{
    "Recommendation to authorize City Manager, or designee, to execute a Facility Use Permit with the Long Beach Unified School District for use of the Central Facilities Center, for a five-year period, November 1, 2020 through October 31, 2025, with the option to extend annually after the end of the initial term, upon a determination by the City Manager, or designee, that the permittee has fully complied with the terms and conditions of the permit and is otherwise in good standing with the City.  (District 6)": [
        "'speaker_4': 'Thank you. Consent carries. Let's take item four, please. This is a one and now we can have vice mayor of can't vote on this item. So I'm sorry, this is the conflicted item. So this is item four and vice mayor, did you want to make a comment on your.'",
        "'speaker_4': 'I'm being conflicted.'",
        "'speaker_2': 'Yes. I must recuse myself on this item because the long unified school district, my employees before the panel. Again, thank you.'",
        "'speaker_0': 'Item for a report from Health and Human Services. Recommendation to execute a facility use permit with the Long Beach Unified School District for use of the Central Facility Center.'",
        "'speaker_4': 'Thank you. I have a most part for Richardson. The second the councilman price. There is no public comment on this item, so please roll call vote.'",
        "'speaker_0': 'District one. I district to. I. District three. I district for.'",
        "'speaker_2': 'All right. Thanks.'",
        "'speaker_0': 'Miami District five. District five. I am District six. District seven.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'I motion carries.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_4': 'I don't have any public open general public comment. Is that right? But I don't see it on the sheet here.'",
        "'speaker_0': 'And that is correct. There is no non agenda public comment for this evening.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution continuing the Belmont Shore Parking and Business Improvement Area assessment levy for the period of October 1, 2020 through September 30, 2021; and, authorize City Manager, or designee, to extend the agreement with the Belmont Shore Business Association for a one-year term.  (District 3)": [
        "'speaker_4': 'Okay. Then we're going to go to move on to a first hearing, which is hearing the Belmont for parking hearing. Please, let's begin that.'",
        "'speaker_0': 'Report from Economic Development Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution continuing the Belmont Shore Parking and Business Improvement Area Assessment Levee District three.'",
        "'speaker_4': 'Can't turn this over to staff.'",
        "'speaker_3': 'Good evening, honorable members of the City Council in Sacramento.'",
        "'speaker_4': 'City of Economic Development Department. The Belmont Shore Parking and Business Improvement.'",
        "'speaker_3': 'Area, also known as a business improvement district, was established by the City Council in 1983, allowing for the levy of an annual.'",
        "'speaker_4': 'Assessment to be paid by businesses.'",
        "'speaker_3': 'Located in the district. The city contracts with the Belmont.'",
        "'speaker_4': 'Shore Business Association.'",
        "'speaker_3': 'To manage the Business Improvement District.'",
        "'speaker_4': 'And the Belmont Shore Business Association's Board of.'",
        "'speaker_2': 'Directors.'",
        "'speaker_3': 'Serves as the advisory board to the City Council on matters.'",
        "'speaker_2': 'Related to the district.'",
        "'speaker_4': 'State law governing this district.'",
        "'speaker_3': 'Requires that an annual report be approved by the City Council. The annual report describes the boundaries.'",
        "'speaker_4': 'Proposed activities and.'",
        "'speaker_3': 'Budgetary information, as well as the method and basis for the continuation of the assessment. The annual report proposes no change to the district boundaries or the method of leaving the assessment.'",
        "'speaker_4': 'The proposed activities will focus on marketing.'",
        "'speaker_3': 'Business assistance and special events. State law requires that a public hearing be held on a proposed program and assessment at.'",
        "'speaker_2': 'Its October six.'",
        "'speaker_4': '2020 meeting. The City Council approved a resolution.'",
        "'speaker_3': 'Granting approval of the annual report, declaring the.'",
        "'speaker_4': 'Attention of the City Council to levy the assessment and set today.'",
        "'speaker_3': 'As a.'",
        "'speaker_4': 'Date of the public hearing. City Council shall hear and consider.'",
        "'speaker_3': 'All protest from.'",
        "'speaker_4': 'Area businesses against the assessment. The program and.'",
        "'speaker_3': 'Boundaries of the area as proposed in the annual report. This concludes my staff report and I'm happy to answer any questions.'",
        "'speaker_4': 'Thank you. Thank you very much. And we do have an early public. I'm trying to look, I don't see any public comment on this item, so I will go to Councilwoman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I have no comments. I just want to thank staff for that report.'",
        "'speaker_4': 'Then let's go ahead and go to a roll call and have a first and a second buy price and then cancel a month.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. I District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. District six. By District seven. District nine. I motion carries.'"
    ],
    "Recommendation to direct City Attorney to prepare an ordinance to address tenant harassment within the City of Long Beach; and, direct City Attorney to bring this back to the City Council for consideration at its next scheduled meeting, or as soon thereafter as reasonably possible.": [
        "'speaker_4': 'Great. Thank you very much. That concludes the hearing. So let's continue on the E on the agenda. We're going to go ahead and do item number nine is next.'",
        "'speaker_0': 'Communication from Vice Mayor Andrew's council member Urunga. Recommendation to direct City Attorney to prepare an ordinance to address tenant harassment within the city of Long Beach.'",
        "'speaker_4': 'Okay. I have a motion by Vice Drews and a second by Councilmember Ranger of Vice Mayor Andrews.'",
        "'speaker_2': 'Thank you, Mayor. You know, first of all, I'd like to thank the Orange Avenue residents for bringing these types of items and issues into the district to my attention. I want to thank, first of all, Councilman, your response in this item with me.'",
        "'speaker_2': 'And residents came to your you know, when you have residents come to your door about 8 p.m. when it grew, even because their security lighting on the second storey apartment complex is removed. You must take action. Imagine your safety fences being removed in retaliation for not signing a lease that increased your rent by $800.'",
        "'speaker_2': 'Worse than that, being threatened to be evicted if you did not sign a document, not in your native language or having no idea what you were signing. These kinds of actions. A one we are facing and a sixth district.'",
        "'speaker_2': 'It is unfortunate that a few bad apples and the landlord sector faces us to create citywide policies, which should be just a human decency. I am a renter. I've always considered tenant landlord relationships to be a moat or a mutual benefit and respect.'",
        "'speaker_2': 'Bringing this item forward with relief recommendations is needed because it is time that as a city we start taking tenants seriously. This situation is what a lot of, you know, anger and unfortunate situations that I have found because of this individual, which made it bad for a whole lot of landlords.'",
        "'speaker_2': 'And I know better because they are much, much better individuals and the city of Long Beach and they do better. But I'm just thinking by going through this, can you imagine a group of individuals who have lived in their place for 24 years, never missed a day of rent?'",
        "'speaker_2': 'And then you get a new owner once they raise the rent, $800 more. That is a state ordinance that you can't do. This is the type of thing that I think we should really take serious issues to, because this individual is blatantly overlooking what is a state mandated audit.'",
        "'speaker_2': 'These individuals were landlords have really overlooked. And this is a serious situation because the fact that I'm just thinking if in a situation during that time, if those little young kids who live in this apartment would have gotten hurt.'",
        "'speaker_2': 'We wouldn't be here talking about this right now. So I'm just hoping that maybe somehow I see the attorney, prosecutors or anyone in our department and really let these individuals know that this is not acceptable in the city of Long Beach or shouldn't be accepted anywhere just to come and make money.'",
        "'speaker_2': 'You know, our landlord and everything set a very precedent going along with most of the things that the state and the local city has asked them to do. But this is unacceptable. This individual had another piece of land in the first district and now with mine just to make money and raise the rent, $800 more than what'",
        "'speaker_2': 'it should be. Individuals have lived there, probably have bought that piece of land. But this should be unacceptable. And I am hoping that I can get my colleagues to support me on this item. I'm looking forward to a robust discussion.'",
        "'speaker_2': 'And thank you very much.'",
        "'speaker_4': 'Thank you. I do have a second by councilmember your ringa company Ringa. We we do have significant comment. Would you mind if I go through all the public comment and then have you begin the discussion?'",
        "'speaker_3': 'Not at all. Okay.'",
        "'speaker_4': 'Madam, quick. If you want to go through all the public comment. Four out of nine, please.'",
        "'speaker_5': 'Our first speaker is Andrew Men, Dujana.'",
        "'speaker_3': 'Hello. My name is Angela. Do I know a community organizer with Long Beach Forward? Over the past year, I've had the honor to organize alongside the most powerful people I've ever known. It started in District nine when a tenant union of 16 families was formed to fight against illegal rent increases, harassment and displacement at the hands of'",
        "'speaker_3': 'their property management company West Stark. Then in District one, another tenant union of 12 families formed to fight against unjust evictions and escalating levels of harassment, which include waking children up from their sleep to translate documents and threaten to pull permits and evict if rent increases up to 90% were not paid.'",
        "'speaker_3': 'Lastly, in District six, the Tenant Union of eight families formed to fight against illegal rent increases and escalating levels of harassment, such as shut off utilities and taking off security doors. In District three, a tenants family was threatened to be killed, and in District four, a building was served involving 60 day notices.'",
        "'speaker_3': 'Adopt this item as emergency ordinance and on or before October 27th. Let's be clear that this is a growing movement of individuals who are fighting for their rights. These injustices are only examples of a much wider problem. The adoption of this policy doesn't mean we stop here.'",
        "'speaker_3': 'We work together and adopt more protections. I look forward to speaking with you all.'",
        "'speaker_5': 'Thank you. Your next speaker is Eduardo. Obvious.'",
        "'speaker_3': 'Well, good evening, honorable mayor and council members. My name is Eduardo Olivas. I'm a senior at Cal State Long Beach, and I live in council district for me and my family have been renters for ten years in our current apartment and gratefully our landlord has been have have been has been a decent landlord.'",
        "'speaker_3': 'We have no experience in the housing boom. So he and other landlords like him won't be impacted by this ordinance. However, I've been in contact with some tenants and some are experiencing harassment from their landlord and they have told me things like they've reported mold and rats in their unit but have not been addressed or fixed by'",
        "'speaker_3': 'the landlord. Other tenants have told me that the landlord have tried to force illegal rent increases ranging from 66% to 90%, then threatening eviction if they can't pay the rent increase. Some of these tenants are immigrant families, which means that they have trouble speaking English, and it makes it a lot more difficult for them to deal with'",
        "'speaker_3': 'this. I simply can't imagine my own family, which is also an immigrant family. I can't speak a lot of English experience the stress of being harassed by a landlord, especially during times like these. This ordinance is to protect tenants from the landlords who abuse their position of power and ruthlessly harass or tenants.'",
        "'speaker_3': 'This is about basic human decency. Everybody deserves a safe home, especially during a pandemic. I urge the City Council to vote yes on itemizing and adopt the anti-harassment urgency ordinance at a special meeting on or before October 27.'",
        "'speaker_3': 'Thank.'",
        "'speaker_5': 'Thank you. Our next speaker is Ailsa Chang.'",
        "'speaker_1': 'Hi. Good evening, mayor and council members. My name is Elsa Tongue, resident of District seven and program manager at Long Beach Forward and member of the Housing Justice Coalition. Tenant harassment is real and it's happening all across the city.'",
        "'speaker_1': 'You will hear firsthand stories tonight. Long Beach needs a local tenant anti-harassment urgency ordinance such as those adopted by Santa monica, West Hollywood, Oakland, San Francisco and Berkeley. That will create real, substantial penalties for specific abuses without requiring tenants to prove landlords motives or move out first and sue later.'",
        "'speaker_1': 'This is a matter of basic human decency. If you are a kind of decent landlord, you have nothing to worry about. This ordinance will not impact you. I will repeat that if you are a kind, decent landlord, you have nothing to worry about.'",
        "'speaker_1': 'This ordinance will not impact you. But if you are a landlord who harasses and intimidates to squeeze your tenants, then your opposition to this ordinance is more a reflection of your shameful character than anything else. It is your responsibility.'",
        "'speaker_1': 'City Council to legislate protections against egregious abuse. Please show your leadership and your humanity tonight. Pass Item nine and adopt a tenant anti-harassment urgency ordinance at a special meeting on or before October 27. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Rob Velasco. Aura Velazco. Prison yourself. Moving on to our next speaker is Fred Sutton. Brett Sutton.'",
        "'speaker_3': 'Can you hear me?'",
        "'speaker_5': 'Yes. Please begin.'",
        "'speaker_3': 'Hello, Honorable Mayor and City Council. My name is Fred Sutton. I'm calling on behalf of the California Apartment Association. We strive to uphold the highest standards in the rental housing industry, promote fairness, equality and the availability of housing throughout California.'",
        "'speaker_3': 'We do not tolerate any forms of harassment. It is our members who house Long Beach and that is the business oriented housing people. California state law regarding this issue is incredibly robust. Residents are protected from harassment and wrongful evictions.'",
        "'speaker_3': 'Meaningful protection this law can impose have already been imposed, but some of the prohibitions that are in this proposed ordinance are vague, which create the ability for an individual to create their own definition of harassment. There are references to annoying a tenant in here and a previous caller said there's someone had illegal utility shut off or threatened'",
        "'speaker_3': 'to kill somebody invalid. 60 day notices, illegal rent increases. All of those items mentioned are already illegal. No outreach was done to discuss these issues with rental housing providers. Like any other policy the city visits, a formal stakeholder process should be established, receive feedback, input and considerations.'",
        "'speaker_3': 'There are nuances that must be considered to avoid unnecessary legal pitfalls and frivolous lawsuits. The motion does not display a single point of down of communications received, which would justify the fast track nature of this proposal. The best way to resolve disputes is through communication.'",
        "'speaker_5': 'We. Thank you. Our next speaker is Ana Velasco. Aura Velazco. Our next speaker is Joshua Christian.'",
        "'speaker_3': 'Hello, Mr. Mayor. Members of the council. My name is Joshua Christian, eviction, defense attorney with the Legal Aid Foundation and our Long Beach Office. This ordinance can put a stop to startling levels of harassment that are going on right now in Long Beach.'",
        "'speaker_3': 'It is an emergency situation. State law in these cases is actually very limited. Harassment is only outlawed in the extreme cases. And even then, a tenant has to impossibly prove a landlord's intent to actually drive them from their homes.'",
        "'speaker_3': 'And damages under state law are not a sufficient deterrent. So tenants need a local law that specifically lays out what constitutes harassment, makes it illegal regardless of landlord's intent, and imposes damages for landlords who abuse their power. And that's why so many other jurisdictions have passed laws very similar to this one.'",
        "'speaker_3': 'The landlords who violate these ordinances, they are serial offenders. They have seen cease and desist letters from people like me dozens of times. They crumple them up, throw them away. They know that in the rare case they pay, the damages will be negligible compared to profits.'",
        "'speaker_3': '95% of landlords have nothing to worry about here. This item will only deter bad actors. So it's been seven months since the policy was proposed. This is at least the third time it's been on the council's agenda. This issue is urgent and needs to be addressed now.'",
        "'speaker_3': 'My clients are scared and they are hurting. Thank you, counsel. Thank you, Staff.'",
        "'speaker_5': 'Thank you. Your next speaker is Karen Reside.'",
        "'speaker_1': 'Hi. This is Karen Reside. I'm a resident of the First District and a member of the Long Beach Gray Panthers, which is also a member of the Housing Justice Coalition. And I have a I have rented in the city of Long Beach for over 20 years now, and I've had a variety of landlords, some good and some'",
        "'speaker_1': 'not so good. I actually rented an apartment one time that didn't have any hot water and that was not revealed to me at all in the lease. And then when the condo I was renting, I complained about it for the landlord to do something.'",
        "'speaker_1': 'They tried to say that they were going to make me pay for it through my rent. Landlords do many abusive things to tenants. We've had all the control in the power for too long. The relationship should be one of mutual respect and with ability to communicate.'",
        "'speaker_1': 'I live in a subsidized building. The property managers that are hired don't often know the rules. We had dog inspections to come through for bedbugs.'",
        "'speaker_3': 'And.'",
        "'speaker_1': 'They get the notices at 5:00 in the evening and the inspection is the next morning. When I pointed out to them that it's not 24 hours, they got angry and threatened me, but I knew they couldn't do anything.'",
        "'speaker_1': 'It's time we put a stop to this harassing behavior. And for the apartment association. I wish that you would help landlords to understand what the law is and that it's very intimidating to go to people that don't speak English and demand that they sign documents and.'",
        "'speaker_5': 'Thank you. Our next speaker is Maria Lopez.'",
        "'speaker_1': 'Good evening, Honorable Council Members and Mayor. My name is Maria. I am a District One resident employee of Housing Beach and a member of the Housing Justice Coalition. I have been in the field of renters rights protections and affordable housing for four and a half years here in the city.'",
        "'speaker_1': 'And I have seen over 600 cases of tenants varying and different amounts of harassment, micromanagement and just complete degradation of persona on behalf of the person they rent from. You know, harassment is not ideal, especially when it comes from your landlord.'",
        "'speaker_1': 'You know, you are put in jeopardy almost your whole life to try to really create a safe, healthy relationship that can flourish, hopefully with the fact that you can keep your home at the very least, and that that's not necessarily happening.'",
        "'speaker_1': 'There are various cases of harassment that we tell tenants to go ahead and, you know, detail in a tenant journal. And even with all that evidence, there is still fear of losing one's home, loses one security and stable needs.'",
        "'speaker_1': 'And so I urge you to support the stability of our families because when renters rise and thrive.'",
        "'speaker_5': 'Thank you. Our next speaker is Melody Osuna.'",
        "'speaker_3': 'You.'",
        "'speaker_1': 'Good evening. My name is Melody Osuna. I'm a home owner in the eighth District. I support this ordinance because the health of Long Beach tenants is at stake and no good landlord should be opposed to it. I work at a medical facility in District one and see a lot of tenants who come into the clinic with landlord'",
        "'speaker_1': 'harassment issues. Their landlords are demanding rent now, even though the law protects the tenants from paying if they cannot and they are threatening eviction even though there is no legal way to do it at the moment. This is causing a lot of anxiety and toxic stress for the tenant patients at the clinic, which could harm their health'",
        "'speaker_1': '. Studies have shown that housing stability can significantly affect health care outcomes. Today's ordinance would be a real deterrence for bad landlords and could keep tenants safe from toxic stress. While there are laws in place that protect tenants, there is no real remedy for the individual.'",
        "'speaker_1': 'To pursue this ordinance would put tenants on an even playing field with landlords. Finally, there is no reason for landlords to be opposed to this ordinance. If they follow the laws and stay away from the abuse that this ordinance protects against.'",
        "'speaker_1': 'No additional conversations need to be had said don't force domestic violence victims to talk it out with their abusers and tenants should not have to talk it out with their bad landlords to remain safe and free of harassment.'",
        "'speaker_1': 'I urge you to adopt this ordinance and bring it back on or before October 27th for adoption. Thank you for considering my comments.'",
        "'speaker_5': 'Thank you. Our next speaker is Cindy Quintana.'",
        "'speaker_1': 'Hi. Good evening, everyone. My name is Sandy in Dallas and I'm from District six. I urge you to please vote yes. To keep vulnerable families from experiencing harassment at the hands of their landlord. Landlords use harassment to pressure, intimidate tenants into leaving their homes, paying illegal rent increases and signing documentation they say they don't understand.'",
        "'speaker_1': 'The city council must declare the item an emergency ordinance to return on or before October 27 to prevent further harassment from escalating. Just last week, landlords shut off utility lights from our apartment in serving legal 60 day notices and threatening to evict tenants if they don't pay legal rent increases, which is up to 90%.'",
        "'speaker_1': 'Please. Please declare this item number nine and urgency ordinance and vote yes. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Tanya Jimenez.'",
        "'speaker_1': 'Good evening. My name is Tom Jimenez, lifelong seventh District resident and DSA language member. First, I would like to thank Andrews and Aranda for being the only two council members out of nine to do right by the city center by bringing this item forward.'",
        "'speaker_1': 'The narrative that merchants and others propagate even members on this council, that most landlords are good and only some are bad. Apples is a false narrative because in an exploitative system where profit and property are valued over human life, one cannot be a good, morally upright landlord in an ongoing pandemic.'",
        "'speaker_1': 'Homes are not just places that we live in. There are places of refuge and safety. All tenants, especially tenants that are experiencing job insecurity, those that do not speak English, those that are older, those with disabilities, etc., cannot wait for the protections they rightly deserve, such as those outlined in the proposed tenant harassment ordinance.'",
        "'speaker_1': 'Council members, I urge you all to vote in favor of adopting an emergency and harassment ordinance and protect Long Beach families do right by these tenants and make it just a bit easier for them to stay in their safe haven.'",
        "'speaker_1': 'Lastly, landlords, I urge you all to look for new jobs because being a, quote, housing provider, unquote, and exploiting others is not a legitimate job. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Tiffany, D.V.. Tiffany Davey.'",
        "'speaker_1': 'Yes. Good evening.'",
        "'speaker_3': 'Honorable Mayor and City Council. I strongly support this item as well as a passing of an ordinance to protect tenants. In my case, I have actually assisted a member who has both underlying conditions and part of a vulnerable population.'",
        "'speaker_3': 'And during some of the most impactful stressors during the COVID 19 pandemic, who was given a 48 hour notice to move out? This senior citizen who resided in the affected district really was threatened just because she was going for a walk.'",
        "'speaker_3': 'She had a shared residence with friends and there are a lot of gray areas. We know that there have been illegal actions taken. We know that individuals have been unhoused. We know that individuals have been threatened during an ongoing crisis, unlike the Northridge Northridge earthquake that lasted 35 seconds and had lasting economic impacts for the past 25'",
        "'speaker_3': 'years. This is ongoing. This is not over. There are many things we are not able to control and there are many protections that need to be in place. The CAA has issued many enticements to their landlords and it's not quite in the equity lens nor the emergency response lens of the complete, unfathomable ramifications of whatever.'",
        "'speaker_5': 'Thank you. Our next speaker is Jordan Wynn.'",
        "'speaker_3': 'Ken. Evening, City Council and Honorable Mayor. My name is Jordan Wynn, District three resident, also a member of everyone in which is a part of the Housing Justice Coalition. In spring, our city council passed an eviction moratorium, which was a common sense policy given the COVID 19 crisis that faced our city.'",
        "'speaker_3': 'And since then, most landlords have followed this policy. It has been recognized by the city and the state. And good acting landlords. At a time when things are so unstable, people deserve to stay in their homes. It's unfortunate now that we have ended up in a situation in which item nine has become necessary.'",
        "'speaker_3': 'But unfortunately, the bad actor landlords will not stop. There are cases of harassment across the city, but the pandemic going on. I can only imagine how heartless those are who decide to harass and harangue their own tenants and threaten them with eviction and homelessness, taking advantage of tenants with false information and deliberately obfuscating the legal rights of'",
        "'speaker_3': 'ten. We need real remedies for.'",
        "'speaker_6': 'Families against landlord.'",
        "'speaker_3': 'Harassment, and it is why I speak in support of item nine tonight. As was stated earlier, everything that is being engaged by the bad actor landlords is illegal already, and we need a backbone to that. We need enforcement against these bad actors who continue to get away with illegal harassment.'",
        "'speaker_3': 'This policy has come up for over seven months at this point and has almost been the council appearance twice before today's appearance. Today, I urge you all the City Council members to support the bill in your city.'",
        "'speaker_5': 'Thank you. Give us a moment when we transition to the Spanish portion of the public comment. Our first speaker is Ora Velasco.'",
        "'speaker_7': 'Premiere Pro Sona is our local.'",
        "'speaker_1': 'Hello.'",
        "'speaker_7': 'All.'",
        "'speaker_3': 'Which of.'",
        "'speaker_1': 'So to me is so simple, saying we are comfortable and love for your whole family.'",
        "'speaker_7': 'You know, my name is not my name. My name is out of Alaska. I'm from District six. And I asked the council please to support the adoption, to adopt these in article to protect tenants.'",
        "'speaker_3': 'Continuing to see.'",
        "'speaker_1': 'Her day care for you. You then return to the familiar. More vulnerable. And so from a causal part of the study.'",
        "'speaker_7': 'And I asked them for them to add support and help families that are vulnerable at this moment continue. What?'",
        "'speaker_1': 'She would that you in a court opera. Of course you are not prissy or not e intimidated I think in the.'",
        "'speaker_7': 'And they use harassment in order to pressure put pressure on their tenants lumped in with.'",
        "'speaker_1': 'The domain name so that it's a settlement of their illegality. And I feel good compassion and most importantly, you know, in seeing them going to another level and I've seen them document them.'",
        "'speaker_7': 'And and they tried to do that in order to push us out of our homes. And they do that in order to make us pay higher rents, illegal higher rents. And they also present documents that we had to sign that we do not understand.'",
        "'speaker_7': 'When we had you sign. Continuing to buy.'",
        "'speaker_1': 'Saltpeter for your outdoor content. Boiling hot little things not familiar with.'",
        "'speaker_3': 'Some of this. And almost.'",
        "'speaker_1': 'Almost 180.'",
        "'speaker_7': 'Days honorable counsel to please support all these tenants. He's not only tenants these are families and he's not only one person. We are many families facing this situation. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Aurelia Ortega.'",
        "'speaker_7': 'Las personas. Aurelio Ortega.'",
        "'speaker_1': 'They go.'",
        "'speaker_7': 'A long Selectwoman Saniora.'",
        "'speaker_1': 'In the future.'",
        "'speaker_7': 'Of the culture.'",
        "'speaker_1': 'Although when I started in mid-November, several of.'",
        "'speaker_3': 'The.'",
        "'speaker_1': 'Yo yo yo quiero is to give up in a sequel. Also, I Don't Think Anymore.'",
        "'speaker_7': 'In L.A., Ortega and I would like for this honorable council to pass these Article nine in order to support a continuing.'",
        "'speaker_1': 'Forget walking the streets or saying so in a reciprocal safe zone, your son. And they're safe. They live on the coastal communities that other people know, etc.. What about the story that one loses to?'",
        "'speaker_7': 'If I am from I mean, I am from different sticks. And then the owners came requesting for more money. They asked. They increased their rent. They also had a harassment against us. They removed all the safety equipment for safety.'",
        "'speaker_7': 'They took the laundry away and they took all the outside lightning from us. Continuing.'",
        "'speaker_1': 'Uh huh. Is that your single training? You should be able to win the singles off winner you stole of the 1 million. I guess you get my husband. I mean it. I said so. Nah, not with my commentary then with the.'",
        "'speaker_1': 'But I'm one of those positive commentary. You some. Me and.'",
        "'speaker_7': 'And we. I had three kids in my home and they took all the the lights outside. So the children for like eight, eight days and the children were asking, can we go out and what is going to happen tomorrow and what about the day after and what about the day after?'",
        "'speaker_7': 'So it is a very stressful light, a life not only for parents but also for the children. Continue it.'",
        "'speaker_1': 'I mean, it's not that I endorse conservatism and get most of your money for them and then. I don't know. No, no, not remotely. To Mark Vaile. They sent me to tell them that I used them up and.'",
        "'speaker_1': 'No, no, not that I wasn't looking. Look, I just trying to scribble.'",
        "'speaker_7': 'And they bring contracts for us to sign. But it is in another language that we cannot understand. So when we don't want to sign that contract, they tell us that they're going to translate it themselves. But then when they translate the documents themselves, they translate whatever is convenient for them.'",
        "'speaker_7': 'They do not translate the whole document as it should continue.'",
        "'speaker_5': 'Thank you. The next speaker is Jose Luis Gonzalez.'",
        "'speaker_3': 'All over the place for some reason. Somebody there just to say.'",
        "'speaker_7': 'Good afternoon my name is wholesale Gonzalez from District six. Continue with.'",
        "'speaker_3': 'But a lot of people more than the delay in controlling the possibility to be more jokey. You kill a person until they'll be defeated in the future.'",
        "'speaker_7': 'I asked the council member and the honorable the honorable council and and the mayor to please to adopt Article nine and two, which is a law to protect tenants against harassment. And also if it could be passed before October 27, continuing.'",
        "'speaker_3': 'Yet the most obvious, one of the most egregious. They include a stellar rental wedding, a single person.'",
        "'speaker_7': 'Because we tenants are under harassment by some property owners and sometimes their rent is increased by a 45%. Continue with.'",
        "'speaker_3': 'And it's total direction from the Malaysian.'",
        "'speaker_7': 'And that is so. And I ask you, please, to support Article nine. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Porfirio de la Rosa.'",
        "'speaker_7': 'Perfidia Rosa.'",
        "'speaker_3': 'Well, I mean, a lot of people are looking into entitled Lazy in the street.'",
        "'speaker_7': 'My name is Porfirio Rosa and I live on 432 A Daisy Avenue A and I am here for a continuing.'",
        "'speaker_3': 'See if you put a subway in the lake. Okay. But then I'm also going to. With the temple.'",
        "'speaker_7': 'And I am here to to ask you to please support the law that would prevent donors from harassing us all the time.'",
        "'speaker_3': 'Continue a simple listening level as he look, you get a little rental only. Okay not for anybody to.'",
        "'speaker_7': 'And yes, because this has come up with paperwork and they tell us that the rent is going to increase, even double from what we're paying right now. Continuing.'",
        "'speaker_3': 'CEO, Barbara Morello, my mentor and the man who is connected to every animal successfully needs it. All of the other levels of power.'",
        "'speaker_7': 'And besides, there are many pests around and there are cockroaches and they don't fix things. All their piping is all blocked and clogged. Continue with.'",
        "'speaker_3': 'The purpose of communism is also for gay couples and we only want security given the long sleeve e, which is stress.'",
        "'speaker_7': 'And also the children. They're very scared because we receive papers are going to we're going to have to move out. And that creates a lot of stress to the children as well. Continuing.'",
        "'speaker_3': 'Therefore. Look, again, I see the point for.'",
        "'speaker_7': 'And that's all I want to tell you is please support us. Please.'",
        "'speaker_3': 'Garcia.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Rosa VILLASENOR.'",
        "'speaker_7': 'The persona rose above us. And you.'",
        "'speaker_1': 'But when I started my. No.'",
        "'speaker_7': 'What evening? My name is Ros. Obvious and your continua.'",
        "'speaker_1': 'Get their help on safely, baby. And let's not have four young people on the web. But I love a little stigma. And so I think, you know.'",
        "'speaker_7': 'And I want you to thank these honorable counsel for the opportunity. And I ask you, please, to support Article nine for the law to protect the tenants from harassment. Continue with.'",
        "'speaker_1': 'If I were passing on the bill. Thank you. Sit there. But I did not. And most of these guys or whatever is like I thought there was like capital of the law bill. So then the spirit will say.'",
        "'speaker_7': 'And please to pass this law before the 27th of October so we are not harassed again. I am a neighbor from 54th Street, 1454 Orange and District number six continue.'",
        "'speaker_1': 'Well, that ultimately Avril gets on top of this. You know what? Do I know this like on the store? He was scared. Okay, but a lot of things this year for your support. Yeah. I gave have a spicy product and he sat up also on North Carolina.'",
        "'speaker_7': 'And that since April the first when I a it I have a new owner a I been under severe stress and I had to go to the doctor again and again. A And I speak not only for me, but for all tenants.'",
        "'speaker_7': 'Please pass these law in order to protect us from harassment. What?'",
        "'speaker_1': 'By, uh, studying El Sindicato in Chile knows they'd love to have a long beach. And I will maintain a continuing. WALLACE But I'm also appointed, so they'll call and say, okay, if I approve it. But every battle in the course of my son.'",
        "'speaker_7': 'SLAUGHTER And we're hoping for the support from the entire council for all from all the council members in order for us to not to suffer any more harassment.'",
        "'speaker_1': 'Um. Not the sense of the end though. When I went back a bit with Mutual, not with him. Bhagat Singh is still the La Pandemia Mucho. They're still sick. And I don't seem it was sort of our thing, but I gave it everything.'",
        "'speaker_1': 'I've gotten myself looking cleaner.'",
        "'speaker_7': 'And the rent is increasing a lot and we cannot pay that kind of increase, particularly during the pandemic. And many of us do not have a job right now. So please, I ask you, please vote and support these law to protect tenants from harassment.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item, which.'",
        "'speaker_7': 'Addresses Edelman in a commentary, but I don't think so.'",
        "'speaker_4': 'Okay. Thank you very much. We will now go back to the council. I have the second year of the Motion Council member hearing.'",
        "'speaker_3': 'Thank you. But even if they get it out to the polls, a lot of money if they're super, super cynical. But it's good to look at what they notice of this. First of all, I want to give people thanks for coming forward to speak on behalf of attendance rates and their situations like Councilmember, like Vice Mayor Andrews'",
        "'speaker_3': '. I, too, have had visits from renters who have let me into their homes or to their apartments. They showed me for the conditions that they live under. Some of them are very horrific. There's not too much, but they're all suffering from some kind of negligence from land owners or apartment owners who have chosen not to fix their'",
        "'speaker_3': 'apartments. So this ordinance we're trying to look at today basically provides guidelines for land owners in terms of what they can and cannot do when you're coming to your tenants. And it also provides an opportunity for tenants to look at what landlords can and cannot do when their rights are being violated and what they can do in'",
        "'speaker_3': 'terms of getting any kind of compensation or corrections when it comes down to their their living conditions or their rent. So I'm bringing this forward with a council, with a Vice Mayor Andrews, to assist our clients, to provide them with guidance so that when and if there is a violation, there are what I call 13 different conditions'",
        "'speaker_3': 'that we are moving forward that the tenants can use when they go to court or when they need to get compensation for any kind of violations that they are facing, including eviction. The importance of bringing this now and bringing this up and bringing it back to the city council as soon as possible, is that.'",
        "'speaker_3': 'We we have an urgency. We have a pandemic that is horrifically affecting our populations, especially those in dire need of assistance. And bringing this back as quick as possible provides them with additional help to address this. So I want to thank the Vice Mayor for bringing this forward, and I hope that we can bring him back as'",
        "'speaker_3': 'quickly as possible, hopefully before the end of the month looking if we can bring it back on on the 27th, sometime that week, maybe the 30th. So I'm if you don't mind my saying, like to amend that motion that we create that by the end of the month.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Thank you. Vice-Chair And thank you, City Council. I hope that we could get the support of our council members to support this and push it forward so that tenants can have a pathway towards getting to really. Thank you very.'",
        "'speaker_4': 'Thank you, Councilmember. Councilwoman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. So I want to thank Vice Mayor Andrews and Councilman Karenga for bringing this back or bringing this item to council. I really appreciate the comments and the testimony that we heard from so many tenants.'",
        "'speaker_1': 'And I wholeheartedly, absolutely agree that nobody should live under the situations and the circumstances that we heard tonight from so many of the speakers. And so I really think that some of the concerns are very valid. And I want to go through some of the items that are listed in the proposed ordinance that Council Vice Mayor Andrews'",
        "'speaker_1': 'has asked the city attorney to bring forth. So I had a chance to and I understand there are state laws in place right now. I also understand that there's. Nuances and different burdens of proof and different factors when we have a local ordinance.'",
        "'speaker_1': 'So I'm not opposed to having a local ordinance, although I do have some concerns about the way this one is worded. So I want to talk to Vice Mayor Andrews about that. A couple of the speakers talked about similar jurisdictions that have adopted local anti tenant harassment ordinances.'",
        "'speaker_1': 'And I know that I have reviewed those in the past when we've talked about this item. The particular item that Vice Mayor Andrews has brought forth, I think, misses some of the verbiage that was included in other city ordinances.'",
        "'speaker_1': 'That to me is kind of pivotal. I think it's really important when you have any sort of law or regulation that it's very clear and there is due process and as much effort to avoid ambiguity as possible. I mean, some of the callers talked about domestic violence cases and things of that nature.'",
        "'speaker_1': 'And I think we can all agree that while there's a lot of room for improvement of the law, the law, at least the criminal law, is written in such a way to avoid ambiguity so that people know exactly under what circumstances they'd be violating it and under what circumstances they would not.'",
        "'speaker_1': 'And so there's got to be kind of a mental state requirement. Any time there's an allegation that someone is violating another person's rights. And so one of the things that I noted is in the ordinance, the proposed language of the ordinance vice mayor that you bring.'",
        "'speaker_1': 'There's nothing requiring any bad faith or ill will on behalf of the landlord. So technically, if you look at many of these items here, many of these provisions, they could technically, technically and legally be violated by someone who has no ill intent at all.'",
        "'speaker_1': 'So someone could inadvertently annoy a tenant. By the way, they're asking a question or the type of question they could also inadvertently confuse someone, whether someone's confused or annoyed. Are very much subjective terms. And so I don't think the what we're astha and that's not present by the way, in any of the local ordinances.'",
        "'speaker_1': 'So whether we're talking about Berkeley, San Francisco, Oakland, you know, they all require some sort of a specific intent or mental state on behalf of the landlord, which we don't have. So, Vice Mayor Andrus, I'm wondering if you're willing to.'",
        "'speaker_1': 'Consider this friendly. I have a couple of friendlies I wanted to ask that would allow me to support this item tonight. But the first sentence that you list here, it would say No landlord shall. And I'd like to offer a friendly that says no landlord shall comma in bad faith comma.'",
        "'speaker_1': 'Commit the following colon and then it would go to number one. Is that something you're open to?'",
        "'speaker_2': 'All right, I accept your opening.'",
        "'speaker_1': 'Okay. Thank you. And then there's a couple other ones that I wanted to ask about. On number 11. English is my second language, and it's the second language for my family. So I'm very. Cognizant of the situation where someone is being asked to sign a legal document in a language that's not their own.'",
        "'speaker_1': 'My mother and I certainly had to do that quite a bit in the apartments that we lived in when I was growing up. But I think that sometimes, you know, we're attributing to number 11, for example, a violation that may be inadvertent.'",
        "'speaker_1': 'So what I would like to add as a friendly is number 11, communicate with the tenant in a language other than the tenant's primary language. And I would like to cross out for the purpose of two with a specific intent of intimidating, confusing, deceiving or annoying the tenant.'",
        "'speaker_1': 'And then I'd like to add language barriers that arise in good faith and without the intent to intimidate, confuse, deceive or annoy do not constitute a violation. Is that something you'd be open to?'",
        "'speaker_2': 'Yeah, definitely.'",
        "'speaker_1': 'Okay. And that way it's just it's really the people that are intentionally, you know, they've been advised and they ignore it. The other one that I had is number. Okay. The last paragraph. What I'd like to include is an opportunity for the landlords to be able to correct the defect.'",
        "'speaker_1': 'So what I wanted to propose is the last paragraph. If a landlord violates the terms of this ordinance, an aggrieved residential tenant, and then I'd like to insert must provide the landlord with a reasonable time to cure the defect.'",
        "'speaker_1': 'If the landlord fails to cure the defect within 7 to 10 business days, the tenant may and then continue the rest of your paragraph, which is institute a civil proceeding. Are you open to that?'",
        "'speaker_2': 'First of all, I heard that. But, you know, you know, I'm not an attorney and this is not a it's this is not perfect. But I would like to do you know, I city attorney to help write the ordinance similar to other cities because the point of this item is to help us stop harassment in general.'",
        "'speaker_2': 'And I, of course, you know, and I think, you know, general treatment, you should you know, you don't need to move like the offenses and increase, you know, rent it is that's not okay. So this is what I would really like to see what's going to happen with this, right?'",
        "'speaker_2': 'Because, you know, like I said, it's not perfect. Least, you know, we need to make sure that, you know, our people are, you know, communicating, you know, in their own native language.'",
        "'speaker_1': 'And I appreciate that, Mr. Vice Mayor. And I certainly don't want to rewrite the ordinance. You know, I'm a council member. I'm not the city attorney here. But those are areas where I would. I mean, I'd love to.'",
        "'speaker_1': 'I'd love to. If you're open to those topics being included in the first draft of the ordinance that comes back, and the city attorney can write them up using whatever verbiage they like.'",
        "'speaker_2': 'I'm going to throw this to the city attorney. Would that be okay? Because I'd like to hear, you know, some of their comments on it, because, first of all, I understood with the last I have a little you know.'",
        "'speaker_2': 'Concerned about that. I would like to write to the city attorney.'",
        "'speaker_3': 'Before you do that there today for a second.'",
        "'speaker_4': 'Well, hold up. Hold on 1/2. So I just wanna make sure we're clear about where we are. So. So I think I'm wrong. I think Vice Mayor, I think. Were you just what just what you just said was that you were open to the first two friendlies, but the last friendly.'",
        "'speaker_4': 'You would prefer that the city attorney handle all in when he writes the ordinance. Is that is that what I got that you got. Mr. City also.'",
        "'speaker_2': 'Yes. Yes.'",
        "'speaker_3': 'Yeah. That's what. That's what I got. This is Rick Anthony. I assume everyone can hear me. Thank you.'",
        "'speaker_4': 'Okay. Okay, great. And then. And then I think the next person that spoke was that Councilmember Gringa. I don't. That you. Councilmember.'",
        "'speaker_3': 'Yes, it was. And that's to as a part of the second year of the motion. And the friendly desk.'",
        "'speaker_4': 'I'm sure it's just really customary. Just 1/2, please. Just from a procedure perspective, I do have a speakers list. Should you try it? Does the second order of the motion also have? Can he speak now or do I need to keep going down the queue?'",
        "'speaker_6': 'If if I understand the council members he may be asking is the as the second hour of the motion, is he also accepting the friendly? And I think the answer to that is yes, he needs to or it needs to be a substitute motion.'",
        "'speaker_4': 'Okay. It's customary, Ringo.'",
        "'speaker_3': 'Yeah, well, I basically agree with Vice Premier Andrews in the sense that I think it would be better if we get a read from the city attorney in regards to the to the substitute motion for the amendment for the amendments that were made to this.'",
        "'speaker_3': 'Because, again, he is not a divisive attorney. I am not an attorney. The the amendments, the friendlies that are being pushed forward are difficult to understand in the sense of what effect it would have on the current motion that's on the table.'",
        "'speaker_3': 'So I would rather we have a read from the city attorney on this before we move forward with any kind of presence. Is that okay with you? That.'",
        "'speaker_2': 'Yes, it is. That's the way. Yes. By all.'",
        "'speaker_3': 'Wyoming. Okay. This is this is Rich Anthony, again, deputy city attorney. I can. I'm taking careful notes, trying to we can have as many friendly amendments as the council. Direct. I I've so far I think I clearly understood the first friendly that Councilmember Price made having to do with in bad faith.'",
        "'speaker_3': 'Commit the following. I understand the second in section 11. If Councilmember Price wouldn't mind reminding me I didn't get it all down what her third friendly was, which I'm calling the third friendly, also a change to section 11.'",
        "'speaker_3': 'It had to do with language barriers. Could you repeat that language a little more slowly?'",
        "'speaker_1': 'Sure, sure. The second friendly was on item 11. It was it to read communicate with the tenant in a language other than the tenants primary language with the specific intent of intimidating, confusing, deceiving or annoying the tenant. Moving on, the second sentence would say Language barriers that arise in good faith and without the intent to intimidate, confuse'",
        "'speaker_1': ', deceive or annoy do not constitute a violation. That was the second one. The third one does not. The third friendly that I proposed does not have to do with item 11.'",
        "'speaker_3': 'Right. But. Okay. Thank you. I have that. And so then let me continue with the third one. The provision of of a reasonable time for a landlord to cure. I understand that without too much more detail, because my read of similar ordinances adopted in Oakland, San Francisco and Berkeley, at least two of them, maybe all three of'",
        "'speaker_3': 'them, I can't quite recall due do include a provision similar however in those. However, I'm not sure that every violation enumerated in the first 12 paragraphs is reasonably susceptible to being cured. Like if you're abusing someone or harassing someone or annoying them or threatening them, there's no real way to cure a threat that's already been made.'",
        "'speaker_3': 'Other other violations I think are could clearly be cured, like a failure to maintain the property or make a fix or a failure to provide a tenant with a valid address at which to stand rent, among others. I have not gone through to check all 12 to see which ones might be cured.'",
        "'speaker_3': 'I guess I should say 13. Which ones might be cured and which ones may not? And I think I can do that. But I do think that it's it's something that I would prefer to have direct and specific direction from the council on.'",
        "'speaker_3': 'And I know that maybe not everyone wants to hear that, but I think a fair number of questions are going to arise tonight. And I would love to have direction from the Council on on several of these issues that that this item raises.'",
        "'speaker_1': 'Well, Mr. Anthony, on that note, can I just ask you, since you've looked at the other ordinances, how is this proposed ordinance different from the other ordinance ordinances in terms of bad faith and the ability to cure a defect?'",
        "'speaker_1': 'And could we align them so that the language is consistent with other cities? That's really all I'm trying to get to here.'",
        "'speaker_3': 'Yeah. The answer to your second question first is, you know, clearly we could align them, I think, with other ordinances that other cities have adopted. The answer to the first question is, I have not done an exhaustive comparison line by line or, you know, substantive provision to substantive provision there.'",
        "'speaker_3': 'I think this item is is it's off to it gets us off to a very good start. It clearly is inspired by other provisions that other cities have adopted and have been in place for several years, if not decades.'",
        "'speaker_3': 'But that said, there are some things in here that I did not see in other ordinances, which is okay. That doesn't necessarily mean this ordinance couldn't adopt them, but it's something that I would want to confirm the legality of.'",
        "'speaker_3': 'And I have I also have several questions of my own and points of clarification that I think I would like council input on. Okay. So I can bring back an ordinance that I know reflects what the council wants to see.'",
        "'speaker_4': 'So, Mr. Anthony I know, I know that comes from your anger and Vice Mayor Andrew's and we're still accepting we're in the process of accepting those friendlies and have a full council list. So did you, Mr. City Attorney, did you get everything you needed at this time on the motion that's on the floor?'",
        "'speaker_3': 'Yes, I think I'm good for now. Thank you, Mayor.'",
        "'speaker_4': 'Okay, so before we, uh, and that and count from your anger that's reflective of, of then the motion and the second. Correct. Could I have one clarification before we move on? Are we good? Okay.'",
        "'speaker_3': 'Actually, no. But I'm going to let my colleague to speak. And I'm not I'm not in total agreement with the friends.'",
        "'speaker_4': 'Okay. Well, you have to actually accept the friendlies for them to move forward. If the city attorney just said, is that right?'",
        "'speaker_3': 'I'm correct. I think I have to I have to disagree because of the emotion on the floor. It's emotional on the floor. I don't really.'",
        "'speaker_4': 'Hold on a second. I just want to make sure that that we're doing this correctly so. Mr. City Attorney, the reason we went back to free range is because he wanted to comment on the friendlies. And so it sounds like counter me, Ringo, you don't accept the friendlies.'",
        "'speaker_4': 'And so that does not allow the friendlies to go into the into them into Vice Miranda's main motion. Is that right? Is that right? I'm a city attorney.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_2': 'Real quickly, to make this easy, let's go ahead and let the councilwoman price make their own substitute.'",
        "'speaker_4': 'Okay. Well, then you're not. So are you saying you don't accept the friendly face that you're saying?'",
        "'speaker_2': 'Yeah. Yeah. Yes.'",
        "'speaker_3': 'Okay. Yeah.'",
        "'speaker_4': 'Okay. Now, let me get a. Okay, so let's just have everyone's queued up. So let me let me go through this whole thing before we move on. I'm sorry.'",
        "'speaker_2': 'Yeah, but not accepting and putting. I wanted to go, and so. Councilwoman. Okay. All right. Okay.'",
        "'speaker_4': 'All right. So you're not accepting the friendlies. Okay, so let me let me get one clarification point before we move on. And I have customers and they have snacks. Was was part of the motion. I thought I think I heard that the councilmember wanted this to come back before the end of the month, I think is what'",
        "'speaker_4': 'I heard. I just want to clarify that, because the next council meeting is not until the 17th of November. I mean, we the council actually we have Election Day and council meeting. So I just want to clarify that.'",
        "'speaker_4': 'And I think there is no council meeting to the 17th of November.'",
        "'speaker_6': 'And Mayor, this is city attorney. I just also want to interject this motion. I don't think we can physically bring it back on the 27th. We need a couple of weeks at least, and I haven't heard all of the councilmembers comments and direction.'",
        "'speaker_6': 'But three days is not enough to write this motion and try and bring it back next week. So we're going to need at least two weeks to do this. So just we're trying to factor that.'",
        "'speaker_4': 'My concern about my concern about next week is there is there is no next week, so there's no meeting next week. The next meeting is November 17th. So I just want to clarify that I think part of the motion said to bring this back to the council.'",
        "'speaker_4': 'So I don't know if that meant like, like, like send the council a memo or on the item back. But there is no meeting till the 17th, just to be very clear. And so they can't come back in two weeks.'",
        "'speaker_4': 'And I think the city attorney has just said that, you know, he would need more time anyway. So. So, Vice Mayor, I just want to make sure and clarify on that. Are we or with whatever the motion is?'",
        "'speaker_4': 'I'm under the assumption then that it would come back at the next meeting. But I want to clarify that it comes from your rank because I think you said end of the month. Yeah. So are we. Are we fine with that, vice mayor?'",
        "'speaker_2': 'Yes. Yes, that was what we decided on.'",
        "'speaker_4': 'Which which was what, but that it would be the next meeting or try to make sure.'",
        "'speaker_2': 'It would be like as quick as you can bring it back. And that's what it is. That's what I would like to see is that hopefully before the end of the month, but it just seemed like he said he can't do it.'",
        "'speaker_2': 'So that's the that would be a problem for all of us. That's sort of set up as because it's an emergency situation. But you said that he can't. So we're going to have to go back. What's.'",
        "'speaker_4': 'Okay. Let me cut some of your anger.'",
        "'speaker_3': 'Well, actually, I asked for it at the end of the month, the 30th. We were we were not able to do it on the last Tuesday of the month at a special meeting, which is when it's ready to go.'",
        "'speaker_4': 'Ah. Okay, I'm. I'm just trying to get clarification. I don't understand. So you want it by the end of the month? On the 30th? You want it to come back at the next possible meeting or are you scheduling as part of your motion of meeting.'",
        "'speaker_3': 'The bill before that, before the next council meeting.'",
        "'speaker_4': 'Which is the 17th?'",
        "'speaker_3': 'Right. I'll bring him back before then. Exactly. But did it help? Would it help? If this were to be, we could work on the main motion, but bringing it back. Would it help if we made that a separate motion?'",
        "'speaker_3': 'Just to make a clarification.'",
        "'speaker_4': 'Okay. Why don't I think I guess what I just want to be clear on before we move forward is I think part of your motion, you said to bring it back on the 30th or the end of the month.'",
        "'speaker_4': 'I'm just letting you know that there's no council meeting to the 17th. And I think the city attorney has said that he can't have it ready on the 30th or the end of the month. So we can continue moving forward.'",
        "'speaker_4': 'But I just want to make I want to make sure those two notes at some point in this discussion, we need to clarify one, if part of your motion you're calling a special meeting or what's happening there before the 17th and two, the city attorney has to be able to actually physically bring it back.'",
        "'speaker_4': 'So I just want to those are two things that we got it clarified as we as we move forward. All right. So let me keep going and count concerns and things. Councilman Sun has.'",
        "'speaker_1': 'Sorry. Thank you, Mayor. I thought I was. I didn't know what I was on mute. Thank you very much, Mayor, for this. This time on this, I know that we have a very complex item in front of us, but also a very, very important one.'",
        "'speaker_1': 'I'm so excited to see a version of this policy come before us today here at council. As my colleagues know, this is a this is a very important and incredible, incredible item of importance for me. I'm grateful for my staff and our community partners, like Legal Aid Foundation and now Vice Mayor Andrew for choosing to back this'",
        "'speaker_1': 'very important policy. And thank you so much to Vice Mayor Andrus for bringing this forward and listening to our residents who are going through a lot at this time. I myself have been a renter and have struggled with with housing and afford when it comes to being able to afford housing.'",
        "'speaker_1': 'And I've been a renter for over 25 years and I see myself continuing to be a renter for many of our neighbors, especially our neighbors of color. We have we see a lot of harassment going on, especially in our in immigrant communities and undocumented families that we have, especially in here in the first District.'",
        "'speaker_1': 'Well, I can imagine that circumstances that make this pause, this policy sadly necessary, are unimaginable to to most of Long Beach residents but me. Each week I hear from my residents on how they are being harassed by their landlords, mostly because they don't either speak the language or they don't know the law.'",
        "'speaker_1': 'And in in most instances, if a landlord says something to attend, a tenant usually takes that as it must be law. And that's why it's so conflicting. And it puts a lot of our tenants, you know, in very insecure positions.'",
        "'speaker_1': 'As I said, I understand how difficult this year has been on so many of us, on so many levels, including our small property owners. But there is no excuse for this kind of treatment to our tenants. And a policy like this would limit the ability of doing or continuing the harassment of our of our tenants.'",
        "'speaker_1': 'Unfortunately, there is only so much we can do as a councilperson to defend our most vulnerable among us. You know, there's times when I. I just break down in tears when I'm hearing the stories of my tenants. And I I'm frustrated because I feel that my hands are tied.'",
        "'speaker_1': 'And I, you know, as a council person, there's only so much we can do. But these stories really tug at my heartstrings. And, you know, and I really bothers me to see families going through a lot of undue stress and unnecessary stress, especially when they have younger children who are already suffering by the changes that COVID has'",
        "'speaker_1': 'brought upon us. You know, so there's stress already on the family and on top of that, being harassed by the by your landlord who who is, you know, something that, you know, can can really bring down a family.'",
        "'speaker_1': 'So I really urge my colleagues to really take a good, good look at this and really support this item. I'm so grateful to all of our community partners that have been advocating for our residents in and out every day, you know, trying to find ways to assure them that, you know, they're not going to be out on'",
        "'speaker_1': 'the street. But it's easy for us to say it's okay, things are going to be okay when it's us that you know, when it's not us. That fear that tomorrow we will be homeless and that that could be a real possibility for that.'",
        "'speaker_1': 'Again, I want to thank Mayor Vice Mayor Andrews for bringing this forward. I also want to thank Councilmember Otunga for for signing onto this item. And I hope that we can together come up with a. Good. A good resolution so that we can protect those most vulnerable, those renters that need our help now more than ever.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. Next up is Councilwoman Pierce.'",
        "'speaker_1': 'Thank you, Mayor. I want to sincerely, sincerely thank Vice Mayor Dantas for bringing this item forward together with Councilmember Yarrawonga. We have been trying to figure out how to tackle this issue, not, you know, not just in COVID, but before COVID.'",
        "'speaker_1': 'And I think we all hear these stories every single council Tuesday, and you guys have heard me share my story and I want to share a little bit more. And then I want to specifically clarify that it seems like council member, Urunga, council member Marizanne de Vos and Vice Mayor de Andrews have all asked for this item'",
        "'speaker_1': 'to come back earlier. I recognize that that means having a special meeting. I think the date was the 30th. We have two meetings that were canceled in November, one of them because of the election. And honestly, I'm not sure why the other ones canceled.'",
        "'speaker_1': 'So I would hope that we could do what's best for tenants right now and put their interest in front of anything else at this moment. So I've shared with folks and you've heard the testimony about my landlord, the fact that I'm a renter.'",
        "'speaker_1': 'My landlord is the sweetest man. He's like in his eighties, this is his only property his son used to be on. The city council is very nice, kind, smiling guy. When COVID happened and I lost my contract, I sent him a letter that said, Here is what my payment plan is going to be.'",
        "'speaker_1': 'Here is me telling you that I've been impacted by COVID. I have texted him. I have emailed him. I have kept him up to date with the income that I get and how much I can pay. Currently, right now, I am one month behind rent.'",
        "'speaker_1': 'He showed up at my door at seven in the morning, knocking on my door and he gave me a list, ten pages of papers, and he says, You need to sign this in three days. And I said, What is this?'",
        "'speaker_1': 'And he said, Well, you need to sign it in three days. It's because you haven't paid your rent. And, you know, I just woke up, I hadn't had coffee. I had to get my kid up, get ready for school.'",
        "'speaker_1': 'I look at them and I can't read them. They're printed on vague paper. But what I can put through is that there's a letter, there's a new lease agreement. There's papers from the city of L.A., nothing from Long Beach and nothing about the state law.'",
        "'speaker_1': 'The last page was the only page that I legally was required to sign. And he's doing this to me. A councilwoman who he knows knows the law in that was a letter. I'm not going to read you the entire letter.'",
        "'speaker_1': 'I've shared it with many people. It says, While no eviction actions will be taken at this time, there is an expectation and a requirement that your outstanding rent be paid in the near future. There are temporary bans on evictions, but those do not waive financial obligations.'",
        "'speaker_1': 'You need to pay as much as your rent as you possibly can to avoid legal actions, period. That is a threat. That is harassment. That is not transparency with the state law. I am a college educated, elected official that have been threatened by my landlord.'",
        "'speaker_1': 'I text him and tell him that I want to understand what he's sending me. So he knocks on my door again while I'm trying to feed my daughter and get her ready for school. Mind you, I have a meeting at 9:00.'",
        "'speaker_1': 'He says if you can't read it, I'll just read it to you. You don't need to read it. No, I need to be able to read the document you sent me. So I know firsthand what harassment means. Did he intend to, quote unquote, to harass me?'",
        "'speaker_1': 'Did he intend to make my heart race, to set my day off, to make it one of the worst days I've had in the last month? Probably not. She probably wouldn't stand in front of a judge and say, I intended to go and bully her.'",
        "'speaker_1': 'She's scared too. But we all have to understand how we treat people and what the law is. When I asked him where he got the documents from, he said the apartment association and that they were required. I informed him they were not required.'",
        "'speaker_1': 'I gave him the only page that was required by law and I informed my other tenants that live in this building of their same rights. This is something that's happening every single day. He asked me to sign a new lease with a new payment agreement on that lease.'",
        "'speaker_1': 'I still don't quite know if legally if I had signed that if I would have to be upheld to that standard. This is why we have to do something sooner rather than later. So I know that there is an urgency ordinance that the city attorney reads it as an urgency ordinance.'",
        "'speaker_1': 'I know that there is a extensive two from for that stuff is done. I know that these things can seem complicated to us who aren't attorneys, but it should be pretty simple in my mind from having drafted other policies and recognizing that when we focus on something and it's urgent, we get it done.'",
        "'speaker_1': 'So I'm asking the city attorney, Rich Anthony, which date is the soonest date that you can bring this back? If there was a special meeting.'",
        "'speaker_3': 'Councilmember Pearce, thank you. I know you know this. I'm not the city attorney.'",
        "'speaker_1': 'You are any attorney within our city. Thank you.'",
        "'speaker_3': 'Yes, I am. I would like to defer that to to Charlie, Mr. Parker. And if he'd like me to speak to that, I'm happy to do so.'",
        "'speaker_6': 'This is Charlie Parker, and I think the earliest we can commit to bringing this back would be November 2nd, the first week. And we certainly I hear the urgency, I hear the desire to to move quickly on this bill.'",
        "'speaker_6': 'But we want to do a good job for you. And we would bring it back as an urgency ordinance so that you could, at the discretion of the council, adopted that night and have it go into effect if you chose to have a special meeting on that week.'",
        "'speaker_1': 'Okay. And can you clarify for me if it's an emergency ordinance, you bring it back on the second. Does that protect people that might experience harassment in between now and the second? Is that what I remember from other emergency ordinances?'",
        "'speaker_6': 'That is not correct. If you'd adopted it on the week and I'm saying the week of the second, we would bring it back to you. It would it would go into effect that evening and be proactive from that date and would not be retroactive.'",
        "'speaker_1': 'Okay. So with that, you know, in the statements that my colleagues have made, I wholeheartedly you know, I recognize that we have an election on the third. I also recognize that we don't want to play politics with people's lives.'",
        "'speaker_1': 'I would hope that we could get a special meeting scheduled as soon as possible. You know, if not the 30th and then the second, I know that's up to you guys and the mayor should decide how to do that, but I really hope we can get something done before the election.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Great. And before we move on to the next speaker, which is controversial or not. Just to clarify, I know I'm not available on I'm the second. So please, when you make the motion, you guys will need to schedule this.'",
        "'speaker_4': 'Please schedule the meeting with the motion. So it's very clear, perfectly, very difficult to get it scheduled right around that time because people's calendars, people are already have the commitments. So please, if we can before this this conversation ends, if the makers of the motion will include the special election or the special meeting date.'",
        "'speaker_4': 'So it's very clear when that will be that that would be very helpful, I think, for for the city attorney and the staff as well. So let's get this continue controversy for not.'",
        "'speaker_3': 'Thank you, Mayor Garcia. Yeah. I'm going to try to go a little different direction here because I think we're fighting the calendar and we're actually rushing an ordinance that would be incredibly important. So what I'd like to ask and I'm going to direct this to the city manager, but I understand that it might take development services and'",
        "'speaker_3': 'possibly the city attorney to answer.'",
        "'speaker_2': 'But how much are.'",
        "'speaker_3': 'Included in this new ordinance would would there be crossover for items we already have on on the.'",
        "'speaker_2': 'Books? And what.'",
        "'speaker_3': 'Are your enforcement.'",
        "'speaker_2': 'Capabilities?'",
        "'speaker_3': 'That is.'",
        "'speaker_2': 'What the city.'",
        "'speaker_3': 'Staff have that we could address these issues immediately. Even if we were to bring this forward on a second, on November 2nd, we have units who have expressed that they need help immediately. Is there anything that could begin tomorrow to address these issues?'",
        "'speaker_6': 'So I'll take the best crack at that that I can. This is not an area where the city has a law. In the past, most cities don't really get into this business to, you know, this type of business in the past.'",
        "'speaker_6': 'So this is clearly something that has been in the last couple of years of interest. And so there are city programs on the books, but there are state laws and state law protections that already exist that people can avail themselves of.'",
        "'speaker_6': 'We were not planning that this would be a city enforced ordinance. It would be a city ordinance which would then be handled in the civil court system. So otherwise we would be needing to add a number of staff and putting staff in the position to put themselves between their landlord and the tenant.'",
        "'speaker_6': 'And so the way that we understand the ordinance to be written is it would be regulated in the courts. And so if there's people who are experiencing harassment that they may already qualify under certain amounts of or certain provisions under state law.'",
        "'speaker_6': 'But this clearly is an attempt to add additional items and provide clarity at the local level.'",
        "'speaker_3': 'Okay. Thank you. Then I'll just have one follow up. So the idea of of having this ordinance enacted at the earliest date, November 2nd, that's provided, we can have a quorum on that date, which I'm not sure of.'",
        "'speaker_2': 'Then how about the implementation? I think the city manager.'",
        "'speaker_3': 'Was saying that that that is something that might be time consuming.'",
        "'speaker_2': 'And I'm making that a question. Well.'",
        "'speaker_6': 'Yes. As as the city manager was saying, the implementation of the ordinance would be, it would provide, as I understand it, enriches on the line, too, and he can jump in here that it would give the tenant or the person who is aggrieved under the ordinance the right to bring the action and for the damages.'",
        "'speaker_6': 'Richard, you want to add to that?'",
        "'speaker_3': 'Sure. Sure. Thanks. I think that's right. I don't think there'd be much in the way of implementation on the part of the city as soon as it became effective. The tenants would have the opportunity to avail themselves of the of the rights of action that they have.'",
        "'speaker_3': 'So because we don't intend and I don't I don't think the makers of the motion intend that this would be city enforced. There's not much to do as far as implementation on the part of the city. I would imagine there would be some sort of notice post notice posted to a city website and that may be it'",
        "'speaker_3': '. Okay. Thanks for that.'",
        "'speaker_2': 'Clarification.'",
        "'speaker_4': 'Thank you, Councilmember. Next up is Councilman Richard.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So I think this is, you know, certainly an important issue. And and, you know, I tend to believe that we should certainly certainly look at this from a standpoint of if we can get this done the week before the election, that's fine.'",
        "'speaker_2': 'But doing a meeting the day before the election, that doesn't sound that doesn't sound like a good proposition to me. If we know that there's going to be number one, there's going to be a it's going to be pressured decision making and more and more discussion.'",
        "'speaker_2': 'And I don't think is the environment to shape policy. I think we should just get it done on the on the 30th. And if we can't get it done on the 30th, and it could be immediately after the election, we you know, we as a city attorney can get it done.'",
        "'speaker_2': 'We call the special meeting. So I don't I don't know if this makes sense to do it on the second day of you know, on the day before the election. Secondly, you know, this is special. It's a stressful time for everybody right now in general.'",
        "'speaker_2': 'It's confusing environment for for renters. We know that it's also for small property owners, this confusing environment. Like what? What is harassment and what is not? I think all of us have a general idea of what harassment is, but we have a very, very specific laws that that call that out.'",
        "'speaker_2': 'If you're a large property owner, you should know those rules. And if you break those rules, there should be penalties. Very small guy will say you have one property, you have one renter, and the rules change. Well, there's no local resource for you to find out what you should or shouldn't say, what language you should or shouldn't'",
        "'speaker_2': 'use. There's there's no real resource for you have to pay $300 to join the apartment association and they will have the updated documents and they'll have the trainings for you. But we don't have anything local for we're talking about small property owners here, which is which is, you know, what a lot of people in the city are'",
        "'speaker_2': '. Those are the ones where you want to make sure you create an environment where there's no harassment intentionally or unintentionally. So this is directly connected to our whole conversation about establishing a rental housing division. If we if we establish a rental housing division, the whole point is to have notices that are available to both sides.'",
        "'speaker_2': 'Resources, trainings locally that we can make sure that's a that's a service that we should provide in our city. And so this is directly connected to that. So here's so, so, so and not just look at the calendar.'",
        "'speaker_2': 'It looks like the 30th is a furlough day anyway. So. Mr.. Mrs. City Attorney, is it at all possible to get it done the week before the election?'",
        "'speaker_6': 'And I, I cannot commit to that. I haven't heard the rest of the Council discussion on this, but there's already been several issues. And I know Rich has a series of questions for additional direction. I would like to be able to promise that, but I would say no.'",
        "'speaker_6': 'I would say the week of the second is the earliest. If you're asking me for a commitment that we could commit to, I agree with you that November 2nd is a bad day. We would like it later in that week, if possible, but we will support it.'",
        "'speaker_2': 'Well, I certainly appreciate your honesty about your ability to get it done. I think if you can't get it done that week, then you plan for the following week and do it after the election. And, you know, we set a goal we agenda item, and then we get it.'",
        "'speaker_2': 'We get it done. The reality is this is a shifting legislative environment. And, you know, and there's going to be a lot that takes place on on that Tuesday. If if if the city attorney is telling us clearly he cannot get it done on the 29th, then we as a council need to say, bring it back on'",
        "'speaker_2': 'the third or bring it back on the fourth in a special meeting to get it done. I understand the urgency. This is an important issue, but I also think we need to have some common sense about how we go about this.'",
        "'speaker_2': 'I there's you know, the window of time I think is closing. It needs to happen. If he if it couldn't happen on the 29th, the citizenry saying it shouldn't then do it on the fourth or the fifth. So that would be that would be my suggestion.'",
        "'speaker_2': 'I'm going to keep listening to this conversation. But again, I think I think, you know, that makes a lot more sense hosting it after, you know, bringing this back in a special afterward and ensuring that we have we have quorum for the meeting.'",
        "'speaker_2': 'So those are those are my general thoughts. Thank you.'",
        "'speaker_4': 'Becky Council member. I mean, look at the queue next to us, Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I don't think I queued up again, but sorry about that. It's okay. Let me just chime in that, you know, I support what my colleagues are saying. This is really important policy. I understand there's a rush to get this done.'",
        "'speaker_1': 'But honestly, if you if people read it, there is no mens rea or state of mind whatsoever attributed to the landlord. So it's very much subjective in terms of what someone might view as annoying or in fact the word confusing.'",
        "'speaker_1': 'I mean, there is a lot of times where my council colleagues are talking and I'm sure it's the same with you guys when I'm talking, or you might be confused. Does that alone mean that there's been a violation?'",
        "'speaker_1': 'I just feel like we need to make sure that we I'm willing to do it any time you guys want to do it if you want to do it tonight. But I made some friendlies to try to move this forward and they were rejected.'",
        "'speaker_1': 'So with that, I'm going to support what Councilman Richardson said. I was hoping that some of my friendlies would be accepted and we could move forward. But it sounds like that's not going to happen. So if that's the case, then I think we do need to talk about it further.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_4': 'Vice Mayor Andrews.'",
        "'speaker_2': 'A lot of it. My problem with this is we need to have our city attorney. Out. Got what bad faith or intent is. You know, also I understand and our landlords, you know, our landlords are bilingual. But we need to understand that you can't get someone to agree a sign on something that they do not understand because'",
        "'speaker_2': '. It. It it is like, you know, we've had a code enforcement system and that allowed us to repair things in seven days. So this is also a problem. You know, my problem with this is because in the tenets that I have on Orange Avenue, that was inspection made two months ago, the owner was just mailed a letter'",
        "'speaker_2': 'by code enforcement today. So clearly something is broken. And if we can't get this ordinance in place sooner or later. It can't hopefully deter bad apples. You know, they they have been living with no interior lives, no security doors.'",
        "'speaker_2': 'No one should have to live like that. So this is where I feel about the whole situation. Thank you.'",
        "'speaker_4': 'Next up is Councilman Mongo.'",
        "'speaker_1': 'Thank you. Thank you for that statement. Both Mayor Andrews, I guess in kind of leaning to. Solve issues today. Along the lines of Councilman Supernova. Is there a. I guess. I don't know. Across all the cities, I'd like to see a chart that shows what different cities have put in place as it compares to the state law'",
        "'speaker_1': ', as it compares to what we're talking about today. I think that that would be helpful. And then are there things that we could do? Like we were talking about the administrative housing division is there. What processes are expensive?'",
        "'speaker_1': 'So we're going to create an ordinance where tenants who, according to Councilman Pearce, don't know that what their landlord is saying isn't true, which means that they wouldn't know that this ordinance is true. But hopefully we can figure out something bigger than that.'",
        "'speaker_1': 'But there has to be a cheaper, more expedited process than going through the courts. Is there are there cities who do administrative hearings or. I don't know. Something on a more. Quick and resolute level that Mr. Anthony or both Marie Andrews could speak to.'",
        "'speaker_3': 'Councilmember Mungo, this is Rich Anthony. I think there are. I'm not an expert on the subject, but just by perusing some of the other anti tenant harassment ordinances from the cities that have already been mentioned, some of those cities, one comes to mind, already has a rent control board in place.'",
        "'speaker_3': 'So that city already has infrastructure in place in order to bring administrative hearings and determine possible landlord harassment. Long Beach doesn't have such a thing at the moment, so I'm not certain. I see what you're saying, but I think trying to address the accessibility and the speed with which a tenant could get some redress, I don't know'",
        "'speaker_3': 'that the city is set up to do that without a much heavier lift and a lot more changes.'",
        "'speaker_1': 'Is there a possibility for on a local level for us to adopt the state ordinance as it's written with a financial commitment of, I don't know, $200,000 to pilot an administrative officer? To be brought on on a contract basis to make it possible that.'",
        "'speaker_1': 'That individual could do administrative duties. And then we because I have big concerns, I don't think I completely understand. In listening to the testimony of the community, there were things that were said that were in conflict that make me concerned about the language that we are proposing.'",
        "'speaker_1': 'When we talk about the different excerpts that come to an end, price is kind of addressed. I want to make sure that we're doing it right because we put policy in the place. We often do it and we don't look back for a long time.'",
        "'speaker_1': 'And so I almost feel like. Even this policy, I don't think, would help Councilman Pierce's situation where the small property owner doesn't know or understand. The components of what he's doing and she talks about how he's nice and all these things.'",
        "'speaker_1': 'And then I guess my bigger question is. How many cases are brought forward to the court system as it is today? I mean, in looking through some data that was submitted and I can't verify the information provided by the community member, they thought there were four cases.'",
        "'speaker_1': 'In the past 220 days. That means once every 30 days out of our. 65,000 units. One person starts this process, so I'm not sure if an ordinance really resolve the issue. It kind of goes to a bigger issue of knowledge, understanding, education.'",
        "'speaker_1': 'I guess I would ask Vice Mayor Andrews if your intent is to give immediate. Support. Would you be of the mind that perhaps some kind of pilot program for immediate support would be a good alternative? I don't have one in mind.'",
        "'speaker_1': 'I'm just trying to listen to what I'm hearing and. Solve issues.'",
        "'speaker_2': 'And I just want to say one thing about four incidents. You know, a lot of times, especially in our areas that know how to go and report various incidents. I know it's more than four, but those are the individuals who just came forward, you know, to let individuals know why they were being treated so.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'I get.'",
        "'speaker_2': 'That. Yeah. So that's but I hear what you're saying. I think that would probably be a good idea. You know, we have that type of, you know, finance to be able to put something like that together.'",
        "'speaker_1': 'Not just the finances, but I guess, I mean, it seems like there's like this massive sense of urgency to get something done. We're doing it now. I don't know what. You're 5 minutes.'",
        "'speaker_4': 'Longer. Okay, so let me just I mean, just at the meeting back. So, Councilman Mongo, I'm going to gather anything else that you have.'",
        "'speaker_1': 'I just. I'm looking for a solution that gives. If we have a law in place of the state that no one's utilizing, I'm not sure a law at the local level is going to solve that problem. So I'm just looking to figure out what's the issue.'",
        "'speaker_1': 'There's a perception that people are being harassed. How do we stop people from being harassed? We either need something more immediate because court processes take a long time. So just looking for some solutions.'",
        "'speaker_4': 'Okay, Mayor, I'm going to go ahead and hold on 1/2. Okay. I just want to I wanted to get back on track. And this is as this is all over the place. So just to be very clear, before we move on to we have another councilmember just queued up.'",
        "'speaker_4': 'So just be very clear. There is a motion on the floor by Vice Mayor Andrews and comes from your anger. And I want to get clarification. I'm I'm not exactly sure what it what it is right now. So I believe the motion is to have the city attorney draft this ordinance and to bring it back at its'",
        "'speaker_4': 'earliest possible. A date, which, according to the city attorney, would be November. That would be November 2nd. That is the motion on the floor. Am I right? Vice Mayor Andrews am I correct so far? I want to assure that for the motion has now you'll change.'",
        "'speaker_4': 'Okay. Okay. Councilman Ranga. Is that correct? Where the motion is as of now.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Okay. So we've agreed that the motion on the floor. I'll be back as soon as it can. November 2nd. That's the motion on the floor. We'll continue. Councilman Pearce.'",
        "'speaker_1': 'Thank you, Mayor, for getting us back on track. I won't speak too much. I just want to clarify that there was a two from four done in July that actually has a chart of all the other city ordinances.'",
        "'speaker_1': 'So a lot of work has already been done on this. I hope that we can call the question and vote on this. It seems like staff has a lot of work to do in the coming weeks, so thank you.'",
        "'speaker_4': 'Okay. Thank you. There is no more. There are no more cues pushing the talk. Actually, Councilman, we just came up right now. Councilman Mongo.'",
        "'speaker_1': 'Councilman Pearce, I've read that the thing is that that chart doesn't compare to what is currently state law. It only addresses Oakland, San Francisco, Los Angeles, West Hollywood, Santa monica and Berkeley. There is a state law anti-harassment policy.'",
        "'speaker_1': 'That's why we need to do something locally. So I called the question please. But within. Thank you. I have the floor. But within that there is protections against harassment at the state level at least. Many people have testified to that today.'",
        "'speaker_1': 'And so that's why I just don't know. Also, this chart doesn't show which ones of these boxes the Long Beach ordinance is trying to address is the Long Beach ordinance trying to address all of them for eight, nine, ten, 11, 12, 13, 14, 15 were all a mix of them when a city attorney question actually work.'",
        "'speaker_4': 'So we have that. There's nobody else cued up. So we're all we're going to go. All right. So I think we may.'",
        "'speaker_6': 'Or members of the council, Rich Anthony, has said we have some questions that we need clarification on before votes taken.'",
        "'speaker_4': 'But I will I will I will have the Mr. Anthony make the questions of the maker of the motion. Go ahead.'",
        "'speaker_3': 'Okay. Thank you, Mayor. First, I want to make a clarification. The state law does not include anti-harassment provisions. It does include anti retaliation provisions. And I think a lot of people seem to think that's a distinction without a difference.'",
        "'speaker_3': 'But but in fact, it's not the what. What you are have in front of you tonight would provide tenants with more protections and more tools than what state law currently does. First, second, it's a I think it's an administrative issue that I just want to bring to everyone's attention.'",
        "'speaker_3': 'I have several questions about the ordinance as written. I think there may be some issues with it that I don't want to wait until the first hearing to bring up, because what I'm afraid is going to happen is I'm going to get direction to change certain provisions on the floor at whenever the next hearing is, which will'",
        "'speaker_3': 'require another first hearing. So I don't know that it's that efficient to move forward right now and to direct me to prepare an ordinance based on what I know right now without having a further discussion. And I'm prepared to do that tonight.'",
        "'speaker_3': 'I don't know that others are, but I am. I'm also prepared to put my concerns and the specific points of direction that I think I need in in a memo to forum from which would be public. And we could get further input from the public and council members and hopefully it would be directed and specific at a'",
        "'speaker_3': 'future meeting. That would necessarily mean that this ordinance won't be adopted until after November 2nd, but I'm not sure that that's not going to happen anyway unless we want to continue this discussion right now, which I am prepared to do.'",
        "'speaker_4': 'Okay. Mr. Anthony, it sounds like you have some questions that you want to ask, or we can just take a motion and then what you come back with. The counsel can then give you additional direction.'",
        "'speaker_3': 'Exactly. Thank you.'",
        "'speaker_4': 'So just I just I think that, you know, Mr. Anthony makes a good point and so he will bring something back. But there might be obviously changes to that. It sounds like the motion is to have the city attorney come up with the policy per, you know, part of the agenda item.'",
        "'speaker_4': 'And then you guys would then go ahead and go through that. Is that correct? Mr. Vice Mayor?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Okay. Councilman Franco.'",
        "'speaker_3': 'I was to about.'",
        "'speaker_4': 'Okay. Okay. We're going to before we go to a I have another cue up Councilman Price.'",
        "'speaker_1': 'Okay. So we are about to take a vote to have the city attorney draft an ordinance on an item that he has lots of remaining questions on. And we're all comfortable with that. Is that just for clarification? Is that what I'm hearing, that the city attorney is being asked to draft an ordinance and he himself is not'",
        "'speaker_1': 'clear on the policy direction. Is that where we're at?'",
        "'speaker_4': 'If you're asking me, I think that's where we're at.'",
        "'speaker_1': 'Okay. Well, I think that's I'm sorry to say, but a pretty sad state for policy. But if that's where we're at, then that's where we're at. Let me just remind everyone that there was an effort to offer some friendlies to be able to move that item forward.'",
        "'speaker_1': 'And I guess now we're just going to ask the city attorney to do his best to try to understand where we're all coming from and come up with some language for us to vote on. That's what we're voting on.'",
        "'speaker_1': 'So awesome. Let's do it.'",
        "'speaker_2': 'You know? And what do you do with that respect? You know, we have a week to act. And so, you know, Mitch, you have a chance to put in memo. Okay.'",
        "'speaker_6': 'But if this is a city attorney, I'm not sure I just understood the vice mayor. But does he want is the direction now you want a memo instead of a draft ordinance? Because what Richard's talking about is we're going to have to make several assumptions without further clarification from the council, and we're going to do our best'",
        "'speaker_6': 'job to do that. But it may not be or meet the requirements and the intent of this body. And if you make some substantive changes, when we bring this back as an urgency ordinance, we'll have to bring it back another time.'",
        "'speaker_6': 'So further delaying the implementation. So I just want to be clear that we're going to do the best we can, but without these questions answered, it's going to be very difficult to mine. Read what everybody wants and have an ordinance that is going to be meet your your needs.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Okay. I have I have four councilmembers cued up again. So let me go ahead and go through that council. Councilman Mongo.'",
        "'speaker_1': 'I just want to iterate that. I want to be supportive of a tenant policy, but I can't be supportive of a policy that I don't know what I'm voting on. If the city attorney is mind reading, then it doesn't surprise me that I'm confused about where we are or what we're voting on because he's not clear on'",
        "'speaker_1': 'what he would be writing. So I understood that the possibility that Mr. Anthony said and maybe I misunderstood because what Mr. Perkins said is a little bit different. Mr. Anthony, you were saying you would potentially bring back a memo, send it out to the council without a meeting.'",
        "'speaker_1': 'We'd have it immediately or whenever you're able to get to it. Then the community and the council could provide input to your office, but then we would probably need to vote on what that input was because no one member of the council can.'",
        "'speaker_1': 'Provide direction to city staff on how to write an ordinance. But then there'd be at least the opportunity for the community to help weigh in on that, and then the item would come back at a future council meeting.'",
        "'speaker_1': 'So perhaps, Vice Mayor, you could provide some guidance on what you're looking for or Mr. Mayor, tell us where we are, what we're voting on.'",
        "'speaker_2': 'Yes. Okay. Yes, very good. Wayne, back a draft ordinance. We'll go from there. If the memo was suggested, we should have had that conversation early. We can discuss the details later on what the ordinance is going to look like based on that draft ordinance.'",
        "'speaker_4': 'Okay. So what I'm just to be clear. So what I'm hearing is that it's clear that the maker of the motion wants the city attorney to bring back the draft ordinance. And then at that point, the council will discuss that.'",
        "'speaker_4': 'That's at least what the what the maker of the motion said. So that's where the motion is at.'",
        "'speaker_3': 'At the second day of the motion today?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Get out. I think the vice mayor may also be a little. Confused as well. But I think based on the. Testimony that we just received right now from the attorney. I think we go ahead and listen to the questions because this is so important that I think that if the city attorney has questions, they want to proceed'",
        "'speaker_3': 'with questioning the the emotion makers and the counsel as to how they should proceed to get clarification. And let's offer that opportunity as we think we need to go ahead and get a clarification tonight so that when and if we do come back with this, it's pretty much what what the intent of the council is.'",
        "'speaker_3': 'So, Mr. Vice Mayor, are you okay with that?'",
        "'speaker_2': 'I am okay with it. But like I said, I think we've put in a lot of time and will we can get this moving and everyone will have a chance to discuss it even so that it. I'm okay with that.'",
        "'speaker_4': 'Okay. So I think okay, so I think I think where we're at now is the the maker of the motion. And the second of the motion are fine with getting the questions answered by the city attorney to develop the ordinance.'",
        "'speaker_4': 'Believe that's where we are right now. And I think that. Mr.. Mr.. Parkin, I think that's what you heard as well, right?'",
        "'speaker_6': 'That's correct. Mr.. Anthony, go ahead.'",
        "'speaker_3': 'Okay. Will do. Thank you. My first question and probably the one that's most important are other ordinances exempt, certain residences, certain units from the application of the anti tenant harassment, their anti tenant harassment ordinance units such as halfway houses, drug rehab facilities, university owned housing, health care facilities, housing that is owned by non-profits.'",
        "'speaker_3': 'The proposed ordinance does not. I have not had time to go through and determine whether the exemptions of those types of units is a policy decision made by each one of those cities, or whether it's actually illegal to regulate those types of units.'",
        "'speaker_3': 'I don't know the answer, but it makes me nervous bringing back an ordinance which hasn't fully contemplated all of those exemptions. And I want everyone to know I'm not trying to delay for the sake of delay. I'm trying to delay to ensure that we've addressed all these issues and that once an ordinance does pass, assuming that it'",
        "'speaker_3': 'does, that it is strong and not subject to challenge, and we haven't overlooked anything. And in four or five days, it's it's tough to get that done. I have another six questions or so that I think are threshold questions.'",
        "'speaker_3': 'I don't know if we should be taking a motion, if they should all be in one amended motion or a friendly or further direction, or if we have five or six different motions, I'm happy to do it either way.'",
        "'speaker_3': 'But the first issue I have is do we intend to exempt any sorts of units and if so, which. And I understand that the Council may not be ready to speak to that right now, but I think it's something that we have to consider and discuss.'",
        "'speaker_3': 'And maybe the answer is no. We're not interested in exempting any units whatsoever and I can continue on through with various other questions. We can take them one at a time. And I leave it to you, Mayor.'",
        "'speaker_1': 'Can we just hear all the questions?'",
        "'speaker_4': 'Hold on. I can hold on a second. So I'm having some council members that are calling the question and asking for a vote. So I just want on the on the motion. So I just want to make sure that, you know, I'm also following Robert's rules the best way we can, you know, electronically here.'",
        "'speaker_4': 'So, Mr. Turner, if I have a councilmember calling the question, do we have to unless there is an objection, do we have to take a vote on that.'",
        "'speaker_6': 'Call for the question? We need a second on the call for the question. It's not debatable. It needs a two thirds vote to pass. And then you would vote on the on the actual item if there's a second, and then you take a roll.'",
        "'speaker_1': 'So it's called the question.'",
        "'speaker_4': 'All right, guys, I'm in the meeting. I have a call for the question and I have a second for the call on the question. So I have a call for the question on from from price. I have a call from the question on Mongo second call for the question.'",
        "'speaker_4': 'So just so I'm.'",
        "'speaker_1': 'D two and called to the question and it was already seconded by the second call for the.'",
        "'speaker_3': 'Question.'",
        "'speaker_4': 'Why? Okay, I don't have that. I have a cooler. I'd have no one calling. The question except for Stacy Mungo called the question and Price called the question.'",
        "'speaker_1': 'Kels woman Pierce called the question verbally. What I was speaking is what I was addressing. But yeah, let's call the question then. I don't know. I'm just trying to follow the rules I got.'",
        "'speaker_4': 'Thank you. All right. We're going to take a vote on calling the question to just vote on the motion on the floor. And. And that's correct. Right. City Attorney. So what.'",
        "'speaker_3': 'About.'",
        "'speaker_4': 'To go directly to a vote. Mr. Parkin, is that right?'",
        "'speaker_6': 'That's correct. You need a two thirds you need six votes to end debate.'",
        "'speaker_4': 'Okay. Six votes and debate real companies.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'Name.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'Nay.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I guess even I was confused. The person who called the question with a name. Yeah. I tried to take it back, but I was cut off. I tried to clarify that when the city attorney.'",
        "'speaker_4': 'There's no debate. We're in the middle district. We're in the middle of a main district.'",
        "'speaker_0': 'Seven. District eight or nine May.'",
        "'speaker_4': 'Great work going on now. Okay. So the vote with the question did not have the the the two thirds majority. So we're going back to where we were. I believe the person that has the floor next is councilman's in Dallas.'",
        "'speaker_1': 'Oh, thank you, Mayor.'",
        "'speaker_4': 'Actually, I'm sorry, Councilman. Before I get to that, before I go to you. So, Mr. City Attorney. Mr. Anthony, did you want to go ahead and continue? I know you were actually you were actually speaking on some questions you had.'",
        "'speaker_4': 'Did you want to continue that part first?'",
        "'speaker_3': 'Sure. I'm happy to.'",
        "'speaker_4': 'And then, Councilman, I'll go to you next.'",
        "'speaker_3': 'Hopefully, I've described the possibility of exempting certain units. I'm sorry that I can't give you more guidance right now about what actually needs to be exempt and what doesn't. Next question is whether this ordinance is meant to apply to commercial tenancies as well as residential tenancies.'",
        "'speaker_3': 'My suspicion is that it is not, but it's not clear on that matter. So I would need to make her the motion to clarify that. Is it commercial or and residential or simply residential? There is a provision in section.'",
        "'speaker_3': 'I think it is Section nine, sorry, it's section ten, which says that the request on the part of a landlord for a tenant's Social Security number can constitute harassment. I think we need to clarify that, that that requesting a Social Security number in advance of a tenancy is acceptable.'",
        "'speaker_3': 'It seems to me that that is the industry standard for determining someone's creditworthiness. You need to have their say. And every other ordinance that I reviewed included such a provision allowing for a landlord to require a Social Security number in advance of executing a lease.'",
        "'speaker_3': 'The next point of clarification that I have is with respect to Section eight. I want to make it clear that my reading of Section eight says that it would constitute harassment if a landlord requested a tenant to sign a new lease.'",
        "'speaker_3': 'That is not in the tenant's native language. I'm not certain that would be enforceable. I have not found any provision of state law which requires a lease to be written under all circumstances in the tenant's native language. And I think to ensure the legality of whatever ordinance we bring forward, I would probably eliminate that.'",
        "'speaker_3': 'But I don't know that it's illegal yet. So if the maker of the motion wants to keep it in, I'll do that. It gives me some pause. The following are see also in section nine. I want to make it clear and every other anti tenant harassment ordinance does this in my research.'",
        "'speaker_3': 'That is, failure to accept rent by a landlord payable by the tenant is okay provided that. The number of days. Usually it's 3 to 3 days have expired under a validly issued notice to pay or quit. Refusing to accept rent after the expiration of that statutory period does not constitute harassment.'",
        "'speaker_3': 'I suspect that might be okay with the maker of the motion and maybe that's what was intended in Section nine, but it's not as clear as I'd like it to be. Also in Section nine. The way I read this is that it would constitute harassment by a landlord if the landlord fails to allow for online payment portals'",
        "'speaker_3': 'or fund transfers at all times. I'm not currently aware of any law which says that a landlord can't simply require cash or a check or a credit card, but that a online payment portal is required under all circumstances.'",
        "'speaker_3': 'But I feel like Section nine would effectively require that in Long Beach. It wouldn't require it, but it would. Failure to provide such a thing would constitute harassment. The way that I read Section nine. I think there's also I think it's very important that there be a clarification on the penalty provisions at the which is the last'",
        "'speaker_3': 'paragraph before the conclusion. First thing it says, there is that under it for a violation, there would be an award of a civil penalty, no less than $2,000 per violation, depending on the severity. But that effectively means that the top amount of the violation is open ended.'",
        "'speaker_3': 'You know, in theory, it could be millions and millions of dollars if that's what a judge imposed. And I don't think anyone intends to give a judge that kind of leeway for a violation of this ordinance. Maybe I'm wrong, but I think maybe that should say up to or should say no less than 2000 and no more'",
        "'speaker_3': 'than 5000 or whatever the case may be. But I'm going to be guessing at that. If we move forward as is. And there are other. Those are things that I need direction on. I think there are other best practices that maybe haven't been considered, just based on my several hours of review of similar ordinances in other cities'",
        "'speaker_3': '. And like I say, I think I'm willing to take direction on all these tonight, if you would rather a memo and we put this off. I could do that, too. But right now I'm moving forward, assuming I'm going to do the best I can tonight with the direction that I'm hopefully will be given right now.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_4': 'Vice Mayor Andrews.'",
        "'speaker_2': 'Okay. Are we ready? Are you ready? Yes.'",
        "'speaker_4': 'We're ready.'",
        "'speaker_2': 'Okay, fine. I'm going to give you Justin's and then I won't cost you anything that's on it. I'm going back to recommendations for our city compared with other cities. I don't think we should exempt any of. Not for commercial tenants this week at the part of Social Security numbers, a lemonade part on number eight about the native'",
        "'speaker_2': 'language. In number nine, about three days. Accepting or refusing payment. You're right. If three days have expired, it should not be considered harassment unless they have a court related agreement in place already. But remind us, I will leave the dollar amount for you.'",
        "'speaker_2': 'The draft based on what other cities have done. Thank you. Okay.'",
        "'speaker_4': 'I think you would ask the customary gringa to weigh in on that as well.'",
        "'speaker_3': 'I'm just waiting for the vice mayor to.'",
        "'speaker_2': 'Answer and provide.'",
        "'speaker_3': 'Okay. That's very. You said it well. I agree with you on that. And just for correction purposes, this is not about commercial properties. These are about tenants. So thank you.'",
        "'speaker_4': 'Okay. Let me I do have folks cued up. So let me go ahead and go through the people that are queued up. Councilman's in Dallas.'",
        "'speaker_1': 'Thank you. May I think what I wanted to say has already been said. I had been queued up for a while and my queue was the purpose of my queue was to listen to what our city attorney, deputy city attorney had to say in regards to this.'",
        "'speaker_1': 'So I'm right now processing all his questions. So thank you.'",
        "'speaker_4': 'Thank you, Councilmember Pearce.'",
        "'speaker_1': 'Thank you, Mayor. I appreciate the opportunity to hear the questions. I think we're so used to hearing staff reports at the beginning and perhaps that's where we kind of everyone got flipped around. So, you know, having no exemptions is, as the vice mayor said, is something that I support, that it doesn't you know, it's not meant for'",
        "'speaker_1': 'commercial tenants, which was already recited trying to keep native language in the ordinance if it's legal. And I know you've got to verify that, but I believe from other ordinances that it is and penalties, I know that we change those penalties from the first time when we tried to bring this to council, trying to make sure that'",
        "'speaker_1': 'those aren't to be capped, that that's up to the the judge. That's not for us to really decide is what I think is the best practice, making sure that that's up to them. So, you know, Rich, I think we all believe that you you need some direction from us.'",
        "'speaker_1': 'So I appreciate the questions and the intent. From what I've heard tonight is drafting an anti-harassment policy that falls in line with some other policies and ensures that we have the best protection for our tenants. And we hope and believe that you can deliver that for us.'",
        "'speaker_1': 'So those are all my comments tonight. I think you think of.'",
        "'speaker_4': 'Vice mayor have you in the queue. I'm not sure if you acute or this. Do you have additional comments?'",
        "'speaker_2': 'No, I'm fine.'",
        "'speaker_4': 'Okay. Councilman Richardson.'",
        "'speaker_2': 'I didn't know I was cute. I'm good.'",
        "'speaker_4': 'You're good. Councilman Price.'",
        "'speaker_1': 'Mr. Mayor, I'm not queued up. And to be honest, I really have no idea what we're voting on, because what Vice Mayor Andrew said and what Councilman Roberto said were not the same thing. But I'm just I I'm a no, I don't even understand what we're voting on.'",
        "'speaker_4': 'Okay. And I just so you know, I do have you guys queued up. So Councilman Richardson, Councilman Price and Councilman Mongo, you're on the Q side, so I'm not sure if it is such a long time ago, but Councilman Mongo.'",
        "'speaker_1': 'I would like some clarity on the variance between Mr. Ringo's comment and Mr.. Vice Mayor Andrew's comment and my understanding that Vice Mayor Andrews asked Mr. Anthony to do his best to mimic the other cities. And then Councilmember Ortega added, Except don't add commercial properties and include all other types of properties.'",
        "'speaker_1': 'That could nullify the ordinance. Mr. Anthony, is that what you heard?'",
        "'speaker_3': 'I can.'",
        "'speaker_1': 'We are going to.'",
        "'speaker_3': 'Attempt to clarify the motion if the mayor is okay with that. I can tell you what I have. Yep.'",
        "'speaker_4': 'Yep.'",
        "'speaker_3': 'Let's do that. Okay. So I think the motion on the floor is to adopt the ordinance as written in item nine in the council letter with the following changes or clarifications and changes. We confirmed that there will be no city enforcement arm will simply be civil matter.'",
        "'speaker_3': 'No properties will be exempt from the application of this ordinance, including university owned housing and the other stuff that I mentioned that they will all be subject to the anti tenant harassment. It will. I heard it as residential only, not commercial.'",
        "'speaker_3': 'It will not apply to commercial. The Social Security number can be removed, or at least it can be clarified that requiring a SSN prior to tenancy is okay, not anti tenant harassment. The preferred language. I think I heard the vice mayor say he doesn't require that.'",
        "'speaker_3': 'But but then I heard other people say, well, it's only not required. It should only be removed if it's if it's illegal. So I'm not quite clear on that. But I'm going to say that the motion on the floor is we're going to remove the requirement that future leases be in the language, the tenants preferred language.'",
        "'speaker_3': 'That's the way I heard the motion. And also, we're going to clarify that the three day notice, once the three days is up, it's clear that failure to accept rent thereafter is not harassment. Then we also have the penalty clarification.'",
        "'speaker_3': 'I think I have clear direction to come up with something reasonable, propose something reasonable based on other cities ordinances. I can do that. The last question. So that's where I stand on how I heard the motion. However, I do have a clarification question for the maker of the motion for the vice mayor.'",
        "'speaker_3': 'I didn't hear anything. Maybe I missed it. Regarding my question about whether online payment is going to be required. It cannot be removed. Mr. Vice Mayor. You want to keep it?'",
        "'speaker_2': 'Oh, yeah. Hello? Are you there?'",
        "'speaker_4': 'We're here. Yes, we're here.'",
        "'speaker_2': 'Remove. Remove the part about the online payment. And can I. Okay. Number eight, eliminate item number eight about the native language. Unless you find it legal to enforce.'",
        "'speaker_3': 'Okay. Then I think I'm clear on the motion on the floor. Everything else. Thank you.'",
        "'speaker_2': 'Everything else is good.'",
        "'speaker_4': 'Thank you. Thank you, Mr. Vice Mayor. Thank you, Mr. Anthony. I think we have a motion on the floor and a second. And so I have no one else cued up. So we will go ahead and vote on the motion.'",
        "'speaker_4': 'So if I can please turn it over to the clerk for a roll call, vote, please.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two, I. District three?'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'District four. Ney District five.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'District six.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'District seven. District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_4': 'Okay. Thank you. Just to clarify that question then, welcome back to the Council. Mr. Anthony, if I heard correctly as part of the motion at a special meeting on November the second that we had as well. Mr. Anthony.'",
        "'speaker_3': 'I think that was part of a motion on the floor. If if Charlie would like to China and otherwise or if we want to take a specific vote on that, I mean.'",
        "'speaker_6': 'I think we need some direction. I heard discussion. We said we we're going to try to bring this back on the week of November 11th. That's a monday. As everyone knows, Election Day is the following day. There was some discussion of of having to come back either on the fourth or fifth or sixth and and depending on'",
        "'speaker_6': 'when we could get a quorum. So some directive to be helpful.'",
        "'speaker_4': 'Okay. I thought part of the combat weekend. Ice Mary Andrews.'",
        "'speaker_2': 'Yes. That was deferred to Alberto. I think he made that. Second. Please get that for me.'",
        "'speaker_4': 'Okay. Got some ringa that wasn't for me. What was your interpretation of the motion?'",
        "'speaker_3': 'Well, my interpretation that I received that I understand was for the second. And I'm okay with that.'",
        "'speaker_2': 'Okay. That's.'",
        "'speaker_4': 'It was my understanding that we never got off the set of off November 2nd and as a as a question. But that's I could be wrong. You know, there was a lot of back and forth there. So. So, Mr. Anthony, do we need to take a vote on this or is that part of the motion?'",
        "'speaker_6': 'This the city of Frankfurt, and we'll take that as part of the motion. We will work with the city clerk to try and have a special meeting on November 2nd, assuming we can get everything done.'"
    ],
    "Recommendation to increase the FY 20 appropriations in the General Fund Group in the City Manager Department by $1,046, offset by the Ninth Council District One-time District Priority Funds transferred from the Citywide Activities Department to provide a contribution to the Draculas for a mural painted at Houghton Park prior to the grand opening of the expanded Houghton Park Community Center on June 30, 2020; and   Decrease the FY 20 appropriations in the General Fund Group in the Citywide Activities Department by $1,046 to offset a transfer to the City Manager Department.": [
        "'speaker_4': 'Okay. That concludes the item. We are now moving on to the next item and that will be item number. Ten.'",
        "'speaker_0': 'Communication from Councilmember Richardson. Recommendation to increase the F 20 appropriations in the General Fund Group in the City Manager Department by $1,046 to provide a contribution to the Dracula's Forum mural painted at Howden Park.'",
        "'speaker_4': 'Can I have a motion in a can by Councilman Richardson and Councilwoman Pierce? Unless there's not any any there's no public comment that I have listed here. So. Constant Richardson can we go and go to a vote? Is there any comment.'",
        "'speaker_2': 'Straight to a vote?'",
        "'speaker_4': 'Okay, roll call vote, please.'",
        "'speaker_1': 'Pick one I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I'm an I and I love the district three. I.'",
        "'speaker_0': 'District four. District four.'",
        "'speaker_2': 'II.'",
        "'speaker_0': 'District five. I. District six.'",
        "'speaker_2': 'So I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Is that an I? Councilman Richland.'",
        "'speaker_2': 'Yes, it was. And I.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to adopt resolution to accept and expend grant funding from the California Department of Housing and Community Development (HCD), in an amount not to exceed $36,000,000; and   Authorize City Manager, or designee, to execute all necessary documents and any subsequent amendments, including amending the terms, or changing the amount of the award, with HCD relating to the grant application and award to the Long Beach Development Services and Health and Human Services Departments, for acquisition and operation of an existing hotel and conversion into interim housing options for persons experiencing homelessness.  (Citywide)": [
        "'speaker_4': 'Thank you. Next up is item 11, please.'",
        "'speaker_0': 'The poor from Development Services and Health and Human Services recommendation to adopt a resolution to accept and expand grant funding from the California Department of Housing and Community Development in an amount not to exceed 36 million citywide.'",
        "'speaker_4': 'Can I get a motion in the second, please? I have a motion by Councilman Ranga. Can I get a second, please? Second my counsel was in. They have I see no public comment. Actually, I have one member public.'",
        "'speaker_4': 'Go ahead.'",
        "'speaker_5': 'Jordan win.'",
        "'speaker_3': 'Hi there. Can you hear me?'",
        "'speaker_5': 'Yes, please.'",
        "'speaker_3': 'Great. Thank you very much. I just wanted to comment. First of all, a thank you to the city for doing such much needed work in funding this public key project. I did want to bring up one thing. I read the report that the city prepared.'",
        "'speaker_3': 'I noticed that the full grant was up to $36 million. The expected amount is around 15 to 16 million, which covers the city of Long Beach as burden for the best Western. But I wanted to emphasize that if there is additional funding that comes back from this grant, if we do end up getting closer to the full'",
        "'speaker_3': '36 million that Lumbee continue to pursue, acquiring motels and hotels that may be suitable candidate for supportive and interim housing for those who are experiencing homelessness, particularly chronic homelessness during this time. I just wanted to bring that to the attention of the city.'",
        "'speaker_3': 'I thank you all for the very dedicated actions that you've been taking recently to make sure that we can get people off of the streets and into safe and affordable housing. Thank you very much.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'Okay. Roll call. Vote, please.'",
        "'speaker_0': 'District one. District two. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five. I. District six.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine. I motion carries.'"
    ],
    "Recommendation to receive and file a report on the DeForest Park Vision Plan; and, accept Statutory Exemption SE-20-082.  (District 9)": [
        "'speaker_4': 'Thank you. Next item is 12.'",
        "'speaker_0': 'Please report from Parks, Recreation and Marine recommendation to receive and file a report on the DeForest Park Vision Plan District nine.'",
        "'speaker_4': 'Take the negative motion in a second, please. Can I get a second? Okay. Second Council is in the house. Can I get the member of the public please comment.'",
        "'speaker_5': 'Our first speaker is Alexander Young.'",
        "'speaker_1': 'What?'",
        "'speaker_3': 'Hello.'",
        "'speaker_5': 'Yes. Please begin.'",
        "'speaker_3': 'Me. Hi. Yeah. Good evening, honorable members. My name's Alex Chung, and I represent City Fabric. We're a local nonprofit design studio located here in Long Beach, and we're dedicated to reshaping communities through collaborative design, planning and policy development and advocacy.'",
        "'speaker_3': 'We have the honor of providing capacity to the Report Park Vision Plan Team through community engagement, design and planning. Working closely with the City of Long Beach Conservation Corps of Long Beach, Campfire, Angela's Council, the Forest Park Neighborhood Association, and the larger the fourth Park community over the past year.'",
        "'speaker_3': 'And just wanted to state that we're in full support of this vision plan. And we want to emphasize how much this vision plan and the process of developing it was a community led and data driven process. We held three rounds of public outreach using both online and in-person tools and shared in multiple languages for people of all'",
        "'speaker_3': 'ages and abilities. As a nonprofit dedicated to serving communities in need, we have we have been working with Knauf on these for several years now, on several projects related to parks and open space. And we find that the area has 2.9 acres of open space per 1000 residents, which is in stark contrast to the citywide average of'",
        "'speaker_3': '5.6 acres of open space per 1000 Long Beach residents across the city. So we hope that the City Council and City of Long Beach will favorably choose to invest in the fourth park, and we hope to continue working with the community to realize their vision.'",
        "'speaker_3': 'Thank you, Councilmembers.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_4': 'Thank you. With that, please go ahead. Actually, Cosmo Richardson, did you do you have any comments or do you want answer? You want to start quickly?'",
        "'speaker_2': 'I got comments in the staff report.'",
        "'speaker_4': 'Why don't we do let's go ahead and do I do want you to comment first sort.'",
        "'speaker_2': 'Of a turn. Absolutely.'",
        "'speaker_4': 'And we're going to suffer for this.'",
        "'speaker_2': 'Great. Well, so this is an important project. I want to say thanks to staffer for their work on this. This was sort of the third master plan, open space master plan in the series of master plans that the ninth District has has led over the last five years or so.'",
        "'speaker_2': 'First was the the uptown open space plan. Second was the Halton Park Master Plan. And now we're moving on to the the fourth part plan. And we find is investing in these plans really puts us in a position to actually bring down draw down additional regional resources and state resources in order to implement some of the changes'",
        "'speaker_2': 'in our in our parks. And additionally, the Speaker mentioned the open space deficit. We have to be really creative about finding opportunities to expand open space. And so we're really proud of all of these plans, but especially this one here with the Forest Park plan, particularly in the way that it's.'",
        "'speaker_2': 'We're partnering this with Conservation Corps and Campfire to implement a better vision for a cleaner and safer and more active Forest Park. So that said, let's hear the staff report.'",
        "'speaker_6': 'Thank you, Mr. and Mr. Richardson. We will be getting a staff report from Brant Dennis, our director of Parks and Rec and Recreation, and Meridith Reynolds.'",
        "'speaker_2': 'Thank you. City manager, honorable mayor and members of Council were real pleased to bring presentation before you this evening for the Forest Park Vision Plan. I'd like to introduce Meredith Reynolds, who's our bureau manager of Parks Planning and Partnerships.'",
        "'speaker_2': 'I'll provide a brief presentation. Thank you, Meredith.'",
        "'speaker_1': 'Thank you. Good evening, Mayor. Members of the city council will walk you through a presentation here this evening that outlines the effort for the Diverse Park Vision Plan. This vision plan is meant to provide the strategic guidance for future investments and improvements to this park to maximize the impact and best serve the community to enhance the overall'",
        "'speaker_1': 'park user experience. This particular vision plan was funded in collaboration with our partners. We have worked with the Conservation Corps, Campfire Angeles Council, City Fabric and the Ninth District to put this together. This is also part of kind of a larger investment from our proposal and grant funds.'",
        "'speaker_1': 'With the partners here. You'll see two other items on the council agenda this evening related to right of entry permits. These are early action projects that came from this plan. And I just wanted to point this out in advance before jumping into the vision plan.'",
        "'speaker_1': 'So there is some additional funds from the Conservation Corps of Long Beach that they were able to secure for an early action project that you'll see in the vision plan for an environmental center and also a proposed right of entry for Campfire Angeles for some trails project that they were able to secure grant funds from the Port'",
        "'speaker_1': 'of Long Beach as another early action project. With these two items, should they be approved this evening, we would be returning to the City Council in a future meeting for long term leases for these partners to operate and continue their investment in the park.'",
        "'speaker_1': 'Back to the vision plan. As a councilmember mentioned, this is a long term effort that began earlier in 2016 with the L.A. County identifying North Long Beach as having a very high need for parks. And that was followed by the Uptown Open Space Vision Plan, which identified a series of parks in need for vision plans and improvements'",
        "'speaker_1': '. And we began this effort in August of 2019, where we were able to perform some site analysis, park assessment. And that was followed by a series of workshops through the spring, both with in-person stakeholder engagement when it was possible, and then online engagement when it was not due to COVID.'",
        "'speaker_1': 'The item went to the Parks and Recreation Commission in June, and we're here before you today. Part of our work on this includes existing conditions and analysis of the existing plans. You can see here some of those demographics that we paid attention to and that we sought out as a part of reviewing existing conditions.'",
        "'speaker_1': 'Overall, through the series of engagements, we held 13 public workshops and stakeholder meetings. We had 156 park assessment and community surveys completed, and all in all of which you will see seven ideas that culminated into the final idea that is in the vision plan.'",
        "'speaker_1': 'The park assessment was where we have folks go out into the park and evaluate what they see using a paper survey tool. So we did two of these at two different days, two different times. We had 22 park assessment participants.'",
        "'speaker_1': 'These were available in multiple languages. And really here, trying to get a sense of the kind of first person experience from our users. Then we held our first series of workshops. We had three of them. They were the same content, just different days and times in multiple languages.'",
        "'speaker_1': 'And we had an activity board, as you see here in the photo. These are some of the ideas that came out of that activity. And so we had little kind of player chips that would indicate whether there was good placement or bad placement of existing amenity, good activity, bad activity where there were opportunities and challenges and participants'",
        "'speaker_1': 'got to put their activity chip on a large scale map to indicate what they saw during their site assessment. You'll see here the different sections of the park. And here is the south end of the park. From there, we ask some additional questions through some public surveys.'",
        "'speaker_1': 'We found that the park is active and very active during the day and the night and throughout the entire week. We heard a lot about the convenience of being able to walk from the neighbors neighborhood into the park.'",
        "'speaker_1': 'There is a lot of attractiveness of the park because of the trails and the new wetlands just south of the park. And there were a lot of information that the community was able to provide about some of the improvements they would like to see.'",
        "'speaker_1': 'From there, we had a second series of workshops, four of them in all for the community, and then three specific stakeholder workshops where the community was able to take a activity board again and sort of more in-depth design their park as they would like to see it in the future.'",
        "'speaker_1': 'So here are the different ideas that came out of the different groups through this community engagement. And you'll see in the legend, in the bottom right corner the different types of activities people had identified. So arts and education programs, events.'",
        "'speaker_1': 'Fitness and health classes. Sports. Park improvements. Youth programs. And other. And then finally in the third workshop series, we whittle it down to two ideas, and folks were able to view that during our virtual public workshop in a follow up survey.'",
        "'speaker_1': 'So here are some of the types of questions where we were able to really clarify what the community wanted to see. So they preferred design. Number two, they had some preferences related to replacing the existing community center and maximizing space.'",
        "'speaker_1': 'And then there were some concerns about unsafe driving behavior. And so what additional kind of safe streets improvements might be useful? There's a handball court that separates the park and provides a visual barrier. There was support for removing that in favor of other activities.'",
        "'speaker_1': 'You'll see some of the different kinds of levels of demand for the different play here. And then finally, I asked we asked about prioritizing small projects, medium projects and large scale projects to get a sense of folks sequencing and priority.'",
        "'speaker_1': 'After all of that, here is a final vision plan concept. Going from north to south. In this case, it is right to left. The northern part of the park was identified for a discovery trail and use camping access to Los Angeles River as well as some fitness stations.'",
        "'speaker_1': 'There is ideas to have a environmental education center and enhance the community center and entry plaza. There is a desire to have some community gardens where the playground exists now and pulling the playground to the front of the park where there's eyes on the children and you can easily access it without changing the grade or a kind'",
        "'speaker_1': 'of right off of the parking lot. There was a desire to extend the Nature Trail and Creek to have a small dog area, a community amphitheater and plaza where the handball court used to be, and then continuing some of the walking and skiing pedestrian and bike improvements and making sure that the fields were playable with the new'",
        "'speaker_1': 'concession stand and restroom toward the southern end near the ballfields. I'll give you a sense of some renderings of what this could potentially look like when all phases are complete, once funding has been identified. Here you will see that Re-Envisioned playground in front of the courts next to on street parking.'",
        "'speaker_1': 'And then finally here you can see the amphitheater and these sports fields with some embankment seating and that the topography allows for at this particular location. I mentioned some of the early action projects and the funding that has been secured.'",
        "'speaker_1': 'So the Conservation Corps has secured additional funding for the Environmental Education Center, and CAMPFIRE has secured that grant from the Port of Long Beach. So we do have a lot of momentum built behind this plan and this effort.'",
        "'speaker_1': 'With that, I will conclude the presentation and I will stop sharing my screen and will be available for questions. Thank you.'",
        "'speaker_2': 'Thank you. Thank you. Mr. Vice Minister, so quickly, I thought there were two slides from the the items that are coming up next. If we could just see those. If we can see those, that will be helpful. So we don't have to do a presentation on the next two items that are related.'",
        "'speaker_1': 'Happy to. Just one moment. There you are, sir.'",
        "'speaker_2': 'Okafor There was a rendering of the stewardship center. There's no rendering the stewardship center.'",
        "'speaker_1': 'And we consolidated it into this this presentation. If you give me one moment, we're going to pull that off for good.'",
        "'speaker_2': 'If you wouldn't mind, just send that over to me and I'll share. Another community, members of the Forest Park are really excited about this. And thank you. I just want to thank you to sit, you know, Meredith and everyone on the team that's worked hard, especially our partners, Conservation Corps and Campfire, who have stepped up to really'",
        "'speaker_2': 'adopt this park and to offer services to the broader North Beach community. It's kind of a big deal. Campfire was in North Long Beach before the 91 Freeway was established and 91 freeways brought in. They moved their facilities.'",
        "'speaker_2': 'They acquired facilities in East Long Beach and left North Long Beach. And with this project, it's pretty cool because it's a part of Hitler Family's history returning. So as a part of the Uptown Renaissance, if you will. So thank you all for for your time and indulging us.'",
        "'speaker_2': 'And congratulations to the Forest Park neighbors. Thank you. And we do have a comment on this already.'",
        "'speaker_0': 'Yes, we did.'",
        "'speaker_2': 'Okay, fine. Would you please come up the vote?'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. By District six. By District seven. By District nine. Buy motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to issue and administer a new Right-of-Entry Permit to Conservation Corps of Long Beach, a nonprofit 501c3, for the construction for an Environmental Stewardship Center, for a period of two years, from September 1, 2020 through August 30, 2022, with the option to renew for one year; and, the approval of an Environmental Stewardship Center for public recreation at DeForest Park, which meets a recreational need within the City.  (District 9)": [
        "'speaker_2': 'I am 13 years. You didn't hear me come into the stadium. No no comments on the rest of these as we are collecting please media. I am please.'",
        "'speaker_0': 'Report from Parks Recreation Marine Recommendation to execute a new right of entry permit to Conservation Corps of Long Beach for the construction of an Environmental Stewardship Center. District nine.'",
        "'speaker_2': 'For any public comment.'",
        "'speaker_0': 'There is no public comment on this item.'",
        "'speaker_2': 'What you're saying, do you have any? No, sir. I just move the item. Would you please call for the vote?'",
        "'speaker_0': 'It was the second year on the item. Vice Mayor.'",
        "'speaker_3': '87 of our building.'",
        "'speaker_0': 'Thank you. District one. I'm District two and district three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. I. District six. By District seven. District nine.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a new Right-of-Entry Permit to Camp Fire Angeles, a nonprofit 501c3, for the construction of Discovery Trails at DeForest Park, for a period of two years from September 1, 2020 through August 30, 2022, with the option to renew for one year; and, the approval of the Discovery Trails for public recreation, which meets a recreational need within the City.  (District 9)": [
        "'speaker_2': 'I am too pleased when I am 14.'",
        "'speaker_0': 'Pleased clear eyed in 14. Report from Parks, Recreation and Marine Recommendation to execute a new right of entry permit to Campfire Angeles for the construction of Discovery Trails at the Forest Park District nine.'",
        "'speaker_2': 'Councilor Richardson was about to comment on this. Just move it. Just move the item. All right.'",
        "'speaker_1': 'Secondly, Sun has.'",
        "'speaker_2': 'Thank you. Any public comment on this item?'",
        "'speaker_0': 'No public comment on item 14.'",
        "'speaker_2': 'Would you please call for the Bell District one?'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District to. I'm District three. District three. District by district for.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. I District six. All right. District seven. I District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 5.90.200 and 5.92.915, all relating to the hours of operation for medical and adult-use marijuana dispensaries, read and adopted as read.  (Citywide)": [
        "'speaker_2': 'Thank you. Item 15.'",
        "'speaker_0': 'Report from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code relating to the hours of operation for medical and adult use. Marijuana dispensaries read and adopted as read citywide.'",
        "'speaker_1': 'Right now. Move.'",
        "'speaker_2': 'Grab a second, please. Secondly, this item. Becoming an.'",
        "'speaker_0': 'There is no public comment on item 15.'",
        "'speaker_2': 'Could you pick up the vote?'",
        "'speaker_0': 'District one I. District two District three I. District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five. I. District six. I District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Mr. Vice Chair, just wanted to let you know that that you some very thing. I don't know if it's just me, but I can barely hear you. Just to let you know.'",
        "'speaker_2': 'Can you hear me now?'"
    ],
    "Recommendation to direct City Manager and City Attorney to provide a report to the City Council on the role of the Council as a legislative body in the implementation and interpretation of the State of Californias health orders in response to COVID-19.": [
        "'speaker_1': 'Yes. Much better. Thank you. Vice Mayor.'",
        "'speaker_2': 'Thank you for telling me that. Okay, fine. Item 16, please.'",
        "'speaker_0': 'Communication from Councilwoman Price. Councilwoman Zendejas, Councilmember Pierce. Councilwoman Mango. Recommendation to direct City Manager and City Attorney to provide a report on the role of the Council as a legislative body in the implementation and interpretation of the State of California's health orders in response to COVID 19.'",
        "'speaker_2': 'Thank you. Councilwoman Pryce, would you like to comment?'",
        "'speaker_1': 'Thank you, Mr. Vice Mayor. Yes, I want to thank the colleagues of mine who signed on to this item. This is an item that I've actually been thinking about for quite a bit of time now. We have been told since day one of this pandemic in mid-March that the city council really has no standing.'",
        "'speaker_1': 'To weigh in on the issues regarding the openings and the closures of our small businesses, the conduct prohibitions of our residents in terms of social distancing and mask wearing at that, and that those issues are within the exclusive sovereign purview of the health department.'",
        "'speaker_1': 'Now we've been told that, and I think as a council we have heeded that guidance and we have all been extremely respectful of that directive. However, all around us, we have seen cities and other legislative bodies take action on issues related to the health orders, whether it be mask wearing requirements, whether it be the opening and closure'",
        "'speaker_1': 'of certain business sectors. Or whether it be the opening and closure of certain recreational opportunities. Now, while I understand the importance and the need for us to make sure that the pandemic is at the forefront of our thoughts and our policy making, and the public safety and and public health of our residents is at the forefront of'",
        "'speaker_1': 'our decision making. I brought this item because I want further clarification on why it is that the Long Beach City Council cannot weigh in on issues which seem to be issues that other city councils and legislative bodies are weighing in on.'",
        "'speaker_1': 'And so I'm asking for a report back from the city attorney with a legal clarification of why it is that the city council cannot be at the table when we're talking about openings, closures, mask requirements and other such things that we are seeing other legislative bodies throughout the region weigh in on.'",
        "'speaker_1': 'And so that's the background of this item. And really it's more of an educational item than anything else. I think all of us on the city council want to defer to our city manager, want to defer to our city attorney and our health department to lead us.'",
        "'speaker_1': 'But we are in a situation where we have businesses that are literally having to shut their doors forever, incurring major debt in order to be able to pay their bills. And we are not in any position to help them.'",
        "'speaker_1': 'We are powerless, according to the city manager and the city attorney, to help them in any way. And if that is truly the case, then I'd like to understand why other legislative bodies are able to take some actions that we cannot.'",
        "'speaker_1': 'So that's kind of where this comes from. And I look forward to our report back and hearing from my colleagues and any public comment there might be on this item.'",
        "'speaker_2': 'Thank you, Councilwoman Rice. First of all, we do counsel phone. So I want you to queue up. It's so good to hear from someone.'",
        "'speaker_1': 'Let's come here. Councilman Mongo.'",
        "'speaker_2': 'Yes. Go ahead.'",
        "'speaker_1': 'Thank you. I appreciate Councilman Pryce joining on this item. And I know that this is something that I brought up repeatedly at our COVID briefings and I brought up twice that council. I don't believe that it is our responsibility to only follow the leadership of the city manager.'",
        "'speaker_1': 'We are to lead. And quite frankly, I don't believe that the citizens of Long Beach feel as though certain individuals who have no accountability to the residents should be making these types of decisions. I also feel as though the scope of what needs to be brought back needs to include the amount of resources that we as a'",
        "'speaker_1': 'council have authorized for enforcement of policies. We may not agree with that have no bearing on the health of our community or our, and actually may have even more detrimental help to the health of our. Three. And therefore, I would love to know more about what discretion we have in terms of what resources, local resources are being'",
        "'speaker_1': 'used to enforce policies that I believe are unfairly applied across the region. Thank you.'",
        "'speaker_2': 'To.'",
        "'speaker_1': 'Thank you, Vice Mayor. Yeah, I think I'm on this item because I agree that we need to have something in writing. I know that we've gotten lots of memos and lots of discussion. I know as a council member, the second district, we have tons of small businesses.'",
        "'speaker_1': 'I know it's been extremely tough on them, but I also know that, you know that our death rate is a death rate and that we are trying to balance the health and well-being of every single resident before anything else.'",
        "'speaker_1': 'And I think that from what I've heard from places like L.A. and people that have visited Long Beach from L.A. during this time is that language has actually done more and done it quicker than some of these other areas.'",
        "'speaker_1': 'So, you know, I've heard from them. I've also read a couple of letters from our Board of Health. I forget the proper name of it, but I know that they've issued a letter to us as council members asking us to strengthen the mask law.'",
        "'speaker_1': 'And so I you know, I just wanted to speak and say that I signed on to this item so that we can get something in writing. I do know that our city charter is different from other cities. I know that this is not an easy task or job that anybody wants.'",
        "'speaker_1': 'None of our city staff wants to tell a business that they can't open. It impacts all of our bottom line. So with that, I look forward to seeing that report. Thank you.'",
        "'speaker_2': 'Thank you. Thank you very much. So anyone else like to speak on this item is.'",
        "'speaker_1': 'Thank you, vice mayor. This is Councilwoman Sunday has I too wanted to say that thank you to Councilmember Price for bringing this item forward. I think it's very, very important that we have a presentation on exactly what it is that, you know, us as as a group can can do and cannot do.'",
        "'speaker_1': 'I think that, you know, there's certain orders that are in place. And I do believe that those orders are in place to protect our residents and the health of our residents and actually the life of each individual that is living here in the city of Long Beach.'",
        "'speaker_1': 'I also know that there are so many businesses that are closing down and not being able to afford to pay their bills or to stay open, or who cannot who cannot open because they cannot rely on only the 25% capacity that that is allowed.'",
        "'speaker_1': 'But I think that, you know, I think that having a presentation and having something in front of us to give us guidelines of what what is happening and who is, you know, who has the authority to implement or dictate certain rules, I think is important.'",
        "'speaker_1': 'So I look forward to hearing report back from the city, the city staff. And thank you again for for this item and for those that signed on. Thank you also.'",
        "'speaker_2': 'Thank you. I want to mention that is there anyone else like I speak on this of. Is he in there? No one else wants to speak on it. Do I have a second for this afternoon? Price.'",
        "'speaker_1': 'I believe we might have some public comment.'",
        "'speaker_2': 'Excuse me. I was going to go check in that. I was going to get a second and go to any further comment.'",
        "'speaker_1': 'On the targets that they have queued up.'",
        "'speaker_2': 'Okay. Do I have a second on this? Yes.'",
        "'speaker_6': 'CD five as a second go.'",
        "'speaker_2': 'Okay, fine. Okay. Good. Is it now? Is there any public comment on this site?'",
        "'speaker_5': 'Yes. Our first speaker is Clarissa Bauer.'",
        "'speaker_1': 'Good evening. My name is Clarissa Bower. I'm a resident living in the third district and I am the owner of Nine around Long Beach, a small 1600 square foot kickboxing studio on Naples Island in the third district. We have been in business for almost three years and have been voted the best gym in Long Beach two years'",
        "'speaker_1': 'in a row. We are an active supporter of the Long Beach community and sponsor Special Olympics, Southern California and other charitable causes in the local community every year. Due to the COVID 19 restrictions placed on gyms, our revenue has decreased by 60% since the same time last year in 2019.'",
        "'speaker_1': 'I've lost half of my team of trainers in order to cut expenses. I'm losing my manager at the end of this month because he's going to work in Orange County where he can get more hours. Our PBP loans, loan funds were extended in June.'",
        "'speaker_1': 'That was four months ago. The idle advance wasn't even enough to cover one month's rent here on Naples Island, and the multiple shutdowns of the gyms this year has helped me tens of thousands of dollars in membership refunds.'",
        "'speaker_1': 'We have tried virtual zoom workout and outdoor workouts, but neither of these options provide the workout experience and equipment our members originally signed a membership agreement for. As a result, we have lost 40% of our membership since March, with daylight hours dwindling and weather turning cooler as fall approaches.'",
        "'speaker_1': 'We continue to receive more and more member cancelations every day. The nine round franchise is the largest kickboxing franchise in the world, with more than 700 locations globally. The franchise has established COVID 19 operational adjustments to our business model to provide a safe and clean workout environment for everyone.'",
        "'speaker_1': 'As the sole owner for the sole sole owner for the nine round Naples Island location, I am prepared to implement these safety guidelines and any protocols put forth by the city of Long Beach in order to reopen my small business.'",
        "'speaker_1': 'It is well known through research that exercise strengthens the immune system and supports mental health. These benefits are essential to help protect the people of Long Beach from the health risks of the COVID 19 virus and to counter the mental stress often experienced due to isolation and confinement conditions with which we are currently faced with no planned'",
        "'speaker_1': 'reopening of Long Beach Fitness Studios. In the near term, the sustainability of our business is in serious doubt and the city of Long Beach risks losing the positive contribution that many small fitness studios are making towards the health and wellness of our community.'",
        "'speaker_1': 'For these reasons, I assert that the benefits fitness studios provide to help protect against the potential harm of COVID 19 far outweigh the risk that gyms will contribute disproportionately to COVID 19 infections compared to other businesses that have been allowed to reopen today.'",
        "'speaker_1': 'As a small business owner, a health and fitness advocate and an active supporter of our Long Beach community, I ask the city council to approve this recommendation. Thank you.'",
        "'speaker_5': 'Thank you. Your next speaker is Dave Shukla.'",
        "'speaker_3': 'So how about the Dodgers? Shukla, third district. I appreciate the councilwoman who brought this forward. It is important to have specificity. I think something that might be able to add in specificity is a lot of the work to be done.'",
        "'speaker_3': 'Examining the impact. Also who's spreading the virus. Which politics are directly responsible. For community spread. I mean, a lot of people have put a lot of time, a lot of effort, a lot of sacrifice in addiction, you know, making sure they inadvertently don't, you know, kill someone they love.'",
        "'speaker_3': 'All that effort. I mean, in other countries, you know, it's kind of amazing that, you know, like Vietnam, uh, completely outperformed us on dealing with the virus. New Zealand, Singapore. I mean, name of police. Name a place. Why is it that this business run autocratic, increasingly authoritarian society just happened to decide right before Mayday?'",
        "'speaker_3': 'Oh, let's just support people back to work before, you know. They have a chance to decide. They don't even really need this economic system in the first place. We don't need a permanent world economy, and we don't need all the climate forcing activities that we know are responsible for the uptick in respiratory virus.'",
        "'speaker_3': 'Through through an transmission, through the land use and through choices that we make or we force other people to think that's the way to be American. I mean, who do you think the ultimate. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is David Rosette.'",
        "'speaker_3': 'Yes. Good evening, Mayor and City Council of Long Beach. My name is David Rosette and I am the owner of Naples Fitness Private Training Studio, located in just District three on Second Street. We currently have two leased storefronts that we are unable to open and operate.'",
        "'speaker_3': 'We have been in business for 14 years and we have always been an appointment based business. We focus on clinical style, personal training, mobility and therapy. We work very closely with orthopedic surgeons, physical therapists, chiropractors to successfully continue rehabilitation programs for patients that are pre and post OP.'",
        "'speaker_3': 'This closure has negatively affected many of our members and clients who rely on us to help them feel better physically, mentally and emotionally. With regard to PPE, we have spent thousands of dollars on our PPE supplies, remodeling, plexiglass partitions, signage, air purification systems, sanitizer for the equipment, as well as touchless dispensers throughout the studio.'",
        "'speaker_3': 'We were open successfully for three weeks in June, and then we were then shut down again by the mandate. I personally visited physical therapy and chiropractic clinics in Long Beach to see how they are operating. They are not even doing half of the things that I just mentioned above which we were doing prior to the second shutdown'",
        "'speaker_3': '. They have more people and less square footage, and some are not even using antibacterial soap in their bathrooms, distancing protocol and or allowing ample time for the disinfectants to set on surfaces to be effective. But they are deemed essential and we are not.'",
        "'speaker_3': 'Therefore, they are safe and we are not. There needs to be a clear plan that sets studios like mine apart from big box gyms that would allow 1500 to 2000 members in each and every day. Our normal operation would allow for 30 to 40 people maximum per day to be in the studio and to be in there'",
        "'speaker_3': 'safely. We are not a large membership based gym. We are a private one and one facility that can easily open up at 25% capacity with 2 to 3 clients and trainer's maximum at a time, allowing for 25 feet of space minimum between clients and allowing trainers to keep a safe distance.'",
        "'speaker_3': 'All people inside of my facility would be distance and mask on machines and touch surfaces disinfected after use from every client, and appointments would be staggered by 15 minutes to ensure ample time to clean and maintain six people or less within the studio.'",
        "'speaker_3': 'With our appointment based scenario, which we've always operated by, we can control the flow of clients as well as the narrative within the studio. There has been so much harm to the industry, to individuals and to businesses alike.'",
        "'speaker_3': 'Due to these shutdowns, we've acquired personally tens of thousands of dollars in debt, in leasehold payments that cannot be paid back at this time. And believe me, our landlords want their money now.'",
        "'speaker_5': 'Thank you. Our next speaker is Lisa Campbell.'",
        "'speaker_1': 'Honorable Mayor and City Council. Thank you for this opportunity and thank you, Councilwoman Price, for bringing this agenda item to light. Collectively, I invite you all to pause, take a nice, deep breath with me. Inhale. And that's how.'",
        "'speaker_1': 'My business has been closed since March 17th and yes, we are still closed. That marked seven months. We are Lisa and Casey Campbell. And for 25 years, 25 years. We have proudly served our community as small business owners, as residents, and now as a landlord.'",
        "'speaker_1': 'We are Executive Fitness, a private fitness studio located in the third district in Naples. We offer one on one private personal training by appointment only. Even prior to COVID, we always have. We always will. I echo David's sentiments.'",
        "'speaker_1': 'We are not a big box gym. During the very brief three weeks we were allowed to reopen, our clients returned with sheer jubilation. It was amazing. And no one got sick. We followed the mandate. We invested thousands of dollars in providing a safe, clean environment for everybody.'",
        "'speaker_1': 'We followed states, L.A. County and Long Beach City mandates. In fact, we had a surprise inspection by the Health Department on a Saturday, and they checked us off as a safe facility, only to have the state shut us down three days later.'",
        "'speaker_1': 'It was devastating again. The loss of business revenue, personal income, payroll and jobs due to the shutdown in our industry are irreparable. One mile away from my brick and mortar studio, fitness facilities are open one mile away. We have lost many clients to Orange County due to this.'",
        "'speaker_1': 'Orange County is reaping the benefits financially. Due to this demand. The rapid decline in mental health and wellness of the clients we serve is devastating. Site's cleanliness. A healthy body is the best defense against COVID. Yes. Yet the state has stopped this essential business.'",
        "'speaker_1': 'And I feel, as do my colleagues in our industry, we are essential. We do not have outdoor space to provide services adjacent to our facility and asking our physically challenged client one, which is who my husband as a physically challenged athlete and business owner and seniors to train in the park is completely unsafe, discriminatory and a huge'",
        "'speaker_1': 'liability risk. City Council member. As I know you can make a difference. We're shot down like amusement parks. And trust me, nobody says I'm a sign of the small world, but I guarantee it's a great ride. Our Health Department has the ability to provide mandates for our industry to reopen.'",
        "'speaker_1': 'If our city can do things differently than the state and even L.A. County, the results would be dramatically different. So please send on over those health orders.'",
        "'speaker_5': 'Thank you. Our next speaker is Michael Neufeld.'",
        "'speaker_3': 'Thank you. This is Mike Neufeld. Good evening, mayor and council members. I'm the owner of the Gaslamp Restaurant over in the third district, and I'm also a founding member of the Long Beach Restaurant Association, comprised of restaurants throughout the city.'",
        "'speaker_3': 'And I just have to say, it just continues to break my heart, hearing all these stories from from all of these fellow business owners here on this particular item. And I think the focus of this item, as I understand it, is really to create an all hands on deck sense of urgency to resolving the issues that really'",
        "'speaker_3': 'pertain to the city of Long Beach and our response to the COVID 19 pandemic. It's critical, I think, that our city council members have access to all of the information that is available out there and also have a strong voice in the policy making and decision making as pertains to, in our particular case, the small businesses and'",
        "'speaker_3': 'the community as a whole. That seems like, you know, obvious to me. All of the council members. And I know whenever the opportunity in the pleasure of meeting most of them, they have their feet on the ground, they have the ear to the ground.'",
        "'speaker_3': 'They speak to the small business owners regularly. They know what we're going through. And to learn how powerless they really are in terms of helping the city make decisions and getting us open, getting the gyms open, getting the restaurants back on track here, getting us inside is very disheartening, and I think it's a great opportunity to fix'",
        "'speaker_3': 'that. And it's an all hands on deck crisis we are facing right now. Everybody's as someone informed earlier, everybody's cheap money has run out. Not all businesses have the opportunity to be partially open and the ones that are partially open like mine are all in the red, have incurred enormous losses.'",
        "'speaker_3': 'There are 48 people in the hospital. As of the latest weekly stat on COVID, the numbers never exceeded, from what I understand, 110 to 120 and Long Beach at a 460,000 people. We have to get open and we have to save our city and we have to save our economy.'",
        "'speaker_3': 'So please empower the city council members to help us do that. Thank you.'",
        "'speaker_5': 'Thank you. Our next speaker is Tiffany Davey.'",
        "'speaker_3': 'Good evening, Honorable.'",
        "'speaker_1': 'Vice Mayor.'",
        "'speaker_3': 'City Council. I'm glad that this item is coming before council.'",
        "'speaker_1': 'It's my belief that we are in.'",
        "'speaker_3': 'A national emergency. I definitely empathize with all of the business owners who have spoken before. But I know pursuant to California Government Code Section 8625, the governor may proclaim a state of emergency in the area affected by a natural and intentional disaster when he's requested to do so.'",
        "'speaker_3': 'I'm also aware that the City of Los Angeles published the resilient Los Angeles in March 2018, a booklet with 96 action for combatting pending disasters of various scale, including pandemics. Also, the role of a City Council officer and public safety emergency coordinator is also a document that governs City Council to operate within a continuity of government continued'",
        "'speaker_3': 'operations, district, field operations, office operations, recovery planning, the notification system. It's also my understanding that Section 85, 58, Section C, Chapter seven, Division one, Title two, Government Code also kind of outlines this. I know that in the case of disaster communication, there is a national incident management system.'",
        "'speaker_3': 'And we, I believe since the eighties have the state emergency management system. There are going to be uncomfortable moments during crisis. And I my heart is with everyone during this time. But I do again, I look forward to this report coming back.'",
        "'speaker_3': 'I also look at 2013 covering government code for the emergency operations board as well, and the MDA established the city ordinance in 2000. That really led to a comprehensive role for a city council office. So I look forward to the next discussion.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_5': 'Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'Thank you. Any comments on this, Mrs. Price?'",
        "'speaker_1': 'I, Mr. Vice Mayor? I mean, the only thing that I would add is hopefully the report can include some sort of guidance for the council, because we're seeing a lot of disparity in the types of businesses that we're allowing to open.'",
        "'speaker_1': 'We started the conversation last week and hopefully the city manager and city attorney got a flavor of what some of our concerns are. If it's the conduct that we're prohibiting because we're concerned about the threat of the pandemic being spread between individuals, and that conduct should be evaluated across all sectors.'",
        "'speaker_1': 'The sectors that are allowed to open should not be determined based on the power of their lobbying or advocacy efforts, but rather the kinds of conduct that's engaged in and the threat of spread of the virus. In that conduct, if the conduct is dangerous, then precautions should be taken to limit the spread in that conduct, but not'",
        "'speaker_1': 'where that conduct can take place, because it's the conduct that we're trying to limit because of a public health crisis. So if the city attorney and city manager can please weigh that into the report that comes back, we very much appreciate it.'",
        "'speaker_1': 'It's getting increasingly more difficult to explain to our businesses why certain conduct is allowed in one setting and not in another. It seems incredibly unfair. And so we want to make sure that as a council we have the words, the verbiage, the justification, the legal parameters that allow us to either weigh in or not weigh in.'",
        "'speaker_1': 'So thank you very much.'",
        "'speaker_6': 'And yes, we'll certainly include that. I do agree. I think this will be very helpful. There's a lot of things that may not make sense to somebody who's just, you know, trying to understand what it is that is allowed and not allowed.'",
        "'speaker_6': 'There's things that the city regulates, but a lot of it is based on state law and what we're allowed to even consider or not under our health orders. So we welcome that opportunity to help provide some clarity on that and try to explain some of the thinking that is coming down from the state health officials.'",
        "'speaker_1': 'May just add, Mr. Vice Mayor, to that point, I'd love the report to include what options we have as a council to advocate with the state, because now we're going to be allowing tattoo parlors. Which is great. I think that's great.'",
        "'speaker_1': 'I want to allow them to open. They've reached out to us, but it's very, very difficult to justify to people how a conduct that might involve piercing of skin, for example, is more dangerous than other conduct that's prohibited.'",
        "'speaker_1': 'So if we can advocate and get some understanding from the state on how those determinations are made and perhaps advocate for different industries, I'd like to know what tools we have as a council. So thank you.'",
        "'speaker_2': 'Thank you very much, Counselor Price. Okay. Is there any kind of. Could we please call for the vote, please?'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. District two. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'I'm urging you.'",
        "'speaker_2': 'Thank you. There's any does anybody have any closing remarks? We can't person has any closing remarks. Okay. Fine, I do. Tonight I would like to welcome. Delicious. 1909. Ice is spicy. Ice spicy and nice into the sixth district.'"
    ]
}