{
    "Recommendation to increase appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by $6,000, offset by the Fifth Council District one-time District Priority Funds transferred from the Citywide Activities Department to provide donations to The Rock Club Music Is The Remedy at $2,500, Millikan Orch-a-band Music Boosters at $500, and Burnham USA Equities, DBA, Long Beach Exchange at $3,000 for their support of the annual Giving Gala 2020 event at the Long Beach Exchange; and  Decrease appropriations in the Special Advertising and Promotion Fund Group in the Citywide Activities Department by $6,000 to offset a transfer to the City Manager Department.": [
        "'speaker_2': 'Thank you, Mr. Memo. Now we're going to move on to do we have any motions on the second to approve this consent calendar? Well, okay, fine. Well, we'll move on to item number two. We're going to move two items, 1 to 2024.'",
        "'speaker_2': 'So we move to item 25. Craig, would you please?'",
        "'speaker_1': 'Regarding Item 25 Communication from Councilwoman Mango. Recommendation to increase appropriations in the Special Advertising and promotion fund group in the City Manager Department by $6,000 for their support of the annual Giving Gala 2020 event at the Long Beach Exchange.'",
        "'speaker_5': 'Thank you. I am so proud to support this great community borne initiative where the language exchange joins forces with 18 local educational and charitable organizations to host a main event fundraiser. This has taken place at different locations throughout the city and we are excited that it will take place at Long Beach Exchange this year if approved by'",
        "'speaker_5': 'the council organizations consisting of local neighborhood associations, educational foundations and booster clubs, parent teacher, student associations, youth music programs, animal welfare groups, disability and grief support services and more have all come together for one big event. Join me in supporting a good cause and enjoy food tastings of restaurants at the Long Beach Exchange.'",
        "'speaker_5': 'Music will be provided by ROC for Vets, an impactful organization which provides much needed music therapy to our veterans. Opening for them will be Millikan Gold Jazz Combo, a student jazz group from our very own Millikan High School.'",
        "'speaker_5': 'And the event is open to the public and allows for greater connectivity and support of the organizations that are most invested in our greater Long Beach community. If there's any additional questions, I am open to answering those questions.'",
        "'speaker_5': 'Otherwise, I urge my colleagues to support this item.'",
        "'speaker_2': 'Thank you, Councilwoman Price.'",
        "'speaker_5': 'I support this. Thank you. Hi.'",
        "'speaker_2': 'Let's called for the vote. No, let me come in on the second.'",
        "'speaker_1': 'There is no public comment on this item.'",
        "'speaker_2': 'I didn't. Anyone, please call for the vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt Plans and Specifications Nos. R-7147 and R-7148 for the Junipero and Granada Beach Concession Renovations and Site Improvements Project; award a contract to General Consolidated Constructors, Inc., of Perris, CA, in the amount of $2,879,460, with a 15 percent contingency in the amount of $431,919, for a total contract amount not to exceed $3,311,379; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments.  \n(District 3)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'All right. Now we move to item 27.'",
        "'speaker_1': 'Report from Public Works, Park Recreation and Marine Recommendation to award a contract to General Consolidated Constructors for the One Apparel and Granada Beach concession renovation and site improvement project for a total contract amount not to exceed three 3,311,379 District three.'",
        "'speaker_0': 'Thank you. We're going to have a staff report on this.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Members of the council. We're excited to be here tonight to talk about some of the continuing improvements along our beachfront. These are funded, of course, out of tidelands dollars and not general fund dollars. But we have about a million people a year that walk up and down our beachfront.'",
        "'speaker_7': 'It's amazing how much activity there is. And there's been a focused effort kind of assisted by Councilmember Price and Councilmember Pierce to really focus on some of the community amenities. And so I hope you've been noticing that over the last couple of years, and this really is kind of the next big step.'",
        "'speaker_7': 'So with that, I will turn it over to Eric Lopez and Joshua Hickman to go through a presentation.'",
        "'speaker_4': 'Right. Good evening, Mayor and city council. Happy to be here tonight. So before you tonight is really a holistic effort to activate the waterfront. And we have a multi-phased approach over a number of different locations. You can see the four outlined here on the screen, and each location includes both concession improvements or improvements to the building as'",
        "'speaker_4': 'well as play features. So over on the bay shore side of the beach, we've already made some improvements to the concession building itself, shown in the image on the left as well as play features out in the water.'",
        "'speaker_4': 'Alamitos Beach concession project on the east side of the beach or west side of the beach is under construction now. This is a site plan drawing of the Alamitos Beach concession and the improvements that are happening here. So you can see a play area, a retail restroom, as well as the cafe itself.'",
        "'speaker_4': 'This is an image showing the playground that is being installed at the Almeida's location. You can see there's a number of different play features that that are being included in that construction that's underway now. At the Gina Paris location.'",
        "'speaker_4': 'There's a number of different improvements that are again happening in a phased type of approach. Previously, the beach pedestrian path as well as the bike path were constructed as well as the the parking lot that you can see here.'",
        "'speaker_4': 'And most recently, the basketball courts and the fitness station as well as the multi-sport court have already been have already been constructed south of the beach path. You can see the concession building and the new playground, which are part of the contract that that we're hoping to award tonight.'",
        "'speaker_4': 'This is an image of the completed fitness station as well as the basketball and pickleball courts. And this is an image of the the new building facade, including the wayfinding signage, the better access to the facility and new shade structure for the for the for the concession area.'",
        "'speaker_4': 'Another image of the same facility shown looking north from the beach. This is a play area that's being installed adjacent to the Junipero location. So you can see a fairly large play structure with a slide as well as different climbing areas.'",
        "'speaker_4': 'Another image of the same play area. At the Granada location. There's also a number of improvements that are taking place. We have the concession building that's receiving similar treatment to the June opera. We have the water play feature highlighted in blue on the screen, as well as a fitness station and a dog rental station.'",
        "'speaker_4': 'So you can see there's a similar theme among all of the concession areas. So we have wayfinding signage as well as improved access, as well as some shading and some facade treatment. You can see a rendering of the Granada play area or the water play feature.'",
        "'speaker_4': 'It includes a meandering path as well as water that flows and allows the folks that are playing with it to interact with the water. These are some examples of how children would interact with the water. You would pump the water up into various slides and have it come and flow down through the the meandering path.'",
        "'speaker_4': 'And then we also have a collaborative effort with other city colleagues that we're working to really get some new beach concessionaire into each of these locations. So that is currently underway. We're working with Lee and Associates to to select those those vendors which will be coming back to you at a future at a future meeting.'",
        "'speaker_4': 'So the next steps would like to award the construction contract will then get started on the play. Features at both the Junipero and Granada location will then be coming back to City Council for Future Concessionaire agreements and then they would complete their their tenant improvement projects.'",
        "'speaker_4': 'And that concludes the presentation. We're available for any questions or comments.'",
        "'speaker_0': 'Thank you. There's a motion and a second counsel on price.'",
        "'speaker_5': 'Thank you. I want to thank staff for this. Josh Heckman and Eric Lopez have really led this effort. So thank you, gentlemen, for your great work on this. And I want to thank my colleague, Councilmember Pearce. There are three concession stands in total that have been the subject of a lot of attention from us over the last'",
        "'speaker_5': 'couple of years. And of course, Alamitos is a little bit ahead, and I'm really looking forward to what the changes there are going to be. I want to Paro is a shared space really between the second and third district.'",
        "'speaker_5': 'It kind of borders our two districts. And then Granada is in the third. And for those who don't know, it's really close to Rosie's Dog Beach, which is going to be great to have the dog walkers station and have that water element there.'",
        "'speaker_5': 'Really looking forward to seeing these changes. I wasn't surprised, but I think I was I was happy to get reaffirmation on the number of people that are visiting the beach since we put the beach path in, the fact that we can count how many people are out there now is amazing.'",
        "'speaker_5': 'For those of us who go out there on a regular basis, it's really a great sight to see. No matter what time of day or night. You go out there, you see people of all different walks of life enjoying the beach and the open space and it's really great to see.'",
        "'speaker_5': 'So this will be a nice amenity to add there. And I think a lot of people don't know that the basketball courts are already there at one to Paro. And so hopefully people will go out there and use those more so that we can give a little bit of relief to other impacted courts like the one at'",
        "'speaker_5': 'Bay Shore. But I want to thank you guys for your great work and for bringing this project forward. All three of these beach concession stands together are going to provide a really great new amenity for beachgoers. So thank you.'",
        "'speaker_0': 'Thank you. Got some repairs?'",
        "'speaker_8': 'Yes, I too. Thank you guys so much for the work that you guys have done on this. It's really been three years in the making. When I first got in office, we started doing the visioning work and I actually want to make sure that the record shows because the item says District three, but two of them are'",
        "'speaker_8': 'in District two. So just make sure that the you know, we have some pride over there. But with that said, we know that all of these concession stands are really used by a lot of people throughout the city, not just in our districts.'",
        "'speaker_8': 'Anytime I'm out there, I'll see constituents that don't live in my district that have taken the bus or taken their bike down there to really enjoy the beach path. So congratulations on that. I know I've talked to a couple of local restauranteurs and I know it's kind of a challenge now that we put the local spin on'",
        "'speaker_8': 'it and trying to get one of our local businesses in these concession stands. Can you share with me the timeline one on the completion of Alamitos and then two, the timeline for the RFP process? Because I know it's it's kind of been tough.'",
        "'speaker_4': 'Sure. So the Alamitos Construction Project is again a multiphase type approach where we have a core and shell project that's underway now and we're anticipating being complete with that fall of 2020. And subsequent to that, we'll have a tenant improvement project.'",
        "'speaker_4': 'So we're hoping to select in the upcoming months a future concessionaire for that for that facility. And then they will go through with their own tenant improvement project after we're complete.'",
        "'speaker_8': 'And are we looking at one tenant for Alamitos or two?'",
        "'speaker_4': 'So it's still an open discussion as to who the tenant will be there. We envision that there will be a tenant there for both retail as well as a cafe.'",
        "'speaker_8': 'Okay. I just ask because I had talked to a local brewery last week and they had said that they had been approached about just operating the top. And so I was just curious to that process. But I trust you guys.'",
        "'speaker_8': 'I think all the projects have been great. Thank goodness. On the Pickleball court, when I first said Pickleball, I never thought we would get a pickleball court there. My constituents are very happy. So thank you.'",
        "'speaker_0': 'Thank you. I just want to just add, because I've been a I've been a huge supporter of these projects for for many years. I'm very excited at the work that's being done, the quality, just what it's going to do for activation on the beach.'",
        "'speaker_0': 'They're also part of our kind of master Olympic plan to ensure that when the Olympics are here, folks are at a fully activated beach. And I think I want to particularly what I also think. Mr. Modica, I think, Tom, you have been our leading advocate for these projects in the city, and we've been working on these for'",
        "'speaker_0': 'a long time. And I just want to thank you and the team. I think obviously the whole Tidelands team and and the teams that's been working on it has been really great. But I just want to thank you guys.'",
        "'speaker_0': 'And also just to piggyback on something Councilmember Pearce said, I think it's really important that we. Ensure that we have quality service providers as it relates to food and beverage on these on these sites. And so I hope that as you proceed with the RFP process, that if you feel that we're not getting an adequate response, don't'",
        "'speaker_0': 'hesitate to come back. If you feel you need to change the parameters of whatever we have set within those. Because I also heard that maybe that that maybe the RFP process was a little limiting. I'm not sure if that's been the case or not, but if it has, I would much rather get a home run at with'",
        "'speaker_0': 'these are these are home run sites that deserve home, home run food and beverage. And so Mr. Maurer could give any comment on that.'",
        "'speaker_7': 'Yes. Thank you, Mayor. Those are those are great comments. We absolutely agree. We did do an original RFP and it actually didn't produce what we thought it would produce. So we changed courses. We brought on a broker, a local broker who's been really helping us.'",
        "'speaker_7': 'But we appreciate the flexibility. So we agree it may take a little bit longer to find the right mix, but we really deserve to have amazing concessions that are unique and fun. So we appreciate the leadership of the entire council.'",
        "'speaker_7': 'We've had a number of discussions with District two, District three and the mayor about how our beaches need to be really special. So we feel we're on that path and really appreciate the comments and the work of the team.'",
        "'speaker_0': 'Thank you. And let me and then the final thing I'll say and I'll turn to Councilman Mongo is and I think Councilmember Ranga will understand this. I'm going to put my former coastal commissioner hat on. And I think that one of the things that I really like about this project, and it's the reason why I supported the'",
        "'speaker_0': 'the walking and bike path that we put out. A lot of these projects oftentimes get opposition and there is opposition on these projects from folks that want to preserve as much of the beach as possible in its current form.'",
        "'speaker_0': 'And I think what people oftentimes forget is if we really want to create access to the beach and access to open space, you need to provide the types of services and the types of amenities at these public spaces that will get folks actually come.'",
        "'speaker_0': 'And I think what we have seen with the example of the the additional path, which was a as we remember opposed and these new amenities, including the basketball courts that I see activated almost every single time that I'm on the path.'",
        "'speaker_0': 'I see, you know, young, young people playing basketball on those new courts. That, to me, is what the true mission of access to the coast is all about, which is bringing people to enjoy this beautiful coastline. And so I'm really grateful that you guys have worked so hard on doing this and creating these spaces on the beach'",
        "'speaker_0': 'for people to enjoy and for all families to enjoy, not just in a passive way, but also in a way that keeps our young kids active. So thank you very much for that. Councilman Mongeau.'",
        "'speaker_5': 'I just want to agree and thank all that worked on a recent concession RFP that came out for the fifth District. And I think that.'",
        "'speaker_8': 'While the number of.'",
        "'speaker_5': 'Applicants was small, they were mighty. And I think that echoing the comments about the home run are really important. And then just to consider and I know we're very fortunate, the fifth District procurement proposals were all local. And I think that local hire and local business expansion is a huge opportunity that also should get additional weight because'",
        "'speaker_5': 'they're.'",
        "'speaker_4': 'Proven.'",
        "'speaker_5': 'To be within the liking of the community. So when you look at that and the vision of the facilities, I'm really excited for what's possible.'",
        "'speaker_0': 'Thank you. There's a motion and a second. I don't have any public comment in front of me. Right. So please cast your votes.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 8.63.020, 8.63.030, 8.63.050 and 8.63.070; all relating to prohibiting the use and sale of single-use food and beverage containers, packaging and food service ware made of expanded polystyrene (EPS) foam, rigid polystyrene #6, and non-recyclable and non-compostable material for prepared food distribution, and the distribution of plastic for bio-plastic straws, read and adopted as read.   (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Item. Next item.'",
        "'speaker_1': '28 Communication from City Attorney Recommendation to declare ordinance. Amending the Long Beach Municipal Code relating to prohibiting the use and sale of single use food and beverage containers, packaging and food service where made of expanded polystyrene foam. Read the first time in the lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'Thank you. I think there's a presentation. So I'll turn this over to Mr. Modica.'",
        "'speaker_7': 'Yes. Craig Beck and his team will give a presentation reminding us of kind of the long history of this of this effort and what the next step is.'",
        "'speaker_0': 'Thank you, Mayor. City council members we wanted to bring tonight before you an amendment proposed for the polystyrene ordinance as directed by this council back in October. And we've had a lot of success with the implementation in the first three phases.'",
        "'speaker_0': 'And so this would be an amendment to that and then a proposal for we'll call it a phase for getting into the details of what's before you this evening is dico mokonyane and he's going to go through the powerpoint.'",
        "'speaker_0': 'You go. Good evening, Mayor. Mr.. And Council Members, thank you for having us back here today. As Mr. Beck said, we've had some tremendous success with the first three phases of the expanded polystyrene ordinance. And at your request, we've come back with some follow up regarding some other materials that could be affected by this ordinance.'",
        "'speaker_0': 'So back in October, we had well before we get to October. There we go. As you recall, the first three phases were implemented beginning in September of 2018. Phase that was for city owned facilities and events. Phase two is for large food service providers, defined as 101 seats or more so very large restaurants.'",
        "'speaker_0': 'And phase three was small food providers of less than 100 seats or less. And that last phase just went into effect in December of last this past year. In October of this past year, we gave a presentation updating the city council as to the progress we've made.'",
        "'speaker_0': 'And at that time, the City Council requested to expand the ordinance to include language that would ban the use of plastic or bioplastic straws and eliminate couplet exemption couplet exemptions. By March 15th, approximately, it was a six month request.'",
        "'speaker_0': 'You have before you an ordinance that's being presented today and since it was drafted, we did have some last minute discussions and based on some conversations we've had, we are going to recommend that the City Council consider an exemption for consumers who identify as a person with disability, making the use of a plastic straw a necessity for'",
        "'speaker_0': 'them. Also, the City Council asked that we come back with a recommendation that expands the ban into retail sales. So just to get a little background here. You can see what we're doing is fairly forward thinking, but we're not the first ones out there.'",
        "'speaker_0': 'There are other cities who have done similar bans. So a lot of the large companies that we'd be working with for retail bans are chains with a retail like a McDonald's or franchises have experienced this in other cities around the country.'",
        "'speaker_0': '20 cities currently have an ordinance regarding the use of straws, and 26 cities have retail ordinances that restrict the sale of polystyrene products. So the staff recommendation comes from mostly looking at similar cities as surrounding us. Like Manhattan Beach was one of the ones we considered San Diego as an area we considered, and our proposed ordinance is'",
        "'speaker_0': 'very similar to theirs. As you can see, no person, vendor, business or event promoter in the city shall sell rent or otherwise provide polystyrene food service where products which are not wholly encapsulated or encase with a more durable material including but not limited to cups, cups, lids, condiment cups, food trays, plates, bowls, clamshells and other food service'",
        "'speaker_0': 'use. We're also recommending that we extend it to polystyrene packing materials. So again, no person, vendor, business or promoter shall distribute polystyrene packing material, including things like foam peanuts, packing peanuts and packing noodles. And finally, no person, vendor or business or event promoter may sell, rent or otherwise distribute within the city.'",
        "'speaker_0': 'Meat and fish trays like you see at supermarkets are produce trays or egg cartons made in part from polystyrene. Again, these are relatively common materials that are included in bans in other cities. So just to celebrate some of our successes here, we have nearly an 85% compliance rate as of January 31st this year.'",
        "'speaker_0': 'And what makes that really extraordinary is that data goes back to September of last year and phase three hadn't even been a requirement yet until December. And we still, for that extended period of four months, have, sorry, September, October, five months have an 85% success rate.'",
        "'speaker_0': 'A lot of the reason some of the reason why there's a 15% noncompliance rate is because people are still expiring their existing inventory. And so while they're not in violation of the ordinance, we also didn't want to pretend like they're in compliance yet with the ordinance.'",
        "'speaker_0': 'So they're listed as a non-compliant side. But this is something the ordinance allows and would also allow for straws. We did a lot of outreach and promotion mailers to businesses, social media, door knocking, had some giveaways, and we did a multi-year educational program on that.'",
        "'speaker_0': 'And we have also resources on our website to assist businesses to comply. So what we'd like to suggest today, again, it's a slight variation and from what is in the draft ordinance and this is again because of discussions that happened since then in the last couple of days is the straws and lids would be effective sometime after'",
        "'speaker_0': 'March 15th, 2020. And that keeps us in line with the six month request that the council motion had originally put together. The goal is to get that in by Earth Day so that we can celebrate that as a success here in Long Beach for a day and also a retail ban to follow come October 1st.'",
        "'speaker_0': 'That's all I have for this evening. And I'm open to questions. Thank you, Councilman Ringa.'",
        "'speaker_7': 'Thank you, Mary. And I want to thank staff for putting this together and really looking at closely at what we're trying to do here and especially tried to reduce deadlines as we currently have. One question in regards to page three, where you recommend for consumers who self-identify as a person with a disability to make use of a'",
        "'speaker_7': 'plastic straw necessary? Is that. Well, maybe it's more to the city attorney with that amendment, to the original ordinance that we put that we proposed back in October, have an effect of basically having this as a new reading for this ordinance.'",
        "'speaker_7': 'Would it change that much? Yes. Vice Mayor and members of the council. Councilmember, you're wrong. That is correct. These changes would require us to come back and bring this back for a first reading. We can do that very quickly, but they are substantive in nature.'",
        "'speaker_7': 'And so we will bring it back for a first and second reading. Okay. I'm not opposed to that. I think it's a good idea that we include that. It would make it, I think, even stronger in regards to what we're trying to implement here.'",
        "'speaker_7': 'So thank you for bringing this forward.'",
        "'speaker_0': 'Thank you. Councilwoman, is this.'",
        "'speaker_5': 'Yes. I also want to thank staff for this and my colleagues for actually working really hard on bringing the system forward. I'm excited to see that Long Beeches is moving forward on something like this. And I think that, you know, as a person with a disability that can lift up a cup of glass to drink from, I'",
        "'speaker_5': 'thank you again for all those that are out there in my same situation who don't have the necessary strength to actually pick up a cup and drink from it, especially when it's full. So thank you for that and I look forward to supporting this item.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Pierce.'",
        "'speaker_8': 'Yes, I am super excited about your 85% compliance rate. I think that in the history of Long Beach has been a lot of times when we've had a vision, we've had a new ordinance and implementation hasn't gone that great because we haven't had the best community outreach.'",
        "'speaker_8': 'And that's just part of learning how to do it. And I think that you guys have really excelled and should be really proud. I'm really proud of Long Beach for this, especially considering how tough I think our very first conversation on this was.'",
        "'speaker_8': 'It really demonstrates how far we've come. And so I just really want to applaud you for that. And I want to applaud the city for the amendments, considering council members and de Haas's input and really just demonstrating that diversity on the council really can change policy.'",
        "'speaker_8': 'So thank you, guys.'",
        "'speaker_0': 'Thank you, Councilman Supernova.'",
        "'speaker_7': 'Thank you. Thanks, staff, for that presentation. And regarding the change to the ordinance. I'd like to read that exact language as proposed in a special thanks to the city attorney's office for working in the 11th hour on this.'",
        "'speaker_7': 'And I'd just like to add.'",
        "'speaker_0': 'That.'",
        "'speaker_7': 'The amendment would be reflective of cities such as Seattle and also California Coastal Commission cities, San Francisco and Santa Barbara. So I'll read the text as it will appear. Exemption A food provider or beverage provider is exempt from the provisions of this chapter under the following conditions.'",
        "'speaker_7': 'One. During a locally declared emergency, the city emergency response agencies operating within the city users of city facilities. And food providers and beverages shall be exempt from provisions of this chapter to the food provider or beverage provider provides or distributes a plastic beverage straw upon request to individuals with disabilities as needed to comply with the Americans with'",
        "'speaker_7': 'Disabilities Act. And I believe I need to make that as a motion for the amendment. I think you've clarified the motion that's on the floor, so you're good on that. Thank you.'",
        "'speaker_0': 'Thank you. I just want to add that I'm really, really proud of the work that you guys have done on this. And I'm so glad that we've been ahead of the curve as it relates to policy steering, and particularly on these issues around straws and the work that the team has done to proactively get restaurants to transition'",
        "'speaker_0': 'out of the polystyrene. It's been it's just been really great. And I've been personally hap as an active user of takeout and Postmates. I've seen the change that's happened just in the last year from some of my favorite places that it just I just did not like that they still use polystyrene and now they've all converted, you'",
        "'speaker_0': 'know, to paper or other other types of products. And so it's really great. And I'm always, you know, happy to see that. And you guys did a great job. So I just want to thank all of you for for that work.'",
        "'speaker_0': 'Can you remind me on the on the straw issue paper straws were are we encouraging any type of transition or what what's the the preferred model that folks are transitioning to? Or is that really up to them? Mr. Mayor, it's really up to them.'",
        "'speaker_0': 'We're trying not to suggest that people use any one particular product, just that it not be plastic or bioplastic. You have some restaurants that are actually offering you a paper straw, or you can buy a metal reusable straw and just keep it for yourself.'",
        "'speaker_0': 'Open sesame, I believe, down in the shadows then. So we have, you know, we're allowing restaurants to get creative and do whatever they want to make it happen. I also see more and more of the of restaurants just, you know, not obviously having them.'",
        "'speaker_0': 'And I think it's been so easy to transition to that, you know, for for most folks or even even larger retailers like like Starbucks, right. Who are now putting the the lids on on the on the top, which is really great to see.'",
        "'speaker_0': 'So good. Really good stuff. Councilwoman Mango.'",
        "'speaker_5': 'I'm a big supporter of straws generally, and I carry my own.'",
        "'speaker_8': 'Roberto.'",
        "'speaker_5': 'Durango straw in my purse. I've used it at many L.A. facilities, but I will say that as I've traveled around the country, I recently visited an airport that has an airport director that used to work here in Long Beach.'",
        "'speaker_5': 'And I will say that their entire facility adopted Apple straws and having used nearly every kind of straw on councilmember souvenirs lists that he just showed me, Apple was not listed on there. And I don't know if we provide a list of all the alternatives and their price points, but that was something that helped encourage this other'",
        "'speaker_5': 'airport by saying, here's a lot of options and here's a lot of the price points and here's how they come and here's how you can order them. Because a lot of our smaller retailers still go to like Sam's Club or Smart and Final within the city limits to pick up things.'",
        "'speaker_5': 'And so they've helped by encouraging those those suppliers as well. So I'm really proud of the work we've done. I can't believe I carry a straw in my purse, but I do. And when I go out of the house without a purse, the three things I grab to put in my diaper bag are my reusable straw, my'",
        "'speaker_5': 'sunglasses and my earbuds for my phone. So, I mean, the straw made the cut. That's a pretty high standard. Not even Chapstick made it. So thank you for helping me be a better environmentalist.'",
        "'speaker_0': 'And can I just get one? I have one question for for the staff before we go to a vote actually. And then I have Craig called Waldner. I think it says here, I'll call you up in 1/2. So thank you.'",
        "'speaker_0': 'Want make sure you were here. Can I also ask I think the one will you give me an update on any sort of ordinances or additional laws that the City of Signal Hill has implemented as it relates to all of our laws?'",
        "'speaker_0': 'Because I think one of the things that's interesting, I think Signal Hill still there. They still have plastic bags. Well, plastic bags are now a statewide statewide issue. The state has some legislation regarding straws that would affect all cities.'",
        "'speaker_0': 'Yeah. And what it says essentially is that a restaurant or food service provider must ask if someone you have, you have to wait till someone asked for a straw. So the state state law is implementing it doesn't they don't in signal health, to my knowledge.'",
        "'speaker_0': 'Ban plastic straws there. Okay. Okay. I was wondering if we'd.'",
        "'speaker_7': 'Be happy in the interest of uniformity to reach out to them and share with them what we're doing so that, you know.'",
        "'speaker_0': 'I think I think if they could just afford them what we're doing and it'd be nice to have that kind of uniformity as well, if possible.'",
        "'speaker_7': 'Reach out to their city manager there.'",
        "'speaker_0': 'Their own, you know, government. So I get that there's a motion and a second is, please, Craig. If Craig called, water could come forward.'",
        "'speaker_9': 'Good evening, Mr. Mayor and council members. My name is Craig Cadwallader and I'm speaking on behalf of the Surfrider Foundation South Bay chapter. And I'm very proud that you're moving forward with this amend these amendments. I was going to bring in the wording in the Manhattan Beach ordinance about the accommodations for people with disabilities, but it sounds'",
        "'speaker_9': 'like you've got it in there. And to me it was wrong not to have it. So I'm glad I'm glad you're proactive on that. It's very important. One of the things and also the the straws part of this is not that clear.'",
        "'speaker_9': 'So perhaps at the next first reading, the straws could be more clearly. There's only one sentence that reads All straws must be plastic or must not be plastic or bioplastic. I think if you miss that sentence, you don't get it.'",
        "'speaker_9': 'And other ordinances there currently are 136 by my count, in the state. Not all of them include the straws. I almost have them all memorized, which I work on this all the time with a lot of cities. But if it were clear that the plastic, including petroleum and bioplastic based straws are not acceptable, one of the options'",
        "'speaker_9': 'mentioned I bring these everywhere I go. I got my own straws and utensils. It's unfortunate utensils are included in this because they are in many other ordinances, including Manhattan Beach, Hermosa Beach, Redondo Beach, Culver City, and we're trying to get regional ordinances down here.'",
        "'speaker_9': 'So I hope you might look at that. I don't know why utensils were exempted, but they never get recycled. They're always landfilled. And I think this is the good way to go to bring in the rough food expanded polystyrene tray ban is really important I'm glad that's included and the packing peanuts and expanded polystyrene packing items those'",
        "'speaker_9': 'we find on the beach all the time. We're really looking this is a good, strong way to improve the ordinance. We are working on L.A. County, unincorporated right now. What you do here is going to help define that and we hope will get the city of L.A. to match that.'",
        "'speaker_9': 'I also bring my own collapsible food containers so you can bring your own by state law. Now, AB 619 was signed into law. Bring your own. It's easier. Thank you very much.'",
        "'speaker_0': 'Thank you very much. And with that, there's a motion and a second. Please cast your votes.'",
        "'speaker_4': 'Councilman's in Dallas.'"
    ],
    "Recommendation to declare ordinance amending the Use District Map of the City of Long Beach as said Map has been established and amended by amending portions of Part 5 of said Map from Park (P) to Belmont Pier Planned Development District (PD-2), read and adopted as read.  (District 3)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'I'm 30, please.'",
        "'speaker_1': 'Report from Development Services recommendation or declare ordinance amending portions of part five of the use district map from Park to Belmont Pier Plan Development District Red and Adopted Red District three.'",
        "'speaker_0': 'There's a motion and a second is I don't see any Christians in here. Okay. Please come forward. Speaking of this.'",
        "'speaker_4': 'I gave you guys two papers from two different groups. I'm not going to read those, but I just want to enter into the record of what I am going to do is read this way and I just have to get it in order.'",
        "'speaker_4': 'I'm sorry. I didn't mean to be out of order. Okay, here we go. Partly because it's we're honoring Black History Month tonight here at the council. I decided to include this piece of history. But first to the BBC.'",
        "'speaker_4': 'Long Beach has adopted a healthy communities policy to reverse the inequitable distribution of public recreational facilities. And yet we now intend to build the Belmont Beach, an aquatic center, a poster child for racism so ingrained in the local public consciousness that it can be hidden in plain sight.'",
        "'speaker_4': 'A century ago, a small band of Long Beach residents stood up against racism at the pike. In late June of 1919, Alija Blain, who lived at 506 Locust Avenue, stood before the all white city council bearing a petition signed by 20 of the city's 120 42 black residents asking that a popular game on the pike midway be'",
        "'speaker_4': 'shut down. Lane argued that drown the N-word created race prejudice. City attorney George Hood Hooter Pyle explained that they knew of no legal method of prohibiting the game unless it could be shown that the sport created rheumatism, in which case the Humane Society might have it discontinued.'",
        "'speaker_4': 'The petition was referred to a committee. The game continued to be played up into the 1950s. Elijah Blaine, who I really think deserves a spot on the walk, was just a working class guy who risked everything he had and everything he was.'",
        "'speaker_4': 'At a time when blacks could only live in select parts of town, when the local KKK had more than 10,000 members locally, and when Beaches and our beloved Pike Plunge were for whites only. The rules may have changed, but are we still playing?'",
        "'speaker_4': 'A version of this scheme. The target is no longer a black man seated on a diving board, assaulted by numerous whites whose success in hurling the victim into a pool of water was cheered on by a crowd of their peers.'",
        "'speaker_4': 'Now it's drowning, not dunking whole communities, not single individuals that is perpetuated by those who look away from the victims and cheer on a status quo in which minorities and poor whites continue to be denied and denied an equal opportunity to learn to swim and to participate in aquatic recreation and sports.'",
        "'speaker_4': 'So we are 75% minority community. We have 225 meter pools built in 100 years. We have one Olympic pool. We are now going to have two Olympic pools. Look at the demographics, look at the economics and look at the demographics and ask yourself, you know what?'",
        "'speaker_4': 'What do you.'",
        "'speaker_0': 'Think? Thank you very much. There is a motion and a second. Please cast your votes.'"
    ]
}