{
    "Recommendation to request City Manager to provide a report to the City Council within 60 days on the status of the Pedestrian Safety Advisory Committee, an overview of the City's school crossing guard program, including how many and where crossing guards are currently deployed, and what the cost, as well as the City's overall efforts to ensure traffic safety in school zones.": [
        "'speaker_6': 'Communication from Councilwoman Austin, recommendation to request to report on the status of the Pedestrian Safety Advisory Committee and an overview of the city's school crossing guard program.'",
        "'speaker_2': 'Thank you. Councilmember Austin.'",
        "'speaker_1': 'Thank you very much, Mr. Mayor. I think the agenda item is very much self-explanatory. I received many kind of constituent calls over the last few weeks. So as school has started again and many of them are concerned, many of my constituents have expressed concerned about safety around schools, roads, pedestrian safety, the safety of our children, the high'",
        "'speaker_1': 'traffic volume. And we we wanted to to look into the pedestrian safety advisory committee, understanding that this was something that was brought forward by the voters back in 1978, a time where we had a population of about 360,000 residents.'",
        "'speaker_1': 'Today we have 100,000 more residents. And it's it's apparent that that these safety issues are still a major concern in our neighborhoods and around our schools. And so I wanted to see where we were with the Pedestrian Safety Advisory Committee, and we'd love to hear from staff on that and what we can do and how we can'",
        "'speaker_1': 'start working as a city council to start improving those conditions in and around our schools. I'd love to get a staff report from from staff on where we are with the Pedestrian Safety Advisory Committee today.'",
        "'speaker_2': 'I think so. Mr. West, I wanna make some comments.'",
        "'speaker_5': 'Certainly, Mayor Council members are traffic engineer Dave Roseman can give us a quick report. The Pedestrian Safety Advisory Committee, as the councilman mentioned, started in 1978. We're one of only a few cities that have in California actually have an ordinance that specifically outlines when crossing guard should be deployed and not.'",
        "'speaker_5': 'And I believe we're the only one that has a citizens committee that makes the Approvals Peace Act is essentially a 13 member committee comprised of one member representing each council district one member from L.B. USD, one member from the PTA, one member representing NONPUBLIC schools and myself as the city traffic engineer.'",
        "'speaker_5': 'And in order to have a meeting, we need seven members to have a quorum. The last meeting of the committee was in November of 2008. Unfortunately, with the advent of the Form 700 reporting and ethics rules applied to committees at that time, we lost most of our membership because they felt that those requirements were too onerous.'",
        "'speaker_5': 'We are actively seeking additional members. We have nine potential members now, of which only six have actually completed the appointment requirements, which is a form 700 and the ethics training. The last meeting of peace in 2008, they set out a plan for us to study 14 locations for potential new crossing guards or reallocation of existing crossing guards'",
        "'speaker_5': '. Those are throughout the districts, and that's about how many we were studying. We're studying about 12 to 15 locations a year piece. Also recognize at that last meeting that membership was a problem. Many of them felt that they would not continue and they suggested a few things to us at that time.'",
        "'speaker_5': 'One was to move the meetings to an evening because we were having the meetings during the day, which I think is a good idea. They also suggested having meetings in a central part of the city, perhaps around the airport area, rather than at city hall, to make it easier for them to get there.'",
        "'speaker_5': 'And the third item was they suggested that perhaps the city should consider some compensation for membership because of the Form 700 and the other requirements that they would have to be exposed, their financial information exposed to the public.'",
        "'speaker_5': 'And that's essentially where we stand now. We're actively trying to get the additional members, the three that would names that we have completed through the process so that we can start up the committee at that time. You also asked about how many cross.'",
        "'speaker_5': 'And guards. We have currently we have 82 personnel positions. That's through the police department. And I think it's 68 locations that are covered by crossing guards at this time. And that concludes my report.'",
        "'speaker_2': 'Thank you. At this time, Mr. Austin, going to take to the public, unless you have any comments. Any members of the public that want to comment on the item, please come forward.'",
        "'speaker_4': 'Good evening. I'm Janet. What? I'm a parent with some Long Beach Unified School children and other schools. Here to talk about the issue, I'm very glad this has come before the council. My children walk and or bike to school and beyond just walking.'",
        "'speaker_4': 'I think we need to look at the bike lanes yet again so that they can transition there safely without my supervision. So I'm going to say that as a preface as I know they want to speak.'",
        "'speaker_2': 'Thank you. Next speaker, please. Uh, I want to pull the mic down. Just. There you go. And just introduce yourself.'",
        "'speaker_4': 'Hello. I'm Pierce White. And it is an honor to meet all of you. And I go to Little Cerritos Elementary, and there is such a problem with the bike lanes, and there are no bike lanes. And so it's dangerous for me to ride in the street because a car could hit me and I could get seriously hurt'",
        "'speaker_4': '. And so I go on the sidewalk, which is also dangerous for the other people around me, because I could run into them and hurt them, too. So I really appreciate it if you put some more bike lanes in to the schools and the city so I could ride around more safely because I enjoy my time spending and'",
        "'speaker_4': 'bike riding and stuff. So. That's all.'",
        "'speaker_2': 'That was an excellent presentation, actually. So. Yes. Excellent. Next speaker, please. Miss Kerr. That's a tough.'",
        "'speaker_4': 'That is a very tough act to follow.'",
        "'speaker_7': 'I won't even try. Good evening, Honorable Mayor. Council representatives, city staff. My name is Megan Kerr. I'm a member of the Long Beach Unified School District Board of Education representing District One. Happy to be here. We finished our meeting and I managed to get to back to school mate tonight.'",
        "'speaker_7': 'So I'm kind of glad that it was delayed. Personally. So thank you. I'm here to speak in support of this agenda item, which is an overview and update of pedestrian safety. The school district works closely with the city and agencies such as the police department and Long Beach Transit to ensure the safety of our students not only'",
        "'speaker_7': 'while they are at school, but on their ways to and from school traveling with their families. Our schools take a number of precautions and proactive steps related to pedestrian and vehicular traffic. And we welcome the periodic review with the with our efforts with the city, its residents.'",
        "'speaker_7': 'And we're always open to new ideas that might improve safety for our students. Thank you, Councilmember Austin, for bringing this item forward. I encourage you to keep the school district appraised of your review process as our input can be very important to you in this effort.'",
        "'speaker_7': 'And please let us know if we can be of any further assistance to you. Thank you so much for your time tonight.'",
        "'speaker_2': 'Thank you. Any other speaker? I think we had another speaker up. Yeah. Come forward, please.'",
        "'speaker_4': 'Hello. My name is Elise. What? I'm 12 years old and I'm a seventh grader at Intellectual Virtues Academy. Today I will be speaking for the bike lanes. When I rode my bike to school in the mornings with my friend Alex, we felt as if we could not be safe while riding in the streets, considering that they were'",
        "'speaker_4': 'so busy. So we rode on the sidewalk when there was a driveway. As adults always say, we looked both ways. Halfway across a car comes turning into it. And before and when he finally notices me, he's a foot away from hitting me and my bike.'",
        "'speaker_4': 'Consequently, I feel I'm feeling less safe while riding my bike in the city. In summer, my mom, brother and I rode to Jamba Juice on our way back. I rode through the entering and exiting of a parking lot a few minutes late.'",
        "'speaker_4': 'A few moments later, a car exited. Once again, I was almost hit by a car because I was on the sidewalk since bike lanes were not available. Lastly, in front of this building, it says that Long Beach is the most bike friendly city in America.'",
        "'speaker_4': 'This, though, is hard for me to believe, considering that twice I've nearly been hit with cars and two years ago I spoke for the bike lanes, yet they're still debating whether or not to put them in. Thank you for.'",
        "'speaker_2': 'Another excellent presentation. Give her a round of applause. Two. Very good. Very. Any other comments? Please come forward.'",
        "'speaker_0': 'Mr. Mayor, council members, my name is Michael Jensen. I am a long term resident.'",
        "'speaker_5': 'Of the eighth District. And I also would.'",
        "'speaker_0': 'Like to voice my support for Councilman Austin's proposal. I think that anything that we can do to improve the traffic and safety infrastructure of our community is.'",
        "'speaker_5': 'An extremely valuable investment. I think anything that we.'",
        "'speaker_0': 'Can do to expand the bike lanes will improve safety for bicyclists, as well as students who ride to our local schools.'",
        "'speaker_5': 'And I think anything that we can do along these lines will make our community a.'",
        "'speaker_0': 'More attractive place to live and will help the values of our property and make Long Beach an even greater place to live. Thank you very much.'",
        "'speaker_2': 'Thank you very much. Any other comments on the site and from the public, please?'",
        "'speaker_0': 'My name is Alec.'",
        "'speaker_5': 'Watt and this bike lane put in and encourages the biking and this there's the environmental aspect of it which is it decreases people driving around, which decreases carbon emissions.'",
        "'speaker_0': 'There's also the.'",
        "'speaker_5': 'Danger to both bikers and drivers. When the bikers are on the side of the road or on the sidewalk, there's more of a possibility to get hit by cars or to hit other people and also cars if they see a biker.'",
        "'speaker_5': 'They'll often move more to the middle of the road or someone comes around the corner. A car could swerve to avoid hitting anyone and hit another car instead. Putting the bike lanes then would also decrease the traffic of cars because more people would be on their bikes and having all the people out on bikes in the neighborhood'",
        "'speaker_5': 'builds community.'",
        "'speaker_2': 'Thank you very much. Very good. Thank you. And seeing no other public comment on the I don't want to take it behind to the council, starting with Councilwoman Gonzales.'",
        "'speaker_7': 'I just want to thank Councilmember Austin for bringing this forward, because I know this is something that we've talked about many, many times in the first District, particularly because we have two schools, elementary schools. And I know I've talked to Dave Roseman about it many times.'",
        "'speaker_7': 'Chavez and Edison right next to the 710 Freeway. So it also may be good to look at. I mean, I know there's current accidents that we have that have occurred, unfortunately. And looking at those, I'm sure, which you will.'",
        "'speaker_7': 'But are those factored into or how are we working with that exactly?'",
        "'speaker_5': 'Actually, when the committee was in existence or meeting regularly, they really drove how we conducted these studies because in the past we would just look at the pure numbers, but it's not all about numbers when it comes to safety around schools.'",
        "'speaker_5': 'There's a lot of other elements. So the Peace Committee also requested us to do traffic signal studies. We've installed a number of traffic signals because of Peace Act requests. We've done other all way stops. So the crossing guard is a element of safety around the school.'",
        "'speaker_5': 'And so it would be really good to be able to get this committee back together, to be able to help guide that discussion within public works as well.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_2': 'Thank you. And back to Councilmember Austin.'",
        "'speaker_1': 'Yes. I want to thank the speakers who came out to speak this evening on this very important issue. They speak for several people in our community. And I want to just say well done, especially to the youth, takes a lot of courage to get up here and speak as eloquently as you did right before the city council'",
        "'speaker_1': 'here this evening. And I think you were solution based with your comments talking about the importance of of laying out infrastructure to make school zones a lot safer. I think bike lanes can do that. If we could do that throughout our entire community, I think we'd be better off personally.'",
        "'speaker_1': 'But I want to get back to the core problem, and that's the fact that we have a committee that hasn't met since 2008. This agenda item asks for the city manager to review our crossing guard program, including how many and where the crossing guards are, where they're currently deployed, and at what cost and when.'",
        "'speaker_1': 'Well, as as well as the city's overall effort to ensure traffic safety in school zones. We have asked for a report back in 60 days, and I'd like to move the item. With that said.'",
        "'speaker_2': 'Kay, there's been a motion in a second by Councilwoman Gonzalez. Thank you for all for speaking for the motion, seeing no other council comments, please cast your votes, members.'",
        "'speaker_3': 'Thanks for.'",
        "'speaker_6': 'Watching. Case eight zero.'",
        "'speaker_2': 'Excellent. We're going to go ahead and move on to the consent calendar, but we're going to pull item number six at the request of one of the council members. So can I get a motion? There's been a motion and a second to approve the consent calendar.'"
    ],
    "Recommendation to request City Attorney to prepare an amendment to the Long Beach Municipal Code, Section 10.12.010, relating to the 30 miles per hour speed limit on Walnut Avenue, between Wardlow Road and Carson Street, as recommended by the City Traffic Engineer.  (District 7)": [
        "'speaker_2': 'Okay. Thank you. Now we're going to be moving on to item six, which was pulled from the consent calendar by Councilmember Urania. I'll turn this over to Councilmember Durango.'",
        "'speaker_3': 'Thank you, Mayor. The reason I pulled this out, because I basically want to commend city staff for their efforts in helping the residents in the Walnut Avenue corridor and supporting the their concerns about the level of speed of drivers who drive down that street.'",
        "'speaker_3': 'It's a very unusual when you do a survey of a traffic corridor where the speed limit might be 30 or 40 or 35. Usually when you see any adjustments to the speed limit, it's usually something that goes up because the level of tickets, the speed limit cannot can allow something to go faster.'",
        "'speaker_3': 'In this case, we're looking at a situation where the speed limit is actually going to be lowered by five miles per hour from 30 miles to 25 miles per hour from the section of of Wardlow Avenue to Carson Street on Walnut.'",
        "'speaker_3': 'So I want to commend staff for their excellent work and service and working with the community along that walnut corridor and making sure that the safety of the residents and the pedestrians who are living that walk in those neighborhoods and ride a bike in those neighborhoods, that the speed limit is not going to be a major factor'",
        "'speaker_3': 'for safety because you're going to be going a little slower. So I want to commend traffic engineer David Roseman for his work on this effort and and appreciate it. But if Mr. Roseman has a comment or two, I appreciate that as well.'",
        "'speaker_2': 'Okay. Thank you. Are there any comments from staff?'",
        "'speaker_5': 'Yes. Honorable Mayor and members of the city council. The setting of speed limits is a very complicated process that's outlined both in state law and Caltrans procedure manuals. If we don't follow those laws and procedures, we not only can can't enforce the speed limits, but we can place our roadway maintenance funds at risk.'",
        "'speaker_5': 'We have about 400 speed limit segments in the city, each of which has been studied every five years in order for them to remain enforceable. A few years ago, there was a move by the federal at the federal level that was supported by Caltrans director at the time and a number of Orange County cities to change the'",
        "'speaker_5': 'way speed limits are set in California, which would have resulted in about 75%. And I'll say that again, 75% of our speed limits rising across the city. Working together, the city manager, the chief of police, the city attorney and US in public works said we had to fight back and we did so by creating alliances across the'",
        "'speaker_5': 'state with cities like San Jose, 8000 Oaks, Glendale, Glendale and others. Ultimately, working with Tom Modica and his staff, a new legislation was introduced at the state level that restored some engineering flexibility to the process of setting speed limits.'",
        "'speaker_5': 'The good news is that using that flexibility, we were able to retain our speed limits. And in some very limited cases, such as before you tonight, we were able to recommend a lowering of the speed limit. I would like to just take a minute and acknowledge a very special engineer in the audience with us tonight, Amir Kazmi'",
        "'speaker_5': '. Would you please stand? Amir is a senior traffic engineer that's worked for the city for almost 30 years now. He'll be retiring later this year. Amir has been my right hand man in fighting the good fight with the state at the state level and with Caltrans related speed limits.'",
        "'speaker_5': 'He also came to me a couple of years ago and said, rather than using consultants to study our speed limits year after year, I think we can do better in house. We are the ones that know the streets.'",
        "'speaker_5': 'We're the ones that know the system best. He has almost single handedly reviewed all 400 speed zones in the city and solidified our study process so that we can retain our speed limits and have the documentation to withstand the test in court.'",
        "'speaker_5': 'Plus, he did in this case before you tonight, he has worked with the community in using unique engineering techniques, which I will not discuss to influence driver behavior, to get drivers to reduce their speeds and in turn allow us to legally lower the speed limit.'",
        "'speaker_5': 'Thank you, Amir, for all that you have done to make the streets of Long Beach safer. And that concludes my report.'",
        "'speaker_2': 'Okay. Thank you. So we have a customary ranga.'",
        "'speaker_3': 'Therefore, I would like to motion that we adopted the the recommendation to amend the code section ten 1.12.010 to lower the speed limit from 30 miles per hour to 25 miles per hour on Walnut between Waterloo Road and Carson Street.'",
        "'speaker_1': 'Second.'",
        "'speaker_2': 'There's been a motion and a second, any public comment on the item? CNN members, please cast your vote.'",
        "'speaker_6': 'Motion carries eight zero.'"
    ],
    "Recommendation to receive and file report on the new system for tracking commission appointments and receiving commission applications.": [
        "'speaker_2': 'Okay. Thank you. Now we're moving on to the regular agenda. We'll start with item number nine. An item an item number nine is a recommendation to receive and file a report that from my office. So I'll introduce this this item and then we'll we'll get started with it.'",
        "'speaker_2': 'I want to take us back to our retreat. We one of the items that we discussed was the importance of ensuring that we have a transparent and innovative tracking solution for our commission application process and commission system. We all know that our city commissions are an important part of our local democracy.'",
        "'speaker_2': 'The men, women, and in many cases teenagers that serve on these commissions do so because they love their city. They're committed to the community, and we expect them to do great work, which they do, and in turn, they expect to be part of this democratic process.'",
        "'speaker_2': 'I think that the commissions and those that have served have served the city well. We discuss the how the commission process up to this point has been done on a paper system and it has been quite antiquated. And so I'm going to we're going to briefly present to you the the final product of the new commission system'",
        "'speaker_2': 'will be launching this tomorrow. And then soon after that, there will be opportunities for the what we call the back end piece, which is the dashboard for the council members to go into that system and then begin to look at data and information that that's available to them as well, which will also be available to the public'",
        "'speaker_2': '. So to just walk everyone through the commission process briefly, we have Devin Cotter who worked on this project with the city clerk, and I want to thank the city clerk for the incredible work. This they had to go back and manually put in all of the history of our commissions into the system as well as get us'",
        "'speaker_2': 'up to date. So so thank you all for the hard work. And I'll turn this over to Devin Cotter.'",
        "'speaker_5': 'Mr. Cotter Thank you, Mr. Mayor. Good evening, counsel. And so on. The projection behind you, we have the first part, which is the boards and commissions application or actually sorry, the listing of all the different boards and commissions for the city.'",
        "'speaker_5': 'And this is going to be the new porthole for the public to be able to gain access and information. And so what we have here is, you know, a nice listing of all the city's current commissions and a brief description and what's going to be you know, what's great about this is that every point there's an apply'",
        "'speaker_5': 'button so that you can jump in. There's also a listing of all the vacancies in every single commission. So that way someone can know which positions have vacancies and which ones don't, and, you know when they can apply.'",
        "'speaker_5': 'They also have listings for some of them and seem to be all of them of the criteria for that position. So if there's a council office who the appointing authority is and you know, when those what those terms are.'",
        "'speaker_5': 'But going back to the the list of boards, what this does is it consolidates a few different points of information in the old system from, you know, where they meet, when they meet and how to apply. So if we look at, say, the airport commission, we have the fact that there's one current vacancy, we have their terms'",
        "'speaker_5': ', the term limits, and then we also have, you know, minutes and agendas and agendas. So if you're interested in what's going on in the commission, you get a link in this pool, pull up all the records that are available currently online.'",
        "'speaker_5': 'So the airport commission is great because they also upload the video. So you've got the video of the minutes and the agendas and information on the next meeting. And then of course, the big part that's going to be helpful for us is applying for a board.'",
        "'speaker_5': 'And this takes you to a new online application. And this also simplifies the process because instead of having multiple copies of paper applications, maybe one going to the council members office, one going to the mayor's office, one going to the clerk's office.'",
        "'speaker_5': 'They now are all centrally located on the system. We have, you know, basic information, including in their name and whatnot. What's nice is that they, you know, enter in their council district. So we know exactly, you know, who we wanted to get a recommendation from and all that.'",
        "'speaker_5': 'And unlike the paper applications, unified multiple boards at once, it indicates which ones are available. And you have spaces there highlighted in blue, which ones don't. But even if it's if there isn't a vacancy, you can still apply in the application will be kept on file.'",
        "'speaker_5': 'And then once someone does, you know, finish their application, they have the option of then saving it, printing it out, or going ahead and submitting it. And once it's submitted, it's automatically emailed to the mayor's office in the clerk's office for follow up.'",
        "'speaker_5': 'And you I have to say that the the amount of work that the clerk's staff did to help get this up to speed was fantastic. And I really appreciate their help with this. And and also, you know, we've got information on current board members.'",
        "'speaker_5': 'So if you're interested in, you know, who's serving on the board, you can get information on when they how long they've been serving and information such as, you know, which council district they reside in. So this will be going live tomorrow and moving forward if a council office has questions about, oh, who's applying for my district, who's'",
        "'speaker_5': 'currently serving for my district, you know, who's applied to this commission? It's going to be a much quicker, easier process to then produce a packet of applicants that can then go to each council office and then also before the council if they get appointed.'",
        "'speaker_2': 'So quickly, Mr. Carter. Thank you. And what allowed in addition to that is this this is this will be certainly incredibly transparent and open for the public as well. And so the public will have all this access to to look at who's who serving on our commissions, how to contact commission staff, what district they're in.'",
        "'speaker_2': 'And there'll be demographic information and we'll be able to very easily produce reports. And so the idea beginning tomorrow is if a council requests any type of report on who the commissioners are or how long they're serving. Mr. Carter will be able to produce that or our office working with the clerk's office so that it's it's done'",
        "'speaker_2': 'in a way that's it's organized and efficient. And the last piece also add to this is this is really, I think as a city, we want to move in a way that's innovative and that embraces technology, I think is one way of ensuring that we that we keep really a positive conversation about and encourage encouraging civic innovation'",
        "'speaker_2': '. I think this was just a small example of doing that. So I want to thank I want to thank Mr. Cotter and the city clerk and his staff for for all the work that went into this. We appreciate that.'",
        "'speaker_2': 'And so with that, Councilmember Andrews.'",
        "'speaker_0': 'Yes, I want to thank the mayor also, because I think this is a great idea and updating our system will, you know, keep our residents informed on the commission application process and as well engaging the residents, you know, to be engaged.'",
        "'speaker_0': 'And I think this is a great job that the mayor went and did. Thank you very much.'",
        "'speaker_2': 'You council Councilwoman Price.'",
        "'speaker_7': 'I want to echo that sentiment and thank the mayor's office for bringing this this program to us and thank Devin for the hard work. I know he's been working really diligently on getting this program updated and to the point where we can actually use it.'",
        "'speaker_7': 'I think one of the observations that I've had with the city is that sometimes it takes a long time for commissions to be filled and we have a lot of people who are interested but lose patience when that process takes a long time.'",
        "'speaker_7': 'So I want to thank the mayor for being progressive and bringing this new technology to the city. It was long overdue. I'm looking forward to taking advantage of it as we help recommend people from the third district to fill some of those vacancies.'",
        "'speaker_7': 'So thank you, Mayor.'",
        "'speaker_2': 'Thank you, Councilwoman Mongo.'",
        "'speaker_4': 'I too am excited about this innovative application and I look forward to seeing the citizen engagement. We often hear constituents say, I want to be involved, I want to serve my community, and this makes for a very transparent and open process that everyone has equal access to.'",
        "'speaker_4': 'And I think it really speaks to what we've said we would do as a council. And thank you for your leadership from the mayor's office.'",
        "'speaker_2': 'Thank you, Councilmember Austin.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I'd also like to commend you and your staff for helping to streamline the commission application process. As a former city commissioner, somebody who went through that process several years ago, I can tell you that this is this is much more transparent.'",
        "'speaker_1': 'This is a much easier and user friendly process for our residents, and I think it's going to be a great hit. There was one question that I did have of I guess, Devin is do we know who's in the queue or how many applications are on file?'",
        "'speaker_1': 'What is that information available as well?'",
        "'speaker_5': 'Mr. CARTER We were still, you know, up until tomorrow using the old paper system. So of course we can, you know, produce that report. But once this new system is in place, it will be a instantly generated packet.'",
        "'speaker_5': 'So you could request, you know, who's every applicant for city y, you can request a report on for a specific commission or from, you know, say, the people residing in your council district. So it'll be a much quicker and easier system.'",
        "'speaker_5': 'And one of the other things, too, is that if there is a council district requirement, say it's a seat for the eighth district that'll be present on the site so that instead of getting a call either to your office or to the mayor's office for oh, I'd like to apply for this commission only to find out that'",
        "'speaker_5': ', you know, they don't have a spot for an eighth District resident. That'll be apparent from the beginning.'",
        "'speaker_2': 'Thank you, Councilman Richardson.'",
        "'speaker_8': 'Congratulations, Mayor and Devon, on pulling this together. I think this is going to make our government much easier for folks to get involved in. And I look forward to seeing some of those reports on the back end. This is really exciting.'",
        "'speaker_8': 'It reminds me of some of the some of those platforms that are already out there, Nation Builder and all those database programs. This is this is a really exciting I would imagine there's going to be a flood of new applicants now that this process is so clean and transparent and open.'",
        "'speaker_2': 'Q And I believe Mr. Carter is going to produce an initial report for everyone. So you all have the kind of the new kind of where we're at currently, and then what's what's it moving forward? Councilwoman Gonzalez.'",
        "'speaker_7': 'I just want to say thank you as well. I know it's a lot of hard work put into this and we're finally moving into an age where this is really important. And it also gives us a profile as the city as to how we're doing, you know, with our with our appointments and demographics and everything like that'",
        "'speaker_7': '. So do I just had a couple questions. So the term is that on every single applicant, you'll will be able to see the term and how long they've been a commissioner.'",
        "'speaker_2': 'Mr..'",
        "'speaker_5': 'Carter Yeah. So for every single sitting board. Commissioner Fine. So this mess is a little unwieldy. You can look up every single current commissioner and it'll have their terms and then you can, you know, go also go by the board itself and see, you know, who's served for how long or, you know, when the terms are up'",
        "'speaker_7': '. Okay. Great. Thank you. Great work.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Arango.'",
        "'speaker_3': 'I want to echo Cory, all the comments have been made regarding this issue. I mean, it's wonderful application. We've been not bombarded, but we've been asked quite frequently about what are some vacancies out there in the interest. And I really do appreciate the fact that there's going to be multiple possibilities of getting not only considered for one'",
        "'speaker_3': 'commission, but also for another. And it's not a re a recent middle of an application one after another. It really seems like it streamlines it. And I'll beat an old and old guy and not always computer savvy as to what's going on here.'",
        "'speaker_3': 'I hope that there's an education piece behind this. For those of us who are technologically challenged and being able to access the application process for our for commissions, I know that's something that I will have to do with through my office as well.'",
        "'speaker_3': 'We'll be sending out some information to our constituents regarding the application process. It's new and it changes, streamlined and much more effective than what it used to be. But in the long run, I want to thank you and staff for putting this together.'",
        "'speaker_2': 'Thank you. And also customary ringa. If there are those that don't have access to computer or still want to do the paper version, I will still take paper versions. And then what will do the inputting on the other side?'",
        "'speaker_2': 'Okay. See any public comment on the item? Okay. See none again. Thank you all. It's going to be a great system launch. And if someone can make a motion to receive and file a report card, there's been a motion by Councilmember Andrews and a second by Council Brosnan.'",
        "'speaker_2': 'No public comment on the item. With that, please cast your votes to receive and file.'",
        "'speaker_6': 'Motion carries eight zero.'",
        "'speaker_2': 'Thank you. I don't know. Ten.'",
        "'speaker_6': 'Communication for Mayor Garcia. Recommendation to cancel the City Council meeting of November four, 2014 due to the general election.'"
    ],
    "Recommendation to name the park site located at the Pacific Electric Right-of-Way between Martin Luther King, Jr. Avenue and Lemon Avenue \"National Association for the Advancement of Colored People (NAACP) Freedom Park.\"": [
        "'speaker_6': 'Motion carries eight zero. Item 11 Council Communication from Councilman Andrews. Councilwoman Price. Council Member O'Donnell. Recommendation to refer to the Housing and Neighborhoods Committee and the Parks and Recreation Commission to consider naming the park located at 2300 Martin Luther King Jr Avenue and ACP Freedom Park.'",
        "'speaker_2': 'Thank you so much for this. Over to Councilmember Andrews.'",
        "'speaker_0': 'Yes, thank you, Mayor. First of all, I'd like to thank my colleagues for signing on with me with this item. And it's definitely a pleasure for me to be able to, you know, read this item because the fact that it plays a very important part, I think, in everyone's life.'",
        "'speaker_0': 'You know, it was founded in 1909 in the NAACP. It's the nation's oldest and largest civil rights organization for over 100 years. This organization has vowed to bring civil rights and justice to the new level of acceptance for all our national people.'",
        "'speaker_0': 'Local and Long Beach branch of the NAACP was started in 1940 by the late honorable Mr. Ernest McBride Jr. The policies and procedures brought forward by this local branch causes changes in language, education, economics, development, housing and the labor industry.'",
        "'speaker_0': 'I want to thank the thousands upon thousands of members that served to bring about the change that we see in our world today, not only for blacks, but for all colors that have been integrated into the movement towards freedom, equality and justice, which this is the part that will stand for Long Beach as well as for the'",
        "'speaker_0': 'United States. And the first park named in honor of the NAACP. And at this time, I would like to show a small film sent to us by the national president of the NAACP. Thank you. Would you please take the time to look at this?'",
        "'speaker_0': 'I am the largest.'",
        "'speaker_4': 'The oldest.'",
        "'speaker_0': 'I am the baddest. The boldest.'",
        "'speaker_4': 'I am protecting our voting rights and our environment. I am ending racial profiling.'",
        "'speaker_0': 'And fighting HIV aids.'",
        "'speaker_4': 'I am advancing economic equality. And for all. I am. I am. I am. I am. NAACP.'",
        "'speaker_7': 'Are you.'",
        "'speaker_8': 'Take a stand. I am.'",
        "'speaker_1': 'NAACP.'",
        "'speaker_0': 'Dawg. Thank you. I like to move to approve the asylum.'",
        "'speaker_2': 'Okay. There's been a motion and a second. Let me first begin by taking public comment on the item. With any public comment, please come forward.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_1': 'Honorable Mayor Robert Garcia, City Council. Thank you for this opportunity. I'm here on behalf of Naomi Rainey, president of the Long Beach Branch NAACP.'",
        "'speaker_0': 'My name is Jesse Johnson. I'm on the executive.'",
        "'speaker_1': 'Board and a lifetime member of the NAACP. We thank you for this consideration. Some of my speech has been given already with the history of the NAACP by our councilman at the Andrew's. We especially want to thank our Councilman de Andrew's council member, Susie Price and Councilmember Patrick O'Donnell for putting this item on the city council and'",
        "'speaker_1': 'especially to our honorable mayor Robert Garcia and the full city council.'",
        "'speaker_0': 'The state in.'",
        "'speaker_1': 'ACP President.'",
        "'speaker_0': 'Alice Huffman, as well as our new.'",
        "'speaker_1': 'President and CEO at the national level, Cornell William Brooks. Send their congratulations for this consideration that the city is giving and naming this part of the NAACP, Freedom Park. It was mentioned about the history so I can I'll pass over that.'",
        "'speaker_0': 'And last but not least.'",
        "'speaker_1': 'Oh, yeah. I'd like to mention also that.'",
        "'speaker_0': 'We had several.'",
        "'speaker_1': 'People in the audience that were here earlier, including the president on Naomi Rainey.'",
        "'speaker_0': 'But she had another.'",
        "'speaker_1': 'Engagement, and that's why she's not here.'",
        "'speaker_0': 'But we still have.'",
        "'speaker_1': 'A have some community.'",
        "'speaker_0': 'Leaders as well as pre the previous members and board members were you raise your hand.'",
        "'speaker_1': 'And everyone know Evelyn Knight. Of course.'",
        "'speaker_0': 'She's. She's also a lifetime.'",
        "'speaker_1': 'Member and and a civil rights leader nationally. She walked with Dr. King and many other things. And she was instrumental in a lot of the civil rights that happened here in the city of Long Beach. When I thank you for holding out with this presentation.'",
        "'speaker_0': 'And last but not least, Sylvia.'",
        "'speaker_1': 'Several of you have already committed.'",
        "'speaker_0': 'To attend our annual.'",
        "'speaker_1': 'Fundraiser. And this is how we are able to.'",
        "'speaker_0': 'Ensure the programs.'",
        "'speaker_1': 'And the civil rights that we do in the city continues on.'",
        "'speaker_0': 'It's happening is our 35th of Founder's.'",
        "'speaker_1': 'Celebration Dinner and awards presentation. It's this coming Friday.'",
        "'speaker_0': 'At the Hilton, the president's reception.'",
        "'speaker_1': 'And you all are welcome to attend as at 530 in the dinner and the program starts at 630 and then it's at the Hilton. And thank you so very much for this consideration.'",
        "'speaker_2': 'Thank you. And the other public comment came to get back to the council, Councilmember Ranga.'",
        "'speaker_3': 'I want to commend Councilmember De Andrews for bringing this forward, having been a long time community activist, myself in Long Beach before being an elected official, I have worked very closely with our Long Beach branch of the NAACP for civil civil disobedience issues, as well as some issues are very important to minority communities.'",
        "'speaker_3': 'And the NAACP has been one of those organizations that has extended its arms to embrace all the other cultures in this community as well. So I want to commend the NAACP for their efforts also in terms of being inclusive in their civil rights issues.'",
        "'speaker_3': 'It's not about one, it's about all. And we are one Long Beach. So thank you.'",
        "'speaker_2': 'Thank you. I think we have another public public speaker. So let me let me take the next speaker, then we'll go back to the council, please.'",
        "'speaker_4': 'My name is Evelyn Knight, and I would just like to say that I most appreciate the kind of consideration, because not only has the NAACP and many other organizations, civil rights organization, had a tremendous job in making things better for all people.'",
        "'speaker_4': 'But also, I would like to remind to remind us that that struggle continues because we still have a lot of rights and responsibilities that's on everybody's plate to make things better for all people in the United States of America.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you. And thank you for all that you've done. Councilwoman Pryce.'",
        "'speaker_7': 'Thank you. I want to thank Councilmember Andrews and his staff for giving me the honor to cosign on this particular item. One of the objectives of the ACP is to ensure the political, educational, social and economic equality for all citizens.'",
        "'speaker_7': 'And I think it's appropriate that here in the city of Long Beach, that is to our mission and that we have a park. And with that mission in mind and with that namesake. So thank you for being here.'",
        "'speaker_7': 'And thank you, Councilmember Councilman Austin.'",
        "'speaker_1': 'Thank you. And I also want to express my my gratitude for to my colleagues for bringing this forward. I want to congratulate the NAACP, the Long Beach chapter, Naomi Rainey, State President Alice Huffman, and the many members of the NAACP locally who who labor away for the mission.'",
        "'speaker_1': 'And Evelyn Knight, you said it best. The struggle does continue. The struggle continues in education. It continues in the political realm, but it also continues in the labor and industry area. We have one in high unemployment rates where we're looking to bring up wages of workers.'",
        "'speaker_1': 'I hope we can we can continue to work together and be partners on those issues as well and be cognizant of the importance of standing for those issues. I'm thrilled to 2 to 2 to support this item. And and I would encourage everyone else to as well.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Councilmember Andrews, for bringing this forward. And we a number of us stand on the shoulders of many of the folks who've come before us. But I think Councilmember Alston articulated it best. We are in the midst of a major discussion in our country around equality and and wages and fairness.'",
        "'speaker_8': 'So I would hope that moving forward, we can, you know, count on the NAACP as a partner here in Long Beach as we take on some of these some of these campaigns and challenges.'",
        "'speaker_2': 'Thank you. And with that, I believe there is a motion on the floor. Yes, it is. Okay. So we have a motion on the floor. I want to thank everyone, everyone for coming out. And if we can take a roll call on a roll call a vote, Madam Clerk.'",
        "'speaker_6': 'Councilwoman Gonzales.'",
        "'speaker_4': 'Writes.'",
        "'speaker_6': 'Vice mayor.'",
        "'speaker_4': 'Here. Now you want to voice, vote and.'",
        "'speaker_0': 'Oh.'",
        "'speaker_4': 'What are we doing now?'",
        "'speaker_2': 'It's just a regular vote. Oh, Castro does.'",
        "'speaker_4': 'One.'",
        "'speaker_2': 'Voice. And then I said, I'm sorry about the regular vote. Yes.'",
        "'speaker_6': 'Motion carries eight zero.'",
        "'speaker_2': 'Thank you. Sorry for the confusion. Moving on to congratulations. Very good. Moving on. Item 12 has been withdrawn. Moving on to item number 13. Madam Clerk.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-6914 for construction of the Beach Pedestrian Path project; award the contract to Powell Constructors, Inc., of Fontana, CA, in the amount of $5,519,700, and authorize a 15 percent contingency in the amount of $827,955, for a total contract amount not to exceed $6,347,655; authorize City Manager or designee to execute all documents necessary to enter into a contract, including any necessary amendments thereto; accept Categorical Exemption No. 12-044; and   Increase appropriations in the Tidelands Operations Fund (TF 401) in the City Manager Department (CM) by $2,523,428.  (Districts 2,3)": [
        "'speaker_6': 'Report from City Manager, Financial Management and Parks, Recreation and Marine Recommendation to award the contract to PAL Constructors for construction of the Beach Pedestrian Path Project for a total contract amount not to exceed the $6 million and increase appropriations in the Tidelands Operations Fund by 2,523,428 districts.'",
        "'speaker_6': 'Two and three.'",
        "'speaker_2': 'Thank you. Can I get a motion to approve? There's been a motion. Any second. Any public comment?'",
        "'speaker_0': 'Yes, sir. Hello. Honorable City Council. My name is Bill Napier and Mayor. My name is Bill Napier. And. At the California Coastal Commission meeting about a second path on the sand of our beach. They also told you that if anything was to change about the beach here, that you will have to remove the new path.'",
        "'speaker_0': 'Well, I'm here to remind you that the Army Corps of Engineers of the federal government promised Long Beach, California, a study of the Long Beach breakwater, and I'm sure that they will keep their promise. And so the city must be ready to remove the new path at any time.'",
        "'speaker_0': 'And also, remember, when you have a beach. That's right. You will meet your surfer girl. Thank you very much.'",
        "'speaker_2': 'Hey. Thank you, sir. Mr. Goodhue.'",
        "'speaker_0': 'Very good. You click as the address. This is a very most instructive item in a number of ways. First of all, it is a classic example of one of the biggest problems this city faces, in my view, particularly with Thailand's area.'",
        "'speaker_0': 'The failure of people to understand this council and other councils and too much of the staff. The failure to understand human use patterns. And common sense. Only a close cousin of a buffoon would could conclude that putting in a second path would any way seriously in any right or reduce any problem.'",
        "'speaker_0': 'They will migrate back and forth. That's human nature. That's absolute human nature. And this is secondly, a classic example of what I say is one of our biggest problems, which is not a shortfall of money. It's a shortfall of common sense.'",
        "'speaker_0': 'This is no different than it's a self. City council together stood up on the. Bluff. Unzipped its collective fly and engaged in an activity you'd probably be arrested for. It makes absolutely no sense. But the final point I make, and I think it's I would hope you would take judicial and constructive notice of this is the format'",
        "'speaker_0': 'of this. The way this is formatted and presented to you today is excellent. Outstanding. It is not a black ops backroom type of presentation. This is the type of format. The issue that I discussed earlier should have been contained in whether it be dealing with a bike path removal, construction of a building.'",
        "'speaker_0': 'Period. And that should always be if you don't see something like that, you know, you've got some trucks running around. But again, stop and think about it. And it should start with this path. Human use patters, people, you people do what the crow does.'",
        "'speaker_0': 'They use common sense. And there is no way you're going to stop people from migrating back and forth. This is tantamount like saying, okay, I'm fine avenue, if you want to go north, you can only stay on the east side of the street.'",
        "'speaker_0': 'And the converse for the west side of the street are the same thing on Broadway. Most people generally are not stupid expecting people not to migrate back and forth. And the solution is, I bet you six months from now, a year from now, somebody's going to come up with an idea of spending a few million dollars putting'",
        "'speaker_0': 'up a fence, period. The areas, unplanned, uncontrollable, will always be like that. Rethink this.'",
        "'speaker_2': 'Thank you. There's a motion on the floor. Members, please go ahead and cast your votes. Did you. Did you want to comment? Okay. I thought this was your call. Before we vote, Councilwoman Pryce, and they will go to a vote.'",
        "'speaker_2': 'You mean it? She made a motion early on.'",
        "'speaker_7': 'It's taken. I was listening to Mr. Goodhue and lost track of my thoughts. I wanted to, just for a moment, to thank our staff for the countless hours that they've put into this project. Eric Lopez, Tom Modica, I've talked with you.'",
        "'speaker_7': 'You've briefed me on this project, and I want to thank you and the other members of our staff who have worked on this. I know that there have been several revisions to this path, and at times I'm sure that must have been frustrating, but I think we have a better project for it now.'",
        "'speaker_7': 'It did have a couple of questions that I want to share with you or ask you. Now, we have received many, many emails in our office in support of the pedestrian path. Many people are looking forward to being able to use this path exclusively for walking and running and view it as a benefit to our city.'",
        "'speaker_7': 'My question for you is, what is the timeline? Can I just share all the questions with you now, or do you want to go one at a time? Okay. So what is the timeline? There are have been some concerns about since we're taking portions of the beach, whether or not we've given a fair thought to the size'",
        "'speaker_7': 'of the path, the with the length of the path to make sure that it's minimal intrusion into the beach. So if you could just elaborate for us briefly on what has happened in regards to that and how that conclusion was reached and and whether or not there will be an opportunity at some point down the road for'",
        "'speaker_7': 'any displays of art along that path. I know that's a discussion that had been brought up in the past. So. Thank you. With that.'",
        "'speaker_2': 'Mr. West.'",
        "'speaker_0': 'Tom Modica Thank you, Mr. Mayor. Members of City Council Councilmember Price. I'll try a brief description of those three questions and then Eric can help out with anything that I might miss in terms of timeline. If this is approved tonight, I will be looking to start construction very shortly before the end of the year with a goal'",
        "'speaker_0': 'of being complete before summer 2015 so that the path will be open and available during our highest use time, which is the summer. In terms of the size of the path. You're right, it has gone through a number of iterations.'",
        "'speaker_0': 'The path has actually moved. The original proposal was south and towards the water for the pedestrian path through the the Act of the Coastal Commission and what the Council approved in February. It's now been moved to north of the path.'",
        "'speaker_0': 'The buffer between the two paths has actually been shrunk. So that's down to six feet. Where previously I believe it was ten. Ten. Correct. And also one thing that we gain out of this project is by realigning the paths, we actually are getting a net gain of water or a beach space that is accessible.'",
        "'speaker_0': 'And so you actually increase your sandy beach area adjacent to the water by about 300,000 square feet. The pathway itself takes up about 154,000 square feet. And so the net gain is actually 146,000 square feet of actual beach area that can be better utilized.'",
        "'speaker_0': 'And then as to the question of art, in February, when the council passed this item, they asked us to take a look at the art separate from this item, not as a condition, but separate. One of the things we've done on art is on any major project.'",
        "'speaker_0': 'Now, moving forward, each one of those projects in the Tidelands is going to have an art component to it. And so as we look at the Belmont Pool, as we look at Cherry Beach, as we look at.'",
        "'speaker_5': 'Some of the concession stands, there will be art associated.'",
        "'speaker_0': 'With each one of those projects at the major nodes. And as part of those projects, we can potentially look at some other art up and down on the on the path as well, trying to achieve that balance of keeping a natural area while also providing some artistic elements in the appropriate places.'",
        "'speaker_0': 'I hope that answers your questions.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Any other questions or comments? Councilmember. Consumer price? No.'",
        "'speaker_4': 'Oh.'",
        "'speaker_2': 'Okay, great. Then we have a vote and we have a motion on the floor. Members. Joaquin Castro votes.'",
        "'speaker_6': 'Ocean carries eight zero.'",
        "'speaker_2': 'Thank you. Next item.'"
    ],
    "Recommendation to receive supporting documentation into the record regarding the Tax Equity and Fiscal Responsibility Act (TEFRA) public hearing; and adopt resolution approving the issuance of revenue bonds by the California Municipal Finance Authority (CMFA) to benefit a limited partnership sponsored by Volunteers of America National Services, in an amount not to exceed $13,000,000.  (District 1)": [
        "'speaker_6': 'Motion carries eight zero. Report from Financial Management and Development Services recommendation received supporting documentation to the record regarding the tip public hearing and adopt resolution of benefit of limited partnership sponsored by Volunteers of America National Services an amount not to exceed 30 million District one.'",
        "'speaker_2': 'Can I get a motion? Okay. There's been a motion and a second. Councilman Gonzalez.'",
        "'speaker_4': 'Oh. Oops. What did I do? Sorry. So. Okay.'",
        "'speaker_7': 'I just want to say, I'm really thrilled to hear that the chemist senior apartments will be getting refurbished. I think this is the third or so building in our district. That's that's done this and it's wonderful. I just had a question, though, as to the TEPHRA funds.'",
        "'speaker_7': 'When we received that loan, back with interest. How I know it will be going back to our housing fund, but is that reallocated back into the same district or how is that how is that appropriated?'",
        "'speaker_5': 'Councilmember I'm going to turn this over to our city treasurer, David Nakamoto. But again, this is one of our policies for affordable housing which are real. Glad to present tonight. So, David, thank you.'",
        "'speaker_0': 'Councilwoman Garcia.'",
        "'speaker_1': 'I'd like to make a comment.'",
        "'speaker_4': 'That was the former mayor. Thanks.'",
        "'speaker_2': 'Excuse, Councilwoman Garcia.'",
        "'speaker_4': 'It's okay to the council. My apologies. That's okay.'",
        "'speaker_7': 'There was a Garcia here in the first before, so. That's all right.'",
        "'speaker_1': 'I'd like to make a correction in that these funds are not issued by the city at all. What they are. It's a bond issue issued by a Joint Powers Authority, in this case, the CMC, which the city is a member of.'",
        "'speaker_1': 'We have no taxing authority. We have no financial obligation to support these bonds.'",
        "'speaker_0': 'Our role is merely to hold a.'",
        "'speaker_1': 'Temporary hearing to allow the agency to fulfill its regulatory requirements and then issue the bonds.'",
        "'speaker_7': 'Okay. But I see here and maybe that's where I'm a little unclear as to the I guess, the city loan. And it says from what we received from a staffer, funds will be deposited back into the city's housing fund and reused for affordable housing purposes.'",
        "'speaker_4': 'So, yeah.'",
        "'speaker_0': 'Councilwoman Gonzalez, I know you're.'",
        "'speaker_1': 'A members of the council. There's about $140,000 loan that is existing on the building from when it was.'",
        "'speaker_0': 'Originally built in 1993.'",
        "'speaker_1': 'That loan with interest will be repaid. Those funds will be deposited into the housing fund to be used citywide for affordable housing purposes.'",
        "'speaker_7': 'Okay, so it is city wide. Okay. Thank you. And thank you so much for the thorough information on the Simas Towers. We're really looking forward to that and the district's that. Thank you.'",
        "'speaker_2': 'Thank you. Any members of the public who wish to comment on the item? CNN members, please go and cast your votes.'",
        "'speaker_3': 'God, how are you?'",
        "'speaker_6': 'Eight zero.'",
        "'speaker_2': 'Motion carries an excited and pleased.'"
    ],
    "Recommendation to authorize City Manager to execute the renewal of contracts with Anthem Blue Cross, the Citys Third Party Administrator for the Preferred Provider Organization (PPO) and the Health Maintenance Organization (HMO) group health plans and Medicare Supplement plan; United Healthcare Medicare Advantage Plan; Scan Health Plan for the Medicare Advantage Plan; Delta Dental for the fee-for-service dental plan (DPPO); Medical Eye Services (MES) for the vision plan; CVS Caremark as the Prescription Benefit Manager (PBM) for the Prescription Drug Plan; Standard Insurance Company for life insurance and Long- and Short-Term Disability; and Union Mutual Life Insurance Company (UNUM) through Larry Lambert & Associates Insurance Services for the long-term care benefits; execute a contract with Delta Dental for the closed-panel dental plan (DHMO); and any subsequent amendments necessary to maintain current benefit levels and remain in compliance with state and federal laws on all plans.  (Citywide)": [
        "'speaker_6': 'Report from Human Resources recommendation to execute the renewal of contracts with seven health care providers for coverage of health, dental, vision, prescription and disability to maintain current benefit levels in compliance with state and federal laws on our plans citywide.'",
        "'speaker_2': 'Okay. Hold on. There's been a motion in a second. Councilmember Mongo.'",
        "'speaker_4': 'First, I want to thank our department and our city management for looking after the the health needs of our employees and their families. This is a very, very important matter. I think what's also an important matter is for us as a city to acknowledge that this is a $4.2 million annual increase over last year, according to staff'",
        "'speaker_4': 'reports that I've been reading. And if I'm incorrect in that, I'd be glad to be corrected. But with that, I'd like to see in the next several months that the Budget Oversight Committee start looking at this in advance of two weeks before our October enrollment.'",
        "'speaker_4': 'Both cost to employees and the city have increased over time, and we've shared that. And I think that we need a more comprehensive discussion about what options we have and what can be done. In six years we've experienced a $9.3 million increase, but in this last year, we've experienced a $4.2 million increase, and this only covers approximately'",
        "'speaker_4': '3900 employees in the city at this time. And so I think we just need to have a good amount of time in committee to discuss that. And so if council that the Vice Mayor Lowenthal is open to that, I'd like to request of the Human Resources Department city manager's office to prepare a report with the historical data'",
        "'speaker_4': 'and options that we have to ensure whether it's healthy lifestyle plans for our employees or Biggest Loser projects that other cities and counties have taken on to reduce those ongoing costs over time. I think this is a very important matter and needs to be discussed.'",
        "'speaker_4': 'It is $4.2 million increase, and I think that that's a big component that wasn't that wasn't put in the fiscal impact as much as you have to do the research to find that. So. But thank you for providing all the information.'",
        "'speaker_4': 'I think you've got an excellent job and a thorough job to be able to get to this point, to start the discussion. And I'd hope that Councilmember Lowenthal would take that on.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilmember Price.'",
        "'speaker_7': 'On that note, it does seem that, you know, the data that Councilmember Mongeau and I are referring to looks like it spans a period of time starting in 2009 until the president going into 15. And it looks like at some points there was a rise in the costs and at some point a decline.'",
        "'speaker_7': 'Can you, Ms.. Mills, maybe can you comment on what it is that is the cause of the current increase?'",
        "'speaker_5': 'Yes.'",
        "'speaker_4': 'Well.'",
        "'speaker_5': 'We have two plans. One is a PPO plan, which is a self-funded plan, and the second is an HMO plan, which is a fully insured plan. So on a fully insured plan, of course, we simply pay the rates to the provider.'",
        "'speaker_5': 'On the self-insured plan, we can have some variation from one year to the next, depending on how many large claims we might have. So that can have some impact. I would also say to speak to Council member Mungo's question.'",
        "'speaker_5': 'We do. And Cheryl is actually pointing out to me the Affordable Care Act could account for about was it 12.7?'",
        "'speaker_4': 'Or.'",
        "'speaker_5': '4.8% of the increase is actually the Affordable Care Act. So there are a lot of fees and. Taxes that the city is required to pay. And those were all folded in on the HMO side and the PPO side into the rate.'",
        "'speaker_5': 'So that accounts for some of the increase this year. And then we we do have a wellness program that's built into our plan. So we're certainly very mindful of trying to help our employees be more healthy and all in an effort to reduce cost.'",
        "'speaker_5': 'In the case of the prescription drug plan, one of the highest increases is prescription drugs, those specialty drugs. So we've put some plans in place in order to monitor those and make sure that they're being used in the best way possible and most cost efficient possible.'",
        "'speaker_5': 'But we can certainly provide a lot of detailed information on the plans.'",
        "'speaker_2': 'Dr. Bronson.'",
        "'speaker_1': 'Yes. I wanted to follow up on all those questions. I think your remarks were were pretty much on point. Councilmember Mongeau, I understand that the rising cost of health care has been a problem or been an issue for municipal government for many, many years.'",
        "'speaker_1': 'What I guess the question for staff is with this plan, what is the projected increase in the term of this current agreement? Generally there is that there's a built in factor of X percent a year of cost going up or down.'",
        "'speaker_1': 'Is that that factored in here in any way?'",
        "'speaker_0': 'Cheryl murray, our h.r.'",
        "'speaker_5': 'Officer will answer that.'",
        "'speaker_4': 'For the projected cost for the increase on the benefits plan for this year, the increase is roughly about 4 to 6% increase.'",
        "'speaker_1': 'Okay. And what does that mean in real dollars?'",
        "'speaker_4': 'In real dollars, as she stated, it has gone up from last year, approximately $4 million.'",
        "'speaker_1': 'Okay. And is is. And we understand under the Affordable Care Act, cost were supposed to stabilize. We re experiencing that at any way.'",
        "'speaker_4': 'We haven't gotten to the stabilization portion yet. We are required to pay the bakery fees, which we have done for the last two years, last year and this year. Coming up in 2016, we will be responsible for paying a reinsurance fee that's incorporated into our rates.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_2': 'Thank you, Vice Mayor Lowenthal.'",
        "'speaker_4': 'I wanted to refer back to Councilmember Mango's comment, and I would be open to having that in the budget oversight. Is that a request to the makers of the motion to add that report? I wouldn't add it to the motion at this time, but more just a friendly request.'",
        "'speaker_4': 'I know that you manage the agenda of that committee. I would like to pass the item as it is in line. So we will go ahead and add that to the Budget Oversight Committee agenda. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Pryce.'",
        "'speaker_7': 'I don't have anything. I apologize.'",
        "'speaker_2': 'Any public comment on this item? See, now there's a motion on the floor. Please cast your votes.'",
        "'speaker_6': 'Councilman Andrews. Motion carry seven zero.'",
        "'speaker_2': 'Thank you. Next item.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 2.50 establishing a Technology and Innovation Commission, read and adopted as read.  (Citywide)": [
        "'speaker_6': 'Report from City Attorney Recommendation to declare ordinance adding Chapter 2.5 to establishing the Technology and Innovation Commission met for the first time and lead over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_2': 'Okay, there's been a motion in a second to accept the motion. I'm going make a few comments on the motion. This over have a question. First of all, I do want to just begin by thanking the city attorney for for working diligently on this on this item.'",
        "'speaker_2': 'And also, this is a continuation of a budget item that was already passed by the council. So the council has already, as part of the budget, funded the establishment of a new commission, which is the new Technology and Innovation Commission, which is something, as we know, is greatly needed in the city of Long Beach.'",
        "'speaker_2': 'This commission is going to be charged with looking at innovation in government technology, working with our Technology and Innovation Department, as well as the new director of technology and innovation. And there's a lot of exciting things in this area.'",
        "'speaker_2': 'Cities across the country are bringing and putting together commissions and groups on technology and innovation. And this will ensure that we are a 21st century city and that we're leading the way. And so it's and it's an exciting time.'",
        "'speaker_2': 'And I want to again thank the city attorney and the council. Councilmember Austin.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I want to first of all say that, yes, I did vote for the budget. I passed it. And I have no problem moving forward with the Technology and Innovation Committee. I was a commission. I was on the issue enough when this particular item came before the and commission committee several months ago.'",
        "'speaker_1': 'But when this agenda item came to the City Council to establish the Technology and Innovation Committee, the makeup of the commission was supposed to be 11 members, one from each council district and two At-Large members. And on this, this particular ordinance reads it, read seven members.'",
        "'speaker_1': 'I can can somebody explain how we how we changed?'",
        "'speaker_2': 'Well, I think the initial ordinance was presented by the city attorney's office. And certainly we reviewed the ordinance. I don't remember the or recall the exact language of the of the motion. But Mr..'",
        "'speaker_0': 'City attorney, the.'",
        "'speaker_5': 'Mayor's member of the Council of Councilmember Austin, you're correct. In September of 2013 and the item that was referred off to the committee, the the composition was 11 members, one from each district and two at large. Then the item was went to the committee for the analysis that was done.'",
        "'speaker_5': 'It was received and filed. Then the item was brought back as part of the budget approval process, as the mayor mentioned. At that time, we did not follow this recommendation from council. We were working with the mayor's office on the new composition of the committee that's before you tonight.'",
        "'speaker_5': 'So there is an inconsistency in the from what came from the council to what you have here before you tonight. I can't explain exactly how that happened, but our office was working with the mayor's office and we thought we had it, however, how it was supposed to be.'",
        "'speaker_5': 'But you point out that we do not have that, as you indicate. So we have two options this evening. You can consider and adopt the commission as presented. We could certainly take it back and revise the makeup of the committee to reflect the previous actions of the council and bring that back to you for a new first'",
        "'speaker_5': 'reading.'",
        "'speaker_2': 'Thank you. And actually and Councilman Brosnan, I appreciate that. In retrospect and looking back, I made the motion I brought the agenda item to the council, including what you're describing as the makeup of the commission. So I obviously, I that's where it where it began in the discussions with the city attorney.'",
        "'speaker_2': 'And so in what the attorney presented to us initially was a seven member commission. We looked at that. We're supportive of that. Looking at the other commissions, they are set most most are seven member commissions or smaller. They're not.'",
        "'speaker_2': 'Well, I think we have one with one exception or two. We have 11 member commissions. I think that's why the number was was set. As far as the makeup of the commission, to be quite frank, I'm not married to it either way.'",
        "'speaker_2': 'If we want to go back to another system, I have no issue with that. The only thing I would caution is in the discussion with the city attorney's office, because this is focus on innovation and technology, and it's such a specialized type of of experience and commission.'",
        "'speaker_2': 'We want to ensure that we're kind of putting together the brightest minds on innovation in the city. And certainly, like every commission, we want to make sure it's diverse and has representation from the whole city. So I think that as presented by the city attorney and in the discussions, I'm very comfortable with the seven member commission as'",
        "'speaker_2': 'laid out here. If there is interest in having those also be the Council District piece, I'm open to that, but I want to make sure that could limit. I think some of the the ability of the commission.'",
        "'speaker_1': 'Well, I don't want to second guess you and your wisdom here, but like you said, you brought it forward to begin with with 11 members as a city council member. And the city council was the policy setting body of the city.'",
        "'speaker_1': 'With all due respect, the mayor's office has a lot of influence here, but we are the this is the body that that does that. And so I don't in terms of form, I just like to to respect the the the the vote and the position in the direction that the city council laid down to to establish this'",
        "'speaker_1': 'commission. And we respectfully move to to amend this to include the 11 members as originally laid out by the city council last year.'",
        "'speaker_2': 'That is a second on the amendment. I think there's a second councilmember mongo.'",
        "'speaker_4': 'Having not been privy to the 11 member original. Counsel item, did that have the flexibility that this one has where some of the technology gurus of our region may not live in Long Beach at this time, but could be huge contributors?'",
        "'speaker_4': 'Because one of the things I really liked about this was that five members will live in the city of the seven. And instead of really trying to divide by nine, again, it really thinks about the city as one whole, the way we kind of talked about at the original visioning session.'",
        "'speaker_4': 'And it talks to the different components of our city mobile applications, networking, technology and education. I just watched on the screen a presentation about our districts and the one that they showed was about the airport commission and the airports in my district.'",
        "'speaker_4': 'And I don't have an airport commissioner living in the fifth, and I'm okay with that because we've done an excellent job selecting people with a city wide vision. And so specifically it was nine members that live in council districts and two members that live in the city are at large but don't have to live in the city'",
        "'speaker_4': ', have expertize in what area? I mean, where the expertize is required. I just know that having served three years as a budget director for Community and Senior Services, which manages one of the largest bodies of commissions, which is a 40 member Workforce Investment Board, fulfilling all the requirements and maintaining a quorum is a huge component of being'",
        "'speaker_4': 'able to be successful. And so I want to be mindful of both of those balances.'",
        "'speaker_2': 'Q Vice Mayor Lowenthal.'",
        "'speaker_4': 'And I agree with that. I know that there are several commissions where I would definitely advocate for representatives from each council district. But as it relates to technology, I am not wedded to having someone specifically come from the second District.'",
        "'speaker_4': 'I am open to having these experts coming from outside of the city, as Councilmember Mongo indicated. And I also would support having a much more manageable size. It's hard to I think this may have been said earlier, it's hard to get a quorum when the group is larger.'",
        "'speaker_4': 'I think that's difficult. We found that maybe not in all our commissions, but it is difficult to get a quorum when the number is larger. So I'd support it as it's presented today, even though as a council we did approve it.'",
        "'speaker_4': 'I don't feel that I have to approach it in a formulaic way as a divide by nine, make sure every council district is represented, especially when it's a very specific commission, especially specific to an industry and an expertize.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilor Richardson.'",
        "'speaker_8': 'So I, I seconded this because I was a little caught off guard on the disparity between the 11 versus the seven. I thought it was worth discussing. You know, we had to use the airport commissioner as an example when we found out that we have a vacant ninth district position for the airport commission.'",
        "'speaker_8': 'We found a pilot in the ninth district and he was really excited about it. And it was a and so he's one of the people on the commission that comes back and reports, notes from the meetings, and he's interested in serving other capacities.'",
        "'speaker_8': 'So from that standpoint, I could certainly and totally see the value in ensuring that we do have representation not only geographically but from different perspectives, because who knows who could benefit from being at the table in these discussions?'",
        "'speaker_8': 'But also, you know, I'd like to see a point of order. I seconded both motions. Is that okay?'",
        "'speaker_4': 'Yes.'",
        "'speaker_8': 'Okay. Got it. So. So the other thing is, I know that like the planning commission gets they've got, what, seven commissioners on the planning commission. Right. And thereby planning district. No. Is there a way to ensure that there's or maybe some other commitment we can make without creating an 1111 person commission to ensure that we still have'",
        "'speaker_8': 'balance across the city? Because I can tell you, of the 100,000, 95,000 residents north of the Alamo, I'm sure there are multiple people who could, you know, represent on this commission very well. And I would want to make sure that we if seven if is nine, is this 11, that we do maintain a commitment to to ensuring'",
        "'speaker_8': 'that we have some diversity and is the standard, because as a new commission, I think is the first new commission we've put together as a new council. So my question, Mr. City Attorney, is, is there some other standard that we could use, some compromise standard to ensure that?'",
        "'speaker_8': 'I mean, is the planning districts something we can do?'",
        "'speaker_5': 'We could certainly look at various options and with the mayor's office on how the selections are brought forward to the council. But yes, there are other options.'",
        "'speaker_8': 'Because what I think I might want to do is substitute, substitute, I guess, to see if there's if there's like another way to if it's a nine person commission, maybe seven of them, by planning, planning district or ten, you know, and two citywide so that we can bring in expertize from maybe the colleges or different areas.'",
        "'speaker_8': 'So I guess that would be my my substitute to look at a different formula. So maybe by planning district with some at large just thrown in there as well.'",
        "'speaker_2': 'Mr.. Mr.. City Attorney Yeah. He, he can substitute items seconded, right? Is that correct.'",
        "'speaker_0': 'That yes. Okay.'",
        "'speaker_2': 'Okay. There's a substitute substitute. I want to just say a few things in Mr. Mr. Park and then and we'll go to the rest of the speakers.'",
        "'speaker_5': 'There's I'm sorry, there's a question by Councilmember Mongo on the action that the councilmember from the eighth District referred to. And yes, they would be comprised of Long Beach residents. The 11 all 11 would be required to be Long Beach residents of the former.'",
        "'speaker_2': 'And I think that one and to be I mean, to be frank, I think when the discussion came forward from from the city attorney, we wanted at the time with information, we had to make the best commission possible.'",
        "'speaker_2': 'We certainly there are some there are some folks in in the city right now that are doing incredible work with innovation, that aren't residents. And I think when you look at economic developed commission, I think we have two or three commissions, including the Web and others that encourage those that work in the city but not necessarily live'",
        "'speaker_2': 'in the city. And so the original motion also kind of limited that. So at this point, I think the commission makeup right now will allow for us to put together seven outstanding commissioners. And I think we'll do everything we can to ensure there is diversity of all types on the commission.'",
        "'speaker_2': 'But we want to we don't want to, I think, at this point want to keep that as innovative as possible. And I think as presented by the attorney, I think that that presents that. So those will be my comments.'",
        "'speaker_2': 'Councilmember Austin.'",
        "'speaker_1': 'Thank you. And so I'm not wedded to 11 I'm not wedded to a number. I'm not wedded to the makeup. What I am wedded to is the process and making sure that the integrity of the processes is clean and clear and that when we put forth when we make a decision as a council, that that that that's'",
        "'speaker_1': 'what the decision is. I've never. This is the first time that I've experienced a council decision. Being something different. So that said, I'm not stuck on anything, but I did have a couple of more questions. Did the city council receive a copy of the Fiscal Impact Analysis report that was prepared when this commission was was proposed?'",
        "'speaker_2': 'Mr. City attorney, I I'm not aware of yet.'",
        "'speaker_5': 'Yes. The city manager prepared the fiscal impact report on November six of 2013. That was presented on April 1st of 2014 to the EDF Committee. Item two.'",
        "'speaker_1': 'Okay. Well, when we adopted the budget, it was $100,000. I believe the mayor's recommendation for this commission and the the when reviewing the fiscal impact report identified the cost for staffing for the commission to be between 142 and $221,000 annually.'",
        "'speaker_1': 'Where are we going to make up the difference?'",
        "'speaker_5': 'Mayor. Council. Mayor Council members. When the mayor put forth this in his budget message, we produced a budget of $100,000 that we felt we could manage this commission on a pilot program for the first year and then sustain it in next fiscal year.'",
        "'speaker_1': 'Okay. And it also discusses how there's currently a citizen technology advisory committee that was created in 2004. The SeaTac advises technology services on identifying and applying new information and communication technology to improve service delivery to the city and the public.'",
        "'speaker_1': 'This commission is established. Would we be eliminated in eliminating the seat tag and is a separate council action required to do so?'",
        "'speaker_5': 'No, sir. We would not be eliminated in that.'",
        "'speaker_1': 'That Cabinet committee will will still advise technology services. And the Information and Technology Commission will act on this on a separate track and do something altogether different. Is that correct?'",
        "'speaker_5': 'I don't want to say all something altogether different because it will still be technology and innovation, but definitely two different tracks.'",
        "'speaker_2': 'Clarify. The Citizen's Commission to refer to Council member advises the Director of Technology civically when it comes to staff projects or staff initiatives at the department level.'",
        "'speaker_1': 'Solely in the Technology and Innovation Committee will advise the council.'",
        "'speaker_2': 'Like all commissions, it will be a body that brings forward council issues. We could think things could be asked of them to provide reports for us, but certainly there will be tasks that looking at ways to innovate, not just the confines of City Hall, but looking at technology innovations, city wide, like all commissions do.'",
        "'speaker_1': 'Well, I think it's worthwhile for us to move forward in this direction. Like I said, I'm looking forward to to consistency and integrity of the process in the future. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_7': 'Thank you. And I'm sorry, what was the substitute? Substitute, just so I can be clear on that. And did you get a second for that?'",
        "'speaker_8': 'Yes, I got to say. Okay.'",
        "'speaker_7': 'I just wanted to make but.'",
        "'speaker_8': 'But, you know, I cued up because, I mean, after I made my motion, the mayor made it said that he would make a commitment to ensure that we bring in different perspectives and we make sure there's geographically based as well.'",
        "'speaker_8': 'If we can do that, then I'm comfortable withdrawing my motion. My second, whatever. I mean, I'm on every every motion and I'm comfortable. I'm comfortable going back to the original motion as long as we have that verbal understanding.'",
        "'speaker_2': 'Absolutely. And absolutely. I think certainly support the original motion. And we would absolutely look like all commissions. And I think you're going to see in all commissions diversity of every type, especially geographically.'",
        "'speaker_8': 'All right. So to be clear, I'm withdrawing my substitute. Substitute.'",
        "'speaker_7': 'Okay.'",
        "'speaker_5': 'There, there. It has to be the second has to agree to the withdrawal of the substitute. Substitute it was in.'",
        "'speaker_1': 'I agree.'",
        "'speaker_5': 'Thank you. And now we have the substantive motion of Mr. Austin to send that back to the city attorney to prepare as presented by the council and approved by the council in September of 2013.'",
        "'speaker_1': 'That doesn't seem to be the support from a council to do so. So I will remove that, but I will maintain my position that the process should be reversed in the future.'",
        "'speaker_2': 'Okay, so now we're back to the original motion as presented by the City Attorney Ordinance. I see no other cues up any public comment on the item. See nonmembers, please cast your votes.'",
        "'speaker_6': 'Motion carries 80980.'",
        "'speaker_2': 'Next item.'"
    ]
}