{
    "Recommendation to receive supporting documentation into the record regarding the Tax Equity and Fiscal Responsibility Act (TEFRA) public hearing; and adopt resolution approving the issuance of revenue bonds by the California Municipal Finance Authority (CMFA), to benefit a partnership to be formed by Abode Communities and American Gold Star Manor, a non-profit corporation, in an amount not to exceed $60,000,000.  (District 7)": [
        "'speaker_0': 'Okay, thank you. We're doing a couple of items, and we're gonna go to our regular agenda. One, a couple items quickly out of order. Just left some folks here we do item 17. Real briefly. First, Madam Clerk, for an item 17.'",
        "'speaker_1': 'Item 17 report from Financial Management and Development Services recommendation to receive supporting documentation into the record regarding the Tax Equity and Fiscal Responsibility Act, a public hearing and adopt resolution approving the issuance of revenue bonds by the California Municipal Finance Authority in the amount not to exceed $60 million.'",
        "'speaker_1': 'District seven.'",
        "'speaker_0': 'Okay. There's a motion. Can I get a second? Okay. There's a motion and a second. Mr. West, you want to add to that?'",
        "'speaker_6': 'Yes. We have a quick staff report by our treasurer David Nakamoto, and Amy Bodak, our.'",
        "'speaker_8': 'Development services director. Thank you, sir. Honorable Mayor and members of the City Council before you is a recommendation to receive supporting documentation into the record regarding the temporary hearing and adopt a resolution approving the issuance of revenue bonds by CMB to benefit the Abode, Communities.'",
        "'speaker_2': 'And American.'",
        "'speaker_8': 'Gold Star Manor Partnership in an amount not to exceed $60 million. The project. Current current affordability covenants are expiring are and are at risk of reverting to market rates. CFM will issue tax exempt bonds to finance the acquisition and rehabilitation of the apartment building known as American Gold Star Manor.'",
        "'speaker_8': 'The intent of this acquisition is to preserve 337 affordable senior housing units for 55 years. There is no fiscal impact on the city associated with this action. The city has no financial obligation or liability associated with this financing.'",
        "'speaker_8': 'The project is expected to provide approximately 50 jobs during the rehabilitation. City action is requested on September 8th, 2015 to facilitate CMF forthcoming bond issuance. This concludes staff's report.'",
        "'speaker_0': 'Okay. Thank you. Is there any public comment on the item? Come forward.'",
        "'speaker_8': 'Very good. I'm not quite clear, obviously, if we can provide that type of housing for that number of citizens. That's great. But if we have no liability. Why are we even discussing this tonight? That that hasn't been explained.'",
        "'speaker_8': 'What's the city's role?'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Here we go. I live in Long Beach and run the manor. And this is a second step of our plan to do the renovation. The first one was getting all of the vouchers we need from HUD for all of our goals, for all of our veterans, all of the seniors.'",
        "'speaker_4': 'And this is the one you voted on not too long ago to have the housing authority certify all of that. That program is going 180 miles an hour. This is step two, which provides the funding then to do all of the renovation for $58 million.'",
        "'speaker_4': 'It will make the manor the safest, the greenest and certainly the most comfortable facility of its kind in all of Long Beach in a manner will truly become the jewel of Long Beach. Thank you for your support.'",
        "'speaker_0': 'Thank you. Any other public comment? One more.'",
        "'speaker_4': 'Thank you so much, Mr. Mayor. Members of the council, Gary Shelton at 240 Chestnut Avenue. I just wanted to remark that this is yet one more fabulous moment moving forward in the maintenance and and assurance of affordable housing in the city of Long Beach for senior citizens.'",
        "'speaker_4': 'I live in a senior citizen affordable housing project, and when these things come into that danger period of when the affordability is about to expire, oh my gosh, everybody begins to panic. And the fact that Goldstar Manor is stepping up and saying, let's do this, and the the city is saying and I believe to help Mr. Goodhew'",
        "'speaker_4': 'understand it, simply because this is within the city limits and the city council has to say, yes, we know this is happening. I think that's the extent of it, is how these bond issues, which is a tough road bond issues work.'",
        "'speaker_4': 'But in any regard, I just wanted to express that as a watchdog over affordable housing. I'm so glad to see this happening. And by the way, in case you're not sure, this is like the fourth time in the past 12 months or so that there has been a last minute saving of affordable housing toward 50 to 55'",
        "'speaker_4': 'years into the future. The affordable housing advocates in town couldn't be any happier. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'I just wanted to thank Gold Star Manor for hosting Councilmember your night. He wasn't available this evening. He's out. But thank you for all that you do to the community and and thank you for all your work.'",
        "'speaker_0': 'Did either the makers of the motion have any comments? Nope. Okay, great. Have a motion on the floor. Please cast your votes.'",
        "'speaker_4': 'It's not.'",
        "'speaker_0': 'Is there is there an issue or.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_4': 'I'm a yes, but.'",
        "'speaker_0': 'Yeah, it's coming in. I would say.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'There we go. The motion was Richardson. The second was Pryce. It's well we'll we'll fix on the record. On the record. What did the. Did it go through or. Yeah. Let's go and take a while. We're figuring this out.'",
        "'speaker_0': 'We're just going to go and take a vote. I was in favor of the motion. Say I. And you oppose any abstentions? The motion carries unanimously. So we're good there. Why don't we do my announcement? Then we'll go back to the agenda.'",
        "'speaker_0': 'Motion passes, it's up. Okay. So the announcements that we had was I want introduce our new h.r. Director for a second time. This time we're going to get it here. And I want to introduce and welcome alejandro vasquez who is here.'",
        "'speaker_0': 'Alex Vasquez, please step up here for a second. Just say hello. And I'm going to say a few things about her. As we all know, Debbie Mills, who's next to her, has done a great job. Let's give Debbie a big round of applause, first of all.'",
        "'speaker_0': 'And and Miss Vasquez is coming to us from the city of Los Angeles, where she was the assistant general manager in the personnel department. So she has worked in large scale personnel and H.R. environments. She is loves loves.'",
        "'speaker_0': 'Long Beach holds a master's degree in public policy from the University of Chicago, Bachelor of Arts degree in Social, Social Ecology from the University of California, Irvine. And she, I think, starts today or pretty or pretty soon. Is that that sound about right.'",
        "'speaker_0': 'And I know has a lot of experience in Long Beach as well. So thank you. Ms.. Vasquez, did you want to say anything to the council or. You don't have to. I'm putting you on the spot. Come forward and just say hi really quick.'",
        "'speaker_0': 'You have very big shoes to fill. And as you know, it's a it's a very big job.'",
        "'speaker_1': 'Yes. I'm just I want to just want to say I'm really happy to be here. I. Debbie's been great. She's been with me all day, making sure I have a great transition. And I'm looking forward to working with all of you as well as from the Human Resources Department.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you and welcome you as well. Want to go out and do now because there's a big group of them here. We're going to ask the presentation from Candice Taylor Sherwood and Tom Leary, which I know they pull the speakers card.'",
        "'speaker_0': 'And we've got a big group, so come on forward.'",
        "'speaker_1': 'Hello, everybody. My name is Candace Taylor Sherwood. And while I am a Long Beach City employee today, I'm here.'",
        "'speaker_5': 'As a resident of the.'",
        "'speaker_1': 'Third district. Suzy Pryce, we love you and a proud volunteer and a certified member of the Community Emergency Response Team.'",
        "'speaker_8': 'And hello, everybody. I think we're gonna have to put this away.'",
        "'speaker_6': 'Hello, everybody. I'm Tom Leary. I'm also a city employee, and I'm here as a volunteer to help the fire department with the CERT event.'",
        "'speaker_1': 'So in response of National Preparedness Month Ready Long Beach 2015 is an annual Community Preparedness Expo that promotes a whole community approach to emergency preparedness and readiness.'",
        "'speaker_8': 'Ready. Long Beach will educate.'",
        "'speaker_6': 'Demonstrate and promote current efforts and programs.'",
        "'speaker_4': 'Within the city of Long Beach that support, preparedness, response.'",
        "'speaker_6': 'Recovery and resiliency.'",
        "'speaker_1': 'During a large scale incident. The use of volunteers may be essential to provide support and response when local first responders are overwhelmed and may not readily be available.'"
    ],
    "Recommendation to receive and file a presentation on the management of the major power outages that began on July 15, 2015, and an overview of the Citys emergency preparedness plans and operations.  (Citywide)": [
        "'speaker_1': 'Report from Disaster Preparedness and Emergency Communications Recommendation to receive and file a presentation on the management of the major power outages and an overview of the city's emergency preparedness plans and operations citywide.'",
        "'speaker_0': 'Thank you. This came out of an item that I know Councilman Gonzales and Vice Mayor Lowenthal had coauthored. So I'm trying this over to Councilman Gonzales for some opening remarks.'",
        "'speaker_5': 'Yes. Thank you, Mayor. I first wanted to. There's a lot of people to thank, but I know we've heard this issue in different formats. But this is something I really wanted to bring forward to the council. A lot of my council colleagues, you know, didn't understand the magnitude of what had happened.'",
        "'speaker_5': 'And I think it's great to bring this at the council level for others to learn about this as well, both business owners, residents and alike. I want to thank personally our city management team who were highly communicative during the whole process.'",
        "'speaker_5': 'Reggie, Tom, Pat. It was it was really great working with you throughout because it was a constant flow of communication, which is what we always like our fire, our police teams, our cert, search and rescue, many volunteers and many residents who came together.'",
        "'speaker_5': 'All of that put together really assisted the situation and made it better before it got worse. And so although this was a smaller incident, in hindsight, I know that this is still a significant issue within our city, and it needs to be looked at certainly in different formats.'",
        "'speaker_5': 'And as we mentioned, there's a few there was a hearing that happened. There were a few meetings. Edison has been great at providing our our residents with information on claims and also information to some of our most vulnerable populations, like our senior residents and people who are disabled.'",
        "'speaker_5': 'And so I'll turn it over to Reggie Harrison. I know he has a great presentation for us, and it's very clear and concise and this is exactly what we would like. So thank you.'",
        "'speaker_6': 'So, Councilmember, before I give it over to Reggie again, I want to thank Councilwoman Leena Gonzalez, Vice Mayor Suzanna Lowenthal and Councilmember Roberto Duran, as well as Mayor Garcia to.'",
        "'speaker_4': 'Recommend that we do this item tonight and direct us to do this.'",
        "'speaker_6': 'I also want to point out that we have a couple of Edison vice presidents in the audience tonight. If you guys could raise your hand, Pete Dietrich. We have Paul Grego. We also have some government affairs representation. Representation.'",
        "'speaker_6': 'Robert Quintero. And we also have Ron Garcia. So we welcome you guys. And without further ado.'",
        "'speaker_4': 'I'm going to turn this over to Reggie Harrison, our director of Disaster Preparedness and Emergency Communication.'",
        "'speaker_9': 'Thank you. City Manager with Mayor, members of City Council. Thank you for this opportunity to provide an update on the city's response to the recent power outages, which occurred on July 15th and again on July 30th, the major power outages that occurred on those dates.'",
        "'speaker_9': 'This update is as much about the community's response to the power outage and the resiliency and camaraderie that they show it as it is about the city's determination and professionalism in responding to this power outage. I will also share with you some lessons learned along the way.'",
        "'speaker_9': 'You do have copies of the presentation available at your dais. The map above depicts the areas of the city affected by the power outage beginning on July 15th and again on July 30th. The area shaded in green was the affected area during the July 30th power outage.'",
        "'speaker_9': 'The area shaded in blue and green were affected by the July 15th power outage. So you can see that the July 15 power outage covered a much larger area. The area shaded in red is the perimeter of the network area or loop of the Southern California Edison Vault system.'",
        "'speaker_9': 'And the red circles indicate the July 15th via structures and the purple circles indicate the July 30th fire structures. So then on the afternoon of July 15th, the fire department responded to reports of smoke coming from underground utility vaults maintained by Southern California Edison.'",
        "'speaker_9': 'The votes were located on Third Street between Magnolia and Chestnut Avenue. The fire and smoke was so highly pressurized that it caused several manhole covers to dislodge and fly into the air. And thankfully, no one was injured by those flying manhole covers.'",
        "'speaker_9': 'Fire units suppressed the fire and supported Southern California Edison units as they attempted to identify the cause of the fire. The fires that occurred on that afternoon resulted in a power outage over the course of portions of the next four days.'",
        "'speaker_9': 'A subsequent wildfire triggered another power outage on July 30th. And together, those power outages extended over seven days. And at its height, we estimate that 70,000 residents and many businesses were left without power. The Edison outage had a significant impact on the lives of our residents, as well as significant disruption to our businesses and government operations.'",
        "'speaker_9': 'City Hall at one point was without power and had to close to the public for half a day. Residents, businesses and visitors who came to City Hall seeking services during a power outage experienced the loss of services during that time.'",
        "'speaker_9': 'The Metro Blue Line, one of the nation's highest, highest use light rail systems, could not run its entire route. Conventions at the Long Beach Arena were disrupted. The police headquarters building was forced on to emergency generations for several days and were unable to function at normal capacity.'",
        "'speaker_9': 'Many hours of wages were lost by employees at downtown restaurants and hotels as a result of the fire. As a result of the power outage. And since that time, we have had at least three additional instances of major power outages, including in communities near the traffic circle, the Washington and Wrigley neighborhood, and busy and Bixby nose and'",
        "'speaker_9': 'Los Cerritos neighborhoods, as well as we recognize additional fire power outages that have also occurred since those times. Within one hour of the reported fire, the Police, Fire and Public Works Department has activated their department operations centers or docks to manage the incident.'",
        "'speaker_9': 'We then immediately activated the city's emergency operations center, the EOC, to manage overall city responses and support the teams in the field. This level three activation of the EOC was the highest level of activation since 2004. Verizon Telephone Outage.'",
        "'speaker_9': 'Needless to say, numerous city departments played a critical role during the response period. The police department deployed additional patrols in the affected areas, often with their servers lights on to provide additional sense of safety to the darkened streets.'",
        "'speaker_9': 'The fire department reacted quickly to extinguish the vault fires, and over the course of the seven days conducted 44 elevator rescues from high rise and senior citizen buildings. Public Works Department added a 250 trash receptacles in the affected area to collect food waste that had to be disposed of.'",
        "'speaker_9': 'They also installed generators at 31 intersections that were without power and deployed ten digital message boards to provide direction and information to the public. The city's PIOs from various departments did a tremendous job providing information to the public, including conducting for press conferences, with the mayor, issuing seven press releases in English and Spanish and numerous postings on'",
        "'speaker_9': 'social media sites. The PIOs also established information numbers in Spanish and Kashmir, where the public could receive information regarding services. And we have since memorialized those numbers so that we can use them in the future. Finally, our PIOs distributed 2500 public safety information fliers in English and in Spanish in the affected area.'",
        "'speaker_9': 'I would also like to recognize the heroic efforts of our police and firefighters in response to a two alarm fire on Chestnut and Chestnut Avenue. Two police officers who were patrolling the area were first on the scene and took critical actions to remove two victims of the fire from the building, effectively saving their lives.'",
        "'speaker_9': 'Fire units were quickly on the scene to extinguish the fire. Over 200 staff worked in the EOC or department doses over the course of the seven days, many working back to back 12 hour shifts. The picture above depicts an incident action plan.'",
        "'speaker_9': 'This is a plan that we put together on a daily basis so that staff coming on shift would know what the priorities are for that day. And I brought along copies as well of all of the documents that we produced in the EOC that helped to guide our way around these seven days, the major incidents.'",
        "'speaker_9': 'The city's Parks, Recreation and Marine Department, along with the Health Department, are open Cesar Chavez Park as a 24 hour shelter and food distribution point. Over 2000 residents visited the shelter with 15 of those individuals choosing to spend the night there.'",
        "'speaker_9': 'They distributed over 8000 bottles of water, 2100 meals were served, and 500 flashlights and ice bags were distributed to those affected by the power outage. Third, as you've already acknowledged at Long Beach, search and rescue and the American Red Cross played an essential role in checking on the well-being of our community's most vulnerable members.'",
        "'speaker_9': 'We saw an amazing outpouring of support from our community and business partners who who provided much of the food and water distributed at the shelter and sites. MOLINA Health Care opened its own distribution center on Pacific Avenue to offer medical services, meals and critical supplies to those in need.'",
        "'speaker_9': 'Our biggest round of applause and thanks, however, goes to those individuals and residents directly affected by the power outage. The camaraderie and respect their neighbors bestowed upon each other was incredibly inspiring. We saw residents tending to the needs of each other, barbecuing together to ensure everyone has something to eat and eliminate and to limit food spoilage.'",
        "'speaker_9': 'We are really happy to announce that there were no spikes in crime during this period and no major traffic accidents. Long Beach residents and the businesses and nonprofit organizations demonstrated an outpouring of support during this incident, demonstrating the true strength of the Long Beach community.'",
        "'speaker_9': 'Technology was widely used throughout the power outage within minutes of the outage. Within hours, rather, of the power outage. Staff prepared a telephone voice message for mass notification to the affected area during an emergency. Current laws allow us to access land line phone numbers in the white pages and business numbers listed in the Yellow Pages.'",
        "'speaker_9': 'However, we found that this system did not work well for us. Most cordless phones require electricity, which was an issue. Most residents have opted for cell phones as opposed to landlines in the current city, system for notification is outdated.'",
        "'speaker_9': 'Fortunately, the city is in the final stages of the procurement of a new mass notification system called Blackboard Connect. This is. This is the same system used by Orange County and locally by the California State University system and Long Beach City College.'",
        "'speaker_9': 'Through this system, we will be able to send a voice mail, a voice call, email or text message to every resident in the city within a one hour period. Once the new system comes online, we will work with the Mayor and Council on a robust public outreach program to encourage residents to sign up with their cell phone'",
        "'speaker_9': 'numbers and email address and texting information to increased message delivery options. And finally, we use images from the Long Beach Common Operating picture, Long Beach copters operated by our police department to provide access to cameras in the affected areas to assist staff in the EOC and decision making.'",
        "'speaker_9': 'And we've already talked about the importance of social media. There are many lessons learned in working with Edison on such a large and complex incident. And it has Edison hat and it has. Edison has noted this is the first major outage in Long Beach since the 1950s.'",
        "'speaker_9': 'Edison did assigned its emergency response team to work in the city's EOC to provide information to our response team. However, the initially Edison team lacked the subject matter experts who could give us the most accurate information. This situation was quickly resolved.'",
        "'speaker_9': 'We found that Edison did not use commonly understood phrases. Case in point Edison's use of the term number of a number of customers accounts, which we found did not equate to the number of residents impacted, which, of course, was most important to city staff.'",
        "'speaker_9': 'For a seat for Southern California Edison. A customer's immediate is a metered account, which could be a one person household or a 30 unit apartment complex. As time went on, the flow of information and the use of technology and the overall working relationship with Edison was much improved and very productive, especially during the second power outage.'",
        "'speaker_9': 'Many of the lessons learned during this event has resulted in Edison changing their approach to communicate to emergency communications based on the models that the City of Long Beach has demonstrated and how it communicates with residents during an event.'",
        "'speaker_9': 'Many of the claims filed by residents to be reimbursed by Edison for lost food have already been paid. Edison has already paid many residents $100 for inconveniences caused by the power outage, and we thank them for their cooperation.'",
        "'speaker_9': 'Edison field staff worked around the clock to restore power as quickly as possible. Nonetheless, the loss of power over such a prolonged period of time is of great concern to us. Therefore, at the request of the mayor, the California Public Utilities Commission was asked to become involved.'",
        "'speaker_9': 'And just last week, the PUC ordered Edison to comply with seven directives, including to inspect transformers and underground electrical equipment and the underground ventilation system. Edison must also confirm that manhole covers are properly tethered to reduce public safety risks in the event of future underground explosions.'",
        "'speaker_9': 'The Public Utilities Commission has requested an Edison report back within 30 days on their progress in these areas. In March of this year, City Council approved the updated hazard mitigation plan. The current plan evaluates in depth seven hazards that pose significant threats to Long Beach.'",
        "'speaker_9': 'The plan also identifies over 250 mitigation measures to lessen the impacts of those hazards of those hazards as depicted in the slide before you. The most probable hazard for Long Beach is a major earthquake. However, as we have all witnessed, the loss of electrical power for a prolonged period creates a significant disruption to the quality of life'",
        "'speaker_9': 'of our residents and can have life threatening consequences for some of our most vulnerable members of our community, such as the elderly and those with with mobility impairments. The next update to the House's mitigation plan will include a more robust section on mitigation measures to lessen the impacts of major power outages.'",
        "'speaker_9': 'Also in March of this year, we provided the mayor and city councilor with a memo updating the roles of the council and mayor during a disaster which is included as an attachment to your agenda packet. The role of the Mayor and the City Council is extremely important to ensure the continuity of government during emergencies or disasters.'",
        "'speaker_9': 'You play a significant role in ensuring the protection of persons and properties in the event of a disaster. The approval of the previously mentioned Hazards Mitigation Plan is a case in point. The city's municipal code describes the role of the mayor and council during the disaster, including the responsibility of the mayor as a primary spokesperson for the'",
        "'speaker_9': 'city. Council members have a unique understanding of the needs of their communities at all times, and we rely on council members to keep us informed of any unmet needs of their residents during a disaster. During a disaster, staff will set up a communications protocol to keep council members informed of response and planning efforts and gather input from'",
        "'speaker_9': 'council members on community needs. We also rely on council members and their staff to communicate with residents and businesses in their districts, passing on information from the city's public information office to ensure that we are reaching as many people as possible through social media, flier distribution and personal contact.'",
        "'speaker_9': 'The Mayor and City Council also must ratify any disaster proclamation made during and during a major disaster and approve any special rules such as a curfew that might be put in place and will cover more on disaster preparedness.'",
        "'speaker_9': 'During the Council and the Council responsibility. During the upcoming retreat. There are many training opportunities available to the legislative staff. Many of whom may be many of whom may be new to working in municipal government. In fact, many of the recommended training modules are available to take online.'",
        "'speaker_9': 'These online training programs provide insight into the protocols required to be used by staff at the EOC level, including the National Incident Management System and Incident Command Structure. By having an understanding of these systems and the terms of use, the legislative staff will be better able to convey information to their residents in terms of staff and public'",
        "'speaker_9': 'safety actions. Also, we commend many of the legislative staff who have already taken it upon themselves to learn basic emergency first aid procedures through CERT or the Red Cross. This puts them in a position to provide additional resources to the community.'",
        "'speaker_9': 'The Department of Disaster Preparedness, in partnership with certain American Red Cross, provide outreach to the community in many ways to offer resources and information on disaster preparedness. On a regular basis, we provide training to our community partners, including the Red Cross.'",
        "'speaker_9': 'Long Beach Transit. Long Beach Unified School District. Cal State. Long Beach Lobby. City College. And the faith based community. Most recently, on August 27th, we held a training session at the EOC for neighborhood leaders and residents who were directly affected by the power outage.'",
        "'speaker_9': 'You've already heard much from the CERT representatives on the upcoming really Long Beach event, which is a citywide resource that provides that comprehensive deadline day long review of resources that are available to residents. Additionally, staff from the Department of Disaster Preparedness is available to conduct training sessions at your request to neighborhood associations and nonprofit organizations in your'",
        "'speaker_9': 'districts. So in closing, Mayor and members of the City Council, we would like to thank you again for this opportunity to provide an overview on the city's management of the recent power outages and the lessons learned and some of the emergency preparedness protocols that we have in place.'",
        "'speaker_9': 'This concludes staff presentation. I think basically all of the department heads from the departments that had an active role in the response were available to assist in answering questions. So we thank you for your time.'",
        "'speaker_0': 'Thank you very much. Thank you very much. And I want to also just think, you know, Mr. Harrison, I think he did a great job through these last few months, but also generally just organizing this new department. This is a newer department that the city has.'",
        "'speaker_0': 'And so I want to thank him for all his work and his team's work as well. Let me turn this over to Vice Mayor Lowenthal, who had a second on the motion. Or Councilman Gonzales, did you want to continue?'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'I think we're going to ask probably the same things. But thank you very much, Reggie. Appreciate the presentation. That's exactly what the mission of this agenda item was, along with Vice Mayor Lowenthal and Councilmember Muranga. And our mayor was to get it clear and concise presentation on the events that happened and then our next steps.'",
        "'speaker_5': 'And I'm glad to hear that we will have a more efficient and effective notification system, even for those that do not have computers or maybe technology that is readily available to them and all of that. So I really appreciate that.'",
        "'speaker_5': 'A quick question. I know some of this this information I don't see on our website, our emergency preparedness website. So what are are we planning to change that a bit? Because I notice it's there's no mention of of any of the power outage information.'",
        "'speaker_9': 'I think we're in the process right now of updating some information on the website that gives tips for residents in dealing with power outages. Some of the lessons learned from this most recent outage. We will put those up there and some some words of caution as well in terms of handling candles and those kinds of things that'",
        "'speaker_9': 'residents might want to use when they don't have power. We do have the updated hazardous mitigation plan on our website and we'd be happy council member to work with your office to identify other things that you've identified that we should have as well.'",
        "'speaker_5': 'They're great. Thank you. And I understand I have the memo here from the PUC, two Edison, seven points. It seems like that need to be addressed and it seems like that would be in within 30 days. Is that correct?'",
        "'speaker_9': 'That was a request from the PUC to Edison that they report back within 30 days.'",
        "'speaker_5': 'And that's 30 days as of September 1st. Correct. So it would include the tethering of the manholes and inspection of the underground facilities and the inspection on the lead conductors and all of that. So just want to make sure we're clear on that.'",
        "'speaker_5': 'Okay, great. And I think that is about it. I just wanted to thank you again for your attention to this, and I appreciate it very much.'",
        "'speaker_0': 'Thank you very much. Vice Mayor. Low info.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Just as a follow up, initially when we spoke with Edison, they talked about conducting a system wide test through thermal testing. I think that's what they indicated. Do we have any specific results from that?'",
        "'speaker_3': 'Because after they conducted that, we had at least two, if not more bolt fires that were similar to the original ones.'",
        "'speaker_9': 'We are understanding of the way in which Edison and the way in which the system is designed and set up is that when we experienced the initial power outage, one of the protocols for Edison and trying to determine how to bring the system back up was that they needed to bring the system down, which resulted in larger'",
        "'speaker_9': 'areas that were previously unaffected by the blackout, a power outage that now they experienced power outages. So will work with Edison to be able to bring back to your council member and vice mayor a more in-depth explanation as to what the results of some of those investigations have been.'",
        "'speaker_3': 'Do you have a sense of when you can do that? Mr. Marco.'",
        "'speaker_9': 'So there sorry an representatives in saying that they'll have it by the end of September for us if not sooner.'",
        "'speaker_3': 'So I think we Raisa and Councilwoman Gonzales and I are aligned in this when and certainly all the investigations need to be conducted and we're not rushing anything. But when we publicly well, maybe not publicly, but at least with this council, we had discussed that they took a major step to bring in I want to say it'",
        "'speaker_3': 'was 50 teams of two individuals each to investigate through a particular type of testing what was going on in the rest of the system and not hearing anything after which and then experiencing several other similar incidents. I think it leaves that gap because on the one hand, we've left our residents and customers feeling as though this intense'",
        "'speaker_3': 'review and investigation and research is going on. But then we were still having the same problem. So something has to be said in that gap. It doesn't have to be specifically we've identified these as causes. But I think that in the absence of information between this very forthright effort to conduct research and still experiencing similar problems, therein'",
        "'speaker_3': 'lies the challenge for us. And we as a city are very open with our residents and our constituents and our stakeholders. Even if the news isn't good news, we need to say something. There is a gap. We did leave people feeling as though Edison has come out here ferociously to investigate what's going on because it is so'",
        "'speaker_3': 'important and I believe it's important to them. But then we had similar incidents and said nothing. That's my concern.'",
        "'speaker_9': 'I understand. And I see the Edison report nodding their head. They understand as well. And so they'll be providing us back with some information.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. And, you know, I just want to say thanks to the entire city family for such a great response. I, I literally when it began happening, I think I was visiting Councilmember Gonzalez's state of the district.'",
        "'speaker_2': 'And I saw our sister city manager, Tom Modica, outside on the cell phone making things happen. From public safety to city manager, city staff. It was a great response. And I particularly was inspired by that, to see the entire city and and the greater Long Beach area really reach out and try to support this, you know, our'",
        "'speaker_2': 'community. And I think that the social media outreach and strategy that the city had was really, really good. I saw the mayor, I saw the city council sharing updates. I think that was a great model, an example for how other city should do it.'",
        "'speaker_2': 'And it really raised the awareness to how we should respond to these things by raising awareness. It kind of opens us up to ask us, ask questions like, Hey, ah, what other areas of town are vulnerable to something like this?'",
        "'speaker_2': 'I guess my question would be, you know, as a large city, Mr. Harrison, you know, have we looked into localized emergency plans? And is there any way that we could say, hey, this was localized in one area of town, but then it happened again and in Bixby, no.'",
        "'speaker_2': 'So is there any way to foresee what areas are most susceptible to this?'",
        "'speaker_9': 'I'm not certain if we can forecast what other areas might be impacted next. Certainly since these two incidents, we have seen other incidents of power outage, as we often do during the summer, not to the extent of what we experienced on July the 15th and July the 30th.'",
        "'speaker_9': 'I think that's the number where we would like to offer, is those opportunities to get into your districts, to get in and work with your neighborhood association so that we can provide the training, some of the tips that we learned, some of the lessons we learned from dealing with this incident and overall disaster preparedness to just put'",
        "'speaker_9': 'residents in a better place to deal with not only this kind of a disaster, but a major emergency, but any other that might be forthcoming as well. We know that there's a really, really wet season is coming soon.'",
        "'speaker_9': 'And so some of the things that we discovered during this incident will also apply to that season as well. And so we look to opportunities to work with you within your district.'",
        "'speaker_2': 'Great. Because I think, you know, now we're on notice that these things and a lot of times we hear about emergencies and we never think that it can happen in our communities and it can. And so I think we should, you know, continue to do the things we're doing, but really place a greater focus on our local'",
        "'speaker_2': 'neighborhoods. And then and then how is our Spanish in our language access, outreach and that area where we utilize our language access plan or any of the tools that we have.'",
        "'speaker_9': 'We did. We did council member. We set up an information line in both Spanish and Crimea where residents could call in and receive information. And those distinct languages, as I mentioned as well, our public information staff distributed 2500 fliers within that area in both Spanish and English as well.'",
        "'speaker_9': 'Many of the press releases that were done in English were also done in Spanish for certain, not certain about come here if we were able to respond to quickly on the press releases. But we did distribute those in multiple languages.'",
        "'speaker_2': 'Great. And then and then I guess my final question is, I know that Edison's been updating some towers and they set up a pretty large temporary facility in the north south right away. And it's been there a couple of years.'",
        "'speaker_2': 'Is there is there is this is that the work that's taking place related to this somehow?'",
        "'speaker_9': 'So the Edison reps are saying that they're not they're not aware that it's related to this, but they'll take a look at that and to respond back with some of the other answers as well.'",
        "'speaker_2': 'Okay, great. Well, I would just offer then if it would be good as you look into that, if we can just have some a better understanding of how long that temporary facility will be, you know, will be in place.'",
        "'speaker_2': 'We thought it would be like a six month, but I think it's going to like two, three years. So it will be just good to better understand that and any other sort of smaller responsive request that the city has made with Edison about this right away.'",
        "'speaker_2': 'And thank you so much for for being here tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'Do we have a a phone tree that goes to council members when outages occur? Because on Saturday at 630 in the morning when my phone started ringing, it was residents asking me how long the outage was going to last.'",
        "'speaker_1': 'And so I was curious about that.'",
        "'speaker_9': 'We generally, when we have those kinds of incidents that occur, we sent out a watch commanders notification that goes to mayors and remember the city council so that you receive that notification from us. We can look into that if you did not receive that notification, but that's a normal protocol.'",
        "'speaker_1': 'I think I received one closer to 930, but I think that at 630 in the morning and I think part of the challenge is different districts have different age demographics. And so one of the things that was easy for me to do is use the Southern California Edison app and be able to see when the outage was'",
        "'speaker_1': 'going to be anticipated to be repaired and then be able to tell two or three neighbors who can quickly spread the word through their either phone tree or neighbors standing in the front yard together, as we all know, happens when the power comes out.'",
        "'speaker_1': 'But I think that of outages over a certain size, I'm not sure an email is sufficient. We had 832 neighbors without power when they all woke up in the morning.'",
        "'speaker_9': 'You know, and that's a that's a really good point, Councilmember. And that goes back to that mass notification system that I spoke of earlier. We'll be in a much better position to target our messages and residents will be able to prioritize the type of response that they would like to receive, whether it's at their landline or at'",
        "'speaker_9': 'their cell phone, text message or an email. And so we'll be able to offer residents options in terms of how they receive information from us.'",
        "'speaker_1': 'So I could be mistaken, but I'm pretty sure that I'm on that notification list. And so I didn't receive a notification probably because I wasn't in the area of the outage, which is surprising because my area had the most outages of the whole district in the last three years.'",
        "'speaker_1': 'But in this case, I wasn't. So perhaps councilmembers could be on the outage list for every single community in the district so that we're aware and we can help provide that feedback for neighbors who aren't on it. Thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Think I'm going to make a few comments before I turn it back over to Councilman Gonzales. I want to just start by saying that I think the certainly the whole leadership of the city is just very appreciative of the incredible work that happened from the community, from our police and fire operators, from everyone that was working on'",
        "'speaker_0': 'the outage. I mean, I even talked to some of the workers in some of the vaults, some of the Edison Worker guys that were there all day and all night, and they were working very hard and we appreciate all of their work on getting the lights back on as quickly as possible.'",
        "'speaker_0': 'But I'm asking you to just to repeat some of what I've said up to this point, and it's, you know, no surprise to Edison mentioned it to their president as well as their leadership team. I personally do not have the confidence in our electrical grid and our system in Long Beach.'",
        "'speaker_0': 'And I think that having having had now. A major outage, a second pretty significant incident and two others just in the last few weeks, month or so. I mean, this hasn't this hasn't happened in the city of Long Beach with this much.'",
        "'speaker_0': 'It was that many events, one after another. And so it is concerning. The community should be concerned about it. Our staff is concerned about it. And we're working very closely with both, obviously, Edison as well as the PUC, to really get down to the bottom of what happened and how we can stop this from occurring in the'",
        "'speaker_0': 'future because. But believe me and and I've been pretty tough on Edison, but they are as interested in solving and trying to get to the bottom of this as we are as well. But where we are today is in a I think in a in a place where we need to we need to regain our confidence.'",
        "'speaker_0': 'We don't we our confidence is broken, as should as is the communities. And it needs to be repaired along with a sense of of stronger partnership. And I think what we're looking for from the from the PUC in particular.'",
        "'speaker_0': 'And while I know there's going to be an internal investigation from Edison, I think the PUC is going to give clarity, hopefully, and some very clear recommendations, some of which they have already made to to the city, to Edison, to the council as a body.'",
        "'speaker_0': 'And we'll be able to make some some decisions. Edison, I assume, will be able to make and they continue to make investments in their network. And we'll have an idea of what exactly went wrong and why we're having these additional occurrences, because the key question is, is it you know, it appears to me that we have a'",
        "'speaker_0': 'very old system that has not been maintained appropriately and it needs to be invested in. And so that's that's kind of where I see the situation today. And we'll we'll find out more as we as we move forward.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_5': 'Yes. I just wanted to briefly mentioned. I know we hadn't. I know it will probably come back anyway, but I wanted to explicitly ask and request the report to come back from after the investigation in the U.S. is done to come back to council so we can review that further.'",
        "'speaker_5': 'Do we know at this time how many city resources were expended?'",
        "'speaker_9': 'We know that just alone at the EOC is in the city's dioceses, that we had approximately 200 staff that responded to those two centers. That excludes the men and women that responded at the scene with police and fire.'",
        "'speaker_9': 'So those incident managers is not a part of that number. We've got some numbers available in terms of the costs, estimates for food and ice and those kinds of things that we that we provided. And we're having conversations with Edison about the appropriateness of reimbursement for some of those items.'",
        "'speaker_5': 'Okay, great. And can that once we get a full. Cost estimate cannot be included as well in the report, please, when it comes back. And then I would also just like to encourage, you know, we talked about training, but just encourage a bit more from our city management as well as from your shop, Reggie.'",
        "'speaker_5': 'A better plan to engage and encourage our own city employees to take up the training. I think it's really important. The only trained member of the council is Councilmember Richardson, but it'd be great if we had information. Maybe there was a day for us to do that, but I think that would be really appropriate, especially now.'",
        "'speaker_5': 'And then lastly, I failed to mention, but I want to thank our POW Kari Jarrod who is there with us, our public works, our health department, as well as all of the other departments that were so integral in this in this whole process.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_0': 'Thank you, Mr. West or Mr. Modica. And I know that the I'm sure the Council has read some of the reports in the media, but do you want to just briefly touch on the, uh, the latest? And I'm not sure if or Mr. Harrison just the latest letter from the PUC that had given Edison a deadline of'",
        "'speaker_0': '30 days to essentially comply with a variety of requests.'",
        "'speaker_9': 'And say, I have the I have the letter here. Let me just see if I can find it quickly in there. So I do have the letter from the I do have the letter here from the Public Utilities Commission dated September one, 2015.'",
        "'speaker_9': 'There are seven areas that you want to just highlight briefly those.'",
        "'speaker_0': 'Yeah. If you can just briefly highlight the areas on the on the letter, because I know it came out right before the the Labor Day holiday. So I just want to be sure it's not not last.'",
        "'speaker_9': 'Set of letters dated September one, 2015 and, uh, seven areas that they have identified. One to perform a detailed inspection on all underground facilities that are part of the secondary network system that we talked about on Long Beach to verify compliance with the general order.'",
        "'speaker_9': 'Second is to perform a detailed inspection on all on all lead conductors and splices in the city of Long Beach to verify the safe conditions of the conductors and splices. Third is to perform a detailed inspection on every protective device such as relays, breakers, fuzes, etc. connected to any of the primary feeder circuits.'",
        "'speaker_9': 'Fourth is to confirm the ventilation system is properly working and all underground vaults in Long Beach. Fourth is to confirm is to confirm that the cover of each underground vault in Long Beach is properly tethered and secured to the ground to minimize potential impacts.'",
        "'speaker_9': 'Number six is to confirm that all transformers serving the Long Beach area are properly rated to meet customer demand, particularly during the time of peak demand. And seventh is to inspect and confirm the safe and reliable operations of the circuits supplying power to the Port of Long Beach in any spot, networks serving large customers in the city'",
        "'speaker_9': 'of Long Beach. And as in this letter signed by the Director of Safety and Enforcement Division for the PSC.'",
        "'speaker_0': 'Letter also ask that all of those items would would happen in the next 30 days. So essentially by the end of September, correct? Correct. Okay. Thank you. I'm going to unless there's any other current council comment, I would open it up for public comment.'",
        "'speaker_0': 'Is there any public comment on the item? Please come forward. Yes. Please come forward to the mike. Please go ahead.'",
        "'speaker_5': 'Hello. My name is Jovana Ferraro, owner of Groundwork Fitness. Address should be on file. I am a resident in District one as well as a small business owner. I own a gym and the purpose for me this evening is really to just reiterate a lot of what was said and has been said on.'",
        "'speaker_5': 'The big picture with with the power outages is. Yes, it it continued on. The first time it happened. Three and a half days of no power for me as a small business owner was huge, huge impact financially. And then as it occurred thereafter, as soon as clients hear that there's a power outage somewhere else, they don't come'",
        "'speaker_5': 'to my gym because simply, oh, I already know it's going to probably be out there. So it's not just a matter of when it was actually out. The power outage was happening and occurring at my gym. It's the times it happened to Bixby and all these other spots.'",
        "'speaker_5': 'It kept clients home because they had heard, you know, social media travels fast. So I'm losing business not just when those three and a half days of no power occurred downtown. I'm losing business those other days because. Word gets out, oh, I'm not even going to bother leaving my house.'",
        "'speaker_5': 'And so I just want to reiterate that it really is extremely important that indeed there's communication. Please. I love everything all of you are saying up here about just letting us know what's going on. And if there's a flicker of my lights right now at my gym, I freak out because it really is.'",
        "'speaker_5': 'It's a financial thing. And I just I can't afford another three days, 2 hours, 30 minutes with no power. It will keep my clients from coming in because they're going to think, Oh, I'm not going to go downtown.'",
        "'speaker_5': 'It's going to be a mess like it was last time. So that that's scary. So a flicker of light scares me, and I shouldn't be scared like that as a business owner downtown in. So I just want to be make that heard as well as just real quick, I don't know if you know as old as Long'",
        "'speaker_5': 'Beach is, so are the plumbing issues and so are something called sub pumps. My gym, there's no restroom available. When power goes out, that's just not going to occur. And that's one thing I didn't learn until that happened.'",
        "'speaker_5': 'Even though we would get through during the daytime hours, you know, God forbid someone had to use the restroom. We were out running up and down and trying to find one, which means porta potties are those are I mean, there is no one around us.'",
        "'speaker_5': 'A lot of these buildings are old and they have sub pumps. If there's no power to the sub pump, you're not using a restroom. And that's just that was something that needed I would wanted to make sure was heard as well even during the daytime hours as a small business owner, again, I think it's important that communication'",
        "'speaker_5': 'occurs. So I love the fact that you guys are asking for feedback and where do we go from here? And I appreciate that. So thank you. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please, by actually advisory law, but I wanted to say something.'",
        "'speaker_3': 'Just briefly, Gio. I want to assure you that our team is taking notes because we haven't thought of everything. I mean, I think our staff did a great job of taking notes about the things we learned out in the field.'",
        "'speaker_3': 'I personally did not even think about this, and I'm sure they have, but I just I'm glad you came forward. And maybe what this reminds us is to put out a call to our folks just through social media.'",
        "'speaker_3': 'They're very particular they're very particular circumstances that we may not have thought of, but that affect other people. We should know that, and we need to hear that from our residents. So I don't think porta potties are too much to ask for.'",
        "'speaker_3': 'It's a public health issue. I'm sure our doctor at DHS will say that again.'",
        "'speaker_5': 'It's something I didn't even think about, you know, until it occurred. And then all of a sudden we're down and out and it's like, wow, three and a half days without that, even for myself, where am I going to go?'",
        "'speaker_5': 'Right. So that's just something to add to it. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Thanks again, Mr. Mayor. Gary Shelton. I had the great opportunity. I was privileged to be asked to be the representative of the public, the residents at the town hall meeting that was called by the state assembly and senators.'",
        "'speaker_4': 'And I did have a chance to speak with them and I appreciate that opportunity. But here I am now in front of you folks. And I just had a couple or three things to point out, and I really, really appreciate your report.'",
        "'speaker_4': 'Director Harrison full of great information. I wanted to see if we could expand on a couple of things that Reggie mentioned. I think it was on I don't know, I would call it page three, the technology and outreach and the SC communication page of the PowerPoint that there there did seem to be a couple of different channels'",
        "'speaker_4': 'of communication or levels of communication. There was sort of an internal type of communication that that Edison seemed to seem to hold close to. The to the vest that I learned at the town hall meeting wasn't really actually even shared at the EOC during the early days of this outage.'",
        "'speaker_4': 'And and and then out here in the public, even though we were many of us right in the very middle of it, we didn't have any inside information ourselves as to what was going on. Part of the reason for that was that we were deprived of high tech solutions to communication.'",
        "'speaker_4': 'We couldn't I was getting pixel, but that was about the only thing and it was basically telling what the street closures were on ocean or on shoreline drive. Low tech would have helped in many ways. I don't know exactly how many different methods we would have of that.'",
        "'speaker_4': 'One might be police cars telling us over their loudspeakers that they would go up and down the streets. This is what's going on. There might be some script that they could have had as they went up and down through the neighborhood, which we didn't see, see the police all that much.'",
        "'speaker_4': 'But anyway, low tech communication is something that would be really, really need. I wanted to express too that we all. We're aware very early on that we were in this in the middle of a crucible of learning. At the time, we had an option.'",
        "'speaker_4': 'We had an opportunity to go through an event that didn't have tilting buildings akimbo. It didn't have injuries. It didn't have fear, such as some other major incident might have. This was a very low level incident that got a high level response.'",
        "'speaker_4': 'And so I think we've had an opportunity to learn a lot without a whole lot of damage being suffered in the meantime. I wanted to then add one more thing to the offer by Edison to send $100 credits or in the case of folks like us at Plymouth West to our on shared meters and other senior citizens'",
        "'speaker_4': '. A $100 check has actually had the result of infusing tens of thousands of dollars of ready cash into the community because those checks are arriving this week and they're being spent this week. So that's a benefit that I have to thank Edison for.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good afternoon. My name is Jim Denham with the First District, one more city heritage neighborhood. Well, my area itself wasn't affected. On the 15th, we did get the call through social media for help. The Pacific Tower building, 17 floors, no power's seniors.'",
        "'speaker_8': 'Many of them could not have access to get down food, going up water. Jill, who left earlier, she was the first way that went in there. If you can imagine, you've got water, 8 a gallon, two Home Depot buckets.'",
        "'speaker_8': 'You've got 40 in each hand going up 17 flights. It was out. It was absolutely. We've very quickly realized that we are not prepared for this. Cert was there in the beginning. But then they also had a lead to go to another senior center.'",
        "'speaker_8': 'Melina's jumped in. Councilman Gonzalez, thank you so much. I mean, your office was fantastic. Let us know where we need to be, you know, and how we can assist bags of ice. I mean, it was just literally Florida time doing the daisy chain up and down, up and down and getting this stuff handled.'",
        "'speaker_8': 'And folks that were on the floors, the seniors are knocking on doors. They are so relieved. And then one thing you don't realize is that in these huge buildings, there's no airflow. So all of a sudden now you're opening up doors, opening up stairwells to allow that draft.'",
        "'speaker_8': 'I know probably the fire department's cringing because that if it were to happen, now you've got a huge type of inferno. But, you know, that was something we took a chance on. And a lot of the residents appreciated that.'",
        "'speaker_8': 'One of the things since I do live in one of the oldest historic districts in Long Beach, please, if we can figure out a way not to have the candles, I think it was on Chestnut, a home caught on fire because of a candle knocking over, maybe LED lighting something that will illuminate a little bit of light'",
        "'speaker_8': 'without have the danger of flame. But that's it. Thank you so much. Appreciate it.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_7': 'Good evening. Mayor and Council, thank you so much for this presentation. It was very, very important to our people. I think that we are so used to using social media and having all those advantages that we forget that a lot of the people in our neighborhoods either do not have the capacity or are not familiar enough.'",
        "'speaker_7': 'So I was lucky enough that my house had electricity the whole time. But I know that even with that, we didn't really have a lot of information. I know you know that and that that's one of the big things that needs to be worked on.'",
        "'speaker_7': 'One of the things that I wanted to mention that has not been mentioned is I live right off the the Sixth Street offramp. And I think that there needs to be coordination with highway patrol or somebody to stop people from coming off the off ramps with something like this because they came blasting through and there were no'",
        "'speaker_7': 'lights. So I'm really astounded that nobody got in an accident because that's a really they come off fast anyway, but they come off really fast with no lights right there at Sixth and Daisy. So that's something I think that needs to be looked at also.'",
        "'speaker_7': 'And thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_5': 'My name is Lana Noble. I live downtown in the Walker building where my husband and I and the bank, our own, are our loft. And I'm here. I had also with Gary said I got to speak as a member of the public at the hearing and would encourage those of you that haven't had a chance to wade'",
        "'speaker_5': 'through some of that testimony to do so, because it was incredibly dramatic and sobering how much this impacted residents and businesses. People who live paycheck to paycheck didn't get a paycheck because of those outages and are our neighbors.'",
        "'speaker_5': 'What I want to talk about and I've got copies of this that I will share with the clerk, perhaps I think there's enough for the council is we are not talking about a natural hazard here. It's great that we responded as we did in Long Beach.'",
        "'speaker_5': 'It impresses me. It makes me proud to be a part of this community and that we have the standards that we do. But this was not a natural hazard. Edison has a monopoly. They are a private corporation. They have shareholders.'",
        "'speaker_5': 'They make money. And they are supposed to, according to the PUC, provide us with reliable, safe and affordable or reasonably priced. I believe what the PUC regs say, electricity and electricity is not a luxury anymore. It might be in some other countries, but it's not a luxury here.'",
        "'speaker_5': 'And we pay for it, whether we're small business people like Gio or my husband and I in the Walker building. I, for one, am not at all confident in what SCC has done, what they're doing, and what they are or not telling us.'",
        "'speaker_5': 'And I'm looking to you as the City Council to lead us on this, because if they cannot fulfill what they're legally required to do as we are embarking on serious development dreams and visions and plans. We're downtown that are going to help all of Long Beach, not just those of us that are right downtown.'",
        "'speaker_5': 'We need a partner. We need a partner that consistently will invest in our infrastructure, will maintain our infrastructure, and will provide us not with power outages, not with darkness for days on end, but with the electricity that we need to be the kind of high standard city that we are.'",
        "'speaker_0': 'Thank you. Thank you very much. Next speaker, please.'",
        "'speaker_1': 'Okay. Hi.'",
        "'speaker_0': 'It's the other one right over there.'",
        "'speaker_7': 'Oh, the other one.'",
        "'speaker_0': 'There we go.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'I want to make sure that you each hear me. I know that you understand that there are statistics up there. I believe it was 70,000 individuals were affected by it in some way, shape or form by one of the power outages.'",
        "'speaker_7': 'But there are human faces to those 70,000 people. And I know as a senior living in a senior building at Ground 0/3 and Chestnut, we saw a lot of activity. And first of all, God bless the Edison workers.'",
        "'speaker_7': 'They worked their little kazoos off. I saw them. I went out to visit them at two in the morning, three in the morning, five in the morning to see how things were coming along. But seniors were so impacted.'",
        "'speaker_7': 'I know Gary said that there wasn't fear. I had people stopping me and asking. I walked the streets. I walked that a lot of that district in the dark. I wish I had. I was given cold water from.'",
        "'speaker_7': 'The Red Cross. I was given extra flashlights to pass out. And the thing I heard most often was communication. Edison is telling us the first day I believe it was, the power would be restored in 3 hours, 4 hours, and then it was going to be the next morning, then the next night.'",
        "'speaker_7': 'The next afternoon. Communication is so important. I'd rather be told the truth, as brutal as it might be, so I could plan. That said, I hope that each and every one of you emphasizes to your constituents that being prepared is a self, a matter of self-preservation.'",
        "'speaker_7': 'Flashlights, water, and their own units. Their own house is very important. I see time is running out. Finally, I am more than a little concerned for those of you who saw it. There is a fantastic article in the L.A. Times Sunday edition, Sunday, September six about Big Santa for a lesson learned.'",
        "'speaker_7': 'And it talks about the PUC, talks about Edison and the fiasco that went down there at the ratepayers expense. I'm concerned that you've given them 30 days to come to do certain things. I've worked for race car teams.'",
        "'speaker_7': 'I've seen what happens when when we've got a deadline and some mechanic is getting weary and suddenly a screw doesn't get tightened properly. The wheel comes off, the driver is killed. Please be a little flexible with that 30 day requirement that they inspect everything.'",
        "'speaker_7': 'I can understand the pressure for them to do something. But on the other hand, we don't want another San Onofre. We don't. And I have to commend. Mayor Garcia and Lina. Councilman Huizar and her staff were phenomenal. If this had happened in the city of L.A., they'd be doing a task force first and whatever, and then figure'",
        "'speaker_7': 'out a month after the event that maybe they should've taken out water. Thank you so much. And thank you for the for the rest of the council.'",
        "'speaker_0': 'Thank you, ma'am. Next speaker, please.'",
        "'speaker_8': 'Yes. Yes. My name is Holly Stewart and Leona spoke earlier and I picked up a couple of more points listening to the discussion. One is, when the power goes down, of course, all your wi fi disappears. There's all this idea about modern tech, but once your server goes down because there's no electricity, then that's gone.'",
        "'speaker_8': 'So now you maybe have a good phone. Like I have a good phone with 4G, LTE, 3G and all that, but the battery runs down after a while. You can't recharge it. That's gone. So the idea that the high tech stuff does such a great job sounds good, but after about 12 hours, it begins to fail.'",
        "'speaker_8': 'And in fact, even though the 4G tower in our area, we live in a water building, as you said, begin to fail or the power went down or something because my phone, which is a very good one, couldn't pick up either LTE, 4G or even 3G after a while.'",
        "'speaker_8': 'So I just want to bring that up as a possibility or a thing to think about is that a lot of this stuff really is dependent upon having the electricity. A second thing is there has been some discussion of the Public Utility Commission, but even at their hearing, I never heard them say why there was a public'",
        "'speaker_8': 'utility commission. If you have to go back about 100 years, you find out that in fact, cities and counties and things like that were putting out monopolies to things like Southern California Edison to provide power. And when you did that, you took and give them tremendous amount of power because they were going to be the only thing'",
        "'speaker_8': 'a power system as a monopoly. So utility commissioners rested up to supervise them, oversee them and make sure that they didn't go just for money, trying to take so much away from us as a whole community for their shareholders.'",
        "'speaker_8': 'Over time, they tended to cut back on the amount of staff they have to take care of things because that makes more profit. Well, we I commend you for looking into this, and I hope you will be on the tail of the utility commission, too, as well as SC to make sure the job gets done.'",
        "'speaker_8': 'So this doesn't happen again. Because, as Liana said and as others have said, the redevelopment and the repositioning of downtown here, and I've heard about all these plans for even more residents. If you don't have the carrying power within your electrical system, you're looking for trouble because the more and more you put on notice, the higher the'",
        "'speaker_8': 'load is that it has to carry, the better chance that you're going to have a failure. During times like, well, extreme heat times, if there's an earthquake, if there's other kinds of power outages, it compounds it as you have more and more people on a grid.'",
        "'speaker_8': 'So thank you very much.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_8': 'Very good, Hugh, before turning to the excellent report that you have presented, I take it the biggest takeaway I would say is the biggest lesson is do not give up your landline. Hang on to that. Secondly, although this was obviously a Edison and Electric centric presentation of I, I noticed you had touched upon the issue of tsunami'",
        "'speaker_8': ', which is certainly something we've got to deal with and particularly if we here live on the coastline. And I'll get to you. I'll make sure you get the plans. Relatives. It's the tens river type of lock that's now going to be put in the open 365 days a year, but can be closed on a tsunami basis.'",
        "'speaker_8': 'The warning out of nowhere and so forth, that within two or three years we should be able to have at the end of the jetty. In addition to that, touching upon just that aspect, one of the things that we will not have to prepare for in about eight years, going back to what I talked about, the new'",
        "'speaker_8': 'paradigm that we could use, the mitigation that base is the construction of that will be such that we will no longer have to every year bring in loads of sand and protect the assets that are along the peninsula because the construction of the perimeter dynamic will prevent the waves and the surge from hitting a good portion of'",
        "'speaker_8': 'those so forth. But there was a very good, thorough report. I'll make sure you get the details out there on the sounds tsunami dynamics. Thanks.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_5': 'Yes. Just one last point. A resident of ours, Gary Shelton, brought this forward and I thought it was a good point, creating emergency plans for business owners and helping them do that, or especially in buildings like the downtown where we have high rises.'",
        "'speaker_5': 'I'd like to have us look into that. I think it would be great to conduct workshops of some sort or go out and do a training of some sort and how to create a plan. Great. Thank you. Okay.'",
        "'speaker_0': 'There's no other public comment we're going to receive and file, but I just have to just to make a quick a quick note. And it's unfortunately very timely. But from what I understand right now, we just had an Edison outage that 1400 customers are affected in parts of West Long Beach from what my city, the city manager'",
        "'speaker_0': 'is telling me right now. So I know that they're working on that. But this this is obviously both unfortunately ironic, but goes to show you that we need change and there needs to be an improvement in the system.'",
        "'speaker_0': 'I know you guys are here and I appreciate that from the from the Edison guys, but this is just completely unacceptable. And I'll say it again. So we're going to hopefully figure out what's going on here. And right now, 4000 customers without without, without power.'",
        "'speaker_0': 'So there's a motion on the floor in a second.'",
        "'speaker_3': 'Mr. Mayor? Yes, I know we have representatives here. Did you want to hear from them?'",
        "'speaker_0': 'I think they're going to get to they're going to if you'd like to make a comment, but I know they're going to get to work on what's going on right now, from what I understand. Okay. All right. Receive and file.'",
        "'speaker_0': 'Cast your vote to make a two minute recess.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'I'm going to I'm going to ask everyone to take a seat and we're going to go ahead and get started. I'm going to call the meeting back to order.'",
        "'speaker_10': 'I think there was a. We're going to switch that.'",
        "'speaker_8': 'We never. I mean.'",
        "'speaker_2': 'We pretty much.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_8': 'They don't want to do it. Exactly. Exactly. I mean, if it's not. It probably has problems, but.'",
        "'speaker_0': 'So this is an opportunity.'",
        "'speaker_4': 'To get together.'",
        "'speaker_0': 'Yeah. Okay. I'm going to call the meeting. I'm going to call a meeting back to order. I'm have roll call, please.'",
        "'speaker_1': 'Councilwoman Gonzalez. Mayor Vice Mayor Lowenthal, Councilwoman Price. Councilmember Cooper. Not here. Councilwoman Mango. Councilman Andrews. Councilmember Muranga. Councilman Austin. Councilmember Richardson. Mayor Garcia.'",
        "'speaker_0': 'I'm here. Thank you. And just as a quick announcement, so the power outage is in West Long Beach, mostly in the seventh District. And so I know that our folks are in Edison are taking a look at that right now.'",
        "'speaker_0': 'And so if you're obviously those that are without power are obviously not watching this. But if you are out there, you know someone that needs assistance, please, please do so. So we're going to continue on. We have an important budget hearing tonight, which we have to which we have to finish.'",
        "'speaker_0': 'But I know that we have our folks right now addressing the outage as we speak. So, madam, quick, if you can read, but you're hearing one.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and take the actions necessary to adopt the Fiscal Year 2016 budget as listed in Attachment A.  (Citywide)": [
        "'speaker_1': 'Report from Financial Management Recommendation to receive supporting documentation into the record, conclude the public hearing and make the actions necessary to adopt the fiscal year 2016 budget citywide.'",
        "'speaker_0': 'Thank you. We have the the hearing. I'm going to go ahead. And, Mr. West, did you have anything to introduce as part of this budget hearing first? No, sir. Okay. Then what I'm going to go ahead and do is I'm going to turn this over first.'",
        "'speaker_0': 'Any public comment as part of the hearing? Please come forward.'",
        "'speaker_8': 'Very good. You click as the address. Full disclosure I have not studied the entire budget, but from what I can see it is but ugly. It's the only way to describe our financial situation. So much so. I'm going to suggest that notwithstanding the tremendous effort and tremendous results that our good chief of police are doing is doing'",
        "'speaker_8': ', is that this be the last? Council meeting held in the city hall. Given the number of shootings in close proximity and that we consider having. The City Council meetings, perhaps out in the fifth District. Well aware away from the gunfire.'",
        "'speaker_8': 'Period. And I see this situation continuing. And in addition to that, I would suggest this, that the council declare a state of emergency. And take the necessary steps to dissolve the office of full time mayor. And wait, you know, until next year when obviously we will be having a new mayor and a new city manager anyway.'",
        "'speaker_8': 'The financial situation in this city, I think warrants that type of action. But particularly relocating the city council meetings to a district where there's not gunfire within four or five blocks away and the number of killings that are at a record level.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Now we're going to move on to the budget hearing item. So I'm going to turn this over actually to Vice Mayor Lowenthal, who is going to walk us through the items as a remembered reminder to the council.'",
        "'speaker_0': 'There's a these are a series. There's going to be a series of recommendations on a variety of items, and there has to be a vote on each one. Vice Mayor Lilienthal.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I wanted to acknowledge that we don't have member Your Honor here. And so for for the City General Fund related items, we will wait for Council Member, Your Honor, and take those up at the next council meeting.'",
        "'speaker_3': 'We've had a series of Budget Oversight Committee meetings with co-chair, Councilmember Mongeau and committee member Councilwoman Pryce. And we've had lots of discussion about items that council members have raised earlier and during the budget presentations when we've had departments make these presentations.'",
        "'speaker_3': 'And so we've also had community members come out and speak for issues that are important to them. Notably, Mr. Aaron Fletcher was there at every single budget oversight committee meeting, as well as each of our offices, reminding us of the importance of of what lifeguards do and what cuts to that department or that division mean to all'",
        "'speaker_3': 'of us in the city, not just along the coast, but our entire city. So with that, Mr. Mayor, what I'd like to do is ask our council colleagues to consider adopting a certain number of these items. They're more or less ministerial items.'",
        "'speaker_3': 'And if I may ask Mr. City attorney for his opinion on whether I do have the items correct. I am looking at items 1.1 through 1.9 as ones that we can take today. That would be non. General fund items, which I hope to hold for next week.'",
        "'speaker_4': 'That's correct.'",
        "'speaker_3': 'Okay. So I proceed. Mr. Mayor.'",
        "'speaker_0': 'So we thank you.'",
        "'speaker_3': 'Okay. So I'd like to recommend to receive the supporting documentation into the record and conclude the public hearing and take actions to adopt the following items. Item 1.1 Actually, Mr. City Attorney, do we need to do item 1/1?'",
        "'speaker_4': 'Yes, we need to do. Well, you can start at 1.1.'",
        "'speaker_3': 'Okay. Thank you. Item 1.1 recommendation to adopt resolution approving the fiscal year budget for the Long Beach Harbor Department as adopted by the Board of Harbor Commissioners on May 27th, 2005.'"
    ],
    "Recommendation to adopt resolution establishing the Gann Appropriations Limit (Limit) for FY 16 pursuant to Article XIII (B) of the California Constitution.  (A-9)": [
        "'speaker_3': 'Item 1.9. And finally for this evening, recommendation to adopt resolution establishing the GAD appropriations limit for fiscal year 16 pursuant to Article 13 B of the California Constitution.'",
        "'speaker_0': 'There's been a motion and a second. Is there any public comment? Seeing none. Please cast your votes.'",
        "'speaker_1': 'Richardson.'",
        "'speaker_3': 'Councilmember Richardson.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Mr.. To the jury, do we need a motion to move the other items forward to the next meeting? Or we can just leave the hearing as is.'",
        "'speaker_4': 'I think he limousine and bring him back as the next budget hearing at the next week.'",
        "'speaker_0': 'Okay. So we'll resume at the budget hearing for next week for the other items. Councilwoman Mango.'",
        "'speaker_1': 'Mr. GROSS, would it be better to discuss the parking fee next week? I know that it's technically general fund. I know that it's confusing, though, when people know that partially is being passed, but not the whole fee structure.'",
        "'speaker_4': 'Do you mean the the local neighborhood parking fee?'",
        "'speaker_1': 'Yes, sir.'",
        "'speaker_4': 'I think I think tonight would be okay.'",
        "'speaker_1': 'I'll defer to Vice Mayor Lowenthal. Is that okay?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Could we hear that staff report now?'",
        "'speaker_4': 'Mayor. Members of the council. I believe you've already adopted the master.'",
        "'speaker_3': 'The math just continues.'",
        "'speaker_1': 'We only adopted the component that's relative to the special funds, not the general fund.'",
        "'speaker_4': 'I believe you adopted the entire resolution, the master fee and charges schedule for specified city services and citywide fees and charges.'",
        "'speaker_1': 'Then I may have misunderstood because I thought we started with we're only approving things tonight that are not general fund because Councilmember Urunga is not here.'",
        "'speaker_4': 'No, I think the question was if you wanted to change either the mayor's proposed recommendation, the Budget Oversight Committee recommendations, obviously the council could take action on the entire budget if they wish. But I think they decided to have a breaking point at item nine so that you could adjust your budget items later.'",
        "'speaker_4': 'But the master fee resolution could be discussed. Still, you could do a motion to reconsider, vote on it, open it up again and have another motion.'",
        "'speaker_0': 'And and excuse me. So Councilman Mongo is still going to want to have a staff report so that that would.'",
        "'speaker_1': 'Put the community can know the outcome. Yeah. And if there is public comment, would we be able to take that again?'",
        "'speaker_2': 'Absolutely.'",
        "'speaker_0': 'Okay. So city staff. Yeah. There's no there's no motion to reconsider. This is just a staff report on the item first.'",
        "'speaker_1': 'To Mr. Chair. Councilwoman Mongo at the last. Time that the master fee and charges schedule had come up. We had received a request from Councilwoman Mango to explore changing the preferential residential parking program. And right now what it is, is it's 30, $33 per permit.'",
        "'speaker_1': 'And the question was whether or not it made sense for it to be $33 or some amount for the first permit in some amount lower for the second, third or fourth permit for each vehicle. The staff did look into that request.'",
        "'speaker_1': 'We did find that while it was a slight savings to process the second, third or fourth permit per residence, overall, the program was not covering its full cost. And so it would just great it would increase the subsidy to the general fund to change the fee.'",
        "'speaker_1': 'In addition, when we looked at the other benchmark cities that we we had looked at, not a single one had actually had a reduced fee for each subsequent permit. In fact, one city had a more regressive or a it cost more for the second, third or fourth permit, in fact, to decent disincentivize residential parking permits.'",
        "'speaker_1': 'So for those reasons, we did not recommend changing the fee structure at this time. Thank you. I appreciate you having met with me and my office to discuss the report and the detailed study you went into. I think it's important for residents to know that the current parking neighborhood parking permit program is subsidized.'",
        "'speaker_1': 'And with that, I'm still comfortable with my vote.'",
        "'speaker_0': 'Thank you. Okay. The rest of the budget hearing is has concluded. And we'll go to we'll go to those items at the next next meeting. So I want to go ahead and now go back to the regular agenda.'",
        "'speaker_0': 'We did the first hearing. We're going to go now, I believe, to. Is it? Is it 2021? Is it? Okay, Madam Clerk.'"
    ],
    "Recommendation to declare ordinance relating to the temporary limitation of certain construction and development activities in the R-1-L zone in the Los Cerritos and Virginia Country Club areas of the City in order to foster and promote neighborhood character stabilization in said area; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Ordinance No. ORD-15-0024)  (Citywide)": [
        "'speaker_1': 'Item 21 Communication from City Attorney. Recommendation to receive supporting documentation into the record. Conclude the hearing. Declare ordinance relating to the temporary limitation of certain construction and development activities in the r1l zone in the Lo Cerritos and Virginia Country Club areas of the City of the City read adopted as red and laid over to the next regular'",
        "'speaker_1': 'meeting of the City Council for final reading, declaring the urgency thereof and declaring this ordinance shall take effect immediately citywide.'",
        "'speaker_0': 'Mr. MESA. Anything to add to that?'",
        "'speaker_6': 'Not unless someone would like a further staff report. We did amend the ordinance to reflect the action of council on September 1st, which was basically to provide an exemption for those folks that were able to get a an application approved application on file basically by close of business today, September eight.'",
        "'speaker_6': 'And other than that, the moratorium language remains basically the same. During the moratorium period, there will not be any construction permitted in excess of 1500 square feet, whether that's new construction on a vacant lot or additions to existing buildings, those folks that got their applications in by today would be exempt from the moratorium and can move forward'",
        "'speaker_6': 'with their project of now. They can answer any questions anyone might have.'",
        "'speaker_0': 'Thank you. I think we're going to have a couple of motions. Their motion. But I think if I had seen one. Councilman Austin second. Right. Councilman Richardson, is there any public comment before I close to hearing. CNN counterpoint.'",
        "'speaker_0': 'Also do have any other additional comments or what sort of a vote? Okay, great. Let's go and go to a vote.'",
        "'speaker_6': 'And just to be clear, the vote includes the voting, a separate vote on the urgency of the ordinance. So that will take effect immediately commencing today.'",
        "'speaker_0': 'So, Mr. Mayes, you want to take a different a second vote right now?'",
        "'speaker_8': 'Okay. Separate a separate vote.'",
        "'speaker_0': 'So we'll take the second vote on the urgency. We have a motion by Councilmember Austin and a second by Councilman Andrews. Any public comment on the second than the urgency? Okay. So none. Gordon, cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item number 13, please.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an amendment, and all subsequent amendments, to Agreement No. 33739 between the City of Long Beach and the County of Los Angeles to provide bioterrorism preparedness and public health infrastructure development, and to accept additional funding of $913,191 for the period of July 1, 2015 through June 30, 2016, for a total grant contract amount of $3,902,296.  (Citywide)": [
        "'speaker_1': 'A report from Health and Human Services. Recommendation to execute an amendment to agreement with the County of Los Angeles. To provide bioterrorism preparedness and public health infrastructure development. And to accept additional funding of 913,913 $191 citywide.'",
        "'speaker_0': 'I need a emotion in a second place. Okay. I'm also. Councilman Pryce, I think, had a question.'",
        "'speaker_5': 'I was wondering if I could get a little bit more information on this item. It seems that the the. The ability to utilize these funds is kind of broad. And I was wondering if we have any more information on how the funds are going to be used.'",
        "'speaker_6': 'Certainly our director, Kelly Colby and bureau manager Cheryl Barrett can answer any questions.'",
        "'speaker_5': 'Is it possible to just to get an overview of our plans.'",
        "'speaker_0': 'Once we get a little bit of a staff report on this place?'",
        "'speaker_6': 'It's helpful when we have a staff report from Cheryl Barrett. So I thank you for the opportunity to expand on this a little bit more. We've been getting this as an opportunity to look at all of our public health capabilities around emergency preparedness management.'",
        "'speaker_6': 'So that includes emergency coordination, activating our D.O.C. and also looking at our surveillance methodologies and capacities around communicable diseases and emerging threats to our community. Another part of the CDC recommended capabilities that we use this these funds for include our responder health and safety, looking at trainings across the broad categories of bioterrorism and public health emergency threats'",
        "'speaker_6': 'as well. And also looking at, for instance, the response that we were able to effectuate nationally and locally around Ebola. Those are examples of emerging diseases where we are constantly testing our capability and also looking for opportunities to engage with local hospitals as far as preparedness.'",
        "'speaker_6': 'We're going to look at a special focus on our shelter management based on the lessons learned from the power outage and also looking at key areas of staff and cross-training opportunities for public health, along with a registered environmental health specialist and also our partners across the region, particularly with our state partners around surveillance.'",
        "'speaker_5': 'Great. I know we often have agenda items that come to us that summarize grant awards and that we have pursued and received. And I don't I know I personally don't do enough to thank you and your departments and your teams for pursuing and utilizing to the fullest extent possible grant opportunities.'",
        "'speaker_5': 'So thank you for that. And this is obviously something that we would we would have a difficult time funding through our general fund. So thank you. I appreciate it.'",
        "'speaker_0': 'Thank you. There's been a motion and a second there. Any public comment? Okay. Please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'"
    ],
    "Recommendation to authorize City Manager to execute a new agreement between the Long Beach Police Department and the Long Beach Unified School District to staff School Resource Officers for an amount not to exceed $920,799, with an estimated net cost to the Citys General Fund of $230,200.  (Citywide)": [
        "'speaker_1': 'Report from police recommendation to execute a new agreement between the Long Beach Police Department and the Long Beach Unified School District to staff school resource officers for an amount not to exceed $920,799.'",
        "'speaker_0': 'Can we get a short staff report on this? I think this is important.'",
        "'speaker_8': 'Commander Lopez.'",
        "'speaker_7': 'Mayor Garcia. Members of council. Since 1999, the police department has worked with the Long Beach Unified School District to staff the School Resource Officer Program at five high schools. This agreement will cover the current school year 1516 at the cost of $690,599 to the school district and the cost of $230,200 to the general fund.'",
        "'speaker_0': 'Thank you very much. There's a motion and a second Israeli public comment on this. Councilman Price.'",
        "'speaker_5': 'I just out of curiosity, do we keep any stats on the types of arrests and or investigations the resource officers might get involved in at the high school campuses?'",
        "'speaker_7': 'Councilwoman Price Not to my knowledge. We don't track it statistically. Anecdotally, I think it's generally pretty minor offenses, disagreements between students, sometimes drug possessions, sometimes possession of weapons such as a knife. Kind of a typical things that we see.'",
        "'speaker_5': 'I was just curious if if and if we don't have the data, maybe there's some potential. I'm just curious of how many drug related arrests we have in the city, at the high schools or drug related activity? And how much of that involves prescription drugs, marijuana or other more illicit substances like meth or heroin?'",
        "'speaker_5': 'I'm just curious as to whether or not we as I think, by the way, this is a great partnership we have with Long Beach Unified. But I'm just curious as to whether or not we receive data that helps us kind of identify trends in our and our students and our younger population in terms of drug use, addiction'",
        "'speaker_5': 'sales, that kind of thing.'",
        "'speaker_7': 'We can definitely provide that information to you.'",
        "'speaker_5': 'Great. Thank you.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'Thank you for the report. Commander Lopez Which schools will the resource officers be deployed to?'",
        "'speaker_7': 'Councilwoman Gonzalez The schools are Cabrillo Poly, Jordan, Milliken and Wilson.'",
        "'speaker_5': 'Okay, great. Thank you very much.'",
        "'speaker_0': 'Okay. Thank you. And you probably see no public comment on this. Please cast your votes.'",
        "'speaker_1': 'Councilman Richardson. Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'",
        "'speaker_1': 'Report from Public Works Financial Management. Recommendation to award a contract to our Amex group for the Terminal Avenue Greenbelt Restoration. For a total contract amount. Not to exceed $260,757. District three and four.'",
        "'speaker_0': 'Thank you. I have a motion. Can I get a second? There's a motion and a second. Is there any public comment on the item? Seeing Nazis cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item number 22.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7023 for the Termino Avenue Greenbelt Restoration; award a contract to Aramexx Group, Inc., of Ontario, CA, in the amount of $237,052, and authorize a 10 percent contingency in the amount of $23,705, for a total contract amount not to exceed $260,757; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto.  (Districts 3,4)": [
        "'speaker_1': 'Communication from Councilwoman Mongo Vice Mayor Lowenthal. Councilman Austin recommendation to request the city attorney to draft a resolution providing for a temporary amnesty program, waiving late penalty fees for dog licenses through September 30th.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_1': 'Under the leadership of Vice Mayor Lowenthal, the city has moved forward in providing a stand neuter ordinance. Within the context of that. Councilmember Austin and I felt passionate that people who are currently following the rules should be given the opportunity to maintain that status, but also that we want to have a call to action that now at'",
        "'speaker_1': 'the end of the summer, it's a good time to go get your pet vaccinated and become in compliance with the rules. And so we have Mr. Ted Stevens here from Animal Control Services to give a little bit of an overview of what your opportunities are to register, by what deadlines.'",
        "'speaker_8': 'Yeah. So we are.'",
        "'speaker_0': 'Since the new mandatory spay neuter.'",
        "'speaker_2': 'Ordinance will be taking effect October 1st. I think the goal of this was to give people the opportunity before then to come into compliance with their licensing. So this is something that would take place and around September 30th and maybe help just kind of give people an incentive to come get their animals licensed.'",
        "'speaker_1': 'And Mr. Stevens, this is for spayed or neutered and intact animals. Yes.'",
        "'speaker_2': 'Yes. This was to be open to all animal owners, is my understanding. So, yeah, unaltered, altered.'",
        "'speaker_8': 'Senior, everybody.'",
        "'speaker_1': 'Wonderful. Well, I hope that we can all encourage our neighbors to get their animals in compliance. It's a great time of year. There's a lot of low cost vaccination clinics. I know my dog is up for vaccination between now and September 19th, so I'll be renewing my license before I become expired as well.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Is there any public comment on the item? Seeing that. I'm sorry, Councilman. Also, you have any comments?'",
        "'speaker_9': 'Obviously I support.'",
        "'speaker_2': 'This item and encourage everybody to get their dogs.'",
        "'speaker_4': 'Spayed or neutered before October.'",
        "'speaker_2': '1st.'",
        "'speaker_0': 'Great. See no other public comment? Please cast your votes.'",
        "'speaker_1': 'He totally. Motion carries.'",
        "'speaker_0': 'Thank you. We're going to go to move on to some announcements. Well, well, well. People are getting queued up here. Why don't I take the second public comment period, if there is one? Anyone that hasn't made any comments earlier on the agenda.'"
    ]
}