{
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 21.15.3060, 21.21.501, 21.21.504, 21.25.101, Table 30-1 of Section 21.30.040, 21.31.225, 21.31.235.C, 21.31.255, 21.31.265, 21.32.020, 21.32.110, 21.32.120, 21.32.205, 21.32.210, 21.32.220, 21.32.225.A.1, 21.32.235, 21.39.030, 21.41.253, 21.52.206, 21.52.263, 21.52.283, and Table 54-1 of Section 21.54.170; by adding Section 21.32.275; and by repealing Section 21.32.130, and Tables 32-1A, 32-2A, and 32-3A, all related to the Zoning Code, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'Thank you. We're going to do hearing item number 2/1, please.'",
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record. Conclude the public hearing. Declare Ordinance Approving Zoning Code Amendment a-19-002 amending Title 21 of the Long Beach Municipal Code read for the first time and late over in the next regular meeting of the City Council for Final Reading and Adopt a resolution directing the Director of'",
        "'speaker_1': 'Development Services to submit the ordinance amendments to the California Coastal Commission citywide.'",
        "'speaker_0': 'Can I get a second, please? Okay. There's a motion and a second. Mr. West.'",
        "'speaker_5': 'Oh, the staff report will be given by Linda Tatum. And Alexis, thank you.'",
        "'speaker_9': 'I'd like to introduce Alexis Oropeza, our current planning officer, who will provide the staff report.'",
        "'speaker_7': 'A brief staff report.'",
        "'speaker_9': 'Good evening, honorable mayor. Members of the City Council. This item tonight contains a range of nine zone text amendments for a variety of code revisions that are intended to streamline the zoning code, as well as provide clarity for areas of the code which previously were not as clear.'",
        "'speaker_9': 'We are asking for all items to be to.'",
        "'speaker_1': 'Take action on all items, with the exception of item.'",
        "'speaker_9': 'Number four this evening due to a clerical error. We'd like to request approval of all modifications except for the strike out references.'",
        "'speaker_1': 'To commercial.'",
        "'speaker_9': 'Zoning districts for the c0ch zoning districts. With that, we would ask City Council to take.'",
        "'speaker_1': 'Action and are available.'",
        "'speaker_9': 'To answer any questions.'",
        "'speaker_0': 'Is there a public comment on this hearing? Seeing no public comment on the hearing at Concern Richardson. Anything? No. Councilwoman Price. No. Okay. The members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Q Thank you. I'd also like if I can get a motion also to our postponing hearing at Edinburgh one to the next meeting on May 14th. If I can get a motion in a second, please. Is there any public comment on the postponement?'"
    ],
    "Recommendation to direct City Manager to work with the Parks, Recreation, and Marine Department to implement the Compassion Saves model as the operational approach for Long Beach Animal Care Services (LBACS) ensure that this direction is reflected in the LBACS Strategic Plan and provide a report on the existing relationship and recommendations for improvements in policies and practices between SLCAla and LBACS to maintain facilities and financial conditions which are most conducive to promoting increased adoptions at the LBACS facility.": [
        "'speaker_0': 'Thank you. Next item is going to be.'",
        "'speaker_1': 'Item 32 communication from Councilmember Pierce. Councilwoman Gonzalez. Councilwoman Price. Councilwoman Mongeau. Recommendation to direct city manager to work with the Parks, Recreation and Marine Department to implement the Compassion Saves model as the operational approach for Long Beach Animal Care Services.'",
        "'speaker_0': 'Keith. Thank you. Let me this is item four, Councilmember Pearce.'",
        "'speaker_2': 'Thank you. This item came up fast. Appreciate moving it up in the agenda. I want to first and foremost say thank you to our team that has come on board and new to Long Beach to come in and help us not only our Parks and Rec, but with our animal shelter.'",
        "'speaker_2': 'And it means a great deal to me. And I know many of those that have worked hard for the last ten years to make changes in our shelter, to have staff that they can pick up the phone and call and brainstorm with.'",
        "'speaker_2': 'So I want to start it off with that and that that sentiment that it goes a long way. And I know I had a conversation with I won't call her out today, but someone that's in the audience about what does it take to make change?'",
        "'speaker_2': 'What does it take to build trust and to build lasting change? And often it's those one on one conversations where we get to be creative. And they really gave a big shout out to you, Stacey, for being accessible and for coming on to something that everybody has a different priority.'",
        "'speaker_2': 'And it is your task, too, to be on the front lines for that. So I want to first just say how much I appreciate that. When we had staff's presentation on Compassion Saves, I listened. I asked questions. I thought it was a great presentation on a vision that staff has on where they'd like to go.'",
        "'speaker_2': 'I recognize that there are lots of challenges and lots of pieces that need to move forward and that unpacking anything like this is a daunting task. So I also want to say how much I appreciate the task force that has come together as a community member that has served on task force and committees and commissions before.'",
        "'speaker_2': 'I know how frustrating it can also be to serve on a team that you don't know what the outcome will be. You don't know if your hours of volunteering is going to go towards a tangible outcome. And so I have a couple questions for first staff in a minute, just around the task force.'",
        "'speaker_2': 'But I hope that this process can really assist in giving the task force some confidence that this council, whatever way they direct staff today, will support them in making meaningful changes. The process I know a lot of people have asked questions about the process.'",
        "'speaker_2': 'The process is really we heard the staff presentation on the current state of our shelter. We heard some ideas around where they like to go, things that Stacey is already putting into place, like a volunteer program, attempting to get foster program up.'",
        "'speaker_2': 'And so I want to say that that process is moving forward and that today we hope to give a little bit of more direction and that that task force is really going to do the work. And so whenever that you guys come back is when we can prioritize and identify what resources and and what that looks like'",
        "'speaker_2': '. So I know that we are in good steps moving forward. I have a couple of quick things to go over, but I'd like to hear from public comment first and then take it behind the rail and ask some questions of staff before we give our final our final vote.'",
        "'speaker_2': 'So I think this is a great step forward and in making sure that we reduce euthanasia rates in our animal shelter. And when I appreciate everyone who's been involved.'",
        "'speaker_0': 'So great, we're going to do public comment first. So if you have public comment on the item, please come forward and line up up on the on the dais. And if there's more than as this more than ten folks were to go down after that to 90 seconds.'",
        "'speaker_0': 'So please, if there. Unless there's any objection. Looks like the council wants to start at 90. Are there any objection? Okay. We're going to begin at 90 with the amount of people to speak, so please come forward. Madam Clerk, we're going start the clock at 90.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_9': 'Hi, I'm Anna Wong. I am a task force member and I appreciate the appointment. I appreciate the progressive thought movement and the compassion saves. However, I am asking and begging this council to vote no on it tonight. The reason being is that we are not ready to set a label on what we're doing.'",
        "'speaker_9': 'The task force is just now getting ready to start working. We just got now just appointed subcommittees. We are not ready for this. Most importantly, it is too ambiguous with regards to the tradable animals. 2 to 3 years ago, our shelter was killing kittens and cats with mange 3 to 5% on their body.'",
        "'speaker_9': 'Thank God we're not doing that anymore. But where are we going to to cut this off? What does it mean to be a tradeable animal? What does it mean to you? I know what it means to me. I know what it means to the majority of these back here.'",
        "'speaker_9': 'I know what it means to Stacy. I need to see more. Something in writing, telling us what is a treatable animal and we need to be in agreement on that. So please, please, please vote no and concentrate on the SPCA problem, please.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_9': 'Good evening. I'm Beverly Lifer from District two. I'm thankful that the city council is finally publicly recognizing the issues with the Long Beach Animal Care Services. However, I oppose compassion saves in its current form and oppose a city council vote on the related agenda item tonight.'",
        "'speaker_9': 'I wish for it to be postponed. Neither addresses the major issues, including the lack of a full autonomous adoption program. The agenda item and compassion saves does not make animal adoptions a priority. It does not include an autonomous adoption program.'",
        "'speaker_9': 'It allows SPCA, L.A. to continue status quo and process more than the majority of the adoption of live animals. It allows SPCA, L.A. to use their restrictive adoption policies, which prohibits the adoption of many pets to good homes.'",
        "'speaker_9': 'This agenda item is not a first step to an independent adoption program. It places the onus on the community transferring not only the city's homeless animals, but responsibility for them to rescues who are already beyond capacity, as well as the costs for caring for these animals.'",
        "'speaker_9': 'Long Beach needs to be accountable and provide the funding needed to have its own full, robust adoption program. Thank you.'",
        "'speaker_0': 'Thank you so much. Next next speaker, please.'",
        "'speaker_9': 'Thank you. My name is Laura Selma. Thank you, Mayor Garcia, for bringing this to this place. I would like to talk about the Long Beach spay neuter trust fund. The spay neuter fund can be found in municipal code 6.04.070.'",
        "'speaker_9': 'I paraphrase for adoptions, a spay neuter fee is assessed and all such fees are deposited in the spay neuter trust account. Municipal code ensures the fees goes directly to our own mandatory spay neuter fund. So what's the problem?'",
        "'speaker_9': 'We learned our city manager has directed our bags not to do adoptions in SPCA. She'll continue with all our Auerbach's animal adoptions. This directive from the House of Management diverts established collectible fees to a city trust account.'",
        "'speaker_8': 'To.'",
        "'speaker_9': 'An outside entity. The diversion of money has to stop. City Council in the 2019 budget provides $120,000 to start adoptions. It's not a city manager's role to circumvent municipal code and divert revenue from a municipal trust fund. Please direct the city manager to rescind his directive, allowing all banks to put up adoption signs and develop its adoption'",
        "'speaker_9': 'program. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Alex Armstrong. Good evening. That was a great speech by Laura. I'd like to also talk about some municipal codes. I'd like to talk about municipal code 6.046.04.050. It's titled Impound Care of Animals. Municipal Code, says the director shall safely keep all animals, and I quote shall furnish all necessary food and water.'",
        "'speaker_5': 'Looking at the Outback's financials. It is not furnishing all necessary food. It might surprise you that SPCA furnishes the majority of animal food, which the city is by law required to furnish. This amounts to a gift to a city agency of hundreds of thousands of dollars.'",
        "'speaker_5': 'This hefty gift, again worth hundreds of thousands of dollars, is not reported anywhere on Lubbock's financial reports. Worse, SB Sklar does not submit state manager mandated reports of gifts to our city clerk. The problem with handshake deals like this is that they violate the state and city's code of ethics.'",
        "'speaker_5': 'We keep hearing that city management wants to sign a formal agreement with SPCA and is already working on it. But with huge unreported gifts, it constitutes real bribery. But none of this is reported to the city clerk. Clerk.'",
        "'speaker_5': 'I hope you will direct the city manager to authorize emergency funds to uphold municipal code and furnish all necessary food until the public can be assured the SPCA gifts are not government bribery.'",
        "'speaker_0': 'Thank you so much. Next week.'",
        "'speaker_2': 'Hi. Good evening. My name is Joanne Quast. Thank you, honorable mayor and City Council for your time devoted to this very passionate issue. Thank you, Mayor Garcia, for bringing an experienced shelter manager to our city. These are huge steps.'",
        "'speaker_2': 'I look forward to working with all of you to get the next steps right. Thank you to Suzy Price and Janine Pearce for being the first council rep in 11 years to agenda is this item. Compassion saves would not be the words I would have chosen, but the name is not.'",
        "'speaker_2': 'In the long run, the concern what is is the collective programs that are put in place to save animals. We don't need to reinvent this. We have shelters all across the country who are successfully doing this. Let's leverage the best practices and use our time and resources to adopting out animals as that is ultimately what prevents shelter'",
        "'speaker_2': 'killings. We can adopt our way out of killing. Let me say that again. We can adopt our way out of killing, as that is ultimately what prevents shelter deaths. That's an independent adoption program is a must large adoption signage equivalent to SB plays adoption signage is a must because passion says without an independent adoption program is status'",
        "'speaker_2': 'quo, you will not get volunteers or funding without putting this in place. I've left you a red folder at your seat, so I think hopefully you all have it. It is a package that outlines eight serious shelter issues that we are asking City Council to re to consider addressing in your motion today with both audits and the'",
        "'speaker_2': 'public homework, we know a lot more recommendations have be provided that will set the shelter on the path to success. Thank you for covering the following eight issues that are in your packet.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_9': 'Mayor, vice mayor, council staff and audience.'",
        "'speaker_7': 'My name is Christy Maloney from the third district. So far, this administration has excluded anything to do with no kill, whether being left off the task force hiding no kill advocate comments on city officials. Media Pages Ostracize No Kill at public meetings.'",
        "'speaker_7': 'Or completely left out of tonight's Compassion Safes policy. We would like to request that the city council delay voting on this new policy in order to have all of the.'",
        "'speaker_9': 'Information from all available.'",
        "'speaker_7': 'Angles. Why would the city deny us this right before this new policy is voted into place? It is painfully obvious that no skill isn't being considered and that this Council has not been fully informed in the positive aspects of Nokia.'",
        "'speaker_7': 'We respectfully request that this Dyas hear from a Nokia expert on the insights it gives in saving animals before any vote. A no kill expert. According to four separate polls in Long Beach, an average of a full 91% of respondents asked for no kill for our shelter.'",
        "'speaker_7': 'Let's bring in a no killer expert to get definitive answers about it before you commit your vote tonight. Clear the air about SPCA, L.A.. Let's be moral about this.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_9': 'Carol Patterson, fifth district. I can't support this. It's not the ordinance we wanted. It's not the resolution we asked for. It's simply an item pushing the compassion saves model, which, in my opinion, is just a nice sounding name for the status quo.'",
        "'speaker_9': 'We can't end the killing in shelters if we continue thinking that it's a necessary evil. One of those hard things in life you just have to accept. Well, I can't accept that. No kill advocates can't accept that. We want the killing stopped.'",
        "'speaker_9': 'In order to do that. We need to challenge the status quo. Yet exercising our right to free speech has had advocates being characterized as vicious.'",
        "'speaker_1': 'And if they're not.'",
        "'speaker_9': 'Quite vicious, they're just so negative. At the beer and politics event a couple of weeks ago, the Stacy's told the audience that it would be more helpful to stop telling negative things. I heard that to mean stop telling the truth.'",
        "'speaker_9': 'Here's one truth. Nobody wants to close shelter. Even more stains confirm.'",
        "'speaker_1': 'That it's not a tenant of no kill, and I haven't seen.'",
        "'speaker_9': 'Statistics to prove otherwise. But evidently Miss Mungo is so opposed to no kill that she makes stuff up again. At the beer and politics event. She stated that pet retention program is code.'",
        "'speaker_1': 'Vernon Open Admissions.'",
        "'speaker_9': 'Not only is her statement wildly inaccurate, but it shows she is misinformed. What concerns me is that others voting for this item may also be misinformed and that our animals will suffer as they have been for years. If Long Beach really wanted to give every animal.'",
        "'speaker_1': 'A chance as the.'",
        "'speaker_9': 'Slide read Ms. Monkeys presentation, you would.'",
        "'speaker_1': 'Vote to implement no.'",
        "'speaker_9': 'Kill rather than to bash it with beer.'",
        "'speaker_0': 'Next speaker please.'",
        "'speaker_9': 'Patricia Turner. I'm the director of Nokia. Long Beach. Nokia Long Beach opposes compassion saves because it does not address the key problems that are actively blocking our backs operations. First, it does not address the issue raised in the audits of the constraints that SPCA continues to place on our backs.'",
        "'speaker_9': 'City staff have told advocates that SPCA, L.A. will not allow our backs to have its own adoption program. Yet a comprehensive and autonomous adoption program is absolutely critical for the city shelter to operate, to scale and meet the needs of the residents of Long Beach.'",
        "'speaker_9': 'The audits recommended that the city review and formalize the operational agreement, which is verbal only between L. Bax and SPCA. L.A. We believe that this agreement must not only be formalized, it must establish Lubbock's autonomy from SPCA, L.A., so that it can be fully a fully operational, effective, life saving shelter that aligns with the humane values of'",
        "'speaker_9': 'the people of Long Beach. Without this key provision instituting a dog's autonomy, the programs Saddleback puts forth will continue to be undercut by SPCA. Therefore, we ask that you delay the vote presented this evening or vote no and ask that a national authority on no kill animal sheltering be given time to make a formal presentation to City'",
        "'speaker_9': 'Council and answer the questions from council and the public, the majority of whom support no kill programs and policies at the Long Beach Animal Care Services shelter.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Hi. April Devane. Task Force Member While I appreciate you bringing this new policy to the forefront because we haven't seen anything like this in years, I think this is a little oh, we're a little bit too soon on this.'",
        "'speaker_9': 'We haven't even had a chance, as Anna mentioned, to go over things in the task force. It's premature. And I think we need a little more time to vet out some of the statements that are in the compassion saves policy.'",
        "'speaker_9': 'And I really would ask you to vote no or maybe postpone the vote on this so we can actually flesh these things out a little bit clearer. Thank you.'",
        "'speaker_0': 'Thank you, Nick Speaker, please.'",
        "'speaker_9': 'Good evening, Mayor. City Council members of Long Beach. My name is Sharon Logue and I am a resident of Huntington Beach. I am the plaintiff in Logan versus Oakley. Animal Care. Logan versus Animal Care was a game changer that brought much needed shelter reform to O.C. Animal Care.'",
        "'speaker_9': 'Our team of attorneys obtained a complete overhaul in O.C. animal care, intake policies, healthy animal care training, euthanasia practices, and the.'",
        "'speaker_2': 'Subsequent resignation.'",
        "'speaker_9': 'Of O.C. Shelter Director. I have fought tooth and nail since 2012 for the animals of O.C., just like the animal advocates are.'",
        "'speaker_2': 'Fighting tooth and nail for the.'",
        "'speaker_9': 'Animals that help us today. To the rescue, animal advocates and committee members that are currently fighting this.'",
        "'speaker_2': 'Battle for.'",
        "'speaker_9': 'Shelter reform in San.'",
        "'speaker_2': 'Bernardino instead of Cleveland right here.'",
        "'speaker_9': 'In Long Beach. Keep fighting. The animals need your voices. To the residents and community members here in Long Beach. I am living, breathing proof that your voices do matter. Your voices does make a difference. That animal advocacy works.'",
        "'speaker_9': 'This community and the residents in this city have the power to successfully reform and transform elex. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Hello. It's Julie again. I'm wearing sunglasses because I forgot my other ones. No, I'm not on drugs. I'm here today to ask you also to postpone your decision about instituting the Compassion Saves program today. There's just too many loopholes.'",
        "'speaker_9': 'There's too many generalities, things that aren't explained, things that can fall through the cracks. We're all just asking for a postponement, which I've seen you do many, many times here. Whenever the an issue needs more review. As we all know the.'",
        "'speaker_9': 'Task force hasn't really had a chance to make decisions. I don't know if they ever will. We all know that the strategic planners aren't done making their recommendations, and also the community only has like 3 minutes here and there to let you know just exactly how we feel about the Compassion Saves program.'",
        "'speaker_9': 'But I will say congratulations to all of you for hiring the most qualified shelter manager that we've ever had. And I mean, she's fantastic. She was under the gun. You said write a program. She did it. It just needs more review.'",
        "'speaker_9': 'It needs more time to work the bugs out. And there are plenty of them. And also, Suzy, excellent questions that you gave, but I would encourage all the others who remain sanely, like Mr. Yarrawonga.'",
        "'speaker_7': 'Mr. Austin.'",
        "'speaker_9': 'Well, and Leena.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_9': 'Okay. To speak more often in favor. Thank you.'",
        "'speaker_0': 'So much. Program next speaker, please.'",
        "'speaker_7': 'Hello, everybody. Nice to see everybody again. Thank you again. Thank you, Mayor. We're both educators. We talked about that and therefore we're data driven. Do you agree? So when we cited all those polls, I mean, there's all kinds of convincing research that tells us that people are not comfortable volunteering or even working in a in a kill'",
        "'speaker_7': 'shelter. When I brought that up at beer and politics.'",
        "'speaker_4': 'There was just dismiss.'",
        "'speaker_7': 'With I disagree. You know, you're entitled to your own opinions, but not your own facts. We get a lot of that in on our, you know, national administration. The other thing is, is that the business about animal behaviorists, this is a recognized, discrete profession that is helping.'",
        "'speaker_7': 'And believe me, I know I've got a little dog that we picked up at a Fix Long Beach event who has an attitude? He's a growler. It would have been curtains for him at Lbc's, because when I brought up the profession of animal behaviorists, which is part of the no kill nonfungible 11 point formula, I had Stacy'",
        "'speaker_7': 'Mongeau say in a kind of a cartoon cowboy action Armageddon. What does that mean? She brought up B.F. Skinner. Come on, now. B.F. Skinner is a recognized animal behavior who did a lot of work with.'",
        "'speaker_0': 'Pigeons.'",
        "'speaker_5': 'And.'",
        "'speaker_7': 'Like that. But. But we need, you know, to keep animals alive. We need some behaviorism. Compassion saves. What it is, is it's a way of giving killing.'",
        "'speaker_5': 'Ownership.'",
        "'speaker_7': 'To the public.'",
        "'speaker_0': 'Thank you so much. Next speaker before we speak, give me 1/2 to have I think Ms.. Case will be the last speaker. So I have anyone else, so my case will be the last speaker. Okay. Go ahead.'",
        "'speaker_9': 'Hi. Ashley Summers of District two. I'm also a shelter volunteer. I think that Compassion Saves is full of a lot of great intentions. But those intentions won't mean anything unless our shelter has its own comprehensive adoption program. During my orientation, I heard something really disturbing, which was that if we have our own adoptions, SPCA will not do'",
        "'speaker_9': 'any spay and neuter for us. First of all, as somebody who is an organizer for an animal rights organization, I find it completely unconscionable that such a wealthy group would deny basic health care to any animal who needs it, regardless of the circumstances.'",
        "'speaker_9': 'But also, I find it equally disturbing that in a city as wealthy and prosperous as this one, we can't afford to provide basic preventative health care for the animals under our care. I mean, wouldn't if we're worried about money, wouldn't it be a lot cheaper to make sure that we have the funds to spay and neuter and'",
        "'speaker_9': 'the resources to spay and neuter all of our animals rather than dealing with all the offspring of the animals that we did not spay and neuter. And finally, I have one more thing to say about the fact that we do have breeding laws on the books.'",
        "'speaker_9': 'And I want to thank you for that, because a lot of cities do not, but we need to enforce them. Too many people on Craigslist are flagrantly disobeying the laws and they need to be punished, not the animals that they're bringing into the world.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hello. Vince Poggi in Third District. And I truly appreciate the effort that was taken by council members to approach the problem we have. However, I would almost always prefer passion over apathy, but there are times when our goals can get in the way of communicating.'",
        "'speaker_5': 'It seems like semantics has complicated the issues concerning the approach to animal welfare. Stacy Dean Excuse me. Stacy Dean seems to understand the shared belief that no healthy, adoptable animals should ever be killed in shelters in our shelter.'",
        "'speaker_5': 'This is not just a government problem. It's a community problem. Best Friends Animal Society is the largest no kill animal shelter in the country and probably the world. Their goal and slogan is to save them all. By 2025, the number of communities have achieved this goal is just south of 4000.'",
        "'speaker_5': 'The number of partners in the Coalition is also in the thousands and grows daily. Many, if not most, of these communities have significantly less resources than we do in Long Beach. But they are open minded. We accepted the challenge and accomplish their goal.'",
        "'speaker_5': 'In short, no longer business as usual thinking. Long Beach unfortunately, has a unique obstacle in the form of SPCA, LA. Of all the credible and worthy adoption rescue organizations that exist, best friends comes to mind. Unfortunately, we seem stuck with them.'",
        "'speaker_5': 'I think if Stacy has a chance to succeed, she needs to be in charge of our animal care services and they need to answer to her. And I don't know how that's accomplished, but it needs to be looked at.'",
        "'speaker_5': 'Thank you for your effort.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Hello.'",
        "'speaker_7': 'Mayor Garcia and council members. My name is Andrea Hunt, third district. I would like to ask all of you, would you not.'",
        "'speaker_9': 'Agree that the best way to.'",
        "'speaker_7': 'Get animals out of this facility alive?'",
        "'speaker_9': 'It would be to have a.'",
        "'speaker_7': 'Very active adoption program. It has been said over and over and over again. These animals that are now declared not claimed by their owners because of the time that they have to be available for the owner to be picked up.'",
        "'speaker_7': 'That time is not utilized afterwards to groom the animal, to spay and neuter the animals so that they are ready for adoption. Time is wasted and I speak from personal experience. I took animals from a person who couldn't keep them any longer to the shelter.'",
        "'speaker_7': 'I had my name and number there and I said, Please let me know if you have any trouble adopting them. To animals were beautiful white cats, one long haired, one white short hair. They were not shown. They were in a back corner.'",
        "'speaker_7': 'They were disheveled, looking.'",
        "'speaker_9': 'I took them back.'",
        "'speaker_7': 'Out as a rescue where I can come back in. And I did.'",
        "'speaker_9': 'Run them.'",
        "'speaker_7': 'Myself. I wasn't satisfied. I took them to the groomer. I took them to the Irvine Shelter Adoption Fair. And they were taken and adopted as beautiful animals.'",
        "'speaker_0': 'Thank you so.'",
        "'speaker_7': 'Much, personalities.'",
        "'speaker_0': 'Thank you so much to you. Thank you very much. Next week, please.'",
        "'speaker_9': 'Hi, Anita Porter, second district. That's on a hunt. She is like my other mother now. And that woman has adopted thousands of cats. So you have to listen to what she says. I also want to point out that there have been mismanagement situations that have been going on in the been reported.'",
        "'speaker_9': 'There's been over 173 items that need to be addressed and there are specific problems with the leaseback. And it comes down to that situation that's going on with SPCA. We need to be separate from them. We need to I mean, I didn't realize that we were that as a city that that's a special thing, that we have'",
        "'speaker_9': 'our own shelter and it needs to be a shelter and it needs to be our shelter. As I said it last time I was here. We are Long Beach, and we're going to do this the right way. But in order to do that, we need more time.'",
        "'speaker_9': 'We need financial mismanagement to be addressed. We need the problems with the SPCA to be addressed. And we don't need. This is an excellent outline, and I am so thrilled that Stacy is here to do this. But what we need is more guts to this because there's just too many things that aren't answered yet.'",
        "'speaker_9': 'And without them in writing, we don't trust you. And that's what it comes down to. We. And if we don't trust you, we aren't going to turn our animals over to you. We're going to keep taking care of them because we know they'll be okay.'",
        "'speaker_9': 'And I'm you know, I got more cats than I should. I would love to be able to take them to to the to the shelter. So thank you so much.'",
        "'speaker_0': 'Thank you so much. Don't do this next speaker, please.'",
        "'speaker_7': 'Hello. My name is Pam Machado. I've been a volunteer at Long Beach Animal Care Services for four years. Before that, I was a volunteer for 11 years at SPCA, L.A. I live in the First District. I support Compassion Saves.'",
        "'speaker_7': 'I think that is reasonable and responsible model for shelter. And it puts most, if not all, of the programs in place to not only save, but also to help improve the lives of the animals that come into the shelter.'",
        "'speaker_7': 'And it is also a hopeful model. It is hopeful that the people who care about the animals will step up and help the shelter to achieve this. I think this is the crossroads that the audit was talking about, and right now is the opportunity to really improve the shelter and make it a place that the community wants'",
        "'speaker_7': 'to go and adopt animals. If all we do is complain about the shelter, nobody wants to go there. I I've read on lost and found page. Everybody says, oh, they'll be killed. Don't take the dog there. Don't take that cat there.'",
        "'speaker_7': 'So everybody thinks it's a horrible place. We can make it a good place, but people need to step up and do the work. And I think it's a time to call a truce to all of this and everybody just get together and actually do the work that needs to be done to make the shelter a good place'",
        "'speaker_7': '. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please.'",
        "'speaker_9': 'Good evening, everybody. I'm Judy Crumpton and my address is on file. I agree with everything Pam said. You know, you guys hired Stacy Danes to do a job. And what she is doing tonight is her job and she believes in compassion saves.'",
        "'speaker_9': 'And I'm asking you to believe in it, too. I have to agree. It was a little surprising when it came out and it didn't go before the task force first, and we didn't get a chance to look it over.'",
        "'speaker_9': 'But nonetheless, I think it goes along. It's just part of perhaps what we are going to do with the task force. We still have work ahead of us. There's no doubt about that. Only 90 seconds. Listen, I don't agree.'",
        "'speaker_9': 'You can adopt your way out of this mess. I agree. Adoptions are very, very important to do and I support them wholehearted. But we can spay neuter our way out. Please, let's. I'm used to this 12 years of these people.'",
        "'speaker_9': 'Nothing shocks me. They've had more than enough time to bring their specialists here. And they brought plenty of people to say plenty of stuff. You would think by now they would have convinced you guys, but you're too smart and they're not going to do it.'",
        "'speaker_9': 'So please never support no kill. And you main education is very important. This is just ridiculous. This is what they do on social media. This is what they do to people who visit our shelter. I was one of them that was bullied and I think we need to do something about that next.'",
        "'speaker_9': 'So thank you. And please go forward and support compassion saves.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi.'",
        "'speaker_9': 'I'm loving this vest that I have on because I think every one of you should be a volunteer. Because the reason why is we will not get enough of.'",
        "'speaker_2': 'These programs without more volunteers. And I'm almost here on tears right now.'",
        "'speaker_9': 'I was the one that spoke to Janine.'",
        "'speaker_7': 'It's really hard, you guys. Compassion. It's not. It's not. It's in the right direction, but it's not the ultimate goal. I'm sorry. I am for a lifesaving difference.'",
        "'speaker_2': 'I will always be, you know, kill.'",
        "'speaker_9': 'And and but I have to thank you for what you're doing and thank the women. I wish we would have more men who would support us. But thank you for.'",
        "'speaker_2': 'Listening to us. Because I have three cats.'",
        "'speaker_9': 'I have all three.'",
        "'speaker_2': 'Special need cats. I have one currently that's my own. That's at Primary Animal Care because it's having issues. But what we're doing here, like what Anna Wang said, is true. I'm on the task force. None of us brought this to our attention.'",
        "'speaker_9': 'We want to be a part of this equation. I'm part of the equation of being at the shelter, being.'",
        "'speaker_2': 'Here at city council, being on the task force.'",
        "'speaker_9': 'I do support the compassion saves to a degree.'",
        "'speaker_2': 'Because I've been told by certain individuals that that's a step. It's not the ultimate that we're going to move forward.'",
        "'speaker_7': 'For more.'",
        "'speaker_2': 'More security.'",
        "'speaker_9': 'I don't believe in SPCA and the direction that we have for relationship with them. There's definitely.'",
        "'speaker_2': 'Something there.'",
        "'speaker_9': 'The way that we currently do adoptions. I love that Stacy is making change, but she can't do it alone. So Devin and I are here to help. And so please, I ask.'",
        "'speaker_2': 'You guys, we need more volunteers.'",
        "'speaker_9': 'Thank you, Jenny.'",
        "'speaker_0': 'Thank you. That concludes public comment. Let me go back to Councilmember Pearce.'",
        "'speaker_2': 'Thank you, everybody. And I want to say thank you so much for keeping your comments focused on the item that's in front of you. So I want to first I want to say that I would like for this item to for the compassion saves model to be given to the task force to review, to evaluate and to'",
        "'speaker_2': 'give direction on that is the intent of this item to give kind of the box so that you guys have something to work on. It was not the intention to write policy and to do the fine tuning of a department.'",
        "'speaker_2': 'We never do that as council direct every single detail of a department. So I hope that you guys walk out of here understanding that that is the goal of this, which is exactly what you've asked. And it took a lot of work to get here.'",
        "'speaker_2': 'It took meetings with, I believe it's four meetings with the note kill group and phone calls with people and coffee and people's homes nine in the morning going line by line. And so your commitment and your passion is why we are here today.'",
        "'speaker_2': 'And so I want to thank you for your comments because it does pay off. Specifically, I would like the task force to to look at what it would take and hopefully get us to a place where we have an independent adoption program.'",
        "'speaker_2': 'An independent adoption program. And I know that that is a tough task sometimes to think about, but we are not going to be able to get to an independent adoption program. And so we do the very first step, which is understanding the relationship with SPCA and our shelter.'",
        "'speaker_2': 'And I know that my co-lead on this item, Council one, the Councilwoman Price, is going to give some of the the details to that and trying to get that information to come back as soon as possible. We need to have that information that we don't have.'",
        "'speaker_2': 'And I'm going to let her so we don't echo our comments, talk in detail about that. I will say that I hope that whatever we have come back from the city attorney that comes from as councilwoman pries, that that comes back at a reasonable time, 30, 60 days, so that we can really understand where we're at with'",
        "'speaker_2': 'that so independent adoption program that we have open admission and that that that is defined by having reduced or no fees for relinquishing your pets at our shelter. We know that that has to happen to be able often when people have a pet, particularly dogs, it's expensive, it's time consuming, it's more work than some people understand.'",
        "'speaker_2': 'And they need to know that they can safely take their pets somewhere that will not euthanize them. And so that is what an open admission shelter means to me and I think means to many of you. So this is hopefully a step to get us there where you feel that trust and that we get that put into'",
        "'speaker_2': 'policy down down the road, clear as day. I would like also to have the task force and city staff look at what is currently happening with our adoption fees and making sure that those are going to our spay and neuter fund and understanding what that balance is and what.'",
        "'speaker_2': 'What we need to do to ensure that everybody, including the SPCA, is paying those adoption fees so that we can have a spay and neuter program on the front end. That will be meaningful. I do not believe that any one solution, adoption or fostering or spay and neutering, not one of those is going to get us to'",
        "'speaker_2': 'a no kill shelter or a 90% rate. But it is going to take all of these measures to get us there. I also want to make sure that we call out in this again. And this was general for that reason, because it's not my intention to direct policy in that way.'",
        "'speaker_2': 'So I appreciate the task force and you guys will have a chance to go through this. I also want to make sure that we when we talk about our robust communication program, that we have an understanding of what our communication team at the shelter has right now.'",
        "'speaker_2': 'How are we relaying that information to our constituents, to the neighboring cities about what animals are available and that we have an understanding of the resources that you have now that we gave you in the last budget. Is that enough and will it take more?'",
        "'speaker_2': 'My expectation is that you guys do the work in the task force looking at the compassion saves model and defining what the compassion saves model is. It is not for staff to define. It is not only for council to define, but is for us as a community together to define.'",
        "'speaker_2': 'And that is why we wanted to start this conversation. So you have that work ahead of you in the next several months, along with the community members that come to the task force. I look forward to having the conversation about all of these programs.'",
        "'speaker_2': 'I look forward to the budget conversation on what it's going to take to make this real. And I asked that my colleagues join us in voting yes to ensure that a compassion saves model is something that really does save lives and gets us to the lowest euthanasia rate possible.'",
        "'speaker_2': 'So thank you again for my colleagues for working on this with us.'",
        "'speaker_0': 'Thank you, Councilmember. Councilwoman Price.'",
        "'speaker_8': 'Thank you. I want to first start out by thanking my colleague, Councilmember Pearce. We we joined forces on this item. We actually had two items that we merged into one and were both kind of leading a different part of the item.'",
        "'speaker_8': 'So I'm happy that we're having this conversation. It's been many, many years that we've heard from the various groups. And and to be quite honest, it wasn't until recently that I actually understood how the conversation should be framed.'",
        "'speaker_8': 'And I've shared with the advocates that sometimes when we feel passionately about something, conveying what it is we're trying to say in a way that allows us to be heard is difficult because there's so much passion behind it.'",
        "'speaker_8': 'So I appreciate the respectful dialog that those who have requested to meet with me have had with me. It's allowed me to see things from a from a different and I think clearer context. So and I think that's the reason we're having this conversation.'",
        "'speaker_8': 'So you know who you are. Thank you for allowing that respectful dialog to get us to this point. I echo what Council Member Pearce has said in regards to this being a starting point for us and us being able to work in collaboration with the task force to further define practices and policies as we move forward.'",
        "'speaker_8': 'I do think it's a good starting point. I'm grateful that we have our new director with us, animal care services director with us. The portion of the item that's mine and one that I intend to follow up on at every step of the process, is understanding some of the details of the discussion.'",
        "'speaker_8': 'And let me tell you what I mean about that. A lot of times we behind the dais and even out in the community have debates with people about various issues. And what I have always said is that I'm happy to debate anyone about anything and agree to disagree if that's the case.'",
        "'speaker_8': 'But it's important that we're all operating on the same fact sheet because if we're having a debate and somebody is under one set of facts and someone else is under a different set of facts, look, given my profession and my training, there are some things that are gray areas and some things that are disputed.'",
        "'speaker_8': 'But there are a whole lot of facts that are undisputed if we take the time to ascertain what they are. And from there, I think we can have a solid foundation for a debate. And the problem that I've had with this issue for a long time is that there is a lot of assertions or allegations or statements'",
        "'speaker_8': 'that are made that we've never actually been able to fact check or ascertain, allowing for us who are not experts in that industry, to not be able to get into the weeds on some of the things. And not that I'm saying, I want to get into the weeds.'",
        "'speaker_8': 'Trust me, I don't that's why we we hire staff that are special specialists in this area. You don't want a prosecutor making decisions about animal care services. You want an animal care specialist to be making decisions about animal care services.'",
        "'speaker_8': 'We're here to get data and help lead policy, but we're looking for direction and leadership from Stacy and and her her supervisor, the director of their division, to help us lead. That framework. But I do think there are a few issues that have come to light, whether they have merit or not, I don't know.'",
        "'speaker_8': 'But I cannot continue to have this conversation without for myself knowing some pieces of information. So the portion of the agenda item that that I wrote up and one that I hope to continue and I will I expect staff will keep us updated with this.'",
        "'speaker_8': 'I do expect we'll get a report back, but if not, I'll probably agenda is another item to get this information. And I'll tell you why. What I wrote in the agenda item is the city has welcomed a new director for the Animal Care Services Division, and this development presents an opportunity for us to review our existing relationships'",
        "'speaker_8': ', practices, commitments and policies and to realign the same as we develop a strategic plan. Accurate information regarding the inner workings of the agreements between the Allied partners will help set the framework for a solid foundation from which to engage in discussion and debate.'",
        "'speaker_8': 'Without this information, speculation and implication may lead to poor policy and or distrust in the direction we determine is the best course of action for the city of Long Beach. What do I mean by that? And also I'll express it very clearly so.'",
        "'speaker_8': 'When I talk about specific information about inner workings with we've talked and Stacie touched about in her presentation to us a few weeks ago about that the just in general she went over the lease relationship and the relationship of the parties.'",
        "'speaker_8': 'We do have allied partners, obviously, and I think it's important for us as a council to understand the terms of the lease agreement with a little bit more clarity. So what and I'm not saying we need to know necessarily the terms of the lease agreement, but in general, we need to know what are the terms of the'",
        "'speaker_8': 'lease agreement? What are the responsibilities of each entity? Is there compliance from each of the entities in regards to the expectations and the understandings of the parties in regards to their various obligations under the lease agreement? So that's something that I would like included in this item in terms of a report back and whether that's the city'",
        "'speaker_8': 'manager who does it or whether it's the city attorney. We'd like to identify, you know, where we're at. And are there opportunities for us to have a little bit more compliance with the terms of the agreement in terms of the different facilities?'",
        "'speaker_8': 'You know, I would like us to understand what is the allocation of space in the context of the intended use of the two facilities? Are we exercising best practices in terms of the allocation of that space? And that can come back as a report.'",
        "'speaker_8': 'Back with the opinion of our Animal Care Services Director. I do think I was here when we went through our spay and neuter policy and enacted that. I think it's an interesting point that has been raised regarding the spay and neuter trust account.'",
        "'speaker_8': 'I'd love to get a report back on that. What is that account or what? What or what are we using it for? What options do we have for the future? And then there's one thing that and I don't know what the answer to this is, but there has been repeatedly allegations that there are aspects of the lease'",
        "'speaker_8': 'that have been kept confidential. And I don't know if that's true and I don't know why that is. And perhaps that's the subject of closed session. I don't know. Mr. Parking, are you aware are there aspects of this lease that are confidential?'",
        "'speaker_5': 'There are no aspects of the lease I'm aware of. They're confidential.'",
        "'speaker_8': 'Okay. So that's what I had heard as well. And that struck me as odd. You know, I don't really read anything into it because even if there were aspects that are confidential, I'm mindful of the fact that there are legal agreements at times or for protection of the parties.'",
        "'speaker_8': 'Things will be kept confidential. That's not an issue for me. I just know that we've heard that allegation repeatedly, and I'd like some clarity on that. So for me, what I would like is, you know, we get a lot of reports back from city staff with a lot of information.'",
        "'speaker_8': 'And sometimes the reports back that we get are very general and somewhat vague and more have a theme as opposed to actual data. The report back that I would like on this item is actual data so that to council, so that we can have if we're hearing something at the podium that is not accurate, we'll be able'",
        "'speaker_8': 'to know that based on the data that we have. If we're hearing something that is accurate and there's an opportunity for us to improve, then that allows us an opportunity to grow from the data that our staff is providing us.'",
        "'speaker_8': 'I want the staff. No. No disrespect to the audience at all or to the advocates. I want the data from our staff because it is that data that's going to drive our policy so we can debate the data once we get it.'",
        "'speaker_8': 'But let's get that data and the methodology that was used to get that data. Let's trust that methodology together. So if there's a question as to the methodology, we can talk about it. But let's start with the same set of facts.'",
        "'speaker_8': 'And from there we can build because one thing in this debate that for five years I have felt very strongly about. Is there's a lot of allegations, but there's not a lot of data and there hasn't been. So we need to know that information so that we can move forward.'",
        "'speaker_8': 'So I am requesting as part of this item that we receive a report back within 60 days regarding the specific items that I mentioned in regards to the lease agreement, the facility evaluation, the spay and neuter trust account.'",
        "'speaker_8': 'And that's it.'",
        "'speaker_0': 'Thank you, Councilwoman. Guys, please note nothing from. From the dais, please. I mean, from the audience right now.'",
        "'speaker_8': 'Yeah, and. Oh, I'm sorry, Mr. Mayor. Of course, I forgot when I was talking about the lease agreement. I know that each entity has responsibilities in terms of what they're responsible for, maintenance payments, that kind of thing, what utility bills, things like that.'",
        "'speaker_8': 'So what are the different responsibilities and are we all in compliance? If not, is there an opportunity for us to improve? So I just want to get a handle on that because that information, I believe, has to come to me from our staff.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you so much, Councilwoman. Councilwoman Mango.'",
        "'speaker_9': 'Thank you. I agree with a lot of what Councilwoman Price said. My methodologies are a little bit different. And again, it's unfortunate that both the current shelter manager and I have the same name because oftentimes I can't tell if you're making false statements about me or I didn't hear something she'd said, and that's unfortunate.'",
        "'speaker_9': 'I want to thank a couple of quick people. Ashley, I cannot tell you how much I agree with so many of the things you said. I think you're very bright and poignant in the things that you said and specifically how you said them.'",
        "'speaker_9': 'Pam, thank you for the work that you've done. I think the overarching thing that we all can agree on is two parts. One, save all the animals by 2025. And I think that we could get there. And I think that the goal of the Winograd methodology of no kill is saving every adoptable animal with a standard of'",
        "'speaker_9': 'adopting out 90% of the animals and having a really high live release rate. And I know that it can be frustrating when so I bring all my animal stuff that I've had from all of you. And I read that stuff and I look into it and I want to agree with Councilman.'",
        "'speaker_9': 'Price apps that even within your own information that you provide us, there's conflicting information. And so it's very difficult to get to the bottom of it. So I want to do a couple of things. This Council did not write the contract with SPCA.'",
        "'speaker_9': 'And I think this council would agree that in the current economic climate and the current. Success of the city of Long Beach. If we were going into an agreement today, it would look very different. But the city, the city, as it was then, was a very different city.'",
        "'speaker_9': 'And and animals might not have been as high a priority to that council. However, in looking at this agreement, the document that continues to be stated as confidential is cited on page five of the agreement listed as Exhibit B, and I would be interested in reviewing it if it is confidential.'",
        "'speaker_9': 'I'd be interested in reviewing it in the city attorney's office for me to know and understand and read what's in it. But if it is not.'",
        "'speaker_5': 'I believe Exhibit B is a floor plan and it's a public document.'",
        "'speaker_9': 'Okay. In some of the information provided by some of the volunteers that is listed as one of the complaints is that they can't see the specifics of a specific page. So maybe I misunderstood that. But specifically on the notes it says, where's exhibit B?'",
        "'speaker_9': 'And that parts of this are confidential. So I'm happy to go into that again. If I if I wrote that down again, we go we went over like 200 things in an hour and a half, so maybe I'm missing what part of it was confidential, but it says if the city attorney says it's not confidential, I'm happy'",
        "'speaker_9': 'to figure out what the group still thinks is confidential. I see that. I see the document you're showing yet it's still listed. So. To get to our own adoption program. The first step was taken by this Council with the support of Councilmember Austin and Councilman Price.'",
        "'speaker_9': 'Budget oversight. Last year, when we first funded a full time adoption coordinator, that is the first time in a long time that the city has had a person who is dedicated to that, and that person has only come on board within the last 60 days.'",
        "'speaker_9': 'And so I know there's a lot of training. I read the staff email that went out. I have a lot of issues with the current. The current strategy of the adoptions between the two facilities and the signage. However, I also recognize that Ms..'",
        "'speaker_9': 'Staines has been on on staff for just a few months. And while I was not bringing this item forward, I want to thank Councilmember Turanga, who is also working on a similar item. And many know that I try to work directly with the shelter manager and the Parks and Rec director consistently, and I don't always think that'",
        "'speaker_9': 'an item is necessary. However, I appreciate my council colleagues, Price and Pearce, for asking me to be a part of the item because I am involved in some of these things, some of the reports that are being asked for in this document.'",
        "'speaker_9': 'Ms. Daines has already started on and started on them right after she met with each of us back when she came on board. So I expect that a lot of these reports will be coming soon. I also feel very strongly that the definitions really need to be decided through a community input process.'",
        "'speaker_9': 'There are lots of tools to do that. I think that we've consistently said that that's the direction we want to go. I think that's the direction that Ms.. Daines and I communicated a few weeks ago in our open forum.'",
        "'speaker_9': 'I know I've received a considerable amount of criticism for the type of set up for the forum, but I was a guest, as was she. And so I hope that that no one thinks less of her for the way that the forum was managed.'",
        "'speaker_9': 'But we are guests and we were there as their guests in the methodology in which they allowed us to be there. And I have never said no to a meeting with any of you. Not to mention the number of times I've been stood up for meetings where I sat around and waited for people to show up or'",
        "'speaker_9': 'they canceled on me with no notice. And so I want to meet with you. I am happy to talk with you. I'm happy to go to the bottom of what different documents are and and the criticisms of the shelter.'",
        "'speaker_9': 'I'm there often. I know. I just missed Alex walking to his car two weeks ago when I was walking in. But those dialogs don't happen at 90 seconds of you saying similar things over and over again that we still misunderstand because there's so much conflicting opinions about what that is.'",
        "'speaker_9': 'So I will state what I have stated for five years, and I know that Ms.. Daines and I have an understanding that this is coming more quickly. She's the first shelter manager that has a a real understanding of the chameleon system.'",
        "'speaker_9': 'But all of that data should be on our open data portal. There should be no need for public records request. You should be able to click on it and see specifically what's in Chameleon. It should be available to you immediately.'",
        "'speaker_9': 'And we've said that over and over again. There are open data being portals that have been built by other agencies that can be overlaid on the system we have. I spoke about it with our prior IT manager who was reluctant and the Open Data Task Force was not.'",
        "'speaker_9': 'Excited about animal data, but I am appreciative that both Leah Erickson, our new TY manager, and Ms. Daines are very excited to give the data freely and if there are mistakes with the data that we can correct it because unless we're all looking at the same information, it's very frustrating.'",
        "'speaker_9': 'So I want to end with thanking the more than 150 active volunteers at our shelter. We are getting, on average, 30 applicants a month to work at our shelter, and a lot of that is because of the the word of mouth of those who currently volunteer there and are feeling very fulfilled.'",
        "'speaker_9': 'We know it's not perfect and there's a lot we can continue to do. But I guarantee you, if you volunteered there five years ago, it's a different place already. It's a different place than it was two years ago.'",
        "'speaker_9': 'And we're still making strides. And I agree it is not fast enough. My method is to continue to provide suggestions on how to make it better. And if your method is not that I understand and respect it, but please don't disrespect the methodology that I use for for my advocacy for making a difference.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_0': 'Now some are super not.'",
        "'speaker_10': 'Thank you. First, I didn't plan on saying this, but of all the items I thought would be brought up here tonight, I didn't think gender would be one of them. So I want to assure you that there was a male involved in this.'",
        "'speaker_10': 'That was myself. I think I held the very first community meeting where Stacey Daines appeared. Is that okay? She's given a thumbs up. And so we've been involved in this from early on. I want to get into the issue that Councilwoman Pryce brought up involving the contract with SPCA.'",
        "'speaker_10': 'And I guess I would like to get into the weeds a little bit here. So, staff, can you tell me, is there a possibility there are business units in existence that are not licensed? And do we need to look after that?'",
        "'speaker_10': 'Or is there a plan moving forward to get into that?'",
        "'speaker_5': 'Yes. Councilmember So there was a question on business licensing raised about a month ago about whether or not a specific grooming license was was at the right location. So staff took a look at that and found that it was more of a ministerial, just needed to be added to the description.'",
        "'speaker_5': 'But today it was come to our attention that there's also the potential for a retail license in a really quick look. We don't see that on record and on file, so we'll be heading out there tomorrow to make sure we know exactly what's going on and get the right licenses.'",
        "'speaker_5': 'But we are going to look at that and come back to you.'",
        "'speaker_10': 'So I endorse or I support the notion of sending everything to the task force, but this is something that I think can be addressed immediately. I think that if there are revenues to be collected, whatnot, we need we need to get right on that.'",
        "'speaker_10': 'Also, just in terms of the contract. The discussion is like this is an ironclad document and I'd like staff to weigh in on, on, on it. I don't think that's a fair description of what we have going right now, that it is a I don't want to say a work in progress, but it is something that we'",
        "'speaker_10': 'can make adjustments on on the fly. Would that be accurate?'",
        "'speaker_5': 'Councilmember I think that is not accurate. I think there's an existing agreement and to change it, amend it or modify it requires the consent of both parties.'",
        "'speaker_10': 'Okay. Thank you. So that would lend itself to the notion that this this needs to be vetted at the at the level that was suggested by Councilwoman Price. I think that's it. And this might be a Brown violation.'",
        "'speaker_10': 'So pick up. Charlie, you know, of all the things that have come to our office over the years, the policy on barking dogs has been one that just seemed to be not working at all. So if that's something that the task force could look into, that would be wonderful also.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Andrew.'",
        "'speaker_4': 'Yes, thank you very much. I want to thank you, Congressman Supernova, because the fact that I've been here for every one of these and I want to thank everyone of the animal activists, you know, because the care and compassion that you have for your animals and I think everyone should have that same form of compassion, because, remember'",
        "'speaker_4': ', that's something your animal becomes some of the individuals who don't have kids become like your kid. And that's what I really applaud you, because the fact that I see your compassion, I feel your compassion. But I think here, because my office has been numerous and, you know, cause concern and compassion, save and kill and Nokia.'",
        "'speaker_4': 'But but I believe that we can do better in the management and the Animal Control Service. And I'm looking forward to report, you know, for my city manager. You know, I'm very pleased with the appointment of Mrs. Dion as a new head of the Albuquerque couple, because she strikes me as a very compassionate and professional manager who'",
        "'speaker_4': 'can help us, I think, through these tough, tough times, because the fact that you wouldn't come here every Tuesday to, you know, to express your opinion, your feelings about your animals, and I think everyone deserves animals. So that's what I really will stay and listen to and because I am compassion about it also.'",
        "'speaker_4': 'So with her leadership, I believe that we can get to these, you know, get to the point where the animal activist can be happy and with the service provided on behalf of our animals in Long Beach. So I want to thank you again for coming out and giving your concern and compassion.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Richardson.'",
        "'speaker_10': 'Just wanted to chime in and thank everybody for coming out and speaking. You know, we had a good study session on this. I learned a lot during the course of that study session. I look forward to really seeing our new director in action and seeing how she engages on this on this issue and supportive of the motion'",
        "'speaker_10': '. Thank you.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_11': 'Thank you. I just want to weigh in as well. I did have a little bit of concern early on listening to the public comment in terms of the the intent and need for this this item. But after I thank you, Councilmember Pearce, for for and price for for explaining it a little bit further.'",
        "'speaker_11': 'I will be supporting this. I do think to the the no kill advocates, your passion is is something that is very, very admirable. And we we very much appreciate you. Your advocacy is saving lives and raising the consciousness of of everybody in our city regarding animal care.'",
        "'speaker_11': 'Spent a lot of time at the dog park. I was there just this weekend and talking to two neighbors about and one guy I met who actually rescued about six little dogs. And he comes to the park every single day and he has just a great heart.'",
        "'speaker_11': 'And so what we're dealing with here is with advocates with with huge hearts. And so, again, I commend you all. I do think that our new director or bureau chief of the Animal Care Division or Ms.. Danes needs an opportunity.'",
        "'speaker_11': 'And from what I hear, there's a lot of confidence in her ability to turn this department and this program around. I think we need to give her that opportunity to do that, give the compassionate care, an opportunity to succeed.'",
        "'speaker_11': 'I heard from many of you. We're headed in the right direction. And let's let's keep that in mind. We're a lot better today than we were a month ago. Two months ago. And your advocacy, I think I think we are.'",
        "'speaker_11': 'I think we are. We're moving in the right direction. And at the end of the meeting, I'll I'll announce, but I'll announce as well. We will be having a Holstein Ms.. Dame in the eighth District at the Expo on Monday.'",
        "'speaker_11': 'If you want to come out and have a meet and greet, for those of you, particularly my constituents who haven't had an opportunity to weigh in or to meet her. We're inviting everybody to do that. But I will be supporting this motion.'",
        "'speaker_11': 'And again, I thank you for coming out and sharing your thoughts.'",
        "'speaker_0': 'Thank you. Thank you, Councilman. And before we have Councilman Pearce kind of wrap up and then we'll go to a vote, I'm going to make a couple a couple comments. The first is I want to, again, thank everyone for coming out.'",
        "'speaker_0': 'That is has shown consistent passion and love for our animals and our family members of which they are a part of. I want to just again say something I said at the last time that this we discussed this issue.'",
        "'speaker_0': 'And I think we have hired an excellent manager for the department. And I want to make sure that she knows she's heard it from me both in private and in public, that she has my complete confidence and I believe is going to prove to the community that she is going to take our shelter to an even more'",
        "'speaker_0': 'progressive place and in a more progressive direction. Long Beach has a strong tradition of implementing progressive policies, and I think this is another step in that direction. I think that, Ms.. Daines, everything I've heard from her this in this process, I think has been admirable.'",
        "'speaker_0': 'And I think her ability to work with the community is is important. I also really appreciate what Councilwoman Pearce, Council, Councilwoman Price, Councilwoman Mango, everyone has said as it relates to giving the manager an opportunity to actually manage and develop our programs.'",
        "'speaker_0': 'What we have in front of us today is a broad policy policy direction about supporting a model that the manager has asked and wants to implement at the shelter. So I think that that the the kind of broad strokes that are in this agenda item, I think, allow that flexibility for the manager and also allow the flexibility'",
        "'speaker_0': 'for the task force to engage on many of the items are within the policy. I want to say a few things because the task force has been brought up a few times. Number one, I want to thank them again.'",
        "'speaker_0': 'These folks are volunteers and every single one of them loves our animals and wants to save lives at the shelter. And so I want to thank them for their service. And I think that they are consistently at the table listening to comments and trying to navigate a very complex and passionate topic.'",
        "'speaker_0': 'And so I know some of them are here, and I just want to thank you guys for your work. I mean, it really means a lot to the city. And you guys have been doing this work for a long time.'",
        "'speaker_0': 'No one is are you guys, you know, our, you know, receiving a handshake and a pat on the back for all that you guys are going through. And so I want to thank you for that. I also want to remind folks why the task force was formed.'",
        "'speaker_0': 'There is a process that has happened. When the audit was called and the audit was completed. One of the key items in the audit. Was to ensure that the community was a community process to develop a shared vision for the shelter.'",
        "'speaker_0': 'In creating the task force that is part of that recommendation. In addition to that, the the audit speaks to the strategic plan, which is also being developed and being worked on by the task force. The City Council will always retain the broad policy direction to direct and provide overarching policy to our departments and to the city.'",
        "'speaker_0': 'That's part of the responsibility of of the body, and it always will be. I also want to say that I support completely the recommendations as they relate to what's being listed in in this motion. I think Councilman Councilwoman Price's questions and request of data is exactly right, because I've been saying I think the same thing, Stacey, to'",
        "'speaker_0': 'you. It's like we have to all be using the same. There is a we don't we haven't even agreed on what the facts are and what the and what the correct data is. And we have to get there for us to make the right decisions.'",
        "'speaker_0': 'And I think the I keep hearing that we're not going to have a robust adoption program. That is what if Stacy's top goals is to implement as strong, independent and robust adoptions program. And that is something that she has verbalized, I think, to probably all of us on this body and is working to develop.'",
        "'speaker_0': 'And we are supported and supportive and looking forward to that process. On on the other issues that are on here, I just the only one that I will mention and I'll mention this because Councilman Pearson, I've had some good conversations as part of looking at the adoptions programs.'",
        "'speaker_0': 'One of the things that I'm excited for the task force to look at, I think it might be even being brought to your ad at your next meeting is Long Beach. Unlike most cities of our size or even the county allow less adoptions per household than most jurisdictions.'",
        "'speaker_0': 'So if you look at, for example, most cities, whether it's the city of Los Angeles, the county of Los Angeles, San Francisco, San, you name the city. Almost all.'",
        "'speaker_5': 'Cities.'",
        "'speaker_0': 'Provide more opportunities for people to adopt per household than the city of Long Beach does. And to me, that isn't easy. We need to come up with what the right number is for Long Beach. And that's something that I hope the task force also helps give us, gives us direction in this it within the scope of looking'",
        "'speaker_0': 'at adoptions as it's listed in in this in this item. And there are there are small changes like that in many others that you have advocated for that are all going to lead to a better shelter and better program and better department.'",
        "'speaker_0': 'I know there's a lot of folks that are frustrated. I get that. But I'm actually optimistic. And I've been optimistic since this work started. And if you go back from the work of advocating from I mean, Joanne, from the early days of you coming and advocating and others to the audit, to people being frustrated because it wasn't'",
        "'speaker_0': 'being done fast enough to getting good recommendations. To my commitment to ensuring that we have a qualified, excellent leader at the head of our department to the task force. Work to the engagement. This entire council, everyone on this body cares about animals and is working very hard to ensure that the work is happening to the advocacy.'",
        "'speaker_0': 'All of this put a big pot together. Is going is going to come out a much better shelter. And I want to also not lose lose sight that while we have been developing this shelter, the overarching the overarching work of continuing to decrease euthanasia and continuing to increase adoptions and continue to reform the shelter has been ongoing'",
        "'speaker_0': 'through the staff work. And there are we have staff members at the shelter and volunteers at the shelter today that also need to feel supported. And so I want to again publicly thank every volunteer and member of the team that is currently at the shelter that is working hard to save animal lives every single day.'",
        "'speaker_0': 'So I want to give them a round of applause for their amazing work that they do. And I'm great and I'm very, very grateful for them. And so I think this is an important step forward. Thank you to Councilmember Pearce, Councilwoman Price, Councilwoman Mongeau and Councilwoman Gonzalez, who presented this and everyone else who I know supports as'",
        "'speaker_0': 'well. I think this is an important step. And and we should pass the baton to our shelter manager and to the task force so that we can continue moving this forward. So with that, I'm going to turn this over to Council Member Pearce.'",
        "'speaker_2': 'Thank you, Mayor, and really thank you to this council. I think often we find ourselves where we repeat each other's moments or we have some debate. And I think what was great about this item tonight is that each of us lifted up an area that was important to us that reflects some of the concerns that everybody in'",
        "'speaker_2': 'the community has had. As much as I believe from meeting with the majority of the people here, that this council has done a great deal to reflect those concerns and to be strategic and organized and methodical about how we continue to move forward.'",
        "'speaker_2': 'I'm really at a. Very pleased to be at this point tonight to feel that momentum going forward, to pass the baton. And I look forward to the next several months of that work coming back. A couple or just closing closing thoughts?'",
        "'speaker_2': 'I support everything that the council members have asked for and said in the 60 day report. I just want to make sure that I call out the code number 6.04.070.'",
        "'speaker_5': 'I'm not sure that's the right code section, but we'll certainly look at the code. Section 007 is.'",
        "'speaker_2': 'The one around this.'",
        "'speaker_5': 'One business at two locations. I think you're asking us to look at two businesses at one location so.'",
        "'speaker_2': 'That that.'",
        "'speaker_5': 'Looks okay.'",
        "'speaker_2': 'So that's one of the codes. The other code that I took a photo of the actual code and I'll make sure you have it, but it's the one around the spay and neuter fund and making sure that adoption fees go into that fund.'",
        "'speaker_2': 'So just to clarify and I'll say anything that's worth doing is going to be difficult. It's going to be hard, and that means that it's worth doing. As a mother of a six year old having compassion for animals and working really hard to create a shelter where people want to come in side and volunteer and spend their'",
        "'speaker_2': 'time is really important. And so I do believe I don't often refer to things like God's work, but I believe this is God's work, making sure that we are caring for those that are the voiceless. And so I want to just read out loud the motion, the recommendation one more time for four staff.'",
        "'speaker_2': 'I also want to thank those that signed a letter today. So there's several members of the community that signed on that letter in support. So I want to verbalize my appreciation for them. I want to make sure that we're directing the city manager to work with the Parks, Recreation and Marine Departments to implement the Compassion Saves model'",
        "'speaker_2': 'as the operational approach for Long Beach Animal Care Services and ensure the direction is reflected in our strategic plan. Providing a report that the existing relationship and recommendations for improvements in policies and practices between the SPCA and Albuquerque maintain facilities and financial conditions which are most conductive to promoting increased adoptions at the box facility.'",
        "'speaker_2': 'Devin I'm sorry. I wrote on a different page I had. See what happens whenever you write too much. Yes. Thank you. Approve the recommendation to implement compassion, saves approach and have staff work with the task force to assist developing the policy in items listed.'",
        "'speaker_2': 'And so with that, thank you guys for continuing to make history and make sure that our city is moving forward to save as many lives as possible.'",
        "'speaker_0': 'Thank you. Please cast your votes. It was up there, just.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to Increase appropriations in the General Fund in the City Manager Department (20) by $2,500, offset by the Third Council District one-time District Priority funds transferred from the Citywide Activities Department (70) to provide funds to California State University Long Beach for producing an animated Fireworks Public Service Announcement that would be available to the City in our campaign to mitigate the use of illegal fireworks; and   Decrease appropriations in the General Fund in the Citywide Activities Department (70) by $2,500 to offset a transfer to the City Manager Department (20).": [
        "'speaker_0': 'Okay. Well, thank you very much. That concludes that item. And we will move on to the next item. Let me get back to we're actually going to take the fireworks item first. Next, please.'",
        "'speaker_1': 'Communication from Council. Councilwoman Price Recommendation to increase appropriations in the General Fund in the City Manager Department by 2500, offset by the third Council District one time district priority funds to provide funds to CSB for producing an animated fireworks public service announcement.'",
        "'speaker_0': 'Thank you. I mean, turn this over to Councilman Price.'",
        "'speaker_8': 'Thank you. So this item came about as a result of a third district fireworks advisory group that we put together. These residents worked diligently over the course of several months to evaluate best practices in regards to illegal fireworks in other cities and to implement some best practices and some proposals that could be implemented in the city of'",
        "'speaker_8': 'Long Beach. We have taken their recommendations and little by little brought items to council to try to implement several of the recommendations that this committee made. And last year, we produced a video that was a PSA regarding fireworks in response to how they impact pets.'",
        "'speaker_8': 'So for our No Kill Folks was an awesome video. This year we wanted to partner with Cal State, Long Beach, and I want to thank resident Ken Weiss, who's here for really heading up that effort and connecting us with Cal State, Long Beach and their film department to create an educational PSA that will the city will be'",
        "'speaker_8': 'able to use to help educate and address illegal fireworks here in the city of Long Beach. At the elementary school level. So tonight, I haven't even seen the video yet, but tonight we're going to preview the video and we're going to have an opportunity to hopefully share it with our fire department so that when they do their'",
        "'speaker_8': 'outreach with elementary school kids, they can show this video. So I'm going to invite our the committee chairperson, Ken Weiss, and Soy Yan Kim from Cal State Long Beach to speak briefly on this topic. So I don't know if I pronounce the name correctly, but if you are here, please come on up and can.'",
        "'speaker_8': 'Of course, come on up.'",
        "'speaker_4': 'Good evening, Mr. Mayor, and city council members. It's been a long time, but it's been a long.'",
        "'speaker_5': 'Journey for us over the last two and.'",
        "'speaker_4': 'A half years, putting this whole thing together. And it's it's really been an amazing journey for all of us on the committee. And we have several people from the committee here tonight that I just want to point out.'",
        "'speaker_5': 'Eric Whitney, if you will stand or raise your hand.'",
        "'speaker_4': 'So everybody sees you and Jeff Dawson and several of our committee members were supposed to be here, but they had other commitments and I couldn't make it. I would like to. First of all, uh, after it's been a.'",
        "'speaker_5': 'Year since we were here and at your.'",
        "'speaker_4': 'Council chambers and presented a, uh, a report on the findings of our committee and recommendations. Shortly thereafter, we started talking to Cal State Long Beach about producing a, a video that could, as the councilwoman described, could go to the children.'",
        "'speaker_4': 'Because you can cite.'",
        "'speaker_5': '40 year old guys all day.'",
        "'speaker_4': 'Long for shooting off fireworks. What we really need to do is change the culture. And only way to do that is to reach out to the kids. Tonight we have. First of all, I'd like to thank all of the Cal State Long Beach students.'",
        "'speaker_4': 'They're here tonight, the designers of the videos, and there's three of them. You're only gonna see one of them tonight. I want to speed this up a little bit, because I know you have a lot of things to do, but I to ask and to come down over and behind this and sign you and Tonya really kind'",
        "'speaker_4': 'of. Oversaw the whole production of the videos and it was pretty amazing to see it from start to finish if you haven't seen how a cartoon is made. It's a pretty mind blowing experience. It really, truly is. A lot of moving parts that you would never even think about.'",
        "'speaker_4': 'And Tonya kept the whole thing together for us. And what you can see is an amazing video and an is was the Tuesday head of the group student group who produced the video you're going to see. And I just have to say, they did a great job.'",
        "'speaker_4': 'And I'm going to turn it over to Sonia. And she can turn over to Anne and. I hope you enjoy it. And the other thing is that you should know that that while the cartoons are being produced, the fireworks committee went out and worked in creating a a distribution partnership between the committee and the community.'",
        "'speaker_4': 'And we have tonight 75 organizations within Long Beach who are now distributing the cartoons. They were rolled out last night and they are out in the community. And the 75 organizations, some of them small, some of them big, and some of them are education based, some are recreation, some are animal based.'",
        "'speaker_4': 'Some are businesses that all stepped up and said they would put the cartoons out in in the community on our websites and in Instagrams on Facebook. And so the reach of this thing is going to be huge. I don't think it's a first time.'",
        "'speaker_4': 'It's just going to be it's going to blow everybody's mind, I think. So with that, I'll have them come down and show you the video.'",
        "'speaker_9': 'Hello. I wasn't planning to be here because this is the moment that all my student need to get the spotlight. So I just wanted to share how amazing experience been as a teacher. Usually I have something to teach in this class.'",
        "'speaker_9': 'I don't. I hope that nobody thinks I'm a lady teacher. But my job was really in the cheerleader in a silly uniform. And you kind of let them do what they believe in the most and really kind of make their artistic vision come alive.'",
        "'speaker_9': 'And then we create just beautiful pieces. Individual students literally volunteer over 1000 hours this semester. And this is one example that we always share. Hopefully you get the chance to kind of get to see it all. I'm going to actually take this a stage to the Anna student.'",
        "'speaker_9': 'Hi. I'd just like to say thank you so much for this wonderful opportunity that we've been able to do. We've had so much fun and it's been such an exciting and wonderful experience. I just want to take the time right now to thank all the people who have been working with us on this wonderful opportunity.'",
        "'speaker_9': 'I'd like to first thank the city of Long Beach, Third District Fireworks Advisory Committee. They were the people that really started and developed this concept. They've been going on it for like two years now, and they were the people that reached out to CSU, Long Beach, the School of Art, for this collaboration, of course, under the guidance'",
        "'speaker_9': 'of Councilwoman Susie Price. So thank you so much for that. We'd also like to thank the Long Beach Animal Care Services without their support and allowing us to go to the shelter and actually research, we would not be anywhere where we are today.'",
        "'speaker_9': 'Also, CSU, Long Beach in general and the College of the Art Faculty and Staff, the departments we had many of them working with us, not just animation, but also illustration, graphic design, film, music and theater. So there's a lot of people collaborating together and.'",
        "'speaker_8': 'Working together to create these films.'",
        "'speaker_9': 'Also, just I'd like to thank my fellow students for coming out here today and also for working so hard on this throughout the all the late nights. It's been so wonderful and thank you. And that's like. So hopefully we can start the film again.'",
        "'speaker_3': 'I spoke to your family. I don't like this kind of things. I've always wondered what it would be like to touch the ground. So one day I.'",
        "'speaker_8': 'And I know.'",
        "'speaker_3': 'We're not in control. But ask people. Started my shoes and sold Tarzan down into the ground, into things that live there to this day. But I think the very best view in SoCal.'",
        "'speaker_9': 'So this is just one of the three examples that we have considering when it comes to firework safety and also animal safety. So we hope that you guys really enjoyed that and we're really, really excited to begin to see these, you know, spread out throughout the city.'",
        "'speaker_8': 'That's awesome. Thank you. I'd love to get the other two as well so that we could play them at future council meetings leading up to 4th of July. Be fun to play one when we can, maybe at new business or something, but we have certificates for all the students, so if you guys wouldn't mind coming down, perhaps'",
        "'speaker_8': 'I can ask my council colleagues and our mayor, who's a Long Beach State alum, to come up for a photo with you guys. We'd love to to document you being here. And thank you for your work.'",
        "'speaker_0': 'Oh, let me get through the rest of the agenda items. Let me have you guys come down just 1/2. I do have a couple of speakers, so no problem. The second of the motion council member, Austin.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_11': 'Well, I just want to congratulate the students and Councilmember Price. Thank her for bringing this forward. It's an innovative approach to dealing with our fireworks challenge year after year. We know that enforcement is not going to necessarily solve our issues.'",
        "'speaker_11': 'And so I think this is a creative approach, particularly to reach our young people. And I'm happy to support.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. Just wanted to say thank you to Susie and thank you to these students. You know, I think that it was a really creative video. I'd love to see the others. I think that's what we have to do.'",
        "'speaker_10': 'We have to think about an all hands on deck approach. Everyone has something to offer to contribute to the message. The more we can keep it consistent, whatever the fire safety message is, the better. But I got to tell you, you know, I was impressed by this.'",
        "'speaker_10': 'Thank you. Congratulations. I look forward to sharing this video.'",
        "'speaker_0': 'Thank you, Councilmember Pierce.'",
        "'speaker_2': 'This was awesome. I loved it. I love seeing creative videos that reach all audiences. I mean, in the second district, we have a lot of young folks and every 4th of July, we've got street parties where we can never quite get to everybody.'",
        "'speaker_2': 'And I know we've kind of racked our brain on how do we really reduce some of those instances. And so I absolutely love this every time I think this is the second or third time your committee has come to council, right?'",
        "'speaker_2': 'This is the third. The third time I every time I really appreciate the fact that you guys have pulled yourself together and in a different way. And you don't need a lot of resources and a lot of time, but you're doing the great work.'",
        "'speaker_2': 'And so I'm really thankful for you guys and awesome to all the students that did this work.'",
        "'speaker_0': 'Vice Mayor Andrew.'",
        "'speaker_4': 'Says, thank you very much. And I also want to, you know, echo to that because the faculty, of course, the graduates also am I you know, Suzy never mentions that, but it's okay, you know, because the fact that you, you know, when we talk about, you know, go beat, that's all the way around.'",
        "'speaker_4': 'Look at the animation that you guys are doing. You can just ride along with the volleyball team and you guys don't give yourself good or you're the greatest ever happen. Thank I want to thank everyone of you guys for showing us this.'",
        "'speaker_4': 'And I want to see the next two also. Thank you again.'",
        "'speaker_0': 'Thank you, Councilmember Supernanny.'",
        "'speaker_10': 'I'd like to thank the committee for being here again. And on a kind of quirky note, next week we have my item coming to council that is streamlining council meetings. And you don't know this, but you are part of my inspiration.'",
        "'speaker_10': 'I think your first appearance here, you didn't get on the on the podium till after midnight. And I was so impressed that a group of volunteers wait that long. I thought, boy, we need to treat the public a little nicer.'",
        "'speaker_10': 'So thank you for that.'",
        "'speaker_0': 'Thank you, Councilman Richardson.'",
        "'speaker_10': 'Just one more thing. The video reminded me of something that just came to me. You know, the scene when Mowgli in The Jungle Book gets the fire and accidentally sets the jungle on fire? Was that the inspiration for this?'",
        "'speaker_10': 'It seemed like, okay, maybe some copyright issues we got going on. Okay.'",
        "'speaker_0': 'Just checking counts in re ranga.'",
        "'speaker_5': 'Thank you, Mary. And I want to thank the students out there. You're doing some great work. Anything that will teach our young people to teach their parents about fireworks is good with me because I think that's the message you get to the kids, you get to the parents, and we control fireworks in the city.'",
        "'speaker_5': 'Allow me to thank you for what you do.'",
        "'speaker_0': 'Thank you. And I'll just also add first, Councilman Price, I think this is a great project to fund and support and lead on. Congrats to the committee and most importantly to the students. That was really good and just really proud of December Council.'",
        "'speaker_0': 'At one point, students collaborate on this type of work with great faculty and great imagination. So congratulations. Is there is there any additional public comment on this before I close the item out? Oh, actually, sir, you already spoke, so I have to.'",
        "'speaker_0': 'Unless. Come on. Coming forward really briefly. It has to be somebody new.'",
        "'speaker_4': 'I have. I have one more comment that I wanted to make, and that is that the principal elementary school is taking the videos and it's showing them to students and we are having discussions with him. He is going to go to the school district and get them put into all the across the whole system.'",
        "'speaker_4': 'Thank you so much. That's how excited he is about it. So I just wanted to add that one little thank you so much.'",
        "'speaker_0': 'And then our last two speakers and we'll go ahead and go to a vote and take the picture.'",
        "'speaker_5': 'Just on fireworks, I've been noticing there's some other cities that hold silent fireworks. It really helps the animal shelters in their city on 4th of July, on New Year's Eve, not to be packed next day because the animals are so scared.'",
        "'speaker_5': 'Just an idea. You can still see all the beautiful colors, but you don't have the the noise.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'That's a good point about fireworks that don't have any noise because I have two dogs and they're just terrified. But I also wanted to ask you, Mayor, if you're going to be installing the media wall on city hall so the fireworks can be seen on their.'",
        "'speaker_9': 'You might recall a few weeks ago that I asked you if you planned on buying $1,000,000 flat screen TV.'",
        "'speaker_7': 'You said no.'",
        "'speaker_0': 'That's right.'",
        "'speaker_9': 'Then I heard about a $4.3 million program that's being put together, including $1,000,000 media wall. I called it a TV, a flat screen TV at the time. Media wall, flat screen.'",
        "'speaker_0': 'We have to it has to be to this topic, please. Okay.'",
        "'speaker_9': 'Well, I'm just saying, I found out that a media wall is in the plan to be put in city hall. And if that's the case of very disappointed with that extremely inaccurate information you gave me three weeks ago.'",
        "'speaker_9': 'I just wanted to bring that up.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'I'll be bringing it up again.'",
        "'speaker_0': 'Thank you so much. Thank you for that. That concludes this. We are now going to go ahead and go to our vote to please we can go and do vote. Motion carries. Excellent. Thank you. Here, take a picture, guys.'",
        "'speaker_0': 'So come on. Come on down and let's go and do our photo.'",
        "'speaker_3': 'So, you know, I bought a new bike last.'",
        "'speaker_2': 'I haven't really written about.'",
        "'speaker_8': 'I give you all the certificate, I'll just. Just take random ones, and then you guys can swap graduation.'",
        "'speaker_3': 'I. You're welcome. You have a lot to do with it. Congratulations.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Congratulations. Thank. I want to go back to the story. Yeah, yeah.'",
        "'speaker_0': 'We're going to go back to square slash logistics.'",
        "'speaker_3': 'I got here because you had fun doing it. Yes. Goldman is your teacher. It is.'",
        "'speaker_2': 'A lot of work, but what you.'",
        "'speaker_9': 'Saw was one of our other.'",
        "'speaker_3': 'Teams. Okay, great. I think. Are we going back here?'",
        "'speaker_4': 'Yeah, I'm going to get.'",
        "'speaker_3': 'Around moving back and.'",
        "'speaker_5': 'We're all moving back.'",
        "'speaker_3': 'Back? Where's our committee? Okay. Here. All right.'",
        "'speaker_5': 'Guys. Ready?'",
        "'speaker_3': 'One, two, three. Never go. All right. Thank you. Thanks. Oh, really? Yeah.'",
        "'speaker_2': 'I have.'",
        "'speaker_3': 'Yeah. Yeah. I think we can reorganize to some solution. Okay. Okay. Thank you. All right. No. I'm like, Yeah, yeah, yeah. When you get up, you know, you come here, you know.'",
        "'speaker_0': 'Okay. Thank you. If I can have just everyone kind of exit quietly as we continue the meeting, we would appreciate that. But thank you for then. The last item that was asked to be moved up was item 34.'"
    ],
    "Recommendation to increase appropriations in the General Fund in the City Manager Department (20) by $3,000, offset by the Seventh Council District one-time District Priority Funds transferred from the Citywide Activities Department (70) for a contribution to Fix Long Beach, who, in partnership with Friends of Long Beach Animals, will be hosting a Spay and Neuter Event in the Seventh Council District; and   Decrease appropriations in the General Fund in the Citywide Activities Department (70) by $3,000 to offset a transfer to the City Manager Department (20).": [
        "'speaker_4': 'We please have a vote on our place in public. Okay, fine. Now we're going to move on to item 27 seven District Money. Would you please read the item.'",
        "'speaker_1': 'Communication from Council Member Your UNGA recommendation to increase appropriations in the General Fund in the City Manager Department by 3000, offset by the seventh Council District one time district priority funds for a contribution to fix to fix Long Beach who will be hosting a spay and neuter event in the seventh Council District.'",
        "'speaker_4': 'Thank you, Councilman Young.'",
        "'speaker_5': 'Thank you, Mayor. And that is an item that actually I read. I didn't say anything during the the last discussion without baggage because I had an item on the agenda that specifically addresses spay neuter. So I hope that I could get the support of my colleagues to make this transfer so we could have the spay neuter activity'",
        "'speaker_5': 'coming up in July eight. You know? Yeah. Yeah.'",
        "'speaker_4': 'That is a.'",
        "'speaker_5': 'June, sir.'",
        "'speaker_4': 'Okay, fine. Conspiracy. You got it. Okay. I got him right here.'",
        "'speaker_2': 'You also got it. But just thank you. And I know that you've worked hard for animals and so I really appreciate it, even though you didn't make comments earlier. I know it's in your actions and I appreciate it.'"
    ],
    "Recommendation to request the City Council to oppose Senate Bill 50 (Weiner), which would preempt local zoning laws to allow higher density housing near \"transit-rich\" and \"jobs-rich\" areas, including in single-family neighborhoods, and take a \"one-size-fits-all\" to addressing land use for housing throughout the entire state.": [
        "'speaker_4': 'Fine. Do have any public comment on this item? CNN, would you please cast your vote? Now we're going to move to item 31, if you please, with the item.'",
        "'speaker_1': 'Item 31 Communication from Councilman Austin and Councilwoman Mango. Recommendation to request the City Council to oppose Senate Bill 50.'",
        "'speaker_4': 'Councilman Orson.'",
        "'speaker_11': 'Thank you, Mr. Vice Mayor. So, first of all, I'd like to thank Councilmember Mongo for joining me on this item. I believe it's very important that the council weigh in on one of the most significant bills this session that could have a long term impact on our local land use in our city.'",
        "'speaker_11': 'I'd like to thank city staff for working expeditiously to prepare a very detailed memo that I believe each of the council members received. And that memo was under iteration because this this bill has been amended a couple of times over the last couple of weeks.'",
        "'speaker_11': 'So they worked very, very hard, even over the weekend, to prepare that for the council. And as I mentioned, the memo came out today as well as some maps. I'd like to have city staff provide a brief summary of the memo for the public that may have not had a chance to to to see the memo as'",
        "'speaker_11': 'well as the council.'",
        "'speaker_5': 'So Diana Tang is all up to speed on this.'",
        "'speaker_9': 'Sure, Mayor.'",
        "'speaker_2': 'Members of the city council, as you see before you, we have a short memo on SB 50. This is based on the May 1st version of the legislation.'",
        "'speaker_9': 'And so very briefly.'",
        "'speaker_2': 'I'll provide an overview on that and then perhaps go over the maps because that might be the best way to through illustration show what is in the bill as it currently stands. So SB 50 is state legislation that's proposed by Senator Scott Wiener.'",
        "'speaker_2': 'I believe that the.'",
        "'speaker_9': 'Purpose.'",
        "'speaker_2': 'Of this legislation is to help address the state's housing crisis, which we all agree is an issue. SB 50 proposes to do this by enabling density increases, particularly here in transit oriented corridors. Also, major transit stops in what they're defining as job rich areas.'",
        "'speaker_2': 'And then there is a program that would allow density increases in single family neighborhoods that are not historic districts, flood control channels in a flood zone or along a fault line as well. So in short, that is what SB 50 is.'",
        "'speaker_2': 'It would supersede local land use control even in charter.'",
        "'speaker_9': 'Cities to to allow.'",
        "'speaker_2': 'These density increases. And again.'",
        "'speaker_9': 'The bill does propose to.'",
        "'speaker_2': 'Increase housing supply in an effort to increase affordability, which is something the city generally supports. The bill also.'",
        "'speaker_9': 'Would supersede.'",
        "'speaker_2': 'Local land use authority and.'",
        "'speaker_9': 'Prohibit us from.'",
        "'speaker_2': 'Doing studies that.'",
        "'speaker_9': 'Would look at neighborhood compatibility.'",
        "'speaker_2': 'Design standards, everything that the city councils done through our land use element as well. And so generally we would oppose legislation that.'",
        "'speaker_9': 'That supersedes our local.'",
        "'speaker_2': 'Land use authority in that way.'",
        "'speaker_9': 'I'm really briefly, I'll go over.'",
        "'speaker_2': 'There's a chart in the memo that has been provided. One column is the Neighborhood Multifamily Housing Project. The second column is the Equitable Communities Incentive. I'll go over the Neighborhood Multifamily Housing Project first, because I think is the most expansive portion.'",
        "'speaker_9': 'Of the bill.'",
        "'speaker_2': 'Neighborhood multifamily housing projects would be eligible in all single family residential units that are not located in a coastal zone wetlands high fire zone, historic district, flood zone, or along a fault line that is recognized by the state.'",
        "'speaker_2': 'This program would allow up to four residential dwelling units on vacant land or through conversion of an existing home. The legislation currently would require at least 4.5 parking spaces for every housing unit on site on heights. This is where I believe the Senator is recognizing that local cities would like to keep, at least as to the extent'",
        "'speaker_2': 'possible, the look and feel of a single family residence. And so height limitations and things of that nature would stay the same. There is a streamlined ministerial approval permitting process for this type of project if it qualifies. And it is important to note that if a single family home has had a tenant living in that home any'",
        "'speaker_2': 'time in the last ten years, it would not be eligible.'",
        "'speaker_9': 'For the.'",
        "'speaker_2': 'Density increases that I just described. So that is the neighborhood multifamily housing project portion of this bill. The second portion of this bill is the Equitable Communities Incentive, and this is in areas that are a quarter mile from a high quality transit corridor, a half mile from a major transit stops over four alignments that would be the'",
        "'speaker_2': 'blue line stops.'",
        "'speaker_9': 'And then.'",
        "'speaker_2': 'Within jobs rich area again which jobs which area will if this bill passes be defined by the state. And so we don't have those particular areas in Long Beach, if any, at this time for you now.'",
        "'speaker_8': 'But if density.'",
        "'speaker_2': 'Increases or housing developments that qualify for density increases per the Equitable Communities incentive would receive density waivers through projects in high quality transit corridors, major transit stops and in job rich areas. So. These would not be allowed to require more than 2.5 spaces per housing unit built.'",
        "'speaker_2': 'We would not be able to set maximum height limits below 45 feet for projects within a half mile, but outside a quarter mile of a major transit stop. And we cannot set maximum height limits below 55 feet for projects within a quarter mile of a major transit stop.'",
        "'speaker_2': 'There is similar to the previous program streamlining ministerial permitting approach. There is inclusionary requirements in the Equitable Communities Incentive program if there is more than 20 units proposed in the housing development. In the Equitable Communities Incentive Program. The tenant protections are seven years.'",
        "'speaker_2': 'So if you are working on a parcel where there has been a tenant in in the home for the past seven years, that would not be eligible for the benefits that I have just described. And the affordable housing that affordable housing requirements that are required from this program are included in a tenant or I'm sorry, in the'",
        "'speaker_2': 'inclusionary inclusionary housing ordinance portion of the program. So for Long Beach, I look in your pockets. Do you have some maps for a Long Beach? We'll talk about the neighborhood, multi-family housing projects first, and that is it in all of your single-family residential neighborhoods.'",
        "'speaker_2': 'And I believe we all know where those are. But that does exclude your historic districts. It does exclude the fault line that runs sort of north west along the corridor there through districts.'",
        "'speaker_9': 'Three and.'",
        "'speaker_2': 'Four. It looks like it does exclude the flood zones. So areas near Naples, Belmont Shores, the peninsula that all is excluded. And then, of course, we don't have housing in our wetlands or the rivers, but those are also areas that are excluded.'",
        "'speaker_2': 'So that is where the neighborhood multifamily housing projects would apply in Long Beach.'",
        "'speaker_9': 'For the Equitable Communities.'",
        "'speaker_2': 'Incentives. We worked very closely with Lummi to translate, and so I'd like to thank them for their assistance on this map. Based on the definitions. Currently in SB 50, a major transit corridor is defined as one that includes a fixed bus route that has ten minute headways or less.'",
        "'speaker_2': 'And so for us, that is Anaheim Boulevard. And so that is in the map there. The major transit stops, as we had mentioned earlier, is along the blue line at each of the blue line stations. And in these areas.'",
        "'speaker_9': 'The the.'",
        "'speaker_2': 'Housing developer would be eligible for density increases, particularly.'",
        "'speaker_9': 'In multifamily.'",
        "'speaker_2': 'Stops. And that concludes my report. I'm available for questions.'",
        "'speaker_0': 'Thank you very much. A great update, Councilman.'",
        "'speaker_11': 'All right. So thank you very much. And Diana, I appreciate your your diligent work. I think we can all acknowledge that California has a housing crisis and Long Beach is no different. Like other cities throughout the state, our residents are experiencing overcrowding and is in need of significantly more housing here in our city and throughout my tenure'",
        "'speaker_11': 'on the city council, my record shows that I've supported building new housing and adding residential density, even in the face of opposition. The land use element maps that the City Council approved just last year after an unprecedented public engagement process significantly increases the opportunity for housing density along our corridors.'",
        "'speaker_11': 'In fact, the development services now projected that the elderly alone would accommodate more than 17,000 additional units in our city over the next couple of decades. That may not be enough, but that is in addition to the more than 11,000 units that will be accommodated in the city's downtown plan and Midtown Plan, among other land use plans'",
        "'speaker_11': '. However, based on the overwhelming feedback of the residents of Long Beach, our residential neighborhoods were left largely intact. Long Beach is a diverse city, and and that is why many people love the city. That's why we live here.'",
        "'speaker_11': 'We are a beach city. We're an urban community with a thriving, growing downtown. But we're also a suburban community with many strong single family neighborhoods. This is the diversity of neighborhoods, each within their own distinct characteristics and charms that make Long Beach such a great city.'",
        "'speaker_11': 'And that's why the one size fits all approach that SB 50 has handed down by the state does not work, and it's not good for our city. That's one of the primary objectives of Long Beach's state legislative agenda is also to oppose legislation that preempts the city's existing control over local matters.'",
        "'speaker_11': 'That's why the city opposed SB 827 last year by Senator Wiener. I had the opportunity to meet with Senator. Winner last year, and we discussed with him the Long Beach's concerns with this approach to creating housing throughout the state.'",
        "'speaker_11': 'Long Beach is also working to create more affordable housing and is working with implementing many other policies adopted by the Council as part of the plan for production of Affordable Workforce Housing. But SB 50 undermines the entire local planning process for the city to determine how to best fulfill its housing needs and obligations.'",
        "'speaker_11': 'In particular, SB 50 would allow high density housing of a minimum of 4 to 5 storeys within a half mile of the blue line stop or high quality transit stop even within single family neighborhoods. This density would also be allowed near job rich areas, which wouldn't even define unless B defined.'",
        "'speaker_11': 'Unless the bill becomes law, they will have to go through a rulemaking process. Just about any neighborhood in Long Beach, with limited exceptions, would be required to allow a minimum of four units per property. Long Beach cannot not require more than 2.5 parking spaces per unit has mentioned for any of these new housing developments in some cases'",
        "'speaker_11': 'could not require any parking to be provided. These measures would undermine many of the principles and decisions that this Council has already made in its land use planning and do away with a lot of our local control. That's why dozens of cities throughout cities throughout the state, such as the city of Los Angeles and San Francisco, the'",
        "'speaker_11': 'American Planning Association and the League of California Cities and in the South Bay Council of Governments have all opposed this bill. And I would like to thank my colleague, Councilmember Urunga, who is also on the board of Lead California cities for voting to oppose this measure in just recently as well.'",
        "'speaker_11': 'As I stated before, the state has an important role to play in addressing our housing crisis. It can provide resources to smaller cities that have don't have the planning expertize of cities such as Long Beach and largest cities to update their general planning zoning codes.'",
        "'speaker_11': 'And it should hold these cities accountable that are not working to accommodate their share of the new housing. But for Long Beach, which is working to accommodate new housing, including affordable units. SB 50 is only counterproductive and can have a disastrous long term consequence.'",
        "'speaker_11': 'I'd ask my colleagues to join in opposing this legislation and giving our state lobbyists and our our our team the ability to work in Sacramento to oppose this this legislation. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Before we get to Councilwoman Mango, we're going to go to your public comment. So please come forward through any public comment on the item. Please come down some public comment.'",
        "'speaker_5': 'Courtesy of Harrison record. I'm here to voice opposition to SB 50. SB 50 is nothing but the discredited trickle down economics applied to housing. SB 50 is being proposed or talked about as a means to fill the huge gap in housing, primarily affordable housing in the city.'",
        "'speaker_5': 'And in the state. Except that the effect will be to add. To the already huge gentrification that is being caused in part by the city's pay to play atmosphere. The same corporate developers who stand to benefit from the SB 50 windfall are the same who contribute to the mayor and to the council members campaigns.'",
        "'speaker_5': 'There is no question that we need affordable housing. But this isn't an issue about NIMBYism as. Councilmember Gonzalez. I mentioned last night at the forum, the city has identified a deficit of about 28,000 affordable housing units. And and that deficit is not being closed at.'",
        "'speaker_5': 'Given the gentrification that is existing, that is occurring. At best, it's going to take 150 years to fulfill at the pace that we're going. But, you know, gentrification continues apace in part due to those corporate developers. Yet yesterday we heard from Councilman Councilmember Gonzalez that she created 2000 affordable units.'",
        "'speaker_5': 'In downtown Long Beach. That kind of caught me by surprise. I. I don't know where she pulled that number out of, but I would like to see. Because I haven't seen 2000 units of affordable housing being created by her or by the city of Long Beach in downtown or anywhere else.'",
        "'speaker_5': 'It would be fantastic if it was on the line. Coincidentally, I see that she's not here to ask for the vote. I'm sorry, but I don't trust you guys had the dice. I urge you to vote. In unequivocal terms, opposition to SB 50.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. And then, Ms.. Ley, you'll be the last speaker, I think that's.'",
        "'speaker_7': 'Good evening. I want to thank the council members and persons mongeau in Austin for having the backbone to agenda SB 50. I only hope that other cities have the strong council people that are that are that brave, regardless of what some of the clarifications are on what will be exempt and what aren't exempt.'",
        "'speaker_7': 'Let's talk about what SB 50 isn't and what if it isn't is many people think that the crafter, Senator Winer up in Sacramento, crafted this benevolently with, you know, you know, and minimalist people in his mind in affordable housing, in his heart.'",
        "'speaker_7': 'And it isn't. That's not what SB 50 is, as we know, is also not considered is also considered to be a blanket for the whole state. And it isn't. Again, it doesn't blanket the whole state. It isn't for everyone or everywhere in California.'",
        "'speaker_7': 'Senator Weiner conveniently exempted many affluent people and affluent cities. Most of them are oceanfront. This includes places like Malibu and Manhattan Beach. So evidently, if you or your city have enough money, you don't have to comply with any part of SB 50.'",
        "'speaker_7': 'I think an acronym is in order, don't you? SB 50 is meant to take over governance for all cities that aren't. We'll call him Nim Rocks, Nim r0c, which stands for Not in my rich oceanfront community. What it is according to Senate Committee on Governance and Finance.'",
        "'speaker_7': 'SB 50 also allows developers to choose choose friends, choose council people the density at which they build, potentially allowing them to maximize profits by building large luxury units instead of smaller, lower price units. It does exactly the opposite of created needed affordable housing as we FIFO also takes away all local control.'",
        "'speaker_7': 'And according to the author Joe Fox, this controversial bill is designed to grant state authority to override. I used the word override all local zoning laws in order to build density. And who approves our local zoning laws? You do?'",
        "'speaker_7': 'Councilman Richardson, you were quoted in the Long Beach Press recently as stating how excited you were about involving your community in the revitalization of your business corridor. I was excited when I read the article for you and your community.'",
        "'speaker_7': 'But if you do not opposes SB 50, you or any of your other council people who want to get your city and community involved in revitalization will abandon your community involvement in any development project in your community. Miss Gonzalez, who conveniently is not here, finally stated her position last night to oppose SB 50, but she did so'",
        "'speaker_7': 'with a cortisol ad. She said, As it is written today, that's a lot like me serving you raw eggs and telling you, go ahead, eat them tomorrow. I think they'll be an omelet. You must vote to oppose this as the bill is written in front of you today.'",
        "'speaker_7': 'In conclusion, terms like override bypass cities that can that cannot limit state controlled developer sugar. All of them result in one thing. Sacramento overreach. Do not make us Sacramento South.'",
        "'speaker_4': 'Thank you. Thank you.'",
        "'speaker_1': 'That's a lot of energy to follow. Ray Gavlak, eighth District. I want to thank both council members, Mungo and Austin, for putting this on the council agenda. I wanted to see and I was hoping to see a90 vote tonight, and now it'll be eight oh, unless Miss Pearce isn't coming back.'",
        "'speaker_1': 'But all ten of you, which also includes our mayor, you saw the concerns of thousands of your constituents. When our local Luy was in the limelight, thousands of people came out and told you what they didn't want in their neighborhoods.'",
        "'speaker_1': 'You each may have your own political reasons to not be a leader on this or on any other state issue. You may not want to step on any toes in Sacramento. You may feel more comfortable having Sacramento tell you what to do so that your hands are clean.'",
        "'speaker_1': 'However, you were elected to lead. You were elected to understand what your citizens in Long Beach want to see as the future of Long Beach. So I ask you to say no on SB 50. I've had the opportunity to talk to a couple of you about well, maybe not the way it stands, but maybe it could be'",
        "'speaker_1': '. I believe you said. Guten Amend, Rex. No, we don't want any amendments to SB 50. Mr. Weiner should not be allowed to drag our cities through this horrible process and get any credit for it whatsoever. Last year, the state large committee brought before you, the entire council, the motion to oppose all.'",
        "'speaker_1': 'Isolation that interferes with local control. You voted eight zero to support this recommended action. I hope that you will stay. What you. What you. What your decision was with what your decision was last year. I'm sorry that Jeanine is not here, but SB 50, I believe she probably does support it.'",
        "'speaker_1': 'It attacks her verbal concerns for parking. The Broadway project is a nightmare. It's an accident waiting to happen. If you know anybody that lives down there, have a conversation with them, I would ask her that she not add this to the list of mistakes that have already been made.'",
        "'speaker_1': 'Lina last night said that she was against SB 50. As it stands, unfortunately, she chose not to be here tonight to put it on the record. And Rex, I just think that anything that you could hope to change would be too lenient.'",
        "'speaker_1': 'It's not a party issue. It's not a union issue. It is a quality of life issue for all the residents of Long Beach and the state of California, please vote no on SB 50. And since I do have 30 seconds, I'm going to change the subject.'",
        "'speaker_1': 'I'm not coming back next week to talk about streamlining agendas or your meetings. I think that this is the only opportunity that you have for public participation. And I am so offended when the talk when the talk time for public is reduced from a lousy 3 minutes to 90 seconds, try saying what you had to say.'",
        "'speaker_1': 'You took public comment for 25 minutes and you talked about the issue for 55 minutes. So, you know, please consider that when you have that discussion next week. Thank you.'",
        "'speaker_5': 'Natalie's job guide. Joe Sopko, fifth District. And I.'",
        "'speaker_10': 'Want to thank.'",
        "'speaker_5': 'Al Austin and Stacey Mungo for bringing this issue forward that we all face it here together. I know how your constituents feel on it. I hope you vote that way tonight. You know what? One of the biggest mistakes this city ever allowed to happen was building those cracker boxes in the later 1980s, I believe.'",
        "'speaker_5': 'And then we suffered in trying to find a way to get rid of them, to turn them into single family residence, to have someone buy them. But we really couldn't do that because there wasn't enough parking. The the issue about 0.5 parking per unit, it's not even talking about bedrooms, at least right now.'",
        "'speaker_5': 'What do you have to provide? One parking space per bedroom, something like that. People living in these low income housing units, they're going to have cars. And if it's anybody's district, it's going to be a real problem with parking, because we know how difficult it is in the second district right now.'",
        "'speaker_5': 'And it will probably always be a problem in the second district. We like to think about the future. Don't build more cracker boxes. Don't allow that to happen. Don't give up your control. If you give up your control, you're giving up our control.'",
        "'speaker_5': 'You're there representing us. This. If there's eight of you here tonight, we want to see an eight oh vote against this. You know, I was wondering why it was so late on the agenda. Now you understand that Sacramento is in the same timezone that we are and they're not sleeping right now.'",
        "'speaker_5': 'So they're going to see how you vote. You know, how your your constituents would like you to vote. Thank you.'",
        "'speaker_4': 'Thank you. Next place.'",
        "'speaker_5': 'Point of view. And I think my I just might be on record somewhere. Well, I applaud those council members that have realized that SB 50 is essentially a handout for developers, as difficult as that may seem to the rest of you, I hope you all vote against it.'",
        "'speaker_5': 'I know that many of you are receiving contributions from many of those developers that will be greatly appreciative of this SB 50 if it does pass a bill that SB 50, a bill that as many of as many of the other ill planned city or state initiatives such as the rent control or relocation assistance, will have an'",
        "'speaker_5': 'incident and intended or unintended consequence consequences that are not in our city's best interest. SB 50 will take away local control, local planning that all residents of Long Beach demand. It essentially takes away our ability to plan our future.'",
        "'speaker_5': 'It waters down our democracy. My greatest concern is that SB 50 will gentrify.'",
        "'speaker_7': 'Long Beach at an even faster.'",
        "'speaker_5': 'Rate than is already being taken. It's already happening, especially in District one and downtown area, and it will this and it will continue to.'",
        "'speaker_7': 'Disproportionately impact.'",
        "'speaker_5': 'Our low, modest income and working class minorities and residents of Long Beach. So I urge all of you to please vote no on SB 15. Thank you.'",
        "'speaker_4': 'Thank you. Next year.'",
        "'speaker_9': 'Good evening carelessly District five. I also would like to congratulate Stacey Mungo and Austin for getting this on the agenda tonight. We really appreciate that. I got into the weeds a little bit on this bill and went and looked at the bill analysis of SB 50.'",
        "'speaker_9': 'And I thought we had two areas here in this city that would be a problem. The high quality transit corridors, as has already been discussed, is along the blue line. But along the blue line, we also have the Callan, VA, Carol, and viral screen scores that are in the top 25%, which means that they have really bad'",
        "'speaker_9': 'air down there and they already have problems. This would increase their problems. You know, if you add more buildings, you're going to be adding more cars, you're going to add more pollution. So on behalf of the West Side, you know, I'm sure they don't want it.'",
        "'speaker_9': 'And I can tell you on the east side, I've looked at the jobs rich description and part of it says high area median income relative to the relevant region and high quality public schools and then close to jobs.'",
        "'speaker_9': 'So the jobs rich thing is just a trick of messaging. This is really saying, yes, we're going to invade the areas that don't normally have multifamily buildings in them. And I can tell you the east side does not want this.'",
        "'speaker_9': 'And Stacy knows that. Well, parking and traffic are always the two biggest issues brought up when you talk about high density. And this would bring a nightmare of parking and traffic. If this is really about creating more housing, especially more affordable housing.'",
        "'speaker_9': 'The city of Long Beach needs to lead that effort. As Mahatma Gandhi pointed out. I don't know of any people that would not prefer their own bad government to the good government of an outsider. So this council has affirmed each year that they will oppose state legislation that reduces city controls.'",
        "'speaker_9': 'And with that, all of you should oppose this law. Thank you.'",
        "'speaker_0': 'Thank you so much. That concludes public comment. Let me go back to the queue, Councilman Mongo.'",
        "'speaker_9': 'I just want to make some clarifying points. I want to appreciate everyone who's called my office and the many discussions I've had over the past several weeks. This council's state legislative agenda as it stood when I was on the committee, which I am no longer on the committee.'",
        "'speaker_9': 'Thank you. For those of you who have clarified that misinformation that was in the in the public discussion and dialog. Our position has always been to maintain the local democratic process in everything. So whether that is ordinance related to zoning or what types of businesses you can have in your city, all of those things really should be'",
        "'speaker_9': ', in our opinion, as according to our current state legislative agenda. Decisions made locally. And so when we are silent on an item, it doesn't mean we're silent. We have a state legislative position that we always prefer local democratic processes and neighborhood input.'",
        "'speaker_9': 'Many of you remember that over a year ago I attended an item about the gathering of input from our community. Actually before our Louie process, because I feel as though we could be a a best practice across the country of a methodical and consistent way that we communicate with our community and that we receive input from our'",
        "'speaker_9': 'community on items. The current version of this SB 50 is not what it will be on the last day, and we need to be able to communicate out to our communities regularly, and we each have different methodologies for doing that because every community is different.'",
        "'speaker_9': 'But the city as a whole also has that responsibility. Separate and apart from the council members responsibility to do that. So I want to thank Council Member Austin for joining me, for joining joining together on this item. We served on state ledge together.'",
        "'speaker_9': 'I learned a lot from him on that. I continue to learn a lot from Councilmember Austin and his comments both publicly and in closed session on many items that come before the city. And then also the collaborative spirit that he took with our KOA, our op ed that we put out recently.'",
        "'speaker_9': 'I think that it's really important to be able to communicate clearly the detail that's necessary, because unfortunately, the world we live in today is in six word increments, so, so much so that even though individuals have seen the headline, I've received messages that said, I can't believe you support SB 50.'",
        "'speaker_9': 'And I said, Please, please. Click here to read that. And they wrote back. I did read it and I said So I think that a couple of things just need to be said. Today, many members of our public asked us to oppose SB 52, oppose SB 50 I.'",
        "'speaker_9': 'Asking my colleagues for a yes vote tonight. A yes vote means opposing SB 50, and that can be very confusing to the public when they're not clear what the motion on the floor is and the current motion is.'",
        "'speaker_9': 'Please councilmembers join us Councilmember Austin Knight in opposing SB 50. With that, I appreciate everyone's comments and for coming out tonight and I look forward to hearing the comments of my colleagues.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilmember Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. I have a lot of thoughts on this bill and this entire conversation. You know, I've been having this conversation. So I serve on a subcommittee for RINA Regional Housing Needs Assessment as a my role as CAG.'",
        "'speaker_10': 'I serve as second vice president SKEGG and we in a Southern California Association of governments. I represent six Southern California counties. And their regional planning agency. They take on the conversations that are a bit broader than cities take on.'",
        "'speaker_10': 'And and I think what I think we should be thinking about is maybe not having, you know, every response to every crisis, not using the same type of instrument on every certain situation. I think this is a this bill is not ready.'",
        "'speaker_10': 'This bill is not good. I don't support it. But I also want to say that we already took a position on this. It's in our state legislative agenda to oppose bills that take away local control that's already there.'",
        "'speaker_10': 'And currently, we're tracking 1500 bills in the state legislature. To assume that because we haven't lifted up all the scary ones, because there are some scarier bills out there, because we haven't lifted up this bill to assume that we're not taking our position or advocating publicly.'",
        "'speaker_10': 'It's just false. We have a very, very, you know, a very limited sort of staff here. So we have to be strategic in how we do it. I think there's been enough public outcry on this issue. So thank you, Councilman Austin, for raising this and Councilman Mongo for raising up this in this particular bill.'",
        "'speaker_10': 'I think it warrants some conversation. So here are my thoughts. So the conversation we're having at Sky AG and the regional housing needs assessment is about this concept of regional equity and that essentially, you know, we acknowledge that there's a three and a half million home deficit in California and the housing crisis crisis is real across the'",
        "'speaker_10': 'state, but some cities are not doing their part. As a matter of fact, they're, you know, are trends that cities are taking taken on that essentially are, you know, an example here. Some cities are actually taking steps to limit housing in their city.'",
        "'speaker_10': 'There are some modern trends that are fairly new that essentially say we only want single family residential in our city or we won't adopt a land use plan that allows for growth or considers growth. And in those cases, I think that's considered an abuse of local control.'",
        "'speaker_10': 'And on the other hand, Long Beach has been a leader. People look at Long Beach and what we've done in terms of thinking through and planning for our growth, trying to attempt to have this conversation or equity not perfect, but we're ahead of a lot of other cities.'",
        "'speaker_10': 'And as relates to this conversation on equity and we're having a very robust conversation about what else needs to happen. SB 50 is not a solution to any of the problems here in Long Beach in terms of the need to produce housing and the need to produce housing that is affordable.'",
        "'speaker_10': 'Also, I think how we send the message makes sense. There's no way that we should let these cities off the hook that are essentially conducting modern day redlining. They're essentially saying, we want none of you people in our communities.'",
        "'speaker_10': 'And there was some of that that happened in our land use element conversation. So let's not say let's not pretend that our process was perfect. We got through it as a community, but it wasn't perfect. That activity is happening with sort of no opposition here in here in Southern California.'",
        "'speaker_10': 'And in those cases, the states should take action and say cities like Long Beach who are already complying with transit oriented development requirements, who are already looking at transit rich communities, who are already planning for growth. We want to encourage you and incentivize you to continue doing responsible planning.'",
        "'speaker_10': 'And you cities who are creating or essentially have bad habits. We want to limit your ability to continue to do that and encourage you use so carrot and stick. If you plan for growth, if you're responsible about it, you can maintain all the character of your community and all those different things.'",
        "'speaker_10': 'But if you don't plan for plan for growth, there is a stick and that stick could be tied to your your local control. And so that's that's the conversation, a very delicate conversation that's happening on a regional level through the arena process.'",
        "'speaker_10': 'And so and so I support that. I think that's a regional approach to this. So here's what I think should happen. So I think we should vote together and have one position. I think the position should be we should sharpen the pencil on it a bit, and the position should be we issue a letter or statement that'",
        "'speaker_10': 'essentially says, here's why we oppose it unless amended. And it needs to say something very clearly that Long Beach and communities like Long Beach that are doing the right things or planning for growth and being responsible should simply be exempted.'",
        "'speaker_10': 'If anything, incentivize just help us fund some of this planning. We should be incentivizing these communities and we should put our put our focus regionally on those communities that are simply, categorically, categorically opposing any housing project that happens because that's what's actually happening in these communities.'",
        "'speaker_10': 'So that's what I think we should do tonight. What do you think about that, Councilman Austin?'",
        "'speaker_11': 'I think that is consistent with the spirit that we are moving forward with again. I don't want to be completely unreasonable to standpoint where we are just saying no, we are saying no, we want to maintain our local control.'",
        "'speaker_11': 'And I certainly would would support doing a joint letter from the councilors, the alleged committee supporting an amendment that exempts Long Beach.'",
        "'speaker_10': 'And I think that's important that our message is is is very clear and that we pay attention to the conversation, because the reality is, you know, the polling shows that 60% of Californians support SB 50. And the reality is they support it because of the affordability issue.'",
        "'speaker_10': 'And people expect that this is a solution to that. But in reality, it's not. It's a one size fits all approach to planning, and it will change as as it moves forward. And what I hope to see is that Long Beach cities like Long Beach, as defined by cities who are doing the right thing, planning for growth'",
        "'speaker_10': ', creating pathways to housing, they are exempted and actually incentivized. We give more resources to those cities and those cities who are not doing their part, not approving these documents, not embracing this reasonable conversation. Those cities are the ones where we should, you know, place a real focus on.'",
        "'speaker_10': 'So that's where I think we should go. But thank you so much. Those are my comment. Those are my thoughts on this issue.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember, your income.'",
        "'speaker_5': 'Thank you. One of the things that that happened that occurred at the League of Cities when I attended the board directors meeting last month, was that Senator Weiner did come to the board and did address the concerns that many of the cities had in regards to the Senate bill.'",
        "'speaker_5': 'And at the at the at that meeting, there were questions directly related to the well, what about those cities that are moving towards dealing with gentrification, that are dealing with homelessness? We are dealing with changes in their zoning so that you will create more opportunities to create housing.'",
        "'speaker_5': 'And his response was that those cities will not be affected by it, by the Senate bill 50, because you already have working toward making progress towards addressing housing. So the the end result of that discussion was that the vote that was taken at the League of Cities was to oppose unless amended.'",
        "'speaker_5': 'That was concerning to me as well, because obviously what were the amendments that we're going to be address? And there was it was very clear in regards to what what the amendments are. So I just had one question to a to.'",
        "'speaker_5': 'She's lost her name already having a moment. Diana and Diana, the you put in your last note here in terms of next steps that the Senate appropriations will be hearing it before May 17. Is there an estimate as to actually when it will be heard and as well as whether there have been any amendments made to the'",
        "'speaker_5': 'to the bill as it currently stands?'",
        "'speaker_2': 'Councilmember the.'",
        "'speaker_9': 'The.'",
        "'speaker_2': 'Bill was amended on May 1st after robust discussion in Policy Committee right before. And so it is unlikely that new amendments will be made available before the vote in Senate appropriations. I do not have a date for when that Appropriations Committee will take place, but May 17th is the deadline for all fiscal bills to pass the fiscal'",
        "'speaker_2': 'committee, otherwise not move forward. And so we are expecting that the bill will be heard in Senate Appropriations before May 17.'",
        "'speaker_5': 'In its current form.'",
        "'speaker_2': 'Correct? Yes.'",
        "'speaker_5': 'Well, that that's something that obviously I think that Councilmember Richardson's amending motion here to include a letter that was a friendly, friendly amendment. Excuse me. Let's use the proper terminology that would have us address a letter saying that those of those the cities that are already in the loop for making those adjustments should be exempted.'",
        "'speaker_5': 'Because the bottom line here is that, you know, there are cities that are abusing it. We saw Governor Newsom come, what, two months ago and basically chastise the city as Huntington Beach for their not making any kind of progress or effort in addressing their housing issues.'",
        "'speaker_5': 'And we also have dealt with the issues of the armory in North Orange in north San Diego County, who also are making moves like this, although cities are getting away with not having to address their their housing issues.'",
        "'speaker_5': 'So this bill would basically reward them, if you will, if if or not rewarded, would actually force them to address the housing crisis that we have across the state. But at the same time, penalize cities like us who are doing our best to try to address this issue.'",
        "'speaker_5': 'So I'm a supporter of the other friendly amendment.'",
        "'speaker_0': 'Thank you. On price.'",
        "'speaker_8': 'Thank you. I am supportive of the item which is to oppose SB 50. I agree there's a lot of legislative proposals pending in the state legislature and certainly we can't, in the words of Councilman Richardson, you know, we can't lift them all up.'",
        "'speaker_8': 'But certainly if we see ones that are concerning to us or ones that we think are beneficial for the city, we should, in my opinion, call them out as we have in the past. We have on numerous occasions as a body supported legislation that's been very much in its infancy and amended multiple times after we voted to'",
        "'speaker_8': 'support. So I think it's it's the it's the intent or the the concept that we're proposing to oppose or support. It's not necessarily the exact language because we know it's going to go through changes. I don't support the concept of this particular bill, not because I don't support additional housing, not because I don't think we need more'",
        "'speaker_8': 'affordable housing. But I do not believe that a city like ours, a charter city, should be giving up local control on issues of land use and development. When we have the opportunity to maintain local control and still effectuate the goal that the state has, which is to build more affordable housing, we can do that.'",
        "'speaker_8': 'We're continuing to do that. We as a city are committed to that. But I don't want us to lose control over what, when, where and how these developments will occur. I believe that is very much a city function.'",
        "'speaker_8': 'We have a team in place that is able to make those decisions and implement those necessary land use changes and less Ussery housing changes with the unique nature of our neighborhoods in mind when it does it, you know, I really don't care what the polling suggests.'",
        "'speaker_8': 'I know where my residents are on this issue and I am a solid no. So thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Vice Mayor Landrieu.'",
        "'speaker_4': 'Yes, thank you. Thank you, Mayor. You know, I truly myself, you know, I oppose SB 50 because I think reading it in SB, you know, 50 is designed to provide for new housing in the state of California, which is a worthy goal.'",
        "'speaker_4': 'But I think it goes about it in the wrong way. You know, I think it would tie the hands of the city council and our Development Services Department by denying the right to use our judgment in setting a new housing loan, which had done a great job in approving new housing projects.'",
        "'speaker_4': 'In fact, like they said during a governor, you know, even praised the effort of several weeks ago when he came in, spoke about the need for new housing in California. We have been very careful in the development of our new land use elements, the balancing of demands for new housing against the concerns of our neighborhood.'",
        "'speaker_4': 'SB 50 would destroy those efforts. And in our past, we have seen what has happened when we ignore our neighbors. My district has suffered the effort, the overcrowding. When the crack of boxes was built in the sixties and seventies, single family neighborhoods was designated in in a hodgepodge of the density without the concern for our adjacent homes'",
        "'speaker_4': '. We should not ever make that mistake again. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilmember Hooper.'",
        "'speaker_10': 'Well, I don't think you to express it any better than Councilwoman Price and Vice Mayor Dee Andrews. I'm in complete agreement with them. And since the vice mayor mentioned the sixth district, that's where my grandparents home was. Beautiful California Bungalow 21, 20 Locust Avenue on the eastern edge of Wrigley.'",
        "'speaker_10': 'And that was destroyed. And a triplex went in. And Councilman Allen on call back in 95 expressed that one of these buildings can destroy a neighborhood. And I totally agree with that. But we don't talk about the families that are destroyed by this movement.'",
        "'speaker_10': 'And I have very personal experience with that. So I'm a solid. No. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Pierce.'",
        "'speaker_2': 'Thank you. I was not here for the stock presentation, but I was listening as I was having another conversation. So I have already said that I support in concept the idea of SB 50. I think that we absolutely have to figure out ways to build more housing, particularly around transit corridors.'",
        "'speaker_2': 'I think the comments made by my colleagues around local control and the fact that Long Beach has stepped up and done more than a lot of other cities is an important point to make. I support the idea of opposing SB 50 as is, and I understand that is always challenging when when these state bills come to us'",
        "'speaker_2': ', because it's always a conversation of, well, what might change and when might it come back for us? But it's an important to send a message that we need to do policy. The right way. I think the balance in California is that we have a lot of areas and a lot of cities that are not stepping up.'",
        "'speaker_2': 'And so sending a message that we support more affordable housing, we support more density, more construction is important. But in Long Beach, we are moving moving the dial. I do want to say, you know, I appreciate the the years of effort that went into the land use element.'",
        "'speaker_2': 'And while in my district, we did increase density. I was frustrated because I do see that we still have a housing crisis and we will continue to have a housing crisis for the next, you know, decade. We're not going to build ourselves out of it quickly with the density that we have now.'",
        "'speaker_2': 'I will close and say I'll vote with my colleagues in opposing SB 50 as currently written, and I will continue to have conversations after it comes to vote at the state to see where we're at and how we can continue to improve it.'",
        "'speaker_0': 'Thank you. Then before I go to Councilman Awesome to close this out and we'll go to the vote. I just want the one thing I'll add and listen to the conversation is Long Beach is doing incredible work in building.'",
        "'speaker_0': 'I think you just drive around, you see all the construction we're doing. There are it wasn't mentioned, but I think it's important. There are there are over 250 housing bills right now active in the legislature. I believe it's 250 bills that are active in the legislature.'",
        "'speaker_0': 'And, you know, I think it's my hope and I certainly think it's most mayors wishes that these that are building housing, that these bills would be directed to the cities and communities. They're choosing to not build actual housing.'",
        "'speaker_0': 'And for those of us that are that are doing the work, there is an onslaught of bills that are consistently coming down. And I think the attention needs to continue to be on the majority of communities out there, both rural and those that are closer to the coast, that are not meeting, not not just some are building'",
        "'speaker_0': 'housing, but building no affordable. Others are choosing to build nothing. And and these and these communities are both communities of both high income and low income. And so I just think that we're going to continue to see hundreds of bills each legislative cycle until these mayors and cities step up and start doing some of some of the'",
        "'speaker_0': 'work that we're doing. So with that, let me close with oh, actually first Councilman Mongo, then we'll close with Councilman.'",
        "'speaker_9': 'I think you. Councilmember Richardson. I guess I have some challenges with understanding the incentives that would be offered to the smaller cities, because we did it without incentives. I'm up to an open to some ideas related to cities taking on that process when they work with their neighbors.'",
        "'speaker_9': 'Because what I also would like to see is if state funds are going to a particular city to do this planning process that they are mindful of the city they're adjacent to. So you and I border more cities than anyone else.'",
        "'speaker_9': 'And what I would like to do is I currently border a city that's putting some things out of what they'd like to put on our border that we're not okay with. But they don't have to currently listen to us.'",
        "'speaker_9': 'And I would definitely not be okay with the State providing them funding to do such things, if that makes sense. And I know you're in similar positions with a couple of cities.'",
        "'speaker_10': 'Yeah, I would just wanted to keep it simple that I think the intent of the bill I get it. There is a housing crisis and cities are doing some very sneaky things to get out of building housing. We don't want to let them off the hook.'",
        "'speaker_10': 'That's the point. So I think we oppose it. We take the position of opposing it as a city like Long Beach, but our message is oppose. You know, we acknowledge the intent, right? We say we acknowledge with the state trying to do oppose unless amended to reward cities like ours and and essentially place your focus on the'",
        "'speaker_10': 'local control of the cities who are not behaving the right. Because it's a real it's a real regional issue. Hours and hours of conversation at a regional table, at regional tables about this in Long Beach. As a leader, we should at least acknowledge that when we take this action and if anybody is watching this, they should know'",
        "'speaker_10': 'a city like Long Beach, as large as we are, as forward thinking as we are, we you know, we're leaders in the region.'",
        "'speaker_9': 'So as long as we're clear, because I think that some people were unclear on what was said earlier, that our letter would state our clear opposition to SB 50 as worded today, and that we believe that in any version of SB 50, the city of Long Beach and other cities like ours that have taken on planning processes'",
        "'speaker_9': 'would be completely exempt from SB 50. Yes. And that that still maintains to me and my Eastside voters and my community. We've already gone through this, and the hard work of the Louis shall not be forgotten.'",
        "'speaker_10': 'I can't see how we would oppose a bill that takes some of the burden or the pressure off of a city like ours to deliver all the housing. So that's why I oppose. Unless you fix it, you need to go fix it.'",
        "'speaker_10': 'Don't apply it to our cities. Exempt not just Long Beach cities. We're doing this right. That's the idea.'",
        "'speaker_9': 'Understood. And as long as those adjacent cities that are potentially getting the incentives would also I.'",
        "'speaker_10': 'Think we just leave Diana. I think she gets the city.'",
        "'speaker_9': 'I think she does as well. I just wanted to be clear. Thank you.'",
        "'speaker_0': 'Councilman. Austin, to wrap up.'",
        "'speaker_11': 'Well, I want to thank for all my colleagues, I want to thank the public, want to thank everybody for their thoughtful colleagues comments around this very important issue. I think we're clear moving forward that we are hopefully unanimous in opposition to SB 50.'",
        "'speaker_11': 'I just wanted to speak on the smaller cities as somebody who served on the Council of Governments. There are a lot of cities who don't have the professional technical expertize that we do as a large city. And so if Sacramento is going to impose these planning standards, I think it's important for them to provide some.'",
        "'speaker_11': 'And this is where where I may be speaking for those small cities. Some some some support to them to help them develop their plan so that they can they can build those housing and meet the needs throughout the region.'",
        "'speaker_11': 'And so that's it. Thank you for your attention to this and request your unanimous vote.'",
        "'speaker_0': 'Thank you. Member Chip Brown.'",
        "'speaker_10': 'Thank you. I'd like to request clarification because it's confusing to me, so I can't imagine how confusing it is to members of the public. And I go back to this because there is a major misunderstanding on the item.'",
        "'speaker_10': 'When it came forward, I got emails. Why aren't you supporting this? Well, there's there's a reason. If I'm not asked to sign on to an item, I can't sign on to it. So it might have appeared that I wasn't supporting the original item.'",
        "'speaker_10': 'So I appreciate the people who actually emailed me and asked me my position. I have a very strong track record on this topic and please look to my record, but I guess I don't understand the very premise of the friendly.'",
        "'speaker_10': 'We are Long Beach.'",
        "'speaker_5': 'We are speaking for Long Beach.'",
        "'speaker_10': 'Long Beach is opposed to SB 50. Why are we trying to set policy at the state level? I don't think that's our job. We want to speak for our city. So I just think the original objection to supporting SB 50 is the right message to send for our feelings, and that will be completely understandable by the public'",
        "'speaker_10': '. Thank you.'",
        "'speaker_0': 'Okay. There's a motion and a second on the floor. Members, please cast your votes.'",
        "'speaker_11': 'Oh, clarity. The clarification, in my opinion is that we are taking him to oppose position to SB 50. We're asking also that that Long Beach be exempted from the process. There's been a whole lot of other conversation, but we be exempted from from any any, any, any bill because we do have a planning process in place.'",
        "'speaker_0': 'Okay. Please cast your votes. Thank you. Motion carries and Q Motion carries. Next we're going hear item 39.'"
    ],
    "Recommendation to request City Manager to work with relevant departments and the Economic Development Commission to review the feasibility of the City of Long Beach implementing a vacant commercial property fee to address long-time vacant commercial properties, and report back to the City Council within 120 days on findings and recommendations.": [
        "'speaker_0': 'Thank you. Others in motion in a second. Any public comments now? Please cast your votes. Thank you. Back to item. Sorry.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Back to item 29.'",
        "'speaker_1': 'Communication from Councilman Austin, Vice Mayor Andrews, Councilmember Younger Councilmember Richardson. Recommendation to request city manager to work with relevant departments to review the feasibility of implementing a vacant commercial property fee to address long time vacant commercial properties.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Any public comment? Councilman Austin.'",
        "'speaker_11': 'So I think I just need to explain this.'",
        "'speaker_0': 'No, you do. Because I thought it was a Starfighter person. I'm sorry. Personally, I need to slow down. Councilman, I'll thank you.'",
        "'speaker_11': 'And I think we're going to get out of here at a decent hour tonight. So, first of all, Long Beach is retail economy is strong. Our as our sales tax revenues continue to exceed projections and overall commercial vacancy rates remain low in much of our city.'",
        "'speaker_11': 'However, there are some very clear retail properties along a commercial corridors that have remained vacant for four years. I've seen that, witnessed that in North Long Beach and in other areas of our city. Even other retail properties as other retail properties in other areas of the city are filled.'",
        "'speaker_11': 'This can result in blight conditions and send a negative message to adjacent neighborhoods as well as the business community. Cities throughout the country such as Washington, D.C., New York, Boston, Oakland and San Francisco have recently implemented or are considering adopting vacant property taxes to address chronically vacant storefronts.'",
        "'speaker_11': 'A fee on chronically vacant commercial properties can provide an additional tool for Long Beach to incentivize property owners to take more productive or proactive role in leasing their rental spaces or retail spaces, rather than being content to let them sit vacant for a very long time.'",
        "'speaker_11': 'Most vacancy fee policies allow for exemptions for properties that are undergoing renovations or are going through entitlement processes with the city and where the property owner is showing that progress toward leasing the space is being made. I believe this is an intriguing idea, one that is merits some some review and getting input from our Economic Development Commission'",
        "'speaker_11': '. We're requesting that the city manager work with relevant, relevant departments and Economic Development Commission to review the feasibility of implementing a vacant commercial property fee policy in Long Beach and report back to the City Council with findings and recommendations and try to come back within 120 days.'",
        "'speaker_11': 'I ask for your support.'",
        "'speaker_0': 'Thank you, Vice managers.'",
        "'speaker_4': 'Yes. Thank you very much, Mayor. You know, in my district we have numerous commercial properties and vacant lots that have been seemingly abandoned by their owners. I'm not sure whether any owner would let this property fall into disrepair.'",
        "'speaker_4': 'It's a waste of valuable property and an insult to the surrounding communities. These are an eyesore and a magnet for good, greedy, homeless and other less savory activities. I'm hoping that it be would create an incentive for owners to re and re engage in the activities and the stewardship of their properties.'",
        "'speaker_4': 'So rent them, sell them, or otherwise use them for the purpose for which they were intended. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_2': 'I think this is a fantastic idea. Councilmember Austin, what I've seen a lot of on Broadway over the last several years are small businesses having their rent increased excessively. Then they end up leaving and then the property stays vacant for two years.'",
        "'speaker_2': 'So I think it also incentivizes people to keep small businesses in in that location until they maybe have a plan. I know that we are working with economic development, hopefully in the next month to come back with some other small business retention ideas.'",
        "'speaker_2': 'But this is definitely one of the ones that I support. So thank you.'",
        "'speaker_0': 'Thank you. No public comment on this item. Some members, please cast your votes. Motion carries.'"
    ],
    "Recommendation to adopt resolution preliminarily approving the Engineer's Report and mailing of benefit assessment ballots for the Mosquito and Vector Control Program (VCP) to property owners within the boundaries of the proposed benefit assessment district; setting the date of Tuesday, July 2, 2019 for the public hearing on the proposed VCP benefit assessment;": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '35.'",
        "'speaker_1': 'Please report from Health and Human Services recommendation to adopt a resolution preliminarily approving the engineer's report and mailing of benefit assessment ballots for the mosquito and vector control program to property owners within the boundaries of the proposed Benefit Assessment District.'",
        "'speaker_1': 'Setting the date of Tuesday, July 2nd, 2019, for the public hearing. Adopt a resolution adopting proposition to one eight assessment ballot proceedings procedures and authorize city manager to direct the city's consultant SDI Consulting Group to proceed with the mailing of the VCP benefit assessment ballots on May 17th, 2019 citywide.'",
        "'speaker_0': 'Here's the motion in a second. Is there any public comment on this item? See? None. Please cast your votes.'",
        "'speaker_1': 'Councilmember Richardson. Motion carries.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract with Penwal, of Rancho Cucamonga, CA, for the design, fabrication, and installation of the City's Police and Fire Memorial, in the amount of $625,000, with a 10 percent contingency in the amount of $62,500, for a total amount not to exceed $687,500; \n\nIncrease appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by $123,500, to transfer to the Capital Projects Fund Group; \n\nIncrease appropriations in the Capital Projects Fund Group in the Public Works Department by $123,500, offset by a transfer from the Special Advertising and Promotion Fund Group in the City Manager Department; \n\nIncrease appropriations in the Capital Projects Fund Group in the Public Works Department by $64,000, offset by donations received from the Long Beach Chamber of Commerce, the Friends of Long Beach Fire Fighters, and the Long Beach Police Foundation. \n(District 2)": [
        "'speaker_0': 'Item 37. Actually, I think I am 36. Let me actually do. I am 37. Let me do 137.'",
        "'speaker_1': 'Okay. Report from Public Works recommendation to adopt a resolution authorizing city manager to execute a contract with Pennzoil for the design, fabrication and installation of the city's Police and Fire Memorial for a total amount not to exceed 687,500 District two.'",
        "'speaker_0': 'Thank you. Let me just add to this. If I know we have actually a lot of our our police officers and those are involved with the with the memorial or actually watching it. I've been anticipating this item and including some of our fire guys and women as well.'",
        "'speaker_0': 'Oh, and our chiefs here as well. So let me let me just say that, first of all, you know, this great this morning, you know, joined, of course, both of our chiefs in our annual memorial service. It has moved around over the last few years because of the construction at City Hall.'",
        "'speaker_0': 'And this is this allows us to move forward. We have in front of us today with really a really important part of our city. And it really important part of our tradition and honoring are the men and women that have given the ultimate sacrifice to our community.'",
        "'speaker_0': 'And, you know, we noted, of course, this morning just the tragedy. So it's been about a year since Captain Rosa left us as well. And and his name will be on this wall, the newest name on the wall.'",
        "'speaker_0': 'And so I thought. STAFF Maybe, Mr. West, you can kind of walk us through. I think it'll be good for the council, too, to know what the city is planning as it relates to the civic center and the memorial.'",
        "'speaker_0': 'And then we can take it from there.'",
        "'speaker_5': 'Mr. WEST Mayor, council members, this is a as you said, this is a really exciting item tonight. We've been working on this for many years with with our colleagues in the police department, the fire department. As you know, we lost our previous memorial at the Civic Center today.'",
        "'speaker_5': 'So right now, we're in the process of putting together a new memorial that will be strategically placed at the convention at the Civic Center. It will be an iconic memorial. We couldn't be more excited about it working with our employees in the sworn departments without them to turn over to Craig Beck, who is the lead project manager'",
        "'speaker_5': 'on this, and he'll give us some images and tell us what we're going to be doing.'",
        "'speaker_4': 'Thank you, Mayor. Members of the city council. I'm privileged privileged tonight to share with you some of the work that representatives of the Fire and Police Department, Public Works Team and our design team for the Civic Center have brought forward.'",
        "'speaker_4': 'And we really believe that we've identified an opportunity to showcase and honor those fallen in the line of duty here in our city of Long Beach. So what you have before you in this particular slide is a layout of the new Civic Center project.'",
        "'speaker_4': 'And at the ellipsis or the southern side of our new council chambers, we've identified a location where we believe the memorial will be appropriately placed. So you see on the right side of the screen a layout that shows where the memorial will physically be located.'",
        "'speaker_4': 'The item before you this evening allows for the development. There we go. The development of the memorial sculpture that will place be placed in this garden area of our civic plaza. The design of the sculpture represents a folded flag, which is a tradition that honors someone who has lost their life in the line of duty.'",
        "'speaker_4': 'And the you'll see in this next slide, the folded flag represents a triangle, and the names of those fallen would would be inscribed on those different triangle elements. And the thought process behind the design is that you would create a backdrop that is also visible through the structure with a bunch of these triangles.'",
        "'speaker_4': 'And so this is an image of what the sculpture would ultimately look like. I think it gives you a representation of the size and scale of what we're talking about. Again, we're hopeful that no additional names get added to this wall, but if the opportunity to do that over time and to have a place honoring the men'",
        "'speaker_4': 'and women of our public safety services here in our new civic center, I think is appropriate. That concludes the staff report, and we're available to answer any questions.'",
        "'speaker_0': 'Thank you, Mr. Beck. You guys have done really excellent work in this. And I also want to thank our our police and fire departments. I know that all of you have been engaged directly with Mr. Beck and staff to ensure that the design and the outcome is it was appropriate and it was something that was being supported'",
        "'speaker_0': 'by by your teams. And so thank you for all of that. Councilman Pierce.'",
        "'speaker_2': 'I thank you. And I want to thank everybody that put on the memorial this morning. It was really beautiful and I was honored to be there with everyone as we remembered those that have passed before us in the line of service.'",
        "'speaker_2': 'I think that this design is fantastic. It's interactive, it's engaging. It has people come up and and and engage with the with the art. Anybody anybody watch Game of Thrones on Sunday. I thought I would get wrecks to pay attention.'",
        "'speaker_2': 'So I think one of at the very beginning, whenever he's talking about waiting until making sure that we memorialize those that have risked their lives for us until the last human draws his last breath or whatever that statement is, is poignant right now.'",
        "'speaker_2': 'And so I think it's wonderful that we have a memorial that is not one small statue, but again, is engaging for for lots of folks. And so I appreciate the time and dedication that the staff put into this.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_8': 'Thank you. I echo those comments. I want to thank staff and the stakeholders for being involved in this. The design of the project, I think it's very tasteful and and creates a memory that is fitting for the what we are trying to remember as we erect a memorial in honor of our heroes.'",
        "'speaker_8': 'So I thank you for bringing this forward, and I look forward to its completion.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_11': 'Thank you very much. Well, this is, I think, a special day as we celebrate it or memorialize the fallen fire and police officers earlier today. And I just this item is very timely, but also I can recall when we were planning the Civic Center process, the the the the direction from this council to have more public art'",
        "'speaker_11': ', you know, in the in the the the the around the building there in in a visible way. I think this accomplishes that but also memorializes our fallen service public safety individuals. So I'm very much supportive of this and can't wait to see it.'",
        "'speaker_0': 'Councilman Mangum.'",
        "'speaker_9': 'I want to thank the staff for working collaboratively. Collaboratively. I think that this is a great outcome and I'm really excited for the opportunity to honor those that have so bravely served us.'",
        "'speaker_0': 'Councilmember Richardson.'",
        "'speaker_10': 'I really like the design on the new memorial. I look forward to seeing it in action. The clean lines, the triangles, the ways integrated into the larger plaza. You know, before the memorial was sort of off to the side.'",
        "'speaker_10': 'I think this is more appropriate right there next to our civic chambers, a daily reminder of the sacrifices that our public servants make every day. So thank you to all involved. I'm really glad to see this.'",
        "'speaker_0': 'Thank you. Councilmember Supernanny.'",
        "'speaker_10': 'Thank you. Great job. Staff and police and fire on the new memorial. You know, my very first day in office was Cinco de Mayo, 2015, and it was the day of the memorial. Remember, Chief Luna? He had some nice comments to me, and I really appreciate that.'",
        "'speaker_10': 'I remember it to this day that you recognize me my very first day in office. So thank you for that. I will say also that police and fire have done a spectacular job with the temporary location. I think today's memorial was just outstanding and thank you for all the efforts in that.'",
        "'speaker_0': 'Vice Mayor Andrews.'",
        "'speaker_4': 'Yes. I also, you know, echoed those sentiments. And I just hope it is just a miracle and no and never, ever be another name upon it. So I'm just hoping and praying for that. Thank you.'",
        "'speaker_0': 'Councilman Pierce.'",
        "'speaker_2': 'I was curious. I know we lost a K-9 a couple of years ago in the line of fire. Any placed on this memorial for our canines. I have a dog park that the people are very excited about trying to name after.'",
        "'speaker_5': 'At this stage, no. Chief Luna will tell us where our canines are resting.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Councilwoman Pearce, members of the council. Excellent question. We actually have a canine memorial park at our police academy, if you'd like, or any of you an invitation. I'll personally take you guys out there and walk you through there.'",
        "'speaker_5': 'I have one of my former. I used to be a canine officer once upon a time. Susie was my dog's name, and she's buried out there.'",
        "'speaker_2': 'Thank you for that.'",
        "'speaker_0': 'Thank you. Any public comment on.'",
        "'speaker_3': 'This dog.'",
        "'speaker_0': 'Seeing no public comment. Members, please cast your vote.'",
        "'speaker_8': 'She had a lot to say.'",
        "'speaker_9': 'She was a mouthy.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item 38, please.'",
        "'speaker_1': 'Did you want to go back to 36 or continue on to 38?'",
        "'speaker_0': 'We're going to skip 36 for today. Okay. Just kidding. We'll go back to 36 there. Now, 36 is an important one, I think. Right. Let's let's get these little ones out of the way. And let me go back 36.'",
        "'speaker_0': 'Let's do 39 three. Go back to 36. It's probably our last item because I know it's I know it's important.'"
    ]
}