{
    "Recommendation to receive and file an update on the Proactive Rental Housing Inspection Program.  (Citywide)": [
        "'speaker_0': 'Thank you for that. Madam Clerk, let's go straight to item 20, as we had announced. Report from Development Services recommendation to receive and file an update on the proactive rental housing inspection program citywide. Mr. Modica. Was this an item that was going to be postponed?'",
        "'speaker_3': 'Correct. I believe Councilmember Gonzales wanted to make a motion to postpone. Okay.'",
        "'speaker_0': 'Councilman Gonzales?'",
        "'speaker_4': 'Yes, if I could, I'd like to ask the council that we postpone this for a future date. I believe the first date in May, as we would have the majority of our council, all of our council member colleagues here.'",
        "'speaker_4': 'So that's that would be my motion.'",
        "'speaker_0': 'Is there any member of the public that there's been a motion and a second to postpone it? Does anyone want to address the Council on the motion specifically to postpone this item?'",
        "'speaker_8': 'Very good. You click as the address as long as you're postponing it. I would offer this amendment that we also add to that postponing until the same period of time. Item number three on this council agenda, giving the Council an opportunity to review the credentials of the consultant the city is hiring.'",
        "'speaker_8': 'If you read it as extraordinarily important issue. But on the agenda, it shows nothing about what the credentials are of the individual that will be responsible for advising the city on such a seminal project relative to the wetlands around the third district.'",
        "'speaker_8': 'So I week certainly is not going to rock the boat. Nothing's going to happen or two weeks. So I would suggest you somebody make a motion to add that to that. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Goodhue. Is there anyone else that would like to address the Council on item 20? Please come forward. And this is just to post. We're postponing it so we're not taking it up. Okay. Thank you. All right, members, cast your vote.'"
    ],
    "Recommendation to authorize City Manager to execute all documents necessary to enter into a Cooperative Implementation Funding Agreement between the City of Long Beach and the California Department of Transportation, for the Long Beach Municipal Urban Stormwater Treatment Recycle Facility project, and any necessary amendments regarding the scope and or term. (Citywide)": [
        "'speaker_0': 'Motion carries. Do you have, Councilman Austin? Yes. Councilman Austin's here. All right, motion passes. And item 27. Report from Public Works recommendation to enter into a cooperative implementation funding agreement between the City of Long Beach and the California Department of Transportation for the Long Beach Municipal Urban Stormwater Treatment Recycle Facility Project City Wide.'",
        "'speaker_3': 'Mr. MODICA Thank you, Vice Mayor, members of the Council. We're extremely excited to be here tonight to give you a presentation on L.B.. This is a fantastic partnership that Public Works has been leading along with Caltrans is going to be our funding agency.'",
        "'speaker_3': 'I won't steal their thunder, so I'll turn it over to them. But we are just beyond ecstatic that this is becoming a reality and is going to help us with our long term liability for stormwater, help our beaches and also have a reclaimed water source.'",
        "'speaker_3': 'So with that, I will turn it over to Craig Beck, our director of Public Works.'",
        "'speaker_6': 'Thank you very much. Good evening, Vice Mayor. Members of the City Council. I share Assistant City Manager Monica's enthusiasm for this project. It really is an exciting day to talk a little bit about Long Beach Marston and this project that you have before you this evening.'",
        "'speaker_6': 'So what is Long Beach must. It is a municipal urban stormwater treatment facility. And what it's intended to do is essentially treat stormwater runoff that goes through our storm drains before it's pumped into the L.A. River. So we'll show you in just a minute.'",
        "'speaker_6': 'A slide that will talk about our cities tributary, tributary, watershed system and how it discharges into the L.A. River. This facility in phase one will treat approximately 43% of that water runoff. It meets the city's National Pollution Discharge Elimination System, or NYPD's permit requirements, and really helps the city avoid potentially very costly fines if we do nothing'",
        "'speaker_6': 'to treat this water moving forward. So this is a little snapshot, a map. The facility is intended to be constructed adjacent to the L.A. River, just south of the Shoemaker Bridge. And you're all thinking, well, aren't we rebuilding the Shoemaker Bridge in the near future?'",
        "'speaker_6': 'And the answer is yes. We are going to be rebuilding the Shoemaker Bridge in the near future. But this project will be in coordination with not only the Shoemaker Reconstruction Project, but also a Green Greenway expansion that will ultimately connect Drake Park to Cesar Chavez Park.'",
        "'speaker_6': 'So as Tom mentioned, this project wouldn't be part wouldn't be possible without our funding partners. And this is truly a partnership between the city and Caltrans. Tonight, before you is the request to approve a reimbursement agreement that would allow for up to $28 million for design and construction of L.B. Mass.'",
        "'speaker_6': 'This project would include the interception, diversion and treatment of both dry weather, urban water runoff and the first flush of rainwater. So some of the dirtiest water that we see is when we get the first inch or so of rain.'",
        "'speaker_6': 'And it would allow for the treatment of that water again before going into the L.A. River. And we all know that the L.A. River flows into our bays and our beach areas. This initial phase will allow us to treat approximately 5000 acres of the watershed system.'",
        "'speaker_6': 'So how does it work? You're probably familiar with some of the pump stations that we have along the L.A. River. The pump stations are where all the storm drains drain into. We do have some screening functions in the pump stations now to keep large debris from going into the river.'",
        "'speaker_6': 'But it doesn't really treat the water. And this project is intended to divert the water as it goes to the storm drain system. It'll flow down to Long Beach, mass. It'll be treated at Long Beach and then pumped into the river.'",
        "'speaker_6': 'If we have a really large storm event, the water would flow through the pump stations into the river as it's currently designed. But this, again, is really intended to treat dry, dry weather runoff in that first flush. So what are our next steps?'",
        "'speaker_6': 'Well, first, with council approval tonight, we will finalize the agreement with Caltrans. We'll start moving forward with the design. We'll get a environmental impact report completed. We'll have to obtain permits. And you can see some of the agencies that we'll be working with to obtain those permits.'",
        "'speaker_6': 'We'll construct a facility and then we'll all be able to enjoy a cleaner river and beaches. So what's next after we get the facility constructed? We're really also looking right now at future phases. One of the real benefits of the design that we've put together is it will allow expansion.'",
        "'speaker_6': 'And I showed you on that map that roughly it covers 43% of the city's watershed that drains into the L.A. River. We'd like to capture 100% of that watershed with this facility. So with future funding and future expansion, we'd be able to capture all that.'",
        "'speaker_6': 'Currently, the your staff has filed an application with the Rivers and Mountains Conservancy for $2 million to build a wetlands in conjunction with this facility. We're really looking forward to hearing about that funding and moving forward with that project moving in the future.'",
        "'speaker_6': 'We want to create retention facilities that would then allow us to use the treated water for irrigation of not only the new Drake Chavez expansion, but also other parks within our downtown region. So lastly, I want to make sure that we take a moment and thank all of our partners tonight.'",
        "'speaker_6': 'We have with us Scott McGowan, who's the chief environmental engineer for Caltrans. We also have Constantine contacts. He's the watershed manager at Caltrans. They've been great partners as we move this forward and we thank them for being here this evening.'",
        "'speaker_6': 'We also have Richard Watson from Watson Associates, Kiko Anderson, who's helped us along the way. He's from Kuwait Consulting. And your own stormwater compliance officer, Officer Tony Revell. That concludes your staff report. And we await any questions you may have.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Council member, Urunga.'",
        "'speaker_1': 'Thank you, Mary Lou. More than anything else, I just want to give kudos to staff and and to all our partners in joining us in this effort. It's a great opportunity to not only get involved more as we've been trying to do with the L.A. River, we see all the consequences of what happened north of us.'",
        "'speaker_1': 'And so this is a great effort to be able to use some of that runoff and clean it up and repurpose it and reuse it. We don't have enough recycled water in in Long Beach and into our parks.'",
        "'speaker_1': 'And I see this as a project that's going to greatly benefit at least those two parks right now. And hopefully, as this project moves forward, that there will be other projects included as well as in my area, as well as Advocate Park in Silverado, which are in the West Long Beach area, which but the river as well'",
        "'speaker_1': '. So I want to thank the staff for their efforts.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. I too want to commend staff on their excellent work and on their collaboration and partnership. This is a huge. Financial partnership, and we're very grateful to staff for pursuing it and working so closely with Caltrans, as I know we do on many projects.'",
        "'speaker_5': 'So thank you. And I think this is going to be great.'",
        "'speaker_0': 'Thank you. And I'm sorry I missed calling on the maker of the motion, Councilwoman Gonzalez.'",
        "'speaker_4': 'That is okay. I too, just wanted to extend my very many thanks to our public works team and our consulting team, Kay Koa and Tony and Craig and Caltrans. We appreciate the partnership. I know just looking at the larger picture, we just had a meeting in the first District relative to the Shoemaker Bridge.'",
        "'speaker_4': 'And so looking at that whole region and reimagining it with be must is is really a very exciting all the pieces are moving together and sitting on the I7 ten project committee. We see it in an even larger scope and it's still very exciting as one of the longest or as one of the 710 communities.'",
        "'speaker_4': 'So thank you very much for the partnership and the hard work. We appreciate it.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales. Councilman Johnston.'",
        "'speaker_9': 'Yes. I'd just also like to add my congratulations and thanks to our staff for their great work. This is a huge shot in the arm for for our city, as well as the L.A., the lower L.A. River. And looking forward to seeing this this project work.'",
        "'speaker_9': 'I did have a couple of just brief questions regarding the wetlands restoration grant. I know it's $2 million from Rivers and Mountains Conservancy. How large a space are we looking at restoring and how many acres would that be?'",
        "'speaker_6': 'Councilmember Austin will be approximately four acres. And I'm trying to find the map here. So the area that expands where Schumaker is now, it will essentially be on both sides of the Long Beach. Must. You'll have to envision.'",
        "'speaker_6': 'If I had a point, I could point to you. But it's. Oh, wait, they're telling me I have a pointer. Look at that. So this area right here, which is some of our downtown green open space, this will be recaptured once we do our shoemaker bridge expansion.'",
        "'speaker_6': 'And then the idea is we would connect the greenbelt all the way through to this area here. And then this is Drake Park here. So the lower level of the bluff would connect all the way through. The wetlands area is roughly built in right along this section.'",
        "'speaker_9': 'That's fantastic. Thank you for Francine. That question. And then I did have a question in terms of the timeline in which we think this project will actually come to fruition.'",
        "'speaker_6': 'About 30 days. No, I'm kidding.'",
        "'speaker_9': 'That's pretty good.'",
        "'speaker_6': 'We hope to celebrate its grand opening in roughly three years.'",
        "'speaker_9': 'Okay. Thank you very much. Great work.'",
        "'speaker_0': 'Mr. Beck, did you say grand opening in two years? Is that what you said?'",
        "'speaker_6': 'Well, I said three years, but you'll certainly be invited to the grand opening.'",
        "'speaker_0': 'When's the groundbreaking? That's what we want to know. And that's and I also wanted to actually I want to thank Tonio Revelo and his team for bringing this project full circle. Just a personal congratulations to Tony. Tony is one of our unsung heroes.'",
        "'speaker_0': 'I know some of you have seen him in the council chamber, in the audience, as as we have items that deal with storm water. But he's someone who's completely dedicated to clean water and to reusing water and and really making sure that we end up using what we can more than once.'",
        "'speaker_0': 'And so personally, from me, Tony, for someone who's worked in the water industry almost 20 years now, I want to thank you for your commitment. I want to thank you for the excitement that you bring to my office when you bring projects like this.'",
        "'speaker_0': 'And I think one of the favorite things I have heard from Mr. Rebello is saying to me that no one loves trash more than you do. So thank you for that. And, Mr. Beck, you have a great staff.'",
        "'speaker_0': 'I'm so glad you are able to lead this project forward and see it to fruition. And I will definitely be there at the groundbreaking, at the grand opening. And it's a great day. And Councilmember Your Honor is correct.'",
        "'speaker_0': 'We do not it's not that we don't have enough recycled water as much as it is the cost of piping it throughout our city. So having a treatment facility where the source of the runoff is is just it's a gift.'",
        "'speaker_0': 'It's a huge gift. And I want to thank our partners for helping us with this and helping us make this happen, because that is really a wasted resource that does become runoff and it's right there. So thank you.'",
        "'speaker_0': 'There's been a motion and a second. Is there any member of the public that wishes to address Council on item 27? Please come forward.'",
        "'speaker_8': 'Very good to be clear, because this is surely an outstanding project. In fact, if you read in the copy, the email that I sent you, that it went up to General Troy about 3 hours ago on feedback from yesterday's seawall or breakwater issues and study.'",
        "'speaker_8': 'The L.A. River flow and that which comes down to it. And the quality water was number one, number one on the priority list of those groups that were at my table, and I'll go into more of that later and so forth.'",
        "'speaker_8': 'But they they recognize the import of that apparent technically just in the balance of the 2 minutes, as is related to this, in cleaning up the rest of the water. That can be done in the second thing, and I suggested to the colonel, we stopped the general, we stopped the yada, yada, yada, and we will move forward'",
        "'speaker_8': 'by the end of the summer with the lowering of the breakwater in two specific locations, pursuant to the plan that both Johnson and Vicksburg have agreed upon, which will give us the title of Flushing. But the title flushing really doesn't solve the problem.'",
        "'speaker_8': 'What solves the problem is what's going to be done by this. And then the convening authorities have to lean on those upriver to do the same thing. But as I say, I'll get into more than that. But it's an outstanding program, so forth, and it's a step in the right direction.'",
        "'speaker_8': 'And we're not going to have to wait. We'll have the breakwater lowered in right places before the end of the summer. So it will be ahead of your grand grand opening, thanks to check the email that should be in your box there.'",
        "'speaker_0': 'Thank you, Mr. Good here.'",
        "'speaker_7': 'Thank you. I think I'd be in error if I didn't. Thank you as well. I forget your name. There should be a line back here of people thanking you and your department because you were doing one of those jobs that we all need.'",
        "'speaker_7': 'And if something comes up that happens in error or wrong, we're going to complain to your office. Thank you so much for what you're doing. And and having clean water and readily available water is such a privilege. Every morning I start my day looking at a young kid from Africa and his dream is being fulfilled because for'",
        "'speaker_7': 'the one time in his life, he has pumped water. Thank you. God bless you.'",
        "'speaker_0': 'Q There's been a motion and a second members cast your vote. Thank you. Tom mentioned Kerry's. So let's go back to. The consent calendar. So a motion for consent. It's been in motion in a second. So any member of the public that wish to address the Council on consent.'"
    ],
    "Recommendation to approve the nomination of Councilman Al Austin to represent the City of Long Beach on the Lower Los Angeles River Working Group.": [
        "'speaker_0': 'And that is our last speaker for this time of public comment. There'll be another opportunity at the end of the meeting for, again, items not on the agenda going to our regular agenda if we can take up item 19.'",
        "'speaker_0': 'Madam Clerk. Communication from Mayor Garcia recommendation to approve the nomination of Councilman Austin to represent the City of Light of the Lower Los Angeles River Working Group. Thank you. There's been a motion by Councilman Price and second by Councilman Gonzales.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_5': 'Good luck. Thank you.'",
        "'speaker_0': 'Gentlemen.'",
        "'speaker_4': 'Both My congratulations. This is exciting and a really good person to be representing us, so. Great job.'",
        "'speaker_0': 'Thank you. Is there any member of the public that wishes to address Council on hearing on item 19? Councilman Austin.'",
        "'speaker_9': 'So first of all, I'd like to thank Mayor Garcia for the nominations. And thanks to our California Resource Secretary, John Laird, for the appointment. I'd also like to recognize our Assembly Speaker, Anthony Rendon, for his vision in creating the Lower Elwha River Working Group through his legislation 8530 last year.'",
        "'speaker_9': 'This working group will develop over the next year a revitalization plan for the L.A. Lower L.A. Working Group and the communities that it runs through. And that includes the District nine, districts eight, District seven, and, I believe District one.'",
        "'speaker_9': 'And I look forward to working with each and every one of my colleagues and communities and getting their input. The revitalization plan was prepared. A revitalization the initial revitalization plan was prepared in 2007 for the upper 32 miles of the L.A. River.'",
        "'speaker_9': 'However, the lower 19 miles of the river have no such plan. And through my work on the Gateway Cities Council of Government, we're working to identify and address the needs of communities along the lower L.A. River. This working group will be an important step in fully incorporating the river into recreational open space, educational, cultural and artistic opportunities'",
        "'speaker_9': '. And I look forward to working with the mayor and other members of the working group over the next year. I'm honored to have this appointment. Thank you.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_1': 'Yes, my name is Richard Gutman. I live at 602 West 37th Street in the Wrigley Heights area of Long Beach. Anyway, I know of only two large parcels of undeveloped land along the Los Angeles River in Long Beach that would be suitable for creation of a park or open space.'",
        "'speaker_1': 'One is the former Boy Scout Park at North Long Beach. The other is the oil operators site in my neighborhood, Wrigley Heights. Councilmember Austin has been a big supporter of the community's development, developing that project and the Boy Scout camp.'",
        "'speaker_1': 'He spoke to the development glowing terms just before this council unanimously approved that project. The same developer now plans a very similar project, pardon me, on the oil apparatus property and that already and he already has that property in escrow for purchase.'",
        "'speaker_1': 'To expect Councilman Austin to now act on behalf of residents in obtaining this property for open space or parkland when he is clearly a big supporter of this kind of residential development by the same developer, it's too much to ask of him.'",
        "'speaker_1': 'It's a ready made conflict of interest. I would therefore ask Councilman Austin to recuse himself and allow somebody else to be appointed. Thank you.'",
        "'speaker_0': 'Next speaker, please. Thank you. My name is Regina Taylor. I live at 3206 Oregon Avenue and feeding off of Richard Guzman's comments. I would like to say to that I think.'",
        "'speaker_7': 'That he should recuse.'",
        "'speaker_2': 'Himself because of an.'",
        "'speaker_0': 'Apparent conflict of interest. I would also like to point out.'",
        "'speaker_7': 'That Abe FiveThirtyEight.'",
        "'speaker_0': 'Created the Lower L.A. River Working Group. This group is statutorily responsible for developing through watershed based planning methods, a revitalization plan. And I would think that the considerable amount of expertize to do.'",
        "'speaker_7': 'There are many people.'",
        "'speaker_0': 'In the community who attended the first meeting at Assembly Member Attendance Group in Lynwood. They had, they have vital direct interests in the river. And what happens to it? I would hope.'",
        "'speaker_7': 'That if you do.'",
        "'speaker_0': 'Not recuse yourself, that you would at least make use of this vital resources.'",
        "'speaker_7': 'That you have in the community.'",
        "'speaker_0': 'Who would love to participate. When we showed up at that meeting, I think there was about ten or 11 of us compared to.'",
        "'speaker_7': 'Any other city. We want to be represented. The people do. Thank you.'"
    ],
    "Recommendation to increase appropriations in the Tidelands Operations Fund (TF 401) in the Economic and Property Development Department (EP) by $1,702,448 for a transfer of Queen Mary lease revenue to the Queen Mary Fund (TF 410); and   Increase appropriations in the Queen Mary Fund (TF 410) in the Public Works Department (PW) by $1,702,448 for various capital and historic preservation projects, offset by the transfer of Queen Mary lease revenue.  (District 2)": [
        "'speaker_0': 'Thank you. There's been a motion and a second. Members, please cast your vote. Motion carries. Thank you. Item 21 Report from Economic and Property Development. Recommendation to Increase Appropriations in the Tidelands Operations Fund in the Economic and Property Development Department by $1.7 million for a transfer of Queen Mary lease revenue to the Queen Mary Fund District two'",
        "'speaker_0': '. Thank you. Councilman Price. Too many.'",
        "'speaker_5': 'I have no comment.'",
        "'speaker_0': 'Thank you, sir. Mr. Marco Staff Report.'",
        "'speaker_3': 'Mr. Mike Gove. The Staff Report.'",
        "'speaker_6': 'Vice Mayor, Members of the City Council. This item relates to ongoing funding for the Queen Mary Historic Preservation and Capital Improvement Program. You may recall in November.'",
        "'speaker_8': 'Of last year, City Council authorized the.'",
        "'speaker_6': 'Preparation of a restated and amended lease with Urban Commons LLC under certain terms and conditions. One of the terms was to direct funds equivalent to the passenger fees collected.'",
        "'speaker_9': 'From Carnival Corporation by.'",
        "'speaker_6': 'Urban Commons into the Historic Preservation and Capital Improvement.'",
        "'speaker_9': 'Program Fund.'",
        "'speaker_6': 'Rather than relying on percentage rent. This mechanism creates a reliable, ongoing source of funding to continue to preserve, restore and maintain the Queen Mary. Because the restated lease has not yet been executed.'",
        "'speaker_8': 'Staff believes it is appropriate to capture a percentage rent for Flight 14.'",
        "'speaker_6': 'Into the Historic Preservation and Capital.'",
        "'speaker_9': 'Improvement Program Fund.'",
        "'speaker_6': 'In lieu of the passenger fee equivalent until such time as the restated and amended lease is executed and the alternate funding source is established. These funds will be critical to continue to repair and restoration of the Queen Mary.'",
        "'speaker_6': 'Recently, certain expansion joints had been discovered to.'",
        "'speaker_8': 'Be severely rusted, affecting the structural.'",
        "'speaker_6': 'Integrity of the ship and resulting in the temporary closure of the Promenade Cafe until repairs can be made. These repairs are estimated at $625,000. Remaining funds will be used for other anticipated emergency repairs or to fund repairs of items identified on the approved capital improvement program list.'",
        "'speaker_8': 'So staff request.'",
        "'speaker_9': 'City Council approved the.'",
        "'speaker_6': 'Recommended action and this concludes my report.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS16-091 and award a contract to Cabe Toyota, of Long Beach, CA, for the purchase of 32 Toyota RAV4 hybrid utility vehicles, in a total amount not to exceed $1,040,160, inclusive of taxes and fees.  (Citywide)": [
        "'speaker_0': 'Thank you. So any member of the public that wishes to address Council on item 21. CNN members cast your vote. Motion carries. Item 22 Report from Financial Management Recommendation to award a contract to Cape Toyota for the purchase of 32 Toyota RAV4 hybrid utility vehicles in a total amount not to exceed $1 million citywide.'",
        "'speaker_0': 'Councilman Austin. Okay. And Councilman Murang'a.'",
        "'speaker_1': 'Yeah. I'm glad to see that the city continues its efforts in removing high carbon, causing vehicles and replacing them with hybrids. I'm glad to see that, as well as knowing that the contract is going to a local business that remains here in Long Beach.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_0': 'Councilman Andrew.'",
        "'speaker_10': 'Yes. I also understand the importance of replacing inner city vehicles, you know, with the safer and more efficient model. And I'm happy to see that the bid went to the families, businesses in the sixth district that employ 62 full time employees.'",
        "'speaker_10': 'You know, that's how the city keeps our city strong. So I'm very, very excited about this.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any subsequent amendments, between the City of Long Beach and the State of California Department of Public Health, Office of AIDS, in the amount of $3,808,592 for the provision of HIV/AIDS health care services for the period of April 1, 2016 through March 31, 2019; and  Increase appropriations in the Health Fund (SR 130) in the Health and Human Services Department (HE) by $560,622.  (Citywide)": [
        "'speaker_0': 'Thank you. Is there any member of the public that wish to address the Council on 20 item 22? See None. Members, cast your vote. Motion carries. Item 23 Report from Health and Human Services Recommendation to execute an agreement with the State of California.'",
        "'speaker_0': 'Department of Public Health Office of AIDS in the amount of 3.8 million for the provision of HIV AIDS health care services citywide. Councilman Gonzalez.'",
        "'speaker_4': 'Be great to get some stuff if we can. But otherwise, I just wanted to congratulate our team for for this item.'",
        "'speaker_0': 'Mr. Modica.'",
        "'speaker_3': 'I thank you. Kelly Clapper, director of Health and Human Services, will get the staff report.'",
        "'speaker_2': 'Good evening. Approximately 4250 people residing within the city of Long Beach are living with HIV. We have about 100 new cases each year and we have contract with the state of California for 28 years to provide care within the city of Long Beach.'",
        "'speaker_2': 'Our services include HIV, medical care, linkage and adherence to care and medications, health and risk reduction, education and health care navigation. We find that African-Americans and Latinos continue to be disproportionately impacted by HIV in our community. So this grant includes special allocation to support outreach services for HIV positive individuals of color and is geared toward engagement and'",
        "'speaker_2': 'retention in HIV, medical care and other support services. In addition, we received about 560,000 more dollars this round than we did in previous years. And for this is to increase staff, our staff capacity around early intervention services. They're really geared toward linking new positives with HIV, medical care, referral to the services they need.'",
        "'speaker_2': 'Health, education and literacy training to enable clients to navigate the HIV system of care. I'm open to any questions, and with that I conclude my report.'",
        "'speaker_0': 'Thank you. Councilman Austin?'",
        "'speaker_9': 'Yes. I want to thank you. Thank you. And congratulations to the health department. This this department is largely funded through through grants. Grants like this one that will go a long way to to helping many of our residents in the 4200 over 4200 residents living with HIV.'",
        "'speaker_9': 'It's pretty, pretty significant to go a long way to help them think.'",
        "'speaker_0': 'Thank you, Councilmember Urunga.'",
        "'speaker_1': 'Thank you, Mayor. As many of you know, I used to work for the health department. I was the administrative officer there, and I saw many of the programs that they would offer. And it was a big hit that the department took a few years ago when the the vehicle license fee went away that be used to fund'",
        "'speaker_1': 'a lot of these kinds of programs. And I'm very happy to see that the health department has not backed off from its mission to provide services. And that's what makes this health department great. And that's what makes this the city of Long Beach great and having its own health department to be able to respond to these types'",
        "'speaker_1': 'of services that are much needed in the community. And I and kudos to to the Director Collopy and to her staff for continuing to look for grants that provide a very much needed service to our communities in Long Beach.'",
        "'speaker_0': 'Councilman Andrews. Yes.'",
        "'speaker_10': 'Also, I'd like to give kudos to Kelly for this, because the fact that the need is there and you guys went out and did a job and able to continue to, you know, congratulate you on such a fine, fine job.'",
        "'speaker_10': 'Thank you again.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a one-year agreement with the County of Los Angeles, for reimbursement of expenditures in an amount not to exceed $500,000, to assist in the cost of removing debris deposited on City of Long Beach beaches and marinas emanating from the Los Angeles River, for the period of July 1, 2015 through June 30, 2016.  (Districts 2,3)": [
        "'speaker_0': 'Thank you. Thank you. Is there any member of the public that wishes to address Council on item 23? CNN members cast your vote. Councilman Austin. Motion carries. Item 24 Report from Parks, Recreation and Marine recommendation to execute a one year agreement with the County of Los Angeles for reimbursement of expenditures in an amount not to exceed $500,000'",
        "'speaker_0': 'to assist in the cost of removing debris deposited on city of Long Beach beaches and marinas emanating from the Los Angeles River districts two and three. Mr. MODICA.'",
        "'speaker_3': 'Yes, MAYOR. Members of the City Council. Madam Vice Mayor, this is money that we get every year from L.A. County to assist with cleaning the beaches from the material that comes down the L.A. River. It doesn't cover the full cost, but it's very much welcome, and we can provide more details if needed.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_5': 'I just want to thank staff for continuing to make this a priority and identifying our funding sources and working with the county to undertake this major task. Thank you.'"
    ],
    "Recommendation to receive and file the application of Michael Eutseok Kim, dba Sushi Zen Maru, for an original application of an Alcoholic Beverage Control License, at 454 Pine Avenue.   (District 1)": [
        "'speaker_0': 'Thank you. Sir, any member of the public that wish to address the Council on item 24. Seeing None members cast your vote. Motion carries. Thank you. Item 25 Report from Police Recommendation to receive and file the application of Sushi San Maru for an original application of an ABC license at four or five for Pine Avenue District one'",
        "'speaker_0': '. Councilman Gonzales?'",
        "'speaker_4': 'Yes. Commander Lisbon, is there a staff report?'",
        "'speaker_8': 'Uh, yes, councilwoman, there is. And so honorable vice mayor and members of City Council, this items an application for a new type 41 on sale, beer and wine. ABC licenses for a restaurant. This restaurant has been operating since 2007 and they're just now applying for an ABC license.'",
        "'speaker_8': 'The police department has conducted our investigation. We don't anticipate any adverse impact with the issuance of this license, and that concludes my report.'",
        "'speaker_4': 'Thank you very much. And I think we'll go forward with supporting the the motion, the recommendation.'"
    ],
    "Recommendation to receive and file the application of Chipotle Mexican Grill, Incorporated, dba Chipotle Mexican Grill Store No. 2819, for an original application of an Alcoholic Beverage Control License, at 4250 Long Beach Boulevard.  (District 8)": [
        "'speaker_0': 'Councilman Austin. Great, sir. Any member of the public that wish to address Council on item 25. CNN members cast your vote. Motion carries. The great item 26 report from Police Recommendation to receive and file the application of Chipotle Mexican Grill for an original application of an ABC license at 4250 Long Beach Boulevard District eight.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_9': 'Yes, I would like a staff report on this, please.'",
        "'speaker_3': 'Commander LeBaron.'",
        "'speaker_8': 'Vice Mayor and City Council.'",
        "'speaker_10': 'The item 26.'",
        "'speaker_8': 'Is an application also for a new Type 41 on sale beer and wine, ABC license for a restaurant. We've conducted a investigation and we do not anticipate any adverse impact with the issuance of this license.'",
        "'speaker_9': 'And that concludes my report. Thank you, Commander. And I like to stand in support of the recommendation on this item and ask to my colleagues, do the same. This is part of our great economic development revitalization of a shopping center in Bixby North.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_10': 'Second.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7002 for the Drake/Chavez Soccer Fields and Greenbelt Project; award a contract to C.S. Legacy Construction, Inc., of Pomona, CA, in the amount of $2,491,377, and authorize a 15 percent contingency in the amount of $373,706, for a total contract amount not to exceed $2,865,083; authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto; and accept and adopt Mitigated Negative Declaration No. 01-13.  (District 1)": [
        "'speaker_0': 'Is there any member of the public that was to address this council on 26 c none. Members cast your vote. Motion carries. We already took item 27. Item 28 Report from Public Works and Parks, Recreation and Marine Recommendation to award a contract to cease legacy construction for the Drake Chavez Soccer Fields and Greenbelt Project for a total'",
        "'speaker_0': 'contractor contract amount not to exceed 2.8 million District one. Mr. Marika?'",
        "'speaker_3': 'Yes. Thank you, Vice Mayor. This is a very significant project over at the Drake Chavez soccer fields in Greenbelt project. We do have a short PowerPoint presentation that will be given by Craig Beck, our director of Public Works.'",
        "'speaker_3': 'We also have Marine Night, our director of Parks Rec and Marine, who can answer questions as well. Mr. Beck.'",
        "'speaker_6': 'Thank you. Good evening, Vice Mayor. Members of the city council. Tonight we bring before you an exciting project. We talked a little bit before when we presented the Long Beach Must about doing a greenbelt connection between Cesar Chavez and Drake Park.'",
        "'speaker_6': 'This is the first phase of that, what we'll call a master plan. It essentially includes 8.75 acres that we are going to turn into a park. You see the map before you. This includes an artificial turf soccer field for an area that is significantly underserved for soccer fields.'",
        "'speaker_6': 'There will be large grass multi-use areas associated with the project, open landscaped areas, pedestrian walking trails and onsite parking. If you're familiar with the area, it's currently underdeveloped and basically vacant dirt fields. Part of the project includes an artificial soccer field, as I mentioned.'",
        "'speaker_6': 'There has been some discussion internally and externally about artificial turf, soccer fields, and I think focusing on whether or not crumb rubber is an appropriate substance to use on these artificial fields. In sometime back, the Parks and Recreation Commission took a position that they believe that all infill material for artificial fields should be organic.'",
        "'speaker_6': 'So your staff went out and looked out at different options and decided that caulk and sand is the best infill material and are moving forward with this project, including caulk and sand. So what are some of the benefits of using using artificial turf versus a regular grass field?'",
        "'speaker_6': 'Certainly in our times of water conservation, that is probably the biggest issue that we believe is a benefit of using artificial turf. It significantly reduces the need for water usage. The fields themselves are much more durable, meaning that you can have more playable hours per field.'",
        "'speaker_6': 'You don't have to take them down, have them not being used and reseed them to allow them to regrow. There's certainly lower maintenance cost for these type of fields and improves usability and performance for soccer players. Unfortunately, given the drought situation and our inability to water some of the fields throughout the parks, you will notice areas where'",
        "'speaker_6': 'grass isn't growing. And we also have problems with gophers at certain locations.'",
        "'speaker_0': 'Thank you, Councilman Gonzalez.'",
        "'speaker_4': 'Yes. Thank you for the staff report. And I want to thank city staff, both parks and public works for their their work in this. I know we have had some a lot of discussion on this topic. And so I just want to let you know and really my sentiment, you know, the I've talked to a few residents'",
        "'speaker_4': 'in the in the area specific to the Wilmore area who will be utilizing this quite frequently. And they're very thrilled to have a new park in the area, specifically greenery, because we haven't had that for some time. So it's exciting to see almost nine acres being completely transformed into a beautiful park space for this for this area'",
        "'speaker_4': '. You also did a great job at answering many of the questions relative to maintenance, which I think is important. I wanted to ask another question. Who are our current contractors now? For the park. For park maintenance. For a Drake Park.'",
        "'speaker_2': 'As a landscape is our current for Drake Park. Okay.'",
        "'speaker_4': 'And I just want to ensure I know our Willmore community has been concerned with some of the issues in the past. I know we've done a you know, we've we've gone a long way to improve those. So I just want to ensure that our current contractors are very well aware of this this maintenance program I'm seeing here'",
        "'speaker_4': ', you know, brushing eight, air raiding, sweeping from 4 to 6 weeks, upwards of four months. So they're very well informed of this this process. And I just want to ensure that that's the case.'",
        "'speaker_2': 'And actually, that type of maintenance is covered in the contract that.'",
        "'speaker_0': 'We have with our construction contractor. So there isn't a timeframe that they will be.'",
        "'speaker_2': 'Maintaining it and performing those duties.'",
        "'speaker_0': 'Okay. Great.'",
        "'speaker_4': 'And what is the projection, if any, for saving water? Because I know that that's a huge issue and this would certainly save a significant amount of water. Do we know a percentage or.'",
        "'speaker_7': 'We can anecdotally look at.'",
        "'speaker_4': 'A turf field.'",
        "'speaker_5': 'Versus the synthetic. So an.'",
        "'speaker_0': 'Annual water usage.'",
        "'speaker_5': 'For it to keep a turf field as we would like.'",
        "'speaker_0': 'To keep it nice.'",
        "'speaker_5': 'And green would be anywhere from 900000.'",
        "'speaker_7': 'To 1.2 million.'",
        "'speaker_0': 'Gallons of water in a year.'",
        "'speaker_2': 'This synthetic turf, this is not an.'",
        "'speaker_0': 'Irrigated or.'",
        "'speaker_5': 'A.'",
        "'speaker_7': 'Field that has.'",
        "'speaker_0': 'Automatic irrigation in it, but it will need on occasion some watering down and some hosing off.'",
        "'speaker_5': 'And so that equates to anywhere from about 90000 to 120000 gallons.'",
        "'speaker_0': 'So it's a significant savings in water use per year.'",
        "'speaker_4': 'Okay, that's pretty great. And. Okay. And then in addition, I know we went from the discussion of Crumb Rubber and now we're at a discussion with this organic infill. What was how much more does it cost the city to go with this organic infill compared to the crumb rubber?'",
        "'speaker_4': 'Because I know there was a significant uptick in costs.'",
        "'speaker_6': 'Councilmember. We looked at different options from rubber, cork and sand and a coconut fiber material. There is an uptick in cost, but it was not significant between the crumb rubber. There's roughly a $300,000 charge for the turf field component, and we attribute about 100,000 for the organic versus the crumb rubber.'",
        "'speaker_4': 'Okay. Great. And I think those were all of my questions currently. I know I think some of my other colleagues may have some more questions, but I want to thank you. And I know many of my residents, I'll just reiterate, are very happy to see this.'",
        "'speaker_4': 'I know they'll still be questions and this really sets the tone for the rest of the city. But it's certainly a very good step in the right direction in terms of what we need to do for many of our parks.'",
        "'speaker_4': 'So thank you very much.'",
        "'speaker_5': 'I'm supportive of this project.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Austin.'",
        "'speaker_9': 'I want to, first of all, congratulate our Councilmember Gonzalez and her residents for getting a new park and having some greater opportunity for active recreation. I did have one question because I do see that this could be something that we move forward with in other areas of the city.'",
        "'speaker_9': 'What? How much? Or is there a benchmark or best practice for the use of court in seeing in other cities? Do we have any examples that we can look to? Today.'",
        "'speaker_6': 'Catherine Roston So we did reach out to Field Turf USA, which is the largest manufacturer of artificial turf material in in the U.S. They do have a number of cork and sand turf fields going in in Northern California and some scheduled in Southern California, but none currently are installed in Southern California.'",
        "'speaker_6': 'So we'll be one of the first.'",
        "'speaker_0': 'Councilman Andrews.'",
        "'speaker_10': 'Yes. I just want to congratulate Council Councilman. Woman You know, Lena, for this because the fact that you and I think it came in the right time, good time, because all our kids are really seriously so into soccer and this project here will really save us a lot of water to use.'",
        "'speaker_10': 'And also it'll help the kids who don't have a place to play and can be there from sunup to sundown. And that's a good slogan is, you know, high tide kids, a good kid. And this will really definitely keep them tired.'",
        "'speaker_10': 'Thank you very much of this project.'",
        "'speaker_0': 'Councilwoman Gonzalez. I mean, you're anger. I'm sorry.'",
        "'speaker_1': 'She can go first. No, thank you, Mayor. I want to congratulate the Parks Recreation Department for putting this forward as well, because they really did some research in trying to get the right type of artificial field out there where we have a couple of other projects in line.'",
        "'speaker_1': 'I know I have one in my in my district with Advocate Park. We're looking at the possibility of putting in an artificial turf out there for our soccer fields. And I know that if Councilmember Mongeau were here, she'd also say the same thing in terms of what the artificial turf is going to be going into her area'",
        "'speaker_1': 'as well. So I want to also add my congratulatory remarks to Councilmember Gonzales for being the first to put it out there, and at least it gives us an opportunity to evaluate it, look at it and see how tired the kids get and take it from there.'",
        "'speaker_1': 'So thank you very much. Thank you, staff.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_4': 'Yes, and of course, I forgot a question. This is more related to the Pembridge house because they had been formally asking about parking areas for a near their their their property because of many events that they do. And so I don't know if that was worked into this plan at all or if that's even.'",
        "'speaker_4': 'This had been years ago that they'd been talking about this. I know they'd talked to Ora before when he was here, and I think George when he was here in the Parkside. But since we have two new directors, I'm expressing this on the dais now.'",
        "'speaker_0': 'And my understanding is it hasn't been contemplated within this design.'",
        "'speaker_5': 'But it's something that we can chat a little bit off line about and.'",
        "'speaker_0': 'See what the issues are and what their needs are and how that works.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_6': 'I guess, Councilmember, I just add to that that this project does include a parking lot and there are walking paths that will allow you to walk from that lower level up to the upper level park, which is where the Bainbridge House is.'",
        "'speaker_6': 'So while it may not be adjacent to their property, certainly if they were going to have an event, somebody could park in that lower parking lot and walk up to that event at the Bainbridge House.'",
        "'speaker_4': 'Okay. Thank you. I saw the lot and I didn't know that it was I didn't know how far close it was. But that may help. But if there's additional information I get from them all, I'll chat with both of you offline.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Council Councilmember Supernova.'",
        "'speaker_10': 'So my understanding is this hasn't been tested in in Southern California, this particular organic material. Do we have data from where it's been utilized in areas of the country with similar climate conditions, temperatures, etc.?'",
        "'speaker_6': 'Cancel membership or not, we do not have data. However, what we did do is extended warranty with the manufacturer. This field is fully warranted for eight years for full replacement. So if it fails in that time, we will have a for a new field replaced.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_0': 'Is there any member of the public that wishes to address Council on item 28? Please come forward.'",
        "'speaker_6': 'Good evening to this very esteemed council. I'm Pastor Eddie Jones, president of the Los Angeles Civil Rights Association. But I do own property in Long Beach. And my concern is, is that since this type of material has never been used, we want to make sure that it's held healthy, too, that it doesn't cause cancer or any other'",
        "'speaker_6': 'kind of sickness. And it's a good thing that kids like to play soccer, but. Kids also like to play football and basketball and. You know, other games. So I hope that this park is not only a soccer field and not only a place for soccer, but a place for basketball football.'",
        "'speaker_6': 'Whatever other games that you can think of, the kids can play outside of the park. And also I hope and pray that it has exercising apparatuses for other people who like to work on their cardiovascular system. And I hope it's.'",
        "'speaker_6': 'Safe Safety, which is number one in any city. Safety is a priority. So we hope that this will light it and that it can. Have a safe environment. That's the priority. So we know that the field has never been used anywhere else in the United States or anywhere else.'",
        "'speaker_6': 'But we just want to make sure that it doesn't do anything to affect anybody health wise, whether it's their heart, pituitary glands, lungs, whatever. We just want to make sure healthy is the priority safety and healthy. And also to most of all, I'm here tonight not only about the city council meeting for the park and everything, but'",
        "'speaker_6': 'also. The crime and the shooting they took place last night. So I'll wait till public comment, but very concerned and hopefully we can all work together to build these type of parks all over the city, Long Beach. And if we keep our kids busy, maybe we'll cut down on crime.'",
        "'speaker_0': 'Thank you. Next speaker, please. Good evening. And Cantrell and I have bombarded your offices with questions about this, some of which have been. Answer today. I'm very much in favor of new soccer fields. I think the straight park is extension is a wonderful idea, but I still have some questions about.'",
        "'speaker_0': 'There's no mention of cost to install this field. Or any comparison to cost for property prepared for properly prepared natural grass fields. I'm assuming you didn't make that comparison because you're looking at saving water. Artificial. Fields do need water.'",
        "'speaker_0': 'Today it was stated that 90 to 120000 gallons would be needed for the artificial field. I was wondering, are you putting a sprinkler system under it? Which is what? The artificial turf field that I have seen in Hawaiian Gardens has a sprinkler system.'",
        "'speaker_0': 'Otherwise, you're watering the rest of the park. So this is just a small area that you're going to be saving water. I can't believe there's that much difference. There's no mention of washing these fields, which is necessary to wash off blood, vomit, sweat, dirt.'",
        "'speaker_0': 'And also there is no. Indication that you're going to fence this field. I have given each one of you a copy of a picture. This is at Hawaiian Gardens. You can see they have a fence around it. They have a full time recreation person standing guard at the soccer field, allowing only the soccer players and the coaches'",
        "'speaker_0': 'and the refs to go on to the field. The parents and people watching the games sit on bleachers. The players are not allowed to take any kind of sports drink food. All they can take is water because these fields are like a rug.'",
        "'speaker_0': 'If you spill sports drinks or gum or food on them, they have to be cleaned. Which is not what you have to do with grass. So since. There is no other place that you can see. One of these fields.'",
        "'speaker_0': 'Thank you, Miss Cantrell. Your time is up. I think you should make a lot of more questions about what's going in here. Thank you. Thank. There's been a motion. Oh, sorry. Thank you.'",
        "'speaker_1': 'Hi there. I think I am going to second the motion with that, Mr. Councilmember, and I was suggesting as it relates to some hard data. I am a former world class athlete that actually brought soccer to Long Beach.'",
        "'speaker_1': 'And one of the concerns that I have whenever you're playing on artificial surface and it hasn't been addressed by any information that I've been requesting, is a study on the injuries that takes place. It's been my experience and it's been documented in a few places.'",
        "'speaker_1': 'I, I actually spoke to the, uh, the guy, uh, at Catalina. He said that, uh, that he's aware that, uh, there's about three times greater injuries on artificial turf as it relates to serious injuries regarding ACL injuries. I've been asking, uh, both the Department of Public Works and the, uh, parks for information, and I haven't been getting'",
        "'speaker_1': 'anything from them. There's just been a complete lack of information regarding this this project. We have a lot of questions. I'm not going to get into all the details in a in a minute and a half, but none of them have been answered.'",
        "'speaker_1': 'One of the problems that we're having is that there's a trust issue that we have in the past regarding artificial turf as it relates to the parks. It's not with these people, but it has been persistent. Just the push for artificial turf, the wish for more durable material in the face of the fact that we may not'",
        "'speaker_1': 'even have those numbers to justify the, uh, the durability, the need for the durable surfaces. I'm just asking that that we can, if we can, um. I mean, things like price analysis, we have documentation, apparently that that tells us we chose this particular artificial surface over the others.'",
        "'speaker_1': 'But we've seen no technical analysis of that. The reason why we did this, that it's required by law is public law. We've been trying to get it and it's just we can't find it anywhere. Disinformation has to exist, but it's like a cover up.'",
        "'speaker_1': 'Nobody's giving us this information. It's backup information that we want to see that justifies the report. I'm not saying that they're lying or anything. We want to see where they base this stuff off of. What's the difference between durability and the warranty?'",
        "'speaker_1': 'There's a difference. I also used to be a government contractor, contracting officer. There's a lot of things that's missing. All I'm asking is that we delay this decision a bit so the public can get some information that they've been asking for as it relates to this.'",
        "'speaker_1': 'But otherwise, I love this park. It's a great thing. I just have a problem with the the artificial turf that we're looking for. And I do that. And we should compare it with grass, have some kind of a comparison and do that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Very good you, Kirk, as the addressed when we start talking about sports that take place on terra firma. I know very little on water. Yes. But what I've heard here. Seems to me should rate should raise in any intelligent community some red flag sufficient enough to follow the advice that the people have made.'",
        "'speaker_8': 'And step back and take a take a look. There's going to be something for in so a few weeks more getting more information can only help the issue and not hurt it. Thank you.'",
        "'speaker_0': 'Thank you. There's been a motion and a second. Councilman Gonzalez.'",
        "'speaker_4': 'I just want to thank the speakers today for their comments. I know that my Willmore community could not be here tonight because they have been currently going on right now as we speak. But in speaking with them, they they do remain supportive of this field and would like to go forward.'",
        "'speaker_4': 'So I ask that my council colleagues support this item. Thank you.'"
    ],
    "Recommendation to adopt Specifications No. RFP TI 16-041 and award a contract to Long Beach Community Action Partnership, of Long Beach, CA, for the operation of Public Access television in Long Beach, in an amount equivalent to one-third of the Public, Educational and Government funds available each year, for a period of three years, with the option to renew for two additional one-year periods; and authorize City Manager, or designee, to enter into the agreement, including any necessary amendments thereto regarding the term and/or scope of services.  (Citywide)": [
        "'speaker_0': 'And Q Members, cast your vote. Motion carries. Thank you. Item 29 Report from Technology and Innovation Recommendation to award a contract to Long Beach Community Action Partnership for the Operation of Public Access Television in Long Beach in an amount equivalent to one third of the public, educational and government funds available each year citywide.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_9': 'Yes. As you know, public access television returned to Long Beach just a few years ago and Long Beach Cap was a leader in making that happen. They have opened up their doors. They've educated many people on public access.'",
        "'speaker_9': 'They're running stories and current events of interest to our public on cable cable television frequently. And I'd like to just stand in support of renewing their contract and ask that you do the same.'",
        "'speaker_0': 'Now, Caitlin, we actually go to staff report accounts when you were actually. You.'",
        "'speaker_1': 'Well. Yeah, man. Yes. Thank you. I also want to lend my voice of support for this project. I mean, it's been a long time since we've really had a a good community access type of program out there, programing that you offer, Derek and I want to congratulate you on that and thank you for your support of the'",
        "'speaker_1': 'community. You try to be as comprehensive as possible in trying to get as many viewpoints in your programing as much as possible. And I'm really appreciative of that because it's a it provides a very important part of our communicating with our community.'",
        "'speaker_1': 'And the public access is one of those venues that really gives an opportunity for the community to get involved, to get engaged and to express their viewpoints. And you are out there taking taking that that reporting. So I'll be I'll be supporting the same.'",
        "'speaker_0': 'Thank you, Mr. Morgan. Yes.'",
        "'speaker_10': 'Yes. I just want to also commend you on that. Keep up the good work. You guys are doing a great job. Thank you.'",
        "'speaker_0': 'And I fail to ask for a staff report, so let me go ahead and do that.'",
        "'speaker_3': 'Thank you, vice mayor. We can provide that also. Before we get started, we'd also like to thank Derek Simpson and his whole group. We have a tremendous working relationship on the staff level and it's great to see this continue.'",
        "'speaker_3': 'So with that, Mr. Brian Stokes, our director of technical innovation, will give a brief staff report.'",
        "'speaker_1': 'Well, thank you, Madam Vice Mayor and City Council before you as a recommendation to adopt the specifications and award of contract to Long Beach Community Action Partnership or L.B. Cab to operate the public television in Long Beach for a period of three years with an option to renew two additional one year periods at the discretion of the'",
        "'speaker_1': 'city manager. L.B. Capp has been operating the Public Access Digital Network or paid net since October 2011 and over the past five years, L.B. Cap and Paid Net has transitioned into a full service community media center and public access television station, a pattern that empowers our residents to create media to tell their own stories in Long Beach'",
        "'speaker_1': '. And we're very pleased to have L.B. Capp in the city to provide these media services to our community. And that concludes my report.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_5': 'Thank you. I, too, want to thank the entire crew. I know that Councilwoman Gonzalez and Councilwoman Mango and I had the pleasure of being interviewed in one of the shows, and we really appreciated the opportunity to talk about some of the issues that we think are important to the community and to the youth, specifically women in public'",
        "'speaker_5': 'office and women running for office. I think those were really important issues, and above and beyond that, you do a lot of great work for the community and I'm really grateful to have you as our partner. So thank you.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_4': 'I, too, want to thank you and congratulate you.'",
        "'speaker_5': 'You know, you've you've talked.'",
        "'speaker_4': 'About issues that some people don't like to touch, like poverty. And I think it's really important as as Councilman Price said and as others have said, that that you're taking on those topics and that you're really doing so with great passion, but very informative as well for the public.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Councilmember Super. Now.'",
        "'speaker_10': 'I just want to echo the comments of my colleagues. And I was interviewed all by myself, by Derek, and I was so impressed by his research. He knew more about me than myself. And also, thank you for all the other things you do in the community.'",
        "'speaker_10': 'It's really great.'",
        "'speaker_0': 'Great. Is there any member of the public that wish to come forward? Mr. Simpson.'",
        "'speaker_9': 'Good evening. Council members and staff. Derek Simpson, executive director of Long Beach Action Partnership. And Lisa Amico, who is director of our apartment operation. I just want to thank you on behalf of our board of directors and the staff and the community that we serve, which is all of your districts.'",
        "'speaker_9': 'We're really proud that we just opened up. That village is a real partner at satellite location. We're about to open up on an Eldorado park as soon as we get some tables squared away over there we are in the first district at the library.'",
        "'speaker_9': 'We're in the ninth district. So we're really trying to get these resources out to the community as best we can. The one thing that we would like to ask of you tonight as well is to encourage your constituents to become members of partner, because it's your stories within your district that can really make this a greater resource'",
        "'speaker_9': 'for the community. I was quoted in the paper when we first got this contract of saying that the regional media only comes to Long Beach for murder and mayhem, and right below the fold was all the regional media for a big arson issue.'",
        "'speaker_9': 'And so we want to use this as an opportunity to tell all the positive news about our community as well, to give a balance for what goes on in our community. And we think we're working hard towards that, but we can't do it without you.'",
        "'speaker_9': 'And we appreciate all the support. And I would like to say to you, Vice Mayor, before you get out of office, I'd love to get to interview you as well to talk about your legacy while you've been here and Councilman Andrews, since you've made history here.'",
        "'speaker_9': 'We've got to get you on. All of you have been on Pat and Adam one way or another, but I've not had the honor of actually sitting down with you, so I'd love to do that with both of you.'",
        "'speaker_9': 'And I'd like to allow Lisa to say a few words as well.'",
        "'speaker_0': 'I just want to thank the Council very much for your support of public access. Not all of our colleagues nationwide enjoy such support from their city council. For colleagues, I know this would be a much more stressful situation with a lot of people in support.'",
        "'speaker_0': 'And it's just it's so wonderful that the Long Beach City Council really recognizes the value to this community. And that's why I believe we are still the only station, public access station to come back after the passage of DeLuca.'",
        "'speaker_0': 'I don't know of any other one in California.'",
        "'speaker_4': 'That's come back after 50 of.'",
        "'speaker_0': 'Them closed. So thank you so much for your support. And we look forward to just continuing to do our best. Thank you.'",
        "'speaker_9': 'A special shout out to Dennis. Thank you so much for stepping in and taking over after Dean Smith's retirement. He's been great city staff. We have that great working relationship and I look forward to some big things from partner TV.'",
        "'speaker_9': 'Thank you.'"
    ],
    "Recommendation to declare ordinance making findings and determinations regarding contracting for work usually performed by City employees and authorizing City Manager to enter a contract with Plenary Edgemoor Civic Partners, LLC, for custodial, maintenance and security services, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'Thank you. It's an emotion and a second. Members, cast your vote. Motion carries. Thank you. Item 30 Report from Economic and Property Development, Development Services, Financial Management, Library Services, Parks, Recreation and Marine and Public Works. Recommendation to declare ordnance making findings and determinations regarding contracting for work usually performed by city employees and authorizing the city manager to'",
        "'speaker_0': 'enter a contract with Plenary Edge. More civic partners for custodial maintenance and Security Services read and adopted as read citywide. Mr. Modica. Staff report.'",
        "'speaker_1': 'Vice Mayor, members of the council, this is for you. Tonight is the second reading of the Prop l ordinance relating to the new Civic Center. So it includes the changes as made at the original reading, and it was delayed in coming back to you as the negotiations had continued with the IAM.'",
        "'speaker_1': 'And so it is before you tonight as this is the last council date prior to the deadline.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_5': 'I have no comment on this.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_9': 'I'd like to hear public comment.'",
        "'speaker_0': 'Sure. Is there any member of the public that wish to address the Council on item 30? Please come forward. State your name.'",
        "'speaker_1': 'Good evening. Members of the council, Richard Suarez representing the International Association of Machinists and Aerospace Workers. This evening, the city manager asks you to violate the MBA, the Myers Melius Brown Act. The IAM has a simple request that the Council does not break the law.'",
        "'speaker_1': 'And item 30 of the agenda. The city manager recommends that the council approve the property ordinance and execute a project agreement. The City Council must refuse to do this because it is illegal. The parties have not concluded bargaining over the contracting out of I am representative bargaining unit work relative to the Civic Center project.'",
        "'speaker_1': 'Indeed, the parties just completed a fact finding hearing last Friday on April 15th. And the fact finder will issue his report no later than May 6th of 2016. The AM is hopeful that the Fact Finders Report will provide critical assistance in bringing the parties to a mutually agreeable resolution of the Civic Center project.'",
        "'speaker_1': 'Contracting out the council should not terminate bargaining before the Fact Finders report is issued. In addition, under section 30 505.7 of the Government Code, the Council must hold a hearing on the Fact Finders report before it can implement the city's last best than final offer.'",
        "'speaker_1': 'Accordingly, if the city council takes action recommended in Agenda Number 30, the city will violate the MBA. The AM therefore demands that the city remove item 30 from today's City Council agenda. Furthermore, it must be pointed out that the proposal study is flawed.'",
        "'speaker_1': 'It is not cheaper to contract out. The report has intentionally inflated the cost of city provided services to make chases bid seem cheaper. The Council should order an objective, fair, properly study to be prepared. We've met several times over this issue and when we were at an impasse, we followed the law and the law said we go'",
        "'speaker_1': 'to a fact finder, which for all intents and purposes is a neutral. And this individual last Friday heard. For me, and it heard from the folks representing the city's position. As most times when a neutral is involved, he or she is afforded a certain reasonable amount of time to render a decision.'",
        "'speaker_1': 'This is the process. Invoking this agreement today violates that process. So we are simply asking that we continue the process and see what the fact finder has to say. And then based on that. The charter, I believe, based on the information that has been given to me, allows you, the council, to then take a vote on that'",
        "'speaker_1': 'decision. That's all we're asking you to do. Thank you for your time.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Very good. You see, Jess, just so I understand it, what we're talking about is maintenance. And the building that is going to drive us, everybody realizes we'll drive as further down the road to bankruptcy is. That's what we're talking about, right?'",
        "'speaker_8': 'So taking a few more weeks to study it. Really? He's not going to. Impacted. It may, hopefully. Slow us down that road to bankruptcy. So I would suggest. Stepping back. Listening to what was just. Imparted to by certainly one more knowledgeable on the subject than me.'",
        "'speaker_8': 'I don't know what the hurry is to. Go down that path of bankruptcy. But give it some thought, please.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_9': 'It's just a really quick question for our staff regarding the bargaining process. How many bargaining sessions do we have on this particular matter with the.'",
        "'speaker_3': 'I believe we've had in excess of 12.'",
        "'speaker_9': 'And since when?'",
        "'speaker_3': 'Since I think we originally started the prop l process and the request for bargaining back in September, I believe, of 2014 2015. We did negotiations and meet and confer in December all the way through and through the last several months.'",
        "'speaker_9': 'Okay. And in terms of the mentioned fact finding, why were we, in fact finding.'",
        "'speaker_3': 'There is a provision in state law that once you reach impasse, there is the ability to go to a fact finding process.'",
        "'speaker_9': 'So can you explain to the public listening what impact path actually means?'",
        "'speaker_3': 'Sure. For that level of specificity, I'll have Alex Vasquez give a overview of the fact finding process.'",
        "'speaker_0': 'So essentially the fact finding process involves fact finding a panel, a neutral, a representative by the union and represented by city. Each side presents their case and the decision comes back before the council to take into consideration.'",
        "'speaker_9': 'So. So impasse means that after 12 bargaining sessions, we weren't able to reach an agreement?'",
        "'speaker_0': 'That's correct.'",
        "'speaker_9': 'Mr. Modica, is there any sort of financial implications toward regarding this particular entering into this agreement?'",
        "'speaker_3': 'There are. And I'd also like to add a little bit of history is we originally had some bargaining sessions or some meet and confer prior to the vote to get council direction to it, to move forward December 15th.'",
        "'speaker_3': 'We actually then took additional time to go back to the table and to do additional negotiations and did that throughout January, end of February before reaching impasse. We did notify our partners the IAM that on on January 28 that we had a hard deadline in order to, you know, that we had to make a decision at the'",
        "'speaker_3': 'end of April in order to keep forward and keep the pricing that we had secured for this project. Otherwise it would be a significant increase in price. And we had we also implemented what was called an early works agreement in order to secure additional time to try to reach agreement.'",
        "'speaker_3': 'So given all those factors, we do expect, A, that if we do not close by the end of this year and, you know, by the end of April that there will be significant increases in price in terms of interest rate fluctuation.'",
        "'speaker_3': 'And the contract that we have with our partner will.'",
        "'speaker_9': 'And a significant increase in cost for a civic center does not serve anybody's interest. Our city employees or the city or the taxpayers of the city of Long Beach at all. I do want to just raise my concern, and I think I raised it here several months ago when we were talking about moving forward with the Civic'",
        "'speaker_9': 'Center Project Project and particularly the the operations and maintenance component of this regarding a number of city employees who were subject to potentially being displaced. And I think the city council made a a I think most of us made it made it very clear that we did not want to see any of our city employees, existing city'",
        "'speaker_9': 'employees, lose their jobs as a result of this. Was that communicated at the bargaining table?'",
        "'speaker_3': 'Yes, absolutely.'",
        "'speaker_1': 'And if I may add, Councilmember Section four of the Prop L finding this evening states that city employees who whole classifications identified in the Appendix C of the Prop L study who are assigned to the Civic Center facility, shall not be reduced in our position, duties or compensation as a result of the execution of this contract.'",
        "'speaker_3': 'So we have a very firm commitment. Not only did through this process, we add back in the security officers, which were originally contemplated in the prop l, but that was the council decided to keep the security officers in the building.'",
        "'speaker_3': 'That's included in tonight's action, as well as that commitment that none of the affected employees and I believe there are eight would would be impacted in any way. They would absolutely have a job with the city.'",
        "'speaker_9': 'All right. Thank you.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_4': 'Yes. Thank you. I think my question was Councilmember L Austin's last question. I just wanted to reiterate the fact that no employees currently will be reduced in hours, positions, duties, etc., in this realm. I know we had a few facilities maintenance employees who came to my office directly and who weren't hearing information from any side.'",
        "'speaker_4': 'And so I understand that there's negotiations going on, but, you know, this is their livelihood. So I want to make sure that this is, you know, addressed. And I see that here. So thank you for answering the question.'",
        "'speaker_4': 'I appreciate it.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. I want to follow up on some comments that were made by Mr. Suarez regarding legal procedures and aspects. It's my understanding, based on the item, as I as I've read it and reviewed it, that the recommendation by staff is to move forward tonight.'",
        "'speaker_5': 'And that's based on input from the city attorney, is that correct?'",
        "'speaker_1': 'Vice Members of Counsel That is correct. The firm has created an exception to the requirement of exhausting the fact finding process, and we discussed that within the bargaining unit with the city under operational necessity. And I think some of the comments made by the Assistant City Manager and our communications to the AM regarding the hard date and'",
        "'speaker_1': 'the fixed deadlines and the consequences of missing that date, meet the requirement of the operational necessity.'",
        "'speaker_5': 'And what are some of the consequences associated with the city missing that date?'",
        "'speaker_1': 'Some of those would include and I'll let somebody else maybe answer that has more. But a fixed price proposal would expire. The city would need to renegotiate the proposal and significant possible increases in the cost. The city could incur termination penalties and lose the value of the moneys expended.'",
        "'speaker_1': 'Regarding the design. It jeopardizes the project due to the fiscal constraints and all that. Mr. Conway.'",
        "'speaker_6': 'I think in addition to the financial impacts relative to a delay.'",
        "'speaker_8': 'To a project, there is also.'",
        "'speaker_6': 'The, I think, safety impacts in delaying the.'",
        "'speaker_9': 'Project as well.'",
        "'speaker_8': 'This is our fastest process to.'",
        "'speaker_6': 'Bringing a safe facility to the city.'",
        "'speaker_8': 'For its staff and its visitors. And any delay to that process.'",
        "'speaker_9': 'I think exposes us to potential liability.'",
        "'speaker_5': 'Great. Thank you.'"
    ],
    "Recommendation to direct City Manager to support Senate Concurrent Resolution 102, which would name the Los Alamitos Bay Bridge or any successor bridge on Pacific Coast Highway south of Loynes Drive and north of East 2nd Street as the Joan Lind Van Blom Memorial Bridge.": [
        "'speaker_0': 'Thank you. There's been a motion and a second. Members, please cast your vote. Motion carries. Thank you. When a new business we have item 31 communication from Councilman Andrews, Councilwoman Price and councilmember super non recommendation to direct the city manager to support Senate Concurrent Resolution one or two, which would name the Los Alamitos Bay Bridge or any'",
        "'speaker_0': 'successor bridge on Pacific Coast Highway, south of Lawrence Drive and north of East Second Street, as the Joan Lind Van Blum Memorial Bridge. Councilman Price.'",
        "'speaker_5': 'Thank you. This is an item that I asked my council colleagues to support. Ms.. Van Bloom left an imprint on our city as an inductee of the Wilson High School, Long Beach State Century Club and National Rowing Hall of Fame.'",
        "'speaker_5': 'She was the first U.S. woman to win an Olympic medal in rowing after taking the silver in Montreal in 1976 and silver again in 1984. In addition to her career in rowing, Joan also served the Long Beach Unified School District for over three decades 25 years as a teacher, and then another decade as the district's first physical'",
        "'speaker_5': 'education curriculum leader. This bill gives proper recognition to an outstanding leader and member of our community who dedicated her life to education and the sport of rowing. I ask my council colleagues to support this this particular item. Thank you.'",
        "'speaker_0': 'Councilmember Supernova.'",
        "'speaker_10': 'Thank you. Joan Van Blom was my Wilson class of 70 classmate and also my son's track coach in middle school. I'm very proud to support this motion. Thank you.'",
        "'speaker_0': 'Councilman Andrews?'",
        "'speaker_10': 'Yes. Thank you, vice mayor. You know, I would like to thank Councilwoman Price for asking me to sign on to this item. You know, as a former you know, like a professional athlete myself, I know the commitment that it's taken to be the best.'",
        "'speaker_10': 'And Joan brought home two Olympic medals. And that is true commitment. She has led the way for women in both Olympics and the Long Beach Unified School District as a curriculum leader. She has honored us with her leadership and I am truly honored to request support to rename Alameda Space after.'",
        "'speaker_10': 'Thank you very much, Mrs. Price, for this agenda item.'",
        "'speaker_0': 'Thank you. Is there any member of the public that wishes to address Council on item 30?'",
        "'speaker_8': 'Very good. You click as the address. Thank you for bringing this forward. It's certainly an appropriate way to honor somebody in perpetuity. That has been the aspiration to so many over so many years and will continue to be.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Okay. Madam Clerk, I believe that. Is it under new business? Is that correct?'",
        "'speaker_1': 'We need a vote.'",
        "'speaker_0': 'Yeah, we just need a vote and vote, of course. After voting. Motion carries. Thank you. And we have new, new business. And if I may start with Councilwoman Price.'"
    ]
}