{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and approve an amendment to the conditions of the Entertainment without Dancing Permit issued to Relevant, Inc., dba Marina Wine, at 194 Marina Drive, Suite 101.  (District 3)": [
        "'speaker_0': 'Okay. Please cast your votes. And then we have now we're moving on to the hearing and then we'll go right into public comment. And so I'm going to turn the hearing, if we can. Please have. Mr. Modica. And then the clerk, please begin the hearing.'",
        "'speaker_2': 'Yes.'",
        "'speaker_11': 'Report from Financial Management recommendation to receive supporting documentation into the record. Conclude the public hearing and approve an amendment to the conditions of the entertainment without dancing permit issued to Marina Wine at 194 Marina Drive, Suite 101 District three.'",
        "'speaker_3': 'Oh.'",
        "'speaker_11': 'There is an oath. Please stand and raise your right hand. Do you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_3': 'Brett Jaquez and Emily Armstrong from Financial Management will be presenting the staff report.'",
        "'speaker_12': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an amendment to the conditions of the entertainment without dancing permit issued to relevant ink doing business as marina wine located at 194 Marina Drive, Suite 101, operating as a restaurant with alcohol in Council District three.'",
        "'speaker_12': 'At its meeting on October 15, 2019. The City Council granted an entertainment without dancing permit subject to approved permit conditions. The permit conditions approved on October 15th require that all doors and windows must remain closed during the hours of entertainment at the establishment.'",
        "'speaker_12': 'Furthermore, all authorized entertainment activities must be restricted from 7 p.m. to 10 p.m. on Mondays through Thursdays, 8 p.m. to 11 p.m. on Fridays and Saturdays and 2 p.m. to 6 p.m. on Sundays. After approval of the entertainment permit, it was discovered that the conditions were not approved as intended in the entertainment permit.'",
        "'speaker_12': 'As a result, staff recommends amending the permit with the conditions as contained in the hearing packet. I, as well as the police department, stand ready to answer any questions Council may have. And that concludes staff's report.'",
        "'speaker_8': 'Finds anybody coming inside. Who? Mr. Good, you know.'",
        "'speaker_3': 'Councilman Price Thank you. Vice Mayor So I want to thank staff for bringing this item back because as it was approved last time was not what I had intended. So I appreciate you bringing it back and I appreciate the call out for the two additional conditions, specifically the amendments in condition one and the amendments and conditions six'",
        "'speaker_3': '. I want to confirm that the the entertainment permit is with no dancing. Correct. That is correct. So the expectation would be that there would not be any dancing on the premises or within close proximity to the premises as a result of this business.'",
        "'speaker_3': 'Yes, there.'",
        "'speaker_12': 'Is no dancing allowed.'",
        "'speaker_3': 'And then also, I want to confirm that alcohol cannot be carried into the courtyard or other areas of Alamitos Bay Center pursuant to the conditions of this permit. Is that correct?'",
        "'speaker_12': 'So the conditions of the entertainment permit rely on their ABC conditions that's related to their alcohol license. So those ABC conditions trump the entertainment permit.'",
        "'speaker_3': 'Okay, great. And then one other thing that I have. It's not a condition, really, but I want to just share that. I have talked with the business owner who is here today, and I want to thank him for being here.'",
        "'speaker_3': 'And I want to thank him for being engaged and for being, you know, a tremendous partner thus far. I have no doubt this is going to be a very smooth transition with this permit. But one of the things we talked about is I know that he's going to be updating his speaker system so that it is more'",
        "'speaker_3': 'conducive to this particular area in terms of where the sound is amplified. And I know that he expects to do that within the next three months or so. So although it's not a condition, I know that this entertainment permit is going to come back in about a year, I believe, for us to review or not come back'",
        "'speaker_3': ', but it will be evaluated by staff in a year. And so I want us to be mindful of of that as being one of the. Agreements that the business owner has made in regards to working collaboratively and in partnership with the surrounding businesses.'",
        "'speaker_3': 'So with that, I'd ask my colleagues to support granting this permit as amended. And I wish our business owner the best of luck and marina wine. So everyone please go out and visit them and help them help support the business so that they continue to grow.'",
        "'speaker_8': 'Fine, Councilwoman Parrish. Oh, and thank you. Could you please cast your vote or.'",
        "'speaker_11': 'Motion carries.'",
        "'speaker_8': 'When you move to a. And in 20.'",
        "'speaker_11': 'Item 20 Communication from Councilmember Richardson, Councilmember Pearce, Councilmember Urunga.'",
        "'speaker_6': 'I believe that some of the time certain.'",
        "'speaker_7': 'For.'",
        "'speaker_8': 'You and going to public comment there. Okay with that, we're move to public comment then we have a. Eight individuals have to speak with inside with the first three in this room. Could you please come up to the podium when I call your name?'"
    ],
    "Recommendation to receive and file a report on the status of Basic Life Support (BLS) ambulance vacancies in the City of Long Beach; and   Request City Manager to explore and implement solutions to restore BLS 12 and 13 to daily service as soon as possible and prepare a long-term plan that addresses staffing shortages for Emergency Medical Technicians (EMT).": [
        "'speaker_8': 'Thank you. That concludes public comment. Thank you. Now we move to item. 21.'",
        "'speaker_11': 'Communication from Councilmember Richardson, Councilmember Urunga recommendation to receive and file a report on the status of basic life support ambulance vacancies in the city of Long Beach. And request the city manager to explore and implement solutions to restore bills 12 and 13 to daily service as soon as possible.'",
        "'speaker_11': 'And prepare a long term plan that addresses staffing shortages for emergency medical technicians.'",
        "'speaker_8': 'Councilman Richardson was speaking.'",
        "'speaker_6': 'Thank you, vice mayor. Sure. So most recently, I was I and the city council was notified of some recent actions that need to take place in our fire department that impact our ability to deploy our basic life support units 12 and 13 based in north and west Long Beach.'",
        "'speaker_6': 'This has a small but an important impact on our ability to respond and transport patients to the emergency room. The purpose of the motion tonight is to discuss and receive a briefing on that situation, discuss what actions have already been taken and what can be taken to immediately restore vehicles 12 and 13 as soon as possible.'",
        "'speaker_6': 'And then to begin the conversation on long term solutions to address the staffing issues associated with the EMT positions of ambulance operator positions here in the city of Long Beach. So that this problem which occurred last year, occurred this year, during the last two months of the holidays, won't occur next year.'",
        "'speaker_6': 'And so at this point, I'd I'd like to hear your staff report.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Thank you, Mr. Vice Mayor. Members of the Council. So Javier Espinal, our fire chief, will be able to provide kind of an update of where we are with our blaze ambulances. We provided a 2.4 report on Friday, which is provides a lot of data and we can kind of get into that a little bit and answer your'",
        "'speaker_5': 'questions. So with that, I will turn it over to our fire chief.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor. Members of the Council, thank you for the opportunity to provide this update on our basic life support ambulance staffing. Recent staffing shortages and Long Beach Fire Department's ambulance operator position have caused a change in the staffing model for basic life support ambulance deployment.'",
        "'speaker_7': 'On October 18, 2019, after having met and conferred with both the International Association of Machinists and the Long Beach Firefighters Association, Long Beach Fire Department elected to stop using mandatory overtime for ambulance operators to staff one of the city's two time to daytime peak bliss units.'",
        "'speaker_7': 'If full time employees are available or part time employees have signed up to work. This unit will be staffed. This action was taken to provide temporary relief to the remaining full time ambulance operators who were being required to work an excessive number of additional hours to fill the vacancies.'",
        "'speaker_7': 'The FDA provides two transport methods for patients who have called 911 for a medical emergency. Critical patients like those who are suffering a heart attack or a stroke and need immediate medical intervention are transported to a local emergency room by firefighter paramedics in one of the fire departments.'",
        "'speaker_7': 'Nine ALS paramedic rescues patients who do not require immediate, immediate medical intervention by paramedics, but who require or request transport to a local emergency room are transported by one of the BFD bellows ambulances, the BLR ambulances or staff with non sworn ambulance operators who hold an emergency medical technician license and are either full time or part time'",
        "'speaker_7': 'employees at staff. One of the five bellows ambulances, three of the bellows ambulances are staff for 24 hours a day and are currently housed at fire stations two, four and 19. Two of the bellows ambulances are peak load units and are staff during periods in which transports occur more frequently.'",
        "'speaker_7': 'Currently, a unit is housed at Fire Station 13 and a staff from 8 a.m. to 8 p.m. and one is housed at Fire Station 12 and is staffed from 10 a.m. to 10 p.m.. VLS Ambulances are a citywide resource.'",
        "'speaker_7': 'Therefore, even though each BLS unit is assigned to a specific fire station, the Bliss units are out in the community more often than they are in their designated fire stations. Long Beach Fire Department typically hires one class of ambulance operators per year.'",
        "'speaker_7': 'And in past years, this class would graduate approximately 20 ambulance operators. This is typically enough to support the natural attrition that occurs in that classification. Ambulance operators are hired through civil service and applications are screened for qualifications and sent over to the BFD for review.'",
        "'speaker_7': 'Candidate candidate candidates are selected from that list and 60 or more slated for BFD interviews with firefighters of various ranks. The top candidates are sent to live, scan a thorough background process and a medical exam with occupational health before being offered a position.'",
        "'speaker_7': 'Once offered the position, ambulance operators complete a three week course that covers internal BFD policies and procedures, an EMT refresher and emergency vehicle operations. The ambulance operators also complete field orientation observation rotations with current ambulance operators. Part time employees are offered full time positions in order of seniority or an order of their performance in the ambulance operator'",
        "'speaker_7': 'class. Currently they all. BFD is experiencing a shortage of BLS personnel, as many fire departments are hiring for fire positions in addition to ambulance operator companies. The shortage is limited to FDA ability to cover all shifts on the 12 hour bill as ambulances.'",
        "'speaker_7': 'BFD Ambulance Operator Staffing filled a critical levels in September 2018. We conducted a hiring process and 24 candidates began the background and medical exam process. Of the 24 candidates. Only 13 completed the three week orientation class. The others withdrew from the process or were disqualified during the background.'",
        "'speaker_7': 'Medical or EMT refresher course. A second process was initiated in May 2019, and in this process, 36 candidates began and a total of 20 candidates completed the process. The civil service list for this position expired, and a new bulletin was published in June 2019.'",
        "'speaker_7': 'In August 20, 1960, candidates were interviewed. 36 moved to backgrounds, and as of today, 28 candidates remain in the process and those that complete backgrounds are being scheduled for medical exams. The background and medical exam portions of the process are typically slated for ten weeks based on part on prior experience.'",
        "'speaker_7': 'We're hopeful that we may be able to conduct a smaller class prior to the end of the year if we're able to move through the process quickly. If this is not the case, a class would take place in early January 2020.'",
        "'speaker_7': 'As previously mentioned, bliss, ambulances, transport patients who do not require immediate medical intervention by a paramedic when there are no bills, ambulances available and a patient meeting. These criteria requires transportation. An analyst unit is dispatched to provide transport.'",
        "'speaker_7': 'This typically places an A+ unit out of service during a period of typically 20 or 30 to 40 minutes. Other A+ units provide coverage in that unit's area while it's out of service. To reduce the number of mandatory shifts.'",
        "'speaker_7': 'The ambulance operators recovering the department stopped filling mandatory overtime spots on VLS 12. This unit was selected because of the five B-list ambulances. It has the lowest average call volume at seven calls per shift. Additionally, it has two paramedic rescues nearby that provide overlapping coverage in the event one is out of service.'",
        "'speaker_7': 'Further, the OB FDA proposes to rotate this reduction between Bliss 12 and Bliss 13 beginning in mid-November. It is anticipated that most of these calls will be absorbed by the other Bliss units. If no Bliss units are available.'",
        "'speaker_7': 'An elite unit would have to fill in further. The recent restoration of Engine 17 provides an additional citywide resource to provide emergency medical services prior to the arrival of an A+ or a B+ transport unit. These reductions in daily staffing are temporary and will be in place until the BFD is able to hire sufficient number of ambulance'",
        "'speaker_7': 'operators, which is expected to occur in January 2020. During this period, BFD will strive to maintain response times while continuing to meet the expectations of the community with regard to emergency medical services. This concludes our report and we stand ready to answer any questions.'",
        "'speaker_8': 'Thank you. Yes.'",
        "'speaker_6': 'Thank you. Just a thank you for that report, Chief. And you expanded on what was initially submitted in the two from four to the council. So thank you for giving us the most recent update and just have a few questions about the situation.'",
        "'speaker_6': 'So we had a call with our North local leaders last night and there was a lot of discussion about the difference between Alice and the Beatles. Would you just give a high level explanation of what Alice Rescue does and what a Bliss does?'",
        "'speaker_7': 'So Alice is advanced life support and those are are paramedic firefighter paramedics that respond to typically heart attacks, strokes, things of that nature that need immediate intervention by a paramedic by higher level of emergency technician. The Bliss ambulances are more slated for transport of patients to hospitals that don't need immediate intervention by a paramedic.'",
        "'speaker_6': 'Okay. So advanced life support, heart attack, basically it's a life or death situation. Basic life support will be an example of a basic life support call.'",
        "'speaker_7': 'It could be a minor laceration, a fall with bruising pain of some type that doesn't require immediate intervention.'",
        "'speaker_6': 'Understood. Okay. And you touched on this. It's the proximity to the ALS units and the three full time, because VLS units will limit the response time. But can you say that there will be no impact to response times, or will there be an impacted response times while we're in this situation?'",
        "'speaker_7': 'I can't say that there will be no impact. I do anticipate some impact to the system. But as previously stated, especially with the VLS units, once they arrive and change shift in the morning, more generally than not they are out of the station and whether they get back into that particular area within a given number of hours'",
        "'speaker_7': 'is subject to run count.'",
        "'speaker_6': 'Okay. And you mentioned in your presentation that you expect that this issue will be resolved and the unit will be placed, the units will be placed back in service January 2020.'",
        "'speaker_7': 'I do.'",
        "'speaker_6': 'Are there any factors that could affect the timeline on that, either pushing it beyond January 2020 or sooner than January 2020?'",
        "'speaker_7': 'So it is we stated we currently are pushing as hard as we can through the background and medical process. There is a potential that we could do a class potentially earlier as far as going past 2020. I don't anticipate that being a problem.'",
        "'speaker_7': 'We have everybody in the queue as far as the medicals and the backgrounds and I think we're going to be set.'",
        "'speaker_6': 'Sure. Thank you. Now I want to talk about the future. So based on our conversation, I know that this has happened at least once in the past last year, and then it happened this year. Mr. Modica, can can you would you talk about what your approach would be in responding to this, this motion to think about what'",
        "'speaker_6': 'we can do to either make the hiring system better or faster, or to build a bench or a pool, or to enhance or improve the problems that lead to the ALS being difficult, a difficult position to maintain. I know that there are concerns about the level, the rate of pay that these folks receive or whether it's a'",
        "'speaker_6': 'pipeline to a fire position or whatever it is. But how would you respond to this motion?'",
        "'speaker_5': 'Sure. So we have been putting a lot of thought into this, and this motion helps us really hone in on it. We do. You know, one of the aspects here is it's a smaller group of employees than we do have.'",
        "'speaker_5': 'For example, firefighter. We have, you know, 100 firefighter positions and just dozens of these positions. Part of the reason that this program was created in the first place place was to be a feeder group into our firefighter ranks.'",
        "'speaker_5': 'So we know that this happens. We know that we we often have transitioned these people into other employment in long beach. We're going to be looking at working with civil service and with h.r. About planning out those academies.'",
        "'speaker_5': 'We're also, you know, knowing that there's going to be peaks and valleys sometimes where something like this unexpected will happen and see what are our options to either bring in additional support or having people on a bench or others that we can bring in to do that.'",
        "'speaker_5': 'And if there's any other solutions out there, we're going to be looking at those in the next month or two. So we we don't like to be in this situation. We always want to have full staffing whenever possible.'",
        "'speaker_5': 'It does happen in an organization our size and in this case is just a small, limited pool that can do that job. So we were we will be taking this seriously and trying to plan those academies so that this doesn't happen in the future.'",
        "'speaker_6': 'Thank you. So that's the last thing I'll say is, is number one, I want to thank the residents who submitted comments on each comment and those of you who joined us. I see my neighbors, my Rohnert neighbors sitting here front center paying attention.'",
        "'speaker_6': 'It's incredibly important. So so Mr. Modica, I was going to say, Mr. West, Mr. Modica and Chief Espino, the more we can, you know, submit to form fours and keep the council updated, keep the public updated on this immediate restoration.'",
        "'speaker_6': 'But also the conversation about what we're going to do in the future, I think would be welcome. Folks want to want to know that we're on top of this and this won't be the situation next year. Is that okay?'",
        "'speaker_5': 'Yes. So part of our response will be to come back and look at all those different ideas. We we've had some ourselves. We are hearing from others about what could we be doing. We're going to run those down.'",
        "'speaker_5': 'We'll make sure we give a report back. And as the chief mentioned, we're going to try a number of things to accelerate that date from January into December so that the it's narrowed as much as possible.'",
        "'speaker_6': 'To make sure this is.'",
        "'speaker_5': 'Due in writing.'",
        "'speaker_6': 'Thank you. This is an issue not just for North Long Beach, right. All of the you know, the system is the sum of its parts. It affects response times across the city. We restored Engine 17 and they responded to a fire in North Long Beach on the 91 freeway last week.'",
        "'speaker_6': 'So it's all a part of the same system. I know the impact, the Westside North and citywide. Thank you.'",
        "'speaker_8': 'Thank you. Fine. We're going to public comment. We're going to go to right now. That's he said he wanted to wait. Yes. We're going to go to Japan and come up. Mr.. Good to you first. And then we have, uh, Anita, in a way, Mrs. Harding.'",
        "'speaker_8': 'You would. Your next question.'",
        "'speaker_1': 'Thank you. I fully support this motion. And I will use this opportunity as I tried to the last time we were at the council meeting. But the council, our mayor three times said, I already spoke on it when the public record revealed I did not speak on it.'",
        "'speaker_1': 'The thing to keep in mind and this is something I didn't know and a lot of people didn't know until about two or three years ago. Are they in heresy, dangers in fighting fires to the people that fire that fight those fires?'",
        "'speaker_1': 'These are the the long term effects on lungs excuse me and hearts from a lifetime of inhaling that smoke. It's debilitating. It cuts life short to short. And anything we can do. To address that we should keep in mind.'",
        "'speaker_1': 'And ironically, after last week's council meeting, of course, the issue became not just a Long Beach area issue or California issue or law in L.A. County, but it's a nationwide issue. These are the all the fires that nobody expected and so forth.'",
        "'speaker_1': 'So the that's front and center and should always remain front and center relative to those inherent issues that are extraordinarily difficult to deal with and cut the life short of our firemen. Thank you.'",
        "'speaker_8': 'Thank you, Mrs. Bonita.'",
        "'speaker_3': 'Yes. Good evening. Thank you. Vice Mayor De Andrews and our city councilman. My name is. We need a doctor Moore. I'm a resident in the ninth District representing the Collins Neighborhood Association. And the ninth District recently lost and just lost the services to Station 12, I believe it was seven years ago.'",
        "'speaker_3': 'And just recently those services were restored. Having these basic life support services reduced.'",
        "'speaker_12': 'To like part time services or loss of them. They put.'",
        "'speaker_9': 'Our.'",
        "'speaker_3': 'Most vulnerable residents at great risk. We have several residents that are elderly, they're homebound, and we have several members in our community that depend on public transportation. So having these services taken away from them and if they have an incident for call, for service, where they have to depend on this ambulance service to take them to a'",
        "'speaker_3': 'nearby hospital, that's not necessarily maybe in that neighborhood, but is across town. These life saving services sometimes can be life threatening and critical to our most vulnerable residents. So I ask that you please consider something that is more of a permanent and long term solution.'",
        "'speaker_3': 'So our residents in District nine, as well as the other residents in the city of Long Beach, can have a better quality of life. Thank you very much for your time and I appreciate it. Thank you very much.'",
        "'speaker_3': 'Thank you, sir.'",
        "'speaker_8': 'Yes, Mrs. Harry. She? Now I will go to the diocese council in anger.'",
        "'speaker_10': 'Thank you, Mayor. And I want to echo the last person who made a comment there. Although our report says to explore alternative solutions to the temporary to a temporary reduction in bills. I think we should look at more permanent solution to that.'",
        "'speaker_10': 'I totally agree with that. I would ask the maker of the motion if he would be amenable to. Redirect a step to make a permanent solution to this.'",
        "'speaker_6': 'That's the intention with a long term plan like fix it permanent. We don't want to deal with this one.'",
        "'speaker_10': 'On the record that we're.'",
        "'speaker_6': 'Looking on the record. Absolutely.'",
        "'speaker_5': 'We understand that's the that's the goal. We want to get there as well.'",
        "'speaker_10': 'All right. I have a few questions that regarding the the current status of where we're at and what brought us here. So Bill's services are sometimes provided by EMT. Emergency medical technicians are the ones or twos. One. One is that basically entry level emergency medical technician.'",
        "'speaker_10': 'If you're interested in getting to the fire service below a paramedic. Correct. Okay. The positions that we have here, are they part time positions or full time or a mix of both?'",
        "'speaker_7': 'They're mix of both.'",
        "'speaker_10': 'And when we come about to this situation where we're at now. How many hours? A full time EMT one would put in would be would it be a regular eight hour shift an hour firefighters put in 24 hours when they perform as often for as three, 4 hours.'",
        "'speaker_10': 'So. Valencia if we go in a shift, we shift and see shift. So red, blue and green, I think it is. How do they work?'",
        "'speaker_7': 'The full time blazer operators work on the same schedule as our firefighters, but they are the only bliss the ambulance operators that are able to be mandatory back in the temporary positions or into the part time positions, I should say.'",
        "'speaker_7': 'So if you look at their calendars, they're working. 20 days or more, 20 days or more a month, and they're being forced back to work. It's not voluntary.'",
        "'speaker_10': 'So is the coverage that the EMT, the bells serious ambulance, ambulance service providers? Are they mostly daytime then? You mentioned 8 to 8 or.'",
        "'speaker_7': 'Correct. So the two units that we would look at closing any event we had, two mandatory people would be the part time. One of them runs from eight in the morning till 8 p.m. and the other runs from ten in the morning until 10 p.m..'",
        "'speaker_10': 'So you basically have air services at through the early morning hours or radio shifts.'",
        "'speaker_7': 'You would have A.L.S. services throughout the day, 24.'",
        "'speaker_10': 'Hours a day. But I'm saying that the majority of the you wouldn't have that many bells. Ambulance operators in the graveyard shift, we have mostly full time paramedic services.'",
        "'speaker_7': 'Decorate the three at night.'",
        "'speaker_10': 'You know? Correct. Also in also looking at this. Acting City Manager mauka. I'd also like to see we could get together with h.R. And Civil Service to look at not only the duties of the emt and what they do, but also look at some of the wage discrepancies that might exist.'",
        "'speaker_10': 'If we're losing ambulance operators to other jurisdictions. We're probably losing for a number of reasons. Obviously, 1/1 and foremost is pain. And I think that perhaps we should look at what's out there in the market. What can the market bear as far as paying these ambulance operators a little more than they've currently receiving?'",
        "'speaker_10': 'Now, I know it'll be an effect on our budget. However, if we're losing people and we're getting through the state of emergency, that's something that we need to address and we should address it as quickly as we possibly can.'",
        "'speaker_10': 'So I would also want to include a classification review, if you will, with including salaries so that we can look at a better long term solution to this issue here.'",
        "'speaker_5': 'But yes, we do expect this to come up during negotiations. Now's the time to address these types of issues as we're going into negotiations with. And so we we are aware that these of the pay of these employees and recognize the duties that they do for that pay.'",
        "'speaker_5': 'So we will be looking at that.'",
        "'speaker_10': 'And one more thing. I if I recall correctly, we used to have somewhat contract ambulance services, provide supplemental services to the city with that American medical services, I think was one at one time. You're in Long Beach, are they?'",
        "'speaker_10': 'We have no more contract ambulance services out there anymore that we contract with.'",
        "'speaker_5': 'So we used to contract the service out completely and not have our own ambulance operators of several years ago we went to an in-house model rather than the contract model. That is something we're going to be looking at as well as for those supplemental times.'",
        "'speaker_5': 'If you, you know, can we do it with in-house staff? Do we have a pool of staff that can do it? But is contracting an option as well? So we'll be looking at that as part of the review.'",
        "'speaker_10': 'Would contracting out the summit rephrase it? It's a terrible way of saying it. Would contracting with a million services be possible in the in the short term right now to address this current need?'",
        "'speaker_5': 'We don't believe it to be possible in the short term. By the time we would have that and go through all of the meet and confer and everything required. We're going to be fully staffed already. So this would be more of a long term solution and would not be contracting out.'",
        "'speaker_5': 'It would be more supplemental services where we.'",
        "'speaker_10': 'That's what I meant after. That's what I meant. Well, also, in perhaps in this evaluation, we can look at supplemental services, contract services as well for those times when there is a run of emergencies that would require getting a supplemental ambulance service to assist the city in that in that respect as well.'",
        "'speaker_10': 'What I want to revisit that in the short term. That's all I have. Thank you.'",
        "'speaker_8': 'Brian. Thank you very much. We have no more comments on that. Can we please no more from you comes by and please cast a vote. Excuse me, Councilwoman Pierce. Okay, fine. Okay, good. Cast your votes, please.'"
    ],
    "Recommendation to request City Attorney to draft an urgency ordinance for review at the November 12, 2019 City Council meeting, to prohibit no-fault notices and no-fault evictions through December 31, 2019.": [
        "'speaker_11': 'Motion carries.'",
        "'speaker_8': 'Thank you. Now we're going to move on to item 20.'",
        "'speaker_11': 'Communication from Councilmember Richardson, Councilmember Pierce, Councilmember Urunga. Recommendation to request a city attorney to draft an urgency ordinance for review at the November 12th, 2019 City Council meeting to prohibit no fault notices and no fault evictions through December 31st, 2019.'",
        "'speaker_8': 'Fine. Thank you, Janet. Switching. Okay, fine. Okay. We're going to have public comment when I'm public coming in.'",
        "'speaker_6': 'No, I'm ready.'",
        "'speaker_8': 'Okay, let's go. Let's.'",
        "'speaker_6': 'Let's cue the PowerPoint. Great. Thank you, vice mayor. So today we we're going to consider a the no no fault evictions. But I want to kind of start this conversation with a narrative of what has kind of gotten us to this point and that we are we cued up with the.'",
        "'speaker_6': 'There it is. All right. So as many of you know, AB 18, 1482, the Tenant Protection Act was signed by Governor Newsom October 8th of this year. This new legislation primarily does four things beginning in January 2020. Number one, it puts a cap on annual rent increases.'",
        "'speaker_6': 'It limits evictions without cause in the state of California. It offers relocation assistance or rent waiver in certain no fault cases. It sets noticing requirements to ensure tenants are communicated with throughout the whole process. And it sunsets in the year 2030.'",
        "'speaker_6': 'And, you know, it's the point of this law is to protect tenants. And it has good intention. It's a good intention law. However, it's created a significant policy gap that has placed residents across the state of California, including here in Long Beach, at risk.'",
        "'speaker_6': 'The time when the time between when the bill was approved by the legislature and the day the bill goes into a law, creates an unintended incentive for landlords to get ahead of this law. These laws that are being implemented January 2020 by raising rents set a sort of a flurry, a frenzy of increased rents or 60 day'",
        "'speaker_6': 'notices. So this law unintentionally creates the incentive to get it out before the deadline, get the rents up, or get the 60 day notice end before the deadline. This is a current problem and it will continue if unaddressed.'",
        "'speaker_6': 'It will continue to negatively impact Long Beach, the second largest city in Los Angeles County, where three we're almost three out of five residents in our city are renters. We know that this we've heard anecdotal evidence, but we've also seen real accounts, real documented accounts of strategies for landlords to to actually sort of game the system.'",
        "'speaker_6': 'You've got a quote here, you know, cited October 7th in The L.A. Times. It says, ways that landlords could evade rules that as of January 1st would cap annual rent increases for tenants at 5% plus inflation and require just call the evict is the quickly hand out no fault no fault eviction notices to tenants who play low'",
        "'speaker_6': 'rent or make frivolous requests. And this was a landlord attorney being quoted addressing other landlords, and it was covered in the in the Los Angeles Times. So we know that this we know that this is this is happening.'",
        "'speaker_6': 'So here's a timeline of major actions that have taken place in the state of California and here in Long Beach that have created this environment, this shifting legislative environment, that makes it hard for both landlords to navigate and for tenants to understand.'",
        "'speaker_6': 'So it sort of cuts both ways. So a list of these these actions. So the ones that are in blue sort of represent actions right here in the city of Long Beach that are along with city council has taken actions in black are actions that the state has taken.'",
        "'speaker_6': 'And then green is the proposed ordinance that we have tonight. And so you'll see a, you know, March 28th, the Tenant Protection Act of 2019 was introduced April 2nd. It'll be city lobby. City Council Adopts the initial motion to establish tenant relocation ordinance.'",
        "'speaker_6': 'June 11th, City Council approved that ordinance. August 1st, the ordinance went to effect. August 7th. Gavin Newsom announces his support and calls for HB 1482 and says, If you deliver it, I'll sign it. September 11th, the state legislature delivered HB 1482 and landlords are officially on notice.'",
        "'speaker_6': 'September 14th, three days later, proposed urgency ordinance. So October 8th, the Gavin Newsom signs AB 1482. November 3rd, six day notices can no longer be issued because they will expire in the new year. So they'll be effective. The new the new law would effectively make those unlawful.'",
        "'speaker_6': 'And then November 12th is when this potential ordinance will go into effect. And then January 1st is when AB 1482 will go into effect. So this just is to show you that there's a shifting there's a lot of actions that take place that sort of change the rules that created this frenzy, this enticement to issue these notices'",
        "'speaker_6': '. Now, the dates within the red box, that's where the gap exists. So the gap exists basically between the time of 17 September 11th when the call went out, raise your rents now, evict now and potentially November 12th, when this protection would kick in.'",
        "'speaker_6': 'So there's a gap. So notices that came in during that time, a result of this this frenzy that was created by by the pending implementation of this state law. So we are not the only. So cities are stepping up to take an action to add additional protections to our citizens.'",
        "'speaker_6': 'And we're not. We're far from the only city. We're not the only city to consider taking this action. Several cities across southern California, across the state, are taking that same action to protect their tenants. Los Angeles City Council Spectrum has taken this action.'",
        "'speaker_6': 'City of Cudahy, Bell Gardens, city of Torrance. I had a good conversation with Torrance Mayor about it. You know, he had a dilemma, but he felt, you know, he fell on the side of this the right thing to do.'",
        "'speaker_6': 'City of Sacramento. Milpitas. Redwood City. Daly City. Santa Cruz. Just yesterday, the city of Pasadena took the first action and adopted the urgency ordinance of the same night at 1201 to add these protections. They took a step. They went a step further and they added actually a rent rent stabilization into the ordinance to said, number one, you'",
        "'speaker_6': 'have to roll your rent all the way back to March 2019 level and you cannot raise your rent more than eight point something percent between now and the end of the year until the state law kicks in. Today at 10:00 in the morning, Alhambra adopted an urgency, a, you know, an emergency and adopted the same thing at'",
        "'speaker_6': '10:00 this morning. These are cities that, you know, aren't don't you know, they don't have the reputation of being a, you know, uber liberal city or San Francisco. These are middle of the road, middle class cities just like Long Beach.'",
        "'speaker_6': 'Taking a look at an issue that impacts everyone, all of the renters within the city. And so. So compared to the approach some of these is taking or taking, the proposal tonight is really clean, simple, modest. Today's proposal proposed action requests that our city attorney draft an urgency, an order urgency ordinance to prohibit no fault evictions and'",
        "'speaker_6': 'notices on at our next meeting November 12th. To be clear, this doesn't stop evictions of individuals who are not paying their rent or violating the terms of a lease. This is no fault. These are people who are caught up in this frenzy that's taking place right now is simply says that through the end of the year, let's'",
        "'speaker_6': 'stop this frenzy, eviction that's that's impacting our residents and make sure that we keep our families in their homes through the holiday season. This is modest, but meaningful. But it will help us move into the New Year and continue our efforts as a city council to prevent homelessness.'",
        "'speaker_6': 'This is a crisis directly connected to homelessness. Thank you. So the last thing I'll say is last thing I'll say is, you know, wasn't a part of my comments, but I thought about it actually when I was listening to one of the folks who was speaking on the Belmont Shore mobile home situation about her personal life and'",
        "'speaker_6': 'not, you know, not really wanting that and wanting to speak up, but, you know, being compelled to. And I thought about my life. I thought about, you know, when I woke up this morning, you know, helped, you know, like we normally do get up, you know, get the kids ready for school, get ready for work.'",
        "'speaker_6': 'I had a meeting out in West Covina at 9 a.m. this morning, so I was driving. Right. I was nervous. I was nervous about this vote. I was nervous because I know that our city council has has had to deal with some very challenging things over the last couple of years.'",
        "'speaker_6': 'A lot of it linked to, you know, where people live or how they work or dignity. And I know that that's that's been the case. They've had to deal with some very divisive issues. And I know that this, you know, initially, you know, being on a supplemental item, being an urgency item, you know, it probably brought some'",
        "'speaker_6': 'of the same feelings back. But then I was reminded that I had a bed to get out of. I had a home to get ready and go to work from. And I'm not dealing with the stress of a 60 day notice delivered at the end of October that would have me on the streets at Christmas.'",
        "'speaker_6': 'I'm not dealing. That's not my situation. We have a responsibility to do the right thing and keep these people in their homes. It's not their fault. This is no fault. So we have a responsibility. Seek to add this protection to the people of our city, a majority renter city, the second largest city in the county, Los Angeles'",
        "'speaker_6': '. I serve as I serve on the SAG Regional Board, the six counties with the second largest city in six Southern California counties. We have to do the right thing here. So that said, I submit the motion as written.'",
        "'speaker_8': 'Thank you. Thank you, guys. And I think before we get started, we're going to take some time because I think I have to. Yes. Yes, I was. Now you want. Yeah. Okay, fine. Go ahead.'",
        "'speaker_10': 'I didn't mean to confuse you like me or you. I want to basically reinforce the last comment that my colleague, Councilmember Richardson, said. At this time of year, this is the worst possible thing that we could do when we are looking at families who are going to be.'",
        "'speaker_10': 'Short on cash. We are going to be short on housing. You are looking at the holidays ahead and looking for celebrations and and having good times with family and get togethers. This is not a good time for this.'",
        "'speaker_10': 'So I totally support the moratorium to take place. And when it comes to a vote, again, I'm going to be there at the same way. I think that basically when we look at the the. Damage that this could do to families and putting them out, putting them out in the streets or in their cars or trailers or'",
        "'speaker_10': 'wherever, wherever they can find housing is in front of a front of a storefront or whatever. That's not good. So I totally support this and I hope that my colleagues will support it as well.'",
        "'speaker_8': 'Hi. You know, as vice mayor, I don't think many of us in these cases really are looking for any applause because we know and what we do tonight is only going to benefit those who are out there in the street, who are homeless and knowing that we can continue to grow at the rate we're going now.'",
        "'speaker_8': 'So I'm hoping that this will pass. And we with no disrespect to anyone out there, we have 60 speakers. And with that, I would like to move it down to one minute to each individual so we can get everyone a chance to speak.'",
        "'speaker_8': 'Yeah.'",
        "'speaker_4': 'Vice mayor. Vice mayor?'",
        "'speaker_8': 'Yes.'",
        "'speaker_4': 'I just want to make sure that there's no objection to that.'",
        "'speaker_8': 'Yes, I was with no disrespect from them and actually from the diocese with one man to be okay. All right. Right on. Good. Okay, here we go. In this order, we got 60 speakers starting out with Mr.. Very good here.'",
        "'speaker_8': 'Now we have 59.'",
        "'speaker_2': 'Okay. Yeah.'",
        "'speaker_8': 'Okay. We're going to have five at a time. Step in. Victor. Norma. Molina. And Natalie, would you please come up in that order? 7 minutes. All right.'",
        "'speaker_7': 'Stephanie Dawson, still a Democratic Socialists of America, Long Beach chapter.'",
        "'speaker_1': 'The city is made of people, people from.'",
        "'speaker_7': 'A variety of backgrounds who create the distinct neighborhoods that make our city unique and special. And now these people, your neighbors, the people you see every day in your parks who care for your families and serve brunch on, you know, for you on Sunday, Funday are being evicted from their homes.'",
        "'speaker_7': 'They have held a failed housing policies. This item is welcome, necessary and hopefully not too late to.'",
        "'speaker_1': 'Reverse or at least negate some of the plethora of negative consequences.'",
        "'speaker_7': 'Created by the downtown plan. There should be no carve outs. The apartment. The clients of Mr. Murchison and the Apartment Association created this problem. They should not get special treatment. This moratorium should be permanent. It should be a first step towards full and uncompromising rent control.'",
        "'speaker_7': 'Housing is a human right, and it's time that our policies in the city reflected this moral truth.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_8': 'Thank you, Victor. We are better. We're normal. We're more.'",
        "'speaker_1': 'Honorable. Vice mayor, members of the city council, and Victor Sanchez, director of the Language Coalition for Good Jobs in a Healthy Community. It's really important issue. We heard a lot about trust and the need to rebuild trust, right.'",
        "'speaker_1': 'That property management companies, landlords, those that are motivated by profit are taking advantage of vulnerable working class families. And that's really what this is about. It's about keeping working class families in their homes for the holidays. It's the easiest thing we can do today as a city is to ensure the.'",
        "'speaker_5': 'Promise that the state has.'",
        "'speaker_1': 'Passed in its bill packet back in September to close the gap so that nobody is left.'",
        "'speaker_5': 'Behind. I just got done talking to a family outside. They're stressed out.'",
        "'speaker_1': 'Not knowing whether or not their actual notice is valid or not, because that's a big concern, too. You can get a notice, but you don't. Well, you don't have the means to provide proof as to whether or not that's actually a valid notice but stressed out because now they had to find housing right before the holidays.'",
        "'speaker_1': 'The gentleman's a trucker. It's very difficult to thank you for saving your life when you don't have stable housing. We urge you to pass a motion with no covenants.'",
        "'speaker_8': 'Norma.'",
        "'speaker_12': 'Hello. My name is Norma Galindo, member of Birds Central. Remember of Star Center launch? I moved.'",
        "'speaker_2': 'To a38.'",
        "'speaker_12': 'Share window in 2004. I was current in a section. I began working in a mental health facility and ultimately battled mental issues myself, develop depression. My property owner unjustly evicted me because of my battles are facing 2015. We had to throw away our newly bought furniture and the.'",
        "'speaker_2': 'Rooms we were hoping to grow. I took my property owner to court.'",
        "'speaker_12': 'To have my deposit back. He then intimidated me from pursuing the case, which was made worse by my depression. I didn't have support because there is no right to counsel in eviction court and my husband's and I knowledge on the law was missing and we had.'",
        "'speaker_12': 'This is normal. I had a hard time.'",
        "'speaker_8': 'Thank you. Yes. Only.'",
        "'speaker_3': 'My name is Marlene Alvarado. I live in the First District and I am a landlord. I support. I'm 20. An eviction moratorium. Unscrupulous landlords are evicting community members as police response to AB, which protects tenants. Item 22 Eviction Moratorium Steps The privatization of Long Beach families, especially children.'",
        "'speaker_3': 'Unlike Scrooge, I would not put one single Long Beach child on the street for Christmas. Unlike unprincipled land, some unprincipled landlords, I would not kill the golden goose and evict a senior citizen who has put a renter out, who has been a renter for many years.'",
        "'speaker_3': 'Because I want to charge higher rent. Nor like King Midas. I would not wish that everything I touched turned to gold and evict hardworking families because they cannot afford to pay the speck of gold of higher rent that I require to prevent further homelessness and traumatization in families and senior citizens.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Pass a law.'",
        "'speaker_8': 'All right, sir. And your. It's Russia. And you.'",
        "'speaker_14': 'Okay.'",
        "'speaker_8': 'Marvin. In Darwin. I lost five in a row. This as close here. Come here, please. An angel behind and you'll hear. Marvin Emmanuel. Go ahead.'",
        "'speaker_12': 'Hi. My name is Clarissa Hernandez, and I'm here on behalf of my grandma. She and other residents in her building are members of the Section eight program. So under there notices that they got they they basically getting evicted because they're poor just like many of these people speaking today and families being evicted and being affected by the'",
        "'speaker_12': 'notices. The only fault that they have is poverty and lack of resources and support. So it is very important, as Councilman Richardson explained, you know, with the loopholes and the timing of everything, that this ordinance be drafted and be approved.'",
        "'speaker_12': 'Because, you know, going back to the theme in the beginning of this meeting, families important, you know, and we all want to have a safe home for the holidays and we deserve that.'",
        "'speaker_8': 'Thank you. Thank you. Amen.'",
        "'speaker_1': 'Greetings. But Mr. Andrews in, Councilman. My name is Marvin Duran with some a long term residents in city Long Beach, 50 plus years. I'm also an advocate for black people and other people of color. I would like to urge you to join Los Angeles in enacting an emergency law to stop landlords from evicting tenants before a new'",
        "'speaker_1': 'state rent cap just cause eviction protections go into effect in 2020. Evictions hurt our communities and in particular targeted our black women. However, social sociology professor Matthew Desmond, studying housing policy, homelessness and the policies of evictions, came to a conclusion that started stolen him.'",
        "'speaker_1': 'If incarcerated in Carter, incarcerated had come to define the lives of men from impoverished black neighborhoods, evictions was shaping the lives of women. Poor black men would lock up. Poor and poor. Black women were locked out. Thank you.'",
        "'speaker_1': 'Oh, yes. Sorry.'",
        "'speaker_8': 'Alex and Gretchen. Is Alex here? Gretchen? Randall. Karen. In any order. Just come right out. We'll get you.'",
        "'speaker_3': 'Karen Reside, resident of the First District and a proud.'",
        "'speaker_9': 'Long Beach Gray Panther. We're here tonight because this is just simply elder abuse.'",
        "'speaker_3': 'If you look at who's being evicted. Look at all those people from the mobile home park. Most of them are elderly people. They've worked hard all their life to have a stable retirement and the rug is being ripped right out from underneath them.'",
        "'speaker_9': 'This is elder abuse, pure and simple. We know the landlords do not have our.'",
        "'speaker_3': 'Community's best interests at heart. Nobody gave refunds on the rent increases that they did when the rent control ordinance was supposed to be passed. This is purely driven by profit, and it's destroying the fabric of our community. And to do it at the holiday time is just the cruelest of a cruel.'",
        "'speaker_3': 'And I urge you to do more. This is a good first step. But we've got to do more to protect our community because it's being destroyed.'",
        "'speaker_8': 'Thank you. It's dawn here. Would you please state your name? Is Darwin here? Okay. Just come right up, Miss. And state your name, please.'",
        "'speaker_3': 'I thought you said my name, but if you didn't, I'm sorry.'",
        "'speaker_8': 'Just stated. Please push your.'",
        "'speaker_3': 'Native Tushnet and I live in the third district. I've been a renter, a landlady and a homeowner at base. I'm a person who wants a stable and diverse community. As a senior, I'm particularly concerned about others in my age group.'",
        "'speaker_3': 'I can only imagine the pain and anxiety that comes with losing your home, and it's made worse at this time of year particularly. I'm approached almost every day. I'm approached by another senior who has been evicted with no cause.'",
        "'speaker_3': 'We are actually good tenants always. We've worked hard and we pay our rent and we have this kind of work ethic and responsibility that we keep. The state law addresses these problems, but it doesn't go into effect right away.'",
        "'speaker_3': 'And I thank you next weekend.'",
        "'speaker_8': 'Please send your name.'",
        "'speaker_3': 'Hello. My name is Cara McGraw and I am an attorney at Lifeline, the Long Beach office. In response to the term two, in response to the Tenant Protection Act or to cities regionally and statewide, have stepped up to protect residents who are at risk of losing their homes before the TPA goes into effect at the beginning of'",
        "'speaker_3': 'the New Year. These cities include Los Angeles. Pasadena. Bell Gardens. Santa Cruz. Sacramento. Alhambra. Cudahy. Daly City, Redwood City, Milpitas, San Mateo and Torrance. Some cities are going beyond eviction freezes and adopting rent freezes and caps as well.'",
        "'speaker_3': 'L.A. County and Inglewood have adopted local ordinances that are even stronger than the TPA and that are already in effect. If Long Beach does not join, it will fall behind regionally. Long Beach should join these cities in preventing its residents, including its most vulnerable, like seniors, disabled and female head of households, from being pushed out of their'",
        "'speaker_3': 'homes and becoming homeless over the holidays. A clean and simple freeze on all no fault notices and eviction.'",
        "'speaker_8': 'Thank you, actually. State. Your name, please.'",
        "'speaker_3': 'Good evening, Gretchen Swanson. I'm from Rose Park. We've been having a bad week. And it'll continue if we don't take action this evening. Someone mentioned Scrooge. That's how I think about this. I think about Charles Dickens, early 1800s, a Christmas Carol and all those ghosts.'",
        "'speaker_3': 'He didn't get the message until the end of the play. I hate that play. He is a slow learner. My city can't wait for this, and my neighborhood can't. So let's keep everyone home for the holidays. My city council should embrace the values of the holiday season.'",
        "'speaker_3': 'Don't be a Scrooge. I don't think you are. Vote for the eviction moratorium.'",
        "'speaker_1': 'Thank you. Thank you. And speaking. Good evening. My name is Alex Stress. I'm a staff attorney with the Legal Aid Foundation of Los Angeles. Today, the city is being asked to act fast and protect its tenants against invalid and unlawful evictions and to keep them home for the holidays.'",
        "'speaker_1': 'It is not being asked to draft brand new legislation. For better or worse, the state already did that. What we are asking is to pass a clean interim ordinance. What is crucial is that it protects all no fault notices where tenants are in possession and where evictions have not yet been adjudicated.'",
        "'speaker_1': 'I hope that there is no attempt to carve out or exempt any more tenants as that would be. This city trying to rewrite a state law that's by that by its own terms cannot be watered down. What the what the city should be trying to do is include as many tenants as possible in their interim ordinance, not'",
        "'speaker_1': 'figuring out a way how to exempt certain tenants. I hope that other council members will vote for this interim ordinance. Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_12': 'Good evening. My name is Brenda Velasquez. Good evening, Mayor and Council. God bless you guys. My name is Brenda. I'm a resident in District one. I'm a single mother. I have two children, three and four, Milagros and Genesis.'",
        "'speaker_12': 'And they have ADHD, autism with behavior. And I'm just asking for your help because I have a 60 day notice.'",
        "'speaker_2': 'They know this too well, and I'm sure that can help.'",
        "'speaker_12': 'And I've been slapped by my landlord and she hit my.'",
        "'speaker_2': 'Daughter, my four year old, and.'",
        "'speaker_12': 'She's having problems.'",
        "'speaker_2': 'At her school for. And mother would do anything for her kids. I hope and I pray that, you know, you consider.'",
        "'speaker_12': 'This and be on my shoes like I am right now.'",
        "'speaker_8': 'Thank you very.'",
        "'speaker_3': 'Much. Thank you very.'",
        "'speaker_8': 'Okay. The next six speakers Perlis, Jordan, Cathy Andrews and Martha.'",
        "'speaker_5': 'Hello. My name is Jordan Wynn. I am now a resident of the second district. I am here representing United Way of Greater Los Angeles and the everyone in L.A. movement, which is designed to help prevent people from experiencing homelessness.'",
        "'speaker_5': 'We had a big push in Los Angeles just a month ago in order to pass the eviction moratorium that they passed. And nobly, they passed that unanimously. I'm asking you all to do the same. Stand up with the tenants who are here in this room tonight facing these evictions right before the holidays.'",
        "'speaker_5': 'This is literally Christmas Eve. This is New Year's Eve. These are people who are on the tail ends trying to celebrate and live with their family, have a great time at the end of the year. And instead they are faced with greed and as many people have referred to already, Scrooge Yunis.'",
        "'speaker_5': 'So stand with other cities tonight and pass this eviction moratorium unanimously. Thank you.'",
        "'speaker_8': 'Thank you very much. Africa.'",
        "'speaker_3': 'Good evening. My name is Kathy and I am in the District six that I don't know.'",
        "'speaker_9': 'My councilman, but God bless you.'",
        "'speaker_3': 'It's obvious you guys are sensitive enough to know what's going on. Everyone is telling you it's because of the holidays and it's children. It's the elderly. I am.'",
        "'speaker_9': 'A street minister who has the passion and love.'",
        "'speaker_3': 'For the elderly, the disabled, the homeless and anyone else who needs some help. I want to love them and pray for them and help them.'",
        "'speaker_9': 'And I'm an advocate for them.'",
        "'speaker_3': 'But how do I help them? I don't have the I don't have the means. I don't have the money. Everything I do is for free and I don't ask for money. So what I'm asking is you guys, please just continue to do the things that you know are right.'",
        "'speaker_3': 'And it's not just temporary either just because it's the holiday. It's even after the new year. These people are being evicted because of other people want whatever they want, I don't know. But they become victims. And then my heart breaks for them.'",
        "'speaker_3': 'And I really do hope that you will pass this and I believe you will. God bless.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_10': 'Hello. My name is Andrew Andromeda Hanna with Long Beach Forward.'",
        "'speaker_5': 'Supporting the best starts since a Long Beach initiative, an initiative of families, caregivers and organizations focus on the birth to age five population. These organizations include home visitation, child abuse prevention and child care programs, even including members of your own health department.'",
        "'speaker_5': 'If these professionals realize that housing stability is a public health issue, I hope each one of you realize that as well. I'll read some excerpts from our eviction moratorium, some support letters submitted yesterday, and one of our leadership team members will submit it to you today.'",
        "'speaker_5': 'Trauma informed practices, however, only go so far in preventing adverse childhood experiences, according to doctors Elizabeth Bone and Dean Martin. When social policy becomes more trauma informed, it will be better able to promote the safety and empowerment of its target.'",
        "'speaker_10': 'Constituents and ultimately disrupt trauma driven.'",
        "'speaker_5': 'Disparities in health and well-being. To adopt an eviction moratorium and pursue other tenant protections, we are ensuring babies, children and their families are healthy and safe with a passion for life and learning. Please keep all tenants.'",
        "'speaker_10': 'In all units.'",
        "'speaker_5': 'In their homes.'",
        "'speaker_10': 'I appreciate some of you for being vulnerable with me this weekend and I hope to have your support.'",
        "'speaker_9': 'Good afternoon, ladies and gentlemen. My name is Pearlie Piggy and I live at Providence Garden. I'm the vice president of our association, which we developed to help.'",
        "'speaker_1': 'Our seniors, especially seniors. Seniors.'",
        "'speaker_9': 'It's of a background backbone to everything that we do.'",
        "'speaker_1': 'So, please, during this holiday, the next one and the next one. Think about the seniors. Think about your parents.'",
        "'speaker_9': 'Think about the people that you have in your life.'",
        "'speaker_1': 'They need to be home for Christmas.'",
        "'speaker_9': 'And everybody need to be together in peace.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Thank you. Next week.'",
        "'speaker_14': 'But I know she has me. Nobody is going to even go there to see Tono.'",
        "'speaker_2': 'Okay.'",
        "'speaker_14': 'Get all that silly council held on me. That much I will say so Corazon is coming in the saddle. Borromeo this will see horse imp inside a lazy. There was nothing else than a stack of money that.'",
        "'speaker_3': 'Good morning. I'm sorry. Good evening. My name is Dakota. I'm from District one. And I would like to say, Councilmember Richardson, that I'm really happy that you touched your heart this morning to think about your children and how the children will be affected.'",
        "'speaker_3': 'And not just your children, but others children as well.'",
        "'speaker_14': 'You could showcase this momentum. But instead this communist representantes boy that made a lot more than Mr. Familias. Either low capacity egg or nails. We be lucky. Well said here on again whether you want to think on it Carol.'",
        "'speaker_3': 'And I think it's good that you are able to see as council members the pain from the families and how they would be suffering if they were to become homeless. And somebody said or mentioned something about living in a car.'",
        "'speaker_3': 'I don't even have a car. Where would I live? Where would I go?'",
        "'speaker_14': 'We have Avenue Civic. I mean, we have an issue. But I get those things. Maybe I get no unique access for much of a family. It's kind of I mean.'",
        "'speaker_3': 'I'll come live here at the Civic Center here so that everybody can see, because I'm not the only one. There are so many people here as well in the same situation.'",
        "'speaker_14': 'As this case that no, god, I would not have been able to do this moratorium.'",
        "'speaker_3': 'So this evening, everyone should vote in favor of this moratorium.'",
        "'speaker_14': 'You and I, consumers and families. You estamos. That is the thing linked up with us on mass momentum established on me.'",
        "'speaker_8': 'Thank you. One minute, please. Come on. You have to do something.'",
        "'speaker_3': 'One more thing. I have interpretation. So I get one more minute. I get one more minute because I have interpretation.'",
        "'speaker_14': 'Sorry, Mr..'",
        "'speaker_8': 'Hatari.'",
        "'speaker_14': 'Yeah. Okay.'",
        "'speaker_2': 'They gave it to.'",
        "'speaker_14': 'You for Q&A.'",
        "'speaker_2': 'No excuse for.'",
        "'speaker_8': 'How she gave it to you.'",
        "'speaker_14': 'Okay. Distrito. No Estamos. I think almost time of assumption did not.'",
        "'speaker_8': 'Okay. Yes, go ahead. No, I didn't. She already gave it to you. Just. Yeah, yeah. Okay. Yeah. Next. Okay, now we have Ozzy one and John one for. You have a question here. When one Garcia you have John Kendall.'",
        "'speaker_8': 'One force, Eric Bailly. Those people, please come up.'",
        "'speaker_9': 'Hi. My name is Jan Ford and I live in the second district. We're all here because we love Long Beach. And there's something about Long Beach I'd like to point out. Look at the demographics projected for the United States in 30 years and then look at the demographics of Long Beach.'",
        "'speaker_9': 'Today, we're living the future of America and we have the chance to do this, to show the entire country how to do this right. Let's start by protecting the most vulnerable and hardworking of our neighbors who are being thrown into the street at the holidays.'",
        "'speaker_9': 'Please don't let this happen in our beautiful, vibrant city. Please vote yes for the eviction moratorium. Thank you.'",
        "'speaker_8': 'Thank you. Thank you. Yes.'",
        "'speaker_3': 'Hello. My name is Aaron Foley. I live in the first district. As you know, at this time, my district is without a council person. So I felt like I needed to come down here and appeal to the rest of you in person to please pass this moratorium.'",
        "'speaker_3': 'Being a renter in Long Beach is scary. It sounds dramatic, but rents are continually keep they keep rising, and affordable housing is few and far between, as is the existence of small time property owners and landlords that actually care.'",
        "'speaker_3': 'Each year that I have lived in my current place on Pacific Avenue, my rent has risen to a total of 25% in the past four years without any improvements. A couple of times, once due to a clerical error on their part, someone from the property management code slapped a three day power, quit notice in my mailbox without'",
        "'speaker_3': 'even a word to me personally or a phone call. Each time my heart was racing, my stress level, shooting to the sky, and a feeling of being so expendable, so palpable. And we were lucky to work it out.'",
        "'speaker_3': 'But not everybody is that lucky. Times are tough, and though we are lucky to live in Southern California, it's getting cold and there are so many people out there struggling. So please pass the moratorium, but also continue to work towards viable solutions for keeping more of our community from being replaced.'",
        "'speaker_5': 'Good evening, members of the council. My name is Joshua Christian and I'm the eviction defense attorney with the Legal Aid Foundation for the City of Long Beach. I assume it was me that Councilman Adams referred to legal aid advocates, field calls from the community members every day.'",
        "'speaker_5': 'And in the last six weeks, those advocates have spoken to nearly a thousand individuals seeking legal advice. Out of a thousand calls, more than two thirds of them have been clients with housing issues, the number of clients with no fault notices is rising every week.'",
        "'speaker_5': 'And for every individual who calls our hotline, there are a dozen more who don't or who can't. And I know this because of my actual cases. It's not just people who say, I got a no fault notice. What do I do?'",
        "'speaker_5': 'What about my kids? It's also what about my neighbors? She's been here for 20 years. What about my whole entire building? Management companies are sweeping through communities with 60 day notices. There is an indiscriminate scramble to evict as quickly and efficiently as possible going on right now.'",
        "'speaker_5': 'So I hope that the Council will move forward with the ordinance and put a halt to this wave of evictions and give tenants the confidence that the law is the law and they are protected. Thank you. Thank you.'",
        "'speaker_8': 'Hello. My name is John Kendrick.'",
        "'speaker_7': 'I'm on the borderline of first and second district.'",
        "'speaker_10': 'I'm also a board member with the Long Beach Gray Panthers and Library.'",
        "'speaker_8': 'Here in the city of Long Beach. And I want to address the things that.'",
        "'speaker_6': 'Was not said.'",
        "'speaker_8': 'It is proven that by keeping people in their.'",
        "'speaker_10': 'Apartments.'",
        "'speaker_8': 'Is less burden on.'",
        "'speaker_10': 'The system. We spend more money when people are homeless.'",
        "'speaker_8': 'Especially if they're a senior or disabled. So if you're trying to save money, keep us in our homes.'",
        "'speaker_2': 'Also, look at your mission statement. If you do.'",
        "'speaker_1': 'Not vote for this recall, it's a.'",
        "'speaker_8': 'Holiday or no holiday.'",
        "'speaker_4': 'You're going to guess your.'",
        "'speaker_1': 'Own mission statement.'",
        "'speaker_8': 'And I think everybody here should read that statement, what it says.'",
        "'speaker_10': 'And remind the city council and everybody in.'",
        "'speaker_1': 'The city what it says, what we should be all about. Thank you.'",
        "'speaker_8': 'Thank you. Next week, speaker.'",
        "'speaker_10': 'Hi. Hi. My name is Ivan, who's writer is Juan. But it's Ivan. First District resident.'",
        "'speaker_0': 'Resident.'",
        "'speaker_1': 'Anyway, I just want to say.'",
        "'speaker_10': 'That the state we AB 1481 may have left a gap that when spans from September to January. However, it's the responsibility of the city to actually close the gap, to ensure that, for.'",
        "'speaker_0': 'One, families with.'",
        "'speaker_10': 'Children and elderly folk are able to remain in their homes over the holidays. I mean.'",
        "'speaker_0': 'What's worse then, instead of celebrating.'",
        "'speaker_10': 'You're actually having to worry about living on the street, having to look for a place to live.'",
        "'speaker_1': 'And that's not what the holidays.'",
        "'speaker_10': 'The VAT, the value of the holidays are about. So what I'm saying is please support. The moratorium is good for the families, it's good for the children, it's good for the elderly folk. And more importantly.'",
        "'speaker_6': 'It's.'",
        "'speaker_0': 'It benefits.'",
        "'speaker_10': 'Us as a as a city and as a community. Thank you.'",
        "'speaker_8': 'Thank you. Fine. The next speaker will be Lillian Wang. We are merciless. We are so fierce. And my watching you. Please come forward. Is that Lilia? Okay. Bye, Wayne. Cialis.'",
        "'speaker_14': 'My name is Leo Campo. I am a resident of the First District.'",
        "'speaker_3': 'And I.'",
        "'speaker_14': 'Am a mother of five. So I am a member of the Building Healthy Communities Planning Committee and based in Central Lombard, Madrid. My district has experienced many injustices when it comes to housing and myself. I've been in that position.'",
        "'speaker_14': 'So I urge you tonight to support, to keep their families for the holidays and also to take the lead. And when a moratorium for the rent increases. Nobody deserved to be out.'",
        "'speaker_3': 'In the cold.'",
        "'speaker_14': 'Nobody especially no families with children.'",
        "'speaker_3': 'And we want.'",
        "'speaker_14': 'You to support this moratorium and to keep their families and their houses.'",
        "'speaker_8': 'Thank you, Nancy Reagan.'",
        "'speaker_10': 'Hi. My name is Wayne, second district. Really awesome beginning there, Mr. Richardson. And you touched on a lot of things. It sounds like a lot of you were kind of lean in that way for the ones that aren't.'",
        "'speaker_10': 'We know who you are. They think about the money. And the money is that without this moratorium, there is going to be a whole lot more homeless and you folks are going to have to deal with it in one way or another so it'll save some money and put this moratorium in because that's going to save your'",
        "'speaker_10': 'money.'",
        "'speaker_3': 'Hi. I'm Don Watkins. I am a business owner in the ninth district. I'm a homeowner in.'",
        "'speaker_12': 'The fourth district.'",
        "'speaker_3': 'And I'm a landlord for 15 years in the second district. And I'm also a member of Black Lives Matter who supports this moratorium. My entire family lives in the second District. I'm at Fourth and cherry. My mom fought them on a pair of my in-laws that fought in Tampa.'",
        "'speaker_3': 'My other best folks off of seventh and Ohio, others fourth and Redondo. And my son's oldest son's father, a fourth and one that he was evicted. The guy who owned the building, Larry, his grandson and my son played baseball together at Sterns Park.'",
        "'speaker_3': 'He had some hard times. He owned for a place with a house on the corner of Fourth and Walnut and was on a refi. Someone came in and offered a cash out by. He took it, left town. The guy increased the rent from 900 to 1500 dollars, left my son's dad homeless for several months.'",
        "'speaker_3': 'He's a cook with a teenage daughter. And we know we live in a capitalistic society, but there's a difference between investing for some extra money and being greedy as hell at the cost of causing mass homelessness and citywide trauma.'",
        "'speaker_1': 'Good evening, Mayor Councilmembers. My name is Mike Murchison. I'm here on behalf of the Apartment Association Small Property Owners Alliance. I am a lifetime resident of Long Beach. I may not be in the majority this evening, and I appreciate the fact that nobody wants to be homeless during the holidays.'",
        "'speaker_1': 'I'm not advocating that you don't support an ordinance tonight. What I'm going to say is four facts. Number one, this was bought on the supplemental. There was no outreach to any of the business groups are going to be impacted by this from another perspective, none.'",
        "'speaker_1': 'I would encourage you on future ordinances, whether emergency or not, that you do appropriate outreach to the other side. Number two, you've got a situation that from November one to January one, 1482 applies. So doesn't really make a difference what a landlord wants to do.'",
        "'speaker_1': 'They can't do it because it's within that 60 day window. So if you're talking about the window outside of the 60 days, then by all means go ahead and do that. But think about this. Those tenants and specifically the ones have been reporting the Long Beach Post this evening have already been paid 50% under your own tenant'",
        "'speaker_1': 'relocation ordinance. They've already been paid. Keep that in mind. Thank you.'",
        "'speaker_0': 'I want to make sure we got this, as did Marcel de Rivera speak already. And so Ms.. I think it says here, please come forward. Marcella Rivera, Suffolk Media. And then I'm going to ask the next group, please, if you can please get in line.'",
        "'speaker_0': 'Fred Sutton, Julie Sorrow. Maria, I think, says Luisa and Daniel Lamping, if you can please get in that order. So we have Marcel de Rivera, Sophie Ramirez, Fred Sutton, Sally, Sara maria Luisa and Daniel Lamping.'",
        "'speaker_3': 'Thank you, Mayor Garcia. I'm sorry. I didn't hear my name earlier. My name is Maricela de Rivera. I am a ninth district resident. I'm incredibly grateful that my council member, along with my previous council member in District six, District two.'",
        "'speaker_3': 'Sorry. I love you too. I guess that's why I said six.'",
        "'speaker_12': 'Brought this forward. I'm.'",
        "'speaker_3': 'It's very hard to be here.'",
        "'speaker_12': 'Because my husband and I come from very humble means. Understand what it's.'",
        "'speaker_3': 'Like to be housing insecure and now have a better life. We are homeowners. This is our second.'",
        "'speaker_12': 'Home we've lived in in Long Beach. We have a six figure.'",
        "'speaker_3': 'Income family now. We are doing very well.'",
        "'speaker_12': 'I'm a city commissioner.'",
        "'speaker_3': 'Life is great. And we constantly think about the fact that if we did not have generational wealth that helped us become homeowners, we would absolutely have to leave Long Beach.'",
        "'speaker_12': 'We would be homeless, too. My mother lives with us because even with our generational wealth, it's not enough.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_3': 'Thank you for this, I think. Hi. My name is so Pachomius. I'm here on behalf of the four monks out here. Two of them were evicted, wrongfully evicted from 2100 West Wall Street. And in the process, two other monks are left homeless and they're now or camping on the sidewalk in tents in the cold on 21 street'",
        "'speaker_3': 'west Willow. And the reason why for the eviction? Well, first of all, monks cannot get evicted. They don't pay rent. Monks live off of donations and offerings of the people and the the temple that the they had 12 board of directors who are so hungry for power push the monks out because they were not willing to conform'",
        "'speaker_3': 'to to to their to their means of corruption and lies in order to gain power to to to make something bigger of the organization so they can get funded from the government. And so I would like to ask for for you to assist in this matter, because it's getting out of hand.'",
        "'speaker_3': 'Parents, grandfather, grandmother, they're being dropped off to protect the monks.'",
        "'speaker_15': 'Thank you very much. Thank you.'",
        "'speaker_7': 'Honorable Mayor and City Council. My name is Fred Sutton. I'm here on behalf of the California Apartment Association. As was mentioned, there are many cities that are looking at implementing implementing the AB 1482 early. The big difference between those cities in this city is they had not spent the last year working on its own local ordinance, which'",
        "'speaker_7': 'went into effect on August 1st. Those include on non renewals, financial payment, everything's filed with the city, so the city should be able to tell us.'",
        "'speaker_1': 'How widespread.'",
        "'speaker_7': 'This is and they can no longer be served. Undoing part of the ordinance doesn't really make sense. I think this is a perfect opportunity to rescind the entire ordinance effective January 1st, 2020 and comply with AB 1482. That should be the priority going forward.'",
        "'speaker_7': 'Is how does the local relocation fit with a B 1482? And I think that should be prioritized for January 1st.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Honorable Mayor and councilmembers. My name is Doctor Sully Saro. I'm a resident of the sixth district. I know Long Beach can do better and it can be better, and we need to protect all tenants. And so I urge you to pass this or a moratorium tonight.'",
        "'speaker_3': 'No carve out, and that it should include all tenants in all units, and that many cities, including L.A., are already doing it. And the city of Karachi is doing it tonight. And so because Long Beach cares about all its residents, I believe we must and should pass this so that that we prevent homelessness and that we can'",
        "'speaker_3': 'keep our families home for the holidays. Thank you so much.'",
        "'speaker_0': 'Thank you very much. Let's look at this one.'",
        "'speaker_14': 'And not just me. Nobody's Maria Luisa. We want to say even more representatives. This time I see the residents the longest relative, S.A. Ibrahim Yasmin with three step and sadness as familias stand up onto the set of this alucarda as much as they are not sufficiently cautious but are entitled appropriate that I'm just a little rent Dallas'",
        "'speaker_14': 'into the mass image of the nosotros not the name was instead the narrow papa gato the locus necesita. It's a lesson for commuters versus a stuffy window into Nakai the embarcadero point. That was then los gatos. It's not just a, you know, policy that might even be as easy as you say, Tony.'",
        "'speaker_14': 'That is also that as follows. When I said this Alcaraz de la Soto's Ojo, this was when I set up the casino session in Guam to read that this podcast will sit on. But I'm going to shut your.'",
        "'speaker_3': 'Good evening. My name is Maria Luisa and I come here representing Best Start. I live in District six and I've been a resident of Long Beach for the last 20 years. I'm here because I'm worried and sad, thinking about the families that are going to be evicted, that don't have the necessary resources to rent a decent property'",
        "'speaker_3': '. And since the owners abuse and ask for much more than people are able to pay, it's a problem. That's the reason that many families end up in the streets, living in the streets, and the cars are underneath a bridge.'",
        "'speaker_3': 'I'm also here tonight fighting for Miss Maribel Mireles and 16 units, eight of which have been evicted and eight that will be. And I'm asking that as soon as these units are fixed, which was the reason they were told that they're able to go back.'",
        "'speaker_14': 'But then there's a renter who's.'",
        "'speaker_3': 'Paying a fair.'",
        "'speaker_14': 'Bit of property protection that others are keen to support and stuff such as Lazaridis and Okada.'",
        "'speaker_3': 'And I ask you to please protect all of these people that will be homeless during these dates. Thank you. Thank you.'",
        "'speaker_0': 'Before before Daniel comes up and like, let's call the next set of speakers. Please come forward in this order. I have a Jordan Dora two know. So Cynthia macias shamble. Yes. As Zo Nicholson believe it's Lilya Ocampo and Maria Lopez.'",
        "'speaker_0': 'So in that order, if you can please let it be Jordan. Dora to no. So Cynthia Macias Shamble. Yes. As AZO Nicholson, Lilly Ocampo and Maria Lopez.'",
        "'speaker_5': 'Good evening. My name is Daniel Lampkin and I'm a member of Council District Two. I come here not just as a community member, but as someone who manages an affordable housing community in Long Beach, California. I am the manager of Covenant Manor, which is on Fourth and Atlantic.'",
        "'speaker_5': 'And as a result of my work, I'm a witness to the devastation of the homelessness crisis on a daily basis. Daily, I mean, hourly. I field calls on a constant basis from people looking for housing who are currently homeless or about to become homeless as a result of the 60 day eviction notices that have been given out'",
        "'speaker_5': '. My work has become more constant. I deal with seniors, people who are in walkers, people who are in the most dire of situations. I would urge this council to vote unanimously for this moratorium. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hello. Council and mayor. My name is Jordan Doering. I'm a member of the Democratic Socialists of America, Long Beach. I'm here today. Not even to urge you to pass this emergency emergency moratorium because it's obvious just how strong it's going to be.'",
        "'speaker_5': 'I've got to ask, are you going to do what's happened in the past and put carve outs in it to have some families be homeless for the holidays? Or is it going to cover all tenants? Because for the past several years we've all seen it.'",
        "'speaker_5': 'A lot has been given away to luxury developers in the city, and it's finally time for something to be given to the tenants. For years, for example, the Affordable Housing Fund has languished without any type of funding or any money to supply that.'",
        "'speaker_5': 'The least we can do is make sure that tenants are not kicked out so landlords can continue to redevelop and get tax breaks to build new luxury buildings over the holidays. Thank you very much.'",
        "'speaker_0': 'Speaker, please.'",
        "'speaker_9': 'Hi. My name is Zoe Nicholson. I live in the second district. You know, I've stood in front of you for years now asking you for federal amendments, for U.N. accords and for protecting workers rights. Today, I came to give you something.'",
        "'speaker_9': 'I want to give you peace of mind. I want to give you a heart lit up. I want to give you a good night's sleep. You're going to do the right thing. I'm really proud of that. And I wish you all happy holidays for making sure that other people's holidays are with their family.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_15': 'Because next week the first.'",
        "'speaker_12': 'Good evening. My name is Cynthia macias and I live in the second district. I'm a mother, daughter and organizer.'",
        "'speaker_9': 'But most importantly, I'm your constituent. I have been evicted during the holidays, Christmas, to be exact, and it didn't affect me the most. It affected my children the most. And when I speak about my children, I mean it affected them.'",
        "'speaker_9': 'In school. Their grades started dropping. They couldn't focus in school. They even began to get bullied in school because kids will be kids. And being homeless is frowned upon, right? Excuse me. With this in mind. I'm sorry I had to cut it down and half for you guys.'",
        "'speaker_9': 'So, yeah, let me see. As a mother, this broke my heart. But analyzing this as a brown mother, I realized that intersection of oppression and housing poverty is a symptom of poor policymaking. With this in mind, we need to push forth long term policies that give the community abilities to stay in place.'",
        "'speaker_9': 'The right to return. And a path to a community owned housing. We need an eviction moratorium now and continue the conversations on long term housing solutions that benefit those most marginalized. Thank you.'",
        "'speaker_15': 'Thank you very much. Thanks to the police. Hi.'",
        "'speaker_12': 'My name is Chembur Users and I am 12 years old today and instead of celebrating with my family. I'm here to tell you about how I felt my family was getting evicted during Christmas in 2017, when everyone was getting Christmas lights and decorations out of boxes.'",
        "'speaker_12': 'We were packing our clothes and toys in the boxes. I didn't know where we were going to sleep or eat. What? I lose my friends at school. As a good student, I am very focused and prepared. But knowing I was going to lose my home, friends in school and friends school, I couldn't sleep.'",
        "'speaker_12': 'And that made it hard to focus in class. I don't know anymore. I don't think anyone should be homeless, especially not for holidays, when is supposed to be fun and warm outside and clothed. So please don't evict families during Christmas.'",
        "'speaker_14': 'Thank you very much. We're not. No. Shows me. No worries, Dorothy. No. Go. Your botanicals return whenever they return.'",
        "'speaker_3': 'My name is George Tinoco. I belong to the ninth District with Rex Richardson.'",
        "'speaker_14': 'Ian is an old chap with Megan Blessing and Kathy also status tantamount to multiple are crucial, but don't get them been so we must get home now responsibility that Roger Garcia as in we took over here last time I was killed we put on a competitor.'",
        "'speaker_14': 'The Latino selection is to monitor their birth in a city and more commonly the Latin that I'm with different delta.'",
        "'speaker_3': 'And tonight I'm very happy that you've all taken the time to listen to us. But we all know that it's your responsibility. Robert Garcia It's been a long time. So my writing you the last time I saw you was at a conference for Latinos, an action, you know, that the way we were was very different than right'",
        "'speaker_3': 'now I'm a mother so.'",
        "'speaker_14': 'Madre that those communist system great one though thought I mean now my steria in social work getting me home business man in negocios Pedro me preoccupations can you tambien and a step is kiddo care you'll see an independent this the was very lamentably meant the aes de la Renta say you know but in my narrator.'",
        "'speaker_3': 'And I'm the mother of two young people who are about to graduate my daughter with her master's in social work, my son in business and as a mother, I worry. I want them to be independent, but they are unable to pay the rents at the cost that they are.'",
        "'speaker_14': 'See is as soon as he doesn't get affect that much of communism, the U.S. get on with risk of money that affect them as a partner. Kelly They are honest us is. Dorothy you must get. I told you at the end in thin air give me a big smile is having to give what instead of the central'",
        "'speaker_14': 'housing one get a memento. Nothing at all on the EU.'",
        "'speaker_3': 'And it's a situation that affects a lot of young people, a lot of children, and even more in our community. We have to fight against this racism. But it's a fear that we have that's even more about being evicted.'",
        "'speaker_14': 'What is honest and what are your let's be honest instead. Istomin is the partner doppelganger son on sun on group. Okay Necesitamos de la polio they and lament that they will not they will not a Latino they want to purchase American standpoint cumbia.'",
        "'speaker_14': 'If the Sistema get that don't give it out on so necesitamos competition carry that you know says Mother La caught up on anything and.'",
        "'speaker_3': 'We're asking that you come together as a group. We need the support of everybody, not one because they're Latino and others because they're American. We need this broken system to change. We need your compassion. Thank you. Thank you.'",
        "'speaker_0': 'And for having your local streets. The next group will be Gary Hightower better lopez Solana Singer in Savaii Mahi. I'm sorry if I if I'm not trying to do my best with the writing Carmen Mejia and Myron Wallen.'",
        "'speaker_0': 'So the next group after Maria Lopez will be Gary Heidrich. Norberto Lopez. Solana Cintron. Survi. Mejia. Carmen Mejia. Myron Wolin. And Maria Lopez is next.'",
        "'speaker_3': 'My name is Maria. And in a time when everyone's living in fear, I say I'm undocumented, unafraid and unapologetic. I migrated to Long Beach at the age of three, and now I'm the director of Community Organizing for Housing Long Beach, and I organize with the Long Beach Tenants Union.'",
        "'speaker_3': 'Today we are here in support of an eviction moratorium. If you're here, support set up. I want to see your sign. We want an eviction moratorium for all tenants, all units and all buildings, because our community deserves to stay intact during the holidays, during each and every day in the city of Long Beach.'",
        "'speaker_3': 'So I want to finish off with a chant in Spanish, but it's pretty much says Housing is a human right. Then they're doing that.'",
        "'speaker_2': 'Your food, then that's.'",
        "'speaker_3': 'Their narrow dacha. Their. That narrowed that you could get past an eviction moratorium today for all tenants, for all units, for all buildings.'",
        "'speaker_0': 'Thank you. I think I had Gary Hart next. It's okay. No, no. All right. You can tell you're going to.'",
        "'speaker_5': 'So I'm just going to cede my time to a tenant meeting.'",
        "'speaker_14': 'One of the. To me, number ten. Later. Garcia.'",
        "'speaker_3': 'Good evening. My name is Myra Garcia.'",
        "'speaker_14': 'So the residential district of Marisol in they only on this you say this capacity that is a problem other women really that.'",
        "'speaker_3': 'I'm a mother I'm a resident of district two. I'm a mother of a child with 16 different disabilities and mobility problems in Elmira.'",
        "'speaker_14': 'And Robert Garcia of Coachella, Mexico.'",
        "'speaker_3': 'Not only Robert Garcia, the mayor, has heard about my case and knows my son.'",
        "'speaker_14': 'Though, that you that me yourself the other way he seemed to me to tell him.'",
        "'speaker_3': 'He agreed to help me on December 1st. I'm being evicted.'",
        "'speaker_14': 'And because I follow the rottenness.'",
        "'speaker_3': 'Around my house, there were eight rats one.'",
        "'speaker_14': 'Day. The name of the future will be in the Tell Me More longer. We've been living.'",
        "'speaker_3': 'In the same place for 18.'",
        "'speaker_14': 'Years and the sun screaming under the weather if you're trying yours. And he gave you that reportorial problem.'",
        "'speaker_3': 'And there discriminate against me. After 18 years, I called the city to report the problem.'",
        "'speaker_14': 'In in front of the lepers. Nonetheless you that alphabetically certainly we had Matthew Departamento going to give us another look lady kidder.'",
        "'speaker_3': 'And in front of the city supervisor, he said that he was never going to fix the apartment and he would never do what he was being told to do.'",
        "'speaker_14': 'And he say, I'm out with VAC. You're not dealing with that. So American.'",
        "'speaker_3': 'Citizen, I'm not an American citizen.'",
        "'speaker_14': 'And you know that I still get those who stay there.'",
        "'speaker_3': 'They have the same rights as all of you and me.'",
        "'speaker_14': 'We didn't have the police.'",
        "'speaker_3': 'It's very difficult living.'",
        "'speaker_14': 'In this kind of system.'",
        "'speaker_3': 'Discrimination when everyone is discriminated against us.'",
        "'speaker_14': 'No, no. You're quite okay. Potentially.'",
        "'speaker_3': 'I would like you to support the.'",
        "'speaker_14': 'Local or.'",
        "'speaker_3': 'The eviction law.'",
        "'speaker_14': 'But Necesitamos we will conclude that we.'",
        "'speaker_3': 'Need quality of life.'",
        "'speaker_14': 'You will walk in May you the El Primero. They seem to think of me this.'",
        "'speaker_3': 'And I'm asking again for your help on December 1st. I'm being a.'",
        "'speaker_14': 'Victim. You're putting me at the end of this because I'm a single.'",
        "'speaker_3': 'Mother and I will repeat, my son has 16 different disabilities. You met him.'",
        "'speaker_14': 'You don't know me.'",
        "'speaker_3': 'And I'm giving my my time to the next person.'",
        "'speaker_1': 'Thank you, driver. Dr. Hutchinson. Good evening. Mayor Garcia, council members. My name is Gary Hetrick. I'm a resident of the fourth district. I'm also here tonight as president of the California Faculty Association and Long Beach chapter. We represent faculty members, coaches, counselors and librarians.'",
        "'speaker_1': 'And many and many of those folks are rent burdened and vulnerable, just like you've heard tonight. The stories we heard tonight are a little bit hard to follow. Excuse me. They're hard to follow. I have I don't I have no history of stories like that.'",
        "'speaker_1': 'But I want CFA to go on record as supporting the moratorium without any carve outs. I also want everyone here to know that that CFA is a union is not the only one that's supporting this moratorium without carve outs.'",
        "'speaker_1': 'Unite here Local 11 is also a supporter. You have CWA three, 24 is Teamsters 396 and I am District 947 are all supporters of this moratorium without any carve outs. I just want to end by saying there's no good time to push out a good tenant and this time is certainly not the best time.'",
        "'speaker_1': 'Thank you for your time. Thank you. Speaker, please.'",
        "'speaker_14': 'When I notice you know me here.'",
        "'speaker_3': 'Good evening. My name is Carmen Mejia.'",
        "'speaker_14': 'Our having a large sovereign mi sovereign castle and.'",
        "'speaker_3': 'Coming to speak about my case.'",
        "'speaker_14': 'Thing going on in.'",
        "'speaker_3': 'You. I have five children.'",
        "'speaker_14': 'Tengo, cuatro disability.'",
        "'speaker_3': 'Four are disabled going out this month. They have autism.'",
        "'speaker_14': 'Comparable to my most.'",
        "'speaker_3': 'Emotional problems.'",
        "'speaker_14': 'Being only Nancy. Either way.'",
        "'speaker_3': 'That I have a child in a wheelchair.'",
        "'speaker_14': 'In my car, they have light up in us as a quarter of the year.'",
        "'speaker_3': 'With a manager just called me four days ago.'",
        "'speaker_14': 'Miranda that my father this but think.'",
        "'speaker_3': 'I'm only allowed until December 30th.'",
        "'speaker_14': 'Araceli me to get.'",
        "'speaker_3': 'Out I.'",
        "'speaker_14': 'Involuntary sale of problema ninos he doesn't care my name That is how Maria Pasado.'",
        "'speaker_3': 'Nuevo. He doesn't care where I end up spending new year. Kamali Borja said what I'm going to do.'",
        "'speaker_14': 'The whole point. This hero, he.'",
        "'speaker_3': 'Said, I can go underneath the bridge.'",
        "'speaker_14': 'In Neul then.'",
        "'speaker_3': 'It's my problem, not his.'",
        "'speaker_14': 'Joke. Girls have enemies. The rituals Lord show and you'll baby. And why you?'",
        "'speaker_3': 'I'd like to know my rights. I've been living there for eight years.'",
        "'speaker_14': 'In my pocket. Get him in the apartment.'",
        "'speaker_3': 'And just because they want to sell the apartments.'",
        "'speaker_14': 'It was not the same as a hotel.'",
        "'speaker_3': 'It doesn't seem fair to me.'",
        "'speaker_14': 'I may not miss Ninos. Can I look at the end in the Rachel at least.'",
        "'speaker_3': 'I think my children so.'",
        "'speaker_14': 'Resident then that I must battle I mean innocence without and I'm.'",
        "'speaker_3': 'Just a resident.'",
        "'speaker_14': 'I see those happy.'",
        "'speaker_3': 'But my children are citizens.'",
        "'speaker_14': 'Problems.'",
        "'speaker_3': 'They have problems.'",
        "'speaker_14': 'Out dismal artist opposite are.'",
        "'speaker_3': 'For disabilities bad you'll.'",
        "'speaker_14': 'Not receive all takes your march on me now that I.'",
        "'speaker_3': 'Don't realize I mean anything Oh.'",
        "'speaker_14': 'Mitra the whole trabaho them possum No, I'm guaranteeing one. Are you there?'",
        "'speaker_3': 'I pay my rent to.'",
        "'speaker_14': 'You mean in your case on say what?'",
        "'speaker_3': 'Associate my husband's work. I don't get any kind of help other than for my kids which is Social Security ghetto.'",
        "'speaker_14': 'Get them in. Yes, I'm going to. Sorry, todo. No, put all up on me Nina. For last hint. This could be any last Navidad itself real ly dubious It's amazing who stock leading. I know those Mrs. Aquino meeting absolute.'",
        "'speaker_14': 'I'm in denial No problem other laboratories. But you'll see at the end in Gaza. I don't believe in the angels. No thought that I'm not anymore, Grasshopper. We might not get that in moderate or poor people.'",
        "'speaker_10': 'I'm glad to see a crisis.'",
        "'speaker_3': 'And I'd like you to keep in mind all of this, not just for my children, but for people. Christmas is coming. The cold, the rain. I think it's unfair just to get two months when people aren't looking at the lives of people just because they're poor.'",
        "'speaker_3': 'They have a house, the owners do. But I believe that we have rights because we pay rent.'",
        "'speaker_0': 'Thank you so much. Yeah.'",
        "'speaker_3': 'Yeah. This, I think. And that's why we must support the cause of this crisis.'",
        "'speaker_1': 'Just people.'",
        "'speaker_14': 'When does a motorcycle stand at present?'",
        "'speaker_3': 'Good evening to everybody that's here.'",
        "'speaker_14': 'Present Estonia key for Cabangon when he said Portavoz the mujer familias.'",
        "'speaker_0': 'And you're listening to me, he.'",
        "'speaker_14': 'Said on Saturday.'",
        "'speaker_3': 'And then this here tonight to speak my voice and to be the representative of other families. A bingo.'",
        "'speaker_14': 'To me in a contactless problema category as Alabamian as me, Massena Amiga.'",
        "'speaker_3': 'I'd like to tell you also. But the problem I have with eviction, she's my neighbor and my friend.'",
        "'speaker_14': 'Nice. Comforting me problem. A common problem. Acadiana.'",
        "'speaker_3': 'Yeah, my problem isn't as bad as her problem.'",
        "'speaker_14': 'Better met domain temple the venerable our ESL portable the tantas familias damn facilitate the government because having the latter legend adolescence anatomy CEOs but or no keys, they need police. They won't know whether as a la diferencia but Atlanta's familiar Afghanistan estate by the sea and that the policy question and tone, says Jones.'",
        "'speaker_3': 'I took the time to come here to speak as the representatives of all these families. It would have been so easy to stay at home watching TV, giving my children dinner. But I wanted to come here because if one person can make the difference, speaking for all of these families that are going through the same thing.'",
        "'speaker_14': 'It present is going to let them go. Updated Colonel Corazon de La mancha brought forward to Mama's concerns here because I don't know the status she has got. The name of embodiment of CSK tenemos Constancio de Jager done with left calf at this concert Adore Me e there they sit tranquilly maintain no personal personal claro to Pasando'",
        "'speaker_14': 'el Pakistan must be our returned of castles left persona stand indifferent the seat left the honestly feces left eco lap and boy the most conscientious of today.'",
        "'speaker_3': 'And before anything I'm coming to ask you with my heart in my hand that you be aware. If we feel bad about the way things are, we can go home and rest and sleep and act as if nothing's happening.'",
        "'speaker_3': 'But something is happening. We're seeing so many cases of things that are happening and I'm asking you to be aware.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_14': 'That is necessary.'",
        "'speaker_12': 'Thank you. Tulip. So my name is Susanna Kim. I'm the executive director of the United.'",
        "'speaker_3': 'Cambodian Community, and I'm a resident of the fourth District.'",
        "'speaker_12': '75% of Cambodian residents are renters, and Cambodian families are being displaced due to deportation and also evictions. Already, a few of our commune members have come up to us about an eviction notice that they received within this month.'",
        "'speaker_12': 'In addition, as members of the Everyone Home Language Task Force, there are members that sign a letter of support. And in light of these unjust notices and evictions, we urge the City Council to pass an urgency ordinance to enact a moratorium on notices and evictions, to keep Long Beach families and their homes for the holidays and those'",
        "'speaker_12': 'that undersigned. This letter from the Everyone Home Task Force members are Andy Kerr from the Measure H Citizens Oversight Board, the MSA, Los Angeles, Palm Beach, Foreign Ministers Alliance Center, Child Jewish Family Children's Services, Women's Shelter of Long Beach, Lomita, Community College and Children Today.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Let's be complete.'",
        "'speaker_1': 'Hello, I'm Myron Wolin. I'm president of the Long Beach Gray Panthers. I'm here speaking in support of the ordinance. I would like that to be no fault evictions and that it becomes particularly cruel for the senior community. We're a senior advocacy group.'",
        "'speaker_1': 'We see seniors all the time. I run into them. I hear the bells that that they are evicted, that they are have rent increases. They are on a fixed income. They can't stand they can't take a rent increase because their income is fixed.'",
        "'speaker_1': 'I would urge you also to think about having a rent stabilization after you do this right thing. Hopefully you will do it. I hope that you will join other cities that retreat just in mentioned that have passed ordinances that we we should pass that make me proud of living in Long Beach make me proud that we make'",
        "'speaker_1': 'you proud of being involved in a movement that cares for people, cares for unjust evictions, and that will pass such an ordinance. Thank you very much.'",
        "'speaker_0': 'I'm going to call the next set of speakers. Everything picked up in this order are. Nestor Escobar. Mario Medius Resolver. Ramos. Natalia Biran. Maritza a witness, Jennifer Milan and Yolanda Hobson. I'm sorry if I mispronounced it. Miss Escobar.'",
        "'speaker_0': 'Maribel Reyes. Presumably. Ramos. Natalia. Viviane. Russo voters, Jennifer McClung and Yolanda Hobson. In that order, please. And for an article, please come forward.'",
        "'speaker_10': 'Good evening, everyone. My name is Ernest Isaac and I reside in District nine. We are being evicted from a residence by December 17th, a week away, a week before Christmas. That is why I'm here today with my neighbors and my community to let you know that I don't.'",
        "'speaker_10': 'Training is extremely important and must pass. It is unfair and unjust to evict residents from their homes for the purpose of increasing brand before AB 1482 takes effect on January 1st. Item 20 must pass in order to protect tenants from evictions.'",
        "'speaker_10': 'Now and in the future. We have vulnerable citizens that need our help. Our councils help, but mostly be part of everyone. And just like our council member, Rex Richardson would want us to. Thank you.'",
        "'speaker_14': 'Thank you. It's good to please when I see when I'm not just me alone, but as Maribel Mireles, you're so part of the best staff and obviously the company that has got to catapult us to this. Your store, your keeper, is offering them the solution.'",
        "'speaker_14': 'Ease our little sticky note mission to solve the stuff. Keep me company that mithun S.A. means business if than me so organization is best are allow me to start Libra if the house in Long Beach Star Latino so NextGen is to ease jr Garcia has put up pianos.'",
        "'speaker_14': 'Yes no Ms.. Merkel is prosthetist Roberto Garcia tapioca por favor vote this off. Our National Medal of Integrity has another Richardson for Apple yet is the 16 is those he has a good opening you know the stairs I see though this hello huddle Roberto Dunga to Dennis Neto's I'll ask the taco I think about what do you'",
        "'speaker_14': 'do if does a quick massage like I said to Casado to me tranquilo nosotros? No, no, Satoru, start as not just a stump sandbag on the grass. Yes.'",
        "'speaker_3': 'Thank you. Good evening. My name is Maribel Mireles and I come from Best Start Long Beach from the leadership group. And I brought a letter for all of you here we are all suffering. We're suffering the evictions. And I'm not alone.'",
        "'speaker_3': 'I'm here with my community. I'm here with the elderly. I'm here with organizations. I'm here with Best Start, Leeward Housing, Long Beach, East Yards. Thank you, everyone, for supporting us. And Robert Garcia, I ask you to support us in this matter, number 20.'",
        "'speaker_3': 'And thank you, Mr. Richardson, for speaking up. I know that you mentioned you have two two daughters, I believe, and you're thinking of them. And also Robert Wood. And God, I know that you have grandchildren as well, and you are here and you're all going to be going home calmly and into your own homes and into your'",
        "'speaker_3': 'bed. And you don't have to think about being evicted, but we do. We have to think about that. And I urge for you to support us. Thank you. Thank you.'",
        "'speaker_0': 'So much. Next speaker, please.'",
        "'speaker_14': 'She's looking to speak what has not been resolved. So residential district and highway patrol resistencia the of Cynthia quatro you'll be one is terrific. Patricia is going to esposo Emiko and as Mrs. Movement we try to lose our on a moment someone we trust.'",
        "'speaker_14': 'But I'll come in person and this is very alarming. Supremos But in contrast to what I've been through in this business, Mrs. a commitment to Familia Alegria has been almost to the crisis in very bad so desperate distress that Theo one that is the it's been in the swap for you in this area and one of the'",
        "'speaker_14': 'by said let's call it they seem for me it's you that good I'm also an ambulatory other salud. There are no hospitals in communities but a third that is a proposal. City fees. You ought to know what a crisis that is.'",
        "'speaker_0': 'I'm sorry. In translation I forget that I don't speak Spanish.'",
        "'speaker_3': 'My name is Rosalba. I'm a resident of District nine and part of the Resistance for 64. I live in the bill. I've been living in the building for three years with my husband and now we have a seven month old child.'",
        "'speaker_3': 'We were living calmly and peacefully, but now we're in this moment of frustration because of the changes in the past. It happened to me. We suffered in. In our homes. And I. And I can call it a home because that's where we would spend our time.'",
        "'speaker_3': 'We need such great support for our family. And now, thinking about the months coming ahead and spending the time with our family in happiness, we are now actually in anxiety. And to have to go through this during the Christmas time, it's such stress and frustration.'",
        "'speaker_3': 'We hope that all of you are supporting us in this moratorium and that some of you spend the time with your families. If if some of you were to spend the time with your families without a home to think of this, please.'",
        "'speaker_3': 'Thank you. We want a moratorium for eviction for everyone, for all renters, for all units, for all buildings. Act now. It can be done.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_15': 'Next week, Officer.'",
        "'speaker_14': 'All? No, not just all colors. E conceal.'",
        "'speaker_12': 'You mean like sevilla's be one? C Fuentes isn't like water.'",
        "'speaker_14': 'So it isn't like water for the cell walls.'",
        "'speaker_12': 'E e knows that in Houston there was.'",
        "'speaker_14': 'That much conditioners. John, this is it. So are you them?'",
        "'speaker_12': 'Is almost anything against them. Guess them moratoria then they get faster.'",
        "'speaker_14': 'Than them but thought they had this logos. But at the albinos. But at the dollars you need others. But at almost any you get a moratorium. Then there's the law.'",
        "'speaker_12': 'E As you said before, the soil mothers solid data.'",
        "'speaker_14': 'Those ninos e get the performance that you then cannot.'",
        "'speaker_12': 'Single but on the it those but can use.'",
        "'speaker_14': 'Performance in those boiling are you then.'",
        "'speaker_3': 'Good evening mayor and council members. My name is Maritza Aviles. I live at 550, 64th and I'm part of the resistance for 64 because we are being evicted unfairly by West West Star I my conditions are we have cockroaches in our place and we need your help because a moratorium needs to be passed.'",
        "'speaker_3': 'We need to stop the evictions for everyone, for all renters, for all units, for all buildings. We want a moratorium for the evictions now. It can be done. And I'm a single mother with two children, and I need help because I don't know where I would go.'",
        "'speaker_11': 'I don't know where to go. Thank you.'",
        "'speaker_0': 'Thank you so much. Makes me happy.'",
        "'speaker_12': 'Hi. My name is Jennifer Meehan. I live with my family in District nine and I'm here to ask for your support.'",
        "'speaker_11': 'The eviction moratorium.'",
        "'speaker_3': 'Evictions are a major problem, and this is not the first time we've been evicted.'",
        "'speaker_12': 'We're facing eviction during this time of year where we're supposed to be celebrating the holidays in our home and are struggling and stressed to find a new place to live. We've had many great memories in our home and live and lived there for ten.'",
        "'speaker_14': 'Years and don't want to leave our home. Thank you. Thank you so much. This. Yolanda when I noticed that the cops on me were convinced both time you don't see us or you. So, yeah, keep it up for you, you know.'",
        "'speaker_14': 'So are you. Then can we still see who's. See anything in the new knew myself. I mean, you don't mean sequels? No, no. Look, I don't know. Three. Then again, that was canon. Soon you'll see you. I mean, I don't know.'",
        "'speaker_14': 'I think I'm also too cynical. Don't be sorry to know that all these boys can and must get no support in on what it is us is moving through this thing. But I want to put a thought that was good to us.'",
        "'speaker_10': 'This is.'",
        "'speaker_3': 'My name is Yolanda Hobson. I live with my husband and my two children. I am here tonight so that you can support us in fighting for our rights, in not evicting people. I want you to help us out so that they don't take people out of their homes because it's difficult to find an apartment.'",
        "'speaker_3': 'We were evicted before and it was a difficult time. It's really sad when somebody takes you out with your children because I've gone through this with my family and I know how it feels to be evicted. We want your support.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_0': 'Our next our next speakers are Celie Medina, Peter Portillo, Antonia Marva Castillo, and Devon Allred. In that order recently Medina, Peter Portillo, Antonia Marie Castillo and Devon Allard, if you could please line up. Is our soul here. Please come forward.'",
        "'speaker_14': 'When that's not just health care reconciliation, said Medina. So just hit enter the language. Even now, including necesitamos parental moratoria, the disallow familia ticket in contest rental as the todos Camus's corporate donors they cannot select on the fees gratis.'",
        "'speaker_3': 'Good evening, Mayor and council members. My name is Araceli Medina and I am a resident of Long Beach and am I am a good tenant. We need your support in the moratorium for the evictions because. So that families can stay together during the holidays.'",
        "'speaker_3': 'We all deserve this. And we would like this. Protect everyone. All the tenants, all the units and all the buildings. Now. Thank you.'",
        "'speaker_0': 'Peter.'",
        "'speaker_5': 'Good evening everyone. My name is Peter Portillo. As a resident of this city, I believe that all residents of the city of Long Beach should have the right to affordable housing and should not be thrown out during the holiday season for landlords to raise rent and profit from displacing families this coming year as a member of an'",
        "'speaker_5': 'underrepresented community, all while having the first elected Latino mayor of Long Beach, you should have firsthand knowledge that we deserve a right to affordable housing during the holidays and an opportunity to live without fear of being evicted. In order for landlords to profit from displacing hardworking citizens, I urge you to consider the moratorium for all to have'",
        "'speaker_5': 'a warm home during the holidays, not for not just for the privileged few at the top. Don't contribute to the homelessness problem that has already displaced many families within Los Angeles County. Please keep all tenants home. Pass this moratorium.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_15': 'Thank you. Antonio.'",
        "'speaker_14': 'When I notice. You're so street. Don't know whether I mean Antonio Zavala, the civilian at least get a sense that yes, you can find APARTAMENTO and DCM, but it also predominantly celebrities. You see other people call me call me as also call me seahorse in honor study episode B that Foreign Minister CASA.'",
        "'speaker_14': 'Gillies Boyle This year was a yellow sun. Unless people can monitor the Long Beach and then in Macau negative in the past and the moratoria meaning it. Those who want to them as that is. But as is.'",
        "'speaker_3': 'Good evening. My name is.'",
        "'speaker_14': 'Antonia Zavala.'",
        "'speaker_3': 'And I live with my husband and my children. And we received a 60 day notice that I have to leave my apartment on December 17th. What can I tell you? That what hasn't been said yet or already? I ask you to please give our community in Long Beach the best Christmas gift that you can give to pass'",
        "'speaker_3': 'this moratorium for number 20 and so that we can all enjoy our holidays. From District nine. Thank you. It is.'",
        "'speaker_0': 'Necessary, Maria, to steal money from a.'",
        "'speaker_12': 'Hi. My name is Molly Castillo. This is my mom. I'm a member of the First District, and I am part of the 1980 hybrid resistance. My family and I are currently going through an eviction for fighting against an unjust and illegal rent increase of 50%.'",
        "'speaker_12': 'My family and I have lived there for over ten years and we are now being displaced. We have, quote, just less money. And I move up to date is December 12th. Right before the holidays. Right before the holidays, we were given 45 days to move out.'",
        "'speaker_12': 'And this has taken a toll on all of us, especially on my mom, given the situation where we stand, having to stress about where we will live and everything happening right before the holidays. It is very emotional to think we will be homeless at a time that we're supposed to enjoy with our loved ones.'",
        "'speaker_12': 'My family and I could have benefited from this moratorium, but we're now being displaced. I urge to place a moratorium of all evictions for all tenants, for all units and all buildings so that they don't have to go through the same situation as my family is currently going through.'",
        "'speaker_12': 'We are language and we demand a moratorium now.'",
        "'speaker_15': 'And our last speaker.'",
        "'speaker_5': 'Hello, Honorable Mayor and City Council. Thank you for hearing this item tonight. Two things really quickly. Number one, I just want to thank everyone that was here to share their stories about this is a very important issue, not just here in Long Beach, but statewide.'",
        "'speaker_5': 'We are in the middle of a housing crisis that impacts lives daily here in Long Beach. And as a renter myself, as a representative of the majority of employees here in Long Beach, who the majority of them are renters as well that live within the city, I think it's an imperative for us to look at this situation'",
        "'speaker_5': 'and say the intent of the laws that were signed by the governor were to protect these renters and the gap in time had left them vulnerable. And we need to do our jobs to make sure that that does not take place and that everyone is protected, home for the holidays and well beyond that.'",
        "'speaker_5': 'So thank you for your time tonight. Thank you.'",
        "'speaker_0': 'Thank you. I know that the motion has been made and for the motion of the second, I'm going make a couple of just a couple brief comments and then we have a couple of councilmembers that are cued up as well.'",
        "'speaker_0': 'I just want to first I had to step over to Cal State, Long Beach for a remembrance ceremony. So I apologize for that. But I wanted to come back and just first say that I absolutely support, first of all, what's in front of us this evening.'",
        "'speaker_0': 'It's it's one it's the right thing to do, but it's also common sense. There is obviously an intent in the law that was created by the governor, and no one wants to see evictions happen that really go against what the statewide policy was really all about.'",
        "'speaker_0': 'The tenant the tenant relocation ordinance that was passed by the council was the right thing to do. The statewide approach, the statewide approach to tenant protections that the governor and the and the legislature did was also the right approach and the right thing to do.'",
        "'speaker_0': 'And and putting together this moratorium tonight is also the right thing to do. I will also just add, there are some concerns, and I think, and rightly so, from both tenant groups that I've spoken with and also apartment owner groups about how our our tenant protection ordinance that we passed marries the statewide policy that also just got'",
        "'speaker_0': 'adopted and how those two marry and how we move forward. I just want folks to know that that that's something that this council is going to address in the next week, in a couple of weeks ahead of us.'",
        "'speaker_0': 'So we understand that. And we want we don't want there to be the confusion that there is. And so we want to ensure that the statewide the statewide law that is quite broad, it moves forward in our community, but also that we understand where there might be differences and how we can also continue to address the protections'",
        "'speaker_0': 'that this body talked about, especially as it relates to some of the unfinished business around additional protections for seniors and people with disabilities. So those are things that are moving forward and will be in front of this body in the next few weeks.'",
        "'speaker_0': 'So I just want to thank you all for being out here and your advocacy. This is a very common sense and proposals, and I want to thank the council members that brought it forward. And so with that, Councilwoman Pryce.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So I support this item. And I will say that I think it's incredibly frustrating when we have this gap in time between state legislation and our local ordinances in terms of what happens during that period of time.'",
        "'speaker_3': 'And I think one of the things that really came out a lot during the comments was that I really do think we're going to need to do some sort of education on. Whether notice is valid and assisting people in understanding whether the notice is valid, because we're now talking about a very specific period of time, which I'll'",
        "'speaker_3': 'say. Before coming into the meeting tonight, I thought the item represented something else. I actually thought that because we're within 60 days of the implementation of the state law, that we would not it would we would not be able to implement anything locally because it would be invalidated anyway as a result of the state law.'",
        "'speaker_3': 'But I appreciate the clarification on that. But I do think and I don't know if this is something we want to think about as we move forward in talking about this item in the coming weeks, this issue, whether we can have some sort of an education program out there on whether or not notices are valid and how'",
        "'speaker_3': 'people can get that information quickly from a neutral source. I think that's really important. I do have a question for city staff on this. Do we have a database where we keep track of the number of people that have been evicted pursuant to our tenant relocation policy that went into effect on August 1st?'",
        "'speaker_3': 'I think that's when it went to effect, right? August 1st.'",
        "'speaker_5': 'Yes. So as I recall, the ordinance, we had asked for that data because that is not data that the city has collected in the past, I believe it was, which helped me. It was a quarterly or monthly that we asked for it and I and we'll have to see what data we have collected so far.'",
        "'speaker_4': 'What we what the tenant relocation ordinance requires is that landlords give notice to the city when a tenant relocation payment is made. But there may be several other termination of tenancies or evictions where tenant relocation payments were not required to be made.'",
        "'speaker_4': 'I don't know if if the city has yet started to collect the data for when tenant relocation payments have been made. If they have, there's probably not too many given the limited amount of time that's elapse between August 1st and now.'",
        "'speaker_3': 'Yeah. So from August 1st until now, I mean, we tried to do some outreach in our district to see if there had been any. And when I talked with Councilman Richardson about this on Friday, I shared with him that obviously nobody wants to see mass eviction notices going out to thwart the intent of the legislation.'",
        "'speaker_3': 'I mean, nobody up here. So obviously, we we don't want that to happen. The concern, however, is taking away the ability of the landlords on an individual basis to make decisions about tenancy in a particular property, as were some of the issues that I that I shared when this item came to us last time is taking away'",
        "'speaker_3': 'their ability to be able to remove someone short of one of the nine enumerated. Items that are listed in in the California the state code. But I wonder. And so we did some research and we also did some research with newspaper articles and such to see if there had been any mass evictions in the city of Long'",
        "'speaker_3': 'Beach. We were not able to find any mass evictions in our district or others that had been reported in the city. But I know that when eviction notices have been given, there is a requirement under our approved ordinance that 50% of the relocation be paid within ten days.'",
        "'speaker_3': 'Of the notice. So I'm assuming and I read an article today that says that notices were where relocation, 50% of the relocation was paid. Do we have any way of tracking that?'",
        "'speaker_1': 'We can certainly conduct some outreach at this time. We haven't had anybody come forward to talk to us about those evictions. We can certainly look.'",
        "'speaker_3': 'But what the relocation payments aren't they supposed to be lodged with? Isn't somebody supposed to notify the City Councilmember Price?'",
        "'speaker_4': 'I found this section in what you all passed in July. It's an annual report, so it could be the case that the city has no information on a single relocation payment and landlords would still be in compliance with their obligations under the Hilo ordinance.'",
        "'speaker_3': 'But under our Willow Ordinance, if notice has been given, a 60 day notice has been given, then pursuant to the ordinance, the landlord would have paid half of the relocation fee within ten days of notice.'",
        "'speaker_4': 'It's certainly possible that there are tenancies out there right now where half of a relocation payment has been made.'",
        "'speaker_3': 'And if a 60 day notice was given on September 11th or after, and we move forward with this item tonight and a relocation was paid. What happens then to that relocation payment? The 50%, does it get reimbursed to the landlord?'",
        "'speaker_4': 'It should be in. I think September 11th is not quite the right date. I think it would be September 13th.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'A saying, assuming that our office receives authority to move forward to bring back an ordinance tonight that would come back on November 12th, assuming that that is passed on November 12th. Any 60 day notices that had not yet matured, so to speak, would be rescinded more or less.'",
        "'speaker_4': 'And so I think if you go back 60 days from November 12th, you land on September 13th.'",
        "'speaker_3': 'Okay. So if from September 13th to November 12th, anyone has been given a 60 day notice and 50% of the re lo given to them, they would need to return that relocation money. If they're planning on not vacating the property.'",
        "'speaker_4': 'That's exactly.'",
        "'speaker_3': 'Right. So I'd like to offer a friendly what happens. Is there a provision? Well, if we're going to be issuing are moving forward on a moratorium, what I would like it to include is that if a tenant has been given relocation money within this September 13th through November 12th period of time, and they decide to stay in'",
        "'speaker_3': 'the residence and not vacate the premises, they must reimburse the landlord as pursuant to our current ordinance. If they fail to do so, then that could be that would be considered cause for a subsequent eviction. Is that a an amendment that's agreeable?'",
        "'speaker_6': 'Makes sense to me. Is that something we can do?'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_6': 'We can sign the ordinance that way.'",
        "'speaker_0': 'And I want to make sure I keep going along on the from the councilman in person. Things have accepted that. Can we move on to the backup? Sure. Thank you. Consumer.'",
        "'speaker_9': 'We're still not used to these minutes on here. I had a great speech written, but I think that the tenants and the people that they came today really just spoke to the issue. I do want not just to harp on it, but I think it's important.'",
        "'speaker_9': 'We had one person speak against this item tonight and the comment was about the urgency. And as the only renter on this council that moved while being on council, it costs me $7,000 to get into my little apartment in the lovely second District.'",
        "'speaker_9': 'I understand the vulnerabilities of being a tenant. A single mom in the second District is probably the hardest part about serving as your council member. But the city has continued to grapple with the challenges of being a renter.'",
        "'speaker_9': 'We did in 2010 with the downtown plan. 2016, we saw rents go up. 2017, rents went up almost 11%. 2018 went up again. And we've consistently, as a council, tried to continue to talk about the issues. We've got great reports.'",
        "'speaker_9': 'We've got policies coming. We did tenant reload, which I thought was great, but that night was a hard night for me to go to sleep because I didn't feel like we did enough to protect renters at that time.'",
        "'speaker_9': 'And sure enough, what happened was my my phone was flooded. My emails were flooded with people whose rents went up or they had eviction notices. And so I'm very pleased to hear that the majority of people on this council support this.'",
        "'speaker_9': 'It's the right thing to do. I hope that we can take the moment as a council, as a community, to kind of learn how we make policy and recognize that sometimes we let politics. Myself, including all of us, dictate how we are going to vote and how far we're going to go on an item.'",
        "'speaker_9': 'But we continually come back to this council, Dias to try to fix when we don't go far enough when we should. And so I want to applaud all of you guys for coming out today, applaud my council colleagues and Councilmember Richardson for for doing what was right an agenda using this so quickly.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_10': 'Thank you. And I think this has been a very productive discussion this evening. For me, it's a no brainer. There's no conflict or equivocation whatsoever when it comes to my vote this evening. I will be voting in support of the item in front of us.'",
        "'speaker_10': 'Yeah. You know, a lot has been said about personal situations and, you know, you don't rent or you don't understand, you know, the the the where, where, where another person is. I am in constant contact with my constituents and I have a very, very diverse district, have people that are certainly suffering with financial issues with this housing'",
        "'speaker_10': 'crisis. I have family members who are dealing with these issues. And so I'm very, very empathetic and sympathetic to the to the challenges here. This is a what a weak impact. And so to me, you know, this is a holiday season.'",
        "'speaker_10': 'This is the best gift that the city council can give our residents is housing security. And so I'm happy to support this. I will like to say that that this new legislation, AB 1482, is something that we all should seek to understand better.'",
        "'speaker_10': 'And so I would hope that in the coming weeks that we can come together and continue to have this conversation and possibly even have a study session around the the impacts of this legislation so that we as a council have a greater understanding of it, but also the public as well as landlords as well.'",
        "'speaker_10': 'I think we have a responsibility to educate the public about the new law that that will be enacted in January. And so I'm hopeful that we can have that conversation in the coming weeks as well. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Vice Mayor Andrews.'",
        "'speaker_8': 'Yes. First of all, I'd like to thank everyone for coming out tonight. I think what this really shows individuals and the people in the city of Long Beach. When you get tired of being tired, then you're going to stand up and let people know how you feel about the way this city is ran.'",
        "'speaker_8': 'And we have to give a lot of credit to the individuals who are behind it. But you have to understand, you're in a place that you like and this is a place that you love. You were raised here, and by being in all of a sudden, you get that notice of, I have to leave.'",
        "'speaker_8': 'That's very frightening to everyone. And she's not the only one. I'm a renter. I sleep at night because like I said, when I know that things are wrong, I'm going to speak up on it. And I think you individuals out there have made it very clear tonight as to understand that we have a problem here and we'",
        "'speaker_8': 'must solve that problem of the homelessness and renters, because the fact that that's where you live, it's not just about Thanksgiving or Christmas. It's about every day that you live. I don't want to be out after Christmas, so I'm totally going to support this and I hope we'll all be able to get this thing kicking gear and'",
        "'speaker_8': 'taking care soon. And I want to thank the young men for standing up for not only for Latinos, our Cambodians, African-Americans, but everyone who live in the city of Long Beach. And thank you again. Yes, thank you.'",
        "'speaker_0': 'Just got some more super now.'",
        "'speaker_7': 'Thank you. It's been mentioned by Al Austin and Suzy Price, but anyone who contacted my office in the last couple of days knows that the primary concern for me is the educational piece where you don't have that, you have disinformation.'",
        "'speaker_7': 'And I know the Saddam came quickly. So that was kind of a natural byproduct. But I think that everyone, all parties here, all stakeholders have to be educated on any type of legislation, either from the state or our local ordinances.'",
        "'speaker_7': 'So I hope we take that to heart, and I hope we can make very strong efforts in that area. And with that, I'll be supporting the item.'",
        "'speaker_0': 'Thank you. Councilman Pearce.'",
        "'speaker_9': 'Yes. Just real quick, I wanted to just ask I know that there are some properties that have changed hands. City Attorney, If you could just meet with any new landlords have just purchased property in the next week if they reach out to you before coming back.'",
        "'speaker_9': 'So with.'",
        "'speaker_4': 'Before coming back. I mean, you know, I've been I've been taking phone calls from constituents and advocacy groups on both sides of this issue. So I'll continue to do that.'",
        "'speaker_9': 'I just want to make sure appreciate that.'",
        "'speaker_1': 'You're.'",
        "'speaker_0': 'Not from Richardson.'",
        "'speaker_6': 'Thanks. I just want to just recap. First of all, thank you to the entire city council and everybody who spoke up. I want to recap what I picked up right now. So the two councilmembers mentioned that when the new state law goes into effect, they like to see the city have some local education land and as well'",
        "'speaker_6': 'as a potential study session. I support that. I think we should make sure that we do that. To me, that means informational on these TV or regular channels, so we make sure that we're proactively adding that education. There was a friendly amendment from Councilman Price.'",
        "'speaker_6': 'Did you capture what it was?'",
        "'speaker_4': 'I think I did. I want to make sure that the motion secondary council member Urunga is good with it. With that. Okay.'",
        "'speaker_6': 'Great. And can you recap what that was?'",
        "'speaker_4': 'So the ordinance that comes back and by the way, for a little bit of context for the public and behind the dais. My my plan is to bring back an ordinance that substantively looks very similar to the city of Los Angeles ordinance.'",
        "'speaker_4': 'That's what you're likely to see on November 12th with that as a baseline. The addition will be that any tenant who has already received half of a relocation payment under our ordinance and who stays in the unit because the termination is rescinded due to what I think will occur on November 12th.'",
        "'speaker_4': 'If they fail to repay that below, then that will constitute a just cause for eviction and the moratorium or the prohibition on evictions. They will pass on November 12th, I assume would not apply to that tenant.'",
        "'speaker_6': 'It makes sense to me would also say if in general someone, let's say someone already, you know, they receive that notice, they're willing to leave. Right. They've already found new place.'",
        "'speaker_4': 'They can leave if they want the.'",
        "'speaker_6': 'Full. You don't have to give their reload payment back if they're leaving.'",
        "'speaker_4': 'Absolutely right.'",
        "'speaker_6': 'That's right. They'll move forward. So I want to make sure a landlord, lord, and a tenant understands they do still have that option. Okay, we're.'",
        "'speaker_4': 'Clear. Thank you.'",
        "'speaker_0': 'Thank you. Well, thank you very much. Please cast your votes, members.'",
        "'speaker_11': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to amend Contract No. 34946, with Axon Enterprises, Inc., of Scottsdale, AZ, for the purchase of body worn camera equipment, accessories, software, support and digital video storage, to increase the annual amount by $772,728, with a 10 percent contingency in the amount of $77,273, for a total amount not to exceed $850,001, and extend the term for an additional one year, with the option to renew for four additional one-year periods, at the discretion of the City Manager; and   Authorize a one-time purchase of body worn camera equipment and accessories in the amount of $605,694, with a 10 percent contingency of $60,569, for a total not to exceed amount of $666,264.  (Citywide)": [
        "'speaker_0': 'Great motion carries. Thank you very much. We're going to go to item item 15, please.'",
        "'speaker_11': 'Report from police recommendation to authorize city manager to execute all documents necessary to amend contract with Axon Enterprises Inc for the purchase of body worn camera equipment, accessories, software support and digital video storage for a total amount not to exceed 850,001 and authorize a one time purchase of body worn camera equipment and accessories for a total not'",
        "'speaker_11': 'to exceed the amount of 606,260.'",
        "'speaker_0': 'Is restricted to you. Here is Barbara show gear. Now, is not it? Do you want to speak on this?'",
        "'speaker_2': 'You're going to go. And those.'",
        "'speaker_3': 'So I'm in support of this. I think that body cameras are.'",
        "'speaker_8': 'Could we please have it quiet? Why are you leaving? Thank you.'",
        "'speaker_3': 'Body cameras are one way to hold police officers accountable for their action. As we know, police departments all over the country demonstrate systematic mistreatment, sometimes fatal, fatal of people of courage, color. Long Beach has not been exempt from this problem.'",
        "'speaker_3': 'In fact, we're a major contributor to this problem. Cameras are necessary, but not sufficient. Much more is needed to hold police accountable. And I did the 90 seconds because I thought.'",
        "'speaker_8': 'Thank you. Thank you, Count Councilwoman Pierce.'",
        "'speaker_9': 'Yes, I have, of course, support this item. I know that we've talked a lot about it over the last several years. And so I look forward to hearing. I'm assuming there's a brief staff report.'",
        "'speaker_8': 'All right.'",
        "'speaker_9': 'Thank you. So noisy. It's so distracting. We should really pause while people leave.'",
        "'speaker_5': 'We can give a very brief staff report. Yes.'",
        "'speaker_9': 'You.'",
        "'speaker_0': 'You do? Oh, here I go.'",
        "'speaker_8': 'Yes. Thank you, sir. Chief, go ahead.'",
        "'speaker_7': 'Vice Mayor, members of the city council. So tonight, before you. We have our request for more body worn cameras. As you've heard over the last several years. And many of you have asked us to deploy body worn cameras.'",
        "'speaker_7': 'And we've gone through several trials, one that didn't really work out for us. But the current one that we have as far as we can see is working out well for us. Currently, we have 250 body worn cameras deployed between two patrol divisions north and south.'",
        "'speaker_7': 'The proposal in front of you today would increase that to 675 body worn cameras, which would cover about 80% of our sworn personnel. So with that, I know that's short, but I'll leave it to any questions.'",
        "'speaker_5': 'That you may have.'",
        "'speaker_8': 'Thank you. Congressman Uranium.'",
        "'speaker_10': 'Angry and Taguchi for following through with this.'",
        "'speaker_8': 'Thank you. Councilwoman Price.'",
        "'speaker_3': 'Thank you. Thank you, Chief, for that report. And I want to just speak on behalf of the members of the Public Safety Committee who have talked about this issue for years now. Jack was able to pull up that the first time we started talking about this topic of public safety was December of 2015.'",
        "'speaker_3': 'So I'm really glad that we've implemented the program and that we're expanding the program. I will say that I see it daily that body cameras increase transparency. Obviously, they serve the rights of the accused, but they also protect the officers.'",
        "'speaker_3': 'And I'm grateful that we have body cameras now as the as the industry standard for most police agencies. It's something that I think juries expect to see now with the technology being so readily available to police agencies throughout the country.'",
        "'speaker_3': 'So I'm glad that we're able to equip our equip our officers. And I thank you, Chief, for staying with it and making this a priority for this fiscal year. Thank you.'",
        "'speaker_8': 'Thank you. Concentrate.'",
        "'speaker_9': 'Yes. I want to thank the Public Safety Committee. I know you guys have been working on. I know Councilmember Price, you've brought it up several times. You mentioned that it covered 80%. What's the 20% that's not covered? And is that expected to be covered down the road?'",
        "'speaker_7': 'Command staff members and members, for example, detectives who work more inside than outside. What we did is when we we looked at who should have them. Obviously, our priority was the officers who have the most contact with the public.'",
        "'speaker_7': 'So that would be all of our patrol divisions, including our field support division and some of our investigative units that go out and make more than your normal or your average amount of contacts, including search warrants and things of that nature.'",
        "'speaker_7': 'In regards to the future, absolutely. As we phase this in which I think has been the the appropriate and efficient way of doing it, and as as we move forward, we'll see, one, if the technology changes or.'",
        "'speaker_6': 'Improves storage and.'",
        "'speaker_7': 'Things of that nature and paying attention to what the rest of the industry is doing. I know that we as a city, we as a police department do great compared to others, and we have stats to prove that.'",
        "'speaker_7': 'But there are departments going the opposite direction that have had body worn cameras and decided that it is not for them for a lot of different reasons. So those are things we'll continue to monitor and keep you updated on and we'll proceed in the best interests of our community.'",
        "'speaker_9': 'Great. Thank you for that. I do just want to say how much I appreciate it. I know our police department in the last several years has made a lot of changes. I know our stats are changing and want to recognize that and applaud our officers for that effort.'",
        "'speaker_9': 'I look forward to seeing that trend continue and hopefully our police cameras can give our community a little bit more sense of security and our officers as well. Thank you.'",
        "'speaker_8': 'Thank you, Councilman. Super now.'",
        "'speaker_7': 'Thank you. Thanks for the report, chief, and great job on on facing this end from our end of things.'",
        "'speaker_5': 'You know they always.'",
        "'speaker_8': 'Ask us when we get these in the East Division or whatever.'",
        "'speaker_7': 'I know there are a lot of moving parts to get this thing going, including personnel. So you probably can't give us a hard date. But is there any light you can shed.'",
        "'speaker_8': 'On on when this will all take place?'",
        "'speaker_7': 'We anticipate that we will have this all rolled out because there's been an extraordinary amount of work that has already been down or done, I should say. There's a lot of infrastructure that needs to be done, and I can't say enough about the other departments that helped us get here, technology and innovation and financial management.'",
        "'speaker_7': 'So we anticipate with no significant curveballs that we should be able to get these cameras out, hopefully by February of 2020. If if you approve this, then we go through the contractual.'",
        "'speaker_5': 'Process.'",
        "'speaker_7': 'With the company. And then by the time we get all the equipment, we should be about February of 2020.'",
        "'speaker_8': 'Great. Thank you. Thank you also. Great job with that. Would you please cast your vote?'"
    ],
    "Recommendation to increase appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by $552.50, offset by the Sixth Council District one-time District Priority Funds transferred from the Citywide Activities Department to provide a contribution to California Families in Focus a non-profit organization, for support of their Gran Bailaton event, which is an exercise program being hosted in the Sixth District; and   Decrease appropriations in the Special Advertising and Promotion Fund Group in the Citywide Activities Department by $552.50 to offset a transfer to the City Manager Department.": [
        "'speaker_11': 'Motion carries. Number 19 Communication from Vice Mayor Andrews recommendation to increase appropriations in the Special Advertising and promotion fund in the City Manager Department by $552.50.'",
        "'speaker_0': 'Mr. King, he's not here, so please go and cast your vote.'",
        "'speaker_11': 'Motion carries.'",
        "'speaker_0': 'Thank you. We are going to go back and reconsider. I think mirna yoshihiro probably is here, so we're going to reconsider. Item 16 lester's any objection to a will to reconsider?'",
        "'speaker_1': 'We need a moratorium. Reconsider. Okay.'",
        "'speaker_0': 'So we're doing a vote right now to reconsider. Please please cast your votes on that. Thank you. And we now open up for comment, please.'",
        "'speaker_3': 'Good evening, everyone. My name is Mana Yoshihiro. I lived at the Belmont Shores Mobile State for five years. Since last May, my family had has an ounce of family business in the sport fishing industry. My husband died of a massive heart attack last year, June of 2007, when I was only 45 years old.'",
        "'speaker_3': 'I left my job as a as an office manager the following year, 2008. For that, I worked who I worked for a dealership for over five, 25 years, and I managed five stores, five dealerships in the year 2002.'",
        "'speaker_3': 'I was diagnosed with the disease called Moyo. Moyo syndrome. After five years of living in the Machar's mobile estate, watching all the repairs and renovation, rebuilding the whole park the since year 2016 to the present time. I had sold my family family a sport fishing boat.'",
        "'speaker_3': 'And in 2010, in exchange for a commercial boat, which is a squid boat and a real permit, which was very lucrative during that time. Before my before my two brain surgeries, I had to sell the to two boats in order to sell my art just to pay for my surgery bills and hospital stays, hospitalization, rehabs in all'",
        "'speaker_3': '. Now I'm living on disability, income and widow's benefit. No way in heaven will I be able to sustain myself. So on behalf of the mature residents living at Belmont Shore, I would like you to see if you could have how help us solve in this huge increase of our rent.'",
        "'speaker_3': 'Park management proposal. Retain the same amount of 355. Dollars per month. Credit plan which extended to two more years. That which is not not an it's a it's that is still an issue to all the residents living there.'",
        "'speaker_3': 'I had witnessed mature residents who had boarders living with them in order to make their payments meet to make their rent payments. Thank you.'",
        "'speaker_0': 'Thank you so much. We have a motion in a second. If I can get those, please cast your votes on that.'",
        "'speaker_11': 'Motion carries.'",
        "'speaker_0': 'That concludes the regular agenda items, Madam Clerk, I believe. Is that correct? And I'm course. That concludes the regular agenda items.'"
    ]
}