{
    "Recommendation to authorize City Manager, or designee, to execute all necessary agreements, and any subsequent amendments, between the City of Long Beach and The California Endowment to accept funding in the amount of $200,000, for the period of March 1, 2016 through February 28, 2018, for the Long Beach Health Equity Framework Plan; and  Increase appropriations in the Health Fund (SR 130) in the Health and Human Services Department (HE) by $200,000.  (Citywide)": [
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'A report from Health and Human Services recommendation to authorize the city manager to execute all necessary agreements with the California Endowment to accept funding in the amount of $200,000 for the Long Beach Health Equity Framework Plan. City wide.'",
        "'speaker_10': 'Sort of staff report.'",
        "'speaker_3': 'Yes, vice mayor, council members. We simply would like to change the date on this. So we want the terms of the agreement. We'll go from February 1st 16th to two January 31st, 2018, not March 1st, 16 to February 22nd, 18.'",
        "'speaker_3': 'So again, just changing the agreement to start on February 1st 16, that will last until January 31st 18. And this is a wonderful opportunity for us to accept money from the California Endowment for this program.'",
        "'speaker_10': 'Thank you is Councilman Gonzales. I'm okay. All right. Councilmember Richardson. So any member of the public that wishes to address Council on consent calendar item number seven. Seeing None members cast your vote.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to adopt Specifications No. PR15-105 and authorize City Manager to execute new permits with SoCal Kitesurfing, LLC, of Tustin, CA; Off the Hook Kiteboarding, Inc., of Huntington Beach, CA; and Captain Kirks, Inc., of San Pedro, CA, to operate kiteboarding and stand-up paddleboarding rental and instruction concessions on City of Long Beach beaches for an initial term of 18 months, with subsequent term extensions through September 30, 2021, subject to the approval of the California Coastal Commission, and at the discretion of the City Manager, or his designee.  (District 3)": [
        "'speaker_10': 'Is public comment next, Madam Clerk.'",
        "'speaker_2': 'And item ten is next door to. Well.'",
        "'speaker_10': 'That was pulled as well.'",
        "'speaker_2': 'Item ten Report from Parks, Recreation and Marine and Financial Management Recommendation to authorize the city manager to execute three new permits to operate Kiteboarding and stand up paddle boarding. Stand Up Paddle Boarding. Rental and instruction concessions on City of Long Beach Beaches District three.'",
        "'speaker_1': 'Can you turn this over to Councilman Price?'",
        "'speaker_8': 'Thank you. So this has been an item that we've received a lot of inquiry about over the last couple of weeks, actually, several months. But really, the the item has ramped up the discussion. So with that, I'd like to see if Parks Rec and Marine has a report to share with us that hopefully incorporate some of the'",
        "'speaker_8': 'concerns that have been raised.'",
        "'speaker_3': 'I'd like to hand this over to L.V. to Halloran, our bureau manager for our Marine Bureau in the Parks Recreation Marine Department, Alveda.'",
        "'speaker_2': 'Thank you, Councilwoman and mayor. The city has designated a kiteboarding area in Belmont Shore between Claremont and Laverne Avenue. Kitesurfing, also known as Kiteboarding, is an adventure water sport that is gaining popularity over the last few months and few years.'",
        "'speaker_2': 'A car boarder uses a harness, the power of the wind with a large, controllable kite to propel themselves across the water on a kite board that is very similar to a wakeboard or a small surfboard. The wind and surf conditions at Belmont Shore make the Claremont area an ideal site for the sport.'",
        "'speaker_2': 'In the spring of 2015, the city began the process of renewing the kite surfing concession permits. A public meeting was held on April 28th, 2015. This meeting was attended by the local residents and by the kite surfing community.'",
        "'speaker_2': 'At that meeting, everyone was given the opportunity to voice any concerns that they had or requirements that they would like to see. At that meeting, a compromise regarding the shared use of the beach was reached, and this compromise was presented to the California Coastal Commission.'",
        "'speaker_2': 'On July 29, 2015, the California Coastal Commission authorized a coastal development permit for the establishment of the designated Kiteboarding Lesson Area, a Kiteboarding Beach launch and exit area. 315 by 30 foot. Vendor areas. And the issuance of a maximum of three concession permits.'",
        "'speaker_2': 'As a result of this, an RFP was advertised in the Press Telegram on April 29th. As you all know, an RFP is a solicitation that provides for a full and open competitive bid process. At the end of the process, the city received five responses to the RFP.'",
        "'speaker_2': 'The proposals were evaluated by a committee of city staff who reviewed them against the stated criteria on the RFP and made a determination for award in the best interest of the city. The criteria for selection included several factors such as demonstrated competence, experience in the performance of comparable engagements, expertize, and the availability of key personnel and the'",
        "'speaker_2': 'overall conformance responsiveness to the terms of the RFP. The panel selected three responders. Southern California Kiteboarding Off the Hook, Kiteboarding and Captain Kirks, Inc.. Financial Management Purchasing Division sent out the notice of intent to award on June 22nd, 2015.'",
        "'speaker_2': 'Two letters of protest were received within the five day protest period. In accordance with the protest procedures, the purchasing and business services manager in the Department of Financial Management evaluated the protest and determined that there was no basis in support of either protest.'",
        "'speaker_2': 'Letters of explanation were provided to both the protesters on a moving, moving forward basis. Staff is now requesting the city council authorize us to issue the permits to the selected responders. I'd like to note an important notice here that all licenses and required documents such as a business license, insurance certificates, etc., are required to be valid at'",
        "'speaker_2': 'the time of contract issuance. In addition, as a result of a limited limitation placed upon the city by the Coastal Commission and as agreed upon by the Kitesurfing community and the residents, and in the best interest of the city of Long Beach.'",
        "'speaker_2': 'Vendors will not have the authorization to engage in the sales of equipment or sundry items as part of the authorized activity on the beach. And in addition to that, they will not be allowed to install permanent kiosk type structures.'",
        "'speaker_2': 'That is the end of my report.'",
        "'speaker_8': 'Thank you very much for that report. I just have a few follow up questions that I want to make sure that we get clarity on before we vote tonight. So the the three vendors that have been selected through this process, Southern California, Kitesurfing off the hook, Kiteboarding and Captain Kirk's, do they at this time or are they'",
        "'speaker_8': 'expected to have all necessary certifications and requirements in place before the permits are executed?'",
        "'speaker_2': 'Yes. One of the one of the Coastal Commission requirements was for these individuals to have ICAO's surf certification at the time of the submission of the RFP. The three selected vendors supplied copies of the certification.'",
        "'speaker_8': 'Okay. So during this process, it was determined through your methodology that they did have that certification? Yes, ma'am. Okay. And then in regards to those who applied for consideration but were not selected, have any requested meetings with city staff?'",
        "'speaker_8': 'And if so, could you give us an overview of efforts to accommodate them and explain the process?'",
        "'speaker_2': 'As I mentioned in my staff report to the two of the two incumbents who were not selected, submitted a protest letter through purchasing. Both were. Both were investigated by the manager of the purchasing and Business Business Services and were told that their purchase had no validation.'",
        "'speaker_2': 'In addition to that, I myself met with one of the proposers who was not selected, and we discussed at length the reasons why that particular proposal was not selected and why the other ones were selected over that over his proposal.'",
        "'speaker_8': 'Okay. Now, I understand that a resident of the city of Long Beach, in fact, of that area, was one of the ones that had applied but wasn't selected. Based on your understanding of the process. Is it is it your opinion that that that particular application either did not meet the qualifications or was not as preferable as the'",
        "'speaker_8': 'ones that were selected?'",
        "'speaker_2': 'Based on what we what was submitted, the other three incumbents that were that were selected, they ranked higher in our ranking when we went ahead and we reviewed four. Could they demonstrate that they were competent in teaching the board boarding, that they have experience in that area?'",
        "'speaker_2': 'Were they able to acquire the key personnel and that they have key personnel already in place, that they expressed financial stability and that they can form and respond to the RFP as requested so that this individual who I sat down with scored at a lower level than the other three.'",
        "'speaker_8': 'And I don't want to go into the details of it. I just want to make sure that you feel comfortable that the process was consistent, that it was fair, and that everything that folks wanted considered throughout this process was, in fact considered resulting in a a recommendation that you're comfortable with having gone through this process.'",
        "'speaker_2': 'Yes. The process by how it's set up is designed to be fair. So I feel very comfortable, as do the members of my committee, the selection committee that we selected.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Those individuals.'",
        "'speaker_8': 'Thank you. Thank you very much for your work on this.'",
        "'speaker_1': 'Vice Mayor a long theology of any comments.'",
        "'speaker_2': 'Councilman Mongeau I am thrilled that we are exploring Kiteboarding. I think that it is a fantastic sport. It teaches balance and other things young people can learn kiteboarding while standing on the shore. I think it's a great opportunity for Long Beach to get into this active and dynamic industry.'",
        "'speaker_2': 'It helps individuals who used to enjoy water skiing behind boats. Take a more environmentally friendly skiing approach, letting the wind pull them in. So I know that members of my family are active kite boarders. I think it's been a great alternative for our family in terms of not going out and polluting lakes and rivers as we've learned'",
        "'speaker_2': 'through the years. And so I've been very supportive of this item and I appreciate the great process that the team went through to ensure the fairness of the process. I think that Councilman Price did an excellent job of articulating the importance of that to this council, and I look forward to coming out and seeing many of your'",
        "'speaker_2': 'classes and engaging the community in this exciting sport.'",
        "'speaker_1': 'Okay. Thank you. A public comment on this item. Seeing nonmembers, please go ahead and cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay. Thank you. I'm going to I'm going to go ahead. And also, just because I know we have a lot of our I've been asked because we have a group of seniors here for item 11. Let's just go in here item 11.'",
        "'speaker_1': 'I'm sorry, not item 11. Item 14 for the seniors that are here. Let's go and do item 14, please.'",
        "'speaker_8': '15.'"
    ],
    "Recommendation to request the Senior Citizen Advisory Commission to create a report to review and explore the costs of restoring the former senior food programs and to discuss the connection to transportation, specifically related to any major changes that would have interrupted access from senior communities to former food program locations in the city; and  Request City Manager to provide a verbal report back at a Council meeting in a presentation no later than 90 days regarding the senior meal program. Grant opportunities should be explored along with the possibility of the Health Department collaborating or leading the work since this is truly a health related issue.": [
        "'speaker_5': 'It's okay.'",
        "'speaker_2': 'Communication from Councilwoman Gonzalez, Councilman Andrews and Councilmember Odinga. Recommendation to request the Senior Citizen Advisory Commission to create a report to review and explore the costs of restoring the former senior food programs and to discuss the connection to transportation and request the city manager to report back to the City Council no later than 90 days regarding the'",
        "'speaker_2': 'senior meal program.'",
        "'speaker_1': 'Thank you. There's a motion and a second on this. I'm going to read this over to Councilwoman Gonzalez.'",
        "'speaker_8': 'Yes. Thank you, Mr. Mayor. I wanted to bring this forward. This actually started with a friend of many of ours in downtown. Her name was Ruth Ricker. She lived at the Plymouth West. She passed away late last year, but before she passed away, I would often have coffee with her at her favorite spot off Broadway in the'",
        "'speaker_8': 'second District. And we would talk and she would tell me about the senior food program at Chavez Park. And she was very passionate about this program. And she said, you know, Lena, if you ever do anything in your district, please look at reinstating this program for seniors.'",
        "'speaker_8': 'There are many seniors in our area, especially around Chavez Park at Plymouth, West Park, Pacific Towers and many other buildings. And whatever you do, Lena, make sure that you just look into that. That's all I ask of you.'",
        "'speaker_8': 'And so in keeping that promise to her, unfortunately, I couldn't do this while she was alive. But I'm hoping that she will be able to look at this and be very proud. My next step was to talk to one of the individuals that I hold in very high regard, our downtown Don Darden.'",
        "'speaker_8': 'Our he is on the Senior Advisory Commission and I have our other amazing senior advisory commissioners here as well. And I really appreciate them being here in support of looking into this for us. But I believe that, you know, when speaking with Don, he had also mentioned that this was a great avenue to look into.'",
        "'speaker_8': 'In addition to this, we know that some of the transportation avenues have been changed around by Long Beach Transit. And so I know that some access to the senior center, you know, is cut off and you have to pay.'",
        "'speaker_8': 'And then there's some avenues along Chavez that may not make it easier for for individuals to get to those programs, even to go to the current senior programs that we have now. So this is where we are here.'",
        "'speaker_8': 'And I am looking to send this to the Senior Advisory Commission so they can look into this and further review this. But I'm really confident that they'll come back with some great information. And I thank you for your work.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'Thank you, Lina. Thank you so much for bringing this forward. Senior meal programs are a cornerstone of many of our communities, and I too am very supportive. I hope that the report will include the utilization of C one and C two funds for senior meal programs that come down from the state agency on aging and seeing where'",
        "'speaker_2': 'that could take us.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_9': 'Yes, I want to thank you also, Councilwoman Lena, for bringing support. I'm very fortunate to be able to have a senior meal in my district, but that was through private entity. And I'm just hoping that this will come back with some positive, you know, input on this because as a senior myself, I can tell you that every'",
        "'speaker_9': 'penny does count. And when it comes to good nutrition and meals, sometimes you have to sacrifice to pay, you know, for medication or other healthy related issues. So I am 100% in favor of this item, and we must support our seniors where we can.'",
        "'speaker_9': 'Thank you very much for bringing this again to the diocese.'",
        "'speaker_1': 'Thank you, Councilmember Ringo.'",
        "'speaker_6': 'Thank you, Mayor. And I also want to add my thank you to Councilmember Gonzales for inviting me to participate in this very important report here. I also want to include out, however, that there are many retiree retiree facilities in the seventh District.'",
        "'speaker_6': 'And I would like to have inclusion in there the possibility of expanding the program other than to those facilities that are already identified. Here to look at the possibility of opening up opening up another center at either Silverado Park or at Advocate Park as well, is very nice to see the possibilities of expanding the program as well'",
        "'speaker_6': ', since so many seniors do live in West Palm Beach area. Thank you.'",
        "'speaker_1': 'Councilman Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And thank you, Councilmember Gonzalez, for bringing this forward. You know, we have meals and bus service at the Highland Park Senior Center, and I think it's essential that all parts of town have access to that.'",
        "'speaker_3': 'But really, this is an opportunity to look at the whole system with fresh eyes. There's new leadership with Long Beach Transit. There's a new leadership here in Long Beach. So I think we this is a perfect time to relook at the system again, see how we can improve on it.'",
        "'speaker_3': 'So thank you so much for bringing this forward and I'll be in support.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_11': 'Yes. I do want to also thank Councilmember Gonzalez and the rest of the council members for bringing this forward. We have embarked on senior programing at the expo in the eighth District. And I can tell you that engaging our seniors or aging population is extremely important.'",
        "'speaker_11': 'And if we can provide meals and transportation and support for them to be able to, to, to, to fellowship and to and to engage in activities and just be a part of their community, I think that's that's also important.'",
        "'speaker_11': 'So I will definitely be supporting this. I would also ask that you look in the. Senior Citizen Advisory Committee Commission. Look at the the eighth District at the Expo. Look at the model that we have put together on.'",
        "'speaker_11': 'And I know a winning cadre and a number of you have participated. I see the Burgess here in the the early formation of that that that activity, but also looking at a sustainable model that that will help us also feed our seniors and make sure that we have quality programing.'",
        "'speaker_11': 'So thank you again for bringing this forward. And I'm happy to support as well. Thank you.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_8': 'Thank you. I, too, want to thank my colleagues and Councilwoman Gonzales for bringing this forward. I do have a question for city staff. We referred an item to the Senior Advisor Citizen Advisory Commission. Gosh, it has to be about a year ago, maybe more regarding a report on senior programing.'",
        "'speaker_8': 'And I haven't heard anything back. Do we have any update on whether they've been working on that issue or.'",
        "'speaker_3': 'Here comes Kelly Colby. She might have an answer to that.'",
        "'speaker_5': 'Hey. Good evening. So there have been there have been three different requests over the past six months or so around senior issues. And what we are doing at this moment is we are updating and revising the the senior strategic plan.'",
        "'speaker_5': 'Within that within that document, what we'll be doing is including action steps for a full understanding of all the different services within the city of Long Beach and how we start to coordinate those services. So we'll be looking at a system about of coordination of services and then the actual services themselves and starting to look at where'",
        "'speaker_5': 'are where are we meeting the needs and where are we not, and to build from there. So it's sort of a well we're hoping to do is put all of that into a single document that will be coming forth and to present that to you in April.'",
        "'speaker_5': 'And that will be a coordinated with the department, Health and Human Services, the Senior Commission.'",
        "'speaker_0': 'And Parks Rec and Marine Park Marine.'",
        "'speaker_8': 'Okay, that's great. And I'm glad to know that this is a really good conversation to have because we as a district, as the third council district, have been thinking about senior programing in the third district. So we haven't been working with the city other than Parks Rec and Marine on it in terms of what other efforts are'",
        "'speaker_8': 'going on for senior programing. We're really looking forward to bringing something different to the third district in regards to senior programing. Some of the ideas that we've had, our kind of more holistic empowerment, wellness kind of, you know, meditation and taichi and yoga and those kinds of things, as opposed to the traditional courses that we often see'",
        "'speaker_8': ', you know, that we offer. We wanted to offer something different in terms of offering kind of a wellness type senior center where it's kind of mind, body health, all of that. And so we've been exploring ideas, and we would love to be part of that conversation so that whatever we do is synergistic to what we're doing with'",
        "'speaker_8': 'the strategic plan.'",
        "'speaker_5': 'Okay. Yes. The strategic plan in many ways is also focused on those.'",
        "'speaker_0': 'Who are most at.'",
        "'speaker_5': 'Risk, seniors in terms of social services, housing, transportation, meals and all of those kinds of things. And then we'll also be in connection with Parks Rec, Marine, around senior programing in senior sites and in other community locations.'",
        "'speaker_8': 'Great. Thank you.'",
        "'speaker_0': 'Sure.'",
        "'speaker_1': 'Thank you. Any public comment on this item? Please come forward.'",
        "'speaker_2': 'Good evening, Mayor and Council. Women and councilmen and staff. Thank you all for serving this great city. I'm Mary Alice, the I'm the chairperson for the Senior Citizens Advisory Commission. And I want to say thank you to Mayor Garcia and to the Council for appointing me and our commissioners.'",
        "'speaker_2': 'It's been an exciting journey for us to learn how the commission is supposed to work and learning the process, the guidelines and the rules. And it's been an asset to develop our leadership skills and doing something for our seniors in the city.'",
        "'speaker_2': 'Also doing a lot of research, asking a lot of questions, attending meetings, going to events, and also visiting the senior centers. We will continue to engage so that we can be of help to our senior community. We are in receipt of the memorandum that was just read dated March 1st, and that's to create a report and to'",
        "'speaker_2': 'explore the cost of restoring the former food program and also the issues with transportation. So we will be working on that and bring you back the information. Our commissioner, Ruth Raker, passed away in July of 2015 and she was a strong advocate in support of free meals for our seniors.'",
        "'speaker_2': 'She lived in downtown with other seniors, and she understood the great need for good nutrition for those most needy with a limited income. Nothing is more critical to people's health and food. Hunger is a health issue. Some of our seniors come to the senior center and that's the only meal that they might have for the entire day'",
        "'speaker_2': '. The consequences of poor nutrition are devastating. Older Americans are 60% more likely to experience depression and more than 50% more likely to suffer a heart attack. The Supplemental Nutrition Assistance Program, which is a federal program, is called SNAP, only gives $127 a month.'",
        "'speaker_2': 'That doesn't cover for good nutrition. Bringing back the food program would be a great tribute and a way to honor our past commissioner, Ruth Ricker. This is the land of plenty and there shouldn't be anybody going hungry. I appreciate your time.'",
        "'speaker_2': 'And let's celebrate our accomplishments. Accomplishments together. Thank you very much.'",
        "'speaker_1': 'Thank you. Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Mayor and council members. My name is Ben Rockwell. I reside at 75 West Street. Unfortunately, many of our seniors, while they don't always get the best of nutrition, a lot of people don't realize that our seniors and persons with disabilities living on SSI in addition to their Social Security, to supplement it.'",
        "'speaker_3': 'While they may be getting much less financial moneys, they are not eligible for the SNAP program of getting extra food dollars. This is something that is horrendous that has been foisted upon us by our state and federal governments.'",
        "'speaker_3': 'Not only that, just this last year, our fire department. Has started and making charges to individuals when they have to come out to pick us up to do assessments or taking us to the hospital. That assessment is $250.'",
        "'speaker_3': 'That is well over. One third of my income after I pay my rent. That's as an exorbitant amount of money. Yes, we can go in and request that the fee be waived. But I did that over a month and a half ago for my first meal that I received.'",
        "'speaker_3': 'I have yet to hear at that fee has been waived. This was something that is of concern to me and I know many other seniors because seniors are more likely to have to have pick ups and be assessed by the paramedics than any other group of persons.'",
        "'speaker_3': 'So, please, I would like to hear back on that. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Thank you. Surely you start seeing your consultant pastor swarm group and associates with regard to seeing your care and and the meal program. I would like to raise the issue that more than likely we're thinking of people who are housed, seniors who live inside of housing.'",
        "'speaker_4': 'However, in most of the parks, Lincoln Park has a large homeless population who are seniors. So with the committee chair and persons who recently spoke, please make a note to yourselves. And I'm speaking to counsel. With regards to Singh, there are a large majority of the homeless population are aging people who are outside of doors.'",
        "'speaker_4': 'So as you think about restoring meals. We're going to have to expedite a way so that these people who are homeless will be able to get to those meals because now they're being cited groups. Some groups are being cited for taking food to people who are homeless, if they are lodging in the parks, if they're along the'",
        "'speaker_4': 'street. I've gotten away with a lot. I've been able to feed some people in the park, although I've been told lately that it was against the law. So when you're thinking about restoring food. We must lift our side to be young people who are housed and include those persons, those senior persons who are homeless.'",
        "'speaker_4': 'Some of them, as I over the recent Thanksgiving holiday, I was passing out food and money to these people. And it is a heartbreaker when you realize that unless some expedited help gets to these people, they're going to die right there.'",
        "'speaker_4': 'On the grass. So as we think about food programs. Don't think people who are in houses, you must include people who are outside of doors, who are seniors, and the majority of them will remain right there. Because Homeless Services is a very overlooked operation in most cities.'",
        "'speaker_4': 'I've traveled to three counties now over seven years, and I've seen the same problem. Seniors are a forgotten group. I saw a man sitting on the corner both in Ventura County and Orange County, and he sat on that corner in a wheelchair, homeless.'",
        "'speaker_4': 'We must lift our sights beyond people who are in houses with regards to the meal program.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_5': 'Good evening, Mr. Mayor and fellow council members. I am Commissioner, one of a cadre of the Senior Citizen Advisory Commission. I'm here to address the problems seniors are facing, trying to keep up with the shortage of their funds.'",
        "'speaker_5': 'Inability to reach the senior centers where nourishing meals are served daily at a minimal cost is an ever growing problem. Seniors need these meals to survive and should not have to pay for transportation to get to them. I speak from experience.'",
        "'speaker_5': 'I have been an orphan since the age of four. And without government assistance, I could not be here today. So I commit my life to serving the public. I have volunteered since retirement at age 81 in our schools, hospitals, seniors centers, churches and the Long Beach Police Department.'",
        "'speaker_5': 'I'll be I'll be 97 next month. And with God's help, I will continue to serve. Thank you.'",
        "'speaker_3': 'Oh, my goodness. Gary Shelton's my name. 240 Chestnut. I live in Plymouth. West Coast is just about a block and a half from here at Plymouth West. I serve as the community contact. I think if I have a title and all the community contact to the to the resident advocate network it's called ran our and and I'",
        "'speaker_3': 'think you can tell that this issue has maybe touched a nerve. There's fully 5% of the residents from Plymouth West here right now. In fact, if you don't mind my turning around for just a second, a lot of them are in the back row.'",
        "'speaker_3': 'If you could raise your hand if you live in Plymouth West, you know, there's looking at the audience tonight, there's there's a lot of shades of gray and white and bald in the audience where we represent, where we'll all be one of these days, you know, God be with us.'",
        "'speaker_3': 'And I think I counted the votes. I think I'm kind of talking to a choir here. But the one thing that I was that I was that took me kind of by.'",
        "'speaker_1': 'Surprise.'",
        "'speaker_3': 'Was and I really appreciate that. Miss Collopy said that she hopes to present in April a a senior action plan that I would look at as sort of a bureau, address or bureau. And this issue of the senior meals and the nexus they may have to the access or lack of access to transportation to those meals will'",
        "'speaker_3': 'simply be one drawer in that bureau. And I'm not sure that between now and when these action plans, which take, as you know, many, many months to to create, I'm not sure there's actually time for this one to populate that dresser drawer as as well as maybe it could.'",
        "'speaker_3': 'But one thing I want to do is stand before you right now and suggest that we stand ready to the point that we can communicate out to the Senior Citizen Advisory Commission and to the point that they can reach out to us as well.'",
        "'speaker_3': 'In the various locations where seniors live, not only senior buildings, but senior neighborhoods in town, to find out just how impacted we have been by the loss of transportation and the loss of food programs specifically. So I really appreciate this opportunity to get that point across and hope that we have a lot more information on this and'",
        "'speaker_3': 'a lot more meals in the future. Thank you so much.'",
        "'speaker_1': 'Great. Thank you.'",
        "'speaker_2': 'I apologize. I got hit while I was walking in San Pedro and I'm still recovering. I want to thank, first of all, Councilwoman Lena Gonzalez. You're my hero. Dee Andrews, Councilman, your anger. Thank you for bringing this forward.'",
        "'speaker_2': 'And I know that the rest of you will support this because you have seniors living in your your various council districts. Now, Gary stole a little bit of my thunder. I want every senior who's in the building right now to raise your hands.'",
        "'speaker_2': 'Every senior, whether you live in Plymouth West. Great. Okay. How about the peanut gallery here?'",
        "'speaker_0': 'Our friends together.'",
        "'speaker_2': 'You know, we've got a lot of we have a lot of energy here tonight. We have a lot of talent. I have been a published writer, a magazine editor and a grant proposal writer. I hereby Takashi, I hereby will.'",
        "'speaker_4': 'Devote my life to helping the commission.'",
        "'speaker_2': 'And if there's any way that we can persuade anyone who might be a little reluctant.'",
        "'speaker_5': 'Because of cost of money.'",
        "'speaker_2': 'And whatever, there are funds out there, there are a lot of funds. The government, believe it or not, knows that we're here.'",
        "'speaker_4': 'And if they don't.'",
        "'speaker_2': 'Yet, they're going to. And we're going to let this roar. I have seen personally, through my help in the community, the need. And so many of the seniors are shut ins or they're a little reluctant to get involved.'",
        "'speaker_2': 'They don't have to get involved. They just have to let us know, let you know that they're there. And so we want a friendly face to the community letting them know hunger. Hunger isn't really necessary. There are there are many ways to fund these programs to help the individual who might be afraid.'",
        "'speaker_4': 'Of a government.'",
        "'speaker_2': 'Person. And I'm not a government person. And I hope that each and every one of you, whether it's Patrick West, who I met at one of Lena's events.'",
        "'speaker_5': 'Or Mister or City Attorney Parkin.'",
        "'speaker_2': 'We want your support. We want this to go forward.'",
        "'speaker_5': 'We want it to be effective. Not a money waste K, not a money wasted. And if we can help you in any.'",
        "'speaker_2': 'Way, shape or form, we're here to help. And I'm sure I'm not going to speak on behalf of Gary and Beth Seno and some of the other very creative and brilliant people who live at Columbus West. But we want to help.'",
        "'speaker_2': 'We want to make this.'",
        "'speaker_5': 'Happen, happen efficiently.'",
        "'speaker_4': 'And and.'",
        "'speaker_2': 'Meet the people who really need it. Okay.'",
        "'speaker_5': 'Thank you very much. Thanks for listening. And again.'",
        "'speaker_2': 'I apologize.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Good evening, everyone. You have your sparkling faces there. And we are sparkling seniors because there is Super Tuesday. People are voting in other parts of the country and we're here. So I just wanted to let you know, something of our commission is small but mighty, and we just got ourselves together.'",
        "'speaker_5': 'So the 2016 mission statement of the Senior Citizens Commission is to advocate for new thinking and science of aging for the culturally diverse population of the older adults in Long Beach, and broaden knowledge in the areas of education, safety, housing, health, transportation, technology and the quality of life.'",
        "'speaker_5': 'Now, to improve the quality of life and health and to cut the isolation of seniors. Where are hot lunches? Well, Councilman Lowenthal, you have the senior center in your district, and it's a wonderful place to go visit. Councilwoman Mongo, you have that wonderful Eldorado Park.'",
        "'speaker_5': 'Councilman Andrews, huh? You have McBride Park and Councilwoman. Councilman Richardson, you have Halton Park. And all of you have these lovely warm lunches for our older adults at parks and recreation sites. And Councilman Austin, I want to applaud what you have done and worked with to bring lunches to the expo, because that was a wonderful first step'",
        "'speaker_5': '. I hope that you have had time to visit these, Mr. Mir Garcia. I hope that you'll take the time to go out and visit the seniors at those programs. Now for the health and quality of life of older adults.'",
        "'speaker_5': 'More needs to be done. What's missing? Councilwoman Gonzalez, Councilwoman Price, Councilman Super Na, Councilman Urunga. You all have to visit other locations because there's nothing in your area. I really want you all to please consider the positive effects of this food program and these food programs for our older adults and for the homeless.'",
        "'speaker_5': 'I think that's an excellent point for us. For those people that Chavez in or in honor of Ruth Ricker, that's important. Silverado and and Admiral Kidd Park. There are many others but please this needs to be done. And Long Beach.'",
        "'speaker_5': 'All of you every one of you sitting there looking at me and the audience. You need to have skin in the game. And I really appreciate that you're taking the time to listen to us tonight. Thank you.'",
        "'speaker_1': 'Thank you. Another public comment. Please come forward.'",
        "'speaker_7': 'Good to be giving skimming. Good evening, mayor and city council member don darn. Our is my name. I'm in the first district, Elian Gonzalez. We've been working on a lot of issues and we're very concerned with the seniors.'",
        "'speaker_7': 'Me being one course of the senior population is one of the fastest growing segments of our of our society. In case you didn't realize that it's one of the fastest growing. So there's lots of needs there and it's going to continue to get even stronger.'",
        "'speaker_7': 'I agree very much with this feeding program, and I'm glad you brought it up, Lena, because we, too, my wife and I felt very close to Ruth Ricker. And I think this is an opportunity to do something in memory of her and honor of her.'",
        "'speaker_7': 'And I think it's a great thing. Um, I, I'm, I've been to the Chavez Park many times. I go there kind of regularly. And I've noticed since the feeding program stopped there a year and a half ago, two years, whatever it is that the seniors the seniors don't come out anymore.'",
        "'speaker_7': 'They don't come to the park. We need senior programs at the parks and we need senior feeding at the parks. They don't seem to feel quite so comfortable just coming to the park. The feeding program was a tremendous help in doing that.'",
        "'speaker_7': 'So not only do we need to feed them with it, with the need those that haven't been able to get it, but we need to be able to get them there, too. Transportation is definitely an issue. As a matter of fact, just two, three months ago, back in December, Long Beach Transit had a public meeting at international'",
        "'speaker_7': 'school. There was 75 people that showed up, most of them seniors. And we gave all our opinions about the problems with transportation, especially the one that they were cutting out the passport. It no longer goes above third Street.'",
        "'speaker_7': 'It was at 10th Street. And seniors at that point in between there came down and used it very frequently. And we even suggested some alternatives that they could provide that would that would satisfy everybody, both Long Beach Transit, as well as the seniors.'",
        "'speaker_7': 'But unfortunately, of those 75 people that got up and spoke, they were ignored. It nothing happened. We offered an option of how they could do it to please both sides. Just, you know, as the bus now comes across Third Street, just go up seven blocks to 10th and back down over to Chavez Park and back.'",
        "'speaker_7': 'And they continue the route. That's all we have to do. So it seemed to me like there's some some funding, some opportunities, some grants that could not only help feed the seniors, but also if Long Beach Transit is hard up and can't afford to listen to seniors.'",
        "'speaker_7': 'Maybe we can help subsidize just a few more block extensions of of the present passport bus. So that's that's something that we'd like to see you help support us to do, to think about those things. If we can come up with some sort of funding, grants, anything you can think of, please come forward.'",
        "'speaker_1': 'Thank you. Don't.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Is there any other public comment, Mr. Song?'",
        "'speaker_3': 'Honorable Mayor. City Council Member. My name is Charles Song, the chairman of the Cambodian American Civic Engagement Committee. I am here to comment on other issue, but since we brought up the senior issue, I think it's only appropriate for me to take a moment to acknowledge and applaud Councilman Diane Drew for keeping the hot meal for a'",
        "'speaker_3': 'senior, especially in the central area at the McBride Recreation Park, especially for the Cambodian senior. Thank you very much for doing that. I can't imagine, Andrew. And thank you.'",
        "'speaker_1': 'Thank you. See no other public comment. I'm going to take this back to the council now. Councilwoman Mongo.'",
        "'speaker_2': 'So first, I want to thank each and every one of you that serving on the commission and for your thoughtful public comment today. It's important that we have leaders who are passionate about the commissions they serve on and your attendance and your thoughtfulness and your comments that, you know, many of our our staff go to your meetings'",
        "'speaker_2': 'to listen in are just important. Many of you have encouraged us to go out and enjoy time with the seniors. But I'll tell you, I put on a hairnet and scooped food for the senior, delivered home, delivered meals.'",
        "'speaker_2': 'I'm sorry for the congregate meals where they sit together. And then I also went on right along for the home, delivered meals, and today spoke with the pastors in our district about the home delivered meal program and the areas of which we have applicants available, and then the areas where our faith based community can step up.'",
        "'speaker_2': 'Our Home Delivered Meals program both has an ethnic component and a non-ethnic as is our congregate meal program. And I think that localizing that and taking more local control and, and our health department taking a lead through your leadership is a big part of that.'",
        "'speaker_2': 'We talked a lot about transportation today, and a lot of the MTA grants for seniors go into multi-year extensions until they expire because of knowing and understanding the senior community's needs. And that changing demographic as seniors get older and move into different communities has been challenging for those organizations.'",
        "'speaker_2': 'And so we here in Long Beach are so fortunate to have you and your insights and your guidance. And we appreciate you very much. So thank you. And I hope we can continue to work together. I know that I've talked with some of you about some of the bus changes we're talking about with the health facilities that'",
        "'speaker_2': 'are all moving around in the fifth District right now. Because as those facilities move, one component of that is the added distance that seniors will need to take to walk when they get off at the bus stop. And so we're taking that into consideration and we're looking at that.'",
        "'speaker_2': 'And so I appreciate your comments that come to our offices. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_8': 'I just want to thank everyone for their beautiful comments. I think Ruth would definitely be very, very proud to hear that this is being looked into. And I look forward to the information coming back and your hard work.'",
        "'speaker_8': 'And thank you, everyone from Plymouth West. It's just lovely seeing everybody yet again, but on something very positive. So thanks again for every one's work and I look forward to hearing back.'",
        "'speaker_1': 'Thank you. With that member's piece, Peace. Gordon, cast your votes. And as they do that, I want to thank all of you for coming out today as well. And thank you for serving and really important work. So thank you so much.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay. Thank you all very much. Thank you very much. Okay. We're moving on to public comment now. The first three, I have Larry Goodhue, John Dietz and Shirley Bouchard. Jason, please come forward.'"
    ],
    "Recommendation to:  1)\tApprove an ordinance of the People of the City of Long  \tBeach, California, adding Chapter 3.62 to the Long Beach  \tMunicipal Code relating to Transactions and Use Tax;": [
        "'speaker_1': 'Thank you. Okay. Public comment is complete. We're going to take two items up. First, we're going to take both item 14 as well as item. I apologize. Item 11. So 14 and 11 will be the next two items and they will go on with the rest of the agenda.'",
        "'speaker_1': 'So item 14 Madam Clerk.'",
        "'speaker_2': 'Communication from City Attorney Recommendation to one Approve three ordinances of the people of the City of Long Beach relating to transactions and use tax to to impose the transactions and use tax to be administered by the State Board of Equalization and three to establish a budget stabilization fund.'",
        "'speaker_1': 'These are the second reading from last week's vote. I'm a city attorney. I believe we can take these all in one vote from.'",
        "'speaker_3': 'That's correct, Mayor.'",
        "'speaker_1': 'Okay. So second reading, public comment on the second reading, please come forward. There's public comment on the second reading. Please come forward.'",
        "'speaker_4': 'Mayor and council members. My name is Janet West, and I've lived in the city of Long Beach continuously for over five decades. I am opposed to this ordinance for multiple reasons. Why should we believe you'd listen to a citizen advisory committee when you're not currently listening to your citizens?'",
        "'speaker_4': 'Why would citizens of Long Beach make purchases, especially major purchases in Long Beach, when they could go to a local city and buy those items for 1 to 2% lower? You're moving expenditures out of the general budget. To this new ordinance money.'",
        "'speaker_4': 'And that just leaves more money in the general budget, which allows you to spend money on other items. Councilman Supernormal says that he's the new sheriff in town. But did he use Common Core math to determine year one vote can change the other eight votes?'",
        "'speaker_4': 'Councilmember Sue Burnham has supported the Citizen Committee in order that he can sleep well at night. Please save taxpayers money and businesses lower sales and just buy yourself a teddy bear. From The Beachcomber. The spending problem is demonstrated by looking at recent data.'",
        "'speaker_4': 'The medium income. A full time private sector workers in Long Beach is $41,455, which while the median income of full time city employees is 85,900. And what benefits? 111,940 between 2013 and 2014? Total Sitter City Employee Compensation jumped $11,000,336 602.'",
        "'speaker_4': 'That's a 24%. The reason we don't need a tax hike. Is that true? People are hurting financially. The private sector has a downward pressure on wages. I want city employees to earn good wages. But right now in this economy, you need to freeze their salary and benefits.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_11': 'By Tom Stout on information on file. Just the way this is written, approve an ordinance of the people. You have to be kidding me. This is not for the people. This is for you. That's the most absurd thing I've read in a long time.'",
        "'speaker_11': 'And you repeated it three times. You got to be kidding me. And what is that rainy day fund to stabilize the astronomical pension hit? We're going to take in 2021 $150 million, which will carry forward for another 15 years.'",
        "'speaker_11': 'Get off this thing about 700 positions. There were 700 positions that were not needed, that were funded so that you didn't actually have to make any real cuts and get off. The thing about pension reform. It's a farce.'",
        "'speaker_11': 'If we had reform, we wouldn't be spending $150 million in the next five or six years. Those pensions will increase by 10% a year, according to CalPERS. Not me, but CalPERS own information. Then one thing I've always wondered about on Prop eight.'",
        "'speaker_11': 'Yes, we needed to raise those the tax on oil, we need to raise it again. But it should not have been given only to police and fire. There are so many needs in this city besides them. That's what I don't understand.'",
        "'speaker_11': 'Compensation for police and fire is somewhere around 70% of the general fund. 90% of the general fund is compensation. About 10% or less provide services. How much do we have to. I mean, how much should it cost to be safe?'",
        "'speaker_11': 'Think about that. How much should it cost to be safe when you're some of your constituents ask you for more police protection? The Andrews comment was you got to pay more. Now we don't. We give you more than enough money.'",
        "'speaker_11': 'You know, and you say anybody that disagrees that the city has cut this their budget to the bone. I mean, what a demeaning thing to say to your constituents. Anybody that disagrees with you is wrong. I think it's the people up here that are wrong.'",
        "'speaker_11': 'So I guess it's going to be business as usual. You know, I you know, you talk about 67% of the people said this tax is great. Well, I don't know who you talk to. I haven't met any of them.'",
        "'speaker_11': 'You know, and you won't release the information about the study. So, you know, it's probably a farce anyway.'",
        "'speaker_1': 'Thank you, Mr. Stout. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mr. Mayor. Council members. My name is Peter Santillan.'",
        "'speaker_1': 'I am the business.'",
        "'speaker_3': 'Manager and secretary treasurer of Labors Local 1309, representing over 2000 members, the majority of them which live in the city of Long Beach and immediate surrounding areas. I'm just simply here to thank you for your prudence in moving forward with this matter ballot to help secure and pay.'",
        "'speaker_1': 'For the infrastructure costs that have been put off.'",
        "'speaker_3': 'For too long. Also, public safety putting off infrastructure needs is only going to cost more money down the road. I was thinking.'",
        "'speaker_1': 'On the way in.'",
        "'speaker_3': 'I know I have a problem at home with the leaking.'",
        "'speaker_1': 'Faucet and in the bathroom and I.'",
        "'speaker_3': 'Know the longer I let it go, more money is going to cost me.'",
        "'speaker_1': 'So.'",
        "'speaker_3': 'Infrastructure needs, of course, is a much bigger scale.'",
        "'speaker_1': 'And again, I'm just here to thank you for your prudence.'",
        "'speaker_3': 'And we will be doing everything we can to encourage our membership to help.'",
        "'speaker_1': 'This measure pass. Thank you. Thank you. Next speaker, please.'",
        "'speaker_7': 'Very good. You click as the address. If you want this measure to pass, what you've got to do is rewrite it to reflect the fact that you've abandoned the buffoonery inherent in replacing the city hall with what's your plan.'",
        "'speaker_7': 'But instead, I build here an income generating paradigm, two of them one hotel, another an office complex, and the main library will go, is what I suggested. Develop a paradigm where the or their rent as outside school do the requisite language.'",
        "'speaker_7': 'Promise that. All right. And once that starts, come back to the people. With a reasonable plan, a plan that would include we eliminate the full time mayor. And we reduced the number of council people. Two seven. That will demonstrate that you're serious about the future of this city.'",
        "'speaker_7': 'The previous speakers have hit the nose. Right. And this is right in the head, period. This is something like Bernie Madoff would perpetuate and put forward. I have yet to come across anybody that supports this tax period. Most of them recognize the buffoonery and the deceit.'",
        "'speaker_7': 'That everybody is buying into. You just got to step up to the plate and say, hey, we made a mistake and you had the ability to change that. You can have a nice fountainhead of revenue in this terra firma and this city hall complex now where the city hall is.'",
        "'speaker_7': 'I continue revenue stream. If you do it right. Absent that, you're just digging the hole. And, you know, when you find yourself in a hole, what's the first thing you do? You got to stop digging. Period. That's what you have to do.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Ottawa Mayor. City Council Member. My name is Carl Song from the Central Area Sixth District. Now I know that this is difficult at this particular time when we are talking about raising any sort of taxes. But I want to let you all know that I am here to support the idea for a couple of reasons.'",
        "'speaker_3': 'If you look in a central area. When we talking about the infrastructure, indeed something must be done. Now I am going to talk about crime. In the central area. Often time my fellow Cambodian have come to ask to see whether or not they can get some help in time.'",
        "'speaker_3': 'But after I learned that many position has been cut. And there's a lot that need to be done. That's the reason that I come to the conclusion we have no choice but to support. This and they should to move forward.'",
        "'speaker_3': 'And I would hope that Mr. Mayor and a city council member think and make sure that this initiative will approve. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Song. We have one final speaker here coming down, and then we'll go to a vote.'",
        "'speaker_3': 'Mr. Mayor, Honorable City Council. My name is Jake Elwood. I'm the vice president of Long Beach Firefighters Association and also a resident of the fifth District. I'm here tonight to speak on behalf of all the professional firefighters to the city of Long Beach.'",
        "'speaker_3': 'For this agenda item, we support this measure. Today, earlier today, the Public Safety Committee received a report on the response data for the city of Long Beach for the fire department. And it was alarming. It was disturbing. And it needs to be addressed.'",
        "'speaker_3': 'Obviously, we are not meeting the response times for 91 calls for all of our citizens and on behalf of all of us. The only way to fix this problem is the restoration of services. Your fire department, your firefighters are behind this 100%.'",
        "'speaker_3': 'And we thank you. Thank you, sir.'",
        "'speaker_1': 'Thank you. There's a motion in a second. If we can, please go and cast your votes. And again, as a reminder, this vote tonight is to is to have the voters make the decision in June. So please cast your votes.'",
        "'speaker_1': 'And this is to put on the ballot for the voters to decide.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to adopt resolution in support of The Convention of the Elimination of all Forms of Discrimination Against Women (CEDAW), and request City Manager to identify a current City Commission such as the Human Relations Commission that will partner with California State University, Long Beach to complete a gender analysis study of Long Beach. After the gender analysis study is completed the selected City Commission should examine policy reforms as outlined by study and consistent with CEDAW in order to make recommendations to the City Council for implementation of any policy reforms or additional programming that is consistent with goals of CEDAW.": [
        "'speaker_1': 'Thank you. And now we'll go ahead and move on to the next item, which is, I believe it was 11. If I apologize, Councilwoman. PRICE Was it 11? Yes, Madam Clerk.'",
        "'speaker_2': 'Item 11 Communication from Councilwoman Price. Councilwoman Gonzalez, Vice Mayor Lowenthal and Councilwoman Mingo. Recommendation to adopt resolution in support of the Convention of the Elimination of All Forms of Discrimination Against Women. And request the City Manager to identify a current city commission that will partner with the CAC will be to complete a gender analysis study of Long'",
        "'speaker_2': 'Beach.'",
        "'speaker_1': 'Thank you. Councilman Price to you.'",
        "'speaker_8': 'Thank you. Thank you for your patience, everyone who's here for this item? We were not expecting it to take this long to get called, so I appreciate you guys sticking around. In honor of International Women's Day, a global day celebrating the social, economic, cultural and political achievements of women.'",
        "'speaker_8': 'The day also marks a call to action for accelerating gender gender parity. To celebrate International Women's Day, my female colleagues and I are requesting the city attorney to draft a resolution in support of the Convention of the Elimination of All Forms of Discrimination against Women, also known as CEDAW.'",
        "'speaker_8': 'C does a landmark international agreement that affirms principles of fundamental human rights and equity for women around the world. In December of 1979, the United Nations General Assembly adopted CEDAW, and in 1998, San Francisco became the first municipality in the world to adopt a local ordinance.'",
        "'speaker_8': 'CEDAW offers countries a blueprint to promote basic rights and to open opportunities for women and girls in all areas of society. In addition to asking the Long Beach City Council to support CEDAW, we are also requesting the city manager to identify a city commission that can partner with California State University Long Beach to complete a gender analysis'",
        "'speaker_8': 'study of Long Beach after the Gender Analysis Study is completed. Our selected City Commission should examine policy reforms as outlined by the study and consistent with CEDAW in order to make recommendations to the City Council for the implementation of any policy reforms or additional programing that are consistent with the goals of Sweden.'",
        "'speaker_8': 'This very important legislation was brought to our office by our resident Nazanin Amani Nazanin, thanking us and is a member of the Women's Intercultural Network and is leading the campaign of cities for CEDAW. I hope the City Council will support CEDAW and our work to ensure women and girls are treated equally in all areas of our society'",
        "'speaker_8': '. I'd like to ask all of the women and men who are here tonight in support of this item to stand and be recognized. Thank you to my colleagues who signed on to the item, and I ask all of our colleagues to join us in supporting this item when we vote.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Gonzales.'",
        "'speaker_8': 'Yes. I want to thank Councilwoman Pryce and I want to thank everyone here tonight for their work on this every single day. I know we get one night to recognize this. And when it comes back, I'm sure we'll continue the celebration.'",
        "'speaker_8': 'But it really speaks volumes as to what is possible. You know, when we when we initiate a study, when we look further into the quality of life of women. Many of us here work in male dominated fields and in politics and in my other life, in technology.'",
        "'speaker_8': 'And it's always how do we make sure that young, young women, girls, you know, I have all boys at home. But how do we make sure that young girls have opportunities like we do here on the dais? How do we make sure young women have opportunities to learn about technology, to learn about being on commissions, to learn'",
        "'speaker_8': 'about being in things that they didn't even think possible for themselves. And so I want to thank you again for all of your work. And I look forward to this coming back and recognizing this as a day to celebrate women.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Council or actually Vice Mayor Lowenthal.'",
        "'speaker_10': 'Thank you, Mr. Mayor. Wanted to thank Councilmember Price for including me on this motion it and I'm really pleased to see that everyone has shown up for this item and thank you for your patience. We're privileged that you would bring this before us today and ask us to take action on it.'",
        "'speaker_10': 'While we don't have any jurisdiction over the major impediments that women experience throughout the world. It is a very strong statement that our council can make. The convention is the only human rights treaty that affirms the reproductive rights of women and targets culture and tradition as influential forces shaping gender roles and family relations.'",
        "'speaker_10': 'And so, as many times as we can heralded the merits of it. Hold it up. I think we can make progress. It still mystifies me that we have these conversations today in the 21st century. And I'm listening to Councilwoman Gonzalez talk about male dominated industries.'",
        "'speaker_10': 'I think technically I am as well, but. We all are, actually. When I look down the dice. But we've been privileged through the help of many people along the way, we have been able to succeed in areas that maybe many women have not been able to.'",
        "'speaker_10': 'And for that, I am personally grateful for all the men and women that came together to allow that to happen in my life. And I'm hoping that while it's somewhat of a travesty that we're having this conversation in this day and age, I am always glad when there is active dialog nonetheless and that continued storytelling and I'",
        "'speaker_10': 'think we can move toward the change you want to see. Thank you for bringing this to us and I'm obviously very much in support of it.'",
        "'speaker_1': 'Thank you, customary, Ringo.'",
        "'speaker_6': 'Thank you. I want to thank my colleagues to the right side of me. It seems like that's where all the women seem to be in the right side. But I do want to express my gratitude for you bringing this forward.'",
        "'speaker_6': 'I think it's a way long overdue. Is taking too many years to put this put this forward. And I want to share my thoughts with you and the fact that you have a partner with me in this issue.'",
        "'speaker_6': 'In another life, I used to work at Cal State, Long Beach. I was an administrator there. And when I had plenty of opportunity to talk to students about professions, about marketability, about employability, and when young girls would raise your hands, when I would ask question, what do you want to be?'",
        "'speaker_6': 'They would say, Nurse, I would ask you the question, Well, why not be a doctor? Or would they would say, I want to be a mechanic away where? Okay, why don't you be an engineer? It was always that effort to try to push them forward to be something beyond what they thought their own expectations would be.'",
        "'speaker_6': 'And I think it takes, as the saying always goes, it takes a village, but it takes all of us commitment to help our young our young women to see that they make it through life in a way without prejudice and without obstructions and without obstacles to be able to accomplish what they want to accomplish now, what we'",
        "'speaker_6': 'want them to accomplish, what they want to accomplish. And that's something that has always been difficult to, for some segments of our society to believe is that, you know, girls, too, and women have goals and ambitions and desires and they all all want to be career minded and want to be where they want to be, because that's'",
        "'speaker_6': 'where they can be. But the bottom line is that this is a long way, long overdue. And in my second phase of my life, working for the city of Long Beach, I was the city's recruitment officer for many years.'",
        "'speaker_6': 'And it was my goal to increase the numbers of women in in our in our employment, in our force. I was very pleased to see that during my efforts in recruitment, that we were able to hire the first woman firefighter in the region here in the city of Long Beach.'",
        "'speaker_6': 'And we've had been able to increase our representation of women in the police force as well. So we have made progress, but we have a long way to go. And it's it's a cultural change that we need to make within ourselves.'",
        "'speaker_6': 'It's a change of attitudes. And once we get there, we're going to be seeing a much better world. So thank you for being this, for bringing this forward. And I look forward to your voting and the audience when it comes again.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_9': 'Yes, and thank you, Mayor and I myself. It's a must that I, you know, so excited about this being brought to the diocese. Being a father of four daughters. And I had to weigh in because I have a wife that said after she saw this, you better weigh in.'",
        "'speaker_9': 'And I'm so happy that I am, because I think this is a great legislative item. And I commend that Councilwoman Price for bringing this item forward. And this is another huge step towards affirming that Long Beach, the city that stands for equality.'",
        "'speaker_9': 'And it's so wonderful to be a part of a situation of this type. And thank you again, Mrs. Price.'",
        "'speaker_1': 'Gentlemen, also.'",
        "'speaker_11': 'Thank you and certainly echo the comments, I think. Oh, Councilmember Urunga was very eloquent and as well as Councilmember Andrews. I certainly stand in support of this this item. I want to thank Councilmember Price and the the women to the right the right women for bringing this forward.'",
        "'speaker_11': 'And I just wanted to to also say what an honor it is to serve with strong women on this council. We are equals. And each and every one of them are shining examples of of of leaders, for for young women and for for many years to come.'",
        "'speaker_11': 'And you guys are all great role models, so thank you very much. It's an honor to serve with you all. I'm impressed by each and every one of you and happy to support this motion.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'Well, after that, I don't think there's anything else I could say. So I want to thank the people who came today to be supportive of the item. It means a lot to us. And thank you for the leadership you've shown in each of your industries.'",
        "'speaker_1': 'Thank you and public comment on this item. Please come forward.'",
        "'speaker_5': 'Dear Honorable Mayor Robert Garcia and council members. My name is Nazanin Amani. I have been a resident of Long Beach with my husband, who is here in support of Saeeda and my two sons for the past 25 years since we left Iran.'",
        "'speaker_5': 'I heard about cities for their campaign two years ago when I became member of Women Intercultural Network through my sister in law, Harmony, who is also in the audience. Who is the women's rights and human rights activist? Getting acquainted with Cedar.'",
        "'speaker_5': 'I was surprised to find out that the US Constitution does not grant equal rights for women. I was even more surprised to find out that U.S. and Iran are two of the six countries in the world who have not ratified this human rights treaty.'",
        "'speaker_5': 'Well, I couldn't do much about Iraq. Not yet, at least. But I took the initiative to bring this to my district councilwoman, Suzy Pryce. Attention, who brought us here today. Thank you very much, Susie. One of the many benefits of Cedar is raising awareness about many things, including domestic violence and moving forward to minimize it.'",
        "'speaker_5': 'And this is especially important in Long Beach since we all know our city is struggling with homeless issues. And according to a recent report from Good Shepherd, Child Shelter, domestic violence account for 21% of homelessness. I appreciate your time and vote in favor of this resolution in advance.'",
        "'speaker_5': 'And I also want to thank everybody in the audience who have taken the time from their busy life to be here to support the resolution. I leave you with this note that the civility of this society is measured by the way they are treating their woman.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Absolutely. Next speaker, please.'",
        "'speaker_2': 'Dear Mayor and council members, I'm Francis Rosner, president of the American Association of University Women Long Beach Branch, known as AAUW Long Beach. Thank you for this opportunity to speak with you, and thank you to council women Gonzalez, Lowenthal, Pryce and Mongo for bringing forward this resolution in support of CEDAW.'",
        "'speaker_2': 'Since 1881, it has been the mission of AAUW to advance equity for women and girls. And we've been advocating in Long Beach since 1911 a long time. In 2010, our branch sent a resolution to the National Office of UW in support of CEDAW ratification in preparation for AAUW written testimony before the United States Senate Judiciary Subcommittee on'",
        "'speaker_2': 'Human Rights and the Law Hearing held on November 18th, 2010. We're here today still without national ratification, but with our AAUW Public Policy Action Statement still affirming our active participation in the U.N. Commission on the Status of Women and our commitment to ratification of the UN Convention on the Elimination of All Forms of Discrimination against Women or'",
        "'speaker_2': 'CEDAW. It's time for us to stop piecemeal inequity for half the populace. We've had the Suffrage Amendment, Fair Financing Laws, Title nine, which only applies in educational settings using federal funds. Women now allowed to be in most areas within the military and numerous attempts at pay equity.'",
        "'speaker_2': 'We tried to get the Equal Rights Amendment passed and we came so close, but it didn't happen. And even with the fact that numerous studies have proven that in communities where gender equity does exist, families are happier and healthier and businesses have stronger growth.'",
        "'speaker_2': 'Our 139 Long Beach branch members, women and men, are proud that our diverse and inclusive city, as you've pointed out, will be declaring for human rights, joining other large cities such as Los Angeles and San Francisco as early adopter role model in this growing grassroots initiative to ensure gender equity in the United States.'",
        "'speaker_2': 'City by city once and for all. Once CEDAW is implemented within our city based upon the CRC will be analysis. Long Beach will already have gender equity policies in place as California and the rest of the nation are still passing laws about gender equity.'",
        "'speaker_2': 'One by one, we believe that acceptance now of CEDAW is an act of a far sighted city council. Our branch members are 100% in support of this resolution before you this evening. Thank you for your time and your thoughtful leadership.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Any other public comment? Please come forward.'",
        "'speaker_4': 'Hello. Happy Women's History Month. My name is Zoe Nicholson. I live at 8.6 Coronado in beautiful Rose Park and Second District. If you drive past my house today, you will see a suffrage flag hanging, which I hung at one minute after midnight last night.'",
        "'speaker_4': 'Good evening, Mayor Garcia, Vice Mayor Lowenthal, council members, administrator, city citizens of Long Beach and in particular, I want to thank Councilmember Price for considering that Long Beach might become a city of Cedar. I've been active in the American women's movement now for over 50 years.'",
        "'speaker_4': 'In 1982, I sat on a folding chair for 37 consecutive days in the rotunda in the Illinois state legislature, passing on water only. I'm rather serious about equal rights, which, you know, the era never passed. And to this day, women are not included in the Constitution.'",
        "'speaker_4': 'I am a scholar on the Equal Rights Amendment and a consultant on the ERA. Thank you for allowing me to speak.'",
        "'speaker_3': 'Here in March.'",
        "'speaker_4': 'This is one of 32 days legislated when we get to actually talk about women. Women hold up more than half the sky. Women carry most of the water from the shore to the family. Across the globe, women bear, feed, clothe and educate the young.'",
        "'speaker_4': 'We care for the sick, the aging, the dying. And yet we are disposable, discarded, stoned, tortured, gutted of our sexuality, denied education. We are forced to marry at age 12. We die in early childbirth. We are denied reproductive autonomy.'",
        "'speaker_4': 'We are raped as a weapon of war. We are denied mobility up the corporate ladder and even driving a car. The U.S. ranks a poor 75th in women, in leadership in the world behind the likes of China, Nepal, Rwanda.'",
        "'speaker_4': 'When you have an opportunity like this, I am asking you to grab it, to carry it, to teach it, to be it, to do it, to behave as if it passed already. It is the work only of the most advanced, privileged people who have this astonishing opportunity.'",
        "'speaker_4': 'As electeds, you get to bypass the uncivilized behavior of the United States Congress and become a Cedar City. And I am here to ask you to lift the women of Long Beach and hear this global heartbeat to be a Cedar City.'",
        "'speaker_4': 'Your mother wants you to do this. The four grandmothers of all directions want you to do this. Please stand with me in the clear light of day and say you have protected their daughters worldwide and become a City FC.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. That was wonderful. I was like, spoken word almost. Thank you.'",
        "'speaker_5': 'Dear Mr. Garcia and City Councilwoman. City Councilman. Um, I'm here on behalf of a woman intercultural network which is national sponsor of cities for See the Campaign Convention on Elimination of All Forms of Discrimination Against Women adopted in 1979 by the U.N. General Assembly.'",
        "'speaker_5': 'This international treaty is often described as the International Bill of Rights for Women. The six U.N. member states that have not ratified and or acceded to the convention are Iran, polio, Somalia, Sudan, Congo and United States. Actually, U.S. has signed but never ratified Cedar City's first.'",
        "'speaker_5': 'See, there is a campaign to protect the right of women and girls by passing ordinances establishing the principle of CEDAW in cities and towns across United States. The campaign was launched at a meeting of the UN Commission on the Status of Women in 2013 by the NGO Committee on the Status of Women.'",
        "'speaker_5': 'And I was there when she there was cities foresee that was adopted that support the work of United Nations commission. On this status of woman. And support. And this says a woman and un woman. Many cities has already, as you as other people who spoke here shared that like san francisco and city of l.a.'",
        "'speaker_5': 'Has and washington has passed ordinances. As someone who has followed cedar for the last 32 years and have written extensively on the importance of CEDAW as a chair of Global Council Circles of Woman, Intercultural and Network that is Sponsor City for CEDAW nationally.'",
        "'speaker_5': 'A dream is coming true for me as a city, as a resident of Long Beach since 1974. And I never, ever thought that I would. See the day that the Cedar has been, you know, a resolution for being passed in our city.'",
        "'speaker_5': 'I want to thank Councilwoman Susie Price, which is for our district at the east side, of course, at Long Beach. And as we are embarking on a journey by passing a resolution. Thank you very much.'",
        "'speaker_1': 'Thank you very much. There's other public comment. Please come forward.'",
        "'speaker_2': 'Good evening, Mayor Garcia. Members of council.'",
        "'speaker_8': 'My name is Sonny Zia. I sit on the board of.'",
        "'speaker_5': 'Trustees, Alameda Community College District.'",
        "'speaker_2': 'My colleague Ginny.'",
        "'speaker_8': 'Baxter wanted to be here as well, but she couldn't, unfortunately, tonight. And I sent her support for this item. It's a great pleasure for me to be here in support of the resolution on the Convention on the Elimination of All Forms of Discrimination against Women.'",
        "'speaker_8': 'I want to thank you, Councilwoman Susie Price, for your leadership in proposing this resolution.'",
        "'speaker_4': 'Along with your fellow.'",
        "'speaker_8': 'Council.'",
        "'speaker_4': 'Woman. It is truly great.'",
        "'speaker_8': 'To see our leadership take meaningful action and support improving.'",
        "'speaker_2': 'The lives of girls and women.'",
        "'speaker_4': 'In Long Beach. Thank you for going beyond words of support and.'",
        "'speaker_8': 'Looking at finding ways that.'",
        "'speaker_4': 'To impact gender equity by way.'",
        "'speaker_8': 'Of conducting an analysis and assessing pathways to make.'",
        "'speaker_4': 'Change for the better good of all our community members. It is unfortunate to.'",
        "'speaker_8': 'See us fight for equity. 36 years after President Carter signed CEDAW and after the Lilly Ledbetter Act, I'm confident with leaders such as yourselves.'",
        "'speaker_4': 'We can.'",
        "'speaker_8': 'Transform our nation to do better in.'",
        "'speaker_2': 'Closing.'",
        "'speaker_4': 'This.'",
        "'speaker_8': 'Gap and not be placed in the bottom.'",
        "'speaker_4': 'With third world countries.'",
        "'speaker_8': 'Of severe who have severe human rights violations.'",
        "'speaker_2': 'Like Islamic Republic of Iran.'",
        "'speaker_4': 'And Sudan. We can do better. We must do better. I thank you for putting this item forward, and I appreciate your approval of the recommendation before you. Thank you.'",
        "'speaker_1': 'Thank you. Is there any other public comment? Please come forward. And is there any other public comment after this? This or last one? Oh, actually, we'll have the lady in the back. So let me actually go ahead. Yeah, go ahead, ma'am.'",
        "'speaker_1': 'Please go ahead. And I will do the lady in the back and then we'll close up. Thank you.'",
        "'speaker_4': 'Good evening, Mr. Mayor. And the Council. Women and men. My name is Ruchi Burman, and I am the chair of the CEDA task force in Orange County. But I'm also a harbor department employee, so it's my pleasure, with immense pleasure.'",
        "'speaker_4': 'I'm attending this meeting this evening, and I'm extremely happy that Councilwoman Suzy Pryce actually brought it to the city council meeting tonight. And I'm grateful to such a large Lowenthal, who I had met over a year ago, where we had talked about at the UN Women meeting or the conference where we had brought this up for the'",
        "'speaker_4': 'first time. So extremely grateful for this opportunity that we can hopefully pass this tonight. There's just one thing I would like to point out that the positive side of having a city solicitor adopted the city of San Francisco.'",
        "'speaker_5': 'When they adopted this in.'",
        "'speaker_4': '1998, they actually have dropped domestic violence cases, still down to 44%. So that is a huge positive side of having CEDAW in your city. So if, you know, not having that not having the reduction in crimes against women is not a big incentive.'",
        "'speaker_4': 'I don't know what is. So thank you and hope you pass this resolution tonight.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. And I take the the lady at the top there.'",
        "'speaker_5': 'Hi. My name is Sharon Cottrell. Can you hear me? And I reside at 2035 East Broadway, and I've been a resident of Long Beach since.'",
        "'speaker_2': 'The first week of September 1964. Many of you were born here and.'",
        "'speaker_5': 'I've been involved in community politics for many most of those years. Not always have. I've been proud of this city, but I feel very proud tonight.'",
        "'speaker_2': 'And we always are trying to count five on.'",
        "'speaker_5': 'The city council when we want something. The people have spoken approvingly. I think we have seven already votes. I am old enough that when the women's movement, when we first began to agitate, to do things, to stand up for ourselves and try to get rights, the consciousness raising, the.'",
        "'speaker_2': 'First now National.'",
        "'speaker_5': 'Organization of Women. And there was a movement to have women's commissions at City Council. And there was a woman. Gosh, your name?'",
        "'speaker_2': 'Just Renee Simon. And I can't quite remember.'",
        "'speaker_5': 'Whether Rene actually was maybe the first city council person. Or she was running for city council. But whatever it was, it was the consensus that she lost because she championed a women's commission. So I just wanted to tell you that to show.'",
        "'speaker_5': 'So that was the late sixties or the early seventies. Say, 47 years ago. So that's a ways we've come. And thank you very much.'",
        "'speaker_1': 'Thank you. Q We're going to we're going to take this back to to the Council before we do that. I just wanted to thank all of you that spoke that was that was really great testimony tonight. And we can all agree that women, quite frankly, make everything better.'",
        "'speaker_1': 'And I wish we had more women on on every body and in Congress and in corporate America. And it's good to see more women also at our universities now more than ever, which is which is really exciting. So thank you all that spoke.'",
        "'speaker_1': 'I'm going to turn this back over to Councilwoman Price.'",
        "'speaker_8': 'Thank you, Mr. Mayor. And thank you to everyone who came out and spoke tonight. I agree with the mayor that we had we heard some very powerful statements by the folks who spoke. And I'm really grateful for that.'",
        "'speaker_8': 'I neglected to mention that none of this would have been possible without my chief of staff, Julie Maliki, who worked really hard on this and really made herself a subject matter expert. That's that's kind of a big thing we do on our staff.'",
        "'speaker_8': 'Everyone becomes a subject matter expert on three or four topics, and she really became a subject matter expert on CEDA and knows more about the subject than I could that I could ever study or prepare for. So. And she actually, interestingly enough, sent me a a text that reminded me that she was so proud to see all'",
        "'speaker_8': 'the women here tonight. And she sent me a really sweet text about my grandmother and said, you know, she's smiling down at you tonight because my grandmother was a woman who was a single mom and the principal of a school at a time when women didn't even work and has really been a source of inspiration for me'",
        "'speaker_8': 'and my family. And my mom obviously worked until very recently as a single mom. And and I think, you know, I'm raising two boys. And the first time I took them to court with me in my my my day job, my oldest son, who was probably four or five at the time, there was a judge on the'",
        "'speaker_8': 'bench, a male judge, and he probably doesn't remember this. But my son turned to me and goes, Mom, they let men be judges too. Like the idea, like he had grown up seeing all these strong working women in his environment, that he was really surprised to see that a man could do the job.'",
        "'speaker_8': 'So so we've kind of changed things around a little bit. And, and I think my colleagues, as I sit here with my colleagues, I think they treat us as equals. We treat them as our equals. And, you know, I think we are very, very careful as a body, as we always should be, to be very respectful of'",
        "'speaker_8': 'the way that we talk to one another so that we shatter some of the stereotypes and gender narratives that we've been hearing for so much of all of our lives, and that we have a new approach to how we handle one another, even when we disagree.'",
        "'speaker_8': 'And I'm sure the men would agree that when we do disagree, the women always are the best arguers, for sure, but we do our very best to work with one another. And and I really appreciate the partnership that we have all built.'",
        "'speaker_8': 'So thank you very much, everyone, for being here.'",
        "'speaker_1': 'Thank you. That's true. That is definitely true. Councilmember Richard.'",
        "'speaker_3': 'I agree. I just wanted to chime in and just say this is an incredible, important resolution. And I sat back and listened to incredibly important and I listened to the lady who said, do it for your grandma. Do it for it.'",
        "'speaker_3': 'Right. And it moved me to speak up. I was going to sort of just kind of let this go because it was it was I'm obviously going to support this. This is a no brainer. But I felt the need and the urge to, you know, speak up.'",
        "'speaker_3': 'And honestly, you know, we are in a nation that values this, our first lady, as the Let Girls Learn initiative. You know, I'm watching Super Tuesday right now. It looks like we might have a woman in the White House pretty soon, not not campaigning at the dais, but I'm just saying when I'm watching on the news.'",
        "'speaker_3': 'But I think this is incredibly, incredibly important. Thank you so much for bringing this forward. And I've had a thoroughly good time watching this item.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'I think that Councilman Price brought to my attention that for the first time since I've been an elected official, I'm every female member of this council has a female chief of staff and actually the chief of staff. 14th floor is a super majority of women because even some of our male colleagues have women chiefs of staff.'",
        "'speaker_2': 'So I think that so maybe it's not a male dominated world, at least not here on the 14th floor of Long Beach. So thank you so much for all you've done to break those barriers to get us to where we are today.'",
        "'speaker_1': 'Excellent. Thank you. Thank you all again for coming. Great. Great resolution. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance designating the Alamitos Neighborhood Library located at 1836 East Third Street as a Long Beach Historical Landmark.  (District 2)": [
        "'speaker_3': 'Great.'",
        "'speaker_1': 'Thank you. Thank you all again. And Mr. NOW, Madam Kirk, item 13.'",
        "'speaker_2': 'And I'm 13 or 12. Item 12 Report from Development Services Recommendation to request the City Attorney to prepare an ordinance designating the Alamitos Neighborhood Library, located at 1836 East Third Street as a Long Beach Historical Landmark District to.'",
        "'speaker_10': 'Is there a staff report?'",
        "'speaker_2': 'Madam Vice Mayor, members of the City Council. I'm here to talk to you about a potential recommendation to designate the Alamitos Neighborhood Library as a Long Beach historic landmark. As you know, for the past year and a half, we have been putting a renewed effort on our historic preservation initiatives.'",
        "'speaker_2': 'And one of those initiatives is to look at landmarking opportunities for both city and for private properties.'",
        "'speaker_8': 'The City Council recently.'",
        "'speaker_2': 'Revised the historic ordinance to allow us to go through the landmarking process more efficiently. And this would be the first project that we would bring to you under that new, more efficient ordinance. So with your approval, we would set a hearing and come forward with an ordinance to landmark this location, which does happen to be in District'",
        "'speaker_2': 'two. Thank you.'",
        "'speaker_10': 'Thank you, Ms.. Burdick. And I wanted to thank the Cultural Heritage Commission for making this recommendation. This library is one of our jewels in Alamitos Beach. And I remember a celebration we had there for the library a few years ago, appreciating what a great piece of living history it is for the community and for the entire city'",
        "'speaker_10': '. If it hasn't already been highlighted, the Alameda Speech Neighborhood Library, I believe Ms.. Highlighted is the oldest remaining building in our library system. And that's something that gives me great, great joy to celebrate and be sure that we forward this for a successful action on the recommendation.'",
        "'speaker_10': 'And with that, I've made the motion. Councilwoman Gonzales, would you like to address it?'",
        "'speaker_8': 'I just want to congratulate staff and the Cultural Heritage Commission as well. This is wonderful. Thank you.'",
        "'speaker_10': 'Thank you. There's been a motion and a second. Is there any member of the public that wished to address Council on item 12? Please come forward and state your name.'",
        "'speaker_7': 'Very good. You click as it is. It's a superb idea and it should be passed. It's a great building, great asset to the to the district and and also to the city. Thanks.'",
        "'speaker_10': 'Thank you. Mr. Good. You. Members, please cast your vote.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 10.51, regulating the operation of electrically motorized boards in business districts in the City of Long Beach, read and adopted as read.  (Citywide)": [
        "'speaker_10': 'Thank you. Next item, please. Item 13.'",
        "'speaker_2': 'Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code Relating to relating. Regulating the operation of electrically motorized boards in business districts. Read the first time and lead over for the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_10': 'Councilmember Price.'",
        "'speaker_8': 'Thank you. I want to ask my colleagues to support this item. This is an issue of pedestrian safety in only the designated corridors that have been identified. And actually, I think we may add on to those tonight through the course of our discussions.'",
        "'speaker_8': 'But this is a really important safety issue for those business corridors that want to be pedestrian friendly and offer alternate areas for people on bike, skateboards and hoverboards to move in. It's just not safe to have them on the same sidewalks as the pedestrians.'",
        "'speaker_8': 'So I urge your support on this item. Thank you.'",
        "'speaker_10': 'Councilwoman Gonzales.'",
        "'speaker_8': 'Yes. I want to thank Councilwoman Price for bringing this forward and for the language from our city attorney. I do have a couple questions. There are a few areas listed. It does say business improvement districts, but it does not include, when you look at the details, Pine Avenue.'",
        "'speaker_8': 'Can we include that into this first?'",
        "'speaker_3': 'Reading the mayor or members of Council Councilmember Gonzales The answer is no. Unless we take it back and do a new first reading next week. What we could do is adopt it tonight and then do an amendment to this ordinance and add any streets or areas.'",
        "'speaker_3': 'And we could bring that back in a couple of weeks to add the Pine Avenue. If you have specific locations on Pine Avenue you'd like to add. But adding it tonight would I would bring it back as a new first reading next week.'",
        "'speaker_3': 'So it's the council's discretion on how would you like to handle that.'",
        "'speaker_8': 'Well, what would be I mean, what would be the I mean, we would just delay we're delaying it anyway.'",
        "'speaker_3': 'Well, no. If you move forward this evening with first reading as written, it would come back as second reading next week. And then within a week or two after that, we could bring back an amendment to this ordinance, adding the exact location or any of the other locations that council may want to add to this.'",
        "'speaker_3': 'So you could move forward this evening as is, and we will bring it back and we can talk to your staff and get the location and bring back an amendment to this ordinance right away.'",
        "'speaker_8': 'Okay. Can you do that, if that's okay with our motion of.'",
        "'speaker_10': 'I'm sorry?'",
        "'speaker_0': 'Yes, absolutely.'",
        "'speaker_8': 'Okay. Great. Thank you. And then I have another just quick question. I appreciate that. Thank you very much. City attorney and Councilman Pryce. I just know a lot of our Point Avenue residents are in downtown. Residents have been very concerned with skateboards.'",
        "'speaker_8': 'And, of course, this would add to that as well. And so we want to make sure that that's covered. So I appreciate that and look forward to that. My second question, though, is there have been some other like verbiage of of hoverboards, but I've even seen two wheels, self-balancing.'",
        "'speaker_8': 'Would that have any? I think there was something else. It was called an electronic scooter. So I don't know if that language specifically would need to be in that amendment later on just to ensure that people all know that we're covering the same thing.'",
        "'speaker_3': 'Yes, we've looked at the state legislation and there is a specific exemption for the Segway type vehicles. And that was asked that we include that exemption for Segways for the downtown specifically, but in other areas and also for those type of emblems that would or are used by mobility impaired folks that need assistance.'",
        "'speaker_3': 'Those would be allowed under this ordinance. But we believe that the definition meets the hoverboard description and we would. Yes. Based on the state.'",
        "'speaker_8': 'Perfect. Great. Thank you to answer my questions. I appreciate it. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Richardson.'",
        "'speaker_3': 'I'll be supporting this. I just have a question. As I just scan this ordinance, I see a number of areas called out. What are these areas? Many members of the council. These areas are identical to the existing ordinance where it is posted for these skateboards.'",
        "'speaker_3': 'And so these are the areas that are currently existing in our code that and as we just discussed with the councilperson for the First District. These obviously could be expanded to include other areas if the city council would desire to amend this at a future date.'",
        "'speaker_3': 'Well well, I just noticed that some of the new bids aren't represented, but I'm actually okay. Our business district hasn't asked for this. I'm okay with it as as it is. So it did. So to be clear, because our business district has Jordan High School right at the heart of it.'",
        "'speaker_3': 'And I wouldn't want to give any kids any tickets if a kid is riding down with a hoverboard down Atlantic in the Uptown Business District because it's not called out. That kid is not subject to this, am I correct?'",
        "'speaker_3': 'That is correct. They're not prohibited in that area. Thanks.'",
        "'speaker_1': 'Israeli public comment on this item. Please come forward.'",
        "'speaker_7': 'Don. Don are speaking again. I just want to reinforce what Councilmember Gonzales said. Pine Avenue is a very key business district. And so everything from eighth Street on down to Ocean Boulevard, actually Shoreline Drive, even the entire length of Pine Avenue should be included in there.'",
        "'speaker_7': 'I can understand why all the other business districts, but not Pine Avenue. So please, please do include that. Thank you.'",
        "'speaker_1': 'Who are these guys? Now you have to identify yourself for the record.'",
        "'speaker_8': 'Hello. My name is Kiana. I live in the third district. Second Street is a great place to walk around and shop and eat. But when people ride skateboards, invite bikes, it makes it unsafe for walkers, same as for the hoverboards.'",
        "'speaker_2': 'Please support this item and vote for it. I want to thank the smart and Pretty.'",
        "'speaker_5': 'Councilwoman Third District.'",
        "'speaker_2': 'For bringing this item.'",
        "'speaker_1': 'Thank you. Did your mom write that?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Do you want to say anything? Say something?'",
        "'speaker_5': 'No, she didn't write it.'",
        "'speaker_1': 'Oh, you guys are. You guys are so cute. And the other public comment.'",
        "'speaker_8': 'This is what happens when working moms don't have childcare.'",
        "'speaker_9': 'And excuse me, I know she didn't want it because they didn't talk long enough.'",
        "'speaker_2': 'And they didn't. And and that'll be all. There are no further questions.'",
        "'speaker_7': 'Larry, could you clear Cassie address. I'm not a skater, dude or into that world, but I've seen on the news, as most people have, some of these hoverboards exploding, catching the fire. I don't know if. What we're exploring here.'",
        "'speaker_7': 'What if you're covering those? I would certainly want to include in there any prohibitions. Bringing them into any public building. And or on public transit if they're subject to being exploding or catching fire, so forth. I think it's you've got to put the foot on the neck of that instantly and so forth.'",
        "'speaker_7': 'So if these if that type of device has would have a potential for exploding or catching fire, then it should be banned from the appropriate city office and all city facilities, I should think, and certainly on any Long Beach transit busses.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Public comment. CNN, please cast your votes. And then, Madam Clerk, please read the next item, please.'",
        "'speaker_2': 'Motion carries in. That concludes our regular today.'"
    ]
}