{
    "Adopt resolution determining that the proposed project is within the scope of the project previously analyzed as part of the Midtown Specific Plan Environmental Impact Report (State Clearinghouse No. 2015031034) and warrants no further environmental review pursuant to California Environmental Quality Act Guidelines Section 15162; and, approving a Lot Merger (LMG17-019) and Site Plan Review (SPR17-075) request to allow the construction of a new five-story 145,478-square-foot mixed-use building consisting of 3,938 square feet of commercial space and 102 residential units (101 affordable residential units) at 1795 Long Beach Boulevard, in the Midtown Specific Plan (SP-1).  (District 1)": [
        "'speaker_0': 'Thank you. So let's go ahead and pull up our first hearing. So hearing them hearing item number one.'",
        "'speaker_1': 'Report from Development Services. Recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt a resolution approving an amendment to Midtown's specific plan. Environmental Impact Report. Adopt a resolution approving a General Plan Amendment to amend the Land Use District Map by changing the designation of 13 properties to mixed uses.'",
        "'speaker_1': 'Adopt a resolution determining that the proposed project is within the scope of the project previously analyzed as part of the Midtown Specific Plan Environmental Impact Report and approving a lot merger and site plan review request to allow the construction of a new five story mixed use building at 1795 Long Beach Boulevard, District one.'",
        "'speaker_0': 'Thank you. And I understand there's no oath required that true? City Manager.'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'Okay. All right. So, Mr.. Mr. Modica, take us away.'",
        "'speaker_3': 'So, first off, Mayor Councilors, I do want to introduce our brand new first ever interim director of Development Services as this first ever meeting Tom Modica. Why, thank you, Mr. West. I'm happy to be here for this. You'll hear a staff report from Kari Tai, our current current planning officer supported by Oscar Orsi, our deputy director of'",
        "'speaker_3': 'development services. So take it away, Carrie.'",
        "'speaker_4': 'Thank you, Tom. Good afternoon. Honorable Vice Mayor Richardson and members of the city council staff has prepared a presentation that summarizes the staff report. If you so choose, we will proceed. This is a request for a general plan amendment to resolve inconsistencies between the Midtown specific plan and the general plan designation.'",
        "'speaker_4': 'Hang on.'",
        "'speaker_1': 'A minute. This on. I don't know.'",
        "'speaker_4': 'It's like, let's see.'",
        "'speaker_3': 'In the back. Can we please have the PowerPoint presentation? Not.'",
        "'speaker_4': 'Sorry. Technical difficulties. This is the general plan. Amendment request is also accompanied by a lot merger and a site plan review approval for a new mixed use project at 1795 along Beach Boulevard. Thank you. So on the screen, the red outline shows the development site, and that's at the southwest corner of Long Beach Boulevard and Pacific Coast'",
        "'speaker_4': 'Highway. The map is oriented where North is. This is actually facing west, so don't let that disorient you. And the general plan land use designation for the site is mostly in land use District seven, but part of it is in three B, which is residential only, and the development is a mixed use project.'",
        "'speaker_4': 'And there lies the inconsistency. So talk about the general plan amendment a bit. This area used to be what was called PD 29 plan development 29. That was the zoning and it was changed to the Midtown specific plan in 2016.'",
        "'speaker_4': 'The Midtown specific plan changed the way that we implemented zoning in this area. Namely, it's more of a form based code and uses floor area ratio. So in terms of the uses, like I mentioned, the project site is on the map here and you'll see it's outside of the hatched area that leaves or is not working.'",
        "'speaker_4': 'But the the rear part right behind the project site area is an area that's marked as a land use district eight A and that is for retail only. And then if you look under just to the vote below the text of the project site, there's Area three B, which is for residential only.'",
        "'speaker_4': 'And so you can see that those two don't allow for mixed uses. And so along with the project site, we want to clean up the rear part of the project site as well as a basically a comprehensive area because general plans we can't do parcel by parcel.'",
        "'speaker_4': 'And so the request here is to take all of that hashed area and make it part of land use District seven. And that will allow us to implement the Midtown specific plan the way it was intended to be implemented.'",
        "'speaker_4': 'For example, something that is under the allowable floor area ratio may be inconsistent with today's general plan. So in terms of the proposed building at 1795 Long Beach Boulevard, like I mentioned, the project is a project is five stories with 102 dwelling units, 101 of those are going to be affordable.'",
        "'speaker_4': 'The floor area ratio for this project is 3.4, where the Midtown specific plan allows for 4.0. So clearly that's under the Midtown specific plan also allows for ten storeys in this area. But this project is only five stories.'",
        "'speaker_4': 'However, if it were to go under the existing general plan designation of three B, that only allows 30 dwelling units per acre. And this has 101 over a project site that is just about one acre. And so that's that they're thereby illustrating the technical inconsistency there.'",
        "'speaker_4': 'With the general plan amendment approved, this project would be able to move forward. The project, like I mentioned, has 102 residential units. It also includes of a series of courtyards, common areas, balconies and amenities for the residents, as well as at that corner plaza there right at Pacific Coast Highway and Long Beach Boulevard.'",
        "'speaker_4': 'That would really establish a presence and identity right where right now there there lacks a character there. So this would essentially change the entire corner. So then just to summarize the environmental and project findings behind the request here briefly, the Midtown specific plan was accompanied by a certified programmatic environmental impact report.'",
        "'speaker_4': 'And now that it was always intended that the general plan designations would change along with that, however, as the Council was aware, the ongoing land use element effort that was anticipated to be completed and it was supposed to include the underlying properties for the Midtown Plan.'",
        "'speaker_4': 'However, since that has not been done, we are actually trying to comply with a mitigation measure out of the programmatic EMR, which required that these cleanup items be completed within one year of adoption. We're just over 18 months now, so we're just trying to get into compliance there.'",
        "'speaker_4': 'This would clean that up. An addendum was prepared for that program, air for the cleanup, and also the project itself had a separate environmental document that established consistency with the programmatic IIR. The general plan amendment that's proposed is internally consistent with the rest of the general plan.'",
        "'speaker_4': 'And also the findings for the lot merger and site plan review have been documented in your packet in accordance with the Municipal Code, the Planning Commission who the recommending body on this action met on December 9th, 2017 and recommended that the City Council approve this project.'",
        "'speaker_4': 'They conducted a public hearing as well and received a series of speakers in support. So lastly, for public noticing, for both the Planning Commission hearing as well as this hearing, public notices were sent out to a 1000 foot radius to property owners as well as occupants of that hashed area you saw on the previous slide.'",
        "'speaker_4': 'And the staff has not received any comments to date. So therefore staff recommends that the City Council concur with the planning commissions, recommend the recommendation to approve this project and that is articulated in the recommended action on the Council letter as well as the agenda.'",
        "'speaker_4': 'That concludes staff's presentation and the applicant for the development project is also in the audience. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. So that concludes. That's comments.'",
        "'speaker_4': 'Yes. Yes.'",
        "'speaker_0': 'Okay. So at this point, we're going to open it up for public comment on this hearing. Is there any public comment come forward? Saying none. I'm going to go ahead and close public comment, take it back behind the the rail.'",
        "'speaker_0': 'So the motion is made by Councilwoman Gonzalez. Do you have a comment?'",
        "'speaker_2': 'I just would like to say thank you to the staff as well as the developer. This is going to be a fantastic attribute to central Long Beach, especially on Long Beach Boulevard. We've been waiting for this for so long.'",
        "'speaker_2': 'So thank you very much for all of your collaborative work.'",
        "'speaker_0': 'Thank you. Councilman Brice.'",
        "'speaker_2': 'I echo that I did have a long list of questions for our interim development services director involving, you know, decades of work on his part. But I will refrain from those so we can get to the state of the city.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you. Because they would be very short answers.'",
        "'speaker_0': 'Thank you, Councilmember Supernormal.'",
        "'speaker_3': 'Thank you. I just had one question either for staff or maybe the developer. Was there any reference to the.'",
        "'speaker_0': 'Original use of this building? It's hard to tell now, but it was a Norm's restaurant, one of the.'",
        "'speaker_3': 'Real.'",
        "'speaker_0': 'Most elaborate one of their Googie restaurants. But no preservation, no preservation effort or anything, I guess. Convert Googie. Thank you.'",
        "'speaker_4': 'QUESTION Thank you for your question, Councilman. So you're not in evaluation of any existing project site staff always looks at the existing building on on site to see whether it qualifies for any type of status. And in this case, this did not meet any criteria.'",
        "'speaker_3': 'Okay, fine. Thank you.'",
        "'speaker_0': 'Thank you. Seeing no further comment. Members, please cast your vote.'",
        "'speaker_3': 'Hmm. Well.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item number two please.'"
    ],
    "Adopt resolution determining that the proposed project is within the scope of the project previously analyzed as part of the Midtown Specific Plan Environmental Impact Report (State Clearinghouse No. 2015031034) and warrants no further environmental review pursuant to California Environmental Quality Act Guidelines Section 15162; and, approving a Lot Merger (LMG17-015) to consolidate three lots into one lot on properties located at 1836-1852 Locust Avenue, in the Midtown Specific Plan (SP-1).  (District 6)": [
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution approving an addendum to the Midtown Specific Plan Environmental Impact Report. Adopt a resolution approving a General Plan Amendment to amend the Land Use District Map by changing the designation of 11 properties to mixed uses.'",
        "'speaker_1': 'Adopt a resolution determining that the proposed project is within the scope of the project previously analyzed as part of the Midtown Specific Plan Environmental Impact Report and approving a lot merger to consolidate three lots into one lot on properties located at 183621852 Locust Avenue District six.'",
        "'speaker_0': 'Thank you. Staff report, please.'",
        "'speaker_3': 'Thank you very much. Vice Mayor Cory Tai again will give a short staff report.'",
        "'speaker_4': 'Thank you. Hello again. This next item is extremely similar to the previous item and it's just the location is slightly to the north, but it's for the same story. And the only difference I'm going to in the interest of brevity, I'm going to skip forward a little bit.'",
        "'speaker_4': 'The site is the development site here is outlined in in red at 1836 to 1852 Locust Avenue. And there's there's Long Beach Boulevard there to the to the right of that. The green outline is what highlights the general plan amendment area.'",
        "'speaker_4': 'And again, the reason that we do more than just one parcel is that the general plan covers a cohesive area. And so we took the most logical boundary and our chain are proposing to change the underlying general plan designations to allow for implementation of the Midtown specific plan.'",
        "'speaker_4': 'The situation is the same where right now the underlying general plan land use allows is three B and eight A, those are the land use districts they allow for residential only or commercial only. And the midtown specific plan being a mixed use district is more suitable for a land use district seven, which is mixed use.'",
        "'speaker_4': 'And so that's what is being proposed to be changed. The project here is a bit different, is a smaller scale. It's 48 units and this would normally be approved. Actually, this is a site plan, review committee level approval.'",
        "'speaker_4': 'And so the site plan review committee can only effectuate an approval of this project if the general plan amendment is is approved. So again, this is under the allowable FFR of 4.0. This is a 1.95 and it is a five storey building, 48 units, 47 of which are affordable.'",
        "'speaker_4': 'And it also includes amenities and private open space for the residents. And again, the project does meet the project findings. The proposed general plan amendment was evaluated and an addendum to the midtown specific plan. Programmatic e.r. And found that no new impacts would be would result from this general plan amendment.'",
        "'speaker_4': 'There is a lot merger because the project site is made of several lots that need to be combined. Again, the Planning Commission did conduct a public hearing on this proposed general plan amendment on December 9th, and they recommended that the City Council approved this request.'",
        "'speaker_4': 'The public notice thing was sent out and just like the other project staff has not received any any comments on this. So with that, staff is recommending that the City Council concur with the Planning Commission's recommendation to approve this project.'",
        "'speaker_4': 'At this point, the applicant is in the audience and I staff can also answer any questions you may have. Thank you.'",
        "'speaker_0': 'Thank you. Is there any public comment on this hearing with the applicant, like the address, the council? Okay. So we'll close public? No. Okay. So we'll close public comment. Take it back behind the real Councilmember Andrews. Thank you.'",
        "'speaker_5': 'Thank you, Vice Mayor. Mr. B, I would just like to say again, we're starting to make this I-66 again look like Naples. You know, with projects like this, we can't go wrong. And I just want to say that General Plans is create an opportunity for more investments in the area.'",
        "'speaker_5': 'And it has my full support. You know, it needs to be I just want to let you know, this is high quality, affordable housing projects will serve and benefit the residents in that area. And I want to thank you again for bringing this project together.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you. And I'll just say, it looked like the image looked like three levels. So this is five levels. How does that work?'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'The front portion of the building is three stories.'",
        "'speaker_4': 'Because they wanted to.'",
        "'speaker_2': 'Conform to the current.'",
        "'speaker_1': 'Neighborhood and not over.'",
        "'speaker_4': 'Build, but the back to where the alley is. Five stories.'",
        "'speaker_0': 'Good, good. I really like that. That staircase and how it sort of you know, it doesn't look too massive in the front, but you still were able to build enough units. That's good. Good stuff. I just want to make a comment.'",
        "'speaker_5': 'Where's Mr. Beer?'",
        "'speaker_0': 'The applicant.'",
        "'speaker_5': 'Here.'",
        "'speaker_0': 'Is the applicant here. Would you like it? I think they want to hear from you.'",
        "'speaker_5': 'We got to hear from you. It's. But this is not good.'",
        "'speaker_1': 'If you insist. I'm Vanessa Luna. I'm the housing director of Clifford Bears Housing. And we're very excited to bring this development forward in Long Beach. Clifford Bears has other developments, affordable communities in Long Beach as well. And we love the city.'",
        "'speaker_1': 'There's a huge need for affordable housing, especially affordable housing, as we provide with services for residents. And we're really excited to see it happen and very happy to see the support in the community that has come forward for this development.'",
        "'speaker_1': 'And we're going to be working with community partners to provide services to the residents free of charge, have a property management onsite, reputable John Stuart Company who manages our other buildings. And so it's again, we're very happy to be building here.'",
        "'speaker_5': 'Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Members, please cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to accept a non-monetary donation of planning, labor, materials, and equipment, valued at approximately $100,000, from the Long Beach Community Foundation, a California nonprofit corporation, for the installation of a Sound Garden at Houghton Park; and execute a Right-of-Entry Permit, and any related documents, with Long Beach Community Foundation, and/or its agents, to make the improvements.  (District 9)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you, Adam. Ten, please.'",
        "'speaker_1': 'Report from Parks, Recreation and Marine. Recommendation authorizes City Manager to execute all documents necessary to accept a non-monetary donation of planning labor, materials and equipment valued at approximately 100,000 from the Long Beach Community Foundation and California nonprofit Corporation for the installation of a sound garden at Howden Park.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'Thank you. Let's have a staff report, please.'",
        "'speaker_3': 'Our Parks and Recreation Marine Director Marie Knight.'",
        "'speaker_1': 'Good evening, Vice Mayor and members of the Council. Yes, this is an exciting project that has been in the works for some time now and we're very happy to bring forward and a donation from the Long Beach Community Foundation for a sound garden at Houghton Park.'",
        "'speaker_1': 'This will be a unique play space for the community and for our children, and it will complement the upcoming changes and newly refurbished Highland Park Community Center in the future. So we're excited to get moving with this and with the council's blessing.'",
        "'speaker_1': 'I know the foundation is very supportive and looking forward to this as well.'",
        "'speaker_0': 'Thank you. And I just want to take a moment just to say thanks to Marie for helping us to work this work this out, and thank you to the foundation for your philanthropy and for working with us. This project has been scoped in a way that it complements the Highland Park Master Plan.'",
        "'speaker_0': 'It will complement, like Marie said, the new Highland Park Community Center that's going to break ground with next month. And so this is really exciting stuff, but it's 100% philanthropy. So. So I just want to say. Thank you, Councilman Price.'",
        "'speaker_2': 'I support this and I think it's going to be great.'",
        "'speaker_0': 'Thank you. Members, please cast your vote. Any public comment on this item? Seeing the members. Please cast your vote.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a Public Walkways Occupancy Permit with sidewalk extension parklet for sidewalk dining at Pine Avenue Parklet, located at 440, 450, and 454 Pine Avenue.  (District 1)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item 11 Please.'",
        "'speaker_1': 'Report from Public Works recommendation to authorize a city manager to execute a public walkways occupancy permit with sidewalk extension parklet for sidewalk dining at Pine Avenue Parklet located at 440450 and 454. Pine Avenue District one.'",
        "'speaker_0': 'Thank you. Staff report.'",
        "'speaker_3': 'Please. Deputy Director of Public Works, Sean Crombie. Good evening, Honorable Mayor Council. Item 11 on the agenda is a request to approve a parklet within the sidewalk dining program at the addresses of 440450 and 454 Pine Avenue. The PARKLET program is in place to allow restaurants to occupy a portion of the public right away for seating that'",
        "'speaker_3': 'has multi benefits to the community, in that it provides extra seating for the restaurant, but it also activates space within our public right away. It's been a very successful program. This particular parklet is a little bit unique, first of its kind, because it's the first parklet that's shared between between three different businesses, shared space.'",
        "'speaker_3': 'So with that, I'm available to answer any questions that you have.'",
        "'speaker_0': 'Thank you. Councilwoman Gonzalez.'",
        "'speaker_2': 'I just wanted to acknowledge Tony Shoshone, who's here. He's really worked very closely with public works, as well as our office in revitalizing what was formerly known as City Place, which is now the street. So I thank you, Tony, as well as Shawn, Crumby and Public Works.'",
        "'speaker_2': 'Thank you for working through many of our parklet questions. We look forward to continuing our work together.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Pierce.'",
        "'speaker_1': 'Also the same. Congratulations. You guys have really helped transform our downtown and so thank you for all the work and always things to stop for thinking outside of the box on our PARKLET program.'",
        "'speaker_0': 'Thank you. Public comment on this item. Seeing nonmembers, please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. So at this time, we're going to go to public comment on non agenda items. We have only three. I think folks want to get to the state of the city tonight. So we have Harold Ara Boesky.'"
    ],
    "Recommendation to request City Manager to work with appropriate staff to report to Council within 30 days on a potential MOU executed between public safety and Water and Gas Departments. Public safety enterprise fund services and weighted costs must be addressed appropriately by all departments.": [
        "'speaker_0': 'Thank you. That concludes public comment. So we'll move forward now to item number 18. I see that.'",
        "'speaker_1': 'That's Glenn Communication from Councilwoman Mango Council member Super Non Councilmember Urunga. Recommendation to request the city manager to work with appropriate staff to report to council within 30 days on a potential EMU executed between public safety and water and gas departments.'",
        "'speaker_0': 'Thank you. I know this item is really important to Councilmember Mongeau, but she's stuck in jury duty, so I'm going to ask that we just continue this, the next city council meeting. So is that is that your second super mystery winner?'",
        "'speaker_0': 'Yeah. I don't think we have a choice, unfortunately. Well, we do have a choice. We take the item, but I think the good thing to do would be to continue it and not the special meeting tomorrow, the next regularly scheduled city council meeting.'",
        "'speaker_0': 'Is there any public comment on that motion saying non members, please cast your vote?'"
    ],
    "Recommendation to declare an interim ordinance adopted as an urgency measure establishing a temporary one hundred and eighty (180) day limitation on the issuance of any permit, entitlement, license, approval, operation, or activity relating to adult use non-medical commercial cannabis activity in the City; and declaring that this ordinance shall take effect immediately, read and adopted as read.  \n(Ordinance No. ORD-17-0030)  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Number 20, please.'",
        "'speaker_1': 'Communication from City Attorney. Recommendation to declare an interim ordinance adopted as an urgency measure. Establishing a temporary 180 day limitation on the issuance of any permit relating to adult use, non-medical commercial cannabis activity in the city, and declaring that this ordinance shall take effect immediately.'",
        "'speaker_1': 'Read and adopted as read citywide.'",
        "'speaker_0': 'Thank. Thank you. And just to clarify, this is Mr. West. This is what we requested back in December to give us time to craft an ordinance. Correct. This is the past, Mr. City Attorney.'",
        "'speaker_3': 'That is.'",
        "'speaker_0': 'Correct. Thank you. Second reading. Thank you. Any public comment on this?'",
        "'speaker_3': 'Stephanie Dawson, Sue of Second District. Again, we had no opposition to this particular ordinance other than just as a reminder that 13 out of the 16 stores in Santa Ana were able to open their doors on January 1st and offer adult use cannabis.'",
        "'speaker_3': 'Additionally, Bell, Bellflower, Lynwood and Maywood are all coming online within the first quarter of this year. All of them are going to be issuing adult use commercial licenses at a lower tax rate than the city of Long Beach.'",
        "'speaker_3': 'Again, that if that doesn't prompt a sense of urgency within the city, within the city, as a means to be able to get us to the point where we can open these businesses and have these consumers coming to our city and spending their money inside of our city.'",
        "'speaker_3': 'I don't know what else could help additionally with if there are any overwhelming concerns within the city with regards to the revocation by the Justice Department for the Cole memo, I just want to again take solace in the fact that Kamala Harris, Jerry Brown, Gavin Newsom, Xavier Becerra, Kevin de Leon and Alan Lowenthal all issued statements saying'",
        "'speaker_3': 'that they will be they will be fighting to be able to protect us as a city from any particular federal intervention that might come from this administration. And finally, just one final reminder. This year is an election year Long Beach measure impasse with all of your districts by a pretty healthy margin, as well as Proposition 64, by'",
        "'speaker_3': 'an even healthier margin. So, again, respecting the this particular ordinance, but at the same time, please hurry up.'",
        "'speaker_0': 'Thank you. Next speaker, please. Larry King, longtime resident in the seventh District and soon to be hopefully dispensary operator in the ninth District. Happy New Year, everybody on the council. And I'd also like to everything Stephane said, but I'd also like to remind you that it was in the original ordinance that.'",
        "'speaker_3': 'Won an election that made provisions for.'",
        "'speaker_0': 'Recreational as well as tax provisions which are substantially higher than medical.'",
        "'speaker_3': 'And I could tell you from the.'",
        "'speaker_0': 'Few operators that are operating.'",
        "'speaker_3': 'Presently, they're turning away 80 to 100.'",
        "'speaker_0': 'I don't want to say patients anymore. 80 to 100 customers at the door that.'",
        "'speaker_3': 'Don't know that they don't have a recreational adult use.'",
        "'speaker_0': 'So they're lined up and then they're turning them away. They're turning away an average of 80 to 100 a day. So that's a lot of tax dollars. We've made it this far.'",
        "'speaker_3': 'We're this close. The city is going to do all right by taxation again.'",
        "'speaker_0': 'I think we need to get going on recreational.'",
        "'speaker_3': 'Or we're losing too much business to the other cities. Thank you.'",
        "'speaker_0': 'Thank you. Members, please cast your vote.'"
    ],
    "Recommendation to authorize the City of Long Beach to sign an Amicus Brief in support of the American Federation of State, County and Municipal Employees, Council 31 in the matter of Janus v. American Federation of State, County, and Municipal Employees, Council 31 (United States Supreme Court).": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Moving right along. I don't. Number 21, please.'",
        "'speaker_1': 'Communication from Mayor Garcia. Councilwoman Gonzalez, Councilman Andrews, Councilmember Urunga, Vice Mayor Richardson. Recommendation to authorize the city of Long Beach to sign an amicus brief in support of the American Federation of State, County and Municipal Employees Council. 31 In a matter in the matter of Janice versus AFSCME Council 31.'",
        "'speaker_0': 'Thank you. I'm going acknowledge Councilman Austin and.'",
        "'speaker_6': 'Yes, thank you, Mr. Vice Mayor. I'm going to have to recuse myself because I do work for the AFSCME. And so, yeah, I work as myself and I'll be back shortly.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you. So I had a conversation with Mayor Garcia about this item. And this is an issue that many of the many of us have tracked for years. And it's the it's an attack on a fundamental, fundamental public sector sort of standard called agency shop.'",
        "'speaker_0': 'And that's in question at the Supreme Court. And so agency shop essentially ensures that all employees, no matter whether you sign a union card or not, you are entitled to the benefits of whatever that contract is. So if if there's a contract that says we're getting out raises that ensures that whether you sign a union card or'",
        "'speaker_0': 'not, you're entitled to those rate wages because you have you sort of have been you are entitled to that right. As a part of that bargaining unit. And so public sector governments have been sort of built around this and, you know, over the years.'",
        "'speaker_0': 'And it would fundamentally change giant change the employer employee relationship should this this Supreme Court decision go go a certain way. And so this motion is the request that the city of Long Beach go ahead and participate in the amicus brief, which allows us to give our perspective on the issue.'",
        "'speaker_0': 'And so that's the motion. I'm fully supportive here. And so next I'll hand it to Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes. I, too, want to thank Mayor Garcia for bringing it forward. I'm also in in staunch support of our members that ask me, and I look forward to seeing what comes next. But I certainly support this. And thank you.'",
        "'speaker_0': 'Thank you, Councilman Andrews. Yes.'",
        "'speaker_5': 'Yes. Thank you, Vice Mayor. I also support the mayors, you know, for bringing this item forward, because I would like to say that this is an incredibly important case for local rights and workers rights. You know, this city should be able to negotiate with these workers without interference.'",
        "'speaker_5': 'You know, our system has had their system here. Long Beach has worked successfully, and you shouldn't fix what hasn't been broken. So I'm proud to support this idea and I will keep Long Beach locally managed and organized. So I want to thank the mayor again for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilmember Anurag.'",
        "'speaker_3': 'As a son of a long time union member and brother of Teamsters members as well. I think that support of this measure is very critical to the continuation and strength of unions in the country. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_2': 'Thank you. I, too, want to support this item and thank my colleagues for bringing it. I've been a member of a public employee union for 19 years, and during that time I've held leadership positions in my union. And I know that the amount of work that goes into the negotiations that union leaders engage in benefits all employees'",
        "'speaker_2': ', whether they're actually participating in the union actively or not. Therefore, I think costs should be compensated and that it's only fair that we have this practice be allowed to continue. So thank you.'",
        "'speaker_0': 'Thank you. Is there any public comment on this item saying no members, please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'All right. So before we move on to our second public comment, I'd like the Mississippi city attorney. I'd like to recall the item that we we continue. So I want to move to reconsider that. A motion.'",
        "'speaker_3': 'To reconsider is in order for.'",
        "'speaker_0': 'That item. So I move to reconsider the item.'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'Well, I don't think you can second this. Got it. Okay. Councilman super knocking. So I'll move in second. The reconsideration. We have to vote on reconsideration before we have to take public comment.'",
        "'speaker_3': 'And vote on the motion to.'",
        "'speaker_0': 'Reconsider. Okay. So it won't show up on here, but the motion is myself and Councilmember Suber not. Is there any public comment on the motion to reconsider? Item number 20, which was the item 18, item number 18 saying no public comment.'",
        "'speaker_0': 'Members cast your vote on on the reconsideration of item 18.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Item set, please read item number 18, please.'",
        "'speaker_1': 'Communication from Councilwoman Mongeau Councilmember Super nor Councilmember Urunga recommendation to request the City Manager to work with appropriate staff to report to council within 30 days on a potential MRU executed between public safety and water and gas departments.'",
        "'speaker_1': 'Councilmember Mongo Thank you. I feel like this is a great time for us to look at all of our options related to how things fit together. I appreciate my colleagues for at first choosing to delay this as I was at jury duty and under the judge's direction, unable to leave the courtroom until I could come here as'",
        "'speaker_1': 'fast as I could. So thank you for that. It means a lot that we take a hard look at the options available in terms of properly accounting for how our services are allocated and paid for. And so I appreciate all of those who will support this item, and I firmly ask for their support.'",
        "'speaker_0': 'Thanks. And I'll just I'll just add, I think it's important that we continue to review since we are a large, dynamic city and we have enterprise funds in different enterprises that operate differently, that we do regularly update this because we want to make sure that all of them are staffed correctly in public state from a public safety'",
        "'speaker_0': 'standpoint, and that our public safety folks recoup those costs. So I stand in support, and even though I'm not a signer on this, I stand to support Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes, I support this as well. I think Councilmember Mongo for bringing it forward. I just have a couple questions. Although I don't see the chief here. Is he not here?'",
        "'speaker_0': 'Which chief?'",
        "'speaker_1': 'Chief? Three.'",
        "'speaker_0': 'I thought we would move this item. Okay.'",
        "'speaker_2': 'Never mind. Well, then I will hold my questions for later. But that's okay. Thank you so much for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_1': 'Yeah, I had a couple of questions too, but it's something I'm fully in support of. I've talked to both our chief and some of our firefighters and also looking at making sure that across the board. Here we go.'",
        "'speaker_1': 'I'm going to give it back to Leena. Then I'm going to let Lena Councilmember Gonzalez ask her questions first. Yes. Sorry we pulled you back in.'",
        "'speaker_2': 'Thanks, Chief. Just a couple of questions relative to this item. Do we currently have any existing employees of fire and other departments?'",
        "'speaker_3': 'Vice Mayor, Councilmembers? Yes. As a matter of fact, the fire department has employees in place with both the harbor department and the airport currently. Yes.'",
        "'speaker_2': 'Okay. And then do we have I know that there was a I don't know if it was on the 2013 to 2014 agenda item that covered the same topic. Is there an update to that?'",
        "'speaker_3': 'Councilmember I don't have an update to that. I know this this topic has come up in the past, but we could go back and pull the data on that and find out where that stands today.'",
        "'speaker_2': 'Okay, great. Thank you. Those are my questions. I appreciate it.'",
        "'speaker_0': 'Councilmember Pierce, you're back up.'",
        "'speaker_1': 'Thanks. I was going to ask about how many enterprise funds are not included currently. Is it just the ones that are listed in the agenda item? Sorry. Should be.'",
        "'speaker_0': 'I think we're I think the gentleman asked for a report back. Right.'",
        "'speaker_1': 'Okay. So I my question was to point out which enterprise funds do not currently partner with fire or PD to put money back in directly for that area. So I know like with the airport, those funds go directly back to the airport.'",
        "'speaker_1': 'And are there other departments that those funds do not go to? So I look forward to the report back and understanding more which which areas of the city we might be able to have an opportunity to support our critical services.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Grant.'",
        "'speaker_3': 'Thank you, Vice Mayor. I see this as an excellent opportunity for some cost recovery that are very apparent, does a lot for other departments when they go out and they fix things or stop fires or doing whatever it is for other departments, and I think that they should be compensated for and they should be able to recover'",
        "'speaker_3': 'some of those costs. So I'm fully supportive of this item.'",
        "'speaker_0': 'Thank you. Councilmember Andrew.'",
        "'speaker_5': 'Yes, thank you, Vice Mayor. I'd like to thank our councilwoman, Mrs. Mango, for bringing this item forward, because I can remember back in the past, about 2013, this was a common sense measure, and I share that we would have taken care of this in the years since.'",
        "'speaker_5': 'But they're here. We are here again. You know, these enterprise activities must be sustainable in their own right. And with our city financial forecast to experience an increased strain in the coming year, we must act appropriately. This is a responsible budget allocation management, just like any family or small business, and we must pursue it.'",
        "'speaker_5': 'And I want to thank you again for bringing this forward, Mrs. Blanco.'",
        "'speaker_0': 'Thank you, Councilmember Sabrina. Thank you. The language of this item indicates a 30 day response time. So I just like like to ask city staff if they're.'",
        "'speaker_3': 'If they see any impediment to getting back to us within 30 days. We certainly can report where we are in 30 days. No worries.'",
        "'speaker_0': 'No worries. Okay. No worries. Thank you. Thank you. Any public comment on this item? Okay, well, I'll take it back behind the rail. Councilman Mongo.'",
        "'speaker_1': 'In consideration that this is a continuation of something that's been discussed quite extensively in the last several weeks.'",
        "'speaker_0': 'Years?'",
        "'speaker_1': 'Well, even more extensively over the last several weeks. You said you'd report back on where you are. Do you or do you have any hesitation of meeting the 30 day deadline?'",
        "'speaker_3': 'We won't know. And we'll get into it. We'll look back at the reports that we had in 20 1314. And if we can't come back with a final solution to bring to the council in 30 days, we certainly will report to the council where we are and when we expect to come to conclusion.'",
        "'speaker_1': 'Then let's you and I check in at 14 days to make sure that we're on time.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. See you. No further public comment. Members, please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. I think it's record, guys. All right. We're moving on to our second public comment. Any members of the public would like to address the city council? I was saying none. We'll go ahead. And you? Well, it's on the wrong screen.'"
    ]
}