{
    "Recommendation to increase appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by $576, offset by First Council District One-time District Priority Funds transferred from the Citywide Activities Department for the 2020 Da De Los Muertos Celebration; and   Decrease appropriations in the Special Advertising and Promotion Fund Group in the Citywide Activities Department by $576 to offset a transfer to the City Manager Department.": [
        "'speaker_3': 'Okay. Thank you. Let me do 15 and 16 together briefly.'",
        "'speaker_0': 'I am 15 is communication from Councilwoman Sunday has Councilwoman Allen recommendation to increase appropriation in by $576 for the 2020 DIA de los Muertos celebration and item 16 is a communication from Councilwoman Sunday has Councilwoman Sara. Recommendation to increase appropriation by twins for the 2020 holiday Posada virtual celebration.'",
        "'speaker_3': 'Okay. I have a most of my concerns that they have since second by Councilman Allen. I don't think there's any public comment on this. Correct?'",
        "'speaker_0': 'No public comment.'",
        "'speaker_3': 'Okay. Unless the objection will go to a roll call, vote on these items.'",
        "'speaker_0': 'Councilwoman Sun has. Hi, Councilman Allen.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Price. Councilman Sabina.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman. Mongo. I turned to them in zero.'",
        "'speaker_1': 'Nine.'",
        "'speaker_0': 'Council Member Ranga.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_0': 'Councilman Austin. That's when Austin Vice Mayor Richardson All right. Washing cars.'"
    ],
    "Recommendation to respectfully request City Council approval of the 2021 State Legislative Agenda as recommended by the State Legislation Committee.": [
        "'speaker_3': 'Thank you very much. Let's go ahead and do item 29, please, briefly.'",
        "'speaker_0': 'Item 29 is a communication from Vice Mayor Richardson. Chair of the State Legislation Committee recommendation to approve the 2021 state legislative agenda as recommended by the State Legislation Committee.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson. I have a motion I have a second about Councilman Price. Just quick remarks. Vice Mayor, briefly, chair is updated.'",
        "'speaker_2': 'Our State Pledge Committee agenda to reflect two things. Notably, if you folks probably remember the State Lands Commission came down during measure us and talked about the legality of state lands when we take action and we committed to engaging in a discussion with them and you'll see that reflected here that we're going to continue that that discussion'",
        "'speaker_2': 'with state lands and try to find some resolution to some of the discussions have been positive, but we're going to try to try to continue to ensure that staff has the ability to continue those discussions. And it also just updates recommendations from the Racial Equity Reconciliation Initiative, which is just a big theme of the city council meeting'",
        "'speaker_2': '. So those are two things to note. Thank you.'",
        "'speaker_3': 'Councilman Price, anything?'",
        "'speaker_1': 'Yes. I do have something I'm trying to find the exact language for. I believe it is on page three. There is a reference here or somewhere in there. I saw it in regards to the Tidelands Fund. I was wondering if maybe Councilman Richardson or the city manager, whoever has been involved in this conversation, could talk a little'",
        "'speaker_1': 'bit more about that.'",
        "'speaker_2': 'Sure. Sure. This is vice mayor. So so there's there were questions about supporting ongoing collaboration with state lands. And so we just wanted to make sure we reflected so. So there's a link, a line to support ongoing collaboration with State Lands Commission and the state legislature to support new funding options and supports the priorities.'",
        "'speaker_2': 'It also is intentionally vague because it keeps it keeps it doesn't call out titles. It talks about state lands, pipelines, port, upland, all of those state lands. And so we just, you know, it's intentionally vague and offers an opportunity for our government affairs team to engage with state lands who brought forward this issue and continue discussions.'",
        "'speaker_2': 'But that's generally what it is.'",
        "'speaker_1': 'Okay, that sounds good. Thank you for that clarification. My only request would be as part of this motion that it is city staff that's engaging in those discussions. And to the extent that any of the enterprise funds uses the limitations of those funds as discussed, the council members from those districts be included in those discussions.'",
        "'speaker_1': 'So that's my only request.'",
        "'speaker_2': 'But I'm not sure that the state lands agenda dictates who's a part of it. I know they're changing who the committee members are, so I would just have that conversation with the mayor about making sure that I'm sure you'd have a seat at the table.'",
        "'speaker_2': 'But also, I would just say that staff is very good at making sure they protect the city's interests, parklands, all of those things. And so as they continue discussions, that's always the priority. So perhaps just say, you know, make sure that our interests are protected and stakeholders are engaged or something like that.'",
        "'speaker_2': 'That's I think that's.'",
        "'speaker_1': 'Really great, really great suggestion on what language I could use. Maybe I can just turn to the city manager. So let me ask the city manager. Have the discussions with state lands thus far included council members, specifically our city staff?'",
        "'speaker_4': 'So this is just in its infancy. This was an idea that was kind of floated and discussed as part of Measure U.S.. That kind of started with some council discussion and staff are getting plugged into that. So there has not been any type of formal negotiations or discussion on this.'",
        "'speaker_4': 'This is really something that we're asking for your direction on. And then staff would be taking that lead role in having that discussion.'",
        "'speaker_1': 'Okay. And when you say it started with council and staff was looped in, what does that mean?'",
        "'speaker_4': 'I think the vice mayor was speaking to that, that this is an item that he had had some initial discussion with on state lands, and then that he asked staff to, you know, start taking it over. So that's kind of the process that we're in place.'",
        "'speaker_1': 'And staff would be taking it over at this point. Not even the State Lodge Committee, but staff, correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Great. Thank you. I think just just to add to that, too, I think all of our pledge committee at the end of the day, the state led committee and our positions are managed by the staff. And so I think that the staff will be able to regularly update the full council as to the progress of the committee'",
        "'speaker_3': '. And I know there's a lot of members, so I appreciate the conversations and of course everyone is interested in the outcome of all these issues. So thank you for that. And please do a roll call vote unless there's any to.'",
        "'speaker_3': 'I don't I don't have any public comment to you.'",
        "'speaker_4': 'Yes, we have. Dave Shukla.'",
        "'speaker_2': 'Good evening. Despite the expressed support for this item and for the update of many of the changes that were made over the past few weeks, including to me to get more precise about the states obligation for future cleanups with the olive oil.'",
        "'speaker_2': 'And just as a general point, as we saw earlier this afternoon from the study session on reconciliation initiatives that went wrong, a lot of these issues that are local control, that are economic development, that are sustainable and livable and predictable or whatever city reduce down to the same sex relationships between the same handful of players.'",
        "'speaker_2': 'And to what degree the public does or does not have access to the implications of those decisions. Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for the roll call.'",
        "'speaker_3': 'But please.'",
        "'speaker_0': 'Councilwoman Sun has.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Councilwoman Ellen. I cancel them in price. I had some insurance.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Mongo. I as a woman.'",
        "'speaker_1': 'Zero I.'",
        "'speaker_0': 'Council member muranga.'",
        "'speaker_5': 'High.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to authorize final reconciliation payment to SMG/ASM Global under Management Agreement No. 21667 for operational expenses for Fiscal Year 2020 (FY 20) at the Long Beach Convention and Entertainment Center (Convention Center), due to COVID-19 pandemic impacts;  Authorize an advance of payment expected to be owed under Management Agreement No. 21667 to SMG/ASM Global for operational expenses for FY 21 at Convention Center, due to COVID-19 pandemic impacts; and  Increase appropriations in the Tidelands Operating Fund Group in the Economic Development Department in the amount of $3,900,000, offset by funds available and/or reserves to cover the FY 21 operational deficiency of the Convention Center.  (District 2)": [
        "'speaker_3': 'I mean, it's in place.'",
        "'speaker_1': 'Item 18 is a.'",
        "'speaker_0': 'Report from Economic Development. Recommendation to authorize final reconciliations payment to SMG s m global for operational expenses for fiscal year 2020 at the Convention Center due to COVID 19 pandemic impacts district to.'",
        "'speaker_3': 'I got a motion in the second place. Motion by your anger is taken by customers and they have a very public comment.'",
        "'speaker_0': 'No pop a common.'",
        "'speaker_3': 'Okay. Without any objection, we'll go ahead and go to a roll call vote.'",
        "'speaker_0': 'Councilman Sun has.'",
        "'speaker_1': 'All right, Councilwoman Allen.'",
        "'speaker_0': 'All right. Councilwoman Pryce, I sentiments have been asked.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council Councilmember Oranga.'",
        "'speaker_5': 'By.'",
        "'speaker_0': 'Councilman Austin. And Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'"
    ],
    "Recommendation to approve the Fiscal Year 2020 third departmental and fund budget appropriation adjustments in accordance with existing City Council policy.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you. Item 19, please.'",
        "'speaker_0': 'Item 19 is a report from financial management. Recommendation to approve the fiscal year 20/23. Departmental and Fund Budgeted Appropriation Adjustments. CDI.'",
        "'speaker_3': 'I get a motion in a second place. Motion by Councilman Zero, second by Councilwoman Price. Is there any public comment on this item?'",
        "'speaker_0': 'No public comment.'",
        "'speaker_3': 'Rock over, please.'",
        "'speaker_0': 'And so Vinson Day has. Councilwoman Ellen.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Price. An announcement webinar by Councilwoman Mongo. I am two women zero.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council member muranga.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Councilman Austin. All right, Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_3': 'Thank you very much. 21.'",
        "'speaker_0': 'Item 21 is a report on Parks, Recreation and Marine recommendation to receive and file report on the Hamilton Loop Vision Plan District nine.'",
        "'speaker_3': 'Actually, there's a prize there, a presentation on this. If there is, we're going to go to another item.'",
        "'speaker_4': 'There is, if you'd like to see it.'",
        "'speaker_3': 'I think I think I'm sure Vice Mayor Richardson probably wants to see the presentation. So why don't we just go back to the ones about presentations? I didn't want it to. Please.'",
        "'speaker_0': 'Item 22 is a report from Parks, Recreation and Marine. Recommendation to increase appropriations contingent upon executed grant agreements in the Public Works Department and Parks, Recreation and Marine Department for various park improvement project. And for grant administration and decrease appropriation in the Parks Recreation Submarine Department as a technical correction for grant administration cause citywide.'",
        "'speaker_3': 'He comes home, is in the house. Can I get a second, please? Second baseman Richardson. Is there any public comment on item 2022?'"
    ],
    "Recommendation to authorize City Manager, or designee, to submit applications to the Los Angeles County Regional Parks and Open Space District (RPOSD) for guaranteed grant funding under the Community-based Park Investment Program (Category 1) and the Neighborhood Parks, Healthy Communities, and Urban Greening Program (Category 2) for Chavez Park Roof Repair, Drake Chavez Expansion Design and Entitlements, Drake Park Community Center Rehabilitation, Peace Park Playground Construction, Long Beach Greenbelt Design, Wardlow Park ADA Improvements, MLK Park Community Center Improvements, Willow Springs Park Wetlands Expansion Design, Silverado Park Community Center Upgrades, Houghton Park Clubhouse Restoration Design, Houghton Park Playground Design, DeForest Park Playground Design, 51st Street Greenbelt Design, and Scherer Park Community Center Improvements (Projects); when grant documents are executed, accept an amount up to $2,434,863;   Increase appropriations contingent upon an executed grant agreement with the RPOSD, in the Capital Projects Fund Group in the Public Works Department": [
        "'speaker_3': 'Okay. Thank you. Item 20 E. Which 23, please?'",
        "'speaker_0': 'Item 23 is a report from Parks, Recreation and Marine recommendation to submit application to the Los Angeles County Regional Parks and Open Space District for guarantee funding. Increase appropriation in the public purse in the Public Works Department and Parks, Recreation and Marine Department for the Projects and Grant Administration Citywide.'",
        "'speaker_3': 'Okay. I have a I have a motion and a second. Can I please get a, you know, public comment, a motion by I think this is councilmember. Aston Martin and a second by Councilwoman Sarno. I think that's gone from the last one.'",
        "'speaker_3': 'Councilman Robson. Councilman sorrow roll call votes which.'",
        "'speaker_0': 'Councilwoman Sun House.'",
        "'speaker_1': 'All right, Councilwoman Allen.'",
        "'speaker_0': 'Hi, Councilwoman Price. Sky Councilmen. Sabrina High Councilwoman Mango II. Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_6': 'Hi.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Subsections 8.120.010.D, 8.120.020.B, and 8.120.040; and amending and restating Section 8.120.030; all relating to temporary enforcement of Long Beach Health Orders related to COVID-19; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Citywide)  (Emergency Ordinance No. ORD-21-0003)": [
        "'speaker_0': 'Vice Mayor Richardson. Vice Mayor Richardson, motion carries.'",
        "'speaker_3': 'Okay. Thank you. Item 25, please.'",
        "'speaker_0': 'Item 25 is a communication from city attorney. Recommendation to declare ordinance amending the Long Beach Municipal Code related to temporary enforcement of Long Beach health orders regarding COVID 19, declaring the urgency thereof. Read the first time and lead over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_3': 'I have a motion that comes to me. Ranga, can I get a second, please? Second Vice Mayor Richardson. I think there might be one public comment.'",
        "'speaker_4': 'Yes, we have two public comment for this item. Tiffany DAVIES, the first speaker. Tiffany Davey.'",
        "'speaker_6': 'Good evening of the American City Council and Tiffany David, District four residents. I'm just calling to voice my support of this amendment to the language we use. The Code Chapter eight 120 as it relates to the temporary enforcement of the health orders regarding COVID 19.'",
        "'speaker_6': 'The amendments concerning length of time understanding the monster ordinance were to expire tomorrow on January 20th. Allowing for enforcement beyond the most recent promulgation of the order seems consistent with ultimate goal to preserve life during this ongoing pandemic.'",
        "'speaker_6': 'As for the amendments to enforcement and penalties, I also support that in light of recent events wherein a business within the food and beverage sector openly defied this health order publicly and on multiple counts, in addition to organizing like minded business owners to meet, to find ways to continue to defy, to defy the health order.'",
        "'speaker_6': 'I find this and the aforementioned amendments to be urgent. The fact remains that the health orders are promulgated in an effort to ensure all members of the community are safe and the orders should not be subject to an individual feeling or law.'",
        "'speaker_6': 'That is what I said with that empathy for all affected, but for concerns of the safety and health of every member of our community.'",
        "'speaker_4': 'Thank you. Our next speaker is Dave Shukla.'",
        "'speaker_2': 'Good evening. I like this to express my support for this item. And briefly, I would just like to separate the utility shut off for bad actors from the overall extension of the health of these health of the city has made tremendous efforts in its vaccination program.'",
        "'speaker_2': 'With the options that are currently available on the market, the widespread availability and adoption of vaccination will likely have to include more accessible and affordable options like the not yet FDA approved AstraZeneca one. And it simply may take longer than hundred and 80 days, especially if there are complications from new variants of COVID 19 that have already'",
        "'speaker_2': 'been documented in California. But continued education and public outreach are other basic behavioral interventions that one can take are crucial for wearing masks, handwashing, distancing, ventilating people, and so on. No. There are tremendous opportunities with the incoming administration to expand support for these basic behavioral interventions, along with expanding testing, tracing and other communication on COVID.'",
        "'speaker_2': 'People like to make a difference, along with a lot of the increased enforcement that we. We're considering claiming but I think the health department and for every.'",
        "'speaker_4': 'Thank you. That concludes public comment for the final.'",
        "'speaker_2': 'Roll call vote.'",
        "'speaker_0': 'Please note Councilwoman Sandy has. I'm Councilwoman Cindy Allen.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Pryce.'",
        "'speaker_1': 'And.'",
        "'speaker_0': 'Councilman Spinner.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'Councilwoman Mongo. Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Arango.'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Vice Mayor Richardson. Vice Mayor Richardson, I motion case.'",
        "'speaker_3': 'Thank you. Okay. I think we have gotten through a lot of the a lot of the items. We're going to go back now. We do have some other some other items. You're going to have reports and so forth.'",
        "'speaker_3': 'So we're going to start going through those. And before we do that, let's go ahead and have the clerk just go through the public comment, the open public comment. We'll get through that and then we'll start the rest of the agenda.'",
        "'speaker_4': 'Thank you. Our first speaker is Joni Ricks O.D..'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, find that the area to be vacated is not needed for present or prospective public use; and adopt resolution ordering the vacation of the portion of Via Alcalde Avenue, between Via Plata Street and Carson Street, based on the findings and memorializing the conditions imposed on the right-of-way vacation.  (District 8)": [
        "'speaker_3': 'Okay. Excellent. Well, let's go ahead and then move on now to our hearings work. Let's do item actually 14, which is the the big Asian hearing. First, please.'",
        "'speaker_0': 'Item 14 is report from Public Works. Recommendation to receive supporting documentation into the record. Conclude the public hearing and Adobe resolution ordering the vacation. District eight.'",
        "'speaker_1': 'I'd like to introduce Josh Hickman of Public Works staff who will make the presentation for this item.'",
        "'speaker_6': 'Hello.'",
        "'speaker_3': 'Mr. Mayor. Yes, I'm here.'",
        "'speaker_2': 'Point of order.'",
        "'speaker_3': 'Would it be possible to make a motion to continue this item? If that's what you would like, I would of heard from a few stakeholders, and I think we need to.'",
        "'speaker_2': 'To meet with them, have an opportunity to meet with them over the next couple of weeks. And so I'd like to postpone this item to a date certain of February 16th.'",
        "'speaker_5': 'If that's okay with the council.'",
        "'speaker_3': 'Staff, are we okay with that? Are there any issues with that?'",
        "'speaker_4': 'Yes, we think we think that'll be a good thing. Okay. But you have one change, Mayor, that we do want to read into the record. I'd like to turn it over to the city attorney or public works. Mayor, this city attorney, I understand that there was a an error on the on the number for the secure document'",
        "'speaker_4': '. And if the public works could correct that so that on the notice and the continuance to the date certain, we have the right number. Thank you.'",
        "'speaker_3': 'This is Lopez. We can we.'",
        "'speaker_2': 'Can correct this, but.'",
        "'speaker_6': 'I need to.'",
        "'speaker_4': 'Work with the internal team to get the right number so I don't have it readily available. Can. I can. Is this something we can fix with the city attorney? Yes, you have to. We'll have to send out the revised notice, then with the correct number on the secret document.'",
        "'speaker_4': 'Understood. And will do. Thank you.'",
        "'speaker_3': 'Thank you. Let's go ahead. And we have a motion by Councilmember Austin and second, by your anger to the date certain that it was lifted. This was any objection. We will go ahead and do a roll call vote and nothing.'",
        "'speaker_3': 'We have public comment on that. Correct. On the change.'",
        "'speaker_4': 'Do you have two speakers? Okay.'",
        "'speaker_3': 'Sure. Just make sure that we understand that the the motion is to is to postpone to a date. Certain of the speakers need to speak on that if they haven't been to say thank you.'",
        "'speaker_4': 'Our first speakers, Andy Levine. Andy Levine. Andy Levine, if you could press star six to yourself. All right. We'll move on to Jeff Smart.'",
        "'speaker_6': 'Hi.'",
        "'speaker_4': 'Everybody hear me? Yes. Please begin.'",
        "'speaker_6': 'Yes. Yeah. My name's Jeff Smart. I'm an executive vice president with Colliers International. I've worked for over 30 years in and around the Long Beach market. I specialize in warehouses and selling and leasing those buildings.'",
        "'speaker_2': 'I, I love industrial developments. I love warehouses.'",
        "'speaker_6': 'I work with a couple of property.'",
        "'speaker_2': 'Owners in the.'",
        "'speaker_6': 'Project that I know is the Freeway Business Center. So having said that, I love warehouses. I, I have some concerns about my clients and their buildings. With the massive increase in truck traffic in this project. You know, it's it's primarily a suburban office and.'",
        "'speaker_2': 'Corporate headquarters location.'",
        "'speaker_6': 'It's one of the first, you know, truly, I think it might be the only master planned business park in Long Beach outside of the.'",
        "'speaker_2': 'Airport that Douglas Park.'",
        "'speaker_6': 'And that attracted, you know, a who's who of corporate occupiers, Mercedes Benz, AT&T, Northrop.'",
        "'speaker_2': 'Grumman, Fluor.'",
        "'speaker_6': 'The contemplated buildings will have more truck doors in every building in that project combined. And you know what?'",
        "'speaker_3': 'I just could not. Let me. Thank you. I just want to make sure that the comments have to be to the motion which is moving the item. So just want to make sure that the speaker can.'",
        "'speaker_6': 'Okay. Then I'll pass, then I'll wait. I'm not speaking to the motion, so.'",
        "'speaker_4': 'Thank you. Your next speaker is Mike Murchison.'",
        "'speaker_6': 'Greedy mayor and city council members.'",
        "'speaker_2': 'I appreciate Councilmember.'",
        "'speaker_6': 'Austin taking the.'",
        "'speaker_4': 'Time to look further.'",
        "'speaker_6': 'Into this project and getting more stakeholder input from the surrounding businesses. So speaking to the item, appreciate you continuing to February 16.'",
        "'speaker_4': 'Thank you. Thank you. That concludes public comment.'",
        "'speaker_3': 'Thank you. So with that, we have moved that item. Actually, we need to do the roll call. Vote for that. I'm sorry.'",
        "'speaker_0': 'Councilwoman Zendejas.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Pryce. Councilwoman Pryce. Councilman Sabina. Councilwoman, Monday.'",
        "'speaker_1': 'Night I.'",
        "'speaker_0': 'Sent a woman. Sara.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilmember Muranga.'",
        "'speaker_4': 'Hi.'",
        "'speaker_0': 'Councilman Austin. I Vice Mayor Richardson, I motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 21.67; and by repealing Chapter 21.60, both relating to Inclusionary Housing, read and adopted as read. (Citywide)": [
        "'speaker_3': 'Thank you. We are now going to go on to the rest of the agenda. So let's do item 26, please.'",
        "'speaker_0': 'Item. Item 26. Communication from City Attorney. Recommendation to declare ordinance. Amending the Long Beach Municipal Code relating to inclusionary housing and for the purpose of implementing California Senate Bill 330. Read the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt a resolution establishing an inclusionary housing in lieu'",
        "'speaker_0': 'fee citywide.'",
        "'speaker_3': 'Thank you. I'm going to turn this over to staff. I know we have a this is a very obviously important issue. And so well, let's go through the whole presentation and then we will take some public comment and then we'll go back and do together with the Council on questions in private there.'",
        "'speaker_4': 'This is Cindy. Turn I'll turn this over to Rich Anthony, deputy city attorney.'",
        "'speaker_6': 'This is this is Rich Anthony, Deputy City Attorney. Can you hear me, Mr. Mayor?'",
        "'speaker_4': 'Yes. We can hear you.'",
        "'speaker_6': 'Okay, great. There is not much of a presentation, so I'll be brief. As council will recall, back on July 14th, the Council directed our office to bring back for its consideration three related items which we are now bringing back, the first of which is an inclusionary housing ordinance, which would apply to a portion of the city generally'",
        "'speaker_6': 'known as the downtown in the Midtown. The second thing we're bringing back is a no net loss ordinance, which applies citywide. The third thing we are bringing back for the Council's consideration is a resolution which really applies to the inclusionary housing ordinance only.'",
        "'speaker_6': 'And that resolution would establish the in lieu fees that might be payable by developers.'",
        "'speaker_4': 'Under the.'",
        "'speaker_6': 'Inclusionary housing ordinance in lieu of providing affordable units on site. These ordinance are all based on both council direction and modeled on other ordinances currently in use by other municipalities in the state, which we believe reflect best practices.'",
        "'speaker_6': 'I do want to apologize for the delay in bringing this back to the council. We had you had hoped and we had hoped to have this effective as of January one, but we're going to be a couple of months late.'",
        "'speaker_6': 'I want to make it clear that staff bears no responsibility for the delay. Christopher Koontz and his team were ready to go a couple of months before I was. I do want to note for the mayor and for the clerk, and notwithstanding the fact this is a single agenda item, we will need three different votes on each'",
        "'speaker_6': 'of the three things I just mentioned, the inclusionary housing ordinance, the no net loss ordinance, and then lastly, the resolution establishing in lieu fees. So when the Council is ready to vote after question and answers, please remember that there'll be three different votes required.'",
        "'speaker_6': 'And with that, I am standing by to answer any questions. Mike Mayes, the assistant city attorney, is standing by to answer questions on the no net loss ordinance. Christopher Coons and his team are also standing by to answer any questions to the extent they can.'",
        "'speaker_6': 'And I turn it back over to you, Mr. Mayor, and the council.'",
        "'speaker_3': 'I don't have. Let me let me go ahead and do this, if we don't mind. Should we just should we do want to get a public comment first? Yeah, sure. Medical.'",
        "'speaker_4': 'Yes, that's fine. So we're available. If you want to ask more questions, we're available. Or we can just take direction from the council.'",
        "'speaker_3': 'Okay. I just thought that was gonna be a little bit of a presentation, I guess. There. There wasn't. Okay. Why don't we go ahead and do.'",
        "'speaker_4': 'Our first speaker is also tongue. Well, certain.'",
        "'speaker_6': 'Good evening, Mayor and Council. My name is Elissa Tung, the land use program manager at Long Beach Forward. Thank you to staff and council members for bringing these two.'",
        "'speaker_1': 'Critical affordable.'",
        "'speaker_6': 'Housing policies forward tonight.'",
        "'speaker_1': 'Inclusionary housing and.'",
        "'speaker_6': 'No net loss are crucial solutions on the dual front of the covenant, the COVID pandemic and racial justice amid the spiking pandemic. Evictions are a death sentence and led to over 10,000 additional deaths nationwide during the first six months of the pandemic.'",
        "'speaker_6': 'Long Beach renters are mostly black and other people of color, with black women being the most rent burdened. So let's make good on the city's promise in the racial reconciliation report to adopt, quote, a strong inclusionary housing policy.'",
        "'speaker_6': 'Now, specifically, the draft ordinances before you allow for two alternative compliance options other than building the affordable units on site or paying a fee for the inclusionary ordinance. Number one, developers must not be allowed to propose arbitrary compliance methods to be approved at council's discretion case by case.'",
        "'speaker_6': 'And number two, land dedication off site should.'",
        "'speaker_1': 'Only be allowed when the land will accommodate more.'",
        "'speaker_6': 'Affordable units than would have been built on site.'",
        "'speaker_1': 'And when the land is.'",
        "'speaker_6': 'Prioritized for community land trust with deeply affordable units.'",
        "'speaker_1': 'For the no net loss.'",
        "'speaker_6': 'Ordinance, affordable replacement units must be on site. If that's.'",
        "'speaker_1': 'Completely impossible, then the replacement units must be within one.'",
        "'speaker_6': 'Half mile of the originating.'",
        "'speaker_1': 'Development.'",
        "'speaker_6': 'These changes and a number of others which my colleagues will address are critical, most of which are programmatic and clarifying in nature to create a robust inclusionary.'",
        "'speaker_1': 'Housing and no net.'",
        "'speaker_6': 'Loss ordinances to build affordable housing for our most vulnerable neighbors. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Jordan Wynn. Hi, this is Jordan Wynn speaking with everyone in Long Beach. I'd like to thank you for taking the time to talk about this. Today, my colleague made great points on inclusionary housing.'",
        "'speaker_4': 'I would like to bring up three in particular. It was evaluated in the 2021 to 2029 regional housing needs assessment that lawmakers needs to develop up to 11,160 units of low and very low income housing to keep up with demand for affordable housing in the city.'",
        "'speaker_4': 'Our greatest need is for very low income units. Now, this is something that I don't think can wait. One of the major things that I think we need to shift in this policy is eliminating the proposed three year phasing of this policy.'",
        "'speaker_4': 'The community cannot afford to wait three more years for the 11% of new rental units being affordable to be set aside. We need every tool in place for an equitable recovery from COVID 19. Waiting this long will cause a frontloading of development that will negatively impact the number of affordable units on the ground.'",
        "'speaker_4': 'If developers opt for the other compliance option and pay in lieu fees, they must be more narrowly tailored than they are in the current policy. They must be spent entirely on very low income rental units. They must be set to the economic equivalent of providing affordable units on site.'",
        "'speaker_4': 'They must be tied to an objective index that accurately reflects the costs of land development so that fees respond to market changes. They must be spent on the creation of net new unit and they should not be allowed by write for rental projects of 20 or fewer units.'",
        "'speaker_4': 'They should be allowed buy right for four or fewer units. These are the changes and many more as you will continue to hear that will make this inclusionary housing policy stronger for all residents of Long Beach. Thank you very much.'",
        "'speaker_4': 'Thank you. Your next speaker is Victor Sanchez.'",
        "'speaker_6': 'Councilmember General Mary Garcia. My name is Victor Sanchez, director of the Long Beach Coalition. I want to thank you for bringing this item forward and ask that you consider some changes to include fees as well as a no net loss ordinance with respect to the fees.'",
        "'speaker_6': 'Fees from rental projects must be spent entirely.'",
        "'speaker_4': 'On very low income unit, not unknown communities as currently drafted.'",
        "'speaker_6': 'And they must be spent on the creation of net new units in the fees must be set at the economic equivalent of providing the affordable units on site and tied to an objective annual index that accurately reflects the cost of land and development.'",
        "'speaker_6': 'These fees should not.'",
        "'speaker_4': 'Be allowed by write for rental.'",
        "'speaker_6': 'Projects of 20 or fewer units. Why wouldn't the city want to maximize the number of inclusionary units built on site? With respect to the no net loss ordinance. We must eliminate the 2025 expiration date. No net loss runs with inclusionary policy and should not have an arbitrary end date.'",
        "'speaker_6': 'The city doesn't have.'",
        "'speaker_4': 'Nearly enough affordable housing to meet our needs.'",
        "'speaker_6': 'As my two previous colleagues have mentioned, the arena numbers show that we have a.'",
        "'speaker_4': 'Deep need for affordable housing here in.'",
        "'speaker_6': 'Miami, specifically for.'",
        "'speaker_4': 'Very low.'",
        "'speaker_6': 'And low income families. And so our hope is that we take into consideration the changes that have been mentioned before.'",
        "'speaker_4': 'Me and that I mentioned. The current draft of the inclusionary housing and the LOS.'",
        "'speaker_6': 'Ordinances falls short.'",
        "'speaker_4': 'And we urge you to consider that. Thank you. Our next speaker is Suzanne Brown.'",
        "'speaker_1': 'Good evening. My name is Suzanne Brown, and I'm an attorney with the Legal Aid.'",
        "'speaker_6': 'Foundation of Los Angeles.'",
        "'speaker_1': 'And our Long.'",
        "'speaker_6': 'Beach office. We applaud the city for moving forward with land use policies to create and preserve affordable housing. However, we urge the Council to strengthen these ordinances to address our severe, affordable housing crisis and the devastating and disproportionate impacts of the COVID 19 pandemic on low income communities of color.'",
        "'speaker_6': 'For inclusionary housing, we request for amendments of the Council. First, eliminate the proposed three year phase, and the timeline is overly generous to developers, and it does not put the city's affordable housing needs first. Second, tighten up.'",
        "'speaker_1': 'And lower fees.'",
        "'speaker_6': 'So that they are more effective in live fees from rental projects should be spent on very low income rental units, not online communities proposed in the fees should also be tied to an objective index so that they go up and down with the market and do not become annual political fights at council and in lieu fees should'",
        "'speaker_6': 'be spent on the creation of new units, not on the rehabilitation or subsidy of existing market rate units. Third, developers should not be allowed to propose alternative methods for inclusionary housing compliance. This is an unnecessary Newport loophole that should be closed.'",
        "'speaker_1': 'Finally, affordable.'",
        "'speaker_6': 'Units should be covenanted as affordable for the life of the project or in perpetuity. This ensures that affordable units do not expire while building is still in existence, and therefore it also prevents displacement for no net loss. We respectfully request three amendments of the City Council.'",
        "'speaker_6': 'First, eliminate the 2025 expiration date for this policy. The Council did not direct staff to include an expiration date, and there is no legal reason to do so. Second, similar to inclusionary require that affordable units be covenanted as affordable in perpetuity or for the life of the project.'",
        "'speaker_6': 'The County of Los Angeles just included this requirement.'",
        "'speaker_1': 'In its inclusionary housing and no net loss.'",
        "'speaker_6': 'Ordinances. We ask that Lombard to move with our partners in the region. Third, and finally require that replacement units be located onsite in the development causing the displacement. Thank you for your consideration of our comments.'",
        "'speaker_4': 'Thank you. Our next speaker is Norberto Lopez.'",
        "'speaker_6': 'Yes. Hello. City Council and Mayor Garcia.'",
        "'speaker_2': 'There's not a Lopez project director.'",
        "'speaker_6': 'With Long Beach resident and powered local tenant.'",
        "'speaker_2': 'Advocacy.'",
        "'speaker_6': 'Group. Here, just talk about the inclusionary housing policy as well as on that last policy. We are losing more unit than.'",
        "'speaker_2': 'We are building affordable units. And that is the sad truth.'",
        "'speaker_6': 'Although we're in the.'",
        "'speaker_2': 'Pandemic and there's all these eviction moratoriums. They're going to end one day. And all those.'",
        "'speaker_6': 'Units that we are holding on to are going to be gone. We're currently working with 11 buildings who have been issued 60 day notices which are invalid, but we have one that is currently in trial, so we need to do better and ensure that we pass a stronger inclusionary housing policy that really live up to what it's'",
        "'speaker_6': 'supposed to do. And on that last policy, that helps us preserve the existing units and if they are destroyed, they need to be redone and on site as well. We also need to make sure that the affordability needs to last throughout the project.'",
        "'speaker_6': 'And it's not just 55 years or 50 years added as it is commonly known. And you know, one thing I definitely want to say and inclusionary policy should definitely be strong and not just be paraded as a policy that is supposed to do.'",
        "'speaker_2': 'Something and not.'",
        "'speaker_6': 'Necessarily do it.'",
        "'speaker_2': 'We need it now more than ever and not.'",
        "'speaker_6': 'Wait three more years. Thank you.'",
        "'speaker_4': 'Thank. Think your next speaker is Liane Noble.'",
        "'speaker_6': 'The evening council. And Mayor, I want to talk to you as a neighborhood activist who lives downtown in District one. And I want to highlight some of the other folks have done some changes. That is the neighborhood we need you to please make to the inclusionary housing and the no net loss policy you are considering.'",
        "'speaker_6': 'First of all, we need.'",
        "'speaker_1': 'This.'",
        "'speaker_6': 'Now. My neighborhood has seen market rate apartments being built, which the people who live here can not afford. We now know that there are three buildings in the 700 block of time that have new owners, which means that we are likely to see more new development.'",
        "'speaker_6': 'This is great, but what we need is low cost. Low income, very low income rental housing now. So please, let's not face it in over three years. Let's not set aspirations of 2025. We need inclusionary housing and no net loss as neighborhoods that will protect these affordable units for the life of the project.'",
        "'speaker_6': 'The same.'",
        "'speaker_1': 'Thing with the in.'",
        "'speaker_6': 'Fees. Let's use criteria that link them to market chain change and that so that we're not finding this issue every year. As the neighborhood you put them at an impossible disadvantage when you adopt policies that have to be looked at on an annual basis.'",
        "'speaker_6': 'Please make these low income, affordable units affordable for the life of the project. Please make these.'",
        "'speaker_1': 'Policies kick in.'",
        "'speaker_6': 'Now. My neighbors who are Kinect have been terrorized for months now because eviction moratoriums go from month to month. We made a commitment to equality as Long Beach. This is an equity issue. It impacts the lives of the people of color who live in my neighborhood.'",
        "'speaker_6': 'And it affects the. Delivery of the entire neighborhood. You can provide us with equity, leadership and affordable housing, which we so desperately need. Now, I thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Andrew O'Connor. Hello. My name is Angela. Do I know what the.'",
        "'speaker_6': 'Long Beach Tenants Union, the ongoing COVID 19 pandemic is devastating our communities. Evictions and homelessness are skyrocketing among our community members, just as COVID cases are. With a new variant now specific to Southern California, we must ask ourselves.'",
        "'speaker_2': 'Are we doing everything.'",
        "'speaker_6': 'To prevent displacement and ensure our community has access to affordable housing, especially when landlords continue to serve 60 day notices under the guise of substantial rehabilitation and while unlawful detainers. Simply put, the answer is no. We have proof that evictions equal.'",
        "'speaker_6': 'The nationwide evictions led to over 10,000 additional deaths during the first six months of the pandemic deaths that we just honored at the start of this meeting and will obviously continue if we don't take more aggressive action. This inclusionary housing policy is long overdue and should have been adopted before council decided to start approving the development of'",
        "'speaker_6': 'highrises in our downtown to include a three year phase in four. This ordinance is not only absurd but negligent decision making. We need this immediately. Furthermore, we're both inclusionary and no net loss. Affordable units should be covenanted as affordable for the life of the project or in perpetuity.'",
        "'speaker_6': 'L.A. County included covenants in perpetuity in its recent adoption of inclusionary housing and no net loss policies. This is the best practice. I look forward to council taking aggressive action to ease the crisis our communities are currently experiencing as this pandemic continues.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Okay. Thank you very much. We will go back. I have councilman's in Dallas.'",
        "'speaker_1': 'Thank you, Major. First of all, I'm so grateful to staff for bringing the inclusionary housing back before council today. I know that this is this has been a cumulation of so many and so much incredible work that has been previously done by our previous council, by our City of Long Beach team, and especially by members of our'",
        "'speaker_1': 'community who have been champions for inclusionary housing for many, many, many years. Policies like this have also been something I've been personally interested in for a long time. I understand how significant this step is for City. I'm also incredibly grateful for the opportunity that we had this past summer to ensure that this policy is able to be'",
        "'speaker_1': 'best met met by the needs of our community. In that spirit, I would like to make the following motion to help clarify and strengthen parts of the of this ordinance and to have our staff report back on options to continue the conversation and help create more affordable housing moving forward.'",
        "'speaker_1': 'I move that we accept steps recommendation to declare an ordinance amending the Long Beach Municipal Code relating to the inclusionary housing and associated no net loss ordinance ordinance. With the following reports we put back some amendments. One. I'd like to request city staff to evaluate an extension of the affordability covenants for both inclusionary housing and no net'",
        "'speaker_1': 'no net loss ordinance from 55 years to two either to improve Treasury. I. I have a hard time pronouncing that word, which means for the life of the project and to report back in 120 days with an analysis and recommendations.'",
        "'speaker_1': 'Two. I'd also like to request the city staff come back in 120 days with a recommendation on how to ensure that the in lieu fees are captured from inclusionary housing. Rental projects are dedicated to the production of very low income units.'",
        "'speaker_1': 'Three. I'd like to amend the Inclusionary Housing Industry Resolution to ensure that new fees are used to create new, affordable units and not use for rehabilitation or subsidize of rents in the existing market rate units. Four. I'd like to adopt the resolution with the previous amendments and also request that city staff return in 120 days with the'",
        "'speaker_1': 'resolution to tie in in new fees to an annual index based on changes in the construction and costs of costs of land costs. A fee should be adjusted annually based on two factors one being changes in construction costs, as measured by the engineer's new record construction cost index and two changes in the land costs measured by using'",
        "'speaker_1': 'the proxy a change in median condominium sale prices. Before I go on, I was also wondering if city attorney could quickly clarify if the no net loss ordinance before us now would expire in 2025? And if that is the case.'",
        "'speaker_1': 'Would it be possible to amend the ordinance to eliminate that expiration?'",
        "'speaker_5': 'Councilwoman Zendejas, it's Mike Mayes, and I was the one that wrote the no net loss ordinance. And yes, the direction we got four counts back on July 14, 2019. Order to implement SB 333330, which was adopted by the state legislature on January 1st or implement on January 1st, 2019, and SB 330 currently does have a sunset.'",
        "'speaker_5': 'There no requirement that are unserved. You could adopt a no net loss to tonight and simply eliminate the provision that parents the conditions that are in SB 330 as far as the sunset date. So if you want to pass that ordinance tonight, it's separate from the inclusionary zoning ordinance.'",
        "'speaker_5': 'You can do that. And we would bring it back for a second reading at the next council meeting with the January 2025 being eliminated.'",
        "'speaker_1': 'I would like to do that. Thank you so much, Mike. Thank you for that. I was also wondering and thank you. I was also wondering if someone, our city attorney, could clarify for me whether amending the no net loss ordinance to ensure that all replacement units under the policy are built on site, we have to trigger another'",
        "'speaker_1': 'first reading of the ordinance.'",
        "'speaker_5': 'So what? Councilwoman Cindy Haas. It's Mike Mayes again. Yes, that's a substantive change to the ordinance that would require us to bring it back for a new first reading. Currently, the way the ordinance is written, replacement housing could be built within two mile.'",
        "'speaker_5': 'You know, the the replaced. So we would need to bring that back.'",
        "'speaker_1': 'Okay. Thank you. Thank you, Mike, again. Well, I really don't want to further delay this inclusionary housing ordinance. So in that case, I would I would like to request that that staff report back in 120 days with the recommendation to ensure all replacement units are on site so that we don't have to trigger another first reading of'",
        "'speaker_1': 'this ordinance. Please.'",
        "'speaker_5': 'Councilwoman Cindy Haas. So as to the inclusionary zoning ordinance, you laid out five points, it's my understanding. To pass the ordinance tonight with the caveat that staff bring back now five, basically five different items in a subsequent report in 120 days that might lean towards maybe amending the ordinance at that the two ordinances at that time.'",
        "'speaker_5': 'And your intent also is to pass the no net law tonight with the understanding that in five days we come back with a recommendation. On whether or not all requests and how they run. I answered within two miles of the development.'",
        "'speaker_5': 'Is that correct?'",
        "'speaker_1': 'Yes, that's correct. Thank you. Thank you. I know there was a lot. I know that was a lot, too. So thank you. Thank you for capturing all that.'",
        "'speaker_5': 'No problem.'",
        "'speaker_3': 'And then I have a I think the second on this is Councilwoman Allen, correct? Councilwoman?'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Did you have any additional comments?'",
        "'speaker_1': 'I sure do. I just want to say, first of all, that this is a very important legislation for our city. And I want to thank Council Woman's and De Haas and Vice Mayor Richardson for their leadership and their vision on this.'",
        "'speaker_1': 'We are in the middle of a housing crisis which is anticipated to get worse if we don't act today. We need this now. This legislation addresses our acute housing shortage by establishing affordable housing requirements. It also ensures that our affordable housing is protected and secured for future generations.'",
        "'speaker_1': 'It also ensures that our integrated housing is prioritized. And that's really important to our community. This is not a Band-Aid or a temporary solution, but a major step forward in making our city a more equitable and inclusive place to live.'",
        "'speaker_1': 'I am so proud to support this policy and with all of the changes that Councilwoman and Dana included in her motion. Thank you.'",
        "'speaker_3': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_2': 'Mr. Mayor, thank you. First of all, city staff for presenting a good ordinance. It factored in the feedback from the city council from a few months back. All of the feedback and what we have today is is ready to go.'",
        "'speaker_2': 'And I appreciate the community moving so quickly. I know that it was agenda. On supplementals, there wasn't a lot of time to analyze and evaluate all the different pieces, but the feedback from the community has been incredibly helpful.'",
        "'speaker_2': 'And and I want to thank Councilmember Zendejas for her leadership on this both back in a few months ago and tonight. I'm in full support of those recommendations. I think it's it helps make the policy stronger. It also takes into consideration the real market factors in terms of ensuring that, you know, the development market is ready, remains'",
        "'speaker_2': 'in support and willing to work within our city, in developing our city, because it's important to know that, you know, although this could generate 11% of very low income units, if no development happens, 0% is 0%. And we actually want to build housing that's affordable for people.'",
        "'speaker_2': 'So there so the recommendations here I think are balanced and they do that and make it stronger. We did move the phase in from five years to three years. So that was that should be noted. So in the last few months that has happened.'",
        "'speaker_2': 'And so what I think in front of us is ready to go. I think the approach of, hey, the things that we may want to do to make it even stronger, approach it through a 120 day analysis. I think that's a that's a good way to to address it.'",
        "'speaker_2': 'So we get the policy on the books today. We need our commitment today, and we continue to make it make the policy better. And I think that's that's a smart, important way to to agenda. Is this so so I don't have any questions.'",
        "'speaker_2': 'I just want to offer my thanks. And this is an incredible moment for the city. I remember my predecessor, Steve Neill, fought for inclusionary housing in the downtown plan years ago. And to finally see all the work of community organizers advocating for this and residents having an advocate advocating for this, I think it's an incredible moment to'",
        "'speaker_2': 'note and we look forward to continuing to develop our city in the future. Thanks a lot.'",
        "'speaker_3': 'Thank you. We'll go ahead and do a roll call vote as we get ready for that. I'll just add that, you know, it's been a long time coming and obviously I've made extended comments on on this in the past.'",
        "'speaker_3': 'So I'll just leave it at that. I'll leave it at that. And just think for their hard work on this issue.'",
        "'speaker_1': 'Mr. Mayor, this.'",
        "'speaker_3': 'Is you're absolutely right. Just logged in, Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. Sorry about that. I just wanted to weigh in and support this as well. I want to thank the members of the community who reached out to talk with me about this before tonight. I think they raised a lot of issues that Councilwoman De has brought up that caused me pause.'",
        "'speaker_1': 'But I think that the recommendation by Councilwoman Zendejas is perfect. That's spot on because it allows us to incorporate those changes but doesn't delay the implementation tonight, which is where I thought we might be headed after I talked with the groups and realized there were a lot of good points there that we needed to further consider.'",
        "'speaker_1': 'So I'm supportive of this, and I want to thank Zendaya's on her leadership on this.'",
        "'speaker_3': 'Great. Thank you very much. And with that, we will go to Roll Call Misdemeanors.'",
        "'speaker_0': 'Just to let you know, we need three votes on this items.'",
        "'speaker_3': 'Okay. I'll let you call on three.'",
        "'speaker_0': 'The next councilwoman, Cindy has.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Ellen. Councilwoman Price. I am so, so.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Sara. I'm Councilmember Arango. By Councilman Austin. Councilman Alston. Vice Mayor Richardson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you very much. What's that?'",
        "'speaker_4': 'Mayor? I'm sorry. The city attorney. We're going to need two more votes on this item. The first vote was the inclusionary zoning ordinance. The next vote will be the no net loss ordinance. And then the final vote will be on the resolution.'"
    ],
    "Recommendation to determine that the project is categorically exempt from the California Environmental Quality Act (CEQA) pursuant to Section 15305 (Class 5 - Minor Alterations to Land Use Limitations) of the CEQA Guidelines and none of the exceptions in 15300.2 apply, and that it is further exempt pursuant to Section 15308 (Actions by Regulatory Agencies for Protection of the Environment) and Section 15061(b)(3) (Common Sense Exemption), as it will not result directly or indirectly in significant environmental impacts (CE20-090);   Declare ordinance amending Title 21, Zoning Regulations (Zoning Code), of the Long Beach Municipal Code to add Chapter 21.61 (Maintenance of Low Income Housing in the Coastal Zone) to limit exceptions to the requirements to replace affordable units and to increase the in-lieu fees for Coastal Zone areas of Long Beach, read the first time and laid over to the next regular meeting of the City Council for final reading; and": [
        "'speaker_3': 'Okay. And now we're doing item hearing 13, please.'",
        "'speaker_0': 'Item 13 is reported from development services. Recommendation to determine that the project is categorically exempt from CEQA declared ordinance, amending the zoning code to add maintenance of low income housing in the coastal zone. Read the first time and lead over.'",
        "'speaker_0': 'To the next regular meeting of the City Council for Final Reading and Adobe resolution authorizing to submit amendments to the Coastal Commission districts one, two and three.'",
        "'speaker_3': 'Great customers in the house.'",
        "'speaker_1': 'Thank you. Thank you, Mayor. First of all, I want to start off by mentioning how grateful I am to be able to hear these two these items. I think it's very important that we address the issue of affordable housing.'",
        "'speaker_1': 'With this in mind, I would like to offer a motion for staff to bring this item back in 90 days to ensure that it is consistent with our city, with our inclusionary housing, and not net loss policies that we just discussed.'",
        "'speaker_1': 'So I would like to. To make that motion.'",
        "'speaker_3': 'Okay. And I have a second by Councilman Price. Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I don't think we did this already, but I wanted to hear the staff report, if there is one. I know we have a long meeting, but it's kind of an important item. So I was wondering if we could just do a quick staff report.'",
        "'speaker_1': 'Mr. MODICA I'd like to introduce planning manager Patricia Defender for, for this a brief staff presentation on this item. Good evening, Mayor. Council Members. Patricia Defender. This is a presentation on the Zoning Code amendment to amend the ACT ordinance.'",
        "'speaker_1': 'Just some background on this ordinance. The state legislature adopted no act in 1981. It requires replacement of affordable housing demolished in the coastal zone. It allows payment of an in lieu fee as an alternative to providing the housing.'",
        "'speaker_1': 'In 1988, the city adopted a local No Act ordinance and established the in lieu fee schedule that exists on the books today. The city's adopted housing element requires an update to the MOT Act in lieu fee to bring it up to date.'",
        "'speaker_1': 'Since 2014, no affordable housing demolition has triggered collection of the Marlowe Act in lieu fee. The Mello Act in lieu fee schedule has not been updated since the since it was established in 1988. The proposed ordinance would update the in lieu fees based on a market study of current development costs.'",
        "'speaker_1': 'The update removes an exemption for single family houses, duplexes and accessory dwelling units, as those are commonly development projects that are proposed. Demolition and redevelopment of those types of housing units. The Planning Commission did approve or recommend recommended approval of this ordinance on October 1st, 2020.'",
        "'speaker_1': 'This slide just shows you the in lieu fee schedule that will be proposed as a part of this project. You can see these numbers are substantial. If you're familiar with the existing fee schedule, these are substantial increases in the fees, more commensurate with what it would actually cost to provide the units.'",
        "'speaker_1': 'There is public outreach done on this ordinance in the form of the planning hearing, planning commission, hearing and publication in the press, telegram and link LV email blast. This is the environmental clearance on this is. Exempt from secure.'",
        "'speaker_1': 'Consistent with Class five exemption. And finally, the recommendations on this is to receive the supporting documentation to the record and conclude the public hearing and determine that the project is categorically exempt from having to declare an ordinance amending Title 21 Zoning Regulations of the Code Chapter 2161 to limit exceptions to the requirements to replace affordable units and'",
        "'speaker_1': 'to modify the in lieu fees for the coastal zone. And finally, to adopt a resolution authorizing the Director of Development Services to submit amendments to the Zoning Code to the Coastal Commission for review, approval and Certification. That concludes the staff report and we are here to answer any questions that you might have.'",
        "'speaker_3': 'Councilwoman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. So just the one question that I had is I know we're adjusting the fees. So if we adjust the fees, are we making sure that our figures are consistent with other coastal communities in the region?'",
        "'speaker_4': 'Well, Councilmember, we're required under law to make our fees based on development and rents here in Long Beach. So there's two different ways of thinking about it. These increases are order of magnitude, huge increases from the status quo.'",
        "'speaker_4': 'And as Patricia explained, this is not these fees have not come into play one way or another since 2014 and are anticipated to come into play. But to keep the incentive to not demolish these fees do need to be as high as is legally justified.'",
        "'speaker_4': 'But they are lower than some other coastal communities. So property values are higher in Newport Beach, for example, than they are in Long Beach. So you can't compare the two and an apples to apples sort of way because the next study is based on Long Beach properties and Long Beach rents and not those in other cities.'",
        "'speaker_4': 'Each city in California is required if they have a miller ordinance to update their fees based on their local circumstance.'",
        "'speaker_1': 'Okay. I appreciate that. That's helps a lot. Thank you very much. I have no additional questions, Mr. Mayor.'",
        "'speaker_3': 'Thank you. Councilman Allen, I think. Did you Q back up?'",
        "'speaker_1': 'Yeah, I did. Yeah. I just wanted to say one thing. I just just in my opinion, this I think this piece requires further discussion and analysis, and I would be open to postponing tonight's discussion until February. As it stands now, this could be strengthened and the number of ways and a number of ways keep including how the'",
        "'speaker_1': 'and low fees are used where affordable housing units can be replaced and their construction timelines. Overall, I would like to see this legislation mirror and follow our inclusionary housing ordinance more closely. Thank you.'",
        "'speaker_3': 'Okay. Thank you very much. Let me go back to I have a motion in a second by councilman in the House and Councilwoman Price. Is your public comment on this?'",
        "'speaker_4': 'Yes.'",
        "'speaker_5': 'Sir. Mr. Mayor, it's Mike May. I would understand the motion a little bit better is the motion to put the entire matter over for nine days so that it can be consistent with the inclusionary zoning ordinance? Or is the motion to pass the ordinance tonight and bring back a report in 90 days?'",
        "'speaker_5': 'Regarding the consistency with the inclusionary zoning ordinance.'",
        "'speaker_3': 'Councilman's in the.'",
        "'speaker_1': 'House. Thank you. I mike again. I think that the first one is the correct one. So I'm hoping that we can come back in in 90 days or less so that we can we can make it stronger then and be able to have some concerted instances across the board.'",
        "'speaker_1': 'Please. And thank you for making that clear, because I wanted to make that clear that that was the motion on the floor.'",
        "'speaker_5': 'Great. Thank you so much.'",
        "'speaker_3': 'It's good. A public comment, please.'",
        "'speaker_4': 'Our first speakers also tongue.'",
        "'speaker_6': 'Hi. Good evening.'",
        "'speaker_1': 'Mayor and council members.'",
        "'speaker_6': 'Again. This is Alyssa Tung with Long Beach Forward. Thank you for this discussion thus far. It is absolutely true that the Mello ordinance is a really critical anti displacement policy. However, it needs a lot of work to be consistent and conforming with the.'",
        "'speaker_1': 'Inclusionary housing and no net loss.'",
        "'speaker_6': 'Ordinances. So specifically, there are several points to change. Number one, replacement determination, replacement housing obligation should be.'",
        "'speaker_1': 'Determined by.'",
        "'speaker_6': 'Looking at both the rent and income levels of tenants, not just the rent. We have to look at both rent and income level number two, onsite and new units. So consistent with the inclusionary ordinance, we need the affordable housing obligations to be met by providing units on site or paying an in lieu fee.'",
        "'speaker_6': 'So off site units should not be allowed, nor should rehab or subsidy of existing units. In regards to the fee. Again, consistent with the inclusionary.'",
        "'speaker_1': 'Ordinance.'",
        "'speaker_6': 'The in lieu fees must be set at the economic equivalent of providing the units on site and tied to an objective annual index. The replacement units should be replaced at the same or lower affordability level that they are replacing.'",
        "'speaker_6': 'So, for instance, a unit that's occupied by or affordable to a very low income household should be replaced by a very low income unit. Like for like.'",
        "'speaker_1': 'One for one.'",
        "'speaker_6': 'Not like a moderate income unit. And finally, as we mentioned multiple times with the inclusionary ordinance, the affordability covenant should be the life of the project.'",
        "'speaker_1': 'Or in perpetuity.'",
        "'speaker_6': 'L.A. County recently did this in inclusionary housing. We must do this for consistency and conformity with inclusionary housing so that we can meet the most extraordinary.'",
        "'speaker_1': 'Housing needs of.'",
        "'speaker_6': 'Our most vulnerable neighbors. Thank you.'",
        "'speaker_4': 'Oh, thank you. Your next speaker is Jordan Wynne.'",
        "'speaker_6': 'You have the other remote. Hi there.'",
        "'speaker_4': 'This is Jordan Wynn speaking on behalf of everyone in Long Beach. I want to echo what my colleagues have previously shared regarding the Mello Act. We want to make sure that the Melo Act conforms with the inclusionary housing ordinance within our city and that it also conforms with other good policy that has been established.'",
        "'speaker_2': 'Across the region.'",
        "'speaker_4': 'As was mentioned earlier, when it comes to in place replacement housing obligations, we must be looking at both rent and income levels. It is important that we are paying attention to the income classifications in addition to just what is reported by landlords as it is currently constructed, it conflicts with SB 330, the city's proposed no net loss'",
        "'speaker_4': 'ordinance and density bonus law, all of which consider income already within their factors. On the best practice used by the city of L.A. and the County of L.A. is that the Housing Department in the city would conduct rent income surveys to make affordability determinations for replacing replacement housing obligations.'",
        "'speaker_4': 'We also want to make sure that we are providing affordable units on site or paying an in lieu fee, making sure that offsite construction of affordable units is not allowed, and that in lieu fees are set of the economic equivalent of providing the affordable units on site.'",
        "'speaker_4': 'All of tonight's points where it comes to the Mello Act are meant to align with inclusionary housing, no net loss, which are obviously major milestones in our city's housing policies. We need to continue to do strong work and do as much as we can to meet the obligations set by the Regional Housing Needs Assessment.'",
        "'speaker_4': 'There are over 11,000 more units of affordable housing that need to be constructed, and by strengthening the Mello Act, you can help pave that way. Thank you very much. Thank you. Our next speaker is Norberto Lopez.'",
        "'speaker_6': 'Hello once again, city council mayor. And just once again, just echoing what some of my colleagues have said, we want this Mello Act policy to be reflective of the inclusionary housing policy. And we want to make sure that, you know, the new fees are reflective as well.'",
        "'speaker_6': 'You know, no more no more cut outs or, you know, no more special privileges to anybody. Let's ramp up our production on affordable housing units and let's preserve the ones that we already have. We can no longer continue to lose residents regardless of where they're located.'",
        "'speaker_6': 'I understand that. Well, at the Olympics, they're coming. And that's also going to bring in new development. And we have to ensure that these new developments, as they come to the city, they provide the affordable housing units that are going to be mandated by these policies, and they've done right.'",
        "'speaker_6': 'We will be increasing our affordability, housing stock and taking away units, which is currently the situation. And so thank you so much for your time and I hope that we can get this right and come back to it.'",
        "'speaker_4': 'Thank you. Your next speaker is Suzanne Brown.'",
        "'speaker_1': 'Good evening. My name is Suzanne Brown, and I'm an attorney with the Legal Aid.'",
        "'speaker_6': 'Foundation of Los Angeles in our Long Beach office. We applaud the city's effort to update its smell ordinance. But we are concerned, as you've heard from other speakers and council members.'",
        "'speaker_1': 'That the update is not aligned with the inclusionary housing and no net loss ordinances. I want to thank.'",
        "'speaker_6': 'The council members who have acknowledged this and been open to continuing this so.'",
        "'speaker_1': 'That we can get it right.'",
        "'speaker_6': 'We are requesting the City Council to direct staff to revise.'",
        "'speaker_1': 'And align the Mello ordinance.'",
        "'speaker_6': 'So that it is consistent with the land use principles.'",
        "'speaker_1': 'That we've been working on in the inclusionary housing and no net loss.'",
        "'speaker_6': 'Ordinances for.'",
        "'speaker_1': 'Years.'",
        "'speaker_6': 'In particular, we request that.'",
        "'speaker_1': 'The Mello.'",
        "'speaker_6': 'Ordinance be revised in five ways. First, replacement housing determinations need to consider more than just rent levels. Rent levels do not capture who's living in a unit. Two incomes should also be considered. If for some reason that is.'",
        "'speaker_1': 'Not something the city can do.'",
        "'speaker_6': 'At a minimum, the city should use the process.'",
        "'speaker_1': 'Included in its no net loss.'",
        "'speaker_6': 'Ordinance, which is based on state density bonus law that lays out a process for making determinations of.'",
        "'speaker_1': 'Affordable units.'",
        "'speaker_6': 'Second, I say construction of affordable units should not be allowed. Third, providing affordable units through the rehabilitation or subsidy of existing.'",
        "'speaker_1': 'Market.'",
        "'speaker_6': 'Rate units should not be permitted because this does not add to our housing stock. Fourth, affordable units should be replaced in a like for like manner, which means they should be replaced at the same.'",
        "'speaker_1': 'Or lower affordability levels.'",
        "'speaker_6': 'And fifth.'",
        "'speaker_1': 'Affordability covenants.'",
        "'speaker_6': 'Again for this should be set for the life of the project or in perpetuity to prevent expiring affordable units and displacement of low income tenants. Thank you for your consideration of our comments. We urge you to bring this ordinance back as soon as possible with these revisions.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Can you guys hear me?'",
        "'speaker_1': 'Now we can.'",
        "'speaker_5': 'Okay.'",
        "'speaker_3': 'Thank you. Work has been concluded. So we will go back now. We have the motion and the second on the floor. So let's go ahead to a roll call vote, please.'",
        "'speaker_0': 'Councilwoman Sunday has.'",
        "'speaker_1': 'Hired.'",
        "'speaker_0': 'Councilwoman Allen. I answer? Woman Price. Councilwoman Price. Councilman Sabina.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_1': 'Prices.'",
        "'speaker_0': 'And I think you count on having a woman mango. Councilwoman Sarah. I Council member Tauranga.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'And Simon Austin.'",
        "'speaker_2': 'Uh.'",
        "'speaker_0': 'Vice Mayor Richardson, I motion carries.'",
        "'speaker_6': 'On bongos, and I.'",
        "'speaker_0': 'Thank you.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 5.91, relating to grocery workers in Long Beach, and establishing labor standards requirements for premium pay for grocery workers working in Long Beach; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Citywide)\n(Emergency Ordinance No. ORD-21-0004)": [
        "'speaker_3': 'Thank you. And now we're going to be doing item number. 27.'",
        "'speaker_0': 'Item 27 is communication from City Attorney. Recommendation to declare ordinance amending the Long Beach Municipal Code. Establishing premium pay for grocery workers. Read the first time and laid over to the next regular meeting of the City Council for final reading, declaring the urgency thereof and declaring that this ordinance shall take effect immediately.'",
        "'speaker_0': 'City y.'",
        "'speaker_3': 'Okay. We're going to go out and go to public comment. I'm not sure of any objection to that. First, to get through that. Madam Clerk, please keep up a comment.'",
        "'speaker_4': 'Our first speaker is Victor Sanchez.'",
        "'speaker_6': 'Council members. Honorable Mayor Garcia My name's Victor Sanchez, director of the Long Beach Coalition for Good Jobs in a Healthy Community. I urge you to vote in support of this item. Grocery workers are the unsung heroes of this pandemic and have been risking their lives and been on the front lines for months, providing a lifeline for our'",
        "'speaker_6': 'communities and keeping us fed. We owe them our strong support to ensure they are fairly compensated for the risks they have undertaken, as well as able to adequately provide for their families during this uncertain time. Long Beach is well within its power to take the recommended action tonight.'",
        "'speaker_6': 'It's an authority and a responsibility that is extremely urgent given the severity of this current surge in the virus. We vote in support of this item does not negate other workers from other sectors being able to benefit from similar action in the future.'",
        "'speaker_6': 'This has to be viewed as a first step in providing direct relief to frontline workers, not a last one. The rational basis for supporting this item is clear. Your support will help protect public health, support stable incomes, and promote job retention.'",
        "'speaker_6': 'At a critical time for the city to protect and support grocery workers is to protect and support all residents during this emergency. We commend your leadership, especially council members and the House, for bringing this forward in recognizing the challenges workers are facing at this moment.'",
        "'speaker_6': 'Long Beach was the first in proposing this kind of relief for grocery workers. Let's finish the job and get these workers the support they need. Thank you.'",
        "'speaker_4': 'Thank your next speakers. Anthony Campanella. Anthony Campanella. Our next speaker is Christine Boss.'",
        "'speaker_1': 'Hello. My name is Christine Banks and I serve as government affairs manager for the Long Beach Area Chamber of Commerce. I'm speaking on behalf of our 678 members, representatives and community stakeholders. We're in opposition of this item and ask the Council to.'",
        "'speaker_6': 'Consider the.'",
        "'speaker_1': 'Following. Though well-intentioned, this ordinance has been rushed and inadequately studied. An economic impact.'",
        "'speaker_6': 'Survey has not taken place, so the Council would.'",
        "'speaker_1': 'Be creating policy without proper understanding of the impacts on our grocers, the workforce and our community. Furthermore, is our understanding that the grocers.'",
        "'speaker_6': 'Were not given a seat at the table when this ordinance was proposed. This item was placed as an emergency ordinance on the supplemental agenda.'",
        "'speaker_1': 'Friday before Council not once.'",
        "'speaker_6': 'But twice. This is not how policy should be created. We urge the City Council to pass.'",
        "'speaker_1': 'A vote on any wage increase ordinance that.'",
        "'speaker_6': 'Has the potential to create unintentional consequences and possible inequity.'",
        "'speaker_1': 'Across our city. Until an economic impact study is completed. Thank you for the opportunity to speak.'",
        "'speaker_4': 'Thank you. Your next speaker is Cody Walsh.'",
        "'speaker_6': 'Hi. My name was.'",
        "'speaker_2': 'I will give.'",
        "'speaker_6': 'People this in Long Beach.'",
        "'speaker_2': 'And on.'",
        "'speaker_6': 'The dairy court. And afterwards the night grew. And when you first read, you have to put in all these hours with the workload getting.'",
        "'speaker_2': 'Heavier and heavier with.'",
        "'speaker_6': 'Everybody in the palace and everything. And yeah, it's frustrating finally that I was at the cutting of the people at sanitizer school. So I'm afraid to, you know. Never to work at night without, you know.'",
        "'speaker_2': 'Catching the virus again.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_2': 'Yeah. Right. But. Yeah. Oh, well.'",
        "'speaker_6': 'Pretty much.'",
        "'speaker_2': 'I'm sorry.'",
        "'speaker_4': 'Well. Thank you. Our next speaker is Christina Min here. Huh?'",
        "'speaker_1': 'Yes. Hello.'",
        "'speaker_4': 'I please begin.'",
        "'speaker_6': 'Okay.'",
        "'speaker_1': 'Oh. Hi. My name is Christine. I'm here. I work out food for less, and I'm an essential worker during this pandemic we're currently living through. I believe me and my coworkers.'",
        "'speaker_6': 'Deserve hazard.'",
        "'speaker_1': 'Pay. After almost a year of enduring these hard times where this violent, deadly virus is among us. We don't know who is carrying the virus. When? Just last week alone, my store had 18,927 customers.'",
        "'speaker_6': 'Many of those.'",
        "'speaker_1': 'Customers can be carrying the virus a lot of the time. Social distancing nor face masks are being enforced. How they should be. We are risking our health and our family's health when all the company is concerned.'",
        "'speaker_6': 'About is profit.'",
        "'speaker_1': 'Having a record year in sales throughout this time Hazard pays.'",
        "'speaker_6': 'Shouldn't be a question or a debate. This is something we deserve.'",
        "'speaker_1': 'From the start. I believe during this.'",
        "'speaker_6': 'Time it should be people over profit, not profits over people.'",
        "'speaker_1': 'I'd like to thank you for your time and.'",
        "'speaker_6': 'Appreciate the opportunity.'",
        "'speaker_1': 'To be heard. Thank you.'",
        "'speaker_4': 'Thank. Think your next speaker is Derrick Smith.'",
        "'speaker_6': 'Good evening. My name is Derek Smith. I'm the political director for S.W. 324. And on behalf of my union, I want to extend our appreciation to the mayor and each city council member for their support for restoring zero pay for grocery workers back in December, and particularly to council members in Dallas, Richardson and Ranga and the city'",
        "'speaker_6': 'staff for their hard work necessary to bring this to a final vote.'",
        "'speaker_2': 'Tonight.'",
        "'speaker_6': 'Up and down the state of California, city councils and Board of Supervisors are beginning the process of mandating hazard pay for grocery workers. I know 13 already.'",
        "'speaker_2': 'And many more are going to follow.'",
        "'speaker_6': 'The significance of this is enormous. It's given workers the opportunity to talk about conditions on the job and the necessity of restoring hazard pay. It's giving elected and community leaders a chance to express appreciation for the local clerks.'",
        "'speaker_6': 'And it's a clear message to the grocery industry that it's not enough to call the men and women who have spent the better part of the year keeping families fed heroes. You actually have to treat them like heroes tonight.'",
        "'speaker_6': 'My hope is that the city of Long Beach will do just that and that your action will be the catalyst for other cities across the country to follow suit. Thanks.'",
        "'speaker_4': 'Thank you. Your next speaker is Doreen Bonner.'",
        "'speaker_2': 'Good evening, honorable mayor and council members.'",
        "'speaker_4': 'My name is Doreen Bonner and I am a resident.'",
        "'speaker_2': 'Of District one. I first wish to thank you all for voting to bring this ordinance to the table in support of our great work here in the city.'",
        "'speaker_6': 'As a conscientious citizen.'",
        "'speaker_2': 'And former service industry worker, and furthermore urge you to finish the process and declare the ordinance immediately.'",
        "'speaker_6': 'This pandemic has devastated lives.'",
        "'speaker_2': 'Across our communities for nearly a year now, and many of our grocery workers have not only been exposed to or infected.'",
        "'speaker_6': 'With COVID 19, but have also.'",
        "'speaker_2': 'Dealt with many cases of people denying the reality of this pandemic and thus compounding the challenges they already endured. Considering that many grocery workers are black and brown people, this becomes an issue of racial equity as well, because they are already the most disproportionately affected groups by this pandemic.'",
        "'speaker_2': 'We are all relying on the bravery of our essential workers.'",
        "'speaker_6': 'And especially our grocery workers, to keep our fridges.'",
        "'speaker_2': 'Full and our families said. So please.'",
        "'speaker_6': 'Recognize the urgency of the situation and show.'",
        "'speaker_2': 'Them that we value them enough to make sure they can do the same for their own families by giving them the hero care they deserve.'",
        "'speaker_4': 'Thank you very much for your time. Think your next speaker is Elizabeth Leone.'",
        "'speaker_1': 'Hi. My name is Elizabeth Leon. I work at the facilities and.'",
        "'speaker_6': 'I am in Redondo. I have been at this store for about five years. I have work record for last for six years. I would like to start also by thanking the mayor and all of the council members for taking the time to listen to my concerns.'",
        "'speaker_6': 'And have our backs on.'",
        "'speaker_1': 'These very uncertain times.'",
        "'speaker_6': 'Take the last.'",
        "'speaker_1': 'Council meeting that.'",
        "'speaker_6': 'Took place in December. I spoke about the fear of getting COVID 19. On December 27 was the last day that I work due to COVID 19. I was out for three weeks. I was ill. I was stressed out.'",
        "'speaker_6': 'It was around the time that I needed to make a decision. I was told that I would get emergency COVID pay, and when I spoke to my boss, she said it was going to take a little time. I then took the time to think of what I was going to do, and I decided that I would not'",
        "'speaker_6': 'pay my rent. I would feed my kids. It took 19 days for food for us to pay the emergency pay. We are so overworked, exposed ourselves to thousands of people. The committee is essential, so nobody should ever have to choose between feeding their kids.'",
        "'speaker_6': 'Thank you. And having any.'",
        "'speaker_4': 'Your next speaker is Anthony Campanella.'",
        "'speaker_6': 'Yup. I'm Anthony.'",
        "'speaker_4': 'Please begin.'",
        "'speaker_6': 'Yeah. I worked for Ross for 43 years, lived in this city for 55. And I just wanted to say that. I've never gone to work in so much fear in my life and my coworkers all said the same.'",
        "'speaker_6': 'I'm their shop steward. It's it's just phenomenal how this company. Has decided that they do not consider us a risk factor. So I just wanted to really emphasize. How much this would mean to us if you reinstated our hazard pay.'",
        "'speaker_6': 'That's kind of it. That's all I wanted to say.'",
        "'speaker_4': 'Think your next speaker is Jan Michelle.'",
        "'speaker_6': 'Carl.'",
        "'speaker_1': 'My name is Tony Michelle and I'm a proud at Long Beach City resident and a Long Beach essential worker.'",
        "'speaker_6': 'I work for Gelson's.'",
        "'speaker_1': 'In Long Beach. I have been in this.'",
        "'speaker_6': 'Business for.'",
        "'speaker_1': '25 years.'",
        "'speaker_6': 'But these times are the scariest.'",
        "'speaker_1': 'And while granted, I am so incredibly grateful for my job. These are the scariest times for us. And at this point, we are all worked eight, ten, 12.'",
        "'speaker_6': '15 hours a day.'",
        "'speaker_1': 'Six days a week. I see my customers and my coworkers more than I see my own family. And at this point, we're all telling.'",
        "'speaker_6': 'Ourselves, just one more day.'",
        "'speaker_1': 'One more day. Are we going to make it one more day?'",
        "'speaker_6': 'Will we get it? Will we.'",
        "'speaker_1': 'Make it this one last day if we are making.'",
        "'speaker_6': 'Ourselves available to our communities? It's so critical for us to do this work and to keep our our people fed.'",
        "'speaker_1': 'And with every place being closed right.'",
        "'speaker_6': 'Now.'",
        "'speaker_1': 'People are eating breakfast.'",
        "'speaker_6': 'Lunch and dinner at home, which I'm here to tell you that these grocery jobs.'",
        "'speaker_1': 'Continue to be busier and busier, which means more.'",
        "'speaker_6': 'Hazardous by the day.'",
        "'speaker_1': 'My coworkers and I have been at this for the last.'",
        "'speaker_4': 'Thank you to our next speakers, Marcus Williams.'",
        "'speaker_2': 'Hello. Thank you, Mayor and Council, for allowing me to speak. My name is Marcus Williams. I've been working for Albertsons platforms for about 12 years. I'm a front end cashier. I'm also a father of four, and I caught COVID late November, which changed me from hugging and kissing my kids.'",
        "'speaker_2': 'I don't go anywhere. I go to work and go straight home every day. So. There's no mistake that. Okay, I got it from work. They come in contact with more people than the medical facilities right now. And we don't know if these people are taking precautions, you know, washing their hands and things of that nature.'",
        "'speaker_2': 'And in this pandemic, the grocery stores have never closed. They've been open through the whole pandemic. So business is booming. So I feel that every day somebody is dying. And literally one of our coworkers that caught the disease has actually passed away.'",
        "'speaker_2': 'And. In the last couple of months like. It's a numerous amount of people that are just catching the virus and there's no way that we can stop it. We don't know who's touching what in the stores, and it's impossible for them to sanitize everything in the store.'",
        "'speaker_2': 'So. I just want to say that life is priceless. And this $4, it is going to help.'",
        "'speaker_4': 'Thank you. Our next speaker is Mary Dong.'",
        "'speaker_1': 'Good evening, council members. Honorable Mayorga. S.M. is Mary Jung Am, a faith organizer with clergy only at United for Economic Justice, also known as crew. COVID Outbreaks Skyrocket at SoCal supermarkets in NBC News the other day reported that there were 146 outbreaks in supermarkets in December alone, in L.A. County, in Orange County.'",
        "'speaker_1': 'So, of course, you workers are at the front now facing the risk of being contracted with COVID daily to ensure all of our children, families and community members have food on the table. And so if we call them heroes, we need to show that with our actions, it is the right ethical theme for our city to ensure'",
        "'speaker_1': 'the grocery workers are fairly compensated for their dangerous work and.'",
        "'speaker_6': 'Sustainably take care of their families.'",
        "'speaker_1': 'And I believe that supporting social workers is supporting our whole city to survive and move forward in this health crisis. And as people of faith, we believe all labor contributing.'",
        "'speaker_6': 'To the building.'",
        "'speaker_1': 'Of community has dignity and worth. So vote in support of this item is a vote to support community health, community safety and community sustainability.'",
        "'speaker_6': 'This is the first step to provide.'",
        "'speaker_1': 'Direct relief from those workers. So I want to say thank you for the council's leadership, especially council members, and for moving this item forward. And I.'",
        "'speaker_6': 'Urge you to finish this.'",
        "'speaker_1': 'Job and provide support for our workers. Thank you.'",
        "'speaker_4': 'Thank you. Your next speaker speakers Terry Mulder. Terry Mander. Terri mander if you're there please and yourself by hitting star six. Gerrymander. Right. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. I'm going to go ahead and go back now to the city council. And let me just begin with, Councilman, is that that's.'",
        "'speaker_1': 'Thank you, man. I just huge, huge thank you to our city staff, especially our city attorney and his team for bringing this is doing this amazing work and bringing it back so quickly. It is absolutely a matter of urgency that we reestablish these benefits for our heroic grocery store workers during this incredibly difficult and dangerous time.'",
        "'speaker_1': 'They are doing essential work and are entitled to basic benefits so that they can provide for their families and have the financial security they need and deserve for working in a high risk environment. And as our frontline workers during this pandemic, I think we can all unite behind celebrating the work being done by the essential workers right'",
        "'speaker_1': 'now. And it's absolutely necessary that we take action to make sure that our workers are not only receiving our praises, but the essential benefits that that that represent the very least at these at these times. I know that during this time I views this industry is bringing in enormous profits, profits even to the point of 100% for'",
        "'speaker_1': 'last year in some cases. And and they're doing so on the shoulders of all of our grocery workers who are risking their lives every single day. This is why this was brought urgently, because we don't have time. There are some lives that are depending on this.'",
        "'speaker_1': 'And it's it's it's very hard and it's very emotional to hear all of the public comments, all of the workers that have spoken here today, and to know that they are risking their lives for us so that we all can have food on our tables.'",
        "'speaker_1': 'And so with that, I just hope that that my colleagues support this item and that we can vote on this item and make sure that we that we. That we really consider our heroes who are our frontline workers in our grocery stores.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilman's in the house. Customary Ringo.'",
        "'speaker_4': 'Thank you. And I.'",
        "'speaker_5': 'Want to say that Councilmember Senate has some comments who are spot on.'",
        "'speaker_1': 'And they split.'",
        "'speaker_3': 'THOMPSON We ran. I think we lost two. Okay. Let me go.'",
        "'speaker_5': 'To out here for some reason.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'What I basically said was that I agree.'",
        "'speaker_2': 'With the.'",
        "'speaker_5': 'Comments made by governments and then.'",
        "'speaker_2': 'You would read it. They were spot on. And I'm going to.'",
        "'speaker_5': 'Give you.'",
        "'speaker_6': 'That. You hear.'",
        "'speaker_3': 'Richardson.'",
        "'speaker_2': 'Thanks, Mary Garcia. Just wanted to chime in and say, I think this is the right thing to do. I know that. And I want to acknowledge councilmembers and Bay has and Durango for their leadership on this issue. I know that these are unprecedented times.'",
        "'speaker_2': 'It's not the type of measure the lobby city council has done historically. There are some examples. I mean, we did support 50 miles an hour, you know, our voter supported measure. And there are some examples. But I think this is even this is different.'",
        "'speaker_2': 'Hero pay, we know, was established, you know, on the private side during the summertime. And it was certainly the right thing to do. But we're all sort of concerned about the greater economic condition of our economy and low wage workers.'",
        "'speaker_2': 'And we know that, again, it's a k-shaped recovery. People that make under $27,000 a year are showing that unemployment rates are increasing and they're having economic burdens and just trying to hold on. So I think that makes I think it makes sense.'",
        "'speaker_2': 'I don't think we need to change it. Change it. I think we need to stick with what's in front of us, adopt it, move forward, and also watch and see what the region, how the region responds to react.'",
        "'speaker_2': 'So no West Hollywood adopted hero just tonight. So so I'm happy to support this and I encourage and I wrote thank you.'",
        "'speaker_3': 'Q a Councilwoman Allen.'",
        "'speaker_1': 'Thank you, Mayor. I also want to thank the staff for getting back so quickly. This is an important ordinance. And I also want to thank Councilwoman Sun Hoss for her leadership on this. Some of the highest rates of COVID 19 transmission are seen in grocery store workers, and so many of the courses to our workers have already'",
        "'speaker_1': 'had COVID. And I just pray for everyone's safe recovery. These heroes don't have a choice to work from home, and largely they can't control the actions of members of the public that are in their personal space. They, like the gentleman said earlier, they just faced so much fear just to go to work.'",
        "'speaker_1': 'But they do it day after day to make sure that all of us get fed. I support them. I'm with them, and I think I'm all for their service to our community.'",
        "'speaker_3': 'Thank you. That concludes council comment. I'm going to make some comments just to wrap us up. I want to just start by thanking the city attorney team. I know in my conversations with him and the team, they worked really hard to get this out as soon as possible.'",
        "'speaker_3': 'And I just want to thank them. I know that it was it was really a really tight schedule for them. So I appreciate their work. And of course, to our our city team and really all the advocacy on this issue, I just want to just say that I, of course, absolutely have supported this initiative from from day'",
        "'speaker_3': 'one. These folks that are working at these at these markets and these these grocery stores are heroes. This is nothing new. They have received this type of additional pay in the past. And if they deserved it in the past, I deserve it.'",
        "'speaker_3': 'Today there are if you look do you think about all the essential workers that are out there? It is hard to name a group of folks that have as much contact with different individuals in that level of proximity that that these folks have.'",
        "'speaker_3': 'So it is unique. I mean, there's a lot of essential work, but this work is also very unique. And on top of that, unfortunately, a lot of these workers are harassed and they have to deal with folks who don't want to comply with the rules, and they're trying to protect themselves and their family.'",
        "'speaker_3': 'And they don't have the choice to not work or to work from home. These are these these folks make up the backbone and working class community of our city. And I'm really, really proud of them. They they are they are our neighbors.'",
        "'speaker_3': 'I, I there was a worker on here who said I believe she said she was from Gelson's and I was just there. Maybe a week or two ago I was doing some shopping and I actually had a chance to talk to some of the workers and workers who came up to me and words just honestly, they just'",
        "'speaker_3': 'they were so grateful and they just said, hey, thank you so much for this proposal. And you have no idea how much it means to us. And it's just great to know that there is there are folks that are watching out for us and understand how difficult these jobs are.'",
        "'speaker_3': 'And so, you know, just to the workers at Gelson's, that that I that I love so much and across the city and all the other great supermarkets where we are, we got your back and we're really proud of this tonight.'",
        "'speaker_3': 'And I especially want to thank Councilman's and De Haas who really led this this issue. And, you know, she continues just to be such a champion for working people. So congratulations to her and the whole council. And what that was a roll call vote.'",
        "'speaker_0': 'Councilwoman, City Councilwoman Ellen.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Pryce, I councilman's opener.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Councilman Austin. Councilman Alston. I Vice Mayor Richardson.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you very much. Vice Mayor Richardson, I think you have the last couple of items here.'",
        "'speaker_2': 'Sure. Let's take a moment to so I can reset. So let's start off. Madam Clerk, I believe the final items we have are 17, 21, 24 and 28. Is that correct?'",
        "'speaker_0': '17, 20, 21. 24. And 28.'",
        "'speaker_2': 'Okay. So we're going to go in that order and and for the council, we're going to do voice motions. But the clerk has the Q for the order of of comments. So I'll recognize the motions. And then as we proceed through the debate, the clerk will cue to the next speaker.'"
    ],
    "Recommendation to direct City Manager to work with the Human Relations Commission to update and expand its mission and scope, and change its title to the Long Beach Equity Commission, in line with recommendations from the Racial Equity and Reconciliation Initial Report, and return to the City Council within 90 days.": [
        "'speaker_2': 'And that's how I will proceed, since I don't have access to the Q system. So we'll start with item 17 and I'll make the motion on that one. Let's hear item 17, please.'",
        "'speaker_0': 'Item 17 is the communication from Vice Mayor Richardson. Councilwoman Van de has Councilwoman Allen, Councilwoman Sara recommendation to direct city manager to work with the Human Relations Commission to update and expand its mission and scope and change its title to the Long Equity Commission.'",
        "'speaker_2': 'Thank you. I'll go ahead and get started. So this is a recommendation from my office, and it's consistent with two recommendations in the Racial Equity and Reconciliation Initiative report. The Human Relations Commission has a long history. It began in the sixties with the civil rights movement was disbanded in 1981 and was revived in 1989 in response to'",
        "'speaker_2': 'calls from community groups and local ministers in response to an issue of police misconduct and police brutality within the city. Very same issue that led to the creation of the Citizen's Police Complaints Commission over the past few years has been discussions at the Human Relations Commission, and even more so now about aligning with a lot of the'",
        "'speaker_2': 'work that's happening here within the city to date. And by aligning the Human Relations Commission with work that's directly in line with the Office of Equity, the implementation of Racial Equity Reconciliation Initiative. Some of the important work that the City Council is doing, what we do is ultimately expand civic participation, transparency, oversight into some of this work'",
        "'speaker_2': '. And so a citizen commission is is certainly something we're interested in. The motion initially says change the Office of Equity. In talking with the Equity Commission, I certainly support that. That's what's in the reconciliation report. But, you know, in talking to the commission and and community groups, there is an interest in having maybe a combination of equity'",
        "'speaker_2': 'and human rights. I think it's all fine. I think what's most important to me is alignment. I also want to just acknowledge the letters of support that have come in. We've received letters, support from Jessica Suma, from the Economic Development Commission, Walter Larkins, the Chair of the Economic Development Commission, the Lobbies Ministers Alliance, CCG, the LGBTQ center'",
        "'speaker_2': ', Long Beach Forward Lobby, Center for Economic Inclusion, Success and Challenges and others. And so I wanted to thank everyone who participated in this, I think in alignment with all the steps we've done today, this is a good step the city council can take.'",
        "'speaker_2': 'The idea would be the commission is going to work with staff, come back to city council the next 90 days with the plan. And at that point we can vote to update and modernize our commission. And again, I think it makes sense.'",
        "'speaker_2': '30 year old, you know, this commission has been in place for 30 years. So has the PCC. They both sort of came out of the same moment and PCC has been modernized. I think it's time for the Office of Equity to be I mean, the excuse me, the Human Relations Commission to also be modernized.'",
        "'speaker_2': 'So those are my comments. I'll open up for a second and then we'll go to public comment. Is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_2': 'Who's that?'",
        "'speaker_1': 'Sara.'",
        "'speaker_2': 'Okay. Thank you. Okay. Let's go to public comment and then we'll come back for council comment. I'm Clark.'",
        "'speaker_4': 'Our first speaker is Alyssa Gutierrez.'",
        "'speaker_1': 'Getting me Mayor and City Council. My name is Lester Gutierrez and I serve as chair of our city's Human Relations Commission. I'd like to thank Vice Mayor Richardson and the co-sponsors of this item for bringing this forward. The HRC strongly supports the proposal before you and is looking forward to working with the city manager's office to develop'",
        "'speaker_1': 'recommendations on modernizing the HRC role and updating our name to better.'",
        "'speaker_6': 'Reflect the core.'",
        "'speaker_1': 'Of our work. For decades, the HRC has been an ally and advocate in the fight for a more.'",
        "'speaker_6': 'Just and equitable on beach.'",
        "'speaker_1': 'Uplifting the experiences and needs of all marginalized communities. The very communities we've been talking about all evening low income residents, communities of color, rent burdened families, grocery store workers, members of the LGBTQ plus community women. Our current ordinance, written over 30 years ago, does not fully capture the realities of how injustice and inequity show up and more'",
        "'speaker_1': 'importantly, where they originate and how to address them. We know today that in order to create a more equitable city, we must go upstream and address inequity at the root in all its forms. As the city works to institutionalize equity, it's critical that an independent citizen commission has the ability to advise city staff and council on.'",
        "'speaker_6': 'Both practices.'",
        "'speaker_1': 'And be on hand to provide accountability and partnership.'",
        "'speaker_6': 'Throughout the process.'",
        "'speaker_1': 'We look forward to engaging our community partners over the next few months to identify what changes to our purview is needed in order to be a more effective advocate for all of our communities experiencing inequity. It's time to update the Human Relations Commission ordinance to reflect modern approaches to addressing inequity and human rights issues.'",
        "'speaker_1': 'Please vote in support today. Thank you, Mayor Richardson, and thank you to our fellow co-sponsors. Thank you so much.'",
        "'speaker_4': 'Thank you. Our next speaker is Amy Erickson.'",
        "'speaker_1': 'Good evening, Mayor. City Council, thank you so much for having this item on the docket tonight. I'm here as a.'",
        "'speaker_6': 'Lifelong resident.'",
        "'speaker_1': 'Of District two here in Long Beach and also been on the commission for over four years now. And I think it's really important that we make these.'",
        "'speaker_6': 'Steps to.'",
        "'speaker_1': 'Work.'",
        "'speaker_6': 'Alongside the work that is happening.'",
        "'speaker_1': 'With the framework for reconciliation.'",
        "'speaker_6': 'I would like to speak to a couple of those pieces, one of one being what we heard tonight. Every time we have public comment tonight.'",
        "'speaker_1': 'We've been hearing about how important equity is in our city and in in the systems that we have in the city government. And it came up over and over again that we that the city.'",
        "'speaker_6': 'Is dealing with issues of equity. At the Human.'",
        "'speaker_1': 'Relations Commission level, we would like to be able to not only.'",
        "'speaker_6': 'Be on public comment and give recommendations to you as council.'",
        "'speaker_1': 'Members.'",
        "'speaker_6': 'But be able to work with city staff.'",
        "'speaker_1': 'Who are doing amazing work in the Office of Equity City Manager's.'",
        "'speaker_6': 'Office, the Health Department, to make sure that every system.'",
        "'speaker_1': 'Throughout the city is looked at with an equity lens and can work towards doing the work that needs to happen alongside.'",
        "'speaker_6': 'The almost.'",
        "'speaker_1': '200 items in the framework for reconciliation. I just think it's so important that there be an opportunity to update the ordinance as this commission was formed over.'",
        "'speaker_6': '30 years ago, and I'm sure you'll hear.'",
        "'speaker_1': 'More about tonight.'",
        "'speaker_6': 'But it's so important.'",
        "'speaker_1': 'Right now to take a look and see what we can do. I also appreciate Vice Mayor Richardson for thinking about the title of this commission. I think titles are very important, and so making sure that over the next 90 days, as.'",
        "'speaker_6': 'We go through staff work to and to look at this and really look at what we do as a commission.'",
        "'speaker_1': 'I hope that we can take a look at what other council members want and what other commissioners want to see what this title could be. I think human rights is very.'",
        "'speaker_6': 'Important, and some people might think that if we think only about equity, we're not thinking about.'",
        "'speaker_1': 'The other items that really take care of our human needs and our community and those needs.'",
        "'speaker_6': 'Of marginalized groups.'",
        "'speaker_1': 'Not only including those that are being referenced.'",
        "'speaker_6': 'In the framework, but also.'",
        "'speaker_1': 'Our queer community, our community of women here in the city. And so we really want to take a look about how we can handle taking care of our community in a way that other commissions don't have the purview for.'",
        "'speaker_6': 'So we want to make sure we handle that.'",
        "'speaker_1': 'As past chair of this commission, we did a lot of work around our mission, and the mission is to inspire and support social justice and equity in the city of.'",
        "'speaker_6': 'Long Beach and to foster mutual.'",
        "'speaker_1': 'Understanding and respect for all. That's very important at this time in our.'",
        "'speaker_6': 'In our city's life. And I think it's really important to work alongside the framework.'",
        "'speaker_1': 'For reconciliation as well. I look forward to hearing what the next steps are. And thank you so.'",
        "'speaker_6': 'Much for this item.'",
        "'speaker_4': 'Thank you. Our next speaker is Corey Allen.'",
        "'speaker_6': 'Hi. Vice Mayor and council, this is Corey Allen. Thank you so much for the opportunity to be before you today. I serve as the District four Commissioner for the Human Relations Commission.'",
        "'speaker_4': 'And I want to thank you for.'",
        "'speaker_6': 'Your leadership on this item, as well as the co-sponsors for.'",
        "'speaker_2': 'This.'",
        "'speaker_6': 'The Human Relations Commission, as the vice mayor mentioned, has.'",
        "'speaker_4': 'Been at the forefront of a lot of these.'",
        "'speaker_2': 'Issues around equity.'",
        "'speaker_4': 'Around.'",
        "'speaker_6': 'Supporting the community and making sure that we are responding to.'",
        "'speaker_4': 'The work that's happening on the ground. You heard the vice mayor.'",
        "'speaker_6': 'Mentioned several of the iterations of this commission. And one.'",
        "'speaker_4': 'Of the other things that in.'",
        "'speaker_6': 'Its previous life this commission really championed was the human dignity.'",
        "'speaker_2': 'Program and.'",
        "'speaker_4': 'Really working on hate crime.'",
        "'speaker_6': 'Statistics and understanding how to de-escalate issues around hate crimes and make sure that.'",
        "'speaker_4': 'We were really working.'",
        "'speaker_6': 'In communities of color and in our LGBTQ communities to ensure that we were providing those resources as well. And I certainly.'",
        "'speaker_2': 'Would be remiss if I didn't.'",
        "'speaker_6': 'Acknowledge and call out Teresa.'",
        "'speaker_2': 'Gomez.'",
        "'speaker_6': 'Who is our amazing staff member who has been with this commission for several years, as well as Katy Balderas, who who has joined us every single week or every single month for our commission meetings. Just know you have.'",
        "'speaker_2': 'A dedicated crew of community leaders, a diverse crew of community leaders who are.'",
        "'speaker_6': 'Fighting hard alongside you as counsel to do this work. And we're excited to join you in this new iteration of our commission. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Eduardo Lora.'",
        "'speaker_6': 'Good evening. My name is Dr. Eduardo Lara, a professor in the department at Cal State Long Beach. My areas of expertize, for context purposes include social justice and intersectionality. I'm calling tonight to lend my support to this progressive change in the Human Relations Commission.'",
        "'speaker_6': 'I'm going to applaud the city council sponsors and mayor for bringing this item forward. It is an inflection point for the city to shift from a human relations model to equity is a modernization of this commission, bringing it up to speed to both the framing and best practices for advancing equal opportunities for our city's residents.'",
        "'speaker_6': 'To be clear, this item is aligned with the spirit of diversity, equity and inclusion efforts that have swept non-profits, businesses, universities and now government institutions. Adhering to diversity implies there's representation across various identities. But with attention to historically marginalized groups, a commitment to equity ensures that fair treatment to all, while recognizing that each person and community has'",
        "'speaker_6': 'different circumstances and may require different resources to bring about equality and inclusion. The steadfast commitment to Building a culture of belonging. In other words, if you're a resident in Long Beach, you belong and are entitled to a seat at the table.'",
        "'speaker_6': 'Whatever language you speak, regardless of documentation status, you belong at the heart of these three pillars of justice that braids them all together. In other words, diversity, equity and inclusion efforts are brought together by a common vision to distribute resource equitably aligned with social justice, preferably through a lens of intersectionality.'",
        "'speaker_6': 'It's important to note that intersectionality was coined by Kimberl Crenshaw, a legal scholar and black woman. She came up with the framework in the late eighties to help convince legal community that just because we bring about further equality for black people and women, it doesn't necessarily advantage black women.'",
        "'speaker_6': 'An intersectional approach remedies that. As a queer Chicano researcher, I've seen the benefits of intersectionality as an approach for equity and also the empowerment of Latino communities. This item will help operationalize the recommendations from the reconciliation report. This will also help close three institutional gaps at the municipal level.'",
        "'speaker_6': 'Community voice, empowering community residents and crystallizing a formal structure for this. Empowerment is going to be lost on anyone tonight. This item is sandwiched on a day in between the celebration of the legacy of Dr. Martin Luther King Jr.'",
        "'speaker_6': 'And the inauguration of the first woman, a woman of color. As vice president kamala harris. It is equity policies like this one that can create opportunities for the next king and Harris. I look forward to seeing where this inflection point takes the city of Long Beach.'",
        "'speaker_6': 'Thank you very much. City council and mayor.'",
        "'speaker_4': 'Think your next speaker is Gregory Sanders.'",
        "'speaker_2': 'Hello everyone, and thank you. I actually applaud the genesis of the original human resource lease with the Human Relations Commission. However, 2020 was the alarm clock that has awakened us to the fact that names do matter. We've seen the replacement and even the removal of names on things as small as retail products to the evolution of massive'",
        "'speaker_2': 'fan based organizations like the Washington Redskins to the Washington football team. So moving forward with expanding the role of and a shift from being identified as a Human Relations Commission could not be more timely and even more relevant.'",
        "'speaker_2': 'The core values that actually underpants, sustainable community development, interdependence, empathy, equity and intergenerational justice are the pillars of the city's reconciliation efforts. So if we build this correctly, the Equity Commission is a viable vision towards an even better Long Beach being constructed.'",
        "'speaker_2': 'A lot of people want to skip ahead to the finish line of racial harmony. They want to get past all of this tension and unpleasantness to place to a place where wounds are healed and everyone sings Kumbaya and the past is laid to rest.'",
        "'speaker_2': 'But Benjamin Franklin said justice will not be served until those who are unaffected are as outraged as those who are. The Equity Commission can gently disturb the comfort of those unaffected while actually encouraging and empower those that are.'",
        "'speaker_2': 'Thank you so much. I appreciate you all. Talk to you later.'",
        "'speaker_4': 'I think your next speaker is James Sweitzer.'",
        "'speaker_6': 'Good evening, honorable man. Members of the City Council. My name is James Wilder and I'm a third district president and executive director of Long Beach Forward. Before I jump in the comments, I'd be remiss to say that I hope that we can be together in person soon, or at least on video in these digital meetings.'",
        "'speaker_6': 'Because I too was wondering what colorful bow tie and glasses that Pastor Sanders were. So I wish I could see that sometime in the near future. Nonetheless, I'm here tonight to talk to you and ask for your support and our organization asking for your support on this item.'",
        "'speaker_6': 'Our organization, Long Beach Forward submitted a letter of support in this item and asked for your affirmative vote to expand the purview and scope of the Human Relations Commission. So whether we're black, indigenous, Latino, Cambodian, Filipino, LGBTQ young people or seniors, it is vital that we all see the diversity and culture of Long Beach prioritized within our'",
        "'speaker_6': 'local government. And that means moving from equity from pages in a report to tangible policy recommendations and decision making is the next bold step that the City of Long Beach must take to build on that foundational work that has come from so many, so much community driven activism, the absence of equity and, of course, the framework for'",
        "'speaker_6': 'racial equity and reconciliation. The Human Relations Commission has consistently played a strong role within our local government for a more just and equitable Long Beach, uplifting the experiences and needs of marginalized communities, and also translating this into tangible change for people's lives.'",
        "'speaker_6': 'So expanding the official purview of the commission will aid the Commission in fulfilling its mission to inspire and implement equity in the city of Long Beach and also foster a mutual understanding and respect for all. And I want to be clear that working towards equity is not an easy process.'",
        "'speaker_6': 'Equity requires that we understand the path without being trapped in it, embrace the present, without being constrained by it, and look to the future guided by the hopes and courage of those who have fought before and beside us.'",
        "'speaker_6': 'And as city leadership continues to work towards advancing Long Beach into the new decade. We must also plan for a just and fair inclusion into a society where we can all participate, prosper, and people can reach their full potential.'",
        "'speaker_6': 'Committing to that equity commission is a solid step in that direction. I thank you for your commitment to advancing racial equity, and please vote yes on this item. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Jesse Needham.'",
        "'speaker_1': 'Hello, Mayor and city council members.'",
        "'speaker_6': 'And all these.'",
        "'speaker_1': 'Great people I've been listening to on the call. My name is Jesse Needham. My pronouns are she and her. I'm here representing the California Conference for Equality and Justice CCJ.'",
        "'speaker_6': 'I'm also a Long Beach resident.'",
        "'speaker_1': 'Thank you to Vice Mayor Richardson for putting forth this agenda item.'",
        "'speaker_6': 'CCJ enthusiastically supports the expansion of the scope of the Human Relations Commission and the name update outlined in Agenda Item 17.'",
        "'speaker_1': 'In the 1990 and 2000.'",
        "'speaker_6': 'The Commission and CCJ or CCJ, as we.'",
        "'speaker_1': 'Were then known, work together to.'",
        "'speaker_6': 'Respond to and prevent hate crimes in our community. And we look forward to working with the Equity and Human Relations Commission.'",
        "'speaker_1': 'Sorry, Equality and Human Rights Commission.'",
        "'speaker_6': 'To address ongoing needs to uplift values of equity and inclusion in our.'",
        "'speaker_1': 'City and address the racism, bias.'",
        "'speaker_6': 'And bigotry that harm people in our communities.'",
        "'speaker_1': 'We also ask Council to call.'",
        "'speaker_6': 'On the city manager and other budget.'",
        "'speaker_1': 'Decision makers to.'",
        "'speaker_6': 'Ensure that the Office of Equity in the Health Department have adequate funding and staffing to support the Commission's work. A name change that focuses our attention on the need for equity in our city is important. But Long Beach must put our.'",
        "'speaker_1': 'Proverbial money where our mouth.'",
        "'speaker_6': 'Is when it comes to supporting the commissioners and city staff to put ideas into practice. Long Beach residents must be able to trust that when concerns about inequity are brought to the commissioners, that they have.'",
        "'speaker_1': 'Sufficient resources to do further research and make policy.'",
        "'speaker_6': 'Recommendations and take action to with the city based on their findings. Thank you so much.'",
        "'speaker_4': 'Our next speaker is Suleyman Gonzalez.'",
        "'speaker_1': 'Thank you both, Mayor Richardson and City Council. My name is Selene Gonzalez. I'm human relations commissioner representing District nine. So the Human Relations Commission has been a strong ally and advocate in the fight for a more just and equitable Long Beach.'",
        "'speaker_1': 'Expanding the purview of the Commission will aid the Commission in fulfilling its mission to inspire and support social justice and equity in the city of Long Beach and foster a mutual understanding and respect for the city of Long Beach engages in efforts to institutionalize equity and infuse an equity lens through our practices, policies and decision making.'",
        "'speaker_1': 'It is critical that an Independent Citizen Commission has the ability to advise city staff, city manager and City Council on best practices and be on hand to provide accountability through. Through partnerships. In the process. I love Blondie and it is time for us to update the Human Relations Commission's ordinance to reflect the modern approaches to addressing inequality'",
        "'speaker_1': 'and human rights issues.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Your next speaker is Tiffany Davey.'",
        "'speaker_6': 'Good evening, Honorable Mayor Bryson, City Council Tiffany and David, District four residents. I am in support of this item which aims to go beyond simply renaming the Human Relations Commission to the Long Beach Equity Commission. I particularly look forward to seeing amendments to the purpose members functions and most importantly, to the authority the Commission has, as it'",
        "'speaker_6': 'currently outlined in the Long Beach Municipal Code, Chapter two, Section 44, which was last amended in 1989. Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'So now we'll go back to the Madam Clerk if there are any council members queued up.'",
        "'speaker_0': 'Yes, we have. As Woman Sun has.'",
        "'speaker_1': 'Thank you, Madam Cook. I just wanted to say thank you to Vice Mayor Richardson for bringing forward this item. I think that, you know, this is very important going forward, especially in the times that we are living in right now.'",
        "'speaker_1': 'I think that, you know, one of the things I've always advocated for was a commission for quality of health of our residents. And I think that this is the perfect commission to implement that into. And I think that it is very important to be equitable when dispersing whatever resources we have from the city.'",
        "'speaker_1': 'So I think that it's very fitting right now for this commission, and I really do thank you for your leadership on this and for your vision. And I'm happy to support you. And if somebody has not yet taken the motion, I would like to.'",
        "'speaker_1': 'September 15.'",
        "'speaker_2': 'I believe. Councilmember Councilmember. Okay. And I should have gone to her to comment.'",
        "'speaker_1': 'Okay. Thank you. Thank you for that clarification. And again, thank you for your leadership on this.'",
        "'speaker_2': 'Certainly. Thank you, Councilmember Ciro.'",
        "'speaker_1': 'Yes. And I, too, want to thank Vice Mayor Richardson for bringing this item forward and his leadership in ensuring that we're making alignments and modernizing the way that we address inequities in our city as it relates to the framework for reconciliation.'",
        "'speaker_1': 'And we have made a lot of changes to the Office of Equity, such as moving it to the city manager's office, expanding it in staff size. And I think it's also important that we also do that at a commission level to ensure that there is an alignment on the human relations side and making sure it's relevant to'",
        "'speaker_1': 'the time and the current environment we're in. And, you know, human relations is a lot about addressing and improving interpersonal relations among individuals and groups. And a lot of the causes are of of it are racism, sexism, homophobia, ableism that's been you know, that causes these differences and challenges we face in ensuring that our communities are united'",
        "'speaker_1': '. And so it makes so much sense to me to ensure that we also have residents and leaders that are that can speak to these issues and address it and give us feedback and that are representing our residents at the commission level.'",
        "'speaker_1': 'So that's why I'm so supportive of this item. And, and I and so thank you very much for all of the community members that committed and gave your feedback. And thank you very much.'",
        "'speaker_2': 'Thank you. Is there any further further council comment, Madam Court.'",
        "'speaker_0': 'That concludes Council comments for this item.'",
        "'speaker_1': 'I also have a Councilwoman Allen. I have a comment as well.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_1': 'I also want to thank Vice Mayor Richardson for his leadership on equity and conservation and to all the community and for their input as well. I signed on to this item because I too believe in equity, just like my predecessors who took timely action last year relating to reconciliation.'",
        "'speaker_1': 'And I want to be respectful to all the valuable work that was done prior to my joining the body. I would also be open to alternative names and look forward to seeing the proposed mission statement and scope of responsibility that ensures that the body continues to be fully inclusive to all of our communities and advocate for the'",
        "'speaker_1': 'protected classes. I do look forward to hearing back in 90 days from the Commission. What's the best way to represent and serve all the diverse communities that have suffered from inequity? Thank you.'",
        "'speaker_2': 'Fantastic. Thank you. Let's have a roll call vote, please.'",
        "'speaker_0': 'And so a woman Sunday has.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman, Councilwoman Ellen.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Pryce. I councilman's a bona.'",
        "'speaker_2': 'Fide.'",
        "'speaker_0': 'Councilwoman, Mongo.'",
        "'speaker_6': 'Right.'",
        "'speaker_0': 'Councilwoman Sara. I'm Councilmember Granger.'",
        "'speaker_5': 'Hi.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_2': 'I.'"
    ],
    "Recommendation to adopt Specifications No. RFP HSD-2020-001 and award contracts to Volunteers of America Los Angeles (VOALA), of Los Angeles, CA, in the total amount of $1,697,179, and Interval House, of Long Beach, CA, in the total amount of $1,375,000, for a total aggregate contract amount of $3,072,179, for providing homelessness prevention and rapid rehousing services through the Department of Housing and Urban Development Federal Emergency Solutions Grant funded by the CARES Act, for a 20-month period beginning on January 1, 2021, and authorize City Manager, or designee, to execute all necessary documents to enter into contracts including any necessary amendments; and   Increase appropriations in the General Fund Group in the Health and Human Services Department by $14,768,725, offset by an expense transfer to the Community Development Grants Group in the Development Services Department.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. Will take the next item. I think it's 20.'",
        "'speaker_0': 'Item 20 is a report from Health and Human Services. Recommendation to award to contracts for homelessness prevention and rapid rehousing services for a total aggregated contact amount. Contract amount of 3.7 mil or 3.0.'",
        "'speaker_2': 'Thank you for the motion and second on this.'",
        "'speaker_1': 'So I can send.'",
        "'speaker_2': 'Okay. I heard the house motion. I heard it sounded like Alan second. Was that right?'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Okay, great. Is there any additional council comment, Madam Clerk? Queued up.'",
        "'speaker_0': 'There's no councilmember queue up for this item.'",
        "'speaker_2': 'Okay. How about public comment?'",
        "'speaker_0': 'Nope. Have a common.'",
        "'speaker_2': 'Right. Let's have a roll call vote, please.'",
        "'speaker_0': 'Councilwoman Sun has.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Allen, I. Councilwoman Pryce, I. Councilman Sabina.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Councilwoman Sara. I council member oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmen Austin Vice Mayor Richardson.'"
    ],
    "Recommendation to receive and file a report on the Hamilton Loop Vision Plan; and, accept Statutory Exemption SE-20-126.  (District 9)": [
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Wishing Karis.'",
        "'speaker_2': 'Thank you. Will have 21 please.'",
        "'speaker_0': 'Item 21 is a report from Parks Recreation Submarine recommendation to receive and file a report on the Hamilton Loop Vision Plan District nine.'",
        "'speaker_2': 'Thank you. Will have a brief staff report.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. Brendan Dennis and Meredith Reynolds are we get the staff report for staff. Thank you, city manager Monica. Good evening, Vice Mayor Richard and members of Council. It's always an exciting moment in the life of a vibrant park system.'",
        "'speaker_2': 'When.'",
        "'speaker_4': 'We can bring together community through engagement. And and really for tonight's presentation show you, I think, a really exciting shared vision. So I'd like to introduce Meredith Reynolds, who's our bureau manager for Urban Planning and Partnerships. Meredith.'",
        "'speaker_1': 'Thank you, Brian. Good evening, ma'am. Mayor and members of city council. I'm here this evening to walk you through the Hamilton vision plan. And that will include. Sorry about that. That will include the overview of the vision plan.'",
        "'speaker_1': 'Existing conditions are include the process of community engagement, the vision plan concepts and next steps. The Hamilton loop is a greenbelt connector that includes the embankment on the north and south sides of the 91 Freeway and provide an opportunity for this area to be connected through this greenbelt on those two neighborhoods on the north and south.'",
        "'speaker_1': 'This community driven effort was really a creative way to attempt to use landscape to re-envision the very infrastructure that has long divided and isolated these communities. And in particular, this area of North Long Beach has approximately 8.9 acres of open space per 1000 residents, comparatively to the 5.6 average acres per thousand city wide.'",
        "'speaker_1': 'This is a project that was derived from the Uptown Open Space Vision Plan, which was previously presented to the City Council in 2018. It is a part of that project. The Hamilton Group was the top prioritized project that came out of that effort, and that effort was predominantly driven by the Coalition for Helping to Reform Beach, which'",
        "'speaker_1': 'we thank for their participation in prioritizing this project and was also the recipient of a Health Department Kaiser Healing Zone grant that funded this vision plan. So with the boundaries of the full project would take you on the West from Atlantic East all the way to cherry.'",
        "'speaker_1': 'And the first phase of this project is focused on Myrtle to Walnut on the north and south side of the 91 Freeway. A lot of existing conditions here that we're taking into consideration and a park assessment. Some include some of the demonstration projects that the neighborhood groups and the Coalition for Helping on Beach have installed.'",
        "'speaker_1': 'And so this concept is to further build out some of that open space that is walkable, that provides carbon sequestering plants and trees, and really provides that connection. The opportunities and constraints were identified through this community process and certainly this is able area to improve with open space.'",
        "'speaker_1': 'However, the property is owned by California Department of Transportation and has some limitations as to what you can do there. So as you will see as we get through the presentation, this vision planners is really focused on what neighborhoods serving moneys could be walked to from the adjacent neighborhood to get sort of free, healthy outdoor access.'",
        "'speaker_1': 'Here's the timeline from when we started the project in November of 2019 and went through a series of site analysis, multiple workshops producing the final the final vision plan, and having some discussions and negotiation with Caltrans and Metro.'",
        "'speaker_1': 'I related to access to the property and the project was all our vision plan was also presented to the Parks and Recreation Commission in November of 2020 as it was forwarded to you all this evening. I'm going to go through a lot of these slides very quickly, but just to demonstrate sort of the effort that the community'",
        "'speaker_1': 'went through on this and look at the existing conditions analysis from a variety of other plans, including L.A. County needs assessment and park score. And the park need map is directly from the Los Angeles County Parks Needs Assessment from 2016.'",
        "'speaker_1': 'We take a look at demographics when we do these mission plans as well from population age as a vehicle access, language, isolation and diversity. And we go through a series of co-created, community led, inclusive engagements. We had eight public workshops and stakeholder meetings.'",
        "'speaker_1': 'We received 62 community surveys, and the project generated 12 ideas for park elements, which we will show you here today. We prototyped this project with the Uptown Open Space Vision Plan, with the color block walk. For those who remember, this was sort of a mashup of a community planning charrette and a color run.'",
        "'speaker_1': 'So this is a very interesting way to get the community out and about. That is sort of more more creative than your typical park planning charrette. We had a community survey that we started off our process that asked about desired amenities and the look and feel of the space and the community.'",
        "'speaker_1': 'Survey results really helped guide the final vision plan from where the amenities should be distributed, what kind of walkway and pathway and landscaping. Folks wanted to see what the primary goals were for the freeway underpasses in terms of making them safe and welcoming, as well as rethinking the public right of way adjacent to the embankment, including bike'",
        "'speaker_1': 'lanes and traffic configurations. TV as well as smaller and larger amenities folks wanted to see. There's an open space activity which then allowed people to design their own kind of loop connector and use precedent images to display people's desires in terms of amenities and look and feel of the space.'",
        "'speaker_1': 'Here you will see the cross-section of what the community proposed for the roadway configuration to generate some additional space for amenities. So we took a look at the actual six feet of embankment, the four feet that would be dedicated for some form of ADA compliant sidewalk.'",
        "'speaker_1': 'The other additional square footage of or linear feet of the right of way resulted in the community wanting to see the roadway going one way with an adjacent bike lane that connected to the existing orange and proposed bike lanes in North Long Beach.'",
        "'speaker_1': 'They the community was able then to see everyone's proposal and refine those ideas. And those refined ideas were presented as part of one of the evening events at the Michelle Obama Library. We had 58 participants come out and share their information with us, and that really helped us to refine the final idea.'",
        "'speaker_1': 'We had a lot of participation from community members and we asked for some of their quotes. And you can even see one here from one of the leaders from the Hamilton Neighborhood Association. Here is the list of the community amenities as desired and located even by the community being very cognizant of adjacent neighbors and the age groups'",
        "'speaker_1': 'and abilities of the different community members. Even placing things like picnics, picnic areas in areas where families congregate. Playgrounds next to multifamily buildings where there's not a lot of open space for children. And being really cognizant about the connection, the North and South connection under Myrtle, Orange and Walnut in a way that is safe and welcoming and'",
        "'speaker_1': 'accessible and did include all of the design plans from public works for the Orange Avenue Bikeway. Here is a rendering of some of the baseline elements in the larger image on your right, and the smaller images on your left are precedent images from a similar space along the 91 freeway in other cities to the west of Long'",
        "'speaker_1': 'Beach and to the east of Long Beach. So there is a precedent for Caltrans and Metro allowing and even helping with these types of projects in those areas, which is helpful for us. Here's another rendering as well, which shows a different view of what could be possible.'",
        "'speaker_1': 'And so you see in the larger image on the left hand side of the drive aisle, a parking lane, a one way traffic aisle, a buffered bikeway, a bilingual parkway, as well as then trees, carbon sequestering trees, drought tolerant landscape, and a little neighborhood plaza.'",
        "'speaker_1': 'If you look at across all of the project elements, there are a variety of things here that can be phased in over time. And so we are estimating all in this project that over the years could cost upwards of $9 million, but certainly something that would be eligible for county state funding for parks and open space, as'",
        "'speaker_1': 'well as some potential opportunities from the Port of Long Beach Community Grants Program and other sources like Measure County, Measure W, local measure A or cultural philanthropy and foundation funding. Finally, for next steps. The first thing we need to do to get permission to access the property is to apply for a Caltrans permit as we work through'",
        "'speaker_1': 'design and seek funding for construction for the project. Project funding is going to be critical. We don't have any funding at the moment, but as I mentioned, this is likely eligible and competitive for a variety of grant grant dollars moving forward.'",
        "'speaker_1': 'And we have already begun those discussions with Caltrans and Metro related to what would be needed for that access permit to make the project successful in their engineering and design, would make the project shovel ready and be able to go out to bid with the associated project funding.'",
        "'speaker_1': 'And then finally constructing the Hamilton Loop project itself would be the final step. So with that, I conclude the presentation and myself and director Brant Dennis are available for any questions. Thank you.'",
        "'speaker_2': 'Thank you for the presentation, Meredith. I don't have any questions or some brief comments. First, thank you for acknowledging the community's work on this. You know, it started with the conversation about how in part that expanded to a larger conversation about the lack of open space in the north lobbies area.'",
        "'speaker_2': 'And then that turned into a vision plan. And from that vision plan, multiple efforts have spun off to the force vision plan we just brought to council the Hamilton Loop, and we'll look forward to continue with those. The plan sets the stage for the funding and to members of the council.'",
        "'speaker_2': 'I've seen, you know, different areas of town do the very same thing. Drake Park, the Drake Chavez expansion started with the vision plan still has to work out and he was there and that ultimately turned to that grand vision.'",
        "'speaker_2': 'And we need to continue to do these things. One note I know there's a I know there's a discussion about freeway modernization on 91. We know that that may create opportunities here, but that is separate and distinct from this.'",
        "'speaker_2': 'We're going to move forward and pursue funding for this project, whether there's a freeway modernization or not. That's an important point for me to for me to raise. And so I'm excited for this. I look forward to the future of this project, and I'm happy to make make the motion on this item.'",
        "'speaker_2': 'Is there a second?'",
        "'speaker_1': 'Second sorrow.'",
        "'speaker_2': 'Thank you. Second sorrow. Does any council comment on this?'",
        "'speaker_0': 'Councilwoman Sandy has.'",
        "'speaker_1': 'Yes. Thank you, madam. Madam, quick. I just wanted to say how excited I am for this. And thank you to Meredith for that great presentation and for Director Denis. I think that it's very important, like we said, vice mayor, to have these kind of visions and it's very important to bring this kind of open and green space'",
        "'speaker_1': 'to our communities. So I wholeheartedly support this item.'",
        "'speaker_2': 'Thank you. Any other any additional comment that Councilman Austin. Yeah, I'm.'",
        "'speaker_6': 'Unfortunately, I wasn't able to see the presentation.'",
        "'speaker_2': 'Because my phone.'",
        "'speaker_6': 'WebEx is.'",
        "'speaker_2': 'The app is acting up. But I did read the item and and this is good work by.'",
        "'speaker_6': 'Parks and Rec Department.'",
        "'speaker_2': 'Meredith Windsor is the best.'",
        "'speaker_6': 'She's going through park planning processes.'",
        "'speaker_2': 'With us in the North Long Beach area, Davenport Park, which was screen another seven acres, as well as our 51st Street greenbelt that is along the lower L.A. River.'",
        "'speaker_6': 'I had a question for.'",
        "'speaker_2': 'Parks regarding the.'",
        "'speaker_6': 'Point.'",
        "'speaker_2': 'Nine parks per 100,000 residents. Wasn't that that number? Part of a.'",
        "'speaker_6': 'Study in.'",
        "'speaker_2': '2005? Is that the most recent update in terms of acreage per resident?'",
        "'speaker_1': 'Councilmember Alston, this is Meredith. The point nine acres per thousand is the number that comes from the uptown open space vision plan. That number varies by the type of land area that we include, whether it's by a district or a census tract.'",
        "'speaker_1': 'So if there is a more specific neighborhood or census tract you would like to look into, we're happy to provide that. But the point nine acres is from the uptown open space mission.'",
        "'speaker_6': 'Okay.'",
        "'speaker_2': 'So I know that that was a number that was quoted quite, quite frequently recently. And so I'm just I want some clarity on that because I know we've added quite a bit of open space within the last few years.'",
        "'speaker_2': 'Well, actually, last ten years or so, since a lot of that, when was the uptown open space plan developed? Can remind me.'",
        "'speaker_1': 'Yes. The Uptown Open Space Vision Plan was presented to the Council in 2018, summer of 2018. And so the number that number is several years old, but likely wouldn't have increased significantly given the landmass and the amount of park acreage added.'",
        "'speaker_1': 'So for instance, that already included the forest wetlands. In that particular district. What if you if we wanted to do another number citywide, if we look to update that every year in the winter when we provide our updated numbers to the trust for public land for their park score study.'",
        "'speaker_2': 'Okay. And do we know our citywide number yet?'",
        "'speaker_6': 'Whereas our.'",
        "'speaker_1': 'City wide. Sure. Citywide average as of last last calendar year. Report for test for public lands which was 2019 was 5.6 acres on average per 1000 residents. That's a city wide number. And then just as a reminder, our open space element has a goal of eight acres per thousand.'",
        "'speaker_6': 'All right. Thank you.'",
        "'speaker_2': 'And in terms of this this project, this is great visioning.'",
        "'speaker_6': 'There's a plan in place, and.'",
        "'speaker_2': 'We know we've done it during a lot of planning. Is there any idea as to what this will cost, to what it's actually developed? And the reason I ask.'",
        "'speaker_6': 'Is because.'",
        "'speaker_2': 'I know that there there are a number of competing projects along the L.A. River. Right. Consistent with the lower L.A. River Task Force plan. And now we have the L.A. County River Master.'",
        "'speaker_6': 'Plan, and we have our own North Long Beach plan in place.'",
        "'speaker_2': 'What what what what does it what.'",
        "'speaker_6': 'Would it cost to to to.'",
        "'speaker_2': 'Develop a site like this? And where would we get the resources?'",
        "'speaker_1': 'Councilmember Alston. The proposed anticipated cost of the full project for the Hamilton loop at buildout is approximately $9.3 million in today's dollars. The multiple sources that could potentially be available for a project like this that would be eligible and competitive include a local measure, a county measure, a county measure W, which is a stormwater measure along with'",
        "'speaker_1': 'state parks funding under Prop 68. That includes a variety of parks and open space funding in addition to any other agency that receives funding for elements of the L.A. River Master Plan, such as the Rivers and Mountains Conservancy, California Coastal Conservancy, etc..'",
        "'speaker_1': 'So this is one project on the list with many others that we prioritize and evaluate for what would be most eligible and competitive and what is timely and shovel ready as those opportunities come forward.'",
        "'speaker_2': 'Thank you so much, data that answers my questions for now. Appreciate it. Good work. In addition, any additional comments from the Council?'",
        "'speaker_0': 'No council comment.'",
        "'speaker_2': 'Thank you. How about public comment?'",
        "'speaker_4': 'Yes. We have Hilda Gaytan.'",
        "'speaker_1': 'Hi. Can you hear me?'",
        "'speaker_4': 'Yes. Please begin.'",
        "'speaker_1': 'Good evening, ladies and gentlemen.'",
        "'speaker_6': 'Council member and TV staff.'",
        "'speaker_1': 'My name is Hubert, very bent. And Hamid, resident.'",
        "'speaker_6': 'And the chair of the Coalition for General on this. Five years ago, as a.'",
        "'speaker_1': 'Member of the coalition and as a president of the.'",
        "'speaker_6': 'Coming from Mubarak reconciliation.'",
        "'speaker_1': 'I presented for the first time the coming from Leucadia I the on of this idea. I want to think by.'",
        "'speaker_6': 'Reach out from serious stuff and to.'",
        "'speaker_1': 'Actually what I cannot be more pleased.'",
        "'speaker_6': 'With the defense.'",
        "'speaker_1': 'Document you are receiving today.'",
        "'speaker_6': 'My concern, our building was included in the third paragraph.'",
        "'speaker_1': 'On the second page.'",
        "'speaker_6': 'From the Civil Report.'",
        "'speaker_1': 'And the.'",
        "'speaker_6': 'Comments from previous staff.'",
        "'speaker_1': 'And a board member from the Hamilton.'",
        "'speaker_6': 'Neighborhood Association. During an interview with The Longest Path on January 15th.'",
        "'speaker_1': 'That is my understanding.'",
        "'speaker_6': 'Imply.'",
        "'speaker_1': 'That.'",
        "'speaker_6': 'The.'",
        "'speaker_1': 'Hamilton goal is tied to the 91.'",
        "'speaker_6': 'Freeway expansion project. I have seen a copy of a petition.'",
        "'speaker_1': 'Signed by many of the Huntington.'",
        "'speaker_6': 'Residents providing that Richardson City clear.'",
        "'speaker_1': 'And on their.'",
        "'speaker_6': 'Behalf. I'm here to ensure, you know, our position.'",
        "'speaker_1': 'On this item. There is no coming from neighborhood support.'",
        "'speaker_6': 'The homicidal passive acidification project. The project will provide a sense of happiness.'",
        "'speaker_1': 'And feel good about their environment.'",
        "'speaker_6': 'It will promote pride.'",
        "'speaker_1': 'And sense of love and sense of well-being.'",
        "'speaker_6': 'For the residents.'",
        "'speaker_1': 'Of the area. We oppose the 91 city rate expansion. Expanding the freeway will bring more health problems to a.'",
        "'speaker_6': 'Community that is already suffering for its high levels of obesity, asthma and heart problem. We are plus four.'",
        "'speaker_1': 'Because that's where they come from. Besides, so the Navy wants.'",
        "'speaker_6': 'To be where you spend here. We are asking the council to approve the Hamilton law.'",
        "'speaker_1': 'I sent along.'",
        "'speaker_6': 'Projects with.'",
        "'speaker_1': 'No ties to the Navy. One year.'",
        "'speaker_6': 'Suspension because no.'",
        "'speaker_1': 'Determination has been made about.'",
        "'speaker_6': 'The.'",
        "'speaker_1': 'Expansion and the.'",
        "'speaker_6': 'Alternate possibility of a no deal option.'",
        "'speaker_1': 'That concludes my comment, and thank you very much.'",
        "'speaker_4': 'Think your next speaker is Kirk Davis.'",
        "'speaker_6': 'Good evening, Vice Mayor Richardson. City Council, City Staff. My name's Kurt Davis. I'm a ninth District resident. I'm also a past co-chair of the Coalition for Healthy North Long Beach. I've been in conversations with Meredith today, and I'm very happy for the replies she sent back to me.'",
        "'speaker_6': 'But my concerns will always lean towards the health and welfare of the community.'",
        "'speaker_4': 'I've been in.'",
        "'speaker_6': 'Favor of the loop since it was proposed successfully at the L.A. County Parks Assessment over five years ago. But I'm also concerned with the second page, paragraph three, that's being set to be filed today, accepted and filed because of the language in it, talking about the freeway expansion.'",
        "'speaker_6': 'And also, as Hilda brought up the article in the Long Beach Post on the 16th where where we're net mesa from Hamilton Labor Association and Meredith Reynolds noted that Caltrans upcoming plan to expand the 91 freeway could benefit the development of the park.'",
        "'speaker_6': 'And Mesa also said that while there is some pushback from nearby residents against the freeway expansion, she believes the benefits are worth it.'",
        "'speaker_4': 'Although no one.'",
        "'speaker_6': 'Wants to see the freeway expansion, the tradeoff is worth it. Well, I don't agree that the tradeoff is worth it. And I know that Councilmember Richardson also brought up the fact that this park space will not be tied in to the expansion.'",
        "'speaker_6': 'But on a letter we received dated December 11th, 2020 from Caltrans, it's a notice of availability of a draft, initial study, environmental assessment, not some attempt to adopt a mitigated negative declaration, which I guess they want to seek exemption to do this project.'",
        "'speaker_4': 'On the 91 freeway.'",
        "'speaker_6': 'There are two alternatives under consideration, and I know that they have to have these two alternatives, but there is a no build alternative.'",
        "'speaker_4': 'And a one build alternative. And we're hoping when it comes down.'",
        "'speaker_6': 'To it that the city can support the Hamilton neighborhood for a no build alternative for this project and.'",
        "'speaker_2': 'Also the ability to get this part done in our neighborhood.'",
        "'speaker_4': 'Thank you. Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'Thank you. So just address a few of these things, then we'll go to the boat. So first, the 91 freeway modernization project has been in the works for for for over a decade. And this project was proposed as a part of the Uptown Open Space Plan.'",
        "'speaker_2': 'Two separate efforts. And the reason why there was an open space plan is because of the statistic that was just debated, whether it's 0.9% or 1.1% for 10,000 residents. The fact is there's no open space, particularly in that area, is bisected by freeways dividing the community.'",
        "'speaker_2': 'It's been the freeway has been there for four decades and the community has already. The Hamilton neighborhood has already began doing guerrilla sort of guerilla modernization and, you know, doing pocket parks themselves on this embankment. If we have to live with the freeway, we might as well take ownership over the landscaping and the walkability of there.'",
        "'speaker_2': 'And so this was presented there. Now, that outreach around the 91 freeway modernization is led by Caltrans. The city is not formed. A decision on where we stand on that, that's a separate project. What we're voting on today is simply on the city council received filing this presentation from the Parks and Rec Commission on the Vision Plan'",
        "'speaker_2': ', and I think there will be more conversation about the 91 freeway modernization. The reference in the report is to early action. That is very different. There's funding set aside for early action. This project cannot be unlinked from the freeway.'",
        "'speaker_2': 'It is a part of the freeway embankment and therefore is eligible for lots of funding, including 91 modernization. That's important to say. The second thing I'll say is whether the park space is 0.9% or 1.1%. The last message I would want to send out to the public is to discourage conducting these visioning plans simply because of budgetary'",
        "'speaker_2': 'concerns. One of the reasons why we don't have very much open space in these areas is because budget is a barrier. But what we found is by conducting these vision plans and engaging the community in getting projects shovel ready, it makes us more competitive to change the name, change the narrative.'",
        "'speaker_2': 'And these approaches have been successful in North Long Beach. They've been successful downtown. And we will hope to see a more comprehensive plan that ties the West Side livability plan to the L.A. River, to the Uptown Open Space Plan, so we can think more comprehensively about the plan.'",
        "'speaker_2': 'And so that's it. We'll go ahead and go to a roll call vote on this.'",
        "'speaker_0': 'Councilwoman Zendaya's. Councilwoman Ellen.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Sabrina.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Councilwoman Mongo.'",
        "'speaker_6': 'My.'",
        "'speaker_0': 'Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Muranga. Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you. I think we have one more item, Madam Clerk.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 5.95, related to third-party food delivery service fees; and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Citywide)\n(Emergency Ordinance No. ORD-21-0005)": [
        "'speaker_0': 'Um. We have two more items.'",
        "'speaker_2': 'Two more. What's your next.'",
        "'speaker_0': 'Item? 24 is a communication from City Attorney Recommendation to declare ordinance amending Title five of the Long Beach Municipal Code related to third party food delivery service fees and declaring the urgency thereof. Read the first time and lead over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_2': 'Thank you. Let's hear from staff.'",
        "'speaker_4': 'Thank you. Mayor Monica Kalita from the city attorney's office from present Monica.'",
        "'speaker_1': 'Good evening, City Council. For your request, we've prepared an emergency ordinance to add Chapter 5.95 third party food delivery service fees to the Long Beach Municipal Code. This ordinance would prohibit a third party food delivery service from doing the following charging a retail food establishment a delivery fee totaling to more than 15% of the total purchase price'",
        "'speaker_1': 'of each online order, charging a retail food establishment any amount designated as a delivery fee for an online order that does not involve the delivery of food or beverages. Charging a customer any purchase price for a food or beverage item that is higher than the price set by the retail food establishment and or reducing the compensation rates'",
        "'speaker_1': 'paid to drivers or garnishing gratuities due to these limitations. This ordinance would also require third party food delivery services to disclose, in plain conspicuous language, any amount charged to a customer at the time a final price is disclosed.'",
        "'speaker_1': 'A violation of the ordinance could result in civil and or criminal penalties. And lastly, this ordinance would be reported on every 90 days by the city manager or designee to determine whether the chapter is still necessary based on the city's recovery from the health and economic impacts of the COVID 19 pandemic, at which point in time the'",
        "'speaker_1': 'city council will determine the chapter's expiration date. Thank you. And that concludes my report.'",
        "'speaker_4': 'Vice mayor, this city attorney on this item, we will require two votes. The first vote would be on the urgency of the ordinance that would go into effect this evening or today. And then the second vote on the ordinance itself, you will see the ordinance come back at your next meeting on February 2nd for the second reading'",
        "'speaker_4': ', as we will pass it both as an urgency ordinance and as a regular ordinance, and with that staff and the city attorney's office. Stand by for questions.'",
        "'speaker_2': 'Thank you. Let's go to let's go to public comment on this. Is there any public comment?'",
        "'speaker_4': 'Yes. Our first speaker is Karen Goh. You're in. Go.'",
        "'speaker_6': 'Yes. Hey, that's.'",
        "'speaker_2': 'The killer on the 908 and Stacey's district. I'm also a member of the board on the Long Beach Restaurant Association. So we're in support of this item 24.'",
        "'speaker_6': 'Reducing delivery fees to 15%. A big reason is, for example, if.'",
        "'speaker_2': 'We sell a burger for $10, the delivery companies take $3. That leaves you with $7.'",
        "'speaker_6': 'Most restaurants in California.'",
        "'speaker_2': 'Make about 6% profitability. So they're already eating into a lot of the profitability. And one would ask, why use those delivery services? Well, the reason why you have to is because they have a monopoly on that delivery service and they have the platforms where people.'",
        "'speaker_6': 'Can order from from their phones. So it's no.'",
        "'speaker_2': 'Choice. So we support it. It favors quick serve pizza places, places that are big on delivery.'",
        "'speaker_6': 'Doesn't do much for full service, sit down restaurants. So we really.'",
        "'speaker_2': 'Need to move at some point to getting patios reopened again.'",
        "'speaker_6': 'But we support this motion.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Think your next speaker is Jeff Roe. Jeff Brown.'",
        "'speaker_6': 'Hi. My name is Jeff from the owner of the Hideaway Restaurant and Ponzu. And rounding third all here in Long Beach. As Kiran said, I'll make this short. It's it's almost impossible with doing take out to make a profit as it is.'",
        "'speaker_6': 'In fact, it is impossible. We're mostly doing it for our staff with these 30%. We actually lose a significant amount of money, at least on these transactions. You know, and the fact that you're not allowing third party services to raise prices above our prices or take it out is another substantial win for not only us, but for'",
        "'speaker_6': 'the customers that use our food. We just ask that if we do pass this and we get into a point where we are open at full, that you consider keeping it on as in the city of Los Angeles, so that we can work towards getting back to some sort of profitability or or breaking even.'",
        "'speaker_6': 'Last comment. Difference between takeout and outdoor dining between November and December, $27,000 to the bottom line. That should say it all. Thank you so much for your time. Appreciate it.'",
        "'speaker_4': 'Think your next speaker is Stephanie Calo.'",
        "'speaker_1': 'Hi. Good evening. Council members and Mayor Garcia. My name is Stephanie. I am the owner of Plunge Restaurant in the second district. I also live here as well. As you know, restaurants are in a really bad way. There has been a lot of activity in our industry about.'",
        "'speaker_6': 'What we.'",
        "'speaker_1': 'Can and can't do legally right now. Item 24 is something that can be.'",
        "'speaker_6': 'Done right now.'",
        "'speaker_1': 'To help my industry and my.'",
        "'speaker_6': 'Colleagues in a quick and painless way.'",
        "'speaker_1': 'I'm asking that you pass item 24. It's limiting the amount of third party.'",
        "'speaker_6': 'Vendors such as DoorDash, Postmates, GrubHub.'",
        "'speaker_1': 'That can charge our restaurants. Some of our restaurants are currently being.'",
        "'speaker_6': 'Charged up to 30%.'",
        "'speaker_1': 'Of the sale. And, you know, we're suffering quite a bit. So while it might not seem like a lot, this extra percentage can be the.'",
        "'speaker_6': 'Difference between it costing us money to serve that meal, meaning actually.'",
        "'speaker_1': 'Losing money by.'",
        "'speaker_6': 'Working or.'",
        "'speaker_1': 'Making it a.'",
        "'speaker_6': 'Sustainable sale. Capping the third party fees for at least.'",
        "'speaker_1': 'One year.'",
        "'speaker_6': 'After the health order is lifted.'",
        "'speaker_1': 'Will help our community owned restaurants stay open. During this time, as you know, tons of them are closing. Our businesses and our community really need all.'",
        "'speaker_6': 'Of the assistance that you can offer us immediately. I'm really.'",
        "'speaker_1': 'Urging.'",
        "'speaker_6': 'That you pass this tonight.'",
        "'speaker_1': 'In the hopes that we can experience a small win and a little relief in our industry.'",
        "'speaker_6': 'I really thank you all for the work that you're doing.'",
        "'speaker_1': 'For us all. I know it.'",
        "'speaker_6': 'Is a really rough.'",
        "'speaker_1': 'Time with everything going on. And and I appreciate your time and your consideration.'",
        "'speaker_6': 'Thank.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'Thank you. Just a few comments. First, I'm happy to talk. So there's a this was brought up initially at the Economic Development Finance Committee meeting where we discussed the first round of reopening after the initial shutdown. Right. Luis Navarro of Lola's who brought up this this discussion staff has done a good job researching this.'",
        "'speaker_2': 'They've engaged with the industry and the restaurant sector to make these recommendations. You have a quick question. How do we resolve the issue on of where this when this policy would sunset?'",
        "'speaker_5': 'Yeah. Hi, Councilmember, this is John Keisler. So in this is similar to the worker protection ordinances the council passed earlier this this past year. And essentially, if the conditions.'",
        "'speaker_4': 'Still exist as that that warranted this urgency ordinance, then staff will come back to council every 90 days in writing to either confirm or recommend a change.'",
        "'speaker_2': 'Great. I think that I think that makes sense. I'm happy to make this motion. Who's who is there a second on the motion?'",
        "'speaker_1': 'To her long.'",
        "'speaker_6': 'Ago.'",
        "'speaker_2': 'Okay. I know Mungo's a member of the committee. I'm going to recognize Mongo as the second on this motion. Mango, would you like to speak to the motion council member?'",
        "'speaker_6': 'Yes. I'm very supportive of this item. And I really appreciate all the restaurant owners that have reached out and the council for supporting this. I know it's taken a bit of time, but it's important and I'm proud to be supporting it now.'",
        "'speaker_2': 'And that's it. Thank you. Council Members and Day House.'",
        "'speaker_1': 'Thank you. Thank you, Vice Mayor. Thank you, Councilmember Mongo, for this and that and the committee for actually acknowledging and working really hard with city staff to bring something like this forward. I think this is this really is urgent right now.'",
        "'speaker_1': 'As you know, our small businesses or restaurants are suffering greatly during this pandemic. And even though this is a tiny, tiny fix and it is and it brings me a little bit of hope for restaurants. And I, you know, just hearing from from the restaurant owners right now.'",
        "'speaker_1': 'And I was really compelled by their stories. I'm seeing how some of them have gone up to even 30% of their sales. And I think it's it's a really hard time for small restaurants as it is right now.'",
        "'speaker_1': 'And anything that we could do as a council to help and support our our small businesses, our restaurants, I think is essential. So, again, thank you to your to the committee, to both you vice mayor and Councilwoman Mango for bringing this very important item forward.'",
        "'speaker_2': 'Fantastic. Is there an additional council comment?'",
        "'speaker_0': 'Yes. Councilwoman Allen?'",
        "'speaker_1': 'Yes. Thank you, Vice Mayor and Councilwoman Mongo and all of the restaurants that that spoke. I know this has been really a hard time for everyone and I strongly support this p e because we'll provide that economic relief to food establishments, including our small, independent family owned and minority owned businesses.'",
        "'speaker_1': 'And as we all know, this pandemic has hit our economy hard and lots of folks are just struggling to get by and they're more likely to order food and even order more items from the restaurants if they're not being being charged.'",
        "'speaker_1': 'And I also want to say that many of our residents are depending on these delivery services. I received a letter from the Dolby in support of this item, and I also want to thank them for their continuous civic engagement.'",
        "'speaker_1': 'And overall, oh, this is just a strong business and consumer protection piece, and it has my full support.'",
        "'speaker_2': 'Thank you. Any additional?'",
        "'speaker_0': 'No council comments.'",
        "'speaker_2': 'Fantastic. We already took public comment on this, so I think it's pretty straightforward. Council gave direction. We know the situation with our restaurants. We know this is something we can do this in alignment with our inclusive recovery that the city's charting.'",
        "'speaker_2': 'So that's it. Let's go ahead with the roll call.'",
        "'speaker_0': 'Councilwoman Sun has.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilwoman Ellen.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Councilman Spinner. I Councilwoman Mango.'",
        "'speaker_1': 'Hi. Councilwoman Sarah I.'",
        "'speaker_0': 'Councilmember Aranda. Councilmember Muranga. Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Fantastic.'",
        "'speaker_4': 'Let's have our panel. I'm sorry, Vice Mayor. That was the first vote on the urgency. We need a roll call vote on the ordinance itself. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Same maker in second year of the motion.'",
        "'speaker_2': 'Same maker and secondary.'",
        "'speaker_0': 'Roll call vote for the ordinance. Councilwoman said they have.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'Councilwoman Allen.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman sapna.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'Councilwoman Sarah.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council Member Ranga.'",
        "'speaker_5': 'Eye.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_2': 'I.'"
    ],
    "Recommendation to request City Attorney prepare a resolution condemning the insurrection and violence that occurred at the United States Capitol on January 6, 2021.": [
        "'speaker_0': 'Bush and Kerry's.'",
        "'speaker_2': 'Thank you. Our final item, please.'",
        "'speaker_0': 'Item 28 is communication from Councilmember Ranga. Councilwoman Sunday has Councilwoman Allen Vice Mayor Richardson recommendation to request city attorney to prepare a resolution condemning the insurrection and violence that occurred at the United States Capitol on January six, 2021.'",
        "'speaker_2': 'Thank you. I'm going to recognize Councilmember Arango from the motion. Who's the second? Sun has company in Tauranga.'",
        "'speaker_5': 'Your comments take us back. Richardson. First of all, I want to thank my colleagues for staying with me. I also want to thank Congressman, but also Congresswoman Nancy Levitt of Oregon State Senator Dina Gonzalez for sending their letters of support of the sale.'",
        "'speaker_5': 'This unit since November 3rd, 2020 124. President Trump spreading misinformation about the 2020 election. He has claimed without evidence that he won the election. Courts around the country have debunked these claims. 61 campaign lawsuits have been filed. And none of these lawsuits found evidence of widespread voter fraud.'",
        "'speaker_5': 'January six was meant to be.'",
        "'speaker_2': 'A day when the.'",
        "'speaker_5': 'Routine procedure of counting intellectual ballots and certifying the election of President elect Joe Biden was to take place. It was anything but routine. Earlier that day at the urging of President Trump and with the help of his enablers, rioters stormed the Capitol in hopes of stopping the count, changing the vote and declaring Trump the winner of the'",
        "'speaker_5': 'election. What we have learned over the period of the last two weeks is that the event was planned and orchestrated and an insurrection that threatened the very lives of members of Congress and the president and the vice president of the United States, and that it resulted in the loss of five souls.'",
        "'speaker_5': 'Consequently, I mean, courageously, Vice President Pence and the United States legislature were not intimidated by the violence. I reconvened later that evening to ensure that the votes of the Electoral College were counted. When these insurgents stormed the United States Capitol, they were attacking the very idea of democracy.'",
        "'speaker_5': 'It is important that we stand united in defense of democracy. I urge my colleagues to join me in condemning the violence and desecration of the United States Capitol building that took place on January six, 2021. And I also urge you to join me in condemning.'",
        "'speaker_5': 'The actions and inactions of President Donald J. Trump that led to the lawlessness in the United States Capitol. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Gringa, I mean, council members. And they have.'",
        "'speaker_1': 'Thank you, Vice Mayor. I really want to thank Councilmember Otunga for bringing this item to council today. I know I'm speaking for each of us and expressing how horrific it was to watch the events on January six unfold before our eyes.'",
        "'speaker_1': 'The act with this act of terrorism was just a horrible, horrible, horrible attack on the values of our democracy and the peaceful transfer of power. And the only thing that that's more difficult to me is, is to the understanding on just how horrible this attack was, just watching it on TV.'",
        "'speaker_1': 'I was I was broke and I felt helpless. And I am sure that a lot of our residents felt the same way. It was such an invasion to all of us. It was such a horrific hit to all of us.'",
        "'speaker_1': 'We are a country that as a group that has great gratitude to our to those who step up and become lawmakers and to be who become the press and who are officially working to protect our nation, our nation's capitol.'",
        "'speaker_1': 'And that day was just horrified to see everybody scramble and everybody fear for their lives. I will never be able to shake off the fear in their faces of our of our elected officials that were on in that floor that day.'",
        "'speaker_1': 'And with that, I just want to say thank you again. And I join Councilmember Rotunda. And in condemning that day for what happened, that horrific terror terrorist act that happened against our capital.'",
        "'speaker_2': 'Thank you. Any city council comments? Madam. Madam Clerk.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_1': 'Thank you, Madam Clerk. I want to thank Councilman Ranga as well for bringing this item forward. I know some of my colleagues, I that I've shared this personal story with know this, but some probably don't. And some members of the public may not know it at all.'",
        "'speaker_1': 'But when I was seven years old, I was living in the country of Iran, and we were going through a political revolution. And I remember the day right before my mother and I left the country, when my mother and father were late picking me up from school and I was hiding under the desk of the school principal'",
        "'speaker_1': 'with the principal waiting for my parents to pick me up. And when wait, when they got there and we went through the streets, the streets were just crowded with people we could barely get our car through. There were trash cans filled with fire.'",
        "'speaker_1': 'There were burning books related to the existing government trying to bring in a new government. And watching what I was watching on the sixth was the first time since I was seven years old. That's 41 years that I recall the vivid scenes from that day, the way that I did.'",
        "'speaker_1': 'I mean, it was just to me, it just was a reminder of an unstable government. And that made me so sad. And I know that a lot of Americans felt that way, and I know a lot of Persians felt that way because that's exactly the environment that we all fled.'",
        "'speaker_1': 'And there's no doubt in my mind that if the people who were climbing the walls of that building looked anything like me or some of my male relatives. There is no doubt in my mind it would be called terrorism or in the mind of anyone from my community.'",
        "'speaker_1': 'And so what happened to our nation on that day was horrific. It was unbelievable and completely unacceptable, regardless of what political party you're in or who you supported for president. And I'm grateful for Congressman Lowenthal and Congresswoman Barragan, who have kept in communication with me since that happened, because my very first thoughts went to them when I'",
        "'speaker_1': 'was seeing all of this unfold because they were there and I was safe here. So. I appreciate Councilman Ranga bringing this forward. This is not a partizan issue. This is an American issue. And countries that are unstable politically and are fractured go through things like that.'",
        "'speaker_1': 'America should never go through a thing like that. That's why those of us who fled unstable governments worked so hard to make this government, our government, great and strong. So thank you so much for bringing this forward.'",
        "'speaker_2': 'Thank you. Is there any additional comment?'",
        "'speaker_0': 'That concludes council comment.'",
        "'speaker_2': 'Thank you. I'll add my comments here. First, I want to thank Councilman Turanga for bringing this forward. I know and I want to thank the city council members for their for their comments.'",
        "'speaker_1': 'Are.'",
        "'speaker_2': 'Certainly.'",
        "'speaker_1': 'Going to do it now.'",
        "'speaker_2': 'Councilmember Okay. All right. I'll get my comments. And I think Councilmember Alan Watts wants to speak. So to be brief, I certainly agree with the sentiments of our city council members. I think this is this is, you know, this this transcends politics.'",
        "'speaker_2': 'This was a moment for American unity. And it was a and it really put things in perspective. The scenes were were were they weren't pretty. They were very disturbing to see the Confederate flag flying inside the United States Capitol, particularly now.'",
        "'speaker_2': 'And it just reminds us all that, you know, it may be convenient to turn the cheek on racism or to, you know, be neutral or, you know, these things are I'm not racist and so on and so forth.'",
        "'speaker_2': 'But it's not about whether individuals are are neutral on racism. It's about acknowledging the existence of a violent white supremacist movement that that was put on display for national for the entire world that day. And we need to make sure that we're all on the right side of this thing.'",
        "'speaker_2': 'And we we are clear as a city council that, you know, politics aside, we took an oath to support and defend the Constitution, United States and Constitution in California. And that's why I think this was was appropriate. A lot of times we focus on, you know, the politics in our own backyards, and that's important.'",
        "'speaker_2': 'But this is one of those moments of significance that we need to stand up and say what is right and wrong is wrong. And we have work to do as a country to bring everyone together. I want to acknowledge our our congresspeople for staying in communication with us constantly through this process.'",
        "'speaker_2': 'And I have to say, you know, we you know, the 20 that Wednesday's inauguration can't come soon enough. And we'll look forward to marching together as one community, as one country starting tomorrow. So. So thank you so much.'",
        "'speaker_2': 'Councilmember Allen, were you trying to get in to the conversation?'",
        "'speaker_1': 'Yeah. Just real quickly, I just want to say, you know, I signed on to this item because I believe that in every community and in every corner of our country, we have to speak up against the violence that was perpetrated on our nation's capital.'",
        "'speaker_1': 'In this country, we settle our disagreements peacefully through the democratic and the legal processes. I, i, too, want to thank Councilmember Turanga for taking the lead on this. Him and I had long conversations about this, and it was just a horribly sad day for our country.'",
        "'speaker_1': 'And the inauguration can't come soon enough. I also want to thank Congressmembers Lowenthal and Berrigan and Senator Lena Gonzalez for their support on this item.'",
        "'speaker_2': 'It's fantastic. Is there any public comment on this item?'",
        "'speaker_4': 'Yes, we have Tiffany Deeb. Tiffany Davey.'",
        "'speaker_6': 'Good evening, Mayor. City Councilman Tiffany Daly, District four resident. I'd like to thank Councilmember Ranga and others for bringing this item forward. I support this item in which the city condemns violence and desecration on the Capitol that took place on January six, as defined in the US government community awareness briefing.'",
        "'speaker_6': 'Violent extremism refers to violence committed in the name of an idea ideology to further political social agenda. The ideologies protected force of violence on its behalf is not within the United States. On a local, state and federal level, individuals and communities will face the challenges of violent extremism going forward as a result of ignoring the building extremist'",
        "'speaker_6': 'movement over recent decades. And though much can be said of the role of the individual in the role and engage in forming a resilient community can and must aid in preventing violent extremism, it is imperative we build community capacity to respond and prevent type.'",
        "'speaker_6': 'Encourages city and community members to embark upon this important work, which is also necessary. Creating a local prevention framework in conjunction with the local intervention framework for preventing violent extremism. It can happen anywhere. It is possible that the city may seek similar funding that was available to Callaway.'",
        "'speaker_6': 'USA is preventing violent extremism program Iran in the past three years, funded under Homeland Security Goal ten, which was preventing violent extremism in multi-jurisdictional jurisdiction and the collaboration coordination. Now that programs start to create these plans, which were aimed at preventing violent extremism.'",
        "'speaker_6': 'A community effort. In 2016, white supremacist crimes rose 67% in L.A. County, and over the past six years, hate crimes rose 36% across the county. Now. Tomorrow, we're going to welcome a new administration that's tasked with some of the most grave problems and crises we've seen at such a scale in our lifetime.'",
        "'speaker_6': 'Our collective focus is not yet on healing, but rather addressing this crisis. I look forward. To speaking up when I see him and expecting the same of my community members. Dalton went on to report hate crimes.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_2': 'Thank you for several, probably.'",
        "'speaker_0': 'Councilwoman Sunday has.'",
        "'speaker_1': 'High.'",
        "'speaker_0': 'Councilwoman Allen. High Councilwoman Price.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman Sabrina.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman. Mongo. By Councilwoman Sara.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Oranga.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson. Hi. Motion carries.'",
        "'speaker_2': 'Thank you. That satisfies our agenda. We'll now we'll move to new business. Any announcements from the city council? Just jump in if you have an announcement. All right. Well, hearing done. Thank you all and have a great night.'"
    ]
}