{
    "Recommendation to authorize City Manager, or designee, to execute all necessary documents to enter into an agreement with Art Center College of Design, a California private nonprofit educational institution, to develop a campaign related to unhealthy behaviors surrounding HIV and STDs, for the period of January 1, 2017 through December 31, 2017, for an amount not to exceed $80,000.  (Citywide)": [
        "'speaker_1': 'Which increase.'",
        "'speaker_7': 'Okay. Let's go ahead in here seven real quickly so we can get to the study session. Madam, quick.'",
        "'speaker_1': 'Item seven Recommendations to Authorize City Manager to execute an agreement with Art Center College of Design to develop a campaign related to unhealthy behaviors surrounding HIV and STDs for an amount not to exceed 80,000 citywide.'",
        "'speaker_7': 'Great. Mr. West.'",
        "'speaker_3': 'Yes. Our Health Director, Kelly Colby, will make a quick presentation.'",
        "'speaker_9': 'Good evening, Mayor. I'm mayor and city council members in the city of Long Beach. We have been seeing an increasing rate of STDs and HIV infections. In fact, we've seen rates increasing by 47% for chlamydia and for syphilis, 97% and gonorrhea up to 115%.'",
        "'speaker_9': 'The rates have been really going high, as well as an increase in infections in HIV, though some of those are some of the highest in California, second to San Francisco. So we know that we are really doing a lot of great work.'",
        "'speaker_9': 'And we've been working very closely with L.A. County in its work around bringing Prep, which is a prevention opportunity for HIV, as well as doing a lot of outreach campaigns. We have a grant in right now to L.A. County to also connect to, you know, to bring in additional resource for HIV outreach, connecting, testing and moving forward'",
        "'speaker_9': '. So we have a lot of the work going on, but clearly the weather patterns are right now that we need to be doing some additional systems, doing some shifts in the work that we do. So what the screen allows for as we're requesting to work with design matters, which is at the Pasadena Art Center, and basically they'",
        "'speaker_9': 'pull together experts in the field and students in innovation as well as part of our team to really start to look at different ways and different opportunities to reverse the trends that we've been seeing. So we'll be working closely with them and our community partners, including the care clinic, the center being a star and others to really'",
        "'speaker_9': 'to sit with Pasadena Design Center, to really come up with a new and innovative approach. It will be starting in the spring and move into the fall and will be coming back with a with a new a new campaign process to move forward.'",
        "'speaker_9': 'So we're very excited about this opportunity and we look forward to working with our team members.'",
        "'speaker_7': 'Councilwoman Gonzales, anything to your motion? Councilman Austin. Councilman Price.'",
        "'speaker_8': 'Just real briefly, I know we have a busy meeting tonight, but I just wanted to commend the health department. And Kelly, with your leadership, this is a tremendous opportunity to think outside the box and be creative. I can't think of a situation where we've partnered with a group like this, a design, a creative entity like this, to'",
        "'speaker_8': 'help us deal with a public safety public health issue that's affecting our community. So I'm very grateful that you're doing this. And it's it's a great intro for an item that I will be bringing your way via council in January.'",
        "'speaker_8': 'So thank you very much for this collaboration and for bringing this idea to the council. Thank you.'",
        "'speaker_7': 'Thank you. Any public comment on this item? Case C nonmembers, please go below. I have a public comment. I'm looking for the up here. I'm up here. I'm sorry. Okay. Sorry.'",
        "'speaker_3': 'I think the money should be better. Used to look into why it is that when the gay rights movement at the end of the 1970s was raising end to power, and then all of a sudden somebody created something called AIDS HIV.'",
        "'speaker_3': 'I think the money should be spent to investigate how it is. This appeared out of nowhere. They lied to us and said a monkey bit somebody. What a bunch of nonsense. You know, the truth of the matter is, is that there's a holocaust going on in our country and it's against LGBT people, and they really need to'",
        "'speaker_3': 'find the real reason and the real people behind making people sick and killing all these thousands and thousands of innocent people. It reminds me of what Hitler did to the gay people in Nazi Germany. Only they're not rounding them up and putting them in gas chambers and burning their bodies.'",
        "'speaker_3': 'What they're doing is they're poisoning the virus and the virus can be spread to anybody. And what they need to do is find out how it is this virus magically appeared when the gay rights movement was raising up into power at the end of the seventies.'",
        "'speaker_3': 'And the truth of the matter is, we're going into another dark time with Donald Trump and his dictators who are going to he's picking out a cabinet of the most anti-social or anti-gay people that I've ever seen. If we think we have a problem with HIV and AIDS, what they need to do is find out, yes, educate'",
        "'speaker_3': 'people about their health. We all know that. Okay. But we have to do that. But the thing of it is, is that there's something very wrong in our country where we all complacently sit around. And, yes, I'm against an international airport, but what about the lives of people?'",
        "'speaker_3': 'Isn't that a little more important? It seems like money has become our God and people are worshiping the almighty dollar rather than finding the real problems in our society. Why it is that people are having trouble surviving in our society and how to do better, and that somebody has to stand up and speak out against it because'",
        "'speaker_3': 'it's not going to correct itself and pray. And the gay away doesn't work. They've tried that for thousands of years and they also, by the way, burnt witches and gay people in the Inquisition. And as far as I'm concerned, AIDS and HIV is just something manufactured by some sick human beings who knew how to manufacture viral warfare'",
        "'speaker_3': '. Yes, that's what that is. We have the capability of killing everybody many times over with the amount of poison that this country has generated. And if you don't know that, Google it. And the thing of it is, is that we're heading into another dark age.'",
        "'speaker_7': 'Thank you, sir. Time's all up. Sorry about that. Thank you very much. That concludes the public comment on item seven of the last item on the consent. No other public comment. Members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to conduct a study session to receive and file a presentation on a feasibility study for a Federal Inspection Service (FIS) facility at the Long Beach Airport.": [
        "'speaker_7': 'Okay, great. Thank you. Now we're going to have moving on to the study session as we get started. I do want to make sure there are some empty seats and I think there's some folks out in the lobby.'",
        "'speaker_7': 'I would love an opportunity for if people still need a seat to get a seat. I don't know what the I know our fire guys are trying to keep the. But there are a couple empty seats, if you don't mind.'",
        "'speaker_7': 'If there is an opportunity for some of those folks to sit down, that would be great. And as we do that, we're going to go and transition right into the the study session. So with that, is staff ready?'",
        "'speaker_7': 'Is that are you ready for the study session? Okay. Let's let the other folks come in. All right. Great. Okay, so we're going to turn this over to and begin the study session. So to start that off, I'm going to turn this over to staff who will go through their presentation.'",
        "'speaker_3': 'Mayor council members. As we know last week, we were directed to come back with a study session tonight. So this is our study session regarding the FISA facility at the airport. I'm going to turn this over to our airport director, Jess Romo, who will walk us through the presentation and respond to comments.'",
        "'speaker_3': 'Mr. Romo. Yes. Oh, no.'",
        "'speaker_10': 'Good evening, honorable mayor, honorable council members just from the airport director at Long Beach because of a sudden family emergency of one of our Jacobs team members who was going to present tonight, I will actually be taking us through the PowerPoint slides.'",
        "'speaker_10': 'But we do have members of the Jacobs team here in attendance so that as we go through the evening and if you've got questions on specific topics, they will be here to answer them. The audience we have Dave Tomba and Tavon and Kathleen Brady.'",
        "'speaker_10': 'So at the council's request, you know, we're here to present the item regarding the FISA project at Long Beach Airport. One of the basic questions that I think most people know this at this point, but the Federal Inspection Services Facility is a facility that exists at an airport and is the base of operations for use.'",
        "'speaker_10': 'U.S. Customs and Border Protection. There is also an immigration agricultural component to it. And their purpose is to clear and inspect all flights that are coming from foreign countries into the United States. They all must be cleared by Customs and Border Protection.'",
        "'speaker_10': 'It's a facility that unifies that process where both passengers and baggage is inspected and processed for the safe, efficient flow back into the United States. Specifically, why are we here? Let me provide a little bit of history. JetBlue originally made a request of the city and the airport for the possibility of an office or a customs facility'",
        "'speaker_10': 'back in February 2015. Subsequent to that, the City Council in July of 2015 authorized the fees feasibility study and the release of an RFQ. After that RFQ process, the Jacobs was selected to perform the study in March of this year.'",
        "'speaker_10': 'Over the next few months. The study was was commenced and completed. It was released to the public, to the mayor and council on October 4th, 2016. And this evening we are here to present the findings of that study.'",
        "'speaker_10': 'We knew that it was very important to conduct outreach that was very clear by council and the mayor. And as part of that, too, community meetings were held very early on in the process in March and April of this year.'",
        "'speaker_10': 'And as part of that outreach, Jacobs received a number of comment cards, emails, and then as a follow up, conducted an economic impact survey after the study was was released to the public. We've had two presentations to city commissions, the Airport Advisory Commission on October 20th and the Economic Development Commission on October 25th of this year.'",
        "'speaker_10': 'And tonight is our study session for the city council and the mayor. It was detailed as deliverables for the study to have a number of components and they're listed up here. And really what they are is a market analysis or the demand of is there a demand for international service at Long Beach?'",
        "'speaker_10': 'It was also important to look at the environmental compliant compliance assessment component specific to any environmental work that either has been done or would have to be done as part of this project. An Economic Impact analysis which examines what effect financially the construction and the existence and operation of an IFRS would have to Long Beach and to'",
        "'speaker_10': 'the region. We also had to look at siting alternatives specifically if we were to have an office, where on the airfield would it be situated and followed by that the financial feasibility. If we were to get through all those those components or those aspects, how would it be paid for?'",
        "'speaker_10': 'Who would be responsible for paying for it? How how would it be funded from a standpoint of construction as well as ongoing operations? And then finally, the security risk assessment. What types of additional risks that don't already occur here at along B or at Long Beach Airport might be become part of that new risk scenario if there'",
        "'speaker_10': 'was an FAA developed. So flip that around a little bit and put it in the form of questions, really. You know, these are the questions that this presentation will cover and these are the questions that the study looked at and provided answers to.'",
        "'speaker_10': 'So, number one, is there a demand? What types of environmental clearances, again, have been obtained or would need to be obtained? What's the economic impact? Can it fit? How much will it cost? Who will pay for it? And finally, does it increase security risks?'",
        "'speaker_10': 'Before we get into those components, I want to give a little bit of background because there's been a lot of discussion about how this comports with the noise compatibility audience here in Long Beach. So just a little bit of background and detail for the mayor and council and the audience here tonight.'",
        "'speaker_10': 'Long Beach Airport has the benefit of one of the strictest noise ordinances, not only in the country but in the world. It is codified in our municipal code under Chapter 16.43. It's been in existence since 1995. It's consistently been reaffirmed by the city council.'",
        "'speaker_10': 'And this is the important part. It's a very complex and comprehensive ordinance. But its purpose is to limit aircraft noise. It does not speak to the limitation of aircraft routes. All that said, the stay was very important for the study to really make sure that the noise ordinance was looked in its full form as as they undertook'",
        "'speaker_10': 'all these aspects of the study and accept the noise ordinance as a given. More recently, and at the request of both JetBlue and the city of Long Beach, we letters were sent to the FAA, specifically asking about what impact, if any, there would be on the noise ordinance as a result of looking at the development of of'",
        "'speaker_10': 'an amphibious facility. And both in both instances, in fact, the second bullet point here is a direct quote from the FAA response that basically says The FAA does not find an issue of current noncompliance under anchor or the city's grant assurances.'",
        "'speaker_10': 'Concerns that the introduction of an international service consistent with the current noise ordinance would undermine that ordinance or cause a change in the FAA position toward it are unwarranted. So moving into the first component of the study, which is the market analysis specifically on demand.'",
        "'speaker_10': 'It's it's very important. And I think most people do realize. But, you know, Long Beach Airport is located within a very competitive Southern California market. There are five commercial airports that make up this market in the Southern California region.'",
        "'speaker_10': 'It is also a fact that passenger traffic throughout the five airports has been increasing. Of it at some airports, it's greater than others. I think from a percentage standpoint, John Wayne is probably growing at the fastest rate from a percentage standpoint, but absolute passenger numbers that's actually occurring at L.A.X. and across the board in specific to Southern'",
        "'speaker_10': 'California. International growth is outpacing domestic growth that's been occurring for the last few years. It is worth noting, though, and you'll see some following slides in terms of the the typical breakout of of domestic activity versus international LAX, which is a a very major effect.'",
        "'speaker_10': 'It is probably the major international gateway on the West Coast. Last year saw a 26% of its business came from international traffic. And this year so far international at L.A.X. is is is up about nine and a half percent compared to domestic traffic, which is up at seven and a half percent.'",
        "'speaker_10': 'So the modeling that was looked at in terms of what type of demand we would we would we could see here at Long Beach with the development of an I guess is building out this model over a five year period.'",
        "'speaker_10': 'So this table here really shows that over that five year period, the the top row is the number of seats. Or if you multiply all the the seats in an aircraft by the number of flights in the fifth year, you'd have about 446,000 seats.'",
        "'speaker_10': 'And of those seats, the employments or the people getting on the air or on planes going to international destinations would be about 379,000. Across the board, the ratio is consistent. It assumes about an 85% load factor. So just to kind of put that in very simple terms, that's the percentage of the of the aircraft on average that's'",
        "'speaker_10': 'occupied. So we're looking at, you know, what you'd call 85% of the seats being taken. The study also looked at historical slot utilization over a ten year period. And and it's important to note that that period between 26 and 2015 where the average slot utilization or of the slots there were allocated, about 32 and a half of'",
        "'speaker_10': 'those flights per day were being used. That's 79% of 41 flights because through those time periods, 41 was the number of flights that were authorized. We bring that up. It's important because right below that, it could show clearly that unused allocation within that that set of activity could be provided for to use for international service here at'",
        "'speaker_10': 'Long Beach. Now. From now going forward with the with the increase of through the supplemental slots of 50 flights per day, only four air carriers. The forecast is is showing that in year one, we would estimate six of the 50 flights would be international, which represents about 12% of the total activity.'",
        "'speaker_10': 'And in year four, so year four years four and five, you would you would see that potentially increasing to eight flights per day out of the 50 or 16%. General aviation or private aircraft that could also benefit from having an FAA ice facility on the field.'",
        "'speaker_10': 'That activity really would be very incremental and not not be measurably greater than what we see already. Specifically, and for those that don't know this, there are a number of aircraft that are already arriving at Long Beach Airport that are coming from international destinations.'",
        "'speaker_10': 'The thing is, they have to stop at another airport first to get cleared by customs before they return to Long Beach. So we see more of the benefits on the general aviation side coming in the form of improved efficiency of the airspace.'",
        "'speaker_10': 'I think most most people that live around Long Beach and in the L.A. region in general see that it's a very complex airspace. So with the efficiency of that airspace being managed by having direct access back to Long Beach as opposed to a tech stop before they get here, along with incremental reduction in an emissions.'",
        "'speaker_10': 'And our apologies. It's a very busy table, but this show's over a. A. 15 year period. Actually 14 and a half year period. Across the nation, on average, you see the breakout of domestic travel making up 80% of air traffic and international making up about 20% of air traffic.'",
        "'speaker_10': 'There have been some stated concerns from some members of the public in some of our meetings that if we were to allow international activity here, then it would become a 100% international airport. That really is not the case.'",
        "'speaker_10': 'And again, as I alluded to earlier and stated, L.A.X. being a major international gateway is has by far the largest percentage of the international activity will continue to. It will continue to have that level of activity. So in essence, Long Beach Airport will not become a 100% international airport.'",
        "'speaker_10': 'So we want to look at current and past activity as it relates to seasonal service here. But if you look at at the left, that graphic illustrates our our current route map out of Long Beach. And you can see that it mainly focuses on routes north of Long Beach, up the coast into Seattle.'",
        "'speaker_10': 'And we do have seasonal service to Anchorage. We do have two transcontinental flights to the East Coast, one to Boston and one to New York. Currently Long Beach, sir, by four passengers listed up on the on the slide.'",
        "'speaker_10': 'And they include American Airlines, Delta Airlines, JetBlue Airways and Southwest Airlines. This graphic here shows probable international destinations, and this is based on research done in meeting with carriers that obviously have shown an interest in JetBlue being first and foremost, foremost one of the carriers that has expressed your keen interest in developing some international service out of'",
        "'speaker_10': 'Long Beach. So you can see in the graphic there that from Long Beach, everything goes south into Latin America, Mexico and then into Central America. And it's really the constraint there is is tied to aircraft type, which if you look at the concentric circles, the inner most is a C, R or a regional jet.'",
        "'speaker_10': 'The second circle out is Airbus A320. The third one is Airbus A321. So those correspond with the range of each of those particular aircraft type. So that's that's what we're looking at. We're not looking at flights to Europe or flights to the Far East or really anything that's really that far out.'",
        "'speaker_10': 'Number one, the airfield does not support that type of activity in terms of aircraft type or facilities. Don't support that, which I'll show you in a few slides up ahead. And you know, so based on the current range of aircraft that are used by these by these airlines, that that's the that's the probable area to be looked'",
        "'speaker_10': 'at for international service. Looking at it in a little bit more detail. A number of international destinations were examined as probable international destinations. These would not. Each and every one of them become a destination in and of themselves.'",
        "'speaker_10': 'They're just really on a list of potential areas that that would be looked at by airlines. And you can see Mexico leads that list with six destinations. Costa Rica has two. And then Guatemala, Panama and El Salvador each have one.'",
        "'speaker_10': 'Again, the decision to serve any or each of these is really dependent on airlines, subject obviously, to the FAA as being developed here, their their ability to to extract interest in the route and a strong market for that route.'",
        "'speaker_10': 'So, again, these fit in in within JetBlue's network, existing network. Again, we forecast that 6 to 8 of these destinations would be considered by JetBlue. And again, they are based on type of aircraft and facility constraints that exist at Long Beach Airport.'",
        "'speaker_10': 'So really conclusions of the market analysis it was, he said earlier, international flights must operate within the constraints of the noise ordinance. That is an absolute. There is a market at Long Beach airport for international flights to and from southern destinations.'",
        "'speaker_10': 'And again, we would anticipate that 6 to 8 flights per day over a five year period. And in the fourth year, fourth and fifth years, we would be looking at about 379,000 annual arriving passengers. So the next component is the economic impact analysis.'",
        "'speaker_10': 'And this was performed in use results from a 2016 tenant survey. It identified the economic impacts of Long Beach and the potential contribution of an office facility. So without an office as it exists today, it's been studied and quantified that the annual economic contribution of Long Beach and its tenants is approximately 45,000 jobs and $10.3 billion in'",
        "'speaker_10': 'output for the region. Performing an economic analysis and doing this modeling is a little a little complicated, but just running through looking at this, this basically is a chart that traces the flows of spending associated with business and to tourism in a region.'",
        "'speaker_10': 'You know, you have your direct, direct effects that go into local and non-local purchases that then lead to goods and services and labors, that that also contribute to what they call a multiplier effect for both energy industry purchases and labor income and spending.'",
        "'speaker_10': 'The outputs of those are indirect impacts and induced impacts. So along with direct impacts, the three of those would represent the total impact. Of an.'",
        "'speaker_3': 'IFRS.'",
        "'speaker_10': 'At the first two meetings that this was presented, this was really focused at the region level, and there were questions and actually a request a couple requested in one specifically by the Economic Development Commission to see about looking at very localized benefits to Long Beach itself.'",
        "'speaker_10': 'So that was done. I'll get into a little bit of how that was done, but it basically employed a statistical analysis so that their estimated and that they supplement regional economic analysis in the study. It is important to note that these benefits are expressed as a range because this is something that is typically not done as part'",
        "'speaker_10': 'of an economic impact analysis. They look at the regional level. But again, through using sound techniques, we did some interpolation and came out with some some figures that are that really could bring us to the same conclusions just on a different scale as as higher level regional analysis was done.'",
        "'speaker_10': 'So this table here that's that shown or this.'",
        "'speaker_3': 'Graph.'",
        "'speaker_10': 'Is really a snapshot of looking at the fire's impact to Long Beach. Once it's up and running and you can see that it's expressed in the range that that is it goes from $20 million up to $60 million, the median or the middle.'",
        "'speaker_10': 'The median point of that is 38 million. So again, because this is something that's typically not done in industry yet, to keep everybody honest, it was we just decided it was best to show this as a range as opposed to a specific dollar amount.'",
        "'speaker_10': 'Again, I apologize. This slide is a little bit busier, but I'm putting it up here just for reference because the following slides will take information from this slide here and give more detail both on the regional impacts and the local impacts.'",
        "'speaker_10': 'But suffice to say, if you look at that on the left side of the of the slide that's focusing on regional impact and on the right side is focusing on local impact. And that's looking at the existing impacts to Long Beach of Long Beach Airport.'",
        "'speaker_10': 'What the impact of the construction of an office would mean at Long Beach Airport and then in the after condition, what an F bias would contribute to both the region and locally. So as I said, I think up front at one of the first slides is that the economic impact summary shows that again, in its current condition'",
        "'speaker_10': ', about 45,000 jobs, $10.3 billion in regional output as a result of Long Beach Airport doing against some interpolation. If you drill that down to the local the local effect, it's estimated that about 6300 jobs and a $1.8 billion impact or local output is produced by the airport to Long Beach.'",
        "'speaker_10': 'As it relates to facility construction, again, regionally estimating that about 250 jobs and $38 million in one time regional output, and then at the local level estimate that 47 jobs and $6.7 million in one time local output. As to the ongoing operations, we estimate that about 350 jobs and $36 million in annual regional output.'",
        "'speaker_10': 'And then at the local level estimate there are 80 jobs and $7 million in local output. One of the other reasons why we're looking at the FISA and why airports look it up, ISIS as well is the annual spend rate of international travelers will outpace that of domestic visitors to an area.'",
        "'speaker_10': 'So the analysis shows that about 30% of the annual international passengers are visitors to the U.S. and the estimated visitor spending is about $104 million per year. The multiplier effects of the international traveler. Spending translates to about 1400 jobs in $186 million in annual regional output and 179 jobs and $31 billion in annual local output.'",
        "'speaker_10': 'All right. Drilling down to the ongoing operation or existence of the FARC, about 1750 jobs and $222 million in annual regional output, followed by 260 jobs and $20 million in annual local output. So that takes us to the environmental compliance portion of the report.'",
        "'speaker_10': 'And this really looks at two key components as it relates to environmental compliance. We have both the California Environmental Quality Act or Sequoia, and the National Environmental Protection Act, or NEPA. We know that there has been a an environmental impact report that was prepared at Long Beach for the Terminal Area Improvement Project.'",
        "'speaker_10': 'It was completed in 2006 and studied many elements which we will be looking at on following slides. NEPA is actually a separate part and component that the at the federal level that really would be looked at in coordination with CBP and FAA on the type of NEPA documentation that would be required as part of this process.'",
        "'speaker_10': 'What you have on on the slide there is as part of an environmental impact report under Sequoia, there are 17 separate areas that have to be looked at and that were looked at as part of Long Beach's Environmental Impact Report.'",
        "'speaker_10': 'And each one is looked at in detail and was studied as part of the report for purposes of highlighting those that are probably front and center in an airport environment would include air quality, greenhouse gas emissions, noise and transportation traffic.'",
        "'speaker_10': 'And that's not to understate that any of the other items are not important. So as as part of this study, we we engaged a consultant to look at and review the the existing environmental impact report. Kathleen Brady from bone terrorism as so she was retained to to perform this review and did so.'",
        "'speaker_10': 'It's important to note that the study itself in this review does not constitute any type of seek or compliance. The appropriate environmental assessment would have to be performed if and when the city determines to proceed with a project.'",
        "'speaker_10': 'That said, based on on the initial review, it does reveal that there are some scenarios where it's possible that no additional environmental impacts would be generated. And then the last bullet there is just for for your edification and it reference that in the prior air there were scenarios that either match our activity now or even exceed our'",
        "'speaker_10': 'activity now. This is not to say that this is where the airport is or where it would go with an F at all. It's just to say that the air actually in the past has studied activity that eclipses our current, active or current flight pattern right now.'",
        "'speaker_10': 'Some of the other functional areas that were evaluated as part of that are really go to capacity throughput parking both for aircraft and for vehicles. And the three that are highlighted in blue really are those that would be most pertinent to the development of an FAA US facility.'",
        "'speaker_10': 'Again, they would not ignore these other functional areas, but those that are in blue would probably be most pertinent. And as a recap, as it relates to the environmental compliance, the City Council on June 30th, 2006 evaluated an amount of 102,850 square feet of terminal facilities, followed by a council action in April, April 24th, 2007, where of'",
        "'speaker_10': 'that 102,850 square feet, 89,995 square feet of terminal facilities were authorized. Now, from that amount, we have seen through phase one improvements at Long Beach Airport, 73,769 square feet of terminal facilities which have been completed. So if you subtract 8600 square feet of improvements net that are part of a plan that we would move forward with, again'",
        "'speaker_10': ', subject to approval of an. So if you reduce that by that square footage to be removed, that would yield 37,681 square feet of of remaining capacity. Again, that would also be premised on the council approving the difference between the 89,000 995 and the 102 850.'",
        "'speaker_10': 'So now we're going to get into, say, the facility siting alternatives and we're going to show three slides and. Before we do that, I want to give a little bit of background on this. So it's going to show three conceptual options that are prepared as part of this study.'",
        "'speaker_10': 'They are based on a simulated flight schedule that again was done as part of the market analysis that shows 6 to 8 daily international arrivals and a design criteria showing 255 passengers that could be processed per hour. So we're not talking about some big great at this facility that you would see like at L.A.X. We're a large'",
        "'speaker_10': 'international gateway. It would also have to be appropriately sized. And these estimates here did take into consideration customs and border protections, airport technical design standards that would have to be done as part of contacting CBP if this project were to move forward.'",
        "'speaker_10': 'These options are evaluated for feasibility only. They do not represent an actual footprint or even an actual site as it relates to where it sits in relation to the airport. So the preferred project would be determined at some future point.'",
        "'speaker_10': 'All of these are shown to be feasible. So option one shows a facility that's situated north of the terminal building itself. You can see that in the light blue on that point, I guess my. I think my. My laser.'",
        "'speaker_10': 'Is it working? Okay, just. Anyway. I think you can see I apologize. I think it's somehow it's not working. So you can see that linear building there that there is there on the right lower right portion that has a gross square footage of 35,051 square feet, has an estimated costs of about 21 and a half million dollars'",
        "'speaker_10': '. Again, this this is conceptual only. And also keep in mind that this includes what they call exterior areas, hallways that would not necessarily go toward counting for the allowable square footage that that the capacity that we have under the current air.'",
        "'speaker_10': 'Option two moves the facility to the south of the terminal complex. It's it's it's smaller. It's at 30,672 square feet at a cost of $17.3 million. And then finally, it's a little bit of a of of a alteration of a version or option to is one that has 2820 8406 square feet at a cost of $20.3 million'",
        "'speaker_10': '. Next we go to financial feasibility because at the end of the day, it has to be something that can be both supported from a development standpoint, construction standpoint, and then also from an ongoing operational standpoint. So this here is just a reminder for mainly for folks out in the audience that no city of Long Beach General Fund'",
        "'speaker_10': 'dollars support the airport. It's an enterprise fund. So all the revenues that are created out at the airport in the form of rents, concession fees and rates and charges to the airlines, those all go to support Long Beach Airport.'",
        "'speaker_10': 'As a result, no general fund dollars or taxpayer dollars would be used to construct or operate the up ice facility. Conversely, the FAA puts pretty strict restrictions on airport revenues so that they cannot be taken off the airport.'",
        "'speaker_10': 'So all revenues that that are generated at the airport have to go to benefit the airport. Airport revenues cannot be used to pay for city services that are not related to the airport. Now, this does not take into account that we pay for city services such as fire and police and other administrative support that we receive from'",
        "'speaker_10': 'the from the city of Long Beach. And that is allowable. Based on the analysis, Long Beach Airport could commit up to $3 million of passenger facility charges or fees. That PFC is something if you ever notice on when you're flying out of Long Beach.'",
        "'speaker_10': 'It's a $4 and 50 cent charge that we are authorized to collect and we basically use that that money for capital projects or other things specific to the airport. So again, no public money from our new general fund.'",
        "'speaker_10': 'Money would be used for this project. The rest of the cost for this would be or could be funded directly by JetBlue as the primary user of the facility. Based on rough budget numbers, again, they would have to be determined to be, you know, correct and accurate as to square footage and construction cost.'",
        "'speaker_10': 'But the they're looking at about $13 per face arriving passenger in the first year. So that is that would only be assessed to international travelers coming into the airport, not for any domestic passengers coming into the airport. And that's really to reflect initial startup costs starting in year two and then continuing under year ten.'",
        "'speaker_10': 'We would see that we would estimate that that would drop down to $6 per arriving passenger. We'll see on some following slides that these range of charges is really comparable to other California airports. And ultimately the financing plan would be negotiated by all parties.'",
        "'speaker_10': 'So the upshot of this financial feasibility analysis is that it is financially feasible. This is just a chart showing, you know, it's a little it's it's it's a little busy, especially as it relates to Long Beach. But again, since these are estimates, we had to provide ranges of cost.'",
        "'speaker_10': 'So there is a capital charge and then there's a net operating charge and you can see the range for the capital charge. The net operating charge is expected to be $9 again in the first year, then dropping significantly down to between $1.35 and 248 in in years two through ten.'",
        "'speaker_10': 'You compare that with Orange County or John Wayne or with San Diego, Oakland at $10, Fresno at $12, or Phenix, which actually has a common combination of charges based on the the amount per arriving passenger, as well as what they call a turn fee for the aircraft itself.'",
        "'speaker_10': 'So again, the the rate that we're looking at or the charge we're looking at for each international arriving passenger is a is an acceptable manner and is definitely within the range. And then last we come to the security risk assessment.'",
        "'speaker_10': 'You know, the study looked at the potential for additional risk as a result of an amphibious being operating at Long Beach Airport. The findings are showing that the FISA facility would not increase the risks to Long Beach Airport nor the community.'",
        "'speaker_10': 'And and really, what people need to keep in mind is that CBP really is an extension and, you know, another form of law enforcement. So, you know, they are they very well protect FISA facilities. They would complement, you know, the existing law enforcement presence that we have.'",
        "'speaker_10': 'You know, elimination of risk is at any airport in really admitted pretty much any public venue. It's it's seldom possible. I would even, you know, subscribe to you that it's not possible to eliminate risk. You manage it. But Long Beach Airport currently commits significant resources.'",
        "'speaker_10': 'And we can we will we will do so going forward, whether we have an amphibious facility or not, to protect the traveling public. And, you know, we we we are very lucky to be complimented by Long Beach Police Department.'",
        "'speaker_10': 'We got a great partnership with them. And they provide, again, a robust security operation. So next steps. It really is. City Council will decide whether or not to move forward with an FAA facility at Long Beach Airport. And our understanding based on discussion last week is that there's a tentative, tentatively scheduled for January 24th, 2017.'",
        "'speaker_10': 'So before I turn it back over, that's the end of the slide. I did want to close with a few comments that I think just really help ensure that that we are being very transparent with this process. And overarching concept of the FAA feasibility study is recognizing that it is premised on the continued protection and protection of'",
        "'speaker_10': 'and a Biden with the city's noise ordinance at the currently authorized level, a maximum of 50 air carrier flights may operate on a daily basis. Where these flights depart to or originate from does not, in and of itself affect the legitimacy of the ordinance.'",
        "'speaker_10': 'The intent of the FISA feasibility study has been to serve as an analytical and informing tool for the city of Long Beach as it contemplates possible next steps in the process. The goal has been to provide a comprehensive, transparent and fact based document for mayoral city council and public review.'",
        "'speaker_10': 'Finally, the City Council has authorized staff to engage with JetBlue and other interested stakeholders for the purpose of gathering additional information on more specific aspects of the project for example, facility size, siting cost, etc. Many of these data points will be useful when we return to the Council in January.'",
        "'speaker_10': 'We do believe it is appropriate to wait until after the Council considers the item in January before initiating any formal outreach to the governor's office. And thank you. And we're here to answer any questions you may have.'",
        "'speaker_7': 'Thank you. And I want to thank, obviously, the staff at the airport and staff for preparing the study session, as well as the council members. That agenda is a study session for today as well. So I know there's going to be a series of questions from the council and obviously we're going to have public testimony as well'",
        "'speaker_7': 'from the from the public. And so going to get to all of that, I want to make sure that everyone has a chance to speak and be heard, including, of course, getting questions answered and asked from from the city council.'",
        "'speaker_7': 'So I'm going to I'm going to go and start with a couple questions. And I think I think one of the things that's important and I look out and I see some friends that live in the neighborhood and I see Rick and Bruce and Chris and Jan and folks who have been in your backyards.'",
        "'speaker_7': 'I know how important of an issue this is to you. And so I know I've committed to each of you individually, but as well as to the community, this is a very, very serious issue. And I know how important this issue is to each and every one of you, because I see your passion.'",
        "'speaker_7': 'I understand how you believe this has a deep and profound impact on your homes and your neighborhoods and your community. And so I see that because I think as we deliberate this this issue and as we hear from folks on the staff side, folks in the aviation community, and really most importantly, the public and the people that'",
        "'speaker_7': 'are that are living in this in this city, I want you to know that you are being heard. These questions are important. And we're going to have, I hope, a good opportunity to ask questions and to hear what you're saying today.'",
        "'speaker_7': 'So I just want to particularly thank you and I want to thank those of you that have contacted me personally and and our offices as well. So I want to just begin by asking a couple questions. And so there have been, I think, two areas of focus in the conversation around an international terminal in the U.S. And'",
        "'speaker_7': 'one, I think we've spent we have spent some time talking about, well, we'll spend more time talking about tonight is this idea of the noise ordinance. Right. Of course, we've heard obviously, Mr. City attorney, what you said in your analysis.'",
        "'speaker_7': 'We've heard, of course, the the the read the letter from from from the federal government. And of course, we've heard from folks on what we think the impacts are or not are. And I understand the position that the attorneys office has taken as far as its impacts and not having any sort of damaging impacts to the court'",
        "'speaker_7': 'noise ordinance. But the area that we have spent we haven't spent much time, I think, discussing, which I think is is as important, is the issue of economics and the economy and the impacts of domestic flights and those and the impacts of those domestic flights to our local economy.'",
        "'speaker_7': 'And I've asked these questions of some of some some of my friends and people I know in the aviation community. But we haven't just been they haven't been discussed so much. And I think these are important things to consider as we as we move forward.'",
        "'speaker_7': 'I think everyone's probably aware that one of the largest sources of revenue for the city is the tourism economy. And folks that come in to and from conventions and that do convention business. So one thing that has always been of interest to me is having those flights and those domestic flights that link to the cities that bring'",
        "'speaker_7': 'these businesses. And so I'll give you an example. As you probably know, flights have changed in Long Beach as far as what we have. We used to have a lot more transcontinental flights. So you should be you used to be able to go to the Long Beach Airport and pick up a flight and head over to Washington'",
        "'speaker_7': ', D.C., more often than we do now or New York or Chicago. Those connecting flights are oftentimes very important because they provide a stable economic return for the rest of the business and the conventions and folks doing business in the community.'",
        "'speaker_7': 'We certainly have the North-South flights, which have been, I think, very steady and very supportive to going back and forth to Sacramento and the Bay Area. And in fact, I've been very pleased that some of those flights were moved around so that we have more of those Bay Area connections.'",
        "'speaker_7': 'One of my key questions in this is I saw one of the tables that you had. Maybe we can go back to the slide staff you had mentioned. This is the first time I'd seen it. I wanted to just talk about the some more that six out of the 50 flights in year one you expect would possibly'",
        "'speaker_7': 'go international, which you mentioned being a number of 12%. Is that correct, Mr. Roemer?'",
        "'speaker_10': 'Yes.'",
        "'speaker_7': 'That's great. Can we get that slide back up with, if possible.'",
        "'speaker_3': 'You.'",
        "'speaker_10': 'Okay. He's bringing back the liquor. Sorry about that.'",
        "'speaker_7': 'I just want to make sure I have the numbers right, because. And then you also mentioned that possibly in year four, eight out of 50 flights or 16% of the total flights. Of the carrier flights would be. International, is that correct?'",
        "'speaker_10': 'Yes.'",
        "'speaker_7': 'Have we projected that out further? So I'm wondering if in year four, which is, you know, a blink of an eye and you're for we're at 16%. What would happen at year eight.'",
        "'speaker_10': 'That was not done as part of this analysis that I will tell you this based on my previous experience working on air service marketing and air service development, going that far out is, you know, would be speculative at best.'",
        "'speaker_10': 'I mean, you could make a guess what, I would rather not give you something that is unreliable, then give you something that, you know, there's no way pushing eight years out. I think it's really hard to predict.'",
        "'speaker_7': 'Okay. But you I mean, you've pushed it to four years out. So what? I mean, do you think in year five that goes to 20%?'",
        "'speaker_10': 'No, I think if you look at the the table that year in years, four and five. Years, four and five. They're both at it. You know, the number of employments is these are data showed in a different form, but this is based on eight flights.'",
        "'speaker_10': 'So and so.'",
        "'speaker_7': 'I mean, and I just want to follow the start. So I know that I understand what you're saying about speculate too far out. Are you saying that it you would imagine that this would would plateau or would it see or would it have small growth or what can we expect is obviously, we're going to we're going to'",
        "'speaker_7': 'if this moves forward, we would live with this for longer than four years. Well, what what do you see happening out in the future?'",
        "'speaker_10': 'Well, here's all I'm going to answer it this way, and I'll try to give you as as full and direct of an answer as I can. Number one, we've got the noise ordinance, which puts the upper limit. And as of now, and unless we see something changing two years out, four years out, you know, eight years out'",
        "'speaker_10': ', we're looking at 50 flights maximum. Okay. For the for the air carrier group within that 50 flight profile, each carrier decides on how they would like to fly those routes again, assuming there's an amphibious facility here or not.'",
        "'speaker_10': 'You know, so to the extent that there could be some headroom, you could see some incremental increases. But back to the other slide that shows that on average, airports and air patterns show about a 20% versus 80% of international versus domestic.'",
        "'speaker_10': 'So, you know, I don't see it might go up incrementally above that 16%. I don't see you know, I don't see it increasing much more, at least in that, you know, in that first set of years. All that said, because of the uncertainty of anything that could happen in the economy, you know, something.'",
        "'speaker_3': 'You know.'",
        "'speaker_10': 'Inadvertent and negative, could could could cause flights to reduce. We just don't know that.'",
        "'speaker_7': 'Okay. But in your in your best estimate, you think that that 60% certainly could go a little higher, but maybe not higher than 20%. Is that what your what your best estimate, what you're saying?'",
        "'speaker_10': 'I would say that and I would add this again, this is just a snapshot of what we see today. You know, for ten years, I manage the Ontario airport and over that period, we saw international go from 0 to 3% and it's been stuck at 3% for about two years now.'",
        "'speaker_10': 'That's a function of what the airlines want to do. Similarly at John Wayne, you see that profile there. It's a much larger base of passengers, but they're also at about 3%. So, again, you're talking apples and oranges because that's a, you know, 11 million passenger airport versus ours, which is under 3 million.'",
        "'speaker_10': 'But I'd say given that, I would I would say that 6% or eight flights is likely at the upper limit of what we would see here at Long Beach Airport.'",
        "'speaker_7': 'Okay. And so I think why that's important is I just want to make sure that one of the things that we're really thinking about is and it Mr. when I mentioned this, too, to Mr. West a few times, is that there is a there's also a difference between, of course, our airport and some of the other airports'",
        "'speaker_7': '. Right. And so the key difference is that we we have this ordinance that we have all agreed that we all support, that caps very clearly the amount of flights. So while at other airports, there's, I think, flexibility or more flexibility in increasing the domestic market.'",
        "'speaker_7': 'At our at our airport. We like that we've kept and provided this protection for the community. And so any growth on the international side will be at the expense of the domestic flights. I mean, it's basically it's not all it's it's for every international flight that we gain.'",
        "'speaker_7': 'And I just and this is an important conversation we should have. We will be losing domestic service. And so I just want to I think that that needs to be both said and and discussed as part of the as part of the conversation.'",
        "'speaker_7': 'So let me let me just let me just continue. So. My my my concern on on this discussion and I'm interested in is that what protections as the city have. Can we or can we not legally even limit the amount of let's say we wanted to go forward with international?'",
        "'speaker_7': 'Are there limits that can be placed to limit that or is that not something that's that we're able to do.'",
        "'speaker_10': 'Now other than within the larger envelope of the noise ordinance, which sets, we know as the upper limit, cities, counties, state governments are not allowed to tell carriers where they fly or how they fly. That's that was all part of deregulation.'",
        "'speaker_7': 'Okay. Now, I think I think that's fair. I and I. I appreciate that. And so I just I wanted to just put that out there because I think that one of the things that's important is the conversation about the noise ordinance is is is very important.'",
        "'speaker_7': 'And we're going to have that. But I think the conversation about the economics of of domestic flight and so I, I would love our airport to be able to connect currently today to flights to to New York and to Washington, D.C. and to Chicago and to all these places that would, I think, would help our convention business'",
        "'speaker_7': '. And so I just I just want to make sure that as we have this discussion and as we move forward, that we have and listen, I've talked to I've spent a lot of time talking to our hotel folks, and a lot of our hotel folks are very excited about the opportunity of having international folks coming in and'",
        "'speaker_7': 'out. And so I hear that. But I also think I've also talked to hotel folks who have shared with me exactly what we're discussing right now. And I have had numerous meetings with hotel folks that have said. What's going to happen to our domestic flights.'",
        "'speaker_7': 'And so I put that out there for discussion. I have a long speakers list, so I won't monopolize the time, but I just wanted to put that out there as well. So as we move forward, I think those questions need to be answered.'",
        "'speaker_10': 'Mr.. BAER And if I may add one other thing, and it was shown on one of the slides here that the facility design and showing that the throughput at 255 passengers per hour is at peak. This is not a facility that is going to support a large volume of international activity just because of how it would be'",
        "'speaker_10': 'designed and constructed.'",
        "'speaker_7': 'I know. I appreciate that. And I thank you for that. I understand that. And I think but I think also that I think when folks, you know, ask us where they want to fly, I think they almost always say trans transcontinental flights.'",
        "'speaker_7': 'So let me just take the speaker's list, Councilman Austin.'",
        "'speaker_0': 'Thank you, Mr. Mayor, and I appreciate those questions. I want to thank you, Mr. Romo, for the presentation. It was should be noted that this presentation was from our airport director and not from Jacobs Engineering, and I have some specific questions for them.'",
        "'speaker_0': 'Did you say that there was a representative here from Jacobs?'",
        "'speaker_10': 'Yes, we have three representatives.'",
        "'speaker_0': 'Okay. I'll hold my questions until later. I am going to keep my comments short, but I'd just like to make a quick statement. I am I'm really thrilled to see so many residents come out who took their time to learn about this very, very important issue facing our city.'",
        "'speaker_0': 'I want to thank you all in advance for sharing your thoughts and your concerns with the council this evening. I've had the opportunity to to to knock on your doors and talk to many of you at your front porch, your front porches and your living rooms out and about in the community.'",
        "'speaker_0': 'And I've received hundreds of emails and communications from residents in my district. I am unequivocally clear where my residents and my district stand on the possibility of Long Beach Airport building and if I is stationed in hosting international flights.'",
        "'speaker_0': 'The feedback that I've received has been resoundingly in opposition to this proposal. And most thoughtful and informed residents see this as a risky and unnecessary proposal. I respect that and I agree. The few jobs in the economic benefits that have been stated really are not worth the risk, in my opinion.'",
        "'speaker_0': 'It should be noted also that passenger airline activity at Long Beach Airport is actually at capacity today. With respect to our noise ordinance, our noise ordinance dictates our capacity, as it's been mentioned. Our airport is actually lauded as one of the best as a domestic travel resource.'",
        "'speaker_0': 'And I believe that international flights could significantly change the character of our airport and our city. It could result in a net loss for our city to our convention and visitors bureau and to our hospitality industry. As mentioned earlier, Long Beach is unique because of our noise ordinance.'",
        "'speaker_0': 'Our airport is unique because of the noise ordinance. It's also unique, uniquely located, located in the middle of some of the best neighborhoods in Long Beach, which are impacted by this dense. And so over the course of the next month or so, as we are deliberating as a council, I hope you have an opportunity to talk to'",
        "'speaker_0': 'the rest of the city council, communicate your concerns. I know. And I want to respect them for for being here this evening and listening with attentive ears to to to to the to the the I'm sorry to the the study session this evening, but also to to you as residents.'",
        "'speaker_0': 'And again, I want to thank you for coming out. I have a whole lot of questions. I expect to be here until the wee hours of the morning. I've already asked my my staff to order breakfast, but I want to wait until after public comment.'",
        "'speaker_0': 'We hear the comments from the public before I get into questions. Thank you.'",
        "'speaker_7': 'Councilmember Turanga.'",
        "'speaker_11': 'Well done. I'll just say I wrote it for the kid. And when the kid did not write it, I'll both the mayor and they'll have made excellent points in regard to questions already. And I do have my my whole list of questions as well that I will be hitting later on in this presentation.'",
        "'speaker_11': 'But I do want to echo echo Councilmember Els Austin's point in that I've been listening. And one of the reasons why I brought this issue to the fore right now in terms of a study session is because you weren't being listening to I mean, the audience was not engaged.'",
        "'speaker_11': 'And in the conversation the two community meetings, if you want to call them that, that we that we sponsored or that we put together, did not have community interaction. It was basically one sided. It was from the city's point of view or the feasibility Jacobs point of view, the both commissions are basically limited comment, public public comment'",
        "'speaker_11': 'on a lot of the items that were presented. So I felt that this study session would present a better avenue for you to come here and ask your questions. We also offer an opportunity to ask questions via email letter, and I've gotten a lot of those.'",
        "'speaker_11': 'I have a big stack right here, right there, right here of your comments that I've received. Some of your penmanship is worse than mine, but that's neither here nor there. I get the point, and it's a point that's important.'",
        "'speaker_11': 'And there's going to be more discussion as we move forward in regards to what it really means and what impact it will really have for Long Beach. Talk about what it will have economically, talk about it, what it would have environmentally in regards to the flights.'",
        "'speaker_11': 'The one big question that I have and the mayor made up made a point to it is that when we come to the noise ordinance we already had this year, an FAA etiquette mandate to add nine flights because our noise bucket allowed for that.'",
        "'speaker_11': 'Now we're going to be looking at in the future perhaps another possibility of having to add flights, because we're doing so well with our noise bucket that we can handle it. What's going to be the future of that?'",
        "'speaker_11': 'Should we have that bias? Where are those flights going to go? Where are they going to be? So those are questions that was that were not addressed by the Jacobs study. And those are the questions that we need to have answered as well, is that when we move forward, as we move forward with our airport, where are'",
        "'speaker_11': 'we going? And the one big question. It sounds very silly, but one big question is what if we do nothing? What what's what's the impact? What's the impact there?'",
        "'speaker_3': 'I We are, we are.'",
        "'speaker_11': 'We are we are potentially putting ourselves in terms of the city at at a disadvantage of being able to grow our economy or grow our flag to grow. Convention So this was brought up. You know, I think we need to look at that as well.'",
        "'speaker_11': 'In terms of the report came out, it was very glowing, very positive. But if I read reports, right, or as I as they should read, there should always be some conclusions that are not so positive that say, if we don't do this, this is going to happen.'",
        "'speaker_11': 'I saw nothing, no negativity at all in this report. And that's why we're here, because there weren't any brought up there. I'm pretty sure that when the contractor was making his studies in, especially economically, there were there are going to be some negative impacts.'",
        "'speaker_11': 'There will be negative impacts. And it was also likely there's going to be some regional growth in regional out of great benefits to the economy. But at what expense? You know, the yellow, yellow, yellow, an A and a plus in a minus because you're taking some money from you're getting more money here.'",
        "'speaker_11': 'Where's it coming from and who are you taking it from? What comes right down to that? Who's donating to it and where is it coming from? And it may be that we probably are looking at when we're talking about regional impacts, L.A., Ontario, John Wayne, are we going to be taking some of their businesses that way?'",
        "'speaker_11': 'We're going to be growing that. I don't know. I mean, that's something that we need to evaluate and analyze as well, because we are going to be part of this Metroplex. Issues that we're that we're dealing with right now that has not been addressed.'",
        "'speaker_11': 'And we're talking about the other parts that we haven't had in terms of what changes is going to make in flights. I mean, there's going to have to be a re configuration of how flights are going to come in and fly out, flying and fly out of Long Beach.'",
        "'speaker_11': 'Should we have an office and where it's located? So those are just some some. Food for thought at the present time. But obviously I want to add my voice to thanking you for being on here tonight. I've gotten a lot of phone calls, a lot of emails, a lot of pull up to the site and, hey, what'",
        "'speaker_11': 'are you going to do about the fires wrote when I'm driving or when I'm walking. But the bottom line is this is your opportunity to voice your concerns. And we are here to listen. Thank you.'",
        "'speaker_7': 'Thank you, Councilmember. Super now.'",
        "'speaker_2': 'Thank you, Mayor. First, I'd like to thank everyone for being here tonight and apologize for the delay upfront. But now we're all here. I also like to thank the folks in the lobby. We know you're there and I appreciate you being here.'",
        "'speaker_2': 'All those who submitted E comments, we have them. They've been logged in and to all those viewing from home. Thank you for your civic engagement. I have a number of questions over the presentation that I just wrote down now.'",
        "'speaker_2': 'I also have my own presentation that I'd like to get to, but immediately due to one of the slides and number 42 involving the Elbe PD. I'm going to defer to our Councilmember Pryce. This is her area of expertize, and I'm a little confused by the comments made as to jurisdiction in that area.'",
        "'speaker_2': 'I don't think the BPD is involved. So if your permission, Mr. Mayor, I'd like to defer to Councilman Price for a couple of questions, then come back to me.'",
        "'speaker_7': 'Yep. And she's next anyway, so we'll come back to you.'",
        "'speaker_8': 'Thank you. I appreciate that, Councilman. Super. I do have I have I have a number of questions as well. But in regards to security specifically, can you talk me through a little bit of how the conclusion that our security risk won't be negatively impacted was made?'",
        "'speaker_8': 'Because it seems it's counterintuitive in regards to the security risk. So I just want to I kind of want to understand that and what the role of Long Beach PD would be, because there is a jurisdictional issue there and we have certain limits in terms of what we can investigate and enforce and policy wise matters that we'",
        "'speaker_8': 'do investigate and initiate and others that we leave to the federal government. So if you could give us some more background on that conclusion and justification, I'd appreciate it.'",
        "'speaker_10': 'Okay. Let me work backwards from there. And I apologize if I was not clear in terms of the specific roles and responsibilities. Long Beach Police Department, as everybody knows, has been a longstanding present presence at the airport. Their role would continue as such, so they would not be involved in any of the operational issues regarding the processing'",
        "'speaker_10': 'and screening of inbound passengers. They would be available for a law enforcement call should one be needed as what as what happens from time to time at the airport. But again, they would not be doing any of the work that normally is done by Customs and Border Protection as as you may know, Customs and Border Protection are'",
        "'speaker_10': 'sworn officers of the law. They they do carry weapons. But, you know, their their main purpose there is to ensure that both people and their their goods that they're that they're bringing into the country have been properly screened, appropriately screened to ensure that no contraband or other illegal substances are are being brought in to the country.'",
        "'speaker_10': 'Now, as it relates to security risks for the passengers coming from abroad, keep in mind that every country and including Mexico and Latin America, everybody needs to be screened because no carrier wants somebody on an aircraft. It's got some kind of a unsafe or an unauthorized weapon or substance or anything else.'",
        "'speaker_10': 'So as it relates to the public or the safety aspect, these are people that and a number of them are going to be Americans. But these are people who are going to be going to international destinations for business or for leisure, and they're going to be coming back.'",
        "'speaker_10': 'But before they get on an aircraft, they've got to be screened the same way that passengers leaving Long Beach, getting on domestic flights have to be screened. So in that regard, we don't see this being a case of that just because in and of itself, it's international destinations that are going to be served that that creates a'",
        "'speaker_10': 'security risk.'",
        "'speaker_8': 'Okay. I appreciate that and I hear you. I'm not sure I totally agree with that, but I appreciate your opinion on that and I do appreciate the study session. I'm grateful to Councilman Yarrawonga for bringing forth the item for us to have a study session.'",
        "'speaker_8': 'I was happy to sign on to that item and I think my attitude with this whole process has been the more information we obtain to better analyze the situation, the better that we will be in terms of making a knowledgeable decision moving forward.'",
        "'speaker_8': 'I do have some comments that kind of echo some of what the mayor talked about regarding regional versus direct local financial impact. That's an area that I still remain not completely clear on. So I do have some questions on that.'",
        "'speaker_8': 'But I know that Councilman Super now has his own presentation, so I'm going to give the floor back to him. I'd love to hear from the audience, and I expect I'll have some additional questions as well as we move through the night.'",
        "'speaker_8': 'But thank you very much for the presentation, for stepping in at the 11th hour to do the presentation, even though that wasn't planned. I appreciate it. Thank you.'",
        "'speaker_7': 'Thank you so much, Councilman. I do want to go back to you now. Okay, Councilman Worshiper.'",
        "'speaker_2': 'Okay. Thank you. So, as I stated, I'm going to go right back to the presentation. I've actually seen it two other times, but it's a little different this time. So I came up with a couple of new questions and the first one was from slide number seven.'",
        "'speaker_2': 'And it states there that we have one of the strictest, strictest noise ordinances in the world. And that we've heard over and over again if you've been with this process now, just Romo was kind enough to visit my community meeting two weeks ago and we discovered at that meeting that it might be one of the strictest in'",
        "'speaker_2': 'the world, but it's not the strictest within 22 miles. So if you could express what you did, that community meeting, how it is, Orange County prevents flights coming in at night, but language doesn't. Yeah.'",
        "'speaker_10': 'I'll be happy to do that at a at a reasonably surface level, only because I'm not expert on John Wayne's noise ordinance, other than the fact that similar to Long Beach, it was it was implemented pre anchor or the Airport Noise and Capacity Act, which is one of the reasons why Long Beach Long Beach gets to enjoy'",
        "'speaker_10': 'the strength of this ordinance. So I may end up I'm kind of turning to counsel here in the event it's something that it's a little bit more in detail than I can provide because I just don't have that background.'",
        "'speaker_10': 'But I think, as I mentioned at the community meeting, the folks that developed that noise restriction or set of restrictions at John Wayne, I'm going to just use the term they had the foresight. Okay.'",
        "'speaker_9': 'So I'm going to rescue just a little bit because it just so happens we have an expert here. Lori Balance is a principal in the law firm of Gaskin, Dillon and Balance. And for some of you, the I have been following airport issues for years.'",
        "'speaker_9': 'That is a law firm that we typically use to help us with airport regulatory matters. And Lori also is outside counsel for John Wayne Airport. So she's uniquely situated to give us an answer about the difference between Long Beach is set up and John Wayne's.'",
        "'speaker_8': 'Thank you. So, yes, I'll try to answer a little. Kind of broadly to start with. And if you have additional questions, please feel free. Much like Long Beach, we did enter into a settlement agreement with the communities surrounding John Wayne Airport, and we negotiated that settlement for an arrival and departure curfew.'",
        "'speaker_8': 'Those curfews went into place before the Airport Noise and Capacity Act went into place. So John Wayne Airport, like Long Beach, is grandfathered. Those provisions are grandfathered. An airport could no longer do that kind of curfew unless you go through a very difficult part when 61 study so John Wayne airport was able to grandfather those curfew provisions'",
        "'speaker_8': '. We also have strict penalty provisions. So if aircraft arrive or depart outside of the curfew, then there is a penalty structure that penalizes those aircraft.'",
        "'speaker_2': 'Okay. Thank you. Boy, did I get a surprise on that answer, but I really appreciate the expertize here. The next question I had was. The slide, and this is from previous presentations. It's slide number 33 and that's the demand peak of 255 an hour.'",
        "'speaker_2': 'I think we saw at the presentations that that is under ideal conditions. And I think those in the audience would be hard pressed to find ideal conditions at at the Long Beach Airport because we deal with delays and all sorts of things all day long.'",
        "'speaker_2': 'So maybe that's a question for the consultants because they came up with that formula. I don't want to put you on the spot again, just but we can get back to that one if they present later. If we can, I think now I'd like to bring up a couple of slides that we put together and.'",
        "'speaker_2': 'The nature of this is I'll start off with an old riddle if you've never heard it, and that is what's the difference between ignorance and indifference? And the answer is, I don't know and I don't care. And what I'd like to address tonight is the I don't know factor, because I think that's the missing link here.'",
        "'speaker_2': 'I think all these folks in the audience know something that needs to be shared with the council members. If you live in an air packed, airport impacted neighborhood, you have a base knowledge that needs to be shared here.'",
        "'speaker_2': 'So I'm going to attempt to do that a little bit. So in that, I'm going to just start with the. With the late night flights, that piece, no one really knows, because as we just discussed, Long Beach has no way to prevent late night flights coming in.'",
        "'speaker_2': 'That's flights that come in pass ordinance. So what I did here is I went back to the council meeting. I think I was on the job for about two months. And Robert Land of JetBlue came to the podium and he said, let me be crystal clear.'",
        "'speaker_2': 'On behalf of JetBlue, we are and remain always have been. Let me do that again. We are and we remain and always have been committed to the ordinance, the noise ordinance. And that's the night where I made a comment.'",
        "'speaker_2': 'And it wasn't my most Churchillian moment, but I said, You're killing me, man. But it express I just couldn't believe that based on my experience, that JetBlue had that position. So giving him the benefit of doubt. Maybe he was talking about future flights.'",
        "'speaker_2': 'So we have a comment from October 25th, 2016. And Mr. Land said and finally, I in closing, JetBlue has a proven record here in the city of being 100% committed to the city's noise ordinance. We fly our flights in adherence to the noise ordinance.'",
        "'speaker_2': 'So the we're completely 100% committed and committed to the ordinance was used in both quotes. If we can go to the next slide. Here's the record and I chose the last few months. We don't the numbers aren't in yet for December.'",
        "'speaker_2': 'So I use December 2015 through November 2016, those 12 months. If you were to ask anyone who doesn't live in the flight path, what on average, how many times a month does JetBlue violate the noise ordinance? Well, I can cut to the chase here.'",
        "'speaker_2': 'And and it is more than once a night. And that figure is kind of shocking to people who who don't live in the impacted areas. So you can see the total numbers. Well, let's just say there were 366 days in that time period.'",
        "'speaker_2': '2016 is a leap. Year has one extra day. So out of the 366 days, JetBlue violate the new ordinance 375 times. So that's our experience. So if you want to know why the audience members are a little bit cynical or mistrustful, you can go back to these figures here.'",
        "'speaker_2': 'I'd also like to call attention to that dollar figure $610,200 in fines. And that's the staggering number that goes to the Long Beach Public Library Foundation. And while they're doing an endzone dance over that figure, Mr. Romo, can you tell us what it costs to administer this?'",
        "'speaker_2': 'I don't want to put you on the spot. If you don't know, I can give you the number. I believe your noise office costs $940,000 a year. So maybe we want to adjust that. So tell the library they can have the money after they cover costs.'",
        "'speaker_2': 'How would that be? I'm just joking. Now going back to that original quote, I think I said that night, I can't believe this because JetBlue just flew a plane out of here at 2:30 a.m. a week before they're coming to the council to ask for a favor.'",
        "'speaker_2': 'And so if we can go to that next slide with the map, my staff, Barbara moore, put this together today, now bringing this study session forward. This was last night. Okay. So the folks in Los Altos and Stratford Square in the fourth District.'",
        "'speaker_2': 'And also, I guess La Marina Bixby Hill, College Park, they experienced this landing at 11:48 p.m.. Now, there was a little problem. I spoke to Ron Reeves earlier tonight. Web track didn't actually show the plane, but we can see by the the way they lit up the noise monitors.'",
        "'speaker_2': 'I think it's 88 DB over Stratford Square at 1148 at night. So that just kind of illustrates what the folks in the impacted areas deal with. And that's what I think we need to community communicate here tonight. Now.'",
        "'speaker_2': 'So now I'd like to challenge another area, and I'm going to pick on the two greatest experts. I believe in the room on this thing and also two of my three favorite city staff members, and that's Mike Mays and Ron Reeves.'",
        "'speaker_2': 'So I'll go back to a quote they made to the grunion. And this has to do with. Is the destination or the origin. It doesn't. Does that matter? And Ron Reeves said. I mean, I'm sorry Jess said it again tonight that, you know, this doesn't matter.'",
        "'speaker_2': 'Okay. So if we go to the quotes from the grunion, it just it just reiterates that Mr. May said the origin or destination of flights is irrelevant to the various noise buckets established in the ordinance. For instance, if there is a customs facility, the number of flights permitted by the ordinance would not change, nor would the current'",
        "'speaker_2': 'established curfew hours of operation. And then it was, Ron said, for the purposes of the ordinance, we are connected. The noise levels, not markets and aircraft at a given weight will generate certain noise. Now I think they are absolutely correct scientifically.'",
        "'speaker_2': 'However, that's not the real world. Where the plane comes from is critical. And that's because delays are based on either weather or mechanics for the most part. So if you have an origin of a weather impacted city, it's going to put a delay in effect.'",
        "'speaker_2': 'So and that is either foreign or domestic. So I'll flash forward to this year. The next slide is a press release from JetBlue, where they quoted Mary Garcia and just Romo saying talking about the new JetBlue service to Fort Lauderdale and that it's great for the city and, you know, it's a great connection to the Caribbean.'",
        "'speaker_2': 'Okay. Now, at the bottom of that slide, look at this chart. Okay. So that flight, I think just from really you can correct me if I'm wrong, the 9:24 p.m. to 5:25 a.m. is that known as like a redeye in the industry going from Long Beach to Fort Lauderdale?'",
        "'speaker_2': 'Yes. Okay. So this great new flight, we're all excited about leaves here at 9:24 p.m.. Okay. That's pushing the envelope on the noise ordinance. That's not an ideal flight we want to bring in here. But on the other end, it leaves Fort Lauderdale at 5:51 p.m. and arrives here at 8:28 p.m..'",
        "'speaker_2': 'Well, my feeling is that's way too close for comfort too, because you don't want to be have a an origin from any place that's weather impacted. So if we go to the next slide, here's the headline just 30 days prior to that press release.'",
        "'speaker_2': 'This is on October 4th. Okay. So the headline is Hurricane Matthew. All right. So Fort Lauderdale International Airport reported 79 delays and 38 cancelations due to the storm. Some airlines, including JetBlue, Southwest, etc., are issuing travel waivers that eliminate penalties for change flights.'",
        "'speaker_2': 'Okay. Am I making my point that.'",
        "'speaker_3': 'Where.'",
        "'speaker_2': 'The plane come from comes from does matter? So if we want to go to international, I don't want to use that chart and what JetBlue stated as some of their destinations. So let's just take one that wasn't on there.'",
        "'speaker_2': 'Acapulco. Does anyone have any idea what the on time rate is for that airport? It's it's I think around 60%. So if they have planes flying out of there, coming into Long Beach, we run the risk of those late night violations all the time.'",
        "'speaker_2': 'I think in conclusion. I just think it's some of these conventional wisdom remarks just don't hold water, in my view. And that that's kind of the difference. That's where the education piece needs to come in and they're there.'",
        "'speaker_2': 'We can state facts. We can look at a feasibility study, which is just that. It means it's feasible. It doesn't mean that we necessarily need it or want it. You. But there's there's just far more here than what meets the eye.'",
        "'speaker_2': 'So with that, I would love to relinquish the microphone and hear the public comment tonight and reserve other remarks for later. Thank you.'",
        "'speaker_7': 'Thank you. I still have Councilmember Pearce.'",
        "'speaker_4': 'Yes, I had a clarifying question on the noise ordinance. I understand that we have a curfew and we have penalties. That's correct. Right. Right. Is there no way to change the penalties that we have? To increase them.'",
        "'speaker_9': 'Here's let me try to answer that. We have had the current noise penalties on the books since the ordinance was adopted in 1995. Up until this point, there has been a stated preference, I would say, by the Council over the years not to touch the noise ordinance for fear that that may open up something that no one'",
        "'speaker_9': 'really wants. So, quite frankly, that's why we haven't done that. The penalties that Councilman Superman referred to in the slides are actually not the penalties that are outlined in the ordinance. The penalties in the ordinance are actually much, much less than what is depicted up there.'",
        "'speaker_9': 'Those penalties are as a result of a consent decree entered into between the city prosecutor's office and the offending airlines, whether it's JetBlue, American or whoever violates the noise ordinance. The penalties in the ordinance are actually very, very low in the low hundreds of dollars.'",
        "'speaker_9': 'Definitely not a deterrent. So to answer your question, yes, the city could undertake a process to see if we could raise those penalties so that they are similar, maybe equivalent to what John Wayne has. For instance, we would have to engage in with the FAA a fact finding process and with their concurrence, make a determination that based'",
        "'speaker_9': 'on the history that we have at the airport, that it's appropriate to raise the amount of penalties so that they truly act as a deterrent to carriers that fly in and out of here.'",
        "'speaker_4': 'Thank you for that answer. And do we know off the top of one of our great heads here.'",
        "'speaker_8': 'The numbers that we saw about the number of flights that go.'",
        "'speaker_4': 'Beyond our.'",
        "'speaker_8': 'Hour curfew? How are we in compared to cities like Ontario or John Wayne?'",
        "'speaker_4': 'My voice.'",
        "'speaker_10': 'I'll take the first part of that, because having come from Ontario, Ontario does not have a curfew. So that that wouldn't apply there as it relates to John Wayne.'",
        "'speaker_4': 'No. It's okay if we don't have to answer, but I'd like to.'",
        "'speaker_8': 'You know, there are. I don't know offhand. I do know that the numbers that I saw here are greater than what you see at John Wayne Airport. The penalty structure is different at John Wayne Airport than you have here.'",
        "'speaker_8': 'Whether that's a deterrent or not. You know, I think that the air carriers do the economics with respect to the penalty structure and and what it costs to put people up in a hotel. So.'",
        "'speaker_4': 'Okay. And then let me ask in discussion about the flight to Fort Lauderdale. What role does the city have?'",
        "'speaker_8': 'What role does the airport.'",
        "'speaker_4': 'Have in negotiating the additional flights that, say JetBlue said they decided they wanted a flight to. Yeah. Cuba or something. Do we have a role in saying yes, we want to increase flights to that destination or no? So I'm getting no.'",
        "'speaker_9': 'Let me try to answer that simply. There is no making the city. Typically, cities, typically as airport proprietors, don't have the authority to dictate where a flight goes to or comes from, provided that the carrier in this case has an available slot at the airport to land and take off.'",
        "'speaker_9': 'Beyond that, the city really cannot control that. Okay.'",
        "'speaker_4': 'And then my last question before I let folks speak. On the economic factor of having flights land, say, at LAX.'",
        "'speaker_8': 'Or a different airport before they come.'",
        "'speaker_4': 'Into Long Beach. I know that, you know, with like Longines event or something like that for our conventions that are business, we might have people that touch down.'",
        "'speaker_8': 'Somewhere else first.'",
        "'speaker_5': 'And then they gas up.'",
        "'speaker_4': 'There and then come here. Do we see that as a a negative economic impact and a negative environmental impact, or is it that's marginal?'",
        "'speaker_10': 'Well, let me take that in reverse order. And it has explained in the presentation the you know, the inefficiency created by a tech stop or a fuel stop is something that does have an environmental impact relative to increased emissions, you know, because it takes power to to take off and reposition the aircraft.'",
        "'speaker_10': 'And then you're getting back into the airspace, which again in this area is very complex. So I'm not going to say it's unsafe because air traffic control does a great job at managing the or the busy traffic patterns and aircraft that are, you know, in the air.'",
        "'speaker_10': 'But it makes it a little bit more difficult financially. What? Well, Long Beach loses out on when it doesn't sell the fuel here at the or B I can say here I'm thinking on the at the airport when when the airport does not make the fuel sale, then it doesn't get the fuel flow, which fees, which is'",
        "'speaker_10': 'something that does benefit the airport's revenue fund.'",
        "'speaker_4': 'Okay. And my absolute last question. I'm so sorry. Say that JetBlue decides that they you know, we build this FISA facility and. The international flights aren't working out and they decide to leave. Is this a facility that's available.'",
        "'speaker_8': 'For a different courier or are we looking at multiple.'",
        "'speaker_4': 'Couriers now trying to come in to Long Beach because we've built this facility?'",
        "'speaker_10': 'Well, in a word, to be built would be available to any commercial carrier that wanted to make use of it subject to availability as part of CBP, staffing it and not stepping on another carrier schedule. So it's not an exclusive facility for JetBlue, so it could be used by anyone.'",
        "'speaker_10': 'As to the city and the airport protecting the respective positions so that if international traffic did not pan out, if you will, we would structure an agreement such that the lion's share or the bulk of the capital going into building it would come from, in this case, JetBlue.'",
        "'speaker_10': 'So I believe that there is an interest on their part to participate in a financial agreement where they pick up the bulk of the of the cost to build it. As I said, we would we could we could commit up to $3 million in PFC funds to make up the difference.'",
        "'speaker_10': 'And worst case scenario, should there be an amphibious facility built and whether it's a few years later or just any time in the future. You know, it always has a potential for adaptive reuse to be, you know, so that it wouldn't necessarily just be an empty building.'",
        "'speaker_10': 'I wouldn't necessarily want to commit to what it could be, but we would want it designed in such a way that it could be reused for another airport purpose.'",
        "'speaker_4': 'Great. Thank you guys so very much.'",
        "'speaker_7': 'Okay. Thank you. We there's a lot more questions. We're going to go to the public comment period. So please come up to the microphone. To the mic. So please make sure you just state your name and begin. Please go ahead.'",
        "'speaker_4': 'Shirley Brassard. What was comical to me in hearing this is that the planes are already flying. They're coming. Domestic flights are already here. So really, what difference does it make if if we're adding international flights, the planes are already flying in.'",
        "'speaker_4': 'Personally, if I'm getting ready to board a plane, my thoughts are not Who am I? Keep me up at night. I'm not even thinking about it. That's right. That's bad for me. That's. That's not good for me. I should be considerate.'",
        "'speaker_4': 'I'm keeping up somebody. But I have to ask my neighbors, how many of you think when you're in that air? How many people are you keeping up by boarding the plane when you go to Los Angeles and get the flight?'",
        "'speaker_4': 'How many people are you keeping up or do you not care? Because it's not Long Beach. Now we have a new president coming in and this man is all about international business and in acquiring and building up the Americas.'",
        "'speaker_4': 'And Long Beach is a gateway city. This is the gateway city. And I have no personal stake in this. But I believe the horse is already out of the barn. I don't believe we're thinking it through. We don't want to hear an airplane fly over after nine.'",
        "'speaker_4': 'But some of us ladies were nursing at nine. My my concern when I'm on a flight is whether or not I'm hearing any noise at all, because if I'm not, then potentially I have a problem with the plane up there.'",
        "'speaker_4': 'I want to hear the noise. I believe we're not thinking it through. And you want to grow Long Beach? I just do not believe from a business standpoint that this is advantageous just to because you don't want to hear a flight after nine.'",
        "'speaker_4': 'I just don't want to hear it. But I'm a drive to L.A. X and bought a plane at any hour. I want to get out of here. That's what we're doing. It's hypocritical. Neighbors. It's hypocritical.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hello. My name is Pete Perez. Thank you for this time to speak with you. I urge the council to vote no on the international terminal in order to reduce the possibility of airline lawsuits aimed at overturning a no noise ordinance.'",
        "'speaker_3': 'The current economics of the airport has meant that we do not have an overabundance of airlines fighting for slots at airport at Long Beach Airport. This reduces the airline industry's incentive to sue for more slots. If we open up the airport to a whole new range of international destinations, the economics of the airlines flying out of Long'",
        "'speaker_3': 'Beach changes dramatically. I believe that the airlines will find it profitable to fly more slots out of Long Beach. And when they find that number of that, when they find that the number of slots available is insufficient, they will likely sue to overturn the noise ordinance.'",
        "'speaker_3': 'What stopped a potential. Let's stop this. The potential actions to overturn the noise ordinance by not changing the economics of flying out of Long Beach. Once the genie is out of the bottle, it cannot be put back in.'",
        "'speaker_3': 'We are fighting this fight because city residents allowed Douglas aircraft to build a runway with the promise that it would never become a commercial airport. We lose if we all lose if the noise ordinance is overturned. No international terminal.'",
        "'speaker_3': 'I appreciate the time. Thank you, gentlemen.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening. My name is Lloyd Fox. I live in the third district of Holbeach. My daughter, son in law and her three children and three young children live in the Los Altos area, the fourth District. And obviously, as Councilman Superdog pointed out, very highly affected by this.'",
        "'speaker_3': 'I'm very concerned about the establishment of the FISA facility. I don't believe that this is necessary for this city. I think it's harmful to the city residents of Long Beach, and it poses a threat to the current noise ordinance, as has been pointed out.'",
        "'speaker_3': 'And I believe if you look at the numbers, the benefit to Long Beach is marginal. It really is just not there. And I think the overriding question for the mayor's office and for the city council is what kind of city do the residents of this city and you as residents and representatives want to live in?'",
        "'speaker_3': 'What kind of city do you want Long Beach to be and do you want a safe, peaceful city, or do you want a city that is going to be satisfying a corporate greed to add a few extra bucks to their bottom line and they could care less what happens, what happens to citizens and what happens to our'",
        "'speaker_3': 'city. As Councilman Superport pointed out, JetBlue is a flagrant violators of the noise ordinance. And, you know, I understand the difference in the penalties. I've read through all this information. They paid an average about $15,000 a month, as has been pointed out, which is less than what it cost to enforce it.'",
        "'speaker_3': 'And it's the comments that that were made about Chip was fully committed to the Long Beach noise ordinance. I would like JetBlue to be committed to obeying the noise ordinance. We've served as a city. We're kind of blessed in many ways.'",
        "'speaker_3': 'We're served by two international airports that are literally within 20 minutes of the city of Long Beach. And when you look at the study and you look at the economics of the study, you have assumption piled upon assumption and an attempt to justify the FAA US facility.'",
        "'speaker_3': 'And when there is an adverse factor mentioned, it's called speculative. It just it's speculative. It's really not important. And I disagree totally. The economic benefit pointed out in a study is literally worthless, and it's based on this entire regional economic benefit analysis, which is done as as, you know, you know, based on it, based on the the'",
        "'speaker_3': 'the logistics of the study methodology that they use. But the point is that and we tonight heard something for the first time at least, I've heard this about some a local benefit that somehow bit extrapolated from the study.'",
        "'speaker_3': 'But I personally don't think that that is really a very transparent way to do that. The Jacobs has acknowledged that the study did not analyze the difference between adding international versus domestic flights, the $3 million that might be spent, that is in the study.'",
        "'speaker_3': 'That's an assumption in the study. There's $3 million to be spent, and I don't think there's any way of getting it paid back. So I appreciate the time that you're spending on this matter and hope that you will turn it down in a final.'",
        "'speaker_3': 'Thank you, sir. Thank you very much.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Hello. My name is David Alpern. I live in the fourth district and I preface my comments by saying I'm a fan of our airport. I'm glad that just joined us this year from L.A. World Airports. I'm also a fan of JetBlue and try to fly them out of LGB whenever it fits my itinerary.'",
        "'speaker_0': 'I also represent the diligent struggle each of you on the city council and our wonderful progressive mayor how we're trying to manage our city's finances and identify new revenue opportunities. With that monetary message in mind, I ask that you please pay close attention to my economic concern with the potential decision you might make to allow LGB to'",
        "'speaker_0': 'go international. There is concern that JetBlue might pursue the issue legally if the international airport proposal does not get approved in such a scenario, the city's legal team can reasonably and easily respond that LGB is exactly as it was position to the airlines when they first considered launching operations here.'",
        "'speaker_0': 'That is a defensible position as prevailing facts and consistency of practice have a strong and solid legal grounding. However, if the airport goes international, it potentially becomes more attractive to a batch of airlines who may wish to fly more profitable international routes out of the LGB and as such, will be willing to unleash their highly skilled legal'",
        "'speaker_0': 'staffs to find cracks in our noise ordinance in order to defeat it and create opportunity for themselves. A legal onslaught like that will be much tougher for the city to counter, given that the concept of precedent will no longer hold and the parameters will have changed with the transition to international operations, thus opening up considerations that did'",
        "'speaker_0': 'not exist at the time the noise ordinance was created. The city would be facing enormous legal expense to try to defend against and protect the status quo against highly skilled legal teams financially supported to aggressively bring it down.'",
        "'speaker_0': 'Thus voting in favor of international operations now means you are opening up the city to potentially very expensive legal costs in subsequent years. Our city attorney, Charles Parkin, is correct when he says that we can be sued with or without the customs facility.'",
        "'speaker_0': 'However, I would like to ask the city attorney to opine on my following theory. As a domestic airport, JetBlue would have very little ground to stand on since they came here knowing their limitations. However, our city attorney would potentially be facing numerous carriers if you were to go international, including additional airlines, who would want their bite out'",
        "'speaker_0': 'of the LGB Apple. I'd be willing to pull their resources for a legal battle. This batch of airlines will likely have a stronger legal argument to challenge the noise ordinance. And what would likely happen is that their negotiating teams would then ask a future council vote to approve adding more slots to appease this new carrier challenge.'",
        "'speaker_0': 'So to help avoid the scenarios pending court battle, the city's neighborhoods would have to put up with, endure and even suffer from yet another ten or 15 slots. So I'd like to request Mr. Parking as well as council members to please address our city's potential more difficult position in this scenario that I just illustrated.'",
        "'speaker_0': 'Thank you. And I will be eager to follow your assessment of this.'",
        "'speaker_7': 'Great. Thank you. Next speaker, please.'",
        "'speaker_8': 'Hello. I'm Elizabeth. Andrew and I live in the fourth district. I live across from Los Altos Shopping Center, and I would like to invite you to my kitchen for a cup of coffee. Or maybe at 3:00 in the morning when I get up to go to the bathroom.'",
        "'speaker_8': 'I urge you to vote. No, thank you.'",
        "'speaker_7': 'Thank you. Next speaker.'",
        "'speaker_3': 'Please. Hi. My name is Mike Mangan. I'm a member of.'",
        "'speaker_2': 'The eighth District.'",
        "'speaker_3': 'I don't have any audio visual presentation, and I want to thank Mr. Romo for a very thorough presentation. He said something very interesting when.'",
        "'speaker_2': 'Mr. Mayor asked him to speculate.'",
        "'speaker_3': 'So, you know, I don't want to speculate and I can understand that. But this is all speculative. Everything we're doing here is speculative. And so with that in mind, I think a simple cost benefit speculation is not out of line.'",
        "'speaker_3': 'This noise ordinance and I don't want to repeat what people have already said, it is not some physical law of the universe that cannot be violated. And the arguments I hear of, well, the noise ordinance is going to protect us because we have the noise ordinance.'",
        "'speaker_3': 'That's not an argument. That's circular reasoning. That's a tautology. There's no evidence there at all. It was written by politicians. It's enforced by politicians. I think it's safe to say what one considers. Who is going to be running the FAA in a couple of months.'",
        "'speaker_3': 'I will be objective and say all bets are off if we go international. Okay, I. I would like to commend Councilman Super. I live in.'",
        "'speaker_2': 'The eighth.'",
        "'speaker_3': 'District and it's interesting to hear the concerns at the other end of the flight path.'",
        "'speaker_2': 'And I wanted to tell you.'",
        "'speaker_3': 'That you gave me several talking points that I can.'",
        "'speaker_2': 'Spread as I educate people about that. And I like to commend the.'",
        "'speaker_3': 'Efforts of Councilman Turanga. That was one of one of my emails was in there, by the way, and he's not sitting here, but I've done a great job, too. I thank you for your efforts and your attention to what the residents of this city truly want.'",
        "'speaker_3': 'Truly want the people who live here. And like the earlier speaker, I was shocked at the lack of actual local benefit that this fire facility, that this facility would provide. The regional impact fine. But the local impact, the benefits are meager.'",
        "'speaker_3': 'Meager. And I understand that speculative. But the speculative costs, the speculative cost are staggering when one considers public health. Those are two words that were not said enough today, public health. So I urge everyone whom on this council, mayor, who might be wavering on this, I urge you to vote no.'",
        "'speaker_3': 'The people who are voters in the city will have your back on that decision by a wide, wide margin.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_12': 'Thank you very much. My name is Sterling Ringland and I'm currently a resident at eighth District 4300 Cerritos Avenue is where I currently reside. I want to thank you, the mayor and all the council members, for letting us speak today.'",
        "'speaker_12': 'It's a very important issue. I believe I come before you to plead the case that you do not vote to begin the construction of the FISA facility and that you end this red tape bureaucratic charade of attempting to turn Long Beach into an international airport.'",
        "'speaker_12': 'My grandpa once said to me, If it don't make sense, it probably isn't true. And that phrase became so familiar to me when there's talk of an international airport first came up, one of the actual major arguments for having this expansion occur is if we don't have it done, the city might get sued due to failure to'",
        "'speaker_12': 'comply with the noise packet ordinance. So we are actually discussing that the 5 to 10 second disturbance I've had all my life here in Long Beach, the same disturbances which I have had to endure during my classroom, the same disturbances that disrupts businesses and lowers property rates.'",
        "'speaker_12': 'All of that. We're actually saying we need more of that. Else we might get sued. That makes absolutely no sense. And if that argument has any weight behind it, any backing behind it, then the ordinance needs to be changed.'",
        "'speaker_12': 'Which, by the way, the ordinance has not been changed in two decades. It has not been updated and we need to update it. That is the truth. And then there's all these numerous, long, complex and complicated studies that we've already had conducted, and the public can't really understand it as well.'",
        "'speaker_12': 'We are expected to go through all this information with all this complicated jargon, and it's not very transparent to us. I get the airport is trying to explain it to us. Well, but this is very complex information. And you're expecting all these people to go through 700 plus pages of documents and bury through this to just figure'",
        "'speaker_12': 'out what their opinion is. And that's not very fair to the average Joe and I myself. I decided to give those wanting the expansion the benefit of the doubt in believing that this study has some truth to it.'",
        "'speaker_12': 'Let's say that Long Beach does actually get approximately 2000 jobs total and that we do approximately get $105 million expanding yearly. The question we've got to ask is, do the benefits outweigh the costs? Among many, many other questions?'",
        "'speaker_12': 'And the reality is the expansion does not outweigh the costs and get wanting to make Long Beach a more prosperous and wealthy place and want us to make us more productive. And there's a long list of questions we should be studying and answering that are important, and that will help us achieve those goals, like solar panels, like'",
        "'speaker_12': 'increasing the amount of taxes we have on the wealthy, like having more transparency in the criminal justice system. All these things need to be addressed. But we're addressing this red tape bureaucracy. It doesn't make sense to quote war games.'",
        "'speaker_12': 'The only winning move is not to play. Don't waste taxpayers hard earned money or time on a project. Not with the cost. Please, Councilman. And women do not allow this expansion to occur. We do not need any more unnecessary studies or unnecessary discussions about this.'",
        "'speaker_12': 'Let's focus on actual issues and not on a waste of time. Thank you very much.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening. My name is Nancy Lopez. I'm from the fifth District. I have attended since probably October every single meeting in regards to this matter. And this is the first where we've actually been supported by members of the community and residents.'",
        "'speaker_8': 'In other occasions. We've actually been told that we have had to wait and it is not until late in the meeting that we're able to actually speak and by then people need to go home. So I'm actually happy that there's a greater turnout than usual.'",
        "'speaker_8': 'The noise ordinance is one of the things that is most mentioned in regards to this matter, and it is something that our family deals with all the time. We live on the corner of Willow and Clark right across the street.'",
        "'speaker_8': 'We can actually walk to the airport and we can see the flies come in and out. And although that's a major concern, there are other concerns among those noted security, which I think, you know, I, I don't even know his name, but he said that, ah, in the study it says that security is going to be fine'",
        "'speaker_8': '. But like I forget who said super near. I don't know. But Long Beach PD cannot enforce security in our communities. Neither can the Department of Homeland Security. So Customs and Border Patrol, if there's somebody that's, you know, that's outside of our neighborhoods, that could be a potential threat.'",
        "'speaker_8': 'They can't come and help us. It would have to be Long Beach PD on that. No housing, nothing was said about the impact, the economic impact on the houses, on the market value of those houses. There was nothing that was said about that.'",
        "'speaker_8': 'And I think we were able to come to an economic development meeting. And I think, Councilman Cohen, he said that there was nothing that was looked into about how this would impact our houses negatively. I know that this Long Beach, the Long Beach Airport, is unique in that it is in some of the nicest areas in Long'",
        "'speaker_8': 'Beach. And that's something that a lot of families have invested in, and I don't think that's being considered. Lastly, the financial revenues, it will bring a large revenue, but none of that can go back to the city. So if there's any negative impacts, how is that going to affect what can actually be done to improve the city'",
        "'speaker_8': '? That's that's it. Thank you so much for your time.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'My name is Dan Freeland. I live in Los Altos area. I've lived underneath landing and taking off airplanes for over 60 years. So given that couple of questions, Jacobs Engineering, I expect, is done other feasibility studies. Is that true?'",
        "'speaker_3': 'Yes.'",
        "'speaker_7': 'I think the I think I'm assuming Mr. West answer that is yes. Are a bunch of these.'",
        "'speaker_3': 'Okay. Has Jacobs Engineering done any feasibility studies that came up? No, we don't recommend it. You can't do that. It's a bad idea. Okay. Secondly, if. If somehow the office is created and it's kind of like putting a bowl of honey on the kitchen table and you got six kids and only one kid can have the honey'",
        "'speaker_3': '. So no, you can't have that. Mama said that's my honey. You can't have any. Who? And six kids. Five other kids are going to say what? They're going to go talk to PA. All right. So now we've got multiple airlines perhaps interested in international flights out of Long Beach.'",
        "'speaker_3': 'And they're going to sue us. They will sue us if this is a good idea. They will see it as a good idea and they want a piece of it. Give me some of that. So now who's going to fight their lawyers?'",
        "'speaker_3': 'Is the airport going to pay for that or is the city going to pay or are we going to pay for that? We are going to pay for that. Or the airport. We. Nobody's answering that here. You know, everybody back there is saying it, but.'",
        "'speaker_3': 'Okay. Yeah. Just wanted to make sure that. Now, I'd like to thank Stacey Mungo for a community meeting she had a couple of weeks ago in Eldorado Park. She pointed something out to me that I thought was rather interesting.'",
        "'speaker_3': 'She had mentioned a lady, some lady on Redondo, who is complaining about helicopter noise and to the point where the people had scheduled or routed helicopters rerouted the helicopter, so they flew over Stacey Mungo's region. Stacey Mungo called the helicopter people and said, Hey, you want 54,000 phone calls and emails about this noise?'",
        "'speaker_3': 'You better do something about it. Thank you. Ms.. Mungo. I thought that was a very interesting story. If we are impacted by an airport, who are going to get to complain? We're here now. We will be back. We won't stop complaining.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening, and I thank you for the opportunity to participate in this event. My name is Elizabeth Eastman. I live in the seventh District, 840 East 37th Street. I've lived there for 20 years, raised my two children with my husband, John Eastman, who will follow me, children who have been to Longfellow, Hughes and Polly.'",
        "'speaker_8': 'They are currently in college, both of whom are about to finish their education, one getting a degree in astronautical engineering, the other one actually doing a double degree, one in violin performance and also mechanical engineering. I would like nothing more than my children to come back to this neighborhood, to the neighborhoods we've lived in, and have the'",
        "'speaker_8': 'wonderful life for their children that we were able to impart to them. My question and my real concern is, is like so many, this great concern about the noise ordinance and if were not even confident about raising the question about increasing the fines, why on earth would we ever go down this.'",
        "'speaker_4': 'Path of engaging in.'",
        "'speaker_8': 'A international facility? If you're so fearful about losing the noise ordinance over.'",
        "'speaker_4': 'Increasing the fine. Then why do this? So I implore you.'",
        "'speaker_8': 'To please, please.'",
        "'speaker_4': 'Vote against this.'",
        "'speaker_8': 'And I simply leave you with the question why was there no analysis of costs associated with the loss of the lot of the noise ordinance protection? Our neighborhoods and our city will suffer dramatically. Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'John Eastman. I'm her husband and happy to be so there were there were there were two just false statements in the presentation. Councilman Supernova did a terrific job of just blasting the first one that ours is the strictest ordinance in the world.'",
        "'speaker_3': 'It's a paper tiger. It's only a strict as the enforcement and the fines are so low that we guarantee none and not non-enforcement or noncompliance. The second thing, though, is even more troubling to me. We can't restrict rich routes.'",
        "'speaker_3': 'The airlines fly. That's just not true. They cannot fly here internationally if we don't have a federal inspection service that allows them to land here internationally and nobody is forcing us to build that thing, we're going to pay for it if we decide to do it.'",
        "'speaker_3': 'It is entirely our decision whether to put at the airport that we own an international facility that will allow those flights. So we do have the ability to restrict routes, routes they can't. Now, I want to go in my remaining time to a more fundamental flaw with the study, though, and that is the notion that we're going'",
        "'speaker_3': 'to have an economic benefit from this. That's got to be based on one of two things, either as I suspect that it's going to be filling in demand where there is not demand right now from the 32.5 average slots usage daily slots per month at 79% utilization to 100% utilization.'",
        "'speaker_3': 'Newsflash if you drop it further down to 50% and utilization are heck all the way down to 15 flights a day back to where it was in the 1990s, we would all be very happy. So we don't need to increase the demand to get to the full utilization of the noise ordinance slots.'",
        "'speaker_3': 'If the domestic market won't allow for it, we will all be very happy with that. The second thought we might get to that is if there is some differential between economic benefit from the domestic rather than the international flights.'",
        "'speaker_3': 'This study does not assess that. But I think, as Councilman Sugano, you pointed out rightly, it may be a negative impact rather than a positive one if we're supplanting rather than adding flight. This study is flawed. The overall premise is flawed, and please vote against it now.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_7': 'Next speaker.'",
        "'speaker_3': 'Please. Joe Soto, fifth district mayor, city council members. Staff. Mr. Mayor, we've been here before. A couple of decades ago. You remember that you've had the experience of staying here till midnight when you were a councilman. We fought for airport expansion.'",
        "'speaker_3': 'This is airport expansion, but we're calling it a different name. We're calling it international flights, domestic versus international. What we need is more domestic competition. And we don't have the competition there. We don't need international flights. I saw real estate for a living when I commit to a 30 year loan.'",
        "'speaker_3': 'I want. I'm more of a commitment on your part than four or five years on a on an overhead projector. Convention business will not come from south of the border. Convention business comes north of the border. So in the presentation, a statement that was made.'",
        "'speaker_3': 'International flights must operate within constraints of the noise ordinance. But JetBlue is the largest noise violator in the last 12 months. JetBlue broke our noise ordinance 117 times. That means that JetBlue flew flew over our home, our homes between 11 p.m. and 7 a.m. in the morning.'",
        "'speaker_3': 'Now, that's not counting JetBlue's landing between ten and 11. That's I'm sure I didn't track that. I'm sure that's in the hundreds. But they get a break there. Shouldn't we be telling JetBlue before we grant you an international airport that you need to start breaking the noise ordinance, show us that you can do that.'",
        "'speaker_3': 'Instead, we're at the precipice of offering or allowing them an international airport. That doesn't make sense. Airport manager mentioned something about an in the feasibility study. Mr. Cuomo. You said something about the first year of our Pepsis. There'd be $13 per passenger.'",
        "'speaker_3': 'And then the second year through ten years, it would be $6 for PFC. Was that correct in that presentation? And it was something like that. It was a dramatic drop. And I was wondering if if that was based upon, we would become a point of entry, because there's a difference between how we're going to take this international'",
        "'speaker_3': 'airport or and or point of entry. L.A. Access point of entry. Federal government shares with the expenses, it costs a lot less money for the city. John Wayne has been lobbying for years upon years since they started doing the international flights to become a point of entry.'",
        "'speaker_3': 'John Blue. Blue is a bigger airport than us. They have more power in my time is up. One question I do want to ask you is can we be an international city with an award winning municipal airport? Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'I'm Joe Miller, fourth district. I've been to of all of the study sessions and tonight it just morphed into something different and different handouts, different everything. The terminal one is what used to be terminal three. Option one used to be terminal three.'",
        "'speaker_3': 'So, you know, trying to keep everything straight has been a task this evening. There's three there's ten items that I'd like to bring up that my neighborhood is very concerned about. One is that no master plan for the Long Beach Airport basically means that the city's master plan is JetBlue's business plan.'",
        "'speaker_3': 'The FAA's feasibility report envisions the well used to tonight. It was different. Envision the last international flight at 9:30 p.m. tonight it said 1015. I'm not sure why. It says from Cancun it's 1015. But at all of the feasibility studies, we have asked at every one that we've been allowed to, what are the rates of late international'",
        "'speaker_3': 'flights at the surrounding airports? And we have never received an answer from that. We've kept on asking, we keep on asking. And no one seems to be able to find out what the late rates of the international flights are from the surrounding airports.'",
        "'speaker_3': 'Tonight was the first night that we saw a local feasibility impact. All of the other studies that we've been to, we have never seen local impact. People have asked about the local impacts. The Jacobs people said, Our software doesn't do that.'",
        "'speaker_3': 'Tonight was the first time. It's always been trickle down. Tonight the first time. We don't know where these numbers came from. Tonight was the first time anyone has seen these local impacts. Real quick, I want to bring up the impact of the Trump administration on international travelers coming in the U.S., especially from Mexico.'",
        "'speaker_3': 'Like everything in the next four, 4 to 8 years, we have no idea what is going to happen. The impact of the Trump administration on bilateral agreements between Mexico and the U.S. is unknown. The only Trump Mexico policies that have been known as the president elect continues to insist that he's going to build a wall and change'",
        "'speaker_3': 'NAFTA. What the impacts of that on our Mexican flights are going to be, which seems to be what's going to happen. Nobody seems to know. I also want to mention really quick that the terminal options. Please read those carefully because there are some passenger inconveniences it lists inside there.'",
        "'speaker_3': 'And you know, going from a award winning boutique airport. Does anyone know what an award winning boutique international airport? The answer is there are none. And there is a reason that all the world's top ten international airports are outside the United States.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_13': 'Mr. Mayor. Thank you. My name is Robert Land. I'm senior vice president of government affairs with JetBlue Airways, 4400 Donald Douglas Drive at the airport. It's good to be back here. Councilman Urunga, thank you for calling the study session.'",
        "'speaker_13': 'We fully support an open process and participating in that with all the people behind me. I want to remind the council that JetBlue is a 16 year old relatively new entrant in a very legacy dominated industry here in America.'",
        "'speaker_13': 'We've been a disruptor to this industry with award winning customer service and everyday low fares throughout the country and in international markets, which is about a third of our network, including Havana, which was our 100th city two weeks ago, doing it with new aircraft, 20,000 crew members across the system, including 700 here in the Long Beach area'",
        "'speaker_13': '. To something you said earlier about the split between domestic international. Are they coming from here? Visiting JetBlue doesn't operate hubs. We operate focused cities. And what that means simply is we don't connect people. So where most airlines connect.'",
        "'speaker_13': 'Most legacy airlines connect between 60 and 70% of their customers who want to go from A to B, the airline makes them stop at sea. JetBlue's business model is completely different. It's not better or worse. It's just different.'",
        "'speaker_13': 'But it has relevance to this conversation. JetBlue's business model is an indie origin destination. So 90% of our customers, nine out of every ten of our 35 million customers every year start in a and go to be and we don't make them stop and see.'",
        "'speaker_13': 'We have six focus cities where we do that are all densely populated areas. That's the only way that model works are only one five are on the East Coast. The only one on the West Coast is here in Long Beach.'",
        "'speaker_13': 'That's good for the local economy. People are coming to or leaving from Long Beach, contributing to the economy, not just passing through it. Paying a PFC, as alluded to earlier, they're actually spending money here and spending time here.'",
        "'speaker_13': 'Our 700 crewmembers who work at JetBlue. They contribute to the community. They partner in parades and meetings and they contribute to the economy. They're your constituents. We began here 16 years ago, almost 16 years ago. Today, we're at 35 flights to 13 different markets coast to coast, including several to New York and Boston.'",
        "'speaker_13': 'And you saw the new one coming to Lauderdale. We asked for the customs facility a couple of years ago. This would only be for a very small portion, as you heard earlier, of our flights. A very small portion.'",
        "'speaker_13': 'Two years later, we're very happy that last week the council lifted the ban on city staff speaking with us. We look forward to working with the city staff and giving them all of the information they need to help you make an informed decision.'",
        "'speaker_13': 'And in closing, we request this council consider the Jacob study's very positive comments on the economic impact to the city jobs. It will bring tourism enhancements. There will be, we believe, in our models, forecasts, convention business and embrace the city's stature as an international city and vote in favor of the facility.'",
        "'speaker_7': 'Thank you. Next week. Speaker, please. Next week replace.'",
        "'speaker_5': 'My name is Laura Soma. I'm a resident of Long Beach. My address is on file. I live in District four. I'm here speaking to that request.'",
        "'speaker_4': 'By JetBlue Airways.'",
        "'speaker_5': 'To the city to expand service at Long Beach Municipal Airport and change or airport to an international airport. I have a poster here because unlike the study, we don't get to put our graphics on. And I hope the city the video they can see what my little poster is is my show and tell.'",
        "'speaker_4': 'This is the Long Beach Airport. These are the areas that are affected by JetBlue.'",
        "'speaker_5': '1148 last night, plane landed right over us. And these are the.'",
        "'speaker_8': 'Districts drawn that are not affected by.'",
        "'speaker_5': 'The commercial.'",
        "'speaker_8': 'Airlines flying in and out. And you see the way the district lines are drawn. It's kind of.'",
        "'speaker_5': 'Unusual that the airport is in a district that doesn't have commercial flights going over it and it just doesn't seem.'",
        "'speaker_4': 'Fair.'",
        "'speaker_5': 'And it doesn't there's some kind of social element justice. So I really hope that the city at large on the camera can see that it's trying to.'",
        "'speaker_4': 'Turn that around to. Our group can see it too.'",
        "'speaker_5': 'Oh, so we need some just votes. The. The airport turns to 75,000. Just paid for this business study. And I have an MBA from a very prestigious university. And I know that that document is really just a business instrument because that's what businesses do.'",
        "'speaker_5': 'It's a $5 billion corporation wanting to study. And today in Washington. So that study, I think.'",
        "'speaker_4': 'Has a bias.'",
        "'speaker_5': 'Because it doesn't show negative impact. But. So today in Washington, there's a new wind blowing at the federal level. The $5 billion.'",
        "'speaker_4': 'Corporations are poised.'",
        "'speaker_5': 'To eliminate regulations that hinder their growth. This is true in Congress and at the executive level. Government regulations that used to protect us are now in jeopardy. This is not the time to turn our municipal airport into an international terminal.'",
        "'speaker_5': 'Taking this action would hand JetBlue the highly profitable flight I get from their business report.'",
        "'speaker_4': 'The highly profitable flights.'",
        "'speaker_5': 'With no real competition. This is exactly what Delta, American and Southwest need to sue Long Beach, the city of Long Beach, and its ordinance that limit its ability to compete. So and Southwest has a history of suing airports in campaigning and winning its its lawsuits.'",
        "'speaker_5': 'The ordinance is not allowed to impede competition. So handing JetBlue these flights is not a good idea.'",
        "'speaker_7': 'Thank you. Thank you so much. Next speaker, please.'",
        "'speaker_3': 'Hi. My name's Richard Gutman. I live in the seventh District and Wrigley Heights. Is she smart or not? Most Long Beach residents have neither the time nor the inclination to know a great deal about city council members intelligence.'",
        "'speaker_3': 'It's not like we can give them an IQ test before we vote. In the case of Stacy Mungo, I think I know that answer. A friend who worked at Lakewood High School when Stacey was a student there says Ms..'",
        "'speaker_3': 'Mungo is very bright. Ironically, I find that troubling. I think it's fair to say that Mungo has been the chief proponent on the council of making our airport into an international one. She was a big backer of the $345,000 feasibility study.'",
        "'speaker_3': 'Mungo surely knows that Long Beach never contracts for a study, does an environmental impact report, or conducts a survey. It doesn't find it can and should do what it already wants to do. No one knows for sure if allowing international flights will eventually lead to the loss of our noise ordinance.'",
        "'speaker_3': 'But is it wise to take such a chance? We're gambling with large areas of Long Beach additions to the main runway into basically areas with numerous flights 24 hours each day. And for what? Making JetBlue happy, making it slightly more convenient to fly to Mexico or to South America.'",
        "'speaker_3': 'Even the best possible outcome of allowing international flights provides our city with practically negligible benefits. There is no way that Staci Mango doesn't understand this. It makes you wonder what is her real motivation? Thank you.'",
        "'speaker_7': 'The next speaker, please.'",
        "'speaker_9': 'Hi. My name is Terri Foster. He's my last name. I'm a long time resident of Long Beach. Also, the primary reasons I've heard given for converting our unique airport thus far have included increasing revenue for the city of Long Beach, as well as avoiding possible lawsuits by airlines.'",
        "'speaker_9': 'However, should our airport be converted to yet another international airport, two of its highly significant and imminent impacts would be decreased property values and thus decreased property taxes. Has Long Beach done a study to help determine the potential loss of revenue because of these factors?'",
        "'speaker_9': 'I have yet to hear any concrete numbers or even any estimates concerning them. Interestingly, they weren't even addressed in the very expensive Jacobs Engineering Engineering Feasibility study, which seems like a no brainer as far as their inclusion in the report.'",
        "'speaker_9': 'In addition, and as far as possible lawsuits are concerned, it would open the door for thousands of lawsuits against the city by residents and property owners whose homes and investments would undeniably take a huge hit. Aside from the obvious heightened security issues, which would come with an international airport, the traffic congestion would be phenomenal, not only because'",
        "'speaker_9': 'of the increase in traffic to the airport itself, but also because of the congestion which is already inevitable due to the massive development which is currently in progress at Lakewood and Carson. And in addition to the many other residences and businesses already in the immediate area along with Long Beach City College.'",
        "'speaker_9': 'As far as the interest of council members and their district residents, only three council people were present at the October 20th airport meeting at the gas company. There are many excellent speakers at the meeting who were obviously extremely educated in various aspects of the Jacobs engineering feasibility study, which was pretty much eaten alive due to much of'",
        "'speaker_9': 'its outdated, irrelevant and seemingly biased results. It is my sincere hope that each and every council member, as well as the mayor, carefully read the minutes from that meeting to better understand the results of the study. There was an onslaught of charts which could easily be interpreted by many to be simply smoke and mirrors during the presentation'",
        "'speaker_9': '. I understand that revenue is obviously important to any city's operations and well-being. I'm also well aware of the fact that we live in a capitalistic society, and I have absolutely no problem with this. It's a good concept provided that decisions are made responsibly.'",
        "'speaker_9': 'Greed is not good, and it certainly isn't an asset, nor is ignorance. There's a very interesting and informative, informative article in today's Press Telegram regarding two members of the Airport Advisory Commission who have obvious and troubling conflicts of interest in converting Long Beach Airport.'",
        "'speaker_9': 'It's outrageous that these people somehow made it onto the commission. Per the article, although the Commission does not have authorization to approve this project. The City Council has requested its input on it and not surprising in the least.'",
        "'speaker_9': 'The Commission is expected to send a letter to the Council recommending approval of the international airport in January. Our Long Beach Airport was ranked number seven in the United States on the Conde Nast Traveler survey and increase from its number ten ranking in 2015.'",
        "'speaker_9': 'Again, number seven in the entire United States. We, the people at Long Beach, already have a valuable gem in our grasp.'",
        "'speaker_7': 'Thank you, ma'am.'",
        "'speaker_9': 'Don't be fooled by the shell game that is being played before us. Please vote no.'",
        "'speaker_7': 'Thank you. Next speaker, please. Just trying to. I know we have a lot of speakers and is trying to be good about time if possible. So please next speaker.'",
        "'speaker_8': 'Good evening, Mayor Garcia, Councilmembers and City Staff.'",
        "'speaker_4': 'My name is Wendy Nicolai and I live in the seventh district. I have written to.'",
        "'speaker_8': 'Each of you.'",
        "'speaker_4': 'A couple of times since the study came out, and I did attend the airport advisory commission meeting and I spoke at that as well. And during that airport advisory commission, I had asked the council members in the city to really study these numbers in the in the study.'",
        "'speaker_4': 'And I don't know if anyone's done that, but I have a little bit 700 page study. There's a lot of information there. So I'm just going to tap on a few things within the 2 minutes I have left.'",
        "'speaker_4': 'One is that it cites that there's 350.'",
        "'speaker_8': 'Jobs that will be created as.'",
        "'speaker_4': 'An economic contribution, and that generates $36 million of output. Here's what I saw. I saw that only five long term jobs were created and those were in operations and management. I saw 150 airport staff jobs that were created, but those don't make sense because we're using the existing slots.'",
        "'speaker_4': 'So you would think we can just reallocate those resources to those international flights. So I question that number and I also question that a lot of those numbers were generated by short term construction jobs, and that's not a long, long term benefit.'",
        "'speaker_4': 'Here's what I did see. I thought $23 million of debt being taken on.'",
        "'speaker_8': 'For 20 years. And I saw a plan to pay off that.'",
        "'speaker_4': 'Debt $13 at a time by charging passengers. And I question that $13 per passenger when surrounding airports charge $8 or less and their parking fees are much less or $25, and a lot of people don't park there anymore.'",
        "'speaker_4': 'So where's the plan to pay off that building? So let's not take on 23 more million dollars of debt and be more in debt to JetBlue. So I can't argue with implied numbers. I'm not an economist, but what I did do is I took their same numbers, a divided what their output was by the number of jobs'",
        "'speaker_4': 'they created. And that came up with a number. And that number was here's one of them, 253 jobs created, $39 million of output when we built this facility. That's about $154,000 per job in output. So I just took that and said, hey, well, what happens if we just bring a business to Long Beach?'",
        "'speaker_4': '200 people strong. That one business, one business in five years would generate $154 million in revenue without any debt. It would increase the tax revenue to the city, it would increase.'",
        "'speaker_8': 'The real estate value to the.'",
        "'speaker_4': 'City, and it would do that with no risk and no cost. Secondly, we need a master plan. Councilman Alston mentioned this. No one has answered it. We don't have one. There's been dance and song around that. We don't have one.'",
        "'speaker_4': 'We have something like one. But we don't have one. Without a plan, we can't consider the FAA metroplex in bigger picture. We can't plan responsibly for growth. We don't have transparency to the city and its residents, and we cannot get our dependency off JetBlue in control.'",
        "'speaker_4': 'So I ask you to please turn the situation around and gain back the public's trust. The JetBlue gentleman mentioned that this has been ongoing for four years. Tonight he mentioned two. I've heard about it for one year and the decision being pushed forward in three months.'",
        "'speaker_4': 'Please say no. It's a high risk endeavor. Short term gains, long term concern.'",
        "'speaker_7': 'Thank you, ma'am.'",
        "'speaker_4': 'Please vote no. Thank you.'",
        "'speaker_7': 'Thanks so much. Next speaker, please.'",
        "'speaker_4': 'No. My name is Gina Legault. I'm a long time Long Beach resident. I do work for JetBlue Airways. I am a flight attendant based in Long Beach. I've been flying out of Long Beach for over 13 years. And I can tell you from talking to hundreds and hundreds of customers because they love flying JetBlue and they really'",
        "'speaker_4': 'want to fly international. I think this is a progressive city with all the improvements we've made. I'm a third generation. My family's here, and I think the international terminal is just one more quality of life and choice people have.'",
        "'speaker_4': 'As long as whoever flies internationally out of or flies any flights. So Long Beach follows the ordinance, the rules, the slots, those rules we have in place. I think it's a great enhancement to travelers and I do think it should be approved.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'Thank you. Hey, everyone. Hey. No, no, no. We're all going to be respectful to all the speakers. Please. Okay. Thank you. Next speaker. Good evening, Mayor Garcia. Members of the city council staff members. I'm Myron Campbell and I'm a ground operations leader for JetBlue here in the city of Long Beach and in absolute honesty.'",
        "'speaker_7': 'I always count it a privilege to speak before you. I respect what you do as community leaders and consider it and consider most of you consummate professionals. Because of what I've listened to, read about, and watched you do for your communities and this thriving city.'",
        "'speaker_3': 'That is why I encourage your approval.'",
        "'speaker_7': 'Of Federal Inspection Service by.'",
        "'speaker_3': 'Making it a yes on FISA. Here we are this evening.'",
        "'speaker_7': 'With what started as a letter sent to the airport director with a request for our staff. F. I. S last year in February to a host of community meetings, study sessions, voting, airport advisory and Economic Development Commission sessions.'",
        "'speaker_3': 'It's been a long road.'",
        "'speaker_7': 'A very lengthy process, but all respected and require due diligence for serious consideration. And so far we've seen positive results. Results. Again, this is why I encourage you to vote yes on FISA over the past year. We've dance with them.'",
        "'speaker_7': 'And tonight, actually, we danced with some noise ordinance concerns that have displayed no impact or change. If an FISA facility is approved, then we've moved on to other.'",
        "'speaker_3': 'Unsubstantiated.'",
        "'speaker_7': 'Claims such as environmental, economic, or maybe even social impact on communities. However, the feasibility study has addressed these issues as having no negative impact on the city. JetBlue has been a passionate and responsible corporate citizen that has woven itself into the fabric of the community, which has contributed to the enhancement of the use and enjoyment that makes'",
        "'speaker_7': 'Long Beach such a prideful and exciting place.'",
        "'speaker_3': 'You know, in all of the legal, political.'",
        "'speaker_7': 'And social maneuvering that has taken place since February.'",
        "'speaker_3': 'Something important has gotten lost. The truth of the matter.'",
        "'speaker_7': 'Which is Long Beach air.'",
        "'speaker_3': 'Carriers who.'",
        "'speaker_7': 'Were slot restricted were just slot restricted. And we will remain restricted whether an FAA facility is approved or not.'",
        "'speaker_3': 'FISA approval will not negatively impact the airport or.'",
        "'speaker_7': 'Estate of Long Beach council members. There are a lot of us.'",
        "'speaker_3': 'Back here in the background.'",
        "'speaker_7': 'And some people behind me, a lot of us want to tell you what to do. How to do your job. But I believe the reason you're sitting there and we're sitting here is because of who you are and what you've done for your communities.'",
        "'speaker_7': 'You are the best. I urge you to continue to embrace that higher principle for which you have been called to serve by fulfilling your duty and making the right decision for the city of Long Beach.'",
        "'speaker_3': 'And making it a yes on FISA.'",
        "'speaker_7': 'Thank you. Thank you. Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mayor. Council Members. Staff Thank you so much for allowing us to speak and for going into depth on a very important, life changing, city changing issue. There's more to talk about than I have time to address, but I'm going to talk about two main topics that I don't think have been gone into nearly enough.'",
        "'speaker_3': 'Is this better for volume? Oh. I'm David Raichlen, aka Alien, and I'm a longtime resident and business owner here in Long Beach in the eighth District. Thank you, Al Austin. It's just super nice, all the people who have provided useful information.'",
        "'speaker_3': 'Unfortunately, the FISA study does not provide useful information, and there's a good reason for that that has not been mentioned at all. The study is based entirely on other people's research. There is a tiny amount of original research that's done in the feasibility investigation, but most of it is what we call a meta analysis.'",
        "'speaker_3': 'That's a fancy term, which I know from my years doing scientific research, but basically a meta analysis means that you're using someone else's data to draw conclusions that are different than the conclusions of the original investigators. And metadata studies have a horrible reputation because they're usually wrong.'",
        "'speaker_3': 'And for kind of the obvious reasons that when you start looking at other people's data for a purpose that was not originally intended for your bias. Conscious and unconscious bias starts to take over. And when I asked the Jacobs people at the press study sessions eight months ago about statistical bias and unconscious bias and how they were'",
        "'speaker_3': 'going to address that, they said something very interesting. First, let me explain that bias comes from poor judgment. And we try to make judgment, not a factor in creating the data and doing the initial analysis. And you only use judgment after.'",
        "'speaker_3': 'The data has been properly organized, and Jacobs didn't do that. In fact, they couldn't even define what statistical bias was, what unconscious bias was, what a statistics session was in a report. There are no statistical methods discussed anywhere in the 700 page report, but it's all based on statistics.'",
        "'speaker_3': 'So that means it's all based on their judgment and not on facts because they didn't discuss their methods. They could have made this stuff up. Thank you.'",
        "'speaker_7': 'Okay. We're going to next speaker. And then we have we have about 30 minutes public comment in line right now in addition to a lot of questions from the council. So I'm going to limit it to 2 minutes at the end here towards this line.'",
        "'speaker_7': 'So. So as we get to the end of the line and start limiting it to 2 minutes, but keep going because we're going to have continue a lot more public comment. And so we're going to have to take 3 minutes, but the line gets keeps getting longer.'",
        "'speaker_7': 'The last person that was in line behind you, ma'am, will be limited to 2 minutes after the last lady that was in line before I made the announcement. Okay. So please continue.'",
        "'speaker_14': 'Good evening, Mayor Garcia, councilman and councilwoman and Long Beach resident. My name is Watson MATTHEWS. Judging by what I'm wearing tonight, it's no secret what I do. I come here today, having grown up in Southern California and as a resident of Huntington Beach and as an airline pilot, was well aware of the technicalities and formalities of farce'",
        "'speaker_14': '. With all that being said, I'm 100% in favor of the customs facility being built and urged you all to vote accordingly. I've been a pilot for 12 years with the airline for nine of those years. In the course of my career have flown five different types of passenger jet aircraft.'",
        "'speaker_14': 'I'm well aware of the noise profiles of the aircraft I've flown, especially when operating in and out of Long Beach. Since that is my professional duty and responsibility to minimize the impact when I fly in flight as efficiently as possible.'",
        "'speaker_14': 'I've reviewed the various concerns presented by Long Beach area residents at this meeting in the two previous ones. And I must say that all my questions and concerns were fully and properly answered, using facts and logic instead of emotion.'",
        "'speaker_14': 'I live near Huntington Harbor under the final approach. Quarter of the aircraft coming in over water. And aircraft routinely fly over my home at low altitude. I know this fact because I routinely fly over my own house on a weekly basis and know without hit on that.'",
        "'speaker_14': 'Despite aircraft being as low as they are in my neighborhood, I see them fly overhead. However, I do not hear their noise profile. I understand that implementing FISA is a change, and for the most part, we as humans have issues with change.'",
        "'speaker_14': 'The current noise ordinance caps the number of commercial flights serving Long Beach. Building FISA doesn't change that. The current noise ordinance sets curfew times. Building FISA doesn't change that. The findings of previous pollution emission studies remain valid because implementing FISA doesn't change that either.'",
        "'speaker_14': 'I've mentioned a handful of things about what FISA doesn't do. Let's go over a few things that it does do. Construction alone will bring in upwards of $38 million and hundreds of jobs after completion. FISA Second, economic contributions are in the millions annually, with hundreds of businesses being positively affected.'",
        "'speaker_14': 'For you as the traveler, the ability to fly in and out of Long Beach International gives you the ability to join much cheaper airfares. Based on an airline's historical impact on starting service. If there's one thing that everyone in this room can probably agree on is that L.A.X. is an operational disaster.'",
        "'speaker_14': 'And I say that with most respect to airport officials in this ceremony. Why would anybody want to spend hours dropping off or picking up a loved one at LAX when they can do so in minutes here in Long Beach?'",
        "'speaker_14': 'Why would you, as a traveler, want to spend an hour or more going through security in LAX? We can do so in minutes in Long Beach. I'm presenting this to you today, both as a passionate resident, but also as someone that knows and understands the ins and outs of the industry.'",
        "'speaker_14': 'I'm here because FISA and LG in Long Beach. Absolutely needs to happen. Thank you.'",
        "'speaker_7': 'Thank you, sir. Next speaker, please. And before we go to the next speaker, I just this is a reminder. I think it's important that every person gets an opportunity to give their opinion. Please. And in a way that's respectful.'",
        "'speaker_7': 'Please go ahead.'",
        "'speaker_5': 'I was just confused. If you lived in Long Beach or Huntington Beach, it was confusing. My name is Laurie Smith. I'm resident of the third district. I live in Bluff Park. I just wanted to follow up to an early discussion about the comparison between John Wayne Airport and Long Beach Airport.'",
        "'speaker_5': 'The real difference is that it's who manages the airport. John Wayne Airport is managed by the county and a board of executives and directors and here at Long Beach it is managed by the city. There is no checks and balances at this airport.'",
        "'speaker_5': 'The city of Long Beach. The city of Long Beach. Your council officials right here are the ones who manage it. And they also have an airport advisory commission that, as of yesterday, is now under investigation by a state commission.'",
        "'speaker_5': 'John Wayne Airport has a terrific community airport commission. I read their minutes and I will be happy to post that online. And what we need here at Long Beach is a community roundtable where each neighborhood association can have a representative and it's run by an impartial facilitator.'",
        "'speaker_5': 'So please let your representative know about that. I'm also curious if the JetBlue facility would just be for them, or is this open to like general aviation and private jets? So that was a question I had. So yesterday I just wanted to inform you that I received notice from the California Fair Political Process Commission that they have'",
        "'speaker_5': 'initiated an investigation into conflict of interest issues with regards to the Airport Advisory Commission. And these are the same issues that I've talked to you about at numerous meetings, and I emailed to you and spoke to you about last week.'",
        "'speaker_5': 'The conflict of interest issues are under Bush under investigation involve the vice chair and the chair. And it is with regards to business dealings that they have with JetBlue and the city of Long Beach. On tonight's agenda, the vice chair is also an owner of Millionaire.'",
        "'speaker_5': 'And item 13 on tonight's agenda. The city is looking to lease their office space so that they could house their airport staff there. This is going to be $800,000. And this gentleman has been participating in the airport commission and their draft report was also filed at the government on our city government's website.'",
        "'speaker_5': 'I just wanted to read you the the letter I received yesterday from the Fair Political Practices Commission regarding the Long Beach Airport Advisory Commission. This letters to notify you, me, the filer, that the enforcement division of the Fair Political Practices Commission has initiated an investigation into the allegations under the jurisdiction of the Fair Political Practices Commission of'",
        "'speaker_5': 'the sworn complaint that I submitted in the referenced matter, and they thank me for bringing this matter to their attention, signed the Chief of Enforcement Division. It was also seek to Mike Mays, the Long Beach City attorney. I have also filed with the district attorney, L.A. County District Attorney Division, the integrity division, which will be looking into'",
        "'speaker_5': 'the Brown Act violations and the conflict of interest. Please look online for.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_5': 'The public forms that.'",
        "'speaker_7': 'We got I got it's 3 minutes a person.'",
        "'speaker_5': 'Thank you so much. So much. I'll give it to the clerk now.'",
        "'speaker_7': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Good evening. Anne Cantrell and I live in the fifth District. Like some of you council members, my district, at least my area is not impacted directly by the airport flights, but I am concerned about my city as a whole as I think you should be two years to not only represent your constituents in your district, but the'",
        "'speaker_4': 'whole city. And I also like Long Beach Airport. I'd love to fly out of Long Beach Airport. But as Mayor Garcia suggested earlier this evening, I'm concerned about the lack of domestic flights, which I fly much more than I do international.'",
        "'speaker_4': 'I used to be able to fly to Washington, DC nonstop. Can't do that anymore. I can fly to Austin to visit my great grandchild. But there's only one flight a day where there used to be more. I if JetBlue is limited on the number of slots they have.'",
        "'speaker_4': 'If they're good business people, what would they use those slots for? Domestic to Seattle or international to Guatemala, which makes the most money. And I think that's going to factor into what where they decide to fly. I am also very concerned about the environmental compliance.'",
        "'speaker_4': 'It appears that your the feasibility study is relying on an air that was done for the airport expansion. And they're saying that there were a lot more square feet left over so that there is room. For putting in this terminal.'",
        "'speaker_4': 'The reason that there's square footage left over is because the airport expansion was going to be much larger than it is now and fortunately. Long Beach Hush two was able to convince the council to reduce the size of the terminal.'",
        "'speaker_4': 'I. Would ask you to put an end to this right now and vote no. My name is carelessly and I'm from the fifth District. I'm here mainly because I'm concerned about the airport and the airport expansion. I've looked at the documentation that's out there on the feasibility study, and I have concerns about how that was put together'",
        "'speaker_4': '. Also in the document that I saw today, although I really appreciate that there's numbers in it and some assumption of. What could come of this in a positive way. It's a little touching to me that it's all good news.'",
        "'speaker_4': 'And I say that because I was a manager in aerospace at three different companies at Rockwell, Hughes Electronics and Boeing. And I can tell you that when you do a project study about something you want to bring in.'",
        "'speaker_4': 'First of all, you need to understand every number, what the assumptions were, where it came from. And you better be able to explain that to the people around you. I would ask my city council to take that kind of attention into looking at this.'",
        "'speaker_4': 'In my experience, what's normally missing is, is the omissions where you find the bogus part is what they didn't put in the numbers. The second thing that I really see missing here is the most important part of a feasibility study is the risk analysis.'",
        "'speaker_4': 'I can tell you that you wouldn't last at Boeing a week if you did a project like this without showing some risk and that they spend all their time, once that's been done, creating plans to mitigate that risk if they decide to go forward.'",
        "'speaker_4': 'So a plan where everything is positive and there's no risk to me is not believable. I mean, I think we wasted $350,000. It lacks credibility. And you should go back and ask them. First of all, we should have given them a model of what we wanted to come out of it.'",
        "'speaker_4': 'And there should be a section that says Risk. And that's the biggest thing. Moving on from there, in my own personal experience, I grew up around L.A.X. I played on the freeway at the 405 when they were building it.'",
        "'speaker_4': 'I saw LAX built up. There's four neighborhoods right around L.A.X. Three of the four suffered gravely from airport expansion. The one side that came out smelling like a rose was El Segundo. And that's because the airplanes don't go over El Segundo.'",
        "'speaker_4': 'They also did not let the the big hotels in. There's only two hotels, one on Sepulveda and one a little further away. So once you bring the hotels in, you're bring in the skin trade and that really devastates a neighborhood.'",
        "'speaker_4': 'I only had 3 minutes and I'll let it go at that.'",
        "'speaker_3': 'Good evening. I'm Tom Carney. I'm from the Bixby area and I actually set up here when you asked why with important noises important to me, I'm in the flight path. But just as important to me is the airport as a source of air pollution.'",
        "'speaker_3': 'One which is heavily burdened by air pollution. We have the Port 17 and we have the Alameda Corridor. We've made great strides in the last five years while volume has increased at the ports. The pollution levels have come down.'",
        "'speaker_3': 'If we implement new clean technologies, different processing techniques, we've reduced it when it comes to jet engines. There is no clean technology and jet engines produce particulate matter that is the most nasty of all. EPA measures a particulate matter by microns, ten microns pad 2.5 microns, very bad jet aircraft.'",
        "'speaker_3': 'Because more efficient burning. All the fuel produced. Particulate matter down to one micron level. That's important from a health perspective because that very easily gets into the lungs. It'll penetrate the blood air barrier. So he can run regulatory issues with circuitry issues, which is very dangerous for those in the underserved communities homeless.'",
        "'speaker_3': 'There was other though disadvantaged because they can't afford access to health care. Severe respiratory infection for some of us can become life threatening to them. Every international aircraft that flies out the airport is producing more air pollution, which is regressive to the all the great gains we've made the city all last several years.'",
        "'speaker_3': 'So to me, this is beyond the noise. Part of this is also a matter of the air pollution, and it's also a matter of environmental justice for the city and its citizens. Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Gary Mayor. Council members.'",
        "'speaker_14': 'Staff my name is jeremy harris, senior vice president with the Long Beach Area Chamber of Commerce, the upper chamber, our leadership, our many members and businesses. We strongly support the current process on this very critical issue to date and appreciate the study session tonight.'",
        "'speaker_14': 'We also appreciate the thoroughness that you've all taken along with airport staff allowing public to comment on this process. Again, going back to almost two years ago when it was first asked for.'",
        "'speaker_3': 'Furthermore, and by way of.'",
        "'speaker_14': 'Background, the Chamber has a long standing history of supporting the airport and protecting the noise ordinance, an issue that has been addressed several times tonight. We also highlight what has also been said by the FAA in 2015 and 2016 and affirms from the federal government that it will not negatively impact the noise ordinance if a custom facility'",
        "'speaker_14': 'is built. The chamber further supports the customs facility at the Lambert Airport due to multiple economic benefits for Long Beach and the region. And I like to just highlight a few of those that again was included in the study and has been talked about at length here tonight and shared by the airport director.'",
        "'speaker_14': 'Construction of the facility would create 200 to 250 jobs, could generate a financial one time output of roughly $35 million, sustained employment by the airport, air carriers, government and business of supporting operation of international flights and the Cousins facility would create approximately 350 jobs and about $36 million of annual output.'",
        "'speaker_14': 'The potential additional economic expenditures resulting from international travelers spending is estimated at $104 million directly to our tourism. And then also business and tourist travel impacts that are estimated to result in increased approximately 1400 jobs and about $186 million in annual output.'",
        "'speaker_14': 'This is why the Chamber has come forward to take a look at those numbers. The believes that it's a worthwhile reason to move forward and take a look at a coastal facility. These economic benefits are not only are just only part of the entire equation, but only speak to those here tonight.'",
        "'speaker_14': 'We encouraged by these benefits to our noncommercial aviation business businesses as well, to find the Long Beach Airport a convenient location and a destination to fly in and out of. Long Beach, as you know, has some of the most unrivaled businesses and talent and got Gulfstream, Mercedes, Virgin Galactic, just to name a few up in the airport'",
        "'speaker_14': 'corridor area. These companies and many others like them require convenient access and travel to conduct business internationally. Because of such companies, Long Beach is seen as a regional economic driver, but one can argue can be seen as an economic driver throughout the state, country and the world due to our international city moniker.'",
        "'speaker_14': 'Many thanks to our sea port.'",
        "'speaker_3': 'Of course.'",
        "'speaker_14': 'The Long Beach Airport needs to have its full potential realized as well. That allows that will be by allowing a custom facility and initial international flights so we can come true. International City, we look forward to communicating with your individual office over next few weeks outside of the holiday season, of course, in order to better understand the'",
        "'speaker_14': 'position and the need for a customs facility. Thank you so much for tonight.'",
        "'speaker_7': 'Thank you. But great. Next speaker, please.'",
        "'speaker_8': 'Hi guys. My mind is totally boggled. I had so many things. There's so many different ways you could go on this. Oh, I'm Lynda Scopo. I live in the fifth district, but I've also lived in Muncie, the first.'",
        "'speaker_8': 'I lived on the third, and I've lived in the fourth and directly under the flight path. So I know what I'm speaking in terms of what it's like to live in the flight path. Now, I was one of those moms that was nursing her kids back in the nineties when we only had 15 flights.'",
        "'speaker_8': 'And it wasn't because I was nursing my kids that I was up because the one flight it was, my kids woke up because of the flights that went over my house. So you got to consider and that's with due respect, it's not one flight a night.'",
        "'speaker_8': 'If you look at how many they just said that was one for every single day. Every single day. And it matters. Our homes, our lives, our values matter. How do you guys like living in Southern California? Do you guys all like living down here?'",
        "'speaker_8': 'How many of you want to end up having to move? Let's say, you know, because we can't afford to live here anymore. We got to move to Texas. We got to move somewhere else. We got to move with it.'",
        "'speaker_8': 'Let's face it, the weather's terrible. We don't have access to, you know, the delights of L.A., Southern California, San Francisco and our fabulous weather. We pay a premium to live here. And I am really tired of people saying we need to accept the flights.'",
        "'speaker_8': 'We need to accept the noise. That. Oh, no, it's not going to affect our property values, our quality of life. When it was 15 flights a day, it affected our quality of life. Every single one of my kids videos from their birthday parties, because guess what?'",
        "'speaker_8': 'So in California, we party outside every single one of their videos there. In travel times, we see everybody do people in my backyard stop and wait for the planes to go overhead. It's real. And and the lady that brought the sound of that flight tonight, it was coming from her phone.'",
        "'speaker_8': 'I can tell you it's a lot louder than it sounded on her phone. And I know some of you lived under it. I know some of you visit it. And I really appreciate how open you've been to a lot of what we had to say tonight.'",
        "'speaker_8': 'I actually feel like you're hearing us. We don't have much time. And there were a lot of things I wanted to say. But one thing that struck me tonight was when they were talking about the old study that they did, and I and it was an Cantrell that brought it up.'",
        "'speaker_8': 'And it really struck me, too. And I think people kind of missed it. Was that the study that they did when we were talking about airport expansion and it was up to at 100, 250,000 square feet that they were originally proposing.'",
        "'speaker_8': 'That created crowds like this short time ago. And a few of you were around to watch it. It was terrible. It was scary. And we felt like our city was against us. And at that time, a lot of people like Jet Blue as well.'",
        "'speaker_8': 'And I love flying JetBlue. I flew on a couple of weeks ago. They were fabulous. They're fabulous company, but they're not fabulous. The people live and are affected by their flights. They you know, they respect us. No, they don't.'",
        "'speaker_8': 'How many flights, you know, violations do we have? They don't respect us.'",
        "'speaker_7': 'Thank you very much. And before we have the next speaker, can we get the clerk to pick up the mic or someone?'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'I mean.'",
        "'speaker_7': 'Next picture, please.'",
        "'speaker_6': 'Thank you. Good evening. My name is Melinda Cotton. I live in the third district in Belmont Shore. And in all the time I've lived here, which is more than 30 years, we've constantly been told, don't touch the noise ordinance, don't fiddle with it, don't change things, because it's it's not the FAA that's going to be our problem'",
        "'speaker_6': '. It's going to be the lawsuits from other airlines. And so I do share that with you, that economic benefits sound very minimal. Mayor, your your discussion with the present cator basically it sounds like we're better off if we have local flights, if we have domestic flights that bring people in specifically to come to Long Beach, because most'",
        "'speaker_6': 'people, when they fly, especially international, are looking at a schedule and they're looking at price. I fly in and out of L.A.X. regularly, Orange County occasionally. I don't spend money at L.A.X. I don't spend money in the cities around there or in Orange County because I'm coming home to Long Beach and people who are going to be'",
        "'speaker_6': 'flying here from Central or Mexico or whatever are probably coming here specifically to a location, not just to spend money in Long Beach. And there is a great expenditure necessary for the FAA itself. But what I'd like to get to, and you might wonder why in this third district by Del Mar sure I'm here because where I'",
        "'speaker_6': 'live, south of Second Street, when they change the flights at the airport, that noise comes rumbling over the hills. And I certainly feel sympathy for people who live right under it. And also and thank you, Councilmember Your Anka, for mentioning the FAA.'",
        "'speaker_6': 'The next gen, the change of flights that they're doing. Well, Orange County Airport has a lawsuit against the FAA because they are changing the flight patterns and they are impacting neighborhoods that were not affected before. And over the last few weeks, I and my neighbors have were outside quite a bit because we enjoy being out.'",
        "'speaker_6': 'I work finding more flights over us. We can see them, we can hear them. They're pretty high up, but we don't know what's happening next. And I have not heard that law said that Long Beach is studying the flight patterns and how we're going to be infected.'",
        "'speaker_6': 'And Councilmember, I would hope that you would help us look into that because they are going to impact our area more. And we had a time a couple weeks ago where apparently there was fog. They had to go into a holding pattern with JetBlue for an hour.'",
        "'speaker_6': 'The planes were circling over our heads. They didn't go out to sea or to circle. They were over our heads. So I thank you for your time. I appreciate your listening and hope you'll really look into the changes that the flight patterns that the FAA is imposing.'",
        "'speaker_7': 'Thank you. Thank you very much. Next speaker, please. And then I think so. It looks like we have our last speaker. We're going to cut off the speaker's list. We have the lady at the end. Our actually the gentleman the gentleman at the end there in the red shirt or that they'll be our last speaker here.'",
        "'speaker_7': 'And please.'",
        "'speaker_1': 'Continue. Thank you. My name is Donna Sievers and I live in the third district. Like many residents here, I attended.'",
        "'speaker_8': 'All of the Jacobs study.'",
        "'speaker_1': 'Sessions, the Airport and Economic Advisory Commission meetings. And although I don't live directly under the flight path, I listened to the concerns of the residents who are most significantly impacted by aviation noise.'",
        "'speaker_8': 'And I learned that Jacobs.'",
        "'speaker_1': 'Study did not adequately address the many environmental concerns of the community. The decision regarding the FAA facility will impact our city, not just the three districts under the flight path. And I'm concerned that not only is the international terminal not necessary for our economic future, but that the entire process has been less than transparent and perhaps even'",
        "'speaker_1': 'tainted by undue influence by JetBlue. And I hope all of you will consider the comments you've heard this evening. Any restoring noise ordinance is a risk that I don't think any city council members should be willing to take.'",
        "'speaker_1': 'When I learned that JetBlue holds 85% of our allotted slots, that concern me as it should you common sense would suggest that other air carriers would most likely take legal action against our noise ordinance so that they too could benefit from the international flights reflected if there are increased.'",
        "'speaker_8': 'Profits to the.'",
        "'speaker_1': 'Corporations and to the stockholders. Additionally, I think it's vital to consider the comments by Mark.'",
        "'speaker_8': 'Berry, the Deputy Chief.'",
        "'speaker_1': 'Counsel for the Federal Aviation Administration, comments that were recently quoted in a press telegram article to quote Marc Berry reminded the city in a letter in October that a potential new carrier could challenge Long Beach's noise ordinance and with the FAA if it thought it was a barrier to entry, I think that's an important phrase barrier to'",
        "'speaker_1': 'entry, which would cause the city to make modifications to the ordinance to facilitate market entry or consider other. Of courses of action, unquote. Please do not ignore this significant legal insight from the deputy chief counsel of the FAA.'",
        "'speaker_1': 'Every decision made by the city council is a challenge, and you have many factors to bear in mind. Please bear in mind that only a few JetBlue employees have spoken in favor of the FAA facility in the meetings that I've attended.'",
        "'speaker_1': 'Additionally, you may want to consider it was also mentioned the rhetoric between President elect Trump and the Mexican government as another possible negative factor. You may want to consider that the Fresno Yosemite International Airport had to be financially supported by the city when the Mexican air carrier chose not to utilize the facility.'",
        "'speaker_1': 'You may want to consider that John Wayne, LAX and Ontario airports already support the international needs of our local community. But most importantly, I think you need to consider that we have a mutually beneficial relationship thus.'",
        "'speaker_8': 'Far with our airport.'",
        "'speaker_1': 'And to now risk this by allowing an FAA facility is unwise. And I hope you will vote unanimously to reject the FAA US facility. I've never quoted Nancy Reagan in my life, but I will now please just say no.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Thank you for the opportunity to address you. My comments are short. I'm in opposition to the proposed international terminal, which is being pushed by JetBlue for the Long Beach Airport. Please know that this goes beyond noise and is intrinsic to the quality of life of each and every resident of the city.'",
        "'speaker_8': 'According to the American Lung Association, State of the Air 2016 Report. The Long Beach metropolitan area continues to have the worst ozone pollution in the nation. The Long Beach metropolitan area has the worst ozone pollution in the nation.'",
        "'speaker_8': 'The air quality is so bad within a section of Long Beach, it is known as the diesel death zone. It is imperative that you give this matter grave consideration and know the consequences that additional flights in and out of Long Beach will have on the air we breathe.'",
        "'speaker_8': 'JetBlue may claim a wonderful economic stimulus to the economy, but if you look beyond the imminent smokescreen they will produce. The reality is that an international terminal will bring a deficit to the health of the half million people who live within the city.'",
        "'speaker_8': 'Not simply by the increased air traffic, but by the supporting vehicular traffic that not even 2 million blue bicycles can offset.'",
        "'speaker_4': 'I respectfully ask.'",
        "'speaker_8': 'That you regard the future of the city and that of its residents.'",
        "'speaker_4': 'Knowing that every action put into motion today will have a direct impact on our lives and the lives of those who will follow.'",
        "'speaker_8': 'Us for years to come. Let us not be known as the worst.'",
        "'speaker_4': 'But as the best.'",
        "'speaker_8': 'By laying the groundwork for a sustainable and exuberant future. Reject the proposed international terminal at the Long Beach Airport. Thank you.'",
        "'speaker_7': 'Thank you, sir. I think you've already had a chance to take two or 3 minutes, and I have to get to the people who haven't spoken.'",
        "'speaker_3': 'That's fine. But I wanted to address.'",
        "'speaker_10': 'Particularly.'",
        "'speaker_7': 'Sir, I have to follow the rules and I have to go with the rest of the speakers.'",
        "'speaker_3': 'Listen, I'm not Jet Blue, and I didn't have ten employees. Sir, that's my thing, sir.'",
        "'speaker_7': 'I can't, sir, I. I have to follow the rules set up for proper public comment on this week. I have to allow everyone that hasn't spoken before you, sir. So please let me continue with. Look at the environmental impacts.'",
        "'speaker_7': 'Thank you, sir. Next speaker.'",
        "'speaker_3': 'Larry, could you clear casually addresses a problem we haven't discussed before and it becoming increasingly problematic, particularly on airline flights that are long. The airlines used to have a policy that if you ended up sitting next to a unruly kid.'",
        "'speaker_3': 'And they had a vacant space in another seat. They allow you. They give you that seat. That's no longer the case. If it's your own kid, you've got to check that out.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Always witty. Ray Gavel. Eighth District. First of all, I'd like to say happy holidays to everybody. What was not supposed to impact people's holiday celebrations with their families instead has consumed hours of personal time for many of your residents.'",
        "'speaker_8': 'I'd like to first thank the 300 people that showed up tonight. There were over 4500 fliers that went out into the community and maybe hundreds more that were copied by their individuals at their homes. And there are many, many people that are concerned about this.'",
        "'speaker_8': 'Unfortunately, many of them had to leave. They came with their children. And this started an hour and a half late.'",
        "'speaker_4': 'So that was quite offensive.'",
        "'speaker_8': 'Just a couple of corrections on or points of order that I'd like to make. Mr. Romo said that in 24, 26 when I sat there and T.B. was the the people that did the study that recommended 102,850 square feet.'",
        "'speaker_8': 'And after two years of council deliberations and realizing that the terminal size and the number of gates determine the throughput, we were, we determined that 89,995 square feet was the total to be allowed. So there is not a balance of 37,000 square feet that still to reach the maximum of what was approved by the council.'",
        "'speaker_8': 'And Mr. Mays was talking about the fines and changing the fine structure. And our former city attorney, Mr. Shannon, said when we tried to change the fines are talked about, it said, no, you don't change the fines. You don't do anything to strengthen or weaken the ordinance because it could be considered invalidated and openness up to a'",
        "'speaker_8': 'challenge. So I would encourage you not to take that into consideration. And then, Mayor, you said that our number one source of revenue was tourism. But I believe unless it's changed drastically in just a few years, property taxes are our number.'",
        "'speaker_1': 'One source of revenue. Now.'",
        "'speaker_8': 'The other point is that we have 33% of the citizens of Long Beach, 150,000 people live in four, seven and eight. You've heard tonight from people that live in three and five that are now impacted by the airport and the activity that's going on there.'",
        "'speaker_8': 'So there's another 100,000 people, half the city will be impacted by this significantly if this moves through and our noise ordinance is challenged and they win. I did provide you each with a with an email on the economics, and I had two questions that were not accurately answered within the Jacobs report.'",
        "'speaker_8': 'What are the impacts and how does that economic value of your international flights compare to adding flights to D.C. or Chicago or New York or Salt Lake? And this is what they said. International operations are forecast to be incremental to domestic operations.'",
        "'speaker_8': 'Therefore, the economic benefit from international flights will also be incremental to the economic benefit from domestic flights. In fact. It's a wash. Thank you. And please, everybody that's out there listening, make sure that you mark your calendars for January 24th, I believe, which is scheduled for the council's final decision.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_7': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mr. Mayor, and members of the city council. I'm Bruce Holt, and I live in the eighth District. And just by way of information, I spent eight years on the airport advisory commission during the time where we evaluated whether or not we wanted to go with the new terminal.'",
        "'speaker_3': 'So I have some experience in understanding the tug and pull that is associated with different points of view. But at the end of the day, to me, it comes down to your your body deciding the relative benefits to the airport and the greater city against the risk that might be incurred by the airport impacted neighborhoods.'",
        "'speaker_3': 'And in creating the the current direction, I guess it was on July 7th, you asked for three things to take place in terms of studying this activity. Two of them were dealt with by the Jacobs engineering study, but the third one, I think, has been very inadequately dealt with.'",
        "'speaker_3': 'Let me give you a real brief comment in the minutes of the meeting from the city clerk. Item number three was the FISA motion, which was made by Council Member Austin and passed by your entire body, required a risk assessment of potential threats to the airport noise control ordinance and a plan to mitigate impacted neighborhoods and schools'",
        "'speaker_3': 'from environmental and health impacts. Should the airport noise control ordinance become invalidated? And I think that is the absolute bottom line issue. Most of us in the neighborhoods face is not that we can't deal with what the current ordinance permits or doesn't permit, but what happens if the ordinance is invalidated?'",
        "'speaker_3': 'That's the real risk area we have now. That part of the study was given to the city attorney's office to deal with and their response, I think, was pretty inadequate. Their report said that in response, in responded to your direction, that they offered no risk assessment of potential threats other than that, other than the threat is no'",
        "'speaker_3': 'different with or without an FAA. Yes. Well, that may be a true statement, but it doesn't deal at all with what those threats are. Those threats are not starting with an FAA as they have always been with us in terms of if the ordinance is invalidated.'",
        "'speaker_3': 'So I think for you to make a truthful and valid assessment of what the benefits and the risks are in this body, you're really going to have to understand what true risks there are to the impacted neighborhoods and how we might mitigate them if, in fact they are visited upon us.'",
        "'speaker_3': 'Now, I understand this can be considered very touchy information. We do not want to give or, you know, a wide exposure to to what our risks are. They could be exploited. But I do feel that at least your body in counsel with the city attorney should know that.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_7': 'Thank you, Bruce. Next speaker, please. Next speaker.'",
        "'speaker_3': 'Though it is for a small guy. My name is Ramon, like rum and coke.'",
        "'speaker_12': 'I am in the fifth district.'",
        "'speaker_3': 'I've had the luxury of.'",
        "'speaker_12': 'Speaking.'",
        "'speaker_3': 'With. A lot of people associated with airport. You know, the director and everything else. So.'",
        "'speaker_12': 'And Stacie and really, Christine is provide me a lot of information from her office.'",
        "'speaker_3': 'And I'm very appreciative of everyone.'",
        "'speaker_12': 'That has helped give me information of trying to get unbiased information out. And I have screwed up a few times and I've been called on it and I appreciate that, but I've done my best to correct it. I've had this just this morning.'",
        "'speaker_12': 'I spoke with Stacey and she gave me a lot of information.'",
        "'speaker_3': 'And I appreciate that she's done a lot of work to help enlighten me of the process. The Airport Advisory Commission members are appointed to their positions by the City Council. As stated in the municipal court in the Long Beach Municipal Code, 2.27.030.'",
        "'speaker_3': 'The AC.'",
        "'speaker_12': 'AC duties the Airport Advisory Commission is tasked with consulting.'",
        "'speaker_3': 'And advising the City Council on Airport.'",
        "'speaker_12': 'Development Issues since there is a conflict of interest being investigated by the c f P.C. between the AC, JetBlue and the city of Long Beach, then the city.'",
        "'speaker_4': 'Council.'",
        "'speaker_3': 'I'm asking the city council, then the city council agenda items regarding.'",
        "'speaker_12': 'The such matters should be delayed until the.'",
        "'speaker_3': 'C p.'",
        "'speaker_12': 'CFP complete their investigation.'",
        "'speaker_3': 'The Airport Advisory Commission has filed a draft of their annual report on the Long.'",
        "'speaker_12': 'Beach City.'",
        "'speaker_3': 'Website. It is, which in turn has now jeopardized it. The City Council of a Conflict of Interest. It is reasonable to.'",
        "'speaker_12': 'Assume that if the City Council and the staff proceed further with official.'",
        "'speaker_3': 'Business and dialog regarding the JetBlue before the the c f PPC investigation.'",
        "'speaker_12': 'Is complete, then they too may also.'",
        "'speaker_3': 'Be investigated for a conflict of interest. I also would like to say that that the. The other company. If if JetBlue is given the ability to do to to get the international airport slots, the other companies from the outside might be able to contest the the you know, saying, look, they're not getting.'",
        "'speaker_12': 'To be treated the same as.'",
        "'speaker_3': 'Or equally and they may be. Able to. Contest in. Go further with with you know what I'm saying? With the noise. I think you should.'",
        "'speaker_12': 'Be able to break the noise.'",
        "'speaker_3': 'Ordinance by trying to insist on them getting in.'",
        "'speaker_7': 'Thank you, sir. Time's all up. All right. Thank you so much. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mayor Council. My name is Angela Kimball, and I live on the very edge just outside.'",
        "'speaker_4': 'The fifth District.'",
        "'speaker_5': 'And in the county. I want to thank.'",
        "'speaker_4': 'You all for listening to all of us residents tonight. I know a resident. One of the things I wanted to talk about.'",
        "'speaker_5': 'Was NextGen, a neighborhood. One of my neighbors.'",
        "'speaker_4': 'Touched on a bit before me.'",
        "'speaker_5': 'But we're feeling.'",
        "'speaker_4': 'It. I bought my home outside the envelope of where these planes fly for a specific reason, and I sat in my car, drove.'",
        "'speaker_5': 'Around neighborhoods to figure out where to live so I could have parking and quiet.'",
        "'speaker_4': 'And now that NextGen is starting.'",
        "'speaker_5': 'To phase in, we're feeling the first phase and the.'",
        "'speaker_4': 'Metroplex situation.'",
        "'speaker_5': 'We're feeling it. The planes are.'",
        "'speaker_8': 'Allowed.'",
        "'speaker_4': 'There all night long from midnight, three or 4:00 in the morning. They're hovering about now where we never had noise before.'",
        "'speaker_8': 'And we're not against the airport.'",
        "'speaker_4': 'We realize things. There's growth. But you need to think about the residents.'",
        "'speaker_8': 'The residents who have invested in this communities all through Long Beach. And it's not just where I'm at. It's the entire city. It's Huntington Beach. It's SEAL Beach.'",
        "'speaker_4': 'It's all of these need all of these outlying areas that are being impacted. So, you know, you need to think beyond yourself and your own district.'",
        "'speaker_8': 'I beg you.'",
        "'speaker_4': 'Please, please, please, think about the districts that. Are all around. It's very impactful when.'",
        "'speaker_5': 'Neighbors post online now. Hey.'",
        "'speaker_4': 'What's all that noise? You know, what's with the planes? Oh, there. There's a jet fighter down.'",
        "'speaker_5': 'At the airport. That's now they're rerouting aircraft. That's what's going on.'",
        "'speaker_4': 'It's temporary. But this may not be if you go international.'",
        "'speaker_5': 'And JetBlue, they you.'",
        "'speaker_4': 'Know, they're great company. Flown them. They've sent me emails to support their FISA terminal. I've gotten like four or five of them.'",
        "'speaker_8': 'Hey, let the council know you want to fly International.'",
        "'speaker_4': 'Well, no Jet Blue. I don't want to fly.'",
        "'speaker_5': 'International and take me off your mailing list. Thank you.'",
        "'speaker_7': 'Your next speaker.'",
        "'speaker_8': 'Good evening. My name is Glen Dolce from the seventh District. And tonight we're here in city council chambers once again on the airport issue to hear your comments and questions on the FISA study. Many of us have read the study.'",
        "'speaker_8': 'We've read analysis of the study. We've asked questions and we've attended many meetings. Last week, you, the city council, passed a resolution to support the water protectors at Standing Rock. You heard many speakers. You each made your positive supporting comments and from behind the rail and supported the resolution.'",
        "'speaker_8': 'Tonight, I hope you'll hear us and receive results to support residents on protecting our valuable noise ordinance by deciding to turn down JetBlue's request to internationalize our municipal airport. Will you support the future of livable neighborhoods in Long Beach, or will you support corporate interests based out of New York City?'",
        "'speaker_8': 'This is my question. Which path will you choose?'",
        "'speaker_7': 'Thank you. Male speaker, please.'",
        "'speaker_8': 'Good evening. My name is Jean Young and I live in the eighth district. My address is on file. Thank you very much for holding this study session. You hear a public comment on the JetBlue proposed facility and its effect on our lives and in Long Beach.'",
        "'speaker_8': 'I have many questions. Starting with the release of the Jacobs study. In early October, the city attorney reported that if the noise ordinance was lost due to a successful challenge, navigation easement would be pursued, which means that the city would install sound installation replacement doors and windows in exchange for property owners giving up their legal rights to'",
        "'speaker_8': 'airspace over their homes. I was surprised and I kind of question that the city was so willing not to defend the ordinance, but to prepare now for going away. I also questioned why the Airport Advisory Commission, an advisory body, not a community roundtable for concerned residents or a representative of the city at large, was forced to act'",
        "'speaker_8': 'outside of its own charter to be a forum for public comment on the office. I also questioned why the Airport Advisory Commission produced a draft annual report which endorsed the customs station and encouraged its construction. And then at this past December six City Council meeting, a motion was approved to have the city manager move ahead and negotiate'",
        "'speaker_8': 'a financial agreement for the Customs facility development with JetBlue, as well as to move ahead and request that Governor Brown approve the facility creation. I noticed that that was stricken from today's meeting agenda, but many thought the entire FISA discussion was taken off or we would have had greater numbers here tonight.'",
        "'speaker_8': 'I also question that JetBlue used its frequent flier loyalty program to urge support for the customs facility. As we've heard, it's one of the worst violators with 610,000 in fines in 12 months. I also question that more than actually that JetBlue took out a paid advertisement saying it was partnering collaboratively with the city to get this facility'",
        "'speaker_8': 'built. Now, I would just ask you the question. I would ask you to vote no on this, but ask yourself these questions. Could this jeopardize our noise ordinance? I think we've heard that the answer could be yes. Construction of a customs facility could kill our current noise ordinance and flight cap.'",
        "'speaker_8': 'We have a 50 flight maximum dedicated to our noise ordinance, but they FISA opens the door to any competitor who desires flight slots over the current limit. Do we really need this? We have customs facilities at L.A.X. and John Wayne.'",
        "'speaker_8': 'And could a one carrier bond become dangerous and costly?'",
        "'speaker_7': 'Thank you, ma'am.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_7': 'Thank you so much. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Peter. Good doctora. I am a resident of the eighth District.'",
        "'speaker_8': 'And I want to thank you as well for.'",
        "'speaker_4': 'Listening to us tonight and staying here so late and I'm.'",
        "'speaker_8': 'Sure hungry like the rest of us.'",
        "'speaker_4': 'As I'm looking around, I see that the majority of you are paying attention and are really showing a sincere desire, in my opinion, to understand this and do the right thing. Others of you are multitasking, maybe, I hope.'",
        "'speaker_4': 'I do want to follow up on the economic benefit question. It's true, some new things surprised us today. Some in the in the presentation that was given by the airport director, it included some information that I was not prepared for I had never seen before.'",
        "'speaker_4': 'And I would like to get more information. I understand that Long Beach has a need for funds. We know we've cut the police department with the fire department. We have a great need for homeless services for the homeless.'",
        "'speaker_4': 'We want to build a rebuilt our great aquatic center. We know if you're going to ask us to take the risk and maybe suffer for the better of the greater good, I would like to have some concrete numbers and maybe if Mr. Romero sorry could tell me where in the study or were online, I could find the'",
        "'speaker_4': 'information that you cited that shows specific Long Beach benefits. We were at Ms.. Mungo's meeting, and she she voiced the same concerns and also had the concern that maybe it wasn't. The Bill for an economic impact study to crystallize out benefits for such a small geographic area.'",
        "'speaker_4': 'So I I'm very curious how you were able to do that. I appreciate maybe one of you will officially ask that question tonight and for for me. Thanks.'",
        "'speaker_7': 'Thank you. And our final speaker, sir.'",
        "'speaker_3': 'My name is Mark Hawkins. I live in the seventh District and I want to apologize. I was the one with the cat. Call the pizza and that was rude. I'm sorry that I made that that that remark, but I have been here with everybody else for almost five and a half hours, and we're hungry and we're thirsty'",
        "'speaker_3': '. And, you know, when I first heard about this study session, I laughed because it seemed like we've been down this road for decades and been down this very same thing. But you know what? I was wrong. This study session.'",
        "'speaker_3': 'Did nothing but reinforce what I've always thought all along. We talk about the noise bucket and all that, and just about everybody here knows about the noise bucket now. But after this evening, for those of you that are pro expansion of the airport or pro FISA, if you didn't learn this evening that there are some communities, neighborhoods'",
        "'speaker_3': ', 33%, I think I heard 33% live under those airplanes. And I have something in common with with with REI, other than the fact she used to be in my district and my councilperson, but we both used to work for United Airlines.'",
        "'speaker_3': 'We do not we know a thing or two about airlines, how they work. She flew. I was in operations for the gentleman who flies. I don't know what airline he flew for, but says that Los Altos or Bixby Knolls is like is like Huntington Harbor.'",
        "'speaker_3': 'Give me a break. Give me a break. And you're right. You were I believe there is a lady over here that was confused as to whether he lived in Huntington Beach or Long Beach. This is Long Beach, lived here for 34 years.'",
        "'speaker_3': 'And we have the same beefs as we had 34 years ago. But I appreciate I appreciate representation that represents not only their district, but all the people, all the people that have lived in this in this city. And we'll take up any more time.'",
        "'speaker_3': 'Let's eat and let's go drink.'",
        "'speaker_7': 'Thank you. Public comments now closed. So I will go ahead and go back now to the city council's with any additional comments or questions. I'm going to start with Councilman Austin and then we'll go through the list. And why don't we just for I know there was ask can we just start by if someone wants to answer'",
        "'speaker_7': 'the question about the the the lady that asked a question about the economic data, if we wanted to start with that and then I'll go to Mr. Austin, please.'",
        "'speaker_10': 'I believe the question that was asked is that local data why it wasn't in the study. And I think because originally as planned it was done to the regional level and it was only at the request of the chair of the Economic Development Commission asking if we could take a more granular look at the local level.'",
        "'speaker_10': 'So that's what occurred. So that's the answer. It was not you know, it's not in the study. It was not. Tonight's the first time that it was presented, but again, it was in response to two requests from the commission.'",
        "'speaker_7': 'Thank you, Councilman Alston.'",
        "'speaker_0': 'Thank you. And I, too, was one. First of all, thank all of the folks who endured the last 5 hours who sat through this. It shows a great passion from the community. And I think the council received how important this issue really is to you all.'",
        "'speaker_0': 'So thank you all for coming out this evening and sharing your thoughts on this very important issue. I, too, was kind of surprised by the the new information regarding the economic impact. And I will seek to challenge that methodology as much as possible in the weeks to come.'",
        "'speaker_0': 'Mr. Romo. I have I want to say at least 100 or so questions here. All right. And for for the and I don't I don't want to keep everybody here all night, but I do want to get answers to the questions.'",
        "'speaker_0': 'And so with would it be possible or I guess I would like to ask deaf if I submit these questions that that we can somehow answer these questions to the public in a in a public forum. Is that is that possible to do?'",
        "'speaker_3': 'We could answer the questions tonight orally, or you could submit that to us and we'll respond to them in writing and present them back to you in the city council.'",
        "'speaker_0': 'I'd like to. Well, I can ask a few of them, but I'd like to submit them in writing to you and ask that they be provided back on to the public. Because I can imagine over the next people want to get back to to haunt to their homes, they want to celebrate their holidays, but they also want'",
        "'speaker_0': 'to take time to to analyze the questions and answers.'",
        "'speaker_3': 'So you could just submit the questions to us right now, and we'll put them on a website as soon as we can with the answers.'",
        "'speaker_0': 'Duly noted. You know, and with that, that's all I'm going to say for tonight. This was a night for the residents to speak, and I think they spoke loud and clear. Thank you very much.'",
        "'speaker_7': 'To the council for your anger.'",
        "'speaker_11': 'But thank you, Mayor, and I appreciate it. I would love to see those questions as well and the responses, because there are many and there were a lot of questions that were raised here by the public. Again, thank a residents who came out to address their issues, to get their questions answered, and hopefully that some of those'",
        "'speaker_11': 'questions will be online. Eventually when when staff puts it out. My big takeaway on the conversations and the discussion that was held today was the the human aspects of the discussion here, the the effect that it would have on.'",
        "'speaker_11': 'People's quality of life. The the health risk assessments that that that need to be taking place. And maybe quick question regarding the the the health risk. Oh, I if I recall correctly, we did a AQ R&D study back.'",
        "'speaker_11': 'I want to say excuse me, back in the early 2000, maybe about ten, 15 years ago, where the the flight path were were.'",
        "'speaker_3': 'Reviewed.'",
        "'speaker_11': 'And how they went over West Long Beach. And what were the risk assessments for air quality in West Long Beach based on. Um. Exhaust that the planes would would release as they're flying over West Palm Beach and all the schools that were down that area.'",
        "'speaker_11': 'Am I correct on that? Was it was there a AQ, M.D. study that was done back then at that time?'",
        "'speaker_3': 'I can be wrong. We do called the mate study. So Akmed did a pretty significant air quality modeling. It made two and meets three, I believe maybe even meets four. Whether it specifically called out Airplane. We'd have to check on that.'",
        "'speaker_3': 'But there's certainly been air quality analysis done in the past by a committee.'",
        "'speaker_11': 'And I think that the discussion tonight, I think, says we need to bring that back. Perhaps we could ask the A.D. to do another updated assessment as to what the impacts this would have for for the airport in terms of international flights and planes that would be flying out further than what we normally have.'",
        "'speaker_11': 'Quick question on the planes themselves on page 15. Yes. 15. There's a. Modeling here in terms of the planes that are used a c RG 900. The A320 and the A320 one. Is are those planes currently in use at the at the airport?'",
        "'speaker_11': 'All three of those.'",
        "'speaker_10': 'The C RJ 900 is in use not by JetBlue. It's used by both Delta and American. And this, the A320 with that is the the aircraft of choice for JetBlue. They do fly the A321, but not into Long Beach.'",
        "'speaker_11': 'So at the present time with JetBlue, we're talking about them using the A320 at this time.'",
        "'speaker_10': 'That's correct.'",
        "'speaker_11': 'Okay. Has there been any study done in terms of what that plane does with its flights or neighborhoods and the possible exhaust or pollution that it might create over those neighborhoods?'",
        "'speaker_10': 'Not that I'm aware of.'",
        "'speaker_11': 'How long has it been in use?'",
        "'speaker_10': 'The A320. I believe it's been in use since the early I wasn't here in 2001 when they started service. They may have had the eight 319, which was an earlier version.'",
        "'speaker_11': 'I'm just trying to determine if it was used within that period of time where the match study was done back in 2000.'",
        "'speaker_3': 'We're so.'",
        "'speaker_10': 'Will check. I will tell you that it's it's it's been at least ten years and likely it's been for the duration of their operations because they've been flying the A3 19 and A320 since they launched. I just don't know what they flew at Long Beach when they started.'",
        "'speaker_11': 'Okay. Well, perhaps we need to look into that a little further, but I'm more interested in, again, in terms of what the quality of life issues are, the the human risk assessment that we need to evaluate a little better.'",
        "'speaker_11': 'And also, when we're looking at an FAA facility, what we need to do in terms of secure and NEPA making sure that those are up to date, I'm not confident that having done those at least within the last year or ten years ago, that we would need to update that only because we have a new facility coming'",
        "'speaker_11': 'in. And we would I would want to make sure that anything that goes on there in the airport, any additions, go to the airport address. Are there environmental issues? And again, I want to thank everybody who came tonight.'",
        "'speaker_11': 'Thank you for your comments. I learned a lot. Learned a lot. Thank you.'",
        "'speaker_7': 'Thank you, Councilmember Cipriano.'",
        "'speaker_2': 'Thank you very much. And. I'd also like to say once again, thank you to everyone.'",
        "'speaker_7': 'Okay. So we're going to do public comment after we. Okay, ma'am. Thank you. I got to have someone come out, come over there right now and gets you what you need, and we'll get you in front of the council.'",
        "'speaker_7': 'Right now, I'm gonna turn over to Councilmember Super now.'",
        "'speaker_2': 'Okay. Thank you again. I just wanted to acknowledge Rob Land and apologize. You know, the place was so crowded tonight, I did not see him in the audience, and I certainly would have acknowledged him before quoting him tonight.'",
        "'speaker_2': 'So, Mr. Land, great to see you tonight. We had a question come up regarding the fines, and I had quoted the huge numbers for consent decree numbers. And Mr. Mayes accurately pointed out that at the fines are a little different than that.'",
        "'speaker_2': 'So, Mr. Mays, if you want to correct me if I'm wrong, the consent decree is in lieu of a criminal prosecution for violating noise ordinance. Is that a fair statement?'",
        "'speaker_9': 'It's not exactly in lieu of it. It's part of a criminal prosecution. It's basically an agreement between the prosecutor and the party that's involved in this case. Airlines out at the airport as to what an appropriate fine would be.'",
        "'speaker_9': 'So it's part of the criminal justice process.'",
        "'speaker_2': 'Okay. Thank you. And Councilwoman Pierce had asked about those fines. So I just quickly I didn't want to get into the Orange County issue again. So I just quickly looked up San Diego. So Long Beach, your first infraction is a warning.'",
        "'speaker_2': 'Your second infraction is a warning. The third infraction is $100 and the fourth infraction is 300. Okay. So after four times it's 300 bucks in San Diego, your first infraction is $2,000. Your second is $6,000. Your third is $10,000.'",
        "'speaker_2': 'So let's just use San Diego for a comparison. We're probably not going to change that. But the question was asked, so I just wanted to put a reference to where we are with our fines. Also. Yeah, I apologize.'",
        "'speaker_2': 'Although I've been at the other presentations, this was different enough. I think Mr. Miller pointed that out. Rice feverishly taking notes because it was foreign to me. I didn't expect it to be foreign to me. So that's why it's a little jumbled up here tonight.'",
        "'speaker_2': 'I apologize. And then finally to Mr. Land's comments here at the podium tonight from JetBlue, he mentioned something that is really important, and it wasn't mentioned by anybody else tonight. And that is I sometimes hear people refer to JetBlue as having a Long Beach hub.'",
        "'speaker_2': 'And what he explained is JetBlue is not a hub operational model. And he said, if you recall his quote, it's an origin and destination model. That's a critical piece in terms of how they operate. That is when they fly into Long Beach.'",
        "'speaker_2': 'And there's a mechanical problem if you're Southwest at a hub like I think their hub used to be Sky Harbor in Phenix. Maybe it still is, I'm not sure. But you can roll out a spare plane, take its place.'",
        "'speaker_2': 'That isn't JetBlue's model. That plane has to be fixed before it can take off again. And people always ask me, Well, why were they flying out in the middle of the night? How many people were on that plane?'",
        "'speaker_2': 'Well, that's not the issue. That plane might have to be in San Francisco or some other destination to take off the next morning. And that's a very important flight. So that was a critical piece that he explained there tonight.'",
        "'speaker_2': 'And I just wanted to point out exactly what that means. That's what we deal with almost daily. Well, there are whether, as I mentioned before there, whether delays and mechanical delays, I'm sure that makes up well over 90% of the delays.'",
        "'speaker_2': 'And that's a piece with JetBlue. So, again, I just want to thank everyone for being here. And everyone did a great job tonight. Thank you.'",
        "'speaker_7': 'Thank you. Okay, that looks like it, concludes counsel, comments and questions for the evening. There is a emotion and a second to receive it file that was set before by Councilman Austin and Councilmember Ringa for the study session.'",
        "'speaker_7': 'So with the motion, please cast your votes to receive and file the study session and the report, please.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Okay. Thank you. We're going to just take a 1 to 2 minute recess and we'll actually start the the council meeting. The rest of the council meeting. Okay. Thank you. You all for coming out. Go back into session.'",
        "'speaker_7': 'If I can take a roll call, please.'",
        "'speaker_1': 'Councilwoman Lena Gonzalez, Councilmember Janine Peers. Councilwoman Susie Price. Councilmember Dara Spooner. Councilwoman Stacey Mongo. Councilman Dee Andrews. Councilmember Roberto Durango. Percent. Councilman Alston. Vice Mayor Rex Richardson and Mayor Robert Garcia.'",
        "'speaker_7': 'I'm here. Thank you. And we just need obviously everyone else either to sit for the rest of the meeting or to. We can just do the conversations outside. I want to just finish continuing the meeting with public comment, please.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, find that the area to be vacated is not needed for present or prospective public use; and, adopt resolution ordering the vacation of the alley adjacent to 4100 East Ocean Boulevard, east of Termino Avenue and south of Ocean Boulevard, also known as Belmont Avenue.  (District 3)": [
        "'speaker_5': 'to conflict of interest issues yourselves for supporting the signing of this until that investigation is complete. Thank you very much for your time and I appreciate you looking out for the concerns of your residents that that live here.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_7': 'Okay. We're moving on to the hearing. Hearing item number one, please.'",
        "'speaker_1': 'Hearing item one is a report from Public Works recommendations received supporting documentation into the record. Conclude the public hearing. Find that the area to be vacated is not needed for present or prospective public use. And a resolution ordering the vacation of the alley adjacent to 4100 is Ocean Boulevard, east of Terminal Avenue and south of Ocean Boulevard'",
        "'speaker_1': ', also known as Belmont Avenue District three.'",
        "'speaker_7': 'Staff report, please.'",
        "'speaker_3': 'Yes, the staff report was given by Shawn Crumby, our deputy director.'",
        "'speaker_14': 'Good evening, Honorable Mayor and City Council. Item one Hearing one moves for the vacation of the Allies south of Ocean Boulevard and east of Terminal Avenue. The recommended actions tonight are to conduct a public hearing. Make a finding that the alley is not needed for public use and adopt the resolution ordering the vacation, said Alley.'",
        "'speaker_14': 'A summary of the actions related to this item are as follows. General Plan Consistency finding was approved July 21st. Local coastal permit appeal was heard by the Planning Commission on November 17th, and a notice of intent to vacate of this alley was approved by the City Council on November 15th.'",
        "'speaker_14': 'One concern that has been raised or one discussion topic is in regards to that I'd like to highlight is that the property owner for 4100 ocean will continue to work with 4110 to 4120 to find an alternate suitable location for the trash pickup in the alley.'",
        "'speaker_14': 'And until that time or until such time, access will be granted to the end of the alley for for existing, for trash service. So with that, I'm available to answer any questions.'",
        "'speaker_7': 'Okay. Any public comment on the hearing? So, you know. Is this on the for the hearing? Yes. Please come forward.'",
        "'speaker_6': 'Good afternoon. Good evening again, Melinda Cotton in the third district. What has been presented to you is fairly. Not terribly complete. But let's begin. This alley is between Ocean and Olympic Plaza. It's 15 feet wide. It's 120 feet long.'",
        "'speaker_6': 'It provides coastal access for beachgoers. It provides public access. It provides emergency access. It provides trash access for the businesses around it. And during a period of time when Yankee Doodle was not well taken care of, it was pretty much abandoned.'",
        "'speaker_6': 'Yankee Doodle was abandoned. The lighting went out on the alley and apparently it turned into a place where homeless people gathered. That's no longer the case. Olympic fantasies coming in there. We certainly wish them well. But this is a port and access.'",
        "'speaker_6': 'This is a time of transition for this location. For one thing, the city is hoping to put the Belmont Beach and Aquatic Center, the new pool there. When they do that, they're going to close Olympic Plaza. Plaza Drive will be closed so that access will no longer be available.'",
        "'speaker_6': 'And the alley also there got a road diet coming. So they're going to be narrowing the streets down so that portion of the access to that area is also narrowing down. And so it really does not seem a good time to turn this over to the Olympics, fitness for their private use for exercise equipment or whatever, which'",
        "'speaker_6': 'is what was stated in the staff report. What I would recommend is that you're not to turn over this public access at this time until you're really sure that the city doesn't need it. And there's quite a distance between the other streets, the other access to the beach area.'",
        "'speaker_6': 'So I really recommend that you just hold on to it, allow it to be used and by the public, it allows to be used to help the adjacent people because there's going to be traffic problems if you don't and allow people to access the beach in this way.'",
        "'speaker_6': 'So those are the things that I think you should know. It's a shame to give away public property and public access without consideration of all the elements, and I don't believe that they've been as carefully looked at as they should be.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'Thank you. Any other public comment on this?'",
        "'speaker_4': 'Good evening. And Cantrell. And when you were. Were. Addressing this item back on November 15, I suggested that perhaps this was a procedural error because. The appeal that Melinda Cotton and others were bringing before the Planning Commission on this wasn't heard until November 17.'",
        "'speaker_4': 'And this appears to me to be a blatant done deal. The resolution was all written out on the 15th that this was going to be vacated. The Planning Commission as expected. Did up hold. The zoning administration's administrator's coastal permit.'",
        "'speaker_4': 'Today's staff report does not even mention that this is going to be gated. The alley is going to be shut off to the public at both ends. There's going to be a gate there. It not only stops public access, it interferes with views of the coastline.'",
        "'speaker_4': 'And this is in the coastal zone. It is becoming a private eye alley for. The gym to use for equipment that isn't in today's staff report, but it was in your November 15th. It's going to be an outdoor fitness activity and private passageway for business.'",
        "'speaker_4': 'We were arguing that this is access to the beach, if you will. Look at the. Sketch that's in your staff report. You. So on the back of this, you will see that this connects Ocean Boulevard to the beach area.'",
        "'speaker_4': 'And I know Mr. Snyder has said that he has spending $40,000 to pave this alley. It has been unpaved. And this is the reason that it isn't open for traffic. But if it's going to be paved now, then I think it should remain public access.'",
        "'speaker_4': 'The trash is going to be put out on the street, which takes trapped parking spaces.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_4': 'And I would ask you to please hang on to this.'",
        "'speaker_7': 'Thank you. Next week, please.'",
        "'speaker_5': 'Hi. Laurie Smith, third district resident. Okay, so. When I hear about beach access being closed off, it makes me think I think Councilman Durango would be familiar with this. I think this week with the California Coastal Commission, there was $5 million and that they had sent out to people who were closing off access to the beach.'",
        "'speaker_5': 'So that's not something that I would think that the city of Long Beach would be in, interested in considering that Naples residents and that area they have had to open. We've been talking to them about making more access around their homes that that that we have not since.'",
        "'speaker_5': 'Looked into. So basically, I'm not sure why the city would be giving up land. So the trash cans that are currently in that alley are now going to be on the street. And it's just not something that I would think that the the council members would be interested in doing, that you're closing off the beach that you'",
        "'speaker_5': 'want more people to be coming to. So it just seems like a bad business practice again, that you are giving up land to someone that is having a development done. So. Well, we'll just have to look into what this gentleman who he has been talking with so and who he's been doing business with.'",
        "'speaker_5': 'So I'm excited to look at that at the planning commission. All right. Thank you.'",
        "'speaker_7': 'Okay. And you and the other have a comment. Come forward.'",
        "'speaker_3': 'Very good, you third district. I have a great deal of respect for Ms.. Cotton and Melinda. And and of course, I went down and I really had not paid that much attention to it. I said I was here at the hearing and I went down and scope that out and.'",
        "'speaker_3': 'Came to the conclusion that it is in fact. In the interest of public safety. To eliminate that coast or that alleyway as coastal access, there's ample coastal access. But that inherently leaving that there inherently it invites an accident.'",
        "'speaker_3': 'If you walk down that you. From the build it from the. If you're walking along the beach and then walk there. You're walking right into all the traffic, zooming down Ocean Boulevard. And there's a median in the middle.'",
        "'speaker_3': 'So it it really is not a coastal access route. People are, most people will go to an attractive route. An easy route where they don't have to dodge traffic. What you're doing is inviting an accident. By encouraging people if that were to be open to go to cross that street.'",
        "'speaker_3': 'And I invite you if you are undecided now, I invite you to hold this over and go down and put your boots on the ground. On several different days. Busy days. And see for yourself. The danger that is presented by enticing people.'",
        "'speaker_3': 'Down into the roadway. So far, there's ample access to the beach on either side as well as views. Thank you.'",
        "'speaker_7': 'Okay. Thank you. We're going to go ahead and go comment. Please come forward.'",
        "'speaker_3': 'Hey. Good evening. My name's William with Olympic Fitness. Been on the project for a little bit over a year and a half, so I'm very familiar with the location. And I want to talk about a couple of things.'",
        "'speaker_3': 'You talk about having a pathway to the beach and there is no real. Uh. Media where you can cross the street. I've actually seen people that try to use the alley as a pathway to the beach. And what happens is they sprint across the the street, which people you're driving 35 to 40 miles an hour and they're'",
        "'speaker_3': 'jaywalking across the street, about 100 feet on each direction. There's there's crosswalks which you can safely get to the beach, which would be more safer for pedestrians to actually cross. A couple other things, too. Is this this alleyways?'",
        "'speaker_3': 'Obviously not well lit for the last year and a half, probably on every other day, even picking up alcohol bottles. Sin Drug saw some marijuana there a couple of weeks ago, too. And it's just really an alley used for drug trafficking and just people just hide out and drink booze, unfortunately.'",
        "'speaker_3': 'We've hired a security guard there and her last report is there is two people in the last two days have been urinating in the alley and that's been something that's been happening last year and a half as well.'",
        "'speaker_3': 'And I would you take in consideration that we have a daycare close by too as well, in addition to a pool which you got tons of great kids programs going on in there as well. The facility that will have we'll have a daycare there where kids can be dropped off and their parents can work out and enjoy'",
        "'speaker_3': 'work out why their kids are being tended to with some fitness activities as well in the daycare. And with this Allie continue on what we have going on with drug trafficking, alcohol, it's not the right place to have that kind of stuff going on with all the kids and families.'",
        "'speaker_3': 'So appreciate consideration on this. We try to bring some healthy energy to this area that needs it. Thank you.'",
        "'speaker_7': 'Thank you, Speaker.'",
        "'speaker_4': 'I'd probably say goodnight, but that sounds too formal, too final. Mayor and City Council Members Lucy Johnson I live in the fifth District. However, I am frequently down in the third district at the pool area and near Olympics.'",
        "'speaker_4': 'I've been going there since the pool was built in 1968, and I cannot tell you that I've ever seen anybody using that out. As one of the other speakers mentioned, it's not paved. It's never been paved, to my knowledge.'",
        "'speaker_4': 'People really in their right mind wouldn't walk through there.'",
        "'speaker_3': 'And it will be much improved.'",
        "'speaker_4': 'If it's vacated. And Mr. Snyder and the other property owners and.'",
        "'speaker_9': 'It's basically it's not.'",
        "'speaker_4': 'Theoretically owned by the city, it's an easement to the city.'",
        "'speaker_3': 'And the property will revert to the.'",
        "'speaker_4': 'Both owners, the daycare center and the Olympics fitness center. It's not just people walking from Belmont Avenue and trying to cross the Ocean Boulevard, but it's not it's not useful for vehicle traffic. It's not useful for pedestrians. And there is plenty of access.'",
        "'speaker_9': 'Around either side. It's not blocking access like in Malibu, where the homeowners are adjacent to each other and completely fence.'",
        "'speaker_3': 'Off any access. So it's not.'",
        "'speaker_4': 'Going to be that kind of a detriment to public.'",
        "'speaker_0': 'Access.'",
        "'speaker_4': 'Also, one of the other speakers mentioned.'",
        "'speaker_3': 'Olympic Plaza will be closed to vehicle.'",
        "'speaker_4': 'To be closed and it will not be.'",
        "'speaker_9': 'Reduced to public access because it will be closed when the pool is built to vehicular traffic but still available for use by emergency.'",
        "'speaker_4': 'Vehicles. And so the public access along that, it'll.'",
        "'speaker_3': 'Be mostly, as I understand it, a walkway through there too. So it does not reduce any public access. So I encourage you to approve the vacation and let's move on with it and clean up that area. Thank you.'",
        "'speaker_7': 'Thank you. Final public speaker.'",
        "'speaker_3': 'Good evening. I'm Kurt Schneider, a developer of the property that's adjacent to the alley. Lucy was correct in stating that there's no giving of real estate here. As I stated last time before you, city council, the property owners that surround it own the land.'",
        "'speaker_3': 'The simple land is owned by the adjoining property owners. It's strictly an easement and the city is relinquishing that easement. So I'm just reiterating that point. So there is no giving. I'm not getting a gift. What we're looking forward to is making it a much cleaner spot in our community.'",
        "'speaker_3': 'Currently, when we started, when I bought this property three years ago, it was the armpit of Belmont Shore. I think you'll find it'll be a fantastic property when we're done. It already is remarkably better. I want to clarify just one point regarding Chuck's trash.'",
        "'speaker_3': 'We're happy to work with him as a good neighbor. We'll help him find an alternative suitable location for his trash over time. We're going to work with him. And until that time, we'll have a spot at the end of the alley for his trash can.'",
        "'speaker_3': 'Again, we try to be a good neighbor. I think the best way we can be a good neighbor is to improve this neighborhood and to make it so that you get more people coming down to the beach. The access to the beach on terminal as well as Bennett is much easier.'",
        "'speaker_3': 'And again, thank you so much. You've been here for 5 hours. I hope you all are able to go home soon. I'm going. Thank you.'",
        "'speaker_7': 'Thank you. Case. I want to go back to the council. Councilman Price.'",
        "'speaker_8': 'Thank you. So I want to just ask a few questions in regards to some of the comments that were made. Sean, you've been kind of the lead on this project since it came out, was presented to the city.'",
        "'speaker_8': 'Do you believe that there's any information outstanding that you would need to help you assess this request and determine whether or not this is an alley, that the city where the easement is is continuing to be needed?'",
        "'speaker_14': 'So when an alley is vacated, the finding that the city council makes is that it's not needed for public benefit or public use. And so through that process, all those types of public uses are investigated to see if those uses are still necessary.'",
        "'speaker_14': 'And in this case, they were not found to be needed for traffic, circulation, coastal access. Some of the items brought up tonight were emergency access. And for those concerns, our emergency service departments of the city are consulted with a vacation for coastal access.'",
        "'speaker_14': 'In this case, it did include the zoning administrator for the coastal development permit. But we also do site visits and investigations to make sure that coastal access or access in general is not necessary or public benefit for this alley.'",
        "'speaker_14': 'And the investigation, the staff was that public benefit is not needed for this alley.'",
        "'speaker_8': 'So staff conducted an investigation. Yes. In regards to this. And that's consistent with what we do any time such a request is made.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_8': 'We did have a community meeting and I don't believe Miss Cotton or Ms.. Smith and or nor Ms.. Cantrell or anyone from the gym were there. It was on homelessness, and we received a lot of feedback regarding this particular area, not just at the alley, but near the pier, the businesses near the pier regarding homeless activity and'",
        "'speaker_8': 'syringes and things being found in this alley in particular, is this an alley that the city currently patrols or maintains in any way to ensure that there's no homeless activity taking place there?'",
        "'speaker_7': 'I would say.'",
        "'speaker_14': 'That the city responds to two calls and as they come in for service and has done so in this alley, I don't know that there's any routine, necessary patrols or anything that particularly targets this area.'",
        "'speaker_8': 'During your investigation, did you determine whether or not the surrounding business owners were okay with this alley vacation?'",
        "'speaker_14': 'So as part of the process for a vacation. Outreach is done to all of the surrounding property owners and any potential issues that arise as part of the vacation. It is encouraged that are worked out between the surrounding properties and that was done so in this case.'",
        "'speaker_8': 'Miss Cotton mentioned the road diet. I'm very familiar with that project, but I am unclear how that relates at all to the alley. Does it relate to the alley?'",
        "'speaker_14': 'So the road diet would be a change in the configuration of Ocean Avenue, but that does not alter access, particularly this. This alley has two streets that border it. Those are Termino and BURNETT. And so access to the coast is not impacted by the road diet.'",
        "'speaker_8': 'Thank you. I have nothing further.'",
        "'speaker_7': 'Councilman Gonzales. Anything? No. Councilman Supernanny.'",
        "'speaker_2': 'Yeah. I'd like to thank Mr. Goodhue for the invitation. As much as we'd enjoy going down and visiting the site with him. I just looked it up on Google Maps and Mr. Crumby, it looks like the the alley parallels terminal.'",
        "'speaker_2': 'And it's like within a couple of hundred feet, correct?'",
        "'speaker_14': 'That's correct. I would estimate it's probably 150 feet.'",
        "'speaker_2': 'Okay. So beach access is 150 feet away at Termino. And then it was also mentioned about Bennett. The other advantage there is both Termino and Bennett have crosswalks across ocean where the alley does not. Is that correct?'",
        "'speaker_3': 'Okay. That's correct.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Okay. There's a motion and a second. Members, please go ahead and cast your votes.'"
    ],
    "Recommendation to approve the Citys Assessment of Fair Housing  or the period of October 1, 2017 through September 30, 2022, in accordance with the U.S. Department of Housing and Urban Developments Final Rule, and authorize City Manager, or designee, to take actions to further the goals identified in the Assessment of Fair Housing.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Okay. Next item. And I just I think I also want to make a comment about consent to having someone who spoke to an earlier consent was done at the beginning of the agenda. And so I just want to make sure that we're clear the consent calendar.'",
        "'speaker_5': 'Not have a chance.'",
        "'speaker_7': 'Actually, actually. Let me. Let me be sad, actually. I don't believe that's correct. Mr. City Attorney, what happened was. Is asked for consent calendar. I no one pulled any items except for item number seven. We pulled item seven and we did public comment for every any item besides item number seven.'",
        "'speaker_7': 'I don't think there was any public comment or maybe there was one. And then we did put out a number seven. I think that's I believe that's exactly what we did.'",
        "'speaker_3': 'That's correct. Now. Okay.'",
        "'speaker_7': 'Ma'am, I think that that's exactly how we did. We can go back and look at look at the it's all recorded. We asked for public comment during the consent and we'll even take a look at it right now just to make sure we'll go on to the next item.'",
        "'speaker_7': 'Okay.'",
        "'speaker_1': 'Item 22 is a report from Development Services. Recommendations to approve the city's assessment of fair housing for the period of Tober first 2017 through September 30th, 2022. City.'",
        "'speaker_7': 'Is there any public comment on this item? CNN. Please cast your votes.'",
        "'speaker_1': 'Councilwoman Gonzalez.'"
    ],
    "Recommendation to adopt resolution declaring results of the Special Municipal Election held on Tuesday, November 8, 2016.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Okay. What's next? Before we do the next item, what is the next item coming up?'",
        "'speaker_1': '27.'",
        "'speaker_7': 'Okay. Before we do 27, we're going to go. And I was just chatting here with the city attorney. So there is there is going to be a motion to and I think this will I think the same item that Ms..'",
        "'speaker_7': 'Smith wants to speak on anyway. So what we're going to do is we're going to take a motion from one of the council members that wants to do a motion to reconsider an item which we'd have to vote on first.'",
        "'speaker_7': 'And then here the item, which I am guessing is the same item of interest here. So I just wanted to make that announcement. So we're going to get to this last couple items and we're going to get to that motion.'",
        "'speaker_7': 'Okay. All right. So please read the item.'",
        "'speaker_1': 'Item 27 is a report from City Clerk recommendation to adopt a resolution declaring results of the special municipal election held on Tuesday, November eight, 2016.'",
        "'speaker_7': 'There's a motion and a second. Any public comment? Nope. Please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Okay. Councilman Austin wanted to make a motion.'",
        "'speaker_0': 'Well, yes, Mr. Mayor, in light of the news that we received today and the fact that there was an investigation going on with the particular item on item 13, I'd like to motion to reconsider our vote. There was a lot of confusion going on this this this afternoon when the council convened.'",
        "'speaker_0': 'And I didn't you know, the concert calendar was pretty, pretty robust. That one got by me. And so I like the motion to reconsider.'",
        "'speaker_7': 'Okay. There's a motion and a second to reconsider. Repeat the item. Item number again.'",
        "'speaker_0': 'Item number.'",
        "'speaker_7': '13. Item number 13, which will then get pulled off consent. So the first is going to be a motion to reconsider any public comment on the motion to reconsider. Seeing nonmembers. Please go and cast your votes. Please come forward.'",
        "'speaker_7': 'This is. And this is just to reconsider, not the actual item. Please cast your votes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a Sublease to Lease No. 9351 between Million Air North, Inc., a California corporation, and the City of Long Beach for office space at 4401 Donald Douglas Drive, to house the Engineering, Accounting and Security Divisions of the Airport Department; and  Increase appropriations in the Airport Fund (EF 320) in the Airport Department (AP) by $303,036.  (District 5)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Okay. So now we're back at the items. Item 13.'",
        "'speaker_1': 'Item 13 is a report from Long Beach Airport recommendation to authorize city manager to execute all documents necessary for sublease between Millennium North. And the city of Long Beach for office space at 4400. Donna's Donna Douglas drive to house the Engineering, Accounting and Security divisions of the airport department and District five.'",
        "'speaker_7': 'IT Councilman Austin.'",
        "'speaker_0': 'Yes. And I would love to get a staff report on this this item. I have a few questions as well.'",
        "'speaker_3': 'Assistant City Manager Tom Morgan. So I will do my best to give an overview of this item. Essentially, we have been looking for some space at in the airport's area regarding some of our staffing needs. We currently have staff in the third and fourth floors of the terminal.'",
        "'speaker_3': 'It is a historic terminal and there are issues. There's only stairs. There's no elevator access. And so we've been looking for some appropriate accommodations for our city staff. The item before you outlines a lease or that we've identified a building and gives you a sense of, you know, what that amount is.'",
        "'speaker_3': 'It's about $302,000 for the lease and the annual base rent costs will be $152,000 and will increase annually by 3%. We can certainly try to.'",
        "'speaker_14': 'Answer as many questions tonight or we can bring back additional information later.'",
        "'speaker_0': 'So is this a time sensitive matter?'",
        "'speaker_3': 'We do want to be able to move staff at some point, but if we need to take another week to answer questions, we can certainly do that.'",
        "'speaker_0': 'I move to continue this for another 30 days, to gain some more clarity and allow for new information to to come up and help and instruct our staff to look at potential alternatives.'",
        "'speaker_7': 'Okay. The motion on the floor is to take another look at this, to bring this back in 30 days, in addition to look at other alternatives. There's a motion, I believe Catherine Herring is at the second on that.'",
        "'speaker_7': 'Okay, Catherine, your anger.'",
        "'speaker_11': 'Yeah. In light of the new information that we just received today and factually that we did have a busy agenda at the beginning, it sort of got by everybody. I totally supported the motion.'",
        "'speaker_7': 'Councilwoman Mongo.'",
        "'speaker_5': 'I to support the motion. I guess my question.'",
        "'speaker_4': 'To city staff would be what their opinion is on the potential conflict of interest. As I read some documentation from the city attorney that they believe there wasn't one.'",
        "'speaker_3': 'Mayor members of the council. Yes, we have been advised of the potential issue. We have looked at this under government code 1090. We have discussed it with the SPC on other issues, not this particular contract, but we had a Planning Commissioner in a similar situation.'",
        "'speaker_3': 'I received an opinion from the NPC which found that there was no conflict because the Planning Commission did not and was not involved in either recommending approval of the contract or in the making of the contract. And that same situation is true here.'",
        "'speaker_3': 'The Airport Advisory Commission, this lease is not presented to, nor do they recommend, nor do they refer or have any input into the contract. The contract is approved by the Council as a body, not the Airport Advisory Commission.'",
        "'speaker_3': 'So in his capacity or as a seat on the airport advisory commission does not create a legal conflict, in our opinion, under 1090.'",
        "'speaker_5': 'So I guess my my thought would be that this is a member of our community who we believe to be an upstanding citizen, so much so that this council chose to put them in a position to represent us and to.'",
        "'speaker_8': 'Volunteer their time. As mentioned at several community meetings.'",
        "'speaker_4': 'Recently, we're always looking for people to stand up and volunteer to participate. I mean, there is quite a bit of data that they need to provide and put forward, including form seven hundreds and go through trainings and the such.'",
        "'speaker_4': 'And so I just want to make sure that we do our diligence and we.'",
        "'speaker_8': 'Look into this and that. We don't punish someone or put them in a less favorable position for volunteering and for it to be looked at and other considerations to be taken.'",
        "'speaker_4': 'But perhaps bring it back.'",
        "'speaker_8': 'Whenever city staff feel confident that. The situation is significantly similar or completely similar to all other situations, and that we.'",
        "'speaker_4': 'Are clear that there's no potential risks. I see you have a.'",
        "'speaker_3': 'Mayor and members of the council. If this motion, the substitute motion to continue this item for 30 days is passed, we would have an opportunity to reach out to the NPC and talk to them.'",
        "'speaker_4': 'That would be great. But if it came back sooner, Mr. Councilmember, would you be comfortable if everybody responded more quickly or even later that we wait until that comes back?'",
        "'speaker_0': 'Yes. The reason I pull the item and ask for a continuance was just to make sure just to make sure it better safe than sorry.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_0': 'And you know, there's been an allegation and only an allegation that's been looked into.'",
        "'speaker_7': 'And so it sounds like Mr.. Mr. Parkin wants the consultation with the LPC is kind of complete. You'll bring that back to the council in some form.'",
        "'speaker_3': 'We will certainly do so. Okay, great.'",
        "'speaker_7': 'I see no other council comments. Any public comment on the item?'",
        "'speaker_5': 'Laurie Smith, third district. I guess I'm just curious why the city managers did not. It doesn't sound like the staff report had any other places that they looked at to be leasing from. So that is a curious, curious thing.'",
        "'speaker_5': 'Also, I met with the city attorney Mays when I did my. A administrative review of the last airport director for 4 hours in a facility that housed airport staff. So I'm just curious why that would not be something else they'd look into.'",
        "'speaker_5': 'This lease would be for upwards of $800,000. And the conflict of interest is not just about the vice chair of the airport commission and the city. It is also that he's part as a board member on a lobbying group with JetBlue.'",
        "'speaker_5': 'He's also filed an annual report in which he has worked with the commission to recommend the FISA facility to you, and that has been filed on your website. So since we had a JetBlue issue on tonight's agenda, as well as his lease for $800,000 over five years, it seems very, very interesting.'",
        "'speaker_5': 'A conundrum. So this would just be something else that, you know, the California Fair Political Practices Commission, as well as the L.A. County DA's Office of Public Integrity will be alerted to. I'm happy that you are postponing it.'",
        "'speaker_5': 'I wanted to make you aware that the L.A. County D.A. does not talk about current investigations until the investigation is through. So I would really like to have the this motion held over until we until possibly the city attorney or we could check with the L.A. County D.A., Alan Johnson, to be sure that there is no investigation'",
        "'speaker_5': 'going on. It apparently it is a confidential thing. I understand that once they've been alerted to something, that they're not allowed to talk about it until it's done. So that would be something that I would recommend that they hold off until they are absolutely clear that the L.A. County D.A..'",
        "'speaker_5': 'Public Integrity Division looks into this. So I appreciate you allowing me to speak about this. And I. I hope that you continue to use good judgment. Thank you.'",
        "'speaker_7': 'See no other public comment on the item? There's a motion and a second. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ]
}