{
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and approve the hearing officers recommendation to uphold the denial of the business license application MJ21701203 submitted by Seaside Medical Group, Inc., for a medical marijuana business located at 1529 West Pacific Coast Highway.  (District 1)": [
        "'speaker_0': 'Thank you. Take care. Okay. So that was our one presentation for the night. We have two hearings and then we're going to go into the VIP records item. So the first hearing, Madam Clerk, please please read the first hearing.'",
        "'speaker_1': 'Hearing. Item number one is a report from financial management. Recommendation to receive supporting documentation into the record. Conclude the hearing and approve the hearing. Officer's recommendation to uphold the denial of the business license application submitted by the CCI Medical Group Inc for Medical Marijuana Business located at 1529 West Pacific Coast Highway District one, and this item required'",
        "'speaker_0': '. So why don't we do an oath and then we'll go right into Mr. Moto? Because. Report.'",
        "'speaker_1': 'You and each of you do solemnly state that the testimony may give in that cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_2': 'So help you God.'",
        "'speaker_0': 'Do. Thank you, Mr. Mayor. The staff report for this item will be given.'",
        "'speaker_5': 'By Sandie Singh Palmer, our purchasing and business services manager.'",
        "'speaker_2': 'Good evening, Honorable Mayor and members of the City Council. Tonight you have before you a recommendation to uphold the hearing officer's recommendation to deny the business license application. MJ 21701203 Submitted by Seaside Medical Group, Inc. for a medical marijuana business located at 1529 West Pacific Coast Highway in Council District one.'",
        "'speaker_2': 'In addition to the counsel letter, you have been provided the hearing officer's recommendation and findings and the appeal hearing packet. To provide some background on this item. On February 21st, Seaside Medical Group Inc. submitted an application to operate a medical marijuana dispensary at 1529 West Pacific Coast Highway on August 16th, 2017.'",
        "'speaker_2': 'The Department of Financial Management denied the business license application.'",
        "'speaker_3': 'Due to the proposed business location being within 1000 feet of a public or private.'",
        "'speaker_2': 'School, which is in violation of Long Beach Municipal Code Section 5.90.030. On August 21st, 2017, Seaside Medical Group, Inc. filed an appeal of the business license application denial. And on October 10th, 2017, the City Council referred the appeal hearing to a hearing officer.'",
        "'speaker_2': 'On November 7th, 2017, the appeal hearing was held and the presiding hearing officer assigned by the city clerk's office was Jennifer L. King on November 9th, 2017. The hearing officer recommended that the denial of the business license application submitted by Seaside Medical Group, Inc. be upheld due to the proposed business location being within 1000 feet of a'",
        "'speaker_2': 'public or private school, which is in violation of Long Beach Municipal Code Section 5.90.030. It is requested that the City Council accept the hearing officer's recommendation to deny the business license application. That concludes my report, and staff are available to answer any questions Council may have.'",
        "'speaker_0': 'Thank you very much. There is a motion in the second before I do that. Is there any public comment on this item? This is just the hearing.'",
        "'speaker_3': 'Thank you. Surely, Rosada, I don't understand the full reason for this denial. But. But whatever needs to be done to deny this and others, I believe it would be in the city's best interests. There is no medical marijuana.'",
        "'speaker_3': 'It's all marijuana. When a child smells it walking past someone's house in the alley or lately sitting on the street. Guy was rolling his joint in Belmont Shore, just sitting out there on Second Street, just in full view of everyone unafraid.'",
        "'speaker_3': 'Children are not going to know.'",
        "'speaker_0': 'Oh, that was.'",
        "'speaker_3': 'Medical marijuana, Johnny. No, no, no. They're just gonna say that was we. And there used to be. There used to be a time when we would say, you know, something is going to pot. Now our sister cities literally going to pot.'",
        "'speaker_3': 'With our approval, we are proving our city to go to pot. It's a gateway drug. I was just in conference with another young lady. Who works here in the shore. She affirmed. Yes, it was it was a gateway for me.'",
        "'speaker_3': 'It doesn't matter. The stamp of approval we put on it. It does not me. God's test for approval for things that should be. Around his humans. Maybe it doesn't. It doesn't meet his approval. Still yet and still. There is no medical.'",
        "'speaker_3': 'It didn't grow up out of the ground. You don't buy seeds. It's a medical. It just says marijuana or cannabis. As many of you that can find a reason to deny this and others, it would be in the best interest of yourselves and your family for years and generations to come.'",
        "'speaker_3': 'As you put your stamp of approval on anything representing the city in heaven, it registers as, Oh, this is so-and-so. They approve that. So we can let that walk in their family. If you're a child, 16, 18 years old, 21 year old, whatever the legal requirement is, if they walk in your door with a joy, Hey, Mom'",
        "'speaker_3': ', I kid, you gave me this. You want one? What will be your reaction? Oh. He gave you a medical marijuana, Susie? No, that won't be your reaction. You're going to frown and you know it. Come on. We're sending our city to pot.'",
        "'speaker_3': 'Somebody needs to get a C, D of New Jack City and make sure all the council people get it for Christmas.'",
        "'speaker_0': 'Thank you. Next speaker, please. Speaker, please. Is there any other public comment on this hearing before I close it? Mr. Goodhew, please come down. Is there? I'm going to close the speakers list.'",
        "'speaker_6': 'They promote.'",
        "'speaker_0': 'They will. They will. It'll be fine. We're going to. So I. The next three speakers and then the speakers list is closed officially. Thank you, Mr. B.'",
        "'speaker_6': 'Giving honor to Jesus who made marijuana not medical is good. Marijuana is good. I don't know what she's talking about. I got got I have glaucoma. And the first thing the doctor told me is that the team along the tunnel process have six or seven side effects.'",
        "'speaker_6': 'Doctor told me when I went to specialist smoke marijuana. It has no side effects. It takes the pressure off your eyes. Right now, I have to drive way down to L.A. to get my marijuana, and I'm smoking as much as possible because I didn't used to wear glasses, but I'm wearing them now.'",
        "'speaker_6': 'I lost a lot of my sight and I don't know what that mumbo jumbo she's talking about, because if it wasn't for marijuana, I'd be in trouble. So and Nixon was given medical marijuana since 73. You know, the rich were getting it back then and other people were getting slammed, sent, sent to prison for it.'",
        "'speaker_6': 'I had a cousin that did what? Got 40 years for it in Texas, had about a little more now. So, you know, I don't know about that. So I wish you would have some marijuana so I can get it down the street, you know, so I would have to go way out there.'",
        "'speaker_6': 'It ain't like, come on, I was marijuana. Marijuana. I no problem. Remember back in the eighties when cocaine was outlawed? That was a problem. Heroin and meth is a problem. Matter of fact, you guys are. Be glad marijuana is out here.'",
        "'speaker_6': 'That's comin. Everybody down. It'd be a problem if it wasn't a weed out there. The marijuana is good. And I don't know. It's still my God's letting people in heaven who.'",
        "'speaker_0': 'Smoke marijuana acolyte who believe in his.'",
        "'speaker_6': 'Name. You got to believe in Jesus name. You go to heaven so you know you're not smoke marijuana. You left out. So you know, hey, let me get me. I got 123. So, you know, marijuana is good. You know, land marijuana is good.'",
        "'speaker_6': 'Let's get that marijuana in Long Beach to help the people that need it and have them body aches and stuff. Thank you.'",
        "'speaker_0': 'Thank you. And just and just to clear also just the record out before the last week or so, the voters have approved on the medicinal side locally is obviously at the state on the state side. Recreational in Long Beach I believe has Mr. West already probably two dispensaries, I believe, that have already opened with business licenses.'",
        "'speaker_0': 'And I know there's a few more that are being processed silver and that are on the way. And so there are those there are dispensaries that are have opened and will continue to open as part of the the the voter approved laws.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Next Speaker Okay. I wasn't even intending to speak, but I'm I'm sorry. My name is Cammy Johnson from Cameco. Thank you for allowing me to speak. I'm actually going to speak on the business side of this is the question of having businesses that are not allowed within thousand feet of a school.'",
        "'speaker_3': 'And I don't understand why that's an argument, because there's so many other businesses, whether it's a 7-Eleven that wants to sell alcohol near school or if there's another company that wants to sell marijuana near a school. This is really about just regulating where the businesses are.'",
        "'speaker_3': 'The city of Long Beach has already voted this in. I'm not I'm not an advocate on one way or another. I've seen the medical benefits of medical marijuana and recreational marijuana for those who need to become or whatever it is.'",
        "'speaker_3': 'I'm not a user or protect myself. But what I will say is that I don't want it near a school and that's what the law is. So I don't know whether there's a question here or what needs to be said or some to interject on God or anything else.'",
        "'speaker_3': 'The people of the city have voted and there are laws in the city. This is a common question that anyone can ask. You can ask anybody if they use marijuana, that's what they do. There's a doctor involved or whoever is involved that is has nothing to do with this going on right now with this agenda item.'",
        "'speaker_3': 'This agenda item is only because is within the thousands thousand feet of a school. That's it. So what you may. But if you do vote to allow this to happen, what makes a difference if alcohol or other drugs or whatever is.'",
        "'speaker_0': 'Sold.'",
        "'speaker_3': 'Within a thousand feet of a school, what will stop it? And why are we making exceptions for Seaside Medical Group? That's all I'm asking. And I.'",
        "'speaker_0': 'Think you. Finally, Mr. Good, he stated a number of times before, If I view marijuana of any type, those people entering into it is just one step, slight step above. Sex trafficking. Period. No ifs, ands or buts.'",
        "'speaker_4': 'Currently.'",
        "'speaker_0': 'As I've stated before, also the boundaries that you set up are certainly appropriate. But they don't go far enough. What you've got to figure out, as I pointed out with the one that's operating in that building next to the third down there in Belmont Shore is you've got to figure out in each district what are the pathways'",
        "'speaker_0': 'those kids take back and forth to school and to their hangouts at the end of the day, which are generally where parents are not in the Belmont. Sure, it's Rite Aid for ice cream. One block away or jack in the box the other way.'",
        "'speaker_0': 'And you see kids of from Lowell, from Rogers tramping by there every single day. So whenever you set that up, you've got to factor that in. And if you're forced to sell this. The one you. What you should do, as I mentioned before, is read out a space.'",
        "'speaker_0': 'It's in the police department. If you want to get money. And one for each statistic. So you'd have nine vendors up there. All right. And they could be open from 10 to 10, 15 a.m. or whatever. The other alternative would be very serious about this.'",
        "'speaker_0': 'Also, put it out on one of the if you look at the aerial photos in the Long Beach, this is your house today. There's an excellent picture in shot of the oil well. Islands set it out there and they can come out every other Thursday for a few hours and pick up the stuff.'",
        "'speaker_0': 'Thank you. Thank you. Thank you. That concludes our public comment on hearing item number one. So I will move this back to the deliberation that we have a motion in a second to receive the supporting documentation and conclude the hearing and approve hearing officer's recommendation on the denial.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_2': 'No, I just I support the hearing officer's decision. I know there was some back and forth. But, you know, we as many mentioned, we have to stand by our 1000 foot buffer and I support this item. Thank you.'",
        "'speaker_0': 'Okay, there's a motion. And second, please cast your votes.'",
        "'speaker_1': 'Motion case.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and grant an Entertainment Permit with conditions on the application of Eagle 562, LLC, dba Eagle 562, 2020 East Artesia Boulevard, for Entertainment With Dancing.  (District 9)": [
        "'speaker_0': 'Okay. Thank you. That approves staff recommendation on that item. And now we have our final hearing hearing at a number two.'",
        "'speaker_1': 'Item two is a report from financial management. Recommendation to receive supporting documentation into the record. Conclude the hearing and grant an entertainment permit with conditions on the application of Eagle 562 2020 East Artesia Boulevard for Entertainment with Dancing District nine.'",
        "'speaker_0': 'We have a motion in a second and may go back to the staff report, please. I believe it also. Is there an oath for this?'",
        "'speaker_1': 'There is an oath. What is required? Okay.'",
        "'speaker_0': 'So let's do the oath, please.'",
        "'speaker_1': 'You and each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_2': 'So help you God.'",
        "'speaker_0': 'Mr. MODICA Thank you, Mr. Mayor. Again, the staff report for.'",
        "'speaker_5': 'This item will be given by Sandy Tim Palmer, our purchasing and business services manager.'",
        "'speaker_2': 'Good evening, Honorable Mayor and members of the City Council tonight you have before you before you an application for entertainment with dancing for Eagle five six to LLC doing business as Eagle 562. Located at 2020 East Artesia Boulevard, operating as a bar, tavern, lounge and Council District nine.'",
        "'speaker_2': 'All of the necessary departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet, as well as the police department stand ready to answer any questions council may have. And that concludes staff's report.'",
        "'speaker_0': 'Thank you very much. They actually in any public comment on this when we go to vice mayor.'",
        "'speaker_3': 'Thank you, Shirley.'",
        "'speaker_0': 'These are have two public comments. I'm closing the speakers list after this. Thank you, Mr. Sir.'",
        "'speaker_3': 'Thank you. Congratulations. District nine. What? What? A lot of positive. There are so many talented people in that district, and I. I was. I was waiting to hear a business that would step in and have this sort of venue become part of the artist culture of that district.'",
        "'speaker_3': 'I believe nothing but good is coming from the advancement. And for those for those children whose minds are not smoked out, we're going to see so much creativity coming out of this. Again, for those minds that are saved.'",
        "'speaker_3': 'Parents do your work. Nothing but good is going to come from a creative mind and being able to have a venue to go in your neighborhood and and express your creativity, I'm not sure what type of entertainment, and I'd like to hear more of that, but I'm glad to hear that this is a this is coming to'",
        "'speaker_3': 'that district. Thank you very much.'",
        "'speaker_0': 'Thank you. And the last public comment, please come forward. Hello. My name is Sergio Maldonado. I'm the manager from the apartment building located about 50 feet from the lounge. The address is 6530 Cherry Avenue. Most of the tenants didn't want to come because they didn't want to get involved in all this legal.'",
        "'speaker_0': 'They call it legal issues, but obviously it's not. It's just it's a hearing. The for the past few months, we've been having a lot of problems with this lounge. I have called the cops. I, I call the city and seem like nobody wants to do anything about it, because so far, it's.'",
        "'speaker_0': 'It's legal. But I call the cops because they play music till two in the morning. A lot of us go to work next day. Maybe I wake up at 530 to be at work at 630. And so far, nobody seems to care.'",
        "'speaker_0': 'And now they're going to have live entertainment. All the dancers in the past three months. It seems like now and then they do have this type of event. We drive by the alley. There's an alley next to the business.'",
        "'speaker_0': 'And it's the. Let's look at it behind our building. We're seeing dancers weigh nothing but just some really tight shorts, male dancers. My daughter started asking, what are these people doing? I mean, we we were the managers of the building.'",
        "'speaker_0': 'So we we sweep and clean the back of the building and we find a lot of use condoms. I don't know about you, but if my kids walk in the back and see all these things, I don't I don't know.'",
        "'speaker_0': 'What's your reaction to what would you tell them? What are they for? Especially for their use and just laying there on the floor. I have pictures of parking cars, parking all the way in the alley, making it hard for us to park in the garages.'",
        "'speaker_0': 'The the the lounge itself. I don't think it's big enough to maintain a lot of people. I don't know how how big exactly it is, but it is it's been horrible these few months since the new owners took over.'",
        "'speaker_0': 'There was a hearing for ownership change. Atari is supposed to have won, but didn't. So if you can please do something about it, myself and the rest of the tenants and people that live close by this lounge. We appreciate it.'",
        "'speaker_0': 'Thank you. Thank you, sir, very much. We've closed the public comment so we have a motion in the second Vice Mayor Richardson. Thank you, Mr. Mayor. Let me walk, folks, through a little bit of the history on Artesia Boulevard and our strategy to sort of improve it.'",
        "'speaker_0': 'It's pretty common knowledge that Artesia Boulevard has quite a few history of quite a few shady dove bars. And over the last few years we've been doing the hard work of figuring out how to improve the conditions of these bars, to make them have less of an impact or be less of a nuisance on neighborhoods.'",
        "'speaker_0': 'Now, the most important thing that we can do is bring in property owners who have a vision for the future and on board with the larger vision for the corridor. An example is the last strip club in Long Beach was on Artesia Boulevard.'",
        "'speaker_0': 'Entertainment, live entertainment, dancing, you know, that sort of thing. And we were able to work with that property owner to surrender voluntarily, surrender that license for entertainment and convert it to a restaurant. And there was a conversation in partnership that helped us achieve that outcome.'",
        "'speaker_0': 'Now, some of the property owners have not been so willing to come and come forth. The reason I want to recognize this specific project, this this specific deal is that the property owner came to the city in advance and talked about that vision and agreed to a number of conditions that will outline.'",
        "'speaker_0': 'And and I have confidence that in the approach that they've that they've attended this, we've taken one potentially terrible dove bar off the table and created a brought in a leader for the corridor that can help us to get some of the other guys in line, because it's not as simple as people may think that we can'",
        "'speaker_0': 'just point at a dove bar and say, hey, you know, stop being a nuisance on the neighborhood. You have to have some level of partnership with the owner unless it or else it leads you down a very arduous administrative path.'",
        "'speaker_0': 'So. Just a couple of things and one question. So there's a number of there's a number of key conditions in here, but one that's really key and I would hope that we can walk through are the tiered conditions, these tiered conditions sort of outline a progressive like progressive discipline.'",
        "'speaker_0': 'It outlines a process to hold the whole folks accountable on this license. Should folks step outside of the conditions that we that we set out on? So necessity manager, whoever else can can answer. How can can you walk us through what that tier condition process looks like?'",
        "'speaker_2': 'Yes, the way that the tiers work is that for if there are problems with the business operation and their complaints that are received by the police department.'",
        "'speaker_3': 'If three or more.'",
        "'speaker_2': 'Noise complaints come in and are found to have been as a result of the activities happening at this establishment, the hours of activities allowed for entertainment will be rolled back by 2 hours. If three additional violations occur within another 30 day period that are found to violate the noise ordinances, it will be rolled back another 2 hours'",
        "'speaker_2': '. So we have a three tiered arrangement here to ensure that if there are any problems with operations, that we are able to change the operating conditions built into this agreement. And that was something that was discussed between the police department and the business operator to ensure that they understood and were willing to comply with that requirement.'",
        "'speaker_0': 'Thank you. So what I'll say is this particular establishment on three sides is surrounded by commercial and industrial space. If this had been anywhere in one of the residential neighborhoods, my position would be very different. But this for the most part, is an industrial space.'",
        "'speaker_0': 'There's some apartments sort of maybe a block down. And I want to make sure that my staff meets the gentleman who came here and talks to some of those concerns and make sure he has a good relationship with the property owner.'",
        "'speaker_0': 'I'm seeing some nods from the property owner. He's willing to sit down and talk with this because it's literally one of one group of residents that I want you to sit down and build a good, productive relationship with.'",
        "'speaker_0': 'But aside from that, I've gotten sort of the property owners indicated the willingness to work with the community. And so for that, I support moving forward with Eagle 562 on Artesia Boulevard. So thank you. And that's my motion.'",
        "'speaker_0': 'I encourage the city council to support it. Thank you, Councilman Gonzales.'",
        "'speaker_2': 'Yes, I just say I support this as well as Vice Mayor Richardson had mentioned. I know this is not the first turn or the first location for this property. Owner has other incredible establishments and not only that, but is willing to come to the table and work with many of us.'",
        "'speaker_2': 'So for that reason, I'll be supporting this and I look forward to seeing more happen on Artesia Boulevard. Congrats.'",
        "'speaker_0': 'They kick us over?'",
        "'speaker_2': 'Yes. I also wanted to just lend my support. You have two of your other locations in my district and are in on a business corridor with residents behind you. And I think that you've done a fantastic job at both of those locations.'",
        "'speaker_2': 'And so I want to applaud you for going and opening somewhere new and stretching your legs a little bit. And I want to applaud the vice mayor for putting in some implementation and a tiered approach that I think us on council often are trying to figure out those conditional use permits and how we do that in a'",
        "'speaker_2': 'way that's respectful of the businesses and of the residents. So congratulations on the new endeavor and congratulations to the ninth District.'",
        "'speaker_0': 'Great. Thank you. With that, we will move to a vote to approve the the conditions. And again, I want to thank the the property owner and the team. They have some already great establishments in Long Beach and I am certain that will continue to please cast your votes.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Councilmember Andrews.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'The eagle has landed. Thank you. Thank you. Great. We will. That concludes our hearings. So we will move on now to the regular agenda. Just give me 1/2.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance and resolution to designate the VIP Records sign located at 1014 East Pacific Coast Highway as a Long Beach Historical Landmark.  \n(District 6)": [
        "'speaker_1': 'Item 16.'",
        "'speaker_0': 'Okay. Yes, please. Director Agenda. VIP Records.'",
        "'speaker_1': 'Item 16 as report from Development Services. Recommendation to request city attorney to prepare an audience and resolution to designate the VIP record sign located at 1014 is Pacific Coast Highway as a historical landmark District six.'",
        "'speaker_0': 'Okay. Thank you. We do. We have a motion on the floor, but we're going to go and do a short staff report, I believe. So let me just turn this over to Mr. West.'",
        "'speaker_5': 'Thank you, Mayor Councilmembers. This is a fantastic night to declare a historic monument. Weren't turning this over to Christopher Koonce.'",
        "'speaker_0': 'Who will walk us through the item. Good evening, Mr. Mayor, and members of the council. I know we have many folks waiting from the public, so I'm going to run through a couple of slides as quickly as possible.'",
        "'speaker_0': 'We're talking about VIP records, which is at the intersection of PCH and Martin Luther King. Here's another appeal. They're at King and PCH near the high school. So a little bit of background on the VIP records sign and its current location.'",
        "'speaker_0': 'Strip Mall was built in this location in 1962. The sign came quickly later and you'll hear more about that tonight in 63. During the 1970s, before we could take the mic and improve it. Rap really started, Mara, as an East Coast phenomenon.'",
        "'speaker_0': 'The IP records opened in 1979. You see the rise of hip hop and rap as a West Coast phenomenon during the 1980s. And you also see really challenging gang and other challenges in central Long Beach during the eighties and dissipating in the 1990s.'",
        "'speaker_0': 'So that brings us to today. In 2016, VIP records contemplated closure or relocation. In May of 2017, this council authorized funds for preservation and relocation of the VIP record sign assisting the business and side owner. With that, in June of 2017, VIP records filed for a landmark status for the iconic sign.'",
        "'speaker_0': 'And in November of this year, the York Cultural Heritage Commission recommended that this body make the VIP record sign into a local landmark. So the sign itself is of what we call the Googie style, which you see throughout sort of an earlier period, 1940s to 1960s, and we see it in a later example in the sign.'",
        "'speaker_0': 'So while it's a static sign, it evokes sort of a sense of movement and activity. It's a combination of metal and Plexiglas, and it's oriented in east west direction. Here's a picture of the sign. I think we all know it because not only of you driven by it, but it's an iconic piece of album.'",
        "'speaker_0': 'Album covers, music videos and our sort of shared cultural history and pop culture. It's just a different view of it. And the sign has remained. While colors are different, things have changed over time has remained basically the same.'",
        "'speaker_0': 'Not as many tapes sold in the later period. More cities. But it's a bad sign, as has been a fixture here in Long Beach throughout its history. So I think you really cannot think about VIP records without thinking about the history, about music here in Long Beach and about thinking about the man behind VIP records.'",
        "'speaker_0': 'And that, Mr. Calvin Anderson, is really a big part of why we are so enthusiastic to be recommending landmark status this evening. So at a time that it was is a difficult place to be for a lot of folks in central Long Beach, especially youth.'",
        "'speaker_0': 'Mr. Anderson was there for not only his family, but basically bringing in the entire community as a part of his family. And VIP records became really a refuge, not just somewhere to buy records and CDs, but somewhere where you could learn about music and the music industry.'",
        "'speaker_0': 'Somewhere where you had access to recording equipment, somewhere you could find someone to be your champion and to provide you some guidance. So when we look at historic landmarks, we look at different criteria under our ordinance. The first is that the sign is, in this case, associated with events that made a contribution to broad patterns of the'",
        "'speaker_0': 'city's history. So that's the development of rap and hip hop and a social movement that it recognizes. But I think the most important criteria that we're talking about tonight is criteria B, which is the association with lives of important persons and really recognizing the importance that Calvin held and holds to this day to the community.'",
        "'speaker_0': 'So this sign will be removed from its current location. So it can be properly restored, it will be stored, and then it will have a future life as part of a exhibition and asset to the community that I think you'll hear more about tonight.'",
        "'speaker_0': 'So with that, we are recommending that you declare the VIP record, sign a local city, historic landmark and direct staff to continue working with the VIP teams on preservation of the sign and promotion of it. So with that, if there's any questions for the staff table, I can answer them.'",
        "'speaker_0': 'And if not, we have a short video and I think we want to welcome Mr. Anderson first up to the microphone with his team. Great. So I know we do have a motion on the floor, but what we're going to do is Councilman Andrews has requested that we first do the public comment piece and Mr. Anderson wants'",
        "'speaker_0': 'to come first. So we'll do the video if there's any public comment, and then we'll go back to the council and we will hear from Mr. Andrews, the mic, the maker of the motion. Okay. So while folks come up, we do have a short video.'",
        "'speaker_0': 'So we're going to the video and then we're going to first hear from Mr. Anderson and the VIP team and then everyone else will get a chance to speak as well. Okay. Okay.'",
        "'speaker_7': 'I became a rapper. The VIP was like the place to go. If you know what war. Wherever you wanted to showcase your skills for people who was in the music industry. And the VIP was the closest to the music industry.'",
        "'speaker_7': 'Considering that Campbell was dealing with all of the artists that was making records and putting out their music. So it was a direct connect. And once I started making music, I got a relationship with Campbell and so many employees at the VIP, and they allow me and my cousin Daz and Warren G and L.C. Slice.'",
        "'speaker_7': 'We were able to come up here and work and make some, you know, quality music that was like mixtape material. And eventually the music was, you know, strong enough to get us a record deal. So the VIP has been special to me in so many different ways.'",
        "'speaker_7': 'That's why I shot my first video here. When I put my record out, I made sure that VIP was the first place that you can get the album.'",
        "'speaker_0': 'Long Beach in the title, my third book. First of all.'",
        "'speaker_7': 'I wanted to shoot a video in the city that I was from because we had never had a video in Long Beach. Second of all, I wanted to come to a location that was monumental and a location that was really the centerpiece of Long Beach.'",
        "'speaker_7': 'So by choosing a VIP and having a director like Fab Five, Freddy and Dr. Dre, it it magnified the abilities of what we could do with the video. And it became a classic video, The Look of the shadow with the sound of it, the whole delivery of the video.'",
        "'speaker_7': 'And I'm just glad to be a part of it. I'm glad I can say that I brought that to the VIP for them doing what they did for me, that was like a payback, you know, for giving me the opportunity to hit home my skills and to become a rapper for me when I make it to come'",
        "'speaker_7': 'back and make VIP, the hottest spot in hip hop. And to this day, the VIP is known as one spot that artists from all over and people from all over just want to come and take pictures of for the simple fact that it's a love and a love they giving me is a love.'",
        "'speaker_7': 'But I took it outside of the city. I took a long beach with me. Everywhere I went, I took the VIP with me everywhere I went, because there's certain things that I was told that I loved on the east side that were instilled in me that I take with me everywhere I go.'",
        "'speaker_0': 'So we're going to hear from VIP first through Henderson. Thank you, Mayor Garcia and city council members. I stand before you today to tell you why I think that the VIP record affair should become a historical landmark. I have with me today VIP with opened June 1978, and it actually was opened by my brother Khalid, a fan'",
        "'speaker_0': 'of and is here with me today. Cletus opened the store. He redesigned the Christmas liquor store sign and turned it into a VIP record signing. So I am honored to have the man, not only the man who put me in the record business in 1972, of whom I worked for for seven years.'",
        "'speaker_0': 'And he taught me everything that I need to know about the business. And like I say, for those who have those extra questions about how did the saying come about, I actually had a living witness with me here today, so I'm happy about that.'",
        "'speaker_0': 'Also with me, I have my children with me, three of them, Tasha, Tanisha and my son Calvin Junior, who, you know, grew up in VIP. My daughter Latasha actually ran VIP for many years. That allowed me to go out and network and actually build the business and build the brand.'",
        "'speaker_0': 'I also have my brother, Timmy Danson here, who actually worked at VIP and one of the early pioneers in working with young males in the community to teach them how to become a deejay and, you know, were the big help.'",
        "'speaker_0': 'So my entire family, it was a big supporter of VIP records. I also have a few guys that worked for me back for many years. Keith Thompson, Deejay for Life. Michael White, Deejay Forsyth, now Deejay P and I also have first degree here that when I actually opened their recording studio in the back was very instrumental in'",
        "'speaker_0': 'working with those young men's and women's back during the time that I opened the recording studio back to the site. I have traveled all across the country and to a few places overseas. And what's remarkable about that sign is that I can just ask people, you know, I tell them I'm from Long Beach.'",
        "'speaker_0': 'Can you name anything, any sites or locations in Long Beach? And it's always the Queen Mary and VIP records. And I had a testimonial about six months ago from a young man that came in a store and bought a t shirt he sees going to Africa for a business trip for a week.'",
        "'speaker_0': 'And he said, Well, I can't tell you what I wore on Monday. He's about to see. I wore my VIP shirt and he said he was greeted warmly. Everybody was very inviting. He said, with the You wore something else and nobody saw him.'",
        "'speaker_0': 'So he wore his VIP shirt the rest of the time. Recently in May, I was on a cruise, Alaska cruise, and the day that I wore the VIP shirt and several people on the cruise from France, Germany, Japan, the South, Mississippi, Alabama and stuff.'",
        "'speaker_0': 'And it's just amazing the reaction that you get from people when they see this logo. There's a logo. And, you know, I am very proud of all of the years, six months from 40 years and six months, it'll be 40 years.'",
        "'speaker_0': 'The VIP records have stood on that corner. And, you know, I'm very happy about the work that we did for so many years in the community. You know, people always associate VIP records with rap and hip hop, but I am very proud of the gospel years, the jazz years, the blues years, the R&B years and the effect'",
        "'speaker_0': 'that we had on all of those artists for so many years. I also want to recognize. Chill, chill. The gentleman here, he's up there. I know you want to speak, so I hope we can get a mic up there to him.'",
        "'speaker_0': 'He's a little disabled and and have a little hard time getting around. But, man, I mean, we are part of the family and, you know, we treat everybody the same. And we have love, respect for the. I think that's one of the reason that I have been able to survive in this community is because we've been able'",
        "'speaker_0': 'to get back the love that we have shown in this community. And, you know, there's no millionaires in my family because we give everything away. And so, you know, we are we are that type of family. And, you know, my kids were pretty upset about it growing up, but I found out that they got the same problem'",
        "'speaker_0': '. And so I've given, you know, everything away. So I hope today that you feel the importance of making this sign a historical landmark that I feel. And because in many people's heart it's already a historical landmark and stuff.'",
        "'speaker_0': 'So hopefully tonight we can make it official. I have received it with something and I'm almost stop. When I originally moved out of the original location, we had a lot of you know, it was on the news, it was on social media.'",
        "'speaker_0': 'And I had two people to come from Japan, one from France and one from Germany that said that they could not die before on foot in VIP records because it had that much influence and impact on their life.'",
        "'speaker_0': 'And so, you know, the sign is very important to a lot of people. You know, I was told that it's like 200 and something historical landmarks in Long Beach area, and I know that, but I don't know how many is known in this many places.'",
        "'speaker_0': 'This brand is known. So I hope that, like I say, everyone feels the same way I do in this past. Thank you for your time. Thank you very much. Lemmy, we're going to hear from the VP team first.'",
        "'speaker_0': 'So we're going to hear from the VIP folks who are here. Thank you. Good afternoon. To the mayor. The city of Long Beach and in Long Beach City Council. My name is Cletus Anderson. In 1967 Hours, an aircraft painter alone beat at Douglas Aircraft.'",
        "'speaker_0': 'Douglas Aircraft. I became the BRP painter of the Year in 1967. I also opened the first BRP. I named it the Pier, a very important place. KPFA Radio was the number one urban radio station at that time. They had a list called VIP Top 40.'",
        "'speaker_0': 'They always repeated BRP Top 40 number one records as being known as BRP. We reap the benefit sometime we could sell 100 copies of one single tile in a day. So BRP would hear we. We couldn't keep enough amateur in stock based on the fact they had that BRP survey sheet that they were mentioned.'",
        "'speaker_0': 'And we had that name. So I said, We'll go to the roof. And along came Snoop Dogg. And he'll leap up on the roof. The BRP and Long Beach. And he made a video. That video went worldwide. Things changed that BRP.'",
        "'speaker_0': 'BRP became the world famous BRP. And he stole my thunder. But when I travel the world, I ask people, Have they heard of BRP? And they will say yes. The world famous BRP landed Snoop Dogg. I see. You got it.'",
        "'speaker_0': 'So I visualize one day being at L.A.X. and.'",
        "'speaker_6': 'Seeing busses lined up world famous.'",
        "'speaker_0': 'BRP tours. Long Beach, California. That smells. That sales revenue. When I hear the word Long Beach, California, I think of Queen Mary. The Pike and the world famous VIP. Thank you for my time. Okay, I know we have some folks who want to speak, but is there anyone else from the VIP group that has a public comment'",
        "'speaker_0': 'at this time? Before we open it up to general public comment. Yes, please come forward.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_8': 'Hi. I'm not going to keep long. First, I would like to say that I've been knowing I believe in Carnival for over 20 years, for sure. I know. And I can speak to his integrity, his character. I have never known him to be affiliated or looked at him as being a part of the rise of the gang'",
        "'speaker_8': 'movement in Long Beach. He is a very humble spirit. He's a very soft spoken individual. Is a man. Can I get a name in? I know somebody knows him. And so I did not identify with that being placed in your writing.'",
        "'speaker_8': 'I may maybe you have identified it, but I didn't when I thought about VIP records. And also Calvin, I don't know if somebody was killed in front of the building and that I really don't know you. But anyway, that just struck me.'",
        "'speaker_8': 'I'm very excited about this moment. I have to share with you that I spent the day with Snoop Dogg on last week, Tuesday, and even though he cannot be here, he is truly in spirit here with you all.'",
        "'speaker_8': 'He wants everybody to know he loves him some long beach. And just like he said, he attributes it to his success in many, many, many ways and looking forward to the day that that bonds can grow again. I'm grateful for the opportunity to stand here and just see this moment happen, period.'",
        "'speaker_8': 'And I would like to say that you all should address the possibility of a monument being set up with the signs somewhere in the city of Long Beach. I don't know if would be King Park, six district area.'",
        "'speaker_8': 'Somewhere on that side, there's a park right down the street, I believe, on Martin Luther King Boulevard that is right behind that, the high school there. And I think a monument of some sort to the legacy of this space and this sign would be a wonderful thing.'",
        "'speaker_8': 'I love you. You know I love you. Be bless.'",
        "'speaker_0': 'You. Thank you.'",
        "'speaker_2': 'Mayor Garcia City Council residents who are here tonight. I have been given a privilege to come up and speak by the VIP team who asked that I come and say a few words. My name is Katie Rispoli. Tommy.'",
        "'speaker_2': 'I'm the executive director of We Are Even a nonprofit based here in Long Beach. Our goal as an organization is to help young people understand the city that they live in and build a relationship with it. We were privileged to recognize Mr. Anderson for his many years of service to the community and for his work being a'",
        "'speaker_2': 'leader to youth in Long Beach over the last 40 years. Recently with our organization, I, as someone who holds a master's degree in historic preservation, recognize how valuable it is that we do this tonight. It's no secret that this country has carefully created a collection of historic sites that tell a specific version of our nation's history.'",
        "'speaker_2': 'And as a result, we've denied recognizing the full American story. Nationally, we have begun to broaden that conversation by even more. In the city of Long Beach. Right now, there are only two historic landmarks designated for their affiliation with a nonwhite non-male individual out of over 100.'",
        "'speaker_2': 'So it's time that we start to make this change. And tonight, I expect you'll move forward in designating number three. I hope you'll look around tonight and recognize the crowd that's in this room. I know, and I'm sure you know that people invest in the government that invests in them.'",
        "'speaker_2': 'Tonight you're investing in them. And as a result, this crowd is here. Some of them for the very first time. Don't let this be the last time we are in these chambers together. Tonight, designate VIP records a historic landmark and let this be the gateway to recognizing all history in Long Beach and acknowledging, respecting and celebrating our'",
        "'speaker_2': 'city's full population. Thank you.'",
        "'speaker_0': 'Thank you. Excellent. Thank you so much. Best. Please come forward. And actually, we're going to lower that just for you just a little bit. Okay. I want to order for you there.'",
        "'speaker_3': 'So high tech.'",
        "'speaker_4': 'Technology. You got it. Okay.'",
        "'speaker_1': 'Good evening, Mr. Mayor. And ladies and gentlemen of the council. My name is to me and I. I'm here to ask for your support to make the world famous VIP record sign a historical landmark for the city of Long Beach.'",
        "'speaker_1': 'I am eight years old, and in my short years, I have been able to see the impact that VIP records has had on the lives of many people. But I would like to speak on behalf of the children, children past and present, that have been able to see and use VIP as a safe haven, a support system'",
        "'speaker_1': ', and a place to be encouraged. But to do their best, to be there best. For me, VIP represents family, and that sign that is recognized worldwide represents possibility to youth who hear the stories of how dreams were made possible in the doors of VIP, the place where creativity has been encouraged, where people are looked at for what'",
        "'speaker_1': 'they can be. This moment is important for my family, and I plan to make sure the legacy of VIP continues for generations to come. Thank you for allowing me to speak to you. And on and on. On a personal note to my papa, I am so happy to share this moment with you and other family members present'",
        "'speaker_1': '. And it is amazing to hear how you have personally touched the lives of so many people in the city of Long Beach. We we, your family, are proud of you and love you. Thank you for your support.'",
        "'speaker_0': 'Very nice. Very nice. Thank you so much. And when we will move the speaker's platform up for the next speaker.'",
        "'speaker_3': 'Good evening, Mr. Mayor. Mr. Vice Mayor. And ladies and gentlemen of the Council, I just am so overwhelmed with emotion today. I am grateful just to be able to experience this opportunity. I am here in support of you making the world famous VIP record sign a historical landmark here in the city of Long Beach, not just for'",
        "'speaker_3': 'its significance to hip hop, but to its significance to the community of Long Beach and to the people that I speak to personally, not in the community and worldwide. But see, that sign is home. See it as familiarity, see it as just a place to be, the place to be.'",
        "'speaker_3': 'When growing up, I grew up, as my father stated in V.I.P. All of us, my siblings and my cousins who are also here present. We are VIP kids because as you can see, and since 67, most of my cousins, most of us were born, all of us were born after 67, I think.'",
        "'speaker_3': 'And we have just been going through this process with my family. And it has been, like my father said, a amazing journey to experience the lives, being able to experience the lives of other people, letting us being able to be an impact to other people and going broke for other people.'",
        "'speaker_3': 'We do it not for accolades, but we do it for from the kindness of our heart. It is something that is embedded in us, all of us, as a family. And I'm just grateful again just to be able to have a father who has been instrumental in helping people achieve their dreams and instrumental in supporting people to'",
        "'speaker_3': 'be all that they can be. And again, I thank you. I am extremely humbled and thankful to be able to go through this experience. And I ask for you, encourage you to please make this a historical landmark. Thank you.'",
        "'speaker_0': 'Thank you. Next week at place. Hello. Love you guys. Appreciate the moment. My name is Freddie Johnson. I grew up in Long Beach. Okay. VIP has been open all my life and has been open to me and my friends all my life.'",
        "'speaker_0': 'And I've seen at least three of you guys on this panel at that place. You understand what I'm saying? There's only there's only really three things. In Long Beach, the Queen Mary also does pros, goes gay and is the VIP and is hip hop.'",
        "'speaker_0': 'Now, hip hop is something that is see or you got your own personal opinions about it. But one thing hip hop did do was make sure this city was well known. No matter what, Ali, or what corner you can go into.'",
        "'speaker_0': 'They know about Long Beach rehab. I've been everywhere around the world in this VIP shirt. And they respect it and they honor it. Because we upheld a love and understanding there of the city, of the culture of love in this city.'",
        "'speaker_0': 'And his brother behind me, Shani Domino. Okay. We took that place and we walked up to that place. No matter what we was going through or what we understood, we were accepted there and we were able to grow there and we learned things there that we couldn't learn at home.'",
        "'speaker_0': 'So it was a place for fatherless child to find a father. It was a place for a child can play safely in every way they can free think and they can learn. But what I'm asking guys is this What is history?'",
        "'speaker_0': 'A lot of you guys. A successful ministry. Look where you are. But that place is history to me because when people would not allow me. To express myself. That place did that, Mandy. When I needed some money to catch the bus to go try to to audition how many auditions we went to.'",
        "'speaker_0': 'So I had no money. But Calvin say he got $50 for you. Take this VIP shirt and you don't in number 60 and make sure you get out there and make it happen because we frontline is year. But what I'm asking you all to do is to give us something back.'",
        "'speaker_0': 'It might be small to you. It might not be too much importanti. But that sign means a whole lot to a whole lot of people. You know why? Because it was something to look up to. I go to Kings Park.'",
        "'speaker_0': 'I got the King statue, but I'd rather the man instead of a statue. But what we do have, I would rather have that and keep that because it is a part of my growing history. Every day I grew up on this side of Long Beach.'",
        "'speaker_0': 'That place was open to me and that place was there for me and my friends and I met my friends that could sing and rap because we are the original place of singing in rapid. Period. Long Beach is an R&B town.'",
        "'speaker_0': 'So what I'm asking you to do in your heart, what you know, what to do, because when you put this t shirt on. I know. Oh, yes. This is fly. Thank you very much. And there are available. But what I want to tell you is this.'",
        "'speaker_0': 'I want to smile with you. I want to laugh with you. But this place was a place that frowned with me to. So when I lost my father and when I lost my friends, that place gave me want.'",
        "'speaker_0': 'That place gave me a sanctuary. A place to go and learn how to pray. When the church wasn't open. Period. That's what I'm that's what I'm trying to get you all to understand the power and the value of this hip hop thing.'",
        "'speaker_0': 'Because the same people you look at, the Snoop Dogg's, the Domino's perfection, the twins, all of these guys excelled from the condition. They became celebrities from the same condition. That people make point at and say why? Well, here's why.'",
        "'speaker_0': 'Because it was a place to find change. So how many people will open the door to change instead of stand there and watch it die? I'm not pointing you out, but you'll know which ones I do know. And I don't know you.'",
        "'speaker_0': 'But I do know you because you run my community. You are responsible for the way that I grow here. So I'm asking you on behalf of hip hop, because this is my favorite hip hop. When I didn't have nowhere to go.'",
        "'speaker_0': 'When I was out trying to pull me to go to war, Calvin opened the door and gave me a cheer and let me plug that speaker up. And I stood and sat on the speaker until I figured out what I was going to do.'",
        "'speaker_0': 'So I'm asking you to please come sit on the speaker with me so he could give you an opportunity and show you a road to where we can go.'",
        "'speaker_6': 'Because as being.'",
        "'speaker_0': 'A young black man in Long Beach, I had many places to go. I have no where to go now. I have no place to go and celebrate my culture, which is hip hop. The hip hop and the culture that I'm talking about is not Hispanic, black, white, Jewish, Muslim.'",
        "'speaker_0': 'It is for people. And that's the problem that we have in this city, because I do understand, no matter what color you are, you are still people. And it takes people to put you where you at. So help these people keep the little bit we got out here so we can build some money.'",
        "'speaker_0': 'Thank you very much. Thank you. Next speaker. So I, I obviously I obviously let the gentleman go beyond the time because I thought you had a lot to say. So I want to make sure you. Sure thing. But I want to make sure, obviously, just to to be you know, I've got to keep the rules going.'",
        "'speaker_0': 'So please, if can stay within the time allotted and we'll continue. Yes, sir. Hello. Thank you. City Council. When I was Vincent Martinez, I'm from Long Beach, California. I'm going to try to make a quick I'm actually on my lunch break, but I'm a music producer.'",
        "'speaker_0': 'I'm from the east side of Long Beach. I'm actually signed to a record label called Soul Election, which has has over a million followers worldwide. And a radio show on Beats one Apple Music. The reason I'm here is because I don't think any of that would have been possible without the app, because I had a lot of'",
        "'speaker_0': 'friends. I could have been a gang member. I could have done a lot of different things. But instead I just go to the skate park and I go to VIP records and learn about music, not just hip hop or jazz.'",
        "'speaker_0': 'So everything and none of that would have been possible without VIP. So I just want to say thank you, VIP. Thank you, guys, for your consideration for making this a landmark. And I hope you guys say yes and.'",
        "'speaker_0': 'Yeah. This VIP record is, is honestly, I feel like I'm one of the youngest people speaking right now besides the Kilo girl that I feel that it's a it's a symbol of hope that you can make it out of here.'",
        "'speaker_0': 'So that's why I'm here. Just wanted to on behalf of the younger artists, because hip hop now is not just about gangster rap. There's a huge community of Long Beach. Of artists that are doing soul music, hip hop, just different things, speaking on a lot of issues in our community, and that's why I'm here, just to represent'",
        "'speaker_0': 'our younger community and let you guys know that I'm a product of what we did and that we can make it out of here and it's not. So that's kind of nervous. But yeah, I just want to say thank you, Gabby, and thank you guys.'",
        "'speaker_0': 'Doing great. Thank you very much. Mr. Pete, why don't you come up? But, yes, Mr. Pete, your next. Mr. Pete, I need you to. I need you to speak. Please. Hey, Mr. Pitt, you're up. Look.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'I know I've been waiting for you to come up. Go ahead, sir. Come on.'",
        "'speaker_6': 'Couple of seconds. Give an honor to Jesus. He's the only one who deserves honor to me. But anyway, at any rate, this is a great thing. You know, it's it's long overdue because I've been there been a landmark election, but I'm glad to see.'",
        "'speaker_6': 'And here today, you really honor something that black folks did because black folks put Long Beach on the map, as far as I'm concerned. So. I mean, that's that's real. I mean, I'm not coming off racist. I hear everybody that comes in here.'",
        "'speaker_6': 'I mean, they praise they praise their race. And it's good. Everybody's supposed to. If you're white, you're supposed to be glad for which are people dead. If you're Hispanic, be glad for what your people did. But, you know, it seems like when you say something about some black, oh, why don't you guys.'",
        "'speaker_6': 'You know, this is good. And we need to have more of this here. Unlike, you know, I've seen in the past, which given everybody else. So let's keep it American for Americans and let's let's do much more of this recognizing what's here and let's include real citizens and not non citizens, because I know this arc has a'",
        "'speaker_6': 'has a thing with non-citizens. And the bad thing to me about this is I've never this is beautiful seeing all these black folks out here. I wish we get them all the time.'",
        "'speaker_0': 'But with the.'",
        "'speaker_6': 'Way things are going with a rent control, you ain't gonna be here that long because rent control is about to drive them out. And that has something to do with this, too, because we're finally recognizing something that should have been recognized.'",
        "'speaker_6': 'But through, you know, all these other bills, I see non-English speakers being pushed. I want to see more things pushed for black folks. I know you don't like to look me in the eye, Mayor, but you sure do push Hispanic stuff because you're.'",
        "'speaker_0': 'Not wearing your Trump hat.'",
        "'speaker_6': 'That's why. Well, you know what? Doesn't matter. Oh, you trying to get funny, huh?'",
        "'speaker_0': 'Well, check this out. You usually you don't try to talk about time because, you know, nah.'",
        "'speaker_6': 'You don't try to make yourself.'",
        "'speaker_0': 'Seem like a good guy, because I don't think you're a good.'",
        "'speaker_6': 'Guy. And you guys better understand this guy is not for, you know, so so you come up here more often, we're going to get rid of that rent control because that's going to drive black folks out. We're going to do much more of this.'",
        "'speaker_6': 'Rent control is bad. I'm telling all you, black folks see what happened in Frisco, New York and Santa monica. There was blacks in Santa monica before they put back control. So they want to put rent control here. So I just had to say that.'",
        "'speaker_6': 'So you hear that? Remember, no rent control. They're trying to drive us out. Thank you.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_6': 'Like.'",
        "'speaker_0': 'You go the next speaker. Okay. Hello. I'm the artist known as Domino, responsible for moving millions and millions of records, as well as being in many movies that have grossed quite a few millions of dollars. I just want to say that I have a lot of respect for VIP.'",
        "'speaker_0': 'When I was younger, they probably was the only corporation that was really identifying and connecting with the community, as far as I'm concerned. And, you know, a lot of us really we took this thing around the world because it meant a lot to us.'",
        "'speaker_0': 'It's responsible for many other artists that have moved many millions of records. I just don't know any other place or any other establishment in Long Beach that is responsible for such. And so I think that it is mandatory that we make something that has never been duplicated, a historical landmark.'",
        "'speaker_0': 'And I'm going to leave it at that, because everybody has already said what needs to be said. Sorry, that landmark in my head. So thank you. Thank you. Next speaker, please compose.'",
        "'speaker_6': 'Good evening. My name is Pastor Q. I live here in the city of Long Beach.'",
        "'speaker_0': 'It's interesting that VIP is on MLK and PCH. Dr. King said this Everybody can be great because anybody can serve.'",
        "'speaker_6': 'You don't have to have a college degree to serve. You don't have to make your subject and verb agree to serve. You only need a heart full of grace, a soul generated by love. And when I think about VIP.'",
        "'speaker_0': 'I think about that.'",
        "'speaker_6': 'Soul right there generated by love. Why? Because in 1989, I walked into VIP, fresh from Texas with a group called The College Boys. And if you want to know who the college boys is, Ramani Malco, who starred in Think Like a Man.'",
        "'speaker_0': 'Two and Think Like a Man.'",
        "'speaker_6': 'And was in 40 year Old Virgin and starred in Weaves. So Kevin didn't just launch hip hop careers. He launched careers. Can I get a man up in here? And so to me, to me, I don't see you voting any other way.'",
        "'speaker_6': 'I mean, it's it's done. As far as I'm concerned. It's done. It should have been done. And Kevin, we went on. We walked in, like I said, in 89, we walked into VIP. One year later, we came to California to get a record deal.'",
        "'speaker_6': 'One year later, we had a record deal. Why did we have a record deal? He took money out of his own pocket, did a demo tape for us. We signed the Virgin record the next year. So. He has done so much for Long Beach.'",
        "'speaker_6': 'It's time for Long Beach to do for VIP. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'This is so obvious. But thank you for hearing us out. My name is Cammy Johnson again. And I'm speaking. And I hopefully this is the last time I have to speak about the historical landmark designation. I really like to talk to the youth tonight and our future, because what we're doing today is for our future.'",
        "'speaker_3': 'We'll be here. Everyone who is standing here, there's going to be five and six year olds is going to look at this video tonight and they're going to say they fought for us. This historical landmark designation is just one step into a step that I hope that all of the council members, all of this city can stand'",
        "'speaker_3': 'behind because we have more to do. We have a museum to build. We have trucks to go out to share with the entire nation about black history and black music. We have so many things that needs to be done, and this is just one step to offer leverage into those things.'",
        "'speaker_3': 'VIP means more to me than anything, and here's why. When I first came to Long Beach, I was five years old. And the one thing that I knew when my dad used to take us over the VIP records to pick up his gospel albums, because that's all we could listen to.'",
        "'speaker_3': 'And then we also went to P&G to get Boudin and all of the Cajun food that we weren't able to get because he's from Louisiana. We were able to see black business at its heart and inspired me to not only be a hard worker, to get my education, to make sure that I don't only work for somebody'",
        "'speaker_3': ', but I work for myself. This is what VIP did for me at five years old, and I continue every single day to work hard for this. This is not something that just came overnight. This is something that has been inbred in me the moment I stepped my foot onto that pavement.'",
        "'speaker_3': 'When I saw those record signs, I said I wanted to be a painter just like that. I wanted to do record covers just like that. And guess what? I became a graphic designer because of that. It took me ten years to get my bachelor's degree in graphic design.'",
        "'speaker_3': 'I worked hard. I was a single mom, and I was able to cross that line because I always had it in me to say that I am an example. And VIP was my example always. Thank you, Kelvin Anderson.'",
        "'speaker_3': 'Thank you to Shirin. So the goal. You have you two have been really supportive of this movement and all I'm going to say one more time tonight to the youth. Hashtag support, V.I.P. Hashtag Dee Andrews Support VIP. Thanks so much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, everyone. Good evening, Mayor. Members of the City Council. My name is Sol Anika Smith and I am a longtime resident of Long Beach and a volunteer in Long Beach. And many, many of our programs and this is obviously a no brainer, in my opinion and in the opinion of so many people here tonight.'",
        "'speaker_3': 'But Calvin, I am here also to let you guys know. Calvin is so much more than just a businessman who has had a business in Long Beach. He is a communitarian. The IP records and that sign is symbolic with what the city has been able to showcase, and that is diversity that is elevating the brand of the'",
        "'speaker_3': 'city of Long Beach to when people do recognize that sign. And it is very synonymous with progress, with dreams being realized and made. And it is because of Calvin's dedication and commitment to our community, whether it's volunteering for a King parade and having that his location as a stop point where we can rest, we can get T-shirts'",
        "'speaker_3': ', we can get some some snacks, and we can keep going. It is a it's been an epicenter of dreams, of goals being realized and also where people can create and we can continue to do that. And I just encourage you guys to designate this as a Long Beach historical landmark for so many reasons and to also so'",
        "'speaker_3': 'thank you to Calvin for being not only a wonderful person and businessman, but but communitarian in our community. Thank you.'",
        "'speaker_0': 'Thank you. Speaker, please. Thank you, mayor. City councilman. I'm the youngest brother and he's the oldest. And via AP Records has been my life and the lives of most of the kids. We had over like 14 stores, so every kid and everybody that worked inside his store.'",
        "'speaker_0': 'Soon as he got out of school, I was brought to Bishop Long Beach a few months before Calvin took over the store. And it was a beautiful store back then and was still a beautiful store when he took over and ran the store.'",
        "'speaker_0': 'I think that everybody has a lot of things to say about the VIP. So in the past, I have vision for the future for VIP. I've been pushing also the museum idea. I see that New York is putting $40 million into hip hop music museum in New York.'",
        "'speaker_0': 'I say Long Beach is a place for right here. I hear earlier we are short money, short million dollars of all the programs. Then money need to come to Long Beach. I believe that VIP can bring that money.'",
        "'speaker_0': 'I look at things like the voice now that everybody's watching on television. VIP was a voice you want the VIP kids came there and we tell you, you have a hit record. You don't have one good many record companies.'",
        "'speaker_0': 'Often, every Thursday, actually, they invited us to the record company to pick out the next hit. The artist didn't pick the hit. We picked the hit. We told Best Buy what was hot. We told Target what was hot.'",
        "'speaker_0': 'Yes, we didn't get the credit for it. But VIP records was a foundation for hip hop and R&B and jazz and gospel and blues. So I think that talking about the past and I think you've already made your minds up about the historical and that's good.'",
        "'speaker_0': 'But I also believe that VIP can be the next Queen Mary for you. So I want to pass it on, but I thank you guys for my time. Thank you. Next week, a Bruce Springsteen. Good evening, Mayor and Council.'",
        "'speaker_0': 'My name is Bruce Milam, Jr. I moved to Long Beach, 1992 from Joliet, Illinois, and I wanted to come too. I moved out of there to get away from the violence and to come.'",
        "'speaker_8': 'To Long Beach.'",
        "'speaker_0': 'And then I got here with the naval shipyard. My brother was in the Navy and I you know, I missed the Navy here and I moved here and want to be in this being the entertainment business. And so my first very my first celebrity I even seen was that VIP wreckers, that Snoop Dogg video Shoot You Can'",
        "'speaker_0': 'is a little speck or you can see.'",
        "'speaker_8': 'Me in the video.'",
        "'speaker_0': 'It was a lot of people there, but but Fab Five, Freddy, Dr. Dre, it was really exciting to me to let me know that seen him there in the city, that I can do it too. And so from there, you know, I end up appearing on Emmy Awards and I released the album called Through the Eyes of'",
        "'speaker_0': 'the Real. In my first album, The Wrestler, we had friends, they call it VIP Records and Killed to let us put our album in the store. So from the video shoot, you know, years later, record music took in a record deal and ended up having our CD in his store.'",
        "'speaker_0': 'So I appreciate that. And, you know, now have a show called Downtown Bruce and and I'm on Franklin Middle School. Wilson Long Beach City College.'",
        "'speaker_3': 'Entrepreneur Long Beach.'",
        "'speaker_0': 'What aromatherapy business? I love Long Beach and with VIP records, it really helped me, you know, have, you know, take my dreams to the next level with knowing that I can do it. Seen all the celebrities being in the mix, as we call it.'",
        "'speaker_0': 'And so I would really recommend that you guys make this landmark happen. So, Kevin, I want to thank you for, you know, everybody in Long Beach for, you know, taking it to the next level. We appreciate that. And so this bill is real business.'",
        "'speaker_0': 'We have a lot of friends is a number of it's a lot of people that's not even here that went to VIP records and became so-called celebrities or got record deals. It's a number of them, the big list.'",
        "'speaker_0': 'So this is real. We want to thank you and I appreciate it. Once again, I'm Bruce Mahlum and I see you guys later. Thank you so much. Thank you so much. Next speaker, please. Good afternoon, Mayor. Good afternoon, counsel.'",
        "'speaker_0': 'And more importantly, good afternoon, Long Beach or good evening. Now my name is On the Fire, which I've been living in Long Beach for over a decade. And I'd like to first of say that VP Records is Long Beach.'",
        "'speaker_0': 'And, you know, I came to Long Beach in eighth grade coming from Orange County and, you know, coming into Long Beach. And I went to Will Rogers Middle School and I met a buddy of mine named Matthew Roe, who who came out to me.'",
        "'speaker_0': 'And I was a big dude. I was about 300 at the time. And he said, Damn you a big guy, man. Where are you going? High school. And I said, You know, I'm going to I'm going to Long Beach.'",
        "'speaker_0': 'Wilson And he said, All Hell no, hell no. You're going to you're coming to the phone calls. You come to Long Beach Poly and you go play football with us. So, you know, after that, I went up to my mom and dad and I said, mom and dad, you know, I'm not going to school unless you want'",
        "'speaker_0': 'me a Long Beach poly. And, you know, I went in there and I got I went in there. I was coached by Coach Slice right there. And, you know, I really embraced what, you know, the community of Long Beach was all about.'",
        "'speaker_0': 'I really embraced, you know, what that meant. And, you know, here I am, you know, a white boy from Orange County. And I'm surrounded by, you know, you know, blacks, Pacific Islanders. And, you know, I was kind of but but, you know, playing a sport and what's one thing that we we all related to was music.'",
        "'speaker_0': 'And I knew of coming along because I knew, you know, three things. I knew my parents had business in Long Beach. I knew the Long Beach Grand Prix because I love races and I know Snoop Dogg, Warren G, Nate Dogg and VIP records.'",
        "'speaker_0': 'And, you know, music brings community together. And when you look at, you know, what Snoop Dogg has done for for music, for hip hop and for, you know, just bringing cultures together and bringing community together, I think, reflects on what, you know, Kelvin and his family started here at VIP.'",
        "'speaker_0': 'And, you know, just bringing in community, bringing in, you know, things for good, you know, creating art. And I think that's that's truly is a you know, I think it's truly is a blessing that, you know, God has given us.'",
        "'speaker_0': 'Calvin and his family brought him to Long Beach. And, you know, you see the product of, you know, what has been created because of that. And, you know. I just I just want to say, you know, I, I worked with I got the real estate license I work with.'",
        "'speaker_0': 'My mom was a broker here in Long Beach. And, you know, we we were living in a property on Long Beach Boulevard. And my mom's like, here, you got to open up this property. We got some, you know, clients coming in.'",
        "'speaker_0': 'And, you know, we go in there, I open up the property and here comes, you know, Sharon and Kelvin. They come in and they're like, hey, you know, we're from VPI Records. I was like, Get out of here.'",
        "'speaker_0': 'I'm talking VP Records right now. It's just I, I couldn't believe it. And, you know, it's just. Just the warm hearted greeting I got from them and just just you. You could feel when you're around good people. And it was just I just can't say, you know, much more about, you know what, you know what Kelvin is'",
        "'speaker_0': 'and the VP records and that whole family is just they're truly are, you know, great people and you know, this deserves and I'm surprised it's not a landmark. You know, over 40 years everybody knows that sign from every every country in the world.'",
        "'speaker_0': 'You got to keep the time, so just keep it. Yeah, no worries. Always. I thank you for your time. Thank you so much. Appreciate it. Next speaker, please. Good evening, council members and mayor. My name is Daryl Mosley and I'm here on behalf of Kelvin Anderson and the world famous VIP.'",
        "'speaker_0': 'And I'm praying that you guys support and vote to make it a historic historical landmark. My story is basically I grew up in Long Beach since I was eight, and I went to I graduated from Poly High and I lived in Signal Hill and I had to come down Martin Luther King to go to Poly High.'",
        "'speaker_0': 'I fell in love with music at a young age. And instead of hanging out and, you know, doing different things, I chose to follow music. And VIP was the place where I could do that, you know what I mean?'",
        "'speaker_0': 'And they welcomed me back in the day. We had like Warehouse in Lakewood and Tower Records and all that, and I couldn't hang out there for obvious reasons, but I could hang out at VIP though, and they would welcome me like a family member and made me feel welcome.'",
        "'speaker_0': 'And I thank you for that. Calvin. I feel this should be a historical landmark because of its significance to the world and what it does for Long Beach. I also worked at VIP for many years and I've seen a lot of people come from different countries and it's just amazing how respected, you know, that sign is in'",
        "'speaker_0': 'that record stories. You know, it kind of blew my mind to see people from Japan, from Australia, from all over the world, you know, I mean, they really recognized this sign. And like a lot of these brothers behind me, you know, I mean, my dream was to be a producer, a rapper.'",
        "'speaker_0': 'And he helped me, you know, have the ability to honed his skills. And I thank him for that. And there's a lot of people, I'm pretty sure that have that same feeling, you know what I mean? So I pray that you guys do the right thing and vote to possibly make it or not possibly, but make it'",
        "'speaker_0': 'a historical landmark because it's the right thing to do. And I thank you for your time. Thank you. We have three final speakers. I'm closing the speakers list so that. Oh, I'm sorry. So we have a clip, a few more.'",
        "'speaker_0': 'Okay. So I just wanna make sure I know how many have have. I can close the speakers list. I have the four that are in line and I have the gentleman that's in the back actually. Okay, it's going to be five in line.'",
        "'speaker_0': 'The gentleman, the back and then the speakers list is closed. Okay. It is now closed. I'm going to let the gentleman in the back go and then I'm going to have you come up next search. So please, sir.'",
        "'speaker_0': 'Hi.'",
        "'speaker_8': 'Hello. My name is Marcus Phillips.'",
        "'speaker_0': 'Better known as Chill. Singer, songwriter, producer out of.'",
        "'speaker_8': 'The Abbey Records.'",
        "'speaker_0': 'According to the AP, more than, well, probably 24 years ago as a member of the group 12 M, which was managed by Calvin and. I've seen personally being there VIP people that come in here and just from from all over the world.'",
        "'speaker_8': 'And just get so fascinated and just.'",
        "'speaker_0': 'So starstruck being there and may not even be a started to looking at but if you do you know, they look at you as being kind of a star at VIP. We see a lot about VIP records, the sign itself, because it is very important to the community.'",
        "'speaker_0': 'But Kelvin Anderson is very important to the community called The Good. Children did a lot for.'",
        "'speaker_8': 'The community and is still doing a lot for the community.'",
        "'speaker_0': 'If you need a job, he would give you a job even if even a just work day to sweep up or something. But he was always giving back. And this was not just to people in in Long Beach, but it really didn't matter where you came from.'",
        "'speaker_0': 'Anybody can come to Calvin and Calvin would help you with anything. I was always able to able to go to Calvin about anything, and he was always willing to help. When I was made up in that organization was the worst experience in my life.'",
        "'speaker_0': 'No, tell me 1/2. I think to make just one out that can. Yeah. There you go. You know, when I was up in the hospital after open heart surgery and I woke up and saw Calvin sitting there. And many.'",
        "'speaker_8': 'Times in that hospital.'",
        "'speaker_0': 'Campbell was there. Yeah. P t shirts and, you know, hats, whatever. I was at the Heritage Commission last month. Days after that, I had another heart attack. So I didn't know if I was going to be able to be here today.'",
        "'speaker_0': 'But I will call Calhoun once in a while and say, Hey, what's going on? And I plan on being there. So I'm I'm thankful to even be here today. God has blessed me to even. Just in case. There we go.'",
        "'speaker_0': 'Yep. So your guys blessed me to even see this day, but I'm more thankful to see all the people that have come out to support VIP. And there are many more that should have been here and probably could have been here.'",
        "'speaker_0': 'But they aren't for whatever reason. But.'",
        "'speaker_8': 'To me, I'm saying that this is going to be designated a landmark. And I wish we could designate a man as landmark.'",
        "'speaker_0': 'As Calvin would definitely.'",
        "'speaker_8': 'Get that. And I'm just pretty out there.'",
        "'speaker_0': 'Maybe kill Musharraf or cancel, you know? Thank you, sir. Bishop, in the last four speakers here. Yes, sir. All right. Hello, Mayor. And the rest of the council members. My name is Kelvin Anderson, Junior. I am the son of this man here.'",
        "'speaker_0': 'I've known him all my life. Uh, I'd like to pretty much make my long story short. It's pretty much as everybody has said, that, um, as far as what my father and what my uncles have done is they took a city and truthfully made a family out of it.'",
        "'speaker_0': 'I really don't see the record shop as a record shop. I literally see it as my home. And everybody that comes in is whether a brother or sister or uncle. And I refer to these people as such. I don't even refer to them as clients.'",
        "'speaker_0': 'So even with that being said to where I can see a man who sees a young man stealing from him and he disciplines him by taking his bike. And then the same very young man that came home, his skills to where he becomes a superstar today, that speaks volumes to where somebody just got out of jail for'",
        "'speaker_0': 'whatever they may have done, still brought him to the back, led him home, his due skills, and he became a legend today, honestly, one of the biggest stars known today. How would that have happened? I mean, to give them a chance.'",
        "'speaker_0': 'You ask yourself that. This man who everybody else kicked to the curb, he brought inside. Every last one of them, no matter how reckless they may have gotten. He saw the content of their character as far as what was underneath, as far as well as hidden behind any problem that they had.'",
        "'speaker_0': 'He was there for them. So with that being said, with what my father has done and what my uncle has done and how this may be a legacy and all that. Yes, that is true. And I'm only speaking on behalf of friends that I have in Japan that I would have never met in my life.'",
        "'speaker_0': 'Switzerland, Netherlands. Uganda. Who thinks to go there? To be honest. So with him having this entity and for people to treat this place like it's their own backyard, as if they've went to Michael Jordan's house or they went to Michael Jackson's house or anything like that.'",
        "'speaker_0': 'And I'm looking at this place like an everyday place, but they treat this place as if it is a church. If if everybody understands what I'm saying to them is sanctified to them, it's holy to them. It was their place of safety.'",
        "'speaker_0': 'They couldn't go home and do none of this. As a couple of others have said, my father became their father. That's why I look at them as my brothers or my peers. A lot of these people, I've cried with them, laugh with them.'",
        "'speaker_0': 'So this place is more than a business. So for this place to not already be an official legacy. I find that a problem. So for it to have took this long. Don't get me wrong, I'm very appreciative. But this should have been something that happened a long time ago.'",
        "'speaker_0': 'Thank you for your time. Thank you very much. Next speaker. Very good. You. I, too, was at that Heritage Commission and I hadn't heard I obviously had heard about the IP records, but had never heard the full saga.'",
        "'speaker_0': 'And it was extraordinarily impressive. You've heard it here today. My range of of African-American singers, artists is rather limited. Fats Domino was mine in terms of anything that it approached that in the other end of the scale. Marian Anderson, who I still think we should honor by having a facility down here.'",
        "'speaker_0': 'I would get into that at some other time. Well, and it was just so impressed by the the how culturally important it was to the people in the and within the black community and so forth. Functioning as a why?'",
        "'speaker_0': 'A sports operation or a parody organization. Well, one of the things I related to when somebody mentioned taking the 60 bus up to Hollywood reminds me a long time ago and in high school I had a boy band and in the summers we had a good summer in Maine.'",
        "'speaker_0': 'The neighbor, one of our neighbors, was a vice president of Capitol Records. So when I came out here, I did take the 60 bus and I forget what a bus is for the blue eye. What bus? Up to Capitol Records.'",
        "'speaker_0': 'And I went in, auditioned for it. He said, Come on back. I want you to meet somebody. Came back the next day and auditioned with him and Lew Wasserman. You know, it was crazy watching this one. They heard me sing.'",
        "'speaker_0': 'They sang me to a contract, the likes of which all they want is a lifetime contract. And the only other life going contract, which was a steel berg, had that lifetime contract as long as I was, as long as I promised never, ever, ever to sing.'",
        "'speaker_0': 'Because I figured if I sang, it would ruin the industry. Thank you. Next speaker, please.'",
        "'speaker_9': 'I think it.'",
        "'speaker_0': 'Was actually wonderful. Oh, no, I'm with that one. Wow. Yes, sir. A mayor, a city councilman. I'd like to thank everybody for coming out tonight, showing their support. I have no big, huge story. But I do want to say VIP has been a very, very, very special part of the community, of the city, of the history of'",
        "'speaker_0': 'not only Long Beach, but of California as well. It's a unique landmark. It's one of a kind. And I think we all know if we would do what's in our hearts to make it a historic landmark for the world, not just for the city, but for the whole world.'",
        "'speaker_0': 'And like we said, for the youth and an up and coming generation. I would like to give my votes for because without the VIP, I would have missed a lot of opportunities as well. You know, so we all have personal stories that we can tie to the VIP and.'",
        "'speaker_0': 'I just want to give my thanks for the brother, for standing there for so long through the ups and downs and not giving up and not giving given out and not turning his back on the community and for always helping and accepting us.'",
        "'speaker_0': 'And so with that, I truly thank you. And for those who don't have anything to give for Christmas, please come down to the shop. We got great items. We got good clothes, all sizes. Come get them for the Lord.'",
        "'speaker_0': 'Thank you very much. Thank you. Next speaker, please. Good evening, Mayor Garcia. Councilman D'Angelo and the council. I just want to commend you guys for listening to the sixth District for PAP record. I commend you for that. I didn't see too many people on a cell phone in the council meeting as we were speaking, but I think'",
        "'speaker_0': 'you guys were hearing out VIP records. And I'm looking for for Councilman De Andrew and the mayor of Lowndes to continue to make this process, be a process and find a home for the sign of VIP records. I spoke with De Andrew earlier and he has our support to help VIP find a place for the amendment.'",
        "'speaker_0': 'And Councilman Garcia, I heard that you have been a very supportive in this and we as the sixth District will look forward to complete this process. And I thank you guys for hearing out all the different views that we had because we are different culture and people have different thoughts, but we all are one people and tell'",
        "'speaker_0': 'the innocent how, bring us all together. And I just want to thank the councilmen and the mayor and the Andrew for your support. And we're looking forward for your continued support. And by the way, I'm sorry, my name is Michael Baker.'",
        "'speaker_0': 'I own a barbershop next to Kelly Anderson. Mr. Baker Southcenter mayor, we met before. I don't know if you remember, but we really appreciate all the things that you have done for Sixth District. And may God continue to bless all of us.'",
        "'speaker_0': 'Thank you, sir. You know, the last bit askew. The mayor. I'm sorry. Have you got one quick thing that I want to say before Sherry speak, and that is the ACMA. 2015, I placed a sign up on eBay.'",
        "'speaker_0': 'I was burnt out. I was tired. I was alone. I'm like, you know, I can't go any further and stuff. So I actually took a stand off of eBay to look at some other possibilities and stuff, so I buy me a year.'",
        "'speaker_0': 'The idea of open a black music museum came to mind. So I'm like, okay, well, I need to sell design if I'm gonna try to open a museum. So near the end of the year, I'm like, Man, how do I get this done?'",
        "'speaker_0': 'Because in order for me to get this done, I need a relationship with the city of Long Beach. And he needed things, did you know, to help make this happen? Well, I would say around October, a friend of mine came back into my life that I hadn't seen in like 20 some years.'",
        "'speaker_0': 'And she said that she had been thinking about me. She'd been kind of reading things that was going on with me. So she came back and I sit down and I presented to her what I was trying to do or would like to do.'",
        "'speaker_0': 'And she said, Those things can happen. And I'm saying this, sorry, I love you. You really took this dream. And it's almost to make it a reality. I mean, I never couldn't have gotten this far without you. You're hard work, man.'",
        "'speaker_0': 'I don't know what else to say, but I had to get up here on record to make sure that I left. Not only. You guys, but everyone in here know how hard she have worked to make this dream a reality.'",
        "'speaker_0': 'So I had to say that.'",
        "'speaker_3': 'Good evening. I feel like I know you guys. I really do feel like your family. Even though we bump heads, we disagree on some things. Equity. It's important. And I don't want to talk about the past. I'm not here to convince you to make it a historic landmark.'",
        "'speaker_3': 'It's an important resource. And I know you're going to do the right thing. But what we want is for this moment not to be symbolic. We want this moment to be utilized to rebuild our communities. We want jobs.'",
        "'speaker_3': 'We want to bridge the gap in technology. We want to deal with mental health issues in our communities. We want to bring creativity in our communities. And we want to make sure that when there's a place down the street that's only a mile away, where there's only 3% poverty in kids and there's millions of dollars spent.'",
        "'speaker_3': 'We want our communities where there's 50% poverty in the sixth District among youth to be invested in the same way in historic landmark. I've had so many comments online. Why would the mayor throw away $80,000? Why would the city council do that?'",
        "'speaker_3': 'Help a private business? You didn't. You secured a historic landmark for the city of Long Beach that will bring your property values up in the area that it's in, 15 to 20%. You're securing a historic landmark that's going to bring millions of dollars in tourism into the city.'",
        "'speaker_3': 'And we're not looking for handouts, but we're looking for partnerships. And we're looking for the city to invest in what Calvin Anderson and Cletus Anderson laid down for us as a foundation. It's one that works. And so when we sit down and we meet and like, God bless you, vice Mayor, for the work you're doing with youth'",
        "'speaker_3': ', because you have been showing up for everything we ask you for. Councilman Pierce, you are an amazing supporter. Thank you. From the bottom of my heart, Councilman Austin. You've been wonderful since we've opened up the small space in your community and you're very supportive.'",
        "'speaker_3': 'And and Mayor, you know, we have a we have something special. But I want us not to focus on. This the missteps of the past and limit our relationship for the future. It's really important for this sign not to be anchored as a monument thrown up somewhere that that's not what's going to happen.'",
        "'speaker_3': 'Guys, we have put together a plan to the city. We have put together a plan. And we have our eye on where that science should go. And that's on MLK and Pacific on that empty property where history was built.'",
        "'speaker_3': 'We should not have to bid. Right now, we're in a bidding process on this property. And I encourage the city attorney Pat or city manager Pat West and the city attorneys and the city council to work together to find how we can legally build our museum and multimedia center on that land.'",
        "'speaker_3': 'We should not have to run the race with everyone else. We should not have to be competing with developers outside of our city. When this man built that corner, it's not going to happen. But what I can tell you is that we're committed to help you raise the money, bring in the celebrity, bring in the investments, and'",
        "'speaker_3': 'rebuild the sixth District to reflect African American history where people can thrive again. This is it's not a sign. It's hope. It anchored hope when children had nowhere to go. It anchored hope. And that hope is not gone.'",
        "'speaker_3': 'And so what's really important, many have asked us. Right, Pops? How come you guys don't just take the sign and go downtown and open up a cool place and it's fun and you've got performances and music and all that is still.'",
        "'speaker_3': 'You're making it too complicated, they tell us. But if we abandon the community that built us. That's not what should happen. And so today is a beautiful day. But it's a bittersweet moment because 711 and the same week as this becomes a historic landmark, will be moving into the origin or opening up their celebration party this week'",
        "'speaker_3': 'to a Japanese corporation and a 40 year old African American historic spot. When this sign finds a home, it will become a point of interest. It's really important for us council members to understand the value that brings to the city.'",
        "'speaker_3': 'It would be the only one of its kind west of Mississippi. It would put it on the global maps and it will bring in investments and funds. We just want you to work with us the way you work with other communities.'",
        "'speaker_3': 'And so that Domino and all of the other artists and all of that can come back and invest their time in the facilities we build, in the multimedia centers we build. And so we want to thank you, and I really do appreciate you.'",
        "'speaker_3': 'But I'm an advocate and advocates are like doctors. You don't ever go to them when you're feeling well. Right. And so it gets a little bit uncomfortable sometimes when someone's fighting for equity, it gets a little bit uncomfortable.'",
        "'speaker_3': 'But we're here to work with you. Hand in glove equity has to be a plan and not something we fight for on a day to day basis. And so that's why it's important that the economic blueprints that we create of equality somehow have to work with the land use plan that has no equality, no equity clauses in'",
        "'speaker_3': 'it. We have to be smart in our planning right now, guys, before we get to 2040. I love our development and our growth, but if we have an amazing blueprint that says inclusion and then we have a plan that builds, that does not create a part for inclusion, we're going to continue to battle each other, and that's'",
        "'speaker_3': 'not where we want to be. So I appreciate you. I really thank you from the bottom of my heart. And I hope that we can create spaces in all your districts. Really, the opportunities that have been coming in are amazing.'",
        "'speaker_3': 'But I just ask you that when you look at VIP records, you look at something that is a benefit to the community, our resources, our growth, our kids and to help us invest. So I appreciate you. Thank you for honoring Pops, Calvin and Clearest Anderson and the Anderson family.'",
        "'speaker_3': 'And I hope we can continue to build from here. So thank you, Mayor. And to people, honestly, that have stuck with me, Chrysler, Batman has honestly held me through some really tough times. We have an incredible head of our economic development department, guys, that really believes in inclusion.'",
        "'speaker_3': 'He puts his money where his mouth is, his work, where his mouth is, and it makes us feel hopeful and a mark. Taylor, thank you so much. And Christopher Coons, thank you.'",
        "'speaker_0': 'Thank you very much. Thank you. So appreciate that. That concludes public comment. We're going to go now back to the council. There is in motion in a second on the floor to move forward with the designation. Councilman Andrews.'",
        "'speaker_0': 'Yes. Thank you, ma'am. First of all, before I get started here, you know that it seems like we we shouldn't even be talking about the VIP side. We should be talking about Kevin, because this young man here, his compassion and sympathy, what he's done for the sixth District and for the VIP.'",
        "'speaker_0': 'You guys here, I've been here, I think, longer than most of the individuals, 70 some years. And I've blacks have come and go. But I think Kevin's about the only black business that we still almost have opening now.'",
        "'speaker_0': 'There's a lot of things I think we can do. I think one of the biggest mistakes we made there is we didn't buy the building. We tried trying to deal with a lot. And I hear the young lady talk about across the street, you have to deal with that.'",
        "'speaker_0': 'I understand that. But there was a building already there. Kevin started there, and that's where Kevin should be. So there's some things that we should take under consideration. When I gave my $80,000, it wasn't because of the fact that I felt like I was just giving money away.'",
        "'speaker_0': 'I knew what it was for. And I hope that some of my other constituents up here will be saying great things about VIP. But sometimes I want you to put your money where your mouth is. So when we finish all of this, I'm hoping that Mr. Kevin and his family and the people here in the city of'",
        "'speaker_0': 'Long Beach. First time ever since I've been here for 11 years and that this many African-Americans come out and speak on any issue. So this kind of tells me something. When you get riled up about something, you will come out and you will speak about it.'",
        "'speaker_0': 'You will talk about it. And some of the speakers I heard tonight, if I had and that I would give all my money to you, Kevin, because when they finish, but it's just the idea that we have something that should be a historical monument.'",
        "'speaker_0': 'It shouldn't. That should be a no brainer. But then the thing about it, where are we going to put it? Put it where it started. I mean, these are some things that we really should take into consideration. And I want to thank everybody who came out tonight and showed their compassion and consideration, especially for a young man'",
        "'speaker_0': 'who started it. And Kevin, I don't think you want to leave it to him with it just up in the air somewhere. We don't put it off in a corner. It has to be more than that. And I'm praying that we can get behind that and raise enough money where we can, you know, really show the honor'",
        "'speaker_0': 'and privilege that this young that this sign means to all of us. And I'm sure Snoop right now is looking and doing his little rap song about it. We're going to get some of his money, too, but we've got to get this thing right.'",
        "'speaker_0': 'Thank you very much, everyone. Yes. Thank you, Councilman. Next up is Councilman Austin to be the second.'",
        "'speaker_6': 'All right. Thank you.'",
        "'speaker_0': 'And I appreciate those comments.'",
        "'speaker_6': 'Councilman Andrews, I want to thank Mr. Anderson for being a real pillar in our community. A father figure, a mentor, a black business leader, and inspiring so many in this great city and beyond. You are a real example of being your brother's keeper.'",
        "'speaker_6': 'And so we appreciate you very, very much. Thank you. And to the community. To all of the speakers. I don't think a whole lot needs to even be said behind Israel because you guys said it all. I appreciate and I share your passion for this design.'",
        "'speaker_6': 'This is an easy call for me as a council member. Who am I? What's my name? That video put Long Beach on the map in the hip hop genre, which is now international. It's a classic that made me snoop in VIP in Epic, Epic and worldwide.'",
        "'speaker_6': 'VIP serves as a community art space for so many youth over the years, and they work on there as they worked on their craft. And our city would be better off, I think, if we had more VIP records across the city.'",
        "'speaker_6': 'I would I would welcome one in my community. I was a young 20 something year old aircraft worker, Long Beach City College student, when I moved here to Long Beach. Many of my coworkers had roots in the east side of Long Beach.'",
        "'speaker_6': 'This east side of Long Beach. Not that. No, no. To my council members, I used to get I used to get all of my new releases, their mixtapes, VIP records. Usually after getting a fresh cut from Bobby Neill's, which preceded Mr. Baker will go to PPG Fish Market.'",
        "'speaker_6': 'Get my buying pies from Marcus. Yeah. Oh, and we ran many, many campaigns out of that shopping center. And Calvin was was part of many of the VIP, was always the anchor space in that shopping center. I think the sign is perfectly good where it's at right now.'",
        "'speaker_6': 'I always felt at home in every part of the city, but the sixth district is always going to have a special place in my heart. My wife, Daysha, who's upstairs? Hello. Jason and I and our sons have made many great memories in their community there.'",
        "'speaker_6': 'We continue to do so as Polly family as well as long as patriotism and our involvement in that. Tonight, we are here to honor and we honor you. Calvin Anderson is an entrepreneur and creating an era of pride for our city through your business efforts.'",
        "'speaker_6': 'This VIP record sign has been it is an iconic centerpoint in our community, and I'm heartened to know that tonight will be making it a historic landmark. I'll be strongly supporting the recommendation of the Cultural Heritage Committee Commission and voting in the affirmative.'",
        "'speaker_6': 'But also, you have my commitment to to work with you moving forward to make sure that we preserve the history that we built. Thank you.'",
        "'speaker_0': 'Thank you very much, Councilman. Vice Mayor Richardson, thank you so quickly. I just wanted to chime in and just say that, frankly, I'm just honored to be a part of the city council that gets to take this vote tonight and really reflect and represent what you are the community of articulate so well tonight.'",
        "'speaker_0': 'So I'm really honored to take that step. I do want to acknowledge that you've done a great job. So so Calvin Shaw ran the whole team, the community in articulating your stories. And that's what's required to make sure, like our shirts as equity, to make sure that we can make a case for why our communities are diverse'",
        "'speaker_0': ', culturally diverse communities matter. I was astounded. You know, I mean, this this conversation has really elevated the broader conversation in our city around sort of the relevancy of our culture, heritage process and and whether or not we as a city of our historical landmarks, if if our cultural representation is really reflective of the diversity we're really proud'",
        "'speaker_0': 'of. And so you have really elevated that issue. You've done your part. Now it's on US policymakers to make sure we address the system that was put in place for why we have that lack of diversity. So it doesn't stop with this landmark process tonight.'",
        "'speaker_0': 'We have to make sure that we continue to acknowledge and demand that all communities, no matter your background, you have a significant history that's relevant and it's important and it needs to be recognized by our city. Finally, I just want to give a big shout out to the Andrew's the.'",
        "'speaker_0': 'I got to tell you, when sometimes it's difficult to articulate something that's important to you in your community, to others, and you've stepped up, put together the funding to make all of this possible. And so I do want to recognize you for doing that and say that I support I support your leadership.'",
        "'speaker_0': 'I support the community. I'm going to vote in support of this tonight. And I want to see. I want to see where this all lands. I want to make sure that we do keep the presence of Bishop Long Beach in central Long Beach, where it where it started.'",
        "'speaker_0': 'Thank you. Thank you, Vice Mayor Council Member Pearce.'",
        "'speaker_2': 'Yes, I am also extremely honored to be on the council that gets to name this as a historical landmark. The first time this came to council, I shared a lot about my background and some of you guys probably heard I won't share it all again today.'",
        "'speaker_2': 'But you know, when Snoop said, I take Long Beach or I took Long Beach everywhere I went. Growing up in Houston, in the neighborhood I grew up in, hip hop and rap was a core part of of me.'",
        "'speaker_2': 'Even though the majority of the folks didn't look like me, I still grew up poor and grew up where those stories were relevant for me. And so coming along, this was the first place I drove by. The very first time we moved to California and we took our drive up PCH.'",
        "'speaker_2': 'We said, we got to stop and see. And I you know, Sharon has been an amazing advocate. And I think the comments that she makes, it gets uncomfortable when people fight for equity is so core to where we are on this council, to where we are in history right now, and how proud I am of you all'",
        "'speaker_2': 'fighting and demanding that equity and working with councilmembers like Councilmember de Andrews, who has always fought for equity. And sometimes we need community members as a partner to work with to be able to get there while we have a vision in our heart and we know where we want to go.'",
        "'speaker_2': 'We can't do it alone unless you guys are out there fighting with us. And you were here tonight. And so and I'm saying I agree this comment, this is the beginning of where we're going. This is the beginning of a partnership with the rest of the colleagues, with the mayor.'",
        "'speaker_2': 'And again, I do want to shout out to John, our economic development director. I've worked on him on a couple of items around equity and just he's always so great about having that conversation define what that word means for me.'",
        "'speaker_2': 'What does that look like? And process. We're growing as a city and we're growing as a city because you guys put your hearts out there and every single one of you, Calvin, you obviously are a mentor so much.'",
        "'speaker_2': 'And as my colleague said, My Brother's Keeper and I think about that lately I've been doing this thing where I'm like, how do I get my good karma, right? So it's like I'm paying other people's meters and everything and it's just having that warmth that you guys have.'",
        "'speaker_2': 'You feel like a family and you bring that in here and it feels so warm and so loving. And I just want to thank you for sharing your stories with us. I look forward to working together. I know you guys have your heart set on a place and whatever we can do, we will do that.'",
        "'speaker_2': 'And I've also talked about how do we go and bring other folks to this partnership? While you guys have put Long Beach on the map for music, we also have another other communities that have music. And so how do we do this together will be, say, all of us can celebrate our diversity and Long Beach together.'",
        "'speaker_2': 'You know, you've got indie artists that love hip hop and vice versa. We all take from everybody's art and craft. And so I'm really looking forward to what this means for the next steps for Long Beach. We'll just thank you all for putting yourself out there.'",
        "'speaker_2': 'Appreciate it.'",
        "'speaker_0': 'Thank you. Councilmember Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. I, too, want to say I hope everyone will support and I think we're getting there. Absolutely. And I want to say congratulations for all of the work that each of you have done, Calvin, Cletus, your whole family.'",
        "'speaker_2': 'Shereen Your words were just absolutely beautiful for a councilmember like myself who grew up in my younger years in North Long Beach and then going to Cal State and then becoming a council member. And I think when I was very first elected, I went into the store and talked to Calvin and just learned the history because that'",
        "'speaker_2': 'was the first thing is like when you become elected, you have to understand not what's going to be happening next, but where we've come from and what the history is. And I was so glad to have that chance to speak with you directly and just have a moment with you about a couple of t shirts about my'",
        "'speaker_2': 'records I had my first record player had to get them at VIP, but just like my council colleagues had mentioned, this is just the beginning. I know that the landmark is one thing, but the beginning means that I see you becoming really a fixture of mentor mentorship with a lot of entrepreneurs that are coming along that really'",
        "'speaker_2': 'want to know the history, not people that, you know, come in here and kind of fly by night and just go in and go out. But people that have been here and a mainstay for social responsibility and great entrepreneurship.'",
        "'speaker_2': 'So I absolutely see that for you. And I just want to say again, thank you. You have sold our city. A lot of times we go to other regions and we talk about the city of Long Beach and absolutely people bring up VIP.'",
        "'speaker_2': 'And it's a source of pride I know for myself. And it will continue to be so. Thank you so much again.'",
        "'speaker_0': 'I think you killed two women, Price.'",
        "'speaker_2': 'Thank you. I want to echo the comments of my colleagues. And I have to tell you guys.'",
        "'speaker_3': 'That those of you who spoke tonight, some of the most.'",
        "'speaker_2': 'Eloquent words I have ever heard being on this council and spoken with sincerity, authenticity and so much respect, respect for the person you see as a mentor. Respect for each other.'",
        "'speaker_3': 'Respect for us as a council.'",
        "'speaker_2': 'We don't always see that. And I have to tell you, it made me want to just stop and listen to everything you were saying, because it was just from a place of goodness and from a place of passion.'",
        "'speaker_2': 'But understanding.'",
        "'speaker_3': 'Your.'",
        "'speaker_2': 'Audience and understanding how important it is to convey your experience in such a positive way, it really, really was impactful for me, I think, to the Anderson Brothers. I learned a lot tonight from hearing from everyone speak. And I don't know if this is true.'",
        "'speaker_3': 'You guys have.'",
        "'speaker_2': 'To tell me if this is true or not. But I get the sense that, Calvin, that you're a very humble person.'",
        "'speaker_3': 'And that you help people. But it's not for you. It's not about getting credit.'",
        "'speaker_2': 'It's not about making sure that everyone knows.'",
        "'speaker_3': 'That you did something. It really is about.'",
        "'speaker_2': 'Is that right? Am I. Is that him? Yeah. It's about really making a difference. And it sounds like what he cares about most is not himself, not promoting himself. It's about every single one of you who got opportunities I love.'",
        "'speaker_2': 'I forgot your name, sir.'",
        "'speaker_3': 'What? The guy was trying to sell us the beautiful shirt right there. Yeah, yeah, yeah. Your words were really.'",
        "'speaker_2': 'Really beautiful in my in my day job. I'm a prosecutor, and I always look at folks who give people a second chance, give them a chance to learn the lessons and do the right thing. And people like Calvin are really hard to come by.'",
        "'speaker_2': 'I don't see them very often, and I respect that on such a deep level. So obviously that agenda item tonight, it's it's a no brainer. But to me, I feel like this was such an eye opening experience for me.'",
        "'speaker_2': 'I learned so much that I didn't know and I'm so.'",
        "'speaker_3': 'Grateful that there are people like you here. Frankly, I'd love to have people like you all around my community too.'",
        "'speaker_2': 'Because when we talk about struggles, every community has got some sort of struggle or stress or something that they need mentorship with to make sure that they make good choices. And I'm so grateful that you guys came here tonight.'",
        "'speaker_2': 'I really feel I was as I was listening to you talk and sharing, you said something about and I say sharing because I'm Persian and that's.'",
        "'speaker_3': 'How we say it.'",
        "'speaker_2': 'But you said something that I loved, which was, you know, we may butt heads, but we are family. And you consider that family? And I you know, I'm one of those people who really believes we have to respect one another in that situation.'",
        "'speaker_2': 'And so I you guys taught me a lot as you were talking, I was thinking to myself.'",
        "'speaker_3': 'I'm so glad.'",
        "'speaker_2': 'I like Vice Mayor Richardson was saying, I'm so glad I'm able to be a part of this. It really is one of those memorable moments because Councilman Andrews hit it right on the on the head. We don't have a lot of African-American speakers come to council to speak.'",
        "'speaker_2': 'And when and tonight to me.'",
        "'speaker_3': 'Said a.'",
        "'speaker_2': 'Lot to me about who you are, what you think about your community, the level of respect you have for the system. Thank you. Thank you for that. And Councilman Andrews, you are. You are Calvin Anderson. You know that, right?'",
        "'speaker_3': 'You're one of those people who does so much good for your community and you never are promoting.'",
        "'speaker_2': 'Yourself.'",
        "'speaker_3': 'Ever. He is. The man is just a class act. He does it.'",
        "'speaker_2': 'Because it's the right thing to do. He fights for jobs. He fights for opportunity. He fights for his.'",
        "'speaker_3': 'District, too, to move up and get.'",
        "'speaker_2': 'Advance. And he does it with so much class. To me, I look up to him as a mentor on this council and I thank you guys for honoring and respecting that because he deserved that tonight. So thanks for bringing asylum.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Mongo.'",
        "'speaker_2': 'When I entered the chambers tonight among you, I saw a mentor of mine. And so I got to sit in the crowd tonight with him and feel your passion and pride as each of you got in line to speak.'",
        "'speaker_2': 'And we kind of chatted about some of your stories and the things that are going on in each of your lives and the mission and vision that you've had for VIP records. And it's fine. And during your speaking, I came up with three words, and I think these are three words that a lot of people could learn'",
        "'speaker_2': 'a lot from your testimony here today. And that is.'",
        "'speaker_3': 'You came to the table with solutions. You always have. You come to the table with hope and you always offer sweat equity. It's not a donation of $80,000. It's an investment.'",
        "'speaker_2': 'And I appreciate that. In your discussions and dialog, you talked a lot about what the city's meant to you, and that's really identifiable, but also thanking those that have worked with you along the way. And so I'll also give some credit not only to our own Councilmember Dee Andrews, but our economic development team that works full time'",
        "'speaker_2': 'to make sure these things become a reality. And so for that, I, of course, am 100%. Yes.'",
        "'speaker_0': 'Thank you. Remember your anger. Thank you, Mayor. You know, I can't remember a day ever driving down PCH.'",
        "'speaker_7': 'And not seeing that site.'",
        "'speaker_0': 'That I can't remember that ever. It is a little bittersweet today because we're talking about a sign, but we're talking about a lot more than that when we talk about.'",
        "'speaker_7': 'The owner of the store and the meaning of Long Beach and the meaning that it has that it carries for central Long.'",
        "'speaker_0': 'Beach. I was a community college trustee at City College, and I go down a lot on my way to the PCC campus and I would always see it.'",
        "'speaker_7': 'And they'd always be some cooking out there.'",
        "'speaker_0': 'Some kind of barbecue going on and smoke. And it it brings back some fond memories. And my hope is that it stays on PCH somewhere, preferably there. That's going to be the struggle. That's going to be the challenge.'",
        "'speaker_7': 'But that would be my hope and my dream to keep it where it's at. And I would be 100% on this. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Super. Thank you. I, too, will be supporting this item tonight. And I'd like to thank everyone for being here tonight and speaking and in special thanks to the Andrews. I think the Andrews and I are probably the only ones are old enough to remember when the sign was originally erected and part of a kind'",
        "'speaker_0': 'of a mini urban renewal on the PCH quarter back in the day. And two things I'm very struck by. Number one, that anything in Long Beach has lasted that long. We're real good at tearing things down, but we need to preserve a lot of our historical items such as this.'",
        "'speaker_0': 'The second thing that struck me tonight was the statement that worldwide we're known for two things the VIP sign and the Queen Mary. Now, staff, as I recall, I think the city has spent upwards over $200 million on the Queen Mary.'",
        "'speaker_0': 'So when you look at it, I think the VIP sign might be the biggest PR bargain the city has ever had.'",
        "'speaker_9': 'Thank you very. Thank you.'",
        "'speaker_0': 'Thank you again. I think to to the power of of of the moment and the importance of the item. And we we really have everyone speak on an item, but everyone wanted to to give the remarks and some of that.'",
        "'speaker_0': 'I'm going to close. And before we vote, let me let me just say just, of course, to Mr. Anderson, but really to that just to the Anderson family. I know there's a lot of folks here, so thank you for your service to Long Beach.'",
        "'speaker_0': 'I've told you this before. I'll continue to say it tonight and whenever I can. I think that it's really important that tonight we we designate this an important historic landmark for the city. But it's really about honoring you and honoring your family.'",
        "'speaker_0': 'And I think that just want to make sure that we don't miss that as part of of the moment. Clearly, your devotion as a black business owner, as a family that brought so many people in during difficult times in our city's modern history, whether it was some of the photos that we saw, we remember what happened during'",
        "'speaker_0': 'the riots and during other difficult times in in Long Beach is history. But really, the region's history of VIP has been such an important part of that. I also want to say I, I always say this. I like to and it brings me back to my younger days.'",
        "'speaker_0': 'But I say the first the first record I ever bought with Doggystyle by Snoop Dogg. I listen to it nonstop. I can still recite probably almost every lyric from the album. I love hip hop, I love the history and VIP's, an important part of of that history.'",
        "'speaker_0': 'I also think it's really important and it's something that that Mr. Anderson said, which I think is really important and something that's been repeated a few times. It should not be lost on us that we have so few historical landmarks that honor, first and foremost, the black experience and black Americans in Long Beach, because regardless of of'",
        "'speaker_0': 'other communities, whether it's the Latino community or the LGBTQ community or others, the black history goes back extensively and has been a huge part of the development of Long Beach. And if you look at. Recent histories that have been written about Long Beach.'",
        "'speaker_0': 'And there are some there is absolutely a lack of coverage of the black experience and and what the African-American community contributed to the growth of the city from business creation, from the development of our school system, from the civil rights movement.'",
        "'speaker_0': 'There's so many black leaders that were involved in the civil rights movement. And so you're starting to see, particularly in the last few years, a recognition, long overdue of the contribution of black Americans in Long Beach. And you're seeing it finally in some of the naming of our schools in the what's happening tonight and in other ways'",
        "'speaker_0': ', which I think are really important. And so I would just challenge us as a city. And I'm also speaking to the staff from Mr. West on down. I would challenge us as a city that we have to do a much better job of recognizing and honoring the black experience in Long Beach.'",
        "'speaker_0': 'And also just just to conclude, I'll say that I think we've you've heard loud and clear that this this council, every single one is very supportive of this. But also, I think you've heard that we're also very supportive of what VIP means and what's the next step, because we know today closes each a chapter on the restoration'",
        "'speaker_0': 'side. But we're very aware that there is much more to do and much more and other ways that we will recognize the Anderson legacy and the VIP legacy in Long Beach. And we're all I know I am and others are very interested in that.'",
        "'speaker_0': 'I do want to say first, Councilman Andrews, thank you so much for your leadership and support. You and I have had many conversations about this, and I just want to thank you for we wouldn't be here without your support.'",
        "'speaker_0': 'I want to thank Sharon. Listen, your you hustle and you did a great job of of inserting yourself sometimes in uncomfortable moments by inserting yourself to ensure that people listened and and took this process seriously. And I want to just personally thank you for that.'",
        "'speaker_0': 'I think I thank you for the friendship that we have built. But thank you for pushing the city, especially our staff team, to really understand how important culturally this is. Not just beyond just being a sign, this is a culturally important experience.'",
        "'speaker_0': 'And I want to thank you for that. And then lastly, just all the folks that are here. Thank you for coming out, speaking out. This is an important moment for all of you, for the black community, for hip hop, for VIP, for the Anderson family.'",
        "'speaker_0': 'And you have my commitment and I know you have the staff's commitment to really continue doing this kind of work. And again. Mr. Andrews, thank you. Yes. And in closing. Sure. Go ahead. Yes, in closing, I just want to say, I want to thank all of my people coming out tonight and really showing, you know, respect and'",
        "'speaker_0': 'dignity. But we really was very important. And even to be able to have Mr. Pay, you know, when you can keep him in line. You guys did a great job. I just want to let you know and thank you very much, every one of you coming out tonight.'",
        "'speaker_0': 'Again, thank you. Thank you. Let's go ahead and take a vote, please. I understand.'",
        "'speaker_3': 'Motion case.'",
        "'speaker_0': 'Congratulations. Thank you. Thank you. Thank you all for being here. Thank you. Okay. Thank you all. We're going to continue with the rest of the agenda. Thank you all for for coming out. I do have the consent calendar in front of us.'"
    ],
    "Recommendation to adopt resolution authorizing the submission of an application to the California State Department of Housing and Community Development for up to $18,000,000 in loan and grant funds available through the Affordable Housing and Sustainable Communities Program; and, authorize City Manager, or designee, to execute all documents and agreements necessary to apply for and utilize these funds for the construction of the Las Ventanas affordable housing project proposed for development at 1795 Long Beach Boulevard.  \n(District 1)": [
        "'speaker_0': 'We're going to record the vote for the consent motion carries unanimously. Thank you. And we're going to move on to the regular agenda. Item 14, I believe, is his next.'",
        "'speaker_1': 'Item 14 is a report from Development Services. Recommendation to adopt resolution authorizing the submission of an application for up to 18 million in loan and grant funds for the construction of the Lars von Tanya's Affordable Housing Project proposed for development at 1795 Long Beach Boulevard, District one.'",
        "'speaker_0': 'Thank you, Mr. West. Mr. Vice Mayor.'",
        "'speaker_5': 'Council members. This is a very, very, very exciting project. It accounts approximately $8 million in loan and grant funds that are available for an affordable housing project at a very, very key intersection in the city at PCH in Long Beach Boulevard.'",
        "'speaker_5': 'I'm going to turn this over to our housing bureau manager, Patrick Ouray, and also with assistant Andrew Chang.'",
        "'speaker_0': 'Patrick. Thank you, Pat. Good evening, Mayor. And members of the City Council. The California Strategic Growth Council has released a notice of funding availability for $255 million in affordable housing and Sustainable Communities programs. Sustainable Communities Program Funds or HRC funds.'",
        "'speaker_0': 'The program is funded with the state's.'",
        "'speaker_6': 'Cap and trade auction proceeds. The HCC.'",
        "'speaker_0': 'Program primary objective is to reduce greenhouse gas or GHG emissions by supporting.'",
        "'speaker_6': 'More compact infill development patterns.'",
        "'speaker_0': 'Encouraging active transportation and transit usage, and protecting our agricultural land from sprawl development. Under the HCC program.'",
        "'speaker_6': 'Low interest loans are available for affordable housing developments.'",
        "'speaker_0': 'In addition, grants are available for both infrastructure improvements and transportation amenities related to affordable housing developments. The HHC application guidelines highly.'",
        "'speaker_6': 'Encourage housing developers.'",
        "'speaker_0': 'To apply jointly with local jurisdictions in order to demonstrate the requisite experience.'",
        "'speaker_6': 'In the completion of infrastructure improvements.'",
        "'speaker_0': 'And transportation amenities with items 14 and 15. Staff is seeking the Council's approval to submit joint HSA applications for two affordable housing projects for item 14. The Long Beach Community Investment Company Loan M Cal Multi Housing Inc. $3.7 million to acquire the one acre site located at 1795.'",
        "'speaker_6': 'Long Beach Boulevard.'",
        "'speaker_0': 'The site is located on the southwest corner of Long Beach Boulevard and PCH in Council District one. Directly across from the PCH, blue line.'",
        "'speaker_6': 'Stop. And Carol is proposing the development of last Thomas Apartments.'",
        "'speaker_0': 'A 102 unit mixed use building, serving 86 extremely low to very low income families and 15 households experiencing homelessness. In addition, this five story.'",
        "'speaker_6': 'Building will include.'",
        "'speaker_0': '4000 square feet of ground floor commercial space, an 1100 square foot plaza area located on the corner of Long Beach Boulevard and PCH. Over 8000 square feet of common open space for residents supportive service space.'",
        "'speaker_6': 'A computer room, laundry facilities, a large community room with a kitchen, a hot lot, barbecue area and bicycle storage.'",
        "'speaker_0': 'If this item is approved tonight, AM call on the city will apply for a up to $18 million in funding for the development of the project.'",
        "'speaker_6': 'And related infrastructure improvements.'",
        "'speaker_0': 'If the application is successful, loan funds of up to $12 million will.'",
        "'speaker_6': 'Be awarded to a limited partnership to be.'",
        "'speaker_0': 'Formed by an CAO for the financing of the Mixed Use.'",
        "'speaker_6': 'Housing Project. The loan will.'",
        "'speaker_0': 'Be secured by the property and the.'",
        "'speaker_6': 'Limited partnership will be responsible for.'",
        "'speaker_0': 'The repayment of the loan with.'",
        "'speaker_6': 'Rental revenue generated by the project.'",
        "'speaker_0': 'In addition, up to $6 million in grant.'",
        "'speaker_6': 'Funds will be awarded to and distributed to the limited partnership for infrastructure improvements and transportation amenities surrounding the project. These improvements include sidewalk repair and widening bike lanes, a new bus, shelter.'",
        "'speaker_0': 'Street trees and pedestrian lighting from Seventh Street.'",
        "'speaker_6': 'To PCH on both sides of Long Beach Boulevard and other pedestrian.'",
        "'speaker_0': 'Enhancements. The grant funds do not need to be repaid.'",
        "'speaker_6': 'Provided that the project is completed. There are no match funds required from the city and approval.'",
        "'speaker_0': 'Of this item supports the implementation.'",
        "'speaker_6': 'Of housing policy 1.5.'",
        "'speaker_0': 'Which was adopted by the.'",
        "'speaker_6': 'City Council on May 2nd, 2017. That concludes my staff report. Thank you.'",
        "'speaker_0': 'Thank you. Next, we have Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. I just want to say thank you to Patrick and team, as well as the team from Michael, Alex, Benton and Sarah, who worked with my office extensively, as well as with the community to make sure we got this right.'",
        "'speaker_2': 'It's going to be a lovely project. I look forward to that. And we appreciate the work. Thank you.'",
        "'speaker_0': 'But thank you. And is there any public comment on this item? Please come forward.'",
        "'speaker_3': 'Hello, Karen Reside, resident of the First District. And I'm here tonight in behalf of Long Beach Grape Campers. We enthusiastically support this project and are very excited about it. Every day our housing crisis gets worse and any low income and extremely low income projects that we can get going desperately needed in our community.'",
        "'speaker_3': 'So thank you and look forward to the completion of this project as quickly as possible.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Thank you. Shirley Bouchard. I think I believe Mr. Gonzalez, I heard the gentleman say that it would be usable to homeless persons. I'm hoping that I know of at least 20 who are already too. They're just sitting out there.'",
        "'speaker_3': 'No drugs and alcohol. The only problem is that they're homeless. I know of several people who are working, who are homeless, but they're working every day. I'm hoping that that word homeless people will result in visible people so that we can start saving now and letting them know of that address so that they have a visual image'",
        "'speaker_3': 'in their head of possibly where their home will be. So that as this development moves forward. They have a reason to stay in Long Beach and not go to Skid Row. They don't have to be part of the PATH program when in fact we're providing for them here.'",
        "'speaker_3': 'They don't have to get on the bus with a sandwich and some dollars and end up in Redding, California, or Santa Ana, California, when in fact go Long Beach is saying we can provide for our homeless people here.'",
        "'speaker_3': 'I'm hoping that as we're hearing this, each councilperson, this is a model. Of what Long Beach can do for their homeless people who have been here, some for 1 to 20 years. With varying stories. I'm going to make it part of my daily process in the coming year to follow this with the people that I have been'",
        "'speaker_3': 'feeding on a regular basis and keeping track of and letting them know who to contact in that district regarding this this project. And I'm looking forward to the follow suit of other El UAE projects. That can benefit the homeless.'",
        "'speaker_3': 'They are in each district. They are in every district. And if we just site them in and make them part of the development of corporations who want to build here and who want to profit from Long Beach, letting them know and following up that they have to make part of what they're going to do applicable for not'",
        "'speaker_3': 'the low income, not just the knowing, not the moderate, but no income. No income. They have none. But Long Beach has the funds. To follow this through. For the homeless. Thank you. Thank you very much.'",
        "'speaker_0': 'Thank you. We have an. Was that. I'm sorry. I came in with the conclusion. A public comment. Vice mayor or. Yes. Okay. Or were you just following the list? Or are we done with the comment or are we just following?'",
        "'speaker_0': 'Okay. But we want public comment, correct? Okay. So, Shirley, besides spoke, did our guest you speak as well, a comment.'",
        "'speaker_3': 'You.'",
        "'speaker_0': 'Weren't able to take? I'm sorry about that. Okay. Public comment and it's closed right on 14. Our Councilman Gonzalez just spoke. Then we'll go and cast their votes.'"
    ],
    "Recommendation to adopt resolution authorizing the submission of an application to the California State Department of Housing and Community Development for up to $15,750,000 in loan and grant funds available through the Affordable Housing and Sustainable Communities Program; and, authorize City Manager, or designee, to execute all documents and agreements necessary to apply for and utilize these funds for the construction of The Spark at Midtown affordable housing project proposed for development at 1900-1940 Long Beach Boulevard.  (District 6)": [
        "'speaker_0': 'I thank you so much. Thank you for being here. Mr. John Keisler here. Well, we'll chat with you for a moment. Okay. That concludes public comment. We're now going back to 15.'",
        "'speaker_1': 'Item 15 is report from Development Services recommendation to a resolution authorizing the submission of an application for up to 15 mil million in loan and grant funds for the construction.'",
        "'speaker_3': 'Of the spark at.'",
        "'speaker_1': 'Midtown Affordable Housing Project.'",
        "'speaker_3': 'Proposed for a development.'",
        "'speaker_1': 'At 1900 through 1940 Long Beach Boulevard District six.'",
        "'speaker_0': 'Quote, And this was actually I think we heard about this in the one presentation that was made 5414 There's a motion and a second. Any public comment on this? Yes, Councilman Andrews. Yes. Thank you, Mayor. You know, I'm very excited for this project that we're in and what it will mean to the community in which we live'",
        "'speaker_0': 'in June as well as we know, you know, housing in the city is a citywide challenge and we're short and in supplying and what is available is not affordable. So length is proposed an innovative.'",
        "'speaker_7': 'Development that will.'",
        "'speaker_0': 'Serve the community, though its partnership with the YMCA and others on the site amenities. And I'm very, very happy and I would hope that one day and fast as possible that we can see some sticks in the ground.'",
        "'speaker_0': 'Thank you. And I'll be supporting you in this item. Thank you, Councilman Gonzalez.'",
        "'speaker_2': 'I'm very excited for central Long Beach and for Dee Andrews as well. Good job.'",
        "'speaker_0': 'Great. Thank you. Members to cast their votes to public comment. Public comment. No OC members. Please cast your vote.'",
        "'speaker_3': 'Motion. Carry.'"
    ],
    "Recommendation to declare an interim ordinance adopted as an urgency measure establishing a temporary one hundred and eighty (180) day limitation on the issuance of any permit, entitlement, license, approval, operation, or activity relating to adult use non-medical commercial cannabis activity in the City; and declaring that this ordinance shall take effect immediately, read and adopted as read.  \n(Ordinance No. ORD-17-0030)  (Citywide)": [
        "'speaker_3': 'This motion carries.'",
        "'speaker_0': '21, please.'",
        "'speaker_1': 'Item 21 is communication from the City Attorney. Recommendation to receive supporting documentation into the record. Concluding the ordinance relating to the temporary limitations on the issuance of any permit, entitlement license, approval operations, or any activity related to a don't use non medical, recreational.'",
        "'speaker_3': 'And commercial commercial.'",
        "'speaker_1': 'Cannabis activity in the city. Red adapted as red and laid over to next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_0': 'Thank you. As you mentioned in a second, so any public comment signal, please cast your vote. Mayor, we need two votes on this because it's been adopted as an urgency ordinance as well. First vote.'",
        "'speaker_1': 'Because Andrew's. Bush and Kerry.'",
        "'speaker_0': 'And then the second vote, please. Any public comment saying now please cast your votes.'",
        "'speaker_1': 'We need a mover in second?'",
        "'speaker_6': 'Yep. It's there.'",
        "'speaker_1': 'Councilman Austin Councilmember Mungo motion case.'"
    ]
}