{
    "Recommendation to, subject to review and consideration by the Personnel and Civil Service Committee in accordance with Long Beach Municipal Code Section 2.03,065, confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code; or in the alternative, if for some reason the Personnel and Civil Service Committee does not meet prior to or on September 15, 2020, waive the requirement for consideration and recommendation by the Personnel and Civil Service Committee in accordance with Section 2.03.065, and confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code.": [
        "'speaker_0': 'Thank you. We are going to come back to item one after a couple of items here. We'll be right back to that item. We're going to do it in 29, which is the commissioner appointment, since I know a lot of them are watching the meeting.'",
        "'speaker_0': 'So, Madam Clerk, please.'",
        "'speaker_1': 'Communication for Mayor Garcia. Recommendation to confirm charter commission appointments.'",
        "'speaker_0': 'Thank you. I have a motion by Vice Mayor Andrews and a seconded by Councilmember. You think? And let me go ahead and first Vice Mayor Andrews read the motion and then I will yield over to me and I will go over the commissioner.'",
        "'speaker_0': 'So. Vice Mayor.'",
        "'speaker_4': 'Thank you, Mayor. First of all, I want to thank you for these recommendations. Unfortunately, the Personnel and Civil Service Commission was unable, of course, yesterday, despite our best efforts to coordinate. Therefore, I would like to make a motion to approve these appointments pursuant to Section 2.0310657 letter to also include waivers of the confirmation procedures of the commission'",
        "'speaker_4': 'appointments and get them approved tonight in front of the entire council. I hope I can get a second.'",
        "'speaker_0': 'I think it is a second by Councilmember Ranga Councilmember. I'm going to move on to talk about the members unless you wanted Councilman Durango to add to that.'",
        "'speaker_4': 'A good mayor of clay.'",
        "'speaker_0': 'Okay, great. So let me go ahead and go through our commission appointments. We have a slate of commissioners. So I just want to go and just just talk a little bit about each of them. So let me begin first on our Board of Examiners Appeals and condemnation are we have a Kim Chambers.'",
        "'speaker_0': 'A Kim is a third district resident and a senior program manager with Jacobs Engineering. Really amazing firm. He has more than 20 years of experience in planning and construction and has managed more than 25 projects across the country.'",
        "'speaker_0': 'So just a wonderful addition to that commission. So congratulations to her. Kim Chambers Also on the commission, we have Robert Daughtry. Robert is a fourth district and the operations and project manager of this area, which is the Los Angeles County Business Federation.'",
        "'speaker_0': 'We are all familiar with that organization. He serves on many boards and commissions, including at Whittier College, the Alumni Association, Their Honor PAC and the Cystic Fibrosis Foundation. So I want to congratulate Robert Doherty for the Airport Commission to the Board of Health and Human Services Commission.'",
        "'speaker_0': 'I want to appoint Rebecca Ruiz. Rebecca is a District two resident and is currently a social media specialist at Planned Parenthood for both Orange and San Bernardino Counties. She's also the sexual reproductive health educator for the Community Education and Outreach Department of Planned Parenthood.'",
        "'speaker_0': 'Dr. Michael Cerone or Dr. T, as most of us know him, is also being appointed. Dr. T is, and of course, an M.D. and a CEO and founder of Med. Well, he graduated his residency, USC and is a board certified and is board certified in internal medicine and specializes in geriatrics.'",
        "'speaker_0': 'Dr. Tehrani and his patients know him really well. He's, of course, very involved in the city of Long Beach, also to the Cultural Heritage Commission, or appointing Mary Hynes, married to lifelong resident of Long Beach, lives in District eight.'",
        "'speaker_0': 'She has a deep love for our city. Those that know her know how involved she is in the historical society, the Long Beach Women's Shelter in Rancho Cerritos. A congratulations to Mary and also Mark Bishop. Mark is a District five resident at the CEO of Christopher Architecture, and she's a wonderful architect and actress degree in architecture from'",
        "'speaker_0': 'Pomona, from Cal Poly Pomona. And he's also received numerous awards in residential projects and is a great, a well-respected architect within our community as well. To the Citizens Police Complaint Commission, we're appointing Brett Walmsley Brant as a District nine resident and a teacher as well.'",
        "'speaker_0': 'And Brett has been in a variety of community organizations and has also been a board member of Long Beach Echo and the New Leaders Council. We're also appointing John MATTHEWS. The second John of the District six resident is currently the senior legal counsel for the Justice Collaborative.'",
        "'speaker_0': 'Previously, John served as an assistant United States attorney in Puerto Rico. He has a B.A. in policy and a Spanish minor from the University of Los Angeles and a J.D. from Harvard Law. And also appointing to the IPCC is Nigel Lipsey.'",
        "'speaker_0': 'Nigel, the District two resident and a senior front account with Post Advisory Group in the L.A. region. He also co-founded the Urban Society of Long Beach, an entertainment company that hosts community and social events across the city. He attended Boston University and has a degree in arts and economics to the Citizens Advisory Commission disabilities.'",
        "'speaker_0': 'We're appointing Elsie Areas LLC. He's a senior program development specialist at Children 316, and a current will also provides educational programing, an advocate at a local, state and national level for children with special needs. Since to her and our very own Jennifer Jamar Jennifer is a first district resident.'",
        "'speaker_0': 'She believes that Long Beach should be a place where people can watch your concerns and share their ideas. Our community involvement includes being a board member of the Asian Pacific Islander Board with people with disabilities in California. Vice President of Miss Wheelchair America.'",
        "'speaker_0': 'And Board Member on the Disabled Student Resource Center. Congratulations to Ms. Commissioner on the Economic Development Commission will be appointing Brenda one each. Brenda is a third district resident and has called Miami home for more than 32 years.'",
        "'speaker_0': 'She has been involved in a variety of organizations, particularly, of course, in marketing as a founder of West Coast Marketing, which is a advertising and marketing company and also has had many clients, including Four Seasons Hotel in the Wall Street Journal.'",
        "'speaker_0': 'As part of her broader portfolio network. Also is Vivian Shamir, much of the Economic Development Commission. Many of us know Vivian while she's currently the chief operating officer at Scale Smart Partners. Previously, Vivian served as the regional executive director of the Goldman Sachs 10,000 Small Business Program.'",
        "'speaker_0': 'She's internationally recognized for her work of small businesses and women entrepreneurs. She also served as a US delegate to major conferences across the world to the Homeless Service Advisory Committee. We appointing Desiree Rioux Desiree as a third district resident and has been a clinical therapist for over 25 years.'",
        "'speaker_0': 'She currently works with the salt fruit or the travel social worker. She is also Bishop Long Beach and a member of the Delta Sigma Sigma Theta Sorority Incorporated. Also is Janine Solano, who is a District six resident and is currently a mental health administrator for Star View Community Services.'",
        "'speaker_0': 'She received her B.A. in Psychology and Chicano Latino Studies from Cal State, Long Beach Beach. And lastly, the Homeless Service Advisory Committee were appointed Jeanette Perreira Jeanette of the District two resident and has been a mental health provider with experience working in L.A. County and the Mental Health and Children's Family Court.'",
        "'speaker_0': 'She's been involved in numerous intervention programs around homelessness and assist and assisted families that are struggling with low wages and affordable and unaffordable housing. Being appointed to the Human Relations Commission is Lisette Flores Lisette of the District eight resident and is currently vocations consultant with Estrella PR and Marketing.'",
        "'speaker_0': 'The a computer coursework in Spanish literature and linguistics and has also a B.A. in journalism with an emphasis in PR from Cal State Long Beach. Also to the HRC commission is Jeremy Gonzalez Delaney, the District nine resident, is currently an outreach analyst for the California Department of Insurance, and she received her B.A. in communications.'",
        "'speaker_0': 'Also from Cal State, Long Beach to our Marine Advisory Commission, we are appointing the very well-known Bruce McRae. Our Bruce is a District four resident, and the vice president of State Government Affairs for the Western region of Up's objective force has been involved in almost every organization you could imagine in the city of Long Beach is a'",
        "'speaker_0': 'second generation Long Beach native and is just so well known across the city for his amazing and outsized personality. He's gonna be a great addition to the Marine Advisory Commission. So Long Beach Transit Board of directors, we are appointing Connor.'",
        "'speaker_0': 'Locke. Connor is a fourth District resident and a graduate of Cal State University, Long Beach. Connor currently serves as the Chief of staff to the Mayor and City Council for the City of Costa mesa, where he manages the city of Costa mesa.'",
        "'speaker_0': 'Government relations, including Census Outreach, City Council Liaison Services and City Council event management, and of course is also well known for being involved across the city as well to the Pacific Gateway Workforce Development Board we're appointing. AJ Tesfaye, a desert District seven resident and a senior community development manager at HSBC Bank and is more than 25 years'",
        "'speaker_0': 'of experience in the banking industry. Received a degree in mathematics and economics from Cal State Dominguez Hills. We're also appointing Sandra L.A. Sandra as a District eight resident and team manager with the California Department of Debilitation. She got an MBA and master of science in counseling for marriage, family and child therapy from the University of Phenix.'",
        "'speaker_0': 'And also to that commission is Kenneth Gomez. Kenneth is District two resident and is a deputy division chief for the State of California Employment Department, Employment Development Department, Workforce Services Branch in Compton, California. You've got more than 25 years of the private and public sector experience in H.R..'",
        "'speaker_0': 'And now to our public, it's our Parks and Recreation Commission. We've got three new members. First, we have Rob Livingstone. Robert is a lifelong resident of Long Beach. He was appointed by Ernie Kell to serve on the Municipal Golf Commission back in 1986, when he was 23.'",
        "'speaker_0': 'Robert is also probably best known for his many years of service to US and Long Beach within our Parks Recreation Marine Department as well is very well known, particularly within the golf community and the parks community. So congratulations to Robert will be a great addition.'",
        "'speaker_0': 'Also Casey, Shaun Casey is a District One resident and is currently the marketing event coordinator with Jane, our studios. Casey served on the California Parks and Recreation Society as a representative for Long Beach and Casey as a member of the Junior League of Long Beach and an alumna of Cal State, Long Beach as well.'",
        "'speaker_0': 'And finally to the Parks and Rec Commission is Susan Redfield, who many of us know as well. Susan is a District seven resident and a retired attorney. Her community involvement includes being a Long Beach Public Library Foundation Board member, Assistance League cameo board member involved in so many organizations across the city.'",
        "'speaker_0': 'She received her J.D. from the from the Chicago-Kent College of Law in Chicago with honors and a masters of social work from all university in Chicago. She the Senior Advisory Commission. We have Phyllis Schmidt. Phyllis is the District three resident and special education in Artesia and our teacher, Dominga and Westminster high schools before retiring in the late'",
        "'speaker_0': '1970s. Through the long history of community involvement and volunteerism. Phyllis has been selected to honor the recipients of the Lifetime Achievement Award back in 2015 for the Press Telegram's Amazing Woman program to the Technology and Innovation Commission where appointing Andrea white.'",
        "'speaker_0': 'Andrea White cues and Andrea as a District three resident is called Long Beach Home for the past 15 years. She is the co-founder and CEO and CEO of Extra Vallas, a company that helps technology startup companies. And she received her bachelor's degree in international business from Saint Cloud University.'",
        "'speaker_0': 'To the Water Commission, we're appointing Naomi Rainey Pierson. Naomi, of course, is an award winning educator, philanthropist, huge supporter of Cal State, Long Beach, and her anthropic work and a civil rights advocate and activist has had a huge impact here on thousands of community members, particularly with her incredible work within the ACP.'",
        "'speaker_0': 'She's been, of course, leading the ACP for many years and has been involved in our local chapter here since the age of 14. Naomi is well known for her philanthropic work across the city for her commitment, of course, to racial justice.'",
        "'speaker_0': 'Congratulations to Naomi. And then, of course, there is our series of re appointments, which I won't read each individually, but those are the three appointments to the commission. We know, I know it's a long list, but we wanted to get these folks appointed as soon as possible.'",
        "'speaker_0': 'And so with that, let me go ahead and turn this over to some of the folks that are queued up. We do have a motion and a second. Now on to Councilwoman Zendejas.'",
        "'speaker_2': 'Thank you, Mayor. Thank you very much for that. I just wanted to welcome all the new city commissioners to to this new role. I'm super excited for them. Having served on commissions myself, like Cape Cod Citizens Advisory Commission on Disability and the Board of Directors for Long Beach Transit has it has really helped me along the ways'",
        "'speaker_2': 'and it really gave me an opportunity to give back in my group to my community. So I am very excited for each and every one of our commissioners. And the city of Long Beach is lucky to have you and I look forward to working with each one of you guys.'",
        "'speaker_2': 'So thank you. And congratulations to all of our commissioners also who are being reappointed tonight.'",
        "'speaker_1': 'Maybe a.'",
        "'speaker_0': 'Councilmember. Yeah. Councilmember Pearce. Councilmember Pearce. Okay. I'm a customer and we'll come back to Constable Pearce.'",
        "'speaker_4': 'Thanks. A like. I just like the voice of support. And congratulations and welcome to all our new commissioners. I think this is an excellent lineup of hard working people who are making a difference here in our city and will continue to do so in a new capacity as commissioners, city commissioners in various areas.'",
        "'speaker_4': 'You know, I've also sent a personal congratulations to those who I've worked with for some time also, and obviously extend a special congratulations to those eight district residents who are stepping up to serve. A couple of the commissions obviously have big, big.'",
        "'speaker_4': 'Big responsibilities, and we'll definitely have a lot of work ahead of them, particularly the Citizen Police Complaint Commission. I want to congratulate those those new commissioners. There's going to be obviously a lot of serious work ahead and impactful work ahead for for that group.'",
        "'speaker_4': 'But I just want to, again, congratulate everybody and also say good job on the appointments, Mr. Mayor. Thank you very much.'",
        "'speaker_0': 'Thank you. Council member Vice Mayor Andrews.'",
        "'speaker_4': 'The man being the chair of this committee. I want to congratulate each and every one of you individuals who are selected. And I know you guys know what you're doing because in fact, I know you're going to put all your heart and soul into this.'",
        "'speaker_4': 'So congratulations to each and every one of you.'",
        "'speaker_0': 'Thank you, Vice Mayor, Councilman Ringa.'",
        "'speaker_4': 'Thank you, Mayor. And I also want to offer my appreciation to these individuals who have stepped up to serve on the various commissions. It's how they get the training to know how the city is run. And I really appreciate their civic engagement and help and see me the best it can be.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I want to congratulate all the appointees this evening, especially those living in the third district. I'm grateful for your participation in this process, and many of you have already been very engaged with the city.'",
        "'speaker_2': 'And I want to thank you for your continued participation. And I especially want to call out Naomi Rainey. Naomi is as a friend and a mentor to me, and she recently participated in the Third District Diversity and Inclusion video series that we have and shared with us some very personal experiences to challenge us all, to think about'",
        "'speaker_2': 'the world and those living around us from different perspectives. And so that's just a testament to how she and so many others on the list that was read by the mayor earlier contribute above and beyond being appointed or serving on a commission.'",
        "'speaker_2': 'They just help every day make our community better. So thank you very much and congratulations to all of you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilman. Super now.'",
        "'speaker_3': 'Thank you, Mayor Garcia. Congratulations to all the commissioners. And I just want to give a special shout out to the four from the fourth. So the commissioners McCray, Livingston, Forte and Locke. Thank you for serving and go forth.'",
        "'speaker_0': 'Thank you, Councilmember and Councilman Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I know it's been a while since we've done some of these appointments. Thanks to everyone for their patience and know that some of these coalition seats. Is that vacant for a while, particularly? You know, we've been talking with our newest KPCC commissioner, Brant, about his interest in this in this for a while, it'",
        "'speaker_3': 'was held by our planning commissioner, Johnny Rick's Odeon, when Johnny was the planning commission investigated. And so I'm glad to see this appointment with Brant, also see a number of just great individuals who've done incredible job in the community.'",
        "'speaker_3': 'Already stepping up and serve in a new capacity, I think is a great sign for the leadership that's been developed and cultivated in different non-profits and community groups. Library Foundation. I see a number of folks here that are that I think are just great personalities to bring in.'",
        "'speaker_3': 'So congratulations to all of you. And thanks, Mr. Mayor, for these appointments.'",
        "'speaker_0': 'Thank you, Councilmember. And with that, I don't see any public comment. Madam Court, we can go to a roll call.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two. District two. District three.'",
        "'speaker_2': 'II.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'II.'",
        "'speaker_1': 'District five. District five. I. District six.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District seven. By District eight, District nine. I motion carries.'",
        "'speaker_0': 'Thank you and thank you to everyone. It's one to congratulate all the commissioners. I mean, traditionally we have a big picture with everyone. This is virtual. And also once we are able to get out there again, I look forward to those commission receptions and opportunities to thank everybody in person.'",
        "'speaker_0': 'So just congratulations, everyone that.'",
        "'speaker_4': 'That is certainly. Thank you.'"
    ],
    "Recommendation to request City Manager to expand the open streets initiative by extending parklet and parking lot permits at least until the end of 2020 and work with interested small businesses and business improvement districts to make some of them permanent, including a permanent closure of Pine Avenue from Broadway to 3rd Street.": [
        "'speaker_0': 'We're going to really do an item 20 out this.'",
        "'speaker_1': 'Communication for Mayor Garcia Recommendation to request city manager to expand the Open Streets Initiative by extending parklet and parking lot permits, at least until the end of 2020.'",
        "'speaker_0': 'Thank you. Thank you, madam. So I want to first just thank. The the full council have been incredibly active and involved in this program. Ireland has supported our Open Streets program. It's been a complete lifeline for so many restaurants.'",
        "'speaker_0': 'Our small businesses are hurting, as we all know. And the Open Streets program has really provided a lift to so many workers, so many small business owners that are able to serve their customers and serve their food all across the city.'",
        "'speaker_0': 'We have over 200 parklet and parking lot spaces that have been converted across the community. All over the city. It has been amazing to see. I have personally talked to dozens of these owners and they are they are so excited about about the program.'",
        "'speaker_0': 'We know that the Open Streets program has been a success, as we've seen it modeled across the city, where there's also been a lot that we have learned from the program. There's a lot to learn when you're changing and moving around infrastructure.'",
        "'speaker_0': 'But we know that it's critical for for small business owners. The the recommendation in front of us does a couple of things. The first thing it does is it formally is asking the city manager to extend the open streets permitting program that we have currently in place at least the end of this year.'",
        "'speaker_0': 'So that those that have these these parklets have the certainty that they're going to continue to be able to operate outdoors and they can plan as they go into these next few months. So that's the first thing, is to allow that extension through city management.'",
        "'speaker_0': 'The second piece of this item is to have staff begin to work with the business improvement districts. Obviously, the neighborhoods and certainly I would be with everyone on all the councilmembers within the districts to see which of these parklets or spaces could also become permanent.'",
        "'speaker_0': 'One thing I've heard from a lot of restaurants is they would love to have a permanent parklet that their customers love them. I personally think they're fantastic. They may not work, of course, in every space that they are in currently.'",
        "'speaker_0': 'And certainly there are going to be neighborhood considerations in some of these locations. But we should at least begin a process so that there isn't a permanent process that has to go through. Also, not just a staff process, but also one to ensure that there's going to be safety, that we're meeting all of the kind of drainage'",
        "'speaker_0': 'infrastructure requirements so that if parklets become more complex and possibly permanent, we're also following all of the rules and laws as it relates to traffic mitigation and safety. So but we want to get that started now. So that's the other part of this motion as well.'",
        "'speaker_0': 'And finally, there has been a, I think, rather successful closure on Pine Avenue currently. We'd like to explore to see if that's possible to make that closure permanent. We want to first ask staff to work with the Dolby and the businesses to see if there's interest.'",
        "'speaker_0': 'To gauge that interest and to move forward on a possible permanent closure or an expanded closure of what's currently in place. And so that's another piece of the motion as well. So that's really an exploration of that. And what I'll just add is I think the council has heard and I have I have heard from, you know'",
        "'speaker_0': ', everyone from our of course, our Bixby Knolls folks, folks all across Second Street. I've heard, of course, from our downtown people, folks and and across the city on how how important these spaces have been for for so many restaurants and small business owners.'",
        "'speaker_0': 'A lot of them have submitted letters and comments. And so I wanted to go ahead and and put this in front of us today. And so with that, I want to bring it to the council. We do have a motion and a second on this item.'",
        "'speaker_0': 'So let me begin with the motion is from Vice Mayor Andrews and then the second is by councilman in Doha. So let me turn it over to Vice Mayor Andrews.'",
        "'speaker_4': 'Thank you very much, Vice Mayor, for bringing side forward. You know, in a community like mine where, you know, there's already a struggling, these partners are adding a nice touch, you know, doing the corporate and business owners get excited, you know, when we reach out and offer them help to get it set up with them.'",
        "'speaker_4': 'And most of all, I just want to thank public works. We're really, really doing this and put this process down to a science. Now, so I think this is a great, great you know, Artemis brought forward to us and thank you again.'",
        "'speaker_0': 'Thank you, Vice Mayor Councilman's in Dallas.'",
        "'speaker_2': 'Thank you, Mayor. And I echo Vice Mayor Andrew's comments in regards to what a success it has been. And it's a little positiveness in in all of the the chaos that we've been living in in the past couple of months.'",
        "'speaker_2': 'I, I would also like to say thank you to all the organizations that have been working together with the businesses in my district in particular. Lee is the LPA, which we have been seeing such great success of these open streets on on Pine Street, which is a little bit south of my district.'",
        "'speaker_2': 'And I would like to make a frankly amendment. Vice Mayor, if I could, to also extend the foreclosure to up more on pine through fourth and fifth. There has been a great deal of thought being put into it.'",
        "'speaker_2': 'And I think that right now we also need to focus on giving everybody an opportunity to be able to take advantage of this. So it is. Would you be open to that?'",
        "'speaker_4': 'Yes. Yes, yes. Very much so.'",
        "'speaker_2': 'Thank you. Thank you very much.'",
        "'speaker_0': 'Thank you. And will we support I support that as well. So look forward exploring that. Councilmember Pierce.'",
        "'speaker_2': 'Thank you, Mayor. I definitely support this item. I know that I've talked to lots of businesses that are looking to keep the parklets that they have. I also know that there are areas that have denser business zones like Pine, and I just want to make sure that staff is working really closely with all the businesses, ensuring that'",
        "'speaker_2': 'this really is an expansion of of dining and that we have a good process in place to ensure the safety of all of the patrons to these locations, as well as people that might be passing through. So definitely support that item.'",
        "'speaker_2': 'Love the idea of a permanent closure on Pine, but want to make sure that we do that thoughtfully and that we are including all the stakeholders. So thank you so much.'",
        "'speaker_0': 'Thank you. And Councilman Austin.'",
        "'speaker_4': 'Thank you so much. And I think this is a it's an excellent item. We need to definitely do more to support our businesses, our small businesses, and particularly those who can benefit from this these type of street closures.'",
        "'speaker_4': 'We all know that every business district isn't made the same. But I will just just ask why we have staffs here that that they consider, you know, traffic mitigation efforts to slow down traffic, particularly. I can speak to the Bixby Knolls area.'",
        "'speaker_4': 'You know, many of our small businesses would love to be able to benefit from the the open streets closures and parklets. But as it stands, the traffic is is is too too fast. And so we've also been working with staff to look at areas and efforts and ideas to to slow traffic in and to provide those parklets'",
        "'speaker_4': 'along that business district. And I know that it's very important for our businesses to survive, particularly considering everything that they have endured during this year and this pandemic. And so I certainly support this, but obviously we need we have work to do in some of our business districts to give these businesses the support that this important that'",
        "'speaker_4': 'they need. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Marie Ringa.'",
        "'speaker_4': 'Thank you, Mayor, and I really am supportive of this motion, but I think it's a natural evolution. I think of the way that we conduct business and support our local businesses. So I'm very appreciative of you bringing this forward and making the pioneering avenue section of our city much more appealing.'",
        "'speaker_4': 'I think it'll be a great, great opportunity for people to visit downtown. Thank you.'",
        "'speaker_0': 'Thank you, Katherine Richardson.'",
        "'speaker_3': 'Thank you. So I obviously support this. I just want to elevate that. I think, you know, we're going to a place where we've got to sort of hunker down for the next potentially year as as we don't know the way we know what's going to happen with the pandemic.'",
        "'speaker_3': 'So these are innovative ways to provide, you know, assets and additional tools and a tool toolbox for restaurants and and businesses to be able to, you know, adjust through this transition and be able to survive. So I wholeheartedly support it.'",
        "'speaker_3': 'I think we need to be thinking about what we can do for. I know that certain businesses can move indoors, but some may prefer to stay outdoors, or so we should really just always stay open minded in terms of, you know, barbershops, hair salons, bars, you know, alternative ways for them to be able to conduct business over'",
        "'speaker_3': 'the course of the next year or so. I support this and look forward to seeing this continued, continued implementation.'",
        "'speaker_0': 'Thank you. That concludes council comment. Is there any is there any public comment on this item?'",
        "'speaker_4': 'Yes. First, we have Dave Clark.'",
        "'speaker_6': 'Hello? Can you hear me?'",
        "'speaker_4': 'Yes, we can hear you.'",
        "'speaker_6': 'Hello. Was a written concern. For the record, the conversion of lower pay in a matter of months is an objective reason to love our fair town. The Open Streets Initiative kind of great. It's really. I'm really heartened to see the mayor's initiative here.'",
        "'speaker_6': 'And I agree with many of the points laid out, and especially for remembering what's happened with, as we all know, being better isn't in relation to one's fellow man. In relation to one form of health. I only thing I'd add is that we continue to think about how to localize, localize, localize and kind of, you know, help'",
        "'speaker_3': '. A lot of folks.'",
        "'speaker_6': 'In towns kind of get through the next year and we start thinking holistically about the different types of police types and potentially uses for gathering spaces in a in a more walkable.'",
        "'speaker_3': 'Format. One of the great.'",
        "'speaker_6': 'Things for the assets was that we have or those parking garages on third and fourth off time that we can use not only for solar but for storage, for the insurance value, for a lot of different co-benefits beneficial uses.'",
        "'speaker_6': 'So please keep that in mind. Thank you very much.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Our next speaker is in control.'",
        "'speaker_6': 'Hello.'",
        "'speaker_5': 'I please begin.'",
        "'speaker_2': 'Thank you. This is Sam Cantrell.'",
        "'speaker_6': 'And by giving these extensions into Public Street's name of Parklets, it kind of disguises what is happening. I wonder if the. Public knows that what is going on here is that we are losing all of the parking spaces that were once along the curb.'",
        "'speaker_6': 'We are losing, in some cases, a lane of traffic. In Belmont. Sure. These Parklets extending out into the street. Makes driving very hazardous. If you're driving on a cross street, you cannot see the oncoming traffic because the restaurants are extending out into the streets.'",
        "'speaker_6': 'And I am in favor of helping the restaurants and the businesses, but I don't think this is the way to do it. I think you should close the streets to traffic and provide. An open space on the street and provide parking on the backs of the restaurants.'",
        "'speaker_6': 'I am definitely opposed to making this permanent after the pandemic is over. There should be no reason for the public having to give up their public streets. And especially in Belmont. Sure, the Street Olympic Plaza Drive has been closed off for a private business, a gym, parking spaces have been lost.'",
        "'speaker_6': 'And this is in the coastal zone. It is against coastal law to block access to the beach. So I think there's a lot of things that need to be. Tweet on this. Also, I'm wondering about the loss of revenue from parking meters.'",
        "'speaker_6': 'This was not addressed that I could find. It did say in the staff report that this is going to cost $300,000 through the rest of this year. Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Thank you. Actually, I'm going to go back to the council. Councilman Price.'",
        "'speaker_2': 'Mr. Mayor. So I appreciate this item coming forth, and I also appreciate the mayor's words of prudence in terms of which ones we look at for permanency and all the different factors that we're going to be looking at, including neighborhood impacts.'",
        "'speaker_2': 'And as it relates to some of our parking impacted areas, parking impacts. So what I have committed to Third District residents is that we're it's very premature for us at this juncture to determine which Parklets might want to become permanent and whether that's feasible based on parking impacts and other impacts that may or may not have been'",
        "'speaker_2': 'realized by the residents up until this point. So I look forward to this process. I do. I we have received a lot of great positive feedback on the parklets in the Shaw. There are additional parklets that we have deployed, but really those have never been envisioned to be permanent.'",
        "'speaker_2': 'And the public speaker who just spoke a moment ago referenced one of those those are not ones we envision permanency for, but for those that might be transitioned to more permanent sites, those are ones we'll take a very hard look at parking and other types of impacts to make sure that we mitigate those.'",
        "'speaker_2': 'I just want to take a moment just to thank our public works and traffic engineering team. They've been incredible through this whole process and I'm really so grateful for all of them. April, Paul, Karl. Everybody has just been really wonderful in helping us get the parklet up and running.'",
        "'speaker_2': 'Help us feel questions from business owners and residents and really help us transition in this very unprecedented time and to an offering that we had not envisioned prior to March. So thank you, Mr. Mayor, for bringing this item forward.'",
        "'speaker_2': 'And I look forward to what I've committed to my residents to be a robust process before anything becomes permanent. Thank you.'",
        "'speaker_0': 'Thank you. And with that, I also want to as we conclude just to everyone from our city manager on down through our entire public works team and also our city attorney team who have all actually been working on this issue with our staff and also with all the staffs I know of all your offices.'",
        "'speaker_0': 'Just thank you all. You've been phenomenal partners and I know we have a lot of work to do as we move forward to support more businesses. So let's go out and do a roll call vote and thank you.'",
        "'speaker_1': 'District one. Right. District two, i. District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District eight. District nine.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. And now we will do open public comment, please.'"
    ],
    "Recommendation to adopt resolution expressing its Intent to prioritize spending of the Oil Barrel Production Tax Revenues for Specific Purposes, if approved by voters in the November 3, 2020 General Municipal Election; and \n\nProvide direction to City Manager regarding possible informational/educational materials relating to the ballot measure to be provided to Long Beach residents.  (Citywide)": [
        "'speaker_0': 'Thank you very much. We will now be going on to. Back to the regular agenda and we had item one which was removed from the account.'",
        "'speaker_1': 'Report from city attorney recommendation to adopt a resolution expressing its intent to prioritize spending of the oil barrel production tax revenues for specific purposes if approved by voters in the November 3rd, 2020. General municipal election and provide direction to the city manager regarding possible information.'",
        "'speaker_1': 'Educational materials relating to the ballot measure to be provided to Long Beach residents citywide.'",
        "'speaker_0': 'I'm turned over to staff.'",
        "'speaker_5': 'Mayor and members of the council. Thank you very much. The city attorney, Charlie Bergen. Yes. At the request from the council, we are bringing back the resolution which expresses your intent on how to prioritize the spending of the funds for the item that is placed on the current November ballot.'",
        "'speaker_5': 'And so we bring that back for your review and approval added to this item in the supplemental agenda was it was a second item from the city manager regarding the possible information education materials relating to the ballot measure.'",
        "'speaker_5': 'And we stand ready to answer your questions. Thank you.'",
        "'speaker_0': 'Thank you, Mr. City Attorney. I have a motion and a second to approve by Councilmember Richardson and a second by Councilmember Pierce, counsel for Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Thank you, staff, for bringing this back. Just a reminder for the public back in, I believe it was July, we made a motion to explore this. Then we took steps to place this on the ballot and we said, come back to us in a month, month and a half or so, and and show'",
        "'speaker_3': 'us how you can align this with youth health and climate. I see the resolution. I think it does those things. I also know that the purpose of the resolution is really just to talk about the types of uses of the funds.'",
        "'speaker_3': 'I want to I want to just call out a couple of things here. So so first aunt, where it talks about climate. I want to make sure that both climate justice as well as a sea level rise sort of purposes could be included.'",
        "'speaker_3': 'So offering that is a question. Mr. City Attorney, did you anticipate see sea level rise strategies be included, a potential use here?'",
        "'speaker_4': 'That is correct, yes.'",
        "'speaker_3': 'Okay. And then and then I've heard from Blame the Clean Air Coalition, others that really want to see some emphasis on strategies around climate justice and things like that. Can we include climate justice as well?'",
        "'speaker_5': 'Mayor, members of council Councilman Richard. Yes. This is going to be an annual item, I would assume, for the council discussion to prioritize the climate priorities.'",
        "'speaker_3': 'Right. So I just think it's important that people see these things because, you know, in case they want to go out to the committees and talk about it, things that these things are are reflected here. So I just wanted to call those two things out.'",
        "'speaker_3': 'Secondly, I know that I see that the Climate Action Adaptation Plan is called out here. A number of plans are not. I understand why, but I think it's it's important for us to underscore that we have a number of plans in the city from the My Brother's Keeper plan, youth strategic plan, Community Health Assessment, and they change'",
        "'speaker_3': 'from time to time. But the Climate Action Plan is something that would is supposed to be in place for a very long time. So that's why that is called out specifically. But some of the other strategies are not.'",
        "'speaker_3': 'Mr. MODICA Could you just speak to how you plan to just walk up council through, you know, how you plan to utilize this resolution to make sure that we sort of maintain the intent that we outlined when the council put this for you?'",
        "'speaker_5': 'Certainly. So when we have this original discussion with the council, there were three areas of focus climate change and the environment, community, health and youth services and children and youth services and programs. And so this really is kind of a broad, longer term document you're passing here.'",
        "'speaker_5': 'This tax revenue, if it were approved by voters, is going to be around for a while. So we wanted to make this a living document, one that can adapt with the times. That's part of the reason staff isn't recommending calling out specific programs and plans, because some of those will be done in the short term, we hope'",
        "'speaker_5': ', with implementation. But they're reference here. So when we talk about, you know, youth strategic plans, health focus, strategic plans, all the current effort you're working on right now are we are on your behalf. Those would all be possible fundable items.'",
        "'speaker_5': 'We did call out the Climate Action and Adaptation Plan. That is a planning document that has a long term horizon. So we expect that to be around for a long time. The way this would work is you're not approving specific projects today.'",
        "'speaker_5': 'You were approving buckets and large areas that you want us to focus on. This is still a general fund tax. It's not a specific tax. And so every year during the budget process, we would bring you back through the city manager's proposed budget ways to invest in your priorities that would meet these three priorities, as we have'",
        "'speaker_5': 'done with measure a measure may other taxes that have had similar resolutions of intent and mayor and council all add that this this resolution, as you're all aware, is non-binding. It is it is an expression of ten. And as the city manager indicated, it's meant to be a living document so that it can adjust as your circumstances'",
        "'speaker_5': 'change.'",
        "'speaker_3': 'And I support that. And we know that we've done that in the past. We've held to that. I just think these three points are what's important, given what we've dealt with in the last few weeks in terms of seeing the real impacts of climate, you know, red skies, red sun and a lack of ability to go outside'",
        "'speaker_3': 'and exercise due to air quality, and that that is a direct impact of climate making investments to the climate makes sense. We all are concerned about the youth, the youth across our entire city. So investment calling out the types of uses to invest in our youth is something that makes sense and is strong.'",
        "'speaker_3': 'And we're in the middle of a health pandemic. We're one of three public health agencies in the state, and we know that there's there's always more that we can do to expand health and health equity, particularly in this moment where we're more aware of the way that public health has impacts on our residents across the city.'",
        "'speaker_3': 'And so for those reasons, I support this. I think it aligns with those of three very important topics climate, health and youth in this moment. And so I'm happy to make the motion to support this this this resolution.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Captain Pierce.'",
        "'speaker_2': 'Thank you, Mayor. Thank you, city attorney, for drafting this. Thank you, Councilmember Richardson, for the motion and the hard work on this. I know that this has been a topic that's been around for several years, but specifically the last couple of months.'",
        "'speaker_2': 'I want to also say thank you to the Sustainability Commission and the Environmental Committee. We know that jointly they had two meetings that touch briefly on some of these concepts, but the Sustainability Commission has also really dived into this and I think it's critical that we acknowledge that it's not just climate justice, but that we talk about'",
        "'speaker_2': 'equity, particularly when we talk about air quality. We have the cow enviro screen that you can easily look at and see some of the key areas that have some of the worst air quality. But recognizing that climate change is something that impacts the entire city, but that we're trying to prioritize those areas that have the worst impacts'",
        "'speaker_2': 'over sea level rise. I think that's obviously not in my district's at the same level that it is in Councilmember Price's district. But the air quality is worse in our district than maybe it is farther on the east side.'",
        "'speaker_2': 'So I was I was hoping, Councilmember Richardson, that to be consistent with the document that we talk about equity when it comes to climate. And I know that this is a planning doc that's living document. And so pinpointing particularly things like the Columbia screen might not be appropriate, but being able to articulate that the spending for climate'",
        "'speaker_2': 'really can be prioritized in different ways with using the same equity toolkit that we already have for other documents. I would say that on each of these items, I know that I had asked Eric with our public works team, to give me a breakdown assessment and just recognizing that with our climate funds we do have really big'",
        "'speaker_2': 'priorities. I think there's a total energy efficiency related projects add up to about $80 million in the city, and that's just on energy efficiency projects. So we know that this money will definitely have lots of areas to be spent.'",
        "'speaker_2': 'And so making sure that we're prioritizing each of those areas within the Climate Adaptation Action Plan is really a key priority. So I'm glad that it's called out in this document. Councilmember Richardson, would you be opposed to including equity as part of the climate conversation, just like it's played out in the other two?'",
        "'speaker_3': 'It's not a problem. But what I would what I would highlight is that equity is called out twice in the document. I spoke with I spoke with City Manager Modica. I think it was just an oversight in the climate.'",
        "'speaker_3': 'So I'd like I'd like to bring him I think that's already his intent is to sort of apply this, but speak to that.'",
        "'speaker_5': 'Yes. We had looked at having equity in all three of them. We added it into human services, added into community health. And it was an oversight that that the term in the concept wasn't in climate change. You know, you have asked us as part of reconciliation to look at equity in all of those areas, and that's been'",
        "'speaker_5': 'approved by the council. And so we would you know, we would be bringing back things with an equity lens like we do with most of our items now.'",
        "'speaker_3': 'Certainly. And so I would just say, I think folks know the progression here. The council knew this was a recommendation that came out of the beginning of the Framework for reconciliation conversation. So there's a direct alignment with with that.'",
        "'speaker_3': 'There's also a direct alignment with things like our Climate Action Plan and strategic plan and a number of other strategies that we have that are on a shelf and haven't been implemented. So I hope that satisfies which we will.'",
        "'speaker_2': 'Yeah, I guess I wanted to be specific just because of the issues with, as I mentioned, the Callen virus screen. So if you look at the calendar screen map, that's not even my district, but the first District seven, like the west side of the north side is it calendar virus screen goes from 0 to 100.'",
        "'speaker_2': 'And on those areas, it's all the way up to 100. Whereas areas in my district might be screened out of one. And so I just wanted to make sure I know that, that we didn't talk through this beforehand.'",
        "'speaker_2': 'COUNCILMEMBER So I'm sorry for spraying this, but I just want to make sure that as we talk about the Climate Adaptation Action Plan, and perhaps this could be put more strategically into that plan to make sure that there are areas that are prioritized when we're trying to reduce the direct impacts to people's health, like asthma impacts from'",
        "'speaker_2': 'being in that in that zone. So I recognize and appreciate that equity is throughout the document. I got several calls and emails about it today, so I look forward to hearing the rest of the Councilmember comments. I think it's a it's a great document, and I hope that people will stay this engaged as they have been on'",
        "'speaker_2': 'this plan, as they are when the Climate Adaptation Action Plan returns to council as well. That's fine.'",
        "'speaker_0': 'Customers and asked.'",
        "'speaker_2': 'Thank you, Mayor. And as the chair of the Election Oversight Committee, I just wanted to reiterate my support for this kind of of calm, of this kind of item and resolution. I think that it's very important that we do look at it through an equity lens, but we also need to work together with staff to, you know'",
        "'speaker_2': ', to make sure that our our constituents are well educated on on this resolution and what exactly means. And I'm very confident that working together, we can we can do this so and have it ready for the November 3rd election and be able to do outreach and educate our residents on on what exactly this is.'",
        "'speaker_2': 'So thank you. And I fully support this.'",
        "'speaker_0': 'Thank you. Count to my price.'",
        "'speaker_2': 'Q Mr. Mayor, can you hear me okay?'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'We can. Okay. Thank you. So I guess my question would be for the city manager, since it's the city manager who would be interpreting the intent and transferring that intent into practical application when we're talking about equity in this context.'",
        "'speaker_2': 'Well, let's just start with climate equity. What does that term mean to you in terms of how you allocate resources?'",
        "'speaker_5': 'Well, I think it could mean a lot of different things. Climate impacts people in very different ways. Sea level rise is one of the more immediate ones in terms of loss of property and damage. And so that certainly would be an area and that's going to affect, you know, the northern part of our town, a lot different'",
        "'speaker_5': 'than the southern part of our town. We certainly have other things like Heat Island Effect, which are very different as you go further north. And and the heat island effect is much higher than it is down by the coast.'",
        "'speaker_5': 'So in our mind, you know, the concept of equity is looking at what people need and looking at a needs based system and in trying to bring those resources to where the need is. So I think it would be complex, but we wouldn't take a one size fits all.'",
        "'speaker_5': 'We would be looking at the various areas of climate change that we would want to address in any given year and bring those forward. Some might be more immediate in one year than others, but again, this is a long term planning horizon that we're looking at.'",
        "'speaker_5': 'If this funding source were to be passed.'",
        "'speaker_2': 'Okay, I get it. So so just to understand more clearly, like in the example of climate equity, you would view sea level rise. As in when you're saying we're looking at things with an equity lens, you give you you'd view sea level rise as something that would be worthy of view from an equity lens.'",
        "'speaker_5': 'Yes, I think you've got an equity lens, but you've also got your entire climate action goals and programs and sea level rise is one of those big ones that's identified as one of the more impactful, especially in the next, you know, 15 to 20 years.'",
        "'speaker_5': 'So sea level rise is certainly one that we would be looking at.'",
        "'speaker_2': 'Okay. Thank you for that. And then I had assumed so, but I did get a few questions today, and I just wanted to clarify that it's really this concept of equity is based on me. So when we're talking about youth programing, for example, how would you define equity in terms of youth programing?'",
        "'speaker_5': 'So I think we would look at again what some of the needs are that are out there. We clearly know that we have some, you know, high poverty areas and areas where there's higher crime. There are needs in that area and some pretty dire needs for youth.'",
        "'speaker_5': 'We also have areas that youth have very different needs where they may need more, you know, emotional support or programing, you know, for, you know, socialization or to deal with school stress or those types of things. So we would take a look at in that given year what the need and priority is, you know, where we can'",
        "'speaker_5': 'make the best impact. And again, with a $1.6 million week, there is a lot that we can do every year. We're not planning, at least from staff's perspective, to recommend this to be a lot of structural programs. We would actually be looking to fund individual efforts each year.'",
        "'speaker_5': 'So if in that year, some money needed to go towards, you know, kind of youth intervention prevention type programs, those would probably be focused on the most in need for violence. And in that area and others could be more city wide approach for other things like school stress programing or other types of similar needs.'",
        "'speaker_2': 'And when we're determining need, are you guys doing any sort of surveys to determine that? For example, I'll give you an example. When we're determining what we need in terms of youth programing for for children, if equity is being defined as identifying need, then I think we'd probably want to know how how much is an average family'",
        "'speaker_2': 'earning? For example, are both parents working? Is there someone to watch the child during the day? How much are they spending on childcare, for example? And do they need or could they benefit from city subsidized programing? So what I want to give a huge shout out to our new PR director, Mr. Dennis, because for some reason, the'",
        "'speaker_2': 'last time we talked about youth and equity, the only after school program that we had in the third district got taken away, which I wasn't sure how that need determination was made, but it was recently reinstated, which has been great because if you're a working family and you don't have anyone to watch your children in light of'",
        "'speaker_2': 'the COVID school closures, then then there may be a need there. Right. So for some subsidized assistance from the city. So how are you guys determining need when it comes to running youth programing equity?'",
        "'speaker_5': 'So I think we start with data so we can look at a lot of data, everything from, you know, income to, you know, you know, all the different data sources that are out there. We look at our strategic plans as well and why we didn't list specific strategic plans.'",
        "'speaker_5': 'We are in the middle of some efforts like the Youth Strategic Plan, which has a citywide process that we've been going to through to get input. Those plans all have different aspects of them, and so does the reconciliation plan, so does early childhood education plan.'",
        "'speaker_5': 'And so we been looking at those kind of council approved documents, and we would be bringing back actual programs through the budget to look at all your priorities. You can certainly give us input early on in the process on what your priorities are as well.'",
        "'speaker_5': 'But to get down to that level of detail of what the need is and what kind of input we're taking, that would go through the budget process.'",
        "'speaker_2': 'So I appreciate that. Thank you. I'm wondering if there's this is something you don't have to answer tonight, but I appreciate Councilman Richardson's comments earlier and the focus on making sure that we have programing so that every child in the city feels supported.'",
        "'speaker_2': 'I think that's really important. I think that's what we all every member of this council wants. But in light of that, maybe there's something the city council can do. Maybe we can put out our own surveys. You know, this council works really hard to support working families, and I would define working families as especially right now in'",
        "'speaker_2': 'light of COVID. Many families with both parents working outside the home with a tremendous need for childcare, intervention, assistance. I mean, there's so many, you know, forks in the road that children will face right now and without proper guidance and oversight, if they don't have a parental figure there to oversee them, they could make some tremendous mistakes'",
        "'speaker_2': 'or go go take the wrong route. And so I think as a city, we could maybe participate as council members in getting you data of how many working families we have, how many families need childcare, how much people are paying for childcare, you know, what portion of their income goes to things like their mortgage or their rent'",
        "'speaker_2': 'and how much is left over? Is there enough left over for them to be able to get quality childcare without city subsidy? So maybe we can put together a survey or something so that we can make really informed decisions about need that are based on some data and not maybe assumptions.'",
        "'speaker_2': 'Because even though there may be different income levels, you know, the expenses that a family puts out may be such that affording childcare may be a stretch or a burden. And so when we're talking about youth programing and opportunities to have assistance and support for children, every child in the city, you know, I want to know if'",
        "'speaker_2': 'there's any way that we as a council can help the city staff get data, or maybe we can hire a contractor to do a study or a survey. I don't know. I leave that to you as the city manager, but I certainly think that if we were to get some of that data, some of the results might'",
        "'speaker_2': 'be surprising and might inform our decisions of need maybe differently, maybe the same, but at least provide us some data with which to make those decisions. And that would be important to me as part of this process. I understand that we're a ways out from implementation of this and certainly where we're having a discussion about something that'",
        "'speaker_2': 'hasn't even come to fruition. What that means to me is we have plenty of time to determine if equity really means need and if the intent is to support every child in the city, maybe we can get some data to help inform those decisions.'",
        "'speaker_2': 'When you come forth with your proposals.'",
        "'speaker_5': 'It would be happy to look at any data that anyone wants to provide. I think that those are all part of the things that we look at is, you know, what are the different neighborhoods and what are the different needs out there?'",
        "'speaker_5': 'I think you gave a good example of Parks and Rec. If you look at what we did this year with the coronavirus and we changed our parks and rec programs and we were actually able to merge them two different programs into one, lower the fees for everybody, and then also create equity based programs where people that even'",
        "'speaker_5': 'couldn't afford those reduced fees that they had the ability to apply for, you know, for even a more reduced fee than that. So that's actually one where we were able to lower the costs for everybody and create more slots.'",
        "'speaker_5': 'And we were able to offer that throughout the entire city while also thinking about need and people who have lesser ability to pay.'",
        "'speaker_2': 'Very much. I have no additional questions or comments.'",
        "'speaker_0': 'Thank you very much with that. There was any public comment and then we'll go to the well-placed.'",
        "'speaker_5': 'Our first speaker is Christopher Chavez.'",
        "'speaker_6': 'Yeah. Yes. Good evening, Mr. Mayor and council members. My name is Chris Chavez, and I'm the deputy policy director for Coalition for Clean Air and a resident of Long Beach, the sixth District. I want to thank the staff who drafted this resolution, as well as the council members and their staff who've taken the lead on this issue'",
        "'speaker_6': ', understanding that this resolution is a broad and overarching document. We appreciate it and are supportive of its goals. Further, we strongly support the commitment to climate and environmental equity and ask the city to consider Cal enviro screen stores scores the South Coast Air Quality Management District's multiple air toxics exposure study.'",
        "'speaker_3': 'And other.'",
        "'speaker_6': 'Relevant metrics. This advantage in low income communities, which are predominantly comprised of people of color, are disproportionately impacted by poor air and water quality as well as the climate crisis. As such, it is important for climate and environmental equity to be prioritized.'",
        "'speaker_6': 'To this end, I want to express my appreciation and gratitude to Councilmember Richardson and Councilmember Pearce for their questions. I'd also like to consider their I'd also like to ask the state to consider our other recommendations which have been provided in writing and verbal comments, as well as consult.'",
        "'speaker_3': 'With the environmental and environmental.'",
        "'speaker_6': 'Justice organizations when it as should this measure pass.'",
        "'speaker_3': 'And when.'",
        "'speaker_6': 'The time is appropriate. Thank you very much for your time and comments and I and again support this resolution.'",
        "'speaker_3': 'Thank you. Our next speaker is Mark Harris.'",
        "'speaker_2': 'Hello? Can you hear me?'",
        "'speaker_4': 'Yes, we can. Please begin.'",
        "'speaker_2': 'Dear may see him on this council member. My name is Mac Harris and I'm a youth ambassador for the city's Destitute Plan and a youth empowerment co-chair for exciting new local ballot. Measure, measure. Measure. I am also here as a youth ambassador for the Invest in Youth Coalition.'",
        "'speaker_2': 'Tonight, I'm here in support of you all to vote to adopt a resolution to prioritize the spending of the oil barrel production tax revenues for a specific purpose, to fund our fight against climate change, and to support the health and well-being of our youth and communities and communities most harmed by COVID and institutional racism.'",
        "'speaker_2': 'Imagine if all black, brown and Southeast Asian youth in our city have access to resources to stay resilient in these hard times. Right now, Long Beach has an opportunity to increase revenue for communities most impacted by systemic and environmental racism.'",
        "'speaker_2': 'When we vote yes on us, we hold local oil companies accountable to pay their fair share in taxes. Now is the time for Long Beach to level up and vote yes on us and ensure young people and those most impacted will receive the care they deserve.'",
        "'speaker_2': 'The truth is close to one third of Long Beach youth population were already living in poverty before the pandemic, and close to 7000 students attending USC reported homelessness. In this crisis, we know things are getting worse, but we need to act now.'",
        "'speaker_2': 'This is a step towards ensuring youth and families who live in historically and systemically under-resourced neighborhoods. Those who have historically had to carry the burden to fill in the gaps during.'",
        "'speaker_6': 'Budget cuts and recession will benefit.'",
        "'speaker_2': 'From equitable programs and public infrastructure to support strong, healthy and whole communities. I hope.'",
        "'speaker_6': 'That you all.'",
        "'speaker_2': 'Will vote to adopt this pollution and continue to have new voices at the center of this process because we need all of us. Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'That concludes ballot conferencing.'",
        "'speaker_0': 'Okay. Will do the roll call vote.'",
        "'speaker_1': 'District one. District White. I district to. District three, II District four, high District five. I. District six.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'We are we did provoke general public comment already. We're going to take iron and it's 26, 27 and 28, which are budget related. Madam Clerk, have you been keeping the timer for council comments?'",
        "'speaker_1': 'Yes, Mayor.'",
        "'speaker_4': 'You have. Okay.'"
    ],
    "Recommendation to declare ordinance relating to adopting an amendment to Ordinance No. C-6496, adopted July 5, 1988, and amended on January 24, 1989, July 11, 1989, December 5, 1989, March 20, 1990, July 3, 1990, September 18, 1990, July 2, 1991, July 7, 1992, January 26, 1993, August 24, 1993, June 28, 1994, July 18, 1995, November 28, 1995, October 1, 1996, March 25, 1997, October 7, 1997, October 27, 1998, April 20, 1999, October 19, 1999, October 17, 2000, October 30, 2001, March 19, 2002, November 26, 2002, January 6, 2004, February 8, 2005, November 1, 2005, December 5, 2006, March 20, 2007, May 22, 2007, December 18, 2007, July 15, 2008, September 21, 2010, September 13, 2011, September 11, 2012, October 3, 2013, and September 9, 2014, September 22, 2015, September 20, 2016, September 12, 2017, September 11, 2018, and September 3, 2019, relating to departmental organization of the City of Long Beach, read and adopted as read.": [
        "'speaker_0': 'Let me go ahead and let me go ahead and go to Adam's 2620 728.'",
        "'speaker_1': 'Item 26 Report from Financial Management Recommendation to Declare Ordinance relating to Departmental Organization of the City of Long Beach Red and Adopted as Red.'",
        "'speaker_0': 'Okay. I have a motion and a second, please. Medium version in a second on these budget items please Councilmember Austin and second by Councilmember Pearce. I don't think have to have any public comment on 26.'",
        "'speaker_4': 'Yes. Our first speaker is Dave Shukla.'",
        "'speaker_6': 'Hello. Dave Chappelle. Just very briefly, I'm looking forward to seeing how this point in the budget process evolves next year and every two year increments through 2030. And how we manage as a city, what happens after the Olympics and really looking at the Century Foundation as kind of a guide to doing it right the first time yet'",
        "'speaker_6': '. Thank you very much.'",
        "'speaker_5': 'Thank you. Our next speaker is carelessly you.'",
        "'speaker_4': 'Look.'",
        "'speaker_6': 'Hi, this is Corliss Lee. And looking at the budget where we're planning on furloughs, layoffs and salary cuts for frontline city employees to balance the budget. I'm having a hard time reconciling some of the other moves that are made.'",
        "'speaker_6': 'We are in an era of tightening our belts. Budget shortfalls are expected. What was the criteria by which budgeting decisions were made? I have to question that $85 million swimming pool is essential. Santa monica built a pool on the beach for 30 million.'",
        "'speaker_6': 'Who benefits from this? The trees.'",
        "'speaker_2': 'Along Willow and Eldorado Park.'",
        "'speaker_6': 'Are already turning orange. Is that a reduction in watering? Are we giving up watering the.'",
        "'speaker_2': 'Parks.'",
        "'speaker_6': 'While at the same time taking a $1.5 million soccer field that was planned surreptitiously became a $2.3 million soccer field. Are we planning on replacing it with a new potable watering system? What are the benefits? Who benefits? Is it.'",
        "'speaker_2': 'Necessary?'",
        "'speaker_6': 'Then I look at raises. Raises for the city auditor who's already in the 200 K Club. Does that make sense when you're laying people off? Raise this for city council. And then hiding that fact from the public. This is the year you should have frozen salary.'",
        "'speaker_6': 'I really can't understand your budgeting process. Thank you.'",
        "'speaker_3': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Roll call vote, please.'",
        "'speaker_1': 'District one, i. District two. District three, i. District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. District five, just. District six. District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District eight.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District nine.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Ocean carries.'"
    ],
    "Recommendation to declare ordinance approving Resolution No. WD-1429, a resolution of the City of Long Beach Board of Water Commissioners establishing the rates and charges to be charged for water and sewer service and declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 am. on October 1, 2020, read and adopted as read.  (Ordinance No. ORD-20-0033)": [
        "'speaker_0': 'Thank you. Next item 27.'",
        "'speaker_1': 'Report from Financial Management Recommendation of declare ordinance approving a resolution of the Board of Water Commissioners, establishing the rates and charges to be charged for water and sewer service, declaring the urgency thereof, and providing that this ordinance shall take effect on October 1st, 2020.'",
        "'speaker_1': 'Read and adopted as read.'",
        "'speaker_0': 'I have a motion to have a second motion by peers second by Sunday. Has any public comment?'",
        "'speaker_3': 'Yes, we have. Deve Shukla.'",
        "'speaker_6': 'Hello, Peter.'",
        "'speaker_5': 'Yes, we can you please begin?'",
        "'speaker_6': 'Thank you. Sorry. Very briefly. I'd like to state my ambivalence on this item, and I look forward to seeing in future budgets.'",
        "'speaker_3': 'For this department.'",
        "'speaker_6': 'More specifically on monitoring. Given how much we know not only about COVID, but about a lot of. Discuss on the air, for lack of a better term. Thank you.'",
        "'speaker_5': 'Thank you. That concludes public.'",
        "'speaker_4': 'Comment.'",
        "'speaker_0': 'Roll call vote, please.'",
        "'speaker_1': 'District one. All right. District two. I District three. I'm District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. District five. District six.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'District nine.'",
        "'speaker_4': 'All right.'"
    ],
    "Recommendation to declare ordinance approving and adopting the Official Budget of the City of Long Beach for the Fiscal Year 2020-2021, creating and establishing the funds of the Municipal Government of the City of Long Beach and appropriating money to and authorizing expenditures from said funds for said fiscal year; declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 am. on October 1, 2020, read and adopt as read.  (Ordinance No. ORD-20-0037)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next 1828 please.'",
        "'speaker_1': 'Report from Financial Management Recommendation to declare ordinance approving and adopting the official budget of the City of Long Beach for the fiscal year 2022 2021. Declaring the urgency thereof and providing that this ordinance shall take effect on October 1st, 2020.'",
        "'speaker_1': 'Read and adopted as read.'",
        "'speaker_0': 'I have a motion and a second. I have a motion by Councilmember. I think it's Austin and Councilman. Second Rate. Councilwoman Price. Any further comment?'",
        "'speaker_3': 'Yes. We have Dave Shukla.'",
        "'speaker_6': 'Hello. This you could resident of third. No further public comment. Thank you.'",
        "'speaker_4': 'That concludes public comment. Thank you.'",
        "'speaker_0': 'Thank you. That concludes the three budget items. All three of those budget items are now complete.'",
        "'speaker_2': 'You need to.'",
        "'speaker_1': 'Do the roll call. Vote for item number 28.'",
        "'speaker_0': 'Oh, I'm sorry about that. Right. Thank you.'",
        "'speaker_1': 'District number one.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District two.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District for.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I. I.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'District seven. I District eight. I District nine.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending and restating PD-32, Douglas Park Planned Development District (PD-32 North and PD-32 South), read and adopted as read.  (District 5)": [
        "'speaker_0': 'Thank you. Next, we're going to move on to we have three hearings. So let's go out and go through all three of those hearings, starting with hearing number 17.'",
        "'speaker_1': 'Report from Development Services recommendation to receive the supporting documentation under the record, conclude the public hearing and find the project exempt from secure and declare ordinance amending and re restating the Douglas Park Plan Development District North and South ordinances.'",
        "'speaker_1': 'Read the first time and later the next regular meeting of the City Council for Final Reading District five.'",
        "'speaker_2': 'Oscar Orsi, the development services director, will introduce staff for a brief presentation on this item.'",
        "'speaker_7': 'Yes. Thank you, Mayor, Mayor and members of the City Council. This is the zoning code amendment to PD 30 to the Douglas Park Plan Development District to modify provisions to the development standards, to expand our uses, our uses, and also.'",
        "'speaker_4': 'To improve upon the standards and streamline the approval process. And with that, Christopher Kuntz will give you a brief presentation.'",
        "'speaker_8': 'Good evening, Mayor and Council. I can this relates to Douglas Park, which is our industrial area surrounding Long Beach's airport. The Plan Development District was first established in December of 2000 for. This gives you an idea of what we refer to as PD 32.'",
        "'speaker_8': 'It's just north of the airport. It's divided into a northern and southern area with the cover street serving as the division between the two. It has been updated a few times over the years, but why we're in front of you today is to make updates related to use and uses that did not exist as prominently in 2004'",
        "'speaker_8': 'as they do today. So there are a number of users in Douglas Park and a number of sub areas. None of the allowed uses today would be deleted, but we are expanding additional opportunity to have uses that have reemerged.'",
        "'speaker_8': 'So these relate to aircraft manufacturing uses. I think it's an interesting little piece of history. Douglas Park exist because the aerospace industry and our partners, you know, basically exited Long Beach and then we developed Douglas Park with our development partners to refill those jobs and create jobs for the city.'",
        "'speaker_8': 'And we did that in a number of different fields. But the most exciting jobs that we're seeing right now and the highest paying ones are in the aerospace industry, but in a different form. So those are satellite companies and space related companies such as Virgin Orbit, Spin, Launch, Relativity Rocket Labs that you see on the trend.'",
        "'speaker_8': 'So this will effectuate those changes and make it easier for those types of users to move into Douglas Park. And we'll also address some rules that are outdated. Most businesses now have warehouse space associated with their use. They don't put their headquarters or R&D users in a separate building, then those locations that have warehousing.'",
        "'speaker_8': 'So this would provide for those uses as well as for certain fulfillment uses that, well, Amazon existed in 2004, not in the footprint that we see today and all the things that we buy online. And for manufacturers to be able to do that, they need sufficient space and we want to provide them that flexibility.'",
        "'speaker_8': 'So again, it's it's all about flexibility, but these are changes at the at the margin. So these are not uses that would be toxic or unattractive. So things like furniture making, paper products, wood products. We talked about aviation related uses.'",
        "'speaker_8': 'And then there is a difference between what's called third party logistics and being a manufacturer that also warehouses and delivers your products. We want to be able to have those manufacturing uses that produce high paying jobs in our city.'",
        "'speaker_8': 'So those are the changes in a nutshell. We do recommend that the city council approve the ordinance that is in front of you. The Planning Commission approved this item enthusiastically. We've been working both on the city staff side as well as with Service Regis, who is the major landowner in the area.'",
        "'speaker_8': 'And we all agree on the changes that are in front of city council this evening. So with that, I'd be glad to answer any questions you may have.'",
        "'speaker_0': 'Thank you, Mr. Coons. Is there any public comment on this item?'",
        "'speaker_4': 'Yes, I have. Deve Shukla.'",
        "'speaker_6': 'Hello. You should call again. Sorry for talking too much, but this is the reason why I called in today. Douglas Park is really important historically to the city. I mean, it's where we built the arsenal of democracy to beat the fascists the first time.'",
        "'speaker_6': 'And frankly, like what we've done with it is kind of a scandal. I mean, it's some of the best manufacturing land in the city and what are you chasing? And it goes off into space that should all be cleaned up, if nothing else, to deal with the fact that historically, how many emissions have come from that?'",
        "'speaker_6': '1.4. I mean, it's hard to take seriously how this city cohere, you know, from a policy perspective when you're talking about 1.5 million each year and what it's going to do when we tax oil in the wrong way, that captures not even all of the value.'",
        "'speaker_6': 'And then there's a place where the highest intensity of youth historically as well as currently still exists. And what are we doing? We're just subsidizing the hell out of it. But not in the right way. Not in a way where we can keep Jet Blue or anything.'",
        "'speaker_6': 'I mean, you know, it's really hard. It's really hard to take the city seriously when you're a full service city. You could have had a community choice aggregation program two years ago to help you optimize all this and have money on the table today.'",
        "'speaker_6': 'But now we'd rather keep subsidizing on sick and wrong people, frankly. And you've got to wonder why people don't want to live here. Why all those condos that are sitting empty might stay empty? What incentive is there when you're going to ruin this city within the next ten years?'",
        "'speaker_6': 'What incentive is there for me to say honestly? I mean, really? Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Okay. Councilman Mongo.'",
        "'speaker_2': 'Thank you. We're really appreciative of all the great work that the services has done with all of the partners that are at Douglas Park. And we're really proud of the high wage jobs that have really been available to long term residents.'",
        "'speaker_2': 'And we really appreciate the businesses really focusing on local job fairs. And so in all of those ways, they're giving back. And so I appreciate my colleagues support on the side of.'",
        "'speaker_0': 'If you councilman's in Dallas, we'll call the.'",
        "'speaker_4': 'Police.'",
        "'speaker_1': 'District one. I just talked to.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District five. I District six.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District seven. I. District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Ocean carries.'",
        "'speaker_4': 'It.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Table 32-1 of Chapter 21.32, Table 33-2 of Chapter 21.33, and Table 41-C of Chapter 21.44, all related to zoning code regulations, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Next hearing item is item 18 report from Development Services recommendation to receive the supporting documentation into the record and conclude the public hearing and find the project exempt from secure. Declare Ordinance Amending Title 2021 of the Long Beach Municipal Code to modify allowed and conditionally allowed commercial and industrial uses.'",
        "'speaker_1': 'Read the first time and later the next regular meeting of the City Council for Final Reading and adopt a resolution to submit the ordinance to the California Coastal Commission citywide.'",
        "'speaker_0': 'I can't go on staff and staff. You guys can just zoom. We have this information. Can you zoom through this, please?'",
        "'speaker_2': 'Sure. Oscar. Christopher, if you could, go ahead.'",
        "'speaker_8': 'So I think 19 is on the screen instead of 18. So this item relates to what we call omnibus updates to the zoning code. We have an overall program to update the zoning code and replace outdated provisions. But events occurred to change a little bit of what those provisions would be.'",
        "'speaker_8': 'So last year, at a date that's in the PowerPoint, I don't have Councilman Richardson asked staff to report back on that. There we go. April 9th, 2019, to report back on incentives and other provisions we could do to provide urgent care and medical services.'",
        "'speaker_8': 'We followed that into the omnibus program that we already talked about. Then with that work well underway, COVID hit earlier this year and we really looked at sort of the economic impacts of that and made some additional changes that are all packaged together in one item in front of city council today.'",
        "'speaker_8': 'So we have certain uses in the zoning code that require special approvals. What we wanted to do is still provide the community the assurance that there will be a review of those uses, but save those applicants at least $1,000 and a month, a process which we think is very important as we try to get businesses reopened and'",
        "'speaker_8': 'refill storefronts where businesses may have gone out of business. There's this that same approach we took in 2019 with reforms to the cannabis regulations and these clarify and incentivize medical use as per city council direction. So I'm doing the zoom through.'",
        "'speaker_8': 'We made changes to the industrial use table to make it easier to open businesses, including minor auto repair, tire sales, motorcycle and jet ski sales, which no one on staff was or why that required a special approval. But we're going to make it a little bit easier for those businesses and also to make some changes for religious'",
        "'speaker_8': 'uses that may expand, which was just a problem in the code. Private schools like industrial art schools, appliance repair, which is something you need in times of economic distress. You might have something repaired instead of replaced. And then we get into the medical world making sure that we actually allow hospitals in our zoning code, which we, of'",
        "'speaker_8': 'course, have the hospitals in the city. But it's not clear under the zoning code how a new one would open. So we address that as well as other uses such as urgent care. The biggest change is to slightly modify the parking requirements for medical uses to match those of retail.'",
        "'speaker_8': 'This is important because a retailer that went out of business could become a chiropractor or a dentist or urgent care center. And if dentists went out of business, that could become a retailer providing greater flexibility in the built environment.'",
        "'speaker_8': 'So that was as quick as I could do it. We recommend that you approve the ordinance in front of you. The Planning Commission enthusiastically supported this ordinance, and we know that it'll be important to serving residents needs for medical services, as well as goods and services related to the uses covered in this ordinance.'",
        "'speaker_8': 'I'm glad to answer any questions and we have additional staff on the web meeting.'",
        "'speaker_0': 'Thank you. I have a motion, a councilman's and the second by Councilmember Richardson. Is there any public comment on this council comment? Is there any public comment on this, Mr. Clark?'",
        "'speaker_4': 'Yes, we have. And control.'",
        "'speaker_6': 'Hello again for the record. And Control. Hello. And Cantwell. And I'd like to address Change five, which will modify the parking for urgent care centers and other medical places from five per thousand to 4000. I'm puzzled as to where you think people are going to park when they have a medical alert emergency and trying to get to'",
        "'speaker_6': 'urgent care. This. Oh. Seems like a very. Stupid way. To modify. Parking. There should be more parking. Available if you have an emergency. And they're trying to get to urgent care. I'd like an explanation. I know I won't get one, but I can't imagine why you would.'",
        "'speaker_6': 'Take out parking for urgent care. I guess you expect people to ride their bicycles or take the bus if they're sick. Thank you.'",
        "'speaker_3': 'Thank you. Next, we have Dave Shukla.'",
        "'speaker_6': 'Hello. Last coming for me tonight. But for the record, I do support N22. But on this item I support it as well and I appreciate it, you know, pretty detailed but brief presentation. Question How is the same city on the same day?'",
        "'speaker_6': 'Can have this item right after the previous? I mean, look at the difference here. I mean, look at I mean, one is so clearly tied to what we're actually dealing with and one is just, you know, furthering it, frankly.'",
        "'speaker_6': 'I mean, we got to decide what kind of city we're going to be, what kind of people we're going to be. I mean, you know, I learn something every time I you know, this is central to me. I don't always agree with it, but I mean, I learn something every single time.'",
        "'speaker_6': 'Well, we might benefit from some fun. Something found in thinking, you know, next budget, see how we're actually going to achieve the third century in the city. Thank you.'",
        "'speaker_4': 'Thank you that concludes public.'",
        "'speaker_0': 'It also and have any comment on your first. No customer, Richardson. Any clients?'",
        "'speaker_3': 'Yes, Mr. Mayor. So. So, first, I want to thank staff for putting this together. It's actually pretty, pretty innovative. The approach that you took, the direction is that that we we brought in city council last year was the we, you know, looked at some issues and we put up some maps that showed that north west in north'",
        "'speaker_3': 'east Long Beach, basically districts nine, eight, five really had a lack of urgent care centers, hospitals and other things. And those happened to be the same areas that don't have rail. So, you know, have some transit issues. And what ultimately that means is it creates a higher reliance on emergency rooms for non-life-threatening care and that at times'",
        "'speaker_3': 'can overwhelm wait times at our emergency department. So we so we asked you to look at some creative ways to create incentives that take or look at the barriers that keep urgent care centers, medical facilities from locating in these areas.'",
        "'speaker_3': 'And I'm proud I'm glad I'm glad to see what you came back with. It's a whole package of incentives, not just parking, but but other incentives as well around the, you know, taking away conditional use permit, going down the AUP.'",
        "'speaker_3': 'All these things will make it easier for us to locate our medical facilities. I'm proud to say that one, you know, there is actually interest in a new medical clinic with with Blue Shield is looking at utilizing some of these additional clinical amendments in North Lombard.'",
        "'speaker_3': 'So that so this is exactly what we were looking for a year ago. So so thanks to city staff for doing this, I know we're kind of moving quickly, but this is something important to note. And I wanted to say thank you for that and look forward to, you know, what what what turns out.'",
        "'speaker_0': 'Okay. Thank you very much. Country and good evening. Comments or no? Okay, then let's get real.'",
        "'speaker_4': 'I think. I think that's why Richardson set it up. Thank you.'",
        "'speaker_0': 'Okay. Real cover, please.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I high.'",
        "'speaker_1': 'District two.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'District five. I. District six. High District seven. District seven. District. District nine.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal code by adding Chapter 21.65, relating to Interim Motel/Hotel Conversions, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'Thank you very much. And then we have our fucking hearing, please.'",
        "'speaker_1': 'Report from Development Services recommendation to receive the supporting documentation into the record, conclude the public hearing and find the project exempt from the secure. Declare Ordinance. Amending Title 21 of the Long Beach Municipal Code to establish an interim motel conversion ordinance.'",
        "'speaker_1': 'Read the first time and later at the next regular meeting of the City Council for Final Reading and adopt a resolution to submit the ordinance to the California Coastal Commission citywide.'",
        "'speaker_2': 'We'll have Christopher Coons make the final presentation on this public hearing.'",
        "'speaker_8': 'And I will move quickly. Again, Christopher Koonce from Development Services. And I'm joined on the Web meeting by Alejandro Sanchez Lopez, who has been working on this project since he was an M.A. in 2017. And then we hired him in the department.'",
        "'speaker_8': 'So it's great when that works out. What this item is about is we have a number of motels in the city, likely an oversupply of motels in the city. But what we have an undersupply of as housing leading to our housing crisis.'",
        "'speaker_8': 'And specifically looking at the number of homeless residents or folks in danger of homelessness or severely rent burdened motels that become housing of last resort. But when they're operated as some blurry line between legitimate motel and housing, they can be subject to a number of nuisance issues.'",
        "'speaker_8': 'This program seeks to address both problems and builds upon existing efforts and recommendations from all of our various task force and reports that we need to be able to provide additional housing to provide rapid rehousing of homeless individuals and to be able to address our nuisance motels.'",
        "'speaker_8': 'So how does this ordinance work? Motels typically comply with a number of requirements when converting to housing, and there are certain disincentives to do that conversion. This program would allow a streamlined conversion from motel to supportive housing for a period of time with onsite social services.'",
        "'speaker_8': 'They would meet performance standards and the conversion itself would be a matter of right. They would not be able to expand or substantially change the footprint of the structure. This from a technical standpoint, this ordinance provides relief from sections of the zoning code that would otherwise prevent these motels from being converted into housing.'",
        "'speaker_8': 'It provides structure to revert to the prior use to basically revoke the conversion if necessary, by the city upon termination of the agreement with the property operator or at the request of the operator. It allows development services to review the applications in partnership with the Health Department, and it provides strict performance standards for the operators so that'",
        "'speaker_8': 'these facilities are operated in consideration to the surrounding community and we resolve any nuisance activity. This just shows you that this program, while it's a land use item, it's also a partnership between the city, our health department, nonprofits that may be operating these hotels.'",
        "'speaker_8': 'We're going to come into an agreement and we're all going to meet our expectations and our performance standards. In order for a conversion to occur, a multi-year contract has to be entered into between the operator and the city.'",
        "'speaker_8': 'So that would be a partnership between the operator, Development Services and Health and Human Services. The ordinance is intended to remove barriers and incentivize this type of conversion. And we did have some discussion at the Planning Commission about whether this would overburden any particular part of town.'",
        "'speaker_8': 'But there are motels, including nuisance motels spread throughout the city, even if there are more in certain districts than others. So with that staff as excited to move this project forward and we ask that you adopt the ordinance in front of you and I am glad to answer any questions.'",
        "'speaker_0': 'Any public comment on this item?'",
        "'speaker_1': 'There's no public comment on this item.'",
        "'speaker_0': 'We gave a motion to the second Councilman Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. This is this is this is incredible work. We've been talking about motel conversions for quite some time. Now, remember, we also made a motion on this maybe two, three years ago to look at this as a package of a whole host of things.'",
        "'speaker_3': 'Since then, there's been state legislation, there's been Project Homekey and a lot of focus here. But but it's taken taken some time. But I think we're now is the perfect time actually to leverage some of the state programs and figure out how we can address some of the new no nuisance motels in our city by converting them'",
        "'speaker_3': 'into some purpose. That actually helps us solve our public policy challenges around housing availability in our community. So I'm really glad to see this and obviously supportive.'",
        "'speaker_0': 'Councilor Pearce.'",
        "'speaker_2': 'Thank you. Yeah, I'm really thrilled with staff's work on this. I recall in my first six months on office, which was over four years ago, we were talking about this. We had a lot of staff time dedicated to it.'",
        "'speaker_2': 'And I think converting these to transitional housing and providing homes for people is really critical. And I really applaud your staff's work to be creative and to stay focused. I hope that over the next decade even that we can open this up to more properties.'",
        "'speaker_2': 'I know that we went over the property list last time, but really what we should be really proud of this effort because it wasn't an easy lift. So good work in.'",
        "'speaker_0': 'Thank you. Council members and day house.'",
        "'speaker_2': 'Thank you, Mayor. I also want to say thank you very much to the staff. I am in full force, supportive. This is incredibly important to me and to my district that we provide more benefits for for our neighbors in experiencing homelessness.'",
        "'speaker_2': 'It has been such a joy to see this process come about. And I think all those who came previously, for all their efforts they did in bringing this forward and now we get to experience this. And I think it's going to be a great thing moving forward.'",
        "'speaker_2': 'And as my colleagues have said, you know, it's going to help us provide more services that are so, so much needed, not only in the first, but throughout the city and to the whole city as well. So thank you very much, staff.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Q Mr. Mayor, I have a couple of questions for Christopher, for Mr. Coons, and that is in regards to holding strict guidelines for the operators of the facilities. What enforcement resources mechanisms? Staffing allocations, do we have to ensure that the operator will be held to the standard that we're all agreeing on?'",
        "'speaker_2': 'Because I think this is a fantastic program and I look forward to some of the nuisance motels even in my own district. I'm not familiar with all of them throughout the city, of course, but the ones in my district being considered but what I what I want to be able to make assurances of to residents is that'",
        "'speaker_2': 'the operators will be held accountable in terms of abiding by specific guidelines when they're operating, especially in close proximity to residential neighborhoods.'",
        "'speaker_8': 'I'm sure. So while this ordinance takes care of the land use, it also makes reference to entering into a contract. So in addition to the normal code enforcement process development services, we have a much better tool in this case and that you it's not profitable to operate homeless housing.'",
        "'speaker_8': 'So these providers are operating with funding either from the county, the city or another government agency. And they're entering into a contract with the city of Long Beach about the provision of those services that go along with the housing and the city maintains the right to terminate that contract, which would ultimately eliminate their ability to continue to'",
        "'speaker_8': 'operate the facility. So we hold not only our normal nuisance abatement measures, but we hold the purse strings and we have a contractual relationship with these operators. So working with my partners in Health, because it's not development services staff on a day to day basis doing homeless services, but we would be working as a team and we'",
        "'speaker_8': 'believe that additional leverage of the contract and potentially some funding provides us a greater degree of control over these facilities than you would find on a run of the mill land use, such as a restaurant or somewhere where we have to go through the nuisance process.'",
        "'speaker_8': 'That would not be the case in this circumstance.'",
        "'speaker_2': 'Follow up question, will the provisions that we're entering into this evening by way of adoption of this also apply to properties that are acquired through county funds or through county sources?'",
        "'speaker_8': 'So this program will apply? Yes, generally speaking, and the county we have shared the county provisions with them. And Kelly Cappelli, director of Health and Human Services, is having those discussions with the county, not myself, but the county, even if they're not legally required to, because they preempt us on some things.'",
        "'speaker_8': 'They have expressed their intent to meet these conditions and to operate in cooperation with the city and to coordinate entry so that we make sure that we're serving Long Beach homeless residents in these facilities, whether it's owned by the city, county or a third party.'",
        "'speaker_2': 'Okay. Thank you. Appreciate it.'",
        "'speaker_0': 'Thank you, Councilwoman. Next up is Vice Mayor Andrews.'",
        "'speaker_4': 'Okay. Thank you. First of all, I want to thank Isaac and his team for putting the item together. You know, I believe that as a council, we are always forward thinking on how to help with the homeless crisis.'",
        "'speaker_4': 'You know, we have one more chance to participate in this conversation. We should be doing what we can do. I mean, to streamline the process for them. I'm just hoping that in establishing locations that all districts, you know, can help with this initiative.'",
        "'speaker_4': 'And again, I want to thank the team very much, Oscar Unity. Thank you.'",
        "'speaker_0': 'Roll call. Vote, please.'",
        "'speaker_1': 'District one. I District two I District.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'School, District fourth.'",
        "'speaker_4': 'In your high.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'High.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District nine. A motion carries.'"
    ],
    "Recommendation to request City Council to adopt support positions for Propositions 15, 16, 17, 18, and 25 on the November 3, 2020 ballot.": [
        "'speaker_0': 'Thank you. Now, let's go ahead and move on to some other items. We will do 23 and then. And then the rest should go rather quickly. So why don't we go ahead and do 23 and then we'll go back and do all the rest.'",
        "'speaker_0': '23.'",
        "'speaker_1': 'Communication from Councilmember Richardson, Chair of the State Legislation Committee. Recommendation to request City Council to adopt support positions for Propositions 15, 16, 17, 18 and 25 on the November 3rd, 2020 ballot.'",
        "'speaker_0': 'Thank you. I have a motion in a second. I think there's a staff report on this item. So, Councilor Richardson, should we hear the staff report?'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_0': 'All right, Mr. Monica.'",
        "'speaker_5': 'Thank you, Kevin Jackson and Tyler Kerley. We'll give the staff report.'",
        "'speaker_7': 'Yes. Thank you. Good evening, Mayor and City Council. I'd like to give a high level overview of the State Legislation Committee's recommendation from the September 3rd meeting to support Propositions 15, 16, 17, 18 and 25. Let me. Move the slide.'",
        "'speaker_7': 'So these propositions consider the issues of split rural taxation, affirmative action, voting rights for people on parole, voting rights for 17 year olds, and the cash bail system. Proposition 15 is commonly referred to as the Split Roll Initiative, and if approved by voters, it would implement a different tax structure for most commercial and industrial properties worth more'",
        "'speaker_7': 'than $3 million, leading to increased revenues for local governments and education. If voted down, these properties would continue to be taxed based on the existing system. The current property tax system ties taxable value to original purchase price and annual increases are capped.'",
        "'speaker_7': 'Properties are reassessed when there is a change in ownership or new construction. The initiative would begin in 2022 and be phased in over a three year period for properties that are occupied by a majority of small California businesses with 50 or fewer employees.'",
        "'speaker_7': 'Split rule would further exclude agricultural properties and does not apply if the property owner has $3 million or less worth of commercial land and buildings in California. Most owners of commercial land and buildings worth more than $3 million, would pay higher property taxes.'",
        "'speaker_7': 'Yeah. The state estimates split rule would increase property taxes for local governments in education between six and a half billion and 11 and a half billion annually. And that would be split 6040 among local governments and education. So for the city, we estimate a range between one and 1.3 million and 3 million, according to different estimate approaches'",
        "'speaker_7': '. So we really are working based on the best information that's available without an official methodology beyond the State's estimate. So if we take the statewide estimate and the city's current assessed valuation based on our share of overall property taxes, we estimate between 1.3 and 2.4 million annually.'",
        "'speaker_7': 'And if we further estimate the city's current tax values and their potential reassessed value under the initiative, we could expect closer to 3 million. The third estimate of 32 million is from the Schools and Communities First Campaign sponsoring the proposition.'",
        "'speaker_7': 'But their methodology is unclear and likely overestimated because we don't know how they account for the exemptions in the initiative. It also appears to include the portion that would go to education and by comparison, the county's estimate for their general fund revenue increase is 394 million, which is significantly lower as well compared to the campaign's estimate for'",
        "'speaker_7': 'the county of 1.3 billion. So there are a number of uncertainties with these estimates. And it's, as I mentioned, based on the best information we have, all three of these approaches assume Long Beach will continue to receive an amount proportional to its current share of revenues under the existing tax structure.'",
        "'speaker_7': 'But that might change through reassessment. Furthermore, exemptions are not just based on a single jurisdiction but rather are statewide, so it's difficult to accurately estimate what exemptions apply locally and last. The timeline of implementation and revenue generation is also unclear due to the administrative work that would be required to reassess properties.'",
        "'speaker_7': 'The L.A. County assessor estimates it will take 5 to 10 years to get to full implementation. Proposition 16 asks voters whether to repeal Proposition 209 from 1996 and allow for the consideration of race, sex, color, ethnicity or national origin in decisions related to public employment, education and contracting, state and local government entities would still have to comply'",
        "'speaker_7': 'with federal law, which establishes a right to equal protection and limits consideration of characteristics as one of several factors not the decisive factor in decisions. Repealing 209 Proposition 2a9 would permit state and local governments to change current policies or programs.'",
        "'speaker_7': 'Therefore, the measure would not have direct fiscal effect unless the Council chose to change procurement and hiring practices and practices. Proposition 17 would amend the state constitution to grant individuals on parole for felony convictions the right to vote in California.'",
        "'speaker_7': 'The state estimates that Proposition 17 could cost counties hundreds of thousands of dollars to prepare voting information and resources for roughly 40,000 current parolees. The Los Angeles County clerk reports that this proposition could have minor impacts on county operations.'",
        "'speaker_7': 'The county public defender supports restoring voting rights for people who have completed prison sentences. The proposition could have a minimal cost increase to the city clerk's office related to revising voting materials and ensuring they are distributed to additional eligible voters.'",
        "'speaker_7': 'Proposition 18 would authorize eligible 17 year olds who are U.S. citizens and California residents to vote in a special or primary election if they will be at least 18 years old. By the next general election. The state estimates the proposition could require one time costs in the hundreds of thousands of dollars for infrastructure and Labor to update'",
        "'speaker_7': 'existing voter registration systems. The proposition would have minimal implications for city operations, as the majority of the cost burden would fall on counties for the development and processing of additional voting materials. And last we have Proposition 25, which would uphold Senate Bill ten of 2018 and change the existing cash bail system to a risk based system.'",
        "'speaker_7': 'A no vote on Proposition 25 would repeal SB ten, thereby retaining the current cash bail system. So in August 2018, Governor Jerry Brown signed SB ten into law, and it was slated to go into effect in October 2019.'",
        "'speaker_7': 'If upheld through Proposition eight and Proposition 25, SB ten one reform current bill laws implementing a new pretrial detention and release system based on public safety and flight risk instead of cash bail risk would be assessed based on the likelihood of an individual not appearing in court and the likelihood of an individual committing a new crime if'",
        "'speaker_7': 'released. The risk based assessment would be determined by the Court in consultation with stakeholders, considering the following factors. Low risk individuals would be released for certain misdemeanors. Medium risk individuals could be released or provided supervised release with conditions necessary to ensure public safety and the person's return to court or courts could do a review to determine whether'",
        "'speaker_7': 'to detain those individuals until arraignment. And third, high risk individuals would not be granted release for serious or violent crimes. The state estimates that Proposition 25 could cost the state and local governments in the mid hundreds of millions of dollars, depending on how the system is implemented.'",
        "'speaker_7': 'And some of the state costs could be reduced by local programs that are directed towards assisting detainees and reducing recidivism. But this remains unclear at this point. The state estimates that county jail costs could also decrease by tens of millions of dollars annually from less crowded jails.'",
        "'speaker_7': 'And the direct impacts of this proposition to the city are also unclear. Counties would be responsible for implementing the transition from the current cash bail system to a risk assessment system. The implementation of SB ten would have a direct impact on the county jail system and would require significant changes to pretrial release operations.'",
        "'speaker_7': 'With that, I conclude my presentation. I'd be happy to answer any questions.'",
        "'speaker_0': 'Okay. Thank you very much. Councilmember.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So, as the patient stated, our state legislation committee had a meeting. We received a staff report on each of these and had a healthy level of discussion on each of these. And we make recommend we recommend to the City Council that we take positions of support on these matters.'",
        "'speaker_3': 'Most of our justification are a couple of things. One, Proposition 16, 17, 18 and 25 are really about how they align with the work that we've done over the last few months with with our reconciliation process, thinking about the way systems have operated, perhaps disenfranchized populations, and that that's something that we want to be able to acknowledge'",
        "'speaker_3': 'and be and be support of and support efforts to sort of change course there. More specifically, Proposition 16, which is it repeals Prop 209 and allows for decisions and and procurement and targeting based on race and gender and other tactics across institutions, from educational institutions to public agencies like cities and counties.'",
        "'speaker_3': 'You can do things like set targets for procurement, set targets for hiring, and other things that used to be a program that worked really well in California and and based on Prop 209 was eliminated. And since then, we've seen dramatic, dramatic economic impacts and greater segregation.'",
        "'speaker_3': 'And so this is an opportunity for Long Beach to take a position in support. And we have stories like that on every single one of these from restoring voting rights and other and sort of other things. Proposition 15, Schools and communities first, this really was has bubbled up from our local community.'",
        "'speaker_3': 'Our local community has really been very, very vocal vocally supporting this. We know that the way that local government and schools are structured and funded, there needs to be some reform to it. We are we are structured in a way that it's a you know, it's very entrepreneurial.'",
        "'speaker_3': 'And what we've seen is with the pandemic, when sales tax goes away and it goes away and all those things go away, we are still responsible for providing services. So I think this is in alignment with reforming the way that local government is financed.'",
        "'speaker_3': 'So all of these things, these are you know, these are big issues. And we know that there are people on on all sides of these issues who may have some expertize or a specific concern about one or the other.'",
        "'speaker_3': 'But I think the good news is we're a big, diverse city and this is a big opportunity. And, you know, it's a big opportunity for us to do this. But, you know, one way or the other, it's ultimately up to the voters.'",
        "'speaker_3': 'So the way the city council goes, the way individuals support or talk about this in the community that belongs on the outside, I think is important for the public to know that the city is not. Once we take this position, we're not spending any of our local tax dollars or local proceeds advocating a position one way or'",
        "'speaker_3': 'the other. This is us taking a position of support those campaigns can use, can do whatever they want to do. But internally, we're not using any resources to advocate one position or the other. So I support all five of these.'",
        "'speaker_3': 'I came out of our committee and I strongly encourage the city council to consider a yes vote. Thank you.'",
        "'speaker_0': 'Councilor Maria Ringa.'",
        "'speaker_4': 'Thank you, Mayor. And I think Councilmember Richardson was on target with every comment that he made on every one of these propositions. In regards to Proposition 16, especially, I have a history with that one. Back in 1996, I was marching and protesting to oh nine at that time.'",
        "'speaker_4': 'So let it pass. But what these propositions do on the ballot is basically address what we all know to be systemic racism. And I think that putting these in the bill and if it passed, would be doing a big test and eliminating systemic racism from from our Constitution.'",
        "'speaker_4': 'So I support these items. And I think that if we could get the support of our colleagues in the city council as well. Thank you.'",
        "'speaker_0': 'Councilmember Pearce.'",
        "'speaker_2': 'Thank you. Thank you to the committee for bringing these forward. I think these are all common sense propositions that really help the city not only balance the budget, but also ensure that every constituent has an access point to participate in their local democracy.'",
        "'speaker_2': 'Obviously, the voting age is something we've talked a lot about in the city of Long Beach. I think it makes a lot of sense to have that begin at 17 for the primary. I think Prop 15 is something that.'",
        "'speaker_1': 'Is long.'",
        "'speaker_2': 'Overdue and the way that it's presented today is well balanced and measured. And I would also say, including being able to allow people to vote that that might have already been spent time incarcerated is really critical to ensure that we are not further perpetuating structural racism as it might exist in our justice system.'",
        "'speaker_2': 'So I wholeheartedly support this and agree this is just the city going on record, being able to show our support for these items that will benefit all of our constituents in the city of Long Beach. So great work.'",
        "'speaker_0': 'Thank you, Councilmember Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I appreciate my council colleagues bringing this item forward. I'm going to be voting no on this. I've already taken a personal position unrelated to the city council as a whole on some of these. In fact, just yesterday I had an interview with some Polish students regarding my support for Propositions 15 and 16.'",
        "'speaker_2': 'So I've been pretty responsive in regards to my position on those two specific ones. This particular item has a very broad grouping of propositions in it, and at least one of them, Proposition 25 related to bail, has really changed a lot since that proposition was written.'",
        "'speaker_2': 'Well, the proposition hasn't changed, but the status of Bail House in regards to a Supreme Court ruling on the topic about two weeks ago, that really has changed the framework of our practical application of bail in the criminal justice system to accommodate for a lot of the things that are listed in Proposition 25.'",
        "'speaker_2': 'But above and beyond that, I think that this particular item calls for the council to weigh in on several diverse propositions together. In my opinion, these are voter issues which local government bodies probably should not be in the business of advocacy on their state election issues.'",
        "'speaker_2': 'And it's really best left to the proponents of the initiatives, in my opinion, to advocate for the items. But having said that, I do appreciate that being forward brought forward, and I appreciate the discussion tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And I'm also a member of the State Lands Committee. Unfortunately, I was not able to be at the meeting when these items were adopted. But I do think it is important for me to lend my voice to, at least to these issues that I believe and will impact the city of Long Beach should'",
        "'speaker_4': 'they pass. And and and I think each and every one of them are are relevant to to the discussion today in policy today that I will, again, like I said, impact and say in support of these items. And I understand that they're going to be pros and cons on both sides of this issue.'",
        "'speaker_4': 'But we have to look at where California is, where our state is today. Some of these these are at least a couple of these propositions seek to undo or. Or modify laws or change drastically change laws that have been on the books, some for 40 years, some for the last 20 years.'",
        "'speaker_4': 'And I can tell you that, you know, in terms of my involvement, you know, in in local government and in civic affairs, you know, one for one was was a very instrumental in getting me involved. And that was certainly of Prop 16 that is before us here today of, I do think, conversations around racial equity.'",
        "'speaker_4': 'You know, prior to 1996, affirmative action was an equity tool that sought to really balance affordability. So I do think from from educational institutions of, you know, job access, that is a very, very important proposition. And I know Prop 15 is one that is going to be debated pretty significantly over the next several weeks.'",
        "'speaker_4': 'But, you know, again, this was a a tax initiative that was put in place in 1978. I was ten years old at that time, and California was in a much different place. It was a much different state. And when we talk about equity and opportunity moving forward, these these are these these two particular initiatives, I think are'",
        "'speaker_4': 'very, very important for us to look at. And I think the conversation and debate is already moving forward, but I will be voting in support about the state legislature recommendations. Thanks.'",
        "'speaker_0': 'Thank you. Is there any further comment on these?'",
        "'speaker_4': 'Yes. Our first speakers, Jennifer Hing.'",
        "'speaker_2': 'I can. Yes. Hi, Mary. Hi. Dear Mayor Garcia and Long Beach council members Bobby Hughes deserve and support, care or support and care that allows them to overcome challenges, live full lives and thrive. You deserve to live, work and play in a community that provides dedicated investments and resources that allow them to reach their full potential.'",
        "'speaker_2': 'Youth across California are working every day to create healthy, whole communities where they can imagine and help build futures for us all. To My Girls in Action, Californians for Justice and Invest in Youth Coalition are here in support of the council's endorsement for profit teen, also known as schools and teachers.'",
        "'speaker_2': 'Our young people are leading the fight to ensure corporations pay their fair share of taxes. We have an exciting opportunity to double our impact with our local measure a ballot initiative that holds oil industry accountable to pay their fair share in taxes.'",
        "'speaker_2': 'These two ballot measures work in parallel to support an equitable and just future for our communities. U.S. corporations double and triple their profits during a global health crisis at the expense of low income, working class people and essential workers.'",
        "'speaker_2': 'While our communities suffer. When corporations pay outdated 1940 commercial property tax rates, they profit and our community loses. Cheating their way through tax loopholes is a form of divestment from our public education system. We need city leaders to support us and hold corporations accountable.'",
        "'speaker_2': 'Today, young people are often young people who are not of age to vote are doing their part this election season. They are on the ground, hosting voter education events and are mobilizing new voters and community members on issues that impact their future.'",
        "'speaker_2': 'We need to value their work and ensure their voices are heard. You're asking city leaders to do your part and support issues like Prop 15 that invest in youth. Voting yes on 15 would bring $12 billion for new schools and communities to increase resources and support for youth and their families.'",
        "'speaker_2': 'With an estimated 49.7 million coming to Long Beach, reinvesting in rebuilding public education and creating a public education system that reflects our communities, takes all of us leading together. Millions of students in California attend a school with police officers, but no counselor or nurse.'",
        "'speaker_2': 'Those communities are facing big gaps now in meeting the health and wellness needs of students in the era of COVID, including Long Beach. Long Beach needs to commit to investing in youth and endorsed property. It is a step in the right direction and will pave the way for more equitable and just funding that centers our highest needs'",
        "'speaker_2': ', youth and community members. This crisis is causing you to be bold and courageously alongside our youth leaders.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'Our next speaker is Patrick Swimmer.'",
        "'speaker_2': 'Wow. Well, it doesn't work.'",
        "'speaker_5': 'Patrick Swimmer.'",
        "'speaker_6': 'Yeah. Hello, Mayor Darcy and council members, thank you for the time to speak tonight. My name is Patrick Schwimmer and I'm speaking on behalf of the Long Beach Young Democrats. Our organization has endorsed all of these propositions and we urge the city to do the same.'",
        "'speaker_6': 'These five propositions can have an incredible impact on achieving the parity and equity we all want to see in the city. That has been the focus over these budget conversations the last few months. However, in addition to supporting these propositions, I also urge the city to take proactive steps to ensure that if passed, they will achieve their'",
        "'speaker_6': 'desired effects and avoid any unintended consequences. For example, Prop 15 would help provide crucially needed resources to our underfunded education system. However, the city must be sure to develop assistance resources for small businesses who are already experiencing hardships due to the pandemic, particularly those with triple net leases who will see their overhead skyrocket.'",
        "'speaker_6': 'Prop 16 would give the city the tool of affirmative action back to bring new economic opportunities to disadvantaged communities. But that will only be helpful to full review of the city's practices, particularly with contractors, to ensure the tool will be used effectively.'",
        "'speaker_6': 'But 17 and 18 would enfranchise many members of our community, but will be useless without effective outreach to ensure everyone who has been enfranchised understands their renewed rights. And Prop 25 would do away with the incredibly harmful cash bail system that has plagued lower income communities and communities of color for generations.'",
        "'speaker_6': 'But the city must work proactively with the state and county to ensure that the new risk assessment tools do not simply perpetuate discrimination under a different name. These five impact propositions can have an incredible impact on a city, but we need to take the steps necessary to ensure that they do only good and no harm.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Our next speaker is Troy Peters.'",
        "'speaker_4': 'Can you guys hear me? Yes. Please begin.'",
        "'speaker_6': 'Okay. You remember Garcia and Long Beach council members? My name is Troy Peters and I am a youth ambassador for the city's Youth Strategic Plan and a youth empowerment coach for our exciting new ballot measure us. I am here as a I'm also here as a youth ambassador for the Investing Youth Coalition.'",
        "'speaker_6': 'I'm here to support and invest your endorsement on Prop 15. School should be a positive place to learn and a community resource that leads to opportunities and success. Despite being one of the wealthiest states. California ranks 39 out of 50 in education spending.'",
        "'speaker_6': 'And in 2016, 7000 students attending the U.S. reported being homeless. Things will get worse if we do not act now. We hope when we hold wealthy corporations accountable to pay their fair share in commercial property taxes, we secure revenue for our schools, communities, and for our schools and communities that have struggled through decades of deep investment.'",
        "'speaker_6': 'Great schools bring value to our communities, protect teachers, students and schools from corporate greed. By endorsing Prop 15, schools across the state closed down in response to the spread of COVID 19. Students and families lost access to schools as critical hubs of community resources.'",
        "'speaker_6': 'This current crisis shines a new light on the complicated, overlapping reasons that California public schools have yet to live up to their promise of providing equal education for all, especially for students of color, English language learners, LGBTQ students, rural students and low income students.'",
        "'speaker_6': 'COVID 19 also presents a new opportunity for students, their families and educators to become architects and a new path forward. Now more than ever, we must build a network of public schools that are beacons of light and provide hope, opportunity and pathways to health and success.'",
        "'speaker_6': 'This is an exciting opportunity to reverse a longstanding pattern of divestment from our schools and communities. We hope you will join us in endorsing Prop 15. Thank you very much.'",
        "'speaker_4': 'And thank you at roll call vote, please.'",
        "'speaker_1': 'District one. I district to. I'm district three. Nay district for. District four. District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'Nay, they confirm.'",
        "'speaker_1': 'Yes, we can hear you. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'Or.'",
        "'speaker_1': 'District seven? District eight.'",
        "'speaker_6': 'By.'",
        "'speaker_1': 'District nine.'",
        "'speaker_4': 'All right.'",
        "'speaker_3': 'Just before is a name.'",
        "'speaker_1': 'Thank you. Motion carries.'",
        "'speaker_0': 'Thank you. And, Vice Mayor, stay away from the next item.'",
        "'speaker_4': 'Vice Mayor. Thank you, Mayor. Item six. Item six.'"
    ],
    "Recommendation to receive and file a presentation from the Los Angeles Registrar-Recorder/County Clerk relative to the November 3, 2020 General Municipal Election.  (Citywide)": [
        "'speaker_1': 'Item six. Just one moment. Report from City Clerk recommendation to receive and file a presentation from the Los Angeles Registrar Recorder County Clerk relative to the November 3rd, 2020. General Municipal Elections Citywide. A Vice Mayor here to assist us with the presenting information on the November general election is Monica Flores, government and legislative affairs manager for the'",
        "'speaker_1': 'Los Angeles Registrar Court county clerk.'",
        "'speaker_2': 'Good evening. This is Monica Flores. Thank you for having me. I've mentioned I'm the manager of governmental legislative affairs with the county's registrar recorder's office. And today I will be providing a quick overview of how long before voters voted in March, as well as how our preparations are going for the November election.'",
        "'speaker_2': 'Next slide, please. One more. In May I present the findings of our analysis of the March election to your Election Oversight Committee. A few questions were raised during that meeting and then were asked for me to come here to present to your full council and some of these details in the March election.'",
        "'speaker_2': 'We found that 35% of Long Beach voters voted in person and 65% of your voters actually voted via mail. 22% of those in-person voters voted during the first ten days of the voting period. And the busiest voting centers in your city were Eldorado Park West, Bayshore Community Congregation Church and the Panamerican Park.'",
        "'speaker_2': 'You can see here in the presentation the number of voters that voted at each one of these locations. Next five things. One more. So we are now well on our way with the preparations for the November general election.'",
        "'speaker_2': 'And as all things in our lives, the election will look very different than any of the elections we have seen before. To begin, all voters will be issued a vote by mail ballot. This is a 2.5 million ballot increase over what was mailed in the county for the primary election.'",
        "'speaker_2': 'This was done by initially by a board motion supported by a governor's executive order and then legislation that was passed in the state. We have also expanded our vote by mail drop boxes to 400 that will be placed across the county.'",
        "'speaker_2': 'This is an increase from approximately 250 that were placed in the for the March election. Additionally, the number of centers that we will be deploying in the county will change. For this election, we will have 11 days of voting, so a ten day early voting period and we will have 75 sites open for 11 day and 725'",
        "'speaker_2': 'of the sites open for five days for a total of 800 sites open throughout L.A. County. Additionally, we have implemented a safe election plan which incorporates the state and county code with guidelines to ensure safety at our vote centers.'",
        "'speaker_2': 'Next slide. Our priorities in this election are the safety and security of our voters and election workers. We seek to maximize vote by mail options and participate participation. We are looking to align the capacity to the highest expected volume and to predictive analytics, so placing the resources in the right place.'",
        "'speaker_2': 'We are looking to market voting events to encourage early voting. We will be targeting our mobile and flex programs to address geographically isolated areas and voters who have historically faced barriers to access. Additionally, we will be placing these types of sites at locations that have a lot of essential workers, such as hospitals, to ensure that those essential'",
        "'speaker_2': 'workers have the opportunity to vote. We are looking to implement and communicate a broad mass media campaign and voter education campaign to encourage our voters to plan ahead and to make sure they know all of their options for voting.'",
        "'speaker_2': 'Like. This. Here is a list of the vote centers that we have confirmed for Long Beach for the November election. In your city, we have 29 confirmed sites and we are currently either assessing or negotiating a few more sites, just about another handful.'",
        "'speaker_2': 'You may notice that some of the sites used in March are not on this list due to COVID social distancing guidelines. We need larger spaces for our vote centers. This means that some of the sites used in March did not meet the new requirements.'",
        "'speaker_2': 'We will be finalizing this list within the next week and I will share that list of both centers in Long Beach with your city clerk, Monique, who can pass this information along. Additionally, the vote center lists will be shared with all our voters, as we did in March.'",
        "'speaker_2': 'We will be sending a booklet that lists all of the vote centers in the county to every household in L.A. County. Next slide, please. This. Here is a list of the drop boxes that will be in Long Beach.'",
        "'speaker_2': 'We have 18 box boxes secured. Some of these boxes are still being installed, but all will be installed by October 5th, which is the date which all the boxes must open. Voters will receive information on these drop boxes within their vote by mail packet.'",
        "'speaker_2': 'In that packet they will have a list of their nearest locations, and then they can also find that all of the drop boxes on our website as they count the votes centers. We did receive one more request for a Dropbox and we are currently in Longreach and we are currently looking at our inventory and the spacing or'",
        "'speaker_2': 'distribution of boxes to see if that box really adds value to the Long Beach boaters. So this list might grow by one or two more. Next slide. As I mentioned, we have established a safe presidential election plan to keep our voters and election workers safe at our vote centers.'",
        "'speaker_2': 'This plan complies with state and county guidelines. So to begin, as I mentioned, all voters will be mailed a vote by mail ballot. We will encourage our voters to stay home and use their ballots, but we will offer in-person voting.'",
        "'speaker_2': 'The in-person voting will implement social distancing throughout the whole process, from the line to casting the ballot. We will ask voters to wear a face covering, and we will have masks and gloves available for voters who request them.'",
        "'speaker_2': 'Hand sanitizer will be available upon entry and exit and on other key stations throughout the vote center. Our election workers will wear protective gloves and masks, and all of the devices will be sanitized between our after after voters.'",
        "'speaker_2': 'Finally, curbside voting will be available for any voters who do not have a mask or refuse to wear a mask, or for any voter who is just unable to enter the vote center. Next slide. The timeline or key dates for this election.'",
        "'speaker_2': 'September 24th, we will be mailing sample ballot booklets. October 5th, we will begin the mailing of vote by mail ballots. This is also the date that our drop boxes open and the date that early voting begins here in Norwalk at the RCC headquarters.'",
        "'speaker_2': 'Next important deadline is October 19th, and that is the end of voter registration. The voter is not registered by this date. We will not be mailing a vote by mail ballot. They do have the opportunity to register in person at a vote center if they still wish to do so.'",
        "'speaker_2': 'Our vote centers will open on October 24. The hours of operations are 10 a.m. to 7 p.m., except for the final day of voting, which is the 7 a.m. m to 8 p.m.. That's fine. And this is my quick overview of what we have coming into Long Beach as we continue to secure vote centers and drop boxes'",
        "'speaker_2': '. Like I said, I will communicate with your city clerk, move money, and I will pass on information as well about election worker recruitment and training. And then my final comment is, is to thank you, your council and your city clerk money.'",
        "'speaker_2': 'Thank you all for your support. You have been great partners in this. You really assisted us in overcoming challenges that we have seen due to COVID, and our department truly appreciates that. Thank you.'",
        "'speaker_4': 'Thank you very much. I do have anybody coming in this item. Yes, we have Tiffany Davey.'",
        "'speaker_6': 'Good evening, Mayor. Council residents of Long Beach and Stephanie Darby, fourth district resident. I want to thank Monica Forest so much for that really in-depth presentation. And I just want to highlight a couple of reflections actually following this presentation, coupled with the presentation she gave to the Election Oversight Committee on May 26.'",
        "'speaker_6': 'So just speaking to Howie, just a couple of reflections during this crucial transition to the voting solutions for all people and vote center model. Having served in elections for the past 12 years, I make the following advertisements. Having served as well in the 2020 primaries, L.A. County has 20 you know, 27% of the voters take part in'",
        "'speaker_6': 'voting in the ten days prior to Election Day, with the remaining 73% of voters taking place on Election Day. With that, a couple of issues arise. Address with the disproportion of previous polling places. L.A. County previously to voting model had 5000 polling places.'",
        "'speaker_6': 'But with implementation of this up, we had in that primary 978 I believe the report stated. With the new system, it also allows any resident of L.A. County to vote at any vote center, which I am a strong opponent and supporter of.'",
        "'speaker_6': 'Access to the polls, as every person has a right to vote, should exercise that right part of the way to serve the public. However, that dissatisfied 20% and the aforementioned wait times are resulting up to 2 hours kind of reflects that squeeze towards.'",
        "'speaker_6': '73% voting at 20% over the previous amount of polling places. So I just want to take this opportunity to really encourage all voters to take part in early voting. As Monica stated in the report, polling places will be open from October 24th, October 5th, on vote by mail boxes will be open, really take advantage of those dates'",
        "'speaker_6': '. We saw very few voter turnout as again reflected with the percentage. So, again, let's remember a couple of other things really quickly. California's a no I.D. state, so please, to ease whatever we may face on Election Day, please remember the election staff will advise you on whether or not you need to show ID, as there are some'",
        "'speaker_6': 'exceptions to that rule. Again, we do not need to see your ID unless you are asked to do so. Thank you in advance to all of our nation's poll workers and disaster service workers as we are facing this continued ongoing pandemic.'",
        "'speaker_6': 'And I look forward to us taking care of each other as a nation. Thank you, everyone. Have a good evening.'",
        "'speaker_4': 'Thank you. That concludes public comment. Thank you. Do we have any further comment on this item? We just finished that. Okay. Do we have any council phones? You know, I do not have any council phones, so you see, it's so good.'",
        "'speaker_4': 'Keep it up. You know, I'm going to go down in order, you know. So the council comments. So District one.'",
        "'speaker_2': 'Thank you, Vice Mayor. I just wanted to say thank you very much for that great presentation. I know that this is a challenging time for everyone, and I just want to say thank you and thank you to our city clerk's office for the amazing work that they do.'",
        "'speaker_2': 'And I look forward to seeing all their great work be shown on November 3rd and before that so when elections happen. Thank you so much. Very supportive of this. Thank you. Thank you, Vice Mayor. Thank you so much for joining us and presenting today.'",
        "'speaker_2': 'I think as I mentioned earlier in the council meeting, civic engagement and voter turnout is very critical not only for statewide measures, but local measures and just ensuring that our residents feel like they're engaged and that their vote matters.'",
        "'speaker_2': 'We know that there when we're talking about inequalities in our city, we know that different demographics in our city vote higher than others. And sometimes that's related to multiple jobs, maybe childcare situation, maybe not being able to get to the polls in time.'",
        "'speaker_2': 'So I hope that every constituent that is able to vote in this election knows that they will be getting a vote by mail ballot and that they can vote before the final Election Day. And so I really appreciate having the time to talk about this with the council.'",
        "'speaker_2': 'I appreciate the partnership with the county. Thanks so much.'",
        "'speaker_4': 'Disagree. District four.'",
        "'speaker_3': 'Thank you for an excellent presentation.'",
        "'speaker_4': 'Thank you. Second District by. It seven. Again. It's my honor. And I want to thank the staff for the great presentation. Very important that we get out the vote and that we make it as easy as possible to submit the vote.'",
        "'speaker_4': 'One question in regards to the drop boxes, are they secured?'",
        "'speaker_2': 'Yes, the drop boxes are secured, so the drop boxes are actually bolted to the ground. They are a material that is has been tested to be very difficult to destroy. The boxes themselves are also locked in during periods that are not voting periods.'",
        "'speaker_4': 'And can you give an example of when a person would be required to show ID?'",
        "'speaker_2': 'Sure. There's really in one instance, there were an individual's required to provide an ID, and that is when it is a new voter who when they registered, we were unable to verify them in the state database. And that is usually either because they didn't provide either the last four digits of their social or a California driver's license'",
        "'speaker_2': 'number. So very small instances, but there are opportunities. So I appreciate a council member bringing that up.'",
        "'speaker_4': 'And finally, will there be literature going out to the voting public in regards to the information we provided tonight?'",
        "'speaker_2': 'Yes. So we have already sent out two mailers to every registered voter. The first one was an address verification postcard, really informing voters to to ensure that their postcard is verified. It was affordable by us. So if you move but didn't notify us, then you would return that ballot with that postcard with the new address.'",
        "'speaker_2': 'We also sent out a postcard asking any voter who's interested in updating the language in which they receive their material to let us know. And then the other pieces of mailers that will be sent out are, as usual, the sample ballot, the vote by mail packet.'",
        "'speaker_2': 'But then they will also be receiving that information within that booklet that I mentioned that lists all the vote centers. And then voters will also be receiving a postcard listing their nearest vote centers, as they did in March.'",
        "'speaker_2': 'So all of those mailers are opportunities for us to communicate with the voters, and they will have messaging that includes this information that I shared. Additionally, we are kicking off our mass media campaign this week. So beginning tomorrow you should see us all over social media, over traditional media.'",
        "'speaker_2': 'We will be out of home. So billboards, even in signage, in supermarkets, locations that we know voters are frequently that these days. So radio, local publications and so forth. So a lot of messaging will begin tomorrow.'",
        "'speaker_4': 'Thank you very much, everybody. It's. Mr. Gay. Disegno.'",
        "'speaker_3': 'Sure. Thank you. Just thought, first of all, thank you. The president. This is a big election. There's a lot of changes. One thing I wanted to. One thing I wanted to raise during the primary. We would have a number of vote centers, Colin Powell, a local church and smothered in the North Lombard area.'",
        "'speaker_3': 'And Colin Powell, although there was a lot of space, a lot of empty voting booths. A lot of people knew about it. It was hard to. It's it's on the edge of the town and it's hard to access.'",
        "'speaker_3': 'And at the time, our regional park out in park was under construction. And so that's our regional park. That's where everyone goes. That's right in the heart of North Long Beach. And and now it's open. The training center's done.'",
        "'speaker_3': 'I wonder, is it you mentioned you're considering additional voting center locations. I think Highland Park makes more sense in the 95 zip code, given it's the largest zip code in the city and it's smack dab in the middle and it's accessible from all directions.'",
        "'speaker_3': 'What needs to happen in order to make Highland Park a vote center?'",
        "'speaker_2': 'Thank you, Councilmember, for that recommendation. Let me take this back and look at it. I will definitely. If the park wasn't open, maybe it just wasn't fully on our radar and we didn't consider it as we assess locations.'",
        "'speaker_2': 'But I have made note of this and we'll we'll go back to our team to see if we can immediately send out an assessment team to assess the location and, if possible, work out an agreement with the facility.'",
        "'speaker_2': 'And I can work with City Clerk Moni to to secure the location.'",
        "'speaker_3': 'That that works. I think it works a lot better. There's a fresh new parking lot turning loop, the 30,000 square foot facility with lots of open space so you can social distance. I just think it makes a lot more sense in that space.'",
        "'speaker_3': 'Thank you for for looking into it and I'll keep in contact. Thanks.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Bye. And you have a motion in second on this place.'",
        "'speaker_2': 'Emotions and dangers.'",
        "'speaker_3': 'Second Richardson.'",
        "'speaker_4': 'Thank you very much, Greg. Please take a vote.'",
        "'speaker_1': 'District one. I district to.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'School. District four, District five. District five. Right. District six.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District seven. By District eight. District eight. District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. Now who I am. Could you go ahead and read the item, please?'"
    ],
    "Recommendation to increase appropriations in the Capital Projects Fund Group in the Public Works Department in the amount of $620, offset by the Fourth Council District One-time District Priority Funds transferred from the General Fund Group in the Citywide Activities Department to install a new street light in the Fourth Council District.  (District 4)": [
        "'speaker_1': 'Communication from Councilman's Councilman Super Na recommendation to increase appropriations in the Capital Project Fund Group in the Public Works Department in the amount of $620 to install a new streetlight in the fourth Council District. District four.'",
        "'speaker_4': 'Do you have any comment?'",
        "'speaker_3': 'Yes. Thank you, Mr. Vice Mayor. I'd like to amend the recommendation on the floor to change the dollar amount to 20 $500. The original amount included the street lamp, but not operating it, and we found that a street lamp illuminated is far more effective.'",
        "'speaker_3': 'So it is. The city attorney would like what he read the entire item or is just the dollar.'",
        "'speaker_5': 'That would be fine. You're changing the dollar amount from 620 to 2500.'",
        "'speaker_4': 'Correct?'",
        "'speaker_3': 'So I'd like to get a second.'",
        "'speaker_2': 'And this is Mary. I second the motion.'",
        "'speaker_4': 'Yes. Any public comment on this item?'",
        "'speaker_1': 'There's no public comment on this item by any.'",
        "'speaker_4': 'Any council coming. Okay. Would you please vote?'",
        "'speaker_1': 'District one. I'm District two.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_3': 'All right.'"
    ],
    "Recommendation to request City Manager to work with the Public Works and Development Services Departments, California Department of Transportation (CalTrans) and Los Angeles County, to prepare a report on the status of neighborhood clean-up programs and right-of-way maintenance as impacted by the COVID-19 pandemic; and\n\nRequest City Manager to work with the City Health Officer and various Departments to present recommendations on how to safely restart the Long Beach Neighborhood Clean-Up Assistance Programs and other neighborhood improvement programs that have been discontinued due to the COVID-19 pandemic.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you very much. Item 22, you go ahead with the item, please.'",
        "'speaker_1': 'Communication from Council Member Richardson. Recommendation to request City Manager to work with Public Works Development Services Caltrans in Los Angeles County to prepare a report on the status of neighborhood cleanup programs and right of way maintenance as impacted by the COVID 19 pandemic.'",
        "'speaker_1': 'And request city manager to present recommendations on how to safely restart the Long Beach neighborhood cleanup assistance programs.'",
        "'speaker_4': 'I thank you. I know that we have made have a brief staff report on this.'",
        "'speaker_3': 'So I'm I mean, this is a powerful agenda item.'",
        "'speaker_4': 'Okay, so rexy. Okay, you go ahead and you comment.'",
        "'speaker_3': 'Thank you, guys. So. So the last few months obviously have been challenging for the city. We've we've had to face a crisis on multiple fronts here. And and over that time, we've seen some significant impacts to the maintenance of some of our our rights of ways, our freeway on and off ramps, our river, some of our streets'",
        "'speaker_3': '. And prior to the pandemic, there were just a lot more hands to contribute to this. Community groups partner with Neighborhood Services Bureau and partnered with Public Service Public Works to facilitate regular cleanups. You saw regular Caltrans cleanups on the on and off ramps.'",
        "'speaker_3': 'You saw freeway coordination and flood control coordination. But since March, there's been there's been some challenges. We haven't been able to assemble under the health order around large dumpsters and get the community involved in cleaning up the neighborhood.'",
        "'speaker_3': 'We've seen in certain situations, Caltrans and L.A. County have either changed their schedules or stopped cleaning up some of these rights away altogether. There's also other issues we'll hear about from staff about just the impacts of our work or workforce or the impacts on our local sort of clean team.'",
        "'speaker_3': 'And and we want to support them and we want to figure out what we can get done. I have a few slides here. We'll go through them pretty quickly. Let's go to the next slide. This is the recommendation.'",
        "'speaker_3': 'It's already been read by the clerk. We want to look at what we can do across agencies, what we can look, what we can do internally, and how we can work with our health order to really address the barriers to our Neighborhood Clean Up Assistance Program and other programs that we've done.'",
        "'speaker_3': 'Let's go to the next one. Here's some examples of the things that we've seen. So this you know, this is this is a Caltrans property is not the city's property. Typically, we will be able to report this type of thing, work with neighborhoods, work with the different neighborhood associations, and get in there pretty, pretty easily.'",
        "'speaker_3': 'We'd help or Caltrans would help and get that done. And what we see now, it's very difficult to get a response from Caltrans and it's having an impact on our quality of life. What's the next? And here's another one.'",
        "'speaker_3': 'It's a fire hazard. There's an encampment back there. It's yet another Caltrans right away. Let's see another. This year. This was an encampment in a dump site that you can see directly off of Artesia Boulevard. That's the 91 freeway above it.'",
        "'speaker_3': 'So you can see this from from Artesia Boulevard. And it's over time, it's gone from under that underpass all the way to Artesia Boulevard. I showed this to our city manager. They got out there and cleaned it up in a matter of weeks.'",
        "'speaker_3': 'The trash all came back. This is another example of what we've seen. What else was it? I think we have two more. This is we had public work come out, help us do a neighborhood clean up. And we heard at some of the, you know, some of the concerns.'",
        "'speaker_3': 'And and we have, you know, occasionally we get we get assistance with these things. But again, it's it's overwhelming. Let's see the next command. So this is what we're looking to do here. It's a report on what we can do.'",
        "'speaker_3': 'Let's look at communications. Outreach does work with other jurisdictions. Let's work on the interagency plan. And we and I know that there's concerns from other council members. This is a good platform to put it on the table and let's hear from staff.'",
        "'speaker_3': 'So that's my presentation and I'd love to hear from staff now.'",
        "'speaker_5': 'Thank you. Council Member So yes, we can certainly come back with some more information as the item requests. We can give a brief oral report tonight on some of the challenges. This is something we've heard about from every single council office about the need for additional cleanups.'",
        "'speaker_5': 'We are seeing an increase of trash with COVID and we have had some challenges. I'll turn it to Eric and Nico to give some high level comments on some of the challenges and what we're doing about them.'",
        "'speaker_4': 'DPKO, Mokonyane or deputy director will give the report.'",
        "'speaker_7': 'Good evening, Mr. Mayor. Members of the Council, I want to first thank you for the opportunity for us to speak on this topic tonight. It is something that this pandemic has really impacted staff and our ability to provide service.'",
        "'speaker_7': 'And so I just want to go over a few things, a few statistics and a few explanations as to what is impacting the service and then talk about moving forward. First of all, we start with daily sanitization protocols.'",
        "'speaker_7': 'Staff spends more time each day to make sure that their vehicles sanitized, their equipment is sanitized. That's wiping everything down at the beginning and end of shift and between certain service provision, certain service provisions. We also, with our clean team, typically utilize community service workers to help supplement our deep cleaning and our cleanup of areas with people'",
        "'speaker_7': 'experiencing homelessness and whatnot. We typically have eight community service workers a day, but we have not been utilizing the community service program since the middle of March when the shelter at home order went into place. That means that we've lost 320 Labor Hours per week just from community service workers.'",
        "'speaker_7': 'We have on top of everything well, we'll talk about some increases, but on top of that, we've seen a 23% increase in sick leave usage. We encourage people who may feel they have symptoms to stay at home. We have had numerous occasions where we've had to have multiple staff quarantined during this process, too.'",
        "'speaker_7': 'We typically have 1 to 3 people a day calling in for childcare issues, and we have had no community cleanups since the middle of March. Typically last year with Brown, this time we had done about 54 community cleanups in the Clean Team alone.'",
        "'speaker_7': 'This year we stopped at 15 in the middle of March. And, you know, we have the upcoming challenges of furloughs and we have had a hiring freeze. But the city manager has lifted that freeze for those operations because he recognizes the challenges we're facing.'",
        "'speaker_7': 'So now I'd like to talk about the workload. So pre-COVID through February or March or middle of March versus since COVID, we have seen nearly a 13% spike in the amount of trash that is coming from residential and commercial collection.'",
        "'speaker_7': 'To put that in perspective, you're talking over 25,000 tons of trash in a year. To further put that in perspective, that translates to about five and a quarter routes per day, which our current staff is absorbing, all while having a higher increase in sick leave.'",
        "'speaker_7': 'This also results in about $1.5 million in additional disposal fees. So the impact to our residential refuse collection and commercial refuse collection is huge. And I point this out because the clean team supplements the the refugees collection group when we are too shorthanded to be able to collect everything.'",
        "'speaker_7': 'We have seen a 41% increase in special pickups. We used to average just under 2500 special bulky item collections a month. We are now averaging 3500 bulky item collections per month since the pandemic. We have seen an increase in illegally dumped item reports from nearly 2000 among nearly 2600 a month.'",
        "'speaker_7': 'Our refuge hotline has increased for calls and our hotline has increased from 9700 a month to over 13,000 a month, with a peak of 14,500 plus in both June and August. Our goal Long Beach requests have increased from 3300 a month to almost 4600 a month, with a peak of 5300 in August.'",
        "'speaker_7': 'There's also been a corresponding reduction in cleanups or encampments for people experiencing homelessness from about 86 per month down to 45 per month. And that's for a couple of different reasons. One being that part of the pandemic was to not displace people that were homeless too much.'",
        "'speaker_7': 'And secondly, those are the resources that are going to help support the other operations, the other parts of the operations. And as far as greedy abatement goes, we've gone from nearly 7000 per month to 7500 per month. So you can see that the the pandemic has created a situation where people are at home, they're redoing their homes'",
        "'speaker_7': ', children that would normally be throwing their trash away at school or throwing their trash away at home. Adults that might be throwing their trash away at work or throwing their trash away at home. It's resulting in overflowing trash conditions, especially in multi-family areas.'",
        "'speaker_7': 'And we're trying to address all these issues. We're trying to right size accounts when we see overflowing places. But right sizing accounts means charging more for additional pickups, which some people are very resistant to at this time. The good news is, as I said, the city manager has allowed us to do some hiring.'",
        "'speaker_7': 'We currently have four people going through the refuge operator hiring process. We're conducting weekly interviews. We are engaging the Conservation Corps to help us pick up some slack in areas where we're struggling right now and we're already having discussions about how to properly restart neighborhood cleanups.'",
        "'speaker_7': 'That's where I'd like to end. If you have any questions, I'll be available.'",
        "'speaker_4': 'Yes. There. It's way to.'",
        "'speaker_2': 'One.'",
        "'speaker_4': 'Excuse me. I'm sorry. Ever since the day I.'",
        "'speaker_2': 'Say thank you. I swear if I didn't hear a second. So I would like to. Second, if that's needed on this presentation. I don't know if it's needed. And I just want to say thank you. Thank you. Thank you, Eric.'",
        "'speaker_2': 'Thank you to two public works. They they have been extremely, extremely burdened during this corona virus times, but they also have been so willing to work with us. And I know particularly that they get a lot of a lot a lot of phone calls from my office and requests and stuff.'",
        "'speaker_2': 'And I really I really appreciate the a reference that Councilmember Richardson made to the point that, you know, our crews go out there and pick it up and then like a day later or something, the trash is back there again.'",
        "'speaker_2': 'Of course, that that's going to take a little bit more thought on how to resolve that. But I know that you guys are working really hard in in trying to address this this issue. And I appreciate that. I know my staff really appreciates you guys being very open to helping us clean up in the neighborhood.'",
        "'speaker_2': 'And, you know, I'm also looking forward to reaching out to our L.A. County so that they can either give us permission to help clean up their area or come help us in cleaning up their areas. So, again, thank you, Councilmember Richardson, for bringing this forward.'",
        "'speaker_2': 'And I know that this doesn't only affect my my district and that it does affect citywide, but I feel like this has been a continuous issue in my district. So thank you.'",
        "'speaker_4': 'I'm here. Is to kill.'",
        "'speaker_2': 'Thank you, Vice Mayor, and thank you, Councilmember Richardson and cast member as in Dallas. I think we've all noticed an uptick in interest in our districts and whether it's in the alleyways or on the street. And it's been it's been frustrating, but recognizing, I think, the balance that Stark laid out is a tough balance.'",
        "'speaker_2': 'I have a couple of questions. First off, I know particularly in East Village, we had done a pilot program around lock bins. Probably every week I get three or four different people sending me images of the trash bins overflowing there.'",
        "'speaker_2': 'And I'm not sure if you have a status update on this, but I know that we have had a report back that said that the Lock Bin program was working and it was successful. But I don't recall if we ended up making that a mandate, an ordinance, and if we expanded it outside of East Village.'",
        "'speaker_2': 'But I think it would be a good time to revisit that. Do you have any updates on that program?'",
        "'speaker_7': 'Thank you, Councilmember. Yes, we did do a pilot program, as you said, and we saw some success with that. I think part of the problem currently is, as I said earlier, that because of the amount of waste that's being generated with everybody staying at home, that those service levels just aren't necessarily up to par.'",
        "'speaker_7': 'And we're so we are having investigators go out to each of these locations and monitor the service levels and then come back and make recommendations on do we increase do we increase the number of the frequency of collection at that location?'",
        "'speaker_7': 'Do we give it a larger container? And making recommendations. And then we have to make adjustments to the rate to those people accordingly. So when you see a lot in a lot of times when you see some overflowing stuff, you'll see the being open and bags just stacked a little higher than the edge.'",
        "'speaker_7': 'Sometimes with a lot bands, you'll see people just start stacking things on top of it around the bend as well. So it's a challenge, but I think the challenge would be best addressed by looking at the appropriate service levels and addressing them with regard to locking bins.'",
        "'speaker_7': 'We did not mandate locking bins, but we do have locking bins available now. There is a fee in the fee resolution for for multi-family or other accounts that do want to have a locking bin because servicing locking bins is a little bit more time consuming.'",
        "'speaker_7': 'So that's just a small fee that goes with it.'",
        "'speaker_2': 'Okay. And I would ask perhaps the next time we talk about trash, if we could understand how we're notifying people of the options for them to lock their bins. I know that there's a lot of people that don't know that we have that.'",
        "'speaker_2': 'So whether that's in a bill or something like that, just making sure that we're doing some public awareness around it. So I definitely appreciate that that report back. The other question I had is I know that we've changed our recycling and I know that that.'",
        "'speaker_2': 'And do you guys plan on doing a stock presentation down the road on some of the changes to our recycling program?'",
        "'speaker_7': 'We certainly can. I believe the city manager just recently issued a memo to advise the council on the changes and the changes are due to market conditions having changed over the years for what commodities are being purchased versus what commodities are no longer being purchased and put in the recycling stream.'",
        "'speaker_2': 'Now understand. Thank you. And the reason I brought it up here is because I, I know that I've talked to constituents that are just now putting everything in their trash bin instead of the recycle bin because they don't understand the differences.'",
        "'speaker_2': 'And so being able to articulate that for our constituents and maybe address some of the issues with the changes to how their bins are filling up would help.'",
        "'speaker_5': 'And we're planning to have a major press release and public information go out later this week with all those changes and what should go in the bin and what should go in the trash.'",
        "'speaker_2': 'Wonderful. Thank you. I know that we've got lots of items probably coming up over the next year or two on on trash and waste and recycling. So I appreciate that. As it pertains to the item in front of us with cleanups, I couldn't agree more.'",
        "'speaker_2': 'I think a lot of different neighborhoods are trying to figure out how to build capacity, whether that means that they're doing 2 hours, 2 hours at a time, or that different organizations are able to adopt different hours to go out and do cleanups, or that there's a pick up station.'",
        "'speaker_2': 'Like I would happily open up my district office for an entire day on a Saturday for people to come and pick up tools to go out and clean different streets. And so I think that our neighborhoods really need it.'",
        "'speaker_2': 'I know there are some people that that wouldn't mind getting out so long as their safety protocols in place. So I support that item. I appreciate the thought that went into it.'",
        "'speaker_4': 'It's x ray. They disagree, which is based. Fishing for.'",
        "'speaker_3': 'Thank you, Vice Mayor, and thanks to Councilman Richardson for bringing this item forward. Very timely, very much needed. I'd also like to comment for Mr. Marconi and Mr. Lopez. Our own public works department. Their standards are so much higher than other agencies.'",
        "'speaker_3': 'So I know they're trying challenging, but I just wanted to give you kudos for for the great job you're doing. We get daily calls, daily emails to our office involving us, Caltrans easements. We never like to pass the buck or our you know, it just we don't like the whole concept of the handoff.'",
        "'speaker_3': 'But Caltrans is a state agency and not under our jurisdiction. So if the purpose of this agenda item is to direct staff, I would say that that's a huge issue. If if staff could get connected with Caltrans, that would be wonderful.'",
        "'speaker_3': 'We did have quarterly meetings in the past. Those have been canceled since COVID. And when you see the abandoned encampments and all the trash on the four or five freeway easements, I'm just wondering if if this is a public health issue where the California Department of Public Health can get involved.'",
        "'speaker_3': 'Also, if Caltrans is not cleaning stuff, that it is a public health issue and it's their property. So I'd appreciate the staff could look at that and any other way that we can address this, because as I said, it's daily.'",
        "'speaker_3': 'We coordinate with the Fifth Council District because a four or five freeway, uh, divides our district, and I could mention L.A. County, but it's just, it's those issues are so small compared to the Caltrans issues. I just would like to live in a capstone right now.'",
        "'speaker_3': 'So thanks again for bringing that forward and our support to receive it finally.'",
        "'speaker_5': 'Yes, sir. We completely agree with you. We have been asking numerous times for Caltrans to do the cleanups, especially on the four or five. You're right. It's it's gotten completely, you know, bigger than we've ever seen it. I would also say L.A. County, we have had some success.'",
        "'speaker_5': 'So after several months of asking, they are now starting their cleanups again on our major rivers. And I think one is scheduled now for October. So we will start seeing progress there. We will keep after Caltrans and use whatever we can to try to get some attention to those, both the on ramps and off ramps, but also'",
        "'speaker_5': 'the four or five freeway itself.'",
        "'speaker_7': 'And if I may if I may add, first of all, thank you. Thank you for all the compliments we've received. But really, this is a reflection on our refuge team. These guys are out there doing all this additional work, addressing these issues.'",
        "'speaker_7': 'The days are getting longer for them, even though the days are getting shorter for everybody else as far as sunlight goes. But they're still sitting there out there and they're making up this difference that we're seeing created here.'",
        "'speaker_7': 'And that includes maintenance assistance, refuge operators, the refuge supervisory team, all of them but L.A.. I mean, Caltrans is kind of impacted similarly to how we are in that they used 50 or more community service workers a day and they're not using any at all right now.'",
        "'speaker_7': 'So they have some issues. So we've reached out to them and we're going to try and put some plans together.'",
        "'speaker_4': 'Thank you. This is five.'",
        "'speaker_2': 'Thank you, Vice Mayor. A couple of quick things. 1/1, big, big thank you to the rescue workers. I know I try to say it myself when I see them. They collect the trash this morning. I sometimes see them in the district at 530, 6:00 at night, still collecting trash, whether a trash truck's broken down or whatever has'",
        "'speaker_2': 'caused the delays. And we just really appreciate them. Second, I think that I talked to Mr. Modica about this specifically, but when trash bins are broken, it's taking 3 to 4 weeks to get replacement bins, which is very difficult for neighbors to go that long without trash bins in front of their house or recycle bin.'",
        "'speaker_2': 'So I know that we have a contract for that, if we can look into that. I know Mr. Modica said he will. Additionally, thanks to the management at public works and nephews for I'm really partnering with the neighborhoods.'",
        "'speaker_2': 'Some of the neighborhoods over here have found some opportunities to work together to clean out garages and the such and then coordinate getting all the items to the end of every street so that the rescue teams can swing by and pick up as much of it as possible.'",
        "'speaker_2': 'That's all been great, but I think that the challenge still comes with what I talked about with City Manager was when you call in for a pickup, it's a long time before you can get a pickup. So I would like to explore the idea of a same day pickup charge because a lot of people are more than'",
        "'speaker_2': 'happy to pay a fee. If we could fund a a vehicle just out of those kind of fees, then perhaps we can afford another rough use truck because there are lots of neighbors who are cleaning out garages, cleaning out other areas, and they don't have the knowledge of how to dispose of all this kind of stuff so'",
        "'speaker_2': 'quickly. So then it sits out on their curb. Then either they get reported by a neighbor and then they get a fine, which then they would have been willing to pay the fee in the first place. Or they.'",
        "'speaker_2': 'It sits there until it either gets rummaged by some people driving through your neighborhood who then target your neighborhood potentially in the future to rummage through your trash cans and other things. So we just need to figure out a way where trash gets put in the trash as quickly as possible in a way that supports our rescue'",
        "'speaker_2': 'workers and our community. So a big thank you to Chico and his team and all the hard work that they're doing. We cannot be more thankful for how hard they're all working on a daily basis. And then when it comes to Caltrans.'",
        "'speaker_2': 'What are legal opportunities in terms of I know that we've decided to just pay for clean up on their area sometimes, but if you don't clean up an area that belongs to you and you are the owner and you are responsible for blight, what can we do as a city to fine you?'",
        "'speaker_5': 'Councilmember. I'm not sure we have the answer to that. They are a state government. They're not a private property owner that would normally fall under code enforcement. The city attorney might be able to add a little bit more.'",
        "'speaker_5': 'That's correct. They would be exempt from certain government, local government regulations similar to the zoning code or planning and building permits.'",
        "'speaker_2': 'So to make a change, we would need like a statewide ballot initiative or a state legislative item that would empower community so we could work with our state senator and our state assembly members to say, come up with some legislation that would take a percentage of their budget to pay for the the services that we're providing on'",
        "'speaker_2': 'their behalf.'",
        "'speaker_5': 'That that could be an option. Yes.'",
        "'speaker_2': 'I hope that state ledge will consider that at their next meeting. We need a solution. This is just not acceptable. The off ramps are out of control. I was off the 91 in North Long Beach two days ago.'",
        "'speaker_2': 'Off the four or five. Off the Bellflower. I mean, it's it's bad. We need it cleaned up. And it is a public health issue. So thank you for any help that you guys can provide in that.'",
        "'speaker_4': 'Thank you. District seven. Thank you very spur. And I totally agree with everything that's been said, especially when it comes down to getting more cooperation from Caltrans and the county in terms of those cleanups. So it would be greatly appreciated if we could just just give a little more to get involved.'",
        "'speaker_4': 'Appreciate it. I'm also crisscrossed by two crisscrossed by two freeways, four or five and seven, ten. And as you drive over, you could see just the tons of trash that that piles up along this corridor. And then they also have the river as well.'",
        "'speaker_4': 'That would be all the help that we can get. Very much appreciate it. Thank you. And I want to make a shout out to our rescue workers. Thank you. Comes from Uganda. You know, this to me is a great idea and it's unfortunate it had to, you know, be agenda before this problem was taken so seriously.'",
        "'speaker_4': 'And I know I brought this issue up as well. You know what, Councilman Richardson, I would like to really, if you would be open to it. And I am hoping that you will be, you know, that like to add that to your motion to include a report back on.'",
        "'speaker_4': 'Oh yeah. But we have in place to collect illegal dumping items and the statue of each one of them. The status of each one of them. Excuse me. You know, we have a backlog. This is something that needs to be brought to our attention.'",
        "'speaker_4': 'You know, are you okay adding that to the report that came back to this council?'",
        "'speaker_3': 'Absolutely. Vice Mayor, it's time we get back to basics and get things cleaned up. Absolutely.'",
        "'speaker_4': 'Thank you so much. And before I yield my time, I just want to show you all a video. On a serious note and this is this in the sixth District, it's very brief and it concerns me, especially since this along our business corridor at 1511 is Halloween Street.'",
        "'speaker_4': 'So please roll the tape. You don't mind? Okay. But I think and this is what is should what should be totally unacceptable because the fact that these are neighbors coming out of their residence, I mean, business and putting it in the alley.'",
        "'speaker_4': 'You know, all we have to do, like we say, we have, you know, all these apps that you could be using and for them to put it in the ad and then they blame it on, you know, our community and everyone else, you know.'",
        "'speaker_4': 'So this is things that I think we really need to be brought to attention to. And I really want to thank you and your staff, but you guys are just working overload with this. But we have situations like this.'",
        "'speaker_4': 'It makes you work even harder. And I want to thank each and every one of you. And thank you, Mr. Councilman, which is simple and need to put that on, you know, the item that you had. Thank you very much, sir.'",
        "'speaker_4': 'Okay. Is there any public comment on this item?'",
        "'speaker_1': 'There is no public comment on this item.'",
        "'speaker_4': 'But so. District one is always a good place. Did I get a second on that?'",
        "'speaker_1': 'I believe Councilwoman Zendejas was a second on this item.'",
        "'speaker_4': 'Thank you very much. Would you believe that district one.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'District two, I. District three. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'II.'",
        "'speaker_1': 'District six.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'District seven. District eight. High District nine, high ocean carries.'",
        "'speaker_4': 'Thank you. Now we'll go to item 24, please. But you grew up with.'"
    ],
    "Recommendation to increase appropriations in the Special Advertising and Promotion Fund Group in the City Manager Department by $20,000, offset by community sponsorships for the Uptown Jazz Fest in the amount $15,000 from Bridge Development Partners, LLC, and $5,000 from the Port of Long Beach.": [
        "'speaker_4': 'Thank you. Item 33.'",
        "'speaker_1': 'Communication from Councilmember Richardson recommendation to increase appropriations in the special advertising and promotion fund group and the City Manager Department by 20,000 for the Uptown Jazz Fest.'",
        "'speaker_3': 'So I'll move, Richard.'",
        "'speaker_4': 'Thank you. Any public comment on this side of second round is.'",
        "'speaker_1': 'There's no public comment on this item.'",
        "'speaker_4': 'But can we please have a vote on this?'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two. I. District three. District four.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District five. District six.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'District seven, District eight. District nine.'",
        "'speaker_4': 'All right.'"
    ],
    "Recommendation to adopt resolution approving Memoranda of Understanding with the International Association of Machinists and Aerospace Workers and the Long Beach Supervisors Employees Association.  (Citywide)": [
        "'speaker_1': 'Motion carries 505 district. Okay. Motion carries.'",
        "'speaker_4': 'Thank you. 31 plate.'",
        "'speaker_1': 'A report from Human Resources Recommendation to adopt a resolution approving Memorandum of Understanding with the International Association of Machinists and Aerospace Workers and the Long Beach Supervisor Supervisors Employees Association. Citywide.'",
        "'speaker_2': 'So moves and day has.'",
        "'speaker_4': 'Second. Thank you. Any further comment on this item? Yes, we have Devin Appleyard.'",
        "'speaker_2': 'Know.'",
        "'speaker_6': 'Hello. Honorable Vice Mayor and City Council. My name is Devin Apple and I'm business. I am representing approximately 3000 language city employees. I'll start by thanking you all for your advocacy in the negotiations process in many ways. This is as generous an offer one can expect during a public health and financial crisis like we are facing.'",
        "'speaker_6': 'And for that, we are truly grateful. I must, however, address a few important points. The first being for those unions like ours who do not represent public safety or who had yet to close out our contract before COVID 19, we not only were hit with a larger furlough schedule than Alvey, but we were also forced into a'",
        "'speaker_6': 'reopening. Our concern is not only that the city has asked for less of a contribution from Alvey, but that the money not taken from Alvey now may be taken again from all of us when the city decides it needs further austerity.'",
        "'speaker_6': 'The only reason I can see for the city manager to avoid opening their contract was to limit your input on the matter. Second, we heard that you were told the delays in voting on this were because we were being picky and unreasonable.'",
        "'speaker_6': 'We disagree. The city volunteered to clean up the language, in particular regarding inclusive gender expressions. Unfortunately, when we received the document Uber to vote on substantial changes have been made that were not presented to or voted on by our membership.'",
        "'speaker_6': 'These changes would have voided the ratification vote our members might have just held. And lastly, and this is really the most important note of the evening over the term of this contract, we will be organizing around an issue that is of the utmost importance.'",
        "'speaker_6': 'The treatment of part time non-career employees. More and more, the city is shifting full time classified work to non-career employees who are denied benefits or any type of job security. City jobs used to be one of the best path for Disenfranchized communities to reach the middle class and achieve the American dream.'",
        "'speaker_6': 'But now those pathways are being cut off and our public servants are being relegated to minimum wage jobs with no hope of receiving disability parental leave recently, or health benefits while they're on the front during a national health crisis.'",
        "'speaker_6': 'We can't even list all the basic protections you and I enjoy that they do not receive. And some folks serve in non-career positions for upwards of 20 years. They are not given priority when full time jobs open up.'",
        "'speaker_6': 'And the Civil Service Commission just voted to allow the city to bypass them and fill classified positions with non-career employees. In a time where council is discussing inclusion and reconciliation, we are the only union that have to tell over a thousand of our members that they will not be receiving receiving the benefits we just negotiated for everyone'",
        "'speaker_6': 'else. Benefits that many would consider a baseline for city employees. Your constituents are asking that you invest in the community and that you build an infrastructure for the future. The decisions you make today are the foundation of the future, of how services are delivered to our communities.'",
        "'speaker_6': 'When they ask you to invest in the community. This is a large part of that. Your employees, all of them are a part of this city. They are part of the fabric of what makes Long Beach. Long Beach.'",
        "'speaker_6': 'Given all of this, we do feel encouraged that you ratify our MCU. Please stay safe, healthy. And thank you for your time this evening.'",
        "'speaker_3': 'Thank you. That concludes public.'",
        "'speaker_4': 'Comment for the. Thank you. Okay. Would you please go after the vote?'",
        "'speaker_1': 'District one. I am district two. District two. I District three. District four.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'District five, by district six.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. I do have any further comments on the agenda item.'"
    ]
}