{
    "Recommendation to refer to Hearing Officer the business license application denial appeal by Alsace Lorraine Fine Pastries, Inc. located at 4334 Atlantic Avenue, Long Beach, CA  90807.  \n(District 8)": [
        "'speaker_2': 'Recommendation to refer to hearing officer the Business License Application Denial Appeal by All Saints Lorain Fine Pastries Inc located at 4334 Atlantic Avenue, Long Beach, California. 908007, District eight.'",
        "'speaker_1': 'Mr. AUSTIN.'",
        "'speaker_3': 'Thank you. As their staff report on this.'",
        "'speaker_0': 'Yes, we can have one. Jason McDonald, our manager of this is Licensed Services can give the staff report. Jason. Thank you. Mayor City council members. This is a request to have the city council refer a hearing to the hearing officer for the denial of a business license application by the state's Lorain Find Pastries located at 4334 Atlantic'",
        "'speaker_0': 'in District eight. The location was previously cited during the earlier iteration of the medical marijuana ordinance and that this is his request to refer that matter to a hearing officer for adjudication. I'm available if you have any additional questions.'",
        "'speaker_1': 'Mr. Austin.'",
        "'speaker_3': 'Yes. In terms of the business being cited, can you go into a little bit more detail on that, Mr. McDonnell.'",
        "'speaker_0': 'This location. Has received leads and citations of over 400 citations and totaling almost 1,155,000 with penalties and interest. That includes the citations against the property owner for failing to regulate the business under the business license ordinance.'",
        "'speaker_3': 'So when you say the the the citations actually that will go before the hearing officer, is that money due to the city of Long Beach?'",
        "'speaker_0': 'The the citations would be due to the city of Long Beach. This matter actually in front of you, councilmember, is regarding referring their hearing for a denial of their business license. So on a separate but related matter, there were attempting to deny their business license for failure to follow the business license ordinance.'",
        "'speaker_3': 'And so as a matter of process, it will go to the planning commission.'",
        "'speaker_0': 'It. It's being referred to a hearing officer or an officer or hearing officer.'",
        "'speaker_3': 'And will there be public input on that that that hearing or will public be able to participate in any way?'",
        "'speaker_0': 'It's a public hearing that is allowed to be attended by the public, but the presentation is limited to city staff or city attorneys presenting for the hearing officer and the defense or the defendant rebutting or arguing any of those points.'",
        "'speaker_3': 'Okay. In this matter could come before back before the city council. Is that correct?'",
        "'speaker_0': 'It is my understanding that the hearing officer's recommendation would be returned to the city council for final vote. All right. Thank you very much.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_4': 'Just to clarify, this was an illegal marijuana operation that resulted in 100 citations being issued by the city. 400 citations.'",
        "'speaker_0': 'Yes, Councilmember. Over 400 citations were issued at this location.'",
        "'speaker_4': 'That's shocking. I can't even imagine something like that would ever happen in this type of a situation. What is what is the process from this point in terms of what is it that the business is now trying to do?'",
        "'speaker_4': 'And what are the factors that the hearing officer will take into consideration in making a decision?'",
        "'speaker_0': 'Councilmember, the the factors that the hearing officer would take into consideration would be what was being presented by the city, which is regarding there this location's refusal or noncompliance with the business license ordinance. Specifically in this situation, we are talking about the property owner and there we would be attempting to revoke their commercial and industrial license, which'",
        "'speaker_0': 'means their ability to rent the property for commercial purposes.'",
        "'speaker_4': 'Okay. Was this business just out of curiosity? Were there any fines or fees associated with this illegal operation?'",
        "'speaker_0': 'I'm not aware of any fines or fees. The city issues a citation that then results in a lean.'",
        "'speaker_4': 'O and a lean. Okay. Okay. Great. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'You'd mention that if they. If we move to that next step, they would not be able to rent the property. Would they be able to operate their own commercial business out of there? I would think that would be a no.'",
        "'speaker_0': 'That would be my understanding, Councilmember, that they would be restricted for any commercial activity, their own or anyone else.'",
        "'speaker_2': 'Wonderful. Just wanted to make sure that clarification. Thank you.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_3': 'One last question. I won't stay on this too long, but when you talk about 400 citations and I'm sure there were other activities associated with this property, what was the do we have an accounting or any way to determine what it cost the city administratively to deal with this particular establishment?'",
        "'speaker_0': 'Our office has not specifically calculated the the administrative costs, but I believe those considerations are being taken into account for future consideration.'",
        "'speaker_3': 'But I'd like to know the administrative costs as well as public safety costs in city attorney's costs. And all of the above. Thank you.'",
        "'speaker_1': 'Thank you. Okay. We have any public comment on this item. Please come down.'",
        "'speaker_0': 'We have a motion in a second.'",
        "'speaker_1': 'There's a there is a motion in a second.'",
        "'speaker_0': 'Larry Goodhue, Clerk As we address this very important information and I think the councilman from the third District did a very good job of. Focusing in on the number of calls. That's absolutely a. Astounding and troubling. And. I will send it to the council and to the council district council person.'",
        "'speaker_0': 'I know of two. Locations. Where the number of calls, although it doesn't involve this type of crime, are. The number of calls. Exceeds by, at least. 200%. These numbers for which from which other crimes have. Emanated. And. I would hope that the city would move with dispatch on these two areas and these two locations where point in'",
        "'speaker_0': 'fact, they've been dragging their feet for almost two and a half. Two, four years. Thank you. You'll get information on that by close of business tomorrow.'",
        "'speaker_1': 'Any other public comment? CNN members, please cast your votes.'"
    ],
    "Recommendation to appoint Planning Commission as the Hearing Officer, in accordance with Long Beach Municipal Code 2.93.050, for the purpose of conducting a revocation hearing for the revocation of a business license issued to Damitresse Yancey, dba Mikos Sports Lounge, and for the commercial industrial business license issued to the Ronald L. and Peggy C. Mackey Trust for the operation of a business located at 710 West Willow Street, as well as a hearing on the revocation of the Conditional Use Permit (CUP) for 710 West Willow Street based upon violations of the Conditions of Approval associated with the CUP pursuant to Long Beach Municipal Code 21.21.601.  (District 7)": [
        "'speaker_2': 'Report from Development Services and Financial Management. Recommendation to appoint the Planning Commission as the hearing officer for the purpose of conducting a revocation hearing for the revocation of a business license issued to MICO Sports Lounge and for the Commercial Industrial Business License issued to the Ronald and Peggy McKee Trust for the operation of a business located at'",
        "'speaker_2': '710 West Willow Street, as well as a hearing on the revocation of the cp47701 West Willow Street based upon violations of the conditions of approval associated with ACP District seven.'",
        "'speaker_1': 'Thank you. I'm going to turn this over to Mr. City attorney.'",
        "'speaker_0': 'Mayor and vice mayor. Councilmember Austin has to recuse himself on this item as he has a conflict. And so he will step out of the room during the discussion and vote and then return in his conflict. Is he is a union representative of the owner.'",
        "'speaker_1': 'Okay. And also, I know that Mr. West is going to begin by giving us the staff report. Mayor council.'",
        "'speaker_0': 'Members. We have.'",
        "'speaker_6': 'A quick staff report by our Director of Development Services.'",
        "'speaker_0': 'Amy Bodak, as well as our Manager of business licenses, our business license bureau. Jason McDonald So Amy or Jason.'",
        "'speaker_2': 'Mr. Mayor. Members of the City Council, thank you for your attention to this item tonight. The planning staff recently notified the the business owner that there was consideration for the revocation of their conditional use permit and that a hearing would be scheduled in the coming weeks or months regarding some potential allegations and violations of that conditional use'",
        "'speaker_2': 'permit. As part of our research, it has been determined that there are also potential violations to the business license for the business, as well as the business license for the underlying property. And in an interest of consolidating these issues, it is requested that you consider appointing the Planning Commission as the hearing officer for the potential revocation of'",
        "'speaker_2': 'the business license aspects of this application. That's the short version of the staff report. I and Jason McDonald are here to answer any questions you might have.'",
        "'speaker_1': 'Okay, Canterbury Ranga.'",
        "'speaker_8': 'Thank you, Mayor, and thank you. Voted for that report. I know there's a lot of people here interested in making some comments regarding this item here. So I would let the the people for a public B please line up and speak about this if they want to say anything otherwise.'",
        "'speaker_8': 'I would like to support that this item go to the Planning Commission for a consolidated hearing. I would for sometime in the very near future. And that was your support.'",
        "'speaker_0': 'Please.'",
        "'speaker_1': 'Okay. There's a motion in a second on this item. If you have public comment, now's the time to please come forward and make your make your public comment on this item. Do you have a comment? Please line up so we can go one after the other.'",
        "'speaker_0': 'And each 3600 Pacific Avenue. Hello again. I am in total support of the recommendation to have this hearing. I don't expect to give any testimony tonight, nor should there be any given tonight, only a matter of whether or not to conduct the hearing.'",
        "'speaker_0': 'I do believe that there is a typo in the way this is agenda ized. The second reference to an address on West Willow is 701.'",
        "'speaker_5': 'That would be on the other side of the street.'",
        "'speaker_0': 'I believe it should both reference 710.'",
        "'speaker_2': 'Yes, sir, that's correct.'",
        "'speaker_0': 'Okay. And with that. Good luck. Thank you.'",
        "'speaker_1': 'Speaker.'",
        "'speaker_2': 'Mayor Garcia. Council members. My name is Christy Cain and my husband and I live on the 2600 block of Main Avenue, just across Willow Avenue from Chico's Sports Bar. We are very close to Willow and we see Migos from our front door.'",
        "'speaker_2': 'I am speaking to voiced our support for the closing of Migos. The business has been and continues to be a poor neighbor to the wriggly community. They have ignored the concerns voiced directly to them by the residents affected by the criminal activity of their patrons.'",
        "'speaker_2': 'And they have ignored wake up calls in the form of the denial of their entertainment license and the recent strings of violent incidents that have broken out there over the last several months. We will never forget witnessing the immediate aftermath of the attempted murder of a bar patron that occurred literally in front of our house a few'",
        "'speaker_2': 'days after Christmas. This was followed a few months later by a stabbing. Other problems, while less dangerous, are nonetheless a blight on the community. The bar is so loud that we often cannot keep our windows open on summer evenings.'",
        "'speaker_2': 'This happened as recently as last Sunday morning at 1 a.m.. Bear in mind, we are all the way across Willow, a busy boulevard. That is how loud it is. We also deal with overflow parking on our street and the subsequent 2 a.m. interruptions and littering from drunk patrons that come with it.'",
        "'speaker_2': 'Residents closer to the bar have it even worse than us. MZ Yancy has had the opportunity to work with her neighbors and with the city to address these problems. Instead, she denies and scapegoats. It is time to say enough and revoke the business license of Mico Sports Lounge.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Just as the city attorney also just wants as a reminder that I want to remind everyone so that the motion in front of us is to send this issue and to give the Planning Commission the ability to do a hearing.'",
        "'speaker_1': 'So the motion from the council is not to revoke or not revoke any sort of license or any sort of business. It's to send the issue to the Planning Commission. So obviously make sure you're speaking to that issue.'",
        "'speaker_1': 'The issue in the debate is about whether or not this should go to the planning commission, not whether or not something should be revoked or not revoked. And I just want to make sure that we clarify that for the purposes of this discussion.'",
        "'speaker_1': 'Next Speaker Thank you.'",
        "'speaker_0': 'Hi. Mayor Robert Garcia and Council. I'm Steve Duprey. I'm a member of the Wrigley District and I'm going to change my format and that I would. There's been a lot of violations regarding their planning commission cases. So I'd like you to seriously review them in regard to, you know, the purpose of the business is to enhance the'",
        "'speaker_0': 'local community and increase the property value and the livability of the area. So we need to consider all the violations because it seriously affects the value and the health of that neighborhood. Thank you.'",
        "'speaker_1': 'Okay. Thank you. Next speaker, please.'",
        "'speaker_3': 'How you doing, Mayor Carlson? My name is Hank Norman.'",
        "'speaker_0': 'I grew up in Long Beach. I'm a I'm a local entertainer.'",
        "'speaker_3': 'And Michael's is a is a safe haven in our community. It's a place where community activists we go. We have meetings their. He's allowed us to have meetings there where we can talk about better in our community. And we've got community actually like hashtag, say, Long Beach.'",
        "'speaker_3': 'And the Long Beach players we meet there. And we.'",
        "'speaker_0': 'Have community meetings about.'",
        "'speaker_3': 'Saving our community. So I would just like to say that.'",
        "'speaker_0': 'Michael's is one of those one of the stalwarts in our community. And we need to keep it.'",
        "'speaker_3': 'And keep it going because.'",
        "'speaker_0': 'It's a place where we can come and enjoy ourselves.'",
        "'speaker_3': 'Come out and dress up and have a good.'",
        "'speaker_0': 'Time and get out there and enjoy ourselves without having to go through all the problems. So I just want to say thank you.'",
        "'speaker_1': 'Thank you, sir. Next speaker.'",
        "'speaker_9': 'Hi. My name is Priscilla Quinn, and I'm an employee of Mico Sports Lounge. I've been there from the beginning and in rebuttal to what the lady said about the shooting. That happened not in our bar, didn't start in our bar.'",
        "'speaker_9': 'And I don't know how we are being punished for events that happened surrounding the bar. There's a liquor store on the corner. There's a flower shop on the other corner. They're blaming us for the parking situation because of the traffic.'",
        "'speaker_9': 'We have no control of that. There's an alley is actually not an Alyssa Street, 25th Street, where the cars go up and down. It's not necessarily our patrons that's coming up and down the alley with the loud music or parking on their street Valentine's Day.'",
        "'speaker_9': 'One of the neighbors was upset because they couldn't park, but people would buying flowers from the flower shop. But we were faulted for, you know, people parking in front of their property. Also, I don't know the 250 calls or whatever that's supposed to been made.'",
        "'speaker_9': 'I want to know if all of those calls was for Michael Sports Lounge or for 710 West Willow. Because I have patrons that come in all the time that mistakes are bar for the 710 bar. So with that being said, our crowd is a nice crowd.'",
        "'speaker_9': 'We have a 30 and over crowd. There's never been a fight break out in the bar. The police has never had to come in there and break up a fight or arrest anybody. I'm none of that. Unlike other bars in Long Beach just in January, January 26, where the officer was injured at a bar brawl, there's been'",
        "'speaker_9': 'a stabbing at a bar that's not even a half a mile from us where five people were stabbed. I don't see them being punished. And like I said, I think we're being held as a scapegoat for all the other things that's happening around the bar and they're following us for.'",
        "'speaker_1': 'Thank you. Next speaker. And just just as a reminder, so I'm under the assumption the last speaker is against sending this to the planning commission for for for a hearing. Okay. And I just wanted to make sure we try to keep the conversation within the parameters of of what the motion is in front of us.'",
        "'speaker_1': 'So. Yes, ma'am. Next.'",
        "'speaker_9': 'Hi, my name is Monisha Sara and I'm also an employee of Meiko Sports Lounge and I am also against. You going forward in any kind.'",
        "'speaker_1': 'Of sending to the planning commission?'",
        "'speaker_9': 'Yes. Yes. And I also reiterate what she was saying. We don't have any problems. There is a a nice place. A lot of people come. They have 50th anniversaries, parties and. And it's nothing. Outrageous or outlandish going on there, but people having a good time.'",
        "'speaker_9': 'People park on the street because they're allowed to park on the street. If they if someone wants someone not to park in front of their home, they should have to get an extra one to get a permit for people not to park.'",
        "'speaker_9': 'People park there and go other places. They don't just come in to the bar. And I just want to say thank you.'",
        "'speaker_1': 'Thank you. Next week.'",
        "'speaker_2': 'Hello. My name is Vivian Bonner session and I stay and also stay around the corner from me called the state of 2400 block of Daisy Avenue. I am a single parent. I raised five kids, two that made it to the NFL.'",
        "'speaker_2': 'So my thing is now that Michael is around the corner from my house, I decided to go there just for comfort, not to see fights or to engage in fight. I think it's a safe haven for me before me even open.'",
        "'speaker_2': 'I never attended bars until they open. Now I tend bars and when my kids come back in town from playing in a field, they do visit me also. So I think it's a safe haven and I feel no reason they should be closed.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'Next speaker.'",
        "'speaker_2': 'Good evening, Mayor. Council members. My name is Sabrina David. I'm a 49 year old native of Long Beach, California. I'm also a professional. I'm a banker. I'm a commercial real estate agent in the city of Beverly Hills. I am one of those heathens that patronize me.'",
        "'speaker_2': 'I have never, ever experienced any problems while I was in the bar or outside of the bar. I've never been robbed. I've never felt any fear for my life or my safety, nor my livelihood. I am against the recommendation to send this this to the hearing, to revoke her license, her business license.'",
        "'speaker_2': 'All of my friends are professionals. You see some of them standing before you or sitting before you. That's a place where we go and unwind after a hard day's work. It's a place where we gather and we have an opportunity to meet up with our friends that we haven't seen for 30 or 40 years.'",
        "'speaker_2': 'I personally am like Vivian. I did not patronize bars in Long Beach. I have never been to another bar other than because within the city of Long Beach, I think that it's a shame that we're not being supportive to.'",
        "'speaker_2': 'And in my personal opinion, I think that there needs to be more representation if the neighborhood is not happy with the parking situation. There's a very easy fix for that. There's permeable. Think other areas of Long Beach? No, no.'",
        "'speaker_2': 'There's no parking after a certain at the time. If you don't have a permit, that eliminates that entire problem. If they're concerned about the people that walk down the street or are in the alley, then you're basically going to have to close every business in the city of Long Beach, because I'm pretty sure all of you are'",
        "'speaker_2': 'very much aware of the melee that is occurring within our city. It's not just in the Wrigley. A child and a mother was just killed on ninth Street. I was 10 minutes away from there at that time. That could have been me.'",
        "'speaker_2': 'I wasn't doing anything wrong, and it appears that they weren't either. So this isn't a matter to me of whether or not the participants or the patrons that visit Migos are unruly. There's unruly people throughout America. In case we haven't noticed, that is something that law officials need to get a better handle on it.'",
        "'speaker_2': 'That is not her job to police people who leave her business. It is her job to police the people that are patronizing her business within her business. And she's done a fine job in doing that. Thank you very much.'",
        "'speaker_1': 'Thank you. Speaker, please. And man, before you go, your if there's any other speakers, I'm going to close the speakers list. So just please get in line and then I'm a close, closer speakers list so we can. Okay.'",
        "'speaker_1': 'So I see. One, two, three, four, five, six, folks. I'm going to close the speakers list after the gentleman that's walking that gentleman back there is the last speaker. Then the speaker's list is closed. So these are the final speakers.'",
        "'speaker_0': 'Please go ahead.'",
        "'speaker_2': 'Good evening, Mayor and council members. My name is Deborah White. I am a resident of Wrigley, and I would just like for you to reconsider sending this to the Planning Commission. I think that there are unwarranted. I too patronize Michael's and had not patronized a bar until Michael's opened.'",
        "'speaker_2': 'The 250 calls that I read yesterday in the press telegram that that that they say are being made. Find it hard to believe. But I mean, if that's the case, that is the case. But please take into consideration the people that are coming before you today, the professionals, the ones that feel very safe going there.'",
        "'speaker_2': 'If if I didn't feel safe, I wouldn't be going there. And as I said, I am a resident. I live probably two blocks away from the bar. And I just want you to look at the accusations to me that are unwarranted and reconsider sending this to the planning commission.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'My name is Trinidad Renfroe.'",
        "'speaker_2': 'I'm a 46 year old and I am a 42 year resident of the Wrigley. This is I am. First of all, I want to say I am against the recommendations that you that we have before us against Michael's.'",
        "'speaker_2': 'And I just want to tell you that this is the first bar that I have been able to bring my family to for different occasions as far as baby showers, birthdays.'",
        "'speaker_4': 'And all those above things. And I think that.'",
        "'speaker_2': 'It would be a very, very sad story if you guys would.'",
        "'speaker_4': 'Go against what the.'",
        "'speaker_2': 'People are here to speak about. Michael's is not the only bar on Willow. There are a few bars on Willow.'",
        "'speaker_4': 'And I feel that if.'",
        "'speaker_2': 'We are going to condemn her.'",
        "'speaker_4': 'About these different.'",
        "'speaker_2': 'Allegations, these same allegations are against the other bars that are on Willow, also. So I'm just saying that please take in consideration everyone that is speaking here, because we're here for a reason and we're here to support Michael's Bar.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_0': 'My name is David Pittman. I live on Main Avenue, very close to the bar.'",
        "'speaker_7': 'My neighbors and I were all going to speak.'",
        "'speaker_0': 'Actually, I wasn't even prepared to speak because we thought that this was going to come on around 7:00. So they will be showing up, I guarantee you. We are thrilled that this is coming before the the council and to be recommended to the planning commission.'",
        "'speaker_0': 'This has been going on for two and a half years. It's an incredible nuisance, over 250 calls to the police. And let me also say that many of those calls are doubled up when they give us a call number.'",
        "'speaker_0': 'They put two and three calls on the same number. One of my neighbors. Who lives the closest to the bar. Recently, regretfully had to sell his house and move because he could no longer take the noise, the rudeness, the behavior of both the staff.'",
        "'speaker_0': 'And the patrons of the bar. And I just feel sorry for the person that bought that house. But we urge you to put this forward to the Planning Commission, and I assure you my entire group will.'",
        "'speaker_7': 'Be there at that.'",
        "'speaker_0': 'Meeting. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening. Good evening. My name is Randi Hall, and I'm a lifelong Wrigley resident as well. I'm here to say that I'm totally against the recommendation, and it's kind of upsetting to me personally to try to destroy somebody's dream.'",
        "'speaker_0': 'Based on a personal vendetta, you cannot attribute what goes on outside of cause, which goes on in pretty much every neighborhood in Long Beach to make out. There was a shooting. Yes, with a patron, whether by the person that committed this crime.'",
        "'speaker_0': 'And Michael's name. There are lots of things that go on in that neighborhood that need to be addressed. There's a homeless problem in that neighborhood. You can interview that to me. Can you? You can't. I'm just here to say don't destroy somebody's dream based on a personal vendetta.'",
        "'speaker_0': 'And that's all this is a personal vendetta. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_0': 'Good evening. My name is Vincent Lawrence. I'm a 57 year old resident of Long Beach. I've been here basically all of my life, except for when I was in college. I left to play pro ball and I came back.'",
        "'speaker_0': 'I've also been a peace officer, Compton PD. And, you know, the things that I see sometimes that go on, they're not right. I was hired by D.D. and a staff of mine. We patrolled that place. She wasn't having events.'",
        "'speaker_0': 'We would have somebody out the front door. We would have somebody in the alley, which if you lived in Long Beach and you know it. That's not an alley. That's 25th way. That's a street. Now, as far as I remember, there's a liquor store on the corner.'",
        "'speaker_0': 'I chased homeless people away from from urinating in that alley. We don't sell 40 ounces. We don't sell drugs. But I'm chasing people through the alley. That's not Diddy's responsibility. You know, the 250 calls. I'd like to see the proof of it.'",
        "'speaker_0': 'We had a book. Every time they come out. And after being a peace officer, it really saddens me to see this go on here. And the police officers that come out have said there's nothing going on here. There was one night in particular where five times the officers came.'",
        "'speaker_0': 'And the resident that you're talking about, the gentleman that so-called moved, he was upset because officers didn't do anything and the officers told him, we're not coming back out here. I introduced myself to him and he kind of had an attitude with me and I said, Sir, I'm here to make this work.'",
        "'speaker_0': 'We can work together. I gave you my name. I gave you my number. And I never heard from me. Every time when we're there, she has us there sometimes on Friday and Saturday nights. There's nothing going on. It's sad that there's a liquor store there and people are driving from that liquor store now.'",
        "'speaker_0': 'It's sad that women are selling flowers on Valentine's Day at 230 or three in the morning. They're blaming me cause. Somebody said earlier, Didi is supposed to take care of two people in the bar. We take care of the people around the bar, inside the bar and behind the bar.'",
        "'speaker_0': 'We try to pick up trash and stuff at night. That's not our responsibility. We make sure we know people go out, they have McDonald's and this and that. And the gentleman who stays behind us, he has cameras faced on us.'",
        "'speaker_0': 'All you got to do is pull his cameras and you see my security people doing that. I'm just saying, I don't think this needs to be gone. It's like they're trying to blow her dreams. You know, she has the right to do like everybody else to make a living and have a place for the people in Long'",
        "'speaker_0': 'Beach to go and come back and be proud of not to be chased away because of prejudice, because basically that's what it is. You know, I heard the lady say that she lives across Willow. You can't hear anything across Wall because we have the doors close and your sound walls in there.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you, sir. Next speaker.'",
        "'speaker_9': 'Hello. My name is Demetrius Yancey. My friends and family know me as a Dee Yancey. I am the owner of Make All Sports Lounge. I was basically here, too. I know that you guys have a list of items that I supposedly violated.'",
        "'speaker_9': 'I'm here to let you guys know that I in no. And every way I'm trying to come with in compliance. I received a letter from the planning commission or whomever it was that asked me to give a security floor plan of my security.'",
        "'speaker_9': 'I contacted Detective Burress, Laurie Barry. I was worried. Would she? I asked her, what did I need? She told me, Just get your guard cards from your security and give me a floor plan of how you have it laid out.'",
        "'speaker_9': 'I submitted that to her. I submitted all the documents that the city asked for. I got additional five parking spaces. Yes, I did put the wrong date on there, but I did everything the city asked before. When they returned it back to me, they said I was out of compliance with my security because I should have two'",
        "'speaker_9': 'security at 7:00 and one that comes in at ten. Now, they wanted me to have that. They should have said that. They just asked me to do a floor plan. How was I supposed to have my security when undercovers came in and they said I was outside of the my permit?'",
        "'speaker_9': 'I had they documented this having eight customers in a bar. What eight customers do I need to security? At $80 a watt. And then I need another one at 10:00. No. So I don't see that as a need for the city to tell me to have security and have different things that's not needed.'",
        "'speaker_9': 'If you guys are coming after me because I've had a shooting outside my bar, I had a stabbing, which I believe was a plant outside my bar. I don't know who tried to commit suicide outside the bar, even though alcohol is a depressant, but nobody on a Sunday.'",
        "'speaker_9': 'I have a bartender back here. Well, gee was like about seven or eight people there on a Sunday night, crowded like out there. Say, if you want to replicate my license because of me having these six items and over 250 calls which have not been validated, I need you to then go ahead and revoke the license.'",
        "'speaker_9': 'Panama Joes. Legends Tailgate. Todd Bowles. Give me 70 and bar. I need all those bars revoked too, because they have done worse than I have and they've been open for 60,000 years. Stabbings, killings, shootings. Seven Wardlow Station had a security guard and a patron shot inside.'",
        "'speaker_9': 'There was no coverage of that at all. I had somebody shot outside my bar 70 and had somebody at the same time. Media coverage everywhere. Two people got shot at. Wardlow stated nothing but I'm getting revoked. Revoke all the bars license.'",
        "'speaker_9': 'Thank you. You are welcome, sweetie.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_9': 'Hello. My name is. And to make Michael Lewis. And part of me goes for snatch. I'm a bartender and I have been bartending for turbos and duties. And as a bartender, I have never seen what I have seen between them two at our own bar.'",
        "'speaker_9': 'What you guys put heavy on us? I'm not putting the blame in on what I'm trying to bring out in our problems because you both to worry about your own. But I'm just saying, as example, that I have worked at these bars, L.A., the bottom line in which you how you are coming at us and what I'",
        "'speaker_9': 'have seen throughout me working as Bartell. That's okay. I won't do that. I won't say foul play. That's not writing for Justin and neighbors in Harlem next door. How long that bar? I've been a 40 years before we got there.'",
        "'speaker_9': 'We can find the stuff at the bar in a way before work. So which makes it different from us being there when it was there before us. So what were the complaints when it was KBR, the Mai Tai Sandbar, all that?'",
        "'speaker_9': 'So what makes it different from us that we black women and we want something? So what's the difference? That's what I want to know. Want to answer that? No. Because what's the problem? That what he's talking about? You know, when you moved in that place, it was a bar there where before you even decide to move into'",
        "'speaker_9': 'Wrigley. So how do we have the guidance to control about what's going on around there with way before us? So the the blame is all he told is on us. And I don't understand that. Like I said, the shootings like say across the street, they come from other places drunk, want to come to the last minute, make'",
        "'speaker_9': 'their last rounds, and they bring them problems with them with the last rounds. So but in the case. And that's because why the night within the damn calls. And that's a shame that you guys allow it just because they can call it means from any time the police have came and nobody knew that they were mad.'",
        "'speaker_9': 'So by your being wasting your time in this city for doing nothing, you actually can add to what the residents because they're waiting all the time because it was a waste of noise. I have a beautiful day.'",
        "'speaker_1': 'Thank you. All right. Sorry. You're going to. I've closed the speakers list. I'll let you go ahead. But you're going to be the last person. I can't I cannot keep allowing people to speak. So, ma'am. Hey, guys, guys, guys, I'm going to go ahead that I'm going to go ahead and let this gentleman speak.'",
        "'speaker_1': 'Ma'am, if you are, you and I have to close the speakers. Listen, so I understand there may have been a confusion about the time certain I guys. Okay. And I'm making it fair. And from what I understand, there was a confusion about the time certain for certain people.'",
        "'speaker_1': 'And so I'm trying to be I'm trying to ensure that there's the people that are here to speak on it, can speak on it. And we'll we'll clearly want to make sure if there is a time certain. From what I understand, some people thought it was six, that people thought it was seven.'",
        "'speaker_1': 'Okay. Well, I. I didn't. Well, ma'am, I can't I know nothing from no speaking from the comments please. From the sections. So, sir, you can go ahead and speak. I'm going to close the speakers list, ma'am. So this is the last.'",
        "'speaker_1': 'This is the last. The last gentleman. Well, listen. Hold on 1/2. Give me 1/2. Charlie, can you for 1/2? Sir. 1/2. Okay. We're going to do. Listen up. What we're going to do is because this is a possible hearing and it's a sensitive issue.'",
        "'speaker_1': 'I'm going to allow if you want to speak on this issue, you can lineup right now and I'll allow you to speak on it. And then I'm closing the lesson. Last call right now. If anyone else wants to speak on this, please come forward.'",
        "'speaker_1': 'Okay. So please come forward. And then I'm closing the speakers list as the last call. And we're just doing this because it's a it's a it's a sensitive hearing of the possible appeal. So. Okay. This is it. Last call.'",
        "'speaker_1': 'Okay. The four people can speak. Go ahead, sir.'",
        "'speaker_0': 'Thank you. My name is Rick Europaischen. I'm the one who owned two houses right behind the bar. I'm the person that was the most affected by the bottom. You know, I lived in that house for 17 years, and two of my kids were actually born and raised there.'",
        "'speaker_0': 'I have no plans of moving very comfortable. I love my neighbors. I love the neighborhood. You know, one of the speakers mentioned earlier that we knew when we bought the house it was a bar. And you're absolutely right.'",
        "'speaker_0': 'But it was a neighborhood boy, not a nightclub.'",
        "'speaker_1': 'Hey, guys, we everyone has an opportunity to speak and be respected at the mic. So please, no outbursts from the audience. Continue, sir.'",
        "'speaker_0': 'So all the problems that they feel that they're not responsible for in the beginning, call the police. By the time the police will get there, the answer is whatever that might be, where there was loud people drinking outside, urinating on my mind, on my yard, doing number two on my yard, all those kind of incidents.'",
        "'speaker_0': 'We have proved that, ma'am. We have proof of that. So I had to put cameras on the house just to be able to prove that. And if they want proof, there's plenty of including Mrs. Miss Yancy, you know, acting like she is God and she can do whatever she wants.'",
        "'speaker_0': 'And I have it in video, record it. So I'm not here to do any personal or become any personal because I did deal with it for two and a half years. I moved. I took a hit on the house.'",
        "'speaker_0': 'I had to make personal sacrifices. So you talk about someone's dream, you know, for a bar. I'm all for that. I'm I'm a business owner for over 20 years here in Long Beach. Some of you know me already for for many for many years.'",
        "'speaker_0': 'And including the gentleman that spoke earlier, which is a police officer, I actually sold time to his wife. So, yes, absolutely. But the way he approached me when he did it wasn't the way he mentioned or polite. It was all every time through it.'",
        "'speaker_0': 'And you know what it's like to be threatened at 2:00 in the morning, 3:00 in the morning, people knocking on your door, mentioning by name. And I have proof of that as well, too. And also people are telling me they want to f me they're going to go.'",
        "'speaker_0': 'So I was afraid we left because I was afraid for my family's safety and for my safety. So you want to consider that? I want before I urge you to take a look again, I don't want to kill anyone's dreams.'",
        "'speaker_0': 'But why this shadow of mine? I have to make sacrifices. And before you guys consider body, put yourself in my shoes, please. Thank you for the time.'",
        "'speaker_1': 'Thank you. Next speaker, please. Next speaker come forward, and then we have the two ladies after her, and then we're done with the speaking.'",
        "'speaker_2': 'Good evening, Mayor, and thank you for allowing me to speak. I'm an employee. I've been there two years. I'm a single mother, which I most definitely would not put myself in a position not to come home to my son.'",
        "'speaker_2': 'As far as the noise. That is so not true that front doors shut and she is adamant about keeping that back door shut at 8:00 or we get in trouble. It's terrible. But we have to live together, work together and try to make it work for everybody.'",
        "'speaker_2': 'This man bought his dream home, left and came back. So, you know, as far as people outside and the stabbing, actually, I was working that shift. He wasn't even from he wasn't even in the bar. He came running off the street in.'",
        "'speaker_2': 'There was something from somewhere else that came running from way down past the pizza place. So I most definitely, again, would not put my son's life or my life and this is my livelihood as well as a lot of other employees there.'",
        "'speaker_2': 'So we just try to come to a medium. Of course, I'm against sending it to the commission, come to meet medium and work it out. I've heard my CAC speak with the gentleman in the back. It's almost like he is looking and antagonizing.'",
        "'speaker_2': 'He's, you know, looking for a reason. We will be there was four women leaving the bar one night. It was myself, the two owners we have, we're leaving. And it was not like we were thinking like giving hugs and saying, have a safe trip home.'",
        "'speaker_2': 'And he came out yelling at us all to go home. So I'm sure there are loud incidents that surround the area. But again. You can't justify closing a bar or yanking her rights or her her license because of what happens outside.'",
        "'speaker_2': 'Like I said, officers have come in, walked through, said they've come back on an off shift. Thank you for listening. Have a good evening.'",
        "'speaker_1': 'Thank you. Speaker.'",
        "'speaker_2': 'Hello, everybody. My name is Kerry Sanders. I just live a few doors down from the bar. I wasn't planning on speaking, so I don't have anything prepared. I just am appealing to you to please consider rescinding the license based on the fact that.'",
        "'speaker_1': 'Just as a reminder, we don't rescind the license. It's appealing to us to send us to the Planning Commission for hearing.'",
        "'speaker_2': 'Okay. Obviously, I'm not prepared, but my my issue here, I've only lived there for a year. I got very lucky in being able to buy a home. I never thought I would be able to. And I bought my home there.'",
        "'speaker_2': 'Nothing was disclosed to me when I bought the home about a nuisance problem. You know, I'm not saying there is. There isn't, you know, in my opinion there is, because I've lived there a year and I've seen a lot of things and heard a lot of things.'",
        "'speaker_2': 'Uh, I've never talked to my fiancee or anybody, but I, you know, I, myself and my daughter live there. And I remember.'",
        "'speaker_4': 'Many nights.'",
        "'speaker_2': 'When I just hear a lot of.'",
        "'speaker_4': 'Screaming and yelling.'",
        "'speaker_2': 'People obviously drunk because I used to drink. I know what it's like, you know.'",
        "'speaker_4': 'Just going at it in the middle.'",
        "'speaker_2': 'Of the night or going giggly in the middle of the night on the way to the car to go home after partying. And then there was the incident where I was sleeping and my daughter woke me up at.'",
        "'speaker_2': 'I forget what time it was. To tell my mom I heard gunshots, you know, and it was like, come to find out that was somebody getting shot in the face. And this is my American dream where I'm living.'",
        "'speaker_2': 'Somebody is getting shot in the face steps from my house. And I'm just I was in shock. It was I think it was Christmas Eve, the day after Christmas, something like that. I don't remember exactly because I obviously I'm not prepared.'",
        "'speaker_2': 'But, you know, I I am all for her having a business. I just don't think this is the right place for a nightclub atmosphere. There's no parking for it. You know, my daughter has to park sometimes down the street as some of the other residents.'",
        "'speaker_2': 'And, you know, I understand everyone needs a place to have fun from time to time. I just don't understand why it's so difficult to, you know, real in, you know, the people that are leaving from the bar. I've you know, I've I've frequent in bars when I was younger and a lot of times there's security around they're'",
        "'speaker_2': 'telling you, you know, on go home. You can't just hang out. Well, that doesn't happen around there. Just last weekend, there was somebody hanging out in front of my next door neighbor's house just drinking from their car. And my dog started barking.'",
        "'speaker_2': 'It was like midnight. That's what goes on on a weekly basis, and it's hard to sleep. So I'm just asking you to please go forward, send this to the council and thanks for listening to me.'",
        "'speaker_1': 'Okay. Thank you. And then this is our last speaker before this goes back for discussion at the council. Go ahead.'",
        "'speaker_9': 'Hi, my name is Jeannie Moreno. I am kind of a little sickened by what I've heard since I've been here. A lot of the residents have stated that they haven't spoken to me, Nancy. They don't know why my fiancee allows the things to go on and around in the perimeter of the bar.'",
        "'speaker_9': 'Unfortunately, her character has been assassinated here today. I have no Ms.. Yancy, I am 52 years old, August 12th. I have known Ms.. Yancy for over 40 years, and I know her character, I know her intentions, and I know the type of businesswoman that she aspires to be.'",
        "'speaker_9': 'And it's not somebody that wants to bring havoc into a neighboring community that she grew up in. Okay. It's a it's a haven for a lot of us that most of the people that patronize that bar, I don't want to say most of us, they everybody that patronized that bar have been classmates since elementary school.'",
        "'speaker_9': 'We all know each other. We all look out for each other. We all help her, police that area to make sure that she is successful in her business. It just seems to me that every time a community sees a a group of black individuals get together and we try to have fun.'",
        "'speaker_9': 'We try to communicate. We try to be together as one. It's always looked upon as a place that needs to be shut down or a place of danger. Well, that's my opinion.'",
        "'speaker_1': 'I guess. No, we're not having outbursts from them.'",
        "'speaker_9': 'I just feel that she's being victimized on that aspect. And I understand that this gentleman lived behind her, be on and outside the business. But sometimes when we purchase property and we are in an area where there are businesses, liquor stores.'",
        "'speaker_9': 'Several bars. Flower shop. There's all kind of things that going on in that community. We have to understand that there's a possibility that the purchase we making, if it's a family house that we're buying, that we may want to reconsider where we placing our families.'",
        "'speaker_9': 'So I say that to say that people have to understand that the decisions that we make, we have to take responsibility for those decisions. And I understand that you relocate it. It's no longer a problem for you. So when people's businesses are trying to prosper, it's always unfortunate when it's an African-American business.'",
        "'speaker_9': 'That's always viewed as a problem. In Long Beach. This has been constant. We have to shut it down. We have to stop. People like myself don't normally get in a political situation. But when it when you don't speak.'",
        "'speaker_9': 'This is when problems and things persist. I had to say something tonight, and I'm glad I did.'",
        "'speaker_1': 'Thank you. What? 1/2. Councilmember Ringa and then I have a couple of council members that won't make it. They'll want to comment.'",
        "'speaker_8': 'First of all, I want to thank everybody who came down tonight to speak on both sides of the issue. Just as a reminder that this tonight was not a hearing. So a lot of the testimony that you provided and I can't go into the record there is going to be a should this item move to a planning'",
        "'speaker_8': 'commission. That would be the opportunity for everyone to come in and testify and give your opinions and your viewpoints and whatever evidence you have on this issue. So tonight, it's an administrative procedure that we have to conduct to determine that the planning committee will be the hearing officer.'",
        "'speaker_8': 'They will hear all the evidence. They will hear the staff report more at length with everything that has been out, that appeared even in the paper. And then at that point, all the the evidence can be presented and then the planning commission will make its decision.'",
        "'speaker_8': 'The decision is not here tonight. We are simply putting it to the Planning Commission for a hearing, and they will schedule it and have the hearing at some future date. So I strongly encourage you, those who spoke tonight to contact our planning, our our Development Services Bureau man, our bureau bureau department head to get a schedule as'",
        "'speaker_8': 'to where the Planning Commission will meet again so that you are notified and you can attend that planning commission meeting to again provide your testimony. So I want to thank you for being here tonight. Unfortunately, we can't accept all your testimony for a hearing because this is not a hearing.'",
        "'speaker_8': 'This is simply to refer it over to the Planning Commission for a hearing on some future date. But again, thank you for being here.'",
        "'speaker_1': 'Thank you. I'm going to have a couple of speakers from the council. And just as a reminder, there's a motion by Councilmember Turanga to send this to the Planning Commission for a hearing. Councilwoman Gonzales.'",
        "'speaker_4': 'Yes, I have a question. Is justice is a part of process. I understand, you know, the conditions were not met from what it states and then the police calls for.'",
        "'speaker_2': 'Service were high.'",
        "'speaker_4': 'But what was the defining moment for us to be able to refer it over to the Planning Commission? I'm just trying to.'",
        "'speaker_2': 'Clarify that there was continued issues with their entertainment permit and continued issues with their inability to comply with the voluntary conditions of the business license combined with ongoing issues with the conditional use permit. So combined, those triggered us to consider this a potential nuisance property and the Planning Commission would have the hearing of the CFP.'",
        "'speaker_2': 'At that point we investigated whether there were other issues related to the business license because those tend to if there's tends to issue be an issue on the land use side, there also tends to be an issue on the business license side and discovered that there were significant issues related to the lack of an entertainment permit and'",
        "'speaker_2': 'the continued entertainment that was going on. Okay.'",
        "'speaker_4': 'Great. Thank you very much.'",
        "'speaker_1': 'Camera. Go to Vice. Vice Mayor Richardson, who is the second? Let him make some comments.'",
        "'speaker_3': 'Thank you. Thank you, Mr. Mayor. So I just want to. A couple of things I want to say, thanks to Councilmember Durango. First, for walking us through very clearly what the next steps are in this process. And my own my thoughts here that are in here, and I'm not familiar with with, you know, this bar or that'",
        "'speaker_3': 'surrounding neighborhood. And that's why I believe, you know, I support the fact we have districts and you have an elected representative who who's really task of figuring out the balance between neighborhood, neighborhood needs and business interests. And and so you are the local expert I'm going to defer to on this.'",
        "'speaker_3': 'But I will say, you know, there a threshold has clearly been crossed. And I want to see that everyone can achieve their dreams. So a process has begun. I encourage you all to engage that process, both the residents and the community, because we've actually never done this process before.'",
        "'speaker_3': 'We've never revoked a copy in the city's history. So this is the first time we've done this, you know, as a city. And I and I encourage it. We're all learning here. So I want you all to kind of go through this process and let's see what happens.'",
        "'speaker_3': 'But ultimately, you know, this is really about making sure there's a balance between neighborhood interests and community needs. And and frankly, when businesses make it easy for the city, businesses make it easy for the city council when they work out a lot of this stuff before it even gets here, frankly.'",
        "'speaker_3': 'So so those are my comments. And again, Councilmember Ranga, I'll be somewhat supportive of your motion.'",
        "'speaker_1': 'Councilwoman Mungo.'",
        "'speaker_2': 'For development services. What was the date of the original initiation and notice to the bar owner related to the first violation? And how long does the bar owner get to correct the issues? Madam Councilwoman, I don't have that information with me.'",
        "'speaker_2': 'There were some previous meetings that did occur between business license, police special events and development services with the property owner. Excuse me, the business owner. I don't have the specific information on the first time it was it occurred.'",
        "'speaker_2': 'But then we did send a formal letter announcing the potential conditions, violations in June of this year and asked them to immediately comply with those conditions. And we have not heard a response from them to date. So typically we give a first meeting and longer than 60 days before it comes to this body.'",
        "'speaker_2': 'Typically, we have many more interactions. And do you give property owners and business owners the opportunity to come into compliance when there are continuing issues, though, we continue to move towards a process of revocation but are absolutely willing to continue those discussions up until the point of a hearing.'",
        "'speaker_2': 'So if within the last 60 to 90 days they had become in compliance, you would not be recommending this. Go to the Planning Commission today. That is correct on the CFP, but there are also business license issues as well.'",
        "'speaker_2': 'So we would have to look at that as well and. I would say that assuming that all of the land use conditions under the cap come into compliance, there would need to be continued compliance and not relapses because those those also have a tendency to occur as well.'",
        "'speaker_2': 'What is the process look like? If this body did not vote to move this to the planning commission, what would be the next steps? So the CFP revocation would still go to the Planning Commission. They see their business license revocation, if it were to proceed, would actually occur at this body and not at the Planning Commission.'",
        "'speaker_2': 'So this is actually giving an opportunity for a consolidated, more streamlined process for both those in favor of and those against it. Yes, ma'am. Okay. That makes a lot of sense. And I think that that is a good recommendation for actually both sides, that they wouldn't be leverage to come to two bodies to make their cases.'",
        "'speaker_2': 'So I'll be supporting this motion.'",
        "'speaker_1': 'Councilman Andrews?'",
        "'speaker_0': 'Yes. Thank you, Mayor. First of all, I'd like to thank everyone who's coming out tonight to really support Mico and Amber, because the fact that maybe I should have to, you know, even withdraw from this, because the fact that I've known Michael ever since she was a little child, I know the father.'",
        "'speaker_0': 'I know the whole family. And the biggest part about all of this is what I'm hearing is that here's the young lady and her group is trying to start a business and make her life better. And I think that's what all the American dream is, is to try to open up a business or get yourself a home'",
        "'speaker_0': 'and do something is right for you and your family. And what I'm hearing tonight is that, you know, seems like the two sides, you know, the the landowners and the the individuals, the business owner. And I think somehow along the way, I know Michael has done everything she could to try to keep these things in order.'",
        "'speaker_0': 'What happens outside? I've been there many, many times. This is where I go when I get off from work in the evening, and I've never seen any problems in that place. Now, the other things that happened, I'm not there, you know, 24 seven, but when it's open, I'm there.'",
        "'speaker_0': 'And I've been there many, many times and I've enjoyed being there. And I think it's a safe haven for many, many people, and especially people of color, a place to go and sit down and enjoy themselves and really, you know, do something that we haven't had a chance to do.'",
        "'speaker_0': 'I've been here for 70 years, and I know that we've only had three bars of people of color. And most of them, you know, like you say, they have their problems here and there, but nothing like some of the problems I've seen and heard of in the city of Long Beach.'",
        "'speaker_0': 'Michael, I know you know what you have to do in order to keep yourself in compliance with what they're telling you to do. That has to be done. You know what? We know it. I would just hope that you and your your community can get together and really sit down and try to solve this problem because you'",
        "'speaker_0': 'have a great business. This business shouldn't have to be closed because of the outside elements that's causing the problems. It's not your business. It's that outside elements. And I know the people who live in that district there. They should understand that, you know, we have problems all over.'",
        "'speaker_0': 'I would just hope that this would be able to be resolved somehow before we get to the point of telling that you really have to close your business. I would hate to see that happen, and I'm hoping that everything works out.'",
        "'speaker_0': 'And with that, I just hope things work out. Thank you.'",
        "'speaker_1': 'Council member Pearce.'",
        "'speaker_10': 'Thank you, Mayor. I also want to thank everybody for coming out today. It's moments like these when when we want to support minority owned businesses as much as possible, especially women owning businesses. And so I want to follow suit with Councilmember D and just urge that in between now and the time that we move forward, that there's'",
        "'speaker_10': 'some community dialog between you guys and the residents of folks who haven't talked to the owner, you know, trying to sit down and figure out where we're at and how we can get into compliance quickly and be good neighbors together.'",
        "'speaker_10': 'And it's these moments that are really tough, that really take kind of putting some of our pride and some of our assumptions aside so that we can figure this stuff out. I did have a question when will this be going to the Planning Commission?'",
        "'speaker_10': 'Should we vote to move this?'",
        "'speaker_2': 'We have not yet scheduled a hearing date and it will be sometime in the next couple of months. Okay. Okay. Thank you.'",
        "'speaker_1': 'Okay. Thank you. But just what? Just a pressure thing there kills me.'",
        "'speaker_0': 'If.'",
        "'speaker_1': 'You're. There you go. Okay, Councilman.'",
        "'speaker_0': 'I just have a question. Mrs. Wodak, if it go once it goes to the planning committee, how long do they have in order to, you know, make a decision? Or do they make a decision? And does it come back to us for us to make a decision.'",
        "'speaker_2': 'On the CFP revocation, the planning commission would be the deciding factor. Their decision could be appealed to the City Council on the Business License revocation. I believe that is also the case. Charlie. Excuse me. City and Mr. City, attorney.'",
        "'speaker_0': 'That is correct. It could be appealed back to the city council. Also the decision of the hearing commissioner then could be decided in front of this body. So in other words. So in other words, during that time, they would have a chance to really get together and take a lot of.'",
        "'speaker_2': 'These notes or that would really need to happen before the hearing.'",
        "'speaker_0': 'Yes. Yes.'",
        "'speaker_2': 'Before the compliance needs to be before the hearing and it needs to be absolutely consistent.'",
        "'speaker_0': 'Yes. Michael, where are you? You understand that? Thank you. Yes. Thank you very much. Yes.'",
        "'speaker_1': 'Okay. Thank you. And just to clarify that point, I think it's important for everyone that's here. I know the neighborhood folks here, the owners of the bar and patrons. So the process is if this goes to the planning commission on both the license and the Cup issue, but a planning commission makes a decision and if they choose'",
        "'speaker_1': 'on that decision, what they decide on can both be appealed and it will end up back at the council anyways. Is that correct?'",
        "'speaker_2': 'It could be, yes. Okay.'",
        "'speaker_1': 'So just to. So essentially it goes planning commission. If the planning commission makes a decision one way or another, I'm assuming.'",
        "'speaker_2': 'That is correct.'",
        "'speaker_1': 'So regardless of the of of the vote of the Planning Commission, whether it's one way or another, it will come it can come back to the city council if it's appealed. So there's two steps to that. I just want make sure everyone's aware of the process so that everyone understands that process.'",
        "'speaker_1': 'Councilman, your.'",
        "'speaker_8': 'One last comment based on what I've heard so far. There is a window that we have between now and the date that it's scheduled to go to the Planning Commission. I want to offer my office to mediate a meeting between Nico's and the community to come together so that we could start making some progress on this.'",
        "'speaker_8': 'Because the last thing we want to do is to break anybody's heart, break anybody's dreams, what they want. And I'm sure that the D.A. is is wants to make sure she has hers. But we also have a neighborhood that wants to live in peace.'",
        "'speaker_8': 'So I think that if we could do this between now and a planning commission and come up to a mediation, that would be wonderful. Otherwise, the process will continue because we've already set this in motion. So I ask again that my colleagues support the motion to go to the Planning Commission, but I want to also emphasize that'",
        "'speaker_8': 'between now and then that I hope we can get together and come up to a solution that would be amenable to everyone.'",
        "'speaker_1': 'Okay. There's a there's a motion in a second to send the this issue to a planning commission hearing, which is the first step in this type of process. And so with that, members, please go ahead and cast their votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay. The council has voted. We're going to we're moving on to the next item. We're actually, I believe let's see, it's seven, which we're going into the budget hearing now because we had a time certain for that. So we'll go into the budget hearing and then when we come out of the budget hearing, we'll go back to'",
        "'speaker_1': 'the regular agenda. Thank you. And we're just going to take just a one minute recess so that we can get set up for the budget hearing. And we'll be right back. You guys.'",
        "'speaker_0': 'I know. I know what I. And I'm like, Yeah, I don't think I want to. We don't. I would like to tell them that. Oh, yeah. Like a little boy. Okay. I mean. So a presentation that do. Yes.'",
        "'speaker_0': 'Education.'",
        "'speaker_7': 'Something.'",
        "'speaker_1': 'We're going to go ahead and start the council meeting the hearing again. Can I please get a roll call?'",
        "'speaker_2': 'Councilwoman Gonzalez. Councilmember Pierce. Councilman Price. Councilmember Surinam.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Councilman Andrews. Councilmember Muranga. Councilman Austin. Vice Mayor Richardson. Mayor Garcia.'",
        "'speaker_1': 'I'm here. Thank you. We're going to go right into the budget hearing for fiscal year 2017. So I want to turn this over to Mr. West.'"
    ],
    "Recommendation to approve Mayor's designees as argument writers for the two Long Beach ballot measures appearing on the November 8, 2016 California Statewide Election ballot.": [
        "'speaker_1': 'Thank you. Okay. Now we're going back to the council agenda. And we're going to first hear items 24 and 12 and 20. I've had requests hold on, 24, 12 and 14, and then we'll do the rest of the of the item.'",
        "'speaker_1': 'Okay. First up, item 24.'",
        "'speaker_2': 'Communication from Mayor Garcia Recommendation to approve Mayor's designees as argument writers for the two Long Beach ballot measures appearing on the November 8th, 2016 California statewide election ballot.'",
        "'speaker_1': 'Think you just want to go over the process on this similar to how we did it for Measure A, the clerk put out a call for argument writers that was published published in a couple of the publications as well as press release and in her media and social media.'",
        "'speaker_1': 'So that went out for the two city items, all for the regulation of medical marijuana business item. There were six folks signed up for one that signed up against for the Long Beach marijuana taxation measure. There were three that signed up for two that signed up against.'",
        "'speaker_1': 'I put all the names signed up on there with the exception of one person that was the additional person on six for the four of of medical marijuana businesses can only have a total of five. And so the one person that was not placed there was double place on the against line anyways for the second measure.'",
        "'speaker_1': 'So they got a chance to do the other one. So let me read those names in case you don't have it in front of you. Regulation of medical marijuana businesses. Six people applied Bob Kelton, D Andrews, Janine Pearce, Toni Tauranga and Randy Houser.'",
        "'speaker_1': 'Five mispronounced that name. The six person that applied was Diana La Jean's. So the the first five were the ones that were selected and Bob Kelton is selected as the lead in that group. The guests with Mark Greenberg on that only one person applied on the Long Beach marijuana taxation measure.'",
        "'speaker_1': 'Three people applied. Robert Garcia, myself, Mike Terry, who's the fire chief, and Robert Luna, who the police chief two people signed up against, which is Larry King and Diana La Jean's. Larry King will be the lead proponent on that and I will be the lead proponent on the fourth side.'",
        "'speaker_1': 'In addition, as a reminder, if a name of a name is a has an asterisk on your form, it means are the lead proponent. They have final say in approving argument and lead writers may add more names provided there are open slots, but that's less than five on an argument.'",
        "'speaker_1': 'So if, for example, Mr. Greenberg, since he was the only one, if he would like to find other people to add to his list, he's welcome to do so and so on. And this follows the charter process that the the city attorney and the city clerk worked on for this process like they did for measure.'",
        "'speaker_1': 'Right? So with that, there is a a motion and a second. Councilman Austin, do you have any comments? Councilwoman Gonzales, do you have any comments? I'm sorry. Is that a yes or no? Okay. Councilwoman Price.'",
        "'speaker_4': 'I do have some comments, and it would be much easier just to not say anything. But you all know me well enough to know that I won't do that. I'm a little bit disappointed, honestly, in saying that two of my colleagues have signed on to support this initiative.'",
        "'speaker_4': 'And although we all have the right and the freedom to express our our opinions and our interests, and we have the right to free speech as representatives of the city of Long Beach, with a fiduciary duty to care for the residents of this city, I would ask them to reconsider signing on to this for for a variety'",
        "'speaker_4': 'of reasons. One, the legislation that's proposed limits the police's ability to investigate potential crime. It's specifically within the draft ordinance, limits our police's ability to investigate in any manner that they would do with any other business. It creates a citizen task force to opine on the validity of a citation, thereby conflicting with our charter in regards to'",
        "'speaker_4': 'the powers and the duties that are reserved for the City Council. It prohibits the assessment of regulatory fees for cost recovery by the city. Again, violating our charter, the city charter that we are all bound to follow as representatives of the citizens of the city of Long Beach.'",
        "'speaker_4': 'It repeals the taxes that our voters voted in 2014 regarding medical marijuana. Litigation is expected based on the memorandum that was provided by the city manager's office and staff. It requires a $5.1 million ongoing cost. And the revenue, which is projected to be at the middle term of $7.1 million, is expected to be faced with a cost'",
        "'speaker_4': 'to the city of $12.2 million annually. That's a $5 million shortfall, not counting the first year's one time startup fees. As representatives of the citizens of the city of Long Beach, with the fiduciary duty to vote in the best interest of the residents.'",
        "'speaker_4': 'I cannot fathom supporting an initiative that directly conflicts with our city. Charter requires us to undertake a $5 million shortfall and is very likely going to land us in litigation shortly after it is enacted if it isn't enacted.'",
        "'speaker_4': 'I ask you if you are going to sign on as a proponent of this initiative, do you intend to recuse yourself from the vote regarding litigation? Because that vote will come. And as proponents of this initiative, do you really stand in an objective place?'",
        "'speaker_4': 'So with that, I thank you, Mr. Mayor, for giving me the opportunity to speak.'",
        "'speaker_1': 'Thank you. And for clarification, there's two measures in front of us. I think the council was referring to the first measure, which is regulation of medical marijuana businesses. And Councilwoman, there was another person that came up. Nope. Did that get removed?'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_3': 'Yes. I just want to thank Councilmember Price for making those points and certainly made some great arguments against the measure. I'm sure surely you'll be working with Mr. Greenberg. I just want to clarify that I have signed on.'",
        "'speaker_3': 'I made a motion to approve this, and it has nothing to do with. It only has to do with approving the ballot, argued those who are arguing for and against the initiative.'",
        "'speaker_4': 'I respond to that only because my name was mentioned. No, Mr. Watson, I don't intend to get involved in any side of this debate because I would like to stay in a place of objectivity when we are going to be voting on potential litigation in this case.'",
        "'speaker_4': 'And I do not believe that it's appropriate for a council member to sign on on an initiative that is going to have a detrimental impact for the city one way or the other. So that's my personal belief.'",
        "'speaker_3': 'I got you. But I was.'",
        "'speaker_0': 'Playing piano a compliment.'",
        "'speaker_4': 'That but I didn't want the the people who might be watching to walk away thinking that I'm going to be working with somebody behind the scenes. Because if I were going to do that, I would sign on to it.'",
        "'speaker_4': 'But again, ethically, I don't believe I believe that's a violation of our fiduciary duty.'",
        "'speaker_1': 'Okay. Thank you. And just before we go to a vote, I'm going to open up for public comment. Of course, this process is the the process that is laid out in our charter as far as ballot designees. So the call for names, the names being submitted, the names going to the council and putting the names on for'",
        "'speaker_1': 'the signatures of the ballot. And so that's what we have in front of us. And I do have a comment. If anyone has any public comment on this, see? None. Okay. Thank you. With that, then please cast your vote.'",
        "'speaker_1': 'And as a reminder, ballot statements are do that. Madam Quirk, I think it's the 19th for these folks.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_1': 'Okay. So for the folks listed below, it's the 19th. All the ballot arguments have to be submitted.'"
    ],
    "Recommendation to request that City Manager and Airport Director make the Federal Inspection Service (FIS) Feasibility Study publicly available and posted on relevant City websites at least 15 days before scheduling any City Council meeting to discuss the Study; and further provide sufficient time before the scheduled City Council meeting to conduct a Fourth Council District community meeting for the purpose of receiving public input on the Study and the proposed FIS.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay, thank you. And next item is 20 I'm sorry, 12.'",
        "'speaker_2': 'Communication from Councilmember Supernova Councilwoman Gonzalez, Councilmember Pearce and Councilwoman Price. Recommendation to request that the city manager and airport director make the FISA feasibility study publicly available at least 15 days before scheduling any city council meeting to discuss the study and provide sufficient time before the scheduled City Council meeting to conduct a fourth Council District community meeting'",
        "'speaker_1': '. Thank you, Councilmember Superdome.'",
        "'speaker_12': 'Thank you. And I'd like to thank my colleagues. Price piercing. GONZALES Sounds like a law firm for supporting me, and I think it's pretty self explanatory, pretty straightforward. We'd like 15 days to examine the study when it comes back.'",
        "'speaker_12': 'The one part that I do need to clarify is the the item states that we want to make time for a fourth Council district meeting. And that meeting will be, for lack of a better term, city wide. Everyone will be invited, but technically we have to label it a fourth district meeting.'",
        "'speaker_12': 'So I think that's the only issues I have here. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Pryce coming to the second year.'",
        "'speaker_4': 'I support Councilman Super nine. I think public input is very important in this process and this should be a data driven decisions. So I thank you for bringing the item and asking me to sign on.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_2': 'I think Councilmember Rubinoff for clarifying that it's still a citywide meeting. I think that the fourth district is a good central location. I know we've done cross marketing for things in the past, and I think that the 15 day minimum is sufficient.'",
        "'speaker_2': 'But I believe that I'm sorry, is is a good number to put in a in a council item. However, I believe in discussions with the city manager over the last several months. The planned period is actually significantly longer.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_0': 'The plan is not to bring it to the council for at least 15 days. We certainly plan to bring this to the Airport Advisory Commission and also the Economic Development Commission before it gets to the council. So it will be longer than 15 days, but we'll try to do it as soon as possible.'",
        "'speaker_2': 'So it's my understanding from previous discussions that the report period for the consultant whose name escapes me at the moment, was originally going to be concluding, was it September 30th?'",
        "'speaker_0': 'I don't recall what when it was supposed to be completed, but the firm's name is Jacobs. Thank you. And they'll be bringing this in sometime in the the first ten days of first week or two of September.'",
        "'speaker_2': 'And so through that, then there would be several meetings, including the community meetings in the fourth District.'",
        "'speaker_0': 'We'll have the fourth District meeting and any other community meeting that a council district decides to have as well. And then but of course, we definitely are going to have the Jacobs Company be at the Airport Advisory Board Commission and also the Economic Development Commission before it gets the council.'",
        "'speaker_2': 'And are those dates of the potential airport advisory commission and the potential Economic Development Commission meetings known to us? Or when they are known, will they be given to us in a TFF?'",
        "'speaker_0': 'Yes, they're not known at this time. But Will, as soon as we get an idea on the date that we're going to receive the study, we'll schedule those meetings immediately and let the council know.'",
        "'speaker_2': 'Wonderful. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you. I'll be brief. I think this is an excellent item. I want to thank Councilmember Supernova for bringing it forward. When we had the community meetings prior to the the consultants actually initiating the study. It was it was we heard loud and clear from the community that this is something that they wanted.'",
        "'speaker_3': 'And so to actually effectuate it here at the City Council on an agenda item I think is great. My only concern is that reading this item and those in the public looking at this would walk away from this thinking that that the only community meeting is going to be in the fourth District.'",
        "'speaker_3': 'And I can tell you that that probably won't be the case. There will be plenty of opportunity for community input. I know I have a lot of residents in my district who are very, very who are paying close attention to this item as well.'",
        "'speaker_3': 'And so, yes, the eighth District, we will have a community meeting and we will seek the resources and input from city staff as well as the engineers to explain the study. And. My my my my question also is a, would this be considered or is community meeting be considered a study session?'",
        "'speaker_3': 'And maybe you can answer that question, Mr. City Manager.'",
        "'speaker_0': 'No, I would. We would talk to the city attorney, of course, but I just envision this as community meetings to. Take the report out on the road with our airport directors and and get input from the community before it comes to the city council.'",
        "'speaker_3': 'And you mentioned that it would actually go to the Airport Advisory Commission, would they would there will be to make a recommendation or or to just the receiving report filed a report.'",
        "'speaker_0': 'That they would do more than receive. They would receive and file. But also we would take the comments from the from that advisory board and bring those to the council as well as from the Economic Development Commission. So they're not specifically making a recommendation per se or be asked to make a recommendation, but we're certainly going to'",
        "'speaker_0': 'ask them to review it, listen to the comments from the audience or the public, and then provide any feedback that they want that will relate to the city council.'",
        "'speaker_3': 'Well, I do appreciate the fact that we are looking to proceed with caution and involve our advisory group groups, our commissions in the process. There's no need to rush. I don't think it's in the interest of the city to do that.'",
        "'speaker_3': 'Anyway, I've said that all along, and so to have a process that engages our residents is a good thing. And so I'll be in support of this on.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember Pearce. Computer.'",
        "'speaker_2': 'Did you guys make it on there? Yeah.'",
        "'speaker_10': 'Thank you, guys. I just wanted to thank Councilmember Sabrina for asking me to sign on and thank all the council members who have been a part of the process over the last 18 months. Obviously, the airport is a critical city asset in making sure that residents from throughout the city have an opportunity to engage in this conversation'",
        "'speaker_10': '. It's important. And so we'll definitely come to your guys meetings and and utilize the meetings that are already in place. But just wanted to say thank you for the time to have this important discussion.'",
        "'speaker_1': 'Concern for Superyacht.'",
        "'speaker_12': 'Yeah. Just just one point of clarification. While the agenda item reads a fourth district meeting geographically that that was not my intention. We could certainly go back to the gas department and hold the meeting there for efficiency if we wanted to hold just one meeting.'",
        "'speaker_12': 'The other point and Councilwoman Mongeau just mentioned it to me about let's look at this calendar now because I wanted specifically a short time frame so we don't get into the holiday season. So, Mr. West, can you give us can we look at this in terms of the item coming back and then going to two different or'",
        "'speaker_12': 'a commission and a committee? And really, what data are we looking at here for this thing to come back to council?'",
        "'speaker_0': 'I don't know. I'm I'm interested to hear what you're saying. Your intent is to bring it back. Sooner than later. We can certainly have special meetings of the Airport Advisory Commission or Economic Development Commission, so we don't have to wait on the schedule.'",
        "'speaker_0': 'We create something special if their meeting just didn't line up within, you know, two or two weeks of their report coming out.'",
        "'speaker_12': 'Okay. Thank you.'",
        "'speaker_1': 'Councilman Mungo.'",
        "'speaker_2': 'Thank you. I just wanted to ensure that. I think that many of us are planning to be with the community on November 8th, Election Day. While it has not yet come before this board. I had heard rustling in the community that we might cancel the council meeting on that night, so I would hope we would not plan'",
        "'speaker_2': 'to bring it back where the community would have to choose between celebrating their presidential candidate or attending and giving good feedback. So that was just another component of this. But I know that you'll make a good decision. I know there's lots of meetings that need to happen sometime between when the report comes back, hopefully on time, September'",
        "'speaker_2': '30th. And I think the most important component is enough time for community input. And I think that this item addresses that with the minimum amount, but I think that very definitely it could be longer. So thank you for that.'",
        "'speaker_1': 'Thank you. Any public comment on this item saying nonmembers, please cast your votes.'"
    ],
    "Recommendation to authorize City Manager to execute all necessary documents to receive and expend grant funding awarded to the Office of the City Clerk by City Fabrick as part of the Knight Cities Challenge for the Place Make the Vote Voter Engagement Initiative in the amount not to exceed $30,000 for a period ending April 11, 2017; and increase appropriation in the General Grants Fund (SR 120) in the Office of the City Clerk (CC) by $30,000.  (Citywide)": [
        "'speaker_2': 'Motion carries, we'll.'",
        "'speaker_1': 'Go to 14, then back to 13.'",
        "'speaker_2': 'Report from City Clerk recommendation to execute all necessary documents to receive and extend grant funding awarded to the Office of the City Clerk by City Fabric as part of the night city's challenge for the place. Make the vote.'",
        "'speaker_2': 'Put our engagement initiative in the amount not to exceed $30,000 citywide.'",
        "'speaker_0': 'You.'",
        "'speaker_1': 'I'm going to turn this over to the clerk, I believe. Right. And then you can introduce Sheila Swirsky.'",
        "'speaker_2': 'Yes. Thank you, Mayor. So I want to just say thank you to Citi Fabric for engaging my office and the city of Long Beach in this great initiative. And I will reserve the majority of my comments until after Brian gives his presentation to let you know about what place make the vote is and how the initiative is'",
        "'speaker_2': 'going to impact our great city here in Long Beach. So, Brian, if you could come up to the podium.'",
        "'speaker_7': 'Great things. Honorable Mayor and city council. Thank you for having me this evening to share some excitement, exciting work that we're doing with the city clerk's office, the county registrar, and some of our community partners, including Long Beach Rising.'",
        "'speaker_7': 'We were fortunate enough this past year to be the second recipient of a Night City's Challenge Award. Long Beach, the city of Long Beach, obviously getting the other one for the outdoor office space. The idea that we had four place make the vote was to use people use placemaking as a way to expand voter engagement and hopefully'",
        "'speaker_7': 'get voters to linger with their fellow residents and hopefully spark the synapses within the community to continue being civically engaged within their neighborhood. So I'll just give a brief presentation and a little bit of overview of the project.'",
        "'speaker_7': 'But also we had a prototype this past June election and we can share a little bit of that. So the project background place Make the Vote PMT is a toolkit that helps expansive engagement encourage voting using pop up social spaces around bowling our polling booth locations.'",
        "'speaker_7': 'And this is a process that we had initiated when we had the proposal last year. It's a little out of order. We actually had the grant awarded after our primary prototype, but our partners were willing to come together even before the contract and grant check were signed.'",
        "'speaker_7': 'So I appreciate everybody what we're going to do. We had one prototype site for the June election in the second District. Congratulations, Councilmember Pierce at the Fourth Street Senior Center. And the idea is we're going to expand to have four sites during the general election in November, and we're going to also do some voter engagement drives between'",
        "'speaker_7': 'when the ballot is set and the election. Then we will also do some vote by mail event at those four sites before the November election. And so our partners I mentioned before Long Beach rising ourselves, city fabric, the Long Beach City Clerk's Office, the county registrar.'",
        "'speaker_7': 'And we're actually very fortunate enough to have had some help from Parks and Rec at our fourth Street Senior Center site. And Public Works really did come through for us on some last minute assistance to make some better spaces on our street.'",
        "'speaker_7': 'So there's the overall branding of the place make the vote. We want to do something fun, but yet still patriotic. And we expanded the voting for vote. And so we expanded upon that, doing some fun ideas around graphics, posters.'",
        "'speaker_7': 'And really the idea behind this kit is that while we are going to activate four sites directly, we are also building a kit, a website material that can be printed, downloaded online, also ordered through manufacturers and fabricators that people can actually do place make the vote not just on those four sites, but any sites in Long Beach'",
        "'speaker_7': ', any sites in California, even in Ohio. Florida really trying to make this a grassroots initiative where people are throwing block parties and trying to get their residents, their fellow neighbors, to participate in the voting process, but also be part of the civic engagement that takes place beyond.'",
        "'speaker_7': 'And so I was mentioning in June we had our prototype. It was at the Fourth Street Senior Center. It was a great location, a lot of foot traffic. We introduced a parklet along Fourth Street to really kind of grab attention.'",
        "'speaker_7': 'We had a lot of graphics for banners and posters and seating had food. We were fortunate actually. We also had Health and Human Services partake in this program. They had a healthy, active Long Beach, had a health food demonstration.'",
        "'speaker_7': 'So it was really nice that we were able to bring in a lot of partners from the city. And, you know, we had seating, we had games, we had some customized flags made and big six foot V for vote symbols.'",
        "'speaker_7': 'We also had a photo booth, which was probably the most popular part. We had a lot of people of all sorts of backgrounds participating and doing fun stuff with various bowlers and wigs and glasses and definitely something that we will take back and definitely use on future plays.'",
        "'speaker_7': 'Make the both sides. And part of the idea with the prototype was to test out some initial ideas before we go out and foresight before we build this toolkit that others can use. We did user intercepts, we asked residents, we asked voters.'",
        "'speaker_7': 'We got a lot of really fun feedback about wanting to participate in this process and wanting every polling site to be this way. We also had a lot of good press coverage locally as well as nationally Smithsonian, CNN, NPR, but also Long Beach Post, Signal Hill, L.A. A lot of really people perking up.'",
        "'speaker_7': 'We've even had some other foundations take a page from what we were doing the and doing this in L.A. at other sites. And we also had a lot. Lessons learned as part of this idea of prototyping. How do we evolve this to be something that can be successful on a larger format?'",
        "'speaker_7': 'And how could this be expanded to be something that other people can take advantage of? And so we did Pro Tips based on interviews with our city clerk's staff through the county register. Our polling workers are participants, and we're also still looking at some of the data from this prototype to see if we were able to make'",
        "'speaker_7': 'any sort of significant impact. It is within the what was taking place across city. We saw voter participation generally increase. One thing that we did notice a significant increase on was provisional balloting spiked at one of the two precincts here.'",
        "'speaker_7': 'It was actually highest in the city. So that was something that we could really point to as success. We definitely saw people walking up and asking, Hey, can I vote here? I live in North Long Beach or I live in Santa monica even.'",
        "'speaker_7': 'And so we did see a receptive voter audience that just saw it and wanted to participate. And so those are things that we'll try to adapt and incorporate going forward. And, you know, Next Steps is looking at those four sites that we're going to program, moving this voter education program forward and then looking at the kit that'",
        "'speaker_7': 'we're going to release online in the next month or so for others that take advantage. So this is a really exciting opportunity. I mean, we're very fortunate to have the city clerk's office participating as well as a number of other departments.'",
        "'speaker_7': 'Everybody has been very open minded. This is a great opportunity to try to you know, there's rock the vote, there's vote, turbo vote. There's all sorts of different voter initiatives. There's something that's very localized, something that can be very grassroots.'",
        "'speaker_7': 'So we see a lot of opportunity for this proceeding forward. I'm here for any questions or comments.'",
        "'speaker_2': 'And I just want to add that this this project is very dynamic because it targets and aims its efforts at the lowest voter participation rates in the city. So we're really focused on getting those neighborhoods that are not engaged in voting or in the democratic process and getting them activated in and create a culture of civic participation'",
        "'speaker_2': 'in those neighborhoods. So we're really excited to to be part of that effort. And thank you, Brian, for engaging our office in in that project as well also.'",
        "'speaker_1': 'Thank you. Next up, council member Pierce.'",
        "'speaker_10': 'Thank you, Brian, very much for your vision and thinking outside the box. I really was excited to see this on Tuesday morning, especially because I was in my district at the senior center, as you mentioned, and just want to say thank you for doing a good job of partnering with folks that are doing civic engagement.'",
        "'speaker_10': 'I think partnering with an organization like yours that has the ability to think outside the box. Talk about branding. Talk about messaging. You've always been great at that and partnering that with people that are on the ground, knocking on doors, trying to get canvasing.'",
        "'speaker_10': 'Yeah. Doing the propensity voter turnout, you know. And so, you know, as you guys are doing the next four, it's exciting to see that those are going to be in the lowest voter precincts turn out. And I would just encourage you guys to partner again with Long Beach rising to do the the walk pieces so that they'",
        "'speaker_10': 'can also encourage people to go out.'",
        "'speaker_7': 'Yeah, they're an official partner as part of this this grant. And so we're very fortunate to have them with the boots on the ground. And so we've got a number of other partners also coming forward really excited about this.'",
        "'speaker_7': 'So I think, you know, this idea is worth pursuing in a lot of different ways.'",
        "'speaker_10': 'Yeah, definitely. And I think, you know, it's a very proud moment to see you guys partnering with Long Beach Rising, an organization that I helped, you know, back in 2010 started. It was a sad year for me to not play any role in working with them.'",
        "'speaker_10': 'So and then just I would love to hear how you're partnering with, you know, if we're doing something in the sixth District or are you working with organizations there and how we're partnering with organizations based locally. So. Great job.'",
        "'speaker_10': 'Congratulations.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_2': 'I've always been a person who talks a lot about why voting matters, and many have heard me talk a little bit about how we can continue to get people out to vote. And we also need to engage those communities in a long term strategy about cleaning our voter roll because we have an artificially low voter turnout when'",
        "'speaker_2': 'hundreds of people who've moved and or passed away are still on the voter roll. And it makes it look like we have less civic engagement than we really have. I think a great example of that is there's a precinct in Long Beach where there had been the same poll worker for 35 years and she took personal responsibility'",
        "'speaker_2': 'to work with the city I'm sorry, the county registrar and send in letters every time a neighbor would pass away. And their voter list is remarkable. She's 93 now and I'd be happy to meet with you and talk about it.'",
        "'speaker_2': 'But her polling place about three years ago hosted a lemonade stand, morning coffee and donuts. And to this day, that polling place is still one of the highest voter turnout to the whole city, and that does not exist anymore.'",
        "'speaker_2': 'But that sense of community that she built over 30 years. Her name is Lou. She's amazing woman served our country as one of the first women in the Navy. It sticks with that community today. So what you're doing is meaningful and powerful and the fact that you're providing the tools for it to be carried on past a'",
        "'speaker_2': 'single person is remarkable because Lou won't be with us forever. But if those tools were available, it'd be a lot easier to get a neighborhood leader to step up. So I'd love to work with you on getting information into the communities through the neighborhood night out, which is always in August.'",
        "'speaker_2': 'So it's really a good lead time for a community to say, We just had a great time. We're taking community watch and taking care of our neighbors seriously and we have a good lead time before the election. Let's let's place make our local polling place.'",
        "'speaker_2': 'So thank you for applying. Thank you for taking a small idea and making it a national standard.'",
        "'speaker_7': 'Thank you. These are actually really, really fantastic.'",
        "'speaker_1': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I just want to say, you know, congratulations on on applying and winning that grant to city fabric and to our city clerk. I just want to say, this is this is fantastic. I know you played a tremendous sort of significant role here to us.'",
        "'speaker_3': 'A lot of times, you know, we've had conversations about, you know, cracking the code on voter turnout. And a lot of folks believe they, you know, have it down to a science. But, you know, every once in a while there's an innovative idea and it changes the way things operate across the country.'",
        "'speaker_3': 'And, you know, this is one of those things that I think has that has that potential. So I just want to say congratulations and thank you. And I think it's great that you came and gave a report at city council.'",
        "'speaker_3': 'A lot of great things happen in our city and we don't you know, sometimes we don't hear the results. And even though it's not finished, I think it's tremendous to know that that particular precinct had the highest amount of provisional ballots and that that's data and it's it's important.'",
        "'speaker_3': 'So thank you so much for doing that.'",
        "'speaker_1': 'Thank you. You know, Brian, one thing also, I think this is great and I love that we're focusing on on getting people to vote. I think it's really important. I'm not sure the process that you guys will go through to select these these sites.'",
        "'speaker_1': 'I'm not sure if they're selected already or not. But throughout, I think it's important to certainly your target focus is trying to address precincts that have not traditionally voted, which I think is great. I also think it could be interesting to also look at a precinct if you have four, where there is maybe high turnout, but can'",
        "'speaker_1': 'you make that turnout even higher? You know, and so I think hopefully when you select the sites that you guys are, hopefully the sites are are are diverse as far as geographically across the city. So we're really capturing all types of voters because I think we want to encourage higher voting everywhere.'",
        "'speaker_1': 'Right. I mean, at the end of the day, we want voting all across the city regardless of of the district. And so I think I think that the start at low propensity areas, I think is really good. But, you know, it's also interesting to know, you know, how do we get more voters in certain high propensity Eastside'",
        "'speaker_1': 'districts, you know, and if that's possible as well. So just a thought and great work. This is this is good stuff. Councilman Price.'",
        "'speaker_4': 'Thank you. I do know what everyone has said. I want to echo the accolades. You always bring fresh ideas and a fresh perspective to the city, and you think of things that others don't. And in terms of voting, we need that fresh approach.'",
        "'speaker_4': 'We need that fresh attitude. We're dealing with a whole new generation of people that think differently and do things differently. I'm dealing with it all the time. When we hire new attorneys in my office, they just do things differently.'",
        "'speaker_4': 'So in terms of training, you know, we're having to reprogram the traditional ways that we communicated. And I see that that's what you're doing with the message that you provided for us tonight. So I want to thank you for being a great partner to the city always, and especially on this project.'",
        "'speaker_4': 'And one of the things that I would recommend is if there's any of this that we can implement long term into our council districts. So in terms of pushing messages out or pushing marketing out, that's consistent with the logo that you're using.'",
        "'speaker_4': 'Please let us know. We've done a really we've been very aggressive in terms of our counsel office and trying to get the message out about voting and engaging our residents to vote, reminding them to vote. But we could use that fresh perspective, too, because creativity is not abundant on our staff.'",
        "'speaker_4': 'We do we deal with a lot of mundane things all day long. So I really appreciate any influx of creativity that we can get to our efforts as well. So thank you for everything that you're doing on this and the presentation tonight.'",
        "'speaker_4': 'It was really wonderful. Thanks.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_4': 'Brian and Madam City Clerk, I want to thank both of you for your joint efforts and trying to engage more voters. I think the first district is not surprisingly, it is one of the lowest voter turnout in the city.'",
        "'speaker_4': 'And so we'd like to see that change, especially with the high rises that we have. People don't like to get out. How do we make it more accessible to them? Even youth that are starting to vote? Spanish speakers, I mean, we have an influx of different, you know, like other parts of the city as well.'",
        "'speaker_4': 'But I think the first district in some areas may need a little bit more attention. And I think just engaging them in that sense would be great. But I think, as my colleagues had mentioned, your creativity never ceases to amaze me.'",
        "'speaker_4': 'And I really appreciate your efforts in this. It's it's wonderful.'",
        "'speaker_1': 'Everything's great. Good work, Brian. Good work to our city work team as well. Any public comment on this item? CNN members, please cast your vote and they receive and file report.'"
    ],
    "Recommendation to request City Manager to create a comprehensive plan to recruit and include Long Beach businesses in all contracts and purchasing agreements. This should include but not be limited to; a review of current Request for Proposal process, preference points for businesses located in the City of Long Beach, preference points for businesses who are certified California Small Businesses, small/micro businesses, etc. Examples of existing programs throughout California include the \"Pasadena First Buy Local\" program, the City of Los Angeles \"Business Inclusion Program - Local Business Preference\", and the City of Oakland's Local & Small Local Business Certification Program.   This program should be brought back to the City Council for review in 120 days.": [
        "'speaker_2': 'Motion carries came.'",
        "'speaker_1': 'Back to item 13.'",
        "'speaker_2': 'Communication from Councilwoman Gonzalez, Councilmember Supernormal. Councilwoman Mongo and Councilman Andrew's recommendation to request the city manager to create a comprehensive plan to recruit and include Long Beach businesses in all contracts and purchasing agreements.'",
        "'speaker_1': 'Councilwoman Gonzales.'",
        "'speaker_4': 'Yes, thank you. I want to first thank my colleagues for joining me on this item. Councilmember Super Councilwoman Mongo and Councilmember Andrews, I think this first came about for a couple of different reasons. You know, Long Beach. First, I remember we put together the project labor agreement and we asked for a certain percentage of local hiring for'",
        "'speaker_4': 'our residents. And we also did the first source agreement that was also any city dollars that went to projects. We wanted to ensure local hire was important in.'",
        "'speaker_2': 'That as well.'",
        "'speaker_4': 'Now we're looking at what I'm intending to do with this item, is to research other policies and ordinances that other cities have done in relative to businesses.'",
        "'speaker_2': 'So as we've done with.'",
        "'speaker_4': 'Local hiring, just to ensure that we're also allowing local businesses to have the first chance at doing city work in the city with the city they love and have invested in. It'll strengthen our Long Beach economy and hopefully we'll also get local jobs as well.'",
        "'speaker_4': 'With this. So I'm hoping that we can get support in looking at these different cities. The one that I have liked and I think that they have a lot of metrics in as well as Pasadena. They have quantified their success by measuring measuring local procurement dollars and, of course, local jobs.'",
        "'speaker_4': 'I was also happy to see that the you know, about a couple of weeks ago, we were able to include three Long Beach businesses in one of the the projects and contracts that we had put out for public works.'",
        "'speaker_4': 'And so I want to thank our city staff for really being committed to that and just listening to, you know, the things that I had been saying and then implementing that. So I appreciate it and thank you very much.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Councilwoman Mongo has a business advocate who spent much of our business advocacy meetings over the last eight months working on a business's first component of the county of Los Angeles. I think this is the right time where the city of Pasadena is.'",
        "'speaker_2': 'Plan the county's plan, Burbank's plan. All the different local plans have been reviewed. And a lot of key things stand out to me as as priorities, certain things that small businesses need when dealing with large governments. And I do mean dealing with we work with constituents, but sometimes we deal with government.'",
        "'speaker_2': 'Right. This city of Long Beach is a more business friendly city. However, governments as a whole get a reputation for being hard to work with and to be slow at paying their bills. And so one of the main things that when we went out into the communities of L.A. County and asked businesses, why don't you do business'",
        "'speaker_2': 'with the county? Why don't you bid? They say the same thing about their local city government, which is it's very hard and confusing. The requirements for insurance are high and it takes a long time to get paid. I don't have that kind of cash flow.'",
        "'speaker_2': 'So specifically, I'd like us to look into quick pay price, preference and support for onboarding our new businesses to become partners. Furthermore, incentive criteria should probably include if the business is headquartered in Long Beach, if their main location providing the service or product is in Long Beach, and then specifically, a lot of our Long Beach businesses are'",
        "'speaker_2': 'great, but they're on the border of our city. And I'm council district along with my colleague Vice Mayor Richardson, where a lot of our our border city businesses recruit, but they don't necessarily only recruit Long Beach residents. And I think we should give a reward to those who employ our residents, because those are the people who we'",
        "'speaker_2': 'are looking to bring up and support and take care of. And so I would like to look at we do a annual reporting on your business license of how many employees you have. I think that categorizing how many of your employees are Long Beach residents versus how many total employees is is a big deal, too.'",
        "'speaker_2': 'And I think that increasing those percentages over time that perhaps we could put in some of those incentives again. So I think this pairs up nicely with the prior item we did about a year ago related to putting new businesses into the city.'",
        "'speaker_2': 'A lot of those new businesses, as they've spurred up, have even chosen not to take the refund of the business license because they're very happy, even though it's a one page, super simple plan, they're just super excited to be a local new business and they're focused on their business and less on the paperwork.'",
        "'speaker_2': 'So whatever we can do to support that, I think this is a fantastic start in the right direction. And I know that as business friendly as we are, we have to keep reminding people how much we've changed from 20 years ago and how much we're not the same as some of the other governments in the area because'",
        "'speaker_2': 'we are different. We are Long Beach, so come up in a business here.'",
        "'speaker_1': 'Councilmember Pearce.'",
        "'speaker_10': 'Yes. I just wanted to thank everybody that put this on. And thank you, Councilmember Gonzalez. The comments that Councilmember Mongo made definitely support any local hire that we could do on this. It's pretty interesting to look at some of the multiplier effects that happen whenever we employ local residents, whenever we make sure that we're contracting out with'",
        "'speaker_10': 'local businesses. And so as much as we could do. Looking at some of the multiplier effect numbers, whenever we're talking about how how many local businesses that we're trying to bring in would be really helpful. But yeah, just really thankful for this item.'",
        "'speaker_10': 'Good job.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_4': 'I want to echo the positive comments. I think this is a fantastic item. I commend my colleagues for bringing this forward. I do think it's very, very important to promote and encourage growth of Long Beach owned businesses while at the same time making sure that the companies that are selected are those that can provide the best quality'",
        "'speaker_4': 'product for our residents. And I think that that balance can be had if we give a more stringent eye to recruiting local businesses for projects. So thank you for bringing this forward. And I think this is just a fantastic item things.'",
        "'speaker_1': 'Councilwoman Gonzales.'",
        "'speaker_4': 'Yes. And I just wanted to clarify, and I think my council colleagues for their support. You know, I had mentioned in here that it will review.'",
        "'speaker_2': 'Current request for the request for proposal process preference points for.'",
        "'speaker_4': 'Businesses located in the city of Long Beach.'",
        "'speaker_2': 'Preference points for businesses who are certified California small businesses as well. So I just wanted to make sure that we.'",
        "'speaker_4': 'Are clear on that. But thank you all for the wonderful comments and I hope we can proceed. And I've asked for this to come back in 120 days.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Just want to chime in and say congratulations. Good job on this is an easy, easy item for me to support. I would just say, you know, the more we can recycle our dollars in Long Beach, the better. You know, when people have an incentive to move their their headquarters here or if they're, you know, have an incentive'",
        "'speaker_3': 'to hire more people and do those things, it really has a multiplier effect in our whole community. So thanks for continuing this focus. And I do want to acknowledge you're absolutely right. Play was a focus on local Long Beach.'",
        "'speaker_3': 'First was a focus on local and this continues that thread so so thank you for couching those together so that the community does see this is yet another thing the city council's leading on to keep things local. Thank you.'",
        "'speaker_1': 'Local.'",
        "'speaker_0': 'Linus, I want to call you from now on.'",
        "'speaker_1': 'It's better than disaster. Made me major disaster. Whatever that was. Listen, I actually love this I love this item. So thank you, Councilwoman Gonzales, for this. Can you can we can you also, Pat? So when the council passed its local point preference program for for non professional services.'",
        "'speaker_1': 'And correct me if I'm wrong here. This was I know a few years ago that we did do some kind of point preference program that's different than this, because this I think this is also speaking to professional services in all types of services.'",
        "'speaker_1': 'Can we review if that had actually any effect on local hire? The last the last time that the council passed something similar to this, by the way, that was much less in scope. And I think what this is being proposed.'",
        "'speaker_1': 'But can we look at that? I don't know if it's possible to get that data or not, but it'd just be interesting to see if that actually had an impact of hiring more Long Beach folks.'",
        "'speaker_0': 'Sure.'",
        "'speaker_1': 'Okay. Thanks. Any public comment on this? Great Castro votes.'",
        "'speaker_2': 'Motion carries an.'"
    ],
    "Recommendation to receive and file the City Clerk's debrief report on the 2016 City of Long Beach Municipal Elections.  (Citywide)": [
        "'speaker_1': '15.'",
        "'speaker_2': 'Report from City Clerk Recommendation to receive and file the City Clerk's Debrief Report on the 2016 City of Long Beach Municipal Election Citywide.'",
        "'speaker_1': 'Kim. Adam Quirk.'",
        "'speaker_2': 'Good evening, mayor and council members before you as a debrief report on the 2016 City of Long Beach municipal elections. The report highlights administrative outcomes of both the primary and general elections, including the election administration, polling place. Consolidation and recruitment.'",
        "'speaker_2': 'Candidate Processing. Poll worker recruitment and training. Vote by mail services. Early voting. Voter education and outreach. Online services. Election Day. Operations. Canvass of returns and Voter Turnout. For fiscal year 2016, the Office of the City Clerk was budgeted 2.1 million to conduct the primary nominating and general municipal elections.'",
        "'speaker_2': 'Of the 2.1 million, we estimated 1.2 million for the primary election and 900,000 for the general municipal. The actual cost of the April 12th primary election was approximately $1 million, resulting in a cost savings of approximately $189,000, which will be used to cover the cost of the general municipal election should it exceed the original budgeted amount.'",
        "'speaker_2': 'We are awaiting the billing from the Los Angeles County Registrar Recorder Clerk's Office. So the actual cost of the general runoff election is not available at this time. Approval of the suggested action at this time would allow the City of Long Beach to begin planning and preparation for future municipal elections.'",
        "'speaker_2': 'This concludes my staff report. I'm available to answer any questions.'",
        "'speaker_1': 'Councilwoman Pierce.'",
        "'speaker_10': 'Thank you and thank you very much for the report and the conversation we had just kind of going over how the elections went both in April and June. I think it's great that we were able to consolidate and see that instead of a 14 or 25% turnout, we were able to reach a 40% turnout citywide, which is'",
        "'speaker_10': 'fantastic. Really looking forward to working with you in November and working to see how we can continue to increase those numbers while saving our city dollars. Yeah. I'll leave it at that. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_4': 'Just want to say thanks as well. I know it's a big feat to be able to take on all of this. And so you do a great job. And so it was great working with you on the Elections Oversight Committee.'",
        "'speaker_2': 'I pass it on to you now. Thank you.'",
        "'speaker_1': 'Thank you. And I just wanted to thank all the hardworking members of the city clerk department. I honestly I don't remember the last time Long Beach had that high of a voter turnout in any election. And I was trying to look and I actually couldn't find it.'",
        "'speaker_1': 'And so maybe you guys can can can look through the records, but to go and have that level of voter participation. Obviously thank you to you, but also to the public, because they went out and voted and they were engaged, I think to at least to me, there is there is no question that the consolidation of not'",
        "'speaker_1': 'having to do two separate ballots at two different tables had an impact on people's ability to go through the process. I'll also say that because this was the first time that we did this, it was new for a lot of people.'",
        "'speaker_1': 'So there were some there were obviously some challenges as far as not having immediate direct access to the clerk, because obviously it's through the county. I think you and I spoke about. I really missed the fact that we used to stamp the the ballot, which I know you've mentioned that that's not possibly something that we could do'",
        "'speaker_1': 'and add. So I just I would ask you and your team to see how look at ways with the election, with the new elections oversight committee and how we could make the process even better for the next time.'",
        "'speaker_1': 'That would bring some of the kind of Long Beach familiarity of the process, the pre consolidation, like the stamps and things that people like, but continue on that, you know, amazing voter turnout. We've got to keep that going.'",
        "'speaker_1': 'That that's one of the best voter turnouts that anyone had like, you know, locally. So I think that's really I was rereading the Press Telegram Press Telegram editorial about how how terrible it was the last time. And so it's nice to see the change.'",
        "'speaker_1': 'So with that, any public comment for this item? All right. Please cast your votes.'",
        "'speaker_0': 'Guess.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Thank you. Next item, please. I believe it's 17. We did 16.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager to execute a contract with Koppl Pipeline Services, Inc., of Montebello, CA, for furnishing and delivering pipeline stopper fittings and perform tapping and stopping services for natural gas pipelines greater than 12 inches in diameter without advertising for bids, in an annual amount not to exceed $400,000, for a period of two years, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Item 21 carries report from Long Beach Gas and Oil and Financial Management Recommendation to adopt a resolution authorizing the city manager to execute a contract with Coble. Pipeline Services for furnishing and delivering pipeline stopper fittings and perform tapping and stopping services for natural gas pipelines greater than 12 inches in diameter without advertising for bids in an annual'",
        "'speaker_2': 'amount not to exceed 400,000 citywide.'",
        "'speaker_1': 'There's a motion in a second. Okay. Is there any public comment seen on Councilmember Pearce?'",
        "'speaker_10': 'Yes. I just had one question. I'm not putting this out for a bit. How are we sure that this is, in fact, the only company that does this and forgive me for being the new guy. Just ask.'",
        "'speaker_0': 'Bob.'",
        "'speaker_6': 'Dylan, director of.'",
        "'speaker_0': 'Gas and Oil. Answer that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Sure.'",
        "'speaker_1': 'These services are well known in the Southern California area.'",
        "'speaker_0': 'There are only four companies that perform this type of activity.'",
        "'speaker_1': 'As are aging pipelines.'",
        "'speaker_0': 'We replace more and more of them.'",
        "'speaker_1': 'There are fewer or fewer of these companies. One resides in the Bay Area. The other two do not perform the operations in the manner that the city approves of. So that leaves us with just.'",
        "'speaker_0': 'One company to perform those services. Okay.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'There's a motion and a second. Please cast your votes.'",
        "'speaker_2': 'Councilmember Price. The motion carries.'"
    ]
}