{
    "Recommendation to confirm City Managers promulgation of the revised Safer at Home Health Order, issued on October 1, 2020, by the City of Long Beach Health Officer as a regulation.  (Citywide)": [
        "'speaker_3': 'Thank you. Then Councilman Mungo wanted to pull the health order item. Can we read that, please, Madam Clerk? And then I don't know if we just can go right into Councilman Mango. Thank you.'",
        "'speaker_0': 'Report from City Manager Recommendation to confirm city manager's. Promulgation of the revised Safer Home Health Order issued on October one, 2020, by the City of Long Beach Health Officer as a regulation citywide.'",
        "'speaker_1': 'Thank you. I know that there are lots of different aspects of the health order that are currently. Supporting and challenging to our local businesses and in meeting with local businesses throughout the district. I've heard from the community how great development services has been in their education and outreach.'",
        "'speaker_1': 'However, the Department of Development Services is limited in the flexibility that they can provide to any of these businesses because of the way that the health order is written at the state level. There are some things that I've discussed with development services staff over the last several weeks, including up to even earlier today, related to some specifics'",
        "'speaker_1': 'of the health order that are disproportionately impacting certain businesses, while not impacting other businesses that provide the exact same service. And so for that reason, I cannot support that certain businesses are able to be open and available and providing certain services, while other businesses who provide the exact same services, but in a different context, are not able'",
        "'speaker_1': 'to provide that same service. I've met with and gotten an opinion from the city attorney that was forwarded. Thank you, Linda Tatum. But at this time, I will once again be voting no on the enforcement of this, particularly for those businesses that are providing exact same services as other businesses that are allowed to be open while certain'",
        "'speaker_1': 'businesses are not because of the the specifics of how the health orders is written. So I'll continue to advocate for the health of our community and the health of those residents that are not being able to participate in certain health related services in a non health environment because costs are lower.'",
        "'speaker_1': 'And I will continue to work with development services on any potential changes that can be made that are within our authority. Though I am very aware, as are our businesses, that we have very little flexibility on this matter.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. And Councilwoman Rice.'",
        "'speaker_1': 'Thank you. So I'm a little bit confused. I'm not sure if that's what this item calls for. I mean, as a business owner, I disagree with many of the orders. So I certainly hope that by voting for this item, we're not endorsing the health orders and the types of businesses that have been deemed safe while other businesses'",
        "'speaker_1': 'have been deemed unsafe. So if I could get a clarification from the city attorney or perhaps the city manager, is that what we're voting on? Because I don't believe the health order is written in a manner that's fair to businesses, and I don't want to imply that through my vote.'",
        "'speaker_5': 'So, no, the way that it has been set up in the emergency powers that you've delegated the city manager, and then you subsequently change that ordinance, what you vote on now every time as we bring you the promulgation of the health order.'",
        "'speaker_5': 'So the health officer has the official responsibility under state law and they make those decisions in their medical opinion on how to craft a health order in alignment with the state order. Then I, I implement that and so I implement it and then I bring it to you.'",
        "'speaker_5': 'So what this is a vote on is the enforcement ability of the city manager. So if the whole council were to not approve this, the health order would remain. There just would not be a enforcement mechanism for the health order.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilman Price. Councilman. No.'",
        "'speaker_1': 'Exactly. Thank you, Mr. Modica. And so my concern is that we can enforce in certain businesses and we would not. Be in any mechanism to enforce and other businesses that provide a same service in a health environment versus a non health environment.'",
        "'speaker_1': 'And so for those reasons, I am voting no on the enforcement component because of these types of specific nuances. And so in my mind, if those types of services are available in our city, then they should be available by any business that can meet the requirements despite what their classification is.'",
        "'speaker_1': 'So that that's why I asked it to be pulled, so that I could voice that specific concern as the businesses have asked me to do.'",
        "'speaker_3': 'Okay. Thank you. Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. So just for clarification and I get where Councilmember Mongo is coming from. I actually 100% wholeheartedly agree with her on this because the way the health orders are written, it's really difficult to fathom how certain activities are being considered.'",
        "'speaker_1': 'Not risky and other activities are being designated as risky. And so I agree with you. I really don't think the the city or the state, frankly, should be picking winners and losers in terms of businesses. My only concern and I think councilmember member and I might be the only ones who feel this way and I appreciate you'",
        "'speaker_1': 'sharing that because I agree with you. But if all nine of us were to not approve this, does that mean then movie theaters could open or concert venues could open in Long Beach and we wouldn't be able to enforce.'",
        "'speaker_5': 'The answer to that. The city. Tony Perkins The answer to that is no. The state is regulating it. This would if every councilmember or there's a majority voted against this, the city would lack the ability to enforce it.'",
        "'speaker_1': 'Enforce any violation of the state order.'",
        "'speaker_5': 'Of the city's.'",
        "'speaker_2': 'Health order. Yes.'",
        "'speaker_1': 'The city's health order. Okay. Got it. Thank you.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_1': 'Did you call me Mr. Mayor? I can't hear you now.'",
        "'speaker_3': 'I count. Compliments of the house.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you, Mayor. I just wanted a little bit more clarification here. I know that one of the things that my constituents are really concerned about is the safety and the health of the families of residents that live in the district.'",
        "'speaker_4': 'I'm coming from a district representing a district where the majority well, not the majority, but we have very high, high positivity rates in in this district. You know, this makes me nervous. I think that it's important that we have enforcement.'",
        "'speaker_4': 'But, you know, for for these businesses. But I would like a little bit more clarification, if possible, on I don't understand how they say that some businesses are, you know, are able to operate under a health order and some that do the exact same thing are not.'",
        "'speaker_4': 'So if I could get clarification on that, please.'",
        "'speaker_3': 'Mr. Modica.'",
        "'speaker_5': 'So I believe one of the examples might be medical massage. So under the state order, from the very beginning of if there are certain medical uses, like a massage that's happening in a medical office that has been considered an essential service, there are groups that make the argument that the same types of services can be done in'",
        "'speaker_5': 'a in an office building. That's not a medical. The state has basically said those are considered personal care and those need to be closed. But if it were in a medical situation, that might be an example of those services.'",
        "'speaker_5': 'There's not that many of those. There are some. But I also just want to add that, you know, our approach to enforcement has really been education. We do lots of inspections. We talk to a lot of people. To date, we've done 11,628 inspections and issued 72 citations so that we're getting compliance without having to do a lot'",
        "'speaker_5': 'of enforcement. But we are making sure that people are operating safely and in alignment with the state order.'",
        "'speaker_4': 'Thank you for for that, Tom. I really appreciate that clarification. And one of the things that I have seen is that I have seen you being very active in the First District. And I think that if we really want to get to a point that we move forward and and open up as a city, we really have'",
        "'speaker_4': 'to have enforcement for the reasons that we don't want this pandemic to continue. We don't want this spread to continue. And I think that that's the the important thing is that we don't want our businesses to continue to have to be closed.'",
        "'speaker_4': 'But if we if we don't enforce them, we are most likely going to be seeing those businesses continue to be closed and maybe even take us to a deeper shutdown. So thank you for that clarification.'",
        "'speaker_3': 'Thank you. I'm going to go back to the council on Mongo and then Councilwoman Brice.'",
        "'speaker_1': 'Thank you. I think that comes from Mr. Moto because examples exemplary. So to miss that they has this point. If a community member goes to a chiropractic office and gets a massage or goes to a massage facility, or if a person a great example is my my godfather, he is in Orange County.'",
        "'speaker_1': 'So he's not in a position like this. But it was brought to my attention that he's in physical therapy and his physical therapist can choose to work out of a medical facility, but that same physical therapist works out of a small gym.'",
        "'speaker_1': 'And so if he were to get the cash rate of going to a small gym for that physical therapy, then he that's not eligible right now. But in Long Beach, we could not do that unless there were certain conditions met.'",
        "'speaker_1': 'Some gyms are able to move outside, but some have not. And then in this particular case, to Councilman's and day house's point, the activity is no more risky. And so in my mind, I'd like to vote no that the city manager not enforce fines on businesses that are providing services that somewhere under the health order are allowed'",
        "'speaker_1': 'as long as those businesses are providing them in a healthy manner, if they are not providing them in a healthy manner in alignment with the other business that's able to do it, then absolutely. Yes, we should follow through on that type of enforcement.'",
        "'speaker_1': 'But the way that the the current enforcement order is written, the city attorney and the city manager isn't the one picking winners or losers, losers he's enforcing across the board. It's the governor's order. And so I would love to see some kind of specificity where if the activity is already deemed appropriate in some place, in the order'",
        "'speaker_1': 'that it be a lower focus level of our department, and so that those businesses could work through what would be possible. Similar to we worked really hard for four bars and breweries when they were not allowed to be open, and yet in some cases they felt as though they were in the exact or similar situations as restaurants'",
        "'speaker_1': '. Then you have the medical marijuana versus regular marijuana. Why is it that an individual who may have a medical need for marijuana but chooses not to go through the inconvenience of getting a card, would not be able to get their medicine.'",
        "'speaker_1': 'The actual process of getting the product in alignment with what Councilman Sunday has said is no more risky and therefore provides no additional risk or safety to our community. And so for those reasons, on the current order, I will be voting no.'",
        "'speaker_1': 'And if I hope there are enough councilmembers that feel similarly that we in Long Beach could potentially set an example on how to enforce in the most egregious ways and other egregious acts that are completely forbidden under the order and provide health risks versus these other types of reasons that we potentially wouldn't want to do as much'",
        "'speaker_1': 'enforcement. I think that we could be an example because again, as stated in the health order, those specific services do not. Seem to constitute a risk under that methodology. Thank you.'",
        "'speaker_3': 'That's bigger than our last or last communism. I'm impressed.'",
        "'speaker_1': 'Thank you. Very well stated. Councilmember Mongo, I'm going to be supporting your position on this and perhaps we can consider fashioning a friendly down the road or if someone has one tonight that articulates that. Here's there's a lots of categories of businesses that fall into the exact situation that the city manager and council member Mungo mentioned.'",
        "'speaker_1': 'If it's done under the operation, under the direction of a doctor, for example, anything is is allowed. So if we have a dermatologist, for example, people can go in and get facials, they can get wax treatments, they can get, you know, all manner of treatments that you don't have to have a dermatologist give that and they're available'",
        "'speaker_1': 'by us dieticians, but they can't get them done because there's no doctor on site. And even then I don't even think there needs to be a doctor on site, but the facility is a medical facility. So I think there's a lot and you know, we I just spent 45 minutes the other day on the phone with these'",
        "'speaker_1': 'small business owners who own a very small Pilates studio where they help a lot of people that have sports injuries. They're not chiropractors, but they they're not physical therapists, but they're thinking about re categorizing because they can't pay their rent.'",
        "'speaker_1': 'Their landlord isn't helping them at all. They were in tears, frustrated, because if they were categorized as physical therapists and associated with a physical therapist, then they would be able to do exactly what it is. It's being done at physical therapy studios that have parties, machines.'",
        "'speaker_1': 'And so I agree with Council member Mungo. I realize that we haven't been instituting a lot of fines and I get that. But I think it's the optics and it's just a fairness issue. If it's done under the umbrella of a doctor, then how is the contact that's considered risky allowed?'",
        "'speaker_1': 'And that contact outside a medical scenario, the same exact combat contact with the same precautions is considered more risky. It just seems to me that and I get it, it's the way the health order is written, which is probably why most jurisdictions aren't filing any criminal sanctions associated with violations of the state order.'",
        "'speaker_1': 'But it's the way the order is written. It's not the way the city has implemented the order. So I agree with Councilmember Mungo and I think there's just a lot of equities at play here. We talk a lot about equity and I really think it's important for us to think about how these orders are affecting individual business'",
        "'speaker_1': 'owners who are engaged in behavior and conduct that the state has deemed actually totally acceptable in certain settings and not in others. So thank you.'",
        "'speaker_3': 'Thank you, Councilman Richardson. Thank you. So I don't.'",
        "'speaker_2': 'I hear one motion on the floor. Is that correct?'",
        "'speaker_3': 'Actually, I don't think there is. I don't think I actually heard a motion, actually.'",
        "'speaker_2': 'Okay. It sounds like.'",
        "'speaker_3': 'I took the number. I took this off consent calendar, so we had a motion to approve the item.'",
        "'speaker_2': 'Okay. It sounded like a few people just want the opportunity to vote no. I'm going to make the staff recommendation of the motion to approve the staff recommendation. Thank you.'",
        "'speaker_3': 'Thank you. Okay.'",
        "'speaker_2': 'Before but let me let me say this. Let me say this, Mr. Mayor. I actually think that there there should be more discussion on this in the future and that we should revisit revisit this. I think as we move forward, we should be able to understand fully the, you know, where we are with the health orders and'",
        "'speaker_2': 'these changes. So we should think about making some back on consent to get up to speed on where we are on some of these things. So but I do move staff recommendation right now. Thank you.'",
        "'speaker_3': 'Thank you. We're going to go ahead. And Councilwoman Price, did you two back up?'",
        "'speaker_1': 'I did. I did have one question. I wasn't expecting to be talking about it tonight. But I just out of curiosity, I know that we've been called since day one, but the council, as the legislative body, really has no say whatsoever in the state orders.'",
        "'speaker_1': 'But then I was curious, because I know the L.A. Board of Supervisors weighed in on the state health order when it decided to open certain businesses that were allowed to be opened under state directives. And so their legislative body, which which would be analogous to our legislative body for our jurisdiction, did weigh in on the state health'",
        "'speaker_1': 'order and open up categories of businesses that the state had deemed okay for statewide openings. Why? Can you can someone explain that to me? Because I've been told from day one that the legislative body has no jurisdiction to weigh in at all on what business sectors we open.'",
        "'speaker_1': 'But it sounds like a different legislative body did. So I'm not sure if they have something specific in their articles that allows them to do it. And we can't.'",
        "'speaker_3': 'Mr. Modica.'",
        "'speaker_5': 'So we wonder that as well, we actually don't believe they do have that authority, that they are essentially doing that. And then their CEO and their health order health officer needs to make a decision on whether they're going to support what the board wants to do or not.'",
        "'speaker_5': 'So that is not how they have operated in the past. That has been a fairly recent occurrence. And that we believe, at least I'm looking at the city attorney. We believe that the in the state law, it is the health officer in their sole discretion that has the ability to put in a health order.'",
        "'speaker_5': 'And again, even if the board wants to change things, they cannot change things that you know or get that direction to the health officer. The health officer is still bound by the state health order and cannot go beyond that.'",
        "'speaker_1': 'Right. But they're able to operate within the state health order, even though we haven't advanced to the next tier to move us forward in certain business sectors. Or at least that's what they did.'",
        "'speaker_5': 'So I think they our interpretation is they asked their health officer to go, you know, within the purple tier to open certain things up in the purple tier that had not been opened up before. I do want to point out, we believe as Long Beach, we have opened everything in the purple tier that applies to us.'",
        "'speaker_5': 'So we are essentially have everything open. And again, we can't move forward into the red tier, into L.A. County as numbers hit the red tier.'",
        "'speaker_1': 'Okay. So. So nail salons and breweries and wineries were in the purple tier. And indoor shopping malls and card rooms. Those were specifically called out in the purple tier.'",
        "'speaker_5': 'I believe so.'",
        "'speaker_1': 'If it was.'",
        "'speaker_5': 'I believe so.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'And so L.A. County has in certain areas been stricter than what the state has allowed, you know, in and in order to, you know, basically try to keep the numbers down as low as possible. And part of their philosophy is they can get more businesses open if they can get the numbers down.'",
        "'speaker_5': 'So trying to to keep things to a point where the case loads go down, the positivity rates go down so that they can actually make it into red to be able to open more things.'",
        "'speaker_1': 'Okay. So I guess my question should be then how are those specific businesses called out in the purple tier? Like how does a card room, for example, get in the purple tier and. I don't know. A facial doesn't like.'",
        "'speaker_1': 'How does that is there someone lobbying for that? That seems to me like kind of a random, you know, card room or winery or brewery. So is it because someone's lobbying for those things? How's that.'",
        "'speaker_5': 'Happen? Yes, that was definitely a lobbying thing. I think that was done over the objection of the public health department. And again, it's not all done in indoors. That's all outdoors only. So none of those things were allowed to be brought indoors.'",
        "'speaker_5': 'They have to be outdoors. And the health officer is still enforcing that. They have to be open on three sides. I think some of the card rooms I read tried to open up and just put a tent outside and that was enclosed.'",
        "'speaker_5': 'And so the health order health officer is still enforcing those things. So, yes, we do believe that was a number of cities that were asking for the ability to operate outdoors like a massage parlor can or any type of personal services.'",
        "'speaker_1': 'Right. Except for nail salons, which someone has deemed that digging into someone's nails with sharp objects is less risky than giving them a facial.'",
        "'speaker_5': 'Yes, that came from the state. So that's not a local decision that the state allowed, did not originally allow nail salons in purple and then they allowed nail salons in purple.'",
        "'speaker_1': 'Okay. But the but the card room designation and purple that came from the state, not the county.'",
        "'speaker_5': 'I believe so. So the county I believe the state allowed and we haven't followed courtrooms that much because we don't have card room. So. But I do believe that that was allowed in purple. But the county was not allowing it to open even because they have that discretion.'",
        "'speaker_5': 'So they then allowed card rooms to open outdoors.'",
        "'speaker_1': 'Okay. All right. Well, I mean, I guess my my whole point in all of this is that there's some lobbying efforts going on somewhere. And my concern is that, you know, the small mom and pop businesses who don't have a lobbyist or aren't in an industry that has lobbyists are maybe getting forgotten.'",
        "'speaker_1': 'And I realize our numbers are going up. I get that. But I think it should be a shared burden by every business. So I get it. And I understand. I'm just I'm just trying to maybe point out that.'",
        "'speaker_2': 'Councilwoman Price, your time expired.'",
        "'speaker_1': 'Okay, thank you. I have nothing further.'",
        "'speaker_5': 'And if I can just add, this council is very good at passing on information from businesses and asking questions, and we do everything we can to try to accommodate them where we can within the state health order. So I don't want anyone listening to think that their council is not, you know, passing those on.'",
        "'speaker_5': 'And they certainly are. And we address those as best as we can.'",
        "'speaker_3': 'Thank you. I exhausted the council comments. I want to make a few comments and then we'll go to the vote. There's a motion on the floor. Just more broadly speaking, I think it's just important to note that we are in the purple category, which is the most widespread category, as is, of course, most of the larger counties'",
        "'speaker_3': 'in the state of California. And everything that is open right now in Long Beach, as is things that are open in the county, are all allowed within that purple tier. And so there aren't business sectors that are allowed by the state that somehow the city of Long Beach, along with the county, have an open.'",
        "'speaker_3': 'I think, Tom, you mentioned that it's more of a kind of clarify that point. Obviously. In addition, I want to obviously, I think people can have different opinions on this issue and different thoughts. I think we've heard some some tonight as well.'",
        "'speaker_3': 'Some there's a lot of all of us have concerns for small businesses and how these decisions are being made. Obviously, the decisions from the tier category and what goes where are decisions made essentially in the Department of Health and Dr. Ghaly his team.'",
        "'speaker_3': 'And then, of course, they go through their process in meeting with all of the affinity groups and get input, of course, from from the, the hospitals and all the folks that are involved in those decisions as that data is being collected from from the ground.'",
        "'speaker_3': 'I think it's also safe to say that this is not a perfect science and in no way is are we getting every decision the right way? I think the governors even said so. You know that there's a lot that we are learning and have learned in the past.'",
        "'speaker_3': 'The last thing I'll say is that I do strongly support this motion. I think the more cautious that we can be, the better.'",
        "'speaker_2': 'The.'",
        "'speaker_3': 'Time needs to have. The ability, Mr. America, to enforce enforcement is important. And at a moment in the state where we are beginning to see cases and particularly this country rise in 20 to 23 states in the nation, this is going to impact us as we go into the fall with flu season.'",
        "'speaker_3': 'And so I worry about where we're going to be if we don't continue to take this incredibly seriously. And I know everyone on this council takes this very seriously, but I do support this motion, and I think it should be adopted.'",
        "'speaker_3': 'And so with that, we will call the roll call vote.'",
        "'speaker_0': 'We have a second year on this motion, Mayor. Councilman Diaz in the house. Thank you. District one, district two. I. District three.'",
        "'speaker_1': 'They?'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District seven, District eight. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to receive and file a report from the Third Council District Committee on illegal fireworks mitigation recommendations.": [
        "'speaker_3': 'Thank you. Next up is item nine, please.'",
        "'speaker_0': 'Communication from Councilman Price, Councilman Super nor Councilman Austin recommendation to receive and file a report from the Third Council District Committee on Illegal Fireworks Mitigation Recommendations.'",
        "'speaker_3': 'Are we going to turn this over to Mr. Mayor? Councilman Price.'",
        "'speaker_1': 'Okay. Thank you. So I want to thank the third district fireworks committee who is here with us this evening to make a presentation. This group was formed about three years ago, and during that time, they've done a tremendous amount of work in terms of researching fireworks of enforcement efforts throughout the region, and they've done it all voluntarily'",
        "'speaker_1': '. And so I'm going to turn it over to them to give us a report of what they've worked on this year and some of the recommendations.'",
        "'speaker_2': 'Mr. Mayor and council members, I have to thank you for allowing us to present our our report tonight. We feel that we're pretty excited about what we've done this last year. We've had a lot of inclusions from the different council districts and.'",
        "'speaker_2': 'I see that we have our Facebook page up and somebody's going to move the slides. There is a process or guide. We need to do that. Okay. This is a list of all our committee members. And we have five committee members on this list who represent or I should say at this point, we have five districts represented'",
        "'speaker_2': 'on this list and possibly six that we have unqualified out of nine council districts that participated in the formation of our recommendations this year. And we're very close to where were asked to try on what we're trying to accomplish.'",
        "'speaker_2': 'The next slide. Which is our community outreach side and what we accomplish this year. We work very closely with with Cal State, Long Beach in developing PSA both last year and this year and and also additionally with the Long Beach Veterans Association and the random VA hospital.'",
        "'speaker_2': 'And they were just amazing to work with. And you've seen the appearances. A month or so ago on present, at that time, we actually had an individual from the community come to us and and volunteer money to to do bumper stickers, which we did this year and did 5000 bumper stickers.'",
        "'speaker_2': 'And they just went like hotcakes. It was a very successful program where you we have a group of distributional partners and our list of partners this year grew by 10%. And it's a little bit a little deceptive in that you think it's only 143 distribution partners.'",
        "'speaker_2': 'But there are organizations and I, Boy Scouts of America, there's churches, there's homeowners associations. So it is really represented by a factor of X, which there's no real way to put a number to it. But we firmly believe that, you know, it could be as many as almost 100,000 people are are indirectly supporting what we're doing.'",
        "'speaker_2': 'We based the the static art on the convention center billboard again this year which is it was the art that you see on the slide here called Cal State Long Beach had to mind wanted on their billboard. The VA had language on their billboard.'",
        "'speaker_2': 'The League of Women Voters supported us. We worked well. None of us on our own on the committee are proficient at social media. But we, you know, tried the best we could to get the messaging up on social media.'",
        "'speaker_2': 'And and we believe that we did a fairly good job running. Gazette wrote several articles about what we doing and in the Long Beach Post ran an article. The Parks and Rec, to whatever degree they could used, are animations in both with movies and in their recreational programs.'",
        "'speaker_2': 'Our committee reached out to the news networks and we had some exposure there. There was very nice. I think one of the things that probably everybody on our committee is most proud of is, is the work we did with the homage to the Army Unified School District on that thing.'",
        "'speaker_2': 'And the pieces are now in the school district, district wide, and I've had discussions with them and they are willing to do that again next year. And one side benefit that we received late in the game was the school districts who had the chronic markings actually put a language up on our marquees that ran roughly from middle'",
        "'speaker_2': 'of June to about August 1st, which was a very nice thing. The Army private library system had to have the PSA and our are distributing them to young people in the library. We also this year experimented with putting the static art at the Catalina Express terminal in a lab in Long Beach, and both without outward bound passengers'",
        "'speaker_2': 'and in or around passengers had the opportunity to view that we were we were victims just like everybody else in the city with COVID virus crisis and that we had been talking to AMC theaters and we had struck agreement with them to have the static art and one or two of the pieces on the movie screens in'",
        "'speaker_2': 'Long Beach. And we all know what happened with with the movie theaters. And it was kind of too bad because that really kind of pushes over the top. With that, I'd like to introduce Jeff Davidson, one of our audience, and rather one of our one of our board members.'",
        "'speaker_2': 'And he's going to call out he's going to talk about our recommendations. Thank you for having us on their district. I request your committee would like to present the following recommendations. Add a fee to fireworks shows, block parties and special events to fund outreach and education.'",
        "'speaker_2': 'Increase messaging in and on Long Beach busses and bus stops. Partner with CSU. All the veterans services display messaging on Cal Worthington's electric billboard along the four or five freeway. Include a flier with the utility bill. Youth, street and neighborhood associations to spread messaging and distribute lawn funds.'",
        "'speaker_2': 'Place magnetic placards on city vehicles. Increase penalties to $5,000 and mandatory community service. Limit the decibel level of firework shows to 100 decibels. Provide long times for veterans. Partner with how to create an art project. Rap City trash cans with messaging.'",
        "'speaker_2': 'We've already talked with the Belmont Business Association and they will be providing messaging and all the big daily trash cans along Second Street. We're working with Susie Price right now to also include the ones that would be in Colorado Lagoon and and along that Marine Stadium.'",
        "'speaker_2': 'And then the last one is our committee, along with Councilwoman Price will be partnering with Chelsea Long Beach's animation department to create another animation for the coming year. Thank you. Oh.'",
        "'speaker_1': 'Thank you. Eric, would you like I believe there's a time limit on this, Eric, but if you wanted to quickly summarize your portion, please go ahead and do so.'",
        "'speaker_0': 'Councilwoman Price, there's one minute left on your presentation.'",
        "'speaker_1': 'Okay. Well, Eric, I'm going to take it over, if that's okay. So I want to thank the fireworks advisory committee from the third district for one, integrating with other volunteers throughout the city, and two, for the recommendations, which I believe many of them are actually feasible, affordable and something that we can implement.'",
        "'speaker_1': 'I know that this year we funded a fireworks task force, and I've already talked with the city manager to make sure that the work that you all have done over the last three years is included and incorporated and that you're integrated into our efforts moving forward.'",
        "'speaker_1': 'I really appreciate the commitment that you guys have made to this project, the immense amount of outreach that you have engaged in, and all the pieces that we've paid for our city property now. So any council office can use those.'",
        "'speaker_1': 'The city can use those in terms of messaging and outreach, and that's a great first place to start. So thank you, everyone, for the presentation. I appreciate it. And I hope that my colleagues enjoyed the presentation and the recommendations as well.'",
        "'speaker_3': 'Thank you. That's a motion to receive and file. Correct. Councilwoman and I have a second by Councilmember Superman.'",
        "'speaker_1': 'Yes, that's correct, Mr. Right.'",
        "'speaker_3': 'Britain's cut throat supermodel.'",
        "'speaker_2': 'Thank you. Just want to support the motion. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'Thank you. I want to appreciate the work that Councilman Pryce did in the task force. And then I also want to kind of reference that we as a city have a guide of all of the strategies. The strategies that we as a city should deploy when getting communications out to residents.'",
        "'speaker_1': 'I think that all of the things that were mentioned by this task force are in that packet. But I think that we really need to create a tier one, two and three where we as a council can say.'",
        "'speaker_1': 'Illegal firework prevention is a Tier one priority, and all resources in Tier one need to be explored and or executed immediately so that when we bring up ideas like these, a task force can look through that packet and say, Here are all the resources.'",
        "'speaker_1': 'This fireworks taskforce had to spend numerous hours and committee meetings going through and brainstorming all of the ideas that they've had by looking at other strategies that have been used on other campaigns. But we really, as a city have that.'",
        "'speaker_1': 'That framework available and need to utilize it more often and publicize it and make it available to committees like this that are doing great work on behalf of our residents. So once again, I'm in full support. Great work committee and great work council members.'",
        "'speaker_3': 'County Council Member or Vice Mayor Andrews. Vice Mayor Andrews.'",
        "'speaker_2': 'I totally support the site and I went back to council.'",
        "'speaker_3': 'To put this on.'",
        "'speaker_2': 'Fantastic. Thank you very much.'",
        "'speaker_3': 'Councilwoman Sun has.'",
        "'speaker_4': 'Mayor. And thank you very much, Councilwoman Pryce, and your committee for this. District one has had a problem with illegal fireworks in the past, but nothing compared to what we saw this year. So I really appreciate all the hard work that this committee has put into into trying to find solutions and trying to find ways to make'",
        "'speaker_4': 'sure that, you know, that our quality of life on 4th of July and the months leading up to it and the months after it, are not disturbed by the illegal fireworks that we see happening. So I just wanted to say thank you.'",
        "'speaker_4': 'Thank you very much. And I look forward to being able to help in this effort going forward as well. And my office is here and ready to help in any way we can.'",
        "'speaker_3': 'Councilman. Actually, councilman, for your anger.'",
        "'speaker_2': 'And I want to thank the District Council member, Susie Price for bringing this forward. Obviously, we had a celebration the other night with the Lakers winning and there were fireworks in my area. Then we have New Year's coming and I was pretty sure that there's going to be fireworks then as well.'",
        "'speaker_2': 'So basically, my question is, what what are the next steps in regards to this effort? I to start at the ready to assist in any way that I can. I have my fireworks generally go a long time out.'",
        "'speaker_2': 'I put it out the other night because of the of the fireworks going on. So I don't presume I'm sure I want to put it out again. I'm a nurse. So is there a strategy for here on out?'",
        "'speaker_2': 'It's going to be coming back to city council for another type of a accrual. And in terms of the ordinance or strategy or just want to know what's going on, what what's going to.'",
        "'speaker_1': 'Councilman, you're Ranga. This is Linda Tatum. I would just like to give a really quick update on the work of an interdepartmental working group that's looking at this issue and is composed of staff from lead staff in the police department, the fire department, the city prosecutors, the city attorney, and and also in code enforcement.'",
        "'speaker_1': 'So we are looking at this issue really carefully. The tff of the memo that was sent out to council back in August gave a current status of that. We now have funding in the budget, so we are going to be meeting routinely for the remainder of this year in the with the the goal of bringing something back'",
        "'speaker_1': 'to the council early in 2021 to address this issue. And I just to quickly elaborate, we are looking at areas of collaboration with other cities, identifying some of the tools and strategies that they're using. We're looking at collecting data and the use of technology to make it a little bit easier for staff to address areas in the'",
        "'speaker_1': 'city where this is occurring, similar to what was used in last year through the prosecutor's office. We're also looking at an education and enhanced education and outreach program like what we heard in the presentation tonight. And we're also looking at increasing potentially increasing the fines and just a higher level of enforcement.'",
        "'speaker_1': 'So we're doing a number of those things using some of the city's budget, the budget that was identified for this effort in the current year's budget. So that's it. We'll be bringing something back to the council early in 21.'",
        "'speaker_2': 'Thanks for the update. That's all I have here.'",
        "'speaker_3': 'Okay. Thank you very much. We have received 5 minutes. I don't have actually, I might have one public comment. Is that right?'",
        "'speaker_0': 'She is not on the call maker. There are no public comments for this item.'",
        "'speaker_3': 'All right. Roll call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District two. By District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six II. District seven. District eight. US District nine.'",
        "'speaker_2': 'All.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you. Next up is let's just the general public comment. I think we have one.'"
    ],
    "Recommendation to approve the Fiscal Year 2021 (FY 21) Action Plan and Substantial Amendment to the FY 20 Action Plan for the expenditure of Community Development Block Grant, Home Investment Partnership Grant, and Emergency Solutions Grant funds; and  Authorize City Manager, or designee, to execute all necessary documents with the United States Department of Housing and Urban Development, to receive these funds and execute agreements necessary to implement and comply with related federal regulations.  (Citywide)": [
        "'speaker_0': 'She is not on the line, Mayor. There is no one for public comment.'",
        "'speaker_3': 'Okay. Item ten, please.'",
        "'speaker_0': 'Item ten is a report from Development Services. Recommendation to approve the F1 21 Action Plan and submit a substantial amendment to the F1 20 Action Plan for the expenditure of Community Development BLOCK Grant. Home Investment Partnership Grant and Emergency Solutions Grant Funds Citywide.'",
        "'speaker_3': 'Thank you. There's no public comment. Can I get a motion in a second, please? Motion by Councilmember Ringo. Can I get a second, please? Second bite councilman's and day house roll call the District one.'",
        "'speaker_0': 'A district to. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'District seven. I keep. District eight. District nine.'",
        "'speaker_2': 'Hi, Mr. DAVIES, I.'"
    ]
}