{
    "Recommendation to increase appropriations in the Special Advertising and Promotion Group in the City Manager Department by $25,000, offset by Eighth Council District One-time District Priority Funds transferred from the Citywide Activities Department to provide a contribution to the Partners of Parks to support the Summers End Community Jazz Celebration; and\n\nDecrease appropriations in the Special Advertising and Promotion Group in the Citywide Activities Department by $25,000 to offset a transfer to the City Manager Department.": [
        "'speaker_2': 'Thank you. We're going to go and do all the transfer items that item 14, 17, 18, 19, 20 and 22. Madam Court.'",
        "'speaker_1': 'An important communication from Councilwoman Allen recommendation to increase appropriations by $500, to provide a contribution to California families in focus to support their I Matter to Youth Fashion Show and music concert. Item 17 is a communication from Councilwoman Zendejas recommendation to increase appropriations by $689 to provide a donation to Partners of Parks to support the AOC seven'",
        "'speaker_1': 'Neighborhood Group. Item 18 is a communication from Councilwoman Zendaya's recommendation to increase appropriations by $1,000 to provide a donation to the California families in focus to support the I Matter to Youth Fashion Show and Music Concert. Item 19 Communication from Councilwoman Zendejas Councilmember Your UNGA recommendation to increase appropriations by $800 to provide a contribution to Wild West'",
        "'speaker_1': 'women to support the Long Beach Suffrage Women's Equality Day event. Item 20 A Communication from Councilwoman Zinder House recommendation to increase appropriations by $5,000 to provide a donation to the Wilmore City Heritage Association. And Item 22 communication from Councilman Austin.'",
        "'speaker_1': 'Recommendation to increase appropriations by 25,000. To provide a contribution to the Partners of Parks to support the Summers and community jazz celebration.'",
        "'speaker_2': 'Thank you. There's one public comment, please. Item for 20. Leslie, Miss Leslie Holmes. Public comment. Please come forward.'",
        "'speaker_0': 'I just I'm speaking from the behalf of what.'",
        "'speaker_4': 'I and I just want to say thank you.'",
        "'speaker_0': 'And it will be well used. Thank you.'",
        "'speaker_2': 'Thank you very much. There's a motion and the second members. Please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. I've had. One, two, three, four, five. David seven items have been requested to be moved up before the time certain at six I think to the two members that requested these. I may have a obligations as soon as possible.'",
        "'speaker_2': 'So let's please try to get to these next items. It's seven items we're to try to do them as many we can before six the time certain and it's for two members that will have to leave after these items have been requested.'"
    ],
    "Recommendation to request City Attorney to draft a resolution in opposition to the Recall Election of the Governor of California.": [
        "'speaker_2': 'So we'll go through these seven items, hopefully expeditiously. Item 27, please.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson. Councilwoman Zendejas, Councilwoman Allen. Councilwoman Sara. Recommendation to request City Attorney to draft a resolution in opposition to the recall election of the governor of California.'",
        "'speaker_2': 'Of Vice Mayor Richardson. And on the motion, please.'",
        "'speaker_5': 'Thank you, Mr.. A second. Proceed. Please. Thank you. Between now and September 14th, Californians are voting in an election that will determine the direction that we take in California and impact our community here in Long Beach and even in our country at large.'",
        "'speaker_5': 'In this election, voters ask the question on your ballot, shall Gavin Newsom be recalled removed from office of governor? Yes or no? That is a ballot measure question that has tremendous impacts on our city. Like any other ballot question, we have the legal authority and I believe the responsibility to demonstrate leadership and take a position that best'",
        "'speaker_5': 'aligns with Long Beach's goals and values. Many residents might ask, what is what does this vote actually mean for the future of Long Beach? I want everyone to know that the stakes are indeed high for quality of life, for the initiatives that we've pursued to create a more just, a more equitable city, a more inclusive Long Beach'",
        "'speaker_5': ', where every resident is accepted and has an opportunity to thrive. And let's talk about what's at stake. All we need to do is look at the recall supporters statement of reasons. Those advocating for a yes vote say that the governor's support for immigrant rights, conservation and investing in housing and services have to stave off a homelessness emergency'",
        "'speaker_5': '. Are the wrong things to do. Here in Long Beach. We've done the opposite. We welcome immigrants. We've shown this throughout our history as a city. Most recently, by passing our laws that protect our immigrants and helping reunite migrant families.'",
        "'speaker_5': 'We believe that climate change is real. As a city, we need to prepare for its effects. It's why Long Beach has led the way by creating a climate action adaptation plan and passing measure us to help fund these efforts.'",
        "'speaker_5': 'And we know that the K-Shaped recovery from COVID 19 is also real. While the wealthiest among us continue to do well, we've helped our residents, our residents on the lower leg of that case. We're struggling to recover. We've helped them by providing rental assistance and have so have helped support struggling small businesses who need more support, particularly'",
        "'speaker_5': 'through this COVID 19 pandemic. The progress that we've made as a city as a result, it's a result of us working together with our state and federal government to bring resources back to our communities. That's the progress that is on the line.'",
        "'speaker_5': 'The recall process is intended for youth. When a governor cannot fulfill their duty, fulfill their duty due to personal corruption or unfaithfulness for office. And these are not the reasons that are that the recall supporters have put forward in their petition.'",
        "'speaker_5': 'That's not the reasons. In fact, it's important to recognize that this recall petition started circulating months before COVID 19 even reached our shores. And make no mistake, supporters of this recall seek to unravel the progress that we've made as a city in our fight against COVID 19.'",
        "'speaker_5': 'The Long Beach can't afford to sit this one out. The progress we've made in the city is is too important, and it's on the line. So now is the time for us to take a position, our city's future, and make sure that we understand that this recall election is happening.'",
        "'speaker_5': 'This isn't whether or not we want this recall election, how this is happening. And so we need to respond to this with urgency and take a position of no on question one for the seventh, the September 14th recall election.'",
        "'speaker_5': 'And so I'm happy to move our position of no for the city of Long Beach, a position in opposition of the recall election for the governor of California. Thank you.'",
        "'speaker_2': 'Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. This election, this recall election is a power grab by special interest who hope to delegitimize the votes that were cast in 2018. It delegitimizes my vote for the governor. This recall election will cost over a quarter of $1,000,000,000.'",
        "'speaker_1': 'And that's a, quote, equivalent to more than half of our general fund. Just for reference. This is a waste of time, energy and money by bet, by special interest. And this is dangerous for our democracy.'",
        "'speaker_2': 'Councilwoman. Councilmember Superman.'",
        "'speaker_5': 'Thank you. Independent of the comments made by my colleagues. I have to make this statement. The recall process is clearly outlined in the California Constitution, Article three, Sections 13 through 19, and in the California elections code. It provides a mechanism for the public to attempt to remove elected public officials from office before the end of their terms'",
        "'speaker_5': '. I have taken the oath of office on three occasions to serve on the Long Beach City Council. Each time I raise my right hand and I swore to support and defend the Constitution of the State of California, I believe that supporting this agenda item would be a clear violation of my oath of office.'",
        "'speaker_5': 'Therefore, I will be voting in opposition. Thank you.'",
        "'speaker_2': 'They can count. Remember, there's a motion in a second. There is no public comment. Members of his court and Castro notes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to request City Manager to work with the Public Works Department and the City Attorney to evaluate the feasibility of including a Third-Party vendor as part of the future electric scooter program agreements with operators.": [
        "'speaker_2': 'Thank you. Next item is item number 13, please.'",
        "'speaker_1': 'Communication from Councilwoman Price. Councilwoman Zendejas, Councilwoman Allen. Recommendation to evaluate the feasibility of including a third party vendor as part of the future electric scooter program. Agreements with operators.'",
        "'speaker_2': 'Thank you, Councilman Price.'",
        "'speaker_4': 'Thank you, Mr. Mayor. So scooters being deposited all throughout our district continues to be a major problem in the third district. And I appreciate our mobility team with whom I've had an opportunity to speak about this issue. It appears that council districts one, two and three are the ones that are primarily impacted by this problem.'",
        "'speaker_4': 'Scooters are dropped off in roundabouts in the middle of landscaping. They're dropped off in the middle of the street. They're dropped off on the bike path at the beach. They're dropped off on sidewalks, making it nearly impossible for ADA accessibility.'",
        "'speaker_4': 'And it's just not okay. And this was one of the concerns that was raised when we entered into our contracts with the scooter companies. We were assured that there would be mechanisms and technology in place to make sure that this debris isn't deposited all over the city, or at least in the three districts that are the primary'",
        "'speaker_4': 'users of these these technologies. And unfortunately, it just it continues to be a problem. So I'm hoping that city staff can explore the feasibility of putting into the new contracts a third party vendor that can assist the scooter companies, who clearly appear to be overwhelmed with the fundamental responsibility of making sure dump scooters are picked up, and'",
        "'speaker_4': 'that clearly they're not able to meet that burden that they committed to meeting. So perhaps working with a third party might assist them in fulfilling that obligation and commitment to the city that they have made as part of their contract.'",
        "'speaker_4': 'And hopefully that is an alternative that can be made available to the scooter companies to ensure mitigated quality of life impacts for our residents and certainly mitigated accessibility issues for our residents who are operating on the sidewalks, in wheelchairs.'",
        "'speaker_4': 'And I ask for my colleagues support on this.'",
        "'speaker_2': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. And thank you, Councilwoman Price, for bringing this item forward. I too regularly hear from my residents and city CD2 about the issues of having the scooters parked and laying against the ride away. I'm concerned about the impacts.'",
        "'speaker_1': 'Also with disabilities, people with strollers. I've seen the UPS guy have to pick them up. I mean, this is just a roll, a real issue. I'm also excited to hear from staff about my prior request to incorporate the SCOOTER compliance into our excellent Go on Beach app.'",
        "'speaker_1': 'So thank you very much and I'll be supporting this.'",
        "'speaker_2': 'Thank you, Councilman. And they have.'",
        "'speaker_4': 'Thank you, Mayor, and thank you very much, Councilmember Price, for bringing this forward. This is very, very important to me as well. And as a councilwoman, it is not only on, you know, my goal to make our transportation options more accessible to all, but also in expanding and redefining what safe, reliable, agreeable public transportation can look like'",
        "'speaker_4': 'in our city. I am a huge supporter of the Shared Micromobility program because it gives us the opportunity to create more transportation options that are not only good for the environment, but that are also convenient for residents as well.'",
        "'speaker_4': 'However, we still have a long way to go on this, so I am very thankful for this item and for us to be able to look at this and find a better word, a better way to work together and really include different kinds of programs in.'",
        "'speaker_4': 'And having a third party company come in and help us out, I think would be very, very efficient and very good for all of us. I would also like to when we're doing this may be that our we take a good look at what kind of third party companies are out there and really try to seek out'",
        "'speaker_4': 'companies that bring us the most to our city. So thank you very much, Councilwoman Pace and Councilwoman Allen, for this item.'",
        "'speaker_2': 'Thank you. We have a motion at a second and no public comment. Members, please cast your votes.'"
    ],
    "Recommendation to request City Council to support SB679 (Kamlager), which would create a new independent countywide agency to raise public and private funds for renter protections and support programs, affordable housing preservation, and affordable housing production-with a guaranteed seat for the City of Long Beach on the governing board and guaranteed annual funding for the City of Long Beach; and request City Manager to communicate the Citys support to the bills author and our state legislative delegation.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. Next up is item 21.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Allen, Councilmember Your Honor. Councilman Austin recommendation to support SB 679, which would create a new independent countywide agency to raise public and private funds for renter protections and support programs, and request the city manager to communicate the city's support to the bill's author and our state legislative delegation.'",
        "'speaker_2': 'There's a motion on a second baseman, Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. You know, it's not it's not often that the state legislature gives us legislation around housing that we actually get excited about. There's, you know, since the last redevelopment, there's been very few opportunities to actually put some points on the board.'",
        "'speaker_5': 'And I personally believe SB six, seven nine is one of those bills that will create some opportunities for here in Long Beach. Here's the context. We all know that we have to do more. We have to continue to do more around affordable housing here in Long Beach and across L.A. County, as our housing element makes it clear'",
        "'speaker_5': '. Now is the time for action. We have 17,000 people who are precariously housed in our city living in overcrowded or unsafe housing conditions. 43% of all Long Beach households are housed, housing cost burdened. And within that, 80% of very low income renters, the house burden, meaning they spend more than 30% of their income on housing costs.'",
        "'speaker_5': 'Eight out of ten low income people are getting crushed by housing costs. And across L.A. County as a whole, we know that we need at least 500,000 units that are affordable for working families and low income families. We've done our work here in Long Beach.'",
        "'speaker_5': 'We've done the research, we've done our planning. And we know that we need resources. We know that we don't have the funding locally to do what we need to do. And we've debated this quite a bit over the last few years.'",
        "'speaker_5': 'We've never returned to the level of funding for affordable housing that we had pre redevelopment era. And so we also know there are strict smart strategies out there deploying a number of them to bring together public private funding to reduce cost and increase speeds with which we support low income renters and create new housing.'",
        "'speaker_5': 'And we've been we haven't. And these are things that we we've we've supported. The New York Housing Development Corporation was created in the early 1970s and lasted 20 years. It's financed 186,000 affordable units across New York City and public and private sources.'",
        "'speaker_5': 'Now, we we we've come nowhere close to that here. The Bay Area created the Bay Area Housing Finance Authority, which is similar to the New York model, and also seeks to balance both regional and local approach. SB 679 The bill that we are we are considering support today would create the L.A. County Affordable Housing Solutions Authority.'",
        "'speaker_5': 'So it's a regional approach to help support and support our efforts here in the city. It's our opportunity to reject the status quo, the status quo and chart a new course on affordable housing, housing affordability here in Long Beach, across L.A. County.'",
        "'speaker_5': 'Now, here's what's good about this. I pay attention to the regional table. You know, at the SCAD, we don't have a dedicated, dedicated seat on AQAP or a metro. And I wanted my colleagues to know that that lobbies has been at the table helping to craft as be six, seven, nine.'",
        "'speaker_5': 'We made sure Long Beach has a dedicated seat on the governing board, which we do not have on Metro, which we do not have on AQAP. We made sure that Long Beach has a guaranteed baseline of funding. The bill sponsor estimates that Long Beach will be entitled to nearly $15 million annually from this agency without having to'",
        "'speaker_5': 'apply for it every year. That's what's possible with this agency in the context of a moderate, moderate revenue proposal. This is nearly five times what we're receiving from Measure H. This is this certainly deserves consideration. Represents a good balance of a regional and local approach.'",
        "'speaker_5': 'We don't infringe on our local land use powers. We still have the ability to have local control. And the last point is SB 679 creates a regional agency for L.A. County. It doesn't guarantee funding for the agency that that would be a future step.'",
        "'speaker_5': 'This helps establish the agency to be able to be able to do this work and think regionally. So let's not miss our chance to push this right. There's a lot of things in Sacramento that we we've either opposed or we've been silent on.'",
        "'speaker_5': 'This is something that is an opportunity to get to put something out that we can support and so we can make sure Long Beach gets its fair share. We can partner with the community. We can make sure our communities have a chance to ratify this ambitious solution and chart a new path forward for Long Beach and beyond'",
        "'speaker_5': '. So I want to make sure we make this motion to support this important bill. Thank you.'",
        "'speaker_2': 'Thank you. There's three public comments. It's good to hear the public comment.'",
        "'speaker_1': 'The first speakers. Andy Kerr and then. Nadia Tushnet and then Tommy Newman.'",
        "'speaker_6': 'Good evening, Mr. Mayor, and honorable members of the Council. My name is Andy Kerr. It's good to be in your physical presence this evening for the first time in a long time. In addition to being a resident of District eight, I also serve on the L.A. County Measure H Citizen Advisory Oversight Board and have worked on issues'",
        "'speaker_6': 'of homelessness and affordable housing for going on 20 plus years. In addition to that, I was proud to serve on the everyone at home Long Beach Task Force. And I think it's really great timing to be here talking about this item today after last week's great report from the Health Department and from city staff on the update'",
        "'speaker_6': 'to what's been done the last couple of years on the Everyone Home Long Beach efforts and our efforts to fight homelessness and restore housing security. When I was first asked to serve on the Homeless Services Advisory Commission by Councilman Austin several years ago, our budget for the city's Health Department Homeless Services Bureau was under $10 million.'",
        "'speaker_6': 'And then to see it grow to over $90 million here in recent years is was is really incredible that we is I think it's a testament to our city's commitment to this issue and growing those resources. But it's also a little disheartening to see how the challenges are even more acute than they were all those years ago'",
        "'speaker_6': 'today. And. I'm really convinced the data and the reports that I read on a daily basis, it's really clear that this affordable housing crisis is the driver of the homelessness crisis. And that's why I am here before you today to talk about SB 679.'",
        "'speaker_6': 'I think Vice Mayor Richardson did a did a great job laying out all the the positives to this solution. SB 6679 would advance the critical work that we identified on the everyone at home task that everyone at home Long Beach Task Force.'",
        "'speaker_6': 'We lost the critical dollars in redevelopment that.'",
        "'speaker_5': 'Vice Mayor Richardson spoke about in 2012.'",
        "'speaker_6': 'And Lacasse would help restore that work to our community. Since 2012, housing cost burdens have only gone up. Overcrowding has increased, and we've dealt with that in this pandemic. That was the worst situation we could go into. Going into a global health crisis that we've been going through the last couple of years is to have the overcrowding'",
        "'speaker_6': 'this that we have in L.A. County. And housing affordability is driving that.'",
        "'speaker_5': 'Problem.'",
        "'speaker_6': 'Just as critical as the direct support to Long Beach that Vice Mayor Richardson spoke about. La Castle would be a regional solution. And I think that's really important because this really is a regional crisis. Every city, all 88 cities in the county need to do more on this issue.'",
        "'speaker_6': 'And we have very limited resources. We don't have anybody to turn to like La Crosse are right now. So that's why I support SB 679 and hope you will, too. Thank you very much. Hi.'",
        "'speaker_4': 'It is good to be here again in person. I'm a Long Beach resident and I support SB 679.'",
        "'speaker_1': 'For a whole lot of.'",
        "'speaker_0': 'Reasons. We need much needed resources to build housing for people who.'",
        "'speaker_4': 'Are low income and very low income.'",
        "'speaker_0': 'I think it's also important to note that SB.'",
        "'speaker_1': '679 preserves existing.'",
        "'speaker_0': 'Affordable housing, and it builds housing that working families and individuals can actually afford. And it protects hundreds and thousands of renters from unjust evictions, rent increases and landlord harassment. I agree with Council member Richardson that the crisis is a regional crisis.'",
        "'speaker_4': 'It's actually a national crisis, but we can only deal with our region. And so I urge you to vote yes to support.'",
        "'speaker_1': 'SB.'",
        "'speaker_4': '679. Thank you.'",
        "'speaker_2': 'Good evening, Mr. Mayor and council members. My name is Tommy Newman and I work at the United Way. We're proud to be the bill's sponsor on this bill, but I'm really proud to stand with one heck of a coalition helping to drive this bill forward across L.A. County, labor, community based organizations, business organizations, philanthropic organizations, 60 plus'",
        "'speaker_2': 'organizations supporting this bill. Only one city in Los Angeles County is opposing this bill would be Santa Clarita. I can draw your own conclusions there. And so we hope that Long Beach is able to take this big step forward tonight, help us drive this bill forward.'",
        "'speaker_2': 'It's absolutely still alive in the legislature. It's caught up in some conversations between some of our labor partners around exactly what the right balance is on labor requirements. We're confident. Had a good meeting with the speaker two weeks ago.'",
        "'speaker_2': 'We're confident that they can find a solution. And we think that Long Beach coming in support this evening will help us find that solution. As Councilmember Vice Mayor Richardson said, this is a good deal. We think this strikes the right balance for Long Beach and other cities across this county.'",
        "'speaker_2': 'That's why United Way is working so hard with so many. And deeply appreciate your support this evening. Thank you. Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you. I'm happy to sign on. And second, this motion for many of the reasons already stated, and I think the vice mayor made a great points as well as public comment, I think we do have a responsibility as the second largest city in L.A. County, to be a leader in this regional approach.'",
        "'speaker_3': 'And I think this bill actually accomplishes that. I do have a couple of questions for staff, or at least a question. I'd like to get a staff report on this bill. I think we've heard a lot about it, but I'd like to know where the bill is currently.'",
        "'speaker_3': 'And you know what what what are the dynamics in Sacramento related to this bill? Absolutely. So as Mr. Newman from United Way mentioned, the bill did pass the Senate 29 to 7, but it is has been held up in the Assembly.'",
        "'speaker_3': 'It hasn't been referred to a policy committee at this point, given some broader negotiations around labor and other housing and other legislation as well. So not necessarily directly tied to this bill. It does require at this point a rule waiver in order to move forward.'",
        "'speaker_3': 'However, the legislature is still in session until September ten, so they still have about 3 to 4 weeks in order for this bill to move forward in the assembly. And in terms of just an overview of the bill, of course, the vice mayor and the public comment mentioned some of the high level points.'",
        "'speaker_3': 'But I would just emphasize, you know, the the bill is really about creating a new countywide agency separate from L.A. County and other city related agencies. So this really is a region wide approach. And part of the approach is really to make sure that there is buy in from cities and communities across the county, including having a'",
        "'speaker_3': 'seat for Long Beach on the governing board. And then there is in the legislation an overview of what the funding priorities would be depending on the revenue sources. So there would be investments in affordable housing creation and development, as well as renter support and assistance, very similar to what we've seen with our rental assistance program during the'",
        "'speaker_3': 'pandemic. And then there are also just outlines of what the priorities are for funding jurisdictions, including the city of Long Beach, being a direct funding jurisdiction within the bill. Great. And, you know, every year we go through a process to create a state ledger, gender, state legislative agenda through the state levels committee as well as the city'",
        "'speaker_3': 'council. Where does this this bill fall within our state lands agenda, or have we already kind of taken a position in terms of the. In a broader scope. Well, we have not taken a position on this bill specifically.'",
        "'speaker_3': 'We had assumed that at some point we would have a council conversation on the bill specifically, especially, you know, there has been some negotiations over the past several months with a working group to fine tune some of the details about how the agency would be structured.'",
        "'speaker_3': 'And there was negotiations with some of the smaller cities, as well as City of L.A. and County of L.A. just different dynamics and negotiations about how the agency should be structured. And for us, I do think at this point, the bill has been fine tuned in a way that is beneficial, of course, to Long Beach in terms'",
        "'speaker_3': 'of having a seat on the board as well as having direct funding opportunities. However, there is a question at this point from my perspective around it's a policy question really, which is, you know, around the funding revenue source for affordable housing across our state, LEGENDA supports additional resources for affordable housing.'",
        "'speaker_3': 'It would be beneficial. As I mentioned in the Council item, to have an additional local stream funding stream for affordable housing to leverage additional grant opportunities. But this would be created potentially through a ballot measure next year from this agency having the authority to put a measure on the ballot.'",
        "'speaker_3': 'Well, I'm certainly encouraged to know that the Long Beach has been involved in discussions from the beginning and that should a ballot initiative pass and the agency is created, that we will have a solid seat at the table because that is not the case, as I mentioned, in many other regional boards.'",
        "'speaker_3': 'Those are my comments. Thank you. I look forward to supporting this item.'",
        "'speaker_2': 'Thank you, Councilwoman Longo.'",
        "'speaker_0': 'Thank you. I want to talk a little bit about the feedback I've received from the community. I appreciate some of the speakers today have already had one on ones with and I appreciate your input and the great dialogs that we've had and the negotiation around the structure isn't the only thing.'",
        "'speaker_0': 'I think the negotiation around the revenue is a big part of that and I'm very supportive of a ballot measure because people should have the right to determine their own taxation. I think the other part of this that's pretty supportive of what I hear from residents of the fifth District is that there are always cities across the'",
        "'speaker_0': 'region doing their part to support the production of housing. And while this bill does not build any housing, it definitely provides the incentive option and not just the stick. The stick is currently what we hear all the time that we need to increase our arena numbers.'",
        "'speaker_0': 'We need to do this and we need to do that. But there are lots of cities who are choosing not to participate and that the penalties that they face aren't aren't dramatic enough for them to want to transition their plan and put in the effort.'",
        "'speaker_0': 'There are also a lot of cities who don't have the resources or expertize that a city the size of Long Beach has, and this agency could provide those templates for cities of those size. So I really like the buy in and regional approach and the incentives.'",
        "'speaker_0': 'And I think that this would release a lot of the pressure on the cities like ourselves who are doing our part in the whole system. So that is the reason I'm supporting tonight. Thank you.'",
        "'speaker_2': 'Councilman Allen.'",
        "'speaker_1': 'Thank you. I'm proud to sign on to this item. Thank you. Vice Mayor Richardson are leading on this. And also I want to say thank you to Nadia and Tommy Newman and all your coalition for your comments. And I also have to give a special thank you to Andy Kur for your comments and your service on this'",
        "'speaker_1': 'county commission. I know how dedicated you are to these issues. You are one of my go to people when I was running for office to get up to speed and I know how dedicated you are, so thank you for being here tonight to speak on this.'",
        "'speaker_1': 'We need more housing production and we need more streamlined funding to get it done. And this bill will provide representation on the new agency board for Long Beach, and it would also provide direct funding for the housing in Long Beach.'",
        "'speaker_1': 'And this is important because we need more renter protections and support. It makes Long Beach a more affordable place to live for our long time residents and provides homes for our children. And hopefully one day it gives them an opportunity to own a home of their own.'",
        "'speaker_1': 'So thank you very much and I'll be supporting this.'",
        "'speaker_2': 'Thank you. Conference in the house.'",
        "'speaker_4': 'I want to echo my colleagues and Councilmember Allen's comments and thank Vice Mayor Richardson for bringing this item forward and also city staff for elaborating more where this bill is right now. I think that this is really, really, really an exciting plan to bring to our city, because it is so, so very true that when everyone is'",
        "'speaker_4': 'in, everyone wins. And I think that this is ideal timing. Our city is in dire need of multilingual and workforce development programs that can support and empower our most in need communities to help ensure that every person has the tools available to thrive.'",
        "'speaker_4': 'And that is exactly what this bill is going to provide. So I'm very, very happy to support this. Thank you all for all the wonderful work that you've done on this.'",
        "'speaker_2': 'Thank you. Councilman Sarno.'",
        "'speaker_4': 'Thanks, Mayor. I want to add to the thanking my colleagues, vice mayor of Richardson leading as well as Councilman Urunga, Austin and Allen for bringing this forward. You know, I know that we have been spending we've been spending a lot of money to address our homelessness issue.'",
        "'speaker_4': 'And I think that it's time that we do have a dedicated funding source to be able to address really what people need in the end of the days to be housed. And obviously, we cannot build housing if we don't have the funds.'",
        "'speaker_4': 'So I want to also thank all the advocates and organizer who have worked hard in ensuring that this bill moves forward and I wholly support this item. Thank you so much.'",
        "'speaker_2': 'Thank you. There's a motion on the second, I believe there is public comment on this. We did have a comment on this item. So, members, please cast your vote.'"
    ],
    "Recommendation to request City Manager to work with the City Attorneys Office, the City Prosecutors Office, and the Code Enforcement Bureau, to provide a report on the current nuisance violation fine structures and the feasibility of increasing penalties and/or fines or fees on property owners/managers or tenants depending on staffs recommendations, to allow for more effective enforcement tools and resources to address nuisance activities. This should also include evaluating options for fines or fees to be based on income qualifications, and if community service was feasible in place of fines where appropriate.  This report will also include evaluating opportunities and the feasibility of bolstering the Code Enforcement ordinances and relevant provisions of the Municipal Code and aligning with best practices.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Maximum 16.'",
        "'speaker_1': 'Communication from Councilwoman Price, Councilwoman Zendejas, Councilwoman Allen, Councilman Austin. Recommendation to request City Manager to provide a report on the current nuisance violation, fines, structures, and the feasibility of increasing penalties to allow for more effective enforcement tools and resources to address nuisance activities.'",
        "'speaker_2': 'Councilwoman Price.'",
        "'speaker_4': 'Thank you, Mr. Chairman.'",
        "'speaker_2': 'I also got a second on this, please.'",
        "'speaker_4': 'Thank you, Mr. Mayor. So I just want to. The item as written is pretty self-explanatory, but I just want to highlight that we're looking in this item for a report on how to make code enforcement more effective, not necessarily to penalize people.'",
        "'speaker_4': 'There are alternatives outlined in this particular agenda item, such as community service in lieu of fines or fees, but really encouraging. People who are living in some of these new developments that we're starting to see pop up in residential neighborhoods to appreciate the right of every resident in the community to use and enjoy their property with peace'",
        "'speaker_4': '. And so I think it's a really important time, given some of the state legislation that's coming out, this limiting our ability to put into place mitigating impacts, mitigating requirements that might help with some of the impacts in neighborhoods.'",
        "'speaker_4': 'We're not able to do that as a result of the state.'",
        "'speaker_0': 'Legislation.'",
        "'speaker_4': 'That's come forth. So I think it's important for us to take a look at what tools we have to make sure that quality of life impacts are at a minimum. I want to thank my colleagues who signed on to this item and asking for a report.'",
        "'speaker_4': 'This specific item comes as a result of some recent changes to state policy, which have allowed for, in some cases, a three bedroom single family home to become an edu 11 bedroom, 11 bath home on the same lot in the residential neighborhood.'",
        "'speaker_4': 'I am 100% in favor of more housing and absolutely believe that ensuring we are continually adding housing to Long Beach because it's important to our city as we grow and we want to make sure that we keep seeing residents thrive and love our city.'",
        "'speaker_4': 'This particular development, however, is a market rate 11 bedroom, 11 bathroom development near Long Beach State. It is not an affordable housing site, and it is not a site that's designed at all to help people who are under, housed, receive housing.'",
        "'speaker_4': 'It is undoubtedly an opportunity for developers to take full advantage of state law, allowing them to build at full capacity market rate housing. This change and changes like this. Are important for us to look at in terms of what options are available to us to help keep our neighborhoods at their best with little negative impacts in the'",
        "'speaker_4': 'form of parking issues, increased noise, excessive trash, or other types of impacts to residents in the nearby communities and nearby homes. This item asks for city staff to look at ways of making our code enforcement as efficient and effective and up to date as possible.'",
        "'speaker_4': 'Whether that's looking at fines or fees or looking at ways of adjusting fines based on income for those who may struggle to pay a violation, as well as options for community service in place of fines. The goal of this item is to encourage good neighbors and make.'",
        "'speaker_0': 'Sure we have effective.'",
        "'speaker_4': 'Tools at our disposal to keep the neighborhoods and as the place best places they can be within our municipal code. While looking at what tools may be most effective for different neighbors. And I ask my colleagues to please support this item, which is asking the city attorney's office to really take a look at what enforcement mechanisms we'",
        "'speaker_4': 'have in place and how we can make those more effective to address the changing dynamics of our housing situation in the community of Long Beach. And I know that we do have some members of the public here to speak who are from that exact community.'",
        "'speaker_4': 'Of the development I just mentioned. But they are not alone. This is just the first of such developments and I do expect more to come in the near future. So. Thank you, Mr. Mayor.'",
        "'speaker_2': 'That's when Austin.'",
        "'speaker_3': 'Obviously I second this motion. You know, sometimes the legislation is passed in Sacramento that is well-intended. But oftentimes if the details are not really identified or discussed, the unintended consequences can result. And this is clearly an outlier, not the norm.'",
        "'speaker_3': 'And we as a city, I think, have a responsibility. To our residents to know keep the quality of life in intact and obviously support local control as much as possible. And so I support this item and look forward to the city attorney coming back with some good solutions, hopefully.'",
        "'speaker_2': 'Thank you for a public comment, please, Madam Quirk.'",
        "'speaker_1': 'Speaker number one is Jim the tall. Number two is Katie Larson. And speaker number three, jennifer and feld. Can you please come to the podium?'",
        "'speaker_5': 'Good evening, Mayor and City Council.'",
        "'speaker_2': 'My name is Jim Painter. I'm in the.'",
        "'speaker_5': 'La Marina neighborhood next door to Cal State, Long Beach. A longtime resident of Long Beach. 30 years. First time speaking before the council. So please forgive a little nervousness. And thank you so much, Susie, for your introduction to this situation.'",
        "'speaker_5': 'I came here with notes and comments, but I can't say it any better than what Mr. Austin and Mr. Mrs. Price has already explained the situation to you in the introduction to you. The city prepared to mentions an 11 bedroom, one bathroom adu development on a single family lot.'",
        "'speaker_5': 'That's us. That's our neighborhood. And we're we're scared of that. But we're here today to support this item 16. And we thank you, not because we oppose any kind of housing. We all recognize the challenges in our state.'",
        "'speaker_5': 'But because we want to make sure that we continue to live in a great neighborhood. And we're here tonight not only to share those concerns, but we're briefly going to talk about a success story that we may be able to share with you.'",
        "'speaker_5': 'I can define our concerns, but I think it might be more meaningful to hear. I have in front of me a report from Gary Sheets, the city attorney for the City of Orange, that he prepared for his city council.'",
        "'speaker_5': 'He talks about their concerns. City of Orange is ahead of us on this. They have several of these mini dorms. And I'd like to share with you a little bit of the concerns that they have. The many dorms already constructed have caused numerous negative effects on families residing in nearby instances, including but not limited to parking on'",
        "'speaker_5': 'front lawns. I like to make a point. This one bedroom development is to house 15 to 22 students. That's the stated by the developer. The impact on the residences nearby including but not limited to parking on front lawns, illegal street parking, unsafe vehicle speed demonstrations, trampled landscaping, landscaping, loud music, unruly parties, congregation a crowds from outside the'",
        "'speaker_5': 'neighborhoods in the front yards. Confrontational interactions with neighbors. Public drinking, numerous late night disturbances, litter and trash, including bottles and caps strewn about the neighborhood and what has been described by the residents as a fraternity atmosphere. All of which effects constitute a public nuisance to our community.'",
        "'speaker_5': 'The city attorney summed it up this way. The effects are swiftly and significantly contributing to the deterioration of the peace, health, safety and welfare of the neighborhoods where such remodeling projects have been constructed. And I will point out that the developer of the many dorms at Orange is the developer of the many dorms here in Long Beach'",
        "'speaker_5': '. So yes, we're worried.'",
        "'speaker_1': 'But the time has expired.'",
        "'speaker_5': 'Okay. I will sum up then that I was going to show you that the city of Berkeley has also addressed this problem and using city ordinances and using nuisances ordinances. They have successfully worked with the many dorm residents and the city.'",
        "'speaker_5': 'I wanted to say thank you for all the work that you've done and you and Jack and I'll pass it on to my next speakers. Thank you.'",
        "'speaker_0': 'Good evening, Mr. Mayor and council people. A special thanks as well to Councilman Price for the work that she and her office have already done on this. My name is Katie Larson. I'm a resident of La Marina Estates, as well as a local realtor.'",
        "'speaker_0': 'I am very much aware of the housing shortage that is going on and how it has driven up prices not only on home sales but on rents. An average rent of a family single family home in our neighborhood is $4,000 a month.'",
        "'speaker_0': 'This bill that is going in on honorably, well, when full will be a rent of $16,000 a month, four times the rate of an average home. Of course, it's divided.'",
        "'speaker_7': 'Up into 11 rooms.'",
        "'speaker_0': 'This is not affordable.'",
        "'speaker_7': 'Housing being.'",
        "'speaker_0': 'Put into our single family.'",
        "'speaker_6': 'Neighborhood, nor does it adhere.'",
        "'speaker_0': 'To the way that our neighborhood.'",
        "'speaker_7': 'Has been zoned.'",
        "'speaker_0': 'This is not unique to East Long Beach. We are like neighborhoods in any one of the nine districts you represent. Any lot that is more than 5000 square feet. We are all vulnerable to the abuse of the housing laws.'",
        "'speaker_0': 'We're just first up due to our proximity to the university. We also pay for parking permits. Each home is allowed three parking permits and some temporary permits.'",
        "'speaker_7': 'Far more are far fewer than will be needed for this. So we.'",
        "'speaker_0': 'Are expecting there will.'",
        "'speaker_7': 'Be impact.'",
        "'speaker_0': 'To the parking in the neighborhood. Whether it's parking.'",
        "'speaker_6': 'On lawns.'",
        "'speaker_0': 'It's illegal parking, blocking driveways or blocking access to.'",
        "'speaker_7': 'Other homes.'",
        "'speaker_0': 'Also. What about the additional trash? I went to college. I know what goes out of dorm windows and.'",
        "'speaker_7': 'Out of on fraternity row. I know I've seen those things.'",
        "'speaker_0': 'So there's also a mini dorm, again, by the same developer going in across from tincture prep. Is that the type of atmosphere we want across the street from an elementary school? We have co-existed with student renters for many years.'",
        "'speaker_0': 'Most of them are very conscientious neighbors.'",
        "'speaker_7': 'We welcome the students.'",
        "'speaker_0': 'We also have had terrible student renters where the police.'",
        "'speaker_7': 'Have had to intervene, where we have.'",
        "'speaker_0': 'Been awakened in the middle of the night with music and noise. That's us with 4 to 6 renters. Imagine having 20 renters next door. We would have no recourse should there be a problem. Because right now we can go to a single owner or to a tenant and ask for help.'",
        "'speaker_0': 'Now, with 20 renters in there. One tenant's going to blame another, blame another. So what we really need are ordinances to put structure on how these mini dorms are released and how we can help these tenants be good neighbors.'",
        "'speaker_0': 'Again, we welcome the students. We want prohibitive fines on both the tenants and more. Most of all on the owners. So to prevent this and I like the idea of there being community service for.'",
        "'speaker_7': 'The tenants who may not be able to afford the fines.'",
        "'speaker_0': 'So please help us move forward with enforceable ordinances so that we can maintain what we have worked.'",
        "'speaker_7': 'So hard to achieve to become homeowners in our.'",
        "'speaker_6': 'Beloved Long Beach. Thank you.'",
        "'speaker_2': 'Thank you very much. Our final speaker.'",
        "'speaker_0': 'Good evening, County Council members. My name is Jennifer Landefeld, and I've lived in Long Beach for over 35 years. 21 years of those years in my current home, we raised our children here and we think Long Beach is a gem of a city.'",
        "'speaker_0': 'We love Long Beach. I consider my current home, my forever home. I'm here today to urge councilmembers to approve moving forward with this item to ensure we continue to live in a wonderful neighborhood. With 11 bedrooms and 11 bathrooms.'",
        "'speaker_0': '80 new structure currently being built next to my home. This is very personal. Let's find ways to ensure such structures do not have negative impacts to our communities by expanding our enforcement codes. I am open to change and co-living environments.'",
        "'speaker_0': 'I care about our community and want to see it thrive and continue to be a great place to live. I feel that our city also wants us to. I have strong concerns, however, of the noise, parking, litter and other issues that may result from a student dormitory with between 15 and 22 students and their friends being built'",
        "'speaker_0': 'next door. We have successfully co-existed with the university and its students for years and welcomed them in our community. The latest tenants were respectful. We became friends there, admired by other neighbors. However, the tenants before them were another story.'",
        "'speaker_0': 'I mean, they had their parties started at midnight and were ended, you know, in the early morning. This caused numerous sleepless nights. I want them to be good neighbors and with some added attention to code enforcement ordinances. I think that can be.'",
        "'speaker_0': 'Let's give them a path to do so. Thank you.'",
        "'speaker_2': 'Thank you very much. I have some folks queued up to speak, Mr. Modica. Just just a question, because I. I did read about this and I've heard as well. To me, I'm just trying to understand how you can put 1180 use on one lot.'",
        "'speaker_2': 'And what what I don't understand is I think the city has a proud record of building a lot of housing. We should always be building more. I think we know that. And certainly transit quarters, the downtown, we continue to build and build, but certainly adjacent to single family homes to build 11 units seems particularly for the potential'",
        "'speaker_2': 'of that to replicate itself. I think it's very problematic. What how how is this can you for those of us that aren't as clued in as possible price. Is this is this actually a state law?'",
        "'speaker_7': 'Is there some history to this project? So I'll ask Oscar Orsi, our director of development services, to talk it through. Yes. Thank you, Mayor. Members of the city council.'",
        "'speaker_2': 'The current state.'",
        "'speaker_7': 'Regulations have a bit of an outlier. So for those properties that have a larger lot.'",
        "'speaker_2': 'Than your neighborhood, they're allowed to build additional units.'",
        "'speaker_7': 'There is no limit on the number of units that you can do. So as a consequence, in this.'",
        "'speaker_2': 'Particular example, you have a larger than the normal sized lot in the neighborhood where they were able to come in and do the 80 you and the Jedi, you.'",
        "'speaker_7': 'Add to total the total of.'",
        "'speaker_2': 'Approximately 11. So it does meet the state edu act requirement. Okay. I mean, I think I think all of us here truly encourage homeowners to want to build ideas, use. I think we certainly support heavy use across the city.'",
        "'speaker_2': 'But it obviously seems that the intention, I doubt anyone's intention at the state level was to get 1180 use on one lot.'",
        "'speaker_7': 'Do you think this will be a pretty rare occurrence?'",
        "'speaker_3': 'This was a pretty unique.'",
        "'speaker_7': 'Situation with the size of this lot. You know, that said, you know, there are concerns that there could be some others. And so this is something we're.'",
        "'speaker_3': 'Required to.'",
        "'speaker_7': 'Process that we have to do because of the state law. But we understand there is there is concern when you get that many units.'",
        "'speaker_2': 'On a site. And I would like to know just if there are other sites that we are concerned about. I think I would rather proactively know about where these sites are so that we can understand and be prepared for that.'",
        "'speaker_2': 'In addition, I'm just wondering, and I think this is what Councilman Price is probably getting to also in this item is. We are we are certainly going to try to put in certain levels of protections or or rules around these areas.'",
        "'speaker_2': 'There's a reason why we don't, for example, just permit. Dorms in the middle of residential neighborhoods. So I just want to make sure that there is that that going to be reported back on as part of this item.'",
        "'speaker_2': 'Mayor. Yes, we can. We're going to do not.'",
        "'speaker_7': 'Only to visit the legislation, but also take a look at our existing legislation. We do have specific regulations that covered sorority houses for turnkey houses, and we'll make that.'",
        "'speaker_5': 'Analysis as well.'",
        "'speaker_2': 'And I support it. And I think it's great that the university, by the way, is building a lot of on campus housing. And I think I think a lot of folks support that. I'm also wondering if this is an actual because it seems to me to be it's not really about any issues which which I think people'",
        "'speaker_2': 'support, we all support. But there obviously is some sort of issue, I think, within the law that was passed in Council Member Let me just clarify.'",
        "'speaker_7': 'They meet the current regulatory.'",
        "'speaker_2': 'Requirements.'",
        "'speaker_7': 'Of one ADU and one Jay Junior Adu. What the issue is, is the number of units, number of bedrooms within those 80, as well as the home's number of bedrooms. So there's a total of about 11 bedrooms within within.'",
        "'speaker_2': 'The home and the the adu.'",
        "'speaker_7': 'So that's one of the things we also wanted to visit.'",
        "'speaker_2': 'Is are we working with our state partners at all to to. Because to me, this seems like a very rare occurrence that could be addressed at the state level. That's something that we've been we've been discussing with staff, including Dr. Curley.'",
        "'speaker_7': 'To determine what we can do. I think the City of Orange has has an option there that we would like to visit. But I.'",
        "'speaker_2': 'Believe we are.'",
        "'speaker_7': 'Very limited in terms of what we can do based upon current state.'",
        "'speaker_2': 'Legislation. Thank you. I look forward to report back. Councilman Mongo.'",
        "'speaker_0': 'Thank you. So several weeks ago I brought an agenda item where I specifically asked development services to identify the blocks of the city that would be most impacted by similar types of legislation. Many of you know, similar to Councilman Price, I have a university in my district and that university is adjacent to some of the biggest lots'",
        "'speaker_0': 'in the whole city. And one of the things that I hear from development services and even sometimes interns on my own staff is, well, you know, it really couldn't happen to us because you can't knock down a current structure.'",
        "'speaker_0': 'And I say you misunderstand. The current structures are on the very front of this parcel, and that parcel is 27,000 square feet. And it's like that because it's always been like that. You might call them double lots or triple lots, but in the forties those were the size of the lots on that particular street, and they've never'",
        "'speaker_0': 'changed. And there are houses that have nothing back there. You can look at the gears and see where that is. And so while we have a large number of people who are supportive of an ADU, like Mr. Orsi said, if that Adu has three bedrooms in it and another three bedrooms on the front house, already had five'",
        "'speaker_0': 'bedrooms, all of a sudden what you're talking about is serious business. And I think that our staff tried to do the analysis by downloading the assessor's data on parcels and the percentage of land already built. And it's a difficult analysis for my summer intern to do.'",
        "'speaker_0': 'We don't have a robust staff like the department services office with decades of experience. So I would like to know when my agenda item is coming back, because I think that that would help us work with those communities to then mobilize and talk to our state senators and Assembly members on what specific things we would need to'",
        "'speaker_0': 'ensure that single family communities don't turn into dormitories. Do we know what that timeline is? I know that.'",
        "'speaker_2': 'Some of them are. We're coming back to you at the next legislative committee agenda or meeting, which is, I believe, the next Wednesday.'",
        "'speaker_0': 'Okay. And so I'm not on the state budget committee, but I do appreciate that that is the appropriate place for it to go. I encourage you to attend. This will help identify the specific places throughout the city where that happens.'",
        "'speaker_0': 'And then hopefully we can create a coalition of residents and the third residents and the fifth residents of different places in the city that we could pull together and really strategize and work towards the next housing item folding in something to correct this issue.'",
        "'speaker_0': 'And I think that that would be very helpful. Furthermore, my my side of the city is also a little bit different. So a lot of the individuals who've owned these parcels have owned them in their families for generations.'",
        "'speaker_0': 'They've passed them down and that's great. So the developers aren't really able to buy the whole lot and start from scratch. What we've started to receive in the fifth District are postcards. Postcards that say. We would like to rent your backyard.'",
        "'speaker_0': 'We will build the ideas. We will rent them out. We will manage them for you. And all you have to do is take a cut of the income. And these postcards are going to our senior citizens saying, hey, would you like an extra two grand a month?'",
        "'speaker_0': 'We know you live on Social Security of 850 a month. Think how this could change your life? And we want to be sure that there's another component of this, because in my side of town, the other component of this is that some of these seniors are aging and they don't have family close by.'",
        "'speaker_0': 'And one of the things that we recently said is we sometimes get calls about neighbors and it goes directly to being a code enforcement issue. And what I've reached out to, Kelli Colby, our health director, and said is this might not be a health department issue, this might be a wellness check.'",
        "'speaker_0': 'And if, in fact, one of these seniors puts these dormitories on the back unit, I think we do need to be aware of what dynamic could come forward and the potential seniors abuse that could occur. And so I think that when looking at.'",
        "'speaker_0': 'Nooses, violations, all all of that. I'd love to make sure that when a violation comes in when they are owner on on premise that we also have a wellness check component for our senior community. Because as many of you know, I worked with adult protective services for years and senior abuse is a serious thing that can happen'",
        "'speaker_0': 'very quickly. And young people who are afraid of getting in trouble with the law might be perceived differently than they intended, and the senior might be in a tough spot. So I'd love to see a component of this because I don't see my ADA use being developers buying the full property.'",
        "'speaker_0': 'I see my ideal issue being more of a owner, maintaining their property with the units on the back and then a new dynamic occurring within our community. Thank you.'",
        "'speaker_5': 'Thank you, Councilwoman Zendejas.'",
        "'speaker_4': 'Vice Mayor. Thank you, Councilmember Price, for bringing this item forward. As we all know, it is for a very exciting opportunity to address our housing situation. However, we must do our best to ensure that as we move forward in implementing solutions, we did not set ourselves up for future issues and concerns that could have been prevented in'",
        "'speaker_4': 'the first place. Supportive of this item.'",
        "'speaker_5': 'Thank you. I'm cued up next. I just wanted to say that I think this is like a worst case scenario of the of what folks envisioned with the AIDS situation. I think that we certainly need to engage at state ledge around some some legislation here.'",
        "'speaker_5': 'I think if you look at enough cities that have examples like this, there should be a way for us to put some protections or some limits on due process. So thank you, Councilmember Price, for bringing this forward. Next is Councilwoman Allen.'",
        "'speaker_1': 'Yes, thank you, Vice Mayor, and thank you, Councilwoman Price, for bringing this item forward. I agree with the first speaker I think you did a great job at. Or do you think that item? I definitely support 80 use, but my goodness, 1180 use on one property seems excessive.'",
        "'speaker_1': 'So I do understand why neighbors are concerned. I also support a good neighbor policies and I'm happy to see that they're processes that make it easier for resident for residents to under stand. The rules that everyone needs to abide by is going to be important.'",
        "'speaker_1': 'So happy to support this item. Thank you.'",
        "'speaker_5': 'Thank you. Councilman Price.'",
        "'speaker_4': 'I just want to end with a couple of things. So this legislation is HB 68, and we did write I did write a letter to our Long Beach State delegation sharing with them the unintended consequences of this type of development.'",
        "'speaker_4': 'We did have a meeting with one of the the members of the state delegation, and we did have development services. And I'm not sure if Dr. Crowley was present. I can't remember. But we did a Zoom call. We talked about the unintended consequences.'",
        "'speaker_4': 'And there were a couple of things that were made clear. One was the access to parking or the parking impacts was really a. Kind of a dead on arrival issue because of the proximity to transit corridor. And the legislature has stated very clearly that the proximity to a transit corridor mitigates the parking impact issue.'",
        "'speaker_4': 'And so that's just not an area where it was ripe for discussion. We were also advised that if we were able to go out and talk with. So my recommendation was, why don't we tie units like this to affordable housing?'",
        "'speaker_4': 'Because what we're trying to accomplish is more housing that's affordable. This particular development, these rooms are going to go from anywhere from 1000 to 1400 dollars for a single room. That's ridiculous. That is not affordable. College students cannot afford that.'",
        "'speaker_4': 'And so if they tied it to affordable housing and had a component, it might be a disincentive for developers like these developers who I have met with and no knock on them whatsoever. But they were very clear and transparent with me that there is a loophole in state law and they are targeting college towns and trying to'",
        "'speaker_4': 'develop these types of housing developments. That's that's what their whole investment partnership and I appreciate it. I appreciate that they're operating within the law and they're trying to make some money, but they are targeting. That's why they're targeted.'",
        "'speaker_4': 'Orange Because of. Chapman This is not an outlier situation at all. We already have another application in the third district and more are going to come. So the application in the third district is already being processed by development services.'",
        "'speaker_4': 'There is very I mean, we can we can sit up here all day long and advise city staff about let's make sure we have these protections and that protections. There is very little we can do. It is not a fraternity or sorority house, so we can't impose the same regulations on them as we would a sorority or'",
        "'speaker_4': 'fraternity house. So making a recommendation like that to city staff. Sounds like we might be able to do something, but I don't want to give the residents false hope because I've been working on this issue for a long time now and our hands are tied.'",
        "'speaker_4': 'And that's why looking at the muni code like Berkeley did and solidifying what muni code protections we have there to protect people from noise intrusion, light intrusion, trash and other types of impacts and making sure the residents have those tools at their fingertips so that code enforcement can go out and actually educate the residents and the owners'",
        "'speaker_4': 'on what the expectations are, I think is very important, and that's what this item is about. This item was brought forth with full understanding of what our limitations are, which are huge. This is state legislation and the advice that was given when we met with our delegate was that if we could talk to the housing advocates and'",
        "'speaker_4': 'get the housing advocates on board for some tweaks to SB 68, then we might be able to move forward. But I don't know that it's the role of a single council member on behalf of the City Council to engage with housing advocates about state legislation.'",
        "'speaker_4': 'And so this is an item that I discussed the last time our state led agenda came forth in terms of asking for our state legislature committee to advocate for more local controls and changing existing state legislation to modify a bit in light of the realities that have presented themselves that I don't think anybody wanted.'",
        "'speaker_4': 'I really don't think our state legislature ever intended this to happen. Providing more market rate housing. In the third district is something I'm sure they were not envisioning when they passed this legislation. But yet that's what we have here.'",
        "'speaker_4': 'We have more market rate, super expensive, unaffordable housing in a residential neighborhood where a lot of people are going to be crammed into a very tight spot. Mr. Orsi Do you know the size on this particular development?'",
        "'speaker_7': 'Councilmember I'm going to have to get back to you.'",
        "'speaker_4': 'I do not know problem. But it is it's a single lot. We're not talking about a double lot property. It's a single lot in a residential neighborhood. So I appreciate the support of my colleagues.'",
        "'speaker_5': 'Thank you. Final comment, Councilman Sabrina. Thank you. One of the speakers mentioned preferential parking and that's going to be a major impact here. And there's a few things we can do through local control on this. For instance, the speaker mentioned you can have three permits plus a guest permit per household.'",
        "'speaker_5': 'So if the ADU is giving given a separate address, guess what, that number doubles. So we want to keep an eye on that. And also just the the preferential parking process in itself. So this location is near the border of the third and fourth District.'",
        "'speaker_5': 'So a block and a half north, we've had an expansion request for the preference of parking there. It's been pending for a year. When these things happen, those expansion requests are going to come very quickly and the impacts are going to be realized overnight virtually.'",
        "'speaker_5': 'And so I'd like us to look at that process, too, with the permission of the maker of the motion. I just like to add that I know there weren't specifics on what we're asking for, but perfect. Your parking is a big one and that transfers the problem to other neighborhoods.'",
        "'speaker_5': 'Thank you. Thank you, Councilwoman.'",
        "'speaker_0': 'Mongo, to build on what Councilmember Super said. And in our area, we also have the preferential parking district. And it's not going to make a difference how big you make it. The college students scooter and skateboard from the outskirts.'",
        "'speaker_0': 'So if you move it out 400 feet, they're just going to park outside that you move it out a half a mile. They're just gonna to park outside of that. So you're just continuing to transfer that issue. And I totally agree with all that's been said today.'",
        "'speaker_0': 'And I just want to emphasize again, I didn't even know Councilman Price was working on this. My district's been working on it in our own way. But I think that the thing that's really important is. The developers have the money to run the data and get a step ahead of us every step of the way.'",
        "'speaker_0': 'That is why they know exactly what houses to send postcards to when they went in and tried to buy the properties. And that wasn't effective. They have a second tier strategy and a third tier strategy, and so I appreciate that they were transparent and I'd love to learn any additional things that you learned from that meeting, because'",
        "'speaker_0': 'I haven't been as successful. When we call the people who send the postcards, they don't want to meet with us. Thank you.'",
        "'speaker_5': 'Thank you. Members, please cast your vote. I'm a yes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. I wanted to do that. I think there's three members of the general public comment. So let's do those, please. And they're going to do it in 15.'"
    ],
    "Recommendation to receive and file a presentation from the Long Beach Center for Economic Inclusion on their progress and activities in their first year of operation; and   Direct City Manager and Economic Development to prepare a memo on the implementation status of the citys Everyone in Economic Inclusion Plan and present to council within 90 days.": [
        "'speaker_2': 'Thank you, Mr. Speaker. Mr. Speaker, I think a time in times of. Thank you, sir. Next up is that of 15 policemen.'",
        "'speaker_1': 'Clear indication from Vice Mayor Richardson, Councilwoman Cindy, House Councilwoman Sara, Councilmember Arango, recommendation to receive and file a presentation from the Long Beach Center for Economic Inclusion on their progress and activities in their first year of operation.'",
        "'speaker_2': 'With me, Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I want to take a moment and invite the leadership of the city's newest community development corporation, born out of action here at City Council on the Center for Economic Vision to provide an update on their progress in the first year.'",
        "'speaker_5': 'And so I want to pass it over to the leadership. Jeff Williams and Byron Reed. We have our presentation. Good evening, Mayor Garcia and Vice Mayor Richardson and council members and staff. Thank you so much for this opportunity.'",
        "'speaker_5': 'To give you a brief update on the new Miami Center for Economic Inclusion and and introduce our new leader. I it's good to see everybody. I haven't seen so many people since the before time. So in a quick aside, I just wanted to say that so many of you have been so supportive of me and the work'",
        "'speaker_5': 'I've done over the past ten years. And and I always felt like I had a lot of access and opportunity here. One of the roles we did and you entrusted us with your leaders and and your staff and your and we were able to bring 700 people over the last ten years to the city hall and the'",
        "'speaker_5': 'chambers to learn about our city. And I think the the big takeaway from that for me was it was about public service. And it was great to introduce our leaders to true public servants, elected and staff. So I just want to say that aside, and I thank you for for all your support tonight, I want to give'",
        "'speaker_5': 'a brief update on on the organization. And then I'm gonna introduce our our new leader, and you have the presentation in front of you. I'm I'm just going to walk through it kind of quickly, and I'll be happy to answer any questions at the end.'",
        "'speaker_5': 'Go ahead to the next slide. So the one B Center for Economic Inclusion was actually born out of a partnership here with the city. So the blueprint for economic development in 2017 called for one of the seven focus areas to be economic inclusion.'",
        "'speaker_5': 'And following that, thanks to the vision and leadership of the Vice Mayor, the EVERYONE Implementation Plan was brought forth. Working groups. Many people who are probably here in this chamber were part of the everyone in working groups centered on bringing how we can bring more inclusive economic opportunities to our city.'",
        "'speaker_5': 'And out of that was was the one the plan and that was unanimously adopted by the city council in 2017. One of the main outcomes of that plan was to create a new community development corporation, which became the Lobby Center for Economic Inclusion.'",
        "'speaker_5': 'So next slide, please. So there you can see the mission is to is to create a community development corporation that will expand inclusive economic opportunities for underserved communities in our city. Had it called out five focus areas, as you can see here.'",
        "'speaker_5': 'And the purpose of this is to serve the historically underserved economic communities, primarily in north, central and west Long Beach. Next slide. The vice mayor put out the call and said there was a gap and we need help.'",
        "'speaker_5': 'And as you know, probably recognize many of the people up there. This is our founding board of directors that came together to help take this plan from a vision to action. And between them, they have decades and decades of community experience.'",
        "'speaker_5': 'So even though we were starting from scratch, we had all this experience and and passion and commitment to community as part of it. And I was also asked to help be part of that and was honored to join this group as the interim director.'",
        "'speaker_5': 'Next line. So as I mentioned, the city of Long Beach matched a sea grant that was provided by Wells Fargo to actually launch the Community Vilma Corporation. And we started and we had our very first meeting on March 12th of last year, 2020.'",
        "'speaker_5': 'And that date might ring a bell because we had all these grand plans. We had our whiteboard out and we're planning how to launch this organization. And the next day was the stay at home and COVID hit. So we threw all that out the window.'",
        "'speaker_5': 'And a few weeks later we reconvened and said, Well, we have a crisis and we're serving our community. And there are those that are disproportionately affected by it and what can we do to help? And so we put together the in this together plan, which came with some seed funding from the Bridge Development Corporation and some of'",
        "'speaker_5': 'the other funders listed up there. And we put it into action. And because. Next slide, please. So in the start of COVID, thanks to these supports, we were able to build partnerships with local community organizations and directed over $250,000 in funding to help those affected by the pandemic.'",
        "'speaker_5': 'And these areas of food security, small business support, digital inclusion and housing support. And I think the big lesson here is, is these are all partnerships with existing Long Beach organizations. And I think that's the model that we saw was our job is not to go out and recreate the wheel.'",
        "'speaker_5': 'Let's find people who are doing good work in our community, provide them more resources, health, and expand their work and better serve our community. And I'll just quickly go to these next ones. Next slide. One of the one of the first things we did, actually, vice mayor, former staff member Ilana Grant, who's now the city manager's office'",
        "'speaker_5': ', put together a group of nine churches and nonprofits who were already doing food service in our community and brought them together in a network. And over the over those first few months, we were able to serve a thousand households in a partnership with food finders.'",
        "'speaker_5': 'And as many of you have involved in, food security is a real issue in our city, and we're able to address that. These those food pantries were in north, central and west and the districts one, two, six, seven, eight and nine.'",
        "'speaker_5': 'So thank you to those council members and those staff who supported these efforts and allowed us to do that work there. Next one. And if you remember, early in the pandemic, seniors were disproportionately affected as well, and many of them couldn't leave their home for food.'",
        "'speaker_5': 'And we set up a partnership with a couple organizations to provide senior home food delivery. So in those first few minutes, we delivered over 1200 boxes of food, primarily, again to those zip codes of five or six. They won three, but actually that program served all the city.'",
        "'speaker_5': 'And we had a good partnership with the city's senior women, which provided referrals for seniors who who needed this kind of work. Next slide. Digital inclusion was another effort. And especially when people were home, students were home, and we were able to answer the call with some partnerships.'",
        "'speaker_5': 'And we've provided laptops to both students of the YMCA as well as Long Beach City College and some small business owners and nonprofit owners explained. And small business navigation. And, you know, there are a lot of the business structures in our cities that support businesses.'",
        "'speaker_5': 'But the small businesses and many of small business in North, Central, in West do not have those structures and support. And so we were able to partner again with the city. Economic development. I really want to thank John Chrysler and Eric Romero for allowing us to partnering with us to work with navigators to keep them abreast.'",
        "'speaker_5': 'If you remember all the loans and grants and everything was flying out at that time, keep our small business owners informed. Help them secure those funds and get through those very difficult months in the beginning. And and we also partnered with some of the other organizations, especially in central Long Beach, United Cambodian community, who also has a'",
        "'speaker_5': 'business navigation services. Excellent. We started with a group called Project Business Lift and again they became the trusted partner for small business. And we were getting so much information. They're trying to keep their doors open and they needed a trusted someone who could work with them and help them get through those time and help them get resources'",
        "'speaker_5': '. They fled. And Housing Service as well. Of course, that was a big a big challenge at the time and continues to be an excellent. So as we came out of last summer, certainly the crisis was not over. But the recovery and the economic repair is what we needed to address and work on.'",
        "'speaker_5': 'And so we were able to take that initial seed money from the city, which was $125,000 that this body supported. And over those over the last ten months, we've been able to raise seven times that much through other other grantors, partners and private, private sponsors to continue to do this work.'",
        "'speaker_5': 'And I think what the work that we were doing in those areas that I just mentioned, we had proven models and we've been able to build upon. We've been able to direct resources directly to more than 31 Long Beach nonprofit community organizations in north central west long used to do this work.'",
        "'speaker_5': 'And we're also able to leverage many of the CARES Act and the areas that the small business support food security, digital inclusion and ongoing with COVID and vaccine outreach Exide. Well, that's an excellent. So one of the big areas where we really continue to need to do help and continuing to provide resources is in small business support'",
        "'speaker_5': '. I know the but again, there are other structures in the city that support business owners. But many of our small business owners, especially in north, central and west, don't have those kind of support structures in that trusted resource.'",
        "'speaker_5': 'And so ongoing business navigation support is something that we will continue to advocate for and support. And we were able to do some small business programs to help small business owners, including a partnership with Long Beach Economic Partnership.'",
        "'speaker_5': 'Omni Works, SBC and CSC will be called Go Digital. I think Michigan Long Beach Economic Partnership is a sister organization of ours that will start at the same time, you know, their focus is on building up industry and serving and and ours is to serve our community and uplift those in the communities that we're serving.'",
        "'speaker_5': 'But I think it's gonna be very important for the two organizations to align. And everyone.'",
        "'speaker_2': 'Time's up on that one.'",
        "'speaker_5': 'Oh, I didn't realize. I'm sorry. Well, can I. Can I at least introduce Byron very quickly?'",
        "'speaker_2': 'Yeah. What I'm actually going to do is I'm going to turn it back over to Bozeman Richardson. And maybe he can help in the introduction.'",
        "'speaker_5': 'Sure. I mean, more slides that you have, I think. Just give him a couple more minutes to just finish. I don't have anything else to add. What everyone do, probably a summary of I'm following along. I think you have that many more slides as continue and introduce.'",
        "'speaker_5': 'Okay. I'll go ahead and get to the get to the end there. And you'll have this information, and I'll be happy to answer questions. So right there. I just just wanted some of the lessons that we've learned. And we're going to continue to work and operate as a nonprofit.'",
        "'speaker_5': 'But the next flight. We're here for a for our new leader. So we have a wonderful new leader who's come to our city to serve this this need and serve this organization. Byron has 30 years of banking industry experience, and he is he's not only gonna be a great leader for our organization, he's also going to be'",
        "'speaker_5': 'a great leader for our city. So I'd like to at least briefly introduce Byron Reed. Mr. Mayor, Vice Mayor, City Council. Folks, it's a pleasure to be here.'",
        "'speaker_2': 'I'll speak very quickly. I'm very excited about this opportunity coming from the financial industry, primarily the CRA side of the house, which is.'",
        "'speaker_6': 'Community Reinvestment Act.'",
        "'speaker_3': 'Which aligns very well economic inclusion.'",
        "'speaker_7': 'I'm excited about bringing in all the skill sets that I've had a call list of all these years to the city of Long Beach. I see.'",
        "'speaker_2': 'Opportunities here.'",
        "'speaker_7': 'I see their.'",
        "'speaker_3': 'Natural tenants that.'",
        "'speaker_7': 'Mary Well.'",
        "'speaker_2': 'With the work that I've done from a community.'",
        "'speaker_5': 'Development perspective.'",
        "'speaker_7': 'Corporate relations perspective.'",
        "'speaker_2': 'And so what I want to do on behalf.'",
        "'speaker_7': 'Of the city of Long Beach is bring some of that to bear and.'",
        "'speaker_2': 'The areas of concentration that have already been spoken about. Of course, is housing and home ownership. I more than just the words. It's creating homeownership programs.'",
        "'speaker_3': 'If you really identify community.'",
        "'speaker_7': 'Based organizations.'",
        "'speaker_2': 'To help those.'",
        "'speaker_5': 'Individuals that are seeking first time homebuyer or a home, an opportunity.'",
        "'speaker_2': 'The resource to get into those homes, small business diverse.'",
        "'speaker_7': 'Entrepreneurship is another important tenet of what we'll be doing going forward with the center.'",
        "'speaker_2': 'Supplier Diversity Procurement had several conversations with some some very key leaders here in the city about creating some real supply diversity procurement programs directed toward minority vendors to give them an opportunity. But we're going to.'",
        "'speaker_3': 'Prepare those.'",
        "'speaker_5': 'Vendors to stand.'",
        "'speaker_3': 'Up for the RFPs that come forward.'",
        "'speaker_7': 'Training them in the right way.'",
        "'speaker_3': 'Not sending them out, and then them being disappointed by not getting the opportunity.'",
        "'speaker_7': 'Workforce development and.'",
        "'speaker_3': 'Youth development programs are very, very important.'",
        "'speaker_5': 'What's more important.'",
        "'speaker_2': 'About putting people to.'",
        "'speaker_3': 'Work are workforce development programs that will help.'",
        "'speaker_2': 'Folks understand.'",
        "'speaker_3': 'How to get a job, the soft skills, the resume, writing the whole nine yards with regards to the workforce.'",
        "'speaker_7': 'Development space. And so we'll be spending some time with organizations like Pacific Gateway.'",
        "'speaker_3': 'Creating collaborations because.'",
        "'speaker_7': 'That's what they do.'",
        "'speaker_2': 'And will.'",
        "'speaker_7': 'Make sure that the work that we do seamlessly together is something.'",
        "'speaker_5': 'That produces the results that I know that.'",
        "'speaker_7': 'You are seeking. And then lastly, last point of.'",
        "'speaker_3': 'Reference to that like to mention is the connectedness.'",
        "'speaker_7': 'The economic resiliency.'",
        "'speaker_3': 'That is very important as well. And as part of the.'",
        "'speaker_7': 'Work that we're going to be creating.'",
        "'speaker_3': 'As the programs.'",
        "'speaker_5': 'That we'll be doing. It'll be around economic development. And everything that I've spoken to.'",
        "'speaker_3': 'Has a financial education, financial wellness overlay over all of it. I think that's paramount to their success.'",
        "'speaker_5': 'For them to.'",
        "'speaker_2': 'Understand how to financially succeed.'",
        "'speaker_7': 'Is key to their success.'",
        "'speaker_2': 'But how do you succeed financially? We don't have any money.'",
        "'speaker_7': 'We've got to create those winds for them, whether it's investment.'",
        "'speaker_2': 'Clubs, given the dollars, to help them.'",
        "'speaker_5': 'Understand how.'",
        "'speaker_2': 'To create the value proposition of those.'",
        "'speaker_3': 'Dollars.'",
        "'speaker_5': 'To be be impactful and to grow those dollars for their families.'",
        "'speaker_2': 'Again, training them where they are. And so with those those those five things, those are the items that I'd like to share.'",
        "'speaker_3': 'It's a pleasure. Vice Mayor, thank.'",
        "'speaker_7': 'You for the opportunity and look forward to working with.'",
        "'speaker_2': 'All of you. Thank you. And I'm just trying to I know the vice mayor has a certain amount of time allotted for his presentations and is trying to keep it as much into into his time as possible. So sorry about that, but thank you for your and welcome, Mr. Reid.'",
        "'speaker_2': 'And we look forward to working with you here in the in the months and years ahead. Councilman Sorrell. One zero.'",
        "'speaker_4': 'Okay. Sorry, I. That the vice mayor is going to go next. Thank you, Mayor. And yes, sir, I want to make sure thank you, Mr. William, for your presentation and the update. I know that, you know, the excitement was there when you were about to launch and you had to pivot really quick in order to shift to'",
        "'speaker_4': 'the needs at that time, which is really uncertain and, you know, really scary at that at that time. So I appreciate I asi many of the volunteers and staff board members around ensuring that support was provided during the pandemic.'",
        "'speaker_4': 'And also so I appreciate all the work that's been done during the pandemic for relief and now as we're moving into recovery. I want to also just welcome and congratulate Mr. Reid on becoming the new president and CEO.'",
        "'speaker_4': 'I had the pleasure of meeting you virtually and am so glad to meet you in person and really excited and really glad to hear some of the things you share to give us a preliminary sense on what you're going to be working on.'",
        "'speaker_4': 'And I'm just thrilled to be able to work with you very soon so that we can ensure that we are doing the things you mentioned, which is getting the financial, education and wellness really integrated into the fabric of what we need to do to really lift up the parts alarmists that needs the support at this moment, especially'",
        "'speaker_4': 'during this recovery period. So thank you so much and looking forward to working with you.'",
        "'speaker_2': 'Thank you, Katherine Mungo.'",
        "'speaker_0': 'Thank you. I want to welcome Mr. Reid. I haven't had the opportunity. A great fortune to meet with you yet. That's a little bit disappointing, but I know that we'll get that opportunity in the next few weeks. If you didn't know, I'm currently chair of the Economic Development Committee and the chair for the first four years that'",
        "'speaker_0': 'I was on the council in creating the economic blueprint that really a lot of those strategies deemed everyone in with the cool, catchy name were really developed through a lot of community impact. And I really love the word inclusion and I think it was well written in the blueprint.'",
        "'speaker_0': 'And I think it's important that when we talk about inclusion, we talk about the whole city, not just any particular region, because Section eight vouchers, they're not limited by zip code. Poor students, they're not limited by that code.'",
        "'speaker_0': 'They live near schools and they live near transportation. And they they have great needs. And our side of town has many churches that did really, really active food donation boxes for our schools and for our seniors. And I think that there's a lot of value in lifting up because our side of town, we had an abundance of'",
        "'speaker_0': 'fruits and vegetables that were donated, but really a lack of grains and other things that are on the less expensive side. But we have fruit trees and so there are things that if all the connectivity is made across the city, there's some serious value.'",
        "'speaker_0': 'And we're also working really hard right now, and I'm pretty involved in the blueprint to point out, and I hope you'll be a part of that, because one of the things that I see in the city is there and you'll hear this from Derek Simpson when you meet with him.'",
        "'speaker_0': 'There are a lot of amazing organizations and many of them are doing the same thing. And in between those organizations, there's big gaps. And so I think it's really important to see where those gaps are and focus our energy on those, because any area that already has a nonprofit doing something amazing, we really want to lift them'",
        "'speaker_0': 'up and help them strive and succeed in those areas. So I look forward to working with you closely. I attend all the Economic Development Commission meetings I hope you'll consider attending because the Economic Blueprint 2.0 is really our future.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you, Councilwoman. And they have.'",
        "'speaker_4': 'Thank you, Vice Mayor, specially for all the amazing work that you've done on this amazing project. And I also want to wholeheartedly thank Jeff. Jeff, you just did a great, great presentation and you continue to pour your heart into the betterment of our city as a whole.'",
        "'speaker_4': 'And I really, really thank you for that. Welcome, Mr. Reed. I'm really, really excited about you, you know, leading us through this. I think it's very, very important to have someone with so much passion, but not only passion, but also the expertize to move such a project forward.'",
        "'speaker_4': 'So I really thank you and look very much forward to meeting with you and working together with you during this time. I absolutely agree with you that on so many levels we really need to provide opportunities to provide a path to home ownership and hopefully eventually and ultimately wealth to a lot of our residents here in the'",
        "'speaker_4': 'city of Long Beach. I think that that's very, very important and especially for residents in my district, in the first district, so that we can end the cycle of low income families having to go through that and not finding a way out.'",
        "'speaker_4': 'I really, really look forward to working with you closer. Thank you again.'",
        "'speaker_5': 'Thank you, Councilwoman Allen.'",
        "'speaker_1': 'Yes. I thank you, Vice Mayor. And I also would like to thank Mr. Williams for his presentation. And thanks to my colleagues Vice Mayor Richardson and council member, your reynaga. Councilwoman Ciro and Councilwoman Van de haas for bringing this item forward.'",
        "'speaker_1': 'I also would like to say hello and welcome to Mr. Byron Reed. We definitely look forward to your contribution and your important work in Long Beach, especially with housing and home ownership and diversity and business opportunities and diversity and procurement.'",
        "'speaker_1': 'And I definitely want to see more diversity in procurement. So thank you for the presentation and I look forward to supporting this.'",
        "'speaker_5': 'Thank you, Councilman Pryce.'",
        "'speaker_4': 'Thank you and welcome, Mr. Reid. It was a pleasure to meet you. Just briefly before the meeting started, and I appreciate the presentation tonight, I certainly learned a lot about your efforts. I am not sure if the two of you know this, but I wear many hats and one of them is I'm also a small business owner'",
        "'speaker_4': '. And so I think it's really, really important, especially since city funds went into the formation of the organization that we look at helping business owners all over the city. And, you know, Jeff, you made a comment and I'm just not familiar with this this information.'",
        "'speaker_4': 'It may be.'",
        "'speaker_0': 'Absolutely true.'",
        "'speaker_4': 'But that business owners and I think you said west, north and central Long Beach have less resources than other parts of the city. There's only one district left and that would be east. And I'm not really familiar with that, because one of the things that I found during the pandemic especially, is that actually, if you were not'",
        "'speaker_4': 'if your business wasn't located in certain communities, you didn't qualify for many of the grants. And so as a business owner who employs an entire female staff, many of them single mothers who needed a 2 to $3000 grant just to make payroll so that we didn't have to lay those people off.'",
        "'speaker_4': 'It was incredibly difficult for us, for us, because many of the grants were just not even available if you were located on the east side. So I know Jon Keisler is here. I'm curious, is that an accurate statement that there are more resources for the East Side business owners than other business owners?'",
        "'speaker_4': 'Because I feel like we should be supporting all business owners. And I'm not aware that any business owners get more or less support, although those are that are located in certain zip codes do actually get qualification for additional grants that others don't.'",
        "'speaker_7': 'Yeah. Councilmember. So the short answer is that we serve businesses citywide. In fact, there are grants that are specific to certain zip codes or eligible for certain areas based on income levels and other things like that. That was part of our CARES Act and of course our CDBG programs.'",
        "'speaker_7': 'I think probably some of the questions that have been raised over the past couple of months is how do we get more geographically based business and technical assistance providers? And so we've been working with our partners at the Small Business Development Centers, some of our community based organizations to actually add business assistance to those community based organizations'",
        "'speaker_7': '. And a good partner for us over the particularly the COVID 19 pandemic has been the Center for Economic Conclusion. We were able to geographically deploy these programs and services from in in North Long Beach, from both pop ups that we had established outside the libraries, as well as through their networks.'",
        "'speaker_7': 'But having a geographically based program is really, really helpful for business owners that may not come downtown as much or see City Hall. They can see those those service centers right down the street. So this has been a real positive learning experience for us, and we want to do more of it.'",
        "'speaker_4': 'So that's really great. But I guess my question is, are there resources for small business owners and let's say what would be considered affluent areas that are more robust than other business owners.'",
        "'speaker_7': 'But know that the resources themselves are available to everybody? It's more of the outreach activities and making connections and making people aware of those resources. That's been one of our great partnerships with Long Beach Center for Economic Inclusion.'",
        "'speaker_4': 'Well, let me just dispel the notion that business owners that don't live in certain, that don't operate a business in certain districts have abundant time to come to City Hall and are more plugged in with City Hall. I think any business support we offer we should be offering citywide, because running a small business is very, very challenging'",
        "'speaker_4': 'for every business owner, regardless of the zip code that they operate in. I mean, that's just a reality. So as someone who cleans or mops the floors and wipes down the entire business that we own once a week to save the cost of cleaning so that we can pay employees.'",
        "'speaker_4': 'I can tell you businesses all over the city deserve support. And so I know that you're committed to that. But I just wanted to kind of dispel that that that there are some people that have some areas that have more resources than others.'",
        "'speaker_4': 'I don't think that's true. And I for good measure and I just really appreciate everything the center is doing to support business owners. This past year has been incredibly difficult for small business owners. And if you own a business, I guarantee you've lost a lot of sleep about the people who depend on their salaries being able to'",
        "'speaker_4': 'to make their rent and pay for their family. It's it's very challenging. So thank you.'",
        "'speaker_2': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Just wanted to take a moment and kind of close this out. So, first of all, Jeff and your entire board, thank you for stepping up and answering the city's call. When we I understand what you mean when you say we're focusing on north, central and west.'",
        "'speaker_5': 'Long Beach Economic Development Corporation focuses on a broader economic development. But a community development corporation has this point at a community. And so this is the community we were designed to serve. And there were tremendous, tremendous conversations at the everyone in table, at the roundtables about the simple fact that for generations the story has been the same'",
        "'speaker_5': 'in north central west Long Beach. When we put forward and we learned a lot of this, we saw it play out during COVID. When we initially released Small Business Resources. Our communities didn't get the applications in. It was harder to reach our communities.'",
        "'speaker_5': 'They didn't apply and there's not as accessible. We've seen it over the years with the $2,000 CDBG grants. They're not effective. You need a wet signature. You have multiple owners. This is not accessible. So we saw that and we saw a need.'",
        "'speaker_5': 'And the data in the Long Beach, we did a a profile, inclusive Long Beach economic equity profile that showed that this isn't just a feeling, but the data supports it. The funding doesn't get to these communities for a number of reasons language barriers, a whole host of things.'",
        "'speaker_5': 'So to have an organization to stand up and say, we will help the city close those gaps, meet those needs, that is a good thing. I encourage you double down on this. Continue to go where the need is.'",
        "'speaker_5': 'It doesn't mean that we don't support businesses across the city. That's a false proposition. We want every small business to thrive. But we know there are barriers connected to redlining, yellow lining, the evidence of freeways in our communities, you know, overconcentration of nuisance liquor stores in motels in some communities.'",
        "'speaker_5': 'All of these things have an impact and make it more difficult for a business to survive or a family to be resilient, to survive. I encourage you continue to do that work. I also want to say to you, Mr. Reid, I know that there was a search.'",
        "'speaker_5': 'I know you went through the entire process. I want to thank you and I want to welcome you to the city of Long Beach, because, you know, I don't want you getting caught up with the politics behind the dyes.'",
        "'speaker_5': 'You're here to serve the community. So be self-righteous. Stand up. We're going to continue to support you and make sure that our communities have the resources that they need to thrive. So I have whenever I see there's another person cued up, but I want to make sure that we get you this.'",
        "'speaker_5': 'We want it to you know, we support a lot of organizations, but it's not often they come back and tell you how we've done. Some do. Steve Goodling does. And when he when he shows up, we say, hey, Steve, keep up the good work.'",
        "'speaker_5': 'We don't say, you know, I want this. I want the downtown community center on my list. We don't say that. We say keep up the good work. What's good for the downtown is good for the whole city. And I say for you, what's good for north, central west Long Beach is good for the whole city.'",
        "'speaker_5': 'Keep up the good work. And I want to present this to you when the time comes. Maybe after the next spokesperson. Thank you.'",
        "'speaker_2': 'Councilman. Mongo.'",
        "'speaker_0': 'Thank you. Something that Councilmember Richardson and I worked on together probably five years ago, I think could really bring together the two sides of the dais tonight, which is we talk a lot about businesses and the employees. Councilman Price brought up specifically the employees that maybe you work at a business on the east side might not live'",
        "'speaker_0': 'on the east side. And so, Mr. Modica, I know you weren't city manager at the time, or maybe Mr. Chrysler, you have some information. But back in the day, we asked for reports based on the number of employees and how many of those employees lived within our city.'",
        "'speaker_0': 'And at the time, Mr. Richardson and I were told that that wasn't a report that could be pulled. You know, we were on a 1970 system. It's too difficult, all these things. But now we've implemented several systems. Are we moving in a direction where we could actually find out which of these businesses are really employing Long Beach'",
        "'speaker_0': 'residents? Because then we'd be able to do a better picture of helping our city and our more impacted communities by helping the businesses that impact the most wages that come back to residents in our own city. Are we moving in that direction?'",
        "'speaker_0': 'I mean, this is five years ago when we were asking for this.'",
        "'speaker_7': 'Yeah. Councilmember So that's a that's a good question. So the data where we would be able to, to try to, to connect an employee their place of employment to an address and then perhaps their home address would likely be through the Employment Development Department of the State of California.'",
        "'speaker_7': 'So it would be about the quality of their system. It wouldn't be data that the city tracks.'",
        "'speaker_0': 'When we're asking for it on their business license. So on a business license, you currently say the number of employees and I'll give you an example. AmazonFresh opened in my district and they said, Well, we're going to have 300 employees and more than 50% of them are going to be hired from Long Beach.'",
        "'speaker_0': 'And I said, Where are you going to do those job fairs? Are you going to do them in north Long Beach and central Long Beach on the east side, we've got a lot of young kids that need jobs.'",
        "'speaker_0': 'And then on the first day, they only had a 100 employees. And I said, how many of them are Long Beach residents? And they said, 50%. And I said, Where do you live? Where do you live? Where do you live?'",
        "'speaker_0': 'Where do you live? Where do you live? None of them lived in Long Beach. None of them. I mean, the five or six people, I thought, this isn't a good start, so how can we hold people accountable if we don't have the data?'",
        "'speaker_7': 'Yeah, yeah. That's not data that we collect through business licensing. We don't require them. The number of employees, of course, they report as part of their business licensing, but not their their addresses are location. So census data is going to be really interesting.'",
        "'speaker_7': 'We're going to get that soon and that will help us to understand some of those commuting patterns. But it's really the Employment Development Department data that's considered confidential data. We do have a look at some of it, of course, through our workforce development agency Pacific Gateway, and we use Cal State, Long Beach Office of Economic Research to'",
        "'speaker_7': 'really disaggregate some of that confidential data will likely not be able to produce, you know, lists tied to specific businesses. But we should be able to get some of the roll up data that shows where where employees live and commute and maybe not tied to a specific address.'",
        "'speaker_0': 'Well, I think Mr. Orsi still in the back. I'd love to see that field added to the business license, even if it's just a self-reporting. But if we're doing grants in the future and you're able to say that 50% of your employees are from the city of Long Beach, and of those 30% are from disadvantaged communities or'",
        "'speaker_0': 'things like that. I think that's an interesting way to look at future grant opportunities instead of based on where the businesses, I think where the employees come from is is a big impact. Thank you.'",
        "'speaker_2': 'Thank you. Next up, we have a comment, please.'",
        "'speaker_1': 'Mr. Sun. I can pay.'",
        "'speaker_5': 'So I came from sixth district. I just want to say, any of these people that are handing out these postcards in the fifth District. I got two mortgages I'm paying on right now and I need help. If you want to build a Adu at my mom's or my grandmother's house.'",
        "'speaker_5': 'I would love the support. My my address is a public fund. That being said. Once Council, Women's Council people. I don't know how to say women council women. Cindy Allen and Miss Mongo join forces and actually make a real local higher requirement.'",
        "'speaker_5': 'All of this tension will immediately go away. So just piecing it together. That being said, big supporter of Mr. Byron Reed. I've been an avid fan of all the work that he was doing at West Angeles. I'm a firm believer of the CDC.'",
        "'speaker_3': 'Format.'",
        "'speaker_5': 'With respect to housing. I think I'm not putting any pressure or energy. Just as a private citizen, I can say that we've seen the success of the model in Harlem with Abyssinian Development Corporation, with Reverend Calvin Butts and also with West Angeles, with Bishop Blake, and how they've been able to sustain and combat displacement, as well as'",
        "'speaker_5': 'bringing a lot of jobs into it. You know, what's that? So that being said, it's an honor and a privilege to have you here in the city of Long Beach working to combat a lot of the economic woes that marginalized communities of interest.'",
        "'speaker_5': 'That's something I've learned, a term I've learned recently at the redistricting meetings. Marginalized communities of interest that we are dealing with here in the city. And we welcome you and thank you. Mr. Williams, with respect of your interim.'",
        "'speaker_5': 'I think, you know, I live in a district that I believe we have to two bank branches, Bank of America on Willow and Bank of America and Cherry. And I think there's like eight. There's four. Or as yours.'",
        "'speaker_5': 'Oh, so we have one. Okay. I think there's I think there's seven or eight bank bank branches on Second Street. So I think that's what resources mean, speaking about resources in respect to those kind of things. Nothing against Miss Price.'",
        "'speaker_5': 'I know what you mean as a small business person, but I think that's what you meant about resources. So we're all on the same team. It's all of, you know. But thank you. Welcome to the city. And let's keep it moving.'",
        "'speaker_2': 'Sir. There's a motion in the second. Members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to conduct a Budget Hearing to receive and discuss an overview of the Proposed Fiscal Year 2022 Budget for the departments of Economic Development, Fire, and Civil Service.  (Citywide)": [
        "'speaker_2': 'Thank you. Next up is the budget hearing. Item 12. We still have very long agenda ahead of us.'",
        "'speaker_1': 'Item 12 Report for Financial Management Recommendation to conduct a budget hearing to receive and discuss an overview of the proposed fiscal year 2022 Budget for the Departments of Economic Development, Fire.'",
        "'speaker_0': 'And Civil Service. City Wide.'",
        "'speaker_2': 'America.'",
        "'speaker_7': 'Thank you, Mr. Mayor. So we have three presentations today as part of our budget hearing. The first will be our economic development department. Then we'll do our fire department. Then we will do civil service. So I will turn it over.'",
        "'speaker_2': 'To John Keisler to.'",
        "'speaker_7': 'Begin the Economic Development Department overview. All right. Good. Good evening, honorable mayor and members of the city council. I am extremely excited to be able to present to you a summary of the Economic Development Department budget for fiscal year 22.'",
        "'speaker_7': 'And so you know a lot about us, but I want to share with you a little bit about our mission and how we create equitable economic opportunities for workers, investors and entrepreneurs. So, as you know, we have a couple of key service areas that are really designed around our customers, around how to help people make more money'",
        "'speaker_7': '. First, business owners, we offer technical assistance and grants. A lot of the stuff that we were just talking about tonight. But we also offer programs around connecting business owners to the Internet. Digital inclusion and how we can build more connectivity between customers and business owners online.'",
        "'speaker_7': 'We also offer business owners as well as investors, developers and the private sector real estate development services that helps to grow the property tax base, the assessed value of property in the city. And it also helps to address needs like housing and retail, commercial manufacturing and of course, hospitality services.'",
        "'speaker_7': 'But one of the really unique things about the city of Long Beach economic development is that we have Pacific Gateway, a federally funded workforce development agency that would typically be a regional nonprofit. It's actually a part of our city and a part of our department, and that helps us to really develop and cultivate sector cluster strategies for'",
        "'speaker_7': 'things like aerospace or entertainment and hospitality. And it also helps us to implement really unique programs for our youth workforce job centers and of course, the implementation of things like our project labor agreement. So this last year has been historic.'",
        "'speaker_7': 'You've heard this over and over again, but specifically for the economy. The pandemic created an unprecedented spike in unemployment within about a three week period back in March of 2020. Some people are shocked when I say this, but there were 250,000, a quarter million unemployment insurance claims that were filed by 150,000 different Long Beach residents over the'",
        "'speaker_7': 'past year, a quarter million. The city itself, with leadership of the city council, took action to provide rent deferments to our city tenants and deployed over $7 million in new biz care programs. In fact, we launched the first ever busy care program as part of the COVID 19 response.'",
        "'speaker_7': 'And you can just see the thousands of individual business owners and residents as well as the business supporting organizations that we helped to support. We also launch for the first time ever, a digital inclusion initiative in the city of Long Beach, who is really remarkable.'",
        "'speaker_7': 'One of the things that COVID 19 accelerated was the need for businesses and residents and workers to get online, both to tap into and access services, as well as to transition their business models. And so you can see the thousands of people that we brought hotspots to their their residential and commercial locations for the first time, as'",
        "'speaker_7': 'well as devices and resources through our community based partners like humanity I'm sorry, who helped us as a nonprofit to actually deliver those devices and training and get those households online. We also supported thousands of adults and youth workers.'",
        "'speaker_7': 'We launched new programs to actually get displaced youth workers to help with COVID response. It was a remarkable opportunity for us also to connect with the community. And we did during this pandemic five different economic equity studies to understand what was happening with various sectors and members of our community, as well as over 40 hours of roundtables'",
        "'speaker_7': ', which many of you participated in, so that we could move in transition in real time the way that we supported our local economy and workers. So many other accomplishments over this past year that help shape the way that we deliver services.'",
        "'speaker_7': 'A new 55 page digital inclusion roadmap was completed. Believe it or not, most of this started in-person and ended virtually. But this has become a national model for many other cities that have asked for for us to help them with their own digital inclusion roadmaps.'",
        "'speaker_7': 'We negotiated the acquisition of new hotels and other properties to help with transitional and homeless services. We actually executed a decades long, new and innovative project labor agreement during the COVID 19 pandemic, and we launched new programs for cannabis equity.'",
        "'speaker_7': 'Technical assistance for four new cannabis business owners, helped to reopen Long Beach Community Hospital to the emergency room and secured control of our historic Queen Mary and the surrounding properties for the first time in 40 years. So I want you to know that even though we talked a lot about COVID response, we actually made some historic generational'",
        "'speaker_7': 'progress on other areas. So the Long Beach Recovery Act looking forward is really an incredible opportunity for us to make historic, systemic investments in economic inclusion in some of these other areas. And we're going to do this in a collective impact model.'",
        "'speaker_7': 'You can see that $64 million has been dedicated thus far by the Council toward Economic Recovery as part of Elvira, the Recovery Act. And you can see that it cuts across things like transportation, economic and digital inclusion and in our key infrastructure, like our airports and other support services.'",
        "'speaker_7': 'This is what it looks like for us in economic development in the coming year. The Long Beach Recovery Act will be 33 new programs that will go. They'll range from direct grants, over $20 million going to businesses, nonprofits, arts organizations, and a lot of those business supporting organizations, as well as an unprecedented investment in economic inclusion, digital'",
        "'speaker_7': 'inclusion, diverse business councils, more inclusive procurement. We heard about that tonight, and we're going to be making those down payments in FY 22 to Seed Fund, many of these historic efforts. But there's also other programs that we're going to partner on through a collective impact model with our nonprofit organizations and other departments that have to do with'",
        "'speaker_7': 'cleaning up corridors and testing and tracing support so that business can keep workers safe and that workers can can serve customers in a safe way. So the 22 focus for economic development really has it starts with the Recovery Act.'",
        "'speaker_7': 'I mentioned the 33 new economic support programs to support a more inclusive and equitable economic recovery that will be based on our community roundtables. We will also be updating the ten year blueprint for economic development for a more inclusive economy, which will really make this a relevant and current plan for this decade between 21 and 30, and'",
        "'speaker_7': 'prepare our economy and our workers, investors and entrepreneurs for this new economy post-COVID. We will be implementing the Digital Inclusion Roadmap to eliminate the digital divide. Our goal is to make progress, to eliminate the divide for all residents, workers and business owners in need by 25.'",
        "'speaker_7': 'And we will incorporate all of the goals of racial equity and reconciliation reconciliation initiative to eliminate economic disparities in communities most impacted by racism. So we have goal four within the reconciliation plan that really focuses on economic inclusion, economic equity, and that will be a part of every program that we implement in the coming year.'",
        "'speaker_7': 'We also will be developing and implementing multiyear action plans for major real estate assets this year, in particular Queen Mary and the Convention Center. Those are two that have historic needs for infrastructure investment, as well as business models that can help to offset the costs of those investments.'",
        "'speaker_7': 'So some of our challenges EDI economic development remains one of the smallest city manager departments. We staff most of our programs through grants and one time funding. We also need a lot of administrative oversight for both effective program delivery.'",
        "'speaker_7': 'But to do things like audits, whether it's auditing our contracts and service agreements or it's these big grants. We need structural funding if we want to sustain these efforts, including our economic and digital inclusion programs. Because one of the disadvantages of having this grant funding is not being able to sustain it once the grant funding is gone'",
        "'speaker_7': '. So structural funding is going to be needed for the long term maintenance and development of our city owned assets, particularly some of those large real estate assets that I mentioned before. So the opportunity here, which is which is fantastic, is that economic development is all about return on investment.'",
        "'speaker_7': 'For both the community as well as the city. So when you invest a dollar, you should get two or $3 back on those investments. So our opportunity here is by investing in long term economic development, we can strengthen the revenue sources that pay for all of the other city services police, fire, parks and Rec, public works.'",
        "'speaker_7': 'And we need to use data to do that. So we've been working with our community based organizations on many of these initiatives that I discussed and they're ready to implement. So we have huge opportunities right now to move toward action in fiscal year 22.'",
        "'speaker_7': 'The other really amazing opportunity that we have coming out of COVID 19 is the incredible collaboration that we've developed with our nonprofit and community based organizations. Those relationships are strong, and they have become an incredible opportunity for us to deliver economic development resources.'",
        "'speaker_7': 'The city is also has all the critical elements of a modern economy. So many cities look to Long Beach and say, I wish I had an airport, an international seaport, a hospital system. I wish I had space and technology companies.'",
        "'speaker_7': 'And I wish I had a university with 40,000 students graduating 10,000 students a year, a community college with 26,000 students. We have all of those critical elements and we can build on that foundation. And then finally, lbr lbr funding is like seed capital.'",
        "'speaker_7': 'It's like venture capital. We get to invest it in once in a generation, one time opportunities to build long term and inclusive economic development. So we've got everything we need. But together we can deliver. And in FY 22, your economic development department is ready to go.'",
        "'speaker_7': 'So thank you so much for your time. I'm going to hand this over to public record. I'm sorry for. Thank you very much, John. So we will go to our next apartment.'",
        "'speaker_2': 'Which will be our fire.'",
        "'speaker_7': 'Department, and then we'll do a civil service and then we'll get public comment and answer questions. Next up is fire. How the you know.'",
        "'speaker_2': 'All right.'",
        "'speaker_8': 'Good evening, Mayor Garcia and members of the city council. This evening, I will be providing a brief overview of the fire department, highlighting the key services that we provide to the community. Some of our recent key accomplishments are focus for the upcoming fiscal year and some of the major challenges and opportunities that we foresee for the upcoming'",
        "'speaker_8': 'fiscal year. The Long Beach Fire Department delivers fire rescue, emergency medical service services, marine safety response, hazardous materials response, and non-emergency response services. We provide a 24 hour operation 365 days a year. Our personnel are well equipped and highly trained to mitigate all emergencies.'",
        "'speaker_8': 'The fire department strives to make Long Beach a better place to live, visit and own a business. Additionally, we work to ensure the safety of the community through proactive fire prevention activities, including code enforcement, fire investigation and proactive community outreach.'",
        "'speaker_8': 'We also provide training and education that is essential to the delivery of our core fire and rescue services. I would now like to present some of the fire department's accomplishments and highlights for the current fiscal year. Over the past 12 months, we've responded to over 76,000 fire, emergency medical services, marine safety and other emergency incidents.'",
        "'speaker_8': 'Since many incidents require multiple units to respond. These 76,000 incidents equate to more than 157,000 unit responses. Included in this number are over 51,000 medical calls and over 6800 fire calls. This number also includes hazardous materials responses, airport responses and other non fire responses.'",
        "'speaker_8': 'I continue to be very proud of the work that the men and women of the fire department do for the community. Since the first days of the pandemic. They have come to work every day, answering every call, despite the danger and potential harm to themselves.'",
        "'speaker_8': 'Additionally, fire staff and management continue to provide leadership to the city's incident management team. With their knowledge of and experience with the incident command system. Our chief officers have provided structure to a rapidly developing and changing incident. Our shirt volunteers were a huge help as well, using their training to join many of our staff to support testing'",
        "'speaker_8': 'and vaccination sites throughout the city. Our Operations Bureau hired and trained a diverse class of eight ambulance operators to staff our basic life support program. And our training division turned out a diverse class of 19 new firefighters. These were both great investments in the fire department's future.'",
        "'speaker_8': 'In its second year of operations, the diversity recruitment program built upon the successes of the first year in fiscal year 21. The program hosted the inaugural Female Firefighter Work Career Workshop. This was a one day event at the David Rosa Regional Training Center, where 82 women were provided information on the application and testing process for fire recruit'",
        "'speaker_8': '. Additionally, during the pandemic, the diversity recruitment program stayed in touch with potential recruit candidates by hosting 24 Zoom webinars on the hiring process and 27 Prospective Recruit Exercise Program or prep sessions which prepared candidates for success in the testing process.'",
        "'speaker_8': 'We also partnered with the Los Angeles Regional Training Group and the Long Beach Garden Center to develop a first response mental health training video series for all firefighters in the region. This training helps our first responders to readily identify the signs of mental illness in the field and to safely and effectively de-escalate these encounters.'",
        "'speaker_8': 'The department conducted 320 arson investigations, resulting in 57 arrests. This is a 60% increase over the number of investigations last year and a 50% increase in arrest. The majority of these fires are occurring of vegetation located in riverbeds, railway yards and vacant structures.'",
        "'speaker_8': 'To round out our accomplishments, I want to highlight two successful partnerships with other city departments. First, we conducted the triennial emergency drill in conjunction with the Long Beach Airport. This emergency preparedness exercise is required by the FAA and tests the speed and effectiveness of emergency personnel and airport staff in the event of an aircraft incident.'",
        "'speaker_8': 'We also partnered with the police department to develop and implement an alternative response model to work cohesively and collaboratively while responding to incidents of individuals experiencing a mental health crisis. With this training, we're able to coordinate our efforts more effectively on incidents in which both police and fire personnel are responding.'",
        "'speaker_8': 'This collaboration provides for a safer interaction and improved outcome to these incidents. The fire department has several major areas of focus for fiscal year 22. The first is to improve response times to fires, emergency medical and other emergency responses.'",
        "'speaker_8': 'We are working with our medical director to analyze and provide recommendations for adapting how we respond to incidents and perhaps what incidents we respond to in an effort to minimize response times. Firefighter safety and behavioral health continue to be significant issues in the fire service.'",
        "'speaker_8': 'Firefighters are under a tremendous amount of stress working on the front lines during the pandemic, witnessing tragic events firsthand and working long hours. They and their families are impacted by all of this. The health and Safety of Fire Department staff is one of my highest priorities as fire chief.'",
        "'speaker_8': 'To that end, we have trained peer counselors and made the services of mental health clinicians available to all staff. We need to make sure that everyone in the department is aware of these services. Remove any stigma associated with obtaining help and increase these services as funding allows.'",
        "'speaker_8': 'Another priority is to increase diversity in all ranks of the fire department through recruitment and training opportunities. Programs like the Female Firefighter Career Workshop prep sessions and the Fire Services curriculum at Jordan High School are all part of our short term and long term solution to improving the diversity of the department.'",
        "'speaker_8': 'It is also important for us to foster an environment of inclusion and equity in our workforce. The department is rolling out implicit bias training to all fire department employees. While this training is available through our online training platform at a minimal cost, it is very effective training in fiscal year 22 and beyond.'",
        "'speaker_8': 'The Department will continue this and other similar training and activities that focus on the priorities of diversity, inclusion and equity. In recent years, we have seen a significant increase in the number and size of vegetation, fires and other fires in public areas throughout the city.'",
        "'speaker_8': 'Areas such as parks, riverbeds and areas surrounding freeways. This is a great concern to us as it poses a significant risk to life and property. Preventing and minimizing the damage caused by these types of fires will be another focus area in the coming year.'",
        "'speaker_8': 'The anticipated retirement of our leadership in the management and supervisory ranks creates a great opportunity to develop the next generation of leadership. This has always been a focus of mine and it will remain so in the next year.'",
        "'speaker_8': 'The Fleet Services Bureau will be updating fires, frontline vehicles that respond to fires, emergency medical services and other incidents within our current budget. We're able to replace a number of vehicles in the coming year. Ten engines, two trucks and seven paramedic rescues will be replaced in the next 12 months.'",
        "'speaker_8': 'I want to thank the fleet services for their support and partnership in this area. Another focus area is to improve compliance with mandated fire prevention inspections. This includes hotels, apartments and residential care facilities. To help us meet these requirements.'",
        "'speaker_8': 'We're proposing the addition of three civilian inspectors in the fiscal year 22 budget. The cost of these positions will be fully offset by fee revenue that the inspectors will generate by conducting the inspections. Finally, we continue to streamline the fired plant check review process to meet service demands while ensuring the public safety.'",
        "'speaker_8': 'Despite the pandemic, we've been able to keep up with the workload and are committed to this continued level of service. As part of the fiscal year 21 budget, the fire department is participating in a comprehensive fire services study.'",
        "'speaker_8': 'The consultants are taking a very close look at our operations and finances, and we'll be identifying efficiencies and structural budget savings in the amount of $1.8 million. Since February of this year, the city manager's office and the fire department have been working with AP Triton, an outside consultant with extensive fire service, knowledge and experience, to conduct an'",
        "'speaker_8': 'in-depth review of all fire department operations. This review includes an analysis of staffing levels, deployment methodologies, the operations and activities of the Fire Department's four bureaus and the department's financial data. The primary objective of this, of the study is to identify budget solutions and operational efficiencies that will result in structural savings in the general fund beginning in'",
        "'speaker_8': 'fiscal year 23. Additionally, A.P. Triton is gathering information and conducting interviews and surveys throughout the department as part of the Workforce Initiatives component of the study, which focuses on diversity, inclusion and equity as well as succession planning. We expect the study findings and recommendations to be to be provided in October of this year.'",
        "'speaker_8': 'The department will face several significant challenges in fiscal year 22. First, as I mentioned earlier, service demands, staffing levels, the pandemic and the types of calls that we see have led to firefighters safety and behavioral health concerns. Increased development, specifically vertical density in the downtown area and throughout the city will increase service demands, leading to an increase'",
        "'speaker_8': 'in emergency responses and response times. We have we have front line safety equipment that is nearing the end of their useful lives and are in need of replacement. Items, such as the breathing apparatus that the firefighters use are due for replacement in the next couple of years at a significant cost.'",
        "'speaker_8': 'The fiscal year 22 budget proposes additional staff to manage our grants so that we can explore grant funding for these items. Similarly, our first responders work 24 hour shifts, living in and responding from fire stations and marine safety facilities, some of which are old and have significant health and maintenance issues.'",
        "'speaker_8': 'A plan for repair and replacement of these facilities, including identifying a funding source, will be necessary to respond to this challenge. Finally, wildfires throughout the region and the state continue to pose a challenge as they grow in size and frequency.'",
        "'speaker_8': 'The Dixie Fire in Northern California surpassed 500,000 acres last week, making it the largest wildfire in California state recorded history. For the past several months, we have assisted on wildfires in Northern California, Washington and Oregon, averaging 20 personnel per day that are out on the lines.'",
        "'speaker_8': 'And most recently this evening, as we're sitting in the back, we had another engine and battalion chief heading up to Sacramento. That is, as we hear, losing homes as we speak. We also have several opportunities coming up. First, while anticipated retirement of our leadership in the management and supervisory ranks creates somewhat of a challenge.'",
        "'speaker_8': 'It also is a great opportunity to develop the next generation of leadership. The fiscal year 22 proposes the continued support of the FIA diversity recruitment program. This provides a great opportunity for us to continue our short term and long term relationships and recruitment strategies with the goal of increasing the diversity of our staff throughout the organization.'",
        "'speaker_8': 'I want to thank the city manager and City Council for your continued support of this program. Another opportunity is the potential for grant funding to support training for our specialized programs such as hazardous materials, urban search and rescue and airport rescue and firefighting, as well as to support the acquisition of needed equipment, including breathing apparatus and personal'",
        "'speaker_8': 'protective equipment. Finally, we have an opportunity for improved efficiencies by co-locating the Fire and Health and Human Services warehouses. This will be funded with grant funds from the Health Department. I want to thank the Health Department for their partnership and we are grateful for this opportunity to work alongside them.'",
        "'speaker_8': 'In closing, I would like to thank Mary Garcia, our city council, city management and all the members of our city team for your consistent support of your fire department's mission to provide public safety to the city of Long Beach.'",
        "'speaker_8': 'For many, if not most of us, last year was the most difficult time we've ever experienced. In response to the pandemic and all associated issues, our city team unified and provided leadership and direction. I have never been more appreciative of the city I work for and the great people I'm honored to serve with.'",
        "'speaker_8': 'Finally, I need to express my tremendous pride and appreciation for the men and women of the Long Beach Fire Department throughout the pandemic. Sworn in civilian staff have never faltered in their efforts to provide for a safer Long Beach.'",
        "'speaker_8': 'I consider their actions to be heroic, and we'll never forget their response when called to service. This concludes my presentation and I'm prepared to respond. Any questions you may have. Thank you.'",
        "'speaker_7': 'Thank you. Jeff Espino, we will have one more presentation and then.'",
        "'speaker_2': 'We'll get to public comment and council questions. So the next presentation will be.'",
        "'speaker_7': 'Christina Winton and her team from Civil Service.'",
        "'speaker_0': 'Good evening, honorable Mayor and members of the City Council. It's my pleasure to present the budget overview for the Civil Service Department. This over for you will demonstrate how the Civil Service Department has utilized its budget and had to pivot like all city departments, to address the business operations of the department in the COVID 19 pandemic environment'",
        "'speaker_0': '. Given the circumstances that we have had to face, we were fortunate to have the mission of the department to be our guiding compass. Civil Service Commission is a charter commission, and our mission was magnified this past year and a half as we had to think differently, as have as to how we were going to collaborate and provide'",
        "'speaker_0': 'technical, operational and strategic guidance and support to city departments in our effort to ensure a quality classified workforce. Our key services are outlined in our mission statement, and I'm proud to say we continue to provide these key services in spite of the barriers created by the pandemic.'",
        "'speaker_0': 'Like many of my colleagues, our team had to think differently about how we would carry out our mission. You will see in this presentation how we modified our selection system. We continue to listen to our customers needs and we were able to take advantage of best practices in merit based employment testing that involved the expanded use of'",
        "'speaker_0': 'technology. The first to pivot was the Civil Service Commission. On this slide, you can see that the commission immediately shifted to conduct their business meetings more frequently to meet the staffing needs of departments that occurred in an emergency setting.'",
        "'speaker_0': 'In addition, they provided me as the executive director with the emergency authority to approve certain routine transactions that would assist departments in moving quickly with staffing issues due to the pandemic. They also provided the temporary use of classified positions in the unclassified service in the Department of Health and Human Services, allowing the department to hire key staff'",
        "'speaker_0': 'immediately in the ever changing pandemic situation. And finally, the Commission created a policy to conduct disciplinary hearings in a virtual setting. With the support and assistance from the Civil Service Commission staff was able to to adjust to the staffing needs of city departments during the pandemic.'",
        "'speaker_0': 'When the emergency ordered to work remotely began, civil service staff shifted to a virtual environment. Staff was able to leverage technical services that we had already been experimenting with to address the ongoing staffing needs that continued throughout the organization.'",
        "'speaker_0': 'While staff had been experimenting with virtual testing platforms and we always intended to shift to this direction, we needed time to experiment with the various virtual platforms. Without the luxury of time to experiment, but with the tools to execute.'",
        "'speaker_0': 'During the pandemic, staff jumped in and developed new virtual process to meet the staffing needs of the department's. Now, candidates could not only apply online, but test online as well, whether it was a written examination or an appraisal interview.'",
        "'speaker_0': 'Without the challenge of commuting through Southern California traffic to come to Long Beach to test for a position show rates for exams increased, confirming that access to city jobs was now available to more people. Individuals were provided technical support if they were not sure how to access online testing before all exams.'",
        "'speaker_0': 'This technical support increase the comfort level and access for candidates to classified positions within the city. Our outreach to the community also shifted to a virtual environment. With the restoration of our record recruitment and outreach services division staff focused on outreach in as many virtual ways as possible.'",
        "'speaker_0': 'They participated in virtual webinars and job fairs, engaged in social media platforms, and increased followers in these platforms. Staff continue to reach out to the community as well through email notifications and sharing of information through City Council newsletters, which has helped increase applicants for specific positions.'",
        "'speaker_0': 'Some of our examinations required that we continue to conduct them in person. Specifically, public safety promotional positions. As you can see in this slide, protocols were in place to safely conduct these exams. Staff met with the city safety officer to establish safe protocols to ensure safety for all involved.'",
        "'speaker_0': 'I am proud to say that there were no reports of any exposure to COVID 19 through the in-person promotional exams that were conducted for both the police and fire departments. So as the landscape has changed, our business practices too have changed.'",
        "'speaker_0': 'And that will represent our challenges and opportunities. We look forward to the opportunity of expanding on the virtual platform that we have utilized during the pandemic. We will utilize the platforms to provide access to more candidates as well as assist us to streamline our portion of the hiring process.'",
        "'speaker_1': 'To do this, our staff.'",
        "'speaker_0': 'Will continue to receive training on implicit bias to assist us in being open to ideas that will allow us to continue to provide equity and access to classified positions through our merit based system. This training will help guide our department as we develop and implement our Racial Equity and Reconciliation Action Plan.'",
        "'speaker_0': 'There is a natural fit with the principles of the Racial Equity and Reconciliation Plan and the mission of the Civil Service Commission, which in part is to attract high quality, diverse individuals in our community. This outreach effort will be coordinated through our recruitment and Outreach Services Division.'",
        "'speaker_0': 'We are excited to expand our partnership with economic development, to further connect our community and educational institutions with the jobs that our full service city has to offer. We will continue to identify best practices as we work through the challenges of how to best connect the community with the city of Long Beach as an employer of choice'",
        "'speaker_0': '. Thank you for this opportunity to share with you a snapshot into how the Civil Service Department has pivoted during the pandemic and how we intend to use this experience to utilize our budget to best serve the city moving forward into the future.'",
        "'speaker_7': 'Thank you very much. That concludes that presentation and I will turn it back over to the chair to do public comment.'",
        "'speaker_3': 'Well, thank you, Mr. City Manager and all of the departments. Before we go to the Council, I'd like to go to public comment. And so we have five speakers on the particular this particular item I like to call forward Karen boundary.'",
        "'speaker_3': 'Marian Drummond. Stephanie Park. Kenny Allen. Sheila Bates. These line up. Karen boundaries. Number one.'",
        "'speaker_6': 'Good evening. Yeah, that's really a misspelling of my name, but never mind.'",
        "'speaker_3': 'It's pronounced in. No boundary.'",
        "'speaker_7': 'Boundary with correct spelling was wrong.'",
        "'speaker_2': 'Oh.'",
        "'speaker_7': 'Yes.'",
        "'speaker_0': 'My concern is with regard.'",
        "'speaker_6': 'To the budget and some of the things that I have seen as of late.'",
        "'speaker_0': 'It appears that. There were a lot of listening tours that were given earlier.'",
        "'speaker_6': 'And during the year.'",
        "'speaker_7': 'Most of the.'",
        "'speaker_6': 'Time when surveyed individuals did talk about the importance of in communities, talked about the importance of defunding the police. So I'm not understanding why these moneys are basically being re appropriated for the police. That is my concern. Also recently, there is an article that is about to come out in the Long Beach Post.'",
        "'speaker_7': 'For tomorrow that talks about.'",
        "'speaker_6': 'How Police Association is saying how communities don't want to defund the police when that is exactly what they did state that they wanted to do. The survey that.'",
        "'speaker_7': 'They reference is flawed. The survey is not referenced in.'",
        "'speaker_6': 'The news article. We don't know how many people were surveyed in in that survey. We don't know where it was or where it was advertised. The like it scale that is used within this particular. Talking about you know the various options is skewed.'",
        "'speaker_6': 'There is no option for and no opinion option. And then even the questions that were framed are double barrel questions. So you have questions that are should be broken into X, Y or Z that are all combined together.'",
        "'speaker_6': 'So these are.'",
        "'speaker_0': 'Just my concerns.'",
        "'speaker_7': 'And with that, I will.'",
        "'speaker_6': 'Defer the rest of my time. Thank you. Thank you.'",
        "'speaker_0': 'Good evening. My name is Mary Ann Drummond, and I just. The city's budget is a moral document, right, that reflects our our values and our priorities. And really, we spent the last four years knocking over in the last 40 years allowing the police department to slowly sap moneys from the community supports and civic programs.'",
        "'speaker_0': 'Pressing a lot of them to extinction or to be ineffective because they have been improperly funded. And that has happened because this body has allowed it over all that time. Right. And your budget spends more than double on police than it does fire.'",
        "'speaker_0': 'And I just find that to be interesting because. Um. A revealing because fire response tends to be one of care and safety and alternatives. The People's Budget is more than just a shift in the way that the city has done business.'",
        "'speaker_0': 'It's a pathway toward ending anti-blackness and structural racism in the city. Undoing historical disinvestment that has continued for generations and moving us closer toward a long beach that is safe and healthy for all our communities. Can't wait any longer for a budget that finally addresses their needs.'",
        "'speaker_0': 'And concerns and the people's budget needs to be adopted now. I do hear a lot of words, but I want to see some action. Action that looks like divesting from police and reducing the force size and banning surveillance technologies like license plate readers and facial recognition devices that are laden with racial bias and are often used against'",
        "'speaker_0': 'black people. We must redirect these resources toward basic needs in essential services that look that so that our black, indigenous and people of color community members can live successful and happy lives and healthy lives. And the police don't keep us safe.'",
        "'speaker_0': 'We keep each other safe in order to increase that safety. We need to invest in these community responses of care and violence reduction and prevention of strategies and prevention strategies that are unrelated to police and specifically alternative emergency response teams called for in the city's racial equity and reconciliation report.'",
        "'speaker_0': 'I yield the rest of the time.'",
        "'speaker_4': 'Harry Shearer bass. We've made it clear time and time again. The streets were flooded with people following the murder of George Floyd while we uplifted our local folks such as Tyler Woods, Lionel Gibson and Dante Jordan and many others with a clear demand and call of the city and the leaders.'",
        "'speaker_4': 'Defund the police. Provide care, not cops. And let me be clear about what that means. It means invest in our communities. It means invest in.'",
        "'speaker_0': 'Alternative responses to.'",
        "'speaker_4': 'The police. Real alternatives. Real alternative responses to the police. It means invest in our schools, invest in public health care, invest and invest in reparations. That was a promise that was made. There were things that city leaders said they were going to do on the immediate heals when the city was flooded with people on the streets demanding'",
        "'speaker_4': 'justice. And none of that has been moved on. We have not forgotten and we are not letting it go. Our demand is clear. Defund the police. Currently in the budget that was proposed. Y'all are wanting to give 42% of the general fund to police.'",
        "'speaker_4': 'That's on top of the fact that they continuously come to you time after time again asking for more money, asking for money for things like their uniforms. That should be a part of their budget. We're asking you for things like, Oh, we need a training program.'",
        "'speaker_0': 'To make sure that officers and intercede.'",
        "'speaker_4': 'When an officer is doing something not supposed to be doing. That should already be a part of their program, of their training program. And if it's not. If it's.'",
        "'speaker_0': 'Not. That's a floor.'",
        "'speaker_4': 'Another floor of the Long Beach Police Department. And so for you to not hold them accountable for that, they don't need extra money for that. You don't need to consider it an agenda item to do anything about that.'",
        "'speaker_4': 'It's ridiculous that this is even coming to this body and that nobody is calling them on that. I notice that item 23 was pulled from the agenda. Even the fact that that was up for consideration is nonsense. And I want to know who pulled it from the agenda.'",
        "'speaker_4': 'Because the reality is, is that if this was something that the city council and the mayor cared about, then y'all would have supported SB two, which is the.'",
        "'speaker_0': 'BRAC, which is a bill written and authored.'",
        "'speaker_4': 'By Bradford, named after Kenneth Roth.'",
        "'speaker_0': 'Jr.'",
        "'speaker_4': 'Who was murdered by the Gardena Police Department after Michael Robbins, who was an officer in Gardena, was previously an officer in Orange County and shot three people and wasn't held accountable by the department. Much like happens here was not held accountable by the oversight body of the police.'",
        "'speaker_4': 'Much like what happens here wasn't held accountable by the district attorney. And then we do not have a decertification mechanism.'",
        "'speaker_0': 'We were one.'",
        "'speaker_4': 'Of four states that doesn't have a decertification mechanism. If you cared about that, you would support SB two. But the Long Beach Police Department is cited as being against the bill.'",
        "'speaker_1': 'Ms.. Bates, your time.'",
        "'speaker_4': 'So how is it that you are hearing you say that you care anything about the community? Because it's clear that you don't. The budget makes it clear that you don't. And we.'",
        "'speaker_6': 'Demand better.'",
        "'speaker_4': 'Defund the police.'",
        "'speaker_0': 'My name is Stephanie Park, and like my colleagues who came before me, I want to take this opportunity to state that the budget, as it stands is grossly imbalanced and not actually designed to meet the true needs of Long Beach residents.'",
        "'speaker_0': '65 million for the Long Beach Police Department. It's obscene to take these funds, those millions and millions of dollars, and invest them in our communities, our schools and public health care and affordable housing. And you need to invest in alternative responses to the police.'",
        "'speaker_0': 'We heard about some of that tonight from the fire department. We need more of that. We need more and more and more. This is a direct way to work toward racial equity. At this point in history, there is no way you are not aware of the harms of our carceral system, of the dangers of the racism and'",
        "'speaker_0': 'violence inherent to policing as we know it. We cannot keep investing in the same dangerous system. We have to invest in new and healthier and safer ways to respond to the needs of our community, not with guns in handcuffs and prison time, but with appropriate and actually helpful alternatives.'",
        "'speaker_0': 'We need care, not cops. Defund the police. I yield my time.'",
        "'speaker_6': 'Good evening.'",
        "'speaker_7': 'Gunther. My name is Kenny Allen. I'm a resident of the second district of Long Beach.'",
        "'speaker_2': 'And I'm here to talk.'",
        "'speaker_6': 'To you.'",
        "'speaker_7': 'And ask you to adopt the demands of the people's budget.'",
        "'speaker_5': 'Tonight. We talked about economic development.'",
        "'speaker_2': 'That's why I.'",
        "'speaker_5': 'Again.'",
        "'speaker_7': 'Echoed the people's budget in demanding that you immediately divest 65 million from our expensive, violent and ineffective police force and.'",
        "'speaker_6': 'Instead invest that money in development and the well-being of our community. On Page 28, I think it is, of the city manager's note at the.'",
        "'speaker_2': 'Top of the giant budget document. It's got a big.'",
        "'speaker_6': 'List of unfunded items.'",
        "'speaker_7': 'When community members and activists come to this podium and ask for help getting the things that they want to get done.'",
        "'speaker_5': 'In the community. Mm hmm. Signed into law.'",
        "'speaker_7': 'The most common answer that we get is.'",
        "'speaker_2': 'How are you going to pay for it? How do you.'",
        "'speaker_7': 'Expect us to pay for it?'",
        "'speaker_2': 'Yeah.'",
        "'speaker_7': 'We're coming to you with a really clear answer. And really, I'd rather be at home.'",
        "'speaker_2': 'Having dinner right now than talking to you about this. So tonight, we're talking about economic development in 2021.'",
        "'speaker_7': 'An economic development budget must include a reparations program.'",
        "'speaker_6': 'Full stop. It's embarrassing that it doesn't. We need a citywide.'",
        "'speaker_7': 'Rental housing division to ensure economic development doesn't come at the cost of a displacement of our current residents. And we need universal legal representation.'",
        "'speaker_2': 'For immigrants to ensure.'",
        "'speaker_7': 'Economic development efforts don't leave those most vulnerable to.'",
        "'speaker_6': 'The violent effects of gentrification. Behind we all.'",
        "'speaker_7': 'Deserve to live in communities where we feel safe, where neighbors can connect with each other and help each other. The people's budget gets us closer to that reality. You need to divest to invest.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Thank you. That does it for public comment here. I'm going to take it back to the rail. I want to. First of all. Take this opportunity to thank all of our departments for for their presentation and also the public speakers today.'",
        "'speaker_3': 'I want to turn it over to Councilmember Mongo.'",
        "'speaker_0': 'Thank you. Thank you for the presentations. Thank you for the community input. It's always valuable to hear where we stand from each and every department. I want to start with some questions for the fire department. I am looking at page 245 of the budget book and reflecting back on a few years ago where we added fees for'",
        "'speaker_0': 'calls for service. And I see one of the things that's frustrating about this book is that I have to go from book to book to book year over year. There's not like a five year prior year actual, so I can have my staff do that.'",
        "'speaker_0': 'But in looking at page 245 and looking at the revenue that's coming in, it says that the key services on this page include calls for service. Does this include those calls for service fees? Have those come in as were originally projected?'",
        "'speaker_0': 'And have we implemented a program for our low income Medicare, Medicaid families that aren't able to afford that call for service fee?'",
        "'speaker_2': 'Councilwoman. Are you referring to the first responder fee?'",
        "'speaker_0': 'Yes, sir.'",
        "'speaker_2': 'Yes. That was implemented, I think, in 2015 at a rate of $250 per month for a response. And that is coming in around $1.7 million, which is.'",
        "'speaker_5': 'I think, about what.'",
        "'speaker_2': 'We had initially estimated.'",
        "'speaker_0': 'And are we thinking that that I know that one of the reasons for the implementation of that system was for our over users, the sober living homes, the businesses that were really relying on emergency services when. They may have been able to support appropriate staffing at their facilities or we've seen a decline in the calls from those'",
        "'speaker_0': 'businesses that we had felt were potentially over users or not over users, inappropriate users or less appropriate users of the system. Those calls that were necessarily emergencies but were coming in for emergencies.'",
        "'speaker_8': 'You're asking do we think there's a decline.'",
        "'speaker_0': 'From those particular areas? Yes. Had it been an incentive for them to reflect on the calls and more appropriately use emergency services?'",
        "'speaker_8': 'I don't have those numbers for you at this time. But anecdotally, just looking at the runs that we go on, I would say that they have not declined.'",
        "'speaker_0': 'And we've talked about in the past a tiered dispatch system. Are we still considering that? Is that waiting until the new data systems are deployed?'",
        "'speaker_8': 'We are still evaluating that. We recently brought on a new medical director, Dr. Abramson. She's going through all of the information that we have and will come up with a recommendation for us.'",
        "'speaker_0': 'I've heard nothing but amazing things about our new doctor, and I look forward to hearing that. You mentioned that we're looking for additional staffing for grants. What grants will pay for the staffing and what grants are you hoping to go after that we don't currently receive?'",
        "'speaker_8': 'So the grants that we currently receive or that.'",
        "'speaker_0': 'We don't currently.'",
        "'speaker_8': 'Receive, that we don't currently receive, that's why we're getting grant personnel in so that we currently receive the Homeland Security Grants. What we don't have is the bandwidth to be researching additional grants. We just don't have the the the personnel right now to get after that.'",
        "'speaker_8': 'So we're hoping to get an accounting in this coming budget year accountant.'",
        "'speaker_0': 'So I guess I would highly recommend that. Being a division chief over grants and cooperative agreements for a large agency that brings in millions of dollars. I'm not sure an accountant might be the right classification. There's a lot of writing involved in these grants to get the grants to go ahead.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'I can clarify that a bit. We currently have an administrative analyst who is who is managing all financial aspects of the grant. Hiring an accountant this year for fiscal year 22 and beyond will allow the accountant to handle the fiscal requirements of the grant reporting.'",
        "'speaker_2': 'While the administrative analyst under the direction of the Deputy Chief and Assistant Chief and Support Services can.'",
        "'speaker_5': 'Explore grant opportunities and apply for those.'",
        "'speaker_0': 'I would be very interested in which grants you think you're going to receive. A lot of the grants at the federal level are changing. I mean, day by day, I got a new one today for a no that came out last week.'",
        "'speaker_0': 'And their administrative budgets for these grants are also very slim. And so I'd love to see a plan because I'd love for you to have a dozen grant staff. The city of Los Angeles, I want to say, has 26 grant staff for their fire department, for their fire department.'",
        "'speaker_0': 'And they're able to bring in a substantial amount of funding, but they also have different administrative revenue streams available. Thank you. Next, you talked about improving response times for our community to your dispatch as a potential option. What I know that there's kind of a report that just came out about NFPA standards on turnout time.'",
        "'speaker_0': 'Where do we stand on our turnout time? Locally.'",
        "'speaker_8': 'Currently we are meeting that standard predominantly throughout the city, six and a half minutes.'",
        "'speaker_0': 'Turn out time is not the same as.'",
        "'speaker_8': 'Oh, I'm sorry. With our turn out times.'",
        "'speaker_0': 'I'd be interested in knowing what those numbers are. I imagine our personnel are doing an excellent job. I do have two additional questions. One, is a comp a compliment? I just want to tell you a great work on the mental health video.'",
        "'speaker_0': 'Excellent. I saw it on the television show and I'll here for a few additional questions. Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilmember Councilwoman Pryce.'",
        "'speaker_4': 'Thank you very much. First of all, to economic development. John and your team did a fantastic job last year with administering the COVID related small business grants. Your SWIFT work was able to keep a lot of people employed.'",
        "'speaker_4': 'And so I just want to thank you because I know that it really was life changing. Some of the work that you guys do did last year. And so big thanks to you. I do have a couple questions about with for Fire regarding the heart team and the transition to reach.'",
        "'speaker_4': 'So it may just be me, but I am thoroughly confused about what is happening and what's happening to the heart team and when REACH is going to take over. And I just want to have a better understanding of I know the Heart team was working with L.A. County or had to meet some threshold protocols and requirements to'",
        "'speaker_4': 'operate in the way it was with L.A. County. Is that going to happen with REACH? And I asked the same question last week, and again, I'm sure it's just me, but I'm a little bit confused about what that transition is going to look like for our homeless population and how we're servicing them.'",
        "'speaker_8': 'Okay. So with the heart team, we've over the last couple of months have received one time funding month by month, to my understanding that funding ends at the end of August, at which time the heart team would no longer be in operation.'",
        "'speaker_8': 'The REACH team, I believe, has started their operation as of this month. I don't think they're receiving any type of dispatch. I think what's occurring right now is more of a proactive approach to what they're doing. But the missions are different and the Mission for the Heart team was to alleviate some of the responses that were being'",
        "'speaker_8': 'taken on by our engines, trucks and rescues that allow them to go to more serious incidents or other incidents. So with that in mind, yes, the heart team did have to go through a pilot program over overseen by L.A. County.'",
        "'speaker_8': 'We have received correspondence from Cathy Chidester from from L.A. County, saying that she has questions regarding and that was, as of today, regarding the REACH team and the heart. And it's not really a transition. It was a transition of funding.'",
        "'speaker_8': 'So that funding went back into the pot and now the REACH team has the funding. But as far as how they're going to deploy, I'm not fully aware of how they intend to do that throughout use in the dispatch center.'",
        "'speaker_8': 'They do intend to have a separate call or call taker. I believe that will help them to dispatch. But there are some questions that still need to be answered and we still need to have some meetings on that, to my understanding.'",
        "'speaker_4': 'And I appreciate that and maybe for the city manager. So right now, the when people call 911, it may not necessitate the response of a fire engine and an ambulance to deal with someone who might need some mental health services and some interaction from what I think is going to be great resources on the REACH team.'",
        "'speaker_4': 'So what will happen now will if someone calls nine on one will fire now have to go out there with an engine and an ambulance even though the situation might warrant like something the team can do.'",
        "'speaker_2': 'Depending on what the.'",
        "'speaker_7': 'Call is. So Kelly Colby is on the line. I believe she's there. Kelly, are you there?'",
        "'speaker_6': 'I have near me. Great. Yes.'",
        "'speaker_2': 'So I'll start.'",
        "'speaker_7': 'So essentially it is a different service model. So we're not asking health department employees to be firefighters. We're not asking them to take medical calls that they're not trained to do. But they are a resource to be able to be sent or dispatched or have other types of.'",
        "'speaker_2': 'Of proactive ability to go out and look and work with individuals.'",
        "'speaker_7': 'Who are experiencing homelessness. The fire department will still do the fire department job.'",
        "'speaker_2': 'If they get a call about a medical incident and they'll be able to respond with an engine as they would any other call.'",
        "'speaker_5': 'But we also then have the REACH team.'",
        "'speaker_2': 'That can be able to go to certain types of incidences that they're trained for. Kelly If you can talk a little bit more about the transition and how we expect major calls to be handled.'",
        "'speaker_6': 'Yeah. So at the current time in the just as we're working on that through the pilot process of this is that this is we're in the midst of a proactive space. The team is out there engaging with people on the street.'",
        "'speaker_6': 'We have a mental health clinician and a public health nurse working with the outreach workers. Beginning of September, we'll start to be more responsive. So we are hiring someone specific to ensure that our phone line is of it's being answered during during our open hours to be able to refer and send folks, send the teams out in'",
        "'speaker_6': 'a response to people, call 911. There is there's a specific call code that the dispatch center has identified that they would then forward those to the NSC and we would respond to those that nonemergency. This is not an emergency response.'",
        "'speaker_6': 'All other things that are medical or in need of response, we would have those calls. And then once they arrived, if this determined that they don't need to be transported or anything, they can call the health department, the multi service team and we can do a warm handoff.'",
        "'speaker_6': 'And then that allows for us to do ongoing service management, um, and a greater way to engage people in the ongoing operations that are working from their housing. So it is a very, it is a very different model, but it is a very close partnership between the fire department, the police department and the health department in our'",
        "'speaker_6': 'work around people with medical and mental health conditions experiencing.'",
        "'speaker_0': 'Councilman Price, your time is expired.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_3': 'Thank you, Councilman. Super Soprano.'",
        "'speaker_5': 'Thank you. My questions tonight are going to be restricted to fire. And first to Chief Espino on page 17. Great list of accomplishments. I'd love to go over all those, but my time is limited. But great work on diversity.'",
        "'speaker_5': 'The female firefighter career workshops great and the mental health training with the guidance synergies outstanding programs. So thank you. Congratulations on those. So to the Council, I would just like to say that my first request is that. We go to structural funding of engine companies.'",
        "'speaker_5': 'And I say that because a year from now, I don't think it's proper to be balancing our budget using these vital public safety resources. So that would be my very first request is that we do that. I think fire engine companies, it's a it's a little different look nowadays, I think, of the wildfires that that the department'",
        "'speaker_5': 'is addressing. The chief mentioned that tonight, the local vegetation fires. I don't know if the chief put a number on that. I happen to know we were at 200 at some point that we didn't have in the past.'",
        "'speaker_5': 'So these engine companies are just vitally needed. My other records read that we discontinue using the specification of Engine 17 when we talk about restoration of an engine company. It was on a list of priorities that was developed over ten years ago.'",
        "'speaker_5': 'It was developed by a previous fire chief. And I think our current fire chief certainly should have the latitude to develop his own list of priorities when it comes to restoration of engine companies. That list was also created before I ever brought to this council the concept of the equity lens.'",
        "'speaker_5': 'When talking about Engine 17 and its relationship to Engine ten. And they both happen to call on the 90804 zip code in Long Beach, and that is the most densely populated zip code in the city. So. I wonder if the chief would like to comment on that priorities list and and what his thoughts are, if he could'",
        "'speaker_5': 'share that with us tonight.'",
        "'speaker_8': 'Yes, sir. Thank you, Councilman. So we are still currently evaluating that priorities list, but I can tell you that Engine 17 still sits at the top of the list as far as getting structurally funded. There are a couple of different reasons for that.'",
        "'speaker_8': 'When you take seven teams out of the loop, there is a huge hole on the east side where we don't have the ability to flow water, as it were. As you're well aware, the condominium or the duplex directly across the street from Station 17 burning is a direct result of not having an engine there close by to'",
        "'speaker_8': 'get water on it, on that fire within a minute or two. And so 17 still sits at the top of that list. Right behind that would be engine one, two, one, which is downtown right here next door. The increase in vertical density down here.'",
        "'speaker_8': 'When I when I speak to our troops about it, it's as if the entire population of Hawaiian Gardens is going to be put in the downtown Long Beach. And that comes at a cost. Those are going to be responses that we have to respond to.'",
        "'speaker_8': 'And so that's, you know, apparatus and resources that and that's how we get there. So we will have a a new list coming out. And the the resources that we are looking at. It may not it may not change, but but I think it will change a bit.'",
        "'speaker_5': 'Thank you for that. I think that's all I have for now. I didn't want to be dismissive of John Keiser and his great presentation. He's one of my favorites for all his work on Community Hospital. So a great presentation tonight.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Right. Councilmember Mongo.'",
        "'speaker_0': 'Thank you. I see on page 244 that we have a video production unit, but I don't see any video production related. Personal items. What items? What staff members are in our video production unit.'",
        "'speaker_2': 'Ketzel Councilwoman. They'll be the communications specialist, I believe is the communication specialist.'",
        "'speaker_0': 'Three.'",
        "'speaker_5': 'Correct.'",
        "'speaker_0': 'Are you aware that currently between 300,000 and $1,000,000 annually of you U.S. funds go to video production?'",
        "'speaker_8': 'Are you speaking about the video production with the RTG?'",
        "'speaker_0': 'I mean, it's currently for any video production that would be homeland security in nature. So if you were to do videos related to trainings on Stop the Bleed or Active Shooter or you've done these videos and our staff participate, typically complimentary.'",
        "'speaker_0': 'I'd be interested in seeing if a Cordray could be completed where a partial funding of potentially your video production staff, other local cities that have video production staff could come together and really bring those positions in-house. As a group of elected officials, I think we work really hard to use government funding and specifically federal tax dollars to'",
        "'speaker_0': 'fund our positions that have good employee benefits. And when we outsource those things to contractors, while I do see a great amount of flexibility and this Council on this day, as has consistently over the last year, taken out outsourced services and looked to bring those in-house.'",
        "'speaker_0': 'And so if there were funds available, I know other agencies have received them in the past, but at least the past three years that has not been the case. Those have been outsourced funds, and I'd love to see us put together a plan where those funds would come back to government employees that are doing the work already'",
        "'speaker_8': '. Know, we can certainly take a look at that and I'll get back to you with all that information. I do know that the the current staff that we have doing video production is extremely busy between everything that we're doing as far as being able to document all the different things that we do with training and whatnot.'",
        "'speaker_0': 'Excellent. Thank you. And then lastly, you talk about recruitment and depending on the agency that you look to. One of the things that we find is that Explorer programs are a strong tool for diversity and inclusion recruitment. What is the status of our Explorer program and or are we looking to funnel youth in our community into a'",
        "'speaker_0': 'neighboring program that we can recruit from?'",
        "'speaker_8': 'Yeah. We we currently do not have an Explorer program. We do have a search and rescue group that is a feeder system for both PD and fire. And we also have our program at Jordan High School, which is which is taking off.'",
        "'speaker_8': 'We are looking at an Explorer program and seeing how that would fit in with us. But at the moment, we don't have one.'",
        "'speaker_0': 'And then finally, I'll just mention that I don't want to disclose the donor, but an elected official at the regional level has recently come forward with some funding, and if it materializes, there will be a program for individuals from disadvantaged communities to go through a 16 week program and become an EMT.'",
        "'speaker_0': 'And then from EMT opportunities with local companies, they would have mentorship in working towards becoming members of fire service. And I approached a gentleman who was here just two weeks ago from the midnight basketball program and have gotten him to apply for the program.'",
        "'speaker_0': 'And I hope other members of our community who would like to become firefighters but need that additional help. I mean, you can become an EMT to pay $700 and go to a course. But these are for individuals who need that mentorship, that one on one, a pre academy program, the 16 week program that starts in the fall'",
        "'speaker_0': '. And I'd really love to see us utilize part of that to really grow individuals who are in our community that may not know what career they want to really take that opportunity and become a part of the fire service.'",
        "'speaker_0': 'So thank you very much. And I hope that we can work together on some of those programs.'",
        "'speaker_8': 'Terrific. Thank you.'",
        "'speaker_3': 'We saw Councilmember Sorrow District six.'",
        "'speaker_4': 'Thank you. Yes. I also want to add to thinking. Fire Department, as well as Mr. Kaiser, as well as Ms. went in for the presentation, as well as our. Our community for the feedback. I wanted to just, you know.'",
        "'speaker_4': 'Councilmember Price that asks the question that I also wanted to ask, which is clarity around the Hart team and the transition to the Hart team, to the team. And, you know, I think with every new motto, it takes some time to figure out how do we make that work?'",
        "'speaker_4': 'And I'm just wondering if if there's a transition plan that, you know, develop. I mean, I know you're in conversation at the moment, but I'm just thinking it would be helpful because I think if we're not clear, I'm not sure how the public will know there's an alternative model that's happening and that where, you know, is it'",
        "'speaker_4': 'a pilot or is it something that's going to be permanent? And if that's the case, it sounds like then I just wanted to confirm. So we have the heart team on board until the end of this month and then September 1st the team go into effect.'",
        "'speaker_4': 'Like, because I'm trying to figure out like exactly how does it transition?'",
        "'speaker_7': 'So we're actually already in that transition.'",
        "'speaker_2': 'We had originally planned for Heart to Sunset in March. It was going to be a six month program.'",
        "'speaker_7': 'We had some delays and we also wanted to make sure that there was overlap and that these issues were worked out. So Health Department team has been working with dispatch and kind of the groups on the ground.'",
        "'speaker_2': 'To work on who gets what call and how they're going to handle those. We have launched them. So we wanted to make sure.'",
        "'speaker_7': 'That heart was still in place and that we didn't just end one service without the other one.'",
        "'speaker_2': 'We launched Reach, I believe, on August.'",
        "'speaker_7': '1st, and then we wanted to keep.'",
        "'speaker_2': 'Funding, even extra funding with.'",
        "'speaker_5': 'Heart all the way through the 31st.'",
        "'speaker_7': 'We did do some memos where we explained kind of what the differences between heart and region, the staffing models.'",
        "'speaker_2': 'But given.'",
        "'speaker_7': 'The discussion today, I'd like to provide a little bit more in writing so that we have that we'll get that before the next budget meeting about the protocols that have kind of been worked out and and the transition.'",
        "'speaker_5': 'Plan.'",
        "'speaker_4': 'Yeah. Thank you for that. And I also just want to share that I do look forward to seeing the study, the fire, your service study findings and recommendation. I know that we we've had some challenging year and we are in wildfire season at the moment.'",
        "'speaker_4': 'And climate change is not going to be you know, it's going to get worse. And I'm interested to see how much more resources is it going to how that's going to affect our service in general. Right. So I do look forward to seeing that.'",
        "'speaker_4': 'And I also want to make the comment to Mr. Kaiser in that. How much I think it's important that you appreciate the services and the hard work that the department has done to hit the ground running to ensure that services is provided to our businesses in the relief process and how we're going to be moving, looking forward'",
        "'speaker_4': 'to how we're going to be able to work together to really create transformation in services, as well as just changing the services and how we work with businesses and supporting people through workforce development, our guaranteed guaranteed income pilot program.'",
        "'speaker_4': 'Right? So many of these things that's going to be coming down the pipeline and how that we can transform our community for the better. And lastly, to civil services, to Ms.. Winter and the team. I do really appreciate the change in the way that you pivot continue to make sure we do recruitment.'",
        "'speaker_4': 'More than anything, I want to go back to how crucial it is to retain our workforce, given our hard work in doing the Long Beach promise and ensuring that we, you know, support our students and scholars through school process to college, how do we make sure we retain them, bring that into our city.'",
        "'speaker_4': 'Right. And that we are keeping our local talent. So I appreciate the outreach that you came out to our fair that we did in our community, because the city process is sometimes really confusing. People really want to be of service and want to work for the city.'",
        "'speaker_4': 'And it really helps that you're out there tabling and speaking in the community and kind of helping to demystify and breaking down and making it a little bit easier. Obviously we could do better and that's what I'm hoping we can do.'",
        "'speaker_4': 'But I appreciate the effort that's being taken at the moment. Thank you.'",
        "'speaker_3': 'Thank you. Councilmember Allen.'",
        "'speaker_1': 'Yes. Thank you so much. I just want to start with John Kiser. Thank you so much for for all that you have done. It would take me a half an hour to go over my list of all of the amazing things that your department has done.'",
        "'speaker_1': 'So I just just a sincere thank you to you. And then also, Chief, I just want to thank you for your presentation. I know over the past year and a half, your department has just performed incredibly. And I am extremely proud of all the firefighters, all the men and women out there that have performed during these difficult'",
        "'speaker_1': 'times and our city. And I want to thank you for your leadership.'",
        "'speaker_8': 'Thank you. I appreciate that support.'",
        "'speaker_1': 'I know that the response times are extremely fast, and that's important because that saves lives. So you all are heroes in my book, and I really appreciate and respect your work. I saw the long hours, too. I was out there at many of the clinics over the last year, and I saw the work that your team did'",
        "'speaker_1': 'in making sure that we. Vaccinations and arms and that save lives. And I appreciate that as well. I loved hearing about your diversity in your recruitment initiatives. That's really important to me, that we hire people from the community that look like the community and women.'",
        "'speaker_1': 'I know that we have civil service here. So this is this is for you. You need to make sure that when we are hiring police and firefighters, that we have people there that represent our community because you can only hire from the the list that they send over.'",
        "'speaker_1': 'So you also have to do a great job in making sure that you're being innovative and how you do outreach in the community so that we're bringing those folks to the table. You also and then promoting women. And I love what you're doing.'",
        "'speaker_1': 'I mean, loved hearing about your female engineers and not just all, you know, really good work. So I have a couple questions for you. I think we all have questions on the REACH team, but I'm going to come back to that if I have time.'",
        "'speaker_1': 'And my first question is, you know, I've been excited. I represent the downtown area and District two. So I've been excited about all of the downtown development and the high rises. But can you please share some of the challenges that the these developments might pose to the fire department?'",
        "'speaker_8': 'Yes, Councilwoman Ellen. Thank you for the question. So, first and foremost, the the challenges that are brought on by the increase in population, more people mean more responses for us. So you bring in these high rises. And as I said, it's like putting the population of Hawaiian Gardens downtown.'",
        "'speaker_8': 'And so we're going to need to manage the expectations of downtown and how are we responding to those incidents? We're also right now actively tracking time and time from the sidewalk when we arrive on scene to time when we're actually at the patient.'",
        "'speaker_8': 'Because oftentimes, if it's a structure fire, we're not going up in an elevator. We're going up by a staircase with all of our gear and equipment. So that takes many minutes, maybe ten, 15 minutes to get a loft in.'",
        "'speaker_8': 'When we're going to patients, actually, we're using an elevator, but that also equates in an additional time. So those would probably be the biggest challenges to us, is being able to respond to that.'",
        "'speaker_1': 'All right. Thank you. And then I do have some follow up questions. I'm sorry you're getting so much about the team, but is there anything that when we talked earlier about response times for fire call service, is there anything when we revert to the REACH team that would impact those that the response time or call for service'",
        "'speaker_1': 'time?'",
        "'speaker_8': 'Potentially. So we're tracking that as well. So as I stated before, the primary mission of the Hart team was to alleviate some of the responses for engines, trucks, rescues. So if you put those responses back into the mix, that means those units are going to be taken out of service to respond to those patients.'",
        "'speaker_8': 'And so I would expect a slight uptick in our response times overall systemwide.'",
        "'speaker_1': 'Okay. All right. And then is there anything any of the services that were provided by the Hart team that will not be provided by the REACH team that you're aware of outside of fire services?'",
        "'speaker_8': 'Yes. So the Hart team, along with the primary mission of taking on responses, which they did by basically monitoring the radio. So that would be one going on, those types of responses. Secondary to that, they they do proactive work with within the community in which the research team would be doing some something somewhat similar.'",
        "'speaker_8': 'But the biggest thing that they're doing for us over the last couple of months and Councilman Supernova is aware of this, is that they are proactively going out and conducting heat mapping of the homeless encampments throughout the city, vegetation areas that are going to cause us issues if and when they end up igniting.'",
        "'speaker_8': 'The problem is oftentimes these encampments are in areas that are very hard to access because the people that are are living there don't want to be accessible. And it makes it very, very difficult for us for egress and ingress makes it very difficult for us to help manage that.'",
        "'speaker_8': 'So they're going out there videotaping, they're taking photos, they're coming back with maps. They go to the area stations, they relay that information to those captains and let them know to be aware that there is an encampment there.'",
        "'speaker_8': 'So that's one of the other big things they've done for us just in the recent past.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilmember Zendejas.'",
        "'speaker_4': 'Thank you, Councilmember Alston. First of all, John and your team. Oh, my God, you have done an incredible job this past year. You just jumped right into it. And it's just, you know, you make us so very, so very proud to have an economic development team as the one that we have right now.'",
        "'speaker_4': 'I'm so thrilled for the 20 plus million that it's going to support our local businesses. You know, I think that that's that's really going to be very helpful, especially because of all the challenges that are small businesses and all businesses have gone through during this pandemic.'",
        "'speaker_4': 'I'm also very excited about the $2.2 million being allocated to bridge the digital divide. And I was wondering if maybe that part of that money is going to be used to in multilingual workshops or courses to teach those small business owners how to use and how to navigate such devices.'",
        "'speaker_7': 'Council member. Thank you so much. So the answer is yes. We're really fortunate to have learned a lot through our Cares Act outreach and we have multiple community based organizations that are Spanish speaking. So language access has been built into the service delivery model and the programs that we've presented to the city manager.'",
        "'speaker_4': 'Thank you. Thank you, I and that makes me very happy. And I know that I have a lot of those business and, you know, business owners in my district. So I'm glad to hear that. Thank you very much.'",
        "'speaker_4': 'I also I'm so excited about, you know, how part of this money is also going to go into businesses and help them restart their own businesses or start a business here in our city. And I was wondering if you could talk a little bit more about those efforts being made.'",
        "'speaker_7': 'Yeah, absolutely. So there's there's a couple of different categories in some of the comments earlier about providing access is first having direct grants. So the $20 million that you were talking about is broken down by sector for businesses, for instance, in food services, then personal services, and then our art serving nonprofit.'",
        "'speaker_7': 'And so we've really tried to target the resources based on the impacts from COVID 19. But then when it comes to helping those businesses with access to these programs, the busy care program, which is is something that we've been building and growing now, has outreach efforts where in some of the harder to reach parts of the city'",
        "'speaker_7': ', they are now going out door to door to talk to businesses in multiple languages. We have speakers, Spanish speakers and English speakers in actually knocking on the doors of businesses that may not have received communications for through online or digital.'",
        "'speaker_7': 'And then finally, we're going to be through the LBR, a program that you see before you contracting with community based organizations to then provide outreach at the neighborhood level. And through that, they'll provide both the funding and helping with the applications.'",
        "'speaker_7': 'But then some of the business and technical assistance for some of those restart activities that you're talking about. And I think that we've been having some conversations recently about a fresh start, and I think your office has been really a leader in that.'",
        "'speaker_7': 'And so we're going to be talking with the city manager about how we might be able to also use some of the business license, taxes and fees funding to help businesses get a fresh start who may have some liabilities or some obligations that they could not pay for during COVID 19.'",
        "'speaker_7': 'So we're trying to cover all these bases in different ways.'",
        "'speaker_4': 'Great. Thank you so much, John, again, for all the work that you do and continue to do. I really appreciate that. Going on to the fire department. Actually, I have one more question for you, John, and then I might have to queue back up, but I was wondering if you could tell us a little bit more about'",
        "'speaker_4': 'our ten year blueprint. I know that we we talked about our blueprint earlier, our economic blueprint, and that was such a success. But I'm really anxious to know how close we are to maybe you guys giving us a presentation on the ten year blueprint for the city.'",
        "'speaker_7': 'Certainly, COUNCILMEMBER. So this is something that the Economic Development Commission, the 11 members that were tasked with creating back in 2016 and since COVID 19, we've seen huge economic transitions occurring. And that has to do with information technology, the transition of business practices, even even workforce transitions, working from home or maybe starting their own businesses.'",
        "'speaker_7': 'And so the commission is looking at those economic transitions as well as a lot of the social transitions. We've also seen a lot of new information and opportunities to close racial disparities with regard to income generation and small business support.'",
        "'speaker_7': 'And those issues are now at the forefront of the Economic Development Commission's planning and ultimately the recommendations that they hope to bring forward to the Economic Development and Finance Committee of the Council, and then for final approval by the City Council at the end of this year.'",
        "'speaker_7': 'So they've been conducting monthly study sessions on different topics, different focus areas, and we're going to be wrapping that work up this fall with some presentations to both the committee and the council later this year.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Thank you. We have missed Councilmember Supernova.'",
        "'speaker_5': 'Thank you. I realize that I had not mentioned the REACH program and I think that's obligatory tonight, so I want to do that. Seriously, Chief, you had mentioned that the head of County EMS contacted you today, and I think I heard you to say that the issue is over funding and not the public safety function of a'",
        "'speaker_5': 'group. So I just want to get that clear.'",
        "'speaker_8': 'No. The the issue with county DHS is not anything to do with funding. It's it's more of the the actual program itself. And so even with the Hart team through the fire department that took a pilot study before it eventually was adopted, and we were able to put that into play with the research team.'",
        "'speaker_8': 'I believe their their view of it is it's it's bordering on parrot medicine as far as what the actual outcome is going to be. And so they just need to be very clear, to my understanding, about what that team actually is going to do, how it's going to be.'",
        "'speaker_8': 'I don't want to say dispatch because we don't dispatch a non sworn personnel from from fire dispatch, but they need clarification on the actual mission of that team.'",
        "'speaker_5': 'Okay. And did they provide any. Well, I guess they wouldn't know what the timeframe is. And they have to get the information before they can analyze it, correct? Correct. Okay. And thank you for mentioning the tracking that the Hart team is doing on these encampments.'",
        "'speaker_5': 'My thought was just firefighter's safety. The fact that these rigs are not off road vehicles and in and it just be very nice to know where you're going ahead of time rather than trying to find a location on the way to a fire.'",
        "'speaker_5': 'So thank you for that.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Councilwoman Mongo.'",
        "'speaker_0': 'Thank you. Now that I've asked the majority of my questions, I just wanted to follow up with a big thank you for the department heads who have really taken the time to make an excellent presentation on.'",
        "'speaker_3': 'Please. Go ahead and continue, please.'",
        "'speaker_0': 'Thank you. I know this year has been very trying for all of the departments and especially the ones presenting tonight. And I just want to give just an amazing thank you to all of the teams that work with you.'",
        "'speaker_0': 'I also know that we've lost some of those members in our community to other agencies and our promotions in other organizations. And I think it's just a testament to the excellent leadership that we have in the city. It does make me proud to be a leader on so many of these issues, and it wouldn't be possible without'",
        "'speaker_0': 'leadership in our departments like you guys. So thank you for that. And. Let us know how we can provide additional help. Thanks.'",
        "'speaker_3': 'Right. Council members. And they has.'",
        "'speaker_4': 'Thank you, Councilmember Austin. And I just want to take a moment to highlight all the great work that our fire department continues to do in, you know, your response time is very impressive. I'm very, very happy with all the work that you've been doing and look forward to the work that you're going to be doing in this'",
        "'speaker_4': 'next fiscal year. One of the things that I've been very, very, very proud of is, you know, the education and awareness that you bring. And I was wondering if there was a way that we can partner up with the fire department for more education and fire prevention workshops to inform and train community members on what they can'",
        "'speaker_4': 'do in case of a fire in their apartment buildings or houses. I really like welcome that opportunity and maybe we could talk off line, chief and and, you know, create some kind of curriculum so that we could work with our residents.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_8': 'Yeah. So thank you for for that. We do have a currently have a very robust cert program and that has been doing very well for us. Unfortunately, with COVID kind of slow down, difficult to get together in person, but we do have more classes that are coming up.'",
        "'speaker_8': 'Also the least those which is onboard as well. So I'd be more than happy to just sit down with you and discuss that. How we can be more proactive. Thank you.'",
        "'speaker_4': 'Thank you. Thank you. Another thing that I'm very, very proud of is your fire pathway program at Jordan Hung. Jordan High has a very special place in my heart, meaning that I've done work with Jordan High School and hope to one day go back there and continue doing my work with them.'",
        "'speaker_4': 'So I'm very thankful that we have that kind of program there. And I was wondering if there was any any sort of I know the funding is always, you know, the main reason or something that holds us back.'",
        "'speaker_4': 'But I was wondering if there was any plan to maybe expand that kind of program to either Cabrillo or Poly High School, which is where most of my residents attend high school.'",
        "'speaker_8': 'Yeah, eventually we would love to do something like that. Unfortunately, right now it's just a matter of bandwidth. So not only is it a matter of funding, we need to come up with a requisite amount of instructors to be able to to give all of the instruction to these young men and women that are coming up.'",
        "'speaker_8': 'But I could tell you the the young men and women that we were looking at in this program are fantastic. Unfortunately, it just going to take a bit of time, but they're still young. But that's when we need to approach our youth, right?'",
        "'speaker_8': 'When they're young, let them see the opportunities that are out there for them. And then hopefully somewhere down the road, we're going to see them within our ranks.'",
        "'speaker_4': 'Thank you. And I'm always, always a big fan of female empowerment. So the female fighter per year workshops that you provide, I'm so happy to see that within our fire department. So congratulations on that and I look forward to supporting many more of those.'",
        "'speaker_4': 'And also wanted to I wanted to also see what the impact is on our fire department by some of the fires that have been created by some of the unhoused neighbors that we have. I, for one, had a big incident in my in my district, maybe like three, three or so weeks ago, June, June 24, to be'",
        "'speaker_4': 'exact. And. There was squatters living in that household. There was a lot of a lot of things going on there. And, you know, my residents were very, very fearful of the things that could happen. And they did see like that they were pulling, you know, electricity and this and that and doing a lot of illegal stuff.'",
        "'speaker_4': 'And even though we were on them and we were trying to work with code enforcement and everything, it was a very difficult situation until a horrific fire happened. And as you remember, the house burned down and now there's nothing there anymore.'",
        "'speaker_4': 'But I'm wondering what that impact has been on our fire department and fires like that.'",
        "'speaker_8': 'Yeah. So obviously fires like that take up a lot of resources both in our apparatus and our personnel in time. But more so is the the life hazard that occurs every time we have a big fire like that.'",
        "'speaker_8': 'There has to be the assumption that there's a life safety hazard. The fire just didn't start on its own. And so with that in mind, we have personnel going into structures that are dangerous, inherently dangerous looking, searching for people that could potentially be in there.'",
        "'speaker_8': 'The one good thing that I'm looking at is where we've had a number of fires within certain occupancy. We've been able to work with the other members of the city team and as you said, burn to the ground.'",
        "'speaker_8': 'But they get cleared out and taken down to the ground. And basically it's now it's a lot and which makes that area safer. But it's just a difficult proposition for everybody.'",
        "'speaker_4': 'Thank you. Thank you very much.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you, Linda. So I guess I'll take the last opportunity to first of all, thank you, Mr. Keisler, and economic development for a great presentation and all the great work that your department continues to do. A lot of folks don't know.'",
        "'speaker_3': 'We're going on our 12 hour. We were here this morning meeting with the economic development and developers this morning on a key strategic economic development project in North Long Beach. And John and his team have been tremendously supportive and continue to do so for all of our activities and eight district and in North Long Beach as a'",
        "'speaker_3': 'whole. So thank you for that. I can remember not too long ago that this city council during the budget process made the decision to create an economic development department. Right. And I want to say, during my time on a city council, I think that's probably the best decision that we've made, that that decision has produced results far'",
        "'speaker_3': 'beyond what we could have ever imagined. And so credit to the city management. It's credit to the city, to the economic development team for for their great work and continued work in our city. Oh, so no questions. Fire department.'",
        "'speaker_3': 'Obviously, we do. We do appreciate your ongoing commitment to diversity in our academies and hiring practices. And that is obviously a nexus to our civil service department. And we appreciate all of the work that you both are doing to to make that happen.'",
        "'speaker_3': 'We do appreciate your great support during COVID. Uh, the 60% increase in arsons is very, very concerning. And I know we've had these conversations before, but there is anything that we can do proactively, particularly along the Rivers Railroad tracks, in terms of brush fires, prevention, to, to, to get in front of that.'",
        "'speaker_8': 'Yeah. So currently there is a city team that's put together that's working collaboratively with L.A. Public Works, Caltrans, some of the other agencies trying to come to agreements on what this is going to look like as far as the responsibility, who's going to have the ultimate responsibility as far as a cleanup.'",
        "'speaker_8': 'But it's it's kind of a slow process in going. And so in order to bolster that, we also have, as I said, we have the Hart team that are going out doing proactive education in those encampments, in those areas, trying to get people just to be as careful as they can, and also giving that information to all'",
        "'speaker_8': 'of the area stations so that they're able to react in any event. And we actually do have a fire.'",
        "'speaker_3': 'Right. Thank you. That that continues to concern me. And anything we can do to support proactivity in that space is important. I've seen and experienced that that increase in brush fires in my district and we experience it on often it seems like once a week right now.'",
        "'speaker_3': 'In Fire station night. Yes. Obviously, a very important topic of citywide conversation. And thanks to the structure overall. How or how are response times for a power station nine currently? And. And where do you see and where are we toward getting.'",
        "'speaker_3': 'I guess that's not your area but um. Response time supports this in nine. That's an important topic in my area of the city.'",
        "'speaker_8': 'Yes, fire response times improved just the way that we thought they would. Moving the personnel from Engine and Rescue Nine to an area that was that was closer to Old Station nine, brought those response times more into line where they used to be before.'",
        "'speaker_8': 'Now, the the opposite effect of that is obviously when so the rescue was down just slightly south. So those were response times when they were in that location had improved down there. But system wide, we're doing very well with our response times.'",
        "'speaker_3': 'Right. And then my my last question was related to wildfires. Yes. Obviously, they're not close by. But what are the impacts? How are these wildfires impacting operations and service delivery in any way for for our city?'",
        "'speaker_8': 'Yeah. Right now, it's it's a critical time for our region. We just got notified by OAS this evening that they are in a critical state. They're asking everybody in our region to send apparatus up north because they're unable to handle it on their own, obviously, with those resources.'",
        "'speaker_8': 'But our primary I just want to be clear, our primary mission is to protect the city of Long Beach. First and foremost, follow up to that is is the region in the area. So I'm talking Malibu, Ventura, Orange County, San Diego County, somewhere we can get to fairly quickly.'",
        "'speaker_8': 'And then the follow up to that, obviously, are the fires that we're seeing up in Northern California. We're also up in Oregon and Washington. We operate very well because of master mutual aid and not only with wildfires, but looking down the road.'",
        "'speaker_8': 'And I would hate to see anything like it, but we have another big earthquake. I guarantee you we would be using master mutual aid, asking for assistance from outlying fire departments to come in and help us.'",
        "'speaker_3': 'This might be a silly question, but are we reimbursed for that kind of mutual aid?'",
        "'speaker_5': 'We are.'",
        "'speaker_8': 'Yes. We receive full cost plus a slight administrative fee for the wear and tear on the apparatus and the like.'",
        "'speaker_3': 'Great. I have no further questions. I don't see any further questions from the council. So with that said, let's go to a vote. To receive and follow.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you very much. We are moving on before we go on to the next item on the agenda, which will be item 24, we are going to without any objection of the council, we are going to be postponing the infrastructure study session.'",
        "'speaker_2': 'I know that the Council is very interested in that and it deserves a lot of attention from the council. And and so we want to make sure that everyone's ready to go so we can postpone that hopefully to the next week or two.'"
    ],
    "Recommendation to authorize City Manager, or designee, to enter into Beach Concession Agreements with Monty's Beach, a California limited liability company, and Downey Restaurant Company, Inc., dba Gaucho Grill, for the operation of a food concession at Granada Beach and Alamitos Beach, respectively, on the stated terms and conditions, including options to renew at the discretion of the City Manager; and   Authorize City Manager, or designee, to negotiate and execute any necessary modifications to the proposed terms that may be necessary to expedite establishment of the beach concessions operation.  (Districts 2,3)": [
        "'speaker_2': 'That would be great. We'll work on the timing on that. Thank you. And with that, we will take on item number 24.'",
        "'speaker_1': 'Item 24 report from Economic Development, Parks, Recreation and Marine and Public Works. Recommendation to enter into concession agreements for the Operation of Food Concession at Granada Beach and Alamitos Beach Districts. Two or three.'",
        "'speaker_2': 'Before. I want to hear this item. Can I get a motion in a second, please? I have emotion over emotion in a second. Let me go ahead and go to presentation. It's staff.'",
        "'speaker_7': 'Thank you very much, Mr. Mayor. So we do have a presentation on this item. Mrs.. Ah, some pretty significant leases that you're entering into to really activate our beachfront. We have some wonderful.'",
        "'speaker_5': 'Opportunities we've been engaging.'",
        "'speaker_7': 'In to bring.'",
        "'speaker_2': 'People down to the beach and.'",
        "'speaker_7': 'Really improve the beach experience. We have also received.'",
        "'speaker_2': 'One.'",
        "'speaker_3': 'Or possibly two.'",
        "'speaker_7': 'Protests on this item, so we want to make sure that we're spending time to really explain the process that was gone through, explain staff's recommendations, and also address some of the questions that were brought up during the protest process.'",
        "'speaker_7': 'So I will turn this over now to the team to walk through the presentation.'",
        "'speaker_2': 'Thank you, Tom. The this item is a continuation of of an effort to identify and select beach concessionaires across our main waterfront area. Today, we're going to be focusing on the final two areas, the Grenada and the Alamitos Beach areas.'",
        "'speaker_2': 'The project goals were much more than just find a vendor. We've been really working hard to activate our waterfront and improve it and increase access and the beach experience. And we were we've also been looking for a assortment of different options and to really diversify the opportunities along the beachfront of approachable menus and pricing and long term'",
        "'speaker_2': 'partnerships with the city. And and just improving our overall public infrastructure has been a major focus for us. This is this is the final stage of a process that started a couple of years ago. We initially started with an RFP that that didn't create the the activity that we were hoping for.'",
        "'speaker_2': 'So we engaged a brokerage firm to help us lead this effort as we identified vendors and we conducted interviews with were folks to submit a proposal, and we extended that due to COVID. But we're now at a point where we're making recommendations.'",
        "'speaker_2': 'I'm going to start with with Granada Beach and the concession concession that we're recommending in this area, we found a concessionaire, a vendor that is looking to take advantage of the amenities of Granada, the specifically Rosie's Dog Beach and and the launch ramp that that that's available there.'",
        "'speaker_2': 'So I'm going to briefly provide the overview of what of what the vendor is proposing. We have a combination of of sunbeds cabanas and a dog agility course located to be located west of the launch ramp and south of the existing concessions that we the this will require additional review and approvals specifically from the California Coastal Commission'",
        "'speaker_2': '. And so the vendor has agreed to go through that process. And in the case that the concept was not approved, there is an opportunity for the selected concessionaire to terminate the lease. I'm now going to focus on on Alamitos.'",
        "'speaker_2': 'Alamitos has been a major focus area for us. There's been an investment area where we've built and enhanced the pedestrian and bike path. We build new traffic signals, sidewalks and bike lanes. We've been able to rebuild the staircase, the parking lot and obviously the concession facility itself that's that's in progress.'",
        "'speaker_2': 'This is also an area that gets a lot of special events, activities. The Grand Prix and the Long Beach Marathon are just two of the big ones. There's a regularly major events here that that use this area. For those of you that recall the previous facility wasn't really bad shape was in need of major improvements and this'",
        "'speaker_2': 'is what we're building out. These are actual pictures of the existing condition of the new facility. So I'm just going to go back for a second to show that before and then the day after was being built. It's about 90% complete.'",
        "'speaker_2': 'The final touches are still happening. A new amenity as part of this project is the development of an actual playground. To the left. You see a picture of the concept. To the right you see the picture of actual current status of the project.'",
        "'speaker_2': 'So now we feel like it's going to truly continue to transform the landscape and the and the waterfronts as we've been doing with some of the other projects. I'm going to turn it over to John Chrisler and Mary, who's going to walk us through the listing process and the different steps that we've gone through in order to'",
        "'speaker_2': 'get to where we're at now.'",
        "'speaker_7': 'John Yeah, thank you so much, Eric. And so this this is a listing process. We use this for a lot of our real estate agreements. And in this case, we worked with a consultant, a commercial real estate broker that is selected through a competitive bid process and is what we call on our bench to do targeted outreach'",
        "'speaker_7': 'to groups that might be interested in a particular real estate or leasing opportunity. So Leon Associates was our commercial broker in this case. They were able to secure six letters of interest from six different groups, as well as to provide them with background access to the site so that they could develop their concepts.'",
        "'speaker_7': 'There was a multidisciplinary. What that means is at least four different departments were involved and are, of course our commercial broker to review each of the proposals as well as to conduct interviews with all of the proposers who had submitted a letter of interest.'",
        "'speaker_7': 'In this case, the group selected in a unanimous choice. What is listed here is Downey Restaurant Company is actually Beach Restaurant Group, an affiliate of Downey Restaurant Company, otherwise known as Gaucho Grill. And the proposal was evaluated based on these six categories or criteria which included the menu affordability, demonstrated experience, financial strength, proposed hours of operation, and'",
        "'speaker_7': 'a demonstrated willingness to partner with the city because of how active this area is for both visitors as well as special events. So to tell you a little bit about Gaucho Grill or in this case the Gaucho Beach, they offer three different concepts seven days a week.'",
        "'speaker_7': 'And this is important because, as you know, this location is right near the bike path and there's different customers in the morning, in the evening, as well as different customers throughout the weekend. And so there's there's three different amenities.'",
        "'speaker_7': 'Gaucho Beach is more of the sit down restaurant concept. Gaucho Cafe is more of the Quick Serve Cafe and then Gaucho Mercato, which is the grab and go option for those visitors who are passing through on the run.'",
        "'speaker_7': 'So one of the key criteria for the selection of this group had to do with the menu as well as the hours of operation. And you can see the range of of the different types of foods as well as the price points.'",
        "'speaker_7': 'This location, of course, also will offer alcohol, beverages and ultimately a range of of of options for both food on the go as well as sit down. Gaucho Caf would be more of that quick serve experience for different times of the day.'",
        "'speaker_7': 'Usually the earlier parts of the day and you can get a sense of the price points as well as the range for that menu. And then finally in your presentation, you'll see the mercato, and this is more of a of a store where you can get some of the items that are provided in the cafe as well'",
        "'speaker_7': 'as the restaurant. But you're able to to to take them on the run. They're available in this format. And these pictures are actually from another location, I believe this is Bueno Park, where Gaucho Mercato is a proven concept and is currently in business as well.'",
        "'speaker_7': 'So just to give you a little bit of a sense of what the terms of this lease would be, this will be an initial term of five years. It would commence immediately, almost at September 1st, and there would be two five year additional options to extend the base rent.'",
        "'speaker_7': 'Here would be 12,720 per month. There would be CPI or Consumer Price Index increases no more than 3% per year. But then we would see the rents rent commencement period after the building would receive its CEO or certificate of occupancy.'",
        "'speaker_7': 'So that likely is not going to happen until June of 22 because there's pretty extensive tenant improvements that need to occur and the concessionaire in this case will be responsible for the build out of all concessions. I believe that this is about a $1.2 million investment from this particular vendor.'",
        "'speaker_7': 'And in this case, the vendor will also be paying for all of their utilities and other costs. Of course, refuse maintenance. And those things include. So what we wanted to make sure that we covered. Typically, we we will get either a complaint or a protest.'",
        "'speaker_7': 'We wanted to make sure that we shared with the council those those criticisms of the process so that we're transparent. The complaints that we received were primarily about the affordability of the items that were being provided, the correct concepts for the area, whether it fits for the customers or or the lifestyle and activity level, the experience of'",
        "'speaker_7': 'the proposers, their financial strength, the hours of operation that they were proposing, the issue of local preference, whether or not the company is a resident or has done business in the city before. And then the greatest economic value to the city, how much potential, direct and indirect impact that the vendor would would have on that location and'",
        "'speaker_7': 'the city at large. Obviously, there's some questions about maximizing the return on the city's asset. That's always important to us. Our process that we used in this case to select the vendor and ultimately how this vendor will activate the area.'",
        "'speaker_7': 'So this is a summary of the complaints. We're happy to address any of those issues for the Council, but we wanted to make sure that we at least address them for you in in in summary. So we've we've looked at the various issues and we've determined that ultimately we stand by the recommendation of the committee.'",
        "'speaker_7': 'I personally, as the director, do not sit on the committees. These are individuals that are selected for their areas of expertize. But I do have some separation from that process for this for this reason. But in this case, the seven issues that were identified, um, you know, I'll just go through this real quick, but the listing process'",
        "'speaker_7': 'is consistent. We've reviewed this before. It's used consistently in the private sector for these kinds of leasing opportunities. Unfortunately, local preference is not allowed in the tidelands by state law. That's not something that we can use as a differentiator.'",
        "'speaker_7': 'Um, the Gaucho Grill proposal met the goals for the Alamitos Beach concession stand for activation, variety, affordability, etc. while offering a market rent rate rent gauchos Girl Grill's proposal also provided those three different concepts that we just reviewed to ensure that the concession stand would be activated morning, noon and night, seven days a week.'",
        "'speaker_7': 'The proposal offered a variety of items and prices through each concept from grab and go to formal sit down, as we had mentioned, item six. They are currently operating these concepts in other areas of the region and they own two downtown restaurants here in Long Beach.'",
        "'speaker_7': 'We've even checked with some of their neighbors on Pine Avenue to see if they were good neighbors and ultimately that checked out as well. And as I mentioned here, in terms of being local, they received letters of support from downtown businesses as well to support their application.'",
        "'speaker_7': 'And our follow up. So there's one change to the recommendation that I need to read into the record, and that is ultimately that Beach Restaurant group. We listed it as Downey Restaurant Company. This was a staff error. It is an affiliate of Downey Restaurant Company.'",
        "'speaker_7': 'But we want to make sure that we get the right name in the council recommendation because that's what goes into our contracts. So our two recommendations are to authorize the city manager or designee to enter into beach concessions agreements with both Monty's Beach and Beach Restaurant Group, Inc., for the operation of food concessions at both Coronado Beach'",
        "'speaker_7': 'and Alamitos Beach, respectively, on the stated terms and conditions from the presentation, including options to renew at the discretion of the city manager. And the second recommendation is to authorize the city manager designee to negotiate and execute any necessary modifications to the proposed terms that may be necessary to expedite establishment of the beach concessions operation.'",
        "'speaker_7': 'So with that, I'll turn it back over to the city manager and I have Mary Toys R, our acting real estate development bureau manager, to help us answer any questions. Thank you very much, John. So that concludes today's presentation.'",
        "'speaker_7': 'As mentioned, we wanted to make sure you had all the details and we did have those protests and we bring those to your attention.'",
        "'speaker_2': 'I think we.'",
        "'speaker_7': 'Are satisfied with staff's recommendation.'",
        "'speaker_5': 'Really is up to the council to take that next step.'",
        "'speaker_2': 'Which could be.'",
        "'speaker_7': 'As we recommend the staff recommendation.'",
        "'speaker_2': 'Or alternate direction to.'",
        "'speaker_7': 'Cease the process and to begin again. Again, we feel it's been a very fair process.'",
        "'speaker_5': 'We had a.'",
        "'speaker_7': 'Unanimous committee.'",
        "'speaker_5': 'Vote and as a.'",
        "'speaker_7': 'Group that is going to provide the most service.'",
        "'speaker_5': 'Seven days a week are on the beach with varying.'",
        "'speaker_7': 'Options.'",
        "'speaker_5': 'Really was the best proposal.'",
        "'speaker_2': 'And we stand by four questions. Thank you. Have a motion and a second. I'm going to go do the public comment. That is has the given please have the following folks, please come forward in this order. Sarah Sagmeister, Davina Hernandez, Mark Kirk, Kratos in and Adrian Amore.'",
        "'speaker_2': 'In that order they're saying master they're going to Hernandez Mark Gunter Kirk Kratos in and Adrian Amore if I can have them please approach the podium and they can begin.'",
        "'speaker_0': 'Mayor Garcia and council members. My name is Sarah Tong, Sang Meister. I'm a long time resident of the third district and an owner of Gladstone's Long Beach in the second District. We know everybody's time is valuable. I know you guys have already been here a long time tonight, so I'm going to try to keep this as short'",
        "'speaker_0': 'as possible. I'm speaking tonight to ask the council to table this motion or redact the references to the Alamitos Beach concession. More than 20 years ago, my husband John and I took a large gamble cobbled together investors and Gladstone signed the first lease in the new waterfront area known as the Pike.'",
        "'speaker_0': 'That was a bet. The farm proposition for our family and at the time downtown was not family friendly and for those of us that were living here was frankly pretty moribund. We're proud to have been an integral part of the revitalization of downtown and the waterfront.'",
        "'speaker_0': 'We love this city very much. John and I sent you a letter yesterday, which we hope all of you have had a chance to review and reviewed more of our details and concerns. And we appreciate the city staff taking the time to address some of those.'",
        "'speaker_0': 'The last 17 months have really been a roller coaster of economic, social and medical issues and problems that you and the city staff have all had to deal with. As a former Parks and RECs commissioner, I know how hard city staff works.'",
        "'speaker_0': 'I know John Keisler very well and I appreciate all the hard work that's been put forth by the Economic Development Department, Parks and Rec and Public Works departments on all of this vetting process. But I want my comments to focus on two main things, and I know I'm running out of time.'",
        "'speaker_0': 'Return on investment and timing. Given John's for his presentation earlier this evening, he referenced looking for a return on investment and the need for his group to maximize the return on investment. Given a mandate for a way, I'm not sure how the economics of these bids don't play some sort of role.'",
        "'speaker_0': 'And I noted in the presentation it said that rent offered was not a determining factor. If that had been the case, I wish that had been actually in the proposal because John and I would not have proposed what we did, which was a greater rent than what was asked for in the bid.'",
        "'speaker_0': 'I would have told John to keep it down, but no, we actually proposed. Instead of the $3 in a ten year term, we suggested a $1.7 million a tenant improvement investment and suggested a rent starting at $3.50 a square foot and a term of ten years.'",
        "'speaker_0': 'I know also in this proposal that now the proposal also suggests a five year term, at least at the at the beginning. I'd urge the council to look at these economic issues closely. I also understand now that this group also owns Agave and Alegria.'",
        "'speaker_0': 'And as a member of the Downtown, I look, I would ask you to look at those groups as well. Thank you. I've run out of time. Thank you.'",
        "'speaker_2': 'Thank you so much. Next week.'",
        "'speaker_0': 'Hi, my name is Davina Hernandez and I'm a resident in District two of Long Beach. My goal here today is to ask you to take this agenda item regarding the awarding of Alamitos concession stand to the Downey Group.'",
        "'speaker_0': 'I'm sorry, I use Downey Group because I wasn't aware of the change of name. I would like to start by saying that I hope you understand that Mark Dutton and I are not here as embittered losers of our bid.'",
        "'speaker_0': 'In fact, as a local social science history teacher, this is my first bid and I'm impressed that it actually went this far. We are here for the following concerns. The criteria we were given from the city, from the city staff were as follows Unique concept activation of the area, locally owned and family friendly experience and financial backing'",
        "'speaker_0': 'and Tom Rodriguez letter. He stated that each proposal was evaluated on the following six items menu and local concept menu and location concept affordability of menu items demonstrated experience, financial strength, hours of operation and willingness to partner with the city in the activation of the area.'",
        "'speaker_0': 'As you can see, the city's expectations were different from the criteria we received. Some groups received different criteria than others. This alone shows that this process was not equitable. When our group compared Downey Group at Danny Group's proposal not only to Arvid, but to others, we were more, even more concerned.'",
        "'speaker_0': 'For example, concept, our group proposed a mexican Caribbean taco bar with a check average of $22 and 15 or less for on the go and breakfast items. This concept with the ambiance we presented makes sense for a location on the beach and the local demographic.'",
        "'speaker_0': 'Downey Group proposed an Argentinean steakhouse. With the market and on the go items at stake is more expensive than tacos. Their check averages will be much higher than ours, making it difficult for local beachgoers and residents to pop in frequently.'",
        "'speaker_0': 'Not to mention, this concept was unsuccessful at activating Pine Street and closed before COVID. Demonstrated experience. Our group has activated both downtown with District Line and the Rainbow Bridge with Receive. Both restaurants are still operational and successful. Our owners have invested in numerous successful restaurants in the city, including legends and Boathouse on the Bay Downey Group.'",
        "'speaker_0': 'After research, we have found that they own or are part of two local restaurants on Pine, but also act as nightclubs. What we found with our research is they also own a cannabis restaurant in West Hollywood. Our question to you is, will they be serving these edibles at the family friendly gaucho grill environment that they will have'",
        "'speaker_0': 'at the beach located right next to a playground? Financial strength. We're not sure how they judge this item, but our group has the backing of many successful Long Beach business owners and a man who owns the largest conference call company in the world.'",
        "'speaker_0': 'The headquarters of this business are here in Long Beach. With multiple change deadlines, information given to some and not all. No communication as to why the decision was over three months late and choosing a group that is not local.'",
        "'speaker_0': 'I implore you to reconsider.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'I thank you, honorable mayor and council. My name is Mark Dunton and I just want to say thank you for taking the time. I'm a Long Beach district resident and business owner for over 14 years. We submitted a bid for the Elmhurst Beach location, so I am formally requesting that we table this today so we can go'",
        "'speaker_3': 'into why the bid process from our end was murky and no transparency. Once from the start, we got our criteria and we went off that and that oftentimes changed throughout the process, unbeknownst to us. So then we'd find out, Hey, this process was this way, and then someone would say, Well, we went this way with the process'",
        "'speaker_3': '. So the criteria was very murky, hard to understand. So we want to go back and say, Hey, here's the criteria for this bid. And as a restaurant tour, that makes us a lot, a lot simpler for us to understand what's needed and what you guys are looking for.'",
        "'speaker_3': 'We had tons of experience. We thought we met the criteria. And I'm definitely not here to. Bash the winner or anything like that. I just want to bash the process that it was as it.'",
        "'speaker_5': 'Was happening.'",
        "'speaker_3': 'In the criteria wasn't even close to at the end was thank you for explaining that and I'm glad it went well in your end. But from our end, like as a restauranteur, it was all over the place. So we were you were just asking that we just take a pause on this and really dissect that criteria so'",
        "'speaker_3': 'this doesn't happen again. So we can really understand what you guys are looking.'",
        "'speaker_5': 'For in this restaurant.'",
        "'speaker_3': 'We want to be successful no matter who gets it, but we all want a fair shot at this so the criteria can be determined exactly what's needed. What does local mean? What does financial backing mean? How do you get to that?'",
        "'speaker_3': 'So if I just say, please table this for today so we can look at the criteria as a whole and do this the right way so we could all come at this as a strong unit together.'",
        "'speaker_2': 'Thank you. Thank you. Thanks, Speaker, please. I'd like to submit to the city clerk some of our. Packets. Honorable Mayor and members of the City Council staff from Public Works, Economic Development, Administrative Staff. My name is Kurt Cartesian.'",
        "'speaker_2': 'I'm one of the owners of the Gaucho Family of restaurants. My partner Adriana Mosa is here as well. We're very excited to be here even at this late point in the evening and sat through a very professional set of agenda items.'",
        "'speaker_2': 'We commend you for that. In addition to what has been shared previously. We're here to answer any questions you might have, but this has been a rather rigorous process dating back. I think when one individual mentioned it being 17 months, it was at least a year of work getting to this point.'",
        "'speaker_2': 'And we think we think staff to this point, to this point, we still have not met any committee members. So who those members are is still a bit of a known to us. I personally was born in the city of Long Beach.'",
        "'speaker_2': 'I've lived in five different residences here in the city on Chestnut, on Appian Way, on Claremont, on Covina and Corona. And Adrian has lived two different residences and has operated four different businesses in Long Beach. The location previously that was a Gaucho family restaurant was not closed down, it was too small, and it was an expansion project'",
        "'speaker_2': 'on Pine. Our most recent project in Bueno Park is an 11,500 square foot facility. We invite you guys to come out there. It would be exciting to have you. It's a little tough during COVID, but we have the potentiality to handle the size of this project.'",
        "'speaker_2': 'We're very excited about it. And to that, we would like to to share any questions you might have. But we do appreciate being here this evening. And with that, I will I will conclude out and assume that there could be questions, but we don't see any need to prolong the process.'",
        "'speaker_2': 'We just would like to thank you this evening and hope to get underway. Thank you. Thank you. Do you have any comments during the speakers list or.'",
        "'speaker_6': 'No, I. I want to.'",
        "'speaker_5': 'Thank the opportunity. We are very excited about this project and we will do the best that our 12 hours of experience dictate.'",
        "'speaker_2': 'Thank you very much. That concludes public comment. I will go back. I have a motion and a second to approve staff recommendation. Councilman Allen.'",
        "'speaker_1': 'All right. Thank you, Mayor. I first want to thank everyone that came out tonight and sitting through a long meeting. And I really appreciate your comments. Also, I want to thank staff or I know it's like two and a half years that they've been working on this.'",
        "'speaker_1': 'Getting it built out, getting a contractor and finalizing a concession contract was a very long process. I know that folks did reach out to me to talk, but, you know, we need to do this in a public setting like this.'",
        "'speaker_1': 'It's important that we have good operators in these spaces. And I know that there were a lot of great operators that applied for this concession space. I do trust that the staff followed protocols and so I have some questions with regards to that.'",
        "'speaker_1': 'I know. I know these operators and I know they're good operators. But, you know, from everything that I saw tonight, it looks like Gaucho Grill landed on top. And from someone who has done hundreds of RFP as of the previous business, I'm definitely lost more than I want.'",
        "'speaker_1': 'And I and I know it's it's it's it's tough when you when you put a lot of work and equity into time equity into these these processes and and you don't want I know it's tough some of the things that I didn't like what I what I saw was about Gaucho Grill was their extended service hours morning'",
        "'speaker_1': 'afternoon evening. And I don't know if that seven days a week so if we could clarify that I also liked the grab and go options. I think those are really important. I can tell you as also a resident of the second district and being very in touch with my constituents that I know that that that this low'",
        "'speaker_1': 'cost options are important. 354 an empanada or $7 for a pizza that's really, really important to to our our residents having that low costs that low cost option. So my first question I just want to talk about the process.'",
        "'speaker_1': 'Did did did all these groups did did they, in fact, get different criteria or did they all receive the same criteria? Can you just verify can you just clarify that for me?'",
        "'speaker_7': 'Certainly. So, Councilmember, the way that a listing works is that there's an initial packet that Lee and associates that we develop together. And so every one of the proposers receives the same exact packet, which is what I have in front of me.'",
        "'speaker_7': 'Ultimately, it has what's called the opportunity section, which is a couple of paragraphs. It's narrative in in. So I can assure you that our commercial broker, Leon Associates, has the same information that they provide. And secondly, after the group submits an outline, they would receive what's called a tenant questionnaire.'",
        "'speaker_7': 'And those are the same roughly eight questions. And I can assure you as well that they're consistent in the same. And what we receive back is different based on what the proposer wants to submit. But what we have provided to Leon Associates does not change throughout the process.'",
        "'speaker_1': 'So do they all receive the same criteria?'",
        "'speaker_7': 'Okay. Yes, the criteria that that is described is what's called the opportunity. Okay. And those are the three ultimately the three paragraphs that are given to everybody. Okay. What the committee then breaks down as their way of assessing the seven things that we were talking about that the committee used as their as they were discussing proposals.'",
        "'speaker_7': 'That's not something that's that's sent out publicly. It's not published.'",
        "'speaker_1': 'So was a request for an answer?'",
        "'speaker_7': 'Yeah, I'm sorry, but it's part of what we describe as our tenant questionnaire. So business name, type of business owner experience description of the concept menu or list listing of offerings, overview of the interior and exterior build out, and an estimated costs of improvements and hours of operations.'",
        "'speaker_7': 'So those were the consistent questions that were used by the group.'",
        "'speaker_1': 'So I'm assuming if there was a if there was any clarification on this RFP and there was a Q&A phase that all of the respondents would have gotten the answers to those questions if there was any clarifying questions to them with regard to privacy.'",
        "'speaker_7': 'And so the question is, was there like with an RFP? So this was a listing. But typically, I think what you're you're suggesting is that there would be questions submitted by all of the proposers, then those questions would be answered in one document and then provided to all of the proposers so that all the information, clarifying information'",
        "'speaker_7': 'was provided equally. So I'll ask Mary about, given the listing process, if there was ever an F, a queue or a commonly asked question.'",
        "'speaker_0': 'Councilwoman. During the listing process, the brokers fielded the questions mostly on our behalf. So there wasn't a formal question and answer submittal process. They just stuck to the tenant questionnaire to get together the information that the panel requested.'",
        "'speaker_1': 'Okay. And I'm on this. How many people are on this election committee?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_7': 'Yeah. So, so, so. Nine total people across four different departments.'",
        "'speaker_1': 'Okay. And I know my time is up, so I'm going to queue back up.'",
        "'speaker_2': 'Councilman Price.'",
        "'speaker_4': 'I appreciate staff's presentation tonight. Obviously, when we're going through a process like this, city council is not involved for good reason. In fact, it sounds like at least two of the three speakers tonight, our third district resident. So it's it's obviously we want to make sure that it's a fair process.'",
        "'speaker_4': 'So I appreciate that we're usually not involved in this process. First of all, let me just say I'm very excited about Monte's speech, and I appreciate city staff involve me in the process after they were selected. I clearly wasn't involved in their selection, but I'm very excited about that concept for Granada Beach.'",
        "'speaker_4': 'In terms of the the Alameda speech stands. The most important thing to me is that it's a fair process. And one of the points that was raised was this issue of return on investment. And I just would ask if staff could expand on that a little bit more, because I think missing Meissner raised some excellent points regarding'",
        "'speaker_4': 'the rent proposals. And and I realize that wasn't the defining factor. That wasn't the number one criteria, but why wasn't it the number one criteria? And is that accurate to say that the highest. The highest bidder in terms of rent to the city was rejected.'",
        "'speaker_7': 'Yeah, of course. Council member. So, you know, there's, there's a there's a number of different factors that go into the the road calculation. And of course, rent is one of them in terms of how we would calculate the direct economic benefit.'",
        "'speaker_7': 'But it's not necessarily the price per se, you know, price per square foot that actually leads to the longest term or greatest economic impact. So, um, for instance, in this case, we had some vendors of the vendor who offered the highest rental rate, um, also had the longest term, starting with a 20 year term just out the'",
        "'speaker_7': 'gate. So instead of five years for us to really see how they're doing, to see how they're performing, um, most of the, the, the proposers had had a shorter five year term plus two, five year extension, so that would be 15 years.'",
        "'speaker_7': 'The proposer who put down the three, the highest rental rate, asked for 20 years out the gate without a lot of flexibility for us to test the concept, see how they're doing, make adjustments, etc.. So that would have committed the city to 20 years plus to ten years, almost 40 years, which you can imagine is a huge'",
        "'speaker_7': 'commitment for for a particular tenant, especially in this sector. Um, next, when you look at hours of operation, some of the proposers were very specific about their hours of operation. In fact, the one that was selected had their hours of operation listed going in, presented that to the committee and it represented the most hours of service with'",
        "'speaker_7': 'the most types of foods that could be provided at different times of day. Some of the proposers didn't even have their hours of operation identified or just partial shifts identified. Others didn't even have breakfast items, so they really couldn't provide food for the breakfast crowd.'",
        "'speaker_7': 'So when we look across all of the amenities, the hours of operation, the possibility of, you know, monetizing every square foot with different kinds of business activities, all of those calculations would go into and including things like sales tax, there's a possessor interest property tax.'",
        "'speaker_7': 'There's also jobs associated with these different activities. And some of these activities would require more staff than others. So we do have our own spreadsheets, which we have each of the different proposers listed, and we look across those different categories, those different calculations, and ultimately determine what we believe is the best ROI given the goals and objectives'",
        "'speaker_7': 'of the City Council.'",
        "'speaker_4': 'Okay. And my time is almost up. I do. The other question that I wanted to ask is how important is this idea of having the different options for this particular location in terms of the grab and go the sit down and then the cafe style?'",
        "'speaker_4': 'You know, did we do any sort of demographic study and determine that that would be the best? Having those options would be the best concept for the site.'",
        "'speaker_7': 'Mm hmm. Yeah. So Eric Lopez is our Coastal Commission expert. I'll ask him to answer that.'",
        "'speaker_2': 'For this specific area council member. We were looking for varieties and options. As you know, we're building a brand new playground next door. We also have one of the bigger rental spaces that that's also been built. And we know since we've done all of our investments, we're attracting more and more people to this area.'",
        "'speaker_2': 'This is also going to be the future home of the next. We built a the water place structure that we know is going to attract a lot of people. So we wanted to maximize the options available. Grab and go was super important.'",
        "'speaker_2': 'Having more than just the traditional sit down options really, really resonated with the with the committee. And it's one of the points that that that that I'm glad we're highlighting.'",
        "'speaker_7': 'And Councilmember.'",
        "'speaker_2': 'If I can add another Time's up. But Coastal Commission.'",
        "'speaker_7': 'Was very specific when we went and applied for this project in the first place.'",
        "'speaker_6': 'We proposed a.'",
        "'speaker_7': 'Restaurant, a sit down restaurant in Coastal, gave us very significant feedback that they didn't want a restaurant, they wanted a really a grab and go. So it was a lot of negotiation to do some type of sit down dining plus.'",
        "'speaker_2': 'Grab and go, puts anything that can just be.'",
        "'speaker_7': 'Low price street prices. That was very important to us that things cost.'",
        "'speaker_2': 'Essentially what it would cost in a.'",
        "'speaker_5': 'Normal.'",
        "'speaker_7': 'Environment. And there's no upcharge.'",
        "'speaker_4': 'And I appreciate you sharing that, Mr. MODICA, because we did go through those discussions with the Belmont Pool early on when we were talking about a cafe in La Palapa had been removed from that location and a lot of people wanted that concept back and we really had to work with Coastal on that.'",
        "'speaker_4': 'So if we could just go back for a moment to Monty's Beach, I want to thank staff because all I wanted more than anything was some variety between Bay Shore Granada, one of the ones in my district, and you guys have definitely delivered on that.'",
        "'speaker_4': 'We have a different concept at each concession stand, which is really what I wanted for my district. And so I want to thank you for doing that.'",
        "'speaker_2': 'Thank you, Councilwoman. Let me go to Councilwoman Mongo.'",
        "'speaker_0': 'Thank you. So I've been through one of these processes that didn't turn out as positive. It didn't get a lot of bidders. And so I have a little bit of different feedback. I want the process to be fair and inclusive.'",
        "'speaker_0': 'I also really want there to be bidders that really want to be a part of the system. So what I kind of heard today and I want to clarify to make sure that I understand is the three paragraphs really provided the the launch point for people to make their bids?'",
        "'speaker_0': 'And then the questions were specific to what you put in your bid and therefore no one would get the same questions. Okay. I understand. I think that that needs to be more clear, because with the Eldorado Park project, I think we had a set of similar misunderstandings and and with.'",
        "'speaker_0': 'At least the one bidder that ended up kind of panning out. He was kind of confused. And so. I guess my next question would be. At the end of the five year term, you talk about testing a concept.'",
        "'speaker_0': 'It's in my nature to want to negotiate and get the most money for the city. I, of course, would rather have jobs above everything else. And then secondarily would be rent. And then third would be since we only get $0.02 on every dollar sales tax, does it mean at the end of the first five years that there'",
        "'speaker_0': 'would potentially be a rent increase?'",
        "'speaker_7': 'Yeah, absolutely. Councilmember And I'm actually looking at our spreadsheet now in terms of, of what happens with rent. Um, so in comparing, um, the, the selected proposer, which starts out at about 152,000 a year by year five goes up to 170, almost 172.'",
        "'speaker_7': 'And by year 15 goes almost to 231,000 a year compared to the group that offered the highest price per square foot out. The gate starts at 178 and ends at about 223. So you can see that that the CPI decrease increases or the escalators that are built in.'",
        "'speaker_7': 'And then when they're built in, when they're triggered, one is every year. The other one is every five years. And the last thing that I would just just cite in terms of our calculation was that when you include a triple net, when you when you say, I'm going to cover all of my expenditures, we've looked across a'",
        "'speaker_7': 'lot of our different facilities and where we've structured agreements where the vendor is not responsible for all of their costs, for energy, utilities, etc., then they don't have an incentive to keep those costs down or they don't look for innovation to be energy efficient and other things.'",
        "'speaker_7': 'So given that the proposers, some of them, you know, proposed that the city would pick up those costs, that's an expense side that really eats into to that margin or that profit. And of course, the selected proposer, they're there absorbing all those costs under a triple net.'",
        "'speaker_7': 'And that, for us also helps not knowing, given new business concepts, you might have different activities within that facility that drive higher energy costs or drive more costs that the city would have incurred. So again, I just wanted to point out some of those issues, and we can't we don't know exactly where we land at five years'",
        "'speaker_7': ', but with that five year option to extend, we will have the opportunity to visit that at that time.'",
        "'speaker_0': 'And I know that construction costs are very concerning right now and permits are very difficult and construction timelines are long. But my biggest pushback on you is June 20, 22. I mean, summer really starts in Long Beach around April, and I see that as a huge missed opportunity.'",
        "'speaker_0': 'And so anything we can do to encourage and push that this be open at least by Memorial Day, if not sooner. I know that at least on our side of town, the Easter holiday weekend is really a huge launch to outdoor activity in Long Beach.'",
        "'speaker_0': 'And when I see this proposal, many of you know I'm currently addicted to chocolate croissants. I can't get a chocolate cross on the east side of Long Beach for under a buck 50. I go to Simmons, I got a whole year.'",
        "'speaker_0': 'I got it. You name every place in my district. A dollar at the beach for croissants is just like a a whimsical. That's 60% of the total cost. So I'm very impressed by this. I plan to make my way down to the new website by June of 2022 and hopefully sooner.'",
        "'speaker_0': 'And then I would just end by saying, as this process came back to the council, I reached out several times to Mr. Modica and Mr. Brant Dennis of Parks and Rec and multiple times to Mr. Keisler. And I said.'",
        "'speaker_0': 'What can we do to allow anyone who didn't win this bid to get Eldorado Park? Eldorado Park is an amazing opportunity. We have a ranger station built. There's a huge, beautiful lake with beautiful trees that you could host weddings and all of these other things.'",
        "'speaker_0': 'And I would just be in love with a proposal for that project to really take on. And. I can't think of a word right now. Activate that space. And with I think the Parks Rec director said over 300,000 visitors a year to Eldorado Park.'",
        "'speaker_0': 'And with the automation coming and the new gate system, I just see it as the next big thing. So I strongly encourage you to reach out to the city and give your proposal to the other location. And I would love to see us take what we learn from this and be more specific and say for this location'",
        "'speaker_0': 'we're looking for these hours of operation, this many items at this price point and a five year deal with this much rent. I don't know if we can do that. I feel like that's a little bit more on the side of when I see a for rent sign on a building in the fifth District.'",
        "'speaker_0': 'They usually know what they want and I don't know that we always know that, but I'm looking forward to an opportunity to get someone into Eldorado Park, and I would be thrilled if we could do that by June of 2022.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. When we have Councilman Allen and we're going to vote.'",
        "'speaker_1': 'As a thank you, mayor, I just want to say, I think having all of these options in here are going to be really important to two residents. And I really, really like the menu. Like it sounds like a lot of my colleagues do as well.'",
        "'speaker_1': 'Mr. Kaiser, can you the you know, I'm always a big advocate of the local hire and in contracting locally, can you explain to me I know you had it on your report just really briefly about the state local preference.'",
        "'speaker_1': 'And can you explain to me like how that works? Our lack of local preference, I should say.'",
        "'speaker_7': 'Yeah. I was going to actually ask our city attorney to just clarify the law.'",
        "'speaker_2': 'Sure, I'd.'",
        "'speaker_7': 'Be happy to.'",
        "'speaker_2': 'Mayor and council members. The the some people have mentioned.'",
        "'speaker_7': 'That Long Beach, Munich had 2.84.030, which.'",
        "'speaker_3': 'Actually says that.'",
        "'speaker_2': 'Local.'",
        "'speaker_7': 'Preference cannot be given in the expenditure.'",
        "'speaker_2': 'Of tidelands funds. Arguably, that's not applicable here because no Tidelands funds are being expended. However, the granting statutes from.'",
        "'speaker_5': '1911 and there were others in the twenties and.'",
        "'speaker_2': 'Thirties that granted Long Beach, the Tidelands.'",
        "'speaker_5': 'Funds and the interpretive.'",
        "'speaker_2': 'Cases.'",
        "'speaker_7': 'That interpret those.'",
        "'speaker_2': 'Statutes, statutes make it very clear that local preference.'",
        "'speaker_7': 'Can't be given in the operation.'",
        "'speaker_2': 'Of tidelands areas, that.'",
        "'speaker_7': 'They need to be for the benefit of all Californians.'",
        "'speaker_2': 'And not just.'",
        "'speaker_7': 'People from the.'",
        "'speaker_5': 'Local jurisdiction or the title on DA.'",
        "'speaker_1': 'All right. Thank you very much for that clarification. And lastly, I just want to say, I want to congratulate Gaucho Grill for successfully winning this, and I will be supporting Star's recommendation.'",
        "'speaker_2': 'There's a motion in the second to support staff recommendation. Members we scored Castro votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance amending Long Beach Municipal Code Sections 10.12.010 to 10.12.030, relating to Speed Limits on City Streets, on the street segments listed in Attachment A.  (Citywide)": [
        "'speaker_2': 'Thank you. I will be moving on now to the next item, which will be item number 25.'",
        "'speaker_1': 'Please report from Public Works recommendation or request city attorney to prepare an ordinance amending the Long Beach Municipal Code relating to speed limits on city streets citywide.'",
        "'speaker_2': 'Mr. Modica.'",
        "'speaker_7': 'The item before you is related to speed limits. As mentioned, we are available for a staff report if you want it.'",
        "'speaker_5': 'Otherwise we're ready with the recommendation.'",
        "'speaker_2': 'Oh, I'm sorry. Councilman Price.'",
        "'speaker_4': 'To do this because I know it's a late night, but. Mr. Lopez, can you just talk real briefly about how it is specifically in Belmont? Sure. That we came up with these recommendations or perhaps you can expand on what I miss here.'",
        "'speaker_4': 'It's my understanding that this has been a multiyear process where data has been collected and the speed, the recommended speeds have been warranted through national standards for speed design and roadway design standards. And that this is something that has been in the process for a number of years to get to this recommendation.'",
        "'speaker_4': 'The reason and if there's anything you want to add to that, please. But the reason I'm asking that is because we do have business owners in Naples that have been asking for a reduction of speeds on Second Street through Naples.'",
        "'speaker_4': 'And that's something staff is looking at. But they have to collect the data and they have to make sure the warrants are there to recommend it. And it could not have been just added on to this item. Does that sound about right to you?'",
        "'speaker_2': 'Yes. Actually, we have Carl Hickman. That's our city traffic engineer. That's our local expert. So if I can have Carl Hickman help me answer that question, Carl.'",
        "'speaker_5': 'Sure. Good evening, Mr. Mayor. And council members. And to answer your question, Susie, basically, you know, many of most of those streets and the Belmont Shore residents district, they have similar characteristics. They were all originally posted at 25 miles an hour.'",
        "'speaker_5': 'They are very narrow there. The GM metrics are very similar. The usage that is there is very similar. So all of these things make it appropriate, appropriate to designate the entire neighborhood as a common district. All of the speed surveys that we collected there show an 85th percentile speed between 19 and 23 miles an hour.'",
        "'speaker_5': 'Actually, 14 of the 18 were actually 22 miles an hour or less. So because so many common conditions exist per the vehicle code, we're able to create their residence district and change the speed limits, have a reduction down to 15 miles an hour for the entire group of streets.'",
        "'speaker_5': 'And we're talking CVC Section 22, three, five, 8.3. That allows us to do that per state law, and that's how we're able to accomplish that in the Belmont Shore area.'",
        "'speaker_4': 'Okay. And so having said all of that, that your team is still looking at speed reductions on Second Street through the area of Naples, and that is a process where you're collecting data, doing speed surveys and establishing the necessary warrants to make that recommendation, correct?'",
        "'speaker_5': 'Yes, Councilwoman, we're actually in the process of reviewing all of the speed surveys in the entire city. These speed surveys are required so that PD has a formal and legal process to enforce our speed limits. We have over 300 engineering and traffic surveys that we have to maintain, and these require a renewal on the five year basis'",
        "'speaker_5': '. And sometimes we can also extend them seven or ten years. But yes, to answer your question, we will be reviewing those roadways as well at second and other areas as well throughout the entire city. And this is the first step in the process.'",
        "'speaker_5': 'And I can remind you all that we did pass a Safe Streets initiative back in July of last year. And this is part of our process to see where there are areas in the city where we can formally and legally reduce our speed limits to make our city's streets safer.'",
        "'speaker_4': 'Great. Thank you.'",
        "'speaker_2': 'That's when Austin. Is there a public comment on this item? No these cats votes.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 8.120, temporary enforcement of Long Beach Health Orders related COVID-19, and declaring the urgency thereof, and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Citywide)  (Emergency Ordinance No. ORD-21-0029)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'I'm 26.'",
        "'speaker_1': 'Communication from City Attorney Recommendation Declare Ordinance Amending the Long Beach Municipal Code related to temporary enforcement of the Long Beach Health Orders regarding COVID 19 and declaring the urgency thereof. Read the first time and over to the next regular meeting of the City Council for final reading wide.'",
        "'speaker_1': 'This item will require two votes.'",
        "'speaker_2': 'There's a motion in the second adjourning public comment.'",
        "'speaker_1': 'There's no public comment.'",
        "'speaker_2': 'Thread with to vote on. This was the first one in motion. And a second please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Okay. We'll queue up the second vote, please.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. I believe that with all the items on the agenda. So for new business. Is that correct, madame? Quick.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Is there any in your business, please? And super.'",
        "'speaker_5': 'Thank you. Eric Garcia. I'd just like to remind fourth district residents that we have the fourth District redistricting meeting tomorrow night, August 18th at 6:30 p.m.. The location will be Browning High School and that is at 2180 Obispo Avenue.'"
    ]
}