{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, consider a third-party appeal (APL18-002) from James Richardson; accept Categorical Exemption (CE18-079); and, uphold the Planning Commissions decision to approve a Conditional Use Permit (CUP18-006) for childcare services, health and wellness programming, and a 1,760 square-foot outdoor play area at an existing church at 2325 East 3rd Street, in the Single-Family Residential District (R-1-N) Zone.  (District 2)": [
        "'speaker_1': 'Okay. We have two hearings, hearing item number one.'",
        "'speaker_3': 'Report from Development Services recommendation to receive supporting documentation into the record. To conclude a public hearing, consider a third party appeal from James Richardson. Accept categorical exemption.'",
        "'speaker_2': 'And uphold the Planning Commission's decision to approve the conditional use permit for child care services, health and wellness programing, and a.'",
        "'speaker_3': '1760 square foot outdoor play area at an existing church at 2325 East Third Street in a single.'",
        "'speaker_2': 'Family residential district zoned.'",
        "'speaker_3': 'District.'",
        "'speaker_1': 'Two. Thank you. We have a motion and a second counsel appears.'",
        "'speaker_5': 'Yes. I'd like to hear a staff report on this first and then go to public comment and then I'll have a couple of questions.'",
        "'speaker_3': 'Thank you. And for the clerk, I believe an oath is required on this one.'",
        "'speaker_6': 'Yes. Those.'",
        "'speaker_2': 'Those of you.'",
        "'speaker_3': 'Wishing to testify. Please stand and raise your right hand. You and each.'",
        "'speaker_2': 'Of you to solemnly state that the testimony you may give in the course now in pending before you, this body shall be the truth, the whole truth, and nothing but the truth, so help you.'",
        "'speaker_3': 'God. Thank you, Mr. Mayor. Members of the city council. We will have a staff report from Carrie Tai, our current planning officer.'",
        "'speaker_5': 'Good evening. Mayor Garcia and members of the city council. Before you tonight is a public hearing for the appeal of the Planning Commission's approval of a conditional use permit to allow for the YMCA to host childcare services and a health and wellness center at the existing Grace Methodist Church, located at 2325 East Third Street.'",
        "'speaker_5': 'Just for clarification, the applicant has stated that the appeal solely relates to the health and wellness component of the conditional use permit. The project site is located at the northeast corner of Junipero Avenue and Third Street and the R-1 and Single Family District there.'",
        "'speaker_5': 'The church does have an off site parking lot across the street and it's also zoned residential. The area is characterized as a well-established residential neighborhood. There are residential, multi and single families surrounding the property. At the site is in the Carroll Park Historic District.'",
        "'speaker_5': 'There are some well, there's an aerial area. There are some photographs on the screen. But just to show you the building, the round portion on the upper left hand corner is the rotunda, and that is the primary assembly area of the church.'",
        "'speaker_5': 'This church was rebuilt in 1965 after some fire damage, but really the building depicted on the right dates back to 1921. And it's actually the lower level of that building shown on the right, which is where the health and wellness component will be, will be hosted.'",
        "'speaker_5': 'And then the photograph on the bottom shows the parking lot that I referred to that is across the street. So the child care services would be provided Monday through Friday, 6:30 a.m. to 6:30 p.m., and the health and wellness program would be offered 6:30 a.m. to 9 p.m..'",
        "'speaker_5': 'And it's important to note that neither of these would be offered during church assembly purposes in order to render the parking to be available. And just to talk a little bit about the health and wellness programing, so on the screen, the arrow shows the room at the back that was depicted in the photograph, but it's a 1470'",
        "'speaker_5': 'square foot room that where the health and wellness program would be hosted and it's sports clinics, fitness equipment, certain group classes. I liken the size of that room to some of you have stayed in hotels that have a fitness center that's fairly small that's for the guests use and it's roughly about that size.'",
        "'speaker_5': 'Just to also inform the council, there are some play areas that would be provided as part of the child care. Those are not in the health and wellness room. They would be partly inside, inside, as well as partly outside.'",
        "'speaker_5': 'And then lastly, to talk about the parking a little bit, there are 58 parking stalls between the on and the offsite lots. The church does own both lots. The child care and wellness programing combined only requires 22 parking spaces, but nonetheless they would not be offering those services during church use.'",
        "'speaker_5': 'So the Planning Commission did conduct a public hearing on this on June 21st and voted to approve the item. The appellant filed the appeal. Within the ten day appeal period, appeals are conducted as public hearings and require noticing in response to the noticing for this City Council public hearing item staff received a four emails and and which'",
        "'speaker_5': 'of which three were in opposition, one in support, and also one phone call in opposition with that staff recommends that the City Council deny the appeal and uphold the Planning Commission's decision to approve this conditional use permit as the proposal meets the city's requirements for parking as well as land use.'",
        "'speaker_5': 'And in accordance with the findings that the Planning Commission met for the conditional use permit, the appellant and the applicant are here in the chambers tonight at this concludes staff's presentation, and we are here to answer any questions.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you very much. So we have mixed up the applicant and then the appellant, and then the applicant gets a rebuttal. So if the applicant can please come forward. And while you certainly don't have to use all 10 minutes, you get 10 minutes.'",
        "'speaker_1': 'And Mr.. Mr. Mason, the applicant in this case is actually.'",
        "'speaker_3': 'Los Altos YMCA.'",
        "'speaker_1': 'Yeah. Okay. So please come forward. The YMCA is the applicant.'",
        "'speaker_4': 'They come first.'",
        "'speaker_6': 'Okay.'",
        "'speaker_1': 'So the applicant is the YMCA.'",
        "'speaker_2': 'Oh, sorry.'",
        "'speaker_6': 'Okay.'",
        "'speaker_5': 'Thank you. On Ramallah city council and city staff. Thank you for having us this evening. I'm Brandy Claudio. I'm the executive director of the Los Altos Family, YMCA co applicant with Grace United Methodist Church. I am also a local resident living two blocks from Grace, so have a personal understanding of any concerns about this conditional use permit'",
        "'speaker_5': 'that have been raised by neighbors. Thank you for your time reviewing our project. Our Los Altos Y is very excited about this partnership with Grace, which brings together two community serving organizations in order to provide needed programs and services.'",
        "'speaker_5': 'Additionally, we have worked in partnership with Councilwoman Janine Pearce's office in developing this plan to address voids in the neighborhood. And I would like to point out nearly 30 letters of support included in your packet. Note that this conditional use permit was approved by the Planning Commission with a40 vote, as well as acknowledge the supporters we have'",
        "'speaker_5': 'present this evening from the Y and grace. If you want to work with their scattered around, we are really excited about this. Over a year ago, Grace identified some community needs that they had the building infrastructure but not the human infrastructure to address.'",
        "'speaker_5': 'And a partnership with our Y enables us to most effectively address these community needs. This project addresses both the need for affordable child care and youth recreation programing, as well as health and wellness fitness programing for all ages.'",
        "'speaker_5': 'Because this appeal is only challenging the health and wellness fitness portion of this project. I will focus my comments on that. The CDC tells us that chronic diseases are responsible for seven of ten deaths each year and that physical activity helps prevent chronic disease.'",
        "'speaker_5': 'According to the American Heart Association, children with increased physical activity are more alert, confident and focused in school. Rates of severe childhood obesity have tripled in the last 25 years. This is a critical social issue. That is why this Council adopted the Healthy Communities Policy in 2014.'",
        "'speaker_5': 'Approval of this conditional use permit will help us to address chronic disease in the Long Beach community with minimal fitness facilities and none that serve the entire family. If you went to our Y this evening, you would see an eight year old running on the treadmill next to his parent and you would see a family taking a'",
        "'speaker_5': 'group exercise class together. Our goal is to build and strengthen families in spirit, mind and body by providing opportunities to be healthy and spend quality time together. I would like to make special note that this project requires zero construction.'",
        "'speaker_5': 'We are simply reactivating a building to the original intent. It was built to serve the community. We have made numerous considerations in respect to neighboring residents, primarily related to noise and parking. The fitness portion of this proposal is 1500 square feet of space intended to target residents within a mile radius who can walk and bike to our'",
        "'speaker_5': 'health and wellness center. Although Grace meets exceeds actually city parking requirements for these uses included in this copy, we have also taken additional steps to encourage biking and walking through the approval of a new bike rack and bike share hub.'",
        "'speaker_5': 'We are just waiting for installation. I thank you in advance for your support of this collaboration, which addresses well known and well documented community needs, and I will be available to answer questions.'",
        "'speaker_1': 'Thank you so much. Now about that, Mr. Richardson, who is the appellant?'",
        "'speaker_6': 'Well.'",
        "'speaker_1': 'He's again.'",
        "'speaker_6': 'My friend.'",
        "'speaker_2': 'I have no objection to the daycare center. The problem we face a problem I face. I live on Lumina Drive, which is a little L-shaped narrow street that runs right off of the church entrance and around the church does have a huge parking lot, but you have to cross two streets to get to it.'",
        "'speaker_2': 'Louis The drive is right at the church entrance. You just walk across one street or parking is already a critical problem. It has been for for a long, long time. Just last week, I had to have a car ticketed who parked across my driveway.'",
        "'speaker_2': 'And a few months ago, one of the women who lived in our neighborhood had to park several blocks away in order to well, she had to park several blocks away and she was assaulted. This is the problem's not bad during the day because people go to work.'",
        "'speaker_2': 'Most of the people on the street work. So the parking is fine. But from about 5:00 on. The problem we have is there are five restaurants right around the corner. There's hard drive. A star of Siam Chan's Park Pantry and fat tomato pizza chains is the only one that has parking off street parking.'",
        "'speaker_2': 'Also on our street there, ten units, you see. We talk about when the church was built. It was built in the twenties. In the twenties. There was a trolley that ran along Third Street. I've lived here since the forties and I can tell you my mother and I took busses and trolleys places, so it was built at'",
        "'speaker_2': 'a time when there was nothing like the kind of traffic or parking problems that we have today. No. Yes. People, they have adequate parking. But what is to prevent them if they see a spot on the way to drive it?'",
        "'speaker_2': 'It's public. On street parking. What's to prevent them from parking on our street to go to their fitness center? And it's perfectly legal. Anyone can take the parking first. Come, first serve. We already have a major problem, a huge problem on the way in to drive.'",
        "'speaker_2': 'And this fitness center will just exacerbate that. I think it was due consideration given to this major problem when these permits were allowed. That's really all I have to say.'",
        "'speaker_1': 'Thank you very much. The applicant gets 3 minutes if you want to have a rebuttal. If not. Nope. Actually, there's only one you can speak to in public comment if you'd like, sir. But Mr. Richardson is actually the appellant.'",
        "'speaker_1': 'Thank you. Does the does the applicant want a rebuttal or. No? Okay. You get 3 minutes if you'd like one.'",
        "'speaker_5': 'Just 3 seconds that I would just encourage everyone to refer to the conditions in regards to the conditions that were made regarding parking and the accommodations that we would made and that we have more than sufficient parking on church grounds.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Okay. And with that, there is public comments. Sir, if you wanted to speak, you can you can do it now.'",
        "'speaker_2': 'Mayor Garcia, members of the City Council. My name is Elliott Boone. I've lived in Carroll Park since 1972. My only concern with the fitness center is its applica its the ability.'",
        "'speaker_3': 'Of it to exist in accordance with the city code for.'",
        "'speaker_2': 'Zoning.'",
        "'speaker_3': 'I have looked extensively through the city code and find no permission for a fitness center to exist in an R one end zone. To do so without a public hearing would violate the essence of.'",
        "'speaker_2': 'The.'",
        "'speaker_1': 'Long Beach.'",
        "'speaker_3': 'City Code. That's all I have to say. Thank you.'",
        "'speaker_1': 'Thank you. Seeing no other public comment on this hearing there is please come down. And if you if you have a comment for this hearing, you need to please be in line.'",
        "'speaker_4': 'Thank you, counsel. Mayor. My name is Thomas Daniel. I live in three, three, two, one, two. Pair right up the street from the church and now our neighborhood. Welcome the child care center. We were real happy about that.'",
        "'speaker_4': 'But the fitness center is a commercial endeavor and that endeavor belongs into a commercial zone because of the parking issues and everything else. And there's plenty of fitness around Bixby Parks down the street. There's a bike path, there's a pedestrian path, there's a gym on seventh and one apparel.'",
        "'speaker_4': 'There's numerous gyms in town. And I know the person that brought this up said there there's somebody on a bicycle in their gym now and a child next to them, but they're in a commercial zone.'",
        "'speaker_3': 'They're probably on Bellflower Boulevard. There's a lot of.'",
        "'speaker_4': 'Gyms in town, so I just appeal to you. This does not belong in a residential zone. It belongs in a commercial zone.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, city leaders. My name is Pastor Christopher Wiles and I am the pastor at Grace United Methodist Church. I am also happy to say that last month I was sworn in as Long Beach's new police chaplain. So I'm here to serve the community and our churches here for the community itself.'",
        "'speaker_3': 'This trophy is from 1927, as far back as our records that I can tell, in 1918, the YMCA was in partnership with Grace United Methodist Church. Now, I may not look like I was around then, but I have really good doctors who keep me up well.'",
        "'speaker_3': 'This is a partnership that has been there for a long time. Grace United Methodist Church is in the business of saving lives and taking care of the community, as is the YMCA. And actually listening to your budget proposal this evening, I find that I'm very impressed that it seems like the budget has a lot of items for'",
        "'speaker_3': 'that too as well. I would like to say that this is going to go forward as you guys seem fit. That's not the issue now. The issue for me today becomes what can we do to support the city with that budget, to make sure that we take care of our community?'",
        "'speaker_3': 'One thing I would like to hear from the council is how we're going to take care of prevention. The YMCA is here for prevention, for wellness, so that they don't end up in the hospital. We have so many families in our community that are one paycheck away from homelessness.'",
        "'speaker_3': 'I'd like to see us focus on prevention like we at Grace and the YMCA does as well, preventing people from becoming homeless before they get to that place. And as you go back and you think about your budgets and you pray about your community, please make sure that we put some of those dollars into prevention.'",
        "'speaker_3': 'And you can call me at Grace United Methodist Church. You can call the YMCA, you can call any of these people standing here in line. And we will be there for you. Thank you.'",
        "'speaker_1': 'Thank you so much. Makes me complete.'",
        "'speaker_2': 'Good afternoon, everyone. My name is Cole McDaniel. I'm the childcare. Get this thing of child care camp director at the last. Thank you. Whoever is doing this. Thank you. I'm the child care camp director at the Los Altos Family YMCA.'",
        "'speaker_2': 'I'm reading this on behalf of one of our board members. His name is John Rockmore, due to the delay and fortunately had to go home. So this is these are John's words. My name is John Rockmore. Long Beach has been my home for more than 30 years, and I currently live in the neighborhood of Grace United Methodist'",
        "'speaker_2': 'Church. As a father of a seven year old boy, I've always been involved in our wonderful community, especially as it relates to programs and services for youth. I'm a member of the Los Altos YMCA Board of Managers and an active member of the Belmont Heights United Methodist Church, which is a sister church to grace and located at'",
        "'speaker_2': '317 terminal here in Long Beach. In fact, I'm a chair of the Board of Trustees, which oversees the health and well-being of our preschool and daycare programs at Belmont Heights UMC. So I have firsthand knowledge and experience with how needed these programs and services are in this area.'",
        "'speaker_2': 'I also coached high school football at Millikan High. In fact, we had a great group of my players this past Saturday at Grace United Methodist for a work project, and it will be back this Saturday. And in addition, as a neighborhood resident, the portion of this project that includes health and wellness fitness options is exciting and needed'",
        "'speaker_2': 'in this community. While there are many where while there are some small gyms around, nothing serves the entire family. I'm looking forward to utilizing these facilities with my wife and son, so together we can focus on our health and wellness.'",
        "'speaker_2': 'The conditions of approval for this permit are more than fair to our neighbors. This will be an incredible asset to the community. And I ask for your approval of this project tonight. Thank you.'",
        "'speaker_4': 'Thank you. Next, bigger. I have to lower this because he's a lot taller than I am.'",
        "'speaker_3': 'Hello, Mayor. Hello, City Council. City staff. My name is Damon Cole Lucca, and my family and I have lived in Long Beach since 1987. And I'd like you to know that I'm one of the people.'",
        "'speaker_4': 'That's excited about having some wellness programs in my neighborhood. I live about a mile away on Roswell Avenue and look forward to walking.'",
        "'speaker_3': 'Over and taking advantage of the wellness programs the YMCA strives to.'",
        "'speaker_4': 'To strengthen communities by nurturing children.'",
        "'speaker_3': 'Improving the health of families and seniors, and connecting neighbors. I think this is something that we could use more of. This partnership with Christ Church will bring badly needed chronic disease prevention programs that will combat the rise of Type two diabetes, support people living with cancer, help seniors achieve longer, more independent lives, and partner with families to'",
        "'speaker_3': 'help keep them healthy and active. This partnership will help. This will help neighborhood families connect, thrive and grow.'",
        "'speaker_4': 'And I implore you to approve.'",
        "'speaker_3': 'This or uphold the council's or what's the Planning Commission? There you go. Thank you. The Planning Commission's decision. Thank you.'",
        "'speaker_4': 'Thank you. Next week, you.'",
        "'speaker_6': 'Hello. My name is Alan Rivera. I'm going into my senior year of high school and I actually live on Junior Bro in the neighborhood of Grace Church and I am also a participant in the YMCA Y Team Leader Program and Youth and Government Program.'",
        "'speaker_6': 'And I also utilize the health and wellness facilities at the Los Altos YMCA and actually serve my youth in government. Delegates and advisors are here in support of the conditional use permit. I used to attend an elementary school that the YMCA will be servicing through this partnership.'",
        "'speaker_6': 'And while I was a student at Horace Mann, I used to be in rap, an after school program and by the school, while I had the privilege of attending rap after school. MANN Now and other schools in the neighborhood are now in need of additional providers, and the Y is here to serve.'",
        "'speaker_6': 'As I mentioned, I have firsthand experience of how the way I provide services towards youth and families. As a current program participant myself, the youth of today is the future of tomorrow. I believe this is how the staff at the Los Altos YMCA teach the youth there, which includes opportunities for health and wellness and activity for youth'",
        "'speaker_6': 'and families, are designed to better and strengthen the community. I couldn't be more excited about the opportunity of a YMCA fitness facility close enough to my home that I can walk to thank you for your time and careful consideration of this exciting partnership.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you. Next Speaker.'",
        "'speaker_7': 'Good evening. My name is Marquis Richardson. I'm also.'",
        "'speaker_8': 'A resident in the.'",
        "'speaker_5': 'Neighborhood for the proposal for the YMCA. I just wanted to say a couple of things. I know the focus is on the health and wellness side of it, but being of course a mother, the childcare portion, as you just mentioned, my daughter does attend Burbank Elementary, which is right down the road.'",
        "'speaker_5': 'They do offer the rep program. But again, additional after and before care programs are needed. In addition to the health and wellness, I am one of those mothers that will have the eight year old. She's sitting up there on the treadmill with me being an expectant parent.'",
        "'speaker_5': 'It is expected that we do exercise. A lot of times being outside in the heat is not conducive to, you know, the condition that we're in. So having something that's in the neighborhood that we can get to easily, that's accessible, that does also cater to the community, which is my whole family that will offer programs that are'",
        "'speaker_5': 'needed for the youth. I just want to also mention the parking portion of it. Obviously living in the area, I know there can be an issue with the parking, but also, you know, there are like I said, as you can see, that there are options for parking for those who are going to be attending the the YMCA'",
        "'speaker_5': 'program. So I just want to implore you guys that we will need this program for you guys to upload up, uphold the approval so that we can have those things that are needed in the community, because the YMCA is about that.'",
        "'speaker_5': 'The city needs those things in order for us to be able to progress into the future.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_4': 'To our next speaker.'",
        "'speaker_6': 'Now lead me.'",
        "'speaker_3': 'Good evening, council members. My name is Rocky Howard. My address is 2325 East Third Street. I want to talk about that health and wellness part of this as my my family, we are a very active family. We like to ride bikes.'",
        "'speaker_3': 'We like to walk. We like to stay fit. My 14 year old son is a basketball player. He works out currently at the YMCA in Los Altos. That's about maybe a ten minute drive for us right now. So if we can walk and get our workout on as a family staying fit, that will be a great thing'",
        "'speaker_3': 'for our family and it will make our bond even greater. Also, I am a P.E. instructor at Patrick Henry Elementary School, and seeing that these kids only have P.E. classes once a week and the Long Beach Unified School District is a problem and an issue, I think that the YMCA.'",
        "'speaker_3': 'YMCA is tackling a very big issue in our community. So if your kid is only going to PE once a week, you can always come to the YMCA and get your workout on. Thank you very much.'",
        "'speaker_1': 'Thank you so much. Next speaker, please. And these will be our last two speakers. And then we're taking a vote.'",
        "'speaker_4': 'My name is Francis Burns. I live at 301. Barrow. If anybody's going to be impacted by this, it's going to be me and my wife.'",
        "'speaker_6': 'She's around or somewhere.'",
        "'speaker_4': 'When they showed you the picture of the parking lot, those two cars, that white truck and that little versa were ours. I've lived in Long Beach for 20 years. I lived on third and orange for a long time.'",
        "'speaker_4': 'So I understand what they're talking about when they talk about these parking problems. But the fact of the matter is, just like going to the gym the first time you go to the gym, there's going to be a few growing pains.'",
        "'speaker_4': 'But it's something that needs to happen. This community needs what Grace United Methodist and the YMCA are going to provide. And like I said, my wife and I are going to be the ones that are most impacted by this.'",
        "'speaker_4': 'And it's a small inconvenience to see a place grow where families can be together and be healthy and enjoy a greater community. And I think that the issues that were addressed, I think as the community comes together more, some of those issues are going to go away because as more people become involved in the community, as we'",
        "'speaker_4': 'see more walking, as we see more bicycling, it's going to become safer. Those people who want to pray in our community are not going to want to be around anymore because there are going to be too many people to make that fit for them to have that happen.'",
        "'speaker_4': 'So like I said, I understand the parking situation, but I think that that this is bigger than that. And I think after a while we're going to be able to work it out to where it's not going to be an issue.'",
        "'speaker_4': 'And we have grace and said that they've provided parking for the service and it's a big parking lot and there's going to be room for people. And I understand that people might not want to walk across the street initially, but again, as the community.'",
        "'speaker_4': 'It grows as they understand and become part of the community. I think that's going to change as well.'",
        "'speaker_7': 'I'd also like to say that since we live right there.'",
        "'speaker_1': 'Speak to the mike. Thank you so much. No problem.'",
        "'speaker_7': 'My name is Benny and I live with this guy. And our apartment is right above the proposed project area, the outdoor project area. So I just want to let people know that so many people in the community come up our stairs and ask us about the programs that the church offers.'",
        "'speaker_7': 'And when they find out that the YMCA is there, they're very excited. You know, I can't tell them anything yet, but I would like to tell them that because a lot of people want to do things with people in their community, safe things, healthy things.'",
        "'speaker_7': 'And also we're working on the yard. I'm sure everybody in the community appreciates that and the YMCA is helping us do that. We couldn't do that without their help. And I just want to say that while I'm working in the yard, a lot of people stop me in the yard and ask about services the church offers and'",
        "'speaker_7': 'the YMCA, YMCA offers. So I really hope that the council goes forward with this project. Thank you.'",
        "'speaker_1': 'Thank you so much. That concludes the public hearing and we will take some council action and deliberation. Let me begin with Councilmember Pearce.'",
        "'speaker_5': 'Great. Thank you so much. I want to thank all the staff to work on this. I want to thank the appellants and the YMCA for all of your efforts. I know that this conversation was a lengthy one when it came to planning, and my hope was that when it came today, that we would have some some clarity'",
        "'speaker_5': 'on some issues. So I'm going to ask, even though we have the presentation in front of us, I'm going to ask a couple of questions and then I'm going to ask for some for some support and direction. So the first question for city staff or possibly for the city attorney is the question that was raised by the'",
        "'speaker_5': 'appellant about not allowing a fitness center in the r-1 zone. Can you clarify where that where that is stated and what gives us the ability to do that.'",
        "'speaker_3': 'Mistake and probably give you more details? But basically it is considered.'",
        "'speaker_6': 'To be an accessory use.'",
        "'speaker_3': 'Type use to a church, and churches are allowed to engage in all types of community.'",
        "'speaker_6': 'Based accessory type activities. That's pretty much it. She's shaking her.'",
        "'speaker_5': 'Head. Yes, great. So because it's a church, we're allowed to have the accessory activities. So we are check there. So I know that that was one concern. I do want to highlight that this church I cannot say enough about this church.'",
        "'speaker_5': 'I live in the neighborhood as well, right down the street. And for a decade, this church has been opened up to the community. And if you've ever been in it, the space inside is massive. It's very large. I know a lot of people in this room have been there for the state of the city several years ago'",
        "'speaker_5': ', and it is a space that really is deserving of some TLC and allowing the community to come in and not only have a child care center, but a fitness center in an area that we do have a desert.'",
        "'speaker_5': 'Right. I have a six year old daughter. I know how hard it is to find child care after school programs are still really difficult. And so I'm happy today that the conversation was more around the fitness center and understanding that it is allowed.'",
        "'speaker_5': 'But the other question is around parking. And so I do see that it is parked to code. I did have an opportunity to meet with the two gentlemen here that live in Carroll Park. So I did want to ask city staff, probably Mr. Beck, if he could walk through with us now that we know that it's parked'",
        "'speaker_5': 'accordingly, if he could walk through for us the process to do a residential parking permit, just so we can understand as we move forward after today, what that would look like for Carroll Park, which is largely parking impacted as well as Alameda Street.'",
        "'speaker_4': 'Yes. Councilmember Pearce. Thank you for the question. Mm hmm. Basically, the city does provide preferential parking districts where residents within that district can apply for that designation and receive basically a parking permit to park within that restricted zone.'",
        "'speaker_4': 'And there is a formal process that we go through ultimately that would come to council for approval and and designation for that zone. And it would it would go into effect that way. What we look at when we review applications are how many vehicles are parking in the area from outside that neighborhood.'",
        "'speaker_4': 'We work with the residents to define exactly what that area would be, what streets would be included, and then we would move forward with the analysis and the formal adoption.'",
        "'speaker_5': 'And can you give us a typical timeline, like if you guys started working with them? I know we're in budget right now, but if if you started next month, what a timeline might look like.'",
        "'speaker_4': 'Well, again, if we have support from the community and active participation, we would go through that initial screening that would take anywhere from 30 to 60 days. That would conclude if we met those requirements with a survey that would be distributed to all those homes impacted.'",
        "'speaker_4': 'And we would have to get that information back, prepare the staff report and then bring it to council. So you're looking at some on 120 plus day range to get something like that done. And that's that's on the fast side.'",
        "'speaker_5': 'Great. Thank you so much. So I'm really excited about this. We've been working with the YMCA for a while. I think the fact that we have our question around, is it allowed answered? Yes, it's allowed to. Is it adequately park?'",
        "'speaker_5': 'Yes, it's adequately parked. Does that not still mean that there are people that could park in the neighborhood and that that might be an impact? Yes, but today is not today to make action on that. So I'm going to ask staff to begin working with Carroll Park right away, to start going through that process of having a'",
        "'speaker_5': 'residential preferential parking. And we know that it's not a guarantee it's going to happen because we've got to survey the neighborhood, but that we are going to do our very best to make that happen for that community, because I know how how difficult it is.'",
        "'speaker_5': 'So with that, I urge my colleagues just to deny the appeal and to move forward with bringing YMCA, childcare services, programing and fitness center to the heart of Alamitos Beach.'",
        "'speaker_1': 'Thank you, Councilwoman Pryce.'",
        "'speaker_7': 'I support Councilmember Pearce's motion and appreciate the great work that the YMCA does locally, regionally, and especially in districts two, three and four. And I hope that there is some opportunities to resolve some of the concerns and impacts through some sort of mitigated option.'",
        "'speaker_7': 'So thank you very much.'",
        "'speaker_1': 'Thank you, Councilwoman Mingo.'",
        "'speaker_5': 'I wanted to thank our youth in government, young adults for coming out and being a part of the process. I think that's really important. Many know that in addition to the Pastors Alliance citywide, we have a fifth District pastors group and the consistent thing that comes up year after year is the concern and need for additional child'",
        "'speaker_5': 'care in our city. And so any organizations that are willing to work with the community to find options for those things are strongly encouraged. And as long as they can adopt to and be in alignment with the neighbors, which it sounds like a lot of the neighbors are very supportive.'",
        "'speaker_5': 'It sounds like the city is moving in the right direction because child care is a really important need. So I appreciate everyone who spoke on both sides of the issue tonight. And thank you for all of those who compromised to come up with solutions.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. And with that, we will take a vote on the hearing.'",
        "'speaker_8': 'Motion carries unanimously.'",
        "'speaker_1': 'Thank you. Thank you. Thank you. Those that came out for this, I also I think I missed a presentation. So there actually there is a presentation tonight. And I want to turn this over to Councilwoman Gonzales for that.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing to consider the re-establishment of the Uptown Property and Business Improvement District (UPBID); direct the City Clerk to tabulate the ballots and report the results of the tabulation to the Mayor and City Council during the August 7, 2018 meeting; and, if a majority of ballots received are in favor of the establishment of the UPBID, adopt resolution to re-establish the UPBID for a term of ten years, effective January 1, 2019 through December 31, 2028.  (Districts 8,9)": [
        "'speaker_1': 'Thank you very much. Let's give them a round of applause. Okay. And we have I know we we still have one more hearing. And then the first item on the agenda is the hotel item. So the second hearing, if we can, please have the clerk read the hearing.'",
        "'speaker_8': 'Report from Economic Development Recommendation to receive supporting documentation under the record. Conclude the public hearing to consider the reestablishment of the Uptown Property and Business Improvement District. Direct the City Clerk to tabulate the ballots and report the results of the tabulation to the Mayor and City Council.'",
        "'speaker_8': 'And if a majority of ballots received are in favor of the establishment of the U.P. bid, adopt a resolution to reestablish the U.P. bid for a term of ten years District eight and nine.'",
        "'speaker_1': 'Thank you, Mr. Modica. We don't need a growth rate for this.'",
        "'speaker_7': 'We do need it.'",
        "'speaker_1': 'We do need enough. So can we. Madam Clerk, we do the math.'",
        "'speaker_8': 'So anybody who will be a witness, please stand and raise your right hand. Do you, in each of you, solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you, Mr. Modica.'",
        "'speaker_3': 'Thank you, Mr. Mayor. We will have a staff presentation from Eric Romero, our project manager for Economic Development. Good evening. The members of the City Council, property owners of record located in the Uptown Pivot area who will pay more than 50% of the proposed assessment, have submitted petitions to the city for the reestablishment of the Uptown Pivot'",
        "'speaker_3': '. The Uptown Pivot Management District Plan details the boundaries of the Uptown Pivot. The method of assessment for each parcel and the improvements and activities for which assessment funds will be used. The assessment methodology will generate approximately 177 $356 in revenue for the Uptown Peabody during its first year.'",
        "'speaker_3': 'If reestablished, the Uptown period will exist for a ten year period between January 2019 and December 2028, and the City Council will annually review and consider approving the renewal of the levy. Budgets and reports submitted by the Association managing the Uptown Pivot as approved by City Council Action on June 12, 2018.'",
        "'speaker_3': 'A notice of assessment and an assessment ballot were mailed to property owners who are proposed to be assessed. Ballots are weighted by assessment amounts. At the conclusion of this public hearing, the city will tabulate the votes and will return to the City Council later during the August seven, 2018 meeting to announce the results.'",
        "'speaker_3': 'If there is not a majority protest from property owners, the City Council may adopt resolution reestablishing the uptown period. If the uptown pivot is reestablished, the Uptown Property and Community Association will continue to manage the Uptown Pivot and shall serve as a owners association.'",
        "'speaker_3': 'That concludes my staff report.'",
        "'speaker_1': 'Thank you. We're going to go ahead and do public comment on this hearing. Is there any public comment on the hearing? Please come forward. I'm wondering, Miss Webber, should I have the ballots be delivered first to the clerk, or should we do the here?'",
        "'speaker_7': 'The ballots can be delivered to you up to the close of the public hearing.'",
        "'speaker_6': 'Okay.'",
        "'speaker_7': 'Whenever it's.'",
        "'speaker_1': 'Convenient. Okay. So as we begin the public comment before the ballots can please be delivered to the clerk. That would be great. Please continue.'",
        "'speaker_0': 'Good evening. My name is Larry DeJesus and I, along with Mr. Bruce Stewart on the property at 1000 and 1030 Artesia.'",
        "'speaker_2': 'During the past five years, we've paid about $10,000 in property taxes. Five years ago.'",
        "'speaker_0': '73% of the property owners voted against the establishment of the period that it was passed because the city and school district properties represent more than 85% of the yes vote. What I didn't know at the time.'",
        "'speaker_2': 'Was that those owners.'",
        "'speaker_0': 'East of Orange, 600 feet away, got to opt out. I was not given the opportunity.'",
        "'speaker_2': 'To opt out. Last December.'",
        "'speaker_0': 'Laura dowd completed an audit. She found that the city did not pay its bid tax for 2016. $58,000 was not paid.'",
        "'speaker_2': 'What the management.'",
        "'speaker_0': 'Of our people was doing. I don't know the reestablishment of the pyramid. This time will take.'",
        "'speaker_2': '$22,000.'",
        "'speaker_0': 'From us. One of our buildings needs.'",
        "'speaker_2': 'A new roof.'",
        "'speaker_0': 'That 22,000 could pay for the roof. I think the city needs to reexamine the composition of the building. I think the city should think about let us opt out. That is my request. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Honorable mayor. City council members. Thank you. That's appropriate. I just briefly wanted to state that I am greatly honored to have been working with Councilmember Rex Richardson and Ally Austin in the formation of this business improvement district. And before I came to work for the city, I'm now retired.'",
        "'speaker_3': 'This is way past my bedtime. Just so you know, I was a stockbroker and my mentor said to me, and this is a note for any potential investors in Uptown. He said, Jimmy, what you want to do, you want to be on the beach with your oars in the sand waiting for the tide to come in because'",
        "'speaker_3': 'things are happening uptown. And I tell you, it's going to be well, like Rick said back then, renaissance things are really happening and it's going to be a great place to live, work and play. So I'm pretty proud of this.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_2': 'Good afternoon, Mr. Mayor. City council members, members of the community, my fellow colleagues and friends, thank you for this opportunity to speak on behalf of the Uptown Business Improvement District. My name is Portia Darvish, and I'm a real estate owner in the city of Long Beach with properties in the Bixby Knolls and North Long Beach submarkets.'",
        "'speaker_2': 'I'm also a board member of the Uptown Business Improvement District, a commercial real estate broker by trade, and an involved community member by choice. Prior to being a board member of the Business Improvement District, I thought this organization, Soul Charter, was to organize weekly happy hours and chili cook offs, although other bids in other cities may do'",
        "'speaker_2': 'that. Certainly this is not the agenda for North Long Beach, led by our executive director, Tasha Hunter. The North Long Beach bid works effortlessly to solve real life problems for members of our community. Spend a day with Tasha Hunter at her office in the heart of North Long Beach, and you'll feel an ounce of the sheer weight'",
        "'speaker_2': 'she carries on her shoulders daily. Her days are filled, taking calls from real life citizens that rely on the bid and her leadership to keep them afloat. Like the El Salvadorian bakery owner that has no idea how to obtain a permit for their business.'",
        "'speaker_2': 'They come to Tasha because they know she'll take the time to drive them to the city, help them fill out the necessary applications in Spanish to get their permits. Or like the local merchant that calls Tasha before they call the police department to deal with a crime being committed near their store.'",
        "'speaker_2': 'Knowing she'll know what to do, spend a day with her and you'll hear her voice speaking to several private nonprofit companies she employs to keep North Long Beach clean. Picking up thousands of pounds of trash along the Atlantic and Artesia corridors on a weekly basis.'",
        "'speaker_2': 'Or hear her meeting with the private security company, reporting the weekly crime report and discussing ways they can collectively keep crime down within the city. And yes, spend a day with her. And you hear her promoting the local retailers and restaurants and the occasional chili cook off in our community.'",
        "'speaker_2': 'I can go on and on about the different ways she makes a difference in the lives of the local property owners, merchants and residents of North Long Beach. She is, in essence, a friendly face to go to go to when there's no one else to go to.'",
        "'speaker_2': 'So in other words, Tasha Hunter and the Business Improvement District, for lack of a better analogy, is somewhat a city within the city. We are the Planning Department, the Economic Development Police Department, Waste Management and and Waste Management at the local level.'",
        "'speaker_2': 'Although our first priority are the members of our district, we strive to make sure members of our community are abiding by city ordinances and following the rules of this Council puts forth. With that said, the Business Improvement District is the meeting place in which Tasha and the rest of the board members discuss and execute this noble agenda'",
        "'speaker_2': '. That is our responsibility. The board is a forum where property owners, residents, business owners, city representatives, law enforcement, council members, private businesses, developers, and anyone else that wants a voice in our community can send a message. Each board member spends time out of their day, week and month helping to build without compensation, I should add, because we'",
        "'speaker_2': 'all believe in the cause. Allow me to convey to you.'",
        "'speaker_1': 'Thank you so much. It's correct the time.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_3': 'Tom Carpenter with Frontier Real Estate Investments. Good evening, Honorable Mayor City Council. I wish I could just echo what Pasha just said and give him my time. He was on a good roll there, but I just wanted to say we're developing the property at Atlantic and Artesia, our Uptown Commons project.'",
        "'speaker_3': 'We're making a sizable financial investment into our project. And ultimately, you know, we feel the area and that's because we believe in what's going on in the area spearheaded by Councilmember Richardson. And like like Porsha was saying, this bid does so many different positive things for the area.'",
        "'speaker_3': 'What Portia is able to accomplish out of her office in the district is is a huge win for the entire area. So as somebody who is making a sizable investment looks at this from a very long term view, we're all for the bid.'",
        "'speaker_3': 'We're really excited. We're appreciative to everybody who has put in time to make this happen. And thank you to Tosha for all she does. And thank you for your consideration of this. I think it's a total win for the area and we're excited about it.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_1': 'Thank you very much. Next speaker.'",
        "'speaker_3': 'Good evening, everyone. My name is Mike. I'm a ninth district resident for 15 years now. A year ago, I had no idea what a bid was, didn't know what a business improvement district did. But in traveling the you know, the district up and down Atlantic Avenue for as long as I have, I noticed things changing and I'",
        "'speaker_3': 'was curious. And so I found out and knocked on his door one time in her office and got to know her and had the unique couple of unique experiences of actually like canvasing the streets with her and visiting her, her business owners, inviting them out to I think it was a roundtable breakfast meeting of some sort.'",
        "'speaker_3': 'But we had it was very encouraging to see the response. She got just the warm welcome she got from all the people that we went to see. It was like an old relative had entered the building. So it was I just knew that she was, you know, a friend to them to to all of us.'",
        "'speaker_3': 'And the work that's being done was well appreciated. So this month, I take.'",
        "'speaker_1': 'Thanks so much, Mike. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mayor. Vice Mayor, City Council, city staff. I'm Tasha Hunter. And I didn't expect to get emotional.'",
        "'speaker_3': 'But I get.'",
        "'speaker_6': 'Emotional.'",
        "'speaker_5': 'This right here and I always go off book when I come here. So thank you all for all the work. This is not just the work that I've done. This is the work of community members, of the property owners that are willing to talk and listen.'",
        "'speaker_5': 'The business owners, all of which I walk that bed every single last day to get to know my business owners. This is something that I had a great job before at Lumby City College, and when this opportunity to came, came up, I knew it was for me the flexibility and the engagement to put all my talents to'",
        "'speaker_5': 'work. I just want to say that Councilman Austin, when I first moved to Long Beach, I'm not always.'",
        "'speaker_3': 'I have not.'",
        "'speaker_5': 'Always lived in Long Beach, but when I first came to Long Beach, getting my first leadership opportunity, working with Long Beach camp and from there and has introduced me to a lot of things from there I'm very appreciative.'",
        "'speaker_5': 'But this is about our property owners and I just have to say that I'm so thankful to all the property owners that.'",
        "'speaker_3': 'Have invested in North Long.'",
        "'speaker_5': 'Beach a long time ago. I get those calls from people that have owned.'",
        "'speaker_3': 'Property.'",
        "'speaker_5': 'For, you know, the early twenties and for all of the property owners, a couple of which have spoken today that see the potential, see the culture, see the possibilities, the potential, see the vision of where our city is going and choose to.'",
        "'speaker_3': 'Invest in North.'",
        "'speaker_5': 'Beach and appreciative.'",
        "'speaker_3': 'And I'm hoping that all the hard.'",
        "'speaker_5': 'Work and dedication. We'll show in today's results of these tablet the tabulation of ballots. Like I said, I went off book. I've been in this job for two years, five months, six days and 7.'",
        "'speaker_6': 'Hours feels like although.'",
        "'speaker_5': 'I was out there for the implementation or the building of the bid. But there are a lot of.'",
        "'speaker_6': 'People that help put this.'",
        "'speaker_5': 'Together. Councilman Richardson, who helped spearhead the project and Councilman Austin who calls it.'",
        "'speaker_3': 'They call this their baby. Well, and I've often said.'",
        "'speaker_5': 'I've taken that baby, I've adopted that baby, and I love that baby just the same way the two of you did when you created an engine first. Thank you, Jim.'",
        "'speaker_3': 'First for all the hard.'",
        "'speaker_5': 'Work that you did at the city. Did he leave the all the hard work that you did at the city and continue on to come on board as a consultant for us? I have 40 seconds left. Oh, my goodness gracious.'",
        "'speaker_5': 'At the time. Go. So thank you, counsel. And to Stephen Neal, my board members who have been very dedicated. I have to say a special thank you to COBA Council of Business Associates. They bless you. That is not about you.'",
        "'speaker_5': 'Can I have four more seconds for blessing? There was not a binder about.'",
        "'speaker_3': 'What the bid processes are, but through.'",
        "'speaker_5': 'The through the work of our.'",
        "'speaker_3': 'City auditor like Lord Dowd.'",
        "'speaker_5': 'There's going to be a big binder. My big binder for the policies and procedure.'",
        "'speaker_3': 'Were minor.'",
        "'speaker_6': 'Often.'",
        "'speaker_3': 'From our Midtown.'",
        "'speaker_5': 'Business Improvement District, Blair Cohn from our Bixby, Craig, coach, and all the other people that have come together answered my question for every single department in the city that have answer my question. So thank you all. Thank you.'",
        "'speaker_3': 'And let's say a prayer.'",
        "'speaker_1': 'Thank you. Thank you very much for the comments, everyone that came forward. We're going to go ahead and close public comments and the hearing. And then the matter is paused. I know for ballots to be tabulated. And how long will that take?'",
        "'speaker_1': 'About an hour after we come back to this issue at Apple. We'll come back to this after the next item as we tabulate. And so we will hold this item and hold it to you. Mr. Weber, do we just hold this hearing or do we need to continue to close the hearing?'",
        "'speaker_7': 'Or you can close the hearing and the the madam matter will stay recessed until we return with the tabulation of the ballots. And at that time, it will be appropriate to adopt the resolution or not, depending on the results and counting.'",
        "'speaker_1': 'RICHARDSON And Councilman Austin, do you want to make your comments now or after the ballots?'",
        "'speaker_2': 'I think they've said enough. We can do it after we see the results.'",
        "'speaker_1': 'Okay, great. So then we'll go ahead and conclude the hearing and keep it keep it open until we come back with the results of the balloting. So thank you to everyone that came and spoke. That concludes the hearings and the presentations for the evening.'"
    ],
    "Recommendation to request City Council to receive and file the Letter of Completion for the Hotel Workplace Requirements and Restrictions petition and approve one of three alternative actions, as required by the California Elections Code Section 9215 and the Long Beach City Charter Section 2000:  \t1)\tAdopt the Initiative Ordinance, without alteration, at the  \t\tregular meeting at which the certification of the petition  \t\tis presented, or within 10 days after it is presented; or  \t2)\tSubmit the ordinance, without alteration, to the voters  \t\tpursuant to Section 1405, and adopt resolutions a) and b).  \t\ta)\tAdopt resolution calling for the placement of an initiative  \t\t\tmeasure to amend the Long Beach Municipal Code to  \t\t\tadd Hotel Workplace Requirements and Restrictions,  \t\t\tdirecting the City Attorney to prepare an impartial analysis  \t\t\tof the measure, and providing for the filing of primary and  \t\t\trebuttal arguments and setting rules for the filing of written  \t\t\targuments regarding said measure to be submitted at the  \t\t\tNovember 6, 2018 Special Municipal Electio": [
        "'speaker_1': 'So the first item that will be up is item 28.'",
        "'speaker_8': 'Madam Clerk report from City Clerk recommendation to receive and filed a letter of completion for the Hotel Workplace Requirements and Restrictions petition and approved one of the three alternative actions. One Adopt the initiative ordinance without alteration or to submit the ordinance without alteration to the voters and adopt a resolution calling for the placement of an initiative measure'",
        "'speaker_8': '. Directing the City Attorney to prepare an impartial analysis of the measure and providing for the filing of primary and rebuttal arguments. And setting rules for the filing of written arguments regarding said measure and resolution. Requesting the Board of Supervisors of the County of Los Angeles to authorize and order the consolidation of a citywide special municipal election for'",
        "'speaker_8': 'the placement of Voter Petition Initiative measure with the statewide general election to be held on November six, 2018. Or three. Order Report pursuant to California Election Code.'",
        "'speaker_1': 'Thank you. Madam Court, do you have any any additional information?'",
        "'speaker_8': 'Yes. So on January 25th, the proposed measure was submitted to the Office of the City Clerk relating to improved workplace requirements and restrictions for hotel employees. The filing deadline to submit the petition with a minimum of 27,462 qualifying signatures, was on Tuesday, August 7th, 2018, 180 days after the proponents were provided a ballot title.'",
        "'speaker_8': 'In summary, the petition was filed on May 22nd 103 days of circulation with the Office of the City Clerk, at which time a raw count was conducted. Proponents submitted a total of 46,084 signatures. The city clerk opted to conduct a random draw of 3% of the signatures, as allowed by the California election code.'",
        "'speaker_8': 'The random draw concluded on June 27th, and the results fell within 95 210% validity rate. That meant the petition required a full check of signatures until at least 27,462 signatures were found valid due to the large quantity of signatures.'",
        "'speaker_8': 'The Office of the City Clerk requested the services of the Los Angeles County Registrar Recorder County Clerk on June 28. The L.A. RCC was asked to check signatures until they reached the required number of valid signatures on July 27th.'",
        "'speaker_8': 'The L.A. RCC concluded the signature verification process and notified us that the petition was found successful. The offices of the City Clerk notified proponents as proponents of the results and placed the item on tonight's Agenda for Council's consideration.'",
        "'speaker_8': 'If you have any further questions about the petition process.'",
        "'speaker_1': 'Okay, thank you very much. Obviously the petition item is in front of us with three available options per the city clerk. And so I know that we're going to be going and doing public comment on this item first at the request of a couple council members.'",
        "'speaker_1': 'And so we will open up with public comment. So if you're going to comment, please come forward. And we will be we will be after the first 15 speakers will go down to 2 minutes as has been our practice recently.'",
        "'speaker_1': 'Any objection of the council.'",
        "'speaker_6': 'I think. Okay. I wanted to.'",
        "'speaker_1': 'Please, please be. Get.'",
        "'speaker_2': 'Good evening, Mayor. Council members and staff. My name is John Howard. I am the owner operator of Chick-Fil-A at the Long Beach Town Center and have the pleasure to serve as the chairman of the Long Beach Area Chamber of Commerce.'",
        "'speaker_2': 'I'm here tonight on behalf of the Board of directors and members, which includes our Long Beach Hospitality Alliance. Hospitality Alliance. Long Beach hotels are long time members of the chamber and are committed partners of the city of Long Beach.'",
        "'speaker_2': 'They work hard at being a good neighbor, promoting the city, providing local resident jobs and paying their fair share of taxes. The Hotel Workforce Initiative would punish an industry in our city that has always placed the safety and well-being of their employees and guests as a top priority.'",
        "'speaker_2': 'As you will hear from other speakers tonight, many Long Beach hotels have voluntarily imposed safety regulations like training programs and panic buttons for their staff. These regulations have been in place for some time. A near duplicate of last year's previously rejected ordinance.'",
        "'speaker_2': 'This this initiative would impose unnecessary and arbitrary regulations on an industry that has already voluntarily instated safety regulations and measures of their own. But our concern with this ordinance isn't simply that it is redundant and unnecessary. The economic impact of this initiative could be immense and widespread, with its effects being felt by the business community as a'",
        "'speaker_2': 'whole and the city of Long Beach and its residents. The hotel industry is already heavily regulated by both the state and federal government as the hotel industry is forced to incur an estimated 40% increase in costs to comply with further regulations.'",
        "'speaker_2': 'Room rates will rise and we will see tourism dollars leaving the Long Beach community in search of more competitive markets. This will result in the loss of sales for our businesses who depend on tourism dollars and the loss of tax revenue for the city's general fund.'",
        "'speaker_2': 'Consequently, we will see cuts in funding and jobs loss throughout the community. The bottom line is that the whole community views itself as an integral part of Long Beach. They pay millions of dollars in taxes that help to fund vital resident services, provide jobs, and promote the city as a destination to visit.'",
        "'speaker_2': 'This initiative will cause major damage to an industry that many in our city rely on. Damage done to the hotel industry is damage done to the city of Long Beach itself? On behalf of the Chamber, our Long Beach Hospitality Alliance and businesses in our community, I ask that you call for an economic impact report that will review'",
        "'speaker_2': 'the costs associated with this initiative, as it could be financially devastating to the industry and ultimately the city of Long Beach. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'I'd like to invite everybody who is here tonight in favor of approving this to please stand up all the people who are here for supporting the.'",
        "'speaker_6': 'Housekeepers of Long Beach to please stand with me. Thank you very much. My name is Zoe Nicholson.'",
        "'speaker_5': 'I live in Rose Park. I've been advocating for women and girls for over 50 years. I'm a proud member of the Lumbee Coalition for Good Jobs and Healthy Communities, and I am bursting with pride that I am one of the three proponents of this ordinance.'",
        "'speaker_5': 'First, I want to publicly thank you, Mayor Garcia, in particular, for insisting on female majority in the city commissions. Well done. I am so proud of you.'",
        "'speaker_6': 'I have three rather disparate things to say.'",
        "'speaker_5': 'One is, I'm sure you remember a meeting a year ago when the city council voted 5 to 4 against protecting the housekeepers, when some hotel management bragged about training workers in martial arts. It is ludicrous to suggest that training already burdened workers on delivering a roundhouse kick to a hotel guest that delivers a catcall, a touch, a'",
        "'speaker_5': 'grab, an assault, a rape, and as we heard, possibly tying them up with a vacuum cleaner court. I hope you are familiar with the inspiring work of the art of Ramiro Gomez. I saw his art at the Museum of Latin American Art.'",
        "'speaker_5': 'His paintings.'",
        "'speaker_6': 'Show the.'",
        "'speaker_3': 'Invisible.'",
        "'speaker_5': 'Worker in luxurious.'",
        "'speaker_6': 'Settings like gardens.'",
        "'speaker_5': 'Homes and hotels. The landscaper, the maid, the poor person.'",
        "'speaker_6': 'The cook disappear.'",
        "'speaker_5': 'Into the decadence of their work environment. And as you look along Ocean Boulevard, admiring the towering hotels, let us bring these workers out of invisibility and celebrate them. They are our neighbors, our friends, members of our Long Beach family.'",
        "'speaker_5': 'We cannot continue to have this city vote for world class events while offering hotels with fresh linen, fresh towels, and no recourse for sexual assault.'",
        "'speaker_3': 'I wonder if you ever heard of.'",
        "'speaker_5': 'An Easter egg. It's a bit of code that's put inside of an app. It's a prize for people who work through the app. This night is that Easter egg? Well, an army of angels collected 46,000 signatures in 55 days to guarantee safety, justice for hotel housekeepers.'",
        "'speaker_5': 'There is an Easter egg hidden in this action because tonight you have the possibility to move over to the side of what is right. Tonight, you have the opportunity to right this wrong. I encourage you to do so.'",
        "'speaker_5': 'Tonight, my prayer is that the precious workers of.'",
        "'speaker_3': 'Long.'",
        "'speaker_5': 'Beach understand that their city council respects them.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you so much. Next week, please.'",
        "'speaker_8': 'Hi. I'm her Linda Chico, and I'm the field.'",
        "'speaker_5': 'Deputy for L.A. County Supervisor Janice Hahn. I have a letter to read on her behalf. Dear Mayor Garcia, I'm writing in support of the ordinance to protect women. Workers in the hospitality industry. Have been victims of sexual assault and harassment for years, often at the hands of hotel guests for whom there are little, if any, repercussions for'",
        "'speaker_5': 'their behavior. This is unacceptable. Assault is not a job hazard that must be endured in silence. Everyone is entitled to a workplace where they feel safe. Passage of this ordinance would require hotels in Long Beach to provide panic buttons to their workers, enabling them to call for help if they are in danger.'",
        "'speaker_5': 'It is also important to note that over 46,000 signatures were collected to qualify this measure for the November ballot. Given this strong level of support in the community for these workplace protections, I believe the City Council is well-positioned to pass the ordinance now.'",
        "'speaker_5': 'And I urge you to do so. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. Obviously if we do have any translation, that'll be double the time. But per the clerk here so.'",
        "'speaker_6': 'Can.'",
        "'speaker_7': 'See when I start this meaning the law in a certain mid-decade law you'll be looking at tambien.'",
        "'speaker_5': 'Estamos aqui.'",
        "'speaker_7': 'Good afternoon. My name is Lorena. I am a housekeeper and I live here in Long Beach.'",
        "'speaker_5': 'It's almost like economic companeros, but happily, let's keep our honest opinion. All of.'",
        "'speaker_7': 'Us controllable. So I'm. I'm here tonight with my colleagues to ask you to please stand with us to support women.'",
        "'speaker_5': 'Let's get on record article by your little sister upset Randall.'",
        "'speaker_7': 'And I just want to remind you that our whole country is watching what happens here in Long Beach with this story. Only you can make history tonight. Magic Mother, and they say important.'",
        "'speaker_5': 'Is the Long Beach free tomorrow and with repetition. But abroad they hear a lot more heroes.'",
        "'speaker_8': 'And more than 46,000.'",
        "'speaker_7': 'Voters here in Long Beach sign our petition to support women in moving to the West as base.'",
        "'speaker_5': 'But a competition, mistrust, experiences.'",
        "'speaker_7': 'We have come here time and time again to share experiences with you. Come on us intimacy.'",
        "'speaker_5': 'And support us and how we feel unsafe. Como whispering sun echo acusado al-alam Aquarius. No, no. In honor of another.'",
        "'speaker_7': 'And how gifts have harassed the women and there has been no.'",
        "'speaker_5': 'Resolution. This is questionable. Yet we are not rancorous.'",
        "'speaker_7': 'And now we're asking you please listen to us and stand with women.'",
        "'speaker_5': 'Gotabaya kept going to the middle Newcastle skin of upset.'",
        "'speaker_7': 'And every day that we go to work we have the fear that we don't know what's going to happen to us.'",
        "'speaker_8': 'That day at.'",
        "'speaker_7': 'Work.'",
        "'speaker_5': 'What if our percent is the initiative we get as yes.'",
        "'speaker_7': 'Please pass this initiative tonight. Thank you. Which is great.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Speaker Tanya Reyes had an address on file. I'm here to stand with hospitality workers, and I ask that you vote today to adopt the initiative ordinance without alteration. You have several options that you may be considering. One of the others is option two to place it on the ballot for the vote of the people.'",
        "'speaker_5': 'Some of you might think that this is what you need to do because it's what the voters signed up for. While they signed to support Claudia's law, they signed up to support hotel workers and to stand with women against abuse, as many of us did over nine months ago, when most of the council thought otherwise.'",
        "'speaker_5': 'The council is charged with making policy, establishing order, ordinances, resolutions, budgets, administrative actions that will make Long Beach a better place for its residents and workers. Don't make the voters do your job for you because we already know the outcome.'",
        "'speaker_5': '46,000 voters already told you what they want. They want this ordinance passed without revision, in my view, along with 46 others. Voters who signed the petition is is that putting that on the ballot is not necessary. You have the power to make it happen today, which will not only save money, but also time.'",
        "'speaker_5': 'I hope you get the message that over 40,000 voters sent you. Do not abdicate your responsibility as policymakers. Act on the will of the voters because we already know what the outcome will be. If it goes in November, it will pass.'",
        "'speaker_5': 'The other option is to request that we put, oh my goodness, this is the least desirable because it's not just a defer and delay tactic. It is a whatever. It's whatever the report tells you. Your only actions after the receipt of the report are the ones that you have in front of you today.'",
        "'speaker_5': 'Nothing's going to change. And you will again be thwarting the will of the people because this option guarantees that it will not be on the November ballot, costing the city even more money via a special election. So that leads me to where I started, is to adopt the baby initiative ordinance without alteration.'",
        "'speaker_5': 'Today, I understand that some of you may not want to adopt it today, but inaction last year brought us to this place where you have limited choices. As council people, you have employees, all of whom are represented by a collective bargaining unit.'",
        "'speaker_5': 'Well, maybe, except for the refuse workers. But that's another issue. If a union is good enough for you and your city employees, then why not for all workers in the city? Even those of you who work for the county have great benefits and you owe that to collective bargaining for someone representing you at the table.'",
        "'speaker_5': 'Once again, I'm here to stand with hospitality workers, and I ask that you vote today to adopt the initiative ordinance without alteration. You may have nine different reasons to not adopt the initiative today, the ordinance today. But your city clerk has over 40,000, actually 46,000 reasons why you should.'",
        "'speaker_6': 'Thanks.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Good evening, Mayor, and good evening, Council Members. Thank you for the opportunity to speak to you today regarding this very important issue. My name is Ann Burdette and I am a member of Long Beach Sacred Resistance and St Luke's Episcopal Church.'",
        "'speaker_7': 'We are a coalition of faith groups across Long Beach who work together to put our various faiths in action. All of our faith traditions demand that we love our neighbors and seek compassion and justice like many others who are here today.'",
        "'speaker_7': 'I am standing with the women and men working in Long Beach hotels and asking that you adopt the Hotel Workplace Initiative Ordinance without alteration. Tonight, my faith has taught me that all work has dignity and deserves respect. My faith community demonstrates that each of us has the right to live, work and living and provide for our families'",
        "'speaker_7': '. And we have the right to do so in a work environment that is safe and free from harassment and abuse. I support the workers who keep the Long Beach tourism industry alive and thriving. There are few to no protections that exist for them while they work increasingly heavy workloads and are at high risk of sexual assault.'",
        "'speaker_7': 'We have heard their stories. I believe them. When incidents of assaults do occur, hotel workers often stay silent out of fear because they want to keep their jobs, they want to keep their families fed. And the hotel culture often says that the paying customer is always right.'",
        "'speaker_7': 'An industry and city that tolerate any conditions of fear, abuse, assault and harassment of its residents cannot thrive. We in Long Beach Sacred Resistance, feel we have a moral obligation to act in support of our hotel workers. We cannot remain silent when the health, prosperity and safety of our neighbors and friends are at risk.'",
        "'speaker_7': 'Please adopt the ordinance to protect hotel workers tonight. Please do that right thing and grant these workers the respect and protection they deserve for the hard labor they do to make Long Beach an attractive and desirable destination. Especially tonight, when the whole nation celebrates National Night out.'",
        "'speaker_7': 'Please make sure all your constituents feel safe. Passing this ordinance is your and our opportunity to show what is special and admirable and just about Long Beach. Thank you for your time.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_7': 'Good evening. City Council members and mayor. My name's.'",
        "'speaker_6': 'Going.'",
        "'speaker_7': 'Down. Guess who figured out I was short? My name is Neda Tushnet. And tonight I'm representing the Long Beach Area Peace Network. Robopine stands with Hart, stands here today with our hospitality workers.'",
        "'speaker_5': 'The city needs to protect our hospitality workers from.'",
        "'speaker_7': 'Sexual and physical harassment and assault at work.'",
        "'speaker_5': 'In order for there to be peace, we must take a.'",
        "'speaker_7': 'Prospering economy and have a safe community. Today, we are asking for just that through the ordinance to protect women.'",
        "'speaker_5': 'Long Beach City Council has an opportunity to help hotel workers obtain much needed protections in the.'",
        "'speaker_7': 'Workplace for a peaceful society to function. Workers must have dignity, a fair workload and the ability to go to work without being abused.'",
        "'speaker_5': '46,000 Long Beach.'",
        "'speaker_7': 'Residents agree our workers need protection. Please adopt the initiative tonight. This is the moment. Time's up. Do the right thing and stand by. The working women in our city. Protect our.'",
        "'speaker_5': 'Workers, our.'",
        "'speaker_7': 'Residents and our tourist economy. I know you will find in your heart to do the right thing. Thank you so much.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_3': 'Mary Garcia and members of the City Council. Thank you for the opportunity to provide a public comment this evening. My name is Justin Lawson and I'm a second District resident and board member of the Long Beach Young Democrats.'",
        "'speaker_3': 'I'm here today to read a letter in support of the passage of the ordinance to Protect Women on behalf of the four Long Beach Democratic clubs. The letter reads On behalf of the Democratic Women's Study Club of Long Beach, the Long Beach Democratic Club.'",
        "'speaker_3': 'The Young, Long Beach, Young Democrats and the Long Beach. Yes, we can club. We urge you to support the passage of the ordinance. Protect Women are four very active Democratic clubs have endorsed this ordinance. Our memberships, our membership has heard the stories of workers, especially women, hotel workers impacted by sexual and physical violence at work.'",
        "'speaker_3': 'And we support enacting these protections in the city of Long Beach. We are now asking our City Council to enact into law the protection. This for you effort has called for Long Beach residents have spoken. The effort the effort to qualify this measure for the November ballot garnered over 46,000 signatures, a resounding number that communicates broad support'",
        "'speaker_3': 'for these much needed protections in the workplace. Passing this measure outright will save the city from an unnecessary, potentially divisive fight. It is also the Democratic thing to do. This ordinance is in line with our democratic values, and we call on our leaders here protect particularly our Democratic leaders, to vote with the hundreds of members of our'",
        "'speaker_3': 'local Democratic clubs and pass the ordinance to protect women tonight. At the very least, you must listen to the voters and allow them to vote on this ordinance in November. Anything short of that would be undemocratic. I on behalf of her, Linda Chico, president of the Democratic Women's Study Club.'",
        "'speaker_3': 'Annette Martin President The Long Beach Democratic Club. Chris Robson President of the Yes We Can Club, and Chris Chavez, president of the Long Beach Young Democrats urged the city council to support this ordinance. Thank you.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_3': 'Next speaker, please. Mr. Mayor, members of the city council. My name is Victor Sanchez. I'm the director of the Long Beach Coalition for Good Jobs in a Healthy Community. You know, our coalition has been involved in this issue since day one, about four years ago.'",
        "'speaker_3': 'And I think if you ask a lot of the folks that were there at the beginning, I don't think any of you would have thought that they'd be here almost four years later. Still litigating this issue before you.'",
        "'speaker_3': 'Last September was pretty gut wrenching. The measure was voted down 5 to 4. And, you know, I can tell you there are a lot of tears in the eyes of the hotel workers themselves and the community members that fought so hard to get it to that point.'",
        "'speaker_3': 'Unfortunately, Long Beach missed an opportunity last September because two weeks later you had the rise of the MeToo and Time's Up movement, which really skyrocketed this issue onto the national stage and put the impetus for action around sexual harassment and assault.'",
        "'speaker_3': 'Front and center is in the lives of a lot of residents. It re-inspired our workers and our community members to actually go back out onto the street and to collect signatures to make sure that this issue was heard.'",
        "'speaker_3': 'Here in Long Beach, we went out there, volunteers seven days a week to collect over 46,000 signatures, as was mentioned by the city clerk, more than the 41,000 people that turned out to vote this last local election. I just want to underscore that point.'",
        "'speaker_3': '46,000 people signed this petition. 41,000 people turned out to vote this last election. We did work. We sweat it out. And we talked to lots of voters who agree with us overwhelmingly that this is not only the right thing to do, it's the commonsense thing to do.'",
        "'speaker_3': 'When you ask voters, well, what do you mean, they don't have these protections? No, they actually don't. And you hear a lot from the industry here today that I'll tell you. Well, these are burdensome regulations and we don't need this is going to have a negative impact on the industry.'",
        "'speaker_3': 'The hotel and tourism industry here in Long Beach is thriving and there are many actions by this city council to support that industry's continued growth because it is important for economic development. But what we have to do is raise the bar in the industry.'",
        "'speaker_3': 'We have to look out for the blue collar immigrant majority, immigrant women of color workforce, right? That is in the hotel, tourism industry and sector. And they, too, are residents. They too contribute to this economy. And so it's important that we take all that into account when we're thinking about raising the bar for our government.'",
        "'speaker_3': 'We should also be mindful raising the bar in this very important industry. We should not be debating whether or not it's okay for somebody, somebody to be working to death, just like Claudio Sanchez almost was working to death when she fell into a coma after being forced to work in overtime shift.'",
        "'speaker_3': 'These are basic questions we should not be asking ourselves. You have before you a golden opportunity to enact the will of the people. I hope that you all consider that. And vote to enact Claudia's law here tonight. Okay.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Good afternoon. Good evening, Mayor. Council members. My name is Mike Murchison. I represent the hotels and hospitality industry with you tonight. I want to clarify something for you. It's been said by the previous speakers there was 46,000 signatures collected.'",
        "'speaker_3': 'That's true. Of the 46,000. 12,000 were invalid. So you can verify that with the clerk. So I just want to make sure that everybody statistically knows what numbers they're talking about. Secondly, I've been coming to council meetings for over 20 years, having worked for supervisor ding, ding, and then Don Carnaby then on my own.'",
        "'speaker_3': 'And every time I come on a Tuesday night at the very end of an agenda item, it says, What's the fiscal analysis of every single agenda item? And on this one, there is no fiscal analysis. The hospitality industry told you back in September of 2017 that their best guess at that point in time, 3.5 million annually to'",
        "'speaker_3': 'the hotels. It didn't even take into account what the impact is going to be here, said City General Fund. It didn't take into account the bed tax potential impact. It didn't take into account. You're going to have to either form a new department, add personnel on Tuesday by taking this into account.'",
        "'speaker_3': 'So here's my recommendation to you tonight. My recommendation to you tonight is do an economic impact study. If you don't want to do that and you don't want to make it for a you don't want to push that forward and you want to push forward to put it on the November ballot.'",
        "'speaker_3': 'Not going to argue with you about that tonight. What I will say is you still got to do an economic impact study and you should come back in 30 days and you should tell all the voters of Long Beach, including everybody in here tonight, this is what the economic impact is to our city.'",
        "'speaker_3': 'And then on top of that, if you're concerned about assault and I've heard it, Councilwoman Pearce has made me very well aware of the unreported assaults. Then next Tuesday, August 14th, pass an ordinance, immediately an emergency ordinance to have every hotel, not the one, the petitions that says only 100 room hotels.'",
        "'speaker_3': 'We know why that's there. Every hotel gets a panic button past that next Tuesday night. Don't wait till November. And so then you get an economic impact report back and you have what you're concerned about, which is the assault with panic buttons.'",
        "'speaker_3': 'Then you can give a really prudent evaluation of whether you need to carry this forward in November. If that's your case, whether you want to make it law that night, you can vote in it lor you. You're the leaders.'",
        "'speaker_3': 'You don't have to wait till November. Push it forward. Then you vote for it or push it off till March 2020. Police have the information in front of you to evaluate the economic impact and to protect the hotel worker.'",
        "'speaker_3': 'Do the panic button next Tuesday night. Thank you. Good evening. My name is Michael Sole, author. I am president of the Board of Trustees at the Unitarian Universalist Church of Long Beach, which has served the Long Beach community for over 100 years.'",
        "'speaker_3': 'And I was doing the math looking at the SEAL found incorporated in 1897.'",
        "'speaker_4': 'The church was the.'",
        "'speaker_3': 'City was only six years old when my church was formed. So we've been here for the long haul. I'm here tonight in support, in solidarity with my siblings who work in Long Beach Hotels. And I ask the members.'",
        "'speaker_4': 'Of the city council to be in solidarity and support, too.'",
        "'speaker_3': 'I have talked with and heard the stories from hotel workers. One of them came to my door gathering petition signatures. Not only must they complete heavy workloads, but women are also at unacceptable risk of sexual assault. As the MeToo movement has made painfully clear.'",
        "'speaker_3': 'Society too often devalues and disrespects the bodily integrity of women. And in the hotels of Long Beach, there is an unjustified lack of protection in place for them. Whether you are a person of faith or no faith, I would hope you would agree with the principles my faith has taught me to have respect for the inherent worth'",
        "'speaker_3': 'and dignity of all people, to believe in justice, equity and compassion in human relations. That means our hotel workers absolutely deserve protections to earn a living with dignity and without fear of sexual harassment or assault. It's time they receive the respect they deserve for their contributions to our community and that we protect them from physical and sexual'",
        "'speaker_3': 'abuse. Many of the people in the chamber behind me knocked on doors in every neighborhood of this city to bring this matter to the citizens of Long Beach and then to bring it to you. They received resounding support.'",
        "'speaker_3': 'I'll concede. 36,000. Only 36,000. Only 36. 36,000 people signed signatures to put this before you well over the threshold required to put this before you. Now is the time to respond to the will of my faith community, your constituents, and do the right thing.'",
        "'speaker_3': 'Please pass this ordinance to protect hotel workers. Thank you.'",
        "'speaker_4': 'Thank you. Next, the.'",
        "'speaker_3': 'Mayor and council members. Thank you. My name is Coriander. I'm one of the owners of a hotel up by the airport, the Hampton Inn and Homewood Suites. We have enjoyed our experience in Long Beach. We built the Courtyard Hotel up there as well.'",
        "'speaker_3': 'We care deeply about our employees. We have 17 employees in our current hotel, 30 that live in Long Beach. We spend a lot of time helping them, training them, creating a culture that is rewarding for them. They work their tails off.'",
        "'speaker_3': 'We respect them. This the the safety portion of this initiative we are in support of with everybody here. Frankly, at our hotel, we do two person teams in addition to the panic buttons. Where is that? I think we can do better.'",
        "'speaker_3': 'Not only for the housekeepers, but for all the employees. All the employees. So we continue to work on training. We we communicate constantly with police, the safety commission. We should continue that. We should work together. You guys up here in previous councils have accomplished a ton that that budget presentation was phenomenal.'",
        "'speaker_3': 'I mean, very exciting. I've been here almost seven years now. There's huge progress going on, but that requires investment. The portion of this initiative that is not right is the restrictions. That doesn't inspire growth. That doesn't it's not really fair that it's only on one set.'",
        "'speaker_3': 'Not everybody should be all hotels if it's good to do. It should be all hotels. So this is a this is a very complex issue. This is a long term issue. It's not short term. The economic study will tell us a lot.'",
        "'speaker_3': 'It's not a delay tactic. It's the prudent thing to do. Just like your budget analysis, you're running a $3 billion business here. That is complicated. You can't force things to do it. The people will get their vote. They have spoken.'",
        "'speaker_3': 'There's no issue with any of that. But we we can do better than what we're doing on the safety portion, in the economic portion. You need to be very careful because if I think there could be negative impact to the employees.'",
        "'speaker_3': 'From a wage perspective, if there's only two things that happen hotels are doing, they're going to have to raise rates, which makes us less competitive in the general Southern California market, where they're going to have to cut expenses.'",
        "'speaker_3': 'That doesn't help anybody. You've got investment going on here. You're doing great in the city. So let's take time. Let's focus together everybody in this room focus together to come up with the right solution. Do not rush this.'",
        "'speaker_3': '2020 is okay. It's okay. We can come up with a better solution.'",
        "'speaker_4': 'What? All right. Good evening, Vice Mayor.'",
        "'speaker_3': 'And city council members. My name is Gary Hetrick. I reside in the fourth district. And I just want to start by saying I and to a large.'",
        "'speaker_4': 'Degree, I agree with the previous speaker.'",
        "'speaker_3': 'We need to start someplace we can do better and we need to start with this particular war. And so I urge you to adopt this tonight. This can set the standard where we can build from. Beyond that point, I also want to to to to take a minute to think about this notion that somehow it's a zero'",
        "'speaker_3': 'sum game. Either we we cut expenses, we cut wages, we reduce.'",
        "'speaker_4': 'Wages or benefits, or we raise the.'",
        "'speaker_3': 'Rates, the hotels, the rooms. And we know that's that's there are many other options. We've seen that with living wage ordinance. We've seen that with many of these regulations throughout the years that business owners do and make very different kinds of decisions.'",
        "'speaker_3': 'It's not an either or situation. So I also want to put that to rest. I also want to.'",
        "'speaker_4': 'Raise the issue that.'",
        "'speaker_3': 'We can kick this can down the road over and over and over and over again. We can ask for more studies. We can ask more studies. It's time for us to to sort of it's time for us to make a decision tonight.'",
        "'speaker_3': 'We could have Long Beach could have been on the forefront. We could have set the the agenda for the country two months before the MeToo movement. We failed. We didn't do that. We can now we have a chance to make that right.'",
        "'speaker_3': 'And I urge all of you to do the right thing tonight, protect working women and in our city, pass this ordinance to protect women. And I urge you to do it outright tonight. And let's not waiting longer in people's lives.'",
        "'speaker_3': 'People's health is at stake. Thank you very much.'",
        "'speaker_1': 'Thank you, Mr. Hetrick. Nick Speaker.'",
        "'speaker_6': 'Good evening. My name is Reverend John Forest. Douglas and I serve as the Associate Minister at First Congregational Church.'",
        "'speaker_3': 'In Long Beach.'",
        "'speaker_5': 'Just a few blocks away from here tonight. I represent.'",
        "'speaker_6': 'I also represent thousands.'",
        "'speaker_7': 'Of faith leaders.'",
        "'speaker_6': 'And congregations in Long Beach and the greater L.A. area. Through Clergy and laity United for Economic Justice. And I'm standing here with my.'",
        "'speaker_3': 'Siblings who work in Long Beach hotels.'",
        "'speaker_6': 'And bear witness to their stories. As a pastor in Long Beach, I have heard so many of these stories of workers. And I know that you council members and and Mayor, that you have heard these stories as well.'",
        "'speaker_6': 'And so I invite you also to bear witness to the stories by doing justice.'",
        "'speaker_3': 'It is not acceptable.'",
        "'speaker_6': 'That.'",
        "'speaker_7': 'They are being.'",
        "'speaker_6': 'Silenced when incidents.'",
        "'speaker_3': 'Of assault happen. It's not.'",
        "'speaker_5': 'Acceptable that wealthy hotels and developers.'",
        "'speaker_6': 'Retaliate against workers when they share their stories of harassment. It's not acceptable that workers voices are often silenced. And so you have the opportunity.'",
        "'speaker_3': 'To magnify those voices, to also.'",
        "'speaker_6': 'Stand and bear witness.'",
        "'speaker_7': 'We can't remain silent and turn a.'",
        "'speaker_6': 'Blind eye to the struggle of our hotel.'",
        "'speaker_7': 'Workers any longer. We have a moral.'",
        "'speaker_6': 'Obligation to act.'",
        "'speaker_5': 'And pass this ordinance to protect hotel workers.'",
        "'speaker_3': 'From sexual and.'",
        "'speaker_6': 'Physical abuse. So council members, tonight, I invite you I ask you to use the power that you have to make history in our.'",
        "'speaker_3': 'City and ensure.'",
        "'speaker_5': 'That safe working.'",
        "'speaker_6': 'Conditions for the workers in Long Beach hotels. Thank you.'",
        "'speaker_1': 'Thank you. And just like we did for the for the hearing earlier past council meetings, I believe this is our 15th speaker. So after a 15 speaker will automatically go down to 2 minutes.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'Honorable Mayor, members of the city council and city staff. My name is Amy Ericson. I'm a lifelong concerned citizen in District two and also the chair of the Human Relations Commission here in our city. I am here as a member of the Commission to read you a letter that the Commission has come together in just the last'",
        "'speaker_5': 'nine days to bring it in front of you. Tonight, the Human Relations Commission supports the recommendation listed on agenda item number 28 for this Council meeting. The purpose and function of the Human Relations Commission is to promote full acceptance of all citizens in the community, in all aspects of community life, to recommend to city council measures, including'",
        "'speaker_5': 'legislation which will serve to improve positive human relations and the elimination of discriminatory practices, and to enhance and improve mutual understanding and respect for all citizens of the community. It is in this context that the Human Relations Commission placed the topic of addressing abuse experienced by hotel workers on our agenda back in August of 2017.'",
        "'speaker_5': 'This is also why we're here today to ask the Council to adopt the initiative ordinance tonight with no further action needed. Over the last few years, our Commission has learned that there's an extremely distinct set of circumstances related to hotel work that concern.'",
        "'speaker_5': 'The safety of hotel workers like hotel workers also report inhumane working conditions related to workload shift links and an inability to refuse overtime without fear of retaliation. Worker testimony suggests the current policy in many local hotels is inadequate in addressing issues related to safety.'",
        "'speaker_5': 'Following careful consideration of our charter and purview as well as community testimony, we have determined that increased legal protections for hotel workers is crucial to ensuring a safe working environment within Long Beach hotels working within the framework of equity.'",
        "'speaker_5': 'Our Commission believes that all people tied to the hotel industry should benefit from its economic impact. At a bare minimum, employees in the hotel hotel industry are deserving of basic human dignity. It is in this light that we urge the Council to support the recommendation listed on agenda item number 28.'",
        "'speaker_5': 'To summarize, in brief, the recommendation calls to approve one of the three alternative actions. We believe that should be the first. As over 40,000 votes were verified for this position. This is almost the amount of this is more than the amount of people in support of this item as voted in our last election here in the city'",
        "'speaker_5': 'of Long Beach. Please adopt the initiative ordinance without alteration at this regular meeting at which the certification of the petition is presented to Knight, the Human Relations Commission submits this recommendation again with the hope and vision of Long Beach, where our city continues to embrace values of justice, equity, respect and dignity for all residents.'",
        "'speaker_5': 'I may take off my commission hat for a second and just say as a consensus. And Amy Erikson, we've heard a lot about economic impact tonight and the economic impact of doing something right is the important thing here.'",
        "'speaker_5': 'The economic impact of making sure that we are on the right side of these issues is very important to me as a citizen of this amazing town. And so it's important that we think about places that did things wrong.'",
        "'speaker_5': 'Like the Carolinas with the bathroom options to really think about how we can do this right and pay a little bit more.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thanks so much, Sexton. Next speaker, please.'",
        "'speaker_7': 'Good evening, Mayor. Members of the city council. My name is Kenya Bannister. I'm the general manager of the Courtyard Marriott Hotel by the airport. I've stood before you guys on two previous occasions to review the hotel safety reports and the work that the Long Beach hotels are doing daily to ensure the safety of our employees and our'",
        "'speaker_7': 'guest. You've heard other people say it. We are not here to dispute the safety of our hotel employees. I. Born and raised in Long Beach. I've been in hospitality 20 plus years and I can tell you I go to work every single day and that is my goal, is to keep every single employee in my hotel safe'",
        "'speaker_7': ', not just my housekeepers, but every employee. As you know, the Alliance hotels already provide the panic buttons. And we and we also do our monthly safety meetings and trainings to prepare people, all associates, for any situation that will arise.'",
        "'speaker_7': 'The proposed Hotel Workforce Initiative disregards the safety measures that are already in place. And they proven forget all that. But this audience has the same flaws as the one that was previously rejected by the Council last September. The financial impact of this initiative on the city of Long Beach is unknown to many.'",
        "'speaker_7': 'The hotels already have heavily regulated. Initiatives in place by the state and the federal government. And we can tell you that arbitrary regulations such as those proposed by this initiative would be extremely costly and burdensome. The additional cost for the hotels.'",
        "'speaker_7': 'As we previously said, to implement these regulations would cause room rates to rise across Long Beach, which would have a ripple effect on the entire hospitality industry and local businesses and ultimately the city's tax revenue. The proposed initiative, unfortunately, has little to do with the safety that we keep hearing about.'",
        "'speaker_7': 'And it's unnecessary. And the cost. The cost would do us more harm than good. Our safety measures, including our current panic buttons, are in place and they are working. There is no evidence that further safety measures are required or needed.'",
        "'speaker_7': 'If this was only about safety, as we all say, we would all be supportive. But the question is if this is good for the entire hotel, why are some opted out?'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Good evening. My name is Cesar Armendariz, and I live in the second district. I believe that Claudius Law is at the heart of the conversations that we are having as a nation. Conversations about sexual harassment and economic exploitation.'",
        "'speaker_3': 'When the President of the United States brags about groping women, you know that we are in trouble. We cannot ignore the fact that a majority of women in the United States have been sexually harassed. This is even more problematic in the hospitality industry, where studies have shown that up to nine out of ten women have experienced sexual'",
        "'speaker_3': 'harassment in the form of unwanted sexual comments unwelcome, touching, groping, cornering and physical intimidation. The hotel workers in Seattle and New York have made it clear that panic buttons have helped them feel safer, and in some instances they have saved lives.'",
        "'speaker_3': 'Claudius Law can do that for the women of Long Beach. Claudius Law goes beyond sexual exploitation and addresses the economic exploitation of women that we are seeing all around the United States. These women work long hours vacuuming, lifting 100 mattresses, carrying heavy linens, pushing and pulling carts, getting on their knees to scrub toilets and bathroom floors.'",
        "'speaker_3': 'They repeat this process 20 times a day. This results in injuries. The American Journal of Industrial Medicine found that 47% of hotel workers have serious body injuries and 84% have to take pain medicine. These women cannot simply find other jobs.'",
        "'speaker_3': 'For many of them, this is the end of the line. They already work in one of the lowest paying industries. Those of you who vote against this ordinance or delay the vote will have to spend an exponential amount of political capital trying to justify your vote.'",
        "'speaker_3': 'I promise you, the grassroots community will come together and we will knock on tens of thousands of doors. You might fail to protect our most vulnerable workers, but we won't. Time is up. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Stephanie Moore, some sullo democratic socialists of Long Beach. I live in the second district. The hold up in the hotel industry is heavily subsidized by public finances and is a permanent fixture of the city. If the corporations who are appearing here today feel that the health and safety of their employees is not financially feasible, then leave and'",
        "'speaker_3': 'allow the public to operate these buildings for the benefit of the city and the workers who are responsible for generating all the revenue. Will these companies siphon millions of dollars every single year from visitors? Their respective CEO's and board members.'",
        "'speaker_2': 'Are among some of the wealthiest people on the planet.'",
        "'speaker_3': 'They can afford the finest lobbyists in Long Beach in addition to their already well compensated government affairs department. But they can't afford to pay for basic statutory worker protections. Come on. Worried about the fiscal impact of this ordinance?'",
        "'speaker_3': 'Fine. But be aware that this is a compensable externality that this industry is laying on their workers in the city of Juan Beach. If you don't enact this measure tonight, then cover the cost and raise the hotel occupancy tax on these cheapskates.'",
        "'speaker_3': 'These folks are worried about profitability. Well, then why aren't they supporting rent stabilization and housing and rent control that places appropriate regulations on their main competitor, Airbnb? Pass Claudia's law today. Explain to your children why you prioritize campaign donations from the hospitality industry over preventing sexual assault in Long Beach.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'The next speaker, please.'",
        "'speaker_3': 'Next speaker. Good evening. My name's Alvin Engle. I'm from the West Side, Long Beach, District seven. And also I am a member of the Democratic Socialists of America. I'm a senior in Lakewood High School. And today I stand here in solidarity for the help of the hospitality of the workers.'",
        "'speaker_3': 'During my time in the Philippines, I've seen the issues of what we call the free market. What I want is a free market to protect the workers and protect from sexual harassment in this city. I know very well that this city has the assets and the logistics to make this law a reality, to press forward above all'",
        "'speaker_3': ', and to protect workers from all forms of harassment and assault. If you believe that our workers to live and let live, then be so. Pass this ordinance. I don't care or give that you wait until 2020 for this proposal.'",
        "'speaker_3': 'If you're indeed speak, your words mean nothing to me. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'My name is Harriet Ellis and I'm here representing Clue Clergy and Laity United for Economic Justice. And also the Social Action Committee of Temple Israel of Long Beach. Thank you, Mayor Garcia, and council members, for allowing me to speak on behalf of the hotel workers who labor in our prosperous hotel industry.'",
        "'speaker_7': 'Long Beach is considered the gateway to the Pacific Rim and we have booked well over 200 conventions here this year, and there's more to come. And we are considered a main player in California economy. Each day as I drive into Long Beach, I pass a sign that reads Long Beach, The Friendly City.'",
        "'speaker_7': 'After last year's meeting in this very room, I started to wonder just how friendly we really are. Friendly, perhaps, to our tourists who may never return. But how about the people who work here? And the first line of greetings to our guests from around the world.'",
        "'speaker_7': 'Our hotels should be first in line to present the best that we have to offer. But when our workers have to suffer harassment, abuse, sexual assaults, with no one to turn to, no means to call for help, knowing that when they come to work each day, they will labor in an unsafe environment.'",
        "'speaker_7': 'How can we expect them to put on a smiling face of welcome to the guests of the hotel where they work? I ask you, members of the Council, how would you feel if you had to go to work in such an intolerable situation?'",
        "'speaker_7': 'Or maybe your wives? Or your daughters? If we're a progressive city, a friendly city is the Chamber of Commerce and our Convention and Entertainment Bureau advertise. Then you should do your duty and stand behind your promotions and pass this ordinance today.'",
        "'speaker_7': 'Support the workers who, by their actions, help to bring more tourists to our beautiful city. They come to America to work and they're trying hard to do their job well. You've heard tonight from our city manager about what our future holds.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_7': 'Safety is the part of the picture.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_5': 'Get down. My name is Linda Fox. I'm a former and retired director of Women's Studies. But I'm here tonight because I am the president of the Long Beach affiliate of the National Council of Jewish Women, a faith based organization founded in 1893.'",
        "'speaker_5': 'Dedicated to improving the quality of life through social justice activity for women, children and families. The Jewish imperative is to ensure dignity for all. And that is what powers my organization. I'm here representing 350 members of the Long Beach affiliates, standing with our sisters who work in Long Beach hotels.'",
        "'speaker_5': 'And I ask you to stand with them today, as well as a partner of Clergy and Laity United for Economic Justice. We have heard their stories. We attest to the hardships that they that they face every day on the job.'",
        "'speaker_5': 'I'm not going to go through what so many have already said. I've been involved with Claudia's law since it began three or four years ago. It's time. Not one sexual assault. Not one physical collapse is worth. The economic cost.'",
        "'speaker_5': 'Why has the study not been done in three years? So my Jewish faith teaches me that all of us bear the image of God. So if we make an offense to these hotel workers, we make an offense to God.'",
        "'speaker_5': 'If we turn a blind eye to the struggle of these workers, we do that to God as well. So it's time they that they are dignified and respected in their workplace. I ask you I ask you to please pass this ordinance tonight.'",
        "'speaker_5': 'Find your moral compass. Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_7': 'Good evening. My name is Jane Wilson Barbosa. I live in District four. I also represent Clergy and Laity United for Economic Justice. And I'm co-chair of the social justice team for the Los Altos United Methodist Church. You've heard a lot of eloquent arguments tonight.'",
        "'speaker_7': 'And I take you back to an experience that I had when I was quite young, when I worked in the hospitality industry and I experienced sexual harassment, and I experienced the fear, the reluctance to report and the. The loss of dignity and respect that went along with that.'",
        "'speaker_7': 'Now we have women working, making our hotels work who are far more vulnerable than I ever was. And they deserve the respect that we can give them tonight by passing this ordinance. Thank you.'",
        "'speaker_1': 'Thank you for sharing your story. Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Hi. Good evening. Mayor and City Council and staff. I'm Greg Keebler, a resident of Long Beach and the GM of the Hilton for five years in the Queen Mary. Prior to that, I'm going to cut my comments a little short because I echo so many things of almost everyone that I heard speak tonight.'",
        "'speaker_3': 'The issue before us is how do we unravel all of that.'",
        "'speaker_2': 'That is put into an ordinance and do the right thing? I absolutely support Michael Merchant since suggestion to disconnect this. We all believe in me too.'",
        "'speaker_3': 'And housekeepers, safety and doing the things to keep people safe. This is my 36th year.'",
        "'speaker_2': 'I've had over 22,000 associates directly in my employ.'",
        "'speaker_3': 'I care. We don't call our people workers.'",
        "'speaker_2': 'In the hotel business.'",
        "'speaker_3': 'We call them team members. And that's a totally different justification.'",
        "'speaker_1': 'You guys make sure everyone everyone gets a chance to speak, please.'",
        "'speaker_2': 'They don't work for us. They are team members. We're all in this together. I do daily stand ups with my housekeepers and we talk about housekeepers safety. We issue their panic buttons at the beginning of the day. We pull them back at the end of the day so they don't forget them.'",
        "'speaker_2': 'The next the real thing to consider is let's separate this, get the safety panic buttons done, and we can all be celebrate that together. And then just as you said tonight, we need to know what the resultant outcome of this is.'",
        "'speaker_2': 'Every action has an opposite, an equal reaction. We cannot determine right now what that reaction is going to be, both financially, economically and sociologically to our employees. The way this ordinance is written and I have read it and I know that 46,000 people did not read the entire ordinance.'",
        "'speaker_2': 'They saw a sign that said Vote for housekeepers safety and they signed it. I would, too. The actual ordinance says 4000 square feet per room per day dropped 500 square feet for more than seven checkouts, dropped 500 more square feet.'",
        "'speaker_2': 'If they do a roll away, if they work overtime, it has to be with their consent. If they go over 4000 square feet, it's double time.'",
        "'speaker_3': 'For every hour they work that day.'",
        "'speaker_1': 'Thank you. Thank you very much, sir. Thank you. Okay, next speaker, please.'",
        "'speaker_3': 'Hello, Mayor and City Council. My name is Clayton Hurd, a field representative for Congressman Alan Lowenthal, and I'd like to read the following letter on his behalf. Dear Mayor Garcia and members of the Long Beach City Council, I write to express my support for the passage of the ordinance to protect women.'",
        "'speaker_3': 'The time has come to enact into law the protections this four year effort has called for. As I'm sure you have, I also have heard the stories of these workers for years. And although the national dialog is only recently focused on the struggle of working women against workplace sexual harassment and abuse, hotel workers in Long Beach have'",
        "'speaker_3': 'been on the front lines, ensuring we do more than just experts express empathy and understanding the working conditions of the employees of the hospitality industry must be improved. This is an issue that we that is clearly, widely and deeply supported by our constituents and calls us to act accordingly.'",
        "'speaker_3': 'We should not wait. The City of Long Beach should.'",
        "'speaker_6': 'Be a leader.'",
        "'speaker_3': 'In ensuring safe and humane workplaces in our growing tourism sector. I urge you to stand with the working women and men of our Long Beach Hotel workforce and to enact into law the ordinance to protect women. Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker.'",
        "'speaker_7': 'Translating.'",
        "'speaker_1': 'And then all the translations will have double time.'",
        "'speaker_4': 'Mary Garcia. City Council members.'",
        "'speaker_3': 'Good afternoon. When I.'",
        "'speaker_6': 'Started this.'",
        "'speaker_3': 'I mean numerous Julio Martinez. You throw a whole renaissance Long Beach Hotel.'",
        "'speaker_7': 'Good afternoon, Mayor. City Council members. My name is Julio Martinez and I work in the Renaissance Language Hotel.'",
        "'speaker_3': 'I keep it up. The hill is passing. Esther. Leroy.'",
        "'speaker_7': 'I'm here to ask you to pass this law up tonight.'",
        "'speaker_3': 'Jamaicans everywhere. Mm. Companeros.'",
        "'speaker_7': 'I'm tired of seeing my coworkers so scared.'",
        "'speaker_3': 'Which us versus Jos is quite shallow. Clint Eastwood. Tonight, Academies, Companeros de tobacco brought the enemy of LA.'",
        "'speaker_8': 'I have heard many stories of.'",
        "'speaker_7': 'Guests trying to grope my female coworkers.'",
        "'speaker_5': 'But they're very scared to speak out.'",
        "'speaker_3': 'Your medical. When I was MC companero in control. So sweater and a piece of Albano generally seven.'",
        "'speaker_5': 'I remember one time my coworker told me she found.'",
        "'speaker_7': 'Her sweater on the floor of the.'",
        "'speaker_5': 'Public men's restroom.'",
        "'speaker_7': 'In the hotel full of semen.'",
        "'speaker_3': 'A companero for a rapporteur and a supervisor at Paraiso. So it's really a common safe word. When I was Roma.'",
        "'speaker_5': 'My coworker then went to report to her supervisor.'",
        "'speaker_7': 'And they laughed at her as if it were a joke.'",
        "'speaker_4': 'Rumors and theories that.'",
        "'speaker_3': 'Say We're doing a triangle.'",
        "'speaker_5': 'We just want to be safe at work.'",
        "'speaker_3': 'Courtesy work. He made Siento Camille Pueblo pretzel not on bottom. He said, Well, dear Sir Aparecida, he made a comment that.'",
        "'speaker_7': 'I want to know.'",
        "'speaker_5': 'That if I feel unsafe.'",
        "'speaker_7': 'At work, I just push a button and security will be right there.'",
        "'speaker_3': 'You know caramel star Camille passing Mr. Leroy Brussels.'",
        "'speaker_5': 'And we don't want to feel like we have to.'",
        "'speaker_7': 'Work with fear anymore. Please pass this love right now.'",
        "'speaker_1': 'That's just another. Next speaker, please.'",
        "'speaker_5': 'Hello. My name is Emmanuel, a resident of Long Beach and the secretary general of Gabriel South Bay. We are a grassroots, grassroots Filipino women's organization that seek to raise the voices and stories of women, children and migrant families in our community.'",
        "'speaker_5': 'One of our campaigns that we support is to end violence against women. It has been apparent for years that women all over the world, including Filipinos, experience economic violence that causes poverty, which forces our women to migrate abroad, subjecting them to physical violence and potential sexual harassment and violence as well.'",
        "'speaker_5': 'And these are experiences in places like hotels where they are workers there. I feel frustrated that the well-being of the people is not a more is not more of a priority, that profit is greater than the people who make the city what it is.'",
        "'speaker_5': 'What is profit when the people living and working in your city are being harassed, overworked and underpaid? Do not continue to build the city on the pain of the workers. Gabrielle in South Bay stands in solidarity with the hotel workers and not only their fight for better working conditions, but their safety.'",
        "'speaker_5': 'It is only right that we stand together to make what is LA reality. Thank you. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Next speaker.'",
        "'speaker_8': 'Good evening. City Council and Maria Garcia. My name is Katherine Conchita and I'm a resident of the ninth district. I am also the vice chairperson of Gabriela South Bay chapter of Gabriela USA, which is which is a grassroots space alliance of more than 200 organizations, institutions and programs of women from the Philippines struggling for the liberation of'",
        "'speaker_8': 'oppressed Filipino women. And we stand in solidarity with all oppressed women, including our local hotel workers, demanding their right to a safe workplace. The majority of women who work in our hotels are immigrants who came to this country, to our city, seeking a chance at a better life, a chance to provide for their families.'",
        "'speaker_8': 'Much like my mother did back in 1971, one of her first jobs in California was as a housekeeper for a nursing home, where she worked in constant fear of sexual harassment by her employer, who frequently made aggressive advances toward her.'",
        "'speaker_8': 'My mother's cousin, who also worked at the nursing home, would stand guard at the door of each room where my mother scrubbed floors on her hands and knees. My mother later went on to work for the Long Beach Unified School District for almost 20 years.'",
        "'speaker_8': 'But she never forgot the fear. She lived in working as a housekeeper. So I stand here tonight for my mother, for immigrants, and for all of the brave hotel workers who are here to say, Time's up. Prove that you stand with women and pass the ordinance now to protect our hotel workers.'",
        "'speaker_1': 'Thank you. Next speaker, please. Hi.'",
        "'speaker_3': 'My name is Mike Bowers. I'm a district member or constituent of the first. I came tonight for the housing item, but I worked for Marriott for five years, actually, six years at five different properties, three in D.C. and two out here.'",
        "'speaker_3': 'And I was a manager, so non union member I sat across from Unite here, toeing the company line at union grievances, at federal mediations and all sorts of things. And I really want to talk about how hotels can afford this, right?'",
        "'speaker_3': 'I ordered things. I handle the piano like I scheduled. I looked at productivity. Hotels can't afford this, so it's outrageous that they say that they can't. Additionally, I worked at hotels that had multi double digit million dollar profit margins right at the end of the year.'",
        "'speaker_3': 'So that's ridiculous. I'm paying for overtime for cleaning 4000 square feet. I'd like to see anybody else strip rooms for double digit years of tenure. It's ridiculous that they're not willing to pay this. The alarm devices. I worked at five hotels.'",
        "'speaker_3': 'One of my hotels had them, one of them out of five. These are people's moms, sisters, daughters, loved ones. So if you're opposed to this, think about that. That's who you're who you're really preventing. Additionally, why not be the council member to lobby support for this?'",
        "'speaker_3': 'Why not be the one to step out and talk to your other council members about this, be the one? And additionally, the hotel tax. When you look at the bottom of a folio that's off the backs of housekeepers, that's a lot of money that the city's getting from that.'",
        "'speaker_3': 'Okay. And on top of that, I looked at the rate for the for the Long Beach Renaissance tonight, and it's sold out. So hotels are making a lot of money in the city. And additionally, housekeepers are going to clean those rooms.'",
        "'speaker_3': 'And those rooms can be resold tomorrow for 249 tonight. So this is this is a moral and ethical question, which you guys are posed with. And countless times you guys have failed already. So please act on this.'",
        "'speaker_1': 'Thank you very much. Next week, a piece.'",
        "'speaker_3': 'Hi, everybody. My name's Adam. I live right on the street on Broadway at Fort Kent. I'm here today with a clue. Clergy and Laity, United for Economic Justice. And I, I'm here standing today with the women who work in our hotels here in Long Beach.'",
        "'speaker_3': 'And before I actually start my remarks, I just want to say that I was a little bit disappointed during this. This has been a lengthy discussion. It's been overly lengthy. And one thing that's been disappointing is, is to see many, not all, but many of the men councilmen on this earth, on this proscenium today staring at their'",
        "'speaker_3': 'phones instead of paying attention to the amazing stories and passion. And it's just yeah, pretty ridiculous. So but I just want to say, you know, I was very impressed. It's my first time at the city hall down here and I was very impressed with the budget proposal today.'",
        "'speaker_3': 'I just want to remind everybody how much of the revenue underwriting this budget would be coming directly from a sweat, blood and sacrifice of the women working in hotels here in Long Beach. They are and they are an immense source of the wealth in our city.'",
        "'speaker_3': 'And today they are the voice of our conscience. This country is finally having the sober, long overdue conversation about the rights of women to have a safe workplace. It's a crazy it's a crazy thing that we have to even say that that women deserve a safe workplace.'",
        "'speaker_3': 'But we're saying it anyways, because there are people today who are standing against it, who have been delaying this, who have been putting it down, who have been crying, that the sky is falling, the sky is not falling, our city will be better for it.'",
        "'speaker_3': 'The women in our city will be better for it. The employees will be better for the hotels, we'll be better for it. We ask you to do the right thing tonight and to respect the dignity and strength of these women and all women in Long Beach by passing the women's ordinance to protect all hotel workers, we cannot'",
        "'speaker_3': 'remain silent anymore. We have a moral imperative to act. Thank you.'",
        "'speaker_1': 'Thank you, captain of a supernova. I'm sorry, sir. I just saw a note. That's wrong. Next speaker.'",
        "'speaker_2': 'Good evening. Wayne Murchison, Second District. And surprisingly enough, I agree with Mike Murchison. All hotels should have panic buttons. That's also the minimum of safety that they're offering. It's also a tax write off. It's a one off tax write off.'",
        "'speaker_2': 'Doesn't cost the cost them four years. Smart hotels would get them walkie talkies. Then they're in communication with their staff. Makes their staff more efficient. That's also a write off. The the panic buttons kind of a give the dog a bone measure.'",
        "'speaker_2': 'They'll go away for the rest of it. Remember, measure in chamber of commerce and the hotel industry moaned business would be hurt, would affect tourism. That wasn't so. Hotels are full, huh? I feel the hotels retaliated.'",
        "'speaker_0': 'Measuring by laying off staff and heaped more.'",
        "'speaker_2': 'Work on workers. But they can't physically do more work. So that means perhaps the rooms aren't getting as clean as they would be if they were given a chance to properly clean them. You want to stay in those rooms?'",
        "'speaker_2': 'Okay, that's it. Thanks.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hello. My name is Jacob Ingram, member resident of the second District and member of Democratic Socialists of America Long Beach Chapter. The people in support of this ordinance have explained the economic component better than I ever could shout out Stephan.'",
        "'speaker_3': 'But it is a simple matter of a woman was worked into a coma. Based on the current working conditions that Long Beach hotels currently can subject their workers to, and then to address the signature gathering clips that some of the people opposing this ordinance tonight, 46,000 signatures, however you slice it, valid or invalid, probably gets you elected'",
        "'speaker_3': 'mayor in the city of Long Beach. And that and then just to voice support again pass it tonight as is to entertain either of the other options is straight up cowardly. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_8': 'Good afternoon. My name is Viviana Lagunas.'",
        "'speaker_5': 'I am a social worker here in Long Beach. I work with the severe mentally ill. A lot of the clients that I work with are struggling with different mental health issues such as PTSD, depression and anxiety due to past experiences of sexual trauma, rape, violence, harassment.'",
        "'speaker_5': 'And on a personal note, my mom, she's been in the hospitality industry for her entire life, and she, too, was a survivor of sexual assault on the job. She to experience feelings of shame, isolation, shock, confusion and guilt.'",
        "'speaker_5': 'So you passing Claudia's law outright tonight will not only help prevent mental health issues, but it would help to start that healing process for those working women who are living with trauma and distress. You would be making a statement of I believe you and time's up.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mayor Garcia, members of the council. I apologize. I wasn't really planning on speaking tonight, but I heard some things today where I felt I just had to come up and speak my truth. And I want to really highlight the story of someone who's close to me, a family member whose story gets to the heart of'",
        "'speaker_3': 'everything that we're talking about here tonight. She worked in the hotel industry for years. She was overly worked. She lifted heavy mattress after heavy mattress after heavy mattress for hours on end and for years on end. And she now has a permanent disability that prevents it from really struggling to find work for a part time basis.'",
        "'speaker_3': 'So those who argue about economic benefits, what's the cost to her?'",
        "'speaker_6': 'Okay.'",
        "'speaker_3': 'Secondly, she was sexually assaulted on that job. Now imagine that's your mother or your sister or your cousin or a woman who's close to you or you yourself, because it can happen to men as well, where a man decided thought he was cute.'",
        "'speaker_3': 'Decided to disrobe and approach it from behind while she was cleaning the room. Now imagine someone you care about is standing there. Fearless, fearful, has at the mercy of this person with no one to call and is at his back in whatever he wants to do.'",
        "'speaker_3': 'That's what we're talking about tonight. And if people want to get up here and they want to say that protecting a woman like her is going to cause economic catastrophe for this industry, well, that's a whopper that Burger King would be jealous of.'",
        "'speaker_3': 'But for you all and people who think like that and want to make stand publicly and say that that I can't stand for her. Well, guess what? Time's up for you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening, everyone. My name's Christine Pettit, and I still live in the sixth district. I mainly wanted to share some perspective from 2012 when I was a coauthor and community supporter of the ballot measure that increase the minimum wage for hospitality workers in Long Beach as larger hotels which receive taxpayer subsidies.'",
        "'speaker_5': 'There was a lot of talk from the chamber and the industry then that the increase would drive away hospitality dollars and hurt our tourism economy. The gentleman, a few speakers earlier took the words out of my mouth. It was the sky is falling.'",
        "'speaker_5': 'The sky is falling over and over. But the hand-wringing was unfounded then, as it is now. Our hospitality industry is stronger than ever, and its future looks very promising. This does not need an economic study, and it is absolutely without a question, a delay tactic.'",
        "'speaker_5': 'So if you are in any way entertaining that, just be honest about that. There are interests that don't want to see it before the voters. Now, not really in 2020 either, or really ever. When people signed this petition, it was with the understanding that they'd have a chance to see change this year, and a lot of them'",
        "'speaker_5': 'are disappointed that they haven't seen change earlier. Why not tonight? You had the opportunity to do the right thing last year, and this is something I know voters support. 64% of voters supported the minimum wage increase then, and I know this item will enjoy a similar support.'",
        "'speaker_5': 'I volunteered one of those hot Saturdays to collect signatures in Cal Heights and people readily signed and expressed support. This was a no brainer to them, as I would hope it would be for you.'",
        "'speaker_1': 'Thank you very much. Next speaker.'",
        "'speaker_3': 'Good evening, everybody. My name is Jonathan Solorzano and I am a resident of the ninth District and the senior community organizer with the Limited American Rights Coalition, a member of the Sanctuary Long Beach Coalition. And I am here today to express my support for passing Claudia's law outright without changes.'",
        "'speaker_3': 'As a community organizer, I've heard firsthand the testimony of immigrant women who share their fears of harassment from strangers. I'm sure you've also heard your share of horrendous stories from these workers, many of whom are constituents of your districts.'",
        "'speaker_3': 'We've been hearing news lately of migrant women from all over the world reporting sexual assault and abuse by CBP and ICE officers while they they're unjustly detained in these detention centers. And the last thing we would come to expect would be for these workers to experience harassment and abuse in the one place they would least expected their'",
        "'speaker_3': 'workplace. Yet you're in action back in September. Has a lot for this behavior to continue in our very city. As a body who has voted in favor of pro-immigrant policies such as SB 54 and the Language Values Act.'",
        "'speaker_3': 'I urge you tonight to carry that momentum and send a clear message to the immigrant working class community in this city that this body supports them and their safety by voting in favor of this ordinance.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Derek Smith. I'm the political director for Unite Here Local 11. And in the midst of all this emotionally charged testimony, I'm going to throw some numbers at you. We gathered 46,000 signatures, 26,000 more gathered at the stores, and 20,000 were gathered door to door.'",
        "'speaker_4': 'These are face to face conversations. People at their doors. We had. 175 community volunteers and 150 people who came off their hotel shifts to volunteer, even accounting for Mr. Morrison's 12,000 voters who ultimately did not qualify because they weren't registered to vote.'",
        "'speaker_4': 'I implore you to consider that these are still residents of your city. 46,000 signatures doesn't come by accident. It wasn't a fluke. It wasn't because we tricked people. It was because this is an immensely popular idea. I provided all of you with a polling memo that attests to this very fact.'",
        "'speaker_4': '79% of people think it's time to pass this law. This crosses district lines. It crosses ethnic lines. It crosses gender lines across party lines. This is a popular idea. By continuing to stand with hotels that want to obstruct and delay this idea.'",
        "'speaker_4': 'You run a very grave risk of being very out of step with your city. Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker, please. I'm sorry. Before and also before I keep going, I just to make sure there's other speakers that are not in this on the list. I want to I'm going to close the speakers close pretty soon.'",
        "'speaker_1': 'So please get in line if you have not yet spoke. Okay. I'm going to close the speakers list next speaker.'",
        "'speaker_3': 'Good evening, council members. Thank you very much for providing me the opportunity to speak to you today. My name is Edgar Ortiz and I am with the Long Beach Coalition for Clean Jobs and Healthy Communities. A lot has been said this evening about how this ordinance would be a detriment to the hospitality industry.'",
        "'speaker_3': 'However, I would like to point out two conflicting things that have been noted by some of the speakers in the audience today. On one hand, they say that the lack of an economic impact report creates a lot of ambiguity.'",
        "'speaker_3': 'Yet, on the other hand, they seem so certain that the passage of this ordinance would create ruinous economic impacts for the industry. Well, I think that for a city that has been called one of the largest ports and busiest ports in the world, in addition to the eastern capital of the Pacific Rim, I am very inclined to'",
        "'speaker_3': 'believe that the incorporation of these very reasonable and commonsensical safety mechanisms can be very easily absorbed by the city and this industry. But that's not the primary thing we're talking about today. What we're talking about today is the very real and lasting damages that take place in the hospitality industry that impact people who we consider our grandmothers'",
        "'speaker_3': ', our aunts, our sisters, our daughters and our mothers. I myself have worked have walked the city several weekends over the past couple of months, speaking with citizens of the city. And they very much believe in the and the importance of having such an ordinance in order to safeguard our most vulnerable and marginalized communities.'",
        "'speaker_3': 'And so I call on the members who are here today to not be left behind by history. And if you truly believe in social justice and supporting our workers, then it's going to require a renewed and rigorous commitment to their safety, which you have the opportunity to do here tonight by passing the ordinance without alteration.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. And I will be closing the speakers list. So I just want to make sure the speakers list is closed. Okay. All right. Last call. All right, good speaker.'",
        "'speaker_5': 'Good evening. My name's Netty Soto. I am a Long Beach hotel worker. And Teresita here is my colleague. She cannot tell you what happened to her, but I'm going to tell you what I know. In February 2016, Teresita, another woman worker of the Renaissance Long Beach Hotel, obtained a temporary restraining order against a supervisor who they reported'",
        "'speaker_5': 'sexually harassed them and threatened to retaliate against them or anyone that would report his conduct. Teresita and other women worker then filed a lawsuit against the Renaissance in Long Beach, Marriott International, and the supervisor. The suit alleged claims for assault, battery, sexual battery, sexual harassment and other gender discrimination, among other causes of action.'",
        "'speaker_5': 'According to court records, the party settled the lawsuit last year, but the terms of the settlement agreement agreement are not public. And since it seems like their setai has not been able to talk about it, I have to assume that there is a silence clause in the settlement agreement.'",
        "'speaker_5': 'Neither Teresita or the other workers are still at the Renaissance. But the Renaissance in Long Beach continues to employ the man who reported who they reported that harassed them. It is so difficult for women to talk about sexual assault already, especially when we see stories like what happened to Teresita at the Long Beach Renaissance.'",
        "'speaker_5': 'He is still there. And Teresita. I'm her voice. I feel that the hotels protect their guest over the workers, just like the Renaissance continues to employ the manner that a sitter reported harassed her. That's why I ask you to pass this initiative now.'",
        "'speaker_5': 'Protect the whole work, the hotel workers. Now, you had an opportunity to do so last year and you failed. It is time to break the silence. You can make history today. Don't wait until another Time magazine report comes out.'",
        "'speaker_5': 'We and the Silent Breakers art directors voice. And we are the workers voice of Long Beach. We say no more.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'My name is Guatemala. Housekeeping in Long Beach. Silence Breaker 2017 time person.'",
        "'speaker_7': 'Of the Year.'",
        "'speaker_5': 'It was an honor for me to be included with a.'",
        "'speaker_7': 'Brave woman who.'",
        "'speaker_5': 'Came forward publicly against abuse. For years, I have been fighting for the rights of the woman working in India, in the hotel industry. I was tired of being harassed, ignored in abuse.'",
        "'speaker_7': 'I decided to speak up. Very few people understand what housekeepers go through.'",
        "'speaker_5': 'I am so proud that Long Beach residents care about housekeepers. Although 40,000 residents signed our petition to pass our protection for housekeepers, housekeepers clean out to 20 bathrooms. In bathrooms, pushing cars to the wing over 100, lifting average rate of 20 mattresses, wiping in Irish or 30 murals.'",
        "'speaker_5': 'Have they in a lot more of their own hands in neath on top of these? We don't know who will find behind each single door. In the 23 years that I have been working more than a few times, girls have asked me for sexual favors and expose their private parts to me.'",
        "'speaker_5': 'I will never forget how for my money I used to once remember, ladies, what happened to that woman who was raped in one of our towns?'",
        "'speaker_7': 'Like it is our fault.'",
        "'speaker_5': 'Every day, she thought, Come to Long Beach.'",
        "'speaker_7': 'They stay a few days and then they leave.'",
        "'speaker_5': 'It is scary not to know what to expect. Some hotels don't have security personnel during all shifts.'",
        "'speaker_7': 'We need to be safe.'",
        "'speaker_5': 'Council members. Every year that goes by. Woman in hotel, I suppose they.'",
        "'speaker_7': 'The nation is waiting.'",
        "'speaker_5': 'Pass this initiative in. Way no more. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Thanks, Peter.'",
        "'speaker_8': 'And Sandra gather.'",
        "'speaker_5': 'The well or not lesser known, rather common personal.'",
        "'speaker_8': 'Animal border.'",
        "'speaker_5': 'Comparable.'",
        "'speaker_8': 'Silencio The.'",
        "'speaker_5': 'Lacazette one and the Drama.'",
        "'speaker_7': 'My name is Sandra Fisher that I also had the honor of being named Time's Person of the year for breaking the silence against sexual assault.'",
        "'speaker_5': 'A lot of physical. Reporter in san alcazares at 1220. Paul allen on my spot that gay can get to. I know firsthand how difficult it.'",
        "'speaker_8': 'Is to report sexual harassment.'",
        "'speaker_7': 'When the perpetrator has more power than.'",
        "'speaker_5': 'You. And because of women supervisor Ken Macaluso and mytravel.'",
        "'speaker_8': 'And they ended up that they ran that restaurant that.'",
        "'speaker_5': 'In my case.'",
        "'speaker_7': 'My perpetrator was my supervisor when I worked at the Tarana Resort.'",
        "'speaker_5': 'It's it's tough up.'",
        "'speaker_8': 'There on our hands.'",
        "'speaker_5': 'You sell a felt gas deficit.'",
        "'speaker_7': 'I was working through an agency and I know how difficult it was.'",
        "'speaker_8': 'Gonzalez their numbers let's be okay percent this start iniciativa then important.'",
        "'speaker_5': 'The parallels but approach.'",
        "'speaker_8': 'The Herald as lost rather. The hotel, the lobby. Long Beach City Council members.'",
        "'speaker_7': 'I ask you to pass this important law to protect workers.'",
        "'speaker_8': 'In the city of Long Beach.'",
        "'speaker_5': 'Tonight I'm gonna the Galleria passer.'",
        "'speaker_8': 'I grab on to more let's be look but get.'",
        "'speaker_5': 'In.'",
        "'speaker_7': 'Each day that passes. There are workers.'",
        "'speaker_5': 'Like myself that go to work in fear.'",
        "'speaker_8': 'Personal initiative of a laborer, wrote the Herald.'",
        "'speaker_5': 'Trabajadores de.'",
        "'speaker_8': 'La Salle status within a three story. Please pass this initiative tonight to protect hotel workers. You can make history.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you very much. Next week.'",
        "'speaker_5': 'My name is Tiffany Hooten. I'm a resident of the second district. I wasn't going to say anything, and I'm not a great public speaker, so bear with me. But I couldn't keep my mouth shut knowing that there are men in this auditorium who are snickering at the idea of people needing translators to speak their truths and about'",
        "'speaker_5': 'the sufferings that these women go through in the hotel industry. It should not be ridiculous that this billion dollar industry could afford to fairly compensate and give these women the safety that they deserve. Please know that. There are tactics relying on, you know, economic scare tactics is just an obscurity for their racism and misogyny.'",
        "'speaker_5': 'Do not let this to go unchallenged. Pass this ordinance tonight or stand on the wrong side of history.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Karen, retired. I'm a resident of the First District and I'm representing the Gray Panthers. Tonight, we're in solidary solidarity with the hotel workers and encouraging you to pass this tonight. The last time before I came before you, I talked about how angry.'",
        "'speaker_7': 'The community was.'",
        "'speaker_5': 'And the history of our country is built on the backs. Our wealth is built on the backs of immigrant populations. What kind of city are we going to be going forward? We're making all these changes. Most of them are just terrific budget, a positive.'",
        "'speaker_5': 'Who's going to make who's going to end up paying for those costs? We urge you to pass this tonight and no delays so that the protections can be implemented as soon as possible. For 50% or more of our population and send the message that our community is not going to tolerate the abuse and the harassment of women'",
        "'speaker_5': '. I speak as somebody that had to file a restraining order against someone who lives in my building on a different floor in my building, told me that they would move me. I don't want to move. They don't have another building in Long Beach.'",
        "'speaker_5': 'I don't want to leave this community. Let's stand up for women. Let's get some guts.'",
        "'speaker_4': 'Thank you. Thank you. Good evening. My name is Richard Hoyt. I'm a resident of the First District, and I've lived in the seventh district prior to that for 12 years. And. I'm here as a resident tonight. I do work for a hotel in Long Beach, and I also stand with our housekeepers and fully support a safe work'",
        "'speaker_4': 'environment for all of them. But I feel compelled tonight to share my disappointment in our council, in our mayor, in our spiritual community, and in our leadership that I've heard. Because we're not talking.'",
        "'speaker_3': 'About all housekeepers.'",
        "'speaker_4': 'We're talking about housekeepers from large hotels, not small hotels, not motels, not housekeepers that work for agencies that go into people's homes alone and unsupervised or nursing homes. Like one lady mentioned her mother. She's not protected by this law.'",
        "'speaker_4': 'This is our best work. This is about safety and protecting women. No, this is about safety and protecting certain women.'",
        "'speaker_3': 'Well, what if it was just white.'",
        "'speaker_4': 'Women or just black women or just.'",
        "'speaker_3': 'Latina women? What about all women? Who's who's.'",
        "'speaker_4': 'Here? For those housekeepers that work in a 30 room motel, they get raped.'",
        "'speaker_3': 'Nobody. It's disappointing. Thank you. Next speaker, please. Hello, everybody. My name is Norberto Lopez, an organizer in this beautiful city. And I support the passage of the Hotel Worker Ordinance Protection Ordinance. What can I say after?'",
        "'speaker_1': 'This is where I actually got my start here in the city.'",
        "'speaker_3': 'And organizing with the hotel workers.'",
        "'speaker_1': 'And being involved with this campaign since the beginning and.'",
        "'speaker_3': 'Seeing it grow to where it is right now. And the fact that the first time around and we're here again, just keeps motivated me to continue fighting for the rights of the people in the city. I love the city.'",
        "'speaker_3': 'I drive here every day, 30 minutes and 30 minutes out because this is where I want to be. I can't afford to live here yet, but this is where I want to be so I can start making change even though I don't live here.'",
        "'speaker_3': 'But I consider myself a member of this community. The loss of money to provide a safe working environment should not be a reason on why you vote no, but yes to protect the lives of Long Beach workers. Now the money will come and the hotels will continue to invest here as they want to make their money and'",
        "'speaker_3': 'a growing tourist city. Adobe today and vote yes. We must not waste more time. We must protect our friends, family members and neighbors in the workforce. Now, the reason why the hotel worker, the hotel industry is going to continue to grow because the Olympics are coming.'",
        "'speaker_3': 'Let's not forget about that as well. No auto industry is going to make their money regardless if they provide protections or not. But the time for you to act is now. Time's up.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'My name is Lorena Lopez. Year after year, I've spoken to hotel housekeepers. For years this women have come to you asking for your leadership to make protections to stop the abuse of hotel housekeepers. I would like this council to put yourself in this woman's shoes.'",
        "'speaker_8': 'They are asked to clean, unattainable workloads at a very fast pace. And on top of that, they have to deal with.'",
        "'speaker_5': 'Men.'",
        "'speaker_8': 'Exposing themselves, groping them, asking for sexual favors as if it was part of their job. We this women have had the courage to speak up against abuse.'",
        "'speaker_7': 'The nation.'",
        "'speaker_8': 'Has applauded.'",
        "'speaker_7': 'Women from Long Beach for breaking.'",
        "'speaker_8': 'The silence. We're asking you. To put yourself in their shoes. And stand with this women. The nation.'",
        "'speaker_5': 'Is looking.'",
        "'speaker_8': 'At this vote. The entire nation wants you to take leadership. Make history tonight. Pass this law.'",
        "'speaker_7': 'Tonight. Pass it outright. Women need your.'",
        "'speaker_8': 'Leadership. Women have asked for your leadership.'",
        "'speaker_7': 'Do the right thing.'",
        "'speaker_1': 'Thank you. And. And our last speaker is.'",
        "'speaker_8': 'When it's not just mean media gambling as well. The winner's former partner monitoring document is the prize. Good evening. My name is Miriam as well. The winners and I am part of the undocumented community in this country. And does it the underprivileged yoga.'",
        "'speaker_8': 'My guarantees Osaka. We took the other condition as in Romanesque as a given in a couple liberal.'",
        "'speaker_5': 'Before bearing the fruit.'",
        "'speaker_8': 'That Daka granted me, I witnessed the inhumane conditions that take place in the work. Is the logical complaint ignoring the only thing I condemn plainly prolonged under siege told. The media must know the nature of this and they are not so rude as it is illogical.'",
        "'speaker_8': 'But in the 21st century you all continue wasting time contemplating.'",
        "'speaker_5': 'And prolonging if we all deserve to be.'",
        "'speaker_8': 'Safe in the workplace.'",
        "'speaker_5': 'Espresso Kit Vehicle.'",
        "'speaker_8': 'Gazette. The Internet got us on it can open up aboard.'",
        "'speaker_5': 'The lovely the Claudia I don't know who's.'",
        "'speaker_6': 'The.'",
        "'speaker_8': 'It really was more health then I was put to death.'",
        "'speaker_5': 'That is why I am asking you to touch your heart. And to vote in favor of Claudia's law. Do what is just and believe.'",
        "'speaker_8': 'Women once and for all.'",
        "'speaker_1': 'Thank you very much. Thank you very much. So I have I have a series. I have everyone queued up. I want to thank everyone for speaking. I want to make sure that we manage this so I can get everyone to speak.'",
        "'speaker_1': 'Everyone. There's already a motion on the docket. And so I want to just go through and give everyone a chance to speak and we'll go from there. Okay. So it's time for the council discussion. Let me start off by starting off with Councilmember Pearce.'",
        "'speaker_5': 'Okay. We are here for the council discussion. I first want to thank everybody again for their courage, their commitment to continue to step forward and share your stories, to continue to break the silence. We know that it is not easy.'",
        "'speaker_5': 'And typically I have a bunch of talking points that I prep beforehand, but I'm going to wing it tonight. I've got a couple of bullet points and I just want to have a a quick discussion with my colleagues and with all of you.'",
        "'speaker_5': 'The opportunity we have before us tonight is could be a healing moment. It could be a transformational moment for this council and for the city, because for the last two years, we have been having an intense debate and conversation behind the dais here and in our offices and in the 14th on the 14th floor about what to'",
        "'speaker_5': 'do with this policy. And I think it's really important. As somebody mentioned, we have been talking about this for five years, six years, four years, depending on where you were as part of the process. And so this conversation tonight is actually supposed to be focused just on what we do with next steps.'",
        "'speaker_5': 'But I think that we have to have a full conversation so this process can be as healing as possible. Sorry to put everybody through it, but this item has not only been traumatic for the workers that decided to come out of their hotels and share their stories, that decided to sue their employers, that decided to travel the'",
        "'speaker_5': 'country. Breaking the silence. I know that I want to talk about the women that have been recognized nationally. I know that this does not just mean, Juana, that you're struggling here, but that it takes a toll on your family to be the face of so much abuse and to live through that every day.'",
        "'speaker_5': 'So I just want to say that from the bottom of my heart. Thank you. This item is traumatic for the second district, too. I think every time we talk about Claudia's law, my name is out there because we unfortunately went through a recall that lasted a year, that was funded to the tune of over $200,000, where we'",
        "'speaker_5': 'had to talk about abuse on the doorstep. We had to talk about abuse that nobody asked for that I didn't ask for and that housekeepers didn't ask for. And we had to talk about how businesses and our corporate bottom line often is what divides us in trying to figure out the best way to move forward when our'",
        "'speaker_5': 'hearts we know that nobody deserves to be in an abusive situation, that nobody deserves to be retraumatized. And so when I thought about this item coming up tonight and having the conversation around 2020, November this year, or having the ability to do something great and actually vote on it tonight, I thought about, what, five months of a'",
        "'speaker_5': 'campaign looks like to talk about sexual assault. That's going to be hard. It's been hard and it's going to continue to be hard for this council to grapple with. To see it in the news. To have these tough conversations.'",
        "'speaker_5': 'To understand how our actions got us to this point. All of us, we all let politics play in this item. And it means that we're going to be here at a minimum for five more months, because I don't know that the will is here.'",
        "'speaker_5': 'And I'm eager to hear from my council members because I feel like what the will is here. For all of my council members. For Al, for Suzie, for me, this has been traumatic. We've all suffered. And to be able to take a courageous step tonight and say, you know what?'",
        "'speaker_5': 'I'm not playing politics with the Unite here. I'm not playing politics with the hotels. Enough is enough. The city has to move forward. The city has to be able to heal and tackle some of the other big issues.'",
        "'speaker_5': 'And we all have to work together. We've got big items ahead of us. We've got housing, we've got budgets, we've got land use. And I want to work with everybody on this dias. I don't want this item to be the item that made four years hell.'",
        "'speaker_5': 'And so that that's my conversation today that I've been grappling with. And it is emotional. And there are some triggers when we hear these stories being retold and there are triggers when we have debates with our colleagues or with people in the audience or anywhere that says, you know what, this issue is not about housekeepers.'",
        "'speaker_5': 'I had a conversation like that recently. This is not about sexual assault in the hotels. Never, ever, ever, even when there are politics involved, say that it is not about somebody coming up here and sharing their tears about their reality.'",
        "'speaker_5': 'That to me is so heartbreaking and I don't want us to have that debate for five more months, even if you believe that in your heart. I don't think that's the debate that's going to help Long Beach move forward.'",
        "'speaker_5': 'That is not the debate that is going to put us on the map for a city that has dignity and respect for everybody. We cannot have that debate. It is not it has not gotten us anywhere good yet.'",
        "'speaker_5': 'The debate that we can have is do we take five months right now and put it on the ballot, cost the city half a million dollars. Do we have a study? Let me tell you what we have for our economic study right now.'",
        "'speaker_5': 'What we did as a city was we went forward and we asked for a top policy recommendation that was done by, you know, a consultant. They came back with a hotel incentive program study that told us that our hotel industry is thriving.'",
        "'speaker_5': 'And yes, the conversation that was hot around, okay, if we do this, then the hotel is going to suffer the year after measure and pass. We had 7% increase in profits in the hotels. What what kind of hotel development do I have going on right now?'",
        "'speaker_5': 'I have a hotel proposed at the Queen Mary. I have American Life, a 36 story, beautiful hotel at Pine and Ocean. I've got two other hotels on Pine that are being considered. We've got a hotel at the airport.'",
        "'speaker_5': 'The conversation. That is not a murder conversation. Is our industry going to suffer or not? It's going to continue to thrive because you know what? We've got a mayor that's got great vision. We've got a council that's got great vision.'",
        "'speaker_5': 'Our city is night and day from where it was ten years ago, and people want to come here. And we saw an uptick whenever we got national recognition for measure in and it's going to happen again. If we do the right thing, we're going to see another uptick in tourism in our city because we took that that'",
        "'speaker_5': 'courageous step. So that conversation, do we have a study or not? I've mentioned it to some of my colleagues. I know it's a delay tactic. Can we get more information about our industry? We have a lot already at our fingertips.'",
        "'speaker_5': 'We do. We have a lot not about the cost that it takes to put in a panic button. But if the Marriott can spend $60,000 on a political campaign, but they can't spend the money to put into their hotel to make sure their employees are treated right.'",
        "'speaker_5': 'And this battle is not about this council. It is not about me. It's not about my colleagues up here. It should be about you in the rooms that are cleaning those rooms. It shouldn't be around how much money it costs to save to save somebody's safety, to get them at least enough tools in the toolbox to feel'",
        "'speaker_5': 'safe. So I want to be really clear tonight that we have a thriving tourism industry. I've got the whole study in front of us. You can go back and look at it time and time again says that we've got room and the demand for another almost 1500 hotel rooms in our city.'",
        "'speaker_5': 'That says a lot to me and our city. Our hotels are stepping up and doing the right thing. And the questions are the safety issue. I'm not sure what happened in between the time that we had the opportunity to behind this dais to make a decision.'",
        "'speaker_5': 'But it's I believe that the sexual assault provisions are in there for rooms, 50 rooms or more. I wish it was with everybody. We can have that conversation down the road about what we do. But we already had our opportunity, a council said, to make the best ordinance.'",
        "'speaker_5': 'So tonight, as our colleagues grapple with this conversation, I implore us to have the conversation around what is it going to take for us to do this tonight? So my motion, my request is that we we do vote tonight not only for the for the residents to hear from the trauma, for the workers to hear from the'",
        "'speaker_5': 'trauma. But for us, this council deserves to move forward. We deserve to be able to lead and govern for the next two years as a whole body and not allow this conversation to get to get done because it is pulled hide.'",
        "'speaker_5': 'The voters will vote to enact this, whether it's in November because we made everybody wait or because we voted for it now. And now the hotels have five months to actually plan an implementation strategy, which would be really wonderful if we actually looked ahead and plan.'",
        "'speaker_5': 'So let me make sure I'm done with my talking points before I move on. So the conversation around retraumatizing, I just want us to all be clear that when if we vote to put this on the ballot in November and not vote outright today, the things that we're going to hear for five months are restraining order, rape'",
        "'speaker_5': 'taken from behind and worked into a coma. Assault, physical assault, sexual assault, battery, gender discrimination. This is going to be our lives for the next five months. These women are going to have to go door to door and retell their stories for five months.'",
        "'speaker_5': 'If we decide to wait. Please Council. Do it. Do the right thing. Right.'",
        "'speaker_1': 'Thank you, councilmember Pearce councilman. And concentrate you you've cued up as as the motion maker on. Right. So. So there's the first vote. Yeah. So the motion on the floor right now, as per Councilmember Pearce and seconded by Councilman Gonzalez to to choose one of the three options available, which is to implement the ordinance as is today'",
        "'speaker_1': '. So that's that's the motion that's on the table right now for the first and a second. Councilwoman Gonzalez.'",
        "'speaker_8': 'So this is it's really tough seeing a colleague upset like this. And I know that it's just really tough to to see that. So I want to just thank you, Janine, for being so brave. I know this has been a long time for you for some time.'",
        "'speaker_8': 'And I just want to say, you know, I'm sorry you're feeling that way. So thanks to all the women and the men that are here today that have spoken once again in front of this council, I think I appreciate each and every one of you unite here, residents, stakeholders, our dear elected colleagues, Supervisor Janice Hahn.'",
        "'speaker_8': 'Thank you, Congressman Alan Lowenthal, Congresswoman Nanette Barragan and Senator Ricardo Lara, we thank them very much for standing today with our with our hotel housekeepers. Let's give them a big round of applause. So everyone knows I'm sort of a nerd with data and I want to be very cut and dry when we talk about the economics and'",
        "'speaker_8': 'we've talked about this before, but I want to rehash some some information as to why I think we all believe that we absolutely should put people over profits, especially in this case. And why the hotel industry? Well, the hotel industry and the tourism industry is making significant profits.'",
        "'speaker_8': 'And we know this every year. It's pretty hard. And especially after last year when this ordinance did not pass the way we wanted it to, it was very hard a few months later to see from our Convention and Visitors Bureau that 2017 was the best tourism year yet on record for the city of Long Beach.'",
        "'speaker_8': 'In fact, our fiscal year 19 budget is proposing millions more dollars to the CVB. 7.2 million people visited Long Beach for events and meetings, 1.7 million visited the aquarium. And in fact, we gave $10 million as a city council to the aquarium to add value to the tourism industry.'",
        "'speaker_8': 'And I'm not knocking those things. I think that's fantastic. But what are we doing when it comes to our hotel housekeepers, the ones that are most vulnerable in this situation and actually make our cities shine? Overnight, visitors increased 18% over 2016 and generated over $300 million for the local economy here in Long Beach.'",
        "'speaker_8': 'And we have, if everybody knows, an over $100 million sports complex with two L.A. teams coming just 20 minutes north of us, are we not going to benefit from that? We are. And when I say we, we as a as a city, but also we as a hotel industry.'",
        "'speaker_8': 'And in fact, the business markets in the United States have responded overwhelmingly. In fact, large companies like TripAdvisor, if many of you do not know, they responded to the MeToo movement and they include now an online badge when there has been a reported sexual assault of any kind, any kind for the hotels that have had those issues'",
        "'speaker_8': '. Uber is investing $5 million in community partners for sexual assault prevention, and Microsoft changing antiquated workplace policies to ensure that protections are available. I know because I work there, I can include that one. And when we talk about a fiscal impact study, we absolutely have to talk about the cities that have enacted an ordinance similar to this'",
        "'speaker_8': '. We're not new. This is not, you know, a novel idea. So the cities like Seattle, Northern California cities, they've enacted ordinances, some of them in 2016. And their tourism statistics have never been better 3.3 to 4% year over year increase in visitors.'",
        "'speaker_8': 'Transient occupancy taxes have grown nearly 13 to 14%. Average daily hotel rates have grown by 11%. I know this is a lot of data, but it's absolutely in line with what we're doing here. We're not going to slow down here as a city.'",
        "'speaker_8': 'The hotel as a hotel industry is not slowing down. The tourism industry is not slowing down. And if it's okay, as many business partners have said today for 2020, why is it not okay now? Why is it not okay now?'",
        "'speaker_8': 'We can wipe the slate clean and we can move forward to pass an initiative for almost 80% of residents that have said yes to this. And I hope that my council colleagues can look to voting to passing this outright, because whether this happens today or if we delay this to November, it's going to pass.'",
        "'speaker_8': 'So I thank all of you again for all of your hard work. I know that this has been very tough, but you can absolutely count me in in terms of always supporting our hotel housekeepers. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Next up is Councilmember Supernormal.'",
        "'speaker_2': 'Thank you, Mayor Garcia. And thank you to all the speakers here tonight. I would like to make a substitute motion. I move that we adopt Alternative three and order a report pursuant to California Elections Code Sections 9212.'",
        "'speaker_1': 'Okay. There's a motion and a second on that, that that motion is to just adopt the report. Correct. Mr. Soprano and and and counsel and on that motion, did you want to speak to that motion? No. Okay. Councilman Mangold, you want to speak to that motion?'",
        "'speaker_1': 'Okay. No skies. No. Everyone has an opportunity to speak now. It's the council deliberating. Thank you. Next up is counsel in Boston.'",
        "'speaker_0': 'Thank you very much, Mr. Mayor. And I want to thank all of the speakers. It was very, very heart wrenching. And and as usual, I mean, this is certainly not a usual issue. I'd like to first, they say that no no worker should should have to work in fear.'",
        "'speaker_0': 'I firmly believe that is something that I've committed my career to. Nobody should have to work in sexual abuse or in a hostile work environment. And workers in this city deserve to share in the prosperity of our city's economic growth, particularly in a thriving industry like the hospitality industry.'",
        "'speaker_0': 'That's without question. That is why back in 2012, when Measure N was before the voters, I was a supporter of that. I think it was a cosigner of that back in 2006 when boycotts were going on because hotel workers were trying to organize workers.'",
        "'speaker_0': 'I signed on and there are hotels that I haven't been into since 2006. I've stood with workers and I continue to stand with workers every single day. I stand with our hotel workers. I stand with our women. I'm a proud son of a mother who taught me who was a strong woman.'",
        "'speaker_0': 'I was sister. I have a strong wife. I have women. Three women on my staff. I have women who I work with every single day that I respect and will. I will kill over if anybody ever hurt them.'",
        "'speaker_0': 'I'd also like to just tonight recognize some extraordinary efforts in this city to address, address and improve working conditions for women in the hospitality industry, for workers in the hospitality industry. Anyone looking at this issue objectively would have to recognize the thousands of conversations that thousands of conversations have been had about worker safety, about sexual abuse, about'",
        "'speaker_0': 'pack panic button buttons, and safer working conditions for hotel workers. This issue has been a top and hot topic in our city for at least the past year. And as Councilmember Pearce mentioned it, we've all been affected by one way or another.'",
        "'speaker_0': 'Safety for hotel workers has been identified and is a priority in this city. No matter how you cut it. Last year, the city council considered an ordinance and it's been been discussed and a few of us expressed concerns with the policy.'",
        "'speaker_0': 'I'm going to maintain that they were legitimate concerns. They weren't concerns expressed because, you know, we were taking sides, one side or another that we didn't stand with women. There was a lot of very hurtful rhetoric expressed, particularly over the last year that was was completely inaccurate.'",
        "'speaker_0': 'It was political. It was good political banter. It was good talking points, but not accurate. As policymakers, we're supposed to ask tough questions because we want in every we have a responsibility to get the issues right. Many of you said it tonight.'",
        "'speaker_0': 'Get it right. Do it now. Fix it no matter what the issue is. If it's housing, if it's homelessness, if it's whatever the big issue, ticket issue of the day is, you want this council to figure out how to get it right.'",
        "'speaker_0': 'You don't want you don't want us to do what we're told necessarily. And that's not what we're here for. We're here to work and to work together. None of us were raised in the same household. None of us necessarily went to school together.'",
        "'speaker_0': 'We're all different people from different backgrounds. We come here to to enact policy that's in the best interests of our city. Right. So this issue obviously was was very contentious. And in September of last year, and I think it was a true low point for the city.'",
        "'speaker_0': 'And and I will just say that parties all the way around could have handled themselves better. A majority of us passed a resolution strongly encouraging hotels to address the safety concerns that were raised here. And since that time, I've actually been in contact.'",
        "'speaker_0': 'I've tried to maintain. Contact with the hotels to make sure that they were following the the ordinance and updating this council and where they were at. I know that as a result of that council meeting, this debate over this issue over the last year, panic buttons have been implemented in several hotels.'",
        "'speaker_0': 'Maybe not enough. Maybe not to the satisfaction of everyone. But I know good faith efforts have been made. And so I want to recognize that. I think I think some some good, good points have been made here this evening.'",
        "'speaker_0': 'I think we do need to take a broader look at all of our hospitality industry and particularly some of the smaller motels and hotels. And look at those those conditions as well. But the issue before us today is how we proceed now that close to 50 conversations have been documented about this important issue.'",
        "'speaker_0': 'And again, I want to respect the work that went into doing that, because I know that's not easy. And and to go to the voters and have those conversations and to get buy in says a lot. And I think this council has always respected that no matter what what the issue has been.'",
        "'speaker_0': 'And I think we should continue to do that. I would love to see closure on this issue very soon, and that's why I won't support a delay. However, I do support honoring the will of the people and advancing this issue to the November ballot.'",
        "'speaker_0': 'And so, with that said, I want to make a substitute substitute ballot a motion to put this issue on a November six ballot, since we, as a council several hours ago, already set an election with ballot initiatives to go forward to the voters.'",
        "'speaker_0': 'And so that's my motion. I would love to have the council support on that figure.'",
        "'speaker_1': 'Councilman Austin. And we do have a second and two before I before I continue, I want to just clarify kind of where we're at. We still have a lot of speakers, so we're going to keep going through that.'",
        "'speaker_1': 'We have three there's three motions, the main motion, a substitute motion and a substitute substitute. Essentially, all three of the options or the only three options really that are that are available in front of the in front of the city council.'",
        "'speaker_1': 'And just to clarify, obviously, the main motion, which was was done by Councilwoman Pearce would implement the policy today or immediately. The second the second motion which was made by Councilmember Supernova, would implement a study. And I want to make sure that we as we move forward, we know what this all means.'",
        "'speaker_1': 'The study itself, Mr. Parking, would have to happen in how many days?'",
        "'speaker_3': 'Within a year under the election code. The study is required to come back to the Council within 30 days.'",
        "'speaker_1': 'And and also and any study would that would delay the election in November and it would automatically go on the March 2020 ballot. Is that correct?'",
        "'speaker_3': 'Not automatically. It would pass the deadline for us to meet the county's deadline to make the November six, 2018 election. When the study comes back within 30 days, the Council would have two remaining options left adopted that evening has written without alteration or can put it on a ballot.'",
        "'speaker_3': 'It could be 2020. It could be a special election.'",
        "'speaker_1': 'So that's the that's the the second option. And then the third option, which is the third motion which was made by Councilmember Austin, is to move forward with the election this November. I just want to also clarify, and I've heard a couple of different I've heard a couple of different dates the the November election.'",
        "'speaker_1': 'Just want to clarify, just because they know that Councilman Pure sprouted up that we're talking about the same thing. It's not we're only about five I think we're talking about 12 weeks or the three months. Right. Is that the same thing we're talking about?'",
        "'speaker_5': 'So if we so if my motion my motion was that if we vote on it today, that it would automatically go into effect January one. And so that was and so before council speaks, that has been my understanding this entire week that we've been talking about this, that if we voted today to pass it as an ordinance'",
        "'speaker_5': ', because the ordinance was written to implement in January one, which is what the voters said they wanted, that basically what would happen is it would save us from an election. So that's, I think, a bit misunderstanding.'",
        "'speaker_1': 'What do we have? What?'",
        "'speaker_0': 'We have a motion. No, no, no. Section three of the ordinance proposed ordinance says that it'll go in effect ten days after the November 6th election.'",
        "'speaker_1': 'Well, let me let me have that. Why don't we have the attorney clarify? So, Mr. Park and can you clarify the questions that we know what we're talking about as we.'",
        "'speaker_3': 'Thank you. Option one if the Council votes to adopt the initiative ordinance without alteration at the regular meeting this evening or within ten days of it presented, it would go into effect. Basically, immediately it becomes the ordinance of the city.'",
        "'speaker_3': 'So we would then go to the initiative itself and I believe it. I don't have that language on the page. I'll find it, but it would go into effect immediately. In essence, you've adopted the ordinance tonight.'",
        "'speaker_5': 'Okay. So just to clarify, on my on my original motion, I am a fair human. I never would vote for an ordinance and expect the hotels to put that into effect in December, I mean, in ten days. I always expected us to be saving us from an election which would save the taxpayers half a million dollars.'",
        "'speaker_5': 'So I want to hear the rest of the conversations behind the dais, and then I know we'll go through the voting process.'",
        "'speaker_8': 'But just to be.'",
        "'speaker_5': 'Very clear publicly.'",
        "'speaker_1': 'Thank you. Let me let me go. Let me continue on the list. Councilwoman. I think so. There's no other questions on kind of the motions of trying to make sure we clarify those. Councilwoman Pryce.'",
        "'speaker_7': 'Thank you. So earlier so just a couple of questions for me. Earlier tonight, we voted to put charter amendments on the November ballot. So we're having an election anyway, is that right?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_7': 'So adopting the ordinance isn't going to save the taxpayers money in regards to this particular item, because we're going to be having an election that.'",
        "'speaker_3': 'The it's the incremental cost to put the addition this item as an additional item. And I think the clerk had that number at 40,000 or $45,000 per item. So this if they voted tonight to put it on the ballot, I believe that would be the additional cost since council has already have five items on the ballot.'",
        "'speaker_7': 'So we're not talking about a half a million dollars. That's not the. I just want to clarify that because I want to make sure that we are listening to all of our colleagues. I appreciate everyone who came out tonight and everyone who spoke.'",
        "'speaker_7': 'And I agree with all of my colleagues tonight on many of the things that have been said. I think this has many of the issues we take up are very controversial and many of them have a tendency to get emotional and inflammatory.'",
        "'speaker_7': 'And that happens. And I understand that. And it's unfortunate that this one did. And I think in hindsight, there could have been opportunities had there been opportunities for compromise last time to have fashion, something that could have avoided a lot of the effort that was put into it.'",
        "'speaker_7': 'But I applaud the groups that put the effort into the work that they did to get the signatures. And I respect that process. I do know and I have a question for the city attorney here. When the marijuana initiative came to us, when we approved it, we approved it simultaneously to requesting an economic impact study.'",
        "'speaker_7': 'So we approved it to go on the ballot. But at the same time, we also requested an economic study. Could we do that in this case?'",
        "'speaker_3': 'That is correct. On the. And if you chose to do something like that, that motion isn't on the floor right now. But if there was an amendment to a motion, you could do that. The difference is the study that you would be asking for is not the study that's contemplated in what is before you tonight under under'",
        "'speaker_3': 'the elections code. That is very specific. And we would have to get more details if that item before that item is voted on, if it if it is, in fact, voted on as to what specific items you want, if you vote tonight to place it on the November ballot, and then you ask or direct the city manager'",
        "'speaker_3': 'to do a study, that study is a different study and doesn't have a 30 day time limit because you've already taken the action required by the election code this evening of placing it on the ballot.'",
        "'speaker_7': 'I understand my question to the city attorney. I mean, to the city manager would be if we were to to direct the city manager's office to commission or prepare a report, could something be brought back to us in 30 days so that we can have some data?'",
        "'speaker_7': 'And let me tell you why that is, because when the economic impact study for the marijuana item came back, we had revenue and cost projections for the city in terms of the administration of the program, should the ballot initiative pass.'",
        "'speaker_7': 'And we based our budget and our budget discussions on those revenue projections which have thus far turned out to be $4 million lower than we were expecting. But nevertheless, we had some at least some baseline of information and data to work from.'",
        "'speaker_7': 'So I'm wondering how quickly could we get that back?'",
        "'speaker_3': 'We have some consultants on board that we could shift that to immediately. I can't promise you exactly what we would have in 30 days, but we certainly would have an update. With all the information that we could gather within that time period.'",
        "'speaker_3': 'I don't know if it meet all of your needs, but we certainly would have something.'",
        "'speaker_7': 'And for me and I want to hear from my colleagues, but and I'm I think I'm going to make a friendly here, but I'm kind of talking out loud to my colleagues. For me, the key inquiry would be what impact could this potentially have to the city in terms of administration of the ordinance?'",
        "'speaker_7': 'Because I understand the cities that have imposed this have had to evaluate their own structure to make sure they have someone there for compliance purposes and things like that. So what would that look like for us? And that would be the really the focus for me.'",
        "'speaker_7': 'And also in terms of the revenue that's brought into the city, what anticipated differences could it could we expect to see, if any? So so with that, what I would like to do is ask Councilman Austin if he'd be willing to accept a friendly that we have, in addition to the item being placed on the November ballot'",
        "'speaker_7': ', an economic study that would be returned in 30 days to provide us with basic analysis of the economic impacts for the administration and revenue projections for such an ordinance.'",
        "'speaker_0': 'So is it specific to the Economic City study? Would it be specific to this, the city's impact or impact on the the hospitality industry?'",
        "'speaker_7': 'Well, you know, I want to hear from my colleagues on that. I think at the at the base, I would I would like to see if you're open to the friendly, my thoughts would be right now, the primary concern is how, if at all, would it impact the city's budget and the city's revenue projections, whether that's in'",
        "'speaker_7': 'relation to our tourism industry, our top tax, our, you know, all of that because we rely on those projections to to set our budgets.'",
        "'speaker_0': 'Well, I'll tell you, I'm most interested in impacts to obviously our responsibilities to city. I mean, I sit on Budget Oversight Committee and we're in the process of obviously planning our budget right now. And so I think that would be good information to have.'",
        "'speaker_0': 'And so I'll accept the friendly. I would just just say that I think, you know, it's going to be difficult to give direction this evening for scope of a study. And I would say that we probably do we could possibly have a week to try to work this this through as well.'",
        "'speaker_0': 'So but I accept the friendly because in the spirit of moving this design.'",
        "'speaker_7': 'Great. So in terms of just a few final comments, you know, one of the things I found is no matter how hard you try, if folks have made their minds up about you, they've made their minds up about you.'",
        "'speaker_7': 'And some people are willing to listen openly and others are not. And some people are willing to change their minds based on what they hear, and some aren't. And you can only control your own behavior. You can't control others.'",
        "'speaker_7': 'And that's I don't mean to lecture. It's just me kind of talking out loud, kind of like my colleague, Councilman Pierce did, because this this is a very human process. And we are humans experiencing things just like everyone here is.'",
        "'speaker_1': 'Treat the workers like, hey, guys, everyone gets a chance to speak, so please, please. Now, it's not the council's opportunity to deliberate. Thank you, Councilman Price.'",
        "'speaker_7': 'Wow. So.'",
        "'speaker_1': 'Hey, guys. You know what, guys? That's not that's not appropriate. We're now the council's deliberating, so please, everyone was given respect when they spoke. Please just allow every council member to speak. Thank you. Counsel. Counsel Councilwoman Pryce.'",
        "'speaker_7': 'I think I'm done.'",
        "'speaker_1': 'Councilmember Durango.'",
        "'speaker_3': 'Thank you, Mayor. All I have to say, while my time I get to speak or three motions and substitute an amendment so it can get a little confusing here. But, you know, when I look at the what happened last year, where I'm at now, you know, what has changed?'",
        "'speaker_3': 'Nothing. Nothing has changed my situation. I have you know, I have a vested interest in this issue, obviously. If you recall, I have a son and a daughter in law who work in the hotel industry. And I care about very much about their safety and about their working environment.'",
        "'speaker_3': 'So when we were talking about, you know, panic buttons and and worker safety, it's not only about panic buttons, it's also about working conditions and working environments. It they are they're there together. I mean, you can't separate one from the other.'",
        "'speaker_3': 'And, you know, my position has not changed. I mean, I would rather that we go ahead and adopt the ordinance tonight, because it would be I mean, it's inevitable. We've seen the numbers. We know the hard work that many of you in the audience put into this.'",
        "'speaker_3': 'And you're here tonight. You're here close to 10:00. People have been here, you know, most of the day, being here, preparing for this and now listening to us grapple basically with this issue when it comes to this, the the the the options of what we have.'",
        "'speaker_3': 'The second one is is dead in the water, as far as I'm concerned. A study would not resolve anything. We know what the end result is going to be. I mean, it's already been proven. I mean, that Councilmember Gonzalez already gave us what's let's throw she has and the stats and I've heard it for the last four'",
        "'speaker_3': 'years that I've been a council member here. Every year the CFPB comes and they do their reports and every year the city has grown. Every year there's a profit. And every time that we've talked about the effects of of a minimum wage measure in panic buttons, we we hear the same arguments.'",
        "'speaker_3': 'People are going to leave. People are not going to come to Long Beach. Hotels are going to lose their business. It's going to affect their bottom line. It's going to affect their philanthropy and in supporting the nonprofit organizations that they support in the community.'",
        "'speaker_3': 'We hear that every time. And it's it's it's and I said it before, it's a chicken little story. The sky is going to fall. And you know what? The sky has not fallen. In fact, we're you know, we're reaching the skies.'",
        "'speaker_3': 'We're we're up there. I mean, the economy in Long Beach has continually improved the last the last four years. I can see that, you know, with all due respect to the councilmember who lives with me, you know, there wasn't this kind of growth in her area.'",
        "'speaker_3': 'I mean, it was we were dealing with some very serious budget deficits. She came in the city council and there was almost an immediate $80 million deficit that she inherited in 2002 when the utility users tax went down.'",
        "'speaker_3': 'And we cut that in half. And it was an immediate funk. But I have to thank the voters because in their wisdom, they voted for measure in. And I'm sorry that, you know, this puts us in a place to where we need to be.'",
        "'speaker_3': 'They voted for a measure, A, that has significantly helped the city balanced budgets. And not only that, but provided us an opportunity to grow our budget, to return services to public safety, to return to South Division, to return ambulance services, paramedic services and fire stations, to get more police officers to take over the blue line.'",
        "'speaker_3': 'We are doing quite well. In fact, we have Councilmember Pearce has already said, you know, we've got hotels that are that are in the planning stages that are going to be going up. You know, over 20 stories of 4000 rooms are going to be added to the city of Long Beach.'",
        "'speaker_3': 'So we are in a growth mode, and I don't see that stopping, quite frankly, and I don't see how this word is. What would stop that from happening in terms of the growth that the city is going to have?'",
        "'speaker_3': 'In fact, quite the opposite of when you have happy workers. You have people with smiles on their faces. When you have employees who are walking. I mean, and who are in a good spot, who really enjoy their jobs, really enjoy their employers and really support their employers.'",
        "'speaker_3': 'You get business. You get people who return to the bit to to this city because they want to be here because they feel safe. They feel wanted and they feel like they're going to be treated like like royalty when they come here.'",
        "'speaker_3': 'And that's what we're striving for. We're striving. It's not so much that, you know, we're going to be putting a restraining restraint, a restraint on our hotel industry. We're doing that at all. What we're doing is trying to make them stronger, to make them much more effective in how they serve their their tenants.'",
        "'speaker_3': 'And the people who come in and want to stay in line, which are tourism is up. Our conventions are going through the roof. We've got more conventions coming here than we ever had before. And where do they stay?'",
        "'speaker_3': 'They stay in our hotels. They eat at our restaurants and they use our modes of transportation. Our airport has grown significantly. Why? Because people are flat. Because people are flying into Long Beach. Now we're talking about an economic impact study.'",
        "'speaker_3': 'You know, I'm not so sure what the devil's in the details, obviously, in an impact study. Who study? Is it? Is it the steady city study and the impact that what it's going to accrue to us as a as a city talking about, you know, compliance and more staff, or are we talking about the hotel industry and'",
        "'speaker_3': 'the and the impacts that this ordinance would have on them? And who is going to be benefiting from it? And should we have a concurrent study with a ballot measure? You know, and we come back in 30 days.'",
        "'speaker_3': 'What spin is is that study going to have spin for the city or spin for the hotel industry? Can it be used against us or can they work for us? I don't know. I frankly, I that's where I'm perplexed, where a study would provide us with certainly more information.'",
        "'speaker_3': 'And there's no question about that. But I'm not sure to which benefit and and how it's going to be used in a campaign come November, because I know that those numbers and those figures would come into play if if the study comes out before November, before the November election.'",
        "'speaker_3': 'So I'm holding firm with with my position, I will not be supporting the substitute motions. I'm going to go back to my original the original motion. I'm going to stay there. But I'll see how how my colleagues vote, because I think that the most important thing we need to do is to get over what happened last year'",
        "'speaker_3': '. Correct the wrong. And let's keep moving forward and let's get this city where it needs to be. Thank.'",
        "'speaker_1': 'Thank you. Next up is Member Richardson.'",
        "'speaker_2': 'Thank you. I got to say, you know, this this issue. I supported it when it came to council a year ago. It's been a I've seen a wedge divide on this council and in the community on this issue.'",
        "'speaker_2': 'And tonight, we need to vote to move forward. It's time to put this in the voters. I've looked at the analysis to be as clear as we can. We've collected this many signatures. We've seen the polling. It's going to happen either tonight or it's going to happen in November.'",
        "'speaker_2': 'This thing is moving forward, I think, tonight. What we don't need is people dug in. The trench needs to close tonight. We don't need anybody else dug in. This needs to move forward. So I see there's three options.'",
        "'speaker_2': 'There's always been three options tonight. One is to adopt it tonight. I can support that. I don't know that the support is there from five council members to do that delay. I do not support that. That is kicking the can down the road.'",
        "'speaker_2': 'If we get a chance to vote on the order necessity turn attorneys. What? Which which motion gets voted on.'",
        "'speaker_3': 'First we go in reverse order. So the substitute substitute motion made by Council member Austin and seconded by Council Member Price to place the item on the ballot for November 6th with the friendly of the economic study to return in 30 days.'",
        "'speaker_3': 'If that fails, then you go to the substitute motion to request a study for 30 days. Then you go back to the original motion.'",
        "'speaker_2': 'Okay, so the first motion is November that will be voted on first, correct? That is correct. Okay. The second motion is to do the study, which would.'",
        "'speaker_3': 'Then be voted on if the substitute substitute.'",
        "'speaker_2': 'Fails. So if that fails, kill the study which would forego the November election, would be the second thing to be voted on.'",
        "'speaker_3': 'That's correct. The study couldn't be done in time to make the November.'",
        "'speaker_2': 'Miss the November election, and the third would be to do it outright tonight. That's correct. Okay. So let's so if we just walk through scenarios, if the first vote doesn't receive five votes, which is to put it on the ballot for November, then it goes to the second, which is to forgo November and do a study, which'",
        "'speaker_2': 'I don't know that that has the votes either. And then I don't know if that has the votes. And then you have to enact it tonight, which I don't know if that has the votes from. So city attorney, what happens if all three motions fail tonight?'",
        "'speaker_3': 'That would be unfortunate. Absolutely. That's what I'm trying to get to get analysis. No, under the election code, section 90 215, it mandates that the legislative body take an action this evening. So if all three of these motions fail, it would be up to the chair, in this case, the mayor, to reopen council deliberation.'",
        "'speaker_3': 'And we have the start of discussion until you come up with one of these options.'",
        "'speaker_2': 'So so that said, we need to move forward tonight. Yes. I can support two of these motions. I can support doing it tonight. I can support doing it in November. One way or the other, it's getting adopted in this city.'",
        "'speaker_2': 'I can't support the second option. So in the order that it comes up, if November comes up, I implore the city council to not not get entrenched, adopt that tonight. If that gets the votes, it's done and we can start the process of coming together.'",
        "'speaker_2': 'So. So so that's what that's I'm being very clear about this strategy, so no one can say I wasn't in support of doing it tonight. I'm supportive doing tonight, but I'm also support in support of creating a pathway forward.'",
        "'speaker_2': 'So that's that's what I'm recommending to the council and that that's what I'm going to do. But thank you.'",
        "'speaker_1': 'They could some of Richardson Councilman Mungo.'",
        "'speaker_5': 'Wonderful. So I want to thank everyone who came out tonight. I want to thank those of us who have had dialogs over the last few days. I know that in listening to a lot of the things tonight, there's an importance of.'",
        "'speaker_5': 'The will of the voters, which many of you know, often when I support or don't support an agenda item, when there's a will to put it on the ballot, I usually am supportive of putting it on the ballot because that's what my district feels is good.'",
        "'speaker_5': 'Direct democracy in our direct democracy has some challenges. As many people at the dais talked about, we can't make any changes to what they're voting on tonight at the dais. And so even if we had some modifications that would improve it, we really just don't have those options.'",
        "'speaker_5': 'And so we just need to recognize that that's part of direct democracy. So when Councilmember Supernanny were talking about a study, I think that we've always had the intent that what happened in the marijuana ordinance was how they came back concurrently.'",
        "'speaker_5': 'So I think that where we are today with Al and Susie's friendly allies, motion was this is friendly. I think that really puts us in a place where the whole council can come together because the study was important to some individuals and there was some discussion in the community related to impact.'",
        "'speaker_5': 'Many of you remember back for a measure and that there was no impact of there was no talk about a study and the potential positive or negative impacts. I think that people forget that impact studies should show both sides.'",
        "'speaker_5': 'And so in preparing for that, I wrote a few notes before council tonight and then during the agenda during the dais tonight, a lot of people came to the dais and I tried to write down notes about the things you said to make sure that those things are included.'",
        "'speaker_5': 'Because what's important to me is my neighbor that works at a hotel and what impacts their life and their wage and their opportunities and their benefits and their pension and all of the retirement options and all of that.'",
        "'speaker_5': 'But I know that in sit downs I've had one of them was at Starbucks. I asked for like a side by side comparison of what exists at what places. I know that all the hotels in my district have panic buttons, but I don't.'",
        "'speaker_5': 'I haven't toured every hotel in the whole city to see that that's true. And so there are a lot of back and forth of it. And there's nine of us. And again, we're all trying to do our best to come together.'",
        "'speaker_5': 'So let me. Build on the friendly, if possible. Mr. Councilmember Austin. This would be what I think. For the staff to do their best effort at the following. And 30 days. Please build on the economic data we already have from the Beacon Study and the base study and report back on how the ordinance impacts rates, occupancy, our'",
        "'speaker_5': 'competitiveness for conventions and leisure guests, and what that nexus is on those guests. Impact to our total and sales tax budgeting. And important to us is the number of hotel employees, the number of guests spending in our city and the impact.'",
        "'speaker_5': 'Of their pay, their benefits and the nexus of their buying power and disposable income of hotel workers that live in Long Beach and outside the city. So let me give you an example of why that's important. So many of you don't know that when we were elected to the city council, we weren't able to see a lot'",
        "'speaker_5': 'of the sales tax and total revenue numbers. And so you had a legislative body of the city who had to make major financial decisions, and there were some details that we couldn't see. And one of the things that's really important is that as we've driven down the unemployment number, the ability for those neighbors who used to be'",
        "'speaker_5': 'unemployed to have jobs and now spend in our city is is powerful and we budget based on that. And so I think that goes a little bit to what we were talking about earlier from my colleagues that were primarily on the Budget Oversight Committee with me.'",
        "'speaker_5': 'And so I hope that. Mr. Modica or Mr. West or Charlie, would something along that line be something that would make a best effort at that in the next 30 to 45 days? But it would not delay in any way the November ballot.'",
        "'speaker_3': 'You're correct. That's the point I wanted to make, that there is no because the motion elects item number two, which is to place it on the November ballot. There is no constraint of 30 days. This this is a different type of study than is what is contemplated by the your three options.'",
        "'speaker_3': 'So you can add or detract any of those items that would be accepted as a friendly or not. And you are not constrained by the 30 days because your decision as a elected body tonight is to place it on the November 6th ballot.'",
        "'speaker_5': 'And so my thought would be, if information is available on a flow basis, that it's provided to the Budget Oversight Committee, and if it's not on a flow basis, if it comes back at 30 days or what you have it 30 days with a here's what we'll get in the next 10 to 15.'",
        "'speaker_5': 'Something that gives us some feedback on where we are, because what we don't want is you to rush something and not have answers. We want real data, but I recognize that there are considerable resources in 30 days and.'",
        "'speaker_5': 'I hope that that captured everything I heard from so many people who took the time to be here tonight. And I appreciate that.'",
        "'speaker_1': 'Thank you. Councilwoman Mongo and I just to wrap up all the conversations about about this study, I know we've done these studies in the past when we do ballot initiatives. We've done them concurrently like we did with marijuana.'",
        "'speaker_1': 'And I'm assuming that it would be a city staff driven process and that it would. Like all studies, it's driven by staff. And it looks and it looks at impacts. And you guys can make those decisions as far as the impacts as it relates to the city Councilmember Pearce.'",
        "'speaker_3': 'So, Mr. Mayor, if I may, if we can, just for the record, kind of clarify how we would approach it is staff specificity, I think is important coming from the council so that we're not trying to guess what you want included and not included.'",
        "'speaker_3': 'So having some direction like what was laid out would be helpful. We would bring we would need to bring on a consultant to do this. So this is very high level economic analysis. We have used bay economics in the past.'",
        "'speaker_3': 'They started a study for us on hotels, and that's part of the and it's part of our policy to try to do two pot sharing agreements. We have some of this. We would bring them on. We would have them to work on this scope of work, and then we would check in with you.'",
        "'speaker_3': 'If this is below the city manager's threshold for spending, we would move ahead and identify funding. If it gets too large, then we would be back at council and you would be making a decision on whether to move forward.'",
        "'speaker_1': 'Thank you. Councilmember Pearce.'",
        "'speaker_3': 'Mayor, i'm sorry, councilmember pearce, before you begin, it was the friendly accepted by the councilmember from the eighth district. Can you repeat the friendly? Yes, actually, I can come to build on economic data that the city already has and report back on how the ordinance impacts rates, occupancy, our competitiveness for conventions and leisure guests.'",
        "'speaker_3': 'And what is the nexus on those guests? Impact on the number of hotel employees, the number of guests spending in our city, and the impact on our sales tax projections. And finally, the impact on employees, their pay, their benefits, and the nexus of their buying power, disposable income of hotel workers.'",
        "'speaker_5': 'I appreciate that because I think that one thing that was never talked about in Measure N was that the rates of the employees would all go up and people are making 14 something an hour now. And I think that those employee components are really important to the context of the study, and they're buying power in our city'",
        "'speaker_0': '. Councilmember Austin Councilmember Mongo, I think I mean, you raised some very good points. I think that that study and that information should be one that is employed by the private sector in the hotels. I think I think the what if I understand the the friendly that that is already on the table and I ask for clarification.'",
        "'speaker_0': 'It was mostly regarding impacts from the city, right. Because there is a regulatory component in this ordinance. Right. That gives the city regulatory authority that may require us to to to staff up to to to implement that. And so I'm mostly concerned, I think and correct me if I'm wrong.'",
        "'speaker_0': 'Councilmember Price, I think we're mostly concerned about that.'",
        "'speaker_7': 'Yes, that was that was the intent of my friendly initially is to focus on what the impact to the city would be so that we can plan ahead and budget accordingly.'",
        "'speaker_5': 'So just to clarify, what we budget for right now is total and sales tax. And so what I was trying to get out through that was the nexus of how our hotel workers impact that. So for instance, the ordinance restricting the number of square feet may result in more people being employed, which more may result in more'",
        "'speaker_5': 'people having spending power in the city. I was just trying to Nexis that all together based on the things people inside.'",
        "'speaker_1': 'Okay let me I wanted I have a the long speaker's list still so I just want to keep moving forward. So Councilman Austin, I think I just want to make sure that we there is a that your motion is the impact as it relates to the city administratively.'",
        "'speaker_1': 'I think what Council Mango is proposing was beyond was beyond that. And so are you at this point. Are you accepting that?'",
        "'speaker_0': 'I don't think I can accept it at this time. I think I still think we have some some time as a council. And what I said earlier is that I don't want to get into that trying to to get into all of the details this evening.'",
        "'speaker_0': 'I think, you know, it's late. We've been here for several hours, several hours sitting here. I like to be fresh in terms of understanding that question. And I don't know that we have to do that and put that with this this this, this motion.'",
        "'speaker_1': 'Thank you, Councilmember.'",
        "'speaker_3': 'Councilmember Pearce.'",
        "'speaker_5': 'And thank you very much for for that clarification. I support Councilmember Austin. I think that the question I do have is how does this impact city staff? I know I recall whenever we were having the conversations around wage staff that we talked about having a dedicated person, a labor person, is that do we have that person?'",
        "'speaker_5': 'What's that staff look like? Is this somebody that could help us with that? Those kinds of questions about once the voters vote to pass this policy, which they will do when they do that, how are we as a staff, as a city, going to be impacted?'",
        "'speaker_5': 'And I do think that there are a lot of studies that we already have out there that have already been done and us paying for. And another study is deserving of a conversation where we expected to have that.'",
        "'speaker_5': 'And I don't know that that detail of a study was something that we came into the room considering tonight. So that is my my talking points now that I'm going to hear from everybody else.'",
        "'speaker_1': 'Thank you, Vice Mayor Andres.'",
        "'speaker_4': 'Yeah, yes. Thank you, Mayor. I want to be brief because we have heard a lot of dialog and I think tonight is once again, we brought up some very sensitive matters and we need to reach points that allow us to move forward.'",
        "'speaker_4': 'I believe that our workers need to be protected and that is how much of that cost in money to provide the safety and that measure, you know, which is why I am disappointed that it even had to resolve and to bring it to the city city council.'",
        "'speaker_4': 'I think we could have done that even before now. I do not like to impose on businesses, but people have spoken. Signatures have been gathered and there's a need to be addressed and workers need to be protected. I would like to see this issue placed in front of all of the voters in November and not exclude anybody's'",
        "'speaker_4': 'voice or opinions. But I also want us to determine a prior to November's election that this item, of course, you know, as a city, we need to think about both sides and we both sides need to think about each other.'",
        "'speaker_4': 'And I want to thank you for that.'",
        "'speaker_1': 'Thank you. I'd like to I'm going to go to Councilwoman Pryce and the courtroom, because I know I want to I want to make some comments as well. So let me let me just get back to the speaker's list.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_7': 'Okay, so just so I'm clear, the friendly for the economic said. On the impacts to the city was accepted. Yes. Okay. And it does the city management team feel that they have enough direction on that to move forward?'",
        "'speaker_3': 'So as we understand it, we would still be using a consultant to be able to look at this because you would be doing the administration of the tax that could be done in-house because we would know how much would have to be collected.'",
        "'speaker_3': 'But the revenue generation impact, when we start to look at what the hotel costs would be, how much that generates to what we would use that, that is a smaller scope than the other one. If there's anything else the council would like to add, otherwise, we would focus on those two areas that impact on our budget through'",
        "'speaker_3': 'the total.'",
        "'speaker_7': 'And any staffing costs associated with compliance on behalf of the city. Because I think it's contemplated that city would be the compliance officer on the workload restriction piece. So are we going to have to hire someone to go out and measure square footage and that kind of thing?'",
        "'speaker_7': 'And is that going to be a full time person? And I think maybe just even if it's not fully detailed, maybe finding out what Emeryville and Seattle are doing might help us in identifying what we think our our needs will be.'",
        "'speaker_7': 'And because that will be important, I think, for us as we forecast the future budget. Thanks.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Gonzalez.'",
        "'speaker_8': 'So, city attorney, can you clarify again for me just so we can get this straight? And I want to make sure we have all of our information in front of us if if for any way, it doesn't seem like it, but if for any reason we were to vote outright to pass this ordinance, can you provide the'",
        "'speaker_8': 'timeline again and clarification on that? Because I'm getting a little fuzzy on that.'",
        "'speaker_3': 'So. Councilmember Gonzalez. Yes. So we're going to vote in reverse order with Councilmember Ralston's substitute substitute motion.'",
        "'speaker_8': 'We were voted on for if the sub sub was out.'",
        "'speaker_3': 'Okay. So if we get all the way, if we get to the main motion, your question is a good one on the what is the effective date? If council were to adopt it this evening and section three of the draft and Citizens Initiative states and I quote the proposed ordinance that is the subject of this initiative once'",
        "'speaker_3': 'approved by the voters at the November 6th election, where such other election as authorized by law shall be deemed adopted upon the date the vote is declared by the City Council and shall go into effect ten days after that date.'",
        "'speaker_3': 'So my interpretation of that and it was we weren't reading the election code, you were adopting it this evening. If your motion were to pass and ten days after that date, it would in theory go into effect. I think in reality here it's going to take longer than that for it to be implemented because we would have'",
        "'speaker_3': 'to work to get geared up and regulations. We'd have to give notice to all of the hotels. There's going to be a time period where we can't issue or demand their enforcement immediately just because in reality we won't be ready.'",
        "'speaker_8': 'Okay. So ten days from now would be August 17th. Right. I mean, plus seven plus 7%. So just walk clear. But you're expecting that to be longer, but just because of the time and energy on your end and our end to be able to get that.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_7': 'And then after that.'",
        "'speaker_3': 'You know, the section and I'm not blaming the author of it, but didn't contemplate a possibility of it being adopted by council on August 7th. So it's not clear the intent of this. But I'm trying just as we sit here tonight, if you adopted, I will do some more research and probably come back to you and have'",
        "'speaker_3': 'an effective date that we can realistically implement.'",
        "'speaker_8': 'And could we I mean, is it possible for us to suggest a date if we were to say.'",
        "'speaker_3': 'I don't think that that's possible, because the way the election code says is you have to adopt it either this evening or within ten days. And tonight is the last opportunity that the council has to make the November six ballot.'",
        "'speaker_3': 'Everything has to be to the county by Friday. So that no, I don't think you can suggest a date. Nor could the proponents of the initiative, since they've already submitted the signatures. Now it's a citizen's initiative.'",
        "'speaker_8': 'Okay. But we're expecting maybe late August, September, just throwing it out there if if it if the subset was the outright. Okay. Just getting that clear. So I will just ask because I have this opportunity to sit here and ask and I want to just ask this if the maker of the sub sub motion would be willing'",
        "'speaker_8': 'to withdraw that motion for us to go back to the original motion, I don't know if that's even possible, but I have to ask because I think it's.'",
        "'speaker_3': 'One of the if I may, on a point of order, the substitute motion, substitute substitute motion has been made and seconded and amended. It's now a motion of the body. So the maker of the motion doesn't now own it.'",
        "'speaker_3': 'To withdraw, it has to be with a consensus of the council. So you would need a vote?'",
        "'speaker_7': 'Well.'",
        "'speaker_8': 'Yes.'",
        "'speaker_6': 'No.'",
        "'speaker_1': 'Let me make some comments. I want to I want to I also want to make some comments as well. And I know that everyone said.'",
        "'speaker_8': 'They wanted to put it out there because I want to make sure we have all of our bases covered. And if we have the ability to work on this and get somewhere where I think we could be, then I'm going to just at least ask and I know that there's obviously Robert's Rules of Order and all that'",
        "'speaker_8': '. So we have to abide by. But I think, you.'",
        "'speaker_1': 'Know, thank you. And I want to I want to obviously thank all the other council members that spoke. And I do want to make some comments tonight that I think are important to make. And I know that we've had a lot of discussion tonight.'",
        "'speaker_1': 'A revolving is law and the ordinance and the law that's in front of us. And I just I know on a few occasions there's been some discussion about the actual merits of what's in front of us today. And just as a reminder, I think, to all of us and especially the public, because I have read some of'",
        "'speaker_1': 'this online and in the news, that there is no option to not send this to the public. You either adopt it or it's going to be voted on by the public. There is no more debating what's actually in the actual policy itself, whether folks may not like what's in the policy, but that's what was what was collected'",
        "'speaker_1': ', the signatures, and that's what's been in front of us. We know that our hotels are an incredibly important part of our economy, and we know that our hotel workers are driving that success and that economy. I want to note that when Measure N came before us as a party, I was a I was a council member at'",
        "'speaker_1': 'the time, and it was a very difficult decision. In fact, Councilman Pearce was on the other side of the dais advocating for measure and as well as a lot of folks here were as well, that was to increase the wages for hotel workers to ensure that we were achieving living wages.'",
        "'speaker_1': 'I supported that measure. I endorse it, campaigned for it, and I believe that measure had a great and good impact on the city of Long Beach, the measure, and did not cause the gloom and doom that many folks said it would cause.'",
        "'speaker_1': 'In fact, we know that our hotel industry today is booming and successful, and I think we're all grateful for that. We all want our hotels to succeed. We have great hotels and great places across the city for people to enjoy.'",
        "'speaker_1': 'And I think that's been noted at this council, I think has consistently invested in our tourism economy, whether it's been as as has been stated through our total agreements or investment agreements, investing in the aquarium in the entertainment district.'",
        "'speaker_1': 'I think the city continues to to make those investments. We've heard a lot tonight about protecting women. And that's incredibly important. And I think as a as a man myself, I think it's important for men to always believe, respect and listen to the stories of women.'",
        "'speaker_1': 'And so I honor those stories and those experiences that were that were talked about tonight. But I want to touch on another issue tonight that has not been discussed and I think is important. And that's the issue of representative labor.'",
        "'speaker_1': 'I have strongly believed for a long time, and I continue to believe that low wage workers are almost always better off when they are represented by unions. Yeah, we as a as a as a body. As a body, I am proud that this body has passed a numerous policies that support and have supported both low wage workers'",
        "'speaker_1': 'and the hard working men and women of our labor force. Whether it's been through project labor agreements or whether it's been through raising the minimum wage, whether it's been through our own interactions with our own employer unions. And there is no question, I think the evidence and the science is clear that particularly in low wage sector jobs'",
        "'speaker_1': ', you want those folks to be able to be represented. And it's it creates a stronger, long term economy. Now, there are some folks that I know don't agree with that. I believe in that. I think that's something that is is a truth when it comes to the economy.'",
        "'speaker_1': 'And I think it's important to be honest, because I know we we I think for all of us, we haven't had this discussion much in the dais. And I will honor the piece about about sexual assault. But I think that we should also know that this law, I believe, would also encourage more representation for the workforce.'",
        "'speaker_1': 'And I think that over time, that's something that I think is a good thing. Anytime you can have more workers represented is is positive. I want to also just say tonight that over the last ten years that I've been on the council, this issue has come.'",
        "'speaker_1': 'This issue of the voters bringing something forward has happened to me three times while I've been serving on this body. One was once was with Measure in which we voted two to put on the ballot. One fourth was Measure O, which we voted to put on the ballot, which failed.'",
        "'speaker_1': 'And fortunately, there was a small cadre of us that supported Measure O and it did not pass. And, and once with with Measure Amount, which was recently done through the marijuana initiative, which the voters took, which we moved forward and did a concurrent study, all were forwarded to the ballot.'",
        "'speaker_1': 'I know that we're debating and it looks like continuing to discuss three items in front of us tonight. I just want to be clear that of the issues in front of us, I oppose strongly the idea of doing a study that would.'",
        "'speaker_3': 'Delay.'",
        "'speaker_1': 'Our ability to have this, if that's the will of the council in November. And so the second motion that's on the floor, which would push this to 2020, I don't think is fair to the people that signed the ballot and that signed their names to that petition.'",
        "'speaker_1': 'I'll also say, because this is just for me, a question of democracy. And it just I you know, it bothers me on occasion is if I don't want to ever want to ever judge someone that signs their name to a petition regardless of what lead someone to sign that that petition.'",
        "'speaker_1': 'That's like casting your vote. You put your name on a petition, and it's not our job to verify the signatures. It's the job. It was the job of the county clerk. And those signatures are verified. So this petition is is moving forward.'",
        "'speaker_1': 'And so I just wanted I wanted to make sure, as we continue this conversation, to just lay out that I don't support that motion. But I also respect everyone's position as far as as far as where they are and wanting to get to a place where we can have consensus on moving forward.'",
        "'speaker_1': 'And that's, I think, where we are right now. Councilmember Supernova.'",
        "'speaker_2': 'I would just like to make one point of clarification for the city attorney. I believe you said this earlier, but it's been mentioned twice by members of the dais and in spite of a derogatory remark, yelled from the audience, Alternative three does not automatically delay the item.'",
        "'speaker_2': 'You could have a study and then council could adopt it. So I just want to make that point of clarification.'",
        "'speaker_1': 'Mr. PUCKETT.'",
        "'speaker_3': 'That's correct. The the impact of the timing that we are faced with with the upcoming November election is what eliminates one of your alternatives. When that study comes back, you could still adopt it when the study came back that night at the dais.'",
        "'speaker_3': 'That is correct.'",
        "'speaker_2': 'Thank you for that clarification.'",
        "'speaker_1': 'Now that that's true, absolutely.'",
        "'speaker_0': 'Councilman Austin Carver, the question.'",
        "'speaker_1': 'Okay. Okay. So there's no there's no. Well, we've got the question's been called. So there is a motion and a second to to move this item to the November election with a concurrent study on the impacts that would be regulatory to the city as to the city.'",
        "'speaker_1': 'So, members, please go ahead and cast your vote.'",
        "'speaker_8': 'Motion passes unanimously.'",
        "'speaker_1': 'Okay. Well, thank you very much. And I want to thank everybody for coming out. This will be on the November ballot.'",
        "'speaker_3': 'And with that.'",
        "'speaker_1': 'We're going to go ahead and take a five minute recess. We'll take a five minute recess and then we'll continue the rest of the council meeting.'",
        "'speaker_6': 'Democrats say November three. They got it over a year, four years to four years to make the schedule.'",
        "'speaker_9': 'Three, three months. I do. But. Oh.'",
        "'speaker_6': 'And. Oh. Doo doo doo.'",
        "'speaker_9': 'Doo, doo doo.'",
        "'speaker_1': 'Okay. Let me go ahead and continue the council meeting. I want to just make a make an announcement that we are calling for argument writers for. Well, actually, I need to do it all again. So let me do the role first.'",
        "'speaker_8': 'Councilwoman Gonzalez, Councilmember Pierce, Councilwoman Price, Councilmember Superman.'",
        "'speaker_3': 'Here.'",
        "'speaker_8': 'Councilwoman Mongo. Mayor. Vice Mayor Andrews. Council Member. Your UNGA Councilman Austin. Councilmember Richardson. Mayor Garcia.'",
        "'speaker_1': 'Thank you. We are going back. So let me just make first an announcement that we are going to call for argument writers for this for the measure that was just adopted on the on the ballot. And so if you have questions, please contact the city clerk's office.'",
        "'speaker_1': 'And I believe those will be available beginning tonight. Is that correct? Okay.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'So let's go back to the agenda. We do have, I believe, some general public comment. Is Janet Watt here? Marina Rosales and Robert Lucero.'",
        "'speaker_2': 'Is it Janet with.'",
        "'speaker_1': 'It says Janet. Janet West. Sure. Janet West is west. Okay. Is Maria is Alice or Robert Lucero here? Okay. So let me move on to the next item on the agenda. The results of the debate.'",
        "'speaker_5': 'Oh.'",
        "'speaker_8': 'So the results of the ballot tabulation show that total votes cast were 46 total votes cast, yes. 76.72% total votes cast. No. 23.28% of the votes cast. Yes. Equals 76.72% of the total votes cast. There is not a majority protest.'",
        "'speaker_3': 'Graduations, graduations to the summer. What that means is then we could be. We need emotion and a second to adopt the resolution establishing.'",
        "'speaker_1': 'I think there's emotion. I don't know what Counselor Richardson. What?'",
        "'speaker_6': 'He was emotional.'",
        "'speaker_1': 'Sure. But I think that we need to be here for the emotion.'",
        "'speaker_6': 'Right? Good for him. I think now can move it.'",
        "'speaker_1': 'Well, let's see if he's in the back.'",
        "'speaker_3': 'Emotion.'",
        "'speaker_1': 'I know. He wanted to make the motion. The various. Okay. So Councilmember Richardson and Councilman Austin, there's a motion for second. Let me see if Councilman I think Councilman Richardson wanted to make some comments.'",
        "'speaker_6': 'I hope this plan continues to buy me a path.'",
        "'speaker_2': 'Well, thank you, Mr. Mayor. I got to say, you know, when we started this conversation about the Uptown Business District six, six years ago, folks said, hey, North Palm Beach would be ten years until you're ready for a business district.'",
        "'speaker_2': 'And by that clock, we wouldn't have even if we listened to that, we wouldn't even be where we are today, which is renewing for ten full years. So I think that says a lot about how North Long Beach has how far we've come.'",
        "'speaker_2': 'But this is at no point time to rest on our laurels. Now's the time, frankly, for us to get back to basics, focus on, you know, clean, safe. Make these property owners, the few that did vote against this, make them understand the value and the benefit that we're providing through this Uptown Business Improvement District.'",
        "'speaker_2': 'So thank you to everybody who did work hard on this. I think if you any way you slice it out. Do we have. So, Eric, even if we take the city votes out, what was the win percentage? So without the city vote.'",
        "'speaker_3': 'The it would still passed with 57.5% in favor and 42.5% against.'",
        "'speaker_2': 'Even if we take out the school district vote.'",
        "'speaker_3': 'It would still pass that 52%.'",
        "'speaker_2': 'And that's that says a lot because, you know, there was a lot of questions last time. The city owned a lot of property. But, you know, now that property has been disposed, that successor agency property, but we've maintained that support from those large property owners.'",
        "'speaker_2': 'I think that's a lot to be said about how far we've come. So thank you. And I'm very, very proud to support this. Councilman Austin, this is one for the books. So.'",
        "'speaker_1': 'Councilman Austin, thank you.'",
        "'speaker_0': 'And I also would just like to echo those comments. I would like to thank the obviously, the Uptown People staff, Tasha and the board, the neighbors, the business owners who were involved in and this this process. I'd like to thank my staff who actually did some some door to door made phone calls.'",
        "'speaker_0': 'I personally met with a few property owners to encourage them their support for this this process. This is a this is a win for for North Long Beach, our Atlantic corridor, Artesia corridor, the way we Rex and I often, you know, banter over who coined the phrase the uptown renaissance.'",
        "'speaker_0': 'But the Uptown Renaissance, I think, was first said by me, but it is still alive and well. And we are we're going to be thriving. Looking forward to some great developments and prosperity with the uptown be. Congratulations. Get out of here.'",
        "'speaker_2': 'I'm not giving him a click. Steve Neil Coyne uptown. Thank you.'",
        "'speaker_1': 'There's a motion and a second as there any public comment on this item. CNN, please cast your vote. Okay. Great. Next up is. Well, let me wait till the votes get cast.'",
        "'speaker_8': 'The motion carries six.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a Third Amendment to Contract No. 34587 with All American Asphalt, of Corona, CA, for as-needed street improvements, increasing the contract amount by an additional $15,000,000, for a revised total amount not to exceed $55,000,000.  (Citywide)": [
        "'speaker_1': 'Thank you. Next item is going to be.'",
        "'speaker_8': 'Item 32 Report from Public Works Recommendation to execute a Third Amendment to contract with all American asphalt for as needed street improvements. Increasing the contract amount by an additional 15 million citywide.'",
        "'speaker_1': 'There's a motion and a second. Any public comment? Call it. Okay. On this item. Right on the asphalt. Yes. Please come forward about it.'",
        "'speaker_6': 'Okay. Here's another.'",
        "'speaker_3': 'Hi again, Jacob. Were second district. So I have reservations about the American asphalt contract because as I understand it, they are currently being audited by the city auditor's office. So I'm out of breath. Furthermore, I got some tweets.'",
        "'speaker_2': 'Somewhere that I wrote it all down on the.'",
        "'speaker_3': 'The nature of the $15 million that they're asking for. The agenda item itself was only about two pages. They listed they say that there's six items that are the costs of ballooned in an unforeseen manner that they didn't account for.'",
        "'speaker_3': 'I don't know, government contracting, but it's the sort of thing where they did not in the agenda item they don't specify what these are, what the current contracted rates are, what the new projected prices are, any alternatives. But they do say that one of the projects is for airport resurfacing.'",
        "'speaker_3': 'But I also noticed that LGB got an FAA grant to the tune of $15.3 million to do exactly all that work as I understood it. And I don't know. I'm just not sure. Sorry. I'm out of breath and this is not a good comment.'",
        "'speaker_3': 'But yeah, I would really be.'",
        "'speaker_2': 'Hesitant to just approve this outright.'",
        "'speaker_3': 'And I would ask the council to wait until Laura Dodds work is finished on the audit. Thank you.'",
        "'speaker_1': 'Thank you. There's a the motion in a second is do do we have a response to the order question. I think that's I should be addressed.'",
        "'speaker_3': 'We're not aware of an audit, but Craig's here to talk about the project if you want. It's listed.'",
        "'speaker_1': 'I mean. Well, let me maybe maybe the maybe Mr. Beck can refer to that. Thank you.'",
        "'speaker_4': 'You may remember city council. I am happy to address that. The city auditor's office has reached out and to my knowledge is auditing a number of large contracts within the city, including the All American asphalt contract. We've been working with Auditor Dodd's office for probably six months.'",
        "'speaker_4': 'We thus far have not received a final report or an A had them identify any major issues. I can also speak to the items that were requesting cost increases that the Council would like that.'",
        "'speaker_1': 'We have the report. Is any council councilmember need additional information? No. Okay. Go ahead. Okay. So there's a there's a motion in the second in front of us. Councilman Mango Councilman Austin. Nope. Okay. Please cast your votes.'",
        "'speaker_4': 'See this.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Section 14.04.015 relating to work within or on a public street or right-of-way, obstruction of a public street or right-of-way, read and adopted as read.  (Citywide)": [
        "'speaker_8': 'Motion carries.'",
        "'speaker_1': 'Thank you. Next item is item 30 for.'",
        "'speaker_8': 'Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to work within or on a public street or right of way. Obstruction of a public street or right of way read in adopted as read citywide.'",
        "'speaker_1': 'Is there any public comment on this item? Please come forward.'",
        "'speaker_5': 'Janet West, fourth District. Imagine my surprise when I heard that a city employee came to my door and asked for the removal of no. I measure M signs from the right of way. So I am wondering if this.'",
        "'speaker_6': 'Will.'",
        "'speaker_5': 'If if people will not be allowed to put political signs on their right of way without getting a permit. It says you need a permit to obstruct any public street or public right of way for any reason. Abstract definition prevent or hinder movement.'",
        "'speaker_5': 'Someone or someone in motion. So my questions, which I hope the city attorney will answer, is Would this require obtaining a permit in order to put political signs or other signs like slow children present on the right of way?'",
        "'speaker_5': 'And if yes, how would equality of removal of signs be monitored?'",
        "'speaker_1': 'Mr. City Attorney, do you want to briefly comment on that?'",
        "'speaker_3': 'This this agenda item is not targeting signs in the public right away. We don't issue permits for signs in the public right away. This ordinance is intended to help the city enforce during construction projects. When we issue construction permits and they don't follow the terms and conditions of the permit and block the public right away, maybe block'",
        "'speaker_3': 'a lane of traffic without a permit. That's what this ordinance is geared towards.'",
        "'speaker_1': 'Thank you. We have a motion on a second. See no other public comment. Please cast your votes.'"
    ]
}