{
    "Recommendation of the Personnel and Civil Service Committee to receive and confirm reappointments to the Harbor Commission (2 reappointments); and Water Commission (2 reappointments).": [
        "'speaker_2': 'Actually, I just got the new updated schedule. If the council doesn't mind. I'm sorry, I just saw it. We're going to take one item before this. If you don't mind, I apologize. We're going to take item 22/1 so that we can get these folks, our commissioners that are waiting.'",
        "'speaker_2': 'Moving on. And then we'll go up and then we'll move on to item 23. Then we will begin the budget process with Vice Mayor Lowenthal. Okay. So item 22.'",
        "'speaker_1': 'Communication from Councilman Austin, Chair Personnel and Civil Services Committee recommendation to receive and confirm re appointments to the Harbor Commission and Water Commission.'",
        "'speaker_2': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And it is my pleasure to announce that the the Personnel and Civil Service Committee did meet last Tuesday and made recommendations to reappoint the following individuals to to the Harbor Commission, Lou. Ann Bynum to an at large seat.'",
        "'speaker_7': 'Doug Drummond to an at large seat as well to the Harbor Commission. And on the Water Commission, we'd like to reappoint Arthur Levine and Harry Salts, cover all our outstanding standing residents. All have contributed to our city, both as commissioners, but also in their private lives as well.'",
        "'speaker_7': 'And so I recommend. Approval of the committee's recommendation. I so move.'",
        "'speaker_2': 'Okay. There's been a motion and a second to approve Councilman Richardson on price.'",
        "'speaker_8': 'Just want to congratulate our commissioners. You're doing an excellent job for us and at least two of you are residents of the third. So I thank you for being active members of our community and for your service on the commissions as well as and so many other things like Councilmember Austin just mentioned.'",
        "'speaker_8': 'So thank you.'",
        "'speaker_2': 'Thank you, Councilman Andrews.'",
        "'speaker_4': 'Yes, thank you, Mayor. You know, I'm very impressed with vote of the individuals, Lou. And and the job that they've done as leaders is really impeccable. And she is a great role model. And I feel that Long Beach is so lucky to have her on the Harbor Commission.'",
        "'speaker_4': 'And Doug Drummond has been one of the greatest leaders as well, and that Mr. Drummond is doing just as almost every event that I've had in my district, you know, which is makes it very, you know, exciting for the individuals, you know, from the sixth District that we do have, you know, an individual in the harbor department'",
        "'speaker_4': 'that is really in favor and they are with our community. So I really want to think that and Mrs. Suzanne and all the rest of the individuals from the Harbor Commission to let you know that we are really, truly behind you.'",
        "'speaker_4': 'And we hope you continue to be, you know, behind us. Thank you very much, Doug. Congratulations to both you and the way.'",
        "'speaker_2': 'Thank you. If we can just please have any public comment on the item. Say Nonmembers, please go ahead and cast your votes. And of course, I want to congratulate you all. I've already done it in person, but congrats again to our re-appointed commissioners as they continue to serve.'",
        "'speaker_2': 'Everyone's locked up waiting for one workout. There we go.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation of the Budget Oversight Committee to receive the summary of responses to the Long Beach Budget Priority Survey and Long Beach Budget Challenge.": [
        "'speaker_2': 'Thank you. Congratulations again. I look forward to to the service. Now we'll be moving item to 23 before we go back to the to the budget process. Thank you.'",
        "'speaker_1': 'Communication from Vice Mayor Lowenthal, Chair Budget Oversight Committee Recommendation to receive the summary of Responses to the Long Beach Budget Priority Survey and the Long Beach Budget Challenge.'",
        "'speaker_2': 'Thank you. However, motion in a second. So to turn this over to staff and have them do the report. We heard council members, thank you very much.'",
        "'speaker_5': 'We had the opportunity to make this presentation to the Budget Oversight Committee recently, and we're happy to do it before the Council addresses the full budget. Geoff Hall of my office will walk us through the items.'",
        "'speaker_9': 'Honorable Mayor and members of the city council. The Budget Priorities Survey and the budget challenge were implemented in response to the City Council's interest in obtaining resident feedback regarding their budget priorities prior to the adoption of the FY16 Budget.'",
        "'speaker_9': 'The survey tools went live on August 1st and the results were summarized based on the responses received as of yesterday afternoon, September 14th. It's important to note that the survey tools do not preclude multiple responses from a single individual, nor do they attempt to balance the responses from all segments of the community.'",
        "'speaker_9': 'For the Budget Priorities Survey participants were asked to rate 35 city services as being very important. Somewhat important, not very important or not at all important. The survey was available online and through hard copy handouts, which were distributed at community budget meetings.'",
        "'speaker_9': 'Hard copies were available in English, Spanish and Tagalog. 610 survey responses had been received as of September 14th. Looking at the demographics of the sample, why we did have participation from residents in each council district. The majority of residents were respondents were located in districts three, four and five.'",
        "'speaker_9': 'As far as age is concerned, two thirds of the respondents were 50 years or older. And for household size two person household was the predominant category. To provide a means of comparison of the results. Each response to each service was assigned a weight very important to four points.'",
        "'speaker_9': 'Somewhat important three points. Not very important two points and not at all important one point. The total points for each service was divided by the number of responses received for each service to obtain a weighted average. When considering the results, it is important to remember the general demographics of the respondents.'",
        "'speaker_9': 'The results may have been different if a scientific sampling methodology had been utilized. This slide shows the highest rated services with the line signifying the top ten. I won't take the time to read them. But I did want to to make note of the fourth item listed.'",
        "'speaker_9': 'Maintaining or repairing public buildings rated higher than one might one might have expected. We believe this can be attributed to the fact that more than 40% of the survey respondents submitting comments expressed a desire that the city fund infrastructure improvements at Rancho Los Alamitos and this service directly speaks to their interest.'",
        "'speaker_9': 'This slide shows the services in the lower half. It is interesting to note that only six of the listed services had an average weighted score under three. In other words, it could be said that services are generally viewed by the survey sample as being at least somewhat important.'",
        "'speaker_9': 'Again, the ranking of the services should be viewed in relation to the demographics of the sample. 321 written comments were received. As I mentioned a moment ago, the supporters of Rancho Los Alamitos were very well organized and trying to call attention to its needs.'",
        "'speaker_9': 'The remainder of the comments considered a wide variety of topics, big and small. They include, but are not limited to public safety parking sidewalks, traffic libraries, survey format and pensions. An updated summary of these comments have been provided to you for your future reference.'",
        "'speaker_9': 'The budget challenge provides the participant an opportunity to balance the city's general fund budget while deciding if existing funding levels should be changed. It is worth noting that the budget challenge was designed to be an educational tool, as well as a means for gathering public input.'",
        "'speaker_9': 'Participants are exposed to the complexities of balancing their interest with available budget resources. It requires a fair amount of effort to complete, and the choices may be difficult for some. For each department or group of departments, participants could choose a status quo cut by 2%, cut by 5%, increased by 2% or increased by 5%.'",
        "'speaker_9': 'Participants could also choose to increase revenues to enhance services without reducing services in others. Revenue options included a sales tax increase, duty increase or partial tax. 200 responses had been received as of yesterday afternoon. Only 60% of the participant participants actually completed the challenge.'",
        "'speaker_9': 'Many simply abandoned the budget challenge after taking a look at it or completing one or two sections. With such a small sample, the results should not be considered to be representative of the public at large. Looking at the Demographics Council districts, three and five had the largest number of participants with complete responses.'",
        "'speaker_9': 'And the 50 plus crowd were again the most active in the in the age categories. Several other demographic questions were asked, such as education level and homeownership. But the response rates were insufficient to warrant summarization. Looking at the results.'",
        "'speaker_9': '52% of participants increased both expenses and revenues, with revenues being sufficient to offset the expenses or and or to produce a surplus. 18% just cut expenses to create a surplus. 17% cut expenses, but also increased revenues, thereby producing a surplus.'",
        "'speaker_9': '5% opted for the status quo. 6% increased expenses but did not increase revenues. Creating a deficit. Lastly, 2% left expenses as they are, but increased revenues creating surplus. In summary, 71% of respondents increased revenues to support increased expenditures and or to increase or to create a surplus.'",
        "'speaker_9': 'The results by Department of Revenue type can be found in the original report. There are no significant changes to the present percentages due to the increase in the number of participants. A few comments were also received through the budget challenge.'",
        "'speaker_9': 'These included police and fire deeds, pensions and benefits. Budget challenge format. Increased fees. And tax increases. This concludes my report, and I would be happy to answer any questions you might have. But.'",
        "'speaker_2': 'Thank you. Vice President Did you have any comments?'",
        "'speaker_6': 'Me too. I just wanted to share that. The BBC felt it important for our colleagues in the public to hear the outcome of the budget survey and the challenge. So I want to thank staff for that thorough report.'",
        "'speaker_6': 'I know it's a short timeline for development and marketing to the public, but we did feel that there were lessons learned for the next year's budget cycle and we thought that we were off to a great start. So I want to thank you for your efforts and.'",
        "'speaker_6': 'That's it for me, and I'm happy to make the motion.'",
        "'speaker_2': 'Thank you, Councilman Richardson. Give me comments. Nope. Councilman Mongo.'",
        "'speaker_1': 'I, too, want to thank the the staff who put this together. And I want to thank the over 100 residents of the fifth District who took the time to take the survey. I see that there was a comment about how many people filled out the survey.'",
        "'speaker_1': 'I calculate it by counting on page four that it's actually closer to 500 participants, which is is really remarkable. And oftentimes people say that when they're happy with government, it's when they participate the least. And I think that this is a good group of individuals who really were passionate.'",
        "'speaker_1': 'I know I received calls in our office and they realized that these are the tough decisions. You can't abandon the budget process in the middle of the survey when you're sitting up here. So thank you to those who took the time.'",
        "'speaker_1': '52% increase in taxes. And that's surprising. I know that I'm going to continue to stand by not increasing taxes as long as we can, because I know we have a lot of needs. But increasing taxes is a rough go.'",
        "'speaker_1': 'And I'd love to see in the future where when someone marks the box such as increased sales tax revenue, that there could be some maybe comments that say it shows that when sales tax amounts increase, sales change or what those look like because it's never just a straight comparison, there's always equilibrium that really go into play.'",
        "'speaker_1': 'So I've enjoyed this and I look forward to it growing into something a little bit shorter and more robust next year so that people won't abandon the survey. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Pryce.'",
        "'speaker_8': 'I, too, want to thank staff for your excellent work on this. This agenda item came to you in June requesting some assistance with survey methodology, and the staff really pulled this together in a very quick time frame. And I know that with additional time, you would have had the opportunity to do more outreach.'",
        "'speaker_8': 'But I find survey data to be very useful. It does it answer all questions? Absolutely not. But it does provide me some insight into what the majority of my residents who are engaged are thinking and where their priorities are.'",
        "'speaker_8': 'And I have to say, there were very few surprises in the results that that I saw. So I thank you for putting this together. I look forward to enhancing it and making it better and disseminating it on a broader scale for next year.'",
        "'speaker_8': 'So thank you very much.'",
        "'speaker_2': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And I, too, want to thank our staff for for making this information available to us. I want to thank all of the residents who attended the budget meetings and took time to give us this feedback and also want to thank the council members led by Councilmember Price for for bringing this forward and I think assisting'",
        "'speaker_7': 'us with this this budget process this year when we've had budget meetings in the past in my district, we've always done a survey. I never thought to do it on a citywide level. And so now that we're doing that, we have some consistency.'",
        "'speaker_7': 'But it also gives, you know, some of our our groups who are poor, who want to have a voice in the process, a greater voice. It gives them an opportunity to to, to to advocate for the special projects that they'd like to see in our budget and the direction that they'd like to see us go.'",
        "'speaker_7': 'So great job all the way around for everybody. Thank you.'",
        "'speaker_2': 'Thank you. We have a motion and a second. Is any public comment on the item? Seeing none. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt the Mayors proposed budget recommendations, as amended, to the FY 16 Proposed Budget.  (A-10)": [
        "'speaker_2': 'Thank you. Now we're going to move on to the continued hearing, which is continued hearing one, but beginning with item 15, which Vice Chair Lowenthal will walk us through the next few items and then we will take a break from the budget and then come back to it after we've gone through public comment and some other items'",
        "'speaker_2': '. So. Vice Mayor Lowenthal.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Frank is just handing out. Some material for us. So Councilmembers Item 15 is the mayor's fiscal year 16 proposed budget. It corresponds with a Dash ten and the motion is to approve the mayor's proposed budget.'",
        "'speaker_2': 'And investment advice. If you want to just walk through, even the emotions are, Oh, no, no, I want to make sure that.'",
        "'speaker_6': 'I will go through the item. So for the mayor's recommendation, we have $600,000 from general fund fiscal year, 15 state mandate reimbursement funds, and the use will be toward opening three branch libraries on Sunday for a total of $183,000.'",
        "'speaker_6': 'Increased crime analysis resources for a total of $100,000. My Brother's Keeper Project for a total of $30,000. Arts Council Support for a total of $50,000. Be Safe program for a total of $186,000. And then improvements to 309 Pine Avenue for $51,000.'",
        "'speaker_6': 'Secondly, there's $100,000 recommended, which is a drawdown from fiscal year 16, general services beginning funds available. And this would be for the telephone system at $100,000. Lastly, $95,000 drawing down from fiscal year 16, refuse beginning funds available to be used for one time purchase of two clean team trucks at $95,000, and the amount is in total those'",
        "'speaker_6': 'three items, $795,000. Those three source items.'",
        "'speaker_2': 'Okay. So we have a motion in a second. Any public comment on the first item? Saying None. Please cast me. Please. Oh, yes, please. Absolutely. Come forward. Sorry, I will.'",
        "'speaker_0': 'Good evening, Mayor Garcia. Vice Mayor Lowenthal. Council members. My name is Margaret Smith. I reside in Long Beach, 6516 East Bay Shore Walk in the third district. And I am speaking tonight as a board member and vice president of public affairs for the Long Beach Public Library Foundation on behalf of libraries, supporters and users throughout the city'",
        "'speaker_0': '. We are extremely pleased, pleased that Mayor Garcia has included in the 2016 budget recommendations the $183,000 for expanding sun hours to three branch libraries. We fully support the recommendation of library director Glenda Williams to select Bayshore BURNETT and North Libraries.'",
        "'speaker_0': 'We thank Mayor Garcia for his leadership and commitment to expand library access. We thank Councilmember Susie Price for initiating the pilot program that opened Bayshore for Sunday hours last February. It was a huge success, drawing over 400 people per Sunday to a small branch library.'",
        "'speaker_0': 'And these 400 people checked out over 250 items every Sunday, 400 people in 4 hours. That's a hundred people an hour coming into a small Bay Branch library on a Sunday afternoon. We hope the council will support this recommendation so that the value of Sunday hours to our community can be further demonstrated and documented.'",
        "'speaker_0': 'And we hope that in future budget discussions, we can expand Sunday hours in each council district so that all our libraries will have access on Sunday in this information age. Libraries and branch libraries especially, are more important to all our residents of all ages.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_2': 'Thank you. Councilman Richardson.'",
        "'speaker_9': 'Thank you. I'd like to just take a moment to acknowledge a number of things in these recommendations that I'm proud to have an opportunity to support tonight. I think we just heard a little bit about the three branch libraries.'",
        "'speaker_9': 'I made a request that we spread these out across the city. I was very glad to see that Library Services put out a memo that really distributed these Sunday hours across the city. So everyone in town has access to library hours on Sunday.'",
        "'speaker_9': 'So I'm glad to support proud to support that and want to acknowledge Councilmember Price for taking the initial step to get this process, move this process along. Secondly, the My Brother's Keeper resources, a lot of times we take part on we embark on initiatives, but we don't put the resources behind it to make sure it's successful.'",
        "'speaker_9': 'I think this is a very worthwhile cause to invest in our boys and young men of color throughout our city. And this recommendation of $30,000 I am proud to support tonight. I'm glad to see the resources to be safe, invest it tonight.'",
        "'speaker_9': 'Which which is significant and and where by once we adopt this, we're going to go ahead and start thinking about having the be safe games next year like a competition multi-week competition, the be safe games at Highland Park for all ages.'",
        "'speaker_9': 'So this is something I'm really excited for, for the whole community. And then finally, I think it's really smart that we're investing in the to clean teams. Dumping is a significant issue across town. So that said, I'm very pleased to cast my vote in support of the mayor's recommendations.'",
        "'speaker_2': 'Thank you, Councilwoman Pryce.'",
        "'speaker_8': 'I want to thank the mayor for the recommendation for the Sunday library hours. I, too, hope that this is something that we can incorporate into our city throughout all the districts. I'm not sure if all of my colleagues would be interested in having Sunday hours at their branch libraries.'",
        "'speaker_8': 'But I can tell you from personal experience, it has been such a huge success at our branch library and I hope that it is citywide. I was there this Sunday and I was there with my family for about an hour and a half.'",
        "'speaker_8': 'My husband was reading a book. My two boys were reading a book. One of them explored the computer for a little while, and during the time that we were there, we heard the librarian announce every, you know, 10 minutes or so that another computer had opened up, which made me realize how many people in the city go'",
        "'speaker_8': 'to the library because they don't have computer access to Internet, which is something that a lot of us have and take for granted. And every single computer station was packed. There were people there from age 3 to 90 in the library, all within the same space, all residents of the same community enjoying the space together.'",
        "'speaker_8': 'And it just to me, that's what those are the kind of programs and values that we should be promoting in the city. Just a space for people to congregate that is sponsored by their city, brought to them by their city, supported by their city.'",
        "'speaker_8': 'I think it's just a really great offering. So I want to thank the mayor for for making that recommendation and to my colleagues. I would say that I urge you to to think about this for your district. If if one of the libraries isn't going to be yours for next year, because you will absolutely have my support'",
        "'speaker_8': 'if that's something that you want to bring to your district. And I also want to thank our library staff for the recommendations that they made, because I think the libraries that are selected are spread out in a in a geographically desirable way so that residents throughout the city can have the opportunity to enjoy the Sunday hours regardless'",
        "'speaker_8': 'of where they live, without having too far to travel. And I really am grateful that the that the geographic spread is so wide. So thank you, Mr. Mayor. Thank you to our library team. And I support this motion completely.'",
        "'speaker_2': 'Councilwoman Mungo. Thank you.'",
        "'speaker_1': 'It gives me great pride that the city of Long Beach and our libraries are so successful. Today on KNX 1070, when many of us were sitting in multiple hours of traffic, they did a report on library usage in the region, and our Long Beach statistics far exceed that of anyone else.'",
        "'speaker_1': 'As other libraries are on the decline, our libraries have been innovative and we have several successes in the technologies we've brought into the libraries, including our 3D printers and our ability to download either digital books or audiobooks through our Overdrive media program.'",
        "'speaker_1': 'And even though we are offering this great service on our own, we are still in a cooperative partnership with L.A. County to continue to expand and be able to use our library cards in all of the libraries throughout the region.'",
        "'speaker_1': 'So this is this is really an amazing thing. As this came up on the agenda, I had the opportunity to talk with a bunch of neighbors about homework help. And I know that was in our budget study. And homework help is available online through our our county with our Long Beach library card after school each and every'",
        "'speaker_1': 'day. And then you can still go into our libraries and get that one on one help. And those are the things that are really, really important in being able to deliver to our youth the opportunities to learn and our seniors to share that space.'",
        "'speaker_1': 'So I'm very excited about this. I'm very excited about all the great work that the Library Foundation did over the last year, and I really appreciated working with you to raise those funds, and I look forward to the projects that will be delivered.'",
        "'speaker_1': 'So thank you. Continue to be innovative.'",
        "'speaker_2': 'Thank you. And just as a reader, I know this was discussed A, B or C, but I think it's worth just restating. My recommendation was to fund three libraries on Sunday hours. The recommendation on which libraries were selected was left up to the librarians and the library staff.'",
        "'speaker_2': 'And so that was something that was that was done through their work, separate of of of the council. Councilman, you ringa.'",
        "'speaker_3': 'Thank you. I want to add my voice to the kudos that's going out for the recommendations that are stated here. I want to especially focus on the three that Councilman Richardson mentioned, the be safe, the the My Brother's Keeper and of course, the libraries.'",
        "'speaker_3': 'Those three are addressing our issues with our youth. That's very important. I also want to mention that in the BC program, there's a big concentration in the West Long Beach area, an area that needs a lot of support.'",
        "'speaker_3': 'And I hope that this B.C. program can really be expanded in that in that district. I had the honor and privilege yesterday of participating in a program put together by the Job Corps yesterday. It was called the Youth to Youth Initiative.'",
        "'speaker_3': 'It's a new program that the Job Corps is putting together to basically address the issues of youth, to youth, get used to youth violence, whether it's gang or not, doesn't matter. It's talked about bullying. It talked about relationships with kids among themselves.'",
        "'speaker_3': 'And it basically addressed all the issues that youth face while in school or well in the community. And I would like, if we can somehow next year look at that program. It's an initiative that is taking place. And one way that we can support how we can support that program in the future and other programs such as'",
        "'speaker_3': 'that that address the the youth and the violence between youth and among youth so that we can address our future crime. Because as we know and I can't remember the eye, it is a tired kid. It's good kid.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_8': 'I got a lot of stuff over here. Mayor, thank you so very much, as well as our financial services team and all of our community, community members and departments. This is a very comprehensive recommendation that we're bringing forward, and it touches every single one of our districts, but also creates a very citywide approach as well for the'",
        "'speaker_8': 'first district, which also means for the whole city of Be Safe is very important for us and our kids, like Councilmember Muranga mentioned LED lighting. We've talked about that so, so very often streamlining our street, sweeping. There's far too many individuals that are waking up way too early just to move their car.'",
        "'speaker_8': 'Welcome to Long Beach Science, which is important, and I think those need to be made in Long Beach. So I hope that certainly happens. And our innovation hub, which will be in downtown but will be open and available to every single resident and business owner.'",
        "'speaker_8': 'And I hope it really becomes a real center for innovation. So, again, thank you to our mayor for all this.'",
        "'speaker_2': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And I just wanted to weigh in and say and I'm glad that we got to this point, this has been a relatively smooth process. And that is a good thing and certainly a. An improvement over years past where we were dealing with very tough budgets in the Army when I first got here.'",
        "'speaker_7': 'And so kudos to Vice Mayor Lowe and to the BRC. Mr. Mayor, your budget in itself, I think it's thoughtful, it's balanced. And when I say balanced from a standpoint that it addresses many of the needs that we have as a city.'",
        "'speaker_7': 'And I'm particularly enlightened by the support for the BCA program. Obviously, the My Brother's Keeper project, the three libraries, the branches need that. I mean, I wish we could do do more. I think this this budget does no harm.'",
        "'speaker_7': 'It could be better. But in light of what we know in the future, it's a safe budget and a responsible budget. I did want to just just just weigh in on the, um, the strengthening our policing citywide. I mentioned this in our, our hearing a few weeks ago that, you know, there have been some, some remarkable gains'",
        "'speaker_7': 'by our police department. I see Chief Luna in the crowd. Hello, Chief. Our police department, I think, is is top notch. However, I think with the the uptick of gun violence that we are experiencing as a city, that we we need to really dial in and pay attention to doing all we can to to prevent gun violence'",
        "'speaker_7': 'in the city as well. And I know I know that there is a $2.2 million allocated to one time funds, and that's rather open ended. I'd just like to just express my my desire for a portion of those funds to be least allocated toward getting guns off the street through prohibited possessors.'",
        "'speaker_7': 'I'm not I'm not convinced that gun buyback programs are necessarily the answer this time. But we, we did a, um, earmark and actually, um, I believe it was $250,000 in the budget before last to go after prohibited possessors.'",
        "'speaker_7': 'Our chief actually laid out some, I think some very impressive data on the work that our police department did in getting those those guns off the streets from, I would call it the low hanging fruit. I mean, that's that's what we need to be going to be to begin with and obviously doing more to mitigate and and'",
        "'speaker_7': 'and deal with the gang violence as well. So those are my comments and I'm looking forward to supporting this budget. But the chief is available. Could you possibly respond in terms of how you expect to use these resources?'",
        "'speaker_2': 'And we'll let Chief Luna come down and make a few comments.'",
        "'speaker_7': 'Good evening, Mayor, and members of the City Council member, council member Austin. The if you're referring to the.'",
        "'speaker_9': '$2.2 million, I would I would like to see as your chief is for that to be discretionary.'",
        "'speaker_2': 'As this year progresses. Every year we address.'",
        "'speaker_9': 'Excuse me and will continue to address emerging crime trends. And because our system in the police department is to be very visible and accessible in our community, we're consistently out in every part of the city. And from that perspective, we're very responsive not only to our community, but to all of you in regards to things that come'",
        "'speaker_9': 'up. It can be a burglary problem. It can be an auto theft problem. It could be a a gang violence problem, whatever the issue may be. We have been very fortunate in that all of you have given us the resources and the discretion to use them as we see fit.'",
        "'speaker_9': 'And when I say as see fit, it really is responsive to our community needs.'",
        "'speaker_2': 'Thank you, Chief. And I think also at the councilmembers is is just adding is that, you know, he's interested as part of the program and as part of all the work you're doing that we're also looking at how we remove guns and remove access to guns within our community.'",
        "'speaker_2': 'And I think that's something I know you and I have talked about. I know it's part of the work you're doing and perhaps there's a conversation that council can have. There is other things from a policy point of view that we could be looking at in the future as well.'",
        "'speaker_2': 'So I think he's referring to as long as that's part of the mix. Chief. Yes. Okay. Thank you, Councilman Andrews.'",
        "'speaker_4': 'Yes, thank you, Mayor. First of all, I think this is extremely robust, you know, budget item, because I think I also would like to thank our vice mayor and the mayor, you know, for this, because I think each one of these items, it seems to me that you have really taken time and looked into it and took'",
        "'speaker_4': 'a look at the whole city and looked at things that we need. And it's very important, especially the three that I really think of, like as My Brother's Keeper and the one with the library. Because the fact that I could only think that individuals who cannot afford to go places, you can go into the library and travel'",
        "'speaker_4': 'all over the world. And I just want to thank, you know, our staff and everyone who's really taken time with this budget and letting everyone know, because I can remember so much money was taken from our libraries, but that that has been put back in because of the mayor's, you know, situation, I think we're going to be'",
        "'speaker_4': 'able to do things that we wasn't able to do. And hopefully that this year will come out the way we're hoping and everyone will be, at least for a moment, satisfied. So thank you again, mayor and vice mayor, for this again.'",
        "'speaker_2': 'Thank you. And then to close this up, Vice Mayor Lowenthal.'",
        "'speaker_6': 'Thank you, Mr. Mayor. It's been said many times, but I wanted to also express my thanks to you for taking a very holistic approach to these expenditures. It does touch every aspect of our city, whether it's the libraries or the crime analysis or the programs such as My Brother's Keeper or Be Safe.'",
        "'speaker_6': 'It does take a very broad stroke across our city, and even though it's not a lot of money, it does end up impacting all nine districts. And so I want to personally thank you for that, for taking that approach.'",
        "'speaker_6': 'And it also shows that you've been listening and hearing from not just your council colleagues here, but also the constituents. Thank you.'",
        "'speaker_2': 'Thank you. And we've done public comment. And so please go ahead and cast your votes on the motion.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you very much. Next item, please.'"
    ],
    "Recommendation to adopt the Budget Oversight Committees proposed funding recommendations, as amended, to the FY 16 Proposed Budget.  (A-11)": [
        "'speaker_6': 'Item 16. I'm sorry. Yes. Item 16, this is the budget oversight committees proposed funding recommendations to the fiscal year 16 budget. The first part of of the motion is a affirmation of what we just did, which is a motion to approve Mayor Garcia's recommendations as originally proposed.'",
        "'speaker_6': 'Even though we took action on it. I do want to share that the Budget Oversight Committee felt it was important to articulate. Mr. City Attorney, I have one, two, three, four, five, six motions under this item. Do we take them separately?'",
        "'speaker_5': 'It would be helpful for me to follow that.'",
        "'speaker_6': 'And I want to be helpful.'",
        "'speaker_0': 'Thank you. Okay.'",
        "'speaker_6': 'So the first motion is to approve Mayor Garcia's recommendations as originally proposed.'",
        "'speaker_2': 'And Mr. City Attorney, I believe that we can do public comment. Can she just read all the motions and then we do it as one?'",
        "'speaker_5': 'Yes, you could you could go through all of the motions, take public comment on any of the items of the six, and then walk through and have individual votes on all six.'",
        "'speaker_6': 'Okay. So let's do that. Item two is a motion to appropriate any unspent fiscal year, 15 year and general funds surplus in the city prosecutor's office up to $250,000 for the PATH Program and other city prosecutor programs. Item three is to fully restore the proposed fire department's reduction of one full time FTE Marine Safety Sargeant boat operator'",
        "'speaker_6': 'in the Tidelands Operation Fund and to offset the cost of $140,000 by reducing the Tidelands funds in the city manager's department by $25,000. The Parks, Recreation and Marine Department by $46,000. And the Economic and Property Development Department by $69,000.'",
        "'speaker_6': 'Item four is a motion to forward to council from BFC the appropriation of a total of $2,666,000 for capital infrastructure programs to be divided by nine for city council districts. From the following sources 950,000 of supplemental funds for streets and sidewalks, 675,000 of unallocated fiscal year 16 temporary surplus.'",
        "'speaker_6': '$341,000 of general fund fiscal year state mandate reimbursement funds $300,000 of fiscal years 16 General Fund Beginning Funds Available $200,000 of fiscal year, 16 uplands beginning funds available and $200,000 of funds for document imaging project. Item five is a motion to recommend using fiscal year 16 General Fund Beginning funds available to appropriate $50,000 for Rancho Los Alamitos'",
        "'speaker_6': 'Plan Check and to appropriate up to $30,000 for municipal band to match 1 to 1 additional funds raised above $85,000. In addition. In addition to those to those amounts just mentioned, we would allocate $50,000 to Rancho Los Cerritos, as well as $50,000 to a weekend to instate to initiate a weekend graffiti abatement program citywide.'",
        "'speaker_2': 'Thank you. And I think the last part of your motion is the last sentence. Correct?'",
        "'speaker_6': 'Yes, I have the motion to recommend using $200,000 fiscal year 16 General Services Fund Beginning funds available for the Document Imaging Project.'",
        "'speaker_2': 'Thank you. There's a motion in a second. I just I clarified with the city attorney. And so we can actually take one vote on all these items and put one public comment on all the items.'",
        "'speaker_5': 'That's correct. Mayor and if I could just ask for a clarification from the vice mayor. I was given a sheet with the items, but I, I don't have the two items.'",
        "'speaker_2': 'There's two items missing on that sheet. So it's everything on this sheet. Post edition of 50,000 for Rancho Los Cerritos. I So.'",
        "'speaker_5': 'The Rancho Los Cerritos is there for.'",
        "'speaker_2': 'The top and top on top of the Alamitos.'",
        "'speaker_6': 'And I failed to mention the source. I apologize. Okay. So the 50,000 for Rancho Los Cerritos and then the $50,000 for weekend graffiti abatement citywide. And the source would be from the Small Business Incentive Program, which has just started.'",
        "'speaker_6': 'And so in the start up, we anticipate that there would be about $100,000 unused. And so that's the source. If if the program itself becomes highly subscribed, we will make an adjustment that during the year.'",
        "'speaker_2': 'The thought is, as per staff, because the program just started, we're only going to use 100,000 of the 200. So that's where to go. And then we can always do the adjustment later on. So that is the motion.'",
        "'speaker_2': 'So you have those two additional pieces. Mr. CITY Attorney.'",
        "'speaker_6': 'Mr. Mayor, I'm sorry. And on the municipal bond item, there was a friendly amendment which was accepted at budget oversight that if the matching funds are not fully utilized, the balance of the funds would be used to improve any park locations hosting the concerts so that there would be improvements to the concerts, I'm sorry to the parks'",
        "'speaker_6': 'made as opposed to releasing the funds.'",
        "'speaker_2': 'Okay. So that's the that's the motion on the floor. And I'm going to first take public comment and then I'm going to add, is there any public comment saying none? I'm going to go back to the council. Let me start with the second or the motion, which is Councilman Mongo.'",
        "'speaker_1': 'I want to thank city staff for working very diligently to find ways that we would be able to fund all the priorities throughout the city. I think that it's important that when constituents reach out to us and tell us their priorities, that we are able to respond.'",
        "'speaker_1': 'And so I thank you for your hard work on this. I also want to appreciate the members of the committee who we've worked alongside one another for such a long time to get it right, to make sure that the community felt involved, to give them their voice and to get to where we are today.'",
        "'speaker_1': 'So thank you to everyone. This has been a very worthwhile process.'",
        "'speaker_2': 'Thank you. Councilwoman Price.'",
        "'speaker_8': 'Thank you. I have a question for the city manager on the plan tracks for Rancho Los Alamitos. I understand that they have a potential seismic issue and that they have to submit plans to the city. The city has to review the plans, determine the scope of the project, what the potential costs of the project would be.'",
        "'speaker_8': 'And, you know, in terms of the city's maintenance requirement, make a determination as to, you know, what those infrastructure needs are. Is this this money contemplated to go to the city to fund the costs associated with obtaining a permit and and having those plans checked?'",
        "'speaker_8': 'Or is it to go to the entity?'",
        "'speaker_5': 'Mayor councilmembers. This money will actually go to the ranch, on the ranch, and will use those moneys to pay the fees for the plant checking. So during this seven month process, as we go through that. So at the end of the $50,000, at the end of the process, we should have the ability for the rancher Apollo building'",
        "'speaker_5': 'permit.'",
        "'speaker_8': 'I see. Okay. And so I think it's it's definitely my desire. And I know there are others on the council who obviously believe that maintenance of the ranchos both ranches is an important priority for the city. And so I would be supportive of the motion.'",
        "'speaker_8': 'And I want to thank the vice mayor and committee member Mongo for their efforts in getting us to this point. So thank you.'",
        "'speaker_2': 'Thank you, Councilman Richardson.'",
        "'speaker_9': 'Thank you, Mr. Mayor. I have just a few comments and some questions. So within these recommendations, there are a number of things that I'm really excited and eager to support tonight. One of which is, as most of you would remember, we came to city council with a proposal to fund a program, a young adult, 18 to 24'",
        "'speaker_9': 'year old diversion program called Path. Promising adults tomorrow's hope that uses that uses education and workforce as a means to and in lieu of criminal prosecution in certain cases. And so I'm glad that over the last few months, we worked to craft this program and we proposed a a budget solution to help get the program off the'",
        "'speaker_9': 'ground. And so I'm glad to see that the EEOC recommendation includes that solution. So so that's something I'm eager to support tonight. Secondly, I know that I've met with the lifeguards and a number of I know the council has met with the lifeguards.'",
        "'speaker_9': 'So I'm glad to see that there's a solution to the lifeguard issue. I have a number of questions with some of the other bills or recommendations. So first, I see that we have a number. We have 2.6 million allocated four divided by nine, and that all exceptions to this must go to city council for approval.'",
        "'speaker_9': 'Now we. Every year it seems like we've had different rules to the divide by nine resources. And fortunately I've been able to see how that's impacted certain vision, certain goals. Like if, if I have a train trust, train trestle, whatever it's called, and, and it gets painted with graffiti or if I have a utility box that's, that's'",
        "'speaker_9': 'been vandalized, a lot of times I have to figure out which year of resources we can use to actually impact or improve that. And to me, the condition of our the actual esthetic condition of our infrastructure is just as important to many folks as whether it works or not.'",
        "'speaker_9': 'So I'd like to make sure that and I want to hear from some other council members on this, but I want to make sure that whatever isn't legally restricted and also there are some sidewalk funds we want to make sure go into infrastructure, but I want to make sure that council offices in conjunction with departments are able'",
        "'speaker_9': 'to make flexible decisions on how these resources are spent without having to come to city council. For every small decision, every small decision here. So so that's something I that's a question I would say I would pose this to the EEOC chair.'",
        "'speaker_9': 'How would you respond?'",
        "'speaker_6': 'Councilmember Richardson I think that's a very fair question. And if we can ask Miss Erickson to identify how much of the 2.666 million is absolutely restricted and where there might be some flexibility.'",
        "'speaker_1': 'Vice Mayor Lowenthal Right now, the boss recommendation was for capital infrastructure programs. As the Council member stated, in past years, City Council has chosen to have a carve out of a certain amount for program existing programing. So last year that was $50,000.'",
        "'speaker_1': 'So right now there's the recommendation stands. It is for capital infrastructure programs and it would be up to city council to to identify if there would be any exceptions to that. It should be noted, and the city attorney can speak to this more.'",
        "'speaker_1': 'There is a process for how this funding can be designated. It really does need to be department. Existing programs, existing capital, infrastructure needs. And and so that would stay and no matter and so any exceptions to that would need to come to city council.'",
        "'speaker_6': 'So before Mr. Attorney answers, I just to be consistent, I think that portion that we had slated for economic development, I think that was the catchall flexibility. I'm sorry.'",
        "'speaker_5': 'There was I'm not sure that there was not approved in the economic times.'",
        "'speaker_6': 'But in our conversation for the carve out, examples of economic development projects came up, such as developing bids along new business corridors, major business corridors. And so I think if if the council member would like to see that retained in this process, we could ask our council colleagues to consider that.'",
        "'speaker_5': 'Mayor and Vice Mayor. The the problem with having the carve out for the economic development, those would have to come back for a vote of five members of the council to spend that money. You couldn't make that decision tonight under the charter because under 208, the body acts as a whole to identify those projects and approve those'",
        "'speaker_5': 'projects. The individual council officers doesn't do not have the authority to make those decisions and spend those funds here. How will you divide by nine? You have the capital infrastructure program divide by no money, which is approved by the council and then existing programing which has already been adopted or approved.'",
        "'speaker_5': 'But outside of that exception, you while you could bring those projects back, you do need five votes of the council to act.'",
        "'speaker_6': 'Okay.'",
        "'speaker_9': 'So just to give some examples. Last year we didn't see it coming, but we were blessed enough to receive some funding to host the beach streets. And the whole city came to North Long Beach and the funding received the 250 $300,000 was fantastic.'",
        "'speaker_9': 'We received it, but the investment was much greater. And so we had to go through the process, identify which of our one times was flexible, which we're not to be able to support our business district to actually host an event of that magnitude.'",
        "'speaker_9': 'And it was good that I was able to look back, identify some of those resources that have flexibility to do to respond to those things. Another example would be, I know that there's been sort of inconsistencies about whether one time resources can be spent on planning efforts.'",
        "'speaker_9': 'Right. So I know there's been a number of planning efforts across town and know that I'm planning to I'm working on a planning effort now. Some of those years we did not have that. Some years. We do. And there's a direct impact on infrastructure.'",
        "'speaker_9': 'But the interpretation, you know, depending on who you speak with in city staff, is that doing a master plan for a corridor is not necessarily infrastructure, whereas it has a direct connection to infrastructure. Right. Another example I brought up an example of murals.'",
        "'speaker_9': 'Well, I've heard inconsistent examples of of of murals, whether a mural or using art to mitigate graffiti is an accessible use of your one time infrastructure. So what I'm asking is if there's a if we have the legal ability to do tonight, I think we should say no more than say I would propose something like no more'",
        "'speaker_9': 'than 50% of your District nine funds, no more than 50% can be spent. You can have the flexibility in partnership with your with the appropriate departments to have to basically have that flexibility on those things. So like a fifth.'",
        "'speaker_9': 'So instead of like a $50,000 threshold for whatever is divided tonight, 50% of it infrastructure as defined by our city attorney, the other 50% can still be infrastructure, but if it ends up being murals, programs, anything that does not require direct vote of city council, like if you're going to give away money to a rancho or something'",
        "'speaker_9': 'that probably would need to come to city council, a public, public benefit projects. That's the way I would define it. So how would you respond to that? Ms.. Madam Chair. Vice Chair, Budget Committee Chair, Vice Mayor.'",
        "'speaker_1': 'All of it.'",
        "'speaker_0': 'All of that.'",
        "'speaker_6': 'All of it. So when we've had this discussion before, the 50%, because we have such a dire need for infrastructure. Council members have been reticent about that. So I think it's helpful to hear from Alice. Um, um. I just know that.'",
        "'speaker_6': 'When these resources are used for infrastructure, it has such a lasting impact and we don't have the infrastructure repair and restoration schedule that we'd like to. There was a time when we talked about whether it was tree trimming or the streets or the curbs, you know, can we be on a certain number of years doing it?'",
        "'speaker_6': 'Every certain number of years. And so being able to spend it as council districts really helps carry us through until the public works department can take the overall approach. And so. I think it'd be helpful to hear from other colleagues, but I, I struggle with that 50% because it's such a small amount as it is.'",
        "'speaker_6': 'I mean, you can spend $200,000 on one ADA block, right? So I think that becomes challenging.'",
        "'speaker_9': 'So. So I'd like to come back to that. Just have one or two other things I'd like to just comment on and then we'll hear from the rest of our colleagues. So. So I think it's important that we do invest in things like our like our Rancho.'",
        "'speaker_9': 'And I hear the the information about plan check and that all make sense. We've got a number of facilities across town that absolutely need those sorts of resources. I would ask, what would be the difference if, let's say we wanted to do some other plan effort, right?'",
        "'speaker_9': 'If we wanted to do a master plan on a corridor. Versus right now. I need to use my district nine one times to do a master plan or a plan check or something like that. I have to use that.'",
        "'speaker_9': 'So why are we taking a different approach here? By allocating $100,000 to something that our one times can be spent on. So maybe we can just elaborate whoever the maker of that motion is. Maybe just elaborate on why these particular projects are exceptions to the way that the rest of us treat our district assets.'",
        "'speaker_6': 'Yes. Can I. Yeah. Okay. So the question was, what is the difference between the corridor planning efforts that may be funded through one time funds?'",
        "'speaker_9': 'Is there a certain particular reason? And it's not a huge deal to me, but is there a particular reason? We've carved out these two specific locations and I get their historic significance relevance to our city.'",
        "'speaker_6': 'You mean the ranchos?'",
        "'speaker_9': 'Yeah. Right. Why did. Why did we specifically spell these out? Whereas. I just think we're not necessarily and I would like to for the sake of conversation, I'd like to be consistent. I understand that certain people feel that certain things are citywide assets.'",
        "'speaker_9': 'But the reality is, some people would say that the restoration of the clubhouse at Houghton Park is a citywide asset.'",
        "'speaker_0': 'Or so some.'",
        "'speaker_9': 'Would say, a public art piece of city.'",
        "'speaker_6': 'Warehouses. And I knew that. I'll go ahead. Yes.'",
        "'speaker_9': 'So if we as council members determine something as a priority in our district, I've seen over the last five years we've spent our own one times to make that happen. If that's so, I'm guessing what I'm struggling with is how is how are these two projects different from any other projects important to a district that might have'",
        "'speaker_9': 'a citywide value?'",
        "'speaker_6': 'And I know Councilmember Austin and Price might like to address that. If I can just briefly state, because there are several of those examples in the second district as well. You have the aquarium, you have the Queen Mary.'",
        "'speaker_6': 'And how I've regarded that is their city owned property. You know, we talk about assets, maybe having financial value as well as other benefits, but when we just look at them as city owned property, if we don't contribute to their upkeep, it's deferred cost, right?'",
        "'speaker_6': 'It's deferred maintenance, it's deferred costs. And at some point that dollar amount becomes larger. And it's still our responsibility because they're city owned properties. And so maybe assets might not be the right word to use because we're not clearly specifying that we own these pieces of property and it is in the city's best interest to ensure their'",
        "'speaker_6': 'upkeep.'",
        "'speaker_9': 'So I think that makes that makes a lot of sense. I don't I think that's a good response for me. And I would say I can absolutely support that. Let's make sure we remember that to forward the whole council.'",
        "'speaker_9': 'Well, let's remember that, because I would say there are projects that maybe haven't received that level of maintenance that are very significant to our city and maybe we just haven't had the exposure to it or the education to it.'",
        "'speaker_9': 'So let's just remember that moving forward, the last thing I would say is I think it's great that we're investing in municipal band and in those things. I would say that just to provide a little bit of context, the concerts in the Park series have really emerged and local communities have adopted them and embrace them and put'",
        "'speaker_9': 'their own brand on them. The communities that do not have municipal band performances, and I can say that to a municipal band performance, would likely be like into our Latin Jazz Festival at Highland Park. It's to me it's the same thing.'",
        "'speaker_9': 'Thousands of people show up. It's a great way to to get involved in your community. So in the same spirit of the last of the last item I think is great we invest in our ranchos I think is great we invest in municipal band but this is yet again two items here in these recommendations that have that'",
        "'speaker_9': 'are not like they're geographically not located in certain portions of town. And so I would say I can support. Making investments in municipal bond. But I'd like to hear how we can also invest in our concerts in the Park series and the way and the way that we've done it here that incentivizes raising funds, external funds.'",
        "'speaker_9': 'I think that's great. There are actually fundraising efforts going on around town to support things like our festivals. So I'd love to hear Madame Vice Mayor, like, what could we do to support our concerts in the park in the same way that we support our municipal band?'",
        "'speaker_6': 'I think that's a fair question as well. You know, we have areas throughout the city that the concerts in the park are just better received. And I agree that we should provide some level of support currently. How would you say it's currently funded?'",
        "'speaker_6': 'Is it?'",
        "'speaker_9': 'I think that would be a better question for for park staff. I know that personally that some of the concerts in the park were not as well-attended as, say, a muni band. So we invested in certain ones to bring in the art, bring in the the talent and the entertainment that really brought it up to that level'",
        "'speaker_9': '. So I think there was a memo that Parks and Recreation sent out that said that a muni band I mean, excuse me, a concert in the park, they they likened it to about $6,000, was what it cost to really invest in that.'",
        "'speaker_9': 'So even so, if we were to make some sort of an effort, I would like to look at those areas of town that aren't particularly impacted by the Muni band and see if we can find some resources maybe that recommend that number that staff put out in the memo, the $6,000 per area would be something to help'",
        "'speaker_9': 'support those efforts and think that would just be fair.'",
        "'speaker_6': 'Absolutely. And I think Mr. Scott is sitting right behind you, if we can hear from him.'",
        "'speaker_0': 'Mayor, members of the city council, Councilmember Richardson.'",
        "'speaker_3': 'You are correct. The community band concerts or community concerts run roughly $6,000. I do want to point out, though, since 2012, the Department of Parks, Recreation and Marine has not provided a community concert series. Any of the community concerts that occur throughout the community are either led through community organizations or other fundraising activities.'",
        "'speaker_6': 'Council officers and council officers?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_6': 'Do you know, Mr. Scott, how many concerts we had this last fiscal year? Four concerts in the park series. Five. Four.'",
        "'speaker_0': 'It looks like about five. Okay.'",
        "'speaker_6': 'So. I agree with you, Mr. Rich. Councilmember Richardson I do think that and I can point out communities where a concert in the park would go a lot farther than than a municipal band. And I think this council should look at that.'",
        "'speaker_9': 'Great. Let's say we hear from more councilmembers, but thank you for acknowledging that. I think those are the rest of my comments at this point.'",
        "'speaker_2': 'Okay. Thank you. We're now moving on to Councilwoman Gonzales.'",
        "'speaker_8': 'Yes. Thank you to the bossy Vice Mayor Lowenthal Council, Stacey Mungo and Suzie Price. I know this has been you know, you have to be very diligent because so many different priorities come about. But this is, I think, a very fruitful discussion we're having.'",
        "'speaker_8': 'And I see here where it could be very, you know, important going forward and how very important it is for much of our district, but again, city wide. And so, uh, I want to. Sorry. I'm just losing my train of thought here.'",
        "'speaker_8': 'My apologies. So first I wanted to clarify, actually, as we're talking about the municipal band, I believe there was discussion about adding it to other districts. So Stephen, can you discuss that a little bit more? I guess I'm not clear as to I know Districts one, District six and District nine do not have concerts in the park'",
        "'speaker_8': 'currently by the municipal band. From what I understand.'",
        "'speaker_3': 'Mayor, members of the City Council, you're correct. There are several districts that do not have municipal band concerts, council districts, 167, they'll close to Los Cerritos Park and Council districts nine. And so the series right now.'",
        "'speaker_0': 'Is split across the third, fourth.'",
        "'speaker_3': 'Fifth and eighth districts. The additional week of municipal band is slated to maintain the existing schedule or nightly schedule for Wednesday, Thursday and Friday. But that's something that we could look at for the additional week for that Tuesday night concert in additional location outside of the five week schedule.'",
        "'speaker_8': 'Okay. And that would just be one additional location. So perhaps rotated between the the districts that do not have or what I mean, is there any thought in that as to what would how that would be implemented?'",
        "'speaker_0': 'Well, there would there would only.'",
        "'speaker_3': 'Be one additional concert through this six weeks. So we are all very hopeful that the friends of the municipal band are going to be extremely successful with their fundraising efforts. I think they have goals to even exceed a six week and I think in the future.'",
        "'speaker_2': 'As we look.'",
        "'speaker_3': 'At those at their fundraising, if it's an opportunity to expand even.'",
        "'speaker_0': 'Further, there would be additional.'",
        "'speaker_3': 'Opportunities to expand.'",
        "'speaker_0': 'To other areas of the city.'",
        "'speaker_2': 'Just to clarify, I know we consider a concert, but we're really talking about four additional performances. If you include the 30 and the 30 will be fundraiser. That's I think that's right.'",
        "'speaker_8': 'Sees that every Tuesday four. So that would be every Tuesday of the month, correct?'",
        "'speaker_2': 'I think it would depend whether you add an additional week and multiple concerts or whether you added an additional concert to every week. So it just would really depend. Right.'",
        "'speaker_8': 'Great. Um, okay, good. So I just wanted to clarify to ensure, I mean, again, I kind of reiterate what Councilmember Richardson is saying. I do believe, you know, we should have it widespread. And I think it's also a very big city asset.'",
        "'speaker_8': 'And people love seeing the municipal band and it's very apparent. And to have that in different areas would be would be great. Um, so secondly, I have a, let me think here had my notes and then now they're, they're gone for some reason.'",
        "'speaker_8': 'Okay. I also wanted to mention the appropriation for PATH, which I think is very important. Our city prosecutor does some great work, and I think it's been very important to to have this this program available. And then lastly, the graffiti abatement, I just wanted to thank Vice Mayor Lowenthal for bringing that up, because I know that graffiti'",
        "'speaker_8': 'abatement in all of our city sometimes oftentimes does not happen over the weekends. And I think it's important to get tagging down, especially if they're gang related and get them down in a very fast and a very expedient way and I think are a million for for for that information actually are if you want to come up'",
        "'speaker_8': ', I just want you if you can just clarify what that will mean, because I know some residents all over the city have asked about graffiti abatement on the weekends. And so this $50,000, what that breaks down to in terms of weekends and what that looks like.'",
        "'speaker_7': 'Honorable Mayor and honorable council members are a graffiti program currently is between Monday and Fridays. This additional 50,000 basically will cover the weekend. So we're estimating about $500 a day. So weekends will be about $1,000 and 52 weeks.'",
        "'speaker_7': 'Our original estimate was $52,000. We're grateful for 50 if it's approved. And that will take care of all the graffiti abatement during the weekends. Just want to give you some more data. We're averaging about 250 tags a day, translates to about 7000 a month.'",
        "'speaker_7': 'And that's that's the effort that's being to to to mitigate the graffiti. And unfortunately, you know, I don't have the data with me, but it's it's tags. It's by location. And we we use square footage to cover them up.'",
        "'speaker_7': 'We have a very robust graffiti program. I'm very proud of that. It's very advanced. And we use Go Long Beach. We use different methods of transferring that information to the contractor to abate the graffiti. We are even to a point that we match the colors when they're painting.'",
        "'speaker_7': 'This is high level of service compared to the other city. So I have to say that we have a great, great program and buy this additional 50,000 of council awards that we will be having a seven day a week program.'",
        "'speaker_8': 'Great. That's wonderful. Thank you very much for the information. And what I will mention, I think Vice Mayor Lowenthal and I were discussing this is a better outreach program to let people know that there is this opportunity now on the weekends should this pass, because I think that would be very important for our residents to know and'",
        "'speaker_8': 'feel like they will call they will do go Long Beach and it will actually be taken care of. Thank you very much.'",
        "'speaker_2': 'Thank you. Councilmember your income.'",
        "'speaker_3': 'Thank you, Barry. First of all, obviously, I want to thank the BBC for its work. It's difficult work. It can be very contentious, obviously, and can be very. Important in terms of what we come up with. But I got to say that we got it right.'",
        "'speaker_3': 'I mean, the B or C got it right in terms of making some adjustments that needed to be done, providing money for the additional for the additional rancho that we have with that did not exist before and also for funding the municipal band.'",
        "'speaker_3': 'However, everything comes with some with some issues in regards to the ranchos and the discussion that that had previously, I think it's important that when we fund these kinds of of city assets that we put some, some, some restrictions per se.'",
        "'speaker_3': 'I can't find the right word right now. But to put some some elements of citywide responsibility, for example, making sure that there are opportunities for our youth to visit the ranchos, to provide additional educational programs there, to provide additional historical perspectives of what the ranch was mean, where they came from.'",
        "'speaker_3': 'We originally know that they were Spanish land grants, Mexican land grants, in fact, back in the day. That is not adequately shared in that. Well, no, I think we need to expand on those things and we need to have the ranchers be more receptive to providing additional feedback.'",
        "'speaker_3': 'Let me rephrase it. Additionally, additional educational opportunities for people to learn about the history of the ranches and their and and the history of the Californians as a whole. The the municipal ban. We're adding some money there for them to expand their opportunities to have more concerts, which is fine.'",
        "'speaker_3': 'I totally agree with that. The issue I have with that is that I think they've been such a bit ingrained to visit only certain parks and on certain dates, on certain times that certain music. We need to have a variety.'",
        "'speaker_3': 'We need to diversify where the concerts in the park are held. I share as an example, I share a Municipal Ban concert with the eighth District at Little Cerritos Park. I have nothing in the website. I would love to see something happening in the West Side in West Long Beach.'",
        "'speaker_3': 'And you will always hear me talk about West Palm Beach, because when you look at my map and you look at my district, the West Palm Beach area is isolated. It's an island in Long Beach. You can only reach through crossing some bridges.'",
        "'speaker_3': 'And they have a lot of needs out there and there's a lot of cultural activities that don't take place out there because they're simply not provided. And we need to have that outreach out there. And I'd like to see some additional money go down there.'",
        "'speaker_3': 'Councilman Rich Richardson had a great jazz fest at North Long Beach that he put together himself with his. With his. One time funds. You know, I'd like to be able to do that, something like that in West Long Beach.'",
        "'speaker_3': 'I have a very diverse community in West Long Beach, something that I could provide if I had the resources. A great concert that would that would focus on that diversity of that West Palm Beach community. So I would love to see something like that.'",
        "'speaker_3': 'Which brings a final to my third point, which is, are these one time funds that we're talking about divide by nine? You know, if it's divide by nine and I have responsibility in my district to use those funds, I want to use them like I feel like I can use unrestricted.'",
        "'speaker_3': 'I want to be able to decide if I need it for for a sidewalk fight, if I needed to. A tree, a trip tree, a trim, trim, a tree. I want to be able to use it. Or if I need it to knock off a mural, put a mural up there, or do something beneficial that's going to'",
        "'speaker_3': 'end up being beneficial for the community or for public safety purposes or whatever. I want to be able to have that discretion. Now, does it mean that I want to do it on my own or that I'm going to do it unilaterally?'",
        "'speaker_3': 'Of course I would talk to my two department staff, those that are involved. Of course I would do that. It's my responsibility to be responsible as a council member, but I also want to be responsive. To my community.'",
        "'speaker_3': 'And my community has a lot of needs. They they want to see a lot of things happening out there. I met with a constituent today who wants to put put a Christmas tree in the middle of Willow and Santa Fe.'",
        "'speaker_3': 'I can't do it. Not right now. I don't have the discretionary funds to do it. But if I were able to have that discretionary fund in the future, certainly I could help support that because it would be a public benefit not only to that community, but to the city as a whole, especially when it's a main artery'",
        "'speaker_3': 'like Willow that comes into the city of Long Beach. So I. I'm going to support this budget, no question. But I do want to raise those issues for future discussion. We do have a fiduciary, fiduciary responsibility to accept it tonight.'",
        "'speaker_3': 'And and delaying anything would put us in trouble. I know that. But certainly something for future discussions of future royalties, maybe even a mid-year adjustment that we could make come March or so that we can put some aside money to to address some of the issues that that have been raised by my colleagues here today.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Andrews?'",
        "'speaker_4': 'Yes. Thank you, Mayor. First of all, I'd like to thank Councilman Richardson to bring it up. You had him about two divided by nine. I think all of us, you know, would like to think that if we got that, we would be able to spend it as we please.'",
        "'speaker_4': 'But we doing it with responsibility. And I think in your communities, everyone would like to you to do things that they ask to. But you have to understand, we don't have that type of money. But I think right now we'll get in there.'",
        "'speaker_4': 'This budget is one of the best I've had since I've been on this council deal because all of a sudden we're solving for 4 to 6. The biggest point I'm asking for right now is that. Lena, I know you were talking about the graffiti program.'",
        "'speaker_4': 'This that you just brought up, I think is one of the best things that we've had here on this council since I've been here, because when I leave on Friday and all of a sudden I can go down the street and see graffiti everywhere that needs that.'",
        "'speaker_4': 'We probably won't get that until Monday. This I missed. Or I would just like to know where do we call in? Who do we get in touch with? If in a situation we do get this money in order to be able to do it on the weekends?'",
        "'speaker_4': 'Who do we get in touch with? The vice mayor or Ms..'",
        "'speaker_6': 'Who I think Mr. Malloy in was clear from Councilmember Gonzalez's request that that has to be part of the promotion, because most of us don't know now that it would be available on the weekend. And so we hope to test that with him and his department to make sure that residents are aware that they can call the'",
        "'speaker_6': 'graffiti hotline on the weekend as well. But I think Mr. Malloy is here to answer that.'",
        "'speaker_4': 'Well, no, that's that that's that's fine. That's good to know. But I just want to, you know, really thank you, Lena, for doing that, because I think it's a great idea. And I think it really benefit the city of Long Beach because some of it's really out of line.'",
        "'speaker_4': 'So those are the only thing I have to ask in this budget. I would totally support it.'",
        "'speaker_6': 'Mr. Mayor, may I ask just on Councilman Andrew's point, are most of the requests coming in through go Long Beach or are they phone calls or. Mr. Malloy.'",
        "'speaker_7': 'Honorable mayor and honorable council members. But 90% of the calls go through the hotline and about 5 to 10% goes through the language.'",
        "'speaker_6': 'So on the hotline, is there an outgoing message? For instance, you know, you've received you've reached the hotline and. Wait for a customer service rep. Is that what it says?'",
        "'speaker_7': 'I don't know that. Okay. The answer to that question. But to also expand on Councilmember D's question, this will be an extension of existing programs. So whatever's happening today on Mondays, Tuesday, Wednesday, Thursday and Fridays will occur on Saturday and Sunday.'",
        "'speaker_7': 'So.'",
        "'speaker_6': 'So there are ways internally that we can promote this one is the scrolling messages on our city TV. Two is when you call City Hall, there's that hold time message. And in that message we could say and now we're open on weekends as well.'",
        "'speaker_6': 'So I think there are lots of ways that Mr. Malloy can identify that this could be marketed.'",
        "'speaker_7': 'Absolutely.'",
        "'speaker_2': 'Thank you, Councilman Austin. Then I'll make some closing comments. Councilman Orson.'",
        "'speaker_7': 'Thank you. And I want to thank my colleagues for all of their great comments and been a lot of insight here. I do. You know, as a as a district city councilmember, we are very fortunate to have a lot of great tradition in our community.'",
        "'speaker_7': 'We do benefit in my community. It looks forward to the municipal band playing every year. It wasn't just a few years ago that we were talking about eliminating that from the budget altogether. So to be having a conversation about restoring and actually doing extra more, more municipal band concerts is a says a lot about where we are'",
        "'speaker_7': 'as a city today. And I think the I actually would support expanding this tradition to to other areas of the city. Hearing from council members Gonzalez in Urunga and in Richardson in that regard, I think this budget actually can accomplish that and seeks to do that with provisions for extra concerts matching with the municipal band, doing some'",
        "'speaker_7': 'fundraising themselves. And it would only helps them by expanding their scope to other areas of the city. And so that's something I think we should look at doing. The tradition that I talk about is rich with the ranchos as well.'",
        "'speaker_7': 'I mean, these these ranchos are really the the genesis of our of our city and require our attention. Those ranchos are no longer maintenance then managed by the city of Long Beach. They are managed by the foundations, which I think make them unique in that regard.'",
        "'speaker_7': 'They don't get a whole lot of funding. They do get a an annual allocation. But when it comes to some of the maintenance issues with these these historic gems that we have in our cities, I think it is our responsibility to to pay attention to them.'",
        "'speaker_7': 'And so I'm glad we we're doing that as well in this budget. And I wanted to speak to the the the conversation regarding discretionary flexibility for council offices. I think that's important for us to have that in our infrastructure.'",
        "'speaker_7': 'I don't I've been a big voice for for infrastructure on this council since I've been here. I'll continue to do that. I know we have dedicated a great deal of one time funds and even our discretionary dollars, the eighth District, toward infrastructure improvements, streets, sidewalks.'",
        "'speaker_7': 'We're making progress. However, I do agree that the one size fits all model isn't necessarily the best model for for our city. Our districts are are different. Our city is diverse. We have different needs. And I think as council members, we should seek to to to recognize that as well in this budget as well.'",
        "'speaker_7': 'So I would hope that we can get to a place where there's a little bit more flexibility with the discretionary dollars that are coming our way. And I look forward to to supporting this budget with those.'",
        "'speaker_2': 'Thank you. Councilman Price.'",
        "'speaker_8': 'Thank you. I'll be very brief. I think it's important to I agree with the comments that my colleagues have made. I would encourage my colleagues to to.'",
        "'speaker_1': 'Really look.'",
        "'speaker_8': 'Holistically at the things that we do do as a city council, the projects that we support one another in. Sometimes there are projects that are very important to a specific.'",
        "'speaker_1': 'Group.'",
        "'speaker_8': 'Of residents in our community that may not impact other residents at all. And yet we support them because we understand that this is a very diverse city with different interests and different needs and different services that their constituents take advantage of.'",
        "'speaker_8': 'And I think it's important for us to all support one another. And and rather than saying, well, remember this, the next time something comes up, we should think more holistically about how we're allocating money citywide and supporting one another in the programs that we're trying to bring to the communities.'",
        "'speaker_8': 'I do want to highlight, we do have a legal contractual relationship with the ranchos that requires us as a city to provide some maintenance to those two facilities. And, and I completely agree with Councilman Yarrawonga regarding what the ranchos do in terms of giving back to the community.'",
        "'speaker_8': 'I know he knows this, but I think it's important to highlight that every student in the Long Beach Unified School District goes to both ranchos every year. It's a mandatory requirement and it's something that the ranchos put on in addition to the free tours that they give to the community and the fact that they open up those'",
        "'speaker_8': 'two facilities as a museum to every single member of the public. So I think that's really important. But the fact that our children tour that facility and learn about the history of and of that facility and its roots in Long Beach, and that that's part of the curriculum.'",
        "'speaker_8': 'At Long Beach Unified School District, as is the Long Beach Museum of Long Beach Art Museum, is also part of the Long Beach Unified School District curriculum, as is the symphony. So those are it's not just city resources or city assets that we've called them.'",
        "'speaker_8': 'They actually are facilities that our partners in the Long Beach College promise are utilizing to help deliver our end of the Long Beach College promise, which is inviting our children into those facilities. So I think that's really important.'",
        "'speaker_8': 'Never mind the liability that we may have in terms of these being city, city actually facilities. So with that said, I agree with all the comments that my colleagues made. And I think it's important that we, you know, support all the different programs, services and facilities that help every single one of our residents.'",
        "'speaker_8': 'I don't think you'll ever see me opposing something that any of my colleagues feel is going to benefit their constituents and their community in a positive way. Thank you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_6': 'Mr. Mayor. I'm sorry. Yes. May I make a slight amendment to the verbiage of the motion?'",
        "'speaker_2': 'Yes, I was actually just.'",
        "'speaker_6': 'Trying to address that.'",
        "'speaker_2': 'Thank you. No, but I'm going to let I was going to just have the city attorney kind of repeat that piece and then you make the the adjustment that needs to be made. I just want to say a couple a couple comments.'",
        "'speaker_2': 'One, I want to start out by thanking the BBC. They've done really great work. And I think it's it's a lot of additional work to be part of that budget process. And so I want to thank all three members, especially Vice Mayor Lowenthal, for for walking us through that project.'",
        "'speaker_2': 'The second thing I want to mention is just so that everyone's aware, the municipal band is actually very much interested in expanding their programing to other parts of the city. And so I think that is a core part of what they're trying to do and discussing is how they expand their reach.'",
        "'speaker_2': 'And so that's something they've talked to me about. I know they've talked had a conversation with many others as well. And so we we all encourage that. And we're we're very hopeful that that will be occurring. And we want to thank them for for their commitment to doing that.'",
        "'speaker_2': 'Just a quick note about our ranchos. I think this is something that's always interesting to me is, you know, our ranchos are literally the birthplace of Long Beach. That is where our city's history was developed. And the great the great assets, of course, for for the entire city.'",
        "'speaker_2': 'And so I want to I want to thank both the council members who've been advocating for both of those of those ranchos as part of an important part of our of our history. Mr.. Mr.. City Attorney, there was a friendly amendment in discussion about the the amount of of the discretionary one time divided by nine money that'",
        "'speaker_2': 'the Council's proposed. I know that legally we want to make sure that we're working within the legal framework right now as the motion is presented by the boss. Can you just repeat at one time.'",
        "'speaker_5': 'Mayor remembers that council. The motion as proposed by the Bossie allows the use of the $2.666 thousand for capital infrastructure programs divided by nine. And that would include programs that, you know, are consistent with the city staff recommendation, with the normal capital and maintenance programing and decisions.'",
        "'speaker_2': 'And I think Vice Mayor 11,000 is going to do a perhaps a friendly amendment to that.'",
        "'speaker_6': 'Yes. So in addition to the language about capital infrastructure programs, can we add and existing programs.'",
        "'speaker_5': 'If I understand the existing city programs? So that would include operational expenditures for programs that are originated and developed by city staff and directed.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Perfect. Okay. All right. Public comment on the item before us. Say Nonmembers, please go ahead and cast your votes. I do. Where do I see somebody from the left. Please come over here. Actually, you have to come up front if you have a comment.'",
        "'speaker_1': 'I just. I didn't prepare anything.'",
        "'speaker_2': 'You have to just state your name and converse.'",
        "'speaker_0': 'And what?'",
        "'speaker_2': 'State your name for the record, please.'",
        "'speaker_1': 'Carl Gunter. Okay. I have not prepared anything, but I. I was I had an issue of concern. So I'm also not really familiar with your program here, but I wanted to speak to these gentlemen of the room. I wanted to make a comment to the gentleman, if I could please.'",
        "'speaker_2': 'To the gentleman. Actually, right now we're only dealing with the the Budget Oversight Committee's recommendations so that you can comment on that. Or if it's something else, it would have to wait till the second public comment period.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'Thank you. Okay. Thank you. I see no other public comment. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance relating to adopting an amendment to Ordinance No. C-6496, adopted July 5, 1988, and amended on January 24, 1989, July 11, 1989, December 5, 1989,  March 20, 1990, July 3, 1990, September 18, 1990, July 2, 1991,  July 7, 1992, January 26, 1993, August 24, 1993, June 28, 1994,  July 18, 1995, November 28, 1995, October 1, 1996, March 25, 1997, October 7, 1997, October 27, 1998, April 20, 1999, October 19, 1999, October 17, 2000, October 30, 2001, March 19, 2002,  November 26, 2002, January 6, 2004, February 8, 2005,  November 1, 2005, December 5, 2006, March 20, 2007, May 22, 2007, December 18, 2007, July 15, 2008, September 21, 2010,  September 13, 2011, September 11, 2012, October 3, 2013, and September 9, 2014 relating to departmental organization of the City of Long Beach, read and adopted as read.": [
        "'speaker_2': 'Thank you. Next. Exciting Vice mayor.'",
        "'speaker_6': 'The next item is item 17, which corresponds to a dash 12. This is the recommendation to declare ordinance amending the Depart Mental Organization Ordinance. Mr. City Manager, do you have a staff report for that?'",
        "'speaker_5': 'Ms.. Erickson.'",
        "'speaker_1': 'Mr. Mayor and members of City Council before you is the organization ordinance which provides for implementation of the budget in terms of any changes to departments and divisions and bureaus in this. The main change was the the reconfiguration of the Economic and Property Development Department.'",
        "'speaker_1': 'The other items are minor changes.'",
        "'speaker_6': 'Okay, thank you. So with that, I'd like to make a motion to approve.'",
        "'speaker_2': 'Okay. There's been a motion and a second. Is there any public comment on the item? See. Now, please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': '18.'"
    ],
    "Recommendation to declare ordinance approving and adopting the official budget of the City of Long Beach for the Fiscal Year 2015-2016, creating and establishing the funds of the municipal government of the City of Long Beach and appropriating money to and authorizing expenditures from said funds for said fiscal year; declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 a.m. on October 1, 2015, read and adopted as read.  (Ordinance No. ORD-15-0025)": [
        "'speaker_2': 'Thank you. Item 21, please.'",
        "'speaker_1': 'Recommendation to declare the Appropriations Ordinance for Fiscal Year 16 creating and establishing the funds of the municipal government and appropriating money to and authorizing expenditures from said funds and for set fiscal year as an emergency ordinance read and adopted as read and laid over for the next regular meeting of the City Council for Final Reading.'",
        "'speaker_2': 'Thank you. And with that, you all have the documents in front of you as prepared by our our finance staff. If I can get a motion in a second. Okay. There's been a motion or a second. Is there any public comment?'",
        "'speaker_2': 'On it, Mr. City Manager And I believe that anything else to report it. This is just the final documents from which what we voted on before. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. So with that, we will return back to the start of the agenda and I'm going to do public comment. I have in this order if you can just please come up. Lineup, Elizabeth Jones, Patty Daughtry, Steven Gratz and Michael Varella.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute an Agreement with the Economic Development Corporation of Los Angeles County, a California non-profit corporation, for the commissioning of a report regarding the potential implications of a minimum wage policy for the City of Long Beach, in an amount not to exceed $65,000; and  Increase appropriations in the General Fund (GF) in the Economic and Property Development Department (EP) by $65,000.  (Citywide)": [
        "'speaker_2': 'Thank you. Item five relates to our agreement with the L.A. EDC on the minimum wage, as well as the nonprofit and business incentive agenda item that passed out of this council, I think unanimously. The only change here is going to be in discussions with L.A., EDC and staff.'",
        "'speaker_2': 'They're recommending that we add a contingency even though we think we're going to stay within the 65. If there is additional outreach that needs to happen to the business community in particular, include more of their of the of that voice or workers.'",
        "'speaker_2': 'We want to make sure we have that in place and don't have to stop the process and come back to council. So this is the recommendation from the city attorney and city staff. So the contingency would be a $10,000 additionally to the 65, of course, to be used only if necessary as part of the contract.'",
        "'speaker_2': 'There is a motion any second, any public comment on concerned calendar item. Say Nonmembers, please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager to execute all documents and take all actions necessary to implement a First Source Hiring Pilot Program (Long Beach First), to apply to awards for non-professional services above $100,000, and construction projects between $100,000 and $500,000 for a period of two years.  (Citywide)": [
        "'speaker_2': 'Thank you. And moving on now to item. And I believe we're going to do the first source item, which, if I can have the clerk read, should be item number 11.'",
        "'speaker_1': 'Report from Human Resources recommendation to implement a first source hiring pilot program to apply to awards for nonprofessional services above $100,000 and construction projects between 100,000 and $500,000 citywide.'",
        "'speaker_2': 'Okay. Thank you, Mr. City Manager.'",
        "'speaker_5': 'Mayor Councilmembers. I'm going to turn this over to our executive director of the Workforce Investment Board, Nick Schulz. This is a fantastic program that we've been working on since back when we were first starting with the play. This was something that we're doing on a parallel course.'",
        "'speaker_5': 'Our time energy went to the play and then worked over to two local hires, and I think we have something we're quite proud of. I'm going to turn this over to Nick and I understand the new name is not first sources.'",
        "'speaker_5': 'Now Long Beach. First source. Nick. Long Beach first. Good evening, honorable mayor garcia and members of the City Council on April 7th, U.S. Pacific Gateway to lead a study on how the city could qualify local residents for employment opportunities generated by city contracts for services and construction projects not covered by the recently executed play.'",
        "'speaker_5': 'You also asked us to engage the community with regard to our research and to return back with a recommendation, which I'm happy to do tonight in our secondary and some primary research we found promising and expanding practice across the country called First Source or FCA.'",
        "'speaker_5': 'It's taking root and what it is, it's a pipeline process, process to move locals to job opportunities created through municipal contracts. We actually studied seven cities in the secondary research portion and some outreach that we did to the cities directly to understand their program or their ordinance.'",
        "'speaker_5': 'And just for your information, those cities were Somerville, Massachusetts. Cleveland, Ohio. Berkeley, California, Baltimore, Maryland. Denver, Colorado, Washington, D.C. and city of Richmond, California. We chose those seven to focus on because in in the course of our research, there was something on paper, a specific program or ordinance that the city had either a report or a specific'",
        "'speaker_5': 'frame of reference for, rather than just an effort that had been labeled. As we went through our research, we found fundamental tenants. Present in all those seven cities that we thought were important to bring and weigh the value of with the public so that those seven best practice sites all had a defined city action, either an ordinance'",
        "'speaker_5': 'or a dedicated program related to first source hire. There were specific compliance requirements required of contractors in relation to the first source program. The outreach and the recruitment mechanisms used to push the opportunities out to the community and the residents was clearly defined.'",
        "'speaker_5': 'The types of positions and number of jobs in those in those first source programs was also clearly defined, and the threshold at which a contract would be made subject to first source was also clearly defined. After we did our secondary research, we set about to gather community feedback and present that research in a manner so that the'",
        "'speaker_5': 'long, Long Beach residents and interested parties would have an opportunity to respond to that and let us know what specific requirements would be acceptable or they thought would be best utilized for the City of Long Beach program. We're now referring to that program as Long Beach.'",
        "'speaker_5': 'First and just briefly, our outreach included a 1 to 1 or facilitated dialog with the Ministerial Alliance. On April 30th, 2015, we did three community outreach events on July 27, 28th and 29th in the guidance center on center in central Long Beach District nine field office in North Long Beach in Silverado Park in in west Long Beach'",
        "'speaker_5': '. After these sessions were completed, we came back and. Put together the following recommendation for you to consider. I won't read you all the bullets, but the highlight of our recommendations, and again, consistent with what we find to be best practices nationally, are that Long Beach First would apply to all contracts for non professional services above $100,000 and'",
        "'speaker_5': 'also city construction projects including right of way between threshold amounts of 100 and $500,000. Long Beach first program will require qualified city residents be given first consideration for hire through a referral system. That referral system would be administered by the Workforce Investment Board, Pacific Gateway.'",
        "'speaker_5': 'Long Beach First would cover all net all net new jobs created through the awards of the contracts previously referenced. The period of reservation held for Long Beach residents to get the first crack at those jobs would be ten calendar days.'",
        "'speaker_5': 'The ten day local reservation period would run concurrent with other contracting processes in order not to delay the beginning of any work or contract or preparation. All outreach methods, including canvasing, traditional social media, activation of existing networks, email, mailings, etc. would be used to.'",
        "'speaker_5': 'Mask the community to refer residents to the opportunities. Again, Pacific Gateway will act as the essential intermediary between all the potential sources for referral noncompliance with Long Beach. First will result or may result in liquidated damages assessed per day at the discretion of our city manager.'",
        "'speaker_5': 'And as we move forward, we also found that we believe there will be minimal administrative costs associated with the implementation of a pilot process. We're asking that you consider this recommendation as a pilot process for two years when we would come back to you with a subsequent report that would include administrative and overhead costs that we would'",
        "'speaker_5': 'track during that time. That would conclude my report at this time, and I'm happy to answer any questions.'",
        "'speaker_2': 'Thank think I'm actually now going to turn this over to Councilwoman Gonzalez, who's the maker of the motion. And I guess she's going to make some comments and then we'll go from there. Thank you.'",
        "'speaker_8': 'Yes, thank you, Nick, for your staff report. First of all, I just want to say I'm really thrilled that we're bringing this full word. It has been renamed as Long Beach first, because I think it will truly represent that Long Beach locals receiving Long Beach jobs first.'",
        "'speaker_8': 'And so, you know, I've often said and I will say it again, you know, as far as us being able to create jobs, we can't do that directly. But we can certainly look at good policies that can support those good jobs.'",
        "'speaker_8': 'And so while this is a pilot project, we must also work to find creative ways to fight high unemployment rates, especially in places like the 90813 with rates of 19%. But also, this is a program for all residents and also localizing our economy where the play doesn't cover.'",
        "'speaker_8': 'I think this will do a good job of that. So hiring local language residents can create so many more benefits, as many of us know, improving quality of life for those families, adding to our economy and tax base and much more.'",
        "'speaker_8': 'It's also of great benefit to our business owners as well, who have local residents in their employee group. So I want to thank the folks that are here, the Ministry Serial Alliance, Local Hire Coalition, the PHC Building Healthy Communities or Cambodian associations.'",
        "'speaker_8': 'There were so many community groups that came together in various parts of the city to be able to put their opinions in place, to talk about how to formulate a good plan for local jobs. And while that is all said, I also want to thank PG, Wynn, Pacific Gateway and Nick Schultz for their hard work in this'",
        "'speaker_8': 'as well. I think we learned, you know, the place served a different purpose. Construction jobs over $500,000. The first source, the Long Beach First program, looks at taking a different approach with different professional services, with different types of jobs.'",
        "'speaker_8': 'So I have a few questions. Nick, I can barely see you there. First off, I wanted to ask about how I know there's been a lot of talk about youth and perhaps maybe a gap in finding youth employment.'",
        "'speaker_8': 'Can you emphasize how this would help or how we can maybe collaborate with other programs? What can we do in this sense for from the first source program?'",
        "'speaker_5': 'Well, it certainly dovetails with some other efforts in the city and specifically some other efforts that we're involved in. I know the mayor's internship initiative comes to mind, so the opportunity for us to engage with with the contractor at the point that they're ready to to do business with the city, gives us another avenue or another venue'",
        "'speaker_5': 'for it to talk about the benefit of internship and engage them not only in their hiring needs, but also in helping us to find a place for an intern in the city of Long Beach.'",
        "'speaker_8': 'Great. So we could certainly partner with that program to make this a more robust program, especially for local youth. And I think it's important, as we've worked on the play, we're now undergoing a study for the minimum wage.'",
        "'speaker_8': 'I think it's important that we emphasize local are our local youth. Next, I wanted to clarify a few things, because there's a few things that seem a little unclear in the report. So what would. I mean, many of us know, but just to clarify or give examples.'",
        "'speaker_8': 'What would be non professional services and also the referral system, how that would work?'",
        "'speaker_5': 'So I'm going to defer to the city attorney on the distinction between the professional and the non professional services. But let me let me handle the piece. As far as the the excuse me.'",
        "'speaker_8': 'The referrals.'",
        "'speaker_5': 'The referrals, yes. So it would work typical to to how we do with either our internship program or the PATH program that we're building with with Councilman Richardson's office. So there are various sources that are that have an expertize with with target populations who are disconnected or who do workforce development services for people looking for a first'",
        "'speaker_5': 'job or to to change and actually move to move to a higher wage job. So just as in our name, Pacific Gateway would act as that intermediary or that gateway. So at the during the ten day reservation, we would use the available forms of outreach to outreach to our community partners, let them know that the position was'",
        "'speaker_5': 'open, what, what the requirements of the position were, and then arrange to handle that referral of all the clients to the community as a single point of contact to the contractor or the given employer at that point in time.'",
        "'speaker_5': 'There's two advantages to that. One, again, the single point of contact aspect for for the employer, the opportunity to open and close the windows seamlessly. And second of all, it's Pacific Gateways ability, given some of the tools at our disposal through our federal funding to actually be able to track the higher forecast or look out over time'",
        "'speaker_5': 'and see that the person is still retained in the labor force in subsequent quarters, post employment and see that they're earning wages if there's increased wages, those type those types of things.'",
        "'speaker_8': 'Okay.'",
        "'speaker_0': 'Councilman, there's also a question on what's.'",
        "'speaker_2': 'Not professional.'",
        "'speaker_0': 'Services. Yes, that would be.'",
        "'speaker_5': 'Primarily custodial work that we would offer landscaping and tree trimming, things like that, as opposed to professional services, which would include engineers, attorneys, nurses, things like that.'",
        "'speaker_8': 'Okay. Great. And then the noncompliance. How would that be enforced? If a business is non-compliant. And I see that there's. A discussion here about that. But I don't know what the enforcement would be on the back end.'",
        "'speaker_5': 'So I cannot speak to how the liquidated damages would be calculated. I think that specific to size of contract in each individual circumstance. But we would move to have the process of a liquidated damage being assessed and initiated by the fact that the specific employer or contractor completely failed, neglected or refused to engage with the first source'",
        "'speaker_5': 'process.'",
        "'speaker_8': 'Okay. But we would have some sort of we would have a tracking mechanism. We would be able to know if if it was clear that they didn't. Participate or had. No, uh. Opportunity or no inclination to participate.'",
        "'speaker_5': 'Right. Right now, what we've engaged with procurement to do is actually to embed the first source language in in bid requirements and then actually to have the first source language at Long Beach versus, excuse me, language in the act, the actual contract.'",
        "'speaker_5': 'And there would be an introduction or a bridge to Pacific Gateway at the point in time when the contract would be executed with procurement and they would already be cognizant of the requirement and have the opportunity to reach out to us to ask any questions when the bid process was initiated.'",
        "'speaker_8': 'Okay, great. Thank you. And another couple of questions. What I just wanted to clarify that at this point, we can identify a significant fiscal impact. I mean, of course, there will be staff costs, but I mean, there's nothing on the front end now that we can foresee would be a major impact to the city.'",
        "'speaker_5': 'Our our major concern when we did the research was could we find anywhere that this limited the number of bids or increased cost of bids? And in the cities we studied, we could not establish that that was the case.'",
        "'speaker_5': 'The other thing, in terms of staff time, it's mainly staff time in a modified process and some of that process is in procurement, but that's somewhat negligible. Once the language is in inserted into the documents and this is core staff time for Pacific Gateway with with a private employer or somebody who engages with us to source talent'",
        "'speaker_5': '. This is the process we use with with any employer. So the city and a city contractor would be no different. And it's just an enhancement of the of the number of employers in our portfolio.'",
        "'speaker_8': 'Okay, great. And then last question. Last question was the departments and the separate legal entities that are excluded, can you or someone explain what those are exactly and why they're excluded?'",
        "'speaker_5': 'The two that are excluded would be not under the jurisdiction of City Council, the harbor department and the water department.'",
        "'speaker_8': 'Just and it's just those two at this point, I think.'",
        "'speaker_5': 'And also the affordable housing projects, I think those are federally regulated.'",
        "'speaker_8': 'Perfect. Um, okay. Cause there was also, I think there was a, uh, perhaps I was getting it mixed up with something else, but harbor water and affordable housing. Okay. Thank you. Well, I would encourage my colleagues to support this.'",
        "'speaker_8': 'I think, you know, this is certainly a win for the city. I think this is similarly what we've done with the play, but it's looking at other nonprofessional, uh, opportunities for people that certainly need these jobs. So I would ask that my colleagues support and thank you very much.'",
        "'speaker_5': 'Mayor, if I could expand on the answer to the Councilwoman, I think other separate legal entities may include the successor agency or the CIC or the oversight board. So there would be possibly other non entities that aren't subject to the jurisdiction of the council.'",
        "'speaker_2': 'Thank you, Councilman Richardson.'",
        "'speaker_9': 'Sure. Thanks, Mr. Mayor. And I want to start by thanking Councilmember Gonzalez and the other signers. I believe it was Councilmember Ranga and Councilman Brand Jews, I believe and we worked really hard for a number of months on this to make sure that it's meaningful and it's tangible and that it has an impact on folks.'",
        "'speaker_9': 'We intentionally asked to call this Long Beach first because that's just it. We are. This gives Long Beach residents a shot at going through the process for all net new jobs first. And I'm confident that if Long Beach residents are given an opportunity, I'm confident they will rise to the occasion.'",
        "'speaker_9': 'So I am in complete support of this. The focus group in North Long Beach was very well attended. I believe staff did a fantastic job, so I'd like to acknowledge Pacific Gateway and their whole team on all of the work that went into putting together a really comprehensive focus group and making it and making the results of'",
        "'speaker_9': 'that reflect in this in this pilot today. President Obama's My Brother's Keeper program that we've talked about for months now. Milestone five is providing youth and young adults access to jobs and the White House and Policy Link List's first source policies and agreements as the top recommendation to meet Milestone five and have a direct impact on youth'",
        "'speaker_9': 'and young adult employment employment. And I think that this is smart that we this this policy allows us to align policy with some of our initiatives, like My Brother's Keeper and like the PATH program, which which diverts disconnected young adults into the workforce as an alternative and keeps them on the right track.'",
        "'speaker_9': 'So for those reasons, I'm in complete support for this. There were some comments that compare this to the project labor agreement. I'm a bigger fan of this than I am of the project labor agreement because I think this is what broader and more impactful to get directly to jobs.'",
        "'speaker_9': 'So I'm really interested in this and I want to see see how this rolls out. I have a question. I see that we're asking for to a two year pilot. Are we? I would like to see some some check ins on how we're doing, some analytics on how this process is rolling out, maybe on a every six'",
        "'speaker_9': 'month basis. So. Mr. City Manager And maybe, maybe could you respond to that?'",
        "'speaker_5': 'Councilmember We can certainly provide you a report every six months on.'",
        "'speaker_9': 'The.'",
        "'speaker_5': 'Performance measures of the program.'",
        "'speaker_9': 'Sure. What sort of measures would you think that reflect?'",
        "'speaker_5': 'The number of people that have applied, put up their names with the workforce, number of people who have been referred to projects, the number of net new hires that have been created when we award contracts, things like that.'",
        "'speaker_9': 'Great. And then the second thing is, I know that Councilmember Garcia excuse me, Gonzalez mentioned that the other agencies it may not it may not include. And that's and that's fine. But I want to just have clarity that it doesn't stop them from doing something similar, having similar agreements at the same time.'",
        "'speaker_9': 'They could very well do so. Correct.'",
        "'speaker_5': 'I believe they could very well do so. And I think in the research we've seen maybe similar entities to to those that we're excluding initially voluntarily participate.'",
        "'speaker_9': 'Great. So so that's it. Again, I'm in complete support Ion and I want to thank again Councilmember Gonzalez on her leadership and all of the city council members for their hard work on this. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Munger.'",
        "'speaker_1': 'Yes. I want to thank Mr. Schultz for his hard work on this. I appreciate the dialog that we've had. Many people cite statistics that only a third of those that are employed in Long Beach actually live in Long Beach.'",
        "'speaker_1': 'And I think that this is a great step in the right direction towards helping our local and helping our neighbors work close by and reducing our emissions, helping them spend their money where they live, not having to venture out into other cities for those jobs.'",
        "'speaker_1': 'And so this is fantastic. I'm very supportive, great work and I look forward to the reports. Thank you.'",
        "'speaker_2': 'Councilwoman Price.'",
        "'speaker_8': 'Thank you. I've had the opportunity to meet with staff regarding the recommendations. And from what I understand, this policy will allow for workers throughout all of Long Beach to be given the first opportunity to obtain jobs that are tied to our city projects and programs.'",
        "'speaker_8': 'I believe this is sound policy. I support this policy because, one, it applies citywide and is not limited to any particular area where the applicant lives. And two, it gives companies an eligible pool of local candidates, but still allows them to exercise their discretion in accepting or declining to hire candidate based on the company, culture and environment'",
        "'speaker_8': '. This discretion and making hiring decisions is critical to a sustainable policy, in my opinion. I thank my colleagues for bringing this item forward and I will be supporting it tonight.'",
        "'speaker_2': 'Thank you. Count summary Ranga.'",
        "'speaker_3': 'Thank you, Mayor. I have a few questions. I know some of them have already been addressed by Councilwoman Gonzales. When we're looking at the point with the, the, the noncompliance issue, um, I still have some issues. Issues questions about what is that definition of a non-compliant contractor.'",
        "'speaker_3': 'Um, there are, you know, it's complex. There's a lot of issues going on here. For example, when we're looking at a contractor making a, an appointment or giving being given names of qualified residents that Pacific Gateway has already vetted to a certain extent, what is that good faith effort, quote unquote, as it says here, that they're going'",
        "'speaker_3': 'to look at these individuals and then hire them? What is what is the definition of a good faith effort? What is.'",
        "'speaker_5': 'So as as the recommendation is presented, it is actually to to that the resume and from their decision on the resume either bring that candidate in for interview or decline to interview that particular person. The freedom of the hiring decision is still in their corner.'",
        "'speaker_5': 'But again, they would need to take time to sit down and that the referrals, the qualified referrals that were passed along.'",
        "'speaker_3': 'And when you say you have the a local reservation period of ten days, is that I see it in the portion where you have maybe two portions. We're talking about unions like you have regularly. Isn't that too short of a period?'",
        "'speaker_3': 'I mean, most contractors and most employers nowadays require that an applicant go through a life scan or some kind of background check, a drug test before they get they get selected, which is ten days enough.'",
        "'speaker_5': 'Ten days has nothing to do with with the process when when they choose a candidate. The ten days is the is strictly the reservation period. So they cannot open that vacancy up and begin to source other applicants for the ten days or we or until we notify them that the qualified pool of local residents is exhausted.'",
        "'speaker_3': 'So it would be your responsibility to get Pacific Gateway responsibility to vet these potential employees.'",
        "'speaker_5': 'So it's it's a joint responsibility. It's a joint responsibility between Pacific Gateway in our community partners and again, to get the most access to the available jobs to the most residents. We need that community partnership to finalize folks.'",
        "'speaker_5': 'We need time to activate that. We need time to make sure they have the job description in hand to do the screening of their database of clients. We would actually then be the single point of contact to make the comprehensive referral list of the folks from the community who qualify to be evaluated for the position.'",
        "'speaker_3': 'Okay. And when it comes to the non professional definition, I heard custodian, tree trimmer, gardener, those types of things, those are. Low wage occupations. Is there a of an opportunity here to create a living wage type of opportunity for these contractors?'",
        "'speaker_3': 'I know some of these contractors are going to come in and in nonprofessional $10 an hour, not a living wage. Is there going to be a requirement that they provide at least a living wage opportunity for these individuals?'",
        "'speaker_5': 'Again, some of the things that you referred to will be subject to prevailing wage anyhow. So that's that's certainly a living wage. When you look at union jobs that that aren't covered or are below the threshold of of a play, I believe those are already living wage jobs.'",
        "'speaker_5': 'So I think we have we have that covered in those regards. The other thing I would say is that there are some residents who will qualify for work who need a first job, who need some stabilization service, stabilization of a first job.'",
        "'speaker_5': 'And we wouldn't want to exclude any of that in how we approach that. But yes, as always, and our metrics are driven by ensuring that the majority of folks we serve are in living wage jobs.'",
        "'speaker_3': 'Well, I certainly hope so. That's that's important to me in regards to individuals that we are hiring, especially at entry level positions, that there's an opportunity for not only to provide for their families, but to also have an opportunity for growth in that area as well.'",
        "'speaker_3': 'Other than that, I want to thank the participants here, the building of the Community Alliance, Legal Aid Foundation and others who participated in the in these work groups. Certainly your input was very important and I hope that nothing's perfect.'",
        "'speaker_3': 'I know that because it never is. It seems like, you know, the city council where we're trying to do things right and most of the time as I think we get it right. However, I'm looking forward to two comments from from the audience.'",
        "'speaker_2': 'Councilman Andrews.'",
        "'speaker_4': 'Yes. Thank you, Mayor. First of all, I'd like to thank our Lena for bringing this forward on the diocese, because the fact that I, I think everyone realize how important it is for jobs and we talk about first, you know, I want to thank the Pacific Gateway as well as all of the organizations involved in the community'",
        "'speaker_4': 'feedback session. And I would also like to thank the Ministers Lyons for their involvement, because sometimes it still takes a village. Every day I've had, you know, young men approached me on, you know, the streets, you know, I need a job in this program like this allows me to give them, you know, the young people, you know'",
        "'speaker_4': ', an answer like where you truly deserve that. And, you know, and the biggest part about all of this, I think that in vetting all of these jobs, I'm hoping that we can even go even further because, you know, and I know that most of these jobs they will be speaking about, the first thing you're going to ask'",
        "'speaker_4': 'you about your background check, you know what that involves in various individuals and that will almost eliminate them completely from these jobs. I'm hoping that we will take this and take it very seriously to let you know that we talk about Long Beach versus job offers, that these individual have enough, you know, a passion and concern and'",
        "'speaker_4': 'know that if you say you're talking about hiring me, please, when you vet this, you know the application that these people will not be thrown out because of their background. You know, a lot of it is because of the fact that, you know, first time, you know, they ask you, have you ever been involved?'",
        "'speaker_4': 'You know, I have a felony. You know what that does to any, you know, applicant, it throws them out of the loop. So I would just hope that we can go a little further and hope that we can get a little more to help these individuals get further down the line.'",
        "'speaker_4': 'And thank you again, Nina, for bringing this forward. And I think this is one of the better things that we've done for the community, for the city of Long Beach, giving them a chance to know that we do have a program that we will be hiring here in our local cities first.'",
        "'speaker_4': 'Thank you again.'",
        "'speaker_2': 'Thank you. Public comment now. Any public comment?'",
        "'speaker_7': 'Good evening, Mr. Mayor. Council My name is Derek Simpson, resident of District two, executive director of the Long Beach Community Action Partnership. And also tonight is a member of what has been a local hire or coalition started coming to these meetings and speaking on this subject on April 7th and been very involved since that date, speaking with'",
        "'speaker_7': 'many of you as council one on one, try to understand this process so that I could speak intelligently to the community about what's going on, how they can get involved and how they can be supportive. I have to tell you that even though I was really involved, I was also disappointed to find out that as I attended'",
        "'speaker_7': 'some of the meetings that were mentioned, that though I thought we were going to be able to speak to the local hire policy as a part of the play. We were told, no, that's not going to happen. And because Long Beach first was the subject at hand, and I applaud the staff for the work and the energy'",
        "'speaker_7': 'that they put in to it. But the fact remains that we have a public project labor agreement that's passed without a local hire policy. And just as the councilman just asked Councilman Richardson, how will we measure this? Can we get six months reports on this?'",
        "'speaker_7': 'I don't know that we have a report that will come back to you that says, in fact, with this play being passed as it is, how will we measure that jobs are being made available through the play, such as they will be made available with this Long Beach first.'",
        "'speaker_7': 'So I would ask at a minimum that you consider tonight, just as you've considered adding a reporting process and six months for language first that you consider adding also maybe an annual report to see that maybe some of what we've been expressing is our concerns for six months in these meetings and as a result of even what'",
        "'speaker_7': 'one of the councilperson said about showing up for something only when it's about their agenda item. I showed up for meetings even when I didn't need to be here because I wanted to see what was I missing, as intelligent as I think I am.'",
        "'speaker_7': 'Clearly something was not clicking with me on this whole subject. And so, though I'm no longer a member of PG when the only commission that the mayor appointed me to. I'm here as an individual representing Long Beach Community Action Partnership, representing this local hire coalition to say to you as a city council, we indeed need to at'",
        "'speaker_7': 'least consider how we measure what is said is actually getting done when it comes to a policy that's local hire policy for the project labor agreement. I stand ready to help anyone behind the rail in this process and any member of this city management team in this process to make sure that it happens.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Thank you, Derek. Next week, a police.'",
        "'speaker_0': 'Good evening, Mayor. And city and city council members. My name is Brian. There's a meeting. Um, I live in the first district, and I'm current instead of Columbus City College. Um, I'm happy to say that the City Council is taking up the issue of jobs for our community.'",
        "'speaker_0': 'It's important that we have policies that prioritize hiring Long Beach residents, especially those living in areas of high unemployment. And I'm speaking tonight because many people in my community, including my mom, struggle to find work. Um, as a result myself, I think that it's very important that there are jobs available because having a job is key to'",
        "'speaker_0': 'a better future and a better life. Whether it's this first source hiring program or the labor agreement that targets work hours for local residents and disadvantaged workers, it's important that the residents of most cities jobs get them. We also need to be able to evaluate how well this policies are working to benefit residents who live in parts'",
        "'speaker_0': 'of the city that are most impacted by unemployment and the problems that go and the problems that go along with that. And with our age, it's going to be important to develop ways of doing outreach that find those who are hard to reach and who might not have regular computer access.'",
        "'speaker_0': 'These policies are just the beginning of what we need to do to address joblessness in Lombard. As a city, we need to continue to look for ways to build upon the strategies, efforts with our jobs available. The unemployment rate goes up and residents can see a brighter future.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you very much. Thanks, public speaker, please.'",
        "'speaker_10': 'Good evening. My name is Alexander Herndon. I'm an attorney with the Legal Aid Foundation of Los Angeles and our Long Beach office. I'm here tonight to raise just a few important points that should be addressed through a local hire policy.'",
        "'speaker_10': 'And we feel merit discussion one last time. What we understand it's not the current will of the council. We feel the local hire policy item represented a missed opportunity to resolve some key unanswered questions regarding implementation of the place local hire requirements.'",
        "'speaker_10': 'These unanswered questions include what steps a contractor needs to take before they hire outside of Long Beach and what the penalty would be if they don't follow those steps. How the city will monitor the success of the place.'",
        "'speaker_10': 'Local hire requirements through periodic reporting by contractors. The city specific roles and responsibilities with regard to ensuring proper implementation and success of the local hire provisions, and how the community can participate in oversight, monitoring and evaluation of the play.'",
        "'speaker_10': 'Resolving these questions in a local hire policy could translate the good intentions of the play into meaningful hiring for Long Beach residents. And so therefore it echoed the recommendation for an annual report to be given regarding the PLA local hiring component and for that report to be given at a public meeting, a meeting of the Council so'",
        "'speaker_10': 'that the public has an opportunity to review that information and to weigh in from the community perspective. I would also urge the Council to appoint community representatives to the two vacant seats on the Joint Advisory Committee called for by the play again to ensure community oversight and transparency in this process.'",
        "'speaker_10': 'This would give the community and the Council the opportunity to learn from any failures and build on any successes as these policies unfold. So what? We applaud you for taking the first steps to establishing local hire programs for the city of Long Beach.'",
        "'speaker_10': 'We feel that more can and should be done to ensure that Long Beach jobs go to Long Beach residents. Thank you for your time.'",
        "'speaker_2': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Okay. My name is Tania Reyes Ranga, and I'm a former city councilmember and a 25 year workforce development professional, ten years here in Long Beach and ten years in West Orange County service delivery area. Working with the Workforce Investment Board, I was first director of the first Work Stop Center Workforce Center in the County of Orange and'",
        "'speaker_1': 'later consulted with the Department of Labor on how works for centers can be more integrated with union apprenticeships and nontraditional careers for women. A little of my background and why I'm so concerned about this report, this report submitted to you either gives the council members from the one, six, seven and nine districts what they requested and it'",
        "'speaker_1': 'was seventh. Nor did it give the community what they needed in regards to assurances that the city understands and has the will to develop a local hire plan. The request on April 7th specifically stated, and I quote, for a specific, comprehensive local hire program that will work to give people the tools and resources to secure a good'",
        "'speaker_1': 'job with good wages and benefits. The report was neither specific nor comprehensive. One local hire was never addressed or defined. What is local hire? No definition can. No definition, even through the council even know that the council requested.'",
        "'speaker_1': 'The Council request included an attached map delineated delineating unemployment clusters by zip codes. No definition of local hire was given or even referred to in the report for purposes of play and non-players. Two. There was no definition of low income and no verification process for low income eligible residents.'",
        "'speaker_1': 'It was neither outlined nor suggested. Three The scope is so narrow 100000 to 500000 nonprofessional and construction projects and did not include any detail regarding the scope of the universe and universe and the number of jobs that may be available for the definition of local hire jobs and how they would be quantified on any tier one hires'",
        "'speaker_1': 'was submitted, as it were, for non-player hires. Five. There are no goals, no measurements, no enforcement, only good faith efforts and first considerations. And most of all, there was no job coordinator identified other than the vague reference to the Pacific Gateway Center.'",
        "'speaker_1': 'Six. Utilizing the Pacific Gateway Center as an essential intermediary is duplicative as workforce centers are already charged with this task. And this report doesn't provide the Pacific Gateway with details and specifics on goals or measurements of success. The community had high hopes for this report, but soon after the first community session, it was clear that the city'",
        "'speaker_1': 'had no intention of having a local hire policy. And the first source hiring pilot program does anything but make Long Beach first for those most in need. I want to thank the local hire coalition and the ministerial alliance and the over 20 churches who were involved in the push to get the city to detail a local hire'",
        "'speaker_1': 'program. I also want to thank councilmembers Gonzales, Andrews, Warren and Richardson because they were doing what they were supposed to do, and that's watch out for the well-being of their constituents. I'm only sorry that the city could not deliver.'",
        "'speaker_1': 'I expected much more because, quite frankly, our residents deserve much more. Thank you.'",
        "'speaker_2': 'Thank you. I'm turning it over to a public comment. Please come forward. Is there anybody else in public comment? Because I mean, of course, the speaker's list. Okay. Speaker, this is close your last one. Yes, sir. Thank you, Mr. Mayor.'",
        "'speaker_2': 'And Council. My name is Steve. I am a fifth district homeowner and fourth district business owner. My only suggestion here is that the service industry, bartender servers and all of that throughout our city are included into this whole process, especially through the convention center and its contractors that locally that were we're forcing those agencies or contractors to'",
        "'speaker_2': 'hire locally. These bartenders and servers make approximately 15 to $30 an hour once you include earned tips. And it's a very, very good living. And I just want to make sure that that's who were included into all of this.'",
        "'speaker_2': 'Thank you. Thank you, Councilman Richardson.'",
        "'speaker_9': 'Thanks, Mr. Mayor. I just wanted to take a moment and just respond to Derek Simpson cap and ask the city manager just to respond to the question about the question about the Pele's actual live reporting. I remember that there was report back mechanisms put in and and these are separate things.'",
        "'speaker_9': 'But I just want I don't want to sort of run over that. So. City Manager, could you just quickly respond to that?'",
        "'speaker_5': 'Mayor Councilmembers are required to come back with an annual report.'",
        "'speaker_9': 'That's what I thought. So there there are these are distinct issues, but the play does have annual report mechanism. And this what we're asking for isn't, you know, an elaborate report, another convening at city council. What we're looking for is a report like a written and analytical report here to City Council on the results of a, you'",
        "'speaker_9': 'know, first source or Lambie's first. So I just want to make that distinction. Thank you.'",
        "'speaker_2': 'Councilman, Councilwoman Gonzales.'",
        "'speaker_8': 'All right. Well, I thank you for the comment. I mean, you all are, you know, telling it like it is, which is always so wonderful. And I know that many of you have been here for so long. I still do think that this is a program that we can all stand behind.'",
        "'speaker_8': 'I really do believe that. And it's not perfect. We have opportunities now to look at it. The play, it's never you know, nothing is ever going to be perfect. But I still do believe that we will. We have a local hire element in there that was pretty fruitful.'",
        "'speaker_8': 'And we have a lot of many of our city staff here who are Long Beach, local residents themselves. They live here in Long Beach and they care and they're invested in this as well. They are staff members that have really put together a great framework for our residents and our business owners and in making sure that they'",
        "'speaker_8': 'are keeping your your community input in mind. And although, you know, we'll continue talking about this and make sure that it evolves and it's a progressive policy that will encompass all of the things as as it goes along.'",
        "'speaker_8': 'I do still thank you for your comments in that sense. So thank you again to Nick. I know that he worked very, very hard on this. I think after the play was complete, I think we talked about an alternative.'",
        "'speaker_8': 'And his experience in organizing an FSA in Alameda County I think was very important for us. So I just want to thank him again for that as well as our city staff. And I failed to mention my thanks to my council colleagues, Councilmember Andrews and Councilmember Suranga, who really worked hard on this as well.'",
        "'speaker_8': 'So appreciate it.'",
        "'speaker_2': 'Thank you. Before we go to the vote, I'm going to a couple of comments. The first is I want to thank start by thanking Councilwoman Gonzales and the members that brought this forward. It's, you know, within the span of of eight or nine months, the city has had have gone from having no project labor agreement and no'",
        "'speaker_2': 'local source hiring agreement to having both. And we don't you know, we don't always get exactly what what everyone wants out of every agreement or ordinance. But I think this is something that the city should be very proud of.'",
        "'speaker_2': 'I think the community put in a lot of work and want to thank the community members. That did put in a lot of work. I'm a little disappointed that there is some disappointment from from some members of the community.'",
        "'speaker_2': 'And I think there's this actually is a very good effort. And I want to thank the councilwoman, but also the members that were involved. I also want to thank Nick Schulz and the entire team at Workforce Development. You guys did great work with the outreach.'",
        "'speaker_2': 'There was a lot of effort. I know the amount of hours you guys put into into doing this. And and I'm pretty proud of the fact that Long Beach after tonight will have both a project labor agreement and a first source for local hire agreement, which I think both are pretty significant.'",
        "'speaker_2': 'And so I want to thank you again, Councilwoman, and the other members that were involved. And please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to approve the Fiscal Year 2015 third departmental and fund budget appropriation adjustments in accordance with existing City Council policy.  (Citywide)": [
        "'speaker_2': 'Thank you. Let's go to item ten. Is item ten or is that item. Actually. Item ten. Ten, correct. All right, Madam Kirk.'",
        "'speaker_1': 'Report from Financial Management Recommendation to approve the fiscal year 2015 third departmental and Fund Budget Appropriation adjustments in accordance with existing City Council policy citywide.'",
        "'speaker_2': 'Thank you. There's a motion and a second really public comment on item ten. Get. Please cast your vote.'",
        "'speaker_1': 'Vice Mayor Lowenthal. Motion carries.'"
    ],
    "Recommendation to authorize City Manager to execute the renewal of contracts with Anthem Blue Cross, the Citys Third Party Administrator for the Preferred Provider Organization (PPO) and the Health Maintenance Organization (HMO) group health plans and Medicare Supplement plan; United Healthcare Medicare Advantage Plan; Scan Health Plan for the Medicare Advantage Plan; Delta Dental for the fee-for-service dental plan (DPPO); Medical Eye Services (MES) for the vision plan; CVS Caremark as the Prescription Benefit Manager (PBM) for the Prescription Drug Plan; The Standard Insurance Company for life insurance and long-term and short-term disability; and Union Mutual Life Insurance Company (UNUM) through Larry Lambert & Associates Insurance Services for long-term care insurance; and any subsequent amendments necessary to maintain current benefit levels and remain in compliance with state and federal laws on all plans.  (Citywide)": [
        "'speaker_2': 'Thank you. Next item, please.'",
        "'speaker_1': 'Item 12 Report from Human Resources Recommendation to execute the renewal of eight contracts for health, dental, vision, prescription and disability to maintain current benefit levels and remain in compliance with state and federal laws on all plans citywide.'",
        "'speaker_2': 'Thank you. There's a motion in a second. Is attorney any public comment on 12? Councilman Mongo.'",
        "'speaker_1': 'Thank you. This item is really important. A year ago, when I brought it to the attention of the council that we were experiencing a $4.2 million increase in our annual benefit costs, I think that we forget how prudent we've been, and I appreciate the meetings that I've had with the city staff to really get a grasp and'",
        "'speaker_1': 'understanding on what this means. I think it's important to recognize that since 2013, our medical costs have increased by $13.9 million. What does that mean to a city employee? What that means is that the city has absorbed almost 20 $700 per employee.'",
        "'speaker_1': 'And when you compare that to the average civilian salary of the employees of the city of Long Beach, that's nearly a 4% increase over the last three years. And so I know these are tough, tough, tough times. And we are working really hard with our employee groups to ensure that we can be the employer of choice of'",
        "'speaker_1': 'all cities. And we want to create a positive work environment and good paying jobs and also. Take into consideration the millions of dollars that we as a city continue to absorb year after year, because this 20 $700, while it does not show up in your paycheck, it is an additional cost that we as a city have had'",
        "'speaker_1': 'to incur. I want to thank the Human Resources Department and the work that they've done in the benefits management. There are many other large cities and smaller cities that have experienced larger increases than we're talking about today. Thank you to the employees of the city of Long Beach who are staying healthy and active and going out of'",
        "'speaker_1': 'their way to make efforts to improve their health. Because the partnership that you're doing in being healthy is a really important component of our ability to keep these costs under control. And I don't know about you, but I'd love to have an additional 20 $700 check every three years, and we aren't able to do that.'",
        "'speaker_1': 'Instead, we're absorbing these costs, and it doesn't seem like we're able to increase wages every year. But this is an important component. And our health has been our health care has been a big part of what makes this employer a great employer.'",
        "'speaker_1': 'So thank you very much to the city staff, the new benefits coordinator. Welcome. Our new H.R. manager. I'm sure you'll learn how much I care about this item as much as our previous H.R. manager. I keep a tight look on these costs.'",
        "'speaker_1': 'They can skyrocket up, as we've seen in the past, over 10% increases in a single year. So we need to work on that. Is there anything else that, ah, our H.R. team would like to add or the city manager.'",
        "'speaker_0': 'Alex, Michelle, anything?'",
        "'speaker_1': 'No other than.'",
        "'speaker_6': 'We'll certainly take your comments to heart. And it's certainly.'",
        "'speaker_1': 'Something that we'll look into for the following year. Thank you so much appreciation to all our city employees who are helping stay healthy and keep our costs low.'",
        "'speaker_2': 'Thank you. See? No public comment on the item. Members, please go and cast your vote.'",
        "'speaker_1': 'Councilman Andrews. Motion carries.'"
    ],
    "Recommendation to adopt resolution in support of Long Beach hosting the National League of Cities 2018 City Summit.": [
        "'speaker_2': 'Thank you. 25.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to adopt resolution in support of Long Beach hosting the National League of Cities 2018 City Summit.'",
        "'speaker_2': 'Thank you. I'm going to make let me make a couple of comments about this. This is actually pretty significant. And I know, Councilman, your WRANGHAM, I might want to make a couple comments as well. This council tonight adopting a resolution to support Long Beach, being the host of the National League of Cities Conference in 2018.'",
        "'speaker_2': 'I bring it up because I don't believe Long Beach has ever hosted the National League of Cities National Conference. This is actually a huge conference. It's the largest that the National Cities host every year. So we've been working on on attracting this conference of the city.'",
        "'speaker_2': 'I want to thank Steve Goodling at the CVB, who was very helpful with our team in bringing the conference to Long Beach. This will bring mayors, council members and other national federal staff from the executive branch of the White House to Long Beach.'",
        "'speaker_2': 'For this summit and for this conference, it is very prestigious for the city to have. We haven't done it before and it will bring national attention to our community and we'll be hosting hundreds of elected officials from across the country.'",
        "'speaker_2': 'And so it's it's very exciting. It's going to involve the city being very involved. But I but I do want to thank the National League of Cities as well as our CVB. I also want to thank Councilman Tauranga, who is our representative to the National League of Cities, and he may want to make some comments.'",
        "'speaker_3': 'Councilman Thank you, Mayor, and thank you for your support on this and this effort. You know, it's a rare opportunity that any city has to invite a national conference of any size into its location, into its city. And having been a member of a national organization in the past, I know how hard it is because some of'",
        "'speaker_3': 'these conferences are planned for five or six years in advance. And this opportunity that we have in 2018 is one that we just could not miss. And I want to thank you for your efforts. I, too, want to thank Steve Goodling from the CVB in their efforts to bring it to Long Beach.'",
        "'speaker_3': 'And I'm looking forward to having a good conference in Long Beach. Thank you.'",
        "'speaker_2': 'Thank you. Any public comment on the item? CNN. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. Let me to the second public comment period. Is there anyone from the public? Casing none move on to new business, starting with counts of starting with Vice Mayor Lowenthal.'"
    ]
}