{
    "Recommendation to receive and file a presentation from GRID Alternatives-Greater Los Angeles in Celebrating 200 Solar Installs in the City of Long Beach.": [
        "'speaker_0': 'Okay. Thank you. We're we've had a couple two requests to move up two items, and then we'll go to public comment. Item 21, please.'",
        "'speaker_1': 'Item 21 is a communication from Councilmember Pearce, Councilwoman Gonzalez and Vice Mayor Richardson. Recommendation to receive and file a presentation from Grid Alternatives Greater Los Angeles in celebrating 200 solar installs in the city of Long Beach.'",
        "'speaker_0': 'Councilmember Pierson.'",
        "'speaker_8': 'Awesome. I want to thank. Great alternative stellar sewer second district resident commissioner.'",
        "'speaker_4': 'You saw commissioner, right? Yes, ma'am.'",
        "'speaker_8': 'Yeah. Not only for coming today, for all your efforts in the past, but for hanging in there as long as you could at the last meeting. And so I know that you guys have done a lot of great work citywide on trying to do as many installs as possible.'",
        "'speaker_8': 'So I'm eager to see your presentation today. And well, I'll have some comments after your presentation. Okay.'",
        "'speaker_4': 'Thank you, Mayor Garcia and City Councilmembers. Thank you to Councilmember Pearce, Councilmember Gonzalez and Vice Mayor Richardson for putting this on the agenda by name. Stellar Sewer District two resident and I am the outreach and partnerships manager for Grid Alternatives.'",
        "'speaker_4': 'With me is my colleague Danny Holm, who is the communications coordinator for the organization as well. And so we're really glad to be here today. This is something that we've been working on for a number of years. I have just a couple of slides, 200 and counting, lighting, lighting up Long Beach with clean energy and green jobs'",
        "'speaker_4': '. So who is grid alternatives? We're a nonprofit organization that makes renewable energy technology and job training accessible to environmentally disadvantaged communities. We bring together partners, volunteers and job trainees to implement solar power and energy efficiency for low income families.'",
        "'speaker_4': 'And we provide them energy cost savings, hands on solar installation experience, and a source of clean, local energy that benefits everyone. Our mission to make renewable energy technology and job training accessible to underserved communities and a successful transition to clean energy.'",
        "'speaker_4': 'Here's some of the the results over the past. Since 2007, we've installed over 1450 solar systems in L.A., Orange and Ventura Counties. We've installed over 200 solar systems here in Long Beach. We've helped families save over $40 million in lifetime electricity costs.'",
        "'speaker_4': 'We've prevented the release of 99,000 tons of greenhouse gas emissions here in our city. And we've provided over 5000 community members with solar installation experience and connections to future green career opportunities. And in fact, 87 of our volunteers last year, we connected to renewable energy jobs, which is pretty amazing, if you think about it, 87 jobs.'",
        "'speaker_4': 'So we're really proud of that. Our program, Energy for All, as I mentioned, connects families to the the solar energy systems at no cost at no cost for the families. We are not a for profit company. In fact, we're the only nonprofit solar company that was selected to do this work since back in 2007.'",
        "'speaker_4': 'This is the 200th family that we installed over in Councilmember Gonzalez's district, and this was Ms.. Laura Hill and her daughters. Just a little bit about Ms.. Hill real quick. She's been a resident of Long Beach for nearly 40 years.'",
        "'speaker_4': 'She was originally from Pittsburgh, California. She's familiar with the challenges of an environmentally, environmentally disadvantaged community from her childhood years, when she watched the build up of urban oil infrastructure around her home in the fifties. She traveled down to Long Beach.'",
        "'speaker_4': 'She worked at the downtown Long Beach McDonald's restaurant. Today, she no longer drives or works, but she leaves home frequently for medical appointments and visits with her friends. She's a she's proud of her home wish where she made it comfortable for her family.'",
        "'speaker_4': 'Several months ago, she partnered with Rebuilding Together Long Beach, and they provided improvements to her home, as well as the solar energy system that we provided from grid alternatives. So we're really happy that she was our 200th installation.'",
        "'speaker_4': 'Let's see what else I have. Danny, I think, Danny, I'm going to ask you to come up here and just talk a little bit for our executive director. Sure.'",
        "'speaker_9': 'So Stella was kind enough to let me speak very briefly about kind of the future and maybe even the present state of our work in Long Beach. We're tremendously excited to be working in this city as an organization, and it's very exciting for me as well as someone born in Long Beach to be giving back to the'",
        "'speaker_9': 'community in this way. Long Beach has huge potential to go solar because there's huge need here for the energy savings and bill savings that come with energy independence. There's also a tremendous opportunity to improve health and wellness for people living in environmentally disadvantaged communities.'",
        "'speaker_9': 'We could never have gotten to 200 installations in the Long Beach community were it not for the consistent leadership of Mayor Garcia, as well as Larry Rich and the Office of Sustainability here in Long Beach, a firm and valued partner for us and the members of the council who are sitting here tonight, great alternatives.'",
        "'speaker_9': 'Really want to thank the Council and the mayor for partnering with us to make renewables as widely available as possible going forward in the future, starting with the 210 families that we've already gone to as of July 2018 and looking forward to many more individuals impacted as our partnerships with the city grow, as our partnership with the'",
        "'speaker_9': 'Conservation Corps of Long Beach grows, and as new opportunities to benefit the community through solar come into into possibility when we have the opportunity to secure major funding. We are a nonprofit organization and we often look to see how that funding can benefit people right here in Long Beach.'",
        "'speaker_9': 'As a specific example, I can tell you that right now we're working on seeking funding for a community solar program here in Long Beach through the first of its kind for us, our first community solar implementation, and would also have transformative effects for people in the city.'",
        "'speaker_9': 'It would allow nonprofit organizations, other local organizations and subscribers who are individuals themselves, renters, homeowners, to lock in some of their energy costs and really get closer to solar technology that people used to think was off limits to low to moderate income people.'",
        "'speaker_9': 'So this is an exciting opportunity. I can tell you just today, still in myself, we're working on reviewing our submission, which goes to the Chan Zuckerberg Initiative and to the Rockefeller Foundation for the Community Life Challenge. You'll be hearing more about that work from us as it develops.'",
        "'speaker_9': 'Just once more on behalf of our organization. It's an exciting time to be working in solar. We couldn't be more thrilled to be doing it in Long Beach, and we thank you for supporting energy that's available to everyone.'",
        "'speaker_4': 'Thank you, Danny. And this final slide here. This took place about two weeks ago in your youngest district. The entire Office of Sustainability came out to volunteer on the roof of this family. And so we were so excited that they made that commitment.'",
        "'speaker_4': 'They were there, you know, probably majority of the day. They got a great experience. They helped the family, obviously connect to clean energy and to lower energy bills. We thank Councilmember Yarrawonga and staff for stopping by and we would love to have all of you out there.'",
        "'speaker_4': 'In fact, Mayor, you joined us for an install probably about two years ago or no, actually, when you first started as mayor, that was one of the first things he did was he joined us on the roof of a home over in Craftsman Village.'",
        "'speaker_4': 'And we've had other individuals from city council chief of staff Celina from District seven that also joined us. So we invite you all. CC Not you, not right now, but later on after you have the baby come and join us.'",
        "'speaker_4': 'And so we wanted to give this plaque to you. This is from great alternatives, Greater Los Angeles. It says Outstanding Partnership Award presented to the city of Long Beach in recognition of efforts to expand solar access presented on the occasion of our 200th install with alternatives Greater Los Angeles.'",
        "'speaker_4': 'And this was back in December. So we've had this all this time. It was over at the Office of Sustainability, but we wanted to give this to you. So thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much. So I'll come up and we'll come up and grab it. Let me just a couple of people to wanna make some comments first so councilwoman you wanna go back to our peers.'",
        "'speaker_8': 'I just wanted to say again thank you so much for all of your efforts, your partnerships. I know we've done a couple of community events in the second district as well. How many solar installs do you think you can get done in the next 12 months?'",
        "'speaker_8': 'If we are collaborating on a bigger scale.'",
        "'speaker_4': 'If we have everyone focus or you know, if you think about it, if you were to identify five families, right? And then we work with those families, we get them situated with the solar system, we ask them for referrals because that's the best way to to promote the program.'",
        "'speaker_4': 'If someone you know in your district is receiving solar, then the neighbors see it and it's like, oh, okay, that's that's legit, right? And the city of Long Beach is a partner. Then it's it's easier to get into, you know, build that rapport with the with the family so we could do 100, 200.'",
        "'speaker_4': 'It really just depends.'",
        "'speaker_8': 'And so I'm going to challenge us to do another one in the next 12 months. And I wanted to clarify, when we were doing one of our events in the second District, we talked a lot about roofs. And one of the biggest challenges, as I recall, being that roofs were not able to withstand that and people had'",
        "'speaker_8': 'to go in and get new roofs. Yes. What's the cost of a new roof?'",
        "'speaker_4': 'Shoot, it could be anywhere between 5 to $15000. And I'm glad you brought that up, Councilmember, because we have been able to work with different organizations and we have now gotten funding to repair some of those roofs. Oh, that's so not only are they getting a free solar system that will reduce their energy bill by 50 to'",
        "'speaker_4': '90%. But there's also an opportunity to connect them to a new roof.'",
        "'speaker_8': 'That's great. And I bring that up because right after that, we had one of the council members here from San Antonio, which I want to thank Mayor Garcia for having him come around. He is a councilmember in downtown.'",
        "'speaker_8': 'And one of the big items that he did in San Antonio was creating a fund for new rooftops that then allowed people to go and get solar. And so I just want to thank you one more time for your for your efforts and look forward to getting another 100 solar 200 in the next year.'",
        "'speaker_8': 'Thank you so very much.'",
        "'speaker_4': 'Let's do it. Thank you. Thank you very much. Mayor, did you want you guys want to.'",
        "'speaker_0': 'Oh, yeah. I'm first let me finish the speakers and I'm going to come up. Thank you. Councilman Gonzalez.'",
        "'speaker_2': 'Stella, thanks so much. You have a real passion for this. You've had a passion for this. And we appreciate it very much and our residents appreciate it. Not only do I love the color green, but I absolutely love green initiatives like this.'",
        "'speaker_2': 'Yes, because they really do help people who may not have a lot of resources but still can be environmentally friendly. They just don't know how. And this gives them the power to be able to do that. I do see, though, a synergy with rebuilding together and a few other nonprofits that perhaps you can create a collective with'",
        "'speaker_2': 'that could really be very powerful. And I look forward to seeing this through and getting to those numbers and anything we can do to help on behalf of the First District. We're there for you. So thanks so much.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Orengo.'",
        "'speaker_9': 'Thank you, Mary. And I want to thank you, Stella, for putting this together and for picking a website. It's a community that really has a lot of need. And certainly that this project and this program that you have going over there for sustainability and green energy is just absolutely fantastic.'",
        "'speaker_9': 'And the most important part that I was impressed with that day that I went there was the number of volunteers who were there and the the training opportunities that you gave them in terms of solar installers. I mean, that was just absolutely amazing.'",
        "'speaker_9': 'And the energy that was there for these individuals to learn how to install solar panels was just absolutely wonderful. So I want to thank you for your work and not only in what you're doing for green energy, but also for providing training opportunities for people who need it.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. And Councilman Andrews. Yes.'",
        "'speaker_6': 'Also, first of all, so I think it's a great job and what you guys are doing. And I'd like to thank Councilwoman Pearce for highlighting this nonprofit work towards, you know, going solo, because the fact that my chief met with Shell and we find that there are great things that happen in the sixth District because a lot'",
        "'speaker_6': 'of this is look at the money you can save by doing this. And I wonder, when you said 87 jobs, you know my thing, a job stops a bullet. That's a great, great opportunity. Keep up the good work and anything we can do in the sixth district.'",
        "'speaker_6': 'Please keep us aware.'",
        "'speaker_4': 'Very good. Thank you.'",
        "'speaker_0': 'Thank you. Thank you, Stella. And with that, is there any public additional public comment? Please come forward, Mr. Goodhue, and then we'll go to a vote and take the picture.'",
        "'speaker_10': 'I fully support as a reference to this council a couple of months ago. The concept of solar energy and had it not been for you know, essentially having to reconvene the council of Trent. In order for the city to find the invoices relative to the electric use down to the original 1932 boathouse, we'd be well underway there'",
        "'speaker_10': '. I believe a Councilwoman Price has been working with the that organization. She's found a organization. It's the one I had referenced. And I didn't realize that they can work together and will. At no cost to this city. Provide a if my understanding is correct.'",
        "'speaker_10': 'They're able to give it an entirely new roof because they can tap into special state bond measures that the city cannot do. So what we would have on the 1932 boathouse is a new roof, which in time the facility certainly would need.'",
        "'speaker_10': 'And then a a energy source that would create a positive energy flow, profit cash. That would go to in my view, I would like to have it go to the not for profit 501c threes that operate out of the peat art the existing peat art growing center.'",
        "'speaker_10': 'Which I have to pay money. To the city when we hold events in the Marine Stadium, understandably, we need the lifeguards, the patrol boats there. But it's a win win situation. And I would urge the city to work with the council and all of the price and the organizations that she's that their people in their boathouse have'",
        "'speaker_10': 'contacted to provide the requisite solar panels, which also can be put on the Pete Archer Center. Different types that would not stand out like a lot of them do. A lot of neighbors might object to them, but they have a new type of panel that would lay flat and not be raised up.'",
        "'speaker_10': 'So I urge you to work with Council on the Price on that. Thank you.'",
        "'speaker_0': 'Please come forward. Public comment.'",
        "'speaker_4': 'I am Francis Emily Dyson Harris and I reside in District one. And this is an absolutely phenomenal agenda item, which I support 100%. And I was wondering about the feasibility of green alternatives, Greater Los Angeles, in regards to their solar installations, of having that type of opportunity for rental units that have especially landlords and owners that provide'",
        "'speaker_4': 'electricity and pay for it where it's actually them paying for it, not the tenant, especially in units where they have people that have like lower income type of rental units and I thought maybe are just units period where they have that to bring down the cost with historic cost of rent increases.'",
        "'speaker_4': 'I thought that might be something to be looked into. That might be quite helpful. Thank you very much.'",
        "'speaker_0': 'Thank you. With that members, please cast your votes for the photo. And then, Madam Clerk, when we got them, 23.'",
        "'speaker_1': 'Councilwoman Price. Councilman Alston. Motion carries.'"
    ],
    "Recommendation to request City Manager to work with Long Beach Police Department, Department of Public Works, Long Beach Unified School District, Pedestrian Safety Advisory Committee, Parent Teacher Associations, parent groups, and other interested stakeholders and report back within 120 days regarding options to streamline traffic circulation, improve traffic enforcement, and increase safety surrounding schools throughout the City of Long Beach.": [
        "'speaker_3': 'Three want to. Stay there. One more. We got better here. One, two, three. Thank you. Very good. Thank you, sir. Thank you. Thank you. Appreciate it.'",
        "'speaker_0': 'Okay. Thank you. Out of 23, please.'",
        "'speaker_1': 'Item 23 is communication from Councilman Andrews, Councilmember Pierce, Councilwoman Price, Vice Mayor Richardson, recommendation to request city manager to work with Long Beach Police Department and other interested stakeholders and report back within 20 days regarding options to streamline traffic circulation, improve traffic enforcement and increase safety surrounding schools throughout the city.'",
        "'speaker_0': 'Councilman Andrews.'",
        "'speaker_6': 'Yes. Thank you, Mayor. First of all, I'd like to thank my peers who signed on with this item with me. But also, before we continue, I would also like to include the Joint Use Committee as one of the stakeholders in this conversation.'",
        "'speaker_6': 'You know, the safety of our children is one of my top priorities, and I think it should be everyone's top priority. You know, we have done a walk through to some of our schools sites and it is not, you know, as safe as we think it could be.'",
        "'speaker_6': 'I know the schools are trying to put in place regulations to help with cars, working parents and overall traffic, but they need help. I hope that we can hear back some recommendations on how the city we can assist our neighborhood hurt schools.'",
        "'speaker_6': 'I would like to thank Bobbie Smith Elementary for for creating a hub, for creating a pedestrian, safe group of mothers who will help every day. And assistant principal at Lincoln Elementary for reaching out to my office for this assistance.'",
        "'speaker_6': 'This is something I think especially everyone that has a child and doesn't have a job. And when we go to our schools, there are things that we really need to be very, very, I think, consistent of and try to at least try to get something.'",
        "'speaker_6': 'This is a conversation we're trying to get started with, not trying to blame anyone at fault. We're just hoping we can get something going and willing to safety for our kids. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Price.'",
        "'speaker_2': 'I support this item and this is an issue that comes up often. And so I think it's great that we're starting the discussion and really being proactive about how we address school safety and especially traffic and engineering around school sites.'",
        "'speaker_2': 'So thank you, Councilman Andrews, for bringing it forward.'",
        "'speaker_0': 'Thank you, Councilmember Soprano.'",
        "'speaker_6': 'I'd also like to thank Councilman Andrews for bringing this item forward. We have schools in the fourth District that are tremendously impacted. I think this is a great approach in the right way to move forward on it. I'd just like to add that these schools that were built in the fifties or earlier, some I think of from'",
        "'speaker_6': 'school in our Kraft Manor that is totally inside a neighborhood where there's no major thoroughfares to it. And I know Mayor Garcia was there a month or so ago, and I've read to the students there and just the number of students there, this for special needs.'",
        "'speaker_6': 'The school is just bursting at the seams. And so I'd like to also, if we can, within this item, work with the school district to see what we can do in those areas. But I think this is a great first step and a way that we can expose the issues.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_8': 'I was hoping to find out from staff. I think this is great. I really appreciate Councilmember Andrews for bringing this about 18 to 24 months ago. The same topic came up and we sat down with city staff who talked about a committee that was made up of school board members and council members and that that would be'",
        "'speaker_8': 'the solution. What progress has been made on that? Because if we don't have a solution yet, this seems like another.'",
        "'speaker_10': 'I believe this is still one of the agenda items on the school board, city council committee, and they just haven't met for a while.'",
        "'speaker_8': 'They have never met.'",
        "'speaker_10': 'I'm not aware, but they have met for a while. And if not.'",
        "'speaker_8': 'So, our council appointed members to sit on this body. But the school board has chosen not to appoint members to serve on a joint committee where we could work together.'",
        "'speaker_0': 'I'm not aware of that.'",
        "'speaker_8': 'Okay. I would appreciate some follow up. Do I need to add a friendly or I mean, I think it's important. A council agenda item came 24 months ago asking to restart a committee because we have issues around our schools.'",
        "'speaker_8': 'Middle schools have been turned into high schools. High schools have stopped or sorry, middle schools and high schools have both stopped busing. They have the similar issues that Councilmember Superman mentioned. It used to be a bus. One vehicle would bring 60 to 80 children to a school.'",
        "'speaker_8': 'Now you have 40 to 60 cars bringing those same kids. And so the pick up and drop off and the number of vehicles per hour and the safety concerns continue to grow. And I was told that the solution was that we had to have this committee.'",
        "'speaker_8': 'And so if we could get an update back, do I need a friendly.'",
        "'speaker_10': 'No, absolutely not. We can get back here probably tomorrow. The next that.'",
        "'speaker_8': 'Promise. That would be wonderful. It's really important to a lot of parents. So. Thank you.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_2': 'Yes. Thank you for bringing forward. And I also know that we had a crossing guard. Do you have any updates on our crossing guards and where that's at as well in terms of just the larger scope of safety?'",
        "'speaker_10': 'Yes, that's also a committee peace act pedestrian.'",
        "'speaker_2': 'It's the same committee. Yeah, I see.'",
        "'speaker_10': 'Yeah. The Safety Advisory Board. So we'll give you an update on that as well.'",
        "'speaker_2': 'Okay, great. Thank you.'",
        "'speaker_0': 'A open.'",
        "'speaker_6': 'I just want to follow up on Councilwoman Mungo's statement about we used to have bussing at some school. There are 20 busses that currently serve that school in addition to parents dropping off kids. And the one item that is that is critical is is we have PTA.'",
        "'speaker_6': 'We have I think we would probably be covered under stakeholders. But the neighbors around the school, I guess that it's such a critical piece to this. So we'd like to invite them to the table. The staff at bus from I think of the principal, Miriam Garcia, Dr. Tiffany Brown from the school district.'",
        "'speaker_6': 'They do a great job. But this is an area, kind of a jurisdictional issue where the neighborhood just is having trouble communicating this. And so I'm not sure if the solution involves school board members with council members. We might want to be a little closer to the ground than that, but I'm going to support this item.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you very much. I just us we have we have a motion in a second as there any other public comment on this. I'm sorry. Public comment on this first. Please come forward.'",
        "'speaker_8': 'Good evening, honorable mayor and members of the council and city staff. My name is Brenda Soriano Villa and I'm here representing Bobbie Smith Elementary, the YMCA Full Service Community School Program. Unfortunately, the families were not able to make it.'",
        "'speaker_8': 'It is a Tuesday evening, although it's summer, that some of them still work. So I'm here representing the community that participates in our programing, but the school in general and also the neighbors. As Councilmember Andrews mentioned, our families have.'",
        "'speaker_8': 'Noticed this problem and wanted to they've decided to take action in the sense of creating a value system and asking the principal to send out a letter of support to our families that our neighbor, the neighbor, the city that have children there.'",
        "'speaker_8': 'But there's also elements there that we ask all of your support, and then that is the signage that is there. Just all of the list of stakeholders on this item are crucial in ensuring that our students are safe.'",
        "'speaker_8': 'And not only our students, but the families that are walking them. The neighbors are just trying to go to work in the morning and they are having such a hard time to get there. In our school we do have a group of moms.'",
        "'speaker_8': 'I do want to recognize that again, weren't able to be here today, but it was really them. A group of six women that got up early in the morning at seven and just and just set up shop to create a rally system.'",
        "'speaker_8': 'And they realized it was working quite effectively that even though that they didn't intend to be there in the afternoon, they started to be there in the afternoon as well to help out. And it's just created a culture of safety.'",
        "'speaker_8': 'But I think we need more. And that's why we're asking and I'm asking personally to your support in just starting this conversation and creating a space to be able to create some progress. And this many of the women that were here today, the commissioner said, you know, it takes a village.'",
        "'speaker_8': 'And and in terms of our mission and vision at the YMCA, as well as our community school, we are true believers of that in ensuring that everyone has a space at the table and that everyone has the accessibility to be able to participate.'",
        "'speaker_8': 'So thank you and I hope that we move forward on this.'",
        "'speaker_0': 'Thank you. No other. Ignore the public comment. Please come forward if there is.'",
        "'speaker_8': 'Hello, everyone. Mayor Garcia, council members. My name is Anna, R.S. I'm one of the parents at Lincoln Elementary School. I volunteer at the school every morning, and the number one concern is my child safety. And that is why we started the curbside drop off at the end of last year.'",
        "'speaker_8': 'And we see that most of the parents do participate and they are supportive. But there's still parents that are dropping off their children in the middle of the street. And that creates a problem because now the children are trying to walk through the valley in front of the cars.'",
        "'speaker_8': 'So not only do we have to help them get onto the curb safely, but we do not try to create any problems between the parents or confront them to stop the the problem. We do request your support. I know you've started a commission to help us out, but we are requesting that at the beginning of the school'",
        "'speaker_8': 'year we have some maybe law enforcement to help alleviate some of that situation. So the parents are not dropping off their children on the street. But we also would like to help. Within our school, we're thinking if maybe we could create a one way street on in front of our school, I think that would really help the'",
        "'speaker_8': 'situation permanently and not temporarily. So again, we look forward to be working with you. I represent the parents and we thank you for your time.'",
        "'speaker_0': 'Any other speakers? Please come forward now.'",
        "'speaker_4': 'Good evening, council members, residents of Long Beach and Mayor Robert Garcia. My name is Charles Darwin Glaucoma and I am the assistant principal of Lincoln Elementary School. We are located at 1175 East 11th Street between Orange Avenue and Alamitos Avenue.'",
        "'speaker_4': '11th Street is a small residential street with two way traffic and several houses located directly across from our main entrance. At Lincoln. Our English Language Advisory Committee and School Site Council meets several times a year to discuss ideas and improve changes related to safety.'",
        "'speaker_4': 'Many parents expressed concerns about the safety of students upon arrival. Drivers on the narrow streets with limited options for parking were displaying unsafe practices in order to get students to school on time. We addressed this issue with the support of the staff, the Community Student Council, Elac School Site Council and Parent Volunteers.'",
        "'speaker_4': 'A few months ago we began a valet drop off procedure for Lincoln students, while the valet drop off has helped to alleviate some safety concerns and improve on time arrival for our students. Drivers continue to demonstrate unsafe practices.'",
        "'speaker_4': 'Unfortunately, we have been not successful in our efforts to secure support and patrol from Long Beach Police Department. Some of the concerns we are still facing include cars exceeding the speed limit, three point turns, parking in the drop off zone, blocking driveways, double parking and jaywalking throughout our curbside drop off.'",
        "'speaker_4': 'A community partnership could really improve our efforts with traffic flow and awareness and implementation of safe practices, leading to an overall improvement in every area of school, climate and culture. On behalf of Carolyn Nemec, principal at Lincoln Elementary and a dedicated staff members at Lincoln, we hope that you will consider this a high priority as there are'",
        "'speaker_4': 'over 1000 students traveling to and from Lincoln every single day. Thank you for your time, but I am especially grateful for your consideration and how we might work together to prioritize the safe arrival and departure of our Long Beach scholars.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Please come forward on our last public comment.'",
        "'speaker_4': 'I am Frances only to Paris and I reside in District one and I want to thank Council Member Super for your mention about children or persons that have special needs. My concern regarding them curbside drop off is this time they have a certain amount of time.'",
        "'speaker_4': 'They want you to move the air, move from the area where they drop you off and you have children. They may use different types of mobility devices or and they're not able to move as as fast. And unfortunately, because of the exorbitant costs on having services to take them to the school, the parents have to bring them'",
        "'speaker_4': '. And if they have a regular vehicle and have a manual chair and the time to get it out, the car and everything is even more time consuming. So my question is, and I know you can answer tonight, but is there a special area at the school this designated for children with special needs?'",
        "'speaker_4': 'Because when the children, people start honking the horn and hollering and everything is very traumatic to a child that's doing the best they can and the families trying to help them. So I just wanted to put that out on the floor, so to speak, to look at this matter so that it works for everybody.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_0': 'Thank you very much. And I just want to also before we go to I want to just clarify, I think there are two appointed members of the school board that are on the Joint Use Committee, and those have been appointed.'",
        "'speaker_0': 'And I know that they meet when the last meeting happened as well. So I know it was said that the that they were not appointed and they want to clarify that they there are two appointed members and I want to thank the school board and the school district for their work.'",
        "'speaker_0': 'And I know that they've been great partners for us as a community. And certainly there are always there always opportunities for us to work closer together on issues, particularly in our neighborhoods. But they do an excellent job. And I just want to reiterate that tonight.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_8': 'Thank you for that, Mayor. I really appreciate the work that's possible when we all work together. I think that I was just mostly surprised that our staff didn't in prepping for this agenda item. I know it was a council driven agenda item, but know the progress or where we have been because I, I feel for the parents'",
        "'speaker_8': 'in the district and there have been so many changes that many of us have brought up several times. And it's a very complex system of how it all works in working between the different governments. And so I just think that it's important to to know what resources are already available and accessible before we create even more.'",
        "'speaker_8': 'But I too agree that even with as councilmember supervisor said, councilmembers and board members are not always enough. And we have lay programs and Councilwoman Price has a one way street and and even in certain cases those things have needed significant improvement and buy in.'",
        "'speaker_8': 'And so my frustration that you hear comes from just the the there's so many things going on in the city. And this is one more important thing that I'm surprised that we lost the chain on of where where are we going and what progress has been made.'",
        "'speaker_8': 'Because what I hoped when I read an item like this ten days ago is to be able to say, I'm glad that you brought this up to a council member and here's the progress we've made in the last 24 months because an item came before us.'",
        "'speaker_8': 'But I don't know that stuff today and I hope to be able to get it to you soon. Thank you.'",
        "'speaker_0': 'Councilman Austin. Thank you. I really wasn't going to speak on this, but I think a lot of good points have been raised. And I want to thank the folks from the public who've come at it and particularly the parents who are volunteering their time to make sure that their children have safe passage to or from school on'",
        "'speaker_0': 'a daily basis. We have a number of schools in my district, and I'm just curious to know I know this is going to be pretty well, pretty monumental task, not only for our our staff, but also for the the committee, the joint committee that meets.'",
        "'speaker_0': 'Because, I mean, we got to do an inventory of all of the schools and all the districts and assess traffic needs in every one of those districts. And I can tell you that that these these issues come before I know they come before my my my district and our council office every year.'",
        "'speaker_0': 'And generally, we we start getting the calls, you know, during the first couple of weeks of school. And I've been involved in the PTA, I've been involved in most of the stakeholder groups identified in this item. I think it's very important that that on a local level, campus by campus, that if we're going to really make an'",
        "'speaker_0': 'impact on on on safety, you guys are the answer. The work that that these wonderful women have come before us, the parents have come before us and are doing I believe that is going to be the model for success moving forward.'",
        "'speaker_0': 'It's going to require parental involvement. And and. Buy in from the PTA and buy in from the school administration and and neighborhood associations and everybody communicating is one we've had some success in a little surreal school area and with other schools.'",
        "'speaker_0': 'And we've we've done some some traffic modifications and signage there. There are a number of solutions out there. But I think Councilmember Mungo raised a great point, you know, and that is, you know, for years we were bussing.'",
        "'speaker_0': 'Right. And how many of these these these schools are located within neighborhoods and, you know, taking away that dynamic and adding cars, no matter how many bike lanes we put in place, people still need to get comfortable sending their kids to school either by feet or by bicycle.'",
        "'speaker_0': 'But until we get the cars out of the equation, we're going to have more, more traffic. And so I'm really I know I'm on that committee. I don't recall that committee actually meeting since the last city council was was seated.'",
        "'speaker_0': 'The last time we met, I think James Johnson was was the council member in the seventh District. And so I think we need to really step up our commitment to make that that committee meet and meet more often and and and make some things happen.'",
        "'speaker_0': 'I'm looking forward to working with you all.'",
        "'speaker_10': 'Thank you, Councilman. It was May 2nd, 2017. So we'll work on this tomorrow to schedule the next one.'",
        "'speaker_0': 'So about about a year ago, last many of the year, I stand corrected. Am I still on the committee?'",
        "'speaker_3': 'Okay, you.'",
        "'speaker_2': 'Are on the committee. I was like, I could have sworn you were there.'",
        "'speaker_3': 'To get it right for you, Chairman.'",
        "'speaker_0': 'Great. And so, yes. So there is a there is an active there is an active joint use committee. It met a year ago. And and there are it's full of been appointed by both the council and and the school board members.'",
        "'speaker_0': 'And so thank you for that. Please cast your votes.'",
        "'speaker_1': 'Councilwoman Price motion carries.'",
        "'speaker_0': 'Thank you. We're going to do item I'm sorry to public comment there's two there's two folks from public comment Larry Goodhue in and Francis Wood Austin Harris. Mr. Goodhue, come forward.'"
    ],
    "Recommendation to declare ordinance amending use tables in Chapters 21.31, 21.32, 21.33, 21.34 and 21.35; and by adding Chapter 5.92, and Sections 21.15.113, 21.15.441.1, 21.15.441.2, 21.15.441.3 and 21.15.441.4; all related to adult-use cannabis, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'Great. Thank you very much. We're going to go ahead and do our second and final reading for the recreational marijuana items. I want to move that up and that is item 33.'",
        "'speaker_1': 'Out of 33 is report from City Manager. Recommendation to declare ordinance amending the Long Beach Menace Code related to adult use cannabis read and adapted as Read City.'",
        "'speaker_0': 'Thank you. And this is the second reading councilmember. We have a motion and a second. Is there anything else you want to add, Mr. West? No, sir. Okay. Councilman Pierce. Councilman Mongeau?'",
        "'speaker_8': 'Yes. I'd like to make a friendly to move to declare the ordinance read and adopted as read with the following changes to the text of Chapter 5.92 as presented in staff's recommended action. This would not change the reading.'",
        "'speaker_8': 'It would still remain a second reading one that section 5.92.1520.8.3. B is amended to add or to the end of the sentence. And to that paragraph C is added to section 5.92.1520.8.3, which I'll read is a Long Beach resident currently receiving unemployment benefits.'",
        "'speaker_8': 'This is something that we discussed at the last council meeting and at the time it was thought it would force it into a second reading. But upon additional discussion with the city attorney's office, it's it does not do that and it still maintains the value and vision that was originally intended.'",
        "'speaker_8': 'And so that would make that possible. Councilmember Pearce, would you accept my friendly. Yes, I have a couple of questions for the city attorney. First one, understanding that this change would simply expand, who would be part of the social equity piece?'",
        "'speaker_10': 'That is correct. We've talked to Councilmember Mongeau about her proposed amendment and it would expand under the social equity piece, add an additional category of making other folks available to participate in this program.'",
        "'speaker_8': 'That's correct. And I think that that's great if someone's on unemployment and we're making sure that we have new job opportunities for them. And to clarifying from you that this would be the final reading today.'",
        "'speaker_10': 'That is also correct. We looked at this and this is a small change in it expands what was already approved by the council the following week and by the motion is specifically identified where and what language we would be changing to this substantially large ordinance.'",
        "'speaker_10': 'And so, yes, we believe that we can do that this evening. If it's accepted and approved by the body tonight, this would be the final reading and the audience would go into effect 31 days after the mayor signs it.'",
        "'speaker_8': 'Wonderful with that. I'd like to just say that it's a historic night. I know a lot of residents have waited for this night. I think the staff has done a fantastic job of working with all stakeholders, from residents to industry to council officers, in making sure that this is an ordinance that moves the city forward.'",
        "'speaker_8': 'And so I urge my colleagues to accept the motion and vote on this today so we can have our final reading.'",
        "'speaker_0': 'Thank you. And this is the final rating, correct? Correct. Okay.'",
        "'speaker_10': 'That is correct. We're done. We are.'",
        "'speaker_0': 'Okay. Thank you. There's any public comment on this.'",
        "'speaker_10': 'I just wish you would. Do the right thing. You recognize? You have to recognize. And certainly cannot be unaware. The devastation that this will bring on this city. Period. Whatever our crime problems are now. They will near double whatever our homeless problems are.'",
        "'speaker_10': 'Those are all the intensification of those problems. This doesn't solve a single thing. If people want. They can go somewhere else to get that. They may come back here. But at least you can go to bed at night.'",
        "'speaker_10': 'And you can look your constituents in that eye and say, we've done that. We did the right thing. Approving. This is clearly not right. All you have to do is look at where the one is in Belmont Shore.'",
        "'speaker_10': 'In the middle of a. The pathways at school kids, period. There will be an increase in every single neighborhood like that. All it takes is character and backbone. I know some of you don't have that, but I know I think and I would hope that the majority do.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'I am Francis. My two friends passing it out. I am Francis Henley Dyson Harris. I reside in District one and I've spent a tremendous amount of time putting together the document that you have before you. Mayor Robert Gates City Council members I'm Shirley Charles Pratt's hammers quote I believe that the the positive truth and right ideas through'",
        "'speaker_4': 'honest debate and rigorous arguments is a noble understanding. I am grateful to have played a small role in the conversation, has helped guide this ordinary nation's destiny as a great guideline to implement while making decisions regarding this ordinance.'",
        "'speaker_4': 'Because I'm a pediatric nurse, that's the only reason I'm standing before you. Because I'm a pediatric nurse. I'm reluctant to completely support the second reading of this ordinance. Why? Surely this ordinance requires and needs special care? Because there's too much at stake.'",
        "'speaker_4': 'Therefore, any reasonable and protective recommendations must be considered that is, be allowed, discussed and decided upon, even if a second reading is postponed to a later date. Now, combined, marijuana dispensaries exist in Los Angeles, Nevada. I believe that only existing medicinal marijuana dispensaries should be allowed to apply for adult use, recreational marijuana dispensary license and must coexist'",
        "'speaker_4': 'meaning same location. I believe in an adult use. Recreational marijuana dispensary needs to be initially operated as a medicinal marijuana dispensary. Now there are 23 pending movement to some dispensaries in Long Beach. After a six month trial period, then it may be a medicinal and or an adult use cannabis recreational dispensary.'",
        "'speaker_4': 'I feel strongly about a performance period. I believe that any medicinal and or adult use recreational cannabis dispensary which violates its permit must lose and forfeit is slicing to operate in Long Beach. I believe that any person who lives in Long Beach and whose low income and the district qualifies as being eligible as a local hire and'",
        "'speaker_4': 'a bit distant and or adult use. Recreational Cannabis Dispensary. I believe this ordinance must include mandatory notification to the public regarding hearings to applicants for a CFP conditional use permit, particularly for adult use of recreational cannabis. Surely public opinion is imperative a protocol regarding handling use less than 21 years and age who are illegally using and possessing'",
        "'speaker_4': 'medicinal and or adult use. Recreational cannabis is naive in smoking, medicinal and or adult use recreational cannabis and the public needs to cease. Yes, this ordinance is a living document which can be amended any time. Please do not permit this belief to prevent you from your profound capability creating and supporting and approving an ordinance that is noteworthy'",
        "'speaker_4': 'with accuracy and integrity.'",
        "'speaker_0': 'Thank you. Thank you so much.'",
        "'speaker_4': 'Okay. You're welcome.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_9': 'Seven Orson silos second District coming in, talking and speaking in support of this measure. This has been many years in the work, in the works. Really special thanks goes out to the city attorney's office for their patience and really just care in terms of making sure that this ordinance stayed in compliance with appropriate state regulations as they'",
        "'speaker_9': 'were being adopted. As a quick aside, however, at the current moment there are 86 non-compliant delivery services that are not paying into the measure m taxes. That means that they are not supporting that they are a negative they're a revenue negative source for cannabis within within the city of Long Beach.'",
        "'speaker_9': 'They are provided untested and on and frankly just on regulated cannabis to patients and adult use patients or adult use consumers across the city. And at this particular moment, members of the BCA as well, and frankly, anybody who any well minded cannabis consumer would really appreciate extra attention being paid to these particular delivery services in the form'",
        "'speaker_9': 'of perhaps some sort of ordinance emphasizing already existing enforcement measures that are that have been provided. Other than that, we're really looking forward to continued, you know, evolving and good relationship with the city and hiring lots of people locally.'",
        "'speaker_9': 'Thank you. Have a good day.'",
        "'speaker_0': 'Thank you. Any additional public comment? Please come forward.'",
        "'speaker_9': 'Hello. I'm Stefan Freeman. I'm not from Long Beach. But what I can tell you is that we're spending a significant amount of time in Colorado, has been spinning a significant amount of time in Canada, seeing what they're doing in their approach that they're taking right now.'",
        "'speaker_9': 'And I will tell you that I only came here just to come to this one meeting. You're definitely on the right track. The only way that you can take something that's happening like this with the marijuana business is to take the proactive approach that you're taking.'",
        "'speaker_9': 'And I'm also looking at potentially putting a business here as well. But the only reason why we make those kind of decisions is because we see the people that are on this council and the work that you're doing to make sure that this is a transparent business where things are being done the right way.'",
        "'speaker_9': 'So I just wanted to say thank you for letting me hear what's happening in Long Beach. And I'm hoping that as we go through this, that I become a business in the city as well. So thank you.'",
        "'speaker_0': 'Thank you. That closes public comment. Councilman Mongo.'",
        "'speaker_8': 'Thank you, Francis. I appreciate your comments. That was something that I worked on very hard last week or at the last council meeting, but it was not accepted by my colleagues. I will let you know that, though, there has been discussion both publicly at this dais that after the ordinance is in effect, there are a couple of'",
        "'speaker_8': 'ideas about things that could improve the ordinance. But to do those things, they want a opportunity to first demonstrate that through the nine that are available now to open and see how it goes and learn from that experience.'",
        "'speaker_8': 'And I'll tell you specifically, one that I've worked on with the community and I want to continue working with industry on is there are on both sides the way that the original program went. There were challenges for industry because they were locked into certain locations and therefore some of them have exorbitant rent.'",
        "'speaker_8': 'And on the neighborhood side, sometimes there were locations that weren't yet available but could be available 69 to 120 days. But if they didn't have their location, they couldn't get into the lottery. And so we're looking at options which would allow both the industry opportunity to move slight amounts without affecting the value of the ordinance and causing'",
        "'speaker_8': 'additional confusion. So we're in discussions with the city attorney, but those kinds of things, we really appreciate that you are so in tune and feel free to come to any of our community meetings. My district has had dozens of community meetings on this matter that industry has joined us in as well with the neighbors to have these'",
        "'speaker_8': 'dialogs. So thank you.'",
        "'speaker_0': 'Thank you. At the conclusion of a comment and the emotion in a second on the floor with those friendly amendments, there are slight changes. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to request that the City of Long Beach annually recognize June as Pride Month.": [
        "'speaker_0': 'Okay, great. Thank you very much. We're moving on to item 24.'",
        "'speaker_1': 'Item 24 is communication from Councilwoman Price, Councilwoman Gonzalez, Councilmember peers and council membership, and a recommendation to request that City of Long Beach annually recognize June as Pride Month.'",
        "'speaker_6': 'Who should handle this?'",
        "'speaker_3': 'You?'",
        "'speaker_6': 'Yeah, I am. But who's uzan? Okay, this is my space.'",
        "'speaker_2': 'Thank you, Councilman Andres.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'So it is my honor and privilege to work with my council colleagues to bring this item forward. As we all know, Long Beach is a leading city in California in supporting LGBTQ rights. The goals of equality and justice for the LGBT CU community is a priority for the city and a priority for the city council, and it'",
        "'speaker_2': 'is a priority for me personally. It is a privilege that I hold very dear. Recognizing Pride Month will help to honor the legacy of this movement and the progress made by individuals in the LGBT community.'",
        "'speaker_8': 'Through the positive.'",
        "'speaker_2': 'Contributions they have made to our community, to our state, and to this country. On a personal note, every year I have a float in the.'",
        "'speaker_8': 'Pride Parade, but this year.'",
        "'speaker_2': 'I was so exuberant and danced so enthusiastically that I ended up rupturing a disc in my back and needed to get spine.'",
        "'speaker_4': 'Surgery the following week.'",
        "'speaker_2': 'So I will break my back for you.'",
        "'speaker_8': 'I hope that.'",
        "'speaker_2': 'Along with this item, we as a council show that we are committed as a city and as a community to supporting LGBTQ pride and events, programs and all philosophies associated with it. Thank you.'",
        "'speaker_6': 'Yeah. This comes from Gonzalo.'",
        "'speaker_2': 'Thank you. And thank you, Councilmember Price, for bringing it forward. We also designated the third week of May as Pride Week and I think June a lot. You know, we're a little different in Long Beach. We celebrated in May.'",
        "'speaker_2': 'The rest of the world sells, celebrates it in June. And I think it's just absolutely timely and great that we're doing that. Anything we can do to highlight the fact that we are a very inclusive LGBTQ community? You know, I'm we're all about it.'",
        "'speaker_2': 'And so I thank you again for bringing it forward. And I look forward to hopefully having another pride amazing pride float and hopefully you don't rupture another disc. We need you on the council. But thanks so much.'",
        "'speaker_6': 'Thank you very much, Congressman Pearce.'",
        "'speaker_4': 'Mrs. Pearce.'",
        "'speaker_8': 'Yes, thank you. I want to thank my colleagues for this item. I want to thank Long Beach Pride for always presenting us with good items and ways to celebrate our community and partner together. You know, when this item came up, I was kind of surprised that we hadn't already had it.'",
        "'speaker_8': 'So I want to thank Councilwoman Susie Price for this, recognizing that our city is changing and it is diverse, and the more that we can celebrate those that make our city great, the stronger we will be. So keep up the great work and anytime that we can partner and build relationships with you all, we certainly look forward'",
        "'speaker_8': 'to it. Thank you.'",
        "'speaker_6': 'Yes, I see we have. Well, first 10 seconds. Any public comment?'",
        "'speaker_4': 'Hello again. Green Hat off, Rainbow Hat on Stellar Suhr, Vice Chair for the LGBTQ Center of Long Beach. And so I have a short letter to read to you. So, dear Mayor Garcia and members of City Council, the LGBTQ Center of Long Beach supports the proposed agenda item to annually recognize June as Pride Month in Long Beach'",
        "'speaker_4': 'and is incredibly grateful to Councilwoman Pearce for her leadership on this effort. Our LGBTQ community in Long Beach is one of the most diverse in this country, and our local community organizations have contributed greatly to LGBTQ history in the United States while we continue to support advancing equity for LGBTQ people locally and throughout the country.'",
        "'speaker_4': 'We applaud Long Beach City Council for taking the step to formally acknowledge that the nearly 50 years of history pride celebrations have contributed towards our movement. We're also grateful for the efforts of many City Council to address issues of inequity and for your demonstrated actions to improve Long Beach for LGBTQ people during the month of June and'",
        "'speaker_4': 'beyond. We hope that your commitment to and efforts to improve our LGBTQ community extend far beyond this motion and are woven into the moral fabric that contributes to your leadership and how you choose to lead our community. Thank you again to Councilwoman Pearce for leading this effort as well as co-sponsors.'",
        "'speaker_4': 'Councilwoman Gonzalez. Councilwoman Pierce. Councilmember. Super not for your many actions which have demonstrated a.'",
        "'speaker_3': 'Willingness to pay the.'",
        "'speaker_4': 'Price. I'm sorry. Let me say it again. Thank you again to Councilwoman Price for leading this effort, as well as co-sponsors Gonzalez and Pierce in Super for your actions, which have demonstrated a longstanding commitment and unwavering support for our LGBTQ community.'",
        "'speaker_4': 'And this is signed by our executive director, Porter Gilbert, and our board chair and President Justin Porter. Thank you.'",
        "'speaker_6': 'Thank you to any more public comment. Oh, I know this young lady.'",
        "'speaker_4': 'Thank you. Honorable Mayor, members of City Council. My name is Tanya martin. I'm the FIL representative for Senator Ricardo Lot. And today I'm here on behalf of the senator who supports the proposed item and who also would like to recognize Councilwoman Pearce.'",
        "'speaker_4': 'Pearce Price, the other P prize for for her leadership on this effort. Also to recognize the call authors Catwoman, Gonzalez, Councilwoman Pearce, and also Mr. Councilman Silvano. As you may know, June as Pride Month is observed across the nation since 1969 to commemorate the Stonewall riots.'",
        "'speaker_4': 'This is when there was a tipping point movement for the gay liberation in the United States. Every June, the LGBT press organizations around the country call upon Californians for all backgrounds to observe the month by participating in activities and events to celebrate the achievements and diversity of the LGBT community.'",
        "'speaker_4': 'In June of 1969, patrons and supporters of the Stonewall Inn staged an uprising to resist the harassment, the persecution to which many LGBT plus Americans were commonly subjected to. This uprising marked the beginning of civil rights movement to outlaw discriminatory laws and practices against LGBT Americans.'",
        "'speaker_4': 'Today, communities across the state come together to host pride parades, festivals, picnics, parties, drag shows, workshops, conferences and concerts that attract millions of participants from around the world. For decades, Long Beach has been a leader in celebrating our pride for lesbian, gay, bisexual, transgender and related communities and their allies by kicking off the first pride event in'",
        "'speaker_4': 'the region. And this is a southern region. Our city is a leader in supporting gay rights movement, and you are also the host of one of the largest pride festivals and parades in the country. With that said, by supporting this item, the City of Long Beach will ensure that it maintains its momentum as a world class.'",
        "'speaker_8': 'City that openly supports diversity.'",
        "'speaker_4': 'Inclusivity and the community.'",
        "'speaker_8': 'I respectfully ask for your yes vote today.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Thank you, Jane, for public comment. If not, please vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to approve renaming the Multi-Use Sport Court in Marina Vista Park the Luke Tatsu Johnson Court.": [
        "'speaker_6': 'Okay, next item. So is 2025 and 26, 25 and 26. I like that.'",
        "'speaker_1': 'Item 25.'",
        "'speaker_6': 'I'd like to ask that that be pulled into the next council meeting and possible. Can you. Five and 26.'",
        "'speaker_10': 'Council Member Andrews We just need a motion in a second to withdraw the item or to continue the item to another date or just to continue the item and it will be rescheduled at a different date. Thank you.'",
        "'speaker_10': 'Continue the item to reschedule.'",
        "'speaker_6': 'The first and second one, please. Okay, fine. And I don't need any trouble coming on today.'",
        "'speaker_10': 'Yes. Public comment on continuing manner.'",
        "'speaker_6': 'Is there any public comment on continuing the matter? That pleased them me vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_6': 'Fine. Item 28.'"
    ],
    "Recommendation to authorize City Manager or designee, to execute a contract, and all necessary amendments including term extensions, with the City of Los Angeles to receive and expend Department of Homeland Security grant funding for the 2017 Urban Area Security Initiative Grant, in an amount not to exceed $825,000, for the period of September 1, 2017 through May 31, 2020; and  Increase appropriations in the General Grants Fund (SR 120) in the Disaster Preparedness and Emergency Communications Department (DC) by $90,000, in the General Grants Fund (SR 120) in the Fire Department (FD) by $405,000, in the General Grants Fund (SR 120) in the Health and Human Services Department (HE) by $65,000, and in the General Grants Fund (SR 120) in the Police Department (PD) by $265,000, offset by grant revenue.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_6': 'Thank you. Item 28, please.'",
        "'speaker_1': 'Item 28 Report from Disaster Preparedness and Emergency Communications, Health and Human Services. Fire and Police Recommendation to execute a contract with the City of L.A. to receive and expend Department of Human Homeland Security grant funding for the 2017 Urban Area Security Initiative grant in an amount not to exceed 825,000 CDI.'",
        "'speaker_6': 'Yes, I speak on that. No.'",
        "'speaker_0': 'Starting like a brief staff report, please.'",
        "'speaker_6': 'Can we please have a brief reporting?'",
        "'speaker_10': 'Make sure we have Nelson Kerr from the Health and Human Services Department. Oh, I'm sorry. Reggie Harrison.'",
        "'speaker_9': 'Look at Cosmo Andrews met with the city council. The item before you is to approve a contract with the Los Angeles and Long Beach, U.S., to receive a $125,000 in Homeland Security grant funds. The grants are used to for the purpose of providing training, as well as equipment that first responders need, as well as to provide resources'",
        "'speaker_9': 'for community partners as well in the event of it, to assist them in being prepared for a major emergency or disaster. Is an annual award of a contract in the city of Long Beach has been a long time recipient of these funds.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you very much. There's a motion and a second. Any public comment?'",
        "'speaker_10': 'But since the city doesn't have the backbone to shut down the cannabis operations, I think it would certainly be appropriate if the money's there. To apply for. The money they will need to expend. As a result of. The marijuana business that you've invited into the city, period.'",
        "'speaker_10': 'And if the money is there and obviously the police are going to need it, the community is going to need that security. And also it's a study I use it for that or a study, what I should have mentioned before and have mentioned before.'",
        "'speaker_10': 'But I did mention it tonight, the concept.'",
        "'speaker_3': 'Of a meeting.'",
        "'speaker_10': 'Of the city renting out the top floor of the police department. To nine different cannabis operations. They can come there. 3 hours. Every other day. And you'll get some type of control. If the money's there, if they're handing out that grant, get creative and use it.'",
        "'speaker_10': 'And use it in that way. Because right now. You're understaffed with the police department. It's going to take another 5 to 6 years to come up to what we should be at. So if they're handing out money, get creative and ask for it.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. And the other public comment saying none. Please cast your votes in.'",
        "'speaker_1': 'Motion, Kate.'",
        "'speaker_0': 'Thank you. Before we go back to item 29, I just want to make sure. Did we already take. I moved 25 to 26 and 27.'"
    ],
    "Recommendation to adopt resolution requesting that the Board of Harbor Commissioners approve the transfer of 5 percent of Fiscal Year 2018 (FY 18) gross operating revenue, from the Harbor Revenue Fund (HR 430) to the Tidelands Operations Fund (TF 401), with a true-up adjustment, if necessary, to reflect the final gross revenue amount upon issuance of the Harbor Departments FY 18 audited financial statements.  (Citywide)": [
        "'speaker_10': 'We continued all three.'",
        "'speaker_0': 'All three got continued already. Perfect then. Next up, item 29.'",
        "'speaker_1': 'I am 29 is a report from Financial Management Recommendation to Adobe resolution requesting that the Board of Harbor Commissioners approve the transfer of 5% of fiscal year 2018. GROSS operating revenue from the Harbor Revenue Fund to the Thailand Operation Fund City.'",
        "'speaker_0': 'Thank you. There's a motion in a second. Is there any public comment? Seeing any staff report on this?'",
        "'speaker_10': 'No, sir. We're required to do this on an annual basis.'",
        "'speaker_0': 'Okay. You know, public comment, please cast your votes. And that's revolting. Just, you know, just quickly that I know that this last this we're talking about the port. I'm not sure if it'll probably be out tomorrow, but the the port again broke another record on cargo containers for for the month of June.'",
        "'speaker_0': 'And so we're moving more containers than we ever have. So this is great. That's good for the transfer.'",
        "'speaker_9': 'It's made the transfers up about 7% from last year.'",
        "'speaker_0': 'And the more the more cargo we get, the more transfer we get. So that's that's great. And I, I mean, unbelievably, we're almost up 15% from these first six months prior to the last six months of last year.'",
        "'speaker_0': 'So that's really great. That motion. Did we vote on that? Yes. Okay. I didn't see the thing come up. It didn't come up.'",
        "'speaker_6': 'Yeah, we didn't.'",
        "'speaker_0': 'Can we try that one more time? It didn't come up for me. SANDERS Well, I don't think it came up for everyone, so. Please cast your vote because.'",
        "'speaker_1': 'Ben Austin motion carries.'"
    ],
    "Adopt resolution repealing Resolution No. C-28279 for the dissolution of the Commission on Youth and Children.": [
        "'speaker_1': 'Motion carry.'",
        "'speaker_0': 'Thank you. Item 31.'",
        "'speaker_1': 'Item 31 is a communication from city attorney. Recommendation to declare ordinance amending the language municipal code by adding Chapter 2.56. Establishing a Commission on Youth and Families. Read the first time and lead it over to the next regular meeting of the City Council for Final Reading and a resolution Repealing Resolution for the Resolutions of the Commissions on'",
        "'speaker_1': 'Youth and Children.'",
        "'speaker_0': 'Thank you. I just want to actually just think the city during the staff. I know that you guys worked with the commission itself to kind of restructure itself and that these recommendations came from the commission as a better way to move forward.'",
        "'speaker_0': 'And I know that this is a commission that has gone through a lot of change over the last ten years. And they believe that this new format and this new makeup will allow them to do their work moving forward.'",
        "'speaker_0': 'And so I just wanted to thank all of you for for working with them. Councilwoman Gonzales.'",
        "'speaker_2': 'Yes. I think I love the restructure and I really appreciate the effort in making this a very holistic commission. And I look forward to seeing what we can do in a in a more positive way and more impactful.'",
        "'speaker_2': 'So thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Andrews. Any public comment on this? Please cast your votes.'",
        "'speaker_1': 'Bush and Kerry's.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending and restating in its entirety Chapter 5.58; amending Section 21.15.110, Section 21.15.1725, Section 21.32.035, Table 32-1 of Chapter 21.32, Section 21.33.050, Section 21.34.030, and Section 21.35.030; adding Section 21.52.030; and repealing Section 21.51.243, all regarding massage establishments, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_0': '35 police.'",
        "'speaker_1': '35 is a report from Development Services and Financial Management. Recommendation to declare ordinance amending the Long Beach menus barcode or regarding massage establishments red and adopted as red citywide.'",
        "'speaker_0': 'And a second. Any public comment on this? Please customers.'",
        "'speaker_1': 'Motion carry.'",
        "'speaker_0': 'Thank you. The second public comment period is up. K is please come forward.'",
        "'speaker_3': 'Oh, I'm sorry.'",
        "'speaker_0': 'No. The agenda is over. It's the second public comment period. Yes. Please come forward, sir.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'On a personal.'",
        "'speaker_3': 'Let me go ahead.'",
        "'speaker_8': 'Good evening.'",
        "'speaker_2': 'Honorable Mayor. Members of the council. Ladies and gentlemen, my name is Jennifer Krall. I am a resident of Long Beach. I grew up in the third district, currently live in the second. I have recently founded a501c that I am trying to turn into a51 C3.'"
    ]
}