{
    "Recommendation to declare ordinance imposing interim regulations (moratorium) in accordance with Chapter 21.50 of the Long Beach Municipal Code on the issuance of building, construction, occupancy permits, or other entitlements for new stand-alone residential construction along transportation corridors in areas that are designated by the 2019 General Plan Land Use Element Update as the Neighborhood-Serving Corridors or Centers PlaceType on Willow Street, west of the I-710 freeway to the City terminus; and Santa Fe Avenue, between Pacific Coast Highway on the south and Wardlow Road on the north, in the West Long Beach area of the City; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopt as read.  (District 7)  (Emergency Ordinance No. ORD-21-0020)": [
        "'speaker_0': 'Thank you. Moving on. We have three hearings. We'll start with our first hearing. Item 17.'",
        "'speaker_1': 'Communication from City Attorney. Recommendation to receive supporting documentation into the record. The hearing and declared ordinance relating to the temporary limitation on the issuance of building or construction permits for new residential standalone construction along commercial and transportation corridors in West Long Beach.'",
        "'speaker_1': 'Read the first time and later the next regular meeting of the City Council for final reading and declare the urgency thereof and declaring this ordinance shall take effect immediately. District seven And there are two votes required for this item.'",
        "'speaker_0': 'Think it was Gordon turning over to.'",
        "'speaker_4': 'Mike May's from the city attorney's office. I can provide a short staff report if the council desires.'",
        "'speaker_3': 'Please. Go ahead, Mike.'",
        "'speaker_4': 'Yeah. You all remember that on May 18th, the Council adopted a minute order pursuant to an agenda request from District seven, which set in motion this moratorium process that we have here tonight on this form, the ordinance before you formalizes.'",
        "'speaker_6': 'The actual moratorium in the area that Monique.'",
        "'speaker_4': 'Just described for you on Willow Street and Santa Fe Avenue in the west side of Long Beach. This will establish a 12 month moratorium period. And during that time, no building permits will be issued for standalone new residential construction in the area of concern.'",
        "'speaker_6': 'And during this 12 month period.'",
        "'speaker_4': 'The matter will be referred to the Planning Commission. And the planning staff to initiate a study of.'",
        "'speaker_6': 'Potential amendments to the existing zoning.'",
        "'speaker_4': 'And building regulations in the city to have them more closely aligned with the more recently adopted land use and urban design elements of the city's general plan. If anyone should have any questions, I'd be more than happy to try and answer them.'",
        "'speaker_0': 'Thank you. Is there any public comment for this hearing?'",
        "'speaker_1': 'No. There's no public comment for this item.'",
        "'speaker_0': 'Canterbury Ranga.'",
        "'speaker_2': 'Sorry. Still getting adjusted to being back in the chamber. No real comment just to thank staff for their great work on this and we're looking forward to having some positive results at the end of the period.'",
        "'speaker_0': 'Downtown Boston.'",
        "'speaker_2': 'A second emotion.'",
        "'speaker_0': 'Thank you. We're going to do a roll call vote, please.'",
        "'speaker_1': 'District one. My district to my district three. I. District four. I. District five. I. District six. I. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_7': 'I.'",
        "'speaker_6': 'Monique, and we'll need another vote on the urgency.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Do another vote on the urgency, please, echoing emotion in the second, countering your rank as a motion. Second by. Can I get a second, please? Captain Boston.'",
        "'speaker_1': 'Council District one.'",
        "'speaker_5': 'I.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution amending the Master Fees and Charges Schedule adopting new fees and penalties for violations of Chapter 8.81 of the Long Beach Municipal Code, relating to fireworks.  (Citywide)": [
        "'speaker_1': 'Council, District two I Council, District three i District four i district by district six i. District seven i. District eight District nine I. Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please. Item 18.'",
        "'speaker_1': 'Report from City Manager Recommendation to receive supporting documentation into the record. Conclude the public hearing and adopt a resolution amending the master fees and charges schedule. Adopting new fees and penalties for violations relating to fireworks citywide.'",
        "'speaker_0': 'Thank you very much. I have a motion in a second. Is there any public comment on this item? That's one reason Day has.'",
        "'speaker_5': 'Thank you, Mayors. You know, this is a very important topic to my residents and I and. Just 1/2.'",
        "'speaker_7': 'Yes.'",
        "'speaker_5': 'The in the past week, we have begun to hear more and more fireworks being unveiled in our district. That's clearly sending a message that it is really necessary to to look at what what things we can do to prevent anybody from wanting to to light fireworks were they're already illegal here in the city of Long Beach.'",
        "'speaker_5': 'I think that this ordinance will and will that were voted on today will help us kind of disincentivize those people from wanting to light fireworks that are being very disruptive, not only in my district, of course, but throughout the city.'",
        "'speaker_5': 'One of the things that is very important is that we create a city that is not welcoming. Well, not that it is welcoming right now, but that is not welcoming to light fireworks. So, you know that that the consequences are greater than than the joy of lighting the fireworks.'",
        "'speaker_5': 'So I'm very, very happy to be supporting this item.'",
        "'speaker_0': 'Thank you, Councilman Ciro.'",
        "'speaker_1': 'I just want to thank all of our residents who have been so active in advocating for, you know, active measures and stronger measures for us to be able to address the illegal firework, especially the Long Beach, against illegal firework groups.'",
        "'speaker_1': 'So I just want to express my thanks for for all of their time and energy that they've spent on this ongoing issue. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I, too, want to thank the staff and the community groups that have worked so hard to get us here today. And I think it's really important that we work together to ensure that this 4th of July is the safest yet.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. With that roll call vote.'",
        "'speaker_1': 'District one.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'District two, i. District three. I. District for high district I. District six II. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight or District nine high ocean carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Section 5.92.420, Section 5.92.760, Section 5.92.765, and Section 5.92.955; and by amending and restating the Downtown Planned Development District (PD-30), to allow the operation of adult-use cannabis dispensaries within mixed-use buildings in Downtown by way of Conditional Use Permit approval, read and adopt as read.  (Districts 1,2)": [
        "'speaker_0': 'Thank you. Next up is the hearing on cannabis police.'",
        "'speaker_1': 'Report from Development Services recommendation or receive supporting documentation into the record, concluded the public hearing review and determined that the proposed Long Beach Municipal Code amendments are exempt from secure and declared ordinance amending Title five to allow the operation of adult use cannabis dispensaries within mixed use buildings in the downtown area by way of conditional use permit'",
        "'speaker_1': 'approval. Read the first time in a letter to the next regular meeting of City Council for Final Reading Districts one and two.'",
        "'speaker_0': 'Mr.. Is a report on yes or no?'",
        "'speaker_3': 'Yes, we do have a staff report from Christopher Coons, our deputy director, and Patricia Devendorf for cleaning.'",
        "'speaker_0': 'And Patricia has this evening's report.'",
        "'speaker_1': 'With you being mayor, vice mayor, council members. Patricia Devendorf, our planning bureau manager. This item before council this evening involves municipal code amendments to amend Title five and the Downtown Plan Development District PD 30 to allow the operation of adult use cannabis dispensaries within mixed use buildings in downtown by way of a conditional use permit.'",
        "'speaker_1': 'Beginning in January 2016, a number of state and local laws were adopted that established a regulatory framework for allowing the operation of both medical and adult use cannabis businesses. Major regulatory milestones are shown on this slide. The city's regulatory system established a cap of 32 medical cannabis dispensaries citywide and in 2018, code amendments related to adult use'",
        "'speaker_1': '. Cannabis businesses also required the co-location of adult use cannabis businesses with medical cannabis dispensaries therefore creating limiting the or applying the 32 dispensary cap to adult use cannabis businesses as well. In 2018, the city adopted the zoning code and updated the zoning code to allow adult use cannabis dispensaries in commercial zoning districts by right.'",
        "'speaker_1': 'But no changes were made at that time to any of the planned development districts. Also, at that time, the code was amended to introduce Chapter 5.92 of the Municipal Code to establish Long Beach's local regulations for adult use cannabis businesses.'",
        "'speaker_1': 'The proposed ordinance would amend the PD 30 Plan Development District for downtown to add adult use cannabis dispensaries as a permitted use under retail sales, which will explicitly allow adult use cannabis dispensaries in the downtown valley by way of a conditional use process.'",
        "'speaker_1': 'The use would not be allowed in the downtown neighborhood overlay district. This change is comparable and consistent with the 2018 Code amendments that allowed adult use cannabis dispensaries in commercial zoning districts citywide. As a counterpart to this action.'",
        "'speaker_1': 'Title five amendments are needed to allow adult use cannabis dispensaries in the downtown area to be permitted within mixed use buildings. Buildings that have residential units and to adhere to the PD 30 ground floor window transparency requirements to continue to ensure a vibrant, active and walkable environment in the downtown.'",
        "'speaker_1': 'For different sections listed on this slide, within chapter 5.92 are proposed to be amended to ensure that this use will be allowed in mixed use buildings and that the more stringent downtown window transparency requirements will apply to such businesses, superseding the regulations otherwise applicable in Chapter 5.9 to.'",
        "'speaker_1': 'In order to approve municipal and zoning code amendments. One of the findings that needs to be made is consistency with the general plan. On April 15, 2021, the Planning Commission found that the proposed amendments are consistent with the downtown place type of the general plan in particular goals to encourage a mix of land uses with a focus'",
        "'speaker_1': 'on providing active ground for shops and restaurants, and the goal to promote a highly urbanized core featuring compact development composed of a mix of compatible uses. The Planning Commission found that the proposed amendments do support the downtown place type by formally introducing adult use cannabis dispensaries as a recognized use category under the retail uses and ensuring that'",
        "'speaker_1': 'these establishes these establishments continue to be designed in a way that promotes walkable environment and fosters active, active streets. In its Action Planning Commission recommended the City Council determined that the proposed amendments are exempt from secure and that City Council adopt the proposed ordinance too.'",
        "'speaker_1': 'That allowed the operation of adult use cannabis dispensaries within mixed use buildings in the downtown area by way of a conditional use permit. That concludes staff's recommendation and staff is available to answer any questions you might have.'",
        "'speaker_0': 'Thank you. Want to be go ahead. Go to public comment, please.'",
        "'speaker_3': 'Our first speaker is Amber Tovar. Amber Tovar.'",
        "'speaker_4': 'Good evening and thank you for having me. My name is Amber Tobar, and tonight I speak as a Catalyst employee and a 20 year Long Beach resident. Catalyst Time will be the anchor to drive additional traffic to Pine Avenue.'",
        "'speaker_4': 'It'll bring 20 to 30 full time jobs, additional tax revenue for the city, local accessibility to cannabis products and patients and residents. And it's supported by the neighborhood and local business owners. I came the catalyst from the hospitality sales industry focused on farmworkers.'",
        "'speaker_4': 'COVID hit the hospitality industry and we went down hard and fast. I took it as an opportunity to refocus my professional recovery. I wanted to find an industry and a company with social responsibility. I was recently awarded a certificate from Long Beach City College for completing the inaugural Intro to Cannabis Industry Certificate Program.'",
        "'speaker_4': 'During the shutdown, I saw a couple of Lewis Instagram posts talking about the safety of the employees and patients, as well as ensuring employees are essential. This is the first CEO I heard speaking about people situation versus stop the bleeding of the lost profits.'",
        "'speaker_4': 'Elliott's voice was refreshing. In my eight months with Catalyst, I've had the opportunity to meet Elliott as well as most of the management team. I can tell you that the voice is backed by a deeply passionate team and catalyst.'",
        "'speaker_4': 'And while the cannabis industry is their focus, the city of Long Beach always remains top of mind. Volunteering with Catalyst Tourism UFW. I've helped local politicians, worked on expungement.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_7': 'Our next speaker is Anna Lewis.'",
        "'speaker_4': 'Hello. Yes, please. Hello. Okay. Thank you. City Council members and Honorable Mayor Garcia. My name is Anna Lewis. I am a co-founder of Cavaliers. My best friend, along with my children, planted the plant on Pine Avenue to beautify and uplift the community.'",
        "'speaker_4': 'It truly is a labor of love and a family affair. It has been a joy meeting members of the community and to feel the excitement and the hopefulness we share for the future of language. I believe catalysts will drive foot traffic to the surrounding businesses such as Romeo's.'",
        "'speaker_4': 'I would hate to see another business closed down like Crest Market. Catalyst will bring union jobs and much needed life to Pine Avenue. Also, when my husband, Elliott Lewis, says he is going to do something, you better believe he will.'",
        "'speaker_4': 'Thank you for your consideration. Life.'",
        "'speaker_3': 'Thank you. Our next speaker is Blake Hogan.'",
        "'speaker_4': 'Hello? Can you hear me?'",
        "'speaker_3': 'Yes. Please begin.'",
        "'speaker_4': 'I made Lake Hogan and I'm one of the employees at Catalyst Cannabis. So I really wanted to speak to the fact that Catalyst will really uplift the community in ways that I don't think people even realize. When we did the third on chain event, which is only started the second annual, it started off as something that was'",
        "'speaker_4': 'very small and very genuine and Elliot Lewis, along with the Catalyst team, helped lift it up and I think would make that a place to be for years to come, as well as Romeo's topics, as already mentioned, also the high bar and all all these local communities, I've seen firsthand how excited they are, the opportunity for Catalyst'",
        "'speaker_4': 'to be there, to see the change that it will help. I've also seen residents in the community excited to be a part of Catalyst and how they are in the community to also have a place where they can get safe and reliable cannabis to help ailments as well as to help uplift that lot.'",
        "'speaker_4': 'That, unfortunately, due to the pandemic and other unforeseen circumstances, will help uplift the community beyond recognition as well as to reality. Elliot Lewis Being a local resident, I have never seen a man so impassioned to help the city of Long Beach and help empower the community around it, not only for the block but the entire city.'",
        "'speaker_4': 'I believe that this opportunity to help catalyst cannabis go and to uplift the community will only be something a shining beacon for years to come will be talked about. Thank you for your time and for your consideration.'",
        "'speaker_3': 'Thank you. Our next speaker is. Elliott Lewis.'",
        "'speaker_4': 'Yeah. Hi, this is Elliot Lewis with Catalyst Cannabis CO. I just really appreciative of what everybody said before me and the council having this item in front of me.'",
        "'speaker_0': 'In front of them, you know.'",
        "'speaker_4': 'We're going to bring union jobs.'",
        "'speaker_0': 'We're going to bring revenue to the city. But the thing that I really want to focus on is the love and.'",
        "'speaker_4': 'The energy that we've created on that block there down there right now. This is our normal meeting that we have every week we've been there. It's grown from three or four people to 22.'",
        "'speaker_0': 'To 25 people.'",
        "'speaker_4': 'You know, it's not something that's going to happen overnight. It's not something that's going to be easy to do. But if I put my.'",
        "'speaker_0': 'Name on it, hell or high water, we're going to uplift that entire.'",
        "'speaker_4': 'Block. And I've just been so appreciative of all the people that I've met down on the 400 block. We built real relationships. We have a real.'",
        "'speaker_0': 'Vision for the block.'",
        "'speaker_4': 'And beyond that.'",
        "'speaker_0': 'You know.'",
        "'speaker_4': 'When history, right? What happened down there on.'",
        "'speaker_0': 'The 400.'",
        "'speaker_4': 'Block of pine, I wanted to this project to be something that's been.'",
        "'speaker_0': 'Super positive, super energetic.'",
        "'speaker_4': 'I just see people down there that are passionate, that need a little wind at their back. And I give you my word to council. And everybody who knows me, our council knows that if I say something, I'm coming to back it up.'",
        "'speaker_4': 'So I'm very appreciative of the consideration of this item and all the kind words before. And thanks for letting me speak.'",
        "'speaker_3': 'Thank you. Our next speaker is Greg Nahshon.'",
        "'speaker_4': 'Good evening. Thank you, Mr. Mayor, and council members. I respectfully urge the City Council to oppose agenda item number 19. The city currently already has over 30 dispensaries. It's an extremely difficult regulatory environment for licensed cannabis dispensaries. In addition, licensed dispensaries are competing against unlicensed and unregulated cannabis shops.'",
        "'speaker_4': 'The existing dispensaries spent years going through the licensing, building and planning processes. Adding additional dispensaries in the.'",
        "'speaker_7': 'Downtown area will lead.'",
        "'speaker_4': 'To more oversaturation of an already oversaturated market. It's also setting up both current dispensaries, dispensaries and future dispensaries for difficult times and potential failure. Most of the existing dispensaries in Long Beach have been open for a very short period of time.'",
        "'speaker_4': 'I believe it would be in the best interest of the city and its businesses to allow for some additional time before making a determination about adding additional dispensaries. I urge the council members to vote against this item. Thank you.'",
        "'speaker_3': 'Thank you. Our next speaker is Lupe Trejo.'",
        "'speaker_4': 'Good afternoon, council members and Honorable Mayor Garcia. My name is Lupita Trejo and my husband and I both work for the Port of L.A. and Long Beach. We are in support of Catalyst coming to downtown Long Beach for various reasons, one of them being near and dear to our hearts, our union jobs with medical benefits, with getting'",
        "'speaker_4': 'over the pandemic. You all know it's extremely important. I, together with co-founder Anna Lewis, crowded all the beautiful films you see on the 400 block of pine. While planting on pine, Anna and I met tons of neighbors who greeted us with joy and excitement as we shared our hopes of bringing catalyst to Pine Avenue.'",
        "'speaker_4': 'Catalyst brings revenue to Long Beach as well as badly needed foot traffic to the struggling neighboring establishments. Catalyst brings a sense of community to all its neighbors. You can take a look at the other dispensaries in Bellflower on Cherry that are amazingly beautiful, as along with state alumni who spent a lot of time partying downtown.'",
        "'speaker_4': 'I'd love to see that area thrive again. There is no better leader than by call him El Magnifico, also known as Elliot Lewis to make it happen. We for the people.'",
        "'speaker_3': 'Thank you. Your next speaker is Natasha. Wyn.'",
        "'speaker_4': 'Hi. My name is how I. Thank you. Hello. Hi. Councilmember is an honorable Mayor Garcia. Uh, I'm just.'",
        "'speaker_1': 'Speaking today in support of item 19.'",
        "'speaker_4': 'I personally attended the North Plain Neighborhood Association meetings in the past with Elliot Lewis, and the overwhelming consensus among that neighborhood association is that they're excited to see us come in and help revitalize the area beyond just the normal business and our normal operations.'",
        "'speaker_4': 'Our company has tried, has participated in between out.'",
        "'speaker_1': 'Beautification projects, worked in.'",
        "'speaker_4': 'Record expungement clinics. So we're more than just a catalyst company. We're here to help bring positive change to the city of Long Beach, city of Long Beach and beyond. So I urge you all to please vote in favor for this project.'",
        "'speaker_4': 'Thank you so much for your time and for your consideration.'",
        "'speaker_3': 'Thank you. Our next speaker is Ronnie de Leon. Ronnie de Leon. Ronnie de Leon please hit star six time you. Our next speaker is Sam Bird.'",
        "'speaker_4': 'Yes. Hello, this is Sam Barron. Thank you, council members. And thank you, Mayor Garcia. I wanted to speak as a Catalyst employee, but also as a Long Beach resident. I was born here. I've lived here for over 36 years now.'",
        "'speaker_4': 'And at a time when we are going through a revitalization and right after COVID and the loss of employment by so many people, I strongly urge you to support Gender 19. There are so many people in need of work right now, and this would create extra union jobs that would give them benefits and help them and their'",
        "'speaker_4': 'families to get back from a struggling time. I would like to also.'",
        "'speaker_7': 'Talk about how.'",
        "'speaker_4': 'You know, how much this industry has changed since 2016 to now and how we've proven that cannabis in legal and safe environments actually.'",
        "'speaker_7': 'Lowers crime rates.'",
        "'speaker_4': 'And increases foot traffic and prosperity to the community. So I would strongly urge you to consider Gender 19.'",
        "'speaker_0': 'And approval, and I.'",
        "'speaker_4': 'Thank you for your time.'",
        "'speaker_3': 'Thank you. Our next speaker is Todd Nichols. Todd Nichols.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_4': 'Mayor and city council members.'",
        "'speaker_7': 'Um, I don't really understand what's going on here. I mean, didn't we already.'",
        "'speaker_0': 'Authorized a certain.'",
        "'speaker_4': 'Number of licenses? Why is this? One entity allowed to just drop in wherever they want. Shouldn't we do, like, a rigorous study before allowing this art, before expanding the program even more? These licenses have barely got time to operate at this point.'",
        "'speaker_7': 'I see him still coming up after years.'",
        "'speaker_4': 'How does this even make sense? I mean, are we just going to start allowing these to pop up everywhere now? Is there no cap on on what we're going to allow in terms of cannabis businesses in our city?'",
        "'speaker_4': 'I didn't sign up for that. I didn't vote for that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. Our next speaker is Robert de Leon.'",
        "'speaker_4': 'Hello, folks. Please begin. Yes. Hello, folks. Can you hear me okay?'",
        "'speaker_3': 'Yes, please begin.'",
        "'speaker_4': 'All right. Hello, everyone. My name is Romeo Garcia. Hello, Mayor Garcia and council members. I'm here with Ronnie DeLeon, along with 20 other North Pine resident and small business owners here. We call in to express our support of Catlett's Agenda 19 item.'",
        "'speaker_4': 'Catlett's will continue to be an anchor to drive additional foot traffic to Historic Point Avenue, a corridor that needs continued activation and support for local small businesses. We've seen this in Elliot actions and in his leadership, and we have seen an activation for third parties, including my full attention to safety and security here at our North Side'",
        "'speaker_4': 'block. Now, let's will also bring in 20 to 30 full time union jobs for our local Long Beach workforce, including their leadership in organizing a very well attended job fair for our local residents. Now, this will also generate additional tax revenue for the city.'",
        "'speaker_4': 'Lastly, Catalyst will provide local accessibility the cannabis products for patients and residents. Among the 20 plus residents, neighborhood organizations and local small business owners here today at Northside, we encourage the city and the city council, the mayor, to support, catalyst to open and operate on historic Point Avenue.'",
        "'speaker_4': 'Thank you for your consideration and support.'",
        "'speaker_3': 'Thank you. Our next speaker is Violet. Violet Aguilar.'",
        "'speaker_7': 'Works.'",
        "'speaker_4': 'Hi, Henry.'",
        "'speaker_3': 'Yes, please begin.'",
        "'speaker_4': 'Hi. My name is Sheila Aguilar, director of Equity and External Affairs Officer for Catalyst. And also I am in charge of our Catalyst initiative. I don't care. Mission is to bring are we for the people philosophy beyond our stores and surrounding communities, which is exactly what we have been doing and plan to continue to do in North'",
        "'speaker_4': 'Avenue. Our core values are labor, communities, social equity, social justice and best practice. And this really is what's what drives. And we'll continue to drive our direction to bring equity and accessibility to the cannabis industry, specifically to our communities that have been more impacted by the war on drugs.'",
        "'speaker_4': 'We're looking forward to continue to work with the neighbors, with the business owners, with council, and with some out in the community to uplift our community, to bring civilian jobs, to provide that much needed tax revenue and that much needed additional tax for traffic.'",
        "'speaker_1': 'In the North Pine Avenue.'",
        "'speaker_4': 'That's why I urge and we urge city council and mayor to approve our project. Thank you so much.'",
        "'speaker_3': 'Thank you. And that concludes public comment for this item.'",
        "'speaker_0': 'Thank you. Conservative sort of councilman's and day house. Who has the motion?'",
        "'speaker_1': 'Thank you, Mayor.'",
        "'speaker_5': 'Thank you. To city staff who have continuously worked hard on this item. Thank you very much to the planning commission for for their work on this item as well. For passing this item and approving it during this pandemic, it breaks my heart to say that we have had to face three major, significant losses of three major businesses'",
        "'speaker_5': 'in our downtown area in exactly the 400 block of pine. This is why I am for any opportunity that can support our local businesses. And I think that this item offers a very specific change that will allow for a particular business, a particular business to thrive thanks to the CFP process.'",
        "'speaker_5': 'I have already received overwhelming support from residents as well as business owners for this particular item before us. I hope that my colleagues are able to support this item and these efforts to uplift our North Pine area. And in this historic, historic, historic little block that we have and I've already seen such magnificent changes as it is'",
        "'speaker_5': '. So I hope that I can get the support from our my colleagues here today.'",
        "'speaker_0': 'Thank you. And have a second by Councilman Allen.'",
        "'speaker_1': 'As a thank you, mayor, I believe that this amendment will benefit any cannabis business that applies to operate and downtown through the SIU process. Staff found that the proposed changes are consistent with inland land use elements. Goals for downtown Long Beach.'",
        "'speaker_1': 'I'm also happy that this amendment expands areas in which the cannabis businesses can operate, and these cannabis businesses bring great, good paying union jobs. So I'll be supporting this item. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_1': 'Hi, everyone. Thank you, Mr. Mayor. I wanted to just chime in, and of.'",
        "'speaker_4': 'Course, I support.'",
        "'speaker_1': 'The council members from Council.'",
        "'speaker_4': 'District one two and.'",
        "'speaker_1': 'Supporting this item. It is going to be impacting their districts primarily, and.'",
        "'speaker_4': 'I'm sure that they've done their due diligence, so I'm happy to support them on this item. I will say.'",
        "'speaker_1': 'That Catalist has a shop.'",
        "'speaker_4': 'In the third district in Belmont.'",
        "'speaker_1': 'Shore, and I know we've heard a lot about Eliot Lewis tonight. And so at the risk.'",
        "'speaker_4': 'Of inflating his.'",
        "'speaker_1': 'Ego, let.'",
        "'speaker_4': 'Me just say that he is a.'",
        "'speaker_1': 'Tremendous partner to me and my staff and our council office. There's never been a single resident issue or.'",
        "'speaker_4': 'Complaint that I've brought to his attention that hasn't been immediately dealt with, sometimes at extensive cost to himself.'",
        "'speaker_1': 'And sometimes when absolutely.'",
        "'speaker_4': 'Unnecessary, but done out of a purpose.'",
        "'speaker_1': 'Of courtesy that he shares.'",
        "'speaker_4': 'Towards the community. So he's just been an excellent operator.'",
        "'speaker_1': 'He's also.'",
        "'speaker_4': 'Assisted with.'",
        "'speaker_1': 'Education.'",
        "'speaker_4': 'On areas involving cannabis use and some of the best practices there that have really helped me in many ways, not just in my council role but in other roles as well. And I think he's just really a fantastic partner.'",
        "'speaker_4': 'For me personally, my experience has been very positive and I do believe that if he says he's going to do something and work hard to mitigate any concerns or impacts, that he will make sure that he does that.'",
        "'speaker_4': 'That's been my experience. And so thank you very much.'",
        "'speaker_0': 'Councilwoman Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Just want to take a moment and congratulate our first District Councilwoman, Sun Sun House on what appears to be a very thoughtful engagement process to arrive at a decision that ensures progress on an important corridor, the Pine Avenue corridor.'",
        "'speaker_7': 'So I know that, you know, it's great to hear, you know, so much input from residents and from businesses along the corridor. And I'm excited to see our summer quarters could certainly use a boost right now. So I'm sorry.'",
        "'speaker_7': 'I'm certainly excited to see you focused and being diligent on making sure you're making the right choices that are appropriate for your community. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you. Also, I'd like to lend.'",
        "'speaker_7': 'My support to other council members and De Haas and Allen for our agendas in this, for bringing this forward and their support for this. Again, I know that they've done their their homework. They've dealt with the stakeholders and they're reaching a good conclusion here.'",
        "'speaker_7': 'But I want to just just remark that I think this is a this is a bold move. That is an important move for for the city to take. And this council and I just want to hats off to Catullus and Elliott Lewis.'",
        "'speaker_7': 'I think they are pioneers in the cannabis industry today, not just in retail, but also in their approach toward cannabis equity, social equity as well. And I look forward to continuing to work with them on making sure that the future we have more cannabis equity in our city and more opportunities for individuals to participate in this very'",
        "'speaker_7': 'lucrative industry. So I will be supporting tonight and look forward to seeing a new presence on Pine Avenue.'",
        "'speaker_0': 'Thank you. There's a motion in a second. Please cast your votes. I'm sorry. A roll call vote.'",
        "'speaker_1': 'District one I. District two I. District three I. District four. All right. District five. Yes, six. I.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District eight. District nine. I reckon Kerry's.'",
        "'speaker_0': 'Thank you. That concludes the three hearings. Now we will move on to general public comment. I'm quick.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the Parks, Recreation and Marine Department by $50, offset by the First Council District One-time District Priority Funds transferred from the Citywide Activities Department for the Harvey Milk Flag Raising Event;   Increase appropriation in the General Fund Group in the Public Works Department by $150, offset by the First Council District One-time District Priority Funds transferred from the Citywide Activities Department for the costs associated with the First District Harvey Milk Flag Raising Event; and   Decrease appropriations in the General Fund Group in the Citywide Activities Department by $200 to offset a transfer to the Parks, Recreation and Marine Department and the Public Works Department.": [
        "'speaker_1': 'Communication from councilman's in the House, recommendation to increase appropriations in the Parks, Recreation and Marine Department by $50 for the Harvey Milk flag raising event. And then the public works department by $150 for the costs associated with the Harvey Milk flag raising event.'",
        "'speaker_1': 'Item 21 Communication from Councilwoman Allen and Councilwoman Zendaya's recommendation to increase appropriations in the City Manager Department by $1,000 to provide a contribution to Partners of Parks to support the Juneteenth 2021 celebration. Communication from Councilwoman Zendaya's recommendation to increase appropriations in the City Manager Department by $1,095 to support the Long Beach Blues Society.'",
        "'speaker_1': 'Blues for All Event. And Item 23 Communication from Vice Mayor Richardson, Councilwoman Zendejas, Councilwoman Allen Council and Super Nine. Is this part of the transfer? Item 23. No, I'm sorry. Item 25 Communication from Councilman Super. Recommendation to increase appropriations in the City Manager Department by $500 to provide a donation to the Long Beach Fire Museum.'",
        "'speaker_0': 'Can I get a motion in a second, please? Mozambique councilman's Sunday house and a second councilman Alan Thompson day has anything.'",
        "'speaker_5': 'Yes. Think in the year. Once again, I would like to thank Vice Mayor Richardson for partnering and supporting an Juneteenth celebration and also to all my colleagues, including Councilwoman Allen, for supporting this event. I'm happy to contribute the donation to support the city's upcoming Juneteenth celebration, which will be this Saturday on historic Pine Avenue starting at 11'",
        "'speaker_5': 'a.m.. You can still get tickets by going to Albee Juneteenth dot com. I look forward to seeing everybody at this great event. In addition, I also wanted to. To tell you about. How about our next event? As we all know, it is widely known that music helps heal the mind, the body and the spirit.'",
        "'speaker_5': 'After a year of staying indoors, then going through so much stress, pain, we we are finally approaching the light at the end of the tunnel. And I think that it is important that we do our best to help our Long Beach community in this transition, not only through a speedy and comprehensive economic recovery, which we are working'",
        "'speaker_5': 'on, but also by providing events like these that are meant to celebrate life and community. And it is in it is an absolute pleasure to be supporting this summer concert series. I want to thank the Long Beach Society for all the hard work that they've been doing to organize such a beautiful event in our first District.'",
        "'speaker_5': 'For those that who don't know or haven't heard yet, this a first Blues for All event will be next Saturday, June 26th, at our very own Cesar Chavez Anthem Theater. If interested, please make sure to sign up. More information will be provided and you can contact my office or it will be definitely posted on social media.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. We just got some great news out of Washington this afternoon. The United States Senate unanimously passed a resolution designating Juneteenth a federal holiday. So all it needs now is to pass the House and be signed by President Biden to become our 12th federal holiday.'",
        "'speaker_1': 'So this was really exciting. Thank you, Mary, in Dallas, for bringing this forward. I like it that folks are calling this our country's second Independence Day. So just here in Long Beach, I want to thank the organizers, especially Karl Kemp.'",
        "'speaker_1': 'And I would love to see the annual Juneteenth events in Long Beach just become a beacon for the whole region. So I look forward to seeing everyone out there on Saturday. Thank you.'",
        "'speaker_0': 'The Councilwoman seen no other speakers. I don't believe there's any public comment. Members, please do a roll call vote.'",
        "'speaker_1': 'District one i. District two, i. District three. I district for my district by district six. I District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. District nine. Motion carries.'"
    ],
    "Recommendation to request City Manager to conduct a review of the city's hiring practices, and to issue a directive which prioritizes fully staffing the Permit Center as well other offices dealing with the review and approval of building permits;  Request City Manager to provide a report within 30 days regarding the status of the city's permitting software and provide options for optimizing and expediting the building permit review processes; and  Request City Manager to explore the creation of a \"Development Shot Clock\" for the review of local development in line with transparency, timelines, and standards consistent with state law.": [
        "'speaker_0': 'Thank you. That concludes the funds transfers we have now. Item 23, please.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Zendejas, Councilwoman Allen, Councilman Super Na recommendation to request city manager to conduct a review of the city's hiring practices and to issue a directive which prioritizes fully staffing the permit center. Provide a report within 30 days regarding the status of the city's permitting software and to explore the creation of a development'",
        "'speaker_1': 'shot clock for the review of local development.'",
        "'speaker_7': 'And Mr. Mayor, I might add, my thing is I'm working so I can not working.'",
        "'speaker_0': 'So can someone else. So I need to have someone queuing. Okay. Vice Mayor? Yeah.'",
        "'speaker_7': 'Thank you. So I think we have a presentation to queue up to help summarize the proposal.'",
        "'speaker_0': 'I can hear the clerk take a look at his system, please.'",
        "'speaker_7': 'Thanks. Okay, great. Thank you. So first first, it is great to be here in person to help make this proposal on this particular date. And great to see everyone. Today I want to talk about and propose a proposal called the MLB Build Initiative is building upgrades, incentivizing long term economic development.'",
        "'speaker_7': 'And this is focused on supporting our our team internally and creating a modern, efficient, permanent process within the city of Long Beach. I want to thank our city team. I want to thank our stakeholders. Building Industry Association, Base Fed, IAM, Southern California Association, Nonprofit Housing WHO submitted letters of support.'",
        "'speaker_7': 'And I also want to thank council members Mary's and de Haas, Sandy Allen, Darryl. Super so. So let's see. Okay there it is. Is working. So here's here's a bit of background. Last month on May 11th, our director of development services, Oscar Orsi, submitted a memo to the City Council detailing the challenges within the Building and Safety'",
        "'speaker_7': 'Bureau as it relates to issuing construction permits. The memo highlighted lengthy permit, turnaround times, lack of communication with applicants, a slow or delayed development review process, among other issues. During the pandemic, it's been hard on our permit center, and the permit center saw its fourth full time staff drop from 11 to 6, with replacement hours coming in'",
        "'speaker_7': 'the form of private contractors and overtime. This has resulted in substantial delays in the review process, which, although understandable, it can have and lead to substantial, significant impacts on our city. The situation has delayed our ability to approve permits and build housing in the middle of a housing crisis and make it more difficult for contractors to conduct'",
        "'speaker_7': 'improvements to homes, improve the habitat habitability issues within our city, threaten our ongoing economic recovery. So it's an important issue that needs to be elevated to the city council. So this chart shows a little bit about what we're talking about.'",
        "'speaker_7': 'So it shows the ratio of field full time equivalent positions, contractors and vacancies over the period of January 2020 to April 20, 21st. As we can see, the number of positions filled by city full time city employees is declined and the number of positions filled by contractors has grown.'",
        "'speaker_7': 'We want to turn that trend around. As a city council, we have a job to be responsive to our city's needs. This is important to elevate. We need to make sure we invest in our city employees. We make sure that they're adequately staffed and are able to do do the job that they're hired to do and that'",
        "'speaker_7': 'we trust them to do so. Here's a snapshot of April, April 2021, and it shows almost an even split between full time employees and contractors and vacancies and positions filled by other staff. And we need to we need to fix this pie chart.'",
        "'speaker_7': 'We'd like to see much more green. We're heading in that direction. But this sort of summarizes the issue at hand. Even prior to the pandemic. And this is this is a report, a study published last year prior to the pandemic.'",
        "'speaker_7': 'This this shows the 90 day goals set out by the state in SB 330. It's a goal, but it compares how long these fairs in comparison as it relates to how long it takes to actually approve discretionary projects within the city on smaller projects way beyond the state goal.'",
        "'speaker_7': 'But if you look across smaller projects from five or 25 units, 251 units and above, there is a big disparity between what the state set out and where we what we're achieving. So what we want to do is we want to make sure that I mean, to be hard to close that gap completely.'",
        "'speaker_7': 'But we do want to understand where we are from a benchmarking standpoint and continue to take steps take steps toward closing that gap. We have an opportunity ahead of us, and that's what this proposal is about. Despite these issues, affirmatively addressing this issue does present a real opportunity for us to create a modern, prevent permitting system that's'",
        "'speaker_7': 'efficient, transparent, accountable. If we get this right, this will help spur economic opportunity in our city, help support construction jobs, help support small business contractors. It will help eight local realtors and restaurants who are looking to make improvements to their businesses.'",
        "'speaker_7': 'It'll improve our housing spark stock. Help us address our aging housing supply and habitability issues. Although staffing is one contributor, expediting our house hiring process alone won't be enough to really spur the recovery or help solve the housing housing crisis fully.'",
        "'speaker_7': 'But let's use this as an opportunity to explore ways that we can not just fix the problem, but improve the system altogether. So this is what we're asking the city manager do with this proposal. So first we want to expedite hiring.'",
        "'speaker_7': 'I know a lot of steps have already been taken to start heading in this direction and we're supportive, but we want to support heading in the direction of expediting hiring, to conduct a review of our hiring practices and issue a directive that then helps prioritize fully staffing our permit center as fast as possible, as quickly as possible'",
        "'speaker_7': ', and other offices that may be related to this this system. We also want to provide options to the City Council to procure a modern permit software platform that has the ability to optimize and expedite our building permit review process.'",
        "'speaker_7': 'And the third thing we want to do, we want to explore the creation of a shot clock of development shot clock. And this would prioritize customer service, accountability, transparency and how we deal with construction and development timelines within our city.'",
        "'speaker_7': 'So here are a few cities that are taking some very similar steps. These cities are right around the same size as Long Beach or around that, you know, around our very similar lobbies in many ways. And so what it shows is that the challenges we face this city are not unique.'",
        "'speaker_7': 'We want to look at some best practices and we want to, you know, ask our staff to really lean in here. Oakland implemented a quarterly permit tracking system to update assessment and update assessment. And as a result, they've seen a reduction in rent to income ratio from 51% to 44% between 2015 and 2018.'",
        "'speaker_7': 'And San Jose, they made an update to their software system and it's helped them remain resilient through the pandemic. It only received the city of San Jose after that, only saw a 9% drop in permits issued compared to their neighbors in neighboring San Francisco who didn't update their software.'",
        "'speaker_7': 'They saw a 34% drop in permits during the same period. San Diego updated its permit software and in in 2020, just last year, transitioning to a fully online system that prioritized customer full transparency in how it has the shot clock.'",
        "'speaker_7': 'It has estimated approve timelines while also making the permit process more sustainable by completely removing the need for paper. Submitting paper plans as completely online as more sustainable is what San Diego done laying some beaches planning, planning and building departments to transition to a new software in 2018.'",
        "'speaker_7': 'After 14 years without an update, their residents, contractors and interested people can can now visit their website up to date. Information on permit activity is live. They can arrange inspections, make payments, track the process of their project from home or their smartphone 24 hours a day.'",
        "'speaker_7': 'So as we can see, all of these cities took affirmative steps toward their, you know, to support their hardworking employees. And I want our city to our city council to make this step to to do the very same.'",
        "'speaker_7': 'So here's the shot clock idea. I mean, the shot clock and, you know, shot clocks, you know, some city some states have shot clocks. The state of California has a shot clock. What we're talking about is updating our software so we can help approve smaller scale permits like home repair improvements, bring some transparency to our our permitting'",
        "'speaker_7': 'system by providing top tier customer service and accessibility. We can align with state law on affordable housing shot clocks. We can also. So we can also, you know, regulate and improve habitability by better understanding and distinguishing between improvements to existing homes and businesses from the building of new homes.'",
        "'speaker_7': 'So you can treat it differently. The idea is to add accountability, transparency and better customer service by implementing a shot clock. So as the city recovers from the pandemic, I think it's important that we acknowledge, you know, we were we were dealing with a housing crisis prior to the pandemic, and that exists today.'",
        "'speaker_7': 'We're going to continue to tackle issues of economic equity. We should do all that we can to remove barriers that prevent us from building a healthy, safe and bright, vibrant city for all of our residents. We have an incredible staff, tremendous leadership, and we need to put them in a position to succeed.'",
        "'speaker_7': 'That means we need to make the investments necessary to bring, you know, bring them bring pride to their jobs, bring stability in the workplace, bring quality public service, quality services to our residents. So I want to thank you for this time.'",
        "'speaker_7': 'I'm happy to make this motion, and I want to ask staff to provide some updates on sort of progress since the memo on May 11th and then any reaction that they have on how they plan to respond to this request.'",
        "'speaker_7': 'Thank you so much.'",
        "'speaker_0': 'There's a second by Councilmember Austin.'",
        "'speaker_7': 'Thank you. And I'm going to defer comment and I'd like to hear from the public and my colleagues before. Actually a bonus. Thanks.'",
        "'speaker_0': 'Okay. So, what are we. Is there. Before we go to public comment, Mr. Market, did you want to. I wasn't sure if that was a good question. Okay. So Mr. Motorcar.'",
        "'speaker_3': 'Yes. And of course, he would respond for staff.'",
        "'speaker_0': 'Thank you, Mayor and council members and Vice Mayor, for the opportunity to update you and just to let you know our thoughts on the proposal. We have been making some tremendous strides since the May TFF memo to you all.'",
        "'speaker_0': 'Just to highlight a few of some of our accomplishments, we've opened City Hall back in April, May and and started with express permitting by reservation only in the next week or so where we will be accepting reservations to expand that even further so that folks can actually come in and process over the counter applications on a reservation'",
        "'speaker_0': 'basis only. We have launched today a new permitting software for certain express permits. So now we have a web facing portal that will allow us to check off several of the most frequently requested permits, like reroutes and certain water heaters and that sort of thing.'",
        "'speaker_0': 'As the Vice Mayor alluded to, we are continuing to work with our civil service department and our human resources to continue to prioritize the interviewing and selection of staff. We've done some great strides and we will continue to to work on that.'",
        "'speaker_0': 'We have an open enrollment process currently that will allow us to continue to interview staff or applicants as they come in. Lastly, we've made, I think, a significant amount of of improvements to improve our our backlog. We've reached out to our partners in certain cities like Oakland, San Diego, Tennessee, Huntington Beach.'",
        "'speaker_0': 'And we are essentially consistent with their express permit timelines, their minor project timelines. And we're working to catch up where about a week or so behind them when it comes to the major project review. So I think we've done a pretty good job and in reducing that backlog.'",
        "'speaker_0': 'We're not perfect and we'll continue to improve that. And I want to thank the vice mayor for his recommendations. I think these are in the order that were were laid out. I think these are things that that we will be able to report back to you in terms of the additional staffing efforts, the technological improvements, as well'",
        "'speaker_0': 'as the shot clock. I think we are. Generally speaking, we're in support of of those recommendations and as a precursor, having staffing and technology in place to be able to effectuate the shot clock proposal. So that's our thoughts.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'And Mayor, if I can add just a couple more areas that that Oscar shared with me that I think would be important for the team to know in two specific areas. One was expedited, permitting, all those ideas that that actors talked about during the pandemic.'",
        "'speaker_3': 'Yes, we were certainly suffering. We had employees get sick, employees leave, contractors leave. We had furloughs. And so we were seeing response times in that area of about eight weeks or more. We were back down to 1 to 2 days in those areas.'",
        "'speaker_3': 'So there's been huge progress since May that we were even at a point where we were getting so many calls and emails, it was taking a couple of weeks to be able to respond to everything. We're back down to 1 to 2 days as well.'",
        "'speaker_3': 'So there's been certainly a lot of focus on this. We know that there's more that we can do and look forward to engage in some additional study.'",
        "'speaker_0': 'Thank you, Mr. Modica. Appreciate that update, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I want to start by thanking the development services staff. Over the last six months, I've worked so closely with them because so many permits had been pulled on my side of town and there have been so many things that impacted residents.'",
        "'speaker_8': 'And I just want to say that not only has the management been excellent, but the staff that are there remain excellent. Some of the discussions that I've had with management about the implementation of the system that we've discussed, I'm thankful to hear, at least from our I.T.'",
        "'speaker_8': 'Manager, that. We are actively updating the current system to have those online submissions and this is kind of part of a bigger picture as well because other systems will plug into our system. So then there's a secondary component of the assessor's office and other things that really have a long term benefit in reducing the workload over time'",
        "'speaker_8': '. And for those things, I'm grateful because I know it is a big lift and our city has many, many large IT projects at hand. We talked about during an Economic Development and Finance Committee meeting in 2016, the priorities of the city in terms of transparency.'",
        "'speaker_8': 'And we specifically talked about development services. And as I've tracked the progress with the department, I look forward to a time where this permit system is hooked up to a dashboard and whether it's called a dashboard or a shot clock, the transparency on all things within our city, whether it's the number of days it's been since an'",
        "'speaker_8': 'animal was impounded and receives its vaccination to the number of days it's been for a permit to be processed of different types. Individuals in our community should see what's happening at City Hall. As the mayor said when this was brought up the first time, 24 seven City Hall, and that was long before a pandemic that people should'",
        "'speaker_8': 'have access to that information. 24 seven. And so I look forward to us getting all of our systems to that place. And I know that the Long Beach Coast project has been a heavy lift and is a big piece of the resources that have really been a burden on the city to get us to this point.'",
        "'speaker_8': 'Other critical projects, including the Long Beach, one card and others, are making progress. But but slowly because there's so much going on. And I appreciate that. But one thing that I think we just cannot not address is the staffing shortages.'",
        "'speaker_8': 'Mr. Modica has done an excellent job both as city manager and as assistant city manager in trying to streamline. We had a presentation approximately two and a half years ago related to the changes made. However. On and on and on.'",
        "'speaker_8': 'Cities around the region continue to come in, cherry pick our excellent stuff, and they do that because they're able to get their training wheels here, learn the ropes, become excellent staff members, and then all these other cities are cherry picking our staff.'",
        "'speaker_8': 'So what I'd like to see is a friendly. A friendly. A friendly amendment. I can't even remember the things we used to say at the diocese, like looking down. Someone help me out here to dress and provide some ability for our executive team to whether it be with one of the committees of our council or independently be'",
        "'speaker_8': 'able to provide critical shortage recruitment rates. Critical shortage recruitment rates have been a very effective tool in the county of Los Angeles. Quite frankly, the county of Los Angeles has used them to ravage our prosecutor's office and steal them for the DA's office.'",
        "'speaker_8': 'And it's about time that we use those tools for ourselves. So the Los Angeles County Municipal Code, Section 6.10.050 outlines the critical shortage recruitment rate. I think it important to note that the steps in the county system are different percentages than the city system, but that the CEO, under certain considerations in that case would be our city'",
        "'speaker_8': 'manager, can provide between a one and four step increase during the shortage for both recruitment and retention of critical positions. And I think that hadn't Mr. Modica had that tool during this time, we would have been in a better position.'",
        "'speaker_8': 'Mr. Orsi and I and Mr. Koontz and I have discussed the specific item before this agenda item was even presented. It's something that we talked about back when we had the week shortages. Sorry. Speaking with a mask on.'",
        "'speaker_8': 'I'm like, totally winded in myself. But this is a critical part of our city's ability to stay competitive when we have the best of the best. And so for those reasons, I hope, Mr. Richardson, your vice mayor Richardson, will consider a friendly amendment to add in that Mr. Monica look at critical shortage recruitment options for this Council'",
        "'speaker_8': 'to consider.'",
        "'speaker_7': 'Right. These three ideas are a starting point. If there's other things that make it better, I think we're just sending the message that these are the types of things we want to explore to really turn this around. So absolutely happy to accept it.'",
        "'speaker_7': 'I thank you.'",
        "'speaker_0': 'Councilwoman the house.'",
        "'speaker_5': 'You think if I smear Richardson for this item? As we all know, many departments experience cutbacks in staff as well as a slower processes in some instances due to online transactions we had to make during during COVID 19.'",
        "'speaker_5': 'However, as as this item, stress and such changes created more barriers for our permitting center and others per many permit and building related offices, which translated to greater barriers to our affordable housing expansion efforts. And that is something that we cannot allow to continue.'",
        "'speaker_5': 'Anything that we can do to help ensure that our response to housing crisis and that are and that our pandemic recovery is as speedy, comprehensive and efficient as possible is something I want us to do. I am very supportive of everything that this item proposes and will continue to support this item and these efforts to make sure'",
        "'speaker_5': 'that we we are able to provide these permits in a timely manner. Thank you.'",
        "'speaker_0': 'Kathryn Ringo.'",
        "'speaker_2': 'Thank you. I am supportive of the item, but the complaints that I've received haven't been along the lines of the permit. It's the customer service that the individuals get their delays. Excuses are being made and using the using the understaffing as as a reason for not being able to provide the service.'",
        "'speaker_2': 'I think that while we get a solid chart, we have maybe just about equal amount of contractors and employees. I think that when you get contractors, you get what you pay for. The customer service is just not there.'",
        "'speaker_2': 'So I want to see that we can improve our our customer service in the area that we get up to, up to speed with our staffing. But I also want to encourage our department and maybe with h.R. To do maybe a compensation study in terms of where people leaving and where are we being cherry picked as a'",
        "'speaker_2': 'councilmember, Mungo stated, why are we going to other cities or the stimulus in general for our either better employment or better working conditions? I don't know. Might want to do a exit interview of these individuals to find out why they're leaving.'",
        "'speaker_2': 'We know some because they got sick and probably would didn't want to come back or couldn't go and couldn't come back. But for those that replaced them, I think we also have to include a training program on customer service, being able to deal with the public.'",
        "'speaker_2': 'Many of these contractors, we know, are not trained in that area. They're just trained to do the job and probably not sensitive to the needs of the community for to be responsive. So I'd like to also see some kind of customer service training that would bring these contractors up to speed.'",
        "'speaker_2': 'If we're going to be using them, let's get them. That's getting trained so that they can work in the municipal environment. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes, I thank you, Mayor. And I just want to say thank you to Vice Mayor Richardson for introducing this item. And I'm so happy that I have signed on. I have heard from so many folks in District two that are having or had issues with their projects.'",
        "'speaker_1': 'I recently, just last week, was talking to a personal friend who has done construction in this city for over 40 years, and he has never seen these long delays. And I know that were what happened with COVID. And I explained a lot of the issues that we've had.'",
        "'speaker_1': 'I was encouraged when I just heard city manager Tom Modica say that this would be a focus of his. I think that it's important as a city that we do everything possible to get things done in a timely manner and that we have good customer service.'",
        "'speaker_1': 'You know, we need to return people's calls. I know what we did as a city during COVID. I know the amount of calls that we were receiving then, and I know how responsive that we were to all those calls.'",
        "'speaker_1': 'So I'm confident that we can get this under control. With the commitment from staff. And I also think it's important that we hit you know, we hit the ground running. And that means, you know, all these contractors. So this is going to help us.'",
        "'speaker_1': 'This is these issues are going to help us really with our with a strong economic recovery. I also think it's going to be critical that we address address some of the staffing issues that we've talked about and then updating all of our technology as well.'",
        "'speaker_1': 'So anyway, this is good stuff. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. I also want to just first of all, thank our Development Services Department for. I'm just doing an amazing job of responding to just the enormous amount of development that's going on in the city at this time.'",
        "'speaker_7': 'It is not it's not normal times. Right. And I would believe that particularly over the last year with people staying at home or paying a little bit more attention to those household projects that we need to take care of in terms of maintenance of homes.'",
        "'speaker_7': 'There was probably an unexpected demand on our our our services here in the city. And and during a period of time probably that we didn't think there would be that demand. And so there were some factors that I think we need to acknowledge over the last year that that.'",
        "'speaker_7': 'That certainly led to a changing dynamic. In my view, this is a personnel and priority management issue at I that the I appreciate Councilmember Richardson for bringing up the graph showing the the disparity and the the the trend of contractors versus full time employees.'",
        "'speaker_7': 'I'm one that believes that employees actually have more vested interest in their work, particularly in a critical function like this in terms of permitting of for development services. I mean, there's the specific codes, there's specific institutional knowledge. That is, I think, very, very useful.'",
        "'speaker_7': 'Employees are going to have that grasp and long term interests more so than a contractor in the future. So so I guess I have a quick question of how did we get to this point with it? And I heard from my colleague, Councilmember Mongo, and it seems to be some some thought about pay disparities and people being'",
        "'speaker_7': 'kind of plugged off to other agencies. But to the director and to city manager. What, what, what, what? Because it was a drastic shift. I mean, literally 50% of the workforce in this particular function went away. What contributed to that?'",
        "'speaker_0': 'Councilmember First of all, you're correct. 2019, we had a banner year in terms of the number of permits pulled and issued. 2020 was not that far behind. I think it's our second highest permitting. So although we were in COVID, we did have a tremendous amount of requests for development.'",
        "'speaker_0': 'Uh, I think what, what we were managing some of the absences and whatnot throughout the better part of 2020. It's towards the end of the year 2020, the beginning of 2021, where we experienced delays or excuse me, vacancies, and they all seem to happen all at once.'",
        "'speaker_0': 'So it's kind of the perfect storm, if you will. We have the added development activity now. We have vacancies, and now we have to bring up staff contracts to have private consulting staff to train those. And we've we've done we've done well at being able to fill those positions.'",
        "'speaker_0': 'But again, those positions are transient in nature and they require training, which didn't help us in terms of our backlog. So that's essentially what what transpired and why we created these why these delays were created.'",
        "'speaker_3': 'And just add to that a little bit. We agree, we want most of our staff there on a daily basis to be our own city employees. That is our model. We then use contract staff to help on the surges and the supplements.'",
        "'speaker_3': 'And so we got to a point where people were retiring, people were leaving, they were getting sick or they were moving for other jobs. We are not known as the best paid municipality around either, so pay is certainly a factor, but that is something that we see in multiple different areas.'",
        "'speaker_3': 'One thing we did do is we've authorized over hiring. So they have the ability to now hire more than budget in order to get back up so we can get city employees. But just like other employees were, other employers were affected as well by just the limit of a labor pool.'",
        "'speaker_3': 'So this permit tech is one of the main positions down there. We used to get about 70 to 90 applications a year when we opened it up and about half of those would be unqualified. And then you get maybe 30 or 40 people to choose from.'",
        "'speaker_3': 'In this recent time, working with civil service, they opened it up and they got about 36 people and 63% of which were not qualified for the job. So that leaves you with about 13 people to then, you know, go through and make sure that they're a good fit for us and have all the qualifications.'",
        "'speaker_3': 'So we are just like other industries having a hard time finding people to replace them.'",
        "'speaker_7': 'So, um, it sounds like we, no matter where we get to, the bottom line is we're going to have to have adequate staffing to be able to improve efficiencies in our system no matter what we do moving forward.'",
        "'speaker_7': 'So with that, I certainly support improving our efficiencies and I think this discussion was worthwhile. I'm really looking forward to hearing from public comment, but also the stakeholders who who deal with our development services department on a on a daily basis.'",
        "'speaker_7': 'I think that is a.'",
        "'speaker_0': 'An.'",
        "'speaker_7': 'Important element. Thank you. Thank you.'",
        "'speaker_0': 'Next up becomes one person. There is no public comment, but Councilman Price.'",
        "'speaker_1': 'Oh, thank you, Mr. Mayor. I think this is a fantastic item. I'm happy to support it. I do have in doing a little bit of research on the shot clock practices and legislation and in other.'",
        "'speaker_4': 'Parts of the country. One of the things that that I saw is that.'",
        "'speaker_1': 'Making sure that we have enough time and a.'",
        "'speaker_4': 'Process, a meaningful process from public input, I think is going to be important because that's one of the criticisms.'",
        "'speaker_1': 'Of other shot shot clock bills that.'",
        "'speaker_4': 'I that I've seen and read about. I think that's really important. So I'm.'",
        "'speaker_1': 'Hoping staff stays.'",
        "'speaker_4': 'Mindful of that.'",
        "'speaker_1': 'And also allowing staff to still.'",
        "'speaker_4': 'Have the opportunity to make meaningful changes and provide adequate oversight, I think is critical. Again, these are some and this is an area.'",
        "'speaker_1': 'Where we can really adopt some best practices.'",
        "'speaker_4': 'From unfortunate lessons learned in other jurisdictions.'",
        "'speaker_1': 'And I just want to make sure that moving forward, staff is mindful.'",
        "'speaker_4': 'Of some of those best practices and that's incorporated into whatever comes back to us.'",
        "'speaker_1': 'So that's kind of where I wanted to start my comments.'",
        "'speaker_4': 'I wanted to acknowledge our development services and our planning staff. I mean, they have done a tremendous job and just.'",
        "'speaker_1': 'Even in the short time that we really the city.'",
        "'speaker_4': 'Manager, has really put a focus on this, I've seen a major improvement.'",
        "'speaker_1': 'Too, to see that our response rates and our turnaround times have.'",
        "'speaker_4': 'Improved such that where we're on par with a lot of the other cities that were cited this evening and cities with within the region I think is very helpful and it shows just tremendous progress by our development services and planning team.'",
        "'speaker_4': 'So I want to thank.'",
        "'speaker_1': 'Oscar and Christopher really for their.'",
        "'speaker_4': 'Efforts in that regard.'",
        "'speaker_1': 'But but I'm wondering.'",
        "'speaker_4': 'You know, we've gone through the process of streamlining hiring and expediting our hiring process. You know, to what extent have those.'",
        "'speaker_1': 'Changes in our.'",
        "'speaker_4': 'Operations in the city changed our process? And has it been more efficient?'",
        "'speaker_1': 'Are we operating efficiently in terms of our.'",
        "'speaker_4': 'Hiring process so that we can get these positions filled? And maybe that's a question for the city manager.'",
        "'speaker_3': 'So yes, I do feel like some of the improvements that we've made have helped here. For example, this is one we elevated very quickly with civil service. They put it the test ahead of others, which they have been doing now for us when we see a critical vacancy.'",
        "'speaker_3': 'And they created what Oscar mentioned, open, continuous, so that they're not just opening it for two weeks and then it's whoever's on the list. It actually, if we find someone tomorrow who wants to sign up to be a permit tech, we they can get on the list do the qualifications and we can pull from that.'",
        "'speaker_3': 'So that certainly has been one. And on the other end, as we hire, we've been streamlining a lot of what it takes to go through occupational health and to bring them on board. That is going even faster. And we're looking at some additional improvements there to make that go quicker.'",
        "'speaker_3': 'There are certain things that you don't have control over, like, you know, a live scan and some of those where you have to rely on some of the other agencies for background checks. But the ones that we have control that we've made some progress on.'",
        "'speaker_1': 'Okay. Great. Thank you. I don't have any additional questions. Mr. Mayor. Thank.'",
        "'speaker_0': 'Councilwoman. Councilman. Mongo.'",
        "'speaker_8': 'Thank you. Councilwoman Pryce reminded me of something that I had read about one other jurisdiction, and I thought it'd be appropriate to ask. The vice mayor if he had that intent, because that would be something I'd like to learn more about.'",
        "'speaker_8': 'When you talk about a shot clock, that would be a timeline. And typically when the shot clock is reached in basketball, you then lose the ball. And then in your mind, would that mean that it's an automatic approval?'",
        "'speaker_7': 'No. I've had good conversations with staff about there's a lot of ways to get there. And I wanted to kind of close out some of those comments, though, so I'll explain a little bit further when I'm queued up next.'",
        "'speaker_8': 'Okay. I think it's critical to know that because I could not be supportive of a process that would allow for projects that have not gone through proper approvals and requirements to make it to completion. So I think that the health and safety of the community and their neighbors is just critical.'",
        "'speaker_8': 'So as long as it's more in alignment with the dashboards and transparency that this council unanimously supported in 2016, with you on the committee at the time as vice chair, I think that we can continue and I know that Ms..'",
        "'speaker_8': 'Eriksson, with technology and innovation, is supportive of continuing down that path, though we all know it's taken a little bit longer than we had hoped. I know we can get there together. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you. I want to I want to just thank all the council members for their colleagues, for their comments. You know, as we started off with this presentation, we want to lift up our staff. We want to support our staff.'",
        "'speaker_7': 'You guys have done an incredible job. I see it. We deal with habitability issues in my district. We're doing development in my district. I hear it. I see how hard you work, how hard it's been to get development going in certain areas of town.'",
        "'speaker_7': 'So. You know, from things like a plan. We want to be in a place where implementing those things now. And that's why it's important to have this the system in place. A few things. There's there's a few things we're asking for here.'",
        "'speaker_7': 'I think the city council is really lifted up. Hiring is important. We want to see what you've done. We want to see what you can do next. The idea that council the friendly by councilmember mongo. I think it's a great idea if there is other tools be created the software.'",
        "'speaker_7': 'There wasn't a lot of discussion by the council but I know how significant the software and how expensive this could be. We want you to come back and provide those options. I think big think about having a best in class software system.'",
        "'speaker_7': 'That's what we want you to come back and put us in a position to support you and do. And in terms of the shot clock. I've been really clear with staff. What we want here is transparency, accountability. Now, at the end of the shot clock, again, something, something, something happens, right?'",
        "'speaker_7': 'There's already under certain laws and affordable housing is already a shot clock. Now, I'm not asking to add additional penalties. This isn't about being punitive. This is about understanding how we are meeting our commitment to the public. Are we?'",
        "'speaker_7': 'Are we meeting the shot clock? Are we beating the buzzer? Right. Are we constantly delayed in that shot clock? So there's so many ways to achieve it. The idea is the software can really open up the playbook for us in terms of having a shot clock and understanding what our commitment is to the public.'",
        "'speaker_7': 'So thank you to the city council. Thank you to the staff. Thank you to the again, to the machinists, the Building Industry Association, the Southern California Association, our private housing and L.A. County Business Federation for speaking up and supporting us.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. I just wanted to just to close. I want to thank Mr. Orsi and just the whole team at Development Services and Planning. I think you guys have really done a great job under a very difficult year.'",
        "'speaker_0': 'So I just want to thank you and the team. And I personally want to just also think I know I have encountered a couple instances with neighbors or folks, a couple of folks that stopped me on the street and have been waiting on a permit or have had some concerns.'",
        "'speaker_0': 'And you've addressed those very quickly. And when I brought those to the department's attention. So I just appreciate you for for doing that as well. And I want to also just note and I think I know Mr. Modica, you and I talked about this or have been talking about this as well.'",
        "'speaker_0': 'As a as a snapshot as where we are today. We are are we close or fairly close to being cut up as far as the amount of time it takes for processing as we were pre-pandemic? I think we're pretty close.'",
        "'speaker_0': 'Is that right?'",
        "'speaker_3': 'We're pretty close, especially on the stuff that really is kind of the smaller the minor ones. Those were taking weeks. They're now taking 1 to 2 days. One thing we didn't talk about here that I do want to add and I want to hear what Oscar has to say, though, is we changed the system completely when we'",
        "'speaker_3': 'send it went home. We went from a very efficient system where you touch every single city department all in one day on one visit to having to now interact virtually with dozens of different people in different areas that couldn't see each other.'",
        "'speaker_3': 'And it was all done on email instead of over, you know, in person. And that had a very significant impact on our efficiency. And so now getting that back open and as you heard, Oscar bringing more people in and being able to get even more services, indoor permit counter is really going to help.'",
        "'speaker_3': 'Oscar, can you talk a little bit about where we are just in terms of being caught up?'",
        "'speaker_0': 'Yes, thank you. Mr. Motorcar Monaco. As you pointed out, we had to pivot as we shut down and shuttered our city hall. We went from a largely in-person service to a digital process. And it's not necessarily the most conducive way to conduct business, especially when you rely on on the development community to provide the information that we'",
        "'speaker_0': 'need to process it so that when you don't have that and now you're spending most of your time, whether it's through emails or through phone calls, it's not the most efficient way. So technology will help and be able to control that and regulate that and hold both parties accountable.'",
        "'speaker_0': 'Councilmember Mongo, you mentioned what what shot clock ideas would be, things like being able to to not accept incomplete applications. We've done that as a courtesy to expedite the services, but then we find ourselves on the back end, waiting for weeks for folks to to respond to those, to those efforts.'",
        "'speaker_0': 'So having staffing, having the tech will allow us to effectuate a shot clock type program. But, but, but as I mentioned in my presentation or in my in my discussion points, we are caught up in some of those cities that were referenced tonight.'",
        "'speaker_0': 'We are within their ranges and the only improvement we need on our on our LA, our large projects and we have we have seen development activity continue even during during this this pandemic and coming out of the pandemic.'",
        "'speaker_0': 'So and we're making, again, great strides in getting those. But our timelines have been cut down to what used to be eight weeks to one week, what used to be several days to return a phone call to a day or two.'",
        "'speaker_0': 'And we'll continue to do that. And and this effort, this program will just help us be kind of the leader among those communities that we that we identify today and throughout southern California. Thank you. I appreciate that. I think also I want to just note that throughout the the, you know, 15 months, 14 months of the pandemic'",
        "'speaker_0': 'development has continued to boom across the city. Projects happening at every scale, housing, affordable housing projects, large market rate development, retail development. And I just want to commend also all of you for just continuing to shepherd all those projects through.'",
        "'speaker_0': 'It has been a huge task. And in fact, in talking to a lot of mayors and other cities, we have not seen there have been some slowdowns in other places. And I feel I'm from a large project perspective that you guys have done a really great job of just maintaining those and moving those forward.'",
        "'speaker_0': 'I do I do agree that losing a big chunk of our workforce like we did and changing the whole system like you all had to do, it did cause absolute disruptions for particularly, you know, folks who were just trying to do additions to their home or smaller changes to within their own neighborhoods.'",
        "'speaker_0': 'And so I think that's that's absolutely correct. And I think that our planning and our development department, just like it was impacted, just like public works and or trash pickup was impacted, just like fire service was impacted, just like our hospitals were impacted.'",
        "'speaker_0': 'I think that all of our departments were impacted in a very in a very real way because of the pandemic. And so, again, just to you and your team, I think you've done a great job. And I want to just note, I don't I and correct me if my date's wrong, but I think we we we implemented'",
        "'speaker_0': 'the new plan check system just like two years ago. Wasn't that like two years ago? Yes, it's a recent implementation and I know that that and so we've it's it's that's been a huge benefit to to the planning process, an enormous change.'",
        "'speaker_0': 'And so that software and that system is just two years old, correct? Correct. And Mayor, just wanted to let you know that the developer community has not taking advantage of that EA plan software like we wanted them to.'",
        "'speaker_0': 'So we are trying to revisit the EA plans offered as well as our in for permitting system. They work they both work in concert to improve efficiencies and to upgrade our technology, including our E plan. We had a multiple phased a plan process.'",
        "'speaker_0': 'The most current one that implemented the online portal was a couple of years ago because I know we've had some folks use the plan process, but you're saying that we need to do a better job also of getting it out there and promoting it and making sure people know about it, correct?'",
        "'speaker_0': 'Correct. And we have been but it's just the community is typically likes to stick with the traditional process. Right. Right now, I think. Definitely understand. So thank you. Look, look, I think we all look forward to being fully staffed up and opening up the counters fully in city hall and letting folks come back up to do the'",
        "'speaker_0': 'planning. I want to make one more note. I think that the ability and you said it to Mr. Modica, and I think it's critical, the ability for staff to be in the same room. And to be able to share plans with each other or to walk across the hall and get get a plan checked or walk over'",
        "'speaker_0': 'to an engineer or walk over to the traffic department or to sustainability department and be able to collaboratively work on a project was dramatically hindered in during that year. And I think that we should and I think we have learned a lot of lessons.'",
        "'speaker_0': 'We have to be prepared for how we would how we would operate in the future if we were to have to have this type of closure in the future, which hopefully will never happen again anytime soon. But I think we we learned a lot of lessons on that because that back and forth is really critical.'",
        "'speaker_0': 'So thank you for getting things back to almost where they were pre-pandemic and will continue to make real improvements. So I appreciate all of your work. Councilman Mongo.'",
        "'speaker_8': 'Thank you. I appreciate you giving me an opportunity. Once again, I take a lot of ownership of this. This is something I've always been very passionate about. I want to kind of just say two additional things. Some of the bigger projects that I know are coming or have come, and a lot of the bigger developers from housing'",
        "'speaker_8': 'on Norwalk to the Amazon 360 or fresh or whatever it's called now in spring to the senior facility that is going through a process to globe master plan. I'm working with people that work in a lot of cities, and despite what we've had as a challenge, I will tell you that they consistently say that we are.'",
        "'speaker_8': 'The cream of the crop staff to work with. I know that occasionally a staff member might have a bad day, but on the whole, working with you and your team, I get rave reviews all the time, so I just want you to hear that again.'",
        "'speaker_8': 'And then in talking about some of the things that Ms.. Ericsson and I and quite honestly, her predecessor and I discussed related to these systems, there are a lot of tools. A lot of you talked about the pausing of the permit process when you accept incomplete documents.'",
        "'speaker_8': 'And you and I have had a lot of talks about this in the last two years because I got a complaint that no one's gotten back to them. And there was one email that let them know that X, Y and Z is missing and no one's responded.'",
        "'speaker_8': 'And so I really love some of the systems that that technology and innovation and I have discussed, which really have like a couple of major components to them. One is that you can get multiple approvals from multiple division simultaneously when a plan is at a certain phase.'",
        "'speaker_8': 'And that really gives you that online one stop shop that I know that you guys are striving for. And so I want the community to hear that that's in the works like long before today in this meeting, but that you guys have really been thinking about the developers and what they need.'",
        "'speaker_8': 'And then secondarily, when a plan is paused because of a change need or an issue or a request that there is a drip notice of notifications to all members emailed, which means that it says today your plan check has been put on hold because you are missing A, B and C.'",
        "'speaker_8': 'It has been three days since your plan check has been put on hold because you're missing an agency. It has been five days since your and that is an automatic in the system that doesn't take staff resources and really continues to put it back on the staff of the companies that are coming to the city and asking'",
        "'speaker_8': 'for that help so that they are reminded because often these architects, engineers, developers, they have 70 different projects in 30 different cities and they don't always remember and they forgot about a set of emails that came from our office.'",
        "'speaker_8': 'And so I just want to thank you again for that. And I know one of our council members asked this question as a series of questions, and they did it so politely that there wasn't an actual direct response.'",
        "'speaker_8': 'But I've heard some of the rates of our competitor cities. Is there anything you want to comment about the the variance of those rates and what we're really talking about? Or the cost. I'm sorry for the the pay to staff in other cities versus ours.'",
        "'speaker_8': 'Cause I just don't think people know.'",
        "'speaker_0': 'I think we're going to have to get back to you one time. Once we get that.'",
        "'speaker_8': 'I've heard in some cities it's double digits.'",
        "'speaker_0': 'Yeah. Some of them police staff have gone outside the organization for four or $5 and up for the same position.'",
        "'speaker_8': 'Yeah, significantly more worth a move and into areas of Southern California that have a significantly lower cost of living. And I think that that's important to recognize. And I appreciate our staff that stick with us, train and retain.'",
        "'speaker_8': 'That's my motto. And I appreciate you and and the staff that have been with us for the long haul. Note that you will be rewarded. Thank you.'",
        "'speaker_0': 'Thank you. There's a there's a motion in a second. Please cast your vote to call.'"
    ],
    "Recommendation to request City Manager, or designee, to work with all appropriate departments to report back to the City Council in 60 days on a security and safety program that can be implemented to improve safety conditions for street vendors operating in our city.": [
        "'speaker_1': 'District one, District two, high district three. I. District four. District five. Yes. District six. District seven. District eight. District nine. All right, Ocean Cares.'",
        "'speaker_0': 'Thank you. 24, please.'",
        "'speaker_1': 'Communication from Councilwoman Sara, Councilwoman Zendejas, Councilwoman and Vice Mayor Richardson. Recommendation to request city manager to report back in 60 days on a security and safety program that can be implemented to improve safety conditions for street vendors.'",
        "'speaker_0': 'Thank you. Can I get a motion, please? Can I get a second? Councilman Ciro.'",
        "'speaker_1': 'Thank you, Mayor. So I want to thank Vice Mayor Richardson and council members in Dallas and Councilmember Allen for their support on this item. The street vendors represent some of the community's smallest local business owners and make up some of the most vulnerable members of our community.'",
        "'speaker_1': 'Vendors are typically low income, elderly and undocumented migrant workers. These are people who have been particularly economically vulnerable in the pandemic, often operating on slim margins. But they are also a vital and integral part of this community. The violence street vendor have experience recently is the result of a system that has not invested in them, their business'",
        "'speaker_1': 'and their families. Their vital role in our community and economy provides many of our low income residents with quick and easy food access. These entrepreneurs are not only supporting themselves, but their families with their daily earnings from their pushcarts and mobile stalls.'",
        "'speaker_1': 'Vendors are put at greater risk due to the fact that they are often alone and may be handling a large amount of cash. So we must protect these members of our community from robbery and physical attacks that have risen against them in recent years and the past year.'",
        "'speaker_1': 'We should support these vulnerable workers who are trying to make an honest living and support their families. So Security and Safety program is requested to provide protect these street vendors through crime prevention and economic development strategies that include but not limited to some of the following.'",
        "'speaker_1': 'And have an overview of street vending laws in California and Long Beach strategies to decrease robbery by eliminating cash exchange through assistance and support to use online and alternative non-cash transaction signage program that indicate the vendor does not possess cash and support for vendors from the Long Beach Recovery Act, protect their business with their security cameras and'",
        "'speaker_1': 'other potential tools they can use. Information on how they can report crime safely. As always, information on the Long Beach value acts and the protection in place for undocumented residents when they're interacting with the Long Beach Police Department.'",
        "'speaker_1': 'And so that that concludes my comment on this item. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Allen.'",
        "'speaker_1': 'Thank you, Mayor. I want to start by recognizing Councilwoman Sara for bringing this item in, Councilwoman. I think it's an important item, and it has the potential to impact so many vendors in our city. I personally just love the street vendors, especially all the fruit carts I see around town.'",
        "'speaker_1': 'They are just an important part of our community and unfortunately lately there has been a string of attacks and violence against our street vendors and we need to take all the steps necessary to protect them. The initial direction that Councilwoman Sara provided is excellent.'",
        "'speaker_1': 'And particularly with respect to exploring paperless transactions because they do carry so much cash and how they can safely report these incidents. I look forward to seeing the full report back in 60 days. Thank you.'",
        "'speaker_0': 'Thank you. Councilman's in Dallas.'",
        "'speaker_5': 'Thank you. Thank you. Thank you so much to Councilwoman Sara for this item. I'm very happy to see this item. Thank you, Councilwoman Allen and Vice Mayor Richardson for also supporting this item. Instances of robbery, assault and harassment towards our street vendors are not new.'",
        "'speaker_5': 'What has changed is, is more of these cases are being recorded and shared on social media. And and that, I speculate, has helped encourage more street vendors to make police reports when they are otherwise when otherwise they would not do so.'",
        "'speaker_5': 'And talking to our street vendors and listening to these stories of harassment and simply put disrespect hurts my heart because they are such hardworking individuals and have so much integrity and they're such a big part of our Long Beach community and they deserve respect.'",
        "'speaker_5': 'Two of my residents have been victims of of this, and that's Mr. Fernandez and most recently, Mr. Elliott. I'm hoping that this item will send a clear message to all of our street vendors that not only are they welcome in our own city and their own city, but they are valued by our own city as well.'",
        "'speaker_5': 'I also really love this item that it emphasizes on making information about Long Beach values more accessible so that people know. That they're there. That there are protections in place for undocumented residents when when interacting with our Long Beach Police Department.'",
        "'speaker_5': 'So that will hopefully also take away some of those fears that discourage people from reporting such cases to the police. Moving forward. I also wanted to share that our community based organization, Centro Cha, has responded to the assaults and robberies of these two Long Beach street vendors who had been assaulted in recent times with they've helped them'",
        "'speaker_5': 'with legal services, rapid recovery assistance. That includes the following assistance. Victim assist victims to obtain. I'll be the police reports. They assist vendors and their families to navigate and complete the victims of crime application for medical and trauma.'",
        "'speaker_5': 'On top of this central charm maintains their commitment to serve our undocumented community and street vendor community through the following resources of emergency rental assistance, brochure, gift cards, small Business Development Assistance, Free Immigration Legal Services, and ongoing case management services.'",
        "'speaker_5': 'I'm so, so very thankful again for this item. I think that we owe it to these these very vulnerable street vendors to let them know that they are protected. So, again, thank you, council woman. So for bringing this item forward.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you. Thank you to my colleagues, Councilwoman Sorrell, for taking the lead on this. This item. I think what's most important about this item that acknowledges the humanity and dignity of all of these people who are valued members of our community.'",
        "'speaker_7': 'And the reality is, when violence happens and violence takes place against street vendors, it tears in tears at the very fabric of our communities. And it doesn't stop there. It plays on the social media. We hear about it at church.'",
        "'speaker_7': 'We hear it about it. We hear about it. Our neighborhood associations. It creates tension within our communities. And we need to acknowledge this at the highest levels of our city. And we need to deploy resources and strategies to make sure that that, number one, we value the members, every member of our community.'",
        "'speaker_7': 'And two, that we can't allow these things to just continue to happen without a response from our city. And so thank you so much for your leadership on this. And it's incredibly important that I'm proud to sign on.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Sara.'",
        "'speaker_1': 'Yeah. I was just wondering where we can go to public comments and and I would like to provide a comment afterwards.'",
        "'speaker_0': 'Yes. Let's go to public comment. I'm quick. Thank you.'",
        "'speaker_3': 'Our first speaker is an Burdette. And Burdette.'",
        "'speaker_4': 'Hi, Mr. Mayor. And Councilmembers. This is an Burdette resident of District seven, also a member of Long Beach Clergy and Laity United for Economic Justice. I want to thank the council members for excuse me who have co-sponsored item 24.'",
        "'speaker_4': 'Only a couple of you on this panel are from my generation, but when we were kids, we strained our ears listening for that ice cream man or Helms Bakery truck. And these were the street vendors of our day, and they sold their donuts and their cream circles directly to us.'",
        "'speaker_4': 'So they were such an important part of the life of the community. They made our lives better. They made them easier, often tastier. But now on my street, I look forward to the bell of the police, the man on his bicycle or the fruit vendor with his cart.'",
        "'speaker_4': 'They remind me that a community thrives with all kinds of economic activity, and we don't always have to get into a car and pollute the air and clog the streets to get quality produce or ice cream. So now we see our community members, local street vendors, under attack from racist hate crimes.'",
        "'speaker_4': 'Recently, two longtime residents were assaulted and received very little support from law enforcement. They are being attacked by people who are encouraged to fear and disrespect others. So as a city, we need to respond to these crimes with clear civic support.'",
        "'speaker_4': 'For these street vendors that make our city international. I'm a Long Beach native. I strongly support any protections that Item 24 can give our street vending entrepreneurs. Please vote yes on item 24 tonight and help Long Beach live up to the purpose of the California State Safe Sidewalk Vending Act and our own local statutes and really promote'",
        "'speaker_4': 'the health and safety of our community. I think we're only going to recover as a city economically and morally if we just protect each other. Thank you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Our next speaker is Jessica Quintana.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_4': 'Eric Garcia, members of the city council. I also want to thank council member Sally Sara and our vice mayor, Rick Richardson, Mary and their husband, Sandy Allen, for bringing this forward. This is definitely long overdue. Sensitized in full support of item 24, we have experienced firsthand hardship and the trauma of these benders in our community.'",
        "'speaker_4': 'It's just only recent that we've learned of the assault, but this has been ongoing for a very long time because vendors don't come forward. They fear.'",
        "'speaker_1': 'For their status.'",
        "'speaker_4': 'And their fear of police and the local government. They won't go through with testifying against perpetrators who have assaulted them. Unfortunately, these you know, these cowardly assaults and robberies on immigrant vendors have a long lasting trauma effects on them, their wives, their children and the neighborhood that they live in.'",
        "'speaker_4': 'Their well-being and healthy lives have been impacted for for a very long time. You know, they cringe when they hear loud noises at night. You know, the wife tells.'",
        "'speaker_1': 'Of how.'",
        "'speaker_4': 'Their their husbands are jumping in their sleep because their child, you know, because of our experience of working with immigrants, have a trusting relationship with their community and have the ability to be able to rapidly respond to the needs of these offenders.'",
        "'speaker_4': 'As you know, they are not eligible for a lot of government support and help. And through our donations and community foundations, we've been able to respond to these vendors who lost their earnings and pay for their rent and provide them with food security and get back on their feet and being able to help them navigate the system'",
        "'speaker_4': 'of victims of crime. If anybody has ever tried to navigate that, it is a hard, hard system to to apply for these services so vendors and their families can get counseling and get their medical needs and bills. Wait.'",
        "'speaker_4': 'It's a long process, and the process starts first with getting the police report. And so that sometimes is very hard for them to navigate as well, too. So, you know, it's important that as we look at this initiative and, you know, we started discussions that the vendors are included in the discussion.'",
        "'speaker_4': 'And when we're talking about their cards and.'",
        "'speaker_1': 'Cash and money.'",
        "'speaker_4': 'Making sure that, you know, we're listening to them is what's going to work for them. And then also that we're inviting immigrant service organizations to help with some of the solutions as well to, you know, it's important, just like the speaker said before, that.'",
        "'speaker_1': 'We continue to help.'",
        "'speaker_3': 'Thank you. Our next speaker is Robin Cortez.'",
        "'speaker_4': 'Good evening, Honorable Mayor and City Council. I'm Robin Cortez. I live with my husband and my two young boys over in the third district. And I'm here tonight to advocate for greater protection of our street vendors. And Councilman, woman follows agenda item number 24.'",
        "'speaker_4': 'And really just echo much of what's already been said this evening. I think that we would all agree that one of the best things about Long Beach is its people. The diverse, hardworking community of Long Beach essentially is human throughout all of its unique districts are part of what makes this incredible city stand apart from others.'",
        "'speaker_4': 'Our wonderful street vendors are such an important part of this beautiful community. The growing impact on our beloved street vendors has been alarming to me, to say the least. It is time, I believe, for us to really stand up for these valuable members of our community and ensure that they are protected and supported with dignity as they'",
        "'speaker_4': 'work to simply make a living. I would just simply ask the council this evening to support the security and safety program. I'd really like a clear message to be sent that we stand in solidarity with our street vendors and we don't condone any degree of violence toward them.'",
        "'speaker_4': 'And I'd really like to leave this evening knowing that our city's leaders are collectively committed to preventing crimes against these vulnerable people. I'm very grateful this evening for your vote in favor of this agenda item. Thank you.'",
        "'speaker_3': 'Thank you. Our next speaker is Tito Rodriguez.'",
        "'speaker_4': 'Good evening, guys. Mayor Council members. My name is Tito Rodriguez. I am the executive director of Local Heart Foundation. I'm born and raised in District six. So all my life I grew up with street vendors stopping in front of my house and giving us the goodies, you know, like we've all had.'",
        "'speaker_4': 'Right? So I've dealt with about 400 street vendors through our nonprofit where we've protected, we've helped, you know, get them legal assistance from some similar to central PA. But as we've seen in the city of Long Beach, you know, it's increasing, right?'",
        "'speaker_4': 'We've seen it on social media and we've seen it on every news network there is. Right. So I want to give a huge, huge thank you to so far over the agenda item 24 for stepping up and in saying enough's enough, we need to protect our vendors.'",
        "'speaker_4': 'So I'm asking you guys to please, please do something for our vendors. Out of all the vendors I've spoken to, they all want to pay their fair share in taxes. They all want to get committed. They've all they all want to get license.'",
        "'speaker_4': 'They just want to go out there and make an honest living. And with your guys with support and protection, you know, it would make things a lot easier for them. So I just want to give.'",
        "'speaker_0': 'You guys, you a, you know.'",
        "'speaker_4': 'A big hug, virtual hug for taking the time to hear us out. And hopefully, you know, this thing gets passed and you guys continue to do great things for for the people city of Long Beach. And, you know, I like to say the city of Palm Beach, if it takes us to say bus and you know what'",
        "'speaker_4': ', that would be greater for us. You know, me being from Palm Beach in Long Beach, being one of the first cities to step up and say, hey, we're we're willing to protect our street vendors and hopefully other cities follow.'",
        "'speaker_4': 'Okay, guys, so God bless you guys. Keep up the great work and thank you.'",
        "'speaker_3': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Thank you. Let me go back to Councilman Ciro.'",
        "'speaker_1': 'Thank you, Mayor. So I want to thank all of our committee members that made public comment and especially to Senator Char, as well as Local Hearts Foundation, who have done so much to support our street vendors prior to the pandemic and during the pandemic and the various philanthropic work and efforts to providing the services and support needed'",
        "'speaker_1': '. And I hope to count on my colleagues on their support for this item. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I want to comment that I stand with our street vendors. I think they're an important part of our community, and I think it's critical that they have a security and safety program in place that could be supportive.'",
        "'speaker_8': 'I think it's also important to note that the police department has experienced a 10 to $14 million cut in the last year. That includes a reduction of 51 police positions. And I'm interested in knowing from the city manager what departments he feels are appropriate to include in this.'",
        "'speaker_8': 'And if there would be funding to support it, I would be very supportive of funding to support this specifically if there was a way to link it into violence prevention and our our federal funding that just came in.'",
        "'speaker_8': 'But I think that to really be effective, we need to put our money where our mouth is.'",
        "'speaker_0': 'Is is there is that a question to the city?'",
        "'speaker_8': 'It was Mr. City Manager. What departments do you feel would be a part of this? She said appropriate departments. I think that usually comes upon you to determine what those are.'",
        "'speaker_3': 'Yes. So we think economic development is going to have a role in this. A number of these vendors can kind of qualify under some of our recovery programs. So we are looking for a funding source that could help police, not as much.'",
        "'speaker_3': 'They really don't get involved in street vendors. We went back and checked. They aren't, you know, out there issuing tickets or anything like that. But they will have a role in kind of explaining the Values Act. We also have business licensing and health because some of these do need a health permit, but they don't need a business'",
        "'speaker_3': 'license. We do need to be updating our ordinance at some point. It's a pretty big undertaking to do that. So our audience is a little bit inconsistent with state law and therefore there's parts of our ordinances that we are not enforcing because they're in conflict with state law.'",
        "'speaker_3': 'But that is also what the city attorney's office, something that's going to have to be done.'",
        "'speaker_8': 'Thank you. I would just like to, again, give a little bit of additional praise to Councilman Zendejas for the program that she has implemented in partnership with the police department. That I feel has been completely effective. I've seen some statistics.'",
        "'speaker_8': 'I've heard from the community that it's been effective. And I don't know if expanding a component of that which which does include really a partnership with police in helping our community understand the resources available to them, the situational awareness, the design for safety and control that our police department has effectively utilized for our standing brick and mortar'",
        "'speaker_8': 'facilities, such as our liquor stores that have now had significant reductions in victimization. I think some of those things that have been proven to work should also be considered. So that would be my $0.02. Let's also use things that have worked.'",
        "'speaker_8': 'Thank you. Councilman, congratulations to both Councilman Zero and Councilman Zendejas and Allen.'",
        "'speaker_0': 'Not to mention De has.'",
        "'speaker_5': 'Thank you. Thank you, Mayor. Yes. One of the things that I was hoping that this would also fall under our Latino initiative and the recovery plan that we have and our anti-violence aspect of those two. I also wanted to give a big shout out to Tito Rodriguez, who is from the Hope Foundation, who has been just great'",
        "'speaker_5': 'and in supporting our street vendors. When one of my residents was assaulted, the most recent assault that happened, he sprung into action with with his organization and created an event where the whole community came out and supported the vendors that were assaulted and they had like a button buy them out kind of event and everybody was there'",
        "'speaker_5': 'and supporting this vendor. And it just was such a great energy to be there with the community. And I just want to thank them for the work that they do. And I really look forward to seeing this report come back and and working together with staff to make sure that we protect our street vendors.'",
        "'speaker_0': 'Thank you. I think it's been very clear tonight that Long Beach support for street vendors. I certainly do. And I've also been concerned with some of the reports and some of what I have also been been reading and seeing as relates to their safety and to ensuring that they feel welcome in this community.'",
        "'speaker_0': 'I've shared my my concerns and my hopes for for them feeling welcome and supported to our city leadership team over the last few weeks. But I'm really thankful that Councilman Sauro has brought this forward and really brought in the conversation around safety and support, particularly around.'",
        "'speaker_0': 'I love what you said, Councilman, about access to technology and to the, you know, the types of services and needs that would help them not just in their business, but also for their safety. So I really appreciate how thoughtful your legislation is that we have in front of us.'",
        "'speaker_0': 'So I just want to thank you for that. And of course, and a huge thank you to the community that has rallied around our our street vendors, particularly Centra Cha and so many others. That was also really, really great to see.'",
        "'speaker_0': 'So just a really excellent conversation and an excellent item to bring forward. So thank you. Roll call vote, please.'",
        "'speaker_1': 'District one i. District two, i. District three. I District four. All right. District five? Yes, District six. I. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. District nine. I. Ocean carries.'"
    ],
    "Recommendation to request City Manager establish a policy for the COVID-19 Emergency Rental Relief Program to determine eligibility for expedient processing and payment to residents who have been served with a notice of termination of tenancy, or eviction, including Notice to Vacate, Notice to Pay or Quit, or any other eviction notice. Further, request that City staff reach out to landlords who have issued eviction notices to advise them on the ability to apply for expedited processing and payment of back rent through this program.": [
        "'speaker_0': 'Thank you. We're going to do item 38, please.'",
        "'speaker_1': 'Item 38 Communication from Council Member Younger Councilwoman Zendejas. Councilwoman Sara. Vice Mayor Richardson. Recommendation to establish a policy for the COVID 19 Emergency Rental Relief Program to determine eligibility for expedient processing and payment to residents. And request that city staff reach out to landlords who have issued eviction notices to advise them on the ability to apply for'",
        "'speaker_1': 'expedited processing.'",
        "'speaker_0': 'Of a motion and a second count. Summary Oranga.'",
        "'speaker_2': 'Thank you, Mary. I want to thank my colleagues up close. A woman said there has sorrow and Vice Mayor Rick Richardson for joining me on this on this topic. COVID 19 has had a major negative impact on working families and led to the most significant economic downturn that has ever been seen in decades erode.'",
        "'speaker_2': 'State and local agencies have put together an economic recovery package that includes rent relief. However, in many cases, these payments are not coming soon enough. Because current evictions, the foreclosure protections expire on June 30th. Many of those who were hit hardest by the pandemic may be facing eviction or even homelessness in the coming months.'",
        "'speaker_2': 'That is why it is paramount importance that we identify and prioritize residents who are in immediate danger of eviction so that they can receive the support they need to stay in their homes. And I want to also note that many of the families that are affected by this, they have until June 30th.'",
        "'speaker_2': 'That's been the state deadline. We need to act quickly. And unfortunately, we're not meeting in the next couple of weeks. It is imperative that this this item pass. So I would appreciate the support of my colleagues. Thank you.'",
        "'speaker_7': 'Thank you, Councilman Urine. I'll offer my second here and simply say, I think we know that conditions are going to change if and when the eviction moratorium deadline is lifted. And I think this is smart. It allows staff the flexibility if there is an urgent situation and someone's going to they're in the pipeline and and something is'",
        "'speaker_7': 'about to happen. I think staff needs to be able to have the flexibility to do so. And I think the point here is simply just to keep people in their homes. And that's why we set up the program and that's what it is that we want we want accomplished.'",
        "'speaker_7': 'So I'm happy to support this here. I know that a portion of the funds we talked about and maybe, maybe this has already happened, but but this is city manager. Did we do the back rent? We set up a structure for people to apply for maximum back rent.'",
        "'speaker_7': 'Where are we with that? Is that already? Is that all that funding already gone out or is that still eligible under the funding that we have?'",
        "'speaker_3': 'Um. I believe what background is eligible. We are just getting underway with issuing payments. So we've got, if I remember the stats right, about 36 million or so of people have applications and then they go through a vetting process and they go through all the different federal requirements and state requirements.'",
        "'speaker_3': 'So we have been issuing checks just as of last week. I think about two or so million dollars went out the door. And I believe that back rent is a part of that within the within the parameters.'",
        "'speaker_7': 'Okay. I think this most closely aligns with the background portion of this, but I'm happy to support it.'",
        "'speaker_3': 'Thank you. So what we're looking here to do, just so I can clarify, is we're not changing any of the criteria. Those are all set in state and federal law. And Christopher is here. He can help me out if I say something incorrect.'",
        "'speaker_3': 'But we are expediting those who are in urgent need of being potentially evicted, that we will be processing their payments first so that we can kind of move them to the front of the line and make sure that they're eligible for those that meet the criteria.'",
        "'speaker_3': 'So, Christopher, anything like Mr. Toms?'",
        "'speaker_0': 'Absolutely correct. We don't have the ability of one or two to change any of the eligibility criteria, but we do have discretion and we want to help people. So if someone has an active eviction notice, they need to let us or the vendor know we'll take them out of order.'",
        "'speaker_0': 'We'll process that as expeditiously as we can. And the most important thing, though, is getting people to apply at all. We've done an amazing job to get people into this program, but there are still people that have not applied.'",
        "'speaker_0': 'We are in contact with your staffs all the time. We need your help to meet, to find those final people that have not yet applied and get them into this program. Thank you. Councilman's in the house.'",
        "'speaker_5': 'Thank you. Thank you very much to city staff. And thank you so much, Mr. Koontz. I know that you've been doing an incredible job on this, and I thank you and my residents. Thank you. This pandemic brought so much pain to so many families.'",
        "'speaker_5': 'It put many out of work and left people with no steady source of income to purchase food, pay bills, or even pay rent. As we come out of this pandemic, it is important to do our best to connect folks with the emergency resources available as the emergency COVID relief rental relief program that is meant to help families'",
        "'speaker_5': 'stay in their home. I want to thank Council member Wodonga Vice Mayor Van Richardson and Councilwoman Sorrell for supporting this item that calls for the rental relief application process to prioritize those who are on the verge of facing eviction.'",
        "'speaker_5': 'I also hope to continue seeking outreach and being contact seeking outreach that is being conducted citywide to ensure that folks receive access to information about this opportunity and are available to apply as soon as possible. As as you know, city staff, me and my staff are ready and and willing to reach out, do all the outreach we'",
        "'speaker_5': 'can, and also reach out to our and to our community based organizations who are out there every day with our trying to help our community and our residents with this particular aspect of rent relief. So thank you again very much.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. And I also want to say thank you to council and your ranga for bringing this item forward and to Vice Mayor Rex Richardson and Councilwoman Zendejas and Councilman Ciro for signing on to this very important item.'",
        "'speaker_1': 'This is this is this is very, very critical, especially with the state and the county protections that are set to expire on June 30th. It's vital that we take this action to protect both the tenants and landlords who have experienced financial loss due to COVID 19.'",
        "'speaker_1': 'And it's also important that we expedite this relief where it is needed. And I know I can tell you that my residents thank you for this item. So I'm happy to support this today.'",
        "'speaker_0': 'Thank you, Councilwoman Saru.'",
        "'speaker_1': 'Yes. I want to thank Councilmember Yanga for bringing this item forward and my colleagues, Vice Mayor Richardson and Councilwoman Sun. As for signing on. And, you know, I think my colleagues have shared so urgent that we do something as a city to protect our renters.'",
        "'speaker_1': 'And I want to thank development services for their amazing hard work and ensuring that we're getting the word out and assistance through the emergency rental assistance program. I just have a few questions. And with this is what currently is the turnaround time for processing and payment to residents?'",
        "'speaker_1': 'And the second question is what happens to residents while they're waiting for processing and payment? You know, if they applied prior to that June 30th, when the eviction moratorium ends, I won't know what happened to them while they're waiting for their payments to be processed.'",
        "'speaker_0': 'Sure. Thank you for the question, Councilmember. And similar to the discussion earlier tonight, you know, we accept applications in any level of completeness. So while it should only take about ten days to process an application, it has been taking much longer than that, a couple of months to process these applications because we'll be missing information from the'",
        "'speaker_0': 'tenant. They have to prove not just that they're in financial need, but that COVID was a triggering event. So they don't need to have covered themselves, but they worked in the service industry and lost their job as a result.'",
        "'speaker_0': 'Or there was some complicating factor tied back to the pandemic, and they have to establish their income and some different things for us. So we gather all of that information and then we need some information from the landlord and we reach out separately to make sure we accommodate that.'",
        "'speaker_0': 'So we need their W-9 tax information. We need to verify the amount of the lease. We contact the utilities to see if there's back utility payments. We put all of that together. We go through an audit process and then we issue a check.'",
        "'speaker_0': 'The tech goes to the landlord for the background. But the good news is, even though that can take some time to process, you know, step two after we receive an application is to contact the landlord. We're in the process of paying this outstanding amount, you know, and we want you to accept payment.'",
        "'speaker_0': 'So in the event that someone is behind you by facing an eviction, we'd be working with the landlord to let them know that that payment is forthcoming so that they would stop any proceedings. And 99.9% of the landlords are very accommodating.'",
        "'speaker_0': 'And we have a different procedure for if the landlord is not, you know, doesn't want to accept the payment or is not accommodating. And then as a last, last, last resort, we have a separate program that we cooperate with the county, which is a right to counsel program, which does provide legal counsel to the tenant to dispute'",
        "'speaker_0': 'the eviction if that should become necessary. And the vast, vast majority of cases, we're working cooperatively with the landlord, with the tenant, and that's not necessary. But that is available as a kind of backstop.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Brenda.'",
        "'speaker_2': 'Thank you. And I thank you, Mr. Koontz, for that explanation. I was going to ask a question about our our ability to work with landlords in implementing this program. And you were right on. Thank you very much.'",
        "'speaker_0': 'Any public comment on this item?'",
        "'speaker_1': 'There's no public comment on this item.'",
        "'speaker_0': 'Thank you. I think I've come from an and there's.'",
        "'speaker_5': 'Thank you, Mary. May I just have one quick question for our staff. Are we trying to one of the things that I think is deterring some of my residents from applying for this is may be the rigorous documentation that that needs to be filled.'",
        "'speaker_5': 'Is there a way that it can be simplified or can we look into possibly simplifying that process?'",
        "'speaker_0': 'Sure. Council Member So I really would encourage people to apply and provide what they can and then talk to us about what they can't provide. So I wish it was even simpler. We have to please in this program, both federal regulators and state regulators, both of whom have different ideas about how to make it simple.'",
        "'speaker_0': 'So it's not perfectly simple, but when a tenant is not able to provide a document. So, for example, oftentimes people maybe they don't file taxes or they just don't have a copy of a prior year tax return. There is a way to do a sworn declaration as to their income level.'",
        "'speaker_0': 'So we work with them. We they could submit the application online. They could call the hotline. We've been doing outreach events in person in your district and around. And in that case, we actually have staff, you know, help the individual fill out the application right there live.'",
        "'speaker_0': 'So we really are able to work through people's situations, including, you know, missing a document or not having something that we're requesting. But we do need them to take that first step of, you know, engaging with us and starting the application process.'",
        "'speaker_5': 'Thank you very much. Mr.. That makes me feel much better. Thank you. And thank you again for also working with our landlords who often get forgotten in this situation. And so thank you very much.'",
        "'speaker_0': 'Thank you. And that concludes the the agenda items. We will go ahead and do a roll call vote, please.'",
        "'speaker_1': 'District one. I'm District two. I'm District three. I District four i. District five I. District six I. District seven i. District eight District nine high rise.'"
    ],
    "Recommendation to receive and file a presentation on the implementation and launch of the Citys new public-facing calendar system.  (Citywide)": [
        "'speaker_0': 'Thank you. We are going to move on to item 26, please.'",
        "'speaker_1': 'Report from City Manager Recommendation to receive and file a presentation on the implementation and launch of the city's new public facing calendar system citywide.'",
        "'speaker_3': 'Mr. Mayor. Members of the council, we do have a presentation on this. This is a really exciting development that we've been putting into place, and it's ready to go live about how to really show a lot of the great events and meetings and ways to engage with government.'",
        "'speaker_3': 'This has been a big priority for this Council, especially through the Strategic Communications Plan, and I'd like to turn it over to Kevin Lee to walk us through the presentation. Thank you, Mr. America, honorable mayor and city council members.'",
        "'speaker_3': 'I'm happy to be here today to share with you an update regarding the city's new public facing calendar system. That's a launch in just a couple of weeks. As you are aware, the city launched a five year strategic communications plan in March 2020, just days before standing up the Joint Information Center for the COVID 19 Response, which'",
        "'speaker_3': 'is still in operation today. During the pandemic response, we were able to accomplish many things in the communications plan, one of them being the city calendar system. Now, with things opening up, this is the perfect time to launch the calendar.'",
        "'speaker_3': 'In the communications plan. The calendar is under the strategic focus area of local public engagement, with a goal of making a more well informed community and an objective of increasing awareness of city priorities. Projects, programs, initiatives, services, events and meetings.'",
        "'speaker_3': 'The current calendar we are replacing has some challenges. It's a legacy based calendar that the city migrated into the CMS in 2017 with the update to the city's website. So while it served its purpose at the time, it has some limitations.'",
        "'speaker_3': 'For instance, it lacks advanced functionality and limited filtering options. It's not that dynamic, interactive or shareable, and you're not able to receive notifications. Jump forward to the new calendar and you'll see so many benefits and enhancements for the public.'",
        "'speaker_3': 'There is a simplified homepage access, which I will talk about in a moment. New options and features. It's user friendly, very intuitive and dynamic. There is a refined navigation, an integrated notification options and advanced filtering options as well.'",
        "'speaker_3': 'And let me touch on language language access as well. People will be able to use Google Translate throughout the calendar as a quick way to get information in any language. However, we will also add a standard in language message on event pages that lets the community know that if they need more information in their language, they can'",
        "'speaker_3': 'reach out to the staff contact. Also there is a feature that allows community members to note they will require onsite interpretation at a meeting. Further, we will now have the ability to add characters in other languages, such as command directly into the calendar, which was impossible before.'",
        "'speaker_3': 'And for a staff, this calendar really had a customized look. We were able to still keep the look in certain departments like library services and development services while integrating the back end. And it's easier for staff to maintain.'",
        "'speaker_3': 'For instance, you can now enter a multiday event really easily, which before you were not able to do so. As you may be aware, under the current Events tab on the city website, there are two calendars, a special events, one and a meetings and notices one.'",
        "'speaker_3': 'This isn't necessary and can be confusing. With the new system, there will just be one department. Calendars are automatically integrated into this master calendar on the.'",
        "'speaker_2': 'Homepage.'",
        "'speaker_3': 'And basic structure and event details are provided upfront for the convenience of our community. And you can now navigate the calendar from home page or access the full calendar by clicking more events. With the new calendar. There are there are several views, all depending on how each individual would like to view the calendar.'",
        "'speaker_3': 'The eye catching tile of you. What you see here is the default for desktop. However, there are three additional views people can choose. The month and list views are a bit more traditional. And then there's a map view as well that allows you to see events on where they fall within the city on a map.'",
        "'speaker_3': 'This view is default for mobile to ensure an optimized experience. With the new calendar. There are also several ways to search for events and meetings. You can search by calendar name, for example parks or libraries, event type, for example, career workshop, community meeting, or even age based types as well.'",
        "'speaker_3': 'You word search. This is self-explanatory. But I do want to note that these key words don't have to be put in the back end by staff. The calendar is actually searching the contents and then proximity by zip code.'",
        "'speaker_3': 'If someone wants to know what's going on nearby then. The event page will now be full of features. Obviously there will be an event description and image and contact information will be required in case the community has additional questions.'",
        "'speaker_3': 'You will also be able to share directly to your social media pages and place right into your personal calendar. There is also a shareable QR code for each event. There's also an RSVP option as well. And within that option, a calendar administrator can include an option for a community member to sign up to speak at the event'",
        "'speaker_3': 'if there is a Q&A session. Also notable is the notification features. You will now be able to subscribe to a calendar or an event and receive notifications via text or email when a new event is added or if an existing event has updates.'",
        "'speaker_3': 'If you're really into it, you can sign up to receive notifications regarding all events and meetings in the city that are on this calendar. You can also customize when you receive notifications. For instance, if you can get noticed, you can get notifications upon each new event, or you can receive notifications on all events added in a week'",
        "'speaker_3': '. I want to call your attention to the fact that council members will be able to receive notifications when an event is added within your district. You'll likely already know that they are coming, but this can give you more details and also you'll be able to share these events as they pop up.'",
        "'speaker_3': 'Just some information on the administration. Oversight really falls in the Office of Public Affairs and Communications, which is my shop, and we'll make sure that the calendar is being used across the department and then also the Technology and Innovation Department.'",
        "'speaker_3': 'They'll be there to make sure that functioning properly, properly and for training. There are trained content authors in departments and legislative offices, and content is expected to be provided in full and follow the city calendar guidelines, which will be available on the city's intranet.'",
        "'speaker_3': 'What's next? We expect to launch the week of June 28. This gives departments time to populate their events on the new calendar. We will send out a press release. Social media across departments will integrate it into our Go Language newsletter, the city's on hold message, the city's homepage and all the this calendar is really intuitive.'",
        "'speaker_3': 'We are working on a how to video to help those along that might need a little extra information on how to use it. Before I close, I'd like to recognize Sal Rodriguez in the Technology and Innovation Department and Jonathan Garcia in our public affairs office for the excellent work they've done on this project.'",
        "'speaker_3': 'That concludes my presentation, and I'm here to respond to questions you may have.'",
        "'speaker_0': 'Thank you. I believe there is no we have no public comment for this item, so must go to the council. We have a motion by council and I'm going to second advisory. Richardson Councilman Mongo.'",
        "'speaker_8': 'Thank you so much. I have waited so long for this item to come back to council. When I first brought forward this idea to the city, it was unanimously supported but not funded, and it went in years where we continued to hear from the community.'",
        "'speaker_8': 'Request after request to know when things are and how to not schedule nonprofit fundraisers on top of citywide events, how to better coordinate resources, and to really have a central place where all postings were the unification of notification to constituents to be able to score.'",
        "'speaker_8': 'Subscribe to the things you want to know about. While we are in the infancy of rolling this out, the potential is endless. I want to thank Kevin for his relentless pursuit of this. The poor guy has had to have dozens of meetings with me going in and out of every component of this and what the public and'",
        "'speaker_8': 'the future with the public can see, how they can engage with it, and how they can really see what they want from the city through this process. I see this having endless potential in terms of not wanting it to be overcrowded, but to really be able to click on and click off anything.'",
        "'speaker_8': 'If you want to know when the Grand Prix is, every single Grand Prix for the next five years that we have a contract for should be on that calendar. Every Christmas parade, every event on piping, every event in uptown, every single thing could be here so that citywide resources are not stretched too far, but also so that'",
        "'speaker_8': 'nonprofits can coordinate better with us, so they can know when they can have access to a street fair or an event. And then furthermore, just the standardization of an ability to see when things are happening. When is enrollment for soccer?'",
        "'speaker_8': 'When is enrollment for our summer programs at the Nature Center? All of those dates are possible to be here in the future. It's just a matter of ensuring everything's in one place. Then, as a person who enters our city, as a young member of the community who's interested in work source opportunities, you can subscribe to those.'",
        "'speaker_8': 'Then, as you transition to a mom, you can look and sign up for the list related to enrollments for 3 to 5 year olds in Parks and Rec library. You don't have to go to the library website, then the Parks and Rec website and then the Nature Center website.'",
        "'speaker_8': 'It's all in one place for your convenience. I think this will really help constituents be more involved when we have citywide initiatives or policies, whether it's the land use element or short term rentals or any of those things, and community meetings are posted.'",
        "'speaker_8': 'You now can search for which community meeting makes the most sense to you and not rely upon council members individual emails. I often get calls I can't find the email that you sent out last month that had the date of the upcoming such and such meeting.'",
        "'speaker_8': 'Now there can always be a link to the citywide calendar that has all of these things. When bringing this item forward. I had a vision that really came to me through discussions with leaders in our city and leaders that continually struggled through an informal network where they would among themselves, whether it was a group of moms or'",
        "'speaker_8': 'a group of nonprofit leaders, work together to really keep their own calendar. And this will eliminate that. And it will also give instantaneous updates to anyone that subscribes to any particular event of a move. So when things change, when dates change, when things move, we'll be able to know and notify people appropriately.'",
        "'speaker_8': 'So I cannot tell you how excited I am for this. The future is endless. I love to see us get to a point where nonprofits who've gone through appropriate training and within certain limitations could also use the tool to engage the community on some of their more popular events, maybe even the convention center.'",
        "'speaker_8': 'Any convention that's open to the public. How great would it be if you're a Long Beach resident and you said, Hey, I didn't know we had the fishing convention. I'm into fishing. Not only did I sign up for the Fishing Derby at Eldorado Park, but I'm notified.'",
        "'speaker_8': 'Did you know of these other fishing events in our city? And then really take those warm leads for residents to be able to be involved in every aspect of our city. I really think this is a component of of the full integration of a 24 hour city hall.'",
        "'speaker_8': 'And I just cannot tell you how proud I am of our staff. It has not been an easy path, and I want to just say thank you from the bottom of my heart. I don't think you know how many people you're going to impact and their ability to be involved is just it's really, really life changing for'",
        "'speaker_8': 'for people, especially busy people and busy moms. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. I also want to say thank you to Mr. Lee for your presentation. This is an exciting idea, and I too have wanted a city calendar for so long. My staff attended one of your training sessions and they really appreciated the simplicity and the ease of the platform.'",
        "'speaker_1': 'Having one centralized calendar that is searchable and compatible with social media and other platforms is something that is really going to resonate with the public. So I really liked when you talked about all the notification features. I think that is really great.'",
        "'speaker_1': 'I know I'm definitely going to appreciate it. It's just a great tool for people to know what's going on in the city and all the great events that are happening. So I do have a question. How are you going about just getting the word out that we have this tool now?'",
        "'speaker_3': 'Yes. County Council Member So when we launch in a couple of weeks here, the week of the 28th, we will be sending a press release out on social media as well across our city department. So we'll make sure that every department starts pushing this information out.'",
        "'speaker_3': 'We'll be integrating into our newsletter and things like our on hold message at the city. And then we will also be working with we have a email list of community groups will be pushing it out through there as well, which reaches a lot of people in the community.'",
        "'speaker_1': 'Thank you very much. Just great work.'",
        "'speaker_0': 'Thank you. I think I'd passed over a vice mayor Richardson, who had the second, actually.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And, you know, I mean, this is this is incredible. I hope folks I hope folks use it because it can be tremendously impactful. You know, it's a big it's a big deal to do an integrated calendar publicly.'",
        "'speaker_7': 'I mean, it will make all of our jobs a lot easier. And one of those things, we're a big city, but we're really not all that big. We're kind of a small town and everyone wants to support everyone's events across the whole city.'",
        "'speaker_7': 'This is one tool to help make it happen. Councilman Mongo I remember it has been a long time. I remember when you brought this forward and we all talked about how useful it would be. And I think it shows sometimes how long it may take to get something done, but is just as exciting when it finally happens'",
        "'speaker_7': '. So thank you for your leadership in bringing this forward and bringing this forward. And and I look forward to making sure that our our, you know, all of our districts begin to engage with this citywide calendar so we can support each other's events.'",
        "'speaker_7': 'Thanks a lot.'",
        "'speaker_0': 'Thank you, Councilman. Sir.'",
        "'speaker_1': 'Thank you, Mayor. I also want to thank city staff Kevin and your team for working so hard on this and Councilmember Mongo for being such a strong advocate for a calendar that works for 24 hours and to be effective and efficient in the way that we coordinate our work.'",
        "'speaker_1': 'I am so excited about being able to subscribe to the calendar because I live like as Councilmember Mongo as a busy mom. I live off of my calendar. If I am, if it's not on my calendar, it's not in my you know, I'm not aware of what's happening or, you know, it's not on my radar to go'",
        "'speaker_1': 'to. So I appreciate so many of the features and function and are so excited that there will be an ability to access that in other languages as well, which is so crucial to ensuring that all members of our residents can access them and understand what's happening.'",
        "'speaker_1': 'And that I also have had a few of my staff already attend the training, which has been great so that, you know, I appreciate being on a council member coming in with this system set up so that we can best organize and also inform residents about this as well.'",
        "'speaker_1': 'So thank you so much.'",
        "'speaker_0': 'Thank you, counselor. Moms and dads.'",
        "'speaker_5': 'A huge thank you to to you, Kevin Lee. Mr. Kevin Lee, thank you so much. This is phenomenal. Thank you so much. Council member Mango for keeping added and pushing for something so amazing like this. Increasing the level of communication between our Long Beach community and our city is something that I am very, very passionate about.'",
        "'speaker_5': 'I think that tools like this and like this new calendar system offer us the amazing opportunity to do exactly that. And I know many of the residents have expressed interest in being more involved and receiving information about local events and volunteer opportunities.'",
        "'speaker_5': 'And I'm so happy that all of that information will will all be in this one place, in this calendar. So thank you. Thank you very much for your hard work, because I know it took a lot of hard work and a lot of years to actually develop something like this that we all can benefit from.'",
        "'speaker_5': 'But we are going to reap the benefits here on out and I'm just so excited. I can't wait for this to launch out and to launch and I am super excited to share this with all of my residents as well.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. The comments of my colleagues reminded me of a small thing that happened along the way. This item started so long ago that it was not common for you to receive a note from, let's say, your favorite sports team or your favorite Netflix series or whatever, where when they send you the email, you can click on'",
        "'speaker_8': 'it and it literally adds it to your own calendar. And whether it's something where we say, I want to see all the volunteer opportunities for park cleanups at the park near me, or I want to see all the low income resident workshops that help me fill out the forms I need to get up my feet, whatever those'",
        "'speaker_8': 'things are. I just want to give an additional thank you that though the path has been long and a long path along the way, the continued support of staff to make adjustments so that by the time that it was released, it wasn't already antiquated and out of date.'",
        "'speaker_8': 'And so thank you for that. And I just can't wait to see all these things pop up on my calendar that I can subscribe and unsubscribe to in the bottom. I'm just so excited for the things that this can do for our community.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. There's a motion and a second members. Oh, actually, I understand you have an announcement about Councilman Price.'",
        "'speaker_1': 'Yes. All council members currently participating in the meeting are in the council chamber. I will stop the the roll call vote and proceed with voting via vote cast for the remaining items.'",
        "'speaker_0': 'Thank you. Members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a Second Amendment to Exclusive Negotiation Agreement No. 35865 with Gundry Partners, LP, dba Howard CDM, for the continuation of negotiations in connection with the proposed development of the former Long Beach Armory, at 854 East Seventh Street.  (District 1)": [
        "'speaker_0': 'Great. Thank you. Next item, please.'",
        "'speaker_1': 'Item 27 Report from Economic Development. Recommendation to execute a Second Amendment to Exclusive Negotiation Agreement with Howard CDB for the continuation of negotiations in connection with the proposed development of the former Long Beach Armory at 854 East Seventh Street District one.'",
        "'speaker_0': 'Can have a second, please. Thank you, Mr. Modica. Just just briefly, because I'm I'm very personally very interested in this project. I think it's a phenomenal opportunity and we've been discussing it for for many years, and it seems to be in a very good place.'",
        "'speaker_0': 'Can you can Stafford provide a just a brief update on this?'",
        "'speaker_3': 'Yes, John Keisler. Honorable mayor and members of the city council. It's so good to see you. And I'm going to ask our deputy director, Sergio Ramirez, to give a short staff report about this amazing project. Thank you, John.'",
        "'speaker_3': 'Good evening, honorable mayor and council members. We have actually been working with Country Partners, a partnership between Howard Cdmo, Saint Anthony and Pacific six on the adaptive reuse of the former Armory Building, which would consist of the Adaptive Reuse Project and a new development component back in February entered into an inner with the developers and have been'",
        "'speaker_3': 'working with them. They are. We've been working on several items and have negotiations gone very well. They are actually applying for a state and for infrastructure grant and that's part of the grant and requires them to have additional time and staff is supportive of the extension and we will continue to work with them to hopefully bring forward'",
        "'speaker_3': 'to you a definitive project agreement. And that hopefully request.'",
        "'speaker_0': 'Support for this item. Thank you. Very supportive of this. I appreciate the update conference and discuss an article.'",
        "'speaker_5': 'Thank you, Mary. Thank you. Thank you so much to both John and Sergio who have been working really hard on this item. I'm I'm super excited to continue seeing the partnership with Howard CDM and so happy to know that the proposed development would be bringing in 100% affordable housing projects right here in in my district, in the'",
        "'speaker_5': 'first district. As I mentioned, finding creative ways to address our housing crisis and supporting affordable housing projects is altogether one of my greatest priorities as a councilwoman. So I'm so happy to be able to support this item. Thank you for all the hard work that has been put into this.'",
        "'speaker_5': 'And reviving the armory is just going to be something phenomenal, not just for the First District, but for the city as a home.'",
        "'speaker_0': 'Thank you, Councilwoman Councilor, for your comments.'",
        "'speaker_2': 'It's a great project. I support it wholeheartedly.'",
        "'speaker_0': 'And I don't believe there is public comment on this.'",
        "'speaker_1': 'Not on this item.'",
        "'speaker_0': 'Please cast your votes. What's coming up? There's a revolt. Thank you. Don't forget to vote, guys. Okay. Motion carries. Thank you. Next item, please. I am 30.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary documents and subsequent amendments, with Citizens Telecommunications Company of California, Inc., dba Frontier Communications (Frontier), to occupy, place, and maintain attachments on Frontier poles and use conduits for the purpose of extending telecommunication services to the Santa Fe Avenue Synchronization Enhancement Project, in an annual amount not to exceed $20,000, for a period of ten years.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. N 36, please.'",
        "'speaker_1': 'Report from technology and innovation. Recommendation to adopt a resolution to execute a contract with Frontier Communications, to occupy, place and maintain attachments on frontier poles for the purpose of extending telecommunication services to the Santa Fe Avenue Synchronization Enhancement Project and an annual amount not to exceed 20,000 citywide.'",
        "'speaker_0': 'The motion in a second with no public comment, but Councilman Mongo does have a question.'",
        "'speaker_8': 'Thank you. And I probably should have done it on 35 over 36, but I'm hoping that in the next several weeks we could also get an update on the citywide infrastructure upgrade that allows for fiber that kind of talks about bringing everyone within.'",
        "'speaker_8': 'The guidelines of connecting everyone. Everyone connected. Thank you.'",
        "'speaker_0': 'Thank you. Members, please cast your votes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a Consent Letter and a Project Specific Maintenance Agreement, and any other necessary documents required including subsequent amendments, with the State of California Department of Transportation (Caltrans), for access to Caltrans property to offer and provide social services, targeted maintenance, and relocation assistance to people experiencing homelessness, consistent with the business operations of the entity, for a one-year period, June 15, 2021 through June 14, 2022, with the option to renew for three additional one-year terms, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_0': 'You we're going to go back up now to item 30, please.'",
        "'speaker_1': 'A report from Health and Human Services and Public Works. Recommendation to execute a consent letter and a project specific maintenance agreement with Caltrans for access to Caltrans property to offer and provide social services, targeted maintenance and relocation assistance to people experiencing homelessness citywide.'",
        "'speaker_0': 'Thank you. I know we can have a short we can just get a short update. Mr. Morricone, this would be great.'",
        "'speaker_3': 'Yes, this has been something we've heard from the entire council mayor community about working better with Caltrans to get some enhanced maintenance. So it was an agenda item. It came to the council. We've really been working well with Caltrans.'",
        "'speaker_3': 'I hope you've seen some big improvements out there and this is the next step. So we've been working to actually take over some of those sections now that we have some additional resources in the Recovery Act and we're excited to be here tonight.'",
        "'speaker_3': 'We're going to be coming back later in July to really talk about cleanliness in the city and all the different efforts. So we can get more into it then. But I do want to give a a quick overview of what this item is.'",
        "'speaker_3': 'So, Diego.'",
        "'speaker_0': 'Good evening, everybody.'",
        "'speaker_7': 'It's nice to be out.'",
        "'speaker_0': 'And see everyone. I'm just going to take a couple of minutes to go over some of our our discussion about our agreements with Caltrans. So the project specific maintenance agreement that we are.'",
        "'speaker_7': 'Developing with.'",
        "'speaker_0': 'We've developed with Caltrans will allow us access to Caltrans property to offer and provide services, certain maintenance issues and connecting people experiencing homelessness to their.'",
        "'speaker_7': 'Services and housing.'",
        "'speaker_0': 'And this is set up for at least one year, and we're looking at extending it beyond that. Next slide, please. Public works in conjunction with the Health Department has been meeting with Caltrans BI monthly to discuss.'",
        "'speaker_3': 'Strategies.'",
        "'speaker_7': 'On how to improve the esthetics and appearance of freeway off ramps and on ramps in and out of city Long Beach locations.'",
        "'speaker_0': 'We selected the locations 22 different locations based on need and ease of access for staff to get in and do some cleanups and offer services.'",
        "'speaker_2': 'This will allow.'",
        "'speaker_7': 'Caltrans more time and resources to maintain.'",
        "'speaker_0': 'Other areas while we take care of these 22 areas. We'll be working with Caltrans for these cleanups for the next couple of years.'",
        "'speaker_7': 'Next slide, please.'",
        "'speaker_0': 'So as I said earlier, we've identified 22 locations throughout Long Beach in which the clean team will focus their efforts. And these locations, as I said earlier, were based on access, ease of.'",
        "'speaker_7': 'Access and ability to provide assistance.'",
        "'speaker_0': 'We are creating a flexible agreement. So if we identify other areas throughout our process or we find that.'",
        "'speaker_2': 'Maintaining these 22 areas becomes routine.'",
        "'speaker_7': 'And we have the capacity.'",
        "'speaker_0': 'To expand under the current funding.'",
        "'speaker_2': 'We would be able to do.'",
        "'speaker_7': 'That and we'll work.'",
        "'speaker_0': 'In conjunction and we expect to continue our regular.'",
        "'speaker_7': 'Meetings with Caltrans to address these issues.'",
        "'speaker_0': 'Next slide, please. So you can see here at these locations, a clean team will focus on a litter and debris removal, graffiti abatement and connecting people.'",
        "'speaker_7': 'Experiencing homelessness to services and housing.'",
        "'speaker_0': 'These particular pictures are from the Clean team's most recent clean up on Shoreline.'",
        "'speaker_7': 'Drive at the terminus of the 710 Freeway.'",
        "'speaker_0': 'Thank you very much. And we're here to answer any questions. Thank you very much. I'm going to turn this over to Councilman Mongo in just a minute. Is there any public comment on this item? I don't believe so.'",
        "'speaker_0': 'No public comment. Great. I just want to just just make two notes, I think. One just for the council. So they are aware we are going to be having a word with staff to schedule a fairly extensive study session on cleanliness and our Clean Language initiative as it relates to the entire city.'",
        "'speaker_0': 'I believe that's going to be July 13th. Is that right? Mr.. Mr.. MODICA Yes. And so at that meeting, we're going to get a pretty comprehensive report on not just the MEU as it relates to Caltrans, but all of the work that's happening around cleanliness, the additions of staff for clean teams, the deep cleaning that is happening'",
        "'speaker_0': 'across the city, the need for corridor cleaning and enhancements as well as of a large list of of initiatives that the council kind of voted to move forward on over the last few years, as they all relate to cleaning and ensuring that the city is really coming back from from the pandemic.'",
        "'speaker_0': 'We know that our our clean teams were one of the areas that really suffered as it relates to staffing during the pandemic. And at the same time, we also produced a lot more trash as a city. I believe we pulled, I think it was maybe 25% trash or something that I read that we're producing more, is that'",
        "'speaker_0': 'right? About 25% or am I giving the wrong number? It was about 27,000 tons is what it was. So we're producing a lot more trash and we normally had been as well. So that that did create a, you know, a very difficult challenge.'",
        "'speaker_0': 'And we're and I haven't begun to notice really a change in a difference. So so I just want to make sure everyone knows that that is on its way, that major report. And in addition not to be confused with the LA County, because I did want to make sure that to be clear, this MEU is with Caltrans'",
        "'speaker_0': '. There are other areas that are county spaces that we're also working right now on getting an MRU with L.A. County to address those areas. So I'm often asked, for example, about the 710 entrance to the city that is not city property, that is L.A. County.'",
        "'speaker_0': 'I'm also often asked about some areas actually out in District five, over in the eastern part of the city by neighbors pretty often. And those are also L.A. County, some of those areas. So as just as a reminder for the council, we will be also bringing forward and I know Mr. Monica and Mr. Lopez and the team'",
        "'speaker_0': 'are working right now on an L.A. County agreement also that's separate of this. But this is a, in my opinion, a really important step forward. I want to also add that Governor Newsom has put in his in his budget at our request, as if we were the first city to make the request to try to put money'",
        "'speaker_0': 'into the budget for his clean California campaign. And we led a coalition of mayors to get that into his budget. That is also in his budget. And so Caltrans is providing additional funding for some of these locations statewide.'",
        "'speaker_0': 'It's my assumption that we're going to be working with the governor's office and Caltrans to getting that funding for our Caltrans locations and others across across the city that they can focus on. Considering our city was the one that led the effort on that, I would expect that we would see some of that benefit along with all'",
        "'speaker_0': 'the other big cities. So I want to thank Mr. Lopez, just the whole team, for leading this effort. And so very, very, very positive development. Councilman Mongo.'",
        "'speaker_8': 'Thank you. I want to thank Diego and Mr. Lopez as well. If you could turn to slide three, please. I think they do it in the back when we I think they have.'",
        "'speaker_7': 'To do it in the back. If you can get us the second.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'Everyone knows how concerned I am with trash and public health and public safety and encampments and what they've done to parts of our city. And I have been meeting with not only our city staff, but county staff and Caltrans staff for as long as I can remember.'",
        "'speaker_8': 'My staff consistently meet with them. We work through graffiti cleanup. We work through encampment cleanups. And I. When I proposed the idea that we clean up for them and that they pay for it or pay us, pretty much.'",
        "'speaker_8': 'City staff laughed, and I was discouraged from bringing this council agenda item forward. And if not for the support of my colleagues, I cannot say that this item would be here today, because in in our meetings with Caltrans, depending on what division of Caltrans, we are very lucky to have great relationships.'",
        "'speaker_8': 'But this has never been done before. And the idea that it was even possible and I appreciate the nods was. We really had to change our frame of reference. And I think that a lot of this is possible because of some new collaborations and some funding that we had never had before.'",
        "'speaker_8': 'But but I want to say that I want to thank my staff and their persistence and the partnership with public works. Without which, this would not have been possible. And I can't wait to do it with more agencies and and get to a point where we can take ownership of any area that's within our boundaries, even though'",
        "'speaker_8': 'it is not our property. And I think that this is also true of some areas of our city. And I've heard Councilmember Austin make excellent comments about this in the past, about our absent landlords in the city as well, because trash does accumulate on their properties and we need to have a mechanism by which we can clean'",
        "'speaker_8': 'up and appropriately fund the bill when negligence has been made to ensure that we have the ability to keep our city looking its best and healthy for everyone. Encampments aren't healthy for anyone, and everyone knows if you've come to any of my homeless committee meetings that we provide the services and resources through outreach along the way.'",
        "'speaker_8': 'It's not that we're taking these people and just moving them along. We really do provide them opportunities and so we do it right. We are a model that is followed across this country and it is because of amazing people like the three of you, a Teresa, Tico, Eric You guys are fantastic and thank you for your leadership'",
        "'speaker_8': 'on this. Tom I know there was a lot of reluctance. The but I'm glad we got here and I see it happening more and more throughout the region that people want to do like us and be like us.'",
        "'speaker_8': 'So thank you.'",
        "'speaker_0': 'Thank you. I'm sorry that the next screen is. Vice Mayor Richardson, I think. Where's the screen?'",
        "'speaker_7': 'Durango.'",
        "'speaker_0': 'Yep. It's just. There you go, Councilman Ringo.'",
        "'speaker_2': 'Thank you, Mayor. And, you know, Councilmember Mongo, you can be so correct about all this. The seventh district is crisscrossed by two freeways. The 405 and 710, and a river runs right through it. So you got Caltrans on the freeways and then we had a county with the river.'",
        "'speaker_2': 'And so there's a lot of challenges that that I hope east in my district with residents who constantly see the the build up of encampments and the trash and the desire to want to have a clean city and a welcoming city.'",
        "'speaker_2': 'When you come in through our corridors to make sure that it's clean, I'm glad to hear, Mayor, that we're going to be having a study session on this coming up in July, because I think it's very important that we try to support our staff in trying to keep our cities clean.'",
        "'speaker_2': 'But more importantly, I think it's one of the things that we that is that is about Long Beach. When you want to come here, you want to see a city that's vibrant, that's that's dynamic in that and that's clean.'",
        "'speaker_2': 'And you accomplish that by making sure that we have the staff to work with us to keep that. And I'm looking forward to further discussions with the county to also get into an agreement with them. And Mr. Modica, you've heard it from me many, many times that, you know, this is a county territory.'",
        "'speaker_2': 'Either they clean it up or we or we clean up and we charge it. And we've done the same with Caltrans when the on ramps and off ramps are just unbearable and just a blight as we see it.'",
        "'speaker_2': 'So I'm glad to see this motion going forward and I'm looking forward to more discussions on on the rest of the city and the other efforts we're going to be looking at. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you. So I think this is incredibly important. It's been important for a long time. You know, the 91 freeway corridor's been a real area of focus. It only touches the North Long Beach ninth District community and intersects the 710.'",
        "'speaker_7': 'But it's it's been an issue in 91 for a number of cities along the corridor. Just, you know, I remember years ago taking, you know, it's different legislators, three different assembly members, long 91, taking those assembly members on and off every onramp in a in a Caltrans van to show them the conditions of the ramp.'",
        "'speaker_7': 'This was these were this was well before the pandemic, you know, just January. A coalition of cities along 91 submit a letter. Mayors and council members along 91 some in a letter to Caltrans about this very this very issue was a very significant, serious, serious issue for the 91 corridor cities, the 17 corridor cities and clearly across'",
        "'speaker_7': 'the city. I want to thank. I like that we're heading this direction. I want to thank staff for taking steps toward this in this direction. I want to ask a question to just raise up. I see the nodes here and many of we've talked about the different nodes that are referenced here.'",
        "'speaker_7': 'But one node that I want to make sure we have the flexibility to cover and include is the Atlantic in Artesia for the 91 and Atlantic corridor. That is the entryway to the that is the entryway to the Uptown Business District.'",
        "'speaker_0': 'Where the vice mayor is talking to the staff. Also where you.'",
        "'speaker_7': 'Put it, I'm sorry.'",
        "'speaker_0': 'On the screen, just the text.'",
        "'speaker_7': 'Of the map. Okay. Well, this corridor. The 91. Okay. All right. There it is. So when we look at the 91 close to that 9117 intersection, it's just a patchwork of infrastructure that is left a lot of dead down space.'",
        "'speaker_7': 'I'm particularly interested in Atlantic and Artesia, where the 91 in the Atlantic corridor meet, because that is the entrance to the Uptown Business District and entryway. Very close proximity to the Atlantic Bridge community. So it requires a lot of focus, particularly to stay in control of the business issue.'",
        "'speaker_7': 'So I just want to make sure I see if other nodes are there. I see the seven two. I mean, I see the Long Beach Boulevard 91. I think I see a node there. But I want to just ask what flexibility you have as you negotiate with Caltrans to make sure that that is that site is included'",
        "'speaker_7': '. Thank you, Councilmember. Mr. Vice Mayor, I appreciate the question.'",
        "'speaker_0': 'Certain criteria were given to the city of Long Beach by Caltrans to help select these. But we have ensured.'",
        "'speaker_3': 'Flexibility to be.'",
        "'speaker_7': 'Built into the agreement to allow us to address other areas as well. Okay. So let me just make sure that is raised up. That's an important corridor. Important intersections in the north Long Beach community. Thank you.'",
        "'speaker_0': 'Thank you. Councilman's in Dallas.'",
        "'speaker_5': 'Thank you, Mayor. One of the things that I think is very important is partnerships. I'm so happy to see that we have a partnership with Caltrans. I think that's a huge deal. I know that, you know, having several main streets coming in and out of my district, you know, it's really, really important to have this kind of'",
        "'speaker_5': 'partnership. Not too long ago, one of my residences car was completely totaled by a car coming down one of our streets off the freeway. And he was inside minding his own business, and his car was completely totaled. But, you know, so partnerships like thing like this, I think will help us in the future in addressing some of'",
        "'speaker_5': 'those concerns. I do have a couple questions. Do we have a plan to address our worst streets when when extra funds become available? For instance, my business district, the streets haven't have gotten to a point that they're so expensive to fix that there is no time frame for when they're going to be addressed.'",
        "'speaker_5': 'So I guess when.'",
        "'speaker_0': 'I'm getting to some requests of staff to go back to the image, just keep it keep the image there of the map. I'm just getting a couple of councilmembers that they want that. Thank you.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And second question is, do do we have any idea of when the bond that was recommended will be coming back to a council?'",
        "'speaker_3': 'So Councilmember, I think those are both questions about street repair and this is more kind of the cleanliness of the onramp and on off ramps. But we did do a two from four on the on the bond, and I can certainly send another copy on that.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_5': 'Thank you for that clarification. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Austin.'",
        "'speaker_7': 'Thank you. First, let me just say, I do appreciate this item. I'm encouraged by this. This is a long time coming. We've been kind of pointing the fingers during the governmental salute for four years on this freeway, always, you know, when agencies pointed to the other.'",
        "'speaker_7': 'And I think this is a real, real testament of of interagency collaboration and what can be possible now when residents call and they complain about an encampment or trash debris, we're going to own it and we're going to be able to control our own destiny, destiny and the image of our city in a lot of ways.'",
        "'speaker_7': 'So I'm encouraged by this and certainly more courage if there's some funding behind this to help pay for this. So with that, I just wanted to say that I appreciate the the work of staff. This is the shows that we've been listening and we're looking at innovative approaches to to to solve the problem and not wait for'",
        "'speaker_7': 'the next agency or the next person's responsibility. We're taking it on ourselves. And so I think that that says a lot about where we're going. Thanks.'",
        "'speaker_3': 'Mr. Bennett. Mr. Mayor, if I can add to that just for a quick explanation. This has been in the works for many years. So we've talked about this and we've always wanted to do this and it always came down to resources.'",
        "'speaker_3': 'So one thing that's really changed here is the Recovery Act and the ability for us to actually hire up and do this work. We were always worried. We're always willing to take it on, but Caltrans would never pay us.'",
        "'speaker_3': 'And if we sent them a bill, they wouldn't pay that either. So this has always been about getting the resources so that we weren't neglecting our neighborhood streets by doing Caltrans work. So the Recovery Act is what really made a lot of this possible and a lot has to offer.'",
        "'speaker_3': 'They may end up reimbursing some of us. Right now, that's not guaranteed. But if there is state money, we said we're willing to do the work. We still want Caltrans to be responsible in certain areas. This is their property.'",
        "'speaker_3': 'We're just assisting. And I do think that our job, our teams are going to make a noticeable difference. But we also need to make sure Caltrans is still doing their job.'",
        "'speaker_0': 'Thank you, Mr. Mayor. I'm going to turn it to councilman in just a minute. But you you actually said a few things. I just wanted to add or clarify. So just just before we move on, I just wanted to clarify a few things that I heard.'",
        "'speaker_0': 'One is that this is being fully funded by the proposal that we that was in front of this council on adding clean team resources to the Recovery Act. Isn't that right?'",
        "'speaker_3': 'That's correct. Okay.'",
        "'speaker_0': 'So just just to also be clear, so from the council, I think remember those $5 million that we put in there for clean it cleaning initiatives? That's where this that's where this is going at, not just this. I think we're going to hear on the 16th the master plan from the city as to how our all those'",
        "'speaker_0': 'resources are going to be spent in addition to what we're already doing. So that's fantastic. I also just had a question for whether it's for Diego or Eric or or for you. Mr. Modica is the are we overlain because this is a city expense that we are picking up the money that the Governor has put aside for'",
        "'speaker_0': 'Caltrans on ramps and off ramps. It's a significant amount of money in the budget. In fact, we've seen probably images or media of him, you know, cleaning sides of freeways that's promoting this initiative that's going to be, I'm assuming, overlaid on top of what we're doing to get more kind of more cleanliness or what's our approach with'",
        "'speaker_0': 'that?'",
        "'speaker_3': 'Yes. So I'm I meet with the Caltrans director now every month with Theresa. And we've been talking about how to do this. They do not have access to that state funding yet. And so the agreement we've been negotiating allows us to get reimbursed if they get money, but we're not waiting for that.'",
        "'speaker_3': 'So we're building a budget, an approach based on the Recovery Act money. If they are able to reimburse us, then we can use that money then to do this work and then we can free up those recovery dollars to do additional clean team work as more to do either.'",
        "'speaker_0': 'A, you know, we use it in the Recovery Act and we get additional resources to do more areas or we're or we know is we don't get reimbursed basically either we get reimbursed or not. But either way, we're going to get more, more, more work done than what we see on the on this map from the Caltrans'",
        "'speaker_0': ', in my view. I also want to clarify that just because this is a Caltrans, in my view, it doesn't mean that Caltrans is not responsible for all the other off ramps and off ramps. This is just the ones that the city will be responsible for or that will provide additional levels of service moving forward, correct?'",
        "'speaker_3': 'That's correct. And we also, you know, some of these are prioritized. You know, some of these they're not getting to because it's one or two encampments. Those are really good ones for us where we can engage in work on those.'",
        "'speaker_3': 'These are some of our most difficult encampments as well, and they require lots and lots of resources. So we still want Caltrans to work on those. And then we really think we'll be effective with a lot of the litter cleanup.'",
        "'speaker_3': 'Just faster and more responsive. But homelessness is still going to be a very major challenge because we have a lot of service resistant individuals at this time.'",
        "'speaker_0': 'And have we have we thought about it? Because I know that what we're looking at in front of us takes significant resources, which is why it's not, you know, more often or more off ramps and on ramps, I'm assuming.'",
        "'speaker_0': 'But as resources become more available, is there a possibility that the M.O. you think could be could be increased or additional spaces could be added? Is that correct?'",
        "'speaker_3': 'Yes. Can some of these were chosen with safety in mind if it needs a foreclosure in order to get crews out there, that really is a safe spot for our city employees to be. That's really a Caltrans responsibility.'",
        "'speaker_3': 'But we can certainly do more if we have more resources.'",
        "'speaker_0': 'Great. Thank you. And then that's I think I think that's really the one note I'll just make is I think that. Be the entrance, the 20 to seventh Street entrance, that that Caltrans entrance as you're going into the city from the six or five of the 405 is also, you know, one that Caltrans oversees.'",
        "'speaker_0': 'I know that's one that we're very interested in. And also upgrading and doing some signage long term and some other work. And so that's certainly an area that I think we should always keep, keep an eye on. And I know that it's a really it's a really important entrance point, as are others in the city as well'",
        "'speaker_0': '. So. Well, thank you. I'm a conservative councilman, Mongo.'",
        "'speaker_8': 'I think Councilwoman Allen is next.'",
        "'speaker_0': 'I'm after him. I think I have. I have men going here. But let's go to Councilwoman Ellen.'",
        "'speaker_1': 'Thank you, Mary. Just really quickly, this is just a common sense agreement, and there's absolutely no reason why we all wouldn't support this. And we all recognize the homeless encampments along our freeways, the seven, ten and the four or five or the 91.'",
        "'speaker_1': 'I'm also excited to hear about the the county agreement. I think all of these collaborations are just huge. So I definitely know I feel that we need to get Long Beach cleaned up and I'm happy to know that we have the resources and to get this done.'",
        "'speaker_1': 'So just great leadership on this.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I appreciate everything that was said today, and I know that a lot of agenda items by this dais often come from great work that starts with staff over years of time, and then a councilmember hears about it and wants to add their stamp or seal of approval or opinion, and we bring it to the Council'",
        "'speaker_8': '. But I do want to say that, Mr. Modica, while I'm a big fan of yours, what you said today was not the way that I remember it. I remember several meetings where Councilmember Suranga and I had funding available to clean up Caltrans areas and we wanted the city to do it.'",
        "'speaker_8': 'And we were continually told that we could not enter those properties without we had liability issues, we would never be able to get it done. Then Councilmember Super not and I wanted to clean up certain areas and the same was said we had some funding available in our council offices.'",
        "'speaker_8': 'The communities were really asking for responses and we as leaders on this dais were working really hard to find solutions. And I recognize that it was all not within your area. But while I appreciate that the city staff may have been working on a form of this, I don't know that we were really asking for specific designated'",
        "'speaker_8': 'off ramps. I don't know that any one councilmember couldn't add three additional off ramps to this. And I know Councilmember Richardson, he's probably the best out at every agenda item he brings forward. He wants two more off ramps or two more things.'",
        "'speaker_8': 'He's always fighting for his constituents, and each and every one of us could do that. But when when you hear what the mayor just said, I think it really is the root of what we were asking for, which is as any resources are available, we want to have the ability that if our city staff have the resources'",
        "'speaker_8': ', we should be able to have the ability to enter into Caltrans area and clean that area up. And I appreciate that through dialogs, an exception was made for Councilmember Super not in my clean up and there was a way that Caltrans eventually cleaned up councilmember Franco's and I issue but this really was an apex of an agenda'",
        "'speaker_8': 'item that was rooted because there was continually issues where we could not find solutions. And without that and I appreciate Diego in his presentation earlier that talks about that it was really driven by a council agenda item because sometimes it does take a policy by this dais to to make that move.'",
        "'speaker_8': 'And if additional resources are available, I hope that the memo was written or I have the motion, I'd like the memo to include that it doesn't only include these off ramps if there are additional resources that Councilmember Richardson is able to bring to the table to do a specific cleanup in a specific area that may cost $40,000'",
        "'speaker_8': 'because it's gotten to a certain point like the one that happened between councilmember supervisor and I. We want to be able to do that. We don't only want to be limited to the blue dots on the screen, any area of our city that needs help that we have funding for, we really want to see that.'",
        "'speaker_8': 'So thank you, everyone at the dais for all of your comments today. I think they're very poignant. And I just want to say one additional big thank you to our clean teams. And while I'm very fortunate to have a side of the city where our residents are out there cleaning up regularly, painting polls and doing all that'",
        "'speaker_8': 'they can when the clean team comes in, I mean, it makes such a big difference in our alleys and our corridors. They're just they're miracle workers. And I just want to say thank you again.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you. Before we wrap up, just a couple of things. So one, I think what's different here is that the homeless issue on the on and off ramps is significantly worse than what it was before. And this won't meet.'",
        "'speaker_7': 'This won't be just cleaning up the on ramps. It will take significant work with getting access to the on ramps to go and address the actual encampments and make sure that I mean, because what I see on the a91 for you is different than when, you know, my predecessor, Councilman Neal, was having the very conversations, these very'",
        "'speaker_7': 'conversations about taking over the on ramps. And it was a public works conversation then. It was about, hey, if we spend our resources here, we're already behind on the on our own jurisdictions. And that conversation was before I or most of us even joined that join the council.'",
        "'speaker_7': 'I think what we need to hear, what I'm interested in hearing is that by getting access to these sites, we can go and do our homeless outreach work. Because the complaints that I see, our neighborhood associations have already gone and done adopt a high rate on some of the 91 off ramps.'",
        "'speaker_7': 'They're already doing some of these work at the homeless on ramp and the homeless situation with the encampments have been completely abandoned by Caltrans. And that's been the nature of the letters along the 91. And I'm just speaking to the experience in North Long Beach here.'",
        "'speaker_7': 'Homeless outreach is what I really want to see is getting access safely to reach out and engage from that standpoint. So for me, it's not about when this originated or whatever. I think this is about where you have a very different circumstance on off ramps.'",
        "'speaker_7': 'And I want staff to be very, very clear that the expectation isn't just picking up later here in access to deliver services and ensure that people are not creating these massive embankments on, on and off the freeways. I just wanted to be clear on that before we wrap up.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Thank you, Vice Mayor, if I can respond to that quickly. And so, yes, we totally agree with that's part of the reason we want to be out there. And we've been offering our assistance to Caltrans with our outreach workers so that we don't have to rely on lahsa.'",
        "'speaker_3': 'And we and that's how some of those have been have been addressed. But that is going to be the bigger challenge is there are some very large encampments, very service resistant people. And part of the menu is we're not allowed to just go on their property and do whatever we want.'",
        "'speaker_3': 'We need to also follow their rules. So they do have some rules about and that are different than ours about how they treat encampments, the level of severity. I think it's just being out there is going to make us more nimble and especially with the ones and chooses, the ones that we can easily get to, the larger'",
        "'speaker_3': 'encampments that we still have to go through Caltrans process. So I do want to temper expectations that this will not be an overnight fix, but I think this is so much better than just relying on another agency. So but those are those are definitely are our priority that what we have now is not acceptable.'",
        "'speaker_0': 'Thank you very much and great work again to the team. I we look forward to this MRU and I know we're going to focus on these property agreement, but we're always looking at expanding as we as we move forward.'"
    ],
    "Recommendation to adopt resolution approving repaving/resurfacing projects proposed to receive Road Maintenance and Rehabilitation Account funding totaling approximately $9,200,000 in the Fiscal Year 2022 Paving Program.  (Citywide)": [
        "'speaker_0': 'So thank you very much. Please cast your votes. Motion carries 33, please.'",
        "'speaker_1': 'Report from Public Works recommendation to adopt a resolution approving repaving resurfacing projects proposed to receive road maintenance and rehabilitation account funding and the fiscal year 2022 paving program citywide.'",
        "'speaker_0': 'I have a motion in a second. There is no place for public comment on this. You have one here.'",
        "'speaker_3': 'We have any greenfield.'",
        "'speaker_0': 'Your public comment.'",
        "'speaker_3': 'Yes, Annie Greenfield. Annie Greenfeld your phone may be still muted.'",
        "'speaker_0': 'Okay. Thank you, Mr. Marquez. I just wanted to give a couple customers. Just wanted a brief dust up. Didn't want. This actually is.'",
        "'speaker_3': 'Eric Lopez. Mayor, members of the City Council. The item before you is essentially a requirement from SB one, our Road Repair and Accountability Act and its SB one requires that a list of all projects propose to receive funding that it be identified in a resolution that's approved by the City Council.'",
        "'speaker_3': 'And there are specific requirements that we are meeting through this agenda item that that's specific to this funding source. The bill also requires the use of a pavement management system and that guides the development of the project list.'",
        "'speaker_3': 'Something I wanted to clarify this list only represents about a quarter of all roadway projects that are going to be part of the capital improvement program. That's really important. It's just about a quarter is not a complete list and and wanted to make that clarification.'",
        "'speaker_3': 'The other.'",
        "'speaker_0': 'Clarification.'",
        "'speaker_3': 'I wanted to make is that all of these projects are part of the measure, a spending plan. So these are all commitments we've made in the last few years. And we're meeting those commitments. The supplemental, the measure, a funding and other funding sources as well.'",
        "'speaker_3': 'So that concludes the status report, and we're here to answer any questions.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I want to thank Eric for doing an exceptional job of working to improve the streets of the city of Long Beach tonight. I kind of want to just take a moment to ask a few questions that I help.'",
        "'speaker_8': 'I hope will bring some insights to the community. Many know that I've been a proponent of street repair since day one and that when elected, I remember one of my first my first meeting with the mayor. We went over the amount of street repair needed in every district in the city and the cost of that street repair'",
        "'speaker_8': '. And the fifth District was by far the worst. And we've made a lot of progress, but we are nowhere near where we need to be. In a recent memo from the city manager's office, they discuss that we spend approximately $50 million a year maintaining streets at good, very good levels, and we're not really having the amount of'",
        "'speaker_8': 'money necessary to attack the poor and very poor streets that to really get a hold of it while this is a huge light towards climbing out of this tunnel. This is still only 25% of the total plan. But even when you see the total plan, we need an additional $211 million to pull our poor and very poor'",
        "'speaker_8': 'streets and alleys to a condition which I see as appropriate and deserving of our taxpayers and our neighbors. And so I just want that to be both a celebration and a reality check when when you have $211 million in need and that $211 million in need still grows, even when you're spending 50 million a year.'",
        "'speaker_8': 'We we have a long way to go and we need a plan. So what I would also ask is that in future reports, any street that has been paved or resurfaced or mitigated in the last ten years be itemized.'",
        "'speaker_8': 'Because when I read the memo the other day, unless I misunderstood, we're spending 50 million keeping the streets good. And I'd like to see how many streets are getting touched again before hundreds of streets and alleys in our city have ever been touched once since the status was in place.'",
        "'speaker_8': 'And I know the reasoning behind the strategy that we currently have, and I understand its cost effectiveness. And there are residents that have lived on poor streets for a very, very long time. And the current structure of our budget does not, for the foreseeable future, find a way unless an infrastructure bill falls from the feds, which would'",
        "'speaker_8': 'be if it could be dedicated to streets and sidewalks. I need 300 million for sidewalks and 300 million for streets, and I would be a celebratory person without something like that. I don't see a way where we can tell the residents on poor and very poor streets.'",
        "'speaker_8': 'Any date in my lifetime that they could perceive their street being fixed, and that is just not acceptable. So we have to come up with a solution. Grateful for the 9 million in front of us. It's 5% of what we need.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Katherine. Sara.'",
        "'speaker_1': 'Thank you, Mayor. So. I too am grateful that we have this 9 million and to just to see that we're going to be having road maintenance. But I, I think that I need a little bit of a few questions answered about how some of these streets were decided as far as how they ended up being on this'",
        "'speaker_1': 'list and what's the process on getting on a list to getting it into the repayment program?'",
        "'speaker_3': 'Yes. Council Member So we look at the measure spending plan. We made these commitments ask of specific streets that are going to be paved in each district. So throughout the last few years we've been going around and getting some of those segments done each year.'",
        "'speaker_3': 'Those are the the allocations of dollars as directed by the City Council is based on need on the amount of of need per district. And so we allocate dollars a by a percentage based on on that need. And so, you know, there are some districts that will have a different need then than other districts, though.'",
        "'speaker_3': 'So there is some differences. But that that approach was was requested by the City Council. C So when we look here, these are all measure a spending plan, identify streets, and the allocation is based on on the need percentage.'",
        "'speaker_3': 'Where does that percentage come from? The staff updates its pavement management plan every 2 to 3 years, and the need percentages are outlined in that plan. So we get it directly from our and our payment management system.'",
        "'speaker_1': 'Do we have the ability to view this pavement management plan so that we can better understand the process that was kind of taken to it sounded like from Councilmember Mongo statement their grade levels in how they're listed and how they're decided as far as how they're chosen based on, I guess what it's categorized as need.'",
        "'speaker_3': 'Yeah. So we, we actually have the last pavement management program posted on our website. I'll make sure I can send a link. A link so you have a direct access to it. We're looking as part of our update in our in our newspaper management plan, which will be done in the next couple of months.'",
        "'speaker_3': 'We're looking to make it more interactive. We're looking to layer it on a map where you can identify your street, see the rating, see the condition, and just make it a lot easier to understand what the recommendations are.'",
        "'speaker_1': 'And what would be wonderful to do that. Thank you.'",
        "'speaker_0': 'I want to make one clarification also and then I'm going to turn over actually, I think conference in Dallas was the second or did not go to the second of the motion. So if they go to your city councilwoman or no.'",
        "'speaker_0': 'Okay, I'll go to the councilman next. But just to clarify one one thing, and this might help clarify for Councilman Ciro and Andrew Councilman Allen as well the plan, I think Mr. Lopez that you're referring to is is not just the the measure, a five year plan that was adopted by the council, but also the CHP overlay'",
        "'speaker_0': 'that we did on top of that plan. Is that correct? Or you're just referring to the measuring streets? It's both correct.'",
        "'speaker_3': 'So it started with the measure, a map. And then as we build out that map we laid on, as we got new gas tax money, as we got new funding. So, yes, that is the five year commitment that we're talking.'",
        "'speaker_0': 'That this was just the measure, a plan we have, that we this council many years ago adopted the Missouri Street Plan, which was a five year plan of which we're nearing the end of or close to the end of.'",
        "'speaker_0': 'And then we also added through the budget process a variety of streets that met Mr. Lopez's criteria that he just explained from a variety of sources, including, you know, the SB one streets, the gas tax streets, all the streets in the chapbook.'",
        "'speaker_0': 'And it all got folded into one master, a five year plan map that is publicly available that anyone can see that the council adopted. And that's what we're going through right now. And so I think it would be great, obviously, for the Council at some point we should get a kind of refresher and I agree with Councilman'",
        "'speaker_0': 'Sato as to where we're at with that map because I know we've been discussing kind of the what's next, what's next post, this five year plan and how do the funding sources that we have in place impact that that map?'",
        "'speaker_0': 'So I wanted to make that clarification. But thank you for thank you for that. Next, we have customers in the house.'",
        "'speaker_5': 'Thank you, ma'am. I just want to say thank you very much to Councilwoman Mango. I stand with you when it comes to the needing the the poor and very poor street repairs done. I know we've had several conversations about this in the past.'",
        "'speaker_5': 'I know that my residents are eager to figure out, you know, when is their street going to be repaired. I remember when I was elected that I came to visit my my district, my industrial district in the West Side.'",
        "'speaker_5': 'And one of the streets was horrible. I mean, it's a horrible, horrible that I don't think I could even drive my wheelchair through there because it was so bad. And so I said, this is easy, right? And this is one of the most horrible streets here.'",
        "'speaker_5': 'We're going to fix this, you know, a.S.A.P. That still has not happened. And and now I understand why I understand the process. I understand that it is extremely expensive to actually fix those really, really bad streets. And I also understand that it's less expensive to fix the the good, you know, streets or port, you know, the ones'",
        "'speaker_5': 'that are not as horrible. But my question is that do we have a plan for that? Because I don't think that we can just say, oh, well, the street is just horrible and it's just going to have to remain horrible for like council members.'",
        "'speaker_5': 'Mongo says, for as long as we have life, you know, way past us. And so I I'd really like us to move forward to creating a plan that would address those poor, very poor, because they continue to to be damaged then not only that, but they continue to damage other vehicles that pass through there and stuff.'",
        "'speaker_5': 'And and it's just it makes it look like us as a council don't care about those streets or don't care about the, you know, where they are. I usually have weekly check ins with my residents, and one of the things that keeps coming up is why are we not fixing Seventh Street?'",
        "'speaker_5': 'You know, Seventh Street is a main, main street here in. And it goes into the city and out of the city. Right. And so so I think that that's one of the things that we really need to look into.'",
        "'speaker_5': 'Seventh Street, I don't know is that is that street anywhere in the in the plans to be fix.'",
        "'speaker_1': 'Seventh Street.'",
        "'speaker_3': 'Councilmember. I would even go back and check the exact plans, but I can let you know if it's on the current plan or not.'",
        "'speaker_5': 'Thank you. Thank you very much, Mr. Lopez. And I think that, you know, I grieve sorry that we have to come up with a plan to be able to address those very poor and poor streets. Because we cannot we can't.'",
        "'speaker_5': 'It's it's really is unacceptable to continue like this.'",
        "'speaker_7': 'All right. I see the mayor stepped away. Councilman Austin. Thank you. And you know, I'll just say that we have several streets that are going to get paved and we should be celebrating that. And I did to have some some questions and try to understand the methodology and how we got here.'",
        "'speaker_7': 'But I'm going to take this as as a as a win for or at least a few streets in the district. And I can remember when SB one was being debated in Sacramento just a few years ago. I think four years ago it was actually passed.'",
        "'speaker_7': 'And we lauded this this funding sources as an opportunity. I did have a question for a city manager or public works director. Was there a shift in strategy at all in terms of how we were spending SB one money?'",
        "'speaker_7': 'Because the recall wasn't there was it wasn't it specified that SB one would go toward arterial streets. Not residential. Is that ever a strategy?'",
        "'speaker_3': 'I don't I don't think we recall that, particularly because there's there's a number of different types of gas tax. There's gas tax. There's then are prop or prop C, so there's different funding sources. Some can only be used on arterials, some cannot.'",
        "'speaker_3': 'When we got the extra SB one, we went back and looked at kind of the next level of streets and added those in. And so again, you're only seeing one little portion of gas taxes, another whole section of gas tax that's been used for streets as well.'",
        "'speaker_7': 'Okay. So what I'm hearing also from my colleagues and I share that is that, you know, we were contacted on a daily basis about streets throughout our districts, the need for repairs. And I think it would be a very.'",
        "'speaker_7': 'I think it would help us a lot if there was there's a little bit more transparency even for the public and how we were going about identifying which streets are next. I know that's not easy, but even explaining, doing some education about the pavement management plan and how streets are rated and and so when when when they'",
        "'speaker_7': 'see a street help getting paved to streets at least three stillbirths. It's not an affront to them. It's there's a there's a methodology and some science to it. I think that would help us as elected officials explain what's going on, because oftentimes you can you can have a neighborhood and you can do two streets and you look'",
        "'speaker_7': 'at that as a victory. But it really is not a victory when the rest of the neighbors are wondering why not us? So we need to be able to explain that so that our residents understand, you know, how and why we're reaching the decisions that we make other that I'm looking forward to seeing these streets done and'",
        "'speaker_7': 'leveraging our measure eight plans for for future opportunities as well.'",
        "'speaker_3': 'Yeah. And we certainly agree we'd love to be able to to bring more information. I do want us to go back a little bit in history. Four or five years ago, councilmembers were getting one street per district, a new that we were able to do.'",
        "'speaker_3': 'And when we brought on Measure eight, that's what allowed us to really start doing several and create an actual plan. Before that, we didn't even have a pavement management plan. We didn't have any data. We just kind of looked and saw where where were you hearing the most complaints and what one street would you like to fix'",
        "'speaker_3': '? So I do think we've come a long way. I am excited about getting our new pavement management plan and then starting to plan for that next, you know, five year, ten year bring you the options of what funding do we have and what is a need.'",
        "'speaker_3': 'We did think that the in we're really betting on some money from the federal government. We know is $1,000,000,000,000 plan in the works right now and we think we've got a lot of projects that would qualify.'",
        "'speaker_0': 'Thank you. Let me let me just add something else I think Councilmember Austin mentioned. I just think it's important because there's a lot of conversations about, you know, wanting to have a plan and needing to get certain streets done.'",
        "'speaker_0': 'These plans require funding. And I just want a little bit of a reality check as to where we're actually at as it relates to funding infrastructure. We are right now spending more on infrastructure than we probably have in the last 50 years.'",
        "'speaker_0': 'It's very clear about how much we're actually spending on infrastructure. We have more sources of street repair resources that are going into fixing streets than we certainly ever have had in the last few decades. And we were just pre measure a doing 1 to 2 streets for council district a year.'",
        "'speaker_0': 'So I'm very grateful that the voters, you know, for the first time in 40 years, stepped forward with and taxed themselves to invest in all the streets and again taxed themselves to invest in other statewide measures, including, you know, supporting bills like SB one.'",
        "'speaker_0': 'So I just want to make sure that we. Are realistic that right now, even with all of the spending that we're doing in infrastructure, it's not enough. It just is. We just got to be honest with with the public about just saying if we just keep saying, we're going to get through.'",
        "'speaker_0': 'I agree. And we worked really hard to make sure we're doing as many as we are today, which is still not enough to get streets to where they need to be without, you know, a bonding program that I know Councilman Mungo's talked about or without another revenue source or without a large influx of resources.'",
        "'speaker_0': 'There just isn't an opportunity for the city to do dramatically more than what the pace that we're currently doing. It's just not possible unless, of course, we shut down all of our libraries and firefighters and had no other departments in the city.'",
        "'speaker_0': 'So it is it is it is a big challenge. But because fixing a street is not is not inexpensive. And we're talking millions of dollars for First Street. So. I just want to make sure that we're taking a note that.'",
        "'speaker_0': 'When I look at this list, what I see is, oh, my God, we've never done so many streets before. So I'm grateful to the number of streets that we're now doing. So I just want to thank the team and how you've had to completely ramp up.'",
        "'speaker_0': 'Is it enough? Absolutely not. Are there plenty of streets that need repair, including the very poor ones? Absolutely. What I think would be helpful and I think Councilmember Austin is kind of alluding to this as well, is an opportunity in the near future to have a broader conversation about infrastructure.'",
        "'speaker_0': 'And we've kind of had that discussion a little bit on the dais about what does all of our infrastructure funds look like? Where I would like a public update as to where are we at with the five year plan that council adopted?'",
        "'speaker_0': 'How much of it it's done is it we 90% or 95%. And then what? And then showing the public and the council a kind of a what what is the what's the staff proposing for the next if it's not five years, three years or whatever.'",
        "'speaker_0': 'So we have an idea of what's coming down the pipeline with the resources we have in front of us, because we cannot set an unrealistic expectation that somehow things are going to be dramatically different in the next 3 to 5 years without a significant revenue.'",
        "'speaker_0': 'Not I'm not talking a little bit of revenue. Measure producing. $80 million a year approximately in sales tax. Correct me if I if that's incorrect. And so we have this body. Has increased through revenue measures. I want to say 100 to $125 million of revenue that we didn't have before.'",
        "'speaker_0': 'And so just want to make sure that we have that a little perspective. And so I think having a conversation at the dias about what the next few years around infrastructure looks like and what makes sense, I think is important for folks to know what's actually realistic also.'",
        "'speaker_0': 'But I'm very proud of this work and I think you and your team have done a phenomenal job with the amount of ST we're finally doing. So thank you for that. Vice Mayor Richardson.'",
        "'speaker_7': 'Again, Mr. Mayor, I think context is incredibly important. Thank you for allowing some of that context. I think, first of all, congratulations to the public works you guys have done and so much, so much work, infrastructure work over the past few years.'",
        "'speaker_7': 'And I know that it's hard to keep up with the demand of the public. I mean, folks know their council members. They know their city manager. You're going to get a phone call. Members of Congress, assembly members, they don't get a phone call about those things, even though they have more resources than we do.'",
        "'speaker_7': 'They don't get the phone call. You do. But I think it's important to note that a lot has changed in recent years. I remember I remember when, you know, our plant in North Long Beach, which streets was was anchored to redevelopment.'",
        "'speaker_7': 'Redevelopment. We were paving streets and building fire stations with redevelopment that ended in 2013. And that's almost a decade later. And immediately after there's been you know, there's been a measure a there's been SB one, all of these different things.'",
        "'speaker_7': 'I think it's you know, we we also changed our system. The payment management plan process is still fairly new. Prior to that, there was a divide by need and divide by nine. You know, it had its challenges. But you also were able to respond to neighborhood immediate need and say, prioritize this street.'",
        "'speaker_7': 'There was some you know, some good things about that managed plan has its good things as well. So that's fairly that's fairly new. And then I remember when Measure M put out for the first time, we were able to put out a map, go out, do community outreach.'",
        "'speaker_7': 'Show the residents what to expect over a three year period. I thought that was incredible to be able to say, we commit to this and we will deliver this. I thought that was great. I think the challenge here moving forward is going to be that there are different colors of the money.'",
        "'speaker_7': 'Tonight we heard about rules and conditions on SB one. There was no significant outreach to the public about conditions on SB one. SB one. When that happened, that was immediate. Like cities rejoice that we have another tool in addition to our local revenue measures, to go out and produce streets and improve streets.'",
        "'speaker_7': 'And I think in knowing and understanding that there will be an update to the management plan. There needs to be a conversation about, one having a conversation on expectations with the public. And secondly, what is the policy on how we actually use the pavement management plan?'",
        "'speaker_7': 'The pavement management plan just gives us an assessment on the condition of streets, but doesn't say, do we go after worst first? Do we go after streets to catch them before it's before it's too late? That is the conversation, in my opinion, that is overdue.'",
        "'speaker_7': 'And we need to get back to that policy conversation about how we do that in relationship to the different colors of money. If we're going to treat SB one differently than, say, Measure eight. I think we need to have a plan to talk about that.'",
        "'speaker_7': 'So I think moving forward, I certainly see that we need to do some engagement around the update of the pavement management plan that's already planning. I think it's time for that. I think we need to as a part of that factor in things like vulnerability within communities.'",
        "'speaker_7': 'I think we we want to factor in need. There's certainly need in all parts of town, east Long Beach, west Long Beach. I think that's a factor. But we need to think about like things like access or lack of access to public transit.'",
        "'speaker_7': 'Some colors of money are directly linked to public transit. But what about the service roads next to it? What's a more? So we need to pull up a scalpel and have a real conversation about the policy around it in a way that makes sense for everybody across the city and is understandable and is fair.'",
        "'speaker_7': 'And so that's the conversation I'm looking forward to having in the future again. Thank you so much, Eric. I think you and your team are doing incredible work, but that doesn't. But that means people are going to hold you accountable to the talent that you have to step up and rise to the occasion, given the challenges of'",
        "'speaker_7': 'public finance and infrastructure. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilmember Ringo.'",
        "'speaker_2': 'I did great conversation. But, you know, the one thing that I'm concerned about is that, you know, first of all, I want to thank the residents of Long Beach for voting for Marjorie. I mean, that was just a life saver in regards to at least getting a plan to fix our streets and our infrastructure.'",
        "'speaker_2': 'And as the mayor said, yeah, it's never enough. But, you know, what we get is that you? I voted for Marjorie, and where I work my street, you know, it hasn't been fixed. So there's there's that mentality or mentality with that opinion that we get on a daily basis in my office.'",
        "'speaker_2': 'And you know, we look at can we want to we want to get the most bang for our buck with everything that we get. So we do go after the streets. That can be a quick fix. In the meantime, we defer the maintenance of the other streets that are that are really going down to a later point'",
        "'speaker_2': 'in time. And while there are other streets that are on the edge, they deteriorate and they get into deferred maintenance. So, I mean, what we have here basically is, is a never ending cycle of as we fix a street, another one goes down and it doesn't end.'",
        "'speaker_2': 'So we need to have a better plan, a better way of being able to fund the streets. And, you know, I would propose and I don't know, it's probably a budget issue, but, you know, setting aside a percentage of our of our infrastructure funds for those major deferred maintenance streets that really need the work because they're just'",
        "'speaker_2': 'falling too much. I mean, I think the councilmembers and then I brought up a clear a very clear point, point it. Her wheelchair can't cross the street. She should be able to cross the street in a wheelchair. And there are parts of town where she can't because of way deferred maintenance.'",
        "'speaker_2': 'You just don't have the money. So we need to set aside some funding so that she can be able to cross the street without a worry about a pothole or just a street that's just been alone, left alone for for so many years.'",
        "'speaker_2': 'Sorry if I'm getting a little excited about this, but I mean, it's something that I deal with on a daily basis for my constituents. My street hasn't been fixed. I asked for about ten years ago. I voted for Marjorie.'",
        "'speaker_2': 'I thought you were going to fix it. I don't have an answer. And although we defer to you, I think you try your best you can. But, you know, we only have a certain pot and we want to distribute it as best we can and try to get as many streams fixed.'",
        "'speaker_2': 'But in the meantime, like I say, you know, when we put the deferred maintenance on those other streets, others fall into it. So we need a better approach in how we distribute those funds. And I would like I say I recommend that, you know, this is like a bank.'",
        "'speaker_2': 'You know, you set aside for your savings for the rainy day so that when you can use it and you apply it to those streets that are. That are in a in a very bad shape. So, anyway, thank you.'",
        "'speaker_0': 'Thank you, Councilman. Sunday House.'",
        "'speaker_5': 'Thank you, Mary. Mayor. I just want to echo councilmember dundas comments. I get the calls every every day and in my office as well. But I also want to acknowledge the huge difference that a military has made and really thank the voters for passing this this great, great measure.'",
        "'speaker_5': 'I think that, like Councilmember Donna said, we would be in a much, much, much horrible position right now with those streets if it wasn't for this. And I really want to also thank city staff. I know, Eric, you have been amazing.'",
        "'speaker_5': 'And I know that you also feel like your hands are tied because you're trying to do as much as you can to help us, you know, get our streets fixed and stuff. And if you had a magic wand, they would be done, you know, overnight and stuff.'",
        "'speaker_5': 'But I think that, you know, together we can really come up with a plan to really address it and figure out how we can address the streets that really are like the worst, worst streets in our city. So I really want to thank you for all the jobs that the great job that you and your department has'",
        "'speaker_5': 'continued to do.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_8': 'Thank you. I really appreciate all the dialog at the dais today. I know that there's an upcoming policy discussion coming to the Infrastructure Committee, and I'm excited for that opportunity. We talk a lot about where this comes from and what does that mean and how do we set aside the money.'",
        "'speaker_8': 'And it's an overwhelming amount of money, and I hope we can go back to where we started this conversation. When I, I made the motion and we talked about the context, which is we need 200 to $400 million.'",
        "'speaker_8': 'You add in sidewalks, we need $500 million. And that's a lot of money and there's ways to get there. I brought forward a bond item that the mayor mentioned. I think we need to revisit it. I've spoken with bond experts recently and gotten some additional context.'",
        "'speaker_8': 'Buying bonds right now and getting them into the city is one of the best rates we've seen in our lifetime. And so the other thing we have to talk about is the cost of not repairing a street that falls from poor or sorry, from fair to very poor increases almost 100% and in some cases, more than 100%'",
        "'speaker_8': '. And so when you talk about whether you're borrowing money at a 7% or a 3% versus the cost increases that happen if you do not repair the street, you're really talking about significant, significant increases. You're also getting a lot of savings in terms of pothole repair.'",
        "'speaker_8': 'But even if we want to talk about context and policy and all of these things and vulnerability and all of that's important. Even if the money fell from the sky tomorrow, it would still take us years to get through the work.'",
        "'speaker_8': 'Because as measure has been upon us and we've been fortunate to have SB one prop, a prop C measure, a general fund all contributing to our infrastructure plan. There are also only so many contractors to help us, and I know that.'",
        "'speaker_8': 'I want to give a lot of props to public works for ramping up their project management and their ability to get this many streets done is also phenomenal. And then I want to give a big thank you to our residents.'",
        "'speaker_8': 'One of the residents wrote an email during this Dyas conversation about that. Our streets never been touched in 37 years, and the street adjacent to her has been slurry sealed twice. And the other issue that comes about when you have a slurry sealed street is sometimes those slurry sealed streets will never get to the point of a'",
        "'speaker_8': 'full restructure. And many of them have significant drainage issues that back up into our neighborhoods. And because we continue to slurry seal, instead of letting some of them go where we know that that work could get done, and then focusing on the poor and very poor, we just we need to get there.'",
        "'speaker_8': 'And I'll say we have had this policy discussion several times. I'm excited to have it again with two additional members of the dais because we were featured on what our ten worst streets were, and we were honest and open and transparent about that with the public.'",
        "'speaker_8': 'And we continue to be and I think that's an important part of the conversation. So again, as I said when I opened, really excited to celebrate the $9 million, but it does come with a reality check on and I know I was talking to another councilmember hey, there's so many little projects that individually don't make a difference'",
        "'speaker_8': ', but every time we approve a $2 million project, I wish that the agenda item said, Would you like to approve? The paving of Street A? Or do you want this program? Because I think we really need that kind of context.'",
        "'speaker_8': 'When people call our office to hold us accountable, to say, yeah, it's a great program and if it'll help more people than that, but other times it's an investment in the infrastructure that our taxpayers expect. So and our residents and our and quite frankly, our visitors.'",
        "'speaker_8': 'So I'm really passionate about this. It's been a heck of a night, a lot of passion items for me today, and I'm really thankful to get so many of them out there. And if anyone wants to talk streets with me any day, any time, any place, I'll be there and I'll bring them to the PMP.'",
        "'speaker_0': 'Thank you. Members, please cast your votes.'"
    ],
    "Recommendation to approve the City of Long Beach Digital Inclusion Initiatives Digital Inclusion Roadmap to ensure that everyone in Long Beach has equitable access and use of computer literacy training, the Internet, technology devices, and other digital inclusion resources.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. The last item is 35.'",
        "'speaker_1': 'Report from Technology and Innovation Economic Development Recommendation to approve the Digital Inclusion Roadmap to ensure that everyone in Long Beach has equitable access and use of computer literacy training. The Internet technology devices and other digital inclusion resources. Citywide.'",
        "'speaker_0': 'I have a motion in a second, but there is a staff for Mr. Mayor. So, Mr. Modica.'",
        "'speaker_7': 'Mr. Mayor, I need to recuse myself on this one.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you. Given the fact that I work in the technology and telecommunications industry an abundance of caution, I am stepping outside and recuse myself on this item. Thank you.'",
        "'speaker_3': 'Okay. Thank you, Mr. Mayor, and members of the council. This was a big policy initiative by the council in 2018, is to create funding, find a way to do a digital road map. We went through a process and found some additional funding.'",
        "'speaker_3': 'It's been a big outreach effort with our community and there's been a lot that the council can be proud of for digital inclusion, especially with the CARES Act. So I want to give a report today on what we've been doing for the road map development, which really helped inform how we spend a lot of those digital divide'",
        "'speaker_3': 'dollars that came through the CARES Act and is going to be furthered under the Recovery Act. So Lee Eriksen.'",
        "'speaker_1': 'Good evening, Mayor, and members of the City Council. The Technology and Innovation and Economic Development Departments are pleased to provide an overview of the proposed Digital Inclusion Roadmap, peer review and discussion. The Digital Inclusion Initiative strives to ensure we achieve our vision that every individual on Long Beach, regardless of background, neighborhood or identity, has high quality, accessible'",
        "'speaker_1': 'technology, resources and services to be civically engaged and social and economic empowered. This vision was co-created by stakeholders and community members as part of the Digital Inclusion Roadmap Development. The city's digital inclusion initiative has three focus areas that collectively work to achieve the vision.'",
        "'speaker_1': 'We believe that digital inclusion is only met when all three areas are met. Capacity includes free, multilingual computer literacy, training and technical support. Connectivity includes low cost and free, high speed quality. In-Home Internet services and technology support. And technology includes low cost and free quality, internet enabled technology devices and technology support.'",
        "'speaker_1': 'We didn't wait for the digital inclusion roadmap to be finished before starting our digital inclusion work. And already the City of Long Beach has received ample recognition for advancing digital inclusion efforts in 2020. Economic and Digital Inclusion Program Manager Rebecca Comber received the Charles Burton Digital Equity Champion Award presented by the National Digital Inclusion Alliance.'",
        "'speaker_1': 'This National Award recognizes outstanding leadership and dedication in advancing digital equity. You also see the city receive recognition as a 2020 digital inclusion trailblazer three times in a row, and also a California social and public information official Caprio Award for our social media engagement campaign, which was done in all four of the city's languages.'",
        "'speaker_1': 'I'm now going to turn it over to Rebecca to cover the roadmap development process and the proposed digital inclusion goals and Community Priorities Strategies. Thank you very much, Leah. Good evening, honorable mayor and members of the city council.'",
        "'speaker_1': 'As Leah mentioned, my name is Rebecca Coloma and I'm the city's economic and digital inclusion program manager. I'm super excited to share with you all about our great work about developing our digital inclusion roadmap, which uplifts collective impact and an equity lens as part of our way to advance digital inclusion for all in Long Beach.'",
        "'speaker_1': 'On January 23rd, 2018, the City Council approved the city manager to work with several city departments on a digital inclusion master plan to support this effort. Back in March of 2019, the City Council saw further approved one time funding of 40 K to the Technology Innovation Department to support the development of the road map.'",
        "'speaker_1': 'And as I mentioned, the essence of this process does include collective impact and also an equity lens. So through collective impact, we were able to work closely with the community and cross-sector partners in a structured format to be able to solve a digital divide and ultimately advance equity and inclusion.'",
        "'speaker_1': 'And through that, we focused on performance management, developing a common agenda, making sure we had a joint plan of action, and fostering open communication with all of our stakeholders who were involved in addition and equity lens was also imperative.'",
        "'speaker_1': 'Through an equity lens, we were able to segregate data, address systemic and institutional barriers, and ensuring that we were uplifting the lived experience of community members that are most affected by the digital divide. As part of our digital inclusion road map development process, it was very imperative for us to ensure that we were engaging both stakeholders and'",
        "'speaker_1': 'also the community through stakeholder and community engagement. As part of our stakeholder engagement process, we hired a consultant called McCormack, and we were able to convene a 50 person multidisciplinary Digital Inclusion Stakeholder Committee, which officially kicked off back in August of 2019 through October 2020.'",
        "'speaker_1': 'And this committee provides strategic guidance, vision and oversight over the development of this process. And the committee also reflected the entire spectrum of digital inclusion. And also as part of that, it was also crucial that we also engage with community members as part of this process.'",
        "'speaker_1': 'We hired Pueblo Planning, who is a social justice and justice urban planning consultant to help us out with the community engagement activities. It was very imperative that we partnered with local trusted community partners, and these partners included Central Cha, Long Beach, Forward, the United Cambodian community and the YMCA of Greater Long Beach.'",
        "'speaker_1': 'I do want to talk a little bit more about our community engagement process, which was very unique. First and foremost, we intentionally uplifted the community members as experts as part of this process through power sharing and intentionally acknowledge that historically and currently marginalized communities are typically left out of government decision making processes.'",
        "'speaker_1': 'And Pueblo Planning had a great way for us to also engage with the community, and that was also through art and storytelling, where they were able to use that process to uplift their lived experiences, knowledge and vision for what digital inclusion should look like here in the city of Long Beach.'",
        "'speaker_1': 'We had a variety of different ways to engage with community. Over the past year, this included community pop ups, workshops, interviews, and also a survey. And through that, we were so excited. And during a pandemic, we engaged with more than 170 community members in a process that was both meaningful and inclusive.'",
        "'speaker_1': 'During our community engagement process, it was very important for us to understand what some of the key challenges and barriers were for being able to access and utilize the internet and computers. Some of these key challenges and barriers included high costs with Internet services, poor quality broadband literacy and English literacy barriers, lack of access to electricity to'",
        "'speaker_1': 'name a few. And as part of this process, I wanted to share a testimonial from Angela, who resides in central Long Beach, and she was able to share some of her challenges with accessing and utilizing the Internet and computers.'",
        "'speaker_1': 'And this is a direct quote from Angela For one of my classes, the computer wouldn't work because the Internet wasn't working. So I had to email my teachers through my phone because I have mobile data to tell them I was not able to complete the assignment.'",
        "'speaker_1': 'I told him that if I would give him more time, if I could do it, I would have more time. And I had to drive my car to my grandmother's house because my grandmother also had Internet access to complete the assignment.'",
        "'speaker_1': 'So here is a perfect example of a Long Beach community member from their own words that shared what challenges that they were experiencing with having poor internet and computer access. As part of our process, it was very important for us to also uplift strategies, goals and objectives that would advance digital inclusion here in Long Beach.'",
        "'speaker_1': 'For the purpose of this presentation, we will be highlighting some of the key top strategies that were referenced as part of this development process for capacity. The top community strategies included providing one on one tutoring, where community members can learn how to use the internet and computers.'",
        "'speaker_1': 'In addition, providing classes where community members can also learn how to speak, read and write in English. In addition, establishing a hotline where community members can call to resolve any issues that they're having with Internet service providers. And connectivity.'",
        "'speaker_1': 'The top community strategies included providing free and low cost quality, high speed Internet services for community members at home, and also being able to administer free quality wi fi provided at public parks and also at public libraries. And last but not least for technology, the top strategies included providing free and low cost quality desktops, computers and tablets'",
        "'speaker_1': 'for community members, and also providing technical support where they can receive information on how to address computer issues and also any other technology related issues. In regards to next steps, we heard a lot of great expertize wisdom and lived experiences on how to address the digital divide in Long Beach.'",
        "'speaker_1': 'Once this item has been approved by City Council, city staff will officially kick off an equity focus implementation process. And this process would both involve us convening with the community and cross-sector partners. And we will establish an implementation committee where we will have the opportunity to identify funding personnel, data collection and reporting structures to implement this process'",
        "'speaker_1': '. As part of our conclusion, I would like to take the time to thank the mayor, city council, city manager, city staff, community partners, and most importantly, the community for all of their inspiration and collaboration, time and commitment with developing this digital inclusion road map process.'",
        "'speaker_1': 'That concludes our report. And Lee and I are more than happy to answer any questions that you may have.'",
        "'speaker_0': 'Well, thank you. That was a really excellent report and a really great presentation. I also just want to just note. I want to thank a staff you all did a fantastic job in the presentation was really great. So, so, so, so good work.'",
        "'speaker_0': 'I also just want to note that State Senator Gonzalez was a real champion on this issue and really brought this issue forward to the council on multiple occasions and continues to do that work at the state level. But we want to make sure that we obviously think and recognize her for bringing this to the council as a'",
        "'speaker_0': 'as one of her kind of top type issues and priorities. There is a motion and a second, I think Councilman Mango, who made the motion, had to had to leave. So maybe someone else can make the motion. And I think she's got to be here for it to make the motion.'",
        "'speaker_0': 'So let me do this. Ottomans and in.'",
        "'speaker_7': 'Europe.'",
        "'speaker_5': 'Thank you. Thank you very much. We are. And thank you for recognizing all the hard work that now Senator Lena Gonzalez has put into into the digital divide items that we have before us here today. Great job on the staff.'",
        "'speaker_5': 'Thank you, Ms.. ERICKSEN. And thank you, Rebecca, for a great presentation. As you know, COVID COVID 19 highlighted and brought to light many of the already existing impact and inequities in our city. And among those was the digital divide that posed an additional barrier to many of our students, parents who had to condition from going, you know'",
        "'speaker_5': ', in school to online schooling. We also saw that many of our neighborhood associations found it difficult to transition to virtual meetings, especially because many people lacked access to Internet electronic devices or or they just did not know how to navigate the Internet.'",
        "'speaker_5': 'In addition, I am particularly glad to know that much of our community outreach, many of our computer literacy programs, among other resources, will continue to be offered in multiple languages. I am very, very supportive of this item and our city's effort to close the digital divide so that we can all move forward together.'",
        "'speaker_5': 'Thank you. Thank you very much for all your hard work on this.'",
        "'speaker_0': 'Thank you. Catherine. Ringo.'",
        "'speaker_2': 'Thank you. This is a very encouraging item that's coming forward, but it's always how do we pay for it? That's that's the challenge. And I'm hoping that nationally I know that there was a discussion about making Internet accessible for everybody and a national basis.'",
        "'speaker_2': 'And I know that there were a few bills being considered in the state of California to do the same thing. But nothing has happened. In your report. In flipping through it, I see there's other testimonials as well, and one where it says Each month I pay $35 for Internet and my daughter understands that it is the cheapest'",
        "'speaker_2': '. It does not meet the needs of my child's education, however, because it has been very slow and because it's very cheap. That's just. Part of a quote. And then the other one, he's the one who hits me hardest is the rent is not affordable anymore.'",
        "'speaker_2': 'We are living in a time where food and rent is very high. We pay for rent and food. So do we want a luxury? Laptops are not a luxury. They are a necessity for daily life. I would like to see help for kids to get laptops to get accessible quality internet at a good price.'",
        "'speaker_2': 'So I'm hoping that during this period of of bringing this forward that we are talking to our partners. Well, Verizon and and Spectrum and any other service provider here in Long Beach to provide affordable Internet. And I brought this before I went, senator, senator and then Leader Gonzalez, which was a councilmember here.'",
        "'speaker_2': 'I joined her in the whole discussion about the digital divide, especially when it comes to West Palm Beach and the first District as well, because we both are adjacent districts and we we suffered the same consequences of not having good Internet access or at least one at an affordable price.'",
        "'speaker_2': 'So I'm hoping that when we move forward with this and we are looking for the funding that we can work with our partners to to make it accessible, first of all, and to make it affordable, of course. So I support the title for today, but we need to get cracking on getting the funding so we can make'",
        "'speaker_2': 'this a reality for all citizens and all residents in Long Beach. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'The town.'",
        "'speaker_0': 'Councilman Taro.'",
        "'speaker_1': 'Thank you, Mayor. First, I want to thank Lee and Rebecca for the awesome presentation, and I want to thank the technology and innovation staff as well for their hard work. You know, during the pandemic, it really lifted the high need that really demonstrated how much of a divide there is digitally.'",
        "'speaker_1': 'And, you know, I just really appreciate the team because, you know, during the time when, you know, obviously went virtual, there was just a high need for access to Internet as well as computer. And really the team stepped up and really fill in that need.'",
        "'speaker_1': 'I saw them everywhere possible with food drives and all of these spaces. So I really want to acknowledge that and appreciate that. And I really like the the community engagement approach you took and how inclusive and accessible it was in the way that it was approach.'",
        "'speaker_1': 'And it really shows in the report and I really look forward in the next steps and how you're really bringing equity to the forefront in how we implement it and appreciate the way that you'll continue to work with in partnership with the community organizations as well as active residents.'",
        "'speaker_1': 'So thank you so much.'",
        "'speaker_0': 'Councilmember Councilmember, your rank I think you spoke already to the to the second rate. Why did you pick up again? Okay, Councilman. Councilwoman Allen.'",
        "'speaker_1': 'Thank you, Mayor. And I also want to recognize Director Erickson and the T.I. I staff for their hard work on this road map. I also want to appreciate I want to say thank you to Senator Gonzalez for all of her hard work on this item.'",
        "'speaker_1': 'I know this was a major undertaking and I was just so impressed when by the presentation, especially hearing all the goals and community strategies. I also just really respect the community engagement and outreach that was achieved during this process.'",
        "'speaker_1': 'I feel like that you really took the time to understand the barriers in accessing the Internet and computers. So just great work on this.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_7': 'Thanks. I want to say most of my questions have been answered already. I wanted to just compliment the staff on a great report and presentation. I. I did have a question related to. It seems like. We've experienced a lot and learned a lot in the last year.'",
        "'speaker_7': 'We had to work through some some some unexpected challenges in terms of connectivity issues that were experienced. I would say prior to. 2020 or even as this process was going on, had there been any any significant improvements from Internet service providers in terms of expanding capacity and and and connectivity for for residents?'",
        "'speaker_1': 'I thank you for that question, Councilman Austin. I did want to mention that the Internet service providers were at the table throughout this whole process. So Frontier Spectrum, Verizon and they have been offering low cost programs and most of them are participating also in the emergency broadband benefit.'",
        "'speaker_1': 'And I know that they've also been making investments in in the connectivity in the cities in this inner city. So a lot of investment, small cell deployments, etc.. I'm increasing fiber capacity. So there's been a lot of investment in the city over the last couple of years.'",
        "'speaker_1': 'And one of the items that you approved earlier, 34, is continuing the city's work with digital, with building a fiber network, the citywide fiber network, to provide access within any within two miles of any point of the city's fiber.'",
        "'speaker_1': 'And so that's also going to be able to be moving forward with the the approval of that item to to use the broadband group to help us design and engineer the city's fiber network.'",
        "'speaker_7': 'Okay. So this is probably a deeper conversation, but I would really love to understand how that that infrastructure actually looks. Um, from ISP. Um, you know, because we know that there's not a lot of competition either. You live on this side of town.'",
        "'speaker_7': 'This is who you have. You live on this side of town, this is who you have. And sometimes there's also disparities in terms of quality. Right. And and I think we need to dig a little deeper there as well, because we understand that there's a digital divide.'",
        "'speaker_7': 'But then also there's a digital divide with, like I said, quality and individuals who are required to work from home or get to be productive in their daily lives. I've heard from a number of individuals who reached out to me and said, Hey, can you do something about this?'",
        "'speaker_7': 'Because my Internet goes out at a certain time every day, right? And I'm down for an hour or two. So, so, so I think this is a great, great jump starting point for us and I appreciate that work.'",
        "'speaker_7': 'But I do think that we still have a lot to do. This is a much broader issue.'",
        "'speaker_0': 'Thank you, Councilmember Supernanny.'",
        "'speaker_7': 'Thank you. Thanks for the presentation. And I make this same comment.'",
        "'speaker_3': 'Every time this topic comes up. And by the presentation, I can tell you doing it.'",
        "'speaker_7': 'That we continued to collaborate with the public school system and almost it sounds like there was a bit of a gap analysis where you saw what the school district was providing and then we could fill those gaps. So really great to hear that.'",
        "'speaker_7': 'But, you know, my.'",
        "'speaker_3': 'My point has always been.'",
        "'speaker_7': 'If the school district is is supplying every student with a Chromebook and a hotspot, then that's a starting point that we can work from.'",
        "'speaker_0': 'So thank you again for the report. Thank you. And let me make got a public comment, then I have a closing comment.'",
        "'speaker_7': 'We have Jacob O'Donnell. Jay Cutler.'",
        "'speaker_4': 'Great. Thank you. Good evening, Mayor Garcia and members of the city council. My name is Jacob O'Donnell calling on behalf of Senator Lena Gonzalez to express support for item 35. As the former first District Council member, Senator Gonzalez launched the Digital Inclusion Road Map Initiative to ensure every Long Beach resident, regardless of zip code or income level'",
        "'speaker_4': ', has Internet access and that providers are serving and investing in our communities that deserve it the most. Now in the state legislature, Senator Gonzalez continues to advance policy in this space with the introduction of Senate Bill for the Broadband for All Act, which will ensure funding for high speed fiber infrastructure projects in underserved urban and rural communities'",
        "'speaker_4': 'throughout the state of California. We want to thank city staff for all of their hard work and dedication on this initiative and all of the community partners who have put so much hard work on and collaboration into this effort.'",
        "'speaker_4': 'And we're excited to see the next steps. On advancing digital equity and inclusion in the city of Long Beach. Thank you for your time.'",
        "'speaker_3': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Thank you. I just wanted to add also that I did want to thank the Technology and Innovation Commission just because I know that they worked on this issue pretty thoroughly. And it's a really great folks on that commission.'",
        "'speaker_0': 'And I just know that their work is reflected in this in this roadmap and this report. And then this is maybe a broader question for Mr. Modica, or we can you know, we can maybe bring Mr. Lee, Kevin Lien.'",
        "'speaker_0': 'But I think this report is so good and it's you guys did such a great job. I just don't want it to just live as a report. So I just hope that you're thinking about how it can live, as, you know, not just online, but how do we create infographics and a story and materials so that we're'",
        "'speaker_0': 'out telling the story online? This is the type of report and I could see this about other reports as well, that we should be digesting it down to smaller images and infographics and one pagers that we're able to post on social media so that those can share within the community about what we're doing.'",
        "'speaker_0': 'So I just want to make sure that we are thinking about that for this report and for others, of course. But I just always, whenever I see such a well done, broad report, I just don't want I don't want us to be the only people that that see it.'",
        "'speaker_0': 'So if we can just work on it, that would be that would be great.'",
        "'speaker_1': 'Mr. Mayor, I just wanted to add, you know, the $40,000 that we reported earlier, that was from at the time Councilwoman Gonzalez's account and the Technology and Innovation Commission was an active participate through this whole process, including studying the digital inclusion divide at your request, actually back in 2018.'",
        "'speaker_1': 'So and we definitely are going to be moving in towards implementation. And as part of that, we are going to continue our equitable work and equitable approach to outreach and inclusion and have also a state of of digital inclusion every year as part of the approach.'",
        "'speaker_1': 'And I just really wanted to also just really give a lot of credit to Rebecca. The work that she's done is it's just been really amazing with this whole process. And she's being actually asked to speak at national, state and regional conferences and cities and groups, and we're even L.A. County's asking us, Hey, what are you doing'",
        "'speaker_1': 'down there? So this this work is really getting a lot of attention. And and she totally deserves the work she got from the National Digital Inclusion Alliance.'",
        "'speaker_0': 'And Rebecca, the presentation was phenomenal. So thank you. And let's continue this this amazing work. Thank you, Leah. Such impressive staff and commissioner work here. Just thank you all very much. Members, please cast your votes.'",
        "'speaker_1': 'American. Do you have to vote? Motion carries.'",
        "'speaker_0': 'Thank you. Now it's new business, so I want to make sure that we still have quorum here. Okay, good. So if you have new business or an announcement, now would be the time count from your income.'"
    ]
}