{
    "AN ORDINANCE relating to grant funds from non-City sources; authorizing the Director of Transportation to accept specified grants and execute related agreements for and on behalf of the City; amending Ordinance 125207, which adopted the 2017 Budget, including the 2017-2022 Capital Improvement Program (CIP); changing appropriations to the Seattle Department of Transportation; revising allocations and spending plans for certain projects in the 2017-2022 CIP; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Bill passed and show Senate. Please read the report of the Sustainability and Transportation Committee.'",
        "'speaker_3': 'The Report of the Sustainability and Transportation Committee Agenda Item one Council Bill 118990. An ordinance relating to grant funds from non city sources. Authorizing the Director of transportation to accept specified grants and executed and execute related agreements for and on behalf of the city.'",
        "'speaker_3': 'Amending Ordinance 125207, which adopted the 2017 budget, including the 2017 to 2022 Capital Improvement Program, changing appropriations to the Seattle Department of Transportation, revising allocations and spending plans for certain projects in the 2017 to 2022. Copy and ratifying and confirming certain player acts.'",
        "'speaker_3': 'The committee recommends that full council pass the Council bill.'",
        "'speaker_0': 'It comes from Johnson pinch hit for Councilmember O'Brien.'",
        "'speaker_4': 'Thank you. Council President. This is commonly referred to as the Grant's acceptance ordinance for a start. It's accepting funds that are coming to us from the state, from the region and from the federal government to continue to plan and maintain and build out our transportation infrastructure.'",
        "'speaker_4': 'Happy to answer questions if people have any.'",
        "'speaker_0': 'Any fried food.'",
        "'speaker_4': 'For adoption.'",
        "'speaker_0': 'Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Sergeant Bagshaw, I. Herbold II Johnson. I was president in Harrell six in favor and.'"
    ],
    "AN ORDINANCE relating to the Capitol Hill Housing Improvement Program (CHHIP), a public corporation chartered by The City of Seattle; approving the extension of an agreement with CHHIP approved by Ordinance 125045 for three additional months to continue funding the Capitol Hill Housing Low Income Transportation Demand Management Pilot Project; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Unopposed bill passed and chair of the Senate. Please read agenda item number two.'",
        "'speaker_3': 'Agenda item number two Council Bill 118992. An ordinance relating to the Capitol Hill Housing Improvement Program, a public corporation chartered by the City of Seattle approving the extension of an agreement with Seattle IP approved by ordinance 125045 for three additional months to continue funding the Capitol Hill Housing, low income transportation demand management, pilot project and ratifying confirming'",
        "'speaker_3': 'certain prior acts. The committee recommends that for council pass the bill.'",
        "'speaker_0': 'House Member Johnson.'",
        "'speaker_4': 'Wonderful pilot program by Capital Housing to purchase what's called the Multifamily Orca Card Program for residents of two of their buildings on Capitol Hill. This project was a joint project between START and capital housing that really allowed for a whole lot of folks to get access.'",
        "'speaker_4': 'Living in those buildings to unlimited orca rides has been really, really wildly successful. The only bad news is that there was only enough funding for a year. So this ordinance today allows for the extension of the program through the second quarter, i.e. through the end of this month.'",
        "'speaker_4': 'And now we're stuck in a bind and figure out how to make sure that we extend this program, which has been really wildly successful. So wonderful project by Capital Hill Housing. Thanks for their good work and collaboration with us.'",
        "'speaker_4': 'I'm looking forward to seeing where we can take this next to would recommend passage.'",
        "'speaker_0': 'Thank you very much. Any further comments? Please call a role on the passage of the bill.'",
        "'speaker_1': 'Sergeant Bagshaw i. Herbold i. Johnson. Whereas, President Harrell i six in favor and unopposed.'",
        "'speaker_0': 'Bill passed in chair of the Senate. Please read Agenda item number three.'"
    ],
    "AN ORDINANCE relating to residential rental properties; amending Sections 7.24.060, 7.24.070 and 7.24.080 of the Seattle Municipal Code; requiring that landlords provide information to tenants about how to register to vote and how to update voter registration information.": [
        "'speaker_3': 'The Report of the Energy and Environment Committee Agenda Item for Council Bill 118993. An ordinance relating to residential rental properties amending sections 2.24.060.070.080 of the Seattle Municipal Code, requiring that landlords provide information to tenants about how to register to vote and how to update voter registration information.'",
        "'speaker_3': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you very much, Councilmember Swann.'",
        "'speaker_2': 'Thank you, President. This is an ordinance to require landlords to provide new tenants with voter registration forms and information along with the information for tenants. Back at that, they are already required to provide renters a statistically less likely to be registered to vote than homeowners.'",
        "'speaker_2': 'And this isn't surprising because renters who are being displaced by rising rents have registered to vote again at each new address. This also means that people who are more likely to be renters, such as low income people, young people, immigrants, people of color are less likely to be registered to vote.'",
        "'speaker_2': 'This legislation is one part of addressing this statistical disenfranchisement, especially given that we are a mail in ballot state. Although obviously the problem is far bigger than the legislation can address. The only objection I've heard so far to helping tenants register to vote as.'",
        "'speaker_2': 'I'm from the ultra conservative Rental Housing Association. Perhaps they are worried that if more renters vote, more elected officials will support rent control and other tenants rights. But other than that, we have had tremendous support for this bill.'",
        "'speaker_2': 'I wanted to thank the Seattle Department of Construction Inspection. Ali Banerjee from dental staff and King County Elections were working with us on this legislation and for agreeing to help implement it in a way so as to maximize its effectiveness.'",
        "'speaker_2': 'And I think especially Ali Banerjee's expertize on this and other demonstrator installation has been truly invaluable. I also wanted to thank our two members, Juarez and Gonzalez, who were very helpful in our committee discussion. And I want to particularly extend, thanks to Zachary Thibeault from the Capitol Hill Community Council, who originally brought the need for this to'",
        "'speaker_2': 'our attention and has been part of the process all along. And the committee recommended unanimously that we vote yes.'",
        "'speaker_0': 'Thank you very much, Councilmember Swan. I do believe we have two amendments that we can speak on, if anyone, before we talk about the amendments, if anyone had any comments on the base legislation first, now would be the time.'",
        "'speaker_0': 'I may see some comments after it's all done, but why don't we walk through the amendments? Councilmember Wallis, thank you.'",
        "'speaker_1': 'And I want to apologize. We had a bit of a cut, a typo in our referral, and I had to fix it. So for ease of just of discussion, we have Councilmember Gonzalez and I have two amendments, and the first one is Amendment A, so I would move to amend Council Bill 118.0.'",
        "'speaker_1': 'How do I say this point? 993 It's still the lawyer in me, basically this amendment that by the way.'",
        "'speaker_0': 'Oh, sorry. Let's do it. So let's. There's been a motion and it has been seconded to and well, you haven't described the amendment yet, but I'll describe it as amending the Council bill 118993 by adding a new Section three and I think by remembering the remaining sections.'",
        "'speaker_0': 'And now you describe what you're doing. Mm hmm. Very good.'",
        "'speaker_1': 'So what we have here and we discussed this at committee and if council members want wants to comment, that would be great. But we discussed it committee and with Stsci and a representative from King County election who had a representative here that the requirement to track voter registration to see the the productiveness or how well this would'",
        "'speaker_1': 'work in getting more voters or renters to sign up to vote that we would like to see the information come back to us. But anyway that this requirement would not be an added burden or administrative task to perform.'",
        "'speaker_1': 'So basically, it would just track voter registration to see how successful this this council bill would be.'",
        "'speaker_0': 'Very good. Any discussions on this particular motion? It has been moved in second. All those in favor of. I'll just refer to this benefit, number one, if I may. All those in favor of amendment no. Amendment number one, say I, I as opposed no one has passed councilmember words.'",
        "'speaker_0': 'You have a Second Amendment.'",
        "'speaker_1': 'Thank you. This is amendment number two. I moved to amend council bill 118993. This amendment goes is more of a technical amendment. So when we went back and looked at the language, we just basically changed the language from the packet that the packet includes the summary so the landlord or the rent would only have to produce one'",
        "'speaker_1': 'single packet. So it isn't anything real substantive, it's just making it easier for the landlord to hand out one particular packet to the potential renter.'",
        "'speaker_0': 'Very good. Any further comments on amendment number two has been moved in second and already all those in favor of amendment number two say I. I opposed. The ayes have it. So now we have a piece of bass legislation has been amended twice.'",
        "'speaker_0': 'Are there any further comments from any parties? I just wanted to say one thing, and that is that one could argue, why are we asking landlords to do this? We have been trying to we, I think, appropriately enact landlord tenant laws for the protection of tenants, particularly dealing with unscrupulous landlords.'",
        "'speaker_0': 'And we've seen some horror stories out there, but I think if we look at what's happening in this country and we look at the history of voter suppression, that I think a great city will look at every opportunity to try to enhance voting, every transaction, every opportunity.'",
        "'speaker_0': 'So I think that it actually is good policy. And as Councilmember Walsh, I think astutely pointed out, that we're trying to do this at no cost or low cost to the landlord. It's I had actually had my staff figure out where the forms were and how it is to be done.'",
        "'speaker_0': 'So I'd like to think of this legislation. And again, I want to thank community and councilmembers for stepping up with this legislation and just thinking of that here in Seattle, we will do everything possible to make it convenient for voters to vote.'",
        "'speaker_0': 'It's one of our most important civic duties. And so in that sense, I think this is a great direction to go. And again, I want to applaud those that have thought of it, and it's my pleasure in supporting it.'",
        "'speaker_0': 'Any further comments and we will vote. Councilmember.'",
        "'speaker_2': 'Just a quick question if.'",
        "'speaker_0': 'I ask.'",
        "'speaker_2': 'Before. I know. I know, but I.'",
        "'speaker_0': 'Couldn't help myself, could you?'",
        "'speaker_2': 'Well, you know, it's a good idea. Are we asking for landlords to actually put voter registration.'",
        "'speaker_1': 'Paper.'",
        "'speaker_2': 'In the packet or just an announcement or direction on how people can do it online? Not the actual forms. Okay.'",
        "'speaker_0': 'So it's part of a packet that is already we provide a packet already for landlords to give to tenants during the right.'",
        "'speaker_2': 'So a point that was brought up earlier, it's pretty easy to go online to change your voter registration. I just want to make sure people know about that tool as well. You know, they get something and they lose it.'",
        "'speaker_2': 'Yeah, actually, I mean, the online tools are important even for landlord tenant rights because Dems often seek they are I mean, they are information packet. They often many rely on the online version, but we don't want to just have the online version because there's lots of tenants, especially the tenants who need to register to vote and don't'",
        "'speaker_2': 'have access to that information are probably less likely to go online. So we want to make sure all of those are covered.'",
        "'speaker_0': 'And to sort of pile on at that point. Obviously, people are relocating when they're signing a new lease for an apartment. And so at that point is a sort of an opportune time to change your voter registration documents.'",
        "'speaker_2': 'That's a good reminder.'",
        "'speaker_0': 'It's a good reminder during their change of residence. Okay. So those please call the role on the passage of the bill.'",
        "'speaker_2': 'Sergeant, I.'",
        "'speaker_1': 'Beg your Herbold. Johnson. Whereas President Herrell I six in favor not opposed.'"
    ],
    "AN ORDINANCE related to the City Light Department and the Department of Parks and Recreation; declaring certain real property rights surplus to the needs of the City Light Department; and transferring jurisdiction of the former Lakewood Substation from the City Light Department to the Department of Parks and Recreation for open space, park, and recreation purposes.": [
        "'speaker_0': 'The bill passed and then Cheryl sign it please read the report of the park shall senator libraries and Waterfront Committee.'",
        "'speaker_3': 'The Report of the Park Seattle Center Libraries and Waterfront Committee. Agenda Item five Council Bill 11960. An ordinance related to the City Light Department and the Department of Parks and Recreation declaring certain real property rights surplus to the needs of the city light department and transferring jurisdiction of the former Lakewood substation from the City Light Department to'",
        "'speaker_3': 'the Department of Parks and Recreation for Open Space, Park and Recreation Purposes. The committee recommends a bill passed.'",
        "'speaker_0': 'Councilmember Worse.'",
        "'speaker_1': 'Thank you. This council bill would authorize Seattle City Light to transfer an old substation at Genesee Park to the Department of Parks and Recreation at a cost of 210,000. The committee unanimously recommends passage of the bill.'",
        "'speaker_0': 'Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Sergeant Bagshaw. High Herbold. Johnson. Whereas I President Harrell high six in favor and unopposed.'",
        "'speaker_0': 'The bill passed and chair of the Senate. Please read agenda item number six. You could read the shorter version.'"
    ],
    "AN ORDINANCE related to a settlement agreement between the City, the Washington State Department of Transportation, King County, and the Alliance for Pioneer Square related to an appeal of the Citys Final Environmental Impact Statement for the Alaskan Way, Promenade, and Overlook Walk projects; approving the agreement and authorizing the Directors of the Office of the Waterfront and the Department of Transportation to implement the terms of the settlement agreement.": [
        "'speaker_3': 'Agenda item six Council Bill 118975. An ordinance related to a settlement agreement between the city, the Washington State Department of Transportation, King County, and the Alliance for Pioneer Square. Related to an appeal of the city's final environmental impact statement for the Alaskan Way Promenade and Overlook Walk's projects, the committee recommends the council bill pass.'",
        "'speaker_0': 'Councilmember Worse.'",
        "'speaker_1': 'Thank you. The Pioneer Square Settlement Agreement. The settlement agreement is in response to an appeal of the final year for the redevelopment of Alaskan Way after the viaduct comes down. The agreement does eight things very quickly allows public access to the habitat bench, increases funding for East-West connections in the future.'",
        "'speaker_1': 'Proposed Leddy provides funding for the Alliance for Pioneer Square to assist with the construction, coordination and outreach. And the community extends existing low rate parking agreements for off street parking to support tourism and commercial activities. Coordinates. Bus schedules to not overload or slow transit flow on Alaskan way after light rail opens to West Seattle Metro will reduce'",
        "'speaker_1': 'bus traffic on Alaska way to not duplicate rail routes. It also to narrow Alaskan way from seven and eight lanes to five and six lanes. And finally, it maintains a two way traffic on Columbia Street. The committee unanimously recommends passage of the bill.'",
        "'speaker_0': 'Thank you very much. Then any further comments?'",
        "'speaker_3': 'Councilmember Herbold. Thank you. I just want to note that the provisions in the settlement include bus service from West Seattle White Center in Berrien. The busses that currently use the Alaskan Way Viaduct to access downtown Seattle will access downtown from Alaskan Way and that on Alaskan way.'",
        "'speaker_3': 'Metro will not operate more than 650 busses per day until sound transit light rail to the Alaska junction goes into service.'",
        "'speaker_1': 'And this would.'",
        "'speaker_3': 'Also apply when Alaskan Way opens to busses in 2020 until 2023, when light rail is planned to reach West Seattle. One thing I want to just note it's really important to keep in mind that busses will no longer be able to use the Alaskan Way Viaduct when that's removed in 2019.'",
        "'speaker_1': 'So for roughly a year, the busses.'",
        "'speaker_3': 'That we're talking about as part of the settlement will actually need to have an alternative or an alternate route to access downtown. This is something that I know Scott and King County are working to address in one city, one center city process.'",
        "'speaker_3': 'But there isn't a formal proposal yet to deal with this level of complexity that will significantly impact bus riders in West Seattle.'",
        "'speaker_0': 'Correct. Any further comments? Thanks for those comments, Councilman Herbold. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'So want make sure I herbold i Johnson Johnson whereas I President Herrell high six in favor and unopposed.'",
        "'speaker_0': 'The bill passed and chair of the Senate. Please read agenda item number seven. You can read the church title.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the Superintendent to amend the existing Operation and Maintenance Agreement between the Department of Parks and Recreation and the Seattle Art Museum concerning their roles in operation and maintenance of portions of Alaskan Way Boulevard and Myrtle Edwards Park that are operated as part of the Olympic Sculpture Park.": [
        "'speaker_3': 'Agenda item seven Council Bill 118979 An ordinance relating to the Department of Parks and Recreation Councilmember.'",
        "'speaker_1': 'Thank you. Seattle Art Museum Operations and Maintenance Agreement. This Council bill makes slight changes to an existing agreement with the Seattle Art Museum that was approved in 2006. Very briefly, this change would allow the Seattle Art Museum gives them responsibility to maintain vegetation on Edwards Park Beach, and it also gives the art museum the ability to enforce'",
        "'speaker_1': 'DPR rules governing public conduct on the boulevard near Sculpture Park and Myrtle Edwards Park. Beach enforcement, quote unquote, is generally educational. And for many people, all the rules of the Park Sale Art Museum would not be arresting people or giving out citations.'",
        "'speaker_1': 'The committee unanimously. Recommends passage of the bill.'",
        "'speaker_0': 'Thank you very much. Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Sergeant Bagshaw, I. Purple. Hi, Johnson. Hope for us. All right. President Herrell I six in favor nine opposed.'",
        "'speaker_0': 'The bill passed and share with Senate. Please read agenda item number eight.'"
    ]
}