{
    "AN ORDINANCE relating to the regulation of the for-hire industry, amending Sections 6.310.110 and 6.310.735 of the Seattle Municipal Code to add clarity to the qualifying driver description and extend the commencement date, and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'The bill passes and the chair will sign it. Please call the next urgent item, please.'",
        "'speaker_10': 'The report of the Full Council Agenda Item one Council Bill 118 783 relating to regulation of the for hire industry in many sections 6.3, 10.1 ten and point 735 of the Seattle Municipal Code. To add clarity to the qualifying driver description and extend the commencement date and ratifying confirming certain prior acts.'",
        "'speaker_2': 'Thank you very much. So as I said earlier and during the committee, the decision in front of the council's day, which is described in Council Bill 118793, relates to us enforcing a law that we did pass ordinance 124968 which basically set up a collective bargaining process for the drivers, whether you driver a taxi or for hire or'",
        "'speaker_2': 'TNC or Uber or Lyft in any of those cars, a process by which you can organize or a process by which you could reject organization. Ideally, we were hoping to have the rules defining who can vote. Then by September 19th, that's next Monday.'",
        "'speaker_2': 'The FAA, US Finance and Administrative Services have had some difficulty in making sure that they're getting all the data that they want. They want to know who's driving, where the driving, how many hours a day are they working?'",
        "'speaker_2': 'And so what we're trying to do now is simply give established a deadline by which they will make these rules. And as you may recall, the ordinance one two, 4968 did require that the department develop these rules. And you heard today, I think, testimony on opinions on the rules.'",
        "'speaker_2': 'And so what we're asking FAA has to do is to continue to have a dialog with all of these people, some of their their representatives, to come up with the rules that seem to make sense. We realize this is a very difficult task.'",
        "'speaker_2': 'There are going to be several opinions on who should be able to vote, what a qualified driver representative could be, what an exclusive driver representative could be, and the rules associated with that whole system of of a bargaining process.'",
        "'speaker_2': 'And and that's what we're doing in a setting up the deadline. So the new deadline in this legislation will be January 17th, which is after budget and after the well, not after the cold weather, that's for sure, will probably be a little chilly.'",
        "'speaker_2': 'But I'll give the FAA the option, do a lot of outreach meeting with you and we may contemplate another public hearing or not. That decision has not been made, but they will do the outreach and come up with the rules.'",
        "'speaker_2': 'Originally during committee we thought we might be able to accomplish that by November 18th, but the FAA has made it clear that they need the additional time to do the outreach they think is necessary. So that's all this legislation does, is set that deadline up until January 17th to come up with the rules that so many people'",
        "'speaker_2': 'are interested in. So are there any questions from any of my colleagues.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'That I can't remember.'",
        "'speaker_4': 'Thank you. Have a quick question. What is the status of part time workers being able to be part of the conversation for voting? Is that something FAA has to decide to take on, or is that something that we as a council can recommend?'",
        "'speaker_2': 'So you can recommend at any given point what you believe the status of a qualified driver should be. But the part time drivers, whether they're doing one trip, one a week or working 6 hours a week, have has the same say so in voice in the process as a full time driver, a person working 40 or 50'",
        "'speaker_2': 'hours a week. So there's been no arbitrary decisions on who has a voice during the stakeholder process. At the end of the process, there will be rules formed that will decide who gets to vote, who's a qualified driver to vote on whether the union process continues.'",
        "'speaker_2': 'But at this point, all voices are being heard and no one is being excluded.'",
        "'speaker_4': 'So do they have it as far as has not have an opportunity at the end of the process to make a decision on whether the drivers have to be full time, where they could get part time or they get a part time vote.'",
        "'speaker_4': 'Mean for example, what I'm hearing from the green shirts over here is that those who are not driving full time would like to have at least a percentage vote. So if they're working 2035. Sorry, I misunderstood what you were hearing.'",
        "'speaker_4': 'I heard from others saying that if they were driving at least some some percentage of the full time.'",
        "'speaker_8': 'Or part time when it's an independent.'",
        "'speaker_2': 'Contractor. So I'm sorry, but I'm an equal opportunity president. So if I hear more disruption, I'm going to ask that you be removed. And if you don't voluntarily be removed, I will have you removed. We've already received public comment.'",
        "'speaker_2': 'We're discussing this among ourselves. I know you're passionate about this. I understand that we are not making that decision right now. Sally Bagshaw As to who I think what I'm trying to say and maybe I'll make this crystal clear.'",
        "'speaker_2': 'A part time driver, a full time driver. All will be talked to during the process by which will define who gets to vote. And these folks can vote thumbs up or thumbs down on the union process. And what we're with the difficulty right now and the qualified driver issue is as a qualified driver, a person drives one'",
        "'speaker_2': 'hour a week or one trip a week. I drive, I vote, or some people do this full time, 40 or 50 hours a week, or should they be the ones? And so very emotional decision. But we're asking for us to make that decision through the rules.'",
        "'speaker_2': 'And they're going to listen to everybody and they're going to have again, they're going to have outreach meetings. They're going to take surveys. They're trying to get data as to how many trips are made. That's the process that will be completed by January 17th.'",
        "'speaker_2': 'Okay. Any other comments from any of my colleagues? Okay. With that, please call the role on the passage of the Bill.'",
        "'speaker_3': 'Herbold II Johnson IV. Whereas I O'Brien.'",
        "'speaker_7': 'II.'",
        "'speaker_3': 'So want I beg Sean Burgess I. Gonzalez All right. President Harrell All right. Nine in favor. Nine opposed.'",
        "'speaker_2': 'Thank you. The bill passed. And, Cheryl, sign it. Please call the next agenda item.'"
    ],
    "A RESOLUTION calling for a special election to fill a vacancy in the City employee-elected position on the Civil Service Commission and directing the City Clerk to administer the election.": [
        "'speaker_10': 'Resolution 31701 calling for a special election to fill a vacancy in the city, employee elected position on the Civil Service Commission and directing the city clerk to administer the election.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_8': 'Thank you. There are.'",
        "'speaker_2': 'So this this resolution is much less controversial. As you know, the Civil Service Commission is an independent body that is created by the city charter to hear appeals involving the administration of the personnel system, particularly with regards to disciplinary actions or alleged violations of the city charter, the personnel rules, etc..'",
        "'speaker_2': 'The Civil Service Commission consists of three members, including one member appointed by the mayor, one appointed by the council, and one member elected by eligible city employees. We have a vacancy in that commission by virtue of the departure of Mr..'",
        "'speaker_2': 'I'm sorry, Mr.. Steven Joel. I don't mean departure in a negative way. He is just dropped from the commission. And we certainly want to thank Mr. Steve and Joel for the outstanding and fine work that he's done. He's widely respected in arbitration, labor relations circles, but he is no longer on the commission.'",
        "'speaker_2': 'We have a vacancy, and this legislation simply adopts the process by which the election for that position can move forward by virtue of the departure. Any questions on this resolution? I can do this just by roll call, so please call the roll on the you know those in favor of adopting the resolution vote i i those opposed'",
        "'speaker_2': 'vote no. The ayes have it. The resolution is adopted and will sign it. Please go to the next agenda item.'"
    ],
    "A RESOLUTION supporting Washington Initiative Measure 1491 and urging Seattle voters to vote Yes on Initiative 1491 on the November 8, 2016 general election ballot.": [
        "'speaker_10': 'Agenda item three Resolution 31702 Supporting Washington Initiative Measure 1491 and urging Seattle voters to vote yes on Initiative 1481 on the November 8th, 2016 general election ballot.'",
        "'speaker_2': 'Thank you very much. So this resolution supports the initiative. 1491. I'm sorry. Here. I have a lot of paperwork in front of me. And as you well know, 1491 is an initiative to the people of our state relative to, I say, urging voters to vote yes relative to a law that would suspend a person's access to firearms'",
        "'speaker_2': 'if there's documented evidence that an individual is threatening harm to themselves or others because of dangerous mental illness or a high risk of violent behavior. And if you look at the substance of the resolution itself, and I'm not at this point in the proceeding, I'm just describing the context.'",
        "'speaker_2': 'This is not my pro or con statement. I'm just describing the context of the resolution. And then I will ask for comments, either pro or con, but the University of California in 2014 I'm sorry, there are several incidents that have saddened our country that are described in the legislation itself, such as the incident in 2014, the University'",
        "'speaker_2': 'of California in Santa Barbara here in 2013 and Cafe Racer 2006. Jewish Federation of Seattle, the Seattle shooting. We can list the types of egregious behavior we've seen in this initiative. 1491 is modeled on the successful laws around the country and is based on a well-established Washington state system protection orders to fill the gaps in the system'",
        "'speaker_2': 'that allow people experiencing crisis or demonstrating violent behavior to possess and purchase firearms. So as described in the resolution, the contents are for the public safety of all people, including those who harm themselves. And at this point, I will move to pass Council Bill three.'",
        "'speaker_2': 'I will move to adopt Resolution 31701 and then I'll ask for comments after has been moved to adopt as their second. Okay. I'm sorry. 702i move to adopt resolution 31731702. Is there a second? Okay. Now, at this point, are there any comments regarding this resolution?'",
        "'speaker_2': 'So hearing then from my colleagues again, I'll just say it. Councilman Burgess, did you want to say a few words? Please do.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'Council members, before you begin, I just want to make it clear as the rules that aren't known by many that the inclusion of our comments, we will hear comments from members of the public who wish to speak in opposition, and we will allow the same amount of time for those people as well as the rules require.'",
        "'speaker_2': 'Councilman Burgess.'",
        "'speaker_7': 'Thank you very much. This measure 1491, which we all get to vote on here in a few weeks at the November election, is another common sense measure around gun safety. The vast majority of gun violence incidents in the state of Washington and frankly, across the United States, almost three quarters of those cases involve suicide or unintentional shootings'",
        "'speaker_7': ', what some people refer to as accidental shootings. And in many of those cases, members of families or close personal friends are often aware of the looming crisis that is being presented to a family. And so with the passage of this initiative in November, family members will be able to go before a court and petition for a protection'",
        "'speaker_7': 'order, which may include the seizure of firearms in the possession of someone who is at great risk. And I hope that my colleagues will join in supporting this measure, supporting initiative 1491, and that the people of Washington state will likewise support that initiative.'",
        "'speaker_2': 'Thank you, Councilman Burgess. Any further comments from any of my colleagues? I do have at least one person who may want to speak in opposition to this particular item. And Mr.. Mr.. Locke, did you wish to speak on this item, sir, at all dealing with the Firearm Initiative Measure 1491.'",
        "'speaker_2': 'Did you wish to speak to that? You had signed up on several lists? No. Well, let me call for any public comment. Are there any members of the public comment that would like to speak in opposition to this particular resolution or to initiative measure 1491?'",
        "'speaker_2': 'He? We do. Please come forward, ma'am. And, Amelia, can you make sure this is safe?'",
        "'speaker_4': 'I didn't think I was going to be talking on this issue today. But I am Cynthia Lynette, the author, the artist who has produced a body of work called The Gun Show. It will be passed around. I'm very concerned about this resolution that anybody, a family member can take somebody to court.'",
        "'speaker_4': 'And I don't care about taking away their guns, but then they're going to be required to go through some kind of psychiatric help. And you know what that means?'",
        "'speaker_5': 'That means psychotropic drugs. And we do not want them anymore.'",
        "'speaker_4': 'So if you could put something in here that says we are not going to give these people psychotropic drugs or require them to take it, then I might consider this. Otherwise, it is not good.'",
        "'speaker_2': 'Thank you for your words. Do any of my colleagues wish to provide any further comments on this resolution? Okay. Hearing then those in favor of adopting the resolution vote i. I. Those opposed vote no. The motion carries. The resolution stopped and chair will sign it.'",
        "'speaker_2': 'Please read the next agenda item.'"
    ],
    "A RESOLUTION supporting Washington Initiative Measure 1433 and urging Seattle voters to vote Yes on Initiative 1433 on the November 8, 2016 general election ballot.": [
        "'speaker_10': 'Agenda item four Resolution 31703 Supporting Washington Initiative Measure 1433 and urging Seattle voters to vote yes on Initiative 1433 on the November eight, 2016 general election ballot.'",
        "'speaker_2': 'Thank you. So this resolution is calling on support for initiative Measure 1433, which is again urging Seattle voters vote yes on a minimum wage, statewide minimum minimum wage increase to $13.50 an hour by 2020. Again, I'm not saying I'm just describing the context of this resolution is projected to add up to $600, the increased minimum wage of'",
        "'speaker_2': '1433 passes to the pockets of more than 730,000 minimum wage workers in Washington every month is projected to add nearly 2.5 billion to the state's economy every year. And as I described this morning during a council briefing, the current Washington state minimum is $9.47 an hour.'",
        "'speaker_2': 'And so what I will do is describe what I will do is introduce it for a vote, and then I'll ask if any of my colleagues would like to speak on this resolution, which is supporting initiative Measure 1491.'",
        "'speaker_2': 'I move to pass actually. You know, the script is a little weird because. Because it's a resolution. I know. I will. I will. I'll just I'm going to deviate from the script just a little bit.'",
        "'speaker_5': 'I can't not.'",
        "'speaker_2': 'I move to adopt resolution 31703. Is there a second?'",
        "'speaker_6': 'Second.'",
        "'speaker_2': 'Okay. Now let's hear some comments, pro or con, from many of my colleagues relative to this resolution. I got council members who want.'",
        "'speaker_5': 'Getting my herbal.'",
        "'speaker_2': 'Tea. I got Councilmember Herbold.'",
        "'speaker_1': 'Was.'",
        "'speaker_2': 'I know Castro was like playing cleanup. So Councilmember Herbold.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_6': 'So just a few few thoughts here. Addition of 1433 is an incredibly important piece of legislation both for our businesses and our economy, as well as workers. Raising the minimum wage would provide nearly 2.5 billion in earnings.'",
        "'speaker_4': 'More for workers, over four over.'",
        "'speaker_6': '730,000 low wage workers across the state. We know that since those with low incomes are likely to spend additional resources on necessities like food and clothing, communities and businesses throughout Washington state will benefit as well. Women and people of color are disproportionately represented among those not being paid enough to make ends meet and so that they would'",
        "'speaker_6': 'especially benefit from this passage of this initiative. Just to give you a little bit of detail on how this would impact an average family for a person working full time, earning $10 an hour and increase to 1350 an hour would mean an extra 600 sorry, $607 per month to spend on rent, food, utilities or save for the'",
        "'speaker_6': 'future. That's a much needed boost for the over one in five parents in the state trying to raise kids on less than 1350 an hour, or for the young single adult trying to save for a car or school.'",
        "'speaker_6': 'I urge your support and yes, vote on this resolution.'",
        "'speaker_2': 'Thank you. Thank you. Councilmember Herbold. Customers want.'",
        "'speaker_9': 'Thank you, Brighton Hove. I am happy to have this opportunity to publicly support Initiative 1433 to raise the minimum wage throughout Washington State. I particularly wanted to thank all the organizers and activists who sacrificed time, money and energy to gather the hundreds of thousands of signatures that we needed to put on the ballot to achieve what our'",
        "'speaker_9': 'state legislators should have done themselves in the first place. All across the country, really? It has been regular working class people and activists who have forced the political establishment to raise wages through the power of our movements. Here in Seattle, it was the labor movement, Socialist Alternative and 15 now that put the $15 minimum wage on the'",
        "'speaker_9': 'agenda. And we got it passed six months after we elected a socialist. After 100 years in January of next year, workers of big businesses in Seattle will be going to the full $15 an hour. And as was mentioned before, this is going to disproportionately benefit the very people who are disproportionately negatively impacted by our system, which is'",
        "'speaker_9': 'women and people of color. In San Francisco, organizers in the labor movement have driven the process to increase the minimum wage. And all across the country, we are seeing minimum wage increase, as many of them to $15 an hour, because working class activists have been emboldened to fight for our rights by the successful example set by our'",
        "'speaker_9': 'movement. And SeaTac in Seattle and the Washington State movement is no exception. On the other hand, big business and the right wing has fought us tooth and nail. You only have to look at the example of Alaska Airlines, which has tried to disobey legal order after legal order in order to deny its workers and has recently suffered'",
        "'speaker_9': 'another defeat because the Supreme Court, the state Supreme Court in all the courts has sided with the workers. But we also have to be clear that the political establishment, which itself is tied to big business, has not made this easy for us, for us workers.'",
        "'speaker_9': 'Just to give you another ongoing example, as we fight for our state, minimum wage should be increased in Minneapolis. 50 now activists gathered tens of thousands of signatures to put $15 an hour on the ballot for November, and their city council refused to do it.'",
        "'speaker_9': '50 now took them to court and won. But then after that, nine out of the ten city council members made up entirely of Democrats appealed that decision to the Minnesota Supreme Court, which is made up of Republicans that Republican Supreme Court made a political decision to kick it off the ballot, reversing the substantial precedent.'",
        "'speaker_9': 'You can see this example of where corporate Democrats work with Republicans and against the interests of working people. But now the activists in Minneapolis are continuing to build their movement, continuing to try and hold council members accountable for this betrayal and to force them to enact $15 an hour through ordinance.'",
        "'speaker_9': 'I cite this example to again stress that these victories are only because of the strength of the movement. They are not because the Democrats and Republicans who have dominated politics in our country for a century and a half, suddenly woke up one morning and discovered that workers are not getting paid enough to make ends meet and decided'",
        "'speaker_9': 'to do something about it. So again, thanks to all the activists, to the labor movement, to making this initiative a reality. Thank you.'",
        "'speaker_2': 'Jim Acosta from Charlotte, thank you for that. With any of my colleagues like to lend any more words and customer.'",
        "'speaker_6': 'GONZALES Just really briefly, you know, I think this initiative is really important and not one of the things that we have mentioned is that it not only includes a raise of the minimum wage statewide, but it also includes a pathway to earning paid, sick and safe time in addition to that.'",
        "'speaker_6': 'And as we know here in Seattle, both of those measures have had a tremendous beneficial impact, not just for our workers, but we've also seen that it's good for business as well, because our economy certainly continues to grow in spite of these pro-worker, working family policies.'",
        "'speaker_6': 'You know, as somebody who grew up in rural central Washington, in fact, I was just there over the weekend visiting family. Again, I have an opportunity to see, you know, just the suffocation of poverty that exists in other parts of our state and throughout our state, particularly in rural parts of our state.'",
        "'speaker_6': 'And I think that this is a tremendous opportunity for the city of Seattle to step out and and stand with those members in in communities outside of the city of Seattle who may not have progressive leadership to really send a strong message that these policies are good for working families and that it's important for us to to'",
        "'speaker_6': 'make sure that we bring along the rest of the residents of Washington State in this effort to achieve social justice and in this effort to break the chains of poverty that keep so many women, particularly women of color and other communities of color, just in the cycles of poverty for generations.'",
        "'speaker_6': 'So I'm really excited about the fact that we are putting this resolution forward, and I am hopeful that the voters will agree with all of the sentiments that have been said here today and with what the with the work that the organizers are doing and that we will see victory come November.'",
        "'speaker_2': 'Thank you. Councilman Gonzales, any further comments from any of my colleagues? The rules require that we extend the same amount of time for any members of the public with I to oppose this resolution. So I would call a public hearing for any members who would like to oppose this resolution supporting an increase in the minimum wage.'",
        "'speaker_2': 'Yes, ma'am. Come forward.'",
        "'speaker_5': 'Thank you so much. I appreciate being able to speak. And I want to take my hat off to you for for this effort to raise the minimum wage. I just wish that you were older. I think that it's a wonderful thing.'",
        "'speaker_5': 'The difference between nine, nine, something and 13 something indeed will make a difference for people who are desperately trying to raise their families. But when you look at what it needs to be in this at this time, the minimum wage, you know, if it was the seventies, it would be 20 some dollars.'",
        "'speaker_5': 'And I know we're not there, but I know that if we're sincere about wanting to close the gap in this country, we've got to be bolder. And we've got to ask our leaders to be bolder about this. And 13 something is nice, but 15 something is nice.'",
        "'speaker_5': 'I just wish it were better. And maybe it means more. You need to do an income tax. Have an income tax in this state. And if we need to do that, then please, God, do that. Because what we got ain't working.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you very much, man, for your comments. I will conclude the public comment period. Any further comments from any of my colleagues? Carignan none. All those in favor of adopting the resolution vote i. I. Those opposed vote no.'",
        "'speaker_2': 'The ayes have it. The motion carries and the resolutions adopted and the chair will sign it. Please read the next agenda.'"
    ],
    "A RESOLUTION supporting Sound Transit (A Regional Transit Authority) Proposition 1 ballot measure and urging Seattle voters to vote Yes on Sound Transit Proposition 1 on the November 8, 2016 general election ballot.": [
        "'speaker_10': 'Item five Resolution 3170 for supporting sound transit Proposition one ballot measure and urging Seattle voters to vote yes on Sound Transit Proposition one on the November 8th, 2016, general election ballot.'",
        "'speaker_2': 'As I said during a council briefing this morning, this is a resolution supporting sound transit Proposition one ballot measure and urging Seattle voters vote yes on that proposition on the November 8th ballot. We could talk a lot about what this does by adding 62 miles of light rail and growing the existing system to 116 miles.'",
        "'speaker_2': 'But I'm going to stop there and ask if Councilmember Johnson or O'Brien would like to talk a little bit more about what this resolution. But because mine was context, I am going to move to pass it so we can have what I would assume will be some pro statements.'",
        "'speaker_2': 'So I'm going to move to pass council bill. I'm sorry, I'm going to move past resolution 31704. Is there a second? Second? Okay. Councilmember Johnson, would you like to begin.'",
        "'speaker_7': 'Thank you very much. Council President Harrell And when completed, if the voters choose to pass us to three November, our light rail system will actually be larger than Washington, D.C. metro systems. To put that into context for folks, there's a lot to like on this November ballot.'",
        "'speaker_7': 'This is yet another one of those measures that I think I'm hopeful that my colleagues will support. Regardless of where you sit on this day, as there's something in this ballot measure for you, whether you're building light rail to West Seattle in 14 years or to ballot in 19 years, both at grade separations, they've got travel time'",
        "'speaker_7': 'and speed reliability. Whether you're building infill stations at Graham Street or the 130th Street Station, whether you're looking at bus rapid transit improvements in Ballard and West Seattle and along Madison as part of our first five years Quick Wins program, whether they're talking about transit oriented development, affordable housing, where we're going to be putting more resources into'",
        "'speaker_7': 'both of those projects, completing the spine and regional growth, placemaking for the next 25 years is a critical path to ensuring that the region is economically competitive and can handle the growth that we're expected to see over the next 25 years.'",
        "'speaker_7': 'But the final, final couple of things I want to just say about this. As an environmentalist, I care a lot about this plan because transportation is our largest source of greenhouse gas emissions, and we need to get people onto transit to help reduce our fossil fuel reliance.'",
        "'speaker_7': 'If you care about job creation, as I do, this plan will put $54 billion worth of people to work, creating the next generation of great labor opportunities and labor projects and the associated job creation that goes along with all those major capital project investments.'",
        "'speaker_7': 'If you care about alleviating poverty, as I do, multiple studies have shown that access to fast and reliable public transportation is one of the most strong determiner to get people out of poverty and into the middle class. And if you care about the economy, as I do, this opportunity to build out our light rail system is going'",
        "'speaker_7': 'to provide so much more travel time and reliability for folks in this region to get them out of congestion. Just today, I got on a train that left our station a block away and got me to ask you stadium in under 10 minutes.'",
        "'speaker_7': 'That is a bus trip that used to take 45 minutes. So we need this and I hope my colleagues vote yes.'",
        "'speaker_2': 'Thank you very much, Councilwoman Johnson. Councilmember O'Brien.'",
        "'speaker_7': 'I thank you, Councilmember Johnson, for your leadership on this. And colleagues, I also hope we all support this. What we have before as the voters of the region, the peers, Snohomish and King County have an amazing opportunity before us this November.'",
        "'speaker_7': 'And it's an opportunity that I've heard from people throughout this region asking for it long before I was a city council member. Please get us a transit system that is speedy, reliable and gets me where I need to go.'",
        "'speaker_7': 'And this package does that. It's an opportunity, as Councilmember Johnson said, to address issues around mobility, around congestion and around the impacts of climate change. We're already seeing it's an outstanding opportunity, and I look forward to supporting this resolution and the ballot initiative in November, and I hope the voters of the region do also.'",
        "'speaker_2': 'Thank you from Bryan. Any other comments from any of my colleagues? Councilmember Herbold.'",
        "'speaker_6': 'Thank you. I'd just like to thank Councilmember Robert Johnson and Mayor Ed Murray for their work on this on transit board, Councilmember O'Brien for coordinating the very successful city council resolution to sound transit, stating what the city wanted.'",
        "'speaker_6': 'And also, of course, Sound Transit Board Chair and King County executive Dave Cosentino for all his fine work in developing the ballot measure.'",
        "'speaker_2': 'Thank you for those words. Councilmember Sawant.'",
        "'speaker_9': 'Thank you. President Herold. Seattle's transportation infrastructure is woefully inadequate. We asked. I was to drive their cars, less to say the environment correctly so, and to relieve congestion on our roads. But the reality is that we don't have adequate alternatives.'",
        "'speaker_9': 'So how can working people get to work on time and do everything that they need for their families without a car in the absence of real mass transit? Many working people understand the impending damages of climate change and would love to take alternative transportation, public transportation, but simply do not have real options that will enable them to'",
        "'speaker_9': 'get through their day without significant delays. Sounds at Sound Transit three will be a major and long overdue addition to our transit infrastructure, and even this will not be sufficient to our needs, but it will be a huge step forward.'",
        "'speaker_9': 'And I'm really happy that we as a council are urging people to vote in favor of it by passing this resolution. It should be noted, however, the proposal is not perfect. It is funded by sales taxes, which are the most regressive taxes available.'",
        "'speaker_9': 'Sales taxes tax poor and working class people at a far higher rate than the wealthy and they are a big part of the funding of this transit project is an important reminder that elected officials need to show leadership not only in supporting and passing progressive initiatives that enable us to deal with climate change, but we also have'",
        "'speaker_9': 'to make sure that it happens in an economically progressive manner. Ultimately, we need to stop using regressive taxes, and we need to start taxing the many millionaires of this region. However, that is not the fault. Just Dosanjh on the tree.'",
        "'speaker_9': 'It is true for all taxes in this city, county and state. And the reality is that Sound Transit three is a really important increase in transit. And so it is absolutely critical that we all as voters support this initiative.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Thank you. Concerns one. Any further comments from any of my colleagues? Okay. So at this point, I'm going to open up for public comments. For many members of the public that would like to speak in opposition of or in support of the resolution to endorse the sound transit measure.'",
        "'speaker_2': 'Do I see any members of the public? And yes, we do. We have two takers, and this is important that we get to our record. So is there a sign up sheet for these fine folks? Okay.'",
        "'speaker_8': 'Oops.'",
        "'speaker_2': 'Okay. Will do. Thank you.'",
        "'speaker_4': 'So, I'm Alice Lockhart. I came here in support of Standing Rock.'",
        "'speaker_5': 'But this is a really important issue.'",
        "'speaker_4': 'I want to echo what the other lady said.'",
        "'speaker_6': 'This is great.'",
        "'speaker_4': 'It's not enough.'",
        "'speaker_10': 'If you know.'",
        "'speaker_5': 'The science says that.'",
        "'speaker_6': 'We need to decrease our.'",
        "'speaker_4': 'Greenhouse gases in this state and elsewhere by 8% per year. If we start now and buy more, if we wait to do that, an incremental improvement in sound transit is not going to cut it. We need, in fact, in this region and we can afford in this region free transit for everyone, which will.'",
        "'speaker_10': 'As I.'",
        "'speaker_11': 'Believe it was, Mr. Johnson.'",
        "'speaker_4': 'Said, also lift many.'",
        "'speaker_6': 'People out of.'",
        "'speaker_11': 'Poverty and into the middle class as a mere side effect of free transit. I hope that's the next thing that you all think about.'",
        "'speaker_4': 'And thank you, Emily, for.'",
        "'speaker_6': 'Suggesting that today.'",
        "'speaker_2': 'Thank you. I had Mr. Locke actually signed up on this measure. Mr. Locke, if you want to speak on the sound transit measure, either pro or con on the sound transit measure.'",
        "'speaker_8': 'And Paul La Belle La. You've already given $6 billion. We can't afford another 2 billion. The rail system should be made and operated to operate like an elevator where you don't need the operators. That's where your cost is.'",
        "'speaker_8': 'Those people riding on those rigs. Get top salary because they can they can choose the job they take. You're driving a bus or ride Mercedes rail cars. The money is not there. It looks like us who live off investments.'",
        "'speaker_8': 'The. Bonds in that case tell today's don't have very large payments. But 2%. The last bond i owned was 9.6%. Melissa more bombs. But people are still paying the bill. They're going to get a bill. Property taxes. Inflated the properties.'",
        "'speaker_8': 'A $70,000 home is now you can sell the thing for $3 million or more. The people are going to be around when all these bills come due. I'm not going to make it. It doing like it did to the Roman Empire.'",
        "'speaker_8': 'You know, the history books that we used to have. Of 80. Plane is going up against the empire collapsed in.'",
        "'speaker_2': 'No, thank you. Thank you, Mr. Locke. Our next speaker on this resolution will be Paula Revere.'",
        "'speaker_5': 'Hi, champ. Thanks for the chance to speak. Nobody knew there were multiple sheets, by the way. Everybody outside. Hitler, abundant in opinions on all kinds of topics. Sound transit. I am totally pro transit as. As a kid growing up.'",
        "'speaker_5': 'I love trains and busses, and I waited as long as I could to get into a car. And it was because I had good instincts. Unfortunately, besides the tunnel ones which make absolute sense, taking up all the streets and all the parking spaces for our local businesses, I think was a terrible mistake.'",
        "'speaker_5': 'And I think there's a deliberate effort behind it. I won't get into that because not enough time. And it's not your deliberate effort. So what's happened is the streets are full of these things going by. And I know at some point there'll be thousands of people on them.'",
        "'speaker_5': 'But watching the city and all the parking and all the small businesses get hurt by all this construction and everything has been really hard to watch. 54 billion is twice the state budget. That's incredible for a very small percentage of the state's people to be driving, to be riding them.'",
        "'speaker_4': 'They have the double tall busses they could speed around.'",
        "'speaker_5': 'They're very.'",
        "'speaker_4': 'Flexible. We're getting transit like 15 years late.'",
        "'speaker_5': 'That was also deliberate. And then it got rushed in a certain kind of way and everybody was just so happy to have it. I don't think everyone thought enough about it so I wouldn't do it.'",
        "'speaker_4': 'I think that we need to stop and take a look at something more flexible.'",
        "'speaker_5': 'Because, you know, 20, 30 years out, this is outrageous for this kind of.'",
        "'speaker_4': 'Money. And I watch Sound Transit run.'",
        "'speaker_5': 'All those wonderful people that are there making votes. They ran the timetable. They ran the decisions. And I don't trust them. Thank you.'",
        "'speaker_2': 'Thank you, Miss Revere. I am going to there are any other people that like to speak in pro con on this resolution supporting sound transit measure. And if not, I will hold I will conclude that the a lot of time for public comment has expired.'",
        "'speaker_2': 'Okay. So we are ready to vote on this resolution. All those in favor of supporting the resolution vote? I think all those opposed vote no. The ayes have it. The resolution is adopted and the chair will sign it.'",
        "'speaker_2': 'Please read the next agenda item.'"
    ],
    "A RESOLUTION proclaiming the City of Seattles Support for the Standing Rock Sioux Tribes Opposition to the Construction of the Dakota Access Pipeline.": [
        "'speaker_10': 'For adoption of other resolutions. Resolution number 31709 proclaiming the City of Seattle support for the Standing Rock Sioux tribe's opposition to the construction of the Dakota Access pipeline.'",
        "'speaker_2': 'Thank you very much, Councilmember Juarez.'",
        "'speaker_4': 'Thank you very much. Before I begin, I just want to thank the tribal leadership and community that showed up here today. It really means a lot to all of us who've worked hard on this. I want to thank you, President Harrell, for helping me and assisting me early on.'",
        "'speaker_4': 'Like to thank Councilmember Sawant and Councilmember Herbold for their.'",
        "'speaker_5': 'Comments and their additions to make this a stronger.'",
        "'speaker_4': 'Resolution. I want to end with just a few words, and I promise I won't be more than 2 minutes. I want to start with the statement that we believe in Indian Country, that the sacred is the sacred. We can go back and forth about the National Historic Preservation Act, which was passed in 1966.'",
        "'speaker_4': 'We can go around and around about the Clean Water Act, which was passed in 1948 and 19, 1972. We can go around and around about the Rivers and Harbors Act, which was passed in 1899, oldest federal environmental law in the United States.'",
        "'speaker_4': 'But we also know that the Standing Rock Sioux people were signatories to two treaties, the treaties of Fort Laramie in 1851 and the treaty in 1868. We also know that after over 200 years of federal law, Indian law jurisprudence, that treaties are the supreme law of the land.'",
        "'speaker_4': 'So I want to end with this. Tribes, Native Americans, indigenous people, my people have been here since time immemorial. And the passage of this resolution and the support by this community in the city of Seattle in support of the Standing Rock and Standing Rock Sioux tribe, is immense.'",
        "'speaker_4': 'So again, I want to end with this. The sacred is the sacred. And thank you.'",
        "'speaker_2': 'Thank you. Councilmember Suarez. Councilmember so watch.'",
        "'speaker_9': 'Thank you, president haaland. Thank you so much, Councilmember Suarez, for your comments. Since April, despite a longstanding media blackout that actually council member Suarez mentioned this morning. We have seen explosive growth in the movement against the Dakota Access pipeline.'",
        "'speaker_9': 'In many ways, the fight against a good access pipeline is reminiscent of the struggle that activists waged against Keystone XL and related struggles against pipelines by tribes and environmentalists in Canada. But where the Keystone XL struggle took years of organization, mobilization and resource resistance to see results, the No Dakota Access Pipeline movement has broken through to the'",
        "'speaker_9': 'mainstream in just a matter of months, and it's a reflection of the times that we live in. We live in times of social movements. In part, this breakthrough is also due to the recent organizational experience that we have gained tribes, environmentalists, young and old activists over the last few years.'",
        "'speaker_9': 'We've seen a broader level of engagement and an overwhelming and historic display of unity between tribes and communities rooted along the pipeline. Nearly 200 Indian nations, numerous environmental organizations and thousands of other activists have turned out to stand with the Standing Rock Sioux tribe against the pipeline, both at the Sacred Stone camp and around the country.'",
        "'speaker_9': 'Hundreds of the nonviolent demonstrators at the Sacred Stone camp have faced severe intimidation and repression, including state authorities in North Dakota, cutting off water and medical access to campers, the issuing of warrants and the arrests and of activists and journalists.'",
        "'speaker_9': 'The physical attacks on activists by attack dogs and pepper sprayed by the multinational paramilitary private security firm G4 as hired by the pipeline's corporate backers. Despite the Department of Justice's action last week, the fight against the Dakota Access pipeline is far from over.'",
        "'speaker_9': 'As we know, we need to continue to build solidarity, national and international and demand nothing less than an end to the pipeline itself. State and local authorities must drop all charges against the tens of tribe members and organizers with warrants, particularly the dozens who have already been arrested or charged.'",
        "'speaker_9': 'Among those charged are Democracy Now! Journalist Amy Goodman and Green Party presidential candidate Jill Stein. The tribes and environmentalists and socialists on the ground know that allowing new pipelines to be built is a massive step in the wrong direction in the fight against climate change.'",
        "'speaker_9': 'It's a massively wrong step for our entire planet. Young people, children know it. Hundreds of millions of people around the world understand it. Then why does this keep happening? It keeps happening. Because the control of these resources is in the hands of oil corporations who are driven blindly by private profits and short term gains.'",
        "'speaker_9': 'And it's not like they don't have the IQ to understand the problem. They don't have the incentives to support the solutions. And that is why this is a question of political control. We cannot let the oil executives, the 1%, the multibillionaires, continue to drive climate change in their pursuit of profits.'",
        "'speaker_9': 'We cannot let the capitalists burn through every last extractable barrel, destroying our planet and destroying the rights, the basic rights of our indigenous communities. We need to organize independent of those corporate forces. We need to win this fight.'",
        "'speaker_9': 'And to win this fight, we will need to continue to wage defensive struggles like this one. But sisters and brothers, that is only the beginning. We need to take the fight to the very doorstep of those who profit from the perpetuation of this fossil fuel economy.'",
        "'speaker_9': 'And for that for that, we need to continue to build our mass movements, not only fighting these defensive struggles, but really fighting to move away from fossil fuels and going towards an economy that provides a path away from fossil fuels, towards renewable energy for living wage jobs, unionized jobs, education, health care and social services.'",
        "'speaker_9': 'But all of this depends on developing those mass movements that unite with one another across race and across ethnicities, ethnicities, but being clear that the 1% is not on our side. And for this, we also need the development of an independent party of the 99% that refuses to take money from big oil, a party that would promote'",
        "'speaker_9': 'and unabashedly socialist platform that can bring about a sustainable, economy, wide societal change we need. I wanted to thank Matt Rumley for authoring the first draft of this resolution. Gabe Galindo, Molly Kennedy, and everybody from our local community who weighed in on this.'",
        "'speaker_9': 'I especially wanted to thank Councilmember Juarez and everybody in her office who played a leadership role to work on this resolution. I'm very proud sisters and brothers to stand with the Standing Rock Sioux in this fight, and I thank them most of all for declaring their opposition and resistance to this pipeline.'",
        "'speaker_9': 'We will. We can and we will defeat the Dakota Access pipeline. And we can. And we will continue to build a mass movement necessary to win a just, sustainable and socialist economy for all.'",
        "'speaker_2': 'Council member Bagshaw. I believe you have your hand up.'",
        "'speaker_4': 'Thank you. I'm not going to be anywhere near as specific as council members want, but I do want to say thank all of you that are in the audience today. Something that Councilmember Suarez said this morning that really resonated with me is that we are here to protect the.'",
        "'speaker_5': 'Resources.'",
        "'speaker_4': 'And that's what you are doing today. And I want to recognize the tribal nations that are here together, also those that have been fighting this North Dakota pipeline. But recognizing that it's really our opportunity in response to protect the earth and protect the water and protect each other.'",
        "'speaker_4': 'Thank you for this. I will, of course, be supporting it. And I want to say thanks to my holy mountain sister. Thank you.'",
        "'speaker_2': 'Thank you. Council Councilmember O'Brien.'",
        "'speaker_7': 'Thank you. I want to thank my colleagues for their work on this. If I can get untangled here, this is a great step today. And I want to just share a couple of comments that I heard over the weekend about what was happening back in North Dakota and why we need to continue, why this resolution is still'",
        "'speaker_7': 'relevant today and it's going to require a lot of work going forward. I had a chance to hear from Tom Goldtooth, who's a Native American activist and executive director of the Indigenous Environmental Network, who had been out there last week.'",
        "'speaker_7': 'And it was appalling to hear the swiftness with which that pipeline company moved when they heard that the challenges were going to come on that land. Unfortunately, it's not altogether surprising, but within a day they completely demobilized and re mobilized on the site to commence the destruction of the habitat and the sacred lands as soon as possible'",
        "'speaker_7': 'to try to avert the type of challenge and that we have. Corporations that are willing to not just do evil, but to accelerate their evil is just it's unforgivable. And the stories Mr. Goldtooth told of other activists and the physical scars they had from when the dogs were unleashed on them, they will be with them for the'",
        "'speaker_7': 'rest of their lives. It was great to hear. Well, it was awful to hear that the judge ruling. It was great to hear how swiftly the Obama administration moved with their Justice Department and Army Corps of Engineers to reconsider that.'",
        "'speaker_7': 'That was a victory, a short term victory for a couple dozen miles of the pipeline. But there are almost a thousand miles of pipeline that are not affected by that. And all of this needs to be changed. Thank you for your leadership in bringing this to.'",
        "'speaker_2': 'Councilmember member. Whereas you we're going to we're going to take it home here. I want to hear that drum beating in a little bit here. But I see a hand and it comes over.'",
        "'speaker_6': 'HERBAL Thank you. I just wanted to say a bit about the fact that the protest of members of the Standing Rock Sioux tribe, hundreds of other Native people and their supporters, has sparked the need for national reform. Thanks to your sacrifice, the federal government has signaled its intent to really get serious about the enforcement of Article 32'",
        "'speaker_6': 'of the U.N. Declaration on the Rights of Indigenous People, requiring that governments consult with indigenous people, and I quote, in order to obtain their free and informed consent prior to the approval of any project affecting their lands or territories or other resource.'",
        "'speaker_6': 'The Obama administration's Justice Department, in its joint statement with the Army and the Department of the Interior, also in very, very importantly, said this case highlights the need for a serious discussion about nationwide reforms with respect to considering the tribe's view on these types of infrastructure projects moving forward.'",
        "'speaker_6': 'I believe it's really important to support your efforts to organize as part of that nationwide reform so that the disregard for the rights of Native people that occurred at the Dakota Access Pipeline Project does not reoccur. And thank you, Councilmember Suarez, for your leadership on this issue.'",
        "'speaker_5': 'You're welcome.'",
        "'speaker_2': 'Councilmember words. Would you just like say a brief closing? We've heard some very inspirational words from our colleagues.'",
        "'speaker_4': 'I. As Indian people were not raised to say I in me. So I had to learn.'",
        "'speaker_5': 'To transition, to say I in me.'",
        "'speaker_4': 'But I think today when I say I and me, I think you all know I mean you as well. We like to end with a story. And my story is very short.'",
        "'speaker_5': 'I could go over the three big briefs I read and.'",
        "'speaker_4': 'All the information.'",
        "'speaker_6': 'There, but that would be boring. When I worked.'",
        "'speaker_5': 'For a particular governor. Governor Lowry.'",
        "'speaker_4': 'One of my very.'",
        "'speaker_5': 'First staffing was with a major tribe, the accommodation and the tribes on the Columbia River.'",
        "'speaker_4': 'And a huge, huge hydropower source on the Columbia River. And I remember was.'",
        "'speaker_5': 'One of my first or second staff ins.'",
        "'speaker_4': 'And I remember the tribes opened by prayer and calling the Columbia River the giver of life. And I remember the power company started out with calling it the hydro. Power source. And I remember.'",
        "'speaker_5': 'Governor Lowery pulling.'",
        "'speaker_4': 'Me.'",
        "'speaker_5': 'Aside and going, What the hell? And I said, yes.'",
        "'speaker_6': 'This is the world.'",
        "'speaker_4': 'I walk in, the giver of life and a hydropower source.'",
        "'speaker_5': 'And somewhere in between we have to find a way to do the right thing for all of us.'",
        "'speaker_4': 'And as Indian people, we've done it through prayer.'",
        "'speaker_5': 'And we also know as Native American people.'",
        "'speaker_4': 'We've done it. So the power of pulling together.'",
        "'speaker_5': 'And recognizing that this world isn't ours, that this universe isn't ours.'",
        "'speaker_4': 'And it's been difficult for me sometimes in this job to to behave and speak differently. But I hope that I have served you well. And I.'",
        "'speaker_6': 'Want to thank all of you.'",
        "'speaker_5': 'Particularly tribal leadership, for being here, because I know my colleagues.'",
        "'speaker_4': 'Were anxious to hear from you. So it's good to see my brothers and sisters and aunties out there.'",
        "'speaker_5': 'Thank you. Thank you, President.'",
        "'speaker_2': 'Thank you very much for being with us. I'm simply going to say what a beautiful native community we have. And it's our honor to support you and fight with you. Thank you very much. Those in favor of adopting the resolution vote i.'",
        "'speaker_2': 'I. Those oppose vote no. The motion carries. The resolution is adopted and the chair will excitingly sign it. Thank you very much. Oh. Oh, yeah. Thank you. Thank you. Now for something less dramatic. Oh, sorry, customer.'",
        "'speaker_8': 'I was just.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon the Gaslight Inn, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_2': 'Let's move back to agenda item, I believe. 24 please read that, that agenda item into the record.'",
        "'speaker_10': 'The Report of the Affordable Housing Neighborhoods and Finance Committee Agenda Item 24 Council 118 768 Relating to historic preservation posing controls upon the Gaslight in a landmark designated by the Landmarks Preservation Board under Chapter 25.2 of the State of Mississippi Code native to the table historical landmarks contained in Chapter 25.32 ceremonies because the committee recommends the bill'",
        "'speaker_10': 'passed.'",
        "'speaker_2': 'Councilmember Burgess, thank you.'",
        "'speaker_7': 'This is a piece of legislation that imposes controls upon the gaslight in which is a residential structure up on Capitol Hill. And I passed out a map to my colleagues, and you can see that this is located on the west side of 15th Avenue between East Olive and East Howell Street.'",
        "'speaker_7': 'This building was built in 1904 and was designated as a historic landmark in 19 2015. The controls we are about to adopt are those specified by the Landmarks Preservation Board.'",
        "'speaker_2': 'Thank you very much. Are there any questions for council members on this legislation? Matt, please call the role on the passage of the bill.'",
        "'speaker_3': 'Herbold. JOHNSON Whereas I. O'BRIEN Sergeant Bagshaw, hi.'",
        "'speaker_7': 'BURGESS Hi.'",
        "'speaker_3': 'GONZALES President. Herald Hi. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon the J.W. Bullock House, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_2': 'Thank you. The bill passed. And Cheryl, sign it. Please read the next agenda item.'",
        "'speaker_10': 'Agenda item 25 cancel 118 769 relating to historic preservation opposing controls upon the J.W. Bullock house, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 Ceremonies for code and adding to the table of historical landmarks contained in Chapter 25.32 code.'",
        "'speaker_10': 'The committee recommends the bill pass and.'",
        "'speaker_7': 'Burgess Thank you. This is another ordinance establishing controls upon the J.W. Bullock house. I passed out a map that shows where this house is located. It's at 1220 10th Avenue, east between East Highland Drive and East Gaylor Street.'",
        "'speaker_7': 'It's essentially across the street from St Mark's Episcopal Cathedral on Capitol Hill. The house was built in 1912. It was designated as a historic landmark in 2015. The controls we will establish by passing this ordinance were specified by the Landmarks Preservation Board.'",
        "'speaker_7': 'As with both the Gaslight Inn and this J.W. Bullock house, the owners and residents of these two homes are enthusiastic in preserving the historic character of these buildings in their neighborhood. So committee urges us to pass this as well.'",
        "'speaker_2': 'Thank you. Councilman Burgess, any comments on this legislation? If not, please call the rule on the passage of the bill.'",
        "'speaker_3': 'Herbold. JOHNSON Whereas I. O'BRIEN Hi, Sergeant Bagshaw.'",
        "'speaker_7': 'Burgess I.'",
        "'speaker_3': 'Gonzalez President Herrell Aden favor nine opposed.'",
        "'speaker_2': 'The bill passed and chair of the Senate. Next agenda item, please.'"
    ],
    "AN ORDINANCE relating to property at Sand Point, authorizing the Housing Director to execute an amendment to and partial termination of the lease of City of Seattle land authorized by Ordinance 122459, as amended pursuant to Ordinance 123195, to remove three parcels from that lease; authorizing new leases of the removed parcels to YouthCare and Friends of Youth and deeds from the City to convey the buildings on those parcels to the lessees for the duration of the new leases; and authorizing related documents and actions.": [
        "'speaker_10': 'Agenda item 27 cancel 118 787 relating to property at some point authorizing the housing director to execute an amendment to end partial termination of the lease of City City of Seattle line authorized by ordinance 1224 959 as amended pursuant to Ordinance 1 to 3 195 to remove three parcels from the lease authorizing new leases of three new'",
        "'speaker_10': 'parcels to youth care and friends of use and deeds from the city to convey the buildings on those parcels to the lessees for the duration of the new leases and authorizing related documents and actions. The Committee recommends the bill pass.'",
        "'speaker_2': 'Customer Burgess.'",
        "'speaker_7': 'Thank you. This ordinance deals with three homes in the Sandpoint Magnuson Park complex. I passed out a map. Colleagues, these three buildings are building three 3331 and 332 at the south end of the Magnuson Park complex. This legislation transfers the ground lease from the organization Solid Ground to Youth Care and Friends of Youth.'",
        "'speaker_7': 'Those two organizations are currently operating these structures as youth group homes, and this will allow that to continue. With the new ground lease. In December of 2015, the Office of Housing awarded capital financing to Friends of Youth and Youth Care for rehabilitation and remodel of these homes.'",
        "'speaker_7': 'The ordinance simplifies that the management and lease is transferred to these two new organizations are not the organizations are not new, but the two new leaseholders.'",
        "'speaker_2': 'Thank you very much. Councilmember Johnson.'",
        "'speaker_7': 'Just want to say the Office of Housing Funding is critically important, but also is going to be done in collaboration with friends of youth and youth care so that these facilities continues to open during the renovations, which is going to be really important for those folks that are living in those facilities.'",
        "'speaker_7': 'Incredible organizations doing incredible work. They are the ones that are doing the work on the ground. Now, this just changes that ownership, as Councilmember Burgess said, between solid ground. Two Friends of care, really excited to have this in front of us.'",
        "'speaker_7': 'Another example of the city. Do a good job of helping get folks back on their feet.'",
        "'speaker_2': 'Excellent. Any further comments from any of our colleagues with that? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Herbold II. Johnson, i. Suarez I. O'Brien Sergeant Burgess. Gonzalez by President Harrell Rite Aid in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the disposition of two City Urban renewal properties in the Yesler-Atlantic Redevelopment Project Area; adopting competitive procedures for disposition of the properties; authorizing the Director of the Office of Housing to dispose of the properties designated Parcel 7B and Parcel 56 in the project area; designating the disposition of sales proceeds; superseding Ordinance 122017 and Resolutions 27260, 28866, and 29852 with respect to the sale of the properties; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'The bill passed and chair will sign it next. Agenda item.'",
        "'speaker_10': 'Please. Agenda Item 28 Council Bill 118 788 Relating to the disposition of two city urban renewal properties in the Yester Atlantic Redevelopment Project area, adopting competitive procedures for disposition of the properties authorized authorizing Director of the Office of Housing to dispose of the properties designated parcel seven B in parcel 56 in the project area designated the dispositions'",
        "'speaker_10': 'of sales proceeds superseding ordinance 1220 17 and Resolutions 272 62 eight 866 and 298 52. With respect to the sale of the properties in Red nine confirming certain prior acts, the committee recommends the bill pass.'",
        "'speaker_2': 'The Councilman Burgess.'",
        "'speaker_7': 'Thank you. This ordinance authorizes the sale of two surplus parcels in the Seller Atlantic Neighborhood Project area. This is the old urban renewal project for this particular part of Seattle. I passed out a map for each of you.'",
        "'speaker_7': 'One of these properties is at 1429 South Jackson Street, near the bottom of the map, and the other is at 1415 East. Yes, the way the proceeds from the sale of these two parcels will be dedicated to affordable housing.'",
        "'speaker_7': 'And the legislation express expresses our intent that these proceeds from the sale will fund the acquisition of an existing 30 unit building in the central area, which currently has expiring affordability restrictions and will otherwise be available for sale on the private market.'",
        "'speaker_7': 'This structure is located at 14th and East Osler way, so we'll sell these two prop parcels and then invest this money in the 30 unit structure at 14th and yes way.'",
        "'speaker_2': 'Thank you, Councilman Burgess. Councilmember Herbold.'",
        "'speaker_6': 'Thank you. I just want to underscore that with this one action, we are actually going to be implementing two of the recommendations, one being the use of surplus city property for affordable housing purposes, and the other one focused on the need for preservation of existing low income housing.'",
        "'speaker_6': 'And so I thank the Office of Housing for bringing forward this piece of legislation that accomplishes a lot.'",
        "'speaker_2': 'Very good. Any further comments from our colleagues?'",
        "'speaker_7': 'And hopefully we can do it again many times. Yeah. Yeah.'",
        "'speaker_2': 'Except please call the role on the passage of the bill.'",
        "'speaker_3': 'Herbold i Johnson. Whereas. O'Brian. Hi.'",
        "'speaker_7': 'Sergeant Burgess. Hi.'",
        "'speaker_3': 'I President Herrell. I aid in favor and unopposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Is there any further business to come before the council? And before we adjourn, I did commit to listening to public comment after our adjournment. And so we will adjourn and I will stick around.'",
        "'speaker_2': 'If anyone wanted to continue to talk about the public comment, anything on public comment that they weren't afforded the opportunity to hearing no further business coming for the council. Thank you very much. Have a great day. And we stand adjourned.'"
    ]
}