{
    "AN ORDINANCE relating to taxation; delaying the effective date of the heating oil tax on heating oil service providers under Chapter 5.47 of the Seattle Municipal Code; and delaying the date of the Office of Sustainability and Environments first annual heating oil tax program status report.": [
        "'speaker_1': 'We have seven items in front of us today. Will the clerk please read the first one into the record? Agenda Item one Council Bill one 2270 relating to taxation delaying the effective date of the heating oil tax on heating oil service providers under Chapter 5.47 of the Sound Fiscal Code and delaying the date of the Office of'",
        "'speaker_1': 'Sustainability and Environment First Annual Heating Oil Tax Status Report. Apologize for that on camera. Thank you, Madam Clerk. I moved to pass Council Bill 1201278. Thank you. So, second. Thank you. Thank you. It's been moved and seconded. Councilmember Morales.'",
        "'speaker_1': 'It's all your. I'll you. All you.'",
        "'speaker_5': 'Thank you. Council President, colleagues, we received a very helpful memo from our central staff member, Yolanda Ho. But just in summary, we have twice now delayed the heating oil tax. So I want to we have at least one new colleague.'",
        "'speaker_5': 'So just want to give a little bit of background. And we did have a heating oil tax proposed. We delayed it twice. The idea here is that revenue from this heating oil tax would be used to support transition to heat pumps away from from oil, particularly supporting low income families and making that transition revenue would also provide'",
        "'speaker_5': 'important job training programs for workers who would be adversely impacted by a shift away from fossil fuels and would also provide public education on reducing reliance on fossil fuels. I do want to thank the staff at the Office for Sustainability and Environment.'",
        "'speaker_5': 'They've been doing a lot of hard work on these programs and on trying to help understand the best way for the city to move forward. And I don't want I want to make sure folks understand that I'm very supportive of the programs themselves.'",
        "'speaker_5': 'But I have heard from families in my district, at least, who are very concerned about the expense of a heating oil conversion, worried that it would be cost prohibitive for them even with the support that would be offered by this program.'",
        "'speaker_5': 'I know that the Office of Sustainability and Environment folks see this as a tax on oil dealers and on just the notion of dirty oil. But the reality is that this would very likely get passed on to families.'",
        "'speaker_5': 'And so the proposed delay would put a pause on some of the activities mentioned. But we do have a jumpstart fund funds. The Jumpstart spending plan allocates 9% of tax proceeds for investments to advance Green New Deal initiatives.'",
        "'speaker_5': 'The Green New Deal Advisory Board was recently seated and is beginning its work. So when I spoke with O.C. and with the board advisor, the staff specifically, as we indicated, that the board, you know, this could be something that they include in their discussion and in their recommendations for the 2023 budget process.'",
        "'speaker_5': 'So again, I want to be clear, I'm not objecting to the program itself. I think it's important that we move Seattleites away from a reliance on fossil fuel to more efficient, sustainable heating and cooling. But I am asking for a pause on implementation of this tax because it is a regressive tax and we need an opportunity to'",
        "'speaker_5': 'find a different revenue source. So I'm happy to take questions if there are any questions. But but I do think that we need to make sure we have state and local systems set up to help those who can't afford this conversion and can't afford to pay the tax.'",
        "'speaker_5': 'And we aren't quite there yet. So I'm hoping for basically maintaining status quo while we give the Green New Deal Oversight Board an opportunity to study this and bring some recommendations to us.'",
        "'speaker_1': 'Thank you, Casper Morales. Are there any questions for Councilmember Morales? All right. Not seeing any. Will the clerk please call the roll?'",
        "'speaker_2': 'Also member Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Councilmember Morales.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Councilmember must get off I. Councilmember Nelson.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Councilmember Pierson.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Councilmember Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Herbold. Yes. And Council President Suarez. I eight in favor and unopposed.'",
        "'speaker_1': 'Thank you. The motion carries, the bill passes and the chair will sign. It will Leclerc, please. To fix my signature to the legislation. So let's move on to item number two. Councilmember Herbold but in a minute. Clerk Can you please read that into the record?'"
    ],
    "AN ORDINANCE relating to staffing shortages in the Community Safety Communications Center and the Seattle Police Department; retroactively authorizing a one-month hiring bonus incentive program for hiring 911 dispatchers and police officers; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Agenda item to the Council Bill one 2272 Relating to staffing shortages in the Community Safety Communication Center and the Seattle Police Department retroactively authorizing a one month Irene bonus incentive program for Harry 911 dispatchers and police officers and ratifying confirming certain prior acts.'",
        "'speaker_1': 'Thank you. I move to pass council bill 120272. Is there a second second? It's been moved and seconded and let's move forward. Casper Herbert, this is yours. It's all you.'",
        "'speaker_4': 'He said it's council bill 1202 72 provides retroactive approval for $220,000 in bonuses for five police officers in 14 901 dispatchers who are hired during the month of January 20, 22. Last October, former mayor issued an emergency order to provide for hiring bonuses for officers and dispatchers.'",
        "'speaker_4': 'Council allowed that emergency order to go forward, but voted to modify the emergency order to limit on his program the end of 2021. No funding was included in the 2022 budget. There were proposals for for funding a bonus program, including one that I co-sponsored.'",
        "'speaker_4': 'Council adopted a request for a report. Mark would be due on March 1st on a potential citywide bonus program and voted and the emergency order again at the end of 2021. Spoke to the mayor's office about yesterday and we are carefully examining this issue and have let us know that we can expect receive a report on a'",
        "'speaker_4': 'city wide program in mid-March. To the saga of the n uary extension. Contrary to the council's action. I just want to note that for the for the public record that the departments continued the bonuses after receiving a directive from the former mayor on December 30th, 6 p.m., claiming that the council's action limit executive order was not accurate'",
        "'speaker_4': '. And the U.S. Attorney's Office has noted that they provided no such advice and we may not know what more can mean. We wrote based on consultations with legal counsel, it has been concluded the city council's action to limit the emergency order were not effective.'",
        "'speaker_4': 'I discovered in late January that is incentive was still being offered.'",
        "'speaker_1': 'I really sincerely appreciate that.'",
        "'speaker_4': 'Seattle Police Department, with Diaz's direction, provided Mayor Durk and Senator direct of us exactly as soon as I inquired about the situation of the bonuses. And I thank the Herald administration immediately in both departments to cease offering the bonuses as soon as they found out about this.'",
        "'speaker_4': 'We are committed to working together to ensure the officers and partners for the bonus are provided with it and this legislation is the result. I'm very grateful the administration is taking a collaborative approach to governing is a relief.'",
        "'speaker_4': 'Have a mayor and an administration that recognizes council support as we work to resolve together.'",
        "'speaker_1': 'If you cancel a rehearsal, are there any comments or concerns before? If I do need to suspend the rules, which I don't see that happening yet, are there any comments or questions or concerns for cast member her? Okay.'",
        "'speaker_1': 'I see none. So with that, I no need to suspend the rules. Will the clerk please call the role of the passage of the bill?'",
        "'speaker_2': 'That's my brother.'",
        "'speaker_3': 'Is there still a debate happening here?'",
        "'speaker_1': 'Yeah. You came in a little late. Do you want to speak? You can.'",
        "'speaker_3': 'I just wasn't quite sure if we were asking questions of central stuff first.'",
        "'speaker_1': 'Well, I was I got a move to suspend the rules to do that, but I didn't see anyone raise their hand. Okay, now we got to. Okay. So do you have questions for Councilmember Herbold or do you have questions for Ali Petrucci.'",
        "'speaker_3': 'And some questions for Central satisfy me.'",
        "'speaker_1': 'Okay. So let me move to suspend the rules so we can allow Ms.. Pinochet to respond. If there's no objection, the council rules will be suspended to allow the new acting director for central staff to address any questions or concerns council any council member may have.'",
        "'speaker_1': 'All right. See? No objections. The rules are suspended. Go ahead, Casper Mosqueda.'",
        "'speaker_3': 'Thank you very much. And I did see Councilmember Morales's hand up first before me. I'm happy to wait my turn as well. Okay. Thank you very much, Councilmember Herbold, for the summary of this legislation either. The important thing here, I think, to underscore is that this legislation is not something that was council driven.'",
        "'speaker_3': 'This is the council trying to be responsive to a situation that's been forced upon this council yet again by the previous mayor. The mayor, former Mayor Durkan, who adopted an emergency order on October 29 of last year, offered dance and bonuses as counts, as Councilmember Herbal noted.'",
        "'speaker_3': 'But I think what's important to note is that it's very clear that council had expressed that we would be voting to modify that ordinance on November 22nd. In addition to that, I want to just ask Ali Punchy a question about the specific provisos that were placed not on the Community Safety Communications Center, but on the Seattle Police'",
        "'speaker_3': 'Department. Ali, can you please from excuse me, Deputy Director Fiduciary, could you please remind me about how the letter that was sent on December 31st by the mayor violates what the council had put in place regarding provisos on Seattle Police Department spending.'",
        "'speaker_5': 'Thank you. Good afternoon. Council President whereas chair mosquito council members and the I don't have the letter in front of me, but in general, when the Council adopted the 2022 budget, they also adopted a resolution modifying the emergency order that former Mayor Durkan had issued authorizing the hiring incentives.'",
        "'speaker_5': 'The modification to that emergency order only provided authorization to provide hiring incentives to speed officers, as well as DCC dispatchers through the end of 2021. And the assumption was that they would use 2021 salary savings to cover those costs.'",
        "'speaker_5': 'It did not provide any authorization to offer hiring incentives beyond that date. In addition, the budget adoption ordinance imposed a proviso on Spd's 2022 budget prohibiting the use or the spending of any salary savings that they might achieve in 2022 on any for any purpose without authorization from the Council.'",
        "'speaker_5': 'So what that means is there was a budget provided for the assumed staffing plan for SPD for 2022. Any sort of delay in hiring or not filling positions results in some salary savings. SPD does not have authorization to spend any of those salary savings unless specific authority is provided by the Council.'",
        "'speaker_5': 'So that means when Mayor Former Mayor Durkan issued a letter to the Seattle Police Department and the Community Safety and Communication Center, directing them to continue giving the hiring incentives, it was both in violation of the emergency order that the Council had modified, as well as the proviso, because there was no budget authority for SPD to provide'",
        "'speaker_5': 'those the payments of hiring incentives in it. So so in this bill, what it does is it says that it provides retroactive authority only for those offers made in January of 2022 and allows provides the authority to spend $50,000 of spd's salary savings to make those payments.'",
        "'speaker_5': 'The CSC does not need that same authority because the Council did not restrict the use of salary savings as long as they are generally using the funds consistent with the intent of the budget summary level that those funds were appropriated to the CSU.'",
        "'speaker_5': 'So you can just make the payments for speedy needed authority from the council.'",
        "'speaker_1': 'Thank you. Energy customers are Moscow. Did you have any follow up before I go to Cast Member Morales?'",
        "'speaker_3': 'Well, I did have one follow up, if I might, Madam President. You know, when I looked at this legislation and again, I want to I want to note the unfortunate situation that we're in. I don't think it's fair to the employees who've been offered employment or a hiring bonus.'",
        "'speaker_3': 'And it's not fair to this council who was very clear about our intent, both related to policy and the specific provisions placed on the provisos within Seattle Police Department. And I'm thankful to those who've accepted employment offers and want to serve as public servants to the city of Seattle.'",
        "'speaker_3': 'But wanted to be clear that we had provisions in place expressly trying to have a policy conversation around hiring bonuses for this year that Councilmember Herbold had noted and also on budgetary, had intentionally had a proviso that was in scope intending to really keep an eye on Spd's funding.'",
        "'speaker_3': 'So as we look at Seattle Police Department specifically in recognizing that's only about $50,000 of the total amount here. I did ask central staff it was possible to amend the legislation to recoup the specific amount that is being offered for individuals to a city.'",
        "'speaker_3': 'From the author of that letter, being the former mayor is correct that the existing title does not allow for me to make that type of amendment this and this ordinance here today.'",
        "'speaker_1': 'So did you have a question of Miss Bonacci, or are those your general comments in regards.'",
        "'speaker_3': 'Know that that last sentence was a question? Deputy Director If an issue, is that correct, that I cannot amend today's legislation given the current title?'",
        "'speaker_5': 'That is correct. The title doesn't account for that scenario, and we would need to do additional work to understand if that is legislatively possible to do.'",
        "'speaker_3': 'That's my questions, Councilperson.'",
        "'speaker_1': 'Okay, good. Thank you. Councilman Morales.'",
        "'speaker_5': 'Thank you. Council president, I. I think. Councilmember points covered what I wanted to ask and just want to state that I look forward to working with the mayor who understands and respects the separation of powers and brings some management experience to the executive branch.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Okay. So now that we have suspended the rules, allowed council members to ask questions of the acting director, Ali Panaji, are there any other general comments before I call? Ask the clerk to call the roll or the vote.'",
        "'speaker_1': 'Oh, healthcare mosquito.'",
        "'speaker_3': 'Thank you very much. Again, I want to thank the chair of finance as his vice chair of finance, chair public safety for the work that she's doing here. And the senior deputy mayor, along with the Herald administration for quickly calling attention and a stop to this practice, echoed Councilmember Morales's sentiment of the importance of equally important but'",
        "'speaker_3': 'separate branches of government working together on these issues moving forward. I will continue calling to see what we can do to look for other ways to recoup the expenses specific to SVT. But in this legislation, it doesn't sound like it's possible to do that.'",
        "'speaker_3': 'I do think it's in on the factors that led us to this decision today are really unacceptable and look forward to addressing those with your colleagues and the current mayor in a different venue. Not supportive of how we got here, but due to the position that we're in, I will be supporting this in this moment, but we'll'",
        "'speaker_3': 'be looking forward to having greater reconciliation on both the finances and the policy that led us here after today.'",
        "'speaker_1': 'Member Herbold, is there anything else you want to add before we go to the vote? Over to you. Okay. Thank you. So will the clerk please call rule on the passage of the bill?'",
        "'speaker_2': 'Councilmember Lewis?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'Councilmember Morales. As Councilmember Mosqueda Councilmember Nelson.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Councilmember Peterson.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Councilmember Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Herbold. Yes. And Council President Suarez. I n favor and unopposed.'",
        "'speaker_1': 'Thank you. The motion carries. The bill passes. The chair will sign it. And will the clerk please affix my signature to the bill? Let's move on to item number three for Councilmember Nelson. Madam Clerk, will you please read item number three into the record?'"
    ],
    "A RESOLUTION declaring the intention of the City Council to hold a public hearing relating to changing the assessment rate for the Seattle Tourism Improvement Area.": [
        "'speaker_1': 'Agenda item three, Resolution three, 2043 declaring the intention of the City Council to hold a public hearing relating to the changing the assessment rate for the Seattle Tourism Improvement Area. Thank you, Madam Clerk. I move to adopt resolution 32043.'",
        "'speaker_1': 'There a second.'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'It's been moved and seconded. Councilor Nelson.'",
        "'speaker_4': 'Thank you very much. Council President So the Seattle Tourism Improvement Area was established by Council in 2011 to help promote leisure tourism within Estes boundaries, which is the downtown core and waterfront stay rate. Players are hotels with more than 60 rooms and the current rate is $2 per occupied room.'",
        "'speaker_4': 'Night stays. Ratepayer Advisory Board voted in January 2022 to approve an increase in the assessment rate to $4 per occupied room to change assessment rates of a bia. R c. W 35.87 e requires that Council first adopt a resolution that states the city's intention to change the rate, describes the proposed change and sets the date and location'",
        "'speaker_4': 'for a public hearing on the proposal at least 15 days in advance of the hearing. So that's what resolution 3 to 0 for three debts. The RC W also requires that the public hearing resolution be published in the Daily Journal of Commerce and mailed to all potential ratepayers at least ten days prior to the hearing.'",
        "'speaker_4': 'The legislation that would effectuate the proposed assessment rate change. CB 120273 will be discussed in the March 9th Economic Development, Technology and City Light Committee meeting. The public hearing is scheduled for the following meeting on March 23rd for possible vote on that date.'",
        "'speaker_4': 'So that's the legislative process that we've got before us, and that's what Resolution 32043 actually does. As to the merits of the increase in the rate from $2 to $4 per occupied room night. This has the full support of the community, including the SGA membership and the hospitality industry that gets business from hotel guests.'",
        "'speaker_4': 'So, you know, Seattle hotels have fallen behind our neighboring cities in their ability to market themselves to visitors, whereas CEA has has had the same flat rate since 2011 over ten years. Portland's rate, for example, is 2% of the room rate.'",
        "'speaker_4': 'So as room prices increase, so does their marketing revenue. So this rate increase is one means to help our hotels recover from the pandemic and support the revitalization of our downtown core. And adoption of this resolution is the first step in that process.'",
        "'speaker_4': 'Are there any questions?'",
        "'speaker_1': 'Are there any crimes of Councilmember Nelson? Thank you. And I look forward to that because I know I'm the vice chair on your committee. So thank you, Councilmember Nelson. I don't see any questions or comments and no one's raising their hand.'",
        "'speaker_1': 'So with that, Madam Cleary, please call the roll.'",
        "'speaker_2': 'That's remember, Lewis?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Morales. This Council member must get up. I Council Member Nelson. I Council Member Petersen. I Council member Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Council member herbals. Yes. And Council President Juarez. I eight in favor and unopposed.'",
        "'speaker_1': 'Thank you. The motion carries, the bill passes. And Madam Clerk, the chair will sign it. And Madam Slurpy, please affix my signature to the resolution. Thank you. All right. Let's move on to item number four. I see this is Councilmember Strauss.'"
    ],
    "Application of Wallace Properties - Park at Northgate, LLC for a contract rezone of a site located at 10735 Roosevelt Way NE from Lowrise 3 with an M Mandatory Housing Affordability (MHA) suffix (LR3 (M)) to Midrise with an M1 MHA suffix (MR (M1)) (Project No. 3033517; Type IV).": [
        "'speaker_1': 'So, Madam Clerk, will you please read item into the record? Report of the Land Use Committee agenda item for a quick file. 314441 application of Wallace Properties Park at Northgate LLC for a contract result of a site located at 10735 Roosevelt, way northeast.'",
        "'speaker_1': 'The committee recommends that the court file be granted as conditions. Ben Clark My understanding is that I just hand it over to Councilmember Strauss. I don't move it. There's nothing to move the clock file. I believe so. Amelia, can you confirm, please?'",
        "'speaker_2': 'That's correct. Council President Flores. Council members also provide the committee report on the recommendations of the committee.'",
        "'speaker_1': 'Okay, great. Thank you, Councilmember Strauss.'",
        "'speaker_0': 'Thank you. Capps President Clerk File 31441. As you mention, is the application for a contract breakdown of 10735 was about waive work fees from our 3m2pmr. With that one suffix. This is an application for a contract free zone of two parcels located at 10735 and 10713 Roosevelt way northeast of the 55 the North Cape Urban Center from'",
        "'speaker_0': 'low rise three with a mandatory housing affordability designation to mid-rise with a higher two one mandatory housing affordability designation. The two parcels are adjacent to the natural area on Thornton Creek, which includes an environmentally critical multiple environmentally critical areas.'",
        "'speaker_0': 'The sites are about 5.5 acres in total. Unlike most contract rezoning applications we see, this application does not include a concurrent master use permit application. We did see this once before in the last few months with another location of 3050 Northeast Fire Recall correctly.'",
        "'speaker_0': 'This means that future development of the site will still require a master use permit application and all of the associated reviews at best. There was one appeal filed to the CPD decision for its application, which was dismissed by the hearing examiner.'",
        "'speaker_0': 'The hearing examiner recommended approval of the application with several conditions which are contained in the court file. One condition was that the developer assigned an environmentally critical area covenant restricting the future development within the riparian management area on site.'",
        "'speaker_0': 'As you heard me mentioned yesterday, I would only bring this contract zone forward if that agreement had been finalized. And Kettl Freeman of Council Central Staff has confirmed we received the signed and finalized agreement, which should be which is reflected in the register and is sent out to all legislative to all council members earlier today.'",
        "'speaker_0': 'Additional conditions recommended by the hearing examiner include that the future development will comply with the MHRA with MHRA by building affordable units on site, and that future development on the north site will provide a pedestrian connection, a public pedestrian connection between Roosevelt Way and Eighth Avenue.'",
        "'speaker_0': 'Thank you. Council president, that is the committee report on the Clarke file. Up next will be the council bill that is associated and that is the item which I believe you have to be.'",
        "'speaker_1': 'Well, thank you for that, Councilmember Strauss. Before we get to item number five, so with item number four in the clock file, are there any comments for Councilmember Strauss? All right. Not seeing any. Will the clerk please call the rule on granting the clerk file as conditions are as explained by Councilmember Strauss.'",
        "'speaker_2': 'Council member, Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Morales?'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Councilmember must give up.'",
        "'speaker_5': 'Hi.'",
        "'speaker_2': 'Councilmember Nelson.'",
        "'speaker_4': 'AI.'",
        "'speaker_2': 'Councilmember Peterson.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Councilmember Strauss.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Herbold. Yes. And Council President Juarez.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Eight. In favor and unopposed.'",
        "'speaker_1': 'Thank you. The clerk file is granted as condition, and the chair will sign the findings, conclusions and the decision of the city council. Will the clerk please a signature to the findings, conclusions and decision of the City Council on my behalf.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Chapter 23.32 of the Seattle Municipal Code at page 16 of the Official Land Use Map to rezone two parcels located at 10735 Roosevelt Way NE from Lowrise 3 with an M Mandatory Housing Affordability Suffix (LR3 (M)) to Midrise with an M1 Mandatory Housing Affordability Suffix (MR (M1)); and accepting a Property Use and Development Agreement as a condition of rezone approval. (Application of Wallace Properties - Park at Northgate, LLC, C.F. 314441, SDCI Project 3033517-LU)": [
        "'speaker_1': 'Thank you, Madam Clerk. Moving to item number five, it's Councilmember Strauss again, madam. Please read item five into the record. Agenda item five Council Bill one 2275 Relating to land use and zoning amending Chapter 23.32 of the Seattle Municipal Code.'",
        "'speaker_1': 'At Page 16 of the official land use map to rezone two parcels, the committee recommends the bill pass. Thank you, Councilmember Strauss. Chair of the committee. You are recognized.'",
        "'speaker_0': 'Go ahead. Thank you. Counsel Present Colleagues Council Bill 120275. Is the Associated Counsel bill with the clerk file we just discussed? So this is the correspondent counts bill for the contract reason we just approved it. Effectuate the rezone of these two parcels as you as usually occurs when we approve contract reasons, we will have to amend the'",
        "'speaker_0': 'Council Bill to have executed property use and development agreement, in part to ensure that the record does reflect the protections, the covenants for the environmentally critical areas. With that, I move to amend Council Bill 120275 Exhibit B by substituting the UM executed property use and development agreement with the executed properties and development agreement.'",
        "'speaker_1': 'Second. Can I do that?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Okay. So council member Strauss moved it. Council President Seconded. Are there any comments on the substitute? Okay. I'm not seen any. So we will move forward. Will the clerk please call the role on the adoption of the substitute to Exhibit B?'",
        "'speaker_2': 'Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Morales?'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Councilmember must gather. I Councilmember Nelson.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Council member paterson.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Council member Strauss.'",
        "'speaker_0': 'S.'",
        "'speaker_2': 'Council member herbals and Council President Plus.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'H in favor and unopposed.'",
        "'speaker_1': 'So the motion carries in the substitute is adopted and the amended bill is now before council. Are there any further comments on the amended bill? All right. I do not see any. Madam Clerk, will you please call the roll on the amended bill?'",
        "'speaker_2': 'Councilmember Lewis.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember what else?'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Councilmember Mosqueda. Councilmember Nelson, I. Councilmember Peterson.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Councilmember Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Herbold. Yes. And Council President Juarez. I h in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passes as amended, and the chair will sign it. And will the clerk please to fix my signature to the legislation on my behalf? Thank you. So we have adoption of other resolutions on our agenda, and item number six is mine.'"
    ],
    "A RESOLUTION adopting the Statements of Legislative Intent for the 2022 Adopted Budget and 2022-2027 Adopted Capital Improvement Program.": [
        "'speaker_1': 'So, madam, could we please read number six into the record? Agenda Item six Resolution three 2045. Adopting statements of legislative intent for the 2022 adopted budget and 2023 2027.'",
        "'speaker_0': 'Adopted capital.'",
        "'speaker_1': 'Improvement program. Thank you. I moved to adopt resolution 32045. Is there a second?'",
        "'speaker_4': 'I can.'",
        "'speaker_1': 'I can speak you. It's been moved and seconded as sponsor of the resolution. I will address this item on the floor. Two Comments. This resolution formally adopts the statement of legislative intent, which we call slides the City Council approved during its review of the 2022 proposed budget and the 2022 to 2027 proposed capital improvement program, also known'",
        "'speaker_1': 'as the C. This slide reflects the Council's policies intent as it applies to the 202022 adopted budget and the 2022-2027 Adopted Capital Improvement Program. Yes. Okay. So slide committee assignments and due dates are reviewed by essential staff at the beginning of each calendar year.'",
        "'speaker_1': 'Any changes are reflected in attachment one to the resolution, which I believe you all have. After that, is there any comments that any of my colleagues would like to make to this resolution? I should also add we have acting director Ms..'",
        "'speaker_1': 'Pernetti here in order to anybody has any questions, and I'll move to suspend if we do not have any questions and I will not move to suspend and I will just continue with the agenda. Okay. Not seeing any.'",
        "'speaker_1': 'Well, the clerk please call the role on the adoption of the resolution.'",
        "'speaker_2': 'Councilmember Lewis?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Morales.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Councilmember Mashaba. Hi. Councilmember Nelson.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Councilmember Peterson.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Councilmember Strouse.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Councilmember Herbold. Yes. And Council President Juarez. I age in favor and unopposed.'",
        "'speaker_1': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it. And will the clerk please affix my signature to the resolution that we just passed? Moving on to item number seven. This is also mine. Madam Clerk, we please read item seven into the record.'",
        "'speaker_1': 'Agenda item seven, Resolution three, 2046, adopting the Seattle City Council's 2022 work program. Thank you. I moved to Adobe Resolution 32046. Is there a second, Lieutenant? Thank you. Councilmember Skinner. It's been moved and seconded as sponsor of this resolution.'"
    ]
}