{
    "AN ORDINANCE relating to funding for housing and community development programs; adopting The City of Seattle 2019 Annual Action Plan to the 2018-2022 Consolidated Plan for Housing and Community Development and authorizing its submission to the United States Department of Housing and Urban Development; authorizing acceptance of grant funds from that department for programs and activities included in the Annual Action Plan; amending Ordinance 125724, which adopted the 2019 Budget, by modifying appropriations to various departments and budget control levels in the 2019 Adopted Budget; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_1': 'And to cancel 119550 relating to the funding for housing community developed programs, the committee recommends the bill pass.'",
        "'speaker_0': 'Kasper Back show.'",
        "'speaker_2': 'Thank you. So at our last financing committee, neighborhood committee, you will remember that we were looking at the 2019 Annual Action Plan. And what happens here is that it is a grant that we will be able to accept.'",
        "'speaker_2': 'It's roughly $2 million more than what we had identified during our budget for the Community Development BLOCK Grants and for other housing opportunities for persons with AIDS and a couple of others. So the recommendation from the committee is that we approve the grant and move forward with accepting $21,167,444.'",
        "'speaker_0': 'Sounds like a good idea to me. Any other questions or comments on this bill? Not please call the role on the passage of the bill herbold ii.'",
        "'speaker_1': 'Whereas I Macheda i Pacheco. I Suwannee Bayshore High Gonzalez, President Harrell I eight in favor and unopposed.'",
        "'speaker_0': 'The bill passed chair of the Senate. Please read the report of the housing. Health, Energy and Workers Rights Committee.'"
    ],
    "AN ORDINANCE relating to contracting by the Human Services Department; providing that the Seattle Human Services Department provide a cost increase when renewing or renegotiating contracts to address escalation in costs and specifying how and when to apply the increase; amending Section 20.60.102 of the Seattle Municipal Code to exempt human services contracts from the provisions of Chapter 20.60; and adding a new Section 3.20.060 to the Seattle Municipal Code.": [
        "'speaker_1': 'The Report of the Housing, Health, Energy and Workers Rights Committee. Agenda Item three Accountable 119 542 Relating to contracting by the Human Services Department, providing that the Seattle Human Services Department provide a cost increase when renewing or renegotiating contracts to address escalation in costs and specifying how and when to apply the increase in Manning Section 20.60 .102'",
        "'speaker_1': 'of the settlement occurred to exempt Human Services contracts from the provisions of Chapter 20.60 and adding a new Section 3.20 .06 to the systems code. The committee recommends that all passes amended.'",
        "'speaker_0': 'Thank you very much. Customer I'm a skater.'",
        "'speaker_4': 'Thank you very much, Mr. President. I would love to maybe speak at the end and also support you in your amendment. If you'd like, I could either second your amendment or move your amendment.'",
        "'speaker_0': 'Okay, so we would like to make the amendment first for the basically. Yes. Okay. So I will move amendment, I guess I'll call it amendment number one. And in addition, you have a copy of the amendment and it was probably circulated on a timely basis and I think central staff for that.'",
        "'speaker_0': 'Basically what it does is we heard a lot of testimony about how underpaid the the employees doing this kind of work are. And I don't think there was any disagreement. However, it occurred to me that some of the language I thought in the bill could have been a little stronger to making sure that is clearly our intent'",
        "'speaker_0': '. And we understand that there are high fixed costs in these nonprofits and other costs that they just don't have control over. But I thought a strong policy statement saying that we get that too, but we also get the fact that these are underpaid jobs and we want to recognize that.'",
        "'speaker_0': 'So that's what the amendment does. Number one, the number two we've had some of us have been around where we've had real tough times where, you know, a recession and where we had to really sharpen our pencil to make some tough cuts and some policy statements that we had this around 2008 or so.'",
        "'speaker_0': 'Some policy statements that we said during then were why we have to make these real tough cuts, that the work that you all do, the work that Human Services do, we are preserving that. The work is so critical to protect our most vulnerable that in our budget deliberations, this is so critically important that we recognize you have'",
        "'speaker_0': 'to preserve, if not even enhance the funding. So the other language of this amendment captures that, and I think it's read by say by saying the critical role we recognize, the critical role that human services organizations fill. And it's our intent to fund annual adjustments in times of both economic prosperity and economic hardship.'",
        "'speaker_0': 'So that's what the amendment does. And I will formally move it, move it consistent with what I described. Councilmember Mosquito's second it. Any other comments on the amendment?'",
        "'speaker_3': 'I'll take a.'",
        "'speaker_4': 'Comment. Mr. Personnel.'",
        "'speaker_0': 'Councilmember Mosquito.'",
        "'speaker_4': 'I just want to thank you, Mr. President, for bringing this amendment forward. I think it is a really smart idea to make sure that we express the Council's strong desire that these annual adjustments are received by our provider organizations and in dealing with the fixed and variable costs, as we create greater stability for the organizations, our desire'",
        "'speaker_4': 'is absolutely in line with what both the CEOs, the executive directors and the frontline staff have said. We want to see wages stabilized. We want to see workers stabilize and the turnover and vacancy rates addressed. So I really appreciate you underscoring that in the amendment.'",
        "'speaker_4': 'I also think it's important that we, through your amendment, underscore our commitment to investing in the critical role that these human service provider organizations, frontline staff and their leaders provide to our city. And by fulfilling the city's intention to fund the annual adjustments in times of both economic prosperity and economic hardship, I think really recognizes that more'",
        "'speaker_4': 'people are going to need these various services, especially in times of economic hardship. Very much appreciate you bringing this forward and working with our office on this and will be an enthusiastic yes on your amendment.'",
        "'speaker_0': 'Thank you. Castro administrator. Sort of like we have a few newlyweds here. Sort of like those wedding vows, for better or for worse. Okay. Any more comments before we vote on the amendment? Okay. It's been moved in, seconded all those in favor of the amendment.'",
        "'speaker_0': 'Only just the amendment. Please vote. I. I opposed. The ayes have it. The legislation is amended. I'll turn it back over to. I'm a skater.'",
        "'speaker_4': 'Thank you, Mr. President. I am very excited to bring forth to the Council this amended human service provider inflationary adjustment legislation. If it pleases the President. I may wait to make my comments at the very end. Sure closes out.'",
        "'speaker_0': 'Sure. So many people have worked on this legislation, so now would be the time to talk about if you'd like. I give you the option to talk about any comments you say before councilmember skater closes. Debate on it and I'll wait.'",
        "'speaker_2': 'Councilmember Bagshaw Thank you so much. Councilmember Misgendered Councilmember Herald Thank you for both bringing the amendment and for your staunch support. And I want to say thank you to all you and the community for the tremendous work that you.'",
        "'speaker_2': 'Do we know that people that are suffering on the streets, people that are suffering from behavioral mental health, they need your help more. And that warm handoff is more important than anything else that any of us can do.'",
        "'speaker_2': 'So I want to.'",
        "'speaker_1': 'Acknowledge how difficult.'",
        "'speaker_2': 'And challenging the work is and for our friends in the public defenders for the work you're doing on lead. We know that that makes a huge difference as well. So I want to say I support this. I had brought forward an amendment that I was really more focused on the budget to make sure that future councils had'",
        "'speaker_2': 'an opportunity to make decisions about what was going to be required going forward. We know that that amendment didn't pass. I am in full support of moving forward, in support of you, and also acknowledging that in the future, if difficulties are faced because of budget, the budget, climate, whatever it might be, future councils and the executive can'",
        "'speaker_2': 'make their own decisions. So I do want to acknowledge just how strongly I feel about the work you're doing. And I also want to respond to somebody in the audience who said it's a good first start. Well, actually, the good first start was last budget when we did add an additional 1.75 to 2% for this exact thing'",
        "'speaker_2': '. So now we're adding another 2%. I'm proud of that. And just Godspeed.'",
        "'speaker_1': 'In all your work.'",
        "'speaker_0': 'Thank you, Councilman Bagshaw and Councilmember Herbold.'",
        "'speaker_1': 'Thank you. I just want to add that there's been talk about the council exercising budget, budgetary discipline. And it's my opinion that this piece of legislation is actually an expression of our budgetary discipline. This is us saying that when we enter the budget negotiations this year that this is our top priority and it's very similar to what'",
        "'speaker_1': 'we've done in previous years. It's precisely in tough economic times when prior councils have passed resolutions or budget priority letters sent to the mayor, saying that our intention was to hold Human Services harmless to two cuts in past years.'",
        "'speaker_1': 'This is a this is a this piece of legislation is an expression of our values. And future councils may have different values, but this is an expression of our values at this time and my values for as long as I'm on this council.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_0': 'Both, stated Councilmember Herbold. Any other comments before we turn it back over to Councilmember Swan?'",
        "'speaker_2': 'Thank you, President Herrell. I'm glad to be voting yes on this ordinance to try to prevent or at least help prevent human service funding in our city from falling even farther behind than it already has. I really am grateful to all the organizations, the workers and the unions that have advocated for this, including SEIU, Healthcare, 1199 Northwest'",
        "'speaker_2': '. This bill requires human service provider funding to be increased with inflation. And let's be clear, this is not some kind of largesse. If the funding goes up in step with inflation, it just means that they break even. And as the speakers in public comment have stated, not only today, but in on other occasions, that not only are'",
        "'speaker_2': 'the wages not keeping up with inflation, it's also the other costs that all the nonprofits face, including utilities, which they are on the hook for. They can't get go to City Light and say, we can't pay the bills.'",
        "'speaker_2': 'They have to pay those bills. So this is absolutely the bare minimum the city can and should do. As I mentioned in the committee meetings discussing this legislation, at the heart of this problem, of course, is the chronic underfunding for social services over the past several decades.'",
        "'speaker_2': 'The federal funding for housing and mental health services that was eliminated in the 1980s has never returned, and we are reeling from a vicious cycle downward. Social services has been outsourced in multiple cities, have been outsourced from the public sector to nonprofits.'",
        "'speaker_2': 'And once the political establishment offloads that responsibility, they systematically begin underfunding these nonprofit organizations. And so you have the situation where a corporation like Amazon pays no federal taxes and instead gets $129 million tax rebate from the thanks to the Trump tax cuts.'",
        "'speaker_2': 'Social service workers, homeless service workers are so underpaid that they cannot make their own rent. I think these stories are really poignant of of human service workers being a paycheck and a half away from being one of the people in need of the services themselves.'",
        "'speaker_2': 'And I just wanted to quickly, in terms of drawing connections between different struggles, also wanted to congratulate the Amazon warehouse workers around the country who are courageously going out on the prime day strike to protest dangerous working conditions and inadequate benefits and really against even, you know, having insecure scheduling.'",
        "'speaker_2': 'And they are being joined today by tens of thousands outside who are on on the streets protesting no tech for ice against Amazon's contract with ice. So I think these struggles are tied together. And we have to be clear.'",
        "'speaker_2': 'Also, the problem is not that some workers like that workers are paid more than human service workers. I think all working people deserve a high standard of living. The problem is that the biggest businesses and the billionaires are amassing the wealth of society into fewer and fewer hands.'",
        "'speaker_2': 'Under capitalism, economies have a cycle of booms and busts. When the economy is booming, big business makes massive profits, the wealthy get rowdier. And when the economy falls into recession, then then workers are asked to shoulder the costs under the false slogan of shared responsibility.'",
        "'speaker_2': 'We should reject this kind of mythology and understand that we have to fight for our rights. And whether it's a recession or a boom period, we don't accept a low living standard for the workers who make our cities and our services run.'",
        "'speaker_2': 'We need to fight to fully fund human services, which means that in addition to today's measure, we urgently need to tax big business and the super rich to provide those funds. I would also say that council members who have expressed concerns about so-called fiscal responsibility should not have repealed the Amazon taxes.'",
        "'speaker_2': 'Very easy way of addressing fiscal responsibility, which is expand public revenues in a city with the most regressive tax system in the entire nation. I also think as workers, we should note the ominous pronouncements that have been made that future councils and mayors may do other things.'",
        "'speaker_2': 'Yes, that is true, which is why we have to fight for taxes on big business today and enshrine it into law. We also need to fight for rent control to address the alarming rate at which people are being forced out of their homes simply because their rents are going up, out of control, and further overloading the responsibilities'",
        "'speaker_2': 'of the human service organizations. So for the human service workers, it is not going to be enough to increase wages, because if those wages are taken up by disproportionately high rent increases, then it still doesn't help. So we have to fight for this measure today.'",
        "'speaker_2': 'But also please join us and me, my office attendance union of Washington State and other organizations in the rent control movement. And specifically, I would like to invite you all to our rent control rally at the All Pilgrims Christian Church on Broadway at 500 Broadway East at 6 p.m. this Saturday, July 20th.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. I want. Any further comments before I turn it back over to comes from a skate. It comes from a stadium floor.'",
        "'speaker_4': 'All right. Well, thank you, Mr. President. Thank you, entire council. And thank all of you for turning out now to half a dozen community meetings just this year alone. I'm really excited to bring forth this legislation today in its amended version for final passage.'",
        "'speaker_4': 'I have to say that we've been working on this for half a year, but many of you have been working on this for over a decade. I see Allison out there and at the rally I said, you told me that this was something that we've been working on for for ten years, and she said at least ten'",
        "'speaker_4': 'years. So it's very exciting to be able to take this initial step. And Councilmember Bagshaw is correct. And I want to appreciate her leadership in last year's budget where the full council was able to include a 2% increase for both the non general fund and the general fund in last year's budget.'",
        "'speaker_4': 'That was an incredibly important first step, but we also at that point committed, committed to passing legislation to end the cycle of uncertainty, the uncertainty for providers as frontline workers, as the leaders of these organizations, and frankly, directly for your clients, the folks that you serve that have come and testified here time after time about how important'",
        "'speaker_4': 'it was to have case managers and reliable staff at these organizations who have the trust and experience, who can stay in these organizations and help stabilize folks. This is about making sure that we follow through on that commitment.'",
        "'speaker_4': 'And I want to make sure that the folks who are watching understand the type of folks and services that you're helping with. You're helping, yes. To make sure that people who are most vulnerable get the services that any other country would fund through progressive tax measures, that any other country would lift up and say, we have to'",
        "'speaker_4': 'invest in these. Here we are in this corner of our country trying to make up for a fact that we don't have the revenue that we need to invest in the very fabric of the social safety net that you all actually make possible.'",
        "'speaker_4': 'You provide food on the table for seniors through food banks and meal programs. You make sure that our youth development programs get funded and that people have a safe place to stay at night when they're youth. You make sure that those who have experienced domestic violence and sexual harassment and assault get the treatment that they need and'",
        "'speaker_4': 'sometimes, more importantly, the prevention that they need so that they're not in that situation. You make sure that people have a warm, safe place to stay at night and you prevent people from falling into homelessness. As we said at the rally, you are the backbone of what makes our commitment to serving the most vulnerable possible.'",
        "'speaker_4': 'And today we're showing that we have the backbone to stand up for all of the services that you provide to those most vulnerable. We also recognize that if the work that you had done had been within a department at the city, if you were city workers every year you would receive this inflationary adjustment departments, frontline workers here'",
        "'speaker_4': 'at our city, they get adjustments in the costs of both their operational costs and the dollars that go to staff. We've intentionally decided to contract with you. The city has intentionally decided to contract out this work not because we believe in contracting out, but in this specific case, because we believe that you are the most equipped, the'",
        "'speaker_4': 'most trusted. You have the experience on the ground level to actually serve our most vulnerable in a way that can be heard and well received to help stabilize folks. You are the individuals that we have invested in, and we need to make sure that the contracts that you receive receive those inflationary adjustments at the bare minimum to'",
        "'speaker_4': 'keep up with the cost of living. So it's a really exciting opportunity for us to show that the city values this work, that we're investing in, the work that you provide, the strong relationships and the community connectedness that you provide at the ground level.'",
        "'speaker_4': 'And we stand by the principle that nothing should be contracted out just because it's cheaper. We should be contracting out for the very reasons that we are, which is because you are valued partners. So we will continue to make sure that we look at this historic underfund that has been mentioned earlier by my council colleague.'",
        "'speaker_4': 'We know that we can't publicly state our commitment to making sure that the Human Service contracts, the services that we're providing to the most vulnerable and the workers are valued if we're engaging in a process that forces these organizations in a race to the bottom.'",
        "'speaker_4': 'Nobody benefits from that. And if you're starting off at a an amount that is already historically low, if there's a historic underfund for many of these programs and services, you're already at a detriment. We heard a year ago about chemical dependency counselors who have master's degrees in chemical dependency assistance starting out at $33,000 a year.'",
        "'speaker_4': 'It is no wonder that many folks are struggling to survive on that wage. We need to address both the historical underfund in the future and today. We take a really important step by making sure that all of your contracts are tied to the Consumer Price Index, the inflationary adjustment that we experience every year, and that those contracts'",
        "'speaker_4': 'keep up. I'm really excited that this piece of legislation is coming forward now, and I just want to say a few. Thank you. Thanks to Councilmember Herbold for continuing to support this and standing there at the rally last week.'",
        "'speaker_4': 'Councilmember. To offer your amendments on the report back and the reflection piece in there. Council Member Harold. Council President Harold, for your amendment today, as we look at the fixed and variable costs, we know that in many cases many of the leaders in these organizations are making heartbreaking decisions about not filling roles because they have to pay'",
        "'speaker_4': 'for rent, they have to pay for utilities, they have to pay for the increased cost of operations. And the folks who bear the brunt of that are the frontline workers and directly the folks that you serve so excited to have an intent language included, so that we can really look at that variable cost, which unfortunately has resulted'",
        "'speaker_4': 'in high turnover rates, 40, 50% vacancy rates among our organizations. And to provide that stability that we need to address as a city because it's a value statement. I can't do this anymore. Justice on the workers. I already have you heard them speak today?'",
        "'speaker_4': 'I think you've heard them speak about a half a dozen times over the last six months. And they've talked about the important role that they provide, the way in which we have, I think, tied the inflationary adjustment to CPI.'",
        "'speaker_4': 'It's a very common sense approach somebody said in their testimony today. And it is I think the the the value statement that we put forth today in this legislation will have years of benefit to come. So we look forward to working with you, to making sure that this is providing stability and also continuing to address that historic'",
        "'speaker_4': 'underfund that I know Councilmember O'Brien has continued to bring up. And we look forward to continuing that legacy. So just to reiterate what's been already said, this is not a budget exercise. This is a policy and value statement that is embedded in this legislation that the city moves forward today.'",
        "'speaker_4': 'And I want to just say a few. Thank you, Mr. President. And I will be done.'",
        "'speaker_0': 'Please.'",
        "'speaker_4': 'Okay. I want to say thank you to Allison Eisinger, Hilary Coleman from the Seattle King County Coalition on Homelessness. Julia from the Seattle Human Services Coalition, Lauren Fay and Nicole Macri from DSC, Susannah Weinberg and Evelyn Correa from Youth Care, Jesse and Lindsay from SEIU 1199, Kelly Larson from Plymouth Housing, Aaron Moore from West Seattle Help Line'",
        "'speaker_4': 'Flow from Catholic Community Services. Jennifer from Ballard Food Bank, Rizwan from Muslim Housing. Alex and Andrew Bean from SEIU seven seven, five I say Kareen from okay, you look at my union and all of those organizations, not just those individuals, but all the folks that you've turned out and the frontline staff, the workers, the people on the'",
        "'speaker_4': 'ground level who have also had those relationships where you brought in the clients themselves, who testified at this very table and their words were incredibly powerful. Thank you again to all of the organizations. SEIU 11 89775 API Local eight, especially the Human Services Coalition and the Coalition on Homelessness.'",
        "'speaker_4': 'Thank you all for continuing to come forward. The folks at Youth Care, we could probably have not have done a better job of articulating those fixed and variable costs without that incredible demographic or graphic that you shared with us.'",
        "'speaker_4': 'So thank you for sharing all that information. And internally, Amy Gaw and Jeff Sims from our central staff have been tremendous on this. Jessie, I know you're no longer with us in the city of Seattle. Thank you for your ongoing work where you currently are and for what you did with Councilmember O'Brien staff and Leslie as well'",
        "'speaker_4': '. Marc Kazuki from Labor Care wrote an incredible op ed that we're really excited about that highlights the importance of this work. And Katie and Nicole from MLK Labor, our communications team has been all over sharing the incredible turnout that you guys have done.'",
        "'speaker_4': 'I mean, this room was packed. How many times? Six times in the last six months. So thank you. And with that came the work of the security guards. So thank you to our security for helping get folks up here and continue to move folks in and out, especially in the evening meetings.'",
        "'speaker_4': 'I just want to say, if we had a huge round of appreciation for those folks and say Joe Perry, chief of staff, who organized all of this. So thank you for all of your work they've done. And, Mr. President, with that, let's do this.'",
        "'speaker_0': 'All right. Thank you, Katherine. Mascara and make sure we cover all bases here. Thanks for all of your comments. Thank you for your leadership. With that, please call the roll on the passage of the bill.'",
        "'speaker_1': 'Herbold i. Suarez macheda i. Pacheco all right. So what makes john gonzalez president harrell.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Eight in favor and unopposed.'",
        "'speaker_0': 'Bill pass for simon. Well then please read the next and our less urgent item.'",
        "'speaker_1': 'Agenda item for putting in 1380 appointment of Victor and Lozada as Member Domestic Workers Standards Board for Term two February 28, 2022. The committee recommends the appointment be confirmed.'"
    ]
}