{
    "AN ORDINANCE relating to grant funds from non-City sources; authorizing the Director of the Seattle Department of Transportation to accept specified grants and execute related agreements for and on behalf of the City; amending Ordinance 126000, which adopted the 2020 Budget, including the 2020-2025 Capital Improvement Program (CIP); changing appropriations for the Seattle Department of Transportation; revising allocations and spending plans for certain projects in the 2020-2025 CIP; and ratifying and confirming certain prior acts.": [
        "'speaker_3': 'Agenda Item one Capital 119826 relating to grant funds from non city sources, operations director at the Seattle Department of Transportation to accept specified grants and execute related agreements for and on behalf of the city.'",
        "'speaker_1': 'Thank you, Madam Clerk. I will move to pass the council. Bill 119826. Is there a second section? It's been moved and seconded to pass the bill. Councilmember Peterson, you are listed as the prime sponsor of the bill, so you are recognized in order to address this item.'",
        "'speaker_0': 'Thank you. Council President colleagues, this is Council Bill 119826. It's accepting 3.5 million essentially for the West Seattle Bridge. The money is from the Federal Surface Transportation Program and is going to our Seattle Department of Transportation. I'd like to thank Council President Gonzales and Durkan for their votes at the Puget Sound Regional Council a few weeks ago'",
        "'speaker_0': 'to prioritize these funds for the West Seattle Bridge.'",
        "'speaker_1': 'Thank you, Councilmember Peterson, for that description. Is there are there any additional comments on the bill? Councilmember Verbal, please.'",
        "'speaker_2': 'Thank you. I want to echo Councilmember Peterson's appreciation for both Madam President Gonzalez, his vote at APEC, as well as the mayors. Thanks as well to Councilmember Peterson for being the sponsor of this bill. Just want to provide a little bit more detail about the purpose of these funds.'",
        "'speaker_2': '2 million of these funds are identified to conduct what I was calling a type, size and location study for the eventual replacement of the West Seattle Bridge. Does not mean that we've decided that that is the that is the direction that we are pursuing between the options of replace and repair.'",
        "'speaker_2': 'But it gets these funds in place to do that work so that if that decision is made, we have that information. The remaining 1.5 million of the grant award will be used to support specifically the transportation demand management programs that respond to the West Seattle Bridge closure and focus these programs on providing alternatives to single occupancy vehicle'",
        "'speaker_2': 'trips between West Seattle and downtown. Want to note for West Seattle residents that the Council Central Staff Memo notes specifically that the funds related to the type, size and location study allows start to explore replacement concepts such as rebuilding the bridge or an immersed tube tunnel.'",
        "'speaker_2': 'It further notes that it would be the basis for an environmental review of alternatives and developing cost estimates. There's a great deal of interest in West Seattle for what's called an immersed tube tunnel. It's not a it's not a board tunnel or drill tunnel.'",
        "'speaker_2': 'It's built offsite and basically dropped into the water. And so just want folks to know that Scott was forward thinking enough to include this concept as eligible for funds associated with the type, size and location study.'",
        "'speaker_1': 'Thank you. Thank you, Councilmember Herbold, for those comments. Are there any other comments on the bill? Excellent. We will go ahead and move along. It was my pleasure to advocate alongside Mayor Durkan for these additional flexible dollars to look at the scope of work as described by Councilmembers Peterson and Herbold, and really appreciate this bill coming forward'",
        "'speaker_1': 'so that we can begin this crucial infrastructure work. An analysis of infrastructure work for residents of West Seattle. But also it is. Again, I want to remind folks that West Bridge is critical to mobility for the entire region, including those who come, including for those folks who do not live in West Seattle.'",
        "'speaker_1': 'It is just so key to the region's strategies around mobility and so important for us to make sure that we address those issues from a broad perspective, not just because of the direct impact to West Seattle residents, but also to the impact in, for example, Councilmember Morales's district two that is adjacent to your district, Councilmember Herbold, but'",
        "'speaker_1': 'also in addition to the people who just rely on the West Seattle Bridge to get to and from home, but who may not live in in West Seattle. So I'm really proud to be able to support this bill and to continue to support efforts at the regional level, to continue to advocate for additional dollars that might be'",
        "'speaker_1': 'available to us to to really get this replacement or repair done in the most expeditious way possible. If there are no other comments on the bill, I will go ahead and ask that the clerk please call the roll on the passage of the bill.'",
        "'speaker_3': 'Whereas I.'",
        "'speaker_2': 'Know this. Hi. Morales. I. Mesquita. I. Petersen. I so want.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Strauss i.'",
        "'speaker_2': 'Herbold i. President Gonzalez I. Nine in favor and unopposed.'",
        "'speaker_1': 'Thank you so much. The bill passes and the chair will sign it. And I ask the clerk. I'd ask the court to please affix my signature to the legislation. Will the clerk please read agenda item two into the record?'"
    ],
    "AN ORDINANCE relating to the Seattle Monorail, authorizing the Director of the Seattle Center Department to execute a second amendment to the easement agreement with Westlake Center, LLC previously authorized by Ordinance 113272; providing additional easement area for improvement and expansion of the Monorail station platform; granting rights to install and maintain ticket kiosks and commercial and informational signage; and ratifying and confirming certain prior acts.": [
        "'speaker_3': 'Agenda Item two Capital 119815 relates to the settlement or authorizing the director of the South County Department to execute a Second Amendment to the easement agreement with Westlake Center LLC, previously authorized by.'",
        "'speaker_1': 'Audit.'",
        "'speaker_3': '113272 providing additional easement area for the expansion of the monorail station platform, granting rights to install and maintain a kiosk and commercial and informational signage and ratifying and affirming certain prior acts.'",
        "'speaker_1': 'Thank you, Madam Clerk. I will move to pass Council Bill 119815. Is there a second?'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'It's been we've been seconded to pass the bill. Councilmember Suarez, you are the sponsor of the bill, so you are recognized in order to address it.'",
        "'speaker_3': 'Thank you. This regards the monorail expansion, as you heard from the clerk from my comments this morning. This legislation allows the Seattle Center director, Robert Dellums, to take the next step in moving forward with the platform expansion by authorizing execution of an amendment to the existing monorail, operating and easement agreement with Westlake Center.'",
        "'speaker_3': 'Westlake Center owns the Westlake Monorail Station platform and the monorail use. The site utilizes it under the terms of a 1987 monorail operating and easement agreement. This legislation amends the easement with that Westlake Center. The monorail, which is owned by the city and operated by a concessionaire.'",
        "'speaker_3': 'Seattle Monorail Services asked to transport 6000 riders per hour each direction of travel. Traffic mitigation efforts are underway in anticipation of the arena's opening, which should be fall of 2021. To achieve that maximum capacity. The size and layout of the Westlake Center monorail station needs to be modified.'",
        "'speaker_3': 'The legislation expands access ways, provides new ticketing equipment and gateways, as well as information and commercial signage. Monorail services will pay 6.6 million for platform capital improvements and another 38,000 a year for use cleaning and maintenance of the added space.'",
        "'speaker_3': 'The amortized cost of the improvements will be reimbursed with monorail revenues over the remaining 14 years of the Seattle Monorail Services Concession Agreement. As you know, colleagues, we've been working on this for a couple of years. Hopefully it will go as planned and we will open the Staples Center in fall of 2021 as chair of the Public'",
        "'speaker_3': 'Asset and Native Communities Committee. I recommend full council to pass this bill. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Suarez, are there any other comments on the bill? Councilmember Strauss.'",
        "'speaker_0': 'Thank you. Council President Thank you, Councilmember Waters, for your leadership on this agreement. We know that the monorail is going to be that last mile connection between our light rail system and the new climate pledge arena at the Seattle center.'",
        "'speaker_0': 'We are going to with these changes, will be able to see more people able to move, be moved faster, being able to use both trains rather than just one at a time. This is going to change the way that we're able to use the monorail and get to Seattle Center.'",
        "'speaker_0': 'So thank you all for your leadership. Director Nelmes in particular.'",
        "'speaker_1': 'Any other comments on the bill? KC Nunn. Thank you so much, Councilmember Suarez, for bringing this bill forward. I know it's been many years in the in the works, so appreciate the opportunity to support this bill as well.'",
        "'speaker_1': 'I would ask that the Kirk please call the role on the passage of the bill.'",
        "'speaker_2': 'RS.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Lewis.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Morales.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Macheda I Pietersen. I so want.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Strauss. I herbold i President Gonzalez. I am in favor and unopposed.'",
        "'speaker_1': 'Thank you, Madam Clerk. The bill passes and the chair will sign it and ask that the clerk please affix my signature to the legislation. Will the clerk please read item three into the record?'"
    ],
    "A RESOLUTION reaffirming The City of Seattles support of unbanked money transfer operators and the immigrant communities they serve.": [
        "'speaker_3': 'Agenda Item three. Resolution 31955. Reaffirming the city's support to fencing money, transfer operators and immigrant communities. Baser.'",
        "'speaker_1': 'Thank you, Madam Clerk. I move to adopt resolution 31955. Is there a second? It's been moved and seconded to adopt the resolution. Councilmember Morales, you are the prime sponsor of the resolution, so you are recognized in order to address it.'",
        "'speaker_5': 'Thank you. President Gonzalez, I just want to give a little bit of background as the folks who called in this afternoon mentioned over the last several years that money transfer organizations have found it increasingly difficult to operate safely because of what's called de-risking.'",
        "'speaker_5': 'That's a process where banks go through terminating their relationship with certain account holders because who they've deemed to be high risk. And this is particularly affecting our Somali neighbors. It's a process that started after 911. And so there is certain amount of discrimination that is assumed to be happening as well.'",
        "'speaker_5': 'We know that the accounts of Somali American money transfer organizations have been closed. It's having devastating impacts on our Somali neighbors. And it's been going on for a long time. And it is still continuing to be an issue.'",
        "'speaker_5': 'Banks have applied derisking in a discriminatory manner, denying small and immigrant owned remittance companies bank accounts while continuing to serve larger operators. So this resolution calls on the Washington state legislature, specifically the Senate Financial Institutions, Economic Development and Trade Committee, and the House Consumer Protection and Business Committee to study the legislative options that could better support financial'",
        "'speaker_5': 'inclusion of these entities so that they can continue to operate and serve the community. I've discussed this with our Office of Intergovernmental Affairs, who are clear that this is one of the city's legislative priorities already and are working with committee chairs.'",
        "'speaker_5': 'And I urge your support of the resolution for financial inclusion for our Somali neighbors.'",
        "'speaker_1': 'Thank you so much, Councilmember Morales. Any other comments on the resolution? Councilmember Herbold and then Councilmember Sala.'",
        "'speaker_2': 'Again, just want to thank Councilman Morales for taking the lead on this issue and glad to hear confirmation from you, Councilmember Morales, that our has identified this as a priority for the next legislative session. When proponents contacted me back in May about this issue, I immediately contacted Air and requested that they include this issue in the state's'",
        "'speaker_2': 'legislative agenda and work with the proponents on this. So I'm glad to get confirmation that that is that is in the works. Appreciate it.'",
        "'speaker_1': 'Council members want.'",
        "'speaker_4': 'Thank you. I am happy to support this resolution to be in solidarity with the infrastructure to allow our community members in the Seattle area to support their families with money transfers. And of course, I was also extremely supportive of the resolution in 2015 that the city council at that time advised in support of this money transfer infrastructure'",
        "'speaker_4': ', because we know how much of a backbone it is for your financial. Sustenance of the communities in many of the countries in the neocolonial world, the banking industry and the laws that regulate them are dominated by the big banks that are not only more interested in their profits than in meeting the financial needs of our communities, but'",
        "'speaker_4': 'are among the exploiters. The explicit exploiters of the same communities of should be being held. The big banks invest in fossil fuel industry and yet the state government will not allow Seattle to bank with a credit union instead.'",
        "'speaker_4': 'And that's why it's important that in alliance with the native indigenous, urban native community and the environmental activist community, that we have made strides towards that and we need to keep making progress in order to have public banking in the city of Seattle.'",
        "'speaker_4': 'Big banks sell adjustable rate mortgages and then ruthlessly foreclose on people's homes. Big banks and other rapacious financial institutions have carried out years of subprime and predatory lending. Approximately 90% of subprime mortgages issued in 2006 were adjustable rate mortgages, and nearly 10 million homeowners lost their homes.'",
        "'speaker_4': 'The foreclosure sales in the U.S. between 2006 and 2014. I mean, this is the larger context that looms over ordinary people, but especially communities of color. In fact, among those who were foreclosed in the wake of the Great Recession in 2728, it was predominantly black households and Latino households that were impacted by the sale of adjustable rate'",
        "'speaker_4': 'mortgages, predatory lending, and then coming upon that foreclosures. Big banks are not interested in helping the East African community in the Seattle area in any way send money to help support their families and the smaller services that are willing to do this work.'",
        "'speaker_4': 'Because it is needed, even if it may not be very profitable, are not given the authority and protections that are given to the big banks. My staff member Jonathan Rosenblum has met with Rob Lehmann, say to discuss this and I'm very happy to support this resolution, as I said, to work with the community moving forward, especially on'",
        "'speaker_4': 'the state level, to assist money transfer operators who serve immigrant communities. And I just also publicly wanted to thank Jonathan Rosenblum for suggesting or maybe being among those who suggested to the community that they work on the state level instead.'",
        "'speaker_4': 'And clearly, we are hoping that it will have a real impact and to help the community.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Swann, for those remarks as well. Any other comments on the resolution, colleagues? Keep seeing that. I will make sure that Councilman Morales gets the last word. I also wanted to just echo my thanks, Ginsberg. Morales, for your work and advocacy in this space.'",
        "'speaker_1': 'It is an issue that is very dear to my heart. It is part of the reason we have an organization called One America Today that is sort of the largest immigrant rights organization in the state. It is a multicultural, multigenerational, multiracial organization that is really championed so many amazing policy reforms throughout the state and here in Seattle'",
        "'speaker_1': 'and certainly in this area of unbanked issues as it relates to immigrant populations, you know, they they've continued to advocate for a systemic, sustainable change. And as somebody who comes from an immigrant family who still has family abroad, I personally understand the importance of being able to have an opportunity to issue remittances.'",
        "'speaker_1': 'And when you are limited to doing that via banks based on it, racist policies, frankly, that are and have been implemented and enforced by our financial institutions in America, it really makes it difficult for for immigrants living in this country who are already enduring so much in terms of family separation and in having the burden of of'",
        "'speaker_1': 'of continuing to provide for families in their home countries. It is so important for us to continue to take a really strong policy position about how important it is for us to solve for these really significant policy issues which have to be tackled by the state.'",
        "'speaker_1': 'So I appreciate your ongoing advocacy and sponsorship of this resolution. I'm looking forward to supporting it. That being said, I will hand it over to you to have the last word and then we'll call the role in the passage of the resolution.'",
        "'speaker_5': 'Terrific. Well, thank you. Thank you to Councilmember Somewhat and Gonzalez. I do just want to give a final thanks to the community who brought this to us. Council member Council President Gonzalez already mentioned one America. So I want to thank Rich Stultz there, the Somali Health Board, Somali family safety task force here, Washington, Seattle Rideshare Drivers Association'",
        "'speaker_5': 'living well Kent access to our community and the Abu Bakr Islamic Center of Washington. We're all really instrumental in helping bring this to council and are also working, as I said, in Olympia and meeting with state legislators and the appropriate committee chairs to make sure that we are doing what we can at the state level.'",
        "'speaker_5': 'And then we were also in communication with Congressman Heck, who's on the Financial Services Committee in D.C. because a lot of these banking regulations, the changes that we need, need to happen as a congressional level at the federal level as well.'",
        "'speaker_5': 'So I want to thank everyone for your support. And we are ready to vote.'",
        "'speaker_1': 'Thank you, Councilman Morales. With that being said, I would ask the clerk, please call the roll on the adoption of the resolution.'",
        "'speaker_3': 'Suarez i.'",
        "'speaker_2': 'Lewis.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Morales.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Let's get. I.'",
        "'speaker_0': 'Peterson I.'",
        "'speaker_2': 'The one.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Strauss All.'",
        "'speaker_0': 'Right.'",
        "'speaker_2': 'Herbold Hi. President Gonzalez. Hi. Nine in favor. Not opposed.'",
        "'speaker_1': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it and ask that the clerk please affix my signature to the legislation. Okay. Agenda item five Will the clerk please read agenda item five into the record?'",
        "'speaker_3': 'Council President Gonzalez I for an item for wimps.'",
        "'speaker_1': 'I apologize for that. I realized it after I said it. Will the clerk please read the agenda item or into the record?'"
    ],
    "A RESOLUTION relating to the Department of Parks and Recreation; authorizing the Superintendent of Parks and Recreation to act as the authorized representative/agent on behalf of The City of Seattle and to legally bind The City of Seattle with respect to certain projects for which the City seeks grant funding assistance managed through the Recreation and Conservation Office.": [
        "'speaker_3': 'Not a problem. Agenda item four Resolution 31 950 relating to the Department of Parks and Recreation, authorizing the Superintendent of Parks and Recreation to act as the authorized representative of the agent on behalf of the city. Seattle and legally five the City of Seattle with respect to certain projects for which the city seeks wrapped funding assistance managed'",
        "'speaker_3': 'through the Recreation and Conservation Office.'",
        "'speaker_1': 'Madam Clerk, I apologize for reading, asking you to read the wrong item. I was distracted by one very cute baby over here, and so I apologize for that. I will move to adopt resolution 31950. Is there a second?'",
        "'speaker_1': 'It's been moved and seconded to adopt the resolution. Councilmember Suarez, you are the prime sponsor of this resolution, so I will recognize you so that you can address the item.'",
        "'speaker_3': 'Thank you. This legislation authorizes the State Department of Parks and Recreation Superintendent to security to submit grant applications to the State of Washington Recreation and Conservation Office, to argue for state funding assistance. This resolution is routine. We've done it many times and required as part of the formal RCO grant application process.'",
        "'speaker_3': 'Parks and Rec applies for our RCO grant each year. And has a strong success rate in securing additional funding for planned capital projects. The 2020 Dale Parks and Rec will complete 11 RCO applications for a total of $6,120,860.'",
        "'speaker_3': 'The RCO grants require a local match and will fund only projects that are included in an adopted plan. You know, Parks and Rec required matching funds for the projects appropriated in the Parks and REC 2016 2021 Capital Improvement Program RCO will announce the grant awarded at recommendations in January 2021, but the actual grant awards will not be'",
        "'speaker_3': 'contracted until. July two, fall of 2021. The money will support currently unfunded project elements program capital projects. The share of the public? Asked the Native Communities Committee. I recommend council adopt Resolution 31950. Accountable. I'm sorry.'",
        "'speaker_0': 'Council Bill.'",
        "'speaker_3': '119. Put the wrong number here.'",
        "'speaker_0': 'I apologize. It's resolution.'",
        "'speaker_1': '31950.'",
        "'speaker_3': 'Yeah, resolution. Yeah, I was. It was wrong.'",
        "'speaker_0': 'I apologize. We.'",
        "'speaker_3': 'Yeah. I'm sorry. Resolution 31950. I was reading last the last pages. AUDIENCE Thank you.'",
        "'speaker_1': 'Got it. Okay. Colleagues, any additional comments on the resolution? Yeah, I don't see anybody raising their hands. So I would ask that the court please call the role on the adoption of the resolution.'",
        "'speaker_3': 'Whereas by.'",
        "'speaker_2': 'Lois. I hear, Alice. I must get to. Must to. Peterson. I so want.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Strauss.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Herbold. I. President Gonzalez. I ain't in favor and unopposed.'",
        "'speaker_1': 'Thank you so much. The resolution is adopted and the chair will sign it. Asked the clerk, Please affix my signature to the legislation. Now we can go to agenda item five. Will the clerk please read that item into the record?'",
        "'speaker_3': 'Agenda Item five Appointment 1585 Appointment of Karen Grandison as Member Committee Technology Advisory Board for Term two December 31st, 2021.'"
    ]
}