{
    "AN ORDINANCE relating to Seattle Parks and Recreation; authorizing an exchange of City-owned property at Walt Hundley Playfield for property owned by Seattle School District No. 1 adjacent to West Seattle Elementary School; authorizing execution, acceptance, and recording of quitclaim deeds; authorizing an interlocal agreement ensuring public outdoor recreation use of a portion of property deeded to Seattle Public Schools; and finding that the land exchange meets the requirements of Ordinance 118477, which adopted Initiative 42; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Strauss. Yes. And Council President Gonzalez high seven in favor nine opposed the human work the bill passes and the child will sign it. Will the work visa fix my signature piece of legislation on my behalf? Well, please read the short title of item one into the record.'",
        "'speaker_0': 'Agenda Item one Council Bill 12012 sets relating to Seattle Parks and Recreation authorizing an exchange of city owned property at Walt Playfield for property owned by Seattle's Seattle School District Number One adjacent to West Seattle Elementary School. Thank you so much.'",
        "'speaker_0': 'I moved past Council Bill 120126. Is there a second second? It's been moved the second to pass the bill and to hand it over to Councilmember Juarez, who is the prime sponsor of this bill, to address the item.'",
        "'speaker_4': 'Thank you, Council President, and thank.'",
        "'speaker_0': 'You for.'",
        "'speaker_4': 'Allowing this item to advance to full council. So Seattle.'",
        "'speaker_0': 'Parks and Seattle Public.'",
        "'speaker_4': 'Schools can meet their deadline. Colleagues, as I shared with you an email, an informational background email on.'",
        "'speaker_0': 'Friday.'",
        "'speaker_4': 'July 23rd.'",
        "'speaker_0': 'This executive proposed legislation will authorize.'",
        "'speaker_4': 'An exchange of city owned property at Walt Hunley, PLAYFIELD for property.'",
        "'speaker_0': 'Owned by.'",
        "'speaker_4': 'Seattle Public Schools.'",
        "'speaker_0': 'Adjacent to West Seattle Elementary School. We've done these common property swaps between parks and other city departments, such as START in the zoo and Aquarium. And now we're doing another one with Seattle Public Schools.'",
        "'speaker_4': 'Salem Public Schools in Sealed Parks and Rec began the process of formally transfer transferring these two pieces of property in the 1980s, but did not.'",
        "'speaker_0': 'Complete the legal process required for transferring the properties, including the execution.'",
        "'speaker_4': 'Of quick quitclaim deeds. The property trade involves two pieces of land of equal value in size.'",
        "'speaker_2': 'This trade.'",
        "'speaker_4': 'Will give Seattle Parks and Rec full control over.'",
        "'speaker_0': 'Its existing athletic.'",
        "'speaker_4': 'Field in Seattle public schools, full control and the ability to develop its.'",
        "'speaker_0': 'Property at the elementary school.'",
        "'speaker_4': 'Bill ensures that the portion of the property being transferred to Seattle Public Schools remains available for public outdoor recreation through the execution of an interlocal agreement between the two agencies.'",
        "'speaker_0': 'Madam President, I recommend that Council pass this bill. Thank you. Thank you. Consumer awareness. Do you have your handwriting? Thank you so much. I really appreciate Summer Warriors for bringing this forward for the viewing our listening public in District one.'",
        "'speaker_0': 'Just want to add a little bit of more detail about the Interlocal agreement. The Interlocal agreement specifies that the district will not develop or fence off the public recreation portion, but will have the ability to install a gate in the existing fence that will allow students to access and recreate the arrangement, equalizes the area of the transfers'",
        "'speaker_0': ', and neither agency will be required to compensate the other for the exchange. And the legislation does not in any way change the current use of the affected pieces of property. They'll continue to be used as they are now, but with underlying ownership appropriately held by the correct agency user things.'",
        "'speaker_0': 'And you do so much because number herbals. Are there any additional comments on the. No. Caring and honorable. The clerk please call the role on the passage of the bill. Herbert Juarez, I.'",
        "'speaker_1': 'Louis Yes.'",
        "'speaker_0': 'PETERSON.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Sergeant.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Strauss.'",
        "'speaker_3': 'Yes.'"
    ],
    "Designation of Facial Recognition Technology as Surveillance Technology pursuant to Seattle Surveillance Ordinance, Seattle Municipal Code 14.18.020.": [
        "'speaker_0': 'And counseled President Gonzalez. Yes seven a favor and opposed the bill passes and the chair will sign it will the fix my signature to the legislation on my behalf? Will the clerk please read item two into the record?'",
        "'speaker_4': 'Agenda item to file.'",
        "'speaker_0': '314471. Designation Official Facial Recognition Technology Surveillance Technology Pursuant to Seattle Surveillance Ordinance. Seattle Municipal Code 1418 020. Thank you so much. I move to approve Clark Kyle 314479. Is there a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to approve files. 314479. I'm going to hand it over to Councilmember Herbold, who is a co-sponsor of this file item to address the item. Thank you again so much and really appreciate the opportunity to work with Councilmember Peterson on this bill.'",
        "'speaker_0': 'He is the chair of the committee that has oversight of the surveillance technology related actions. And so and so this is a clerk file to the surveillance ordinance. Really appreciate his leadership. And in helping me work through some of the issues related to our recent Office of Professional Accountability Investigation, where the director concluded that an officer's use'",
        "'speaker_0': 'of facial recognition technology was not in violation of the city's surveillance ordinance. We received analysis from central staff. The analysis shows that the facial recognition technology is currently within the jurisdiction and purview of the surveillance ordinance, meaning that the use of the technology is currently prohibited unless reviewed and approved as described in that graphic or as described'",
        "'speaker_0': 'in the in the ordinance itself. But in order to eliminate any confusion in the future, whether facial recognition technology is covered by the surveillance ordinance, council central staff recommended that we use the clerk file as the mechanism for this particular clarification.'",
        "'speaker_0': 'We've also sort of heard differing opinions from from Chief Diaz in the Seattle Police Department back in November of 2020, when this issue was first brought to public awareness awareness. Chief Diaz wrote that SPD does not use Clearview AI and has no intention of using Clearview AI.'",
        "'speaker_0': 'And he went on to say, As chief, I'm committed to upholding the tenets of the surveillance ordinance and the civil liberties of our residents. Clearview AI's business product is at odds with those two central priorities. Further on my request again last year, the chief sent out a department wide communication reminding everyone in the same police department about'",
        "'speaker_0': 'the policy. It made clear that one cannot use personal technology as a means to bypass city policies. And included for the review of the employees what the actual content of the policies were. Certainly the chief publicly indicated that it is a gray area, saying it's not.'",
        "'speaker_0': 'It is his position. That surveillance ordinance, as presently codified, covers the use of facial recognition software. And again, the clerk file before the council today will ensure that in the future the surveillance ordinance is very clear that it does include the use of facial recognition technology and will be subject to the review process outlined in the ordinance'",
        "'speaker_0': '. Thank you. Thank you so much, Councilmember Herbals. Any additional comments on the quick file? Councilmember Peterson, please.'",
        "'speaker_1': 'Thank you. Council president? Yes. As council member, Herbold said, approving this quickfire would designate facial recognition technology as surveillance technologies, who would then be subject to the thorough review and approval process as prescribed by Seattle's strong surveillance ordinance.'",
        "'speaker_1': 'The there's actually a SNC section 14.1 8.0204 that states that council may at any time designate that a technology is or is not surveillance technology, and it actually asks for a clerk trial to do that. So thanks to the foresight of the authors of the surveillance ordinance for giving us this option to do this today, and we'",
        "'speaker_1': 'encourage you to adopt this court file. Thank you.'",
        "'speaker_0': 'Thank you so much. PETERSON Any additional comments on the Clarke file? I'm not seeing any other hands raised. Well, the clerk please call the role on the approval of the cork file. Purple's. It's.'",
        "'speaker_4': 'CLARENCE Hi.'",
        "'speaker_1': 'Lewis Yes. PETERSON Yes.'",
        "'speaker_0': 'So what?'",
        "'speaker_2': 'Yes.'"
    ],
    "Full unit lot subdivision application of Isola Real Estate VI, LLC, to subdivide three parcels into eight parcels of land and one of those parcels into 13 unit lots at 11200 Pinehurst Way NE. (Project No. 3032523-LU; Type III).": [
        "'speaker_0': 'Strauss Yes. And Council President Gonzalez. Yes. Seven in favor, nine opposed the motion carries and the clerk file is approved. Will the clerk please read item three into the record? Agenda Item three quick file 314456. Sold Unit Lot Subdivision Application by Solar Real Estate six LLC to subdivide three parcels into eight parcels of land and one of'",
        "'speaker_0': 'those parcels into 13 unit lots at 11200 Andrus Way North East. Thank you so much. I move to file Clark file three. One, four, four, five, six. Is there a second?'",
        "'speaker_3': 'Second?'",
        "'speaker_0': 'Thank you so much has been seconded to file clerk file 314, four, five, six. I'm going to hand it over to Councilmember Strauss to address the item.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Council President this clerk file. And our next item number four on the agenda.'",
        "'speaker_1': 'Is the ordinance that will be associated with this clerk. While Clerk Baran took most of my speaking points for me, because this is a technical and legal matter where City Council's role is to ensure that this process has certified the needs, that the plan meets all the conditions previously set by the hearing examiner.'",
        "'speaker_1': 'So let me go through the points here. This file and the following council will grant.'",
        "'speaker_3': 'Final approval to the quote.'",
        "'speaker_1': 'Pines at North Cape, unquote, subdivision at 1014, Northeast 1/112 Street.'",
        "'speaker_3': 'And Northgate.'",
        "'speaker_1': 'This plot divides one person to eight, with one of those parcels being further subdivided into 13 unit lots for individual townhome sales. In total, the project includes 13.'",
        "'speaker_3': 'Townhomes and seven.'",
        "'speaker_1': 'Live work units. Our role, the council's role in this process is to again certify that the plot meets all the conditions previously set by the hearing examiner. Seattle Department of Transportation, Seattle Department of Construction, Inspections and Council central staff.'",
        "'speaker_3': 'Have all confirmed that the plat meets all.'",
        "'speaker_1': 'Requirements and recommend the council approves this application. With that in mind, I moved to place clerk file 314456 on file. Thank you. Council President.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Are there any additional comments on the quick file? Harry Nunn. Well, the piece called The Roll on the Filing of the Park File. Both. Yes. Lawrence, I. Lewis.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Peterson.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Sergeant.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Strauss.'",
        "'speaker_3': 'Yes.'"
    ],
    "AN ORDINANCE approving and confirming the plat of The Pines at Northgate in the portions of Northeast Quarter of Southeast Quarter of Section 29, Township 26 North, Range 4 East, W.M. in King County, Washington.": [
        "'speaker_0': 'And Council President Gonzalez. Yes. Seven in favor and opposed the motion carries and the clerk file is placed on file. Will the clerk please read item four into the record? Agenda item for Council Bill 120127 approving confirming the plot of the ponds at Northgate and the portions of north east quarter of Southeast Order of section 29, township'",
        "'speaker_0': '26, North Range four, east and Central Washington. Thank you. I moved to pass Council Bill 120127. Is there a second?'",
        "'speaker_1': 'Second?'",
        "'speaker_0': 'Thank you so much. The bill has been moved and seconded for passage. I'm going to hand it back over to you. Caspar Strauss, in the event that there is anything else you'd like to add.'",
        "'speaker_3': 'Bank accounts present in the clerk, Brian have done a wonderful job.'",
        "'speaker_1': 'This is the Associated Counsel bill to the previous clerk filed.'",
        "'speaker_3': 'The quote pines at north gate.'",
        "'speaker_1': 'Unquote. All subject matter has already been covered and therefore I move to pass Council Bill 120127.'",
        "'speaker_0': 'Great. Thank you so much. Are there any additional comments on the bill? Hearing that. Will the court please call the roll on the passage of the bill? Both. Suarez. Lewis. Yes. Pearson.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Sir. I want. Yes. Strauss Yes. And Council President Gonzalez Yes. Seven in favor, nine opposed. The bill passes and the chair will sign it. Will the caucuses affect my signature to the legislation on my behalf? Will the clerk please read items five through 11 into the record?'"
    ],
    "AN ORDINANCE relating to the Traffic Code; amending Sections 11.14.277, 11.16.121, and 11.76.015 of, and adding a new Section 11.14.276 to, the Seattle Municipal Code to establish on-street paid parking rates for large events that are expected to draw at least 10,000 attendees.": [
        "'speaker_0': 'Strauss. Yes. And Council President Gonzalez. Yes. Seven in favor. Nine opposed. The motion carries and the appointments are confirmed. Well, the clerk please read item 26 into the record. Report of the Transportation and Utilities Committee Agenda Item 26 Council Bill 120115 relating to the traffic code amended sections 11.14 .277, 11.16 .121 and 11.7 6.015 of and adding'",
        "'speaker_0': 'a new section 11.1 4.276 to the seven municipalities to establish on.'",
        "'speaker_4': 'Street parking.'",
        "'speaker_0': 'Rates for large events that are expected to draw at least 10,000 attendees. The committee recommends the bill pass as amended. Thank you so much, Casper Peterson. You are the chair of this committee. Somebody handed over to you to provide the report.'",
        "'speaker_1': 'Thank you. Council president, colleagues, as I mentioned at the council briefing this morning, our Transportation Utilities Committee amended and then unanimously recommended Council Bill 120115. This bill will enable our Seattle Department of Transportation to better manage on street parking availability in the uptown neighborhood by increasing parking rates as needed during large events at Seattle Center.'",
        "'speaker_1': 'Large events are likely to include professional sports at the newly renovated climate pledge arena, formerly known as Key Arena. While our committee unanimously adopted the bill on July seven, we decided to have the legislation arrive at today's council meeting a full three council meetings later, just in case the public wanted more time to comment.'",
        "'speaker_1': 'Thank you to Councilmember Morales for her important amendment in committee, which clarified that the scope is limited just to large events at Seattle Center. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Any additional comments on the bill? Councilmember Lewis, please.'",
        "'speaker_1': 'Thank you so much, Madam President. Well, as I am not a member of the Transportation Committee, today has been my first opportunity to engage in a council process on this bill. I do want to thank Councilmember Peterson for providing space to meet and discuss potential concerns with him in the run up to his process in his committee'",
        "'speaker_1': ', and do appreciate that that that process was inclusive of my positions as the councilmember representing uptown. I do feel like I should make a statement on the legislation now that is facing final passage, and I have the first opportunity to weigh in with an official vote on it.'",
        "'speaker_1': 'I do support the legislation and I do think it's important that we have a strategy around the finite on street parking supply in the uptown neighborhood and how the coming significantly large events. At the climate pledge arena are going to impact that parking supply.'",
        "'speaker_1': 'I do just want to put on the record for folks watching and this will probably be redundant to the discourse in the Transportation Committee. But for the first hour of parking, for the first rather 2 hours of parking, the rate will be assessed at $3 an hour for the second two hour period of parking that will be'",
        "'speaker_1': 'assessed at $8 an hour, with the director discretion to increase to $12 an hour for a four hour period. Folks could end up paying as much as $22 for on street parking or up to 30 if the full discretion afforded to the director is permitted.'",
        "'speaker_1': 'I think it is important to acknowledge that the Uptown neighborhood has considerable additional demands as a neighborhood with a number of small businesses, with additional arts and entertainment facilities in the region, all of which are going to be competing for limited parking supply with these significant events.'",
        "'speaker_1': 'I do want to just come on the record and state that I think it is important that when we are planning moving several thousand people into a discrete area, that we do provide incentives to take advantage of the multitude of direct bus routes that go to the Seattle Center campus from all over the city of Seattle, that'",
        "'speaker_1': 'we take advantage of the souped up monorail transfer that is going to be available to visitors on game days to transfer from the light rail at Westlake to the monorail in order to get to the Seattle Center campus.'",
        "'speaker_1': 'And we can't forget the upcoming Thomas Street improvements that this council has supported for a number of years to increase bike and pedestrian options and indeed to facilitate potential parking from further afield and provide a good pedestrian promenade to the Seattle Center campus.'",
        "'speaker_1': 'All improvements in anticipating moving significant numbers of people to the Seattle center. There are considerable alternatives to driving, and if folks do drive, we need to make sure that we are doing our due diligence to make sure that the parking is being rationed in a way that can be.'",
        "'speaker_1': 'That can coexist with some of the other demands the uptown neighborhood faces for street parking, and also make sure that we are incentivizing those other methods of folks to get to the center campus without depending on single occupancy vehicles.'",
        "'speaker_1': 'So at that, I will be voting for this. I do think that considering again that it's only limited to situations when there are large events, these are not new default, 24 hour a day parking rates for the uptown neighborhood.'",
        "'speaker_1': 'That this is a a reasonable course of action by the department and I will be voting for it.'",
        "'speaker_0': 'Thank you so much, Councilmember Lewis. Any additional comments on the bill? All right. Hearing none while the court chief called the roll on the passage of the bill. HERBOLD. Yes. Suarez, I.'",
        "'speaker_1': 'LEWIS Yes. Peterson Yes.'",
        "'speaker_0': 'So, Sergeant. Yes. Strauss Yes. And Council President Gonzalez. Yes. Seven a favor and unopposed bill passes and the chair will sign it. Will the caucuses affect my signature to the legislation on my behalf? Will the clerk please read items 27 through 31 into the.'"
    ]
}