{
    "A RESOLUTION recognizing the Vietnamese Heritage and Freedom flag as the symbol for Seattles Vietnamese community.": [
        "'speaker_7': 'The Report of the Public Safety, Civil Rights and Technology Committee. Agenda Item one Resolution 31591. Recognizing the Vietnamese Heritage and Freedom flag as a symbol for Seattle Vietnamese community. The committee recommends the resolution be adopted.'",
        "'speaker_0': 'Thank you, Councilmember Harrell.'",
        "'speaker_4': 'Thank you very much, Council President Burgess. Good afternoon and thank you for being here. Chow Kam on my neue da dum de. I took me about an hour to learn those eight words. So I could only imagine the stories that you have coming here to this foreign country with sometimes little more than the clothes on your back'",
        "'speaker_4': ', learning a new language and a new culture. And I think that's why we're here this afternoon. And I don't have to say a lot about this resolution, because you said it all. You are a magnificent community and your stories and your words said it all.'",
        "'speaker_4': 'I will share with my colleagues a few statistics to put what we're doing here. Know, I think in the appropriate context. So Seattle is home to more than 10,000 Vietnamese Americans and the state of Washington is home to more than 70,000 Vietnamese Americans.'",
        "'speaker_4': 'Indeed, a very rich, vibrant community, the business district that is Seattle's Little Saigon has been the economic and social social center of the Vietnamese community since the 1980s. This heritage and Freedom flag. Proudly flies at so many Vietnamese events throughout Little Saigon Business District and Rainier Valley and other parts of this city.'",
        "'speaker_4': 'April 30th, 2015 mark the 40th anniversary of the end of the Vietnam War. So many Vietnamese allies fled after the United States left Vietnam on April 30th, 1975, and over decades, beginning with Governor Dan Evans and other people in the state of Washington, welcomed and aided thousands of Vietnamese refugees.'",
        "'speaker_4': 'Many of these immigrants and refugees rebuilt their entire lives, sometimes only explaining to their children and their grandchildren the experiences they experience. The City of Seattle on other occasions and other resolutions 2489624 900 and other statements have indicated that there is a welcoming tradition here for our Vietnamese refugees.'",
        "'speaker_4': 'But this is the first attempt to recognize officially your heritage flag as the flag that we should use as a symbol for who you are and what you are. In the United States, approximately 13 state governments, seven counties and 85 other cities have adopted similar resolutions that recognize your Vietnam, Vietnamese heritage and freedom flag.'",
        "'speaker_4': 'It is long overdue for the City of Seattle to recognize that you again are rich part of our own history, and we should celebrate it. I have a few thank yous that I would like to say. Assuming that we will adopt this resolution and it'll be part of our legislative, we will accept it through our legislative process'",
        "'speaker_4': '. I'd like to thank our own Lynn Quinn. Who is she? Actually runs this place, by the way. We just sit here. Lynn runs the place and Lynn Tai staff or Congressman Adam Smith played such a significant role in helping make this happen.'",
        "'speaker_4': 'Meaning, no president of the Vietnamese community of King and Snohomish County came along when president of the Vietnamese Mutual Assistance Association, Chong Tang, former president of the Vietnamese Community of Washington State. Tom Nguyen, owner of Tamarind Tree Restaurant.'",
        "'speaker_4': 'President of the neighborhood organization. Friends of Little Saigon. Men Duc Nguyen, executive director of Helping Link. And I also want to recognize the great work The Seattle Times has done through Tonton for publishing several stories in April about the 40th anniversary of the end of the Vietnam War.'",
        "'speaker_4': 'And of course, I'd like to thank my own staff member, Vin Tings, for working with me. So previously on this as well. Who was born in Vietnam so that you are rich community. Thank you for gracing us with your presence in City Hall.'",
        "'speaker_4': 'As I said downstairs, you've made us look so much more beautiful. And yes, I'm not talking to the guys. I'm talking to the women. You've made us look so much more beautiful here at City Hall. Thank you very much for your presence here.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Harrell are there all right? We haven't done anything yet, so hang up. Any questions or comments? Councilmember Licata Excuse me, folks, if we could, if we could have you. Please sit down and keep quiet, please.'",
        "'speaker_0': 'Thank you. Thank you. Please take your seats. Please. Councilmember Licata.'",
        "'speaker_3': 'I first of all want to thank Councilor Hale for recognizing all the leaders in the community, and I'm sure there's others that he hasn't recognized. And I want to welcome you to your city hall, where we try to, as much as possible, listen to people and respond to them in a democracy that we have, we recognize and'",
        "'speaker_3': 'support all of our diverse communities. And this resolution recognizes Seattle's Vietnamese community and the suffering it has endured. The Vietnam War was a terrible experience. Over a half a million soldiers than us were in Vietnam. And as one of the spokesperson said, over 50,000 Americans died there.'",
        "'speaker_3': 'That's not to mention the millions, millions of Vietnamese caught as innocents in that struggle. It's interesting statistic. The U.S. alone dropped more bombs in all of Vietnam than it had in World War Two in Europe. But now in America, as your representatives have spoken so eloquently, we are in a democracy.'",
        "'speaker_3': 'The barriers to freedom of speech, as you've demonstrated, and the freedom of communities to celebrate their histories. We do not share all the same history. Each of us brings us a different memories, different aspirations. But we all share the belief that fair and open elections are the only way to keep a democracy alive.'",
        "'speaker_3': 'If that only could have been accomplished in Vietnam to peacefully unite that country, perhaps you'd be living in a peace and freedom in Vietnam. But alas, unfortunately, the elections were never held. But now you are free to vote and participate in a democracy whose flag recognizes the freedom to not only be.'",
        "'speaker_3': 'Maintained by citizens who participate in our democracy but are not subject to political ideologies or family dynasties. Many of you will see, hopefully your children to grow a long, peaceful life that will contribute to a strong and vibrant.'",
        "'speaker_3': 'Democracy there responsive. To its citizens like you. Thank you. Thank you.'",
        "'speaker_0': 'Council members.'",
        "'speaker_3': 'Want.'",
        "'speaker_1': 'Thank you, President Burgess, and thanks to the councilmembers who spoke before me. It is great to see City Hall packed with so many people from one of the many communities which make Seattle a lively, colorful and thriving. Communities that have played a significant role in Seattle's fight for justice, against racism and for the rights of the immigrant'",
        "'speaker_1': 'community and all people of color. And as an immigrant woman of color myself, I identify with many of your sentiments. Your contribution to the culture, development and economic prosperity of Seattle is strong and needs to be fully acknowledged, not just acknowledged, but celebrated.'",
        "'speaker_1': 'I have great respect for the Vietnamese community and the thousands of Vietnamese people who have immigrated to the Seattle area. I am fully aware of the hardships, great suffering and tragedy of the thousands who immigrated here. The Vietnam War saw millions killed and tens of thousands of U.S. soldiers dead.'",
        "'speaker_1': 'Many more Vietnamese and American people were wounded and impacted for life. The struggle against colonial rule and domination of Vietnam by foreign powers took many complicated and twisted turns. It led to suffering and tragedies on all sides. All people in Seattle, with its valued Vietnamese community, need to be more aware of this history and this heritage.'",
        "'speaker_1': 'So many people have faced this tragedy and its continuing memory. That is why I honestly believe that this resolution is not completely worked out. I fully support the first part of the resolution, but it says the city of Seattle honors its local Vietnamese community's history, contributions and achievements.'",
        "'speaker_1': 'Unfortunately, I think the subsequent portions where all of that respect and acknowledgment is put into in terms of support for one flag is not reflective of the complicated history and the high emotions still linked to so much hardship and suffering on different sides.'",
        "'speaker_1': 'The flags of the different sides, first of the anticolonial struggle and then of the American Vietnam War. Still today evoke tragic emotions and hurtful memories. Members of the Vietnamese American community. As all of you here are free to attach your own meanings to the flag.'",
        "'speaker_1': 'It is your right in a democracy. The City Council. However, as the city's highest elected body has a duty to not uncritically endorse these product projections and interpretations in the name of the entire city without a fuller understanding of the history of the flag.'",
        "'speaker_1': 'I personally believe it is a mistake for the City Council to endorse a flag of the former South Vietnam flag that is highly controversial and painful to many. I know many have strong opposition to the undemocratic regime in Vietnam today.'",
        "'speaker_1': 'I share this feeling. I stand for full democratic rights of the Vietnamese people and against the Vietnamese government's suppression of independent trade unions, free speech and political assembly. The US government and big corporations are only too happy with today's Vietnamese government.'",
        "'speaker_1': 'So suppressing workers rights, which allows U.S. based corporations to profit from giant sweatshops at the expense of Vietnamese workers and American workers. That is one reason I oppose the Obama administration's efforts to push through the Trans-Pacific Partnership, which would include Vietnam in the so-called trade agreement.'",
        "'speaker_1': 'But when it comes to democracy, the former South Vietnamese government was also a dictatorship. The U.S. war and occupation of Vietnam was totally undemocratic and was fought to suppress the right of the Vietnamese people to determine their own fate.'",
        "'speaker_1': 'The US war in Vietnam, which killed millions of Vietnamese people and tens of thousands of U.S. soldiers, was opposed by a majority of the Americans and the majority of the people in Vietnam and across the world. I think that as an elected body of a major metropolitan area, we have a duty to support these anti-war activists of'",
        "'speaker_1': 'the past and of the present and all those who will have the courage to stand up and oppose wars in the future while having the greatest respect for the Vietnamese community in Seattle. I am unable to vote for a resolution that ties this community's recognition to a particular flag that is mired in controversy.'",
        "'speaker_1': 'On the one hand, it connects rightful aspiration and hopes that many of you have. On the other hand, for others, it connects to a history of colonial oppression and a war brought to Vietnam by the United States at war.'",
        "'speaker_1': 'Like so many before and afterward, like the wars in Afghanistan and Iraq, which were started with high claims of defending humanitarian interests, but which were later on exposed as very narrow battles in the interests not of the people of those countries or of the people of the US, but in the interests of a tiny elite.'",
        "'speaker_1': 'Again, I have the deepest respect for the contribution of the Vietnamese community and your strong impact. I honor the rich heritage you are bringing to the U.S. and especially to this city, and I am strongly in favor of learning and teaching more about this history and all its connotations.'",
        "'speaker_1': 'And as an immigrant and as an elected public servant, I stand in solidarity with you to make Seattle a welcoming and affordable city for all. I invite you, all of you, very sincerely, to continue a dialog with me about these complicated issues so that we can take a balanced and careful stance after all the suffering and hardships'",
        "'speaker_1': 'your families and the people in Vietnam have gone through. Thank you very much for your interest and engagement in City Hall. And please understand my position as a starting point for more exchange and discussion. My door is always open for you, and I am looking forward to deepening my understanding on these issues, regardless of our disagreement on'",
        "'speaker_1': 'this present matter. Thank you.'",
        "'speaker_0': 'Thank you. Excuse me. Excuse me. Excuse me. We don't we don't tolerate those kind of outbursts here, so please refrain from those kind of statements. Councilmember Okamoto. Thank you. Council President Burgess. I also want to.'",
        "'speaker_3': 'Thank Council Member Harold for bringing this resolution forward. I support this resolution because it's a statement of support for our local. Because it's a statement of support for our local Seattle Vietnamese community.'",
        "'speaker_0': 'And their very.'",
        "'speaker_3': 'Painful history, but also our rich history of welcoming you into this community.'",
        "'speaker_0': 'Over 40 years.'",
        "'speaker_3': 'Ago. Our country is a great country. Because we are a country full.'",
        "'speaker_0': 'Of immigrants and.'",
        "'speaker_3': 'Refugees who come.'",
        "'speaker_0': 'From a very.'",
        "'speaker_3': 'Painful history. But we have a future, a common future of hope and prosperity. I don't view.'",
        "'speaker_0': 'This resolution as.'",
        "'speaker_3': 'Taking sides.'",
        "'speaker_0': 'Or.'",
        "'speaker_3': 'Siding with one government or one political regime or another. I don't support this resolution just thinking that.'",
        "'speaker_0': 'It supports the.'",
        "'speaker_3': 'Local community at the expense of the people in Vietnam. We have a sister city relationship with the city of Haiphong. We were one of the first.'",
        "'speaker_0': 'Cities in the United.'",
        "'speaker_3': 'States to welcome Vietnamese Prime Minister Khai. With a lot of controversy. But this resolution honors our local Vietnamese community. And in that I support.'",
        "'speaker_0': 'It and urge my colleagues to.'",
        "'speaker_3': 'Support the resolution to.'",
        "'speaker_0': 'Thank you. I will now vote on resolution 31591.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Would you like to? Yeah. All right. Requested that we take a roll call vote. Will the clerk please call the roll on the passage and adoption of the resolution?'",
        "'speaker_2': 'So I don't know. Bagshaw I. Garden I.'",
        "'speaker_4': 'Harrow I.'",
        "'speaker_3': 'Licata I.'",
        "'speaker_2': 'O'Brien.'",
        "'speaker_3': 'I Okamoto.'",
        "'speaker_2': 'I Rasmussen. I President Burgess. Eight in favor one opposed it.'",
        "'speaker_0': 'Resolution is it?'",
        "'speaker_6': 'Read it. And.'",
        "'speaker_0': 'Thank you. Thank you. The resolution is adopted eight in favor, one opposed and the chair will sign. It will now move to items two, three and four. And gentlemen, if you're welcome to stay with us here as we continue our business.'",
        "'speaker_0': 'But if you wish to leave, if you could please quietly go out into the foyer and then we can continue here so you can stay and you're welcome to. But if you want to leave, please quietly leave to the foyer.'",
        "'speaker_0': 'Do your conversations out there. Will the clerk please read items two, three and four?'"
    ],
    "AN ORDINANCE authorizing the Superintendent of Parks and Recreation to execute and accept from the Washington State Department of Natural Resources on behalf of the City of Seattle a Waterway Permit for Waterway 3 and a Waterway Permit for a portion of Waterway 4, both in Lake Union Park.": [
        "'speaker_0': 'The appointments are confirmed. The report of the Parks Seattle Center, Libraries and Gender Pay Equity Committee. Please read Item seven.'",
        "'speaker_7': 'The Report of the Park Seattle Center Libraries and Gender Pay Equity Committee Agenda Item seven Council Bill 118414 Authorizing the Superintendent of Parks and Recreation to execute and accept from the Washington State Department of Natural Resources on behalf of the City of Seattle.'",
        "'speaker_7': 'A Waterway Permit for Waterway three and a waterway permit for a portion of Waterway four, both in Lake Union Park. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_2': 'This is a permit that we authorized the Superintendent of Parks to accept from the Washington State Department of Natural Resources. On behalf of the city. These are two waterways, Waterway three and Waterway four, both of which you may know, adjoin to the probably would be the north east of Lake Union Park and the committee recommends passage.'",
        "'speaker_0': 'Thank you. And questions or comments. Please call the rule on the passage of the bill.'",
        "'speaker_2': 'So, Sergeant. I beg your pardon. I harrow. I Licata.'",
        "'speaker_3': 'All right.'",
        "'speaker_2': 'O'Brien.'",
        "'speaker_3': 'Bye.'",
        "'speaker_2': 'Okamoto. Hi, Rasmussen. Hi, President Burgess. Hi. Nine in favor.'"
    ],
    "AN ORDINANCE relating to the Seattle Center Department; authorizing execution of an agreement with Festivals, Inc. for the presentation of the annual Bite of Seattle Festival at Seattle Center in 2015, 2016, and 2017; and ratifying and confirming prior acts.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item eight.'",
        "'speaker_7': 'Agenda item eight Council Bill 118408 relating to the Seattle Center Department authorizing execution of an agreement with Festivals Inc for the presentation of the annual Byte of Seattle Festival at Seattle Center in 2015, 2016 and 2017 and ratifying and confirming prior acts.'",
        "'speaker_7': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Council Member.'",
        "'speaker_2': 'Gordon. This is authorizing the head of the Seattle Center, Robert Nelms, to execute an agreement with Festivals Inc for the presentation of the annual byte of Seattle, which is a very free, family friendly, popular event for 2015, 16 and 17.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'So aren't I. I. I. Gordon Harrell I Lakota O'Brian.'",
        "'speaker_3': 'I Okamoto High.'",
        "'speaker_2': 'Rasmussen President Burgess High nine in favor.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item nine.'"
    ],
    "A RESOLUTION setting the public hearing on the petition of the City Light Department for the vacation of Pontius Avenue North between Denny Way and John Street in the South Lake Union Urban Center neighborhood of Seattle.": [
        "'speaker_7': 'Agenda Item ten Resolution 31594. Setting the public hearing on the petition of the Seattle City LT Department for the vacation of Pontius Avenue North between Danny Way and John Street in the South Lake Union Urban Center neighborhood of Seattle.'",
        "'speaker_0': 'Thank you. Councilmember Rasmussen.'",
        "'speaker_3': 'Yes. This is and I'm sorry.'",
        "'speaker_0': 'This is a routine amendment where we set the date for a public hearing, and this will be a public hearing on the Danny substation site at Pontius and Denny. And thank you. That is what we'll do.'",
        "'speaker_2': 'Do we have a date set?'",
        "'speaker_0': 'It is in the resolution itself. If you have a copy of that. Well, maybe somebody could. We will find a solution.'",
        "'speaker_4': 'Up in the restaurant. You didn't exactly seem prepared on this since.'",
        "'speaker_3': 'I was.'",
        "'speaker_0': 'Getting prepared for the next meeting. Does somebody have it up on their screen?'",
        "'speaker_3': 'July 30th.'",
        "'speaker_1': 'I had my.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Councilmember. It's July 30. All right. So we're setting a date for a public hearing. That's all we're doing. And that public hearing will be held here in chambers on July 30. And we know the time. It would be at 936.'",
        "'speaker_3': 'At the Belltown Community Center. Oh.'",
        "'speaker_0': 'So it's July 30 at 930 in the morning at the Belltown Community Center.'",
        "'speaker_3': 'Five 3530.'",
        "'speaker_0': 'In the.'",
        "'speaker_3': 'Morning. Sometimes it takes teamwork to do these things.'",
        "'speaker_0': 'Teamwork. All right. We'll say that one more time. It's July 30th, 530 in the evening. Belltown Community Center. Okay, great. Thank you. Are there any other questions or comments? Yes, Councilmember.'",
        "'speaker_1': 'So on. I'm glad we have the day because that was my whole comment is about why we should let people know when the hearing is. They just want to say that usually allegations are non-controversial issues. But I just wanted to draw a little attention to this one.'",
        "'speaker_1': 'As chair of the Energy Committee, this litigation is for the construction of the Denny substation, which is a very large Seattle City Light project in the middle of the Cascade neighborhood, the residential neighborhood and several low income housing buildings are immediately adjacent to the construction site, and substations usually don't go in such dense, densely populated areas.'",
        "'speaker_1': 'But this one is an exception. I do know that City Light has done a lot of outreach so far to the community and has found ways in which to mitigate the potential impact of the construction of this project on the neighbors.'",
        "'speaker_1': 'And I support moving forward to the public hearing. Just wanted to highlight the hearing just in case somebody is listening and wants an opportunity to comment. So thank you.'",
        "'speaker_0': 'Thank you. Thank you very much. So to repeat again, the hearing is July 35, 30 PM at the Bell Town Community Center. Any other questions or comments? All in favor of adopting Resolution 31594 setting the public hearing vote.'",
        "'speaker_0': 'I oppose vote no. The resolution is unanimously adopted. Is there any other business? Councilmember Gardner, the Central Waterfront Committee will meet next. And beginning at what time?'",
        "'speaker_2': 'May I suggest that because of the very large number of citizens here in support of the resolution on the Vietnamese Heritage and Freedom flag, please can we plan 15 minutes between full council and the waterfront committee so that council members may briefly join the community in the birthday Atlantis room if they wish.'",
        "'speaker_2': 'However, since we do expect an audience at the Waterfront Committee and we will not be able to start the committee until there are at least five council members. So let's be back promptly at 330.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you. So we'll reconvene at 330 as the Select Committee on the Central Waterfront. The city council is now adjourned.'"
    ]
}