{
    "AN ORDINANCE relating to the Department of Finance and Administrative Services; authorizing the Director of the Department of Finance and Administrative Services or the Directors designee to negotiate and execute a real property lease renewal with the United States Army for The City of Seattles continued interim use and occupancy of 33.95 acres at the Fort Lawton Army Reserve Center; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Thank you so much. The bill passes and the chair will sign it. We'll look for fees to fix my signature to the legislation on my behalf. Will the clerk please read item one into the record report the City Council Agenda Item one Council Bill 120210.'",
        "'speaker_0': 'An ordinance relating to the Department of Finance and Administrative Services authorizing the Director of the Department of Finance and Administrative Services or the Director's designee to negotiate and execute a real property lease renewal with the United States Army for the City of Seattle's continued interim use and occupancy of 33.95 acres at the Fort Lawton Army Reserve Center'",
        "'speaker_0': 'and ratifying and confirming certain prior acts. Thank you so much. I moved the past council bill 120210. Is there a second? Okay. It's been. We've been seconded to pass the bill. I'm going to hand it over to Councilmember Mosquito, who's the sponsor of the bill and who has a amendment for our consideration.'",
        "'speaker_0': 'Thank you very much, Council President. I move to amend Council Bill 120210 by substituting version two for version d1a substituting attachment one substituting exhibit B, C, E and F, two attachment one all as presented in the agenda and by removing exhibits G and H.'",
        "'speaker_2': 'I can't.'",
        "'speaker_0': 'Thank you so much. It's been you've been seconded to amend the Council bill. Councilmember Mosqueda, anything else you would like to say to address these amendments? Thank you very much. Council President colleagues. This legislation authorizes finance and administrative services to exact executive excuse me to execute a one year lease agreement with for one year extensions for the'",
        "'speaker_0': 'Fort Lawton site currently owned by the U.S. Army. While the City of Seattle's application to the U.S. Department of Housing and Urban Development continues to go through its process for approval and the redevelopment plan to create affordable housing, open space and habitat.'",
        "'speaker_0': 'As a reminder, Fort Lawton project approved by council, will create 85 supportive housing units for older adults, including veterans who have experienced homelessness. 100 units that are 100 units that will include one, two and three, four bed one, two and three bedroom flats or row houses for renters with incomes up to 60% of the area median income'",
        "'speaker_0': '. It will include 53 bedroom, permanently affordable housing row row houses or an townhomes for households with incomes up to 80%. AMI this is all included around an athletic field, forest, land and parkland. This lease agreement authorized by this legislation will allow the city to use the property in the interim while we await approval from HUD and make'",
        "'speaker_0': 'sure that we can continue towards our long term redevelopment plan. The city doesn't pay a fee to the U.S. Army, but it is responsible for all holding and caretaking costs associated with the property, which are covered equally by the Office of Housing and Parks and Recreation Department.'",
        "'speaker_0': 'We look forward to working with the administration and to seek approval from HUD for the Fort Lawton Redevelopment Plan. You're excited about this, but this is an interim step today. Thank you. Council President. Thank you so much. Colleagues, any additional comments on the amendments?'",
        "'speaker_0': 'Hearing none. Will the court please call a roll on the adoption of the amendments?'",
        "'speaker_1': 'So on. Yes. Strauss. Yes. For bold as. Whereas I. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Skinner. By Paterson.'",
        "'speaker_4': 'High.'",
        "'speaker_1': 'Council President Gonzalez. I favor it.'",
        "'speaker_0': 'Unopposed motion carries any amendments are adopted. Are there any additional comments on the bill as amended? I've not seen any hands raised, so we'll please call the role on the passage of the bill as amended to want.'",
        "'speaker_1': 'Yes. Strauss. Yes. Scribbled. Yes. Whereas I. Lewis. Yes. Morales Yes. Mosquera i. Peterson I counsel President Gonzalez i. Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? K Council Members Select Budget Committee report consists of 33 items of business. This afternoon, Council members will be provided an opportunity to make comments on each item before I request the clerk to call the'"
    ],
    "AN ORDINANCE authorizing, in 2021, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Education and Early Learning, Human Services Department, Department of Transportation, Seattle Public Library, Fire Department, City Attorneys Office, Seattle Center, Seattle Parks and Recreation, and Police Department to accept specified grants, private funding, and subsidized loans and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'At please read the title of item two into the record. Agenda item to Council Bill 120220 an ordinance authorizing and 2021 acceptance of funding from non city sources authorizing the hands of the Executive Department, Department of Education and Early Learning.'",
        "'speaker_0': 'Human Services Department. Department of Transportation. Seattle Public Library. Fire Department. City Attorney's Office. Seattle Center. Seattle Parks and Recreation and Police Department to accept specified grants, private funding and subsidized loans and execute, deliver and perform corresponding agreements and ratifying and confirming certain prior acts.'",
        "'speaker_0': 'The Committee recommends City Carson City Council pass the Council bill with councilmembers Mesquita, Herbold, Gonzales, Suarez, Lewis, Morales and Straus favor and Councilmember Peterson abstaining. Thank you, Madam Clerk. Are there any additional comments on the bill? Hearing no additional comments on the bill.'",
        "'speaker_0': 'Will the piece call the vote on the passage of the bill?'",
        "'speaker_1': 'So on. Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. Yes. I. Peterson.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'Council President Gonzales. I nine in favor.'"
    ],
    "AN ORDINANCE amending Ordinance 126237, which adopted the 2021 Budget, including the 2021-2026 Capital Improvement Program (CIP); changing appropriations to various departments and budget control levels, and from various funds in the Budget; revising project allocations for certain projects in the 2021-2026 CIP; creating positions; modifying positions; abrogating positions; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Nine opposed the bill passes in the trouble planet. Will the card please affix my signature to the legislation on my behalf? Will the clerk please read the title of item three into the record channel? Item three Council Bill 120221 An ordinance amending ordinance 126237 which adopted the 2021 budget, including the 2021 through 2026 capital improvement program a.S.A.P'",
        "'speaker_0': '. The committee recommends the bill passed as amended. Thank you so much. Are there any comments on the bill? Council members the one place.'",
        "'speaker_3': 'Sorry. Just finding my place here. I will I will be voting no on this 20, 21 year end supplemental budget. Unfortunately, because this vote is coinciding with the votes on the total city budget for next year, it has not received the attention it needs.'",
        "'speaker_3': 'As in previous years, there are many elements of this supplemental budget that I have no objection to, but there are some aspects that are very objectionable, and for that reason I will be voting no. This supplemental budget increases the police budget for this year 2021, by a total of $6 million.'",
        "'speaker_3': '333,540. How can the police complain of hundreds and hundreds of vacancies and a reduced payroll on the one hand and demand millions more dollars in mad money? On the other, it makes no sense. Some of that increased funding comes from the general fund and would better be spent on housing renewal programs and social services.'",
        "'speaker_3': 'Other funding comes from federal grants, and some of those grants are particularly ominous because it includes grants from the FBI and from Homeland Security for those so-called joint operations that have been used in the past to criminalize dissent.'",
        "'speaker_3': 'Like the way peaceful Black Lives Matter protesters were arrested and investigated by federal officers in the Justice for George Floyd movement last year. For those reasons, I will be voting no on this supplemental budget.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Comes first. Are there excuse me, any additional comments? Any additional comments? Any additional comments on the bill? Gary None. The piece called the roll on the passage of the bill won't.'",
        "'speaker_1': 'No. Strauss Yes. Herbold Yes. Whereas I. Lewis. Yes. Morales. Yes. Mascara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'I. Council President Gonzales I. Eight in favor one opposed.'"
    ],
    "AN ORDINANCE amending Ordinance 126000, which adopted the 2020 Budget, including the 2020-2025 Capital Improvement Program (CIP); changing appropriations to various departments and budget control levels, and from various funds in the Budget; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'The bill passes and the chair will sign. It will occur. Please affix my signature to the legislation on my behalf. The clerk please read the title of item four into the record. Jan Item four Council Bill 120040 An Ordinance Meeting Ordinance 126000 which adopted the 2020 budget, including the 2023 2025 CFP, changing appropriations to various departments and'",
        "'speaker_0': 'budget control levels and from various funds in the budget and ratifying and confirming certain prior acts or by three quarter vote of the City Council. Kinney The committee recommends the City Council pass the council bill with Councilmembers Macheda Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson abstaining.'",
        "'speaker_0': 'A few. Madam Clerk, are there any additional comments on the bill? Any additional comments last time? Any additional comments on the bill? Carry none. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Sergeant. Yes. Strauss Yes. Herbold Yes. Whereas I. Lewis Yes. Morales Yes. ROSQUETA, i. Paterson, I. Council. President Gonzalez. I mean, in favor and unopposed.'"
    ],
    "A RESOLUTION requesting King County and the State of Washington to increase services to address behavioral health conditions.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the fix my signature to the legislation on my behalf? Will the quick please read the title of item five into the record? Item five Resolution 32026 Resolution requesting King County and the State of Washington to increase services to address behavioral health conditions.'",
        "'speaker_0': 'The committee recommends that City Council adopt, as amended, the resolution. Thank you so much. Are there any comments on the resolution? Councilmember Strauss, please.'",
        "'speaker_4': 'I think your council president has more point of order for as we are voting, if when you request the clerk to call the walk, you call the item in which we are voting for. Following along the agenda, I just know there's so much we're voting on today.'",
        "'speaker_0': 'Sure.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilmember Herbold, please.'",
        "'speaker_2': 'Thank you so much. Just a couple of words on this resolution. We all know that the impact of the pandemic on our mental health has been undeniable over the last year and a half. The unprecedented anxiety, pain and isolation of the past year and a half have led to negative mental health impacts and occasionally dropping into self-harm'",
        "'speaker_2': 'and gun fire, assault and other forms of violence. We want to note that this lack of adequate mental health resources is felt by Seattle residents every day at funding. Our behavioral health system is primarily a county and state responsibility.'",
        "'speaker_2': 'I'm pleased that our partners at King County are supportive of and aligned at. That leads to better support for Seattle residents that are struggling with behavioral health challenges. City is willing to do our part and we're looking forward to the county leading the way.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilmember Herbold, are there any additional comments on resolution 32026? Agenda item five. Hearing? None. Will the clerk please call the role on the adoption of resolution 32026? Agenda item five.'",
        "'speaker_1': 'Want. Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. As was KERA. I. Petersen. I. Council President Gonzalez. I. Nine in favor and unopposed.'"
    ],
    "A RESOLUTION modifying the Mayoral Civil Emergency Order of October 29, 2021, related to hiring incentives for public safety emergency response.": [
        "'speaker_0': 'Thank you, Madam Clerk. Resolution 32026. Agenda item five is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the Court please read the title of item six into the record and the item six Resolution 32027.'",
        "'speaker_0': 'A resolution modifying the Mayoral Civil Emergency Order of October 29th, 2021, related to hiring incentives for public safety. Emergency Response. The committee recommends the City Council adopt, as amended, the resolution with councilmembers Herbold, Gonzalez, Lewis and Morales and favor councilmembers Macheda and Serrano opposed and councilmembers Suarez, Peterson and Strauss abstaining.'",
        "'speaker_0': 'Thank you, madam. Are there any comments on resolution 32027? Agenda item six. Councilmember Herbold, please.'",
        "'speaker_2': 'Thank you so much. As a clerk, this was approved in the Budget Committee by a42 vote with three abstentions. The CBA and the resolution are intended to amend the mayor's emergency order on hiring incentives to first limit the duration of the emergency order through the end of 2021.'",
        "'speaker_2': 'And secondly, to limit expenditures pursuant to the order $500,000 in 2021 is the amount his office estimated would meet it in 2021. The resolution works in conjunction with a budget action in the chairman's balancing package, which requests a report from the City Budget Office to the Council on a potential citywide hiring incentive for frontline workers beyond those'",
        "'speaker_2': 'covered in the mayor's current emergency order. Extending those incentives to to recruits, to departments beyond speed and the Community Safety Communication Center. Item Leaves in place Mayor's Executive Order regarding hiring bonuses for police officer in line areas through the end of 2021.'",
        "'speaker_2': 'Some of you may recall that there is another proposal not on the agenda today to limit the hiring incentives to only see us seek recruits and not permit the incentives or our recruit. If the vote in favor of action eight does not prevail, we will very likely see the other proposal before us at our next meeting, and'",
        "'speaker_2': 'that this proposal is related to an executive order promulgated by Mayor Durkan. I believe it's appropriate the executive order and end of her term regardless which action amending mayor and executive order ls. Incoming elect incoming mayor elect Harrell could issue a new executive order in 2022.'",
        "'speaker_2': 'Support important work of all of our city departments and I recognize the difficulty we are having filling vacancies in this labor market and the impact on the delivery of supply of public services and the impact on morale in each of these departments.'",
        "'speaker_2': 'And for that reason, I, for one, would strongly prefer of a 2022 fixation, which means indeed, we could add bonus incentives for rather than having a new conversation both this year and again next year, about excluding SPV officer recruits.'",
        "'speaker_2': 'Finally, as a reminder, the balancing package before us. There is no funding for bonuses in 2022 as a quently then those funds are not in the 2022 budget. It's more important than ever that if we're going to have a bonus program in 2022, we have deliberations about how to fund it before authorizing it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'He becomes member. Councilmember Peterson, please.'",
        "'speaker_4': 'Thank you. Council President. I thank you, Councilmember Herbold, for that. I support Mayor Durkin's executive order for hiring incentives, and it seems to have achieved some early success. I believe these hiring incentives are needed after the alarming spike in the number of police officers in 911 dispatchers leaving their positions.'",
        "'speaker_4': 'At the same time, I agree that today's suggested modifications of the executive order from our public safety chair are reasonable and fiscally prudent as they allow the hiring incentives to continue to the end of this year. And while the Council unfortunately did not approve hiring incentives as part of our fall budget process for next year 2022, today's'",
        "'speaker_4': 'action still leaves the door open for the incoming administration to reissue a similar executive order if needed, as Seattle competes with other jurisdictions across the nation for emergency response personnel. I would encourage the incoming administration in January to do what it can and not only to hire police officers and firefighters and 9 million dispatchers, but also to'",
        "'speaker_4': 'retain these valuable employees that we already have. So they continue to serve Seattle. So I will be voting for these modifications. Thank you.'",
        "'speaker_0': 'I think it comes from Peterson, who has more than one.'",
        "'speaker_3': 'Thank you. On October 29th, Mayor Durkan issued an emergency order to reinstate hiring bonuses of up to $25,000 for new police officers. Ironically, her excuse for this emergency order was to give police even more money because of the COVID 19 emergency.'",
        "'speaker_3': 'In other words, even though so many police officers are actually endangering the public by refusing to be vaccinated or to wear masks, they still apparently need to be given more money. Mayor Durkan has shown a shocking double standard when she advocated for hiring bonuses in the Seattle Police Department.'",
        "'speaker_3': 'The police are some of the highest paid city of Seattle employees, making more than double what is paid to social workers like homeless service workers. The mayor has claimed in the past that she could not that she could she could not open homeless shelters and tiny house villages because there are not enough homeless service workers to staff'",
        "'speaker_3': 'new spaces. Where are the hiring bonuses then, or just decent living standards for impoverished homeless service workers who actually help people turn their lives around? Most importantly, the size of the police budget is not what has a statistical impact on the amount of crime in a community, and that includes police officer salaries as well, not having a'",
        "'speaker_3': 'statistical impact on public safety. I apologize for my dog. It is reducing inequality and providing affordable housing and living wage jobs and affordable services, including childcare, but has a greater statistical impact. I absolutely share the concerns that working people have about the rise in gun violence.'",
        "'speaker_3': 'There is no question that we do need to address this. But if you look at the data, you will see that this is happening. Even though the police budget has been bloated for many years, while the social services and affordable housing that working people, oppressed communities and the poor need continue to be gravely underfunded and at the'",
        "'speaker_3': 'same time, rents by corporate landlords are skyrocketing. Studies show overwhelmingly the best and really only solution to public safety issues is to fund the needs of our society to address crime, and particularly to stop crimes before they even happen.'",
        "'speaker_3': 'We need to find affordable housing, social housing that is publicly owned, high quality, affordable housing funded by taxing big businesses and the wealthy. We need to raise wages and and exploitation, not increase repression. We need an elected community oversight committee with full powers over the police.'",
        "'speaker_3': 'On November eight, my office introduced legislation to modify the mayor's executive order, which would stop the implementation of the police hiring bonuses that the council voted on Loder in September against implementing twice by legislation left in place the hiring bonuses for 911 operators.'",
        "'speaker_3': 'However, rather than bringing that legislation to a vote, it was delayed by two weeks to give the political establishment the opportunity to bring alternative legislation through the Budget Committee that essentially approves the mayor's executive order, which is the bill in front of us today.'",
        "'speaker_3': 'I'm confused how this bill, which does not amend one word or a number in the budget, was treated as budget legislation. But regardless, it is the bill in front of us today. This bill approves Durkan the executive order on hiring bonuses for the duration of her term.'",
        "'speaker_3': 'In my view, those hiring bonuses are a terrible misuse of city resources that should be used for affordable housing, social services and for the needs of our communities. So I will be voting no on this resolution if the majority of the Council agrees with me and votes no on this emergency order.'",
        "'speaker_3': 'I hope the Council will consider to schedule a will. Agree to schedule the resolution from my office rejecting the mayor's emergency order for a vote next Monday.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Silent. Are there any additional comments on item six, which is resolution 32027? Councilmember, will you have the last word.'",
        "'speaker_2': 'On the points for the viewing public? I just want to advise that the mayor's office has confirmed that funding is available throughout during 2021 to implement the executive order. I have requested an update from the Mayor's Office on the implementation of the vaccine mandate as it pertains to police officers and 911 dispatchers.'",
        "'speaker_2': 'I'm confused as to. Councilmember still wants reference of the vaccine mandate and the fact that officers haven't complied as a reason for why a hiring incentive for departments that who for whom their management is enforcing the vaccine mandate event.'",
        "'speaker_2': 'I mean I think that is what is partially creating the need for hiring incentives is to support the officers in one case and the one dispatchers in the other case who have complied and who are are still with the city, still performing public service and are working in departments that have large vacancies.'",
        "'speaker_2': 'So I really see the the allowance of of hiring incentives through the end of this year as really being part and parcel of supporting the enforcement of the vaccine mandate.'",
        "'speaker_0': 'Thank you. Thank you so much, Councilmember Herbold. Okay. With that debate is now closed on this particular agenda item. So will the clerk please call the role on the adoption of resolution 32027? Agenda item six.'",
        "'speaker_1': 'So want no. Strauss. Yes. HERBOLD. Yes. Whereas. Yes. LEWIS Yes. Morales Yes. Well, Sarah, I.'",
        "'speaker_4': 'Peterson I.'",
        "'speaker_1': 'Council president. Gonzalez, I Adan favor one opposed.'"
    ],
    "A RESOLUTION concerning the health, well-being, and safety of domestic workers; expressing Councils intent to establish a right to portable Paid Time Off (PTO) for domestic workers in Seattle; and requesting the Office of Labor Standards to work with community stakeholders to draft legislation creating a portable PTO policy for domestic workers.": [
        "'speaker_0': 'Resolution is adopted and the chair will sign it. Will the group please fix my signature to the legislation on my behalf? Will Clark please read the title of item seven into the record. Agenda Item seven. Resolution 32028. A resolution concerning the health, well-being and safety of domestic workers, expressing council's intent to establish a right to portable paid'",
        "'speaker_0': 'time off for domestic workers in Seattle and requesting the Office of Labor Standards to work with community stakeholders to draft legislation creating a portable policy for domestic workers. The committee recommends the City Council adopt the resolution with councilmembers Macheda Herbold, Gonzales, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. Are there any comments on resolution 32028? Agenda item seven. Councilor, Mosquito Council president, colleagues, I'm excited about this resolution as a corresponding piece of legislation to pass today along with the budget. The COVID 19 pandemic really has amplified the inequities that are inherent in our current treatment of frontline essential workers.'",
        "'speaker_0': 'This inequity that we are seeing across many industries exponentially impacts communities of color, workers of color. And there has been a clear impact on domestic workers as well. I am excited about the legislation in front of us that will continue the path of good policymaking that's rooted in community experience, rooted in the experience of those who are'",
        "'speaker_0': 'the frontline workers themselves, in this case, domestic workers. This piece of legislation builds on the $500,000 that the mayor also included in her proposed budget that the council is continuing to include in our proposed budget and works on policy development in collaboration with community partners such as the Domestic Worker Standards Board and the Affordable Benefits Coalition to'",
        "'speaker_0': 'develop policy to expand upon the benefits of the Domestic Workers Bill of Rights codified two years ago. We all believe that workers deserve respect and all worker on all workers should have dignity. And the legislation in front of us that corresponds with ongoing conversations throughout next year will allow for us as a city, as a city family'",
        "'speaker_0': 'to develop in partnership with community, a policy that outlines how to ensure there's paid time off for caregivers and their families so that they can care for their kiddos and their elders as well. No worker should be forced to choose between working while sick or facing lost wages.'",
        "'speaker_0': 'But until we ensure that there is a paid time off policy that can correspond to the work of domestic work which has many different hiring entities, often we are in a situation where disparity continues. I look forward to continuing to work with community partners and hearing more from cities like San Francisco and Philadelphia who have passed or'",
        "'speaker_0': 'are considering ordinances protecting the right for paid time off to domestic workers. Those cities are currently working on legislation and implementation to make sure that this commitment is a reality. I really love that we are on the national stage for all of the work that you all supported with the Domestic Workers Bill of Rights, that national conversation'",
        "'speaker_0': 'continues to center around how domestic workers have a clear path to paid leave when they need it. So thank you all for your consideration of this resolution in front of us today, which is really about the ongoing work that we will commit to in 2022 with community as and this correlates to the $500,000 included in the 2022'",
        "'speaker_0': 'budget process for other aspects which include doing outreach, engagement with hiring entities, community partners, and the necessary work for education and enforcement. I look forward to hearing more in 2022 as we develop this policy together. Thank you, Councilor.'",
        "'speaker_0': 'Was there any additional comments on resolution 32028 Agenda item seven? What I wanted to think. Madam President. One more. One more time, Councilman. State, go ahead. Just wanted to thank Lori Mayhew, who's in our office of legislative intern, who has been really leading the effort on this.'",
        "'speaker_0': 'So thank her and Annabelle and labor standards for their deep engagement with community partners, including the Portable Candidates Coalition, and shout out to them as they continue to call in and express support for that. So thank you all.'",
        "'speaker_0': 'Anything else? All right. Well, Clark, please call the role on the adoption of resolution 32028. Agenda item seven.'",
        "'speaker_1': 'The want. Yes. Strauss. Yes. Herbold. Yes. Whereas. LEWIS Yes. Morales Yes. Russia i. Peterson, I. Council President Gonzalez. I vote in favor and unopposed.'",
        "'speaker_0': 'Thank you. Resolution 32028. Agenda item seven is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the title of item eight into the record?'",
        "'speaker_0': 'Agenda Item eight Clerk File 314487. The 2022 proposed Budget Committee recommends City Council file to file with council members must get a Herbold, Gonzalez, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you so much.'"
    ],
    "AN ORDINANCE relating to the 2022 Budget; authorizing Department directors to accept anticipated future grants and enter into revenue-backed service contracts to support appropriations in the 2022 Budget.": [
        "'speaker_0': 'Emotion carries and the click file is approved and placed on file. Will the clerk please read the title of item ten into the record? Agenda Item ten Council Bill 120189. An ordinance relating to the 2022 budget authorizing department directors to accept anticipated future grants and enter into revenue back service contracts to support appropriations in the 2022 budget'",
        "'speaker_0': '. The Committee recommends City Council pass the Council.'",
        "'speaker_1': 'Bill.'",
        "'speaker_0': 'With council members Muscat, a Herbold, Gonzalez, Suarez, Luis Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you. Are there any comments on Council Bill 1 to 0 189? Agenda item ten. These are comments on agenda item ten, if there are any.'",
        "'speaker_0': 'Right. Not seen any hands raised. So the police call the role on the passage of Council Bill 120189. Agenda Item ten.'",
        "'speaker_1': 'Want? Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. Yes. Mosquito. I. Petersen. I. Council President Gonzalez. I am not in favor of.'",
        "'speaker_0': 'Thank you so much. Will the clerk please read the title of item 11 into the record? Agenda Item 11. Resolution 32024. A resolution adopting revised financial policies for the emergency fund. The committee recommends City Council adopt the resolution with council members Macheda Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor.'"
    ],
    "AN ORDINANCE relating to fees and charges for permits and activities of the Seattle Department of Construction and Inspections, related fees by other departments, and technical corrections; amending Sections 22.900D.090, 22.900D.100, and 22.900D.150 of the Seattle Municipal Code (SMC).": [
        "'speaker_0': 'Thank you. Resolution 32024. Agenda item 11 is adopted. Mature will sign. It will fix my signature to the legislation on my behalf. Will the clerk please read the title of item 12 into the Record Gender Item 12 Council Bill 120190 An Ordinance relating to fees and charges for permits and activities of the Seattle Department of Construction and'",
        "'speaker_0': 'Inspections related fees by the other Departments and Technical Corrections Committee. Recommend City Council Pass a Council Bill with Councilmembers Macheda, Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you so much. Are there any comments on Council Bill 1 to 0 190?'",
        "'speaker_0': 'Agenda item 12. Agenda Item 12. Any comments on that council bill? Not seen any hands raised so well. The police called the role in the passage of Council Bill 120190. Agenda Item 12.'",
        "'speaker_1': 'One. Yes. Strauss. Yes. For both. Whereas I. Lewis. Yes. Morales. Yes. Skinner. I. Peterson. I. Council President Gonzalez. High nine in favor an unopposed council.'"
    ],
    "AN ORDINANCE relating to street and sidewalk use; amending the Street Use Fee Schedule authorized by Section 15.04.074 of the Seattle Municipal Code; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Bill 120190. Just agenda item 12 passes and the chair will sign it. Will the please affix my signature to the legislation on my behalf? Will the clerk please read the title of item 13 into the record? Agenda Item 13 Council Bill 120191 An ordinance relating to street and sidewalk use amending the street use fee schedule authorized by'",
        "'speaker_0': 'section 15.0 4.074 of the Seattle Municipal Code and ratifying and confirming certain prior acts. The committee recommends the bill pass with council members Macheda Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor and counsel Peterson abstaining. Thank you so much.'",
        "'speaker_0': 'Are there any comments on Council Bill 1 to 0 191? Agenda item 13. Any comments on agenda item 13, which is Council Bill 120191 hearing none. Will the clerk please call the roll on the passage of Council Bill 1 to 0 191.'",
        "'speaker_0': 'Agenda Item 13.'",
        "'speaker_1': 'Silent yes. Strouse Yes. Bold yes. Or is I?'",
        "'speaker_4': 'Lewis Yes.'",
        "'speaker_1': 'Growlers yes. Skinner, I. Peterson II Council President Gonzales was by nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120191. Agenda item 13 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the title of item 14 into the record?'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; establishing the 2022 fee schedule for the use of park properties and other park and recreation facilities and services; and superseding previous park and recreation fee schedules.": [
        "'speaker_0': 'Agenda Item 14 Council Bill 120192 An ordinance relating to the Department of Parks and Recreation establishing the 2022 fee schedule for the use of park properties and other park and recreation facilities and services and superseding previous park and recreation fee schedules.'",
        "'speaker_0': 'The Committee recommends the City Council pass the Council bill with councilmembers mosquito Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you so much. Are there any comments on Council Bill 1 to 0 one nine to agenda item 14.'",
        "'speaker_0': 'Agenda item 14. Looking for any comments on agenda item 14. I don't see any hands raised. So will the Court please call the role on the passage of Council Bill 1 to 0 one nine to agenda item 14.'",
        "'speaker_1': 'It's a warrant. Yes. Strauss. Yes. Herbold. S whereas i. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Yes. I. Peterson. All right. Council President Gonzales. I. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120192 Agenda item 14 passes and the chair will sign it. Will Kirklees affix my signature to the legislation on my behalf? Will the clerk please read the title of item 15 into the record?'"
    ],
    "AN ORDINANCE relating to Seattle Parks and Recreation (SPR); authorizing an administrative amendment to Ordinance 115859, which established the Beach Maintenance Trust Fund (70200) as a subsidiary fund of the Shoreline Park Improvement Fund (SPIF) (33110), which fund was established by Ordinance 115496 as part of the settlement agreement with the Municipality of Metropolitan Seattle (Metro) for the construction of the West Point and Alki secondary sewage projects, and which expired in January 2011.": [
        "'speaker_0': 'Agenda Item 15 Council Bill 120193 An ordinance relating to Seattle Parks and Recreation authorizing an administrative amendment to Ordinance 115859, which established the Beach Maintenance Trust Fund as a subsidiary fund of the Shoreline Park Improvement Fund. Which fund was established by Ordinance 115496 as part of the settlement agreement with the Municipality of Metropolitan excuse me Municipality of'",
        "'speaker_0': 'Metropolitan Seattle for the construction of the West Point and Elk Secondary Sewage Projects, and which expired in January 2011. The committee recommends City Council passed that.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'Members must get a Herbold, Gonzalez, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you so much. Are there any comments on Council Bill 1 to 0 193, agenda item 15, you're on agenda item 15.'",
        "'speaker_0': 'Any comments? Hearing no comments. Will the court please call the roll on the passage of Council Bill 120193 Agenda Item 15.'",
        "'speaker_1': 'It's a want. Yes. Strauss Yes. Herbold Yes. Whereas I. Lewis Yes. Morales Yes, that's correct. I. Peterson I. Council President Gonzalez i. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to King County Conservation Futures Levy proceeds; authorizing the Mayor to enter into a new Interlocal Cooperation Agreement between The City of Seattle and King County to allow for the acceptance of Conservation Futures Levy funds; authorizing the deposit of 2020 and 2021 allocations from King County Conservation Futures Levy proceeds into The City of Seattles Parks Fund.": [
        "'speaker_0': 'Council Bill 120193 Agenda item 15 passes and the chair will sign it. Will the court please affix my signature to the legislation on my behalf? Will the Court please read the title of item 16 into the record? Agenda Item 16 Council Bill 120194 An ordinance relating to King County Conservation Futures Levy proceeds authorizing the mayor to enter'",
        "'speaker_0': 'into a new Interlocal cooperation agreement between the City of Seattle and King County to allow for the acceptance of Conservation Futures Levy funds authorizing the deposit of 2020 and 2021. Allocations from King County Conservation Futures Levy proceeds into the city of Seattle's park funds.'",
        "'speaker_0': 'The committee recommends the city council passed bill. Councilmembers Mesquita, Herbold, Gonzalez, Suarez, Lewis, Morales and Strauss in favor. And Councilmember Peterson abstaining. Thank you so much. Are there any comments on Council Bill 120194 Agenda Item 16. You're now on agenda item 16.'",
        "'speaker_0': 'Any comments on Council Bill 120194. Hearing no comments. Will the police play the role on the passage of Council Bill 1 to 0 one nine for Agenda Item 16 to 1?'",
        "'speaker_1': 'Yes. Strauss Yes. Her bold. Yes. Whereas I. Lewis. Yes. Morales. Yes. Mosquera. I. Peterson.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Council President Gonzalez. High nine in favor and unopposed.'",
        "'speaker_0': 'Thanks so much. Council Bill 120194. Agenda item 16 passes and the chair will sign. It will please fix my signature to the legislation on my behalf. Will the clerk please read the title of agenda item 17 into the record?'"
    ],
    "AN ORDINANCE relating to the financing of the Finance and Administrative Services Fund; authorizing interfund loans up to a total of $8,000,000 from the Fleet Capital Fund and $2,000,000 from the Wheelchair Accessible Fund to the Finance and Administrative Services Fund for financing of FEMA-eligible COVID-19 response expenses.": [
        "'speaker_0': 'Agenda Item 17 Council Bill 120195 An ordinance relating to the financing of the Finance and Administrative Services Fund authorizing and or fund loans up to a total of $8 million from the Fleet Capital Fund and $2 million from a wheelchair accessibility accessible fund to the Finance and Administrative Services Fund for financing of eligible COVID 19 response expenses'",
        "'speaker_0': '. Thank you, Madam Clerk. I'm going to pass Council Bill 1 to 0 195. Is there a second?'",
        "'speaker_2': 'Okay. And.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded. Are there any additional comments on a council bill? 1 to 0 195. Agenda item 17. Any additional comments on agenda item 17 Hearing none. Will the clerk please call the roll on the passage of Council Bill 120195.'",
        "'speaker_0': 'Agenda Item 72.'",
        "'speaker_1': 'One. Yes. Strauss. Yes. Herbold. S. Whereas i. Lewis. Yes. Morales. Yes. Mr. Carter, i.'",
        "'speaker_4': 'Peterson Hi.'",
        "'speaker_1': 'Council President Gonzalez. I. Nine in favor.'",
        "'speaker_0': 'Nine Opposed Council Bill 120195 Agenda item 17 passes and the chair will sign it. Will the Kirk please to fix my signature to the legislation on my behalf? Will the clerk please read the short title of item 18 into the record?'"
    ],
    "AN ORDINANCE relating to contracting indebtedness; authorizing and providing for the issuance and sale of limited tax general obligation bonds to pay all or part of the costs of various elements of the Citys capital improvement program and for other City purposes approved by ordinance, to provide loans to one or more public development authorities of the City for certain eligible capital purposes, and to pay the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; creating the 2022 Multipurpose LTGO Bond Fund; amending Ordinance 126219; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Agenda Item 18 Council Bill 120198 An ordinance relating to contracting indebtedness, authorizing and providing for the issuance and sale of limited tax general obligation bonds to pay for all or part of the cost of various elements of the city's capital improvement program.'",
        "'speaker_0': 'The Committee recommends the Council pass the Council bill with council members Mesquita, Herbold, Gonzales, Suarez, Lewis, Morales and Peterson and Faber and Council member Strauss abstaining. Thank you so much. Okay. Are there any comments? Excuse me, are there any comments on Council Bill 120198.'",
        "'speaker_0': 'Agenda Item 18. We're now on agenda item 18. Any comments? Councilmember Strauss.'",
        "'speaker_4': 'Thank you. Council President Just very excited to vote for this. The abstention in committee was a technical issue. I much like I'm requesting you to read out the numbers. I was unsure of where we were in that agenda and just very excited to vote yesterday.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thanks, Governor Strauss. I know we have a lot on the agenda. I appreciate your your encouragement to go a little bit slower so that all of us, including the viewing public, can stay on track. Okay. So any additional comments on Council Bill 120198 Agenda Item 18 Hearing None.'",
        "'speaker_0': 'Will the clerk please call the roll on the passage of Council Bill 120198. Agenda Item 18.'",
        "'speaker_1': 'Sawant. Yes. Strauss. Yes. Herbold. Yes. Lewis. Or excuse me, Councilmember Suarez, I.'",
        "'speaker_4': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. Mosquito. Hi. Peterson Hi. Council President Gonzalez. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120198 Agenda item 18 passes and the chair will sign it. Will the park please affix my signature to the legislation on my behalf? Leclerc Please read the short title of item 19 into the record.'"
    ],
    "AN ORDINANCE relating to contracting indebtedness; authorizing and providing for the issuance and sale of limited tax general obligation bonds to pay all or part of the costs of certain transportation elements of the Citys capital improvement program and for other City purposes approved by ordinance and to pay the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Agenda Item 19 Council Bill 120224 An ordinance relating to contracting indebtedness, authorizing and providing for the issuance and sale of limited tax general obligation bonds to pay all or part of the cost of certain transportation elements of the city's capital improvement program.'",
        "'speaker_0': 'The committee recommends the bill pass. Thank you so much. Are there any comments on Council Bill 120224 Agenda item. Knight Excuse me. Agenda item 19. We are now on agenda item 19, which is Council Bill 1 to 0 224.'",
        "'speaker_0': 'Any comments? So, you know hands raised will the work please call the role on the passage of council bill 120224 Agenda Item 19.'",
        "'speaker_1': 'It's a want. Yes. Strauss. Yes. Her bold. Yes. Whereas I. Lewis.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Morales. Yes. Rosetta I.'",
        "'speaker_4': 'Petersen Yes.'",
        "'speaker_1': 'Council President Gonzalez. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 1 to 0 two two for agenda item 19 passes and the chair will sign it. Will the park please the fix my signature to the legislation on my behalf? Will the clerk please read the short title of item 20 into the record?'"
    ],
    "AN ORDINANCE relating to the electric system of The City of Seattle; adopting a system or plan of additions and betterments to and extensions of the existing municipal light and electric power generation, transmission, and distribution system of the City; authorizing the issuance and sale of municipal light and power revenue bonds for the purposes of providing funds to pay part of the cost of carrying out that system or plan, providing for the reserve fund requirement (if any), and paying the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; describing the lien of the bonds and authorizing their issuance as either senior lien parity bonds or junior lien bonds; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Agenda Item 20 Council Bill 120196 An ordinance relating to the electric system of the City of Seattle. Adopting a system or plan of additions and betterment to and extensions of the existing municipal light and electric power generation transmission and distribution system of the city.'",
        "'speaker_0': 'Thank you, Madam Clerk. I move to pass Council Bill 1 to 0 196. Agenda item 20. Is there a second? I can. Thank you so much. It's been moved and seconded to pass the bill. Are there any comments on a council bill?'",
        "'speaker_0': '1 to 0 196. Agenda Item 20. Any comments on agenda item 20 see no hands raised will occur. Please call the role on the passage of Council Bill 1 to 0 196. Agenda item 22.'",
        "'speaker_1': 'Want. Yes. Strauss. Yes. Herbold. Thank you. Whereas I. Lewis Yes. Morales Yes. Musgrave, i. Peterson. I. Council President Gonzales. I. Nine in favor and oppose.'",
        "'speaker_0': 'Thank you so much. Council Bill 120196 Agenda item 20 passes and the chair will sign it. Will it please affix my signature to the legislation on my behalf? The clerk please read the short title of item 21 into the record.'"
    ],
    "AN ORDINANCE relating to the drainage and wastewater system of The City of Seattle; adopting a system or plan of additions and betterments to and extensions of the existing drainage and wastewater system; authorizing the issuance and sale of drainage and wastewater revenue bonds in one or more series for the purposes of paying part of the cost of carrying out that system or plan, providing for the reserve requirement, and paying the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; describing the lien of those bonds; amending certain definitions set forth in Ordinance 125455, the Omnibus Refunding Ordinance; authorizing the issuance of drainage and wastewater system refunding revenue bonds; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Agenda Item 21 Council Bill 120197. An ordinance relating to the drainage and wastewater system of the city of Seattle recommends the bill passed with council members Macheda Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson abstaining.'",
        "'speaker_0': 'Thank you so much. Are there any comments on Council Bill 1 to 0 197 Agenda Item 21. Any comments on Agenda Item 21? See No hands raised. Will the clerk please call to warn passage of Council Bill 1 to 0 197.'",
        "'speaker_0': 'Agenda Item 21.'",
        "'speaker_1': 'Sawant. Yes. Strauss. Yes. Herbold. As. Whereas. All right, I. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Councilmember Morales. Scatter. I. Peterson. High Council President Gonzales. I eight in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120197. Agenda item 21 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Colleagues, customer wireless didn't send me a message saying she might need to miss a vote or two due to something on her end.'"
    ],
    "AN ORDINANCE relating to the municipal water system of The City of Seattle; adopting a system or plan of additions and betterments to and extensions of the existing municipal water system; authorizing the issuance and sale of water system revenue bonds in one or more series for the purposes of paying part of the cost of carrying out that system or plan, providing for the reserve requirement, and paying the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; describing the lien of the bonds; creating certain accounts of the City relating to the bonds; amending certain definitions set forth in Ordinance 125714, the Omnibus Refunding Ordinance; authorizing the issuance of water system refunding revenue bonds; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'So I will just ask the clerk to keep calling her her name. But if she doesn't respond, that is why. Well, the clerk please read the short title of item 22 into the record. Agenda Item 22 Council Bill 120199 An Ordinance relating to the Municipal Water System of the City of Seattle.'",
        "'speaker_0': 'The committee recommends the bill pass with council members Macheda Herbold, Gonzalez Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you so much. Are there any comments on Council Bill 120199? Agenda item 22. Looking for comments if any on agenda item 22 see no hands raised for the perk, please call the role and the'",
        "'speaker_0': 'passage of Council Bill 120199. Agenda Item 22.'",
        "'speaker_1': 'Want. Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Mosquera. I. PETERSON All right. Council President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120199 Agenda item 22 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the Court please read the title of item 23 into the record?'"
    ],
    "AN ORDINANCE relating to the Office of Housing; creating a new Fund in the City Treasury.": [
        "'speaker_0': 'Agenda Item 23 Council Bill 120200 An ordinance relating to the Office of Housing Creating a new fund in the City Treasury. The Council budget action was approved by the following vote Council members Mosquito Purple, Gonzalez Suarez and Lewis Morales and Strauss in favor and Council member Peterson abstaining.'",
        "'speaker_0': 'Thank you so much. Are there any comments on Council Bill 120200 Agenda Item 23. Any comments on agenda item 23 Seeing no hands raised. Will the Court please call the roll on the passage of Council? Bill 120200. Agenda Item 23.'",
        "'speaker_1': 'Student. Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. Yes. For Sarah. Hi. Paterson. Hi. Council President Gonzales. I nine in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Council Bill 120200 Agenda item 23 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? The clerk please read the title of item 24 into the record.'"
    ],
    "A RESOLUTION approving interest rates set by the Seattle City Employees Retirement System (SCERS) Board of Administration for 2022.": [
        "'speaker_0': 'Agenda Item 24 Resolution 32022. A resolution approving interest rates set by the Seattle City Employees Retirement System Board of Administration for 2022. The committee recommends City Council adopt the resolution with council members Macheda Herbold, Gonzalez, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining.'",
        "'speaker_0': 'Thank you so much. Are there any comments on resolution 32022? Agenda item 24. Looking for any comments on agenda item 24, if any see no hands raised with the court, please call the role on the adoption of resolution 32022.'",
        "'speaker_0': 'Agenda item 24.'",
        "'speaker_1': 'So on. Strauss. Yes. Verbal. Yes. Whereas I. LEWIS. Yes. Morales Yes. ROSQUETA. I, Peterson. I counsel President Gonzalez. I remain in favor and I oppose.'",
        "'speaker_0': 'Thank you so much. Resolution 32022. Item 24 is adopted and the chair will sign it. Will the person please affix my signature piece of legislation on my behalf? Will the clerk please read the title of item 25 into the record?'"
    ],
    "A RESOLUTION amending Resolution 31334; establishing the City Councils intent to fund the Seattle City Employees Retirement System (SCERS) as informed by the January 1, 2021, Actuarial Study.": [
        "'speaker_0': 'Agenda Item 25 Resolution 32023. A resolution amending Resolution 31334 establishing the City Council's intent to fund the Seattle City Employees Retirement System as informed by the January 1st, 2021 actuary study. The committee recommends the bill pass. Excuse me.'",
        "'speaker_0': 'The committee recommends council adopt a resolution with council members Mesquita, Herbold, Gonzales, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining. Thank you, Madam Clerk. Are there any comments on resolution 32023? Agenda item 25. We're on agenda item 25.'",
        "'speaker_0': 'Are there any comments on that resolution? See, no hands raised will occur. Please call the role on the adoption of resolution 32023. Agenda item 25.'",
        "'speaker_1': 'Silent. Yes. Strauss. Yes. HERBOLD. Yes. Whereas I. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Skinner. Hi. Peterson Hi. Council President Gonzales. Now I'm in favor and unopposed.'",
        "'speaker_0': 'Thank you so much. Resolution 32023. Agenda item 25 is adopted and the chair will sign it. Will the person please affix my signature to the legislation on my behalf? Will the clerk please read the short title of item 26 into the record?'"
    ],
    "AN ORDINANCE relating to City funds; closing certain funds, subfunds, and accounts; authorizing the Department of Finance and Administrative Services to take action pursuant to those closures; authorizing the transfer of all unexpended and unencumbered balances and other assets and liabilities of those funds, subfunds, and accounts; and abandoning appropriation authority from those funds, subfunds, and accounts.": [
        "'speaker_0': 'Agenda Item 26 Council Bill 120201 An ordinance relating to city funds closing certain funds, sub funds and accounts authorizing the Department of Finance and Administrative Services to take action pursuant to those closures. Thank you so much. I move to pass Council Bill 1 to 0 201.'",
        "'speaker_0': 'Agenda Items 26. Is there a second second? Thank you so much. It's been moved and seconded to pass Council Bill 120201 Agenda Item 26 Are there any comments? Any comments on agenda item 26? Hearing none while the police call the roll on the passage of council bill 120201.'",
        "'speaker_0': 'Agenda Item 26.'",
        "'speaker_1': 'The one? Yes. Strauss. Yes. Verbal. Yes. Whereas I. Lewis. Yes. Morales. Yes. Was it a? Councilmember Mosquera.'",
        "'speaker_0': 'She looks like she may be frozen.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Councilmember Peterson, I. Council President Gonzalez II eight in favor nine opposed.'",
        "'speaker_0': 'The council bill 120201 passes that's agenda item 26 and the chair will sign it will please affix my signature to the legislation on my behalf. Will the Court please read the short title of item 27 into the record?'"
    ],
    "AN ORDINANCE relating to the Traffic Code; modifying fees associated with car sharing; clarifying certain definitions; establishing Seattle Department of Transportation authority for managing free-floating zone service areas; and amending Sections 11.14.087, 11.23.150, and 11.23.160 of the Seattle Municipal Code.": [
        "'speaker_0': 'Agenda Item 27 Council Bill 120202 An audience relating to the traffic code modifying fees associated with car sharing, clarifying certain definitions and establishing seal of apartment of transportation authority for managing free floating zone service areas. Oh, excuse me.'",
        "'speaker_0': 'There's more to that. Yeah.'",
        "'speaker_5': 'If. Okay, go ahead.'",
        "'speaker_0': 'We're going to get through this. Thank you. The committee recommends the council pass a council bill with council members Macheda Herbold, Gonzalez Suarez, Lewis Morales and Strauss in favor and Councilmember Peterson stating. Thanks so much, Madam Chair. Appreciate it.'",
        "'speaker_0': 'Are there any comments on Council Bill 1 to 0 two zero to Agenda Item 27? Any comments on agenda item 27? And just before I call the roll, I do want to let our colleagues and members of the viewing public know that council members data is having some technology difficulties she is attempting to get back on.'",
        "'speaker_0': 'So if you do not hear a casting a vote, that is why will the piece called Role in the passage of Council Bill 120202. Agenda Item 27.'",
        "'speaker_1': 'So on. Yes. Strauss. Yes. Revolt? Yes. Whereas I. Lewis. Yes. Morales. Yes. Mosquera hi. Petersen Hi. Council President Gonzalez I nine in favor. Nine opposed.'"
    ],
    "AN ORDINANCE relating to the financing of the Transportation Fund; authorizing interfund loans up to a total amount of $15,000,000 from multiple City funds as bridge financing to be repaid by the proceeds of a future surplus property sale.": [
        "'speaker_0': 'Thanks so much. Council Bill 120202 Agenda item 27 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Please read the title of item 28 into the record. Agenda Item 28 Council Bill 120223.'",
        "'speaker_0': 'An ordinance relating to the financing of the Transportation Fund authorizing interphone enter fund loans up to a total amount of $15 million from multiple city funds as bridge financing to be repaid by the proceeds of a future surplus property sale.'",
        "'speaker_0': 'The committee recommends the bill pass the council members Macheda Herbold, Gonzalez, Suarez, Lewis, Morales and Strauss in favor and counsel Peterson abstaining. Thank you so much. Are there any comments on Council Bill 120223 Agenda item 28 We are now on agenda item 28 and looking for comments, if any.'",
        "'speaker_0': 'See no hands raised. Will the clerk please call the role on the passage of Council Bill 120223. Agenda Item 28.'",
        "'speaker_1': 'Yes. Strauss. Yes. HERBOLD. Yes. Whereas I. Lewis. Yes. Morales. Yes. Mosquera. I Paterson High Council President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'Pete, thank you so much. Council Bill 120223 agenda item 28 passes and the chair will sign it. Will Clark, please affix my signature to the legislation on my behalf. Will the clerk please read the title of item 29 into the record?'"
    ],
    "AN ORDINANCE relating to taxation; increasing the commercial parking tax and amending subsection 5.35.030.B of the Seattle Municipal Code.": [
        "'speaker_0': 'Agenda Item 29 Council Bill 120228 An ordinance relating to taxation increasing the commercial parking tax and amending subsection 5.35.030. B of the Seattle Ministerial Code. The committee recommends the bill pass. Thank you so much. Are there any comments on Council Bill 120228.'",
        "'speaker_0': 'Agenda item 29. We are now on agenda item 29. Does anyone have any comments? Hearing no comments. Will the police call the roll on the passage of Council Bill 120228. Agenda Item 29.'",
        "'speaker_1': 'Sergeant. Yes. Strauss. Yes. HERBOLD. Yes. Whereas. I. Lewis.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Morales. Yes. Mascara. Hi, Petersen. Hi. Council President Gonzalez. Hi. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the financing of the General Fund; amending Ordinance 126407 to increase the authorization of interfund loans up to a total amount of $275,000,000 from multiple City Funds to the General Fund as bridge financing to be repaid from future tax proceeds and other anticipated revenues; authorizing additional lending funds; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Thank you so much. Council Bill 120228 Item 29 passes and the chair will sign it. Will the park please affix my signature to the legislation on my behalf? Please read the title of item 30 into the record. Agenda Item 30 Council Bill 120222.'",
        "'speaker_0': 'An ordinance relating to the financing of the General Fund amending ordinance 126407 to increase the authorization of enter phone enter fund loans up to a total amount of 275 million from multiple city funds to the general fund as bridge financing to be repaid from future tax proceeds and other anticipated revenues.'",
        "'speaker_0': 'The committee recommends the bill passed with council members must get a Gonzalez, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining. It's so much. Are there any comments on Council Bill 120222. Agenda item 30. You're now on agenda item 13.'",
        "'speaker_0': 'Are there any additional comments? Hearing none will the least culpable on the passage of Council. Bill 120222. Agenda Item.'",
        "'speaker_1': '31. Yes. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. Yes. Mistura. I. Peterson. I. Council. President Gonzalez. I. Nine in favor and unopposed.'",
        "'speaker_0': 'Thanks so much. Council Bill 120222. Agenda item 30 passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the title of item 31 into the record?'"
    ],
    "City Council Changes to the 2022 Proposed Budget and the 2022 - 2027 Proposed Capital Improvement Program.": [
        "'speaker_0': 'Agenda Item 31 Clerk File 314488. City Council changes to the 2022 proposed budget and the 2022 through 2027 proposed capital improvement program. The committee recommends the bill or excuse me, the committee recommends City Council approved and file the clerk file.'",
        "'speaker_0': 'Thank you, Madam Clerk. I do understand that there is a amendment to this particular item being brought forward by Councilmember Herbold and Suarez, but my script does not indicate who would like to move that sum. I'm calling on either Councilmember Herbert Laredo.'",
        "'speaker_0': 'I see Councilmember Robles and raised I'm going to recognize Councilmember Hurdle to make her motion and should it receive the second.'",
        "'speaker_2': 'Sorry. Sorry that you did not receive an update. That that amendment is not being brought forward. Okay. Thank you.'",
        "'speaker_0': 'All right. Well, there we go. Easy peasy. We'll just keep on going. That being said. Are there any comments on Clarke file 314488. Agenda item 31. Any comments on agenda item 31 hearing none will occur. Please call the roll on on the filing of Clark file 314488.'",
        "'speaker_0': 'Agenda item 31.'",
        "'speaker_1': 'Silent. Yes. Strauss. Yes. Revolt. Yes. Whereas I. Lewis. Yes. Morales. Yes. I. Peterson. High Council President Gonzalez. High nine. In favor and unopposed.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'So much. The motion carries and clerk. File 314488. Agenda item 31 is approved and placed on file. Okay, colleagues, we are now at item 32. This is, as previously indicated, the large bill that adopts the vast majority of our city budget.'",
        "'speaker_0': 'If you'd like to get into the queue, now is the time to raise your hands. I'll call on people as they raise their hands and we will go from there. Will the clerk please read the title of item 32 into the record?'",
        "'speaker_0': 'Agenda Item 32 Council Bill 120211. An ordinance adopting a budget, including a capital improvement program and position modifications for the City of Seattle for 2022 and creating positions exempt from civil service all by a two thirds vote of the city council.'",
        "'speaker_0': 'The committee recommends the bill passes amended with Councilmembers Macheda Ripple, Gonzalez, Suarez, Lewis Morales, Peterson and Strauss in favor and council members so want opposed. Thank you, Madam Clerk. All right, again, colleagues, I'm calling for comments on Council Bill 120211.'",
        "'speaker_0': 'Agenda item 32. And I see that council member Herbold has her hand raised. Thank you for using that function. You are recognized.'",
        "'speaker_2': 'You so much. I'm going to focus my remarks on the efforts that I have been working with all of you to lead and with members of the public. We have, for the last year and a half, been working to broaden our city's definition of public safety to with intention, include both traditional public safety investments while increasing funding'",
        "'speaker_2': 'for critical upstream investments and crew added safety for all. This budget makes strategic investments in public safety so that law enforcement can respond to calls that only they are qualified to handle. That includes fully funding the Seattle Police Department plan to hire 125 additional police officers, more community service officers, and technology resources necessary to support alternatives to'",
        "'speaker_2': 'police response and consent decree compliance. It includes funding and fees to address staffing and operational needs of our dispatch workers at 911 at the Community Safety and Communication Center. And includes funding for the Seattle Fire Department to add 20 additional firefighter recruits in 2022.'",
        "'speaker_2': 'In addition to the recruits that the mayor's proposed budget funded as it relates specifically to community and safety community safety investments. We have two old safety in neighborhoods from the ground up laying the groundwork for non law enforcement response to crisis including nearly 4 million are needed to allow for their modest expansion next year.'",
        "'speaker_2': '4 million to stay in the community safety hubs in West Seattle, southeast Seattle and a central district operated by the Community Safety Seattle Community Safety Initiative. A funding to support a workgroup with experience of domestic violence. Recommend alternatives to incarceration that address misdemeanor domestic violence.'",
        "'speaker_2': 'And funding to support expansion of the be filing version program of the City Attorney's Office so that we limit diversion opportunities to only those under under 25 years of age. We've made several health investments into all data points through the pandemic.'",
        "'speaker_2': 'All data points to the pandemic having a significant impact on our behavioral health and adequately erupting into self harm is salt and fire and other forms of violence. This budget includes significant new investments in mental health and substance use disorder, including $1,000,000 to expand behavioral health services in Seattle, public schools and community clinics for new mothers, seniors'",
        "'speaker_2': 'and the uninsured. 1.5 million for mobile services for survivors of liquor based violence that help survivors stay safely housed.'",
        "'speaker_4': 'I don't know. Are you following the budget?'",
        "'speaker_2': 'Remember Peterson? Sure, you can buy 5 million to match the county's investment in a new facility for people experiencing homelessness who need behavioral health supports. And so that's missing human services. As the pandemic is through its second year, we know that we must maintain a baseline of increased support for households who continue to struggle the workers we'",
        "'speaker_2': 'rely on to help. That includes 600,000 for a wage equity study to address high turnover and compensate frontline workers. Being the work that we desperately need to do. An additional eight FTE for the Human Services Department hire folks with accounting and financial skill.'",
        "'speaker_2': 'A recommendation of an outside accounting firm is been working with HST on a plan strengthen their financial controls. 1 million for services for work force, affordable housing providers, cities first investment and African senior wide wraparound services at existing meal programs.'",
        "'speaker_2': '$1,000 for a small investment will will help a 65 residents keep home when they lose state benefits $5.1 million to sustain current levels of food support through most of 2020. To help families struggling with the ongoing pandemic stay healthy and nourish.'",
        "'speaker_2': 'Closing. I just want to offer some remarks. I've asked about the payroll tax. It's so important to note that this budget ends on the jumpstart it will tax, which the attorney homes has so far access fully defended against a legal challenge from Greater Seattle Chamber of Commerce after the city attorney submits briefs due on December 15th.'",
        "'speaker_2': 'Next city attorney will take on responsibility for this case, and oral arguments will proceed under the direction of the incoming city attorney next year. The defense is unsuccessful. The incoming mayor will be faced with causing cuts that could $200 million or more in 2022 in May can create a deficit for the 2021 budget, which is an inner'",
        "'speaker_2': 'fund loan payback with payroll tax revenue. This would make it nearly impossible to avoid across the board cut. I think it's really important to place the action that this council is about to take within the context of this case moving forward.'",
        "'speaker_2': 'Want to us with again thanking the budget chair for all of her work, pulling us together, moving in the direction that is the best for our city in this in this time. I want to thank the rest of my colleagues on the Council.'",
        "'speaker_2': 'I appreciate the collegiality and sense of common purpose and common good, as well as all of the hard work that behind the scenes council central staff has done day in, day out for the last six weeks, as well as each of our officers, personal staff, and want to most of all thank the community advocates who without them'",
        "'speaker_2': ', we, I believe, would not be able to do as good of a job ensuring that this budget document is an expression of our values of this city. So thank you, everybody. Thank you so much, Councilmember Herbold.'",
        "'speaker_0': 'Appreciate it. Okay. Next up is let me make sure I'm going in the right order. Next, we.'",
        "'speaker_2': 'Will hear from.'",
        "'speaker_0': 'Excuse me, Councilwoman Morales, then Councilmember Sawant, and then Councilmember Lewis. And you are more concerned about us.'",
        "'speaker_2': 'Thank you. Apologies. Thank you. President Gonzalez, I want to begin by acknowledging the hundreds of community advocates, workers, neighbors and community organizations who really engaged with us in this process. I think their voice has been very important, as Councilmember Herbold stated.'",
        "'speaker_2': 'This was a hard budget year, in my opinion, made harder by a reluctance to reject some very troubling budgeting practices by our police department. And I think it demonstrates that as a council, we can find the resources in our general fund for important city priorities.'",
        "'speaker_2': 'That's always been my point of view in the conversation about reducing the police budget. As I said last week, you know, with the $90 million, we could fund 57 units of permanent supportive housing, 100 home zones, 190 new street outreach workers for given back rent for 3400 or so families and provided nearly five transitional housing sites like'",
        "'speaker_2': 'the one I had proposed for organizations like the Cheapskate.'",
        "'speaker_4': 'Club.'",
        "'speaker_2': 'And still funded six additional public toilets. So I do think it's important that we acknowledge why we haven't been able to fund more of the various services that would address the homelessness crisis and help move people off the streets and into more stable housing.'",
        "'speaker_2': 'That said, I am very excited with the budget that this council has is about to pass. I think it's really important that we are investing a million and a half dollars in public arts and creative industry programing, $375,000 for black girls and young women and for black, queer and transgender youth.'",
        "'speaker_2': 'We're investing a total of $750,000 in restorative justice programing so that our young people, our educators and our communities can really gain a greater understanding of what it means to move away from punitive discipline and toward healing. And I want to thank my colleagues for supporting my amendment to create Juneteenth as a city holiday.'",
        "'speaker_2': 'Federal, state and county employees already enjoy this holiday. So I'm excited that our city workers will also be able to mark this important day. And I'm very proud to be starting down the path to regular baseline inclusion of public toilet infrastructure development in the city.'",
        "'speaker_2': 'That's going to be a critical need and I'm excited that we're starting in that direction. I also want to thank the neighbors from District two for their advocacy. Thanks to that advocacy, we'll see restored funding for culturally responsive afterschool programs, $800,000 for community engagement, support for the neighborhood planning process that is beginning in the Chinatown International District'",
        "'speaker_2': ', as well as additional street cleaning and trash pickup support in the city. We'll see $2 million more invested in sidewalk, sidewalk infrastructure. That's in addition to the 2 million for a District two sidewalk infrastructure from last year. And we are getting funding to complete the bike and pedestrian trail at green space.'",
        "'speaker_2': 'We're also funding a cookie just park the Lake Washington Boulevard expansion prescription food pilot program for the Seattle Indian Health Board, as well as expanded mental and behavioral health services for the Jewish people and to advance some environmental sustainability projects for the Danish longhouse.'",
        "'speaker_2': 'As a council, our role is to deliver the resources needed to keep our city healthy and safe and to protect the most vulnerable in our community. And I want to say that as a city that many across the country look to for innovative solutions to our municipal challenges.'",
        "'speaker_2': 'My hope is that next year we can kind of lift our heads above the fog of COVID and really start thinking creatively about the kinds of forward thinking policies that we can implement to stop displacement, to house our neighbors, and to create bustling, walkable neighborhoods that our community is really eager to, to see and to expand.'",
        "'speaker_2': 'I truly believe that if we have the courage to take kind of a side step toward innovation, we can plan for sustainability, for urban development and for economic justice at the same time. I'm hopeful that we can work collaboratively with our new mayor to move these resources into community and deliver on the investments that can change the'",
        "'speaker_2': 'material conditions of our neighborhoods and really help our neighbors thrive. So I want to thank central staff the. City clerks, our I.T. department and our comms team. I especially want to thank Ali Michie and Yolanda Ho, who have been extraordinarily helpful, collaborative and have offered innovative assistance through our budget process to our office as we think through'",
        "'speaker_2': 'how to move forward. I do also want to thank our facilities team. I've been coming in a couple of times a week for the last several months now, and I've seen how much work goes into keeping City Hall safe, especially in COVID.'",
        "'speaker_2': 'So I want to thank Yahya and Chris for checking in on me once in a while here. It's kind of quiet at City Hall, but really appreciate the work that our facilities team is doing to keep City Hall safe.'",
        "'speaker_2': 'And finally, I do want to thank my staff, Alexis Tala, Darcel Touch, Devon Silverdale and Imani Carey for bringing your passion, your smarts, and your deep organizing skills to the work that we do for the people of District two.'",
        "'speaker_2': 'I'm very proud to have all of you on board and look forward to moving this budget forward and moving forward next year with some innovative policies. Thank you.'",
        "'speaker_0': 'Thank you so much, consumer wireless counselor. Please.'",
        "'speaker_3': 'Thank you. I will be voting no on the budget. This vote is a vote on the budget as a whole. Just to explain to members of the public, not on the amendments to the budget, if we were to only look at the amendment to the budget.'",
        "'speaker_3': 'There have been many progressive changes won by community organizers, particularly from the activists in the People's Budget and Solidarity Budget. And I voted yes on those amendments. Over the past year, the renters rights movement has organized to fight back in skyrocketing rents and other abuses.'",
        "'speaker_3': 'And through that, organizing alongside our council office has won many important victories. We won the right to council extensions of the eviction moratorium during the pandemic. Six months notice for rent increases. We just went into effect on November eight, just got protections for evictions, the ban on school year evictions of children and all public school workers, and'",
        "'speaker_3': 'economic relocation assistance worth three months of rent for renters economically displaced by rising rents. That is when they are forced to move because their landlords have raised their rent by 10% or more. It's a law that is the legislation that will take into effect in July of next year in this budget that many of the renters who'",
        "'speaker_3': 'fought to win those victories also organized with the people's budget to win the funding necessary to enforce these new rental rights to fully fund the right to council. If you're a renter and you're facing eviction while avoiding cuts to the funding for the rent, organizing and education done by the tenants union and other community organizers in the'",
        "'speaker_3': 'Central Area. One Funding for the Clean Greens Fresh Produce Program, funding for the Garfield Super BLOCK, and the technical changes to the Office of Housing. Funding to make it possible for them to fund the new Hope Family Housing Project.'",
        "'speaker_3': 'This project, and the purchase of Square Park Plaza by Lehigh and the New Hope Community Development Institute are serious progress that have been won by the people's budget advocates this year and are real priorities for preventing and reversing the displacement of black, working class and low income families from the central area.'",
        "'speaker_3': 'My office urges the Office of Housing to support these crucial projects without delays. We have won the funding in the budget. Now they need to deliver homeless activists and organizers one another expansion of funding for tiny house villages, a proviso protecting the funding for tiny house villages so they cannot be used for any other purpose.'",
        "'speaker_3': 'This is crucial because year after year corporate mayors have done everything in their power to stand in the way of establishing dining halls, villages. So year after year, tiny house village funding has gone unused. This is predominantly been true under Mayor Durkan and I am concerned that the regional homeless authority will be no different because it is'",
        "'speaker_3': 'still part of the same political establishment, just another step removed from democratic accountability. And we already know of the ominous potential of the new rural administration as mayor, you really to really sort of crack down on homeless neighbors rather than actually providing humane services.'",
        "'speaker_3': 'We need to be crystal clear that homeless people themselves support tiny ice villages in a way that is unlike any other homeless service in Seattle. Year after year, dozens of dining halls, village residents and former residents who are now in permanent housing calling to the city council's public hearing to explain how tiny houses have transformed their lives'",
        "'speaker_3': '. And I cannot say the same about any other service. This is not to say that other services are not important. They are tiny homes. Villages are something special. Of course, there are problems in tiny villages like everywhere, sometimes serious, sometimes tragic, because this is all happening as part of our deeply dysfunctional system of capitalism in the context'",
        "'speaker_3': 'of deep and increasing inequality. But to it all, tiny house villages have provided homeless residents with the community safety and dignity needed to begin to repair lives. When you face the devastating experience of homelessness and overcome the crushing isolation and alienation that comes with homelessness, I urge the Regional Homelessness Authority to rapidly expand Seattle standing house villages'",
        "'speaker_3': '. But I am extremely anxious that it is not going to happen. And that's why I urge all the activists on the people's budget who are listening right now to keep in mind that we will need to continue fighting.'",
        "'speaker_3': 'My office stood with Nicole Small share a real and come second chance when they establish density communities and tiny house villages. Before, they had the legal authority to do so to the people's budget movement. Year after year, we won Seattle's first funding for tiny house villages.'",
        "'speaker_3': 'We want the legislation permitting. Villages in the first place and expanding the number permitted in Seattle. And we will continue to fight for tiny homes, villages and. And aside from that, also fighting to win the necessary funds for affordable social housing that Seattle needs to truly end homelessness.'",
        "'speaker_3': 'There are a lot of tiny house villages, real change organizers working alongside the people's budget campaign this year. One Funding for a new safe parking lot are people living in their vehicles. To be clear, people forced to be living in their vehicles because of the affordable housing crisis and skyrocketing rents.'",
        "'speaker_3': 'And also one the expansion of the garbage pickup and septic system pump out services for people living in Arby's on city streets. Most of the news coverage about the city budget deliberations has been about the police budget. If we were to only consider the objective material reality of police funding, the reality is it has changed very, very'",
        "'speaker_3': 'little over the past two years. The overwhelming majority of the changes have been superficial accounting mechanisms. For example, the biggest change in the police budget has been the costs of the 911 call center and parking enforcement have been moved to other departments.'",
        "'speaker_3': 'There is no material change. There is only a change on how it is accounted for. The material changes have all been extremely marginal. However, if we consider those material changes, there are deep lessons about how progressive change can be won and how big business maintains its power.'",
        "'speaker_3': 'Throughout history, it has been movements that make progressive change, not the machinations of the police political establishment not electing smart technocrats, not the relationships between elected officials. None of this actually helps progressive change, and very often than not can actually, more often than not, can be a hindrance to progressive change.'",
        "'speaker_3': 'Real change is driven by the balance of power in society as a whole, and particularly the organized forces of the working class prepared to fight. And those organized forces need elected representatives who will stand with them and boldly fight alongside them.'",
        "'speaker_3': 'The budget deliberations this year and last year could not be more different, and those differences are mirrored in cities across the country. One year ago, we were in the waning days of the Justice for George Floyd movement. In that context, and some members in Seattle and elected officials around the country claim to support defunding the police and'",
        "'speaker_3': 'funding community based safety alternatives. However, any sociologist will tell you that the one thing that has by far the greatest statistical impact on community safety and crime is the inequality in our society. And while it is important to note the impact of the movements in winning, citing an increased investment in community groups that do restorative justice work'",
        "'speaker_3': ', there was no structural improvement in the overall inequality in society. In fact, we have to be sober. Over the last year, inequality has exploded, with billionaires getting even richer, with the majority of working class people having suffered all the burdens of the COVID recession.'",
        "'speaker_3': 'Seattle rents are now on track to increase and unconscionable 40% this year. That is just inhumane. That economic factor alone fully explains any increase in both homelessness and crime. But the ruling class does not want working people to fight for rent control.'",
        "'speaker_3': 'A real expansion in affordable housing and against inequality. So over the last year, there has been a brutal propaganda offensive against the BLM movement. We have seen this in all the big business owned mass media around the country, and it has gone hand in hand with the criminalization of the Black Lives Matter movement.'",
        "'speaker_3': 'Also on display last week with the outrageous acquittal of Kyle Rittenhouse, I watched a mayoral debate, Seattle mayoral debate just before the general elections, where every single question for the whole hour and a half posed to candidates was about crime and fear and all about fear mongering.'",
        "'speaker_3': 'This is not an accident. This is how the ruling class uses their power to control the political narrative. So while the police budget is roughly the same this year as it was last year, once you pass through the accounting tricks, it is being described by elected officials very differently than it was last year.'",
        "'speaker_3': 'This year, council members have gone to great lengths to say that the police budget is actually growing slightly, which in real terms is true. But what's what's striking about this is that council members are going overboard to make sure that everybody knows that the police budget is actually growing.'",
        "'speaker_3': 'That is a real contrast from last year. The same police budget would. But the same council members as being on track to defund the police by 50%, which was not true. Rhetoric aside, it is actually business as usual.'",
        "'speaker_3': 'But both last year and this year, what is missing is the sort of investment in affordable social housing that would be needed to actually push back the wave of inequality sweeping our communities. And what we know is coming, which is the phenomena of evictions.'",
        "'speaker_3': 'That is why I proposed increasing the Amazon tax to fully fund the affordable housing and Green New Deal building decarbonization work advocated for by the People's Budget and the Solidarity Budget. Unfortunately, seven of the nine Council members voted against adding this budget amendment to the agenda this morning, with only Council member Herbold and myself voting yes.'",
        "'speaker_3': 'For the past year, council members have congratulated themselves on the progressive revenue generated by what they call Jumpstart. But we need to be crystal clear every time progressive revenue is put to a vote, every time council members are put to a test, they vote no, except for one exception.'",
        "'speaker_3': 'That was in 2020, and that was because of the grassroots tax Amazon movement. This movement, which my office launched alongside a number of progressive labor unions and affordable housing organizations, had Action Conference after Action Conference, bringing hundreds and altogether thousands of ordinary people, working people, including struggling small business owners, Black Lives Matter activists and housing justice activists'",
        "'speaker_3': 'who all came together, discussed and debated openly. The points that we had to discuss and debate to make this about the movement that it became, which is a really strong movement. And in the midst of the Black Lives Matter protest, this tax Amazon movement collected 30,000 signatures on a viable ballot initiative to create a viable, credible threat'",
        "'speaker_3': 'of an even larger big business tax. Were the Council to fail to act out of those 30,000 signatures, 20,000 signatures were collected at the protest themselves in 20 days. Suddenly, after that happened, suddenly council members renamed a jumpstart and pretended that they supported it all along.'",
        "'speaker_3': 'But we need to be clear it was the grassroots movement that won the funding or the housing and the Green New Deal that exists in this budget. And it did. So this movement was able to do so despite repeated attempts by many council members to undermine that movement last year.'",
        "'speaker_3': 'And it is the political establishment who have prevented those big business taxes from being large enough to meet the needs of working people. And this year, again, as we said, as I said before, even though there has been an attempt from my office, from the People's Budget Movement to increase that Amazon tax that has been met with'",
        "'speaker_3': 'opposition, when we consider the budget as a whole, it does not do what it is necessary to do to meet the needs of regular working class people being priced out of the city. And that is not acceptable. For that reason, I will vote no as every year.'",
        "'speaker_3': 'I really appreciate the help of the City Council staff preparing budget amendments for my office and for the people's budget. Some of those efforts resulted in budget amendments that passed and became part of the budget, and others resulted in budget amendments that did not pass but were still extremely important for setting the stage for future victories.'",
        "'speaker_3': 'Dani Dyer. Tracy Radcliffe. Geoff Simms. Amy Gore. Peter Freeman. Tom Meisel, Greg Goss and Yolanda Ho all helped my office research and prepare a budget amendment, all coordinated by Ali Banerjee. And I greatly appreciate all your efforts. Thank you to all the staff members and community organizers and socialists in my office.'",
        "'speaker_3': 'Ted Walden. Adams and Koski. Nick Jones and Maura Gorey. Bill Larcombe and Jonathan Rosenblum. And thank you to everyone who was part of this year's US being part of this year's People's Budget Campaign. Special shout out to the low income seniors at the Rainier Court apartment complex who are so valiantly fighting their exploitative landlord side and for'",
        "'speaker_3': 'rent control and who also testified in support of the people's budget. Thank you.'",
        "'speaker_0': 'Council member so want. Council Member Lewis, you are next in the queue and I do not see any other hands raised. Go ahead, Councilor Lewis.'",
        "'speaker_4': 'Thank you, Madam President. I just want to extend a couple of brief remarks to first indicate my very deep appreciation to Chair Mesquita and her leadership and being incredibly accessible and accommodating throughout the budget process and hearing the various requests from from my office and from people in my district and reconciling a lot of those requests into'",
        "'speaker_4': 'this final budget. We are already getting a lot of people reaching out who are very pleased that their efforts on the Battery Street portal in the market to Mohi and other projects have resulted in some of those priorities getting into the budget and are very grateful to see that when a community comes together with a project in'",
        "'speaker_4': 'mind and puts their their shoulder to the wheel on it, something can ultimately come of that effort and really appreciate your process in allowing that to happen. I do want to state that I am certainly voting in favor of this budget today and appreciate the process that has gone into it.'",
        "'speaker_4': 'I do want to signal that for all of us here on the Council, I don't think I'm speaking just for myself to vote in favor of this budget does not necessarily signify agreement with every component, but does signify respect for the process, signify a willingness to go forward and have a budget that can keep the essential services'",
        "'speaker_4': 'of the city running and the continuation of our local democracy. Having gone through this very thorough process and I look forward to voting for it. There certainly are some components I would have liked to see changed. I feel that I was heard and having the completely transparent ability to bring forward amendments, to have my say on them'",
        "'speaker_4': 'and in some cases be successful, in some cases not. And I look forward to having the final passage on this to move forward and get to the work of implementing a lot of the things within the four corners of this budget in 2022.'",
        "'speaker_4': 'I want to close by also extending my thanks to Seattle City Council central staff. I'm always accessible, incredibly hard working. I don't know when our central staff sleeps. They seem to always be there and ready. Whenever I have a question and I really appreciate that accessibility, professionalism and the high quality of the work product throughout this process'",
        "'speaker_4': 'and other endeavors. I want to particularly thank our community as the budget manager for, you know, stressing all of the different parts into place throughout this process to keep us on track and congratulate our new central staff director, Esther Handy, on jumping in right at the beginning of this process and being able to keep everything running on'",
        "'speaker_4': 'time and meeting all of our deadlines. And I do finally want to I want to thank my team in my office throughout this effort for shepherding its proposals through. And every single one of them has multiple projects within this budget that are a result of their coalition building and diligent work in shepherding these projects.'",
        "'speaker_4': 'I want to thank Jacob Thorp for his work in designing with the King County Regional Homelessness Authority and getting a lot of our homelessness additions, homelessness service additions into this budget, including tiny house villages, high duty shelter provisos related to peer navigation.'",
        "'speaker_4': 'One thing to Neil Brown on my staff for her work on alternatives to policing and building up and developing the 911 call criteria is to set the stage for future non-police alternative dispatch from our Communications and Public Safety Center.'",
        "'speaker_4': 'I want to thank Parker Dawson for being the point person on some of those district projects I mentioned earlier for the Battery Street Portal and Market to Mohi. And I want to thank my colleague, in fact, a man of honor, for jumping in and really taking on a lot of the ministerial duties in the office as a'",
        "'speaker_4': 'replacement at the beginning of the budget cycle to really free up my other staff members to take on a bigger role in this budget process. So thank you. We really appreciate having you on board and in your work and helping with our office's communication strategies.'",
        "'speaker_4': 'So thank you so much with that. Madam President, I don't have anything else to add and appreciate being able to make some remarks.'",
        "'speaker_0': 'Councilmember Lewis, I have Councilmember Peterson in the queue next. And again, for anyone else, I'd like to give.'",
        "'speaker_2': 'Remarks, please.'",
        "'speaker_4': 'Thank you. Council President colleagues, as we know that crafting of Seattle's budget occurs during most of the calendar year, starting with proposals from each city department. I want to thank our mayor and her department heads and their teams and our city budget office under the leadership of Ben Noble and here, of course, in the legislative branch.'",
        "'speaker_4': 'Many thanks also to our city council central staff, our information technology team, the city clerks, the L.A. team, and my office for their strong work and many others for their work under the deadlines of our rigorous fall budget review process and especially grateful to our budget chairs, leadership and her grace in giving us the space to offer'",
        "'speaker_4': 'amendments and differences of opinion. As with all budgets that are crafted and amended by multiple teams with various perspectives and approaches, there are items that we and our constituents like, especially programs for those most in need in our council districts.'",
        "'speaker_4': 'And there are items that we might not like, especially as we debate how best to fund public safety, increase accountability, and deploy some effective alternatives to our traditional emergency response systems. Regardless, I believe we need a city budget approved and in place to keep our city government moving forward and in keeping our city moving forward.'",
        "'speaker_4': 'I'm especially grateful for the adoption today of Council 120224, which was the companion legislation for Council Budget Action Estimate 558002 to build back better with a boost to bridge bonds, bonds will enable us to finally address the growing backlog of vital bridge safety projects in the wake of the closure of the West Seattle Bridge and the subsequent'",
        "'speaker_4': 'audit of Seattle bridges that confirms many key bridges are in poor condition. We were reminded of this vulnerability with our the recent malfunctioning and temporary closure of the University Bridge, a multi-modal bridge that may someday be the key to installing a new bus rapid ride line and will enable us to fulfill more promises of a move.'",
        "'speaker_4': 'Seattle, by restoring some of that seismic upgrade projects, paused by our staff and can also increase safety on multiple bridges. On the project list we received from stocks, bonds can also boost the capital heavy line items identified by the city auditor as being historically underfunded.'",
        "'speaker_4': 'Authorizing these bonds will enable the incoming administration to seize the window of opportunity when interest rates are at historic lows. See, this city council delivers the authority for bridge bonds. And early next year we expect the new administration to use that authority to keep our infrastructure safe, to keep our economy moving, and to keep our communities connected'",
        "'speaker_4': '. I will be voting yes on today's amended city budget. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. Are there any other comments? The budgets and government are set up because you're the budget chair. I'm going to let you go last. So I'm looking for non. Budget Chair Committee comments. So council versus please.'",
        "'speaker_4': 'Thank you, Council President. Thank you, Chairman State. In this budget process, I set out with three broad priorities for District six investing in vibrant public spaces, addressing homelessness, and my top priority of providing citywide 24 seven response to mental health emergencies.'",
        "'speaker_4': 'For this top priority, colleagues, with your help, we secured $2.5 million to increase the size of the mobile crisis team so that there is an appropriate first responder for people in crisis in our community. This funding follows our work in my amendment last year to provide the first ever city funding for the Mobile Crisis Team, and it'",
        "'speaker_4': 'brings the total city investment from $0 two years ago to $3.5 million today. This budget also fully funds spd's staffing and hiring plans, expands community service officers health one, sets up triage one and invests in a study of the level of staffing required to ensure public safety on our waterways.'",
        "'speaker_4': 'In District six, this budget makes key investments, including $1,000,000 to install the children's playground at Ballard Commons Park. That was put on pause in 2019 by the pandemic funding to create the redesign of Ballard Avenue for Cafe Street that other districts can use, that redesign their districts to $3 million to clean up and remediate our parks.'",
        "'speaker_4': 'Funding to expand both the Phinney Neighborhood Association's hot meal program and the Vehicle Residency Outreach Program. And so much more for our district and our city. This was a difficult budget year and I did not get everything I wanted in this budget, as others have said as well.'",
        "'speaker_4': 'And I'm proud to pass this budget that moves our city forward out of this pandemic and starts 2022 by working together to build the Seattle we know we can be. I want to take a moment to thank all of my colleagues who worked with me or supported my priorities or even disagreed with my priorities.'",
        "'speaker_4': 'A special thank you to Council Member and Budget Chair Mosqueda for leading a smooth process that resulted in a balanced, fiscally responsible budget. Setting Seattle up for success, emerging out of an economic downturn and a period of political turmoil.'",
        "'speaker_4': 'I can't understate that enough. We have had a lot of political turmoil. We've seen as we experienced an economic recession and we came out set up for success with the budget before us. I want to thank central staff for everyone who worked with me on my amendments.'",
        "'speaker_4': 'I've been noble. Julie Dingley and your entire team. A huge thank you to you. And especially to my own team. Amanda, Noah, Kate and Lena. Thank you for your hard work on behalf of District Six and for the whole city.'",
        "'speaker_4': 'Thank you. Budget Chair and thank you, Council President. I look forward to voting yes on this budget.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss. Any other council members interested in making comments on the budget? All right. I do have some comments I'd like to make before I handed over to Councilman Mosqueda to make closing remarks on this particular item.'",
        "'speaker_0': 'So, colleagues, today the Seattle City Council will pass an important 2022 budget amidst a public health emergency unlike any other in this century. As I wrap up my second and last term on the City Council, this is my final budget and I'm grateful to Budget Chair Mosqueda and each of you who agreed to co-sponsor my budget items'",
        "'speaker_0': 'this year. And over the past six years. I'm also grateful to current and former council members who have extended to me an opportunity to partner with you on your budget priorities as one of your co-sponsors. For me, I'm humbled that the budget chair must data included all but one of my budget priorities in her proposed balancing package'",
        "'speaker_0': '. And I want to thank Budget Chair Mosqueda, who I am lucky enough to call a colleague, but even luckier to call a friend. And I also want to thank council central staff for their diligent work to identify and close a $15 million deficit that Mayor Durkan transmitted in her proposed budget, which was exacerbated by a revenue forecast'",
        "'speaker_0': 'update. That means we have less resources to meet the many needs for a livable, equitable and safe city for us all. I also want to thank my team, most of whom have been with me since my first term on this council.'",
        "'speaker_0': 'For all their tremendous work on this budget and on prior budgets, my Chief of Staff, Brandon Thomas. My Deputy Chief of Staff, Cody Writer, my senior policy adviser being when and my scheduler, Maria von Brunn and my past staff, Orlando Bernal, Genevieve Jones and Roxana Gomez, along with so many work study interns.'",
        "'speaker_0': 'Without each of their ability to bring tenacity and dedication to this really challenging work, none of the millions of dollars of investments achieved in this 2022 budget and past budgets would have been possible. So my deepest thanks and gratitude to each of them.'",
        "'speaker_0': 'This year's budget includes the following new and enhanced investments that we champion together with community partners and with your support colleagues. We expanded child care and safety net programs. There's an additional $1 million to support childcare providers, centers and in homes that will support providers stay licensed and enhance their ability to expand childcare slots to serve our'",
        "'speaker_0': 'children and their families. We have $200,000 in this budget to stoke and eventually launch a citywide guaranteed basic income pilot project. There's $661,000 to expand the legal defense fund to increase legal aid services to an anticipated increase in asylum cases in Seattle.'",
        "'speaker_0': 'There's $500,000 towards the Tubman Health Clinic, a black led community health clinic that will provide culturally responsive health care to Seattle's black community. And I was proud to be able to co-sponsor an additional $649,000 investment to strengthen digital equity and Internet access across the city.'",
        "'speaker_0': 'This budget also has more transit and green infrastructure. We advanced $545,000 to prioritize community engagement and education and environmental impact studies in the city's next comprehensive plan. Update that will guide city wide growth policies for the next decade at least.'",
        "'speaker_0': 'We have $100,000 to strengthen climate resilience strategies by ensuring that smoke shelters or cooling centers are within 15 minutes of every resident and worker in Seattle. There's a $2.5 million proviso to require that the Seattle Department of Transportation detail in the city wide transportation plan.'",
        "'speaker_0': 'How multi-modal plans like bicycle master plan, like the pedestrian master plan will be prioritized to pedestrianize and transform more more of our right of ways into vibrant public carbon free spaces. We've also addressed significantly additional funding for homelessness and mental health services.'",
        "'speaker_0': '$600,000 in additional resources for the King County Regional Homelessness Authority. I was proud to be able to co-sponsor that with Councilmember Lewis and others. There's a new $5 million investment to establish a new high acuity shelter in coordination with King County to provide behavioral health services, an additional $100,000 to expand outreach to our neighbors living in vehicles'",
        "'speaker_0': ', $600,000 to expand and enhance services in tiny house villages. $100,000 to expand hygiene services for camps. Second chance $600,000 for study of wages and our local human services workforce and a boost for workers worker pay for those on the front lines addressing our city's most pressing humanitarian crisis.'",
        "'speaker_0': 'We've also invested in public safety interventions and a trauma informed crisis response system. I was able to advance a proviso in the Seattle Police Department's budget to preserve underspend from salary savings that can be reinvested in community based alternatives to law enforcement.'",
        "'speaker_0': 'We also have $1.8 million proviso in the city attorney's office to ensure that free filing diversion programs and pretrial diversion programs and the Let Everyone Advance with Dignity program will continue to be part of the work we do as a city.'",
        "'speaker_0': 'Regardless of who is the city attorney. I'm proud of these achievements, even though by admission we did not achieve across the board success, including the close defeat of my abrogation amendment that would have advance transparency and budget accountability within the police department.'",
        "'speaker_0': 'Alas, the future Council will continue to struggle with holding the police department accountable to spending within its limits. In large part because the failure of my abrogation amendment means the future mayor and permanent chief will have the budget by which to hoard nearly $20 million worth of general fund dollars during a historic once in a lifetime global'",
        "'speaker_0': 'pandemic that continues to ravage our most vulnerable community members. But this is a battle that will most assuredly be for each of you to consider and debate and decide in the near future. So in closing, I'm grateful to have had such a meaningful opportunity to work with each of you, your staff, council, central staff, including our new'",
        "'speaker_0': 'director, Esther Handy, and her fearless budget manager, Allie Pucci. Also Patti Wigram, City Clerk's Office, I.T. communications staff and the Seattle Channel. This Thanksgiving, I have much to be grateful for. And among those items for which I am grateful.'",
        "'speaker_0': 'I give thanks for all of your hard work and your public service. Thanks to each of you for the opportunity to serve the people of this city together as a strong city council. Thank you, Madam Chair. I'm going to hand it over to you now.'",
        "'speaker_0': 'That's the president. Thank you very much. Thank you for your service and your leadership on council. Thank you for the opportunity to work with you not just on this budget, but with your leadership and partnership on the Seattle rescue plan.'",
        "'speaker_0': 'And colleagues, thanks again to all of you for the work that you put into this budget. I will be very brief because the council president eloquently summarized the aspects within this budget that I am so proud of and I'm so thankful for all of your ongoing participation to have been able to get to this point today, to'",
        "'speaker_0': 'have that extensive summary that you just heard reflected in our final budget as we pass this, the Council 2022 budget response to these most pressing crises facing our city in the wake of COVID and in the wake of rising income inequality, by investing a historic amount of funding in affordable housing and sheltering more of those who are'",
        "'speaker_0': 'experiencing homelessness and ensuring equitable economic recovery, investing in public safety. And, as Councilmember Suarez noted, getting back to the basics, making sure that we're investing in libraries and parks. This council budget rightly invests in more emergency reserves while prioritizing spending limited public dollars to serve, care for and support working families and our local economy.'",
        "'speaker_0': 'Thanks very much to the foresight of this Council to continue to support the implementation plan. From the jump start progressive revenue. We are able to leave with progressive values in this Budget Act with urgency to ward off any deep cuts and protect our most vulnerable in this time of compounding public health crises.'",
        "'speaker_0': 'I am proud and proud of the ways in which we have come together as a council and proud of the ways in which we are coming together as a city. We are making important decisions for our city in the face of very bad economic forecasts received just weeks ago.'",
        "'speaker_0': 'And as chair, I have always been committed to a transparent and accountable budgeting process. After reviewing the nearly 200 amendments to the proposed budget colleagues, together we have crafted a budget that invests in the areas of most need.'",
        "'speaker_0': 'I want to continue to thank my council colleagues and sincerely express my appreciation for your difficult work that you've put into making sure that our most urgent needs are met in this budget cycle. And we will continue to work to address those needs that will potentially manifest in 2022.'",
        "'speaker_0': 'We will be more prepared to do so because of the work you have done to protect the reserves and to prepare for those situations that may be on the horizon. I will also work with the next administration to address any emerging needs and work swiftly to make sure that our city has what it needs to be responsive'",
        "'speaker_0': 'to the tremendous gamut of needs across our great city of Seattle. We've worked tirelessly over the last two months. We've also worked tirelessly over the last two years in the midst of this pandemic, to truly identify every dollar that could be used in 2020, to get it out the door as fast as possible, and in partnership with'",
        "'speaker_0': 'the state partners and our federal congressional members to respond to the emergency that COVID has not created but has made worse in terms of economic instability and housing instability. I greatly appreciate the work you've done here, colleagues. I'm proud of the investments in stability, safety and care for Seattleites.'",
        "'speaker_0': 'We are adjusting for some of the most unprecedented times our city, our country has ever faced. And we are doing this by investing in affordable housing, responding to the homelessness crisis, creating equitable and safe communities, and creating a future that our city can be proud of by investing in economic resilience.'",
        "'speaker_0': 'I look forward to working with you to implement these important components. And I want to thank you again for all of your work. I did my thank you this morning, Madam President, but I want to again thank central staff and my team who have been just tremendous.'",
        "'speaker_0': 'So thank you all for your consideration. And I do look forward to passing this with your support today. Thank you, Councilmember Mosqueda. With that, we are ready to take a vote. So will the clerk please call the role on the passage of council bill 120211 item.'",
        "'speaker_0': 'Agenda item 32.'",
        "'speaker_1': 'The want? No. Strauss. Yes. Herbold. Yes. Whereas I. Lewis. Yes. Morales. Yes. ROSQUETA. I. Peterson. I council President Gonzalez.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Aid in favor one oppose.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_1': 'The script is really long.'",
        "'speaker_0': 'Okay. The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay. We are now item 33. Will the card please read the title of item 33 into the record?'"
    ],
    "AN ORDINANCE relating to the levy of property taxes; fixing the rates and/or amounts of taxes to be levied, and levying the same upon all taxable property, both real and personal, in The City of Seattle, to finance the departments and activities of City government and to provide for the general obligation bond interest and redemption requirements for the year beginning on the first day of January 2022; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Agenda Item 33 Council Bill 120203 An ordinance relating to the levy of property taxes, fixing the rates and or amounts of taxes to be levied and levying the same upon all taxable property, both real and personal, in the City of Seattle, to finance the departments and activities of the city government and to provide for the general obligation'",
        "'speaker_0': ', bond, interest and redemption requirements for the year, beginning on the first day of January 2022 and ratifying and confirming certain prior acts. The committee recommends the bill pass with council members Macheda Herbal, Gonzalez, Suarez, Lewis, Morales and Strauss in favor and Councilmember Peterson abstaining.'",
        "'speaker_0': 'Thank you so much. Okay. Are there any comments on Council Bill 120203. Item three three. He kind of comments on agenda item 33. Hearing none. Will the clerk please call the roll on the passage of Council Bill 120203.'",
        "'speaker_0': 'Agenda item 30.'",
        "'speaker_1': '321.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Strauss Strouse. Yes. Yes. Whereas I. Lewis. Yes. Morales. Yes. I. Peterson. I. Council. President Gonzalez. I nine in favor and unopposed.'"
    ],
    "AN ORDINANCE authorizing the levy of regular property taxes by The City of Seattle for collection in 2022, representing an increase above the regular property taxes levied for collection in 2021; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'So much council bill 120203 Agenda item 33 passes and the chair will sign it. Please affix my signature to the legislation on my behalf. Will the clerk please read the title of item 34 into the record? Agenda Item 34 Council Bill 120204 An ordinance authorizing the levy of regular property taxes by the City of Seattle for collection'",
        "'speaker_0': 'in 2022, representing an increase above the regular property taxes levied for collection in 2021 and ratifying and confirming certain prior acts. The committee recommends the bill passed with council members Macheda Herbold, Gonzalez, Suarez, Lewis Morales and Strauss in favor, and Councilmember Peterson abstaining.'",
        "'speaker_0': 'Thank you so much. Are there any comments on a council bill? 120204. Agenda item 34. Any comments on agenda item 34? Hearing none. Will the court please call the role on the passage of Council Bill 120204 Agenda Item 34 The Want.'",
        "'speaker_1': 'Yes. Strauss Yes. Herbold Yes. Whereas I.'",
        "'speaker_4': 'Lewis Yes.'",
        "'speaker_1': 'Morales Yes. Was it a. Hi. Petersen Hi. Council President Gonzalez I nine in favor and unopposed.'",
        "'speaker_0': 'Because so much council bill 120204 agenda item 34 passes and the chair will sign it will please affix my signature to the legislation on my behalf. Okay, colleagues, is there any further business to come before the council?'",
        "'speaker_2': 'Madam Chair, we have the empty meeting. So do you. What would you suggest as far as a break between now and when we at? I don't suspect it will go long, but yeah.'",
        "'speaker_0': 'I was going to make comments about that right before we adjourn. Okay. Sorry, let me. No, it's okay. Let me let me make sure there isn't any other further business to come before the council that requires motions before we get to that.'",
        "'speaker_0': 'I see your your line. Okay, gentlemen. What else? Your hand is raised.'",
        "'speaker_1': 'Is this the good of the order? Part of the agenda? Yes. Okay.'",
        "'speaker_2': 'I would like to request to be excused from full council on December six and from all committee meetings except for my own during that week as well. That's when I will be in. Not.'",
        "'speaker_0': 'Okay. If there's no objection, Councilmember Morales will be excused from city council meetings on Monday, December six. Hearing no objection. Councilman Morales will be excused on December six. Any other further business to come before the council. Okay, colleagues, this does conclude the items of business on today's agenda.'",
        "'speaker_0': 'As mentioned by councilmember suarez, we do have a meeting as the Seattle Parks District Board that is scheduled to occur at the conclusion of this meeting. The clerk's office has asked to have 15 minutes to be able to transition, and I think our good folks with TAC could use a break as well, and we probably could do'",
        "'speaker_0': 'so with your agreement. I'd like to suggest that we allow for that 50 minute break and reconvene at 5 p.m.. Any objection to that? And we will reconvene at 5:00 PM again, just as we did this morning. You do not need to leave the zoom room.'",
        "'speaker_0': 'The credentials are the same for council members so you can step away for 15 minutes, just mute and stop your video. And when you're ready you can come back. So with that colleagues, our next regularly scheduled city council meeting is on Monday, November 29th, 2021 at 2:00 PM.'",
        "'speaker_0': 'I will see you all in about 15 minutes.'",
        "'speaker_2': 'Thank you. Thank you.'"
    ]
}