{
    "AN ORDINANCE granting Pier 54, LLC permission to maintain and operate a pedestrian walkway and a covered patio, including benches, tables, food preparation and serving areas, outdoor lighting, pedestrian deck, pilings, and other related appurtenant structures in the public place on the north side of Madison Street, west of Alaskan Way, for a ten-year term, renewable for two successive ten-year terms; specifying the conditions under which this permit is granted; providing for the acceptance of the permit and conditions; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Bill passed and chose Senate move on the committee reports. You can read the first item and you can read the short title to please.'",
        "'speaker_5': 'The report of the Sustainability and Transportation Committee agenda item one Council Bill 119154 An ordinance granting Pier 54 LLC permission to maintain and operate a pedestrian walkway and a covered patio, including benches, tables, food preparation and serving areas, outdoor lighting, pedestrian deck pilings and other related apron structures in the public place on the north side of Madison'",
        "'speaker_5': 'Street, west of Alaskan Way, for a ten year term renewable for two successive ten year terms. The committee recommends the bill pass.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_4': 'Thank you. I think folks are generally familiar with the Rivers Fish Bar down on the waterfront from related sites, some of the property outdoors there, specifically the areas where a lot of us feed French fries to seagulls is actually public right away and the previous term permit has expired.'",
        "'speaker_4': 'And so this would create a new term permit for ten years that could be renewed for 2 to 10 year extensions beyond that for a total of 30 years. Similar to other permits, this has gone through the process of evaluating the cost of that and the city will be compensated for the lease terms of that.'",
        "'speaker_1': 'Very good. Any questions or comments? Please call the role on the passage of the Bill Gonzalez.'",
        "'speaker_2': 'HERBOLD Hi. Johnson Whereas McKenna, I. O'Brien Hi. Sergeant Bagshaw President Harrow High nine in favor and unopposed.'",
        "'speaker_1': 'Passenger of Senate. Please read a June item number, the next edition item, and you can read a short time as well.'"
    ],
    "AN ORDINANCE granting Lakefront Investors 2 LLC permission to construct, install, and maintain four sets of private communication conduits under and across Boren Avenue North, north of Mercer Street, and under and across the alley between Boren Avenue North and Fairview Avenue North, north of Mercer Street, for a ten-year term, renewable for two successive ten-year terms; specifying the conditions under which this permit is granted; and providing for the acceptance of the permit and conditions.": [
        "'speaker_5': 'Agenda item two Council Bill 119159 An Ordinance Granting Lakefront Investors two LLC permission to construct, install and maintain four sets of private communication conduits under an across Bourn Avenue, north north of Mercer Street, and under and across the alley between Warren Avenue North and Fairview Avenue, north north of Mercer Street.'",
        "'speaker_5': 'For a ten year term renewable for two successive ten year terms, the committee recommends the bill pass.'",
        "'speaker_1': 'Because of O'Brien.'",
        "'speaker_4': 'So this is another term permitted as described in the title of Bill. This is for properties in South Lake Union, sometimes known as the Mercer Blocks, their blocks between Mercer and Valley. Just what would that be? South of the South Lake Union Park.'",
        "'speaker_4': 'These projects are being developed with the intent that Google would be the tenant in a few these buildings. And specifically, Google has requested the ability to network the two buildings together through a dedicated network under the street in these conduits.'",
        "'speaker_4': 'So this legislation would allow that procedure to move forward. This is not a vacation, but rather a term permit. This means that if at any point the city needs access to that right away and the conduits are in the way, we can revoke that at any point.'",
        "'speaker_4': 'But we've done the thorough analysis. And at this point we believe that these will be placed in a way that we will not need access to them. The intent is that Google is who wants to have security communications among their employees and allowing the private conduit to connect the two buildings allows them to proceed with that.'",
        "'speaker_1': 'Very good. Any questions or comments that please call the role on the passage of the bill?'",
        "'speaker_2': 'Gonzalez I. Herbold, i. Johnson I was I was scared to I. O'Brien by Sergeant Bagshaw. President Harrell nine in favor and an.'"
    ],
    "A RESOLUTION affirming The City of Seattles commitment to racial equity and social justice and recognizing the Seattle Department of Transportations Transportation Equity Program, created to provide safe, environmentally sustainable, accessible, and affordable transportation options that support communities of color, low-income communities, immigrant and refugee communities, people with disabilities, people experiencing homelessness or housing insecurity, LGTBQ people, women and girls, youth, and seniors to thrive in place in vibrant and healthy communities, and eliminate or mitigate racial disparities and the effects of displacement.": [
        "'speaker_1': 'Opposed bill passed in show Senate. Please read that you're not in number three. The short title.'",
        "'speaker_5': 'Agenda item three Resolution 31773. A resolution affirming the City of Seattle's commitment to racial equity and just such social justice. And recognizing the Seattle Department of Transportation's Transportation Equity Program, the committee recommends the resolution be adopted.'",
        "'speaker_1': 'Cast Member Bryant Thank you.'",
        "'speaker_4': 'The work to address equity within the Department of Transportation is critical. Body of work in this resolution is just one small step along the path. What we know is that Seattle is becoming a higher cost city and more and more people are struggling to afford to live in our city.'",
        "'speaker_4': 'Housing is obviously a big piece of that puzzle, and for most you households, housing is the largest cost, but transportation is a close second. And especially for households that are cost burden, the cost of getting around the city can often be the difference between having a viable life in the city or really struggling.'",
        "'speaker_4': 'The transportation equity program within the State Department of Transportation, sometimes in part designed to address the city's affordability crisis by providing access to affordable transportation options and thereby reducing transportation costs, especially for the most vulnerable and the lowest income communities.'",
        "'speaker_4': 'This resolution also asks that our side create a broader transportation equity agenda, outlining some of the principles and frames of the process for creating that agenda and identify some partners in the work. There's a team of folks at our staff that are working on this.'",
        "'speaker_4': 'Obviously, this is critical to have leadership from the department director, former director, who was a good leader on that. And as we move forward with the new director and start in the coming months, I look forward to ensuring that that director will also be engaged in this work, that this resolution will will establish the city's policy on'",
        "'speaker_4': 'working towards equity in transportation.'",
        "'speaker_1': 'Very good. Any comments or questions? If not those in favor of adopting the resolution, please vote i. I. Those oppose vote no. The motion carries the resolutions adopted in the chair will sign it. We have two appointments. Should we read them both in the same time?'",
        "'speaker_1': 'There's separate there's separate commission. Let's go with a Janette in number four, please.'",
        "'speaker_5': 'Agenda item four. Appointment eight, six, eight. The appointment of Emily Payne as members Seattle Bicycle Advisory Board for a term two August 31st, 2019. The committee recommends the appointment be confirmed.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the acquisition of real property commonly known as 5104 SW Orleans Street; and authorizing acceptance and recording of the deed for open space, park, and recreation purposes.": [
        "'speaker_1': 'Very good. Any comments? Those in favor of confirming the appointment. Please vote i. I. Those opposed vote no. The motion carries and the appointment is confirmed. Please read the part of the Civil Rights, Utilities, Economic Development and Arts Committee.'",
        "'speaker_5': 'The report of the Civil Rights, Utilities, Economic Development and Arts Committee. Agenda Item six Council Bill 119169 An ordinance relating to the Department of Parks and Recreation authorizing the acquisition of real property, commonly known as 50 104 Southwest Orleans Street, and authorizing acceptance and reporting of the deed for open space, park and recreation purposes.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Because I'm a herbold.'",
        "'speaker_3': 'Thank you. So this is something that is, as we've heard, a long time in the making. Former Councilmember Tom Rasmussen worked on this issue for a couple of years before I joined the council. In fact, my first visit to this particular property was before I took office in mid-December.'",
        "'speaker_3': 'The tour that was organized by Councilmember Rasmussen staff member also included the Southwest Historic Society and it included for Terra because at the time the Parks Department was not interested in pursuing the purchase of the property, but for Terra was interested in perhaps offering an interim solution and holding on to the property for a period of time'",
        "'speaker_3': 'and perhaps at a later date transferring it to parks. Happily, the Parks Department, through the persistence of many, many people who've joined us today, changed their mind. And the thanks goes to many people both inside and outside City Hall.'",
        "'speaker_3': 'I want to thank, first and foremost, Bruce Statler. I think, you know, he said it best when I visited him at his home when he realized the value of the property to the public and in making what is truly more of a donation than a property acquisition and in keeping in tradition with the history of the park'",
        "'speaker_3': ', which was initially a donation in 40 I'm sorry, 1908 by Ferdinand Schmitz for the enjoyment of the public. And, you know, Mr. Sattler is offering this piece of property to the city for well under half of its value.'",
        "'speaker_3': 'And he did so because he realized what the future would hold for that piece of property should he sell it. And he was very concerned that the property would be be redeveloped for use as a as a McMansion, thus depriving the general public from the enjoyment of the park.'",
        "'speaker_3': 'And not only was the is the acquisition helping stop something that is not desirable for for that park entrance, but it actually is adding something, I think that's really important to future generations for enjoyment of the park and potentially looking at a new access trail in the future so that there will be more ways for more people'",
        "'speaker_3': 'to to enjoy the park. I also want to thank Councilmember Rasmussen for his persistence. I've kind of seen this as one of several legacy projects that the councilmember has had, and I've really enjoyed working with you. It's been a great help to me in pushing this forward to to point to to your efforts and your commitment on'",
        "'speaker_3': 'this throughout the process. I also want to want to thank for Tara. Thank thank Vicki Schmitz and thank the Southwest Historical Association. And in particular, we've got Jeff McCord here with us today. But your predecessor, Clay Eales, was a great advocate for this project as well.'",
        "'speaker_3': 'Many thanks as well to park superintendent Hazel Segarra, Anthony RMR Parks, staff Chip Nevins, Tracey Ratcliffe and Mike Fong, who was in the mayor's office at the time and is back in the mayor's office again. Those folks all helped a great deal.'",
        "'speaker_3': 'The life estate option will allow Mr. Statler to continue to live in his home, and in return the city will acquire the land at a reduced rate and at that time in the future will become officially part of Niche Park.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Very good. Any further comments or questions can send back show.'",
        "'speaker_0': 'Thank you. I just want to acknowledge Councilmember Rasmussen, former councilmember said like working with you and I'm glad you're back. Bruce, thank you for your generosity. And I loved the article about you yesterday front page of Seattle Times and to read about Scout and Nellie and I'm sure that they'll continue to have a great home.'",
        "'speaker_0': 'And this park I think it's 53 acres. It's a stunning pedestrian area in the middle of West Seattle. And you're contributing more to that. Thank you very much.'",
        "'speaker_1': 'Very good. Okay. We're ready to vote. Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Gonzales i. Herbold, i. Johnson Whereas macheda i. O'BRIEN So want to make sure. President Harrell hi. Nine in favor and unopposed.'",
        "'speaker_1': 'Bill passenger would sign it. Very good. The next such an item and the short title.'"
    ],
    "AN ORDINANCE authorizing the General Manager and Chief Executive Officer of Seattle Public Utilities to enter into agreements with the Port of Seattle and BP West Coast Products LLC for the purposes of satisfying utility-related conditions for the Ports street vacation petition for its Terminal 18 Redevelopment Project on Harbor Island, City of Seattle Clerk File No. 301929; declaring certain easement rights located on Harbor Island as no longer required for municipal utility purposes and surplus to the Citys needs; and ratifying and confirming certain prior acts.": [
        "'speaker_5': 'Agenda Item seven Council Bill 119140. An ordinance authorizing the general manager and chief executive officer of Seattle Public Utilities to enter into agreements with the Port of Seattle and BP West Coast Products, LLC for the purposes of satisfying utility related conditions for the Port Street vacation petition for its Terminal 18 redevelopment project.'",
        "'speaker_5': 'The committee recommends the bill passes amended.'",
        "'speaker_1': 'Because of our Herbold.'",
        "'speaker_3': 'Thank you. Way back in 1998, the Port of Seattle petitioned Seattle Public Utilities to vacate certain streets for the expansion of the port's Terminal 18 facility. This year, the city and the port entered into the Harbor Island Redevelopment Agreement.'",
        "'speaker_3': 'The agreement included construction, relocation, transfer and abandonment plans for port and city owned water, storm drainage and sewer facilities, as well as a final infrastructure ownership scheme. It also included an environmental and safety agreement. These easements with the port will satisfy the utility related conditions for the street vacation petition, and the delay from 1998 was due to'",
        "'speaker_3': 'a combination of factors such as project staff turnover, a complicated location with many, many landowners and port tenants past record keeping and work priorities in the future. Escort will bring final street vacation legislation to the council sometime later this year.'",
        "'speaker_1': 'Very good. Any questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez Herbold, i. Johnson, Maurice Mesquita, I. O'Brien Sergeant High President Harrell, nine in favor and unopposed.'",
        "'speaker_1': 'Bill passed in show Senate. Please read the next agenda item.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; declaring certain real property rights to be surplus to the Citys municipal utility needs; authorizing the General Manager/CEO of Seattle Public Utilities to grant a permanent, non-exclusive water utility easement, and restrictive well covenants, to the Sallal Water Association, a non-profit Washington corporation, for the purpose of construction, operation, and maintenance of a water system; and over, upon, across, and under a portion of The City of Seattles Cedar River Watershed property in Section 34, Township 23 North, Range 8 East, W.M., in King County, Washington.": [
        "'speaker_5': 'Agenda Item eight Council. Bill 119165. An ordinance relating to Seattle Public Utilities declaring certain real property rights to be surplus to the city's municipal utility needs. The committee recommends the bill pass.'",
        "'speaker_1': 'Consumer Herbold.'",
        "'speaker_3': 'Thank you. The Slough Water Association is a nonprofit co-op utility in North Bend. Slough Water Association would like to increase the reliability of associated with wall production and increase the size of the well protected area. There is no corresponding increase in water rights associated with this legislation.'",
        "'speaker_3': 'The city will receive $97,000 in compensation for the easement as well as staff time. I recuse myself from this vote during committee and I intend to do so at full council today. My husband is a member of the Slough Water Association and as I mentioned before, it is a nonprofit co-op utility.'",
        "'speaker_3': 'So in essence, he is one of many owners in the area.'",
        "'speaker_1': 'Very good. Any comments or questions? Okay. So we will put on this one. Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzalez i Johnson Suarez as well. Sarah O'Brien so on what i do. President Herrell high eight in favor. None oppose.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; authorizing the General Manager/Chief Executive Officer of Seattle Public Utilities to enter into a Memorandum of Lease and Ground Lease Agreement with King County for a radio tower and appurtenances in the Tolt Watershed.": [
        "'speaker_1': 'The bill passes and the chair of the senate. Please read agenda item number nine.'",
        "'speaker_5': 'Agenda item nine Council Bill 119166. An ordinance relating to Seattle Public Utilities authorizing the general manager, chief executive officer of Seattle Public Utilities to enter into a memorandum of lease and ground lease agreement with King County for radio tower and appearances in the total watershed.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_3': 'Councilmember Herbold, thank you. This agreement allows King County to lease about 8000 square feet of undeveloped land in the total watershed adjacent to the Toll Pipeline Road. The lease is for 25 years and may be extended up to three times in five year increments.'",
        "'speaker_3': 'The city of Seattle is one of many cities that have entered into it and Interlocal agreement with King County in order to implement a new 800 megahertz emergency radio communication system, sometimes referred to as Peterson, the Puget Sound Emergency Radio Network.'",
        "'speaker_3': 'King County will pay an annual rent of $20,000, which includes electricity and adjusts over time with CPI.'",
        "'speaker_1': 'We get any comments or questions that please call the role on the passage of the bill?'",
        "'speaker_2': 'Gonzalez. Herbold I. Johnson Whereas Mosquito I. O'Brien Sergeant Bagshaw. President Harrell nine in favor nine opposed.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; authorizing the General Manager/CEO of Seattle Public Utilities to accept an amended, extended, and restated franchise agreement for the operation of a water system within public rights-of-way of the City of Shoreline until 2026, and to enter into an Interlocal Agreement with the Shoreline Fire Department for hydrant inspection within The City of Seattles retail service area within the City of Shoreline; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'The bill passed and chair of the Senate. Please read agenda item number ten.'",
        "'speaker_5': 'Agenda Item ten Council Bill 119167. An ordinance relating to Seattle Public Utilities authorizing the general manager CEO of Seattle Public Utilities to accept an amended, extended and restated franchise agreement for the operation of a water system within public rights of way of the city of shoreline until 2026.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Consumer Herbold.'",
        "'speaker_3': 'Thank you. The city of Seattle is currently under a franchise agreement with the City of Shoreline to provide retail water service to the approximately 11,000 residents and commercial customers in the city of shoreline. This legislation extends the franchise agreement to 2026, allows for improved joint planning and coordination with the city of shoreline, and clarifies roles and responsibilities'",
        "'speaker_3': 'for Seattle public utility owned fire hydrants within Seattle Public Utility Retail Water Service Area in the city of Shoreline. The legislation authorizes SPU to enter into an interlocal agreement with the Shoreline Fire Department. Consistent with the clarifications regarding fire hydrant responsibilities in the amended franchise agreement.'",
        "'speaker_3': 'The Inter Local Agreement provides that the Shoreline Fire Department will inspect SPU owned fire hydrants within a space retail water service area in Shoreline at SPS expense, and SPU will continue to perform all other operation and maintenance. The City of Shoreline has already ratified the agreement and this legislation accepted on our side.'",
        "'speaker_1': 'Very good. Any comments or questions? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gonzales I herbold ii. Johnson Whereas I misgender i. O'BRIEN So aren't I Bagshaw. President Herrell Hi nine in favor and in oppose.'",
        "'speaker_1': 'The bill passed and share with Senate please read agenda item number 11.'"
    ]
}