{
    "AN ORDINANCE amending Ordinance 126000, which adopted the 2020 Budget; changing appropriations to the Human Services Department, the Executive Departments Office of Economic Development, and budget control levels, and from various funds in the Budget, for the purpose of providing financial assistance to small businesses; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'City council agenda?'",
        "'speaker_0': 'Item one Council 4119.'",
        "'speaker_2': '757 Amending Ordinance 126000.'",
        "'speaker_0': 'Which adopted the.'",
        "'speaker_2': '2020 budget and changing appropriations to.'",
        "'speaker_0': 'The Human Services Department, the Executive.'",
        "'speaker_2': 'Department's Office of Economic Development.'",
        "'speaker_0': 'And Budget Control levels, and from various funds in the.'",
        "'speaker_2': 'Budget for the purpose of providing financial assistance to.'",
        "'speaker_0': 'Small businesses and ratifying confirming certain prior acts.'",
        "'speaker_2': 'Thank you to the Clerk. This Council bill will require five votes in the affirmative in order for it to pass. What I'm going to do is I'm going to move to pass the council bill. Then I'm going to ask for a second.'",
        "'speaker_2': 'And once that second has been made, we do have council central staff on the line available for questions. I will go ahead and suspend the rules to allow for questions to be directed to council central staff if any of the council members have it, or if the sponsor, which is council member Tammy Morales, wants to provide council'",
        "'speaker_2': 'central staff with an opportunity to speak to the bill as well. So I'm going to go ahead and do both of those motions. I'm going to then allow Councilmember Morales to address the bill, and then we will go ahead and take a vote on any amendments and the substantive bill.'",
        "'speaker_2': 'So I'm going to move to pass Council Bill 119757.'",
        "'speaker_0': 'Second. Second.'",
        "'speaker_2': 'It's been moved and Sanjay intends to pass the bill. Again, council members, please note that Yolanda HOA, Amy Gore and Ali Bonacci of Council Central staff have joined this meeting. Should you have any questions? I will move to suspend the rules if there are any questions for central staff after the prime sponsor speaks to the bill.'",
        "'speaker_2': 'Councilmember Morales, would you like to address this bill?'",
        "'speaker_0': 'Yes, thank you. Council President Gonzalez, welcome back.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'If I might take just a moment, I do want to acknowledge that the staff at the Office of Economic Development have been working tirelessly, as have all of our first line frontline folks who work for the city. So I do want to acknowledge the hard work that they are putting in to help us as we get sometimes'",
        "'speaker_0': ', you know, hourly new information about this crisis. You know, our OPD staff are hearing from small businesses who are worried about their employees, worried about their own businesses, and they are dealing themselves now with some of the secondary trauma from hearing those stories over and over again.'",
        "'speaker_0': 'So I want to I want to thank our city employees who are helping us navigate through what is a really unprecedented time. And I want to thank the mayor and Director Lee for getting this bill to us quickly.'",
        "'speaker_0': 'This is an expansion of the existing business stabilization fund that we have at the Office of Economic Development. It is shifting about $1.4 million in community development block grant funds to provide emergency working capital grants to small businesses, really to micro-businesses who have five or fewer employees, because these funds are HUD funds.'",
        "'speaker_0': 'They require that the household income of the recipients be below 80% of area median income. So that's just a little bit of context for who will be receiving these grants. And they are roughly about, you know, up to $10,000 to provide some sort of relief for for working capital and being able to to pay employees or pay'",
        "'speaker_0': 'rent or. Manage as best I can.'",
        "'speaker_2': 'Great. Thank you. Councilmember Morales. Anything else you'd like to add before I go to the next step?'",
        "'speaker_0': 'No, I don't think so.'",
        "'speaker_2': 'Okay. Thank you so much. If there is no objection, the council rules will be suspended to have central staff address the council. Hearing. No objection. The rules are suspended. I wanted to open up the line really quickly just to provide counsel, central staff, an opportunity to add anything to the remarks that have already been made by Councilmember'",
        "'speaker_2': 'Morales as relates to Council Bill 119757. I will hand it over to Yolanda, Amy and Allie in the event that there is anything else that you want to add. And if there isn't, just indicate so.'",
        "'speaker_0': 'Hi. This is Yolanda. So you want to cancel central staff? Um, I would just add that, um, the appropriations from the Human Services Department, um, are to do a there are a couple of sources from the Human Services Department which, um, any could speak to in more detail.'",
        "'speaker_0': 'Um, and I can also speak to some of the discussions we've had with the Office of Economic Development in terms of how they are, how they are planning to distribute these funds. Because there is, um, as Councilmember Morales has noted, extremely high demand for these.'",
        "'speaker_0': 'And so, um, there are and so the Office of Economic Development has been accepting thousands of applications at this point and is screening them right now and is closing the application window next Wednesday. So please let everyone know.'",
        "'speaker_0': 'And they are also conducting outreach to ensure that everyone has a chance to apply. And they have noted that their intention is to prioritize, uh, businesses and these small micro-enterprises, as they call them, in neighborhoods at high risk of displacement.'",
        "'speaker_0': 'And so there, there will be a process by which they will select those who are eligible and, um, and kind of weighted towards those businesses in those locations.'",
        "'speaker_2': 'Thank you, Liza. Amy, is there anything you'd like to add?'",
        "'speaker_0': 'No, I don't have anything to add, but I'm happy to answer any questions that councilmembers have.'",
        "'speaker_2': 'Great. Thank you, Ali. Anything you'd like to add before I go through the process of asking if there are questions?'",
        "'speaker_0': 'No, I don't have anything to add. Thank you.'",
        "'speaker_2': 'Thank you so much. I'm going to go ahead. And just to avoid the that the casualty of conference calls, that is the cattle call. The question I'm going to actually call each of your names by order of districts.'",
        "'speaker_2': 'And if you have questions, please pose your questions at the time that I call your name. And if you don't have a question, just so you don't have any questions, but I'm going to go through the list kind of in a roll call fashion to try to keep this orderly.'",
        "'speaker_2': 'So I'm going to start with Councilmember Herbold. Do you have any questions for council central staff or the prime sponsor?'",
        "'speaker_0': 'I would love it if the council said to staff or the viewing public and the press who might be reporting on this can just very quickly go through what the source, what the this is. These are CDBG funds, their CDBG funds that were program for another purpose.'",
        "'speaker_0': 'If we could just go quickly through what those purposes were and how the departments are going to accommodate.'",
        "'speaker_2': 'Whether or not it's.'",
        "'speaker_0': 'There's no need for those for those purposes as originally anticipated or there's another source. Thank you, Councilmember Humble. This is a of council central staff to answer that question. Approximately $400,000 of the funds in this council bill are from HST for 2019 underspend of program administration funds.'",
        "'speaker_0': 'An additional 1 million of the funds that are being transferred by this council bill are from the Human Human Services Department's Community Facilities Program. And the intention of that funding was for Community Care Facility for Seniors as part of the North Lot Project at the Park Med Center in Beacon Hill.'",
        "'speaker_0': 'And what we have heard is that the project isn't quite ready to use those funds in 2020 and is okay with us using those funds for a different purpose, and that we believe that in 2021 and 2022 or in 2022, we will have other CDBG funds that we can devote to that project in a more useful time'",
        "'speaker_0': 'to the project. Thank you.'",
        "'speaker_2': 'Thank you. Thank you, Amy, for that explanation. Councilmember, did that answer your question?'",
        "'speaker_0': 'It absolutely did. Thank you.'",
        "'speaker_2': 'Okay. Do you have any other questions for council central staff for the prime sponsor?'",
        "'speaker_0': 'I do not.'",
        "'speaker_2': 'Great cabinet move to Councilmember Morales. I know that you are the prime sponsor, but in the event that you have additional questions that you'd like council central staff to run through, I'd offer you the opportunity to do that now.'",
        "'speaker_2': 'And if you don't, just let me know that you don't.'",
        "'speaker_0': 'Well, I do have one question. Yolanda was looking at that. My understanding is that the intent is to use kind of a lottery system for awarding, because we have so many people, so many small businesses who have applied.'",
        "'speaker_0': 'I wonder if there's any additional information about how that process will work. So I can tell you that the the lottery is going to be a weighted lottery system so that, um, the Office of Economic Development has stated that they are target and their goal is to that 80% of these awards go to those neighborhoods that are'",
        "'speaker_0': 'at highest risk of just businesses in neighborhoods that are at highest risk of displacement.'",
        "'speaker_2': 'Thank you. Yolanda, any follow up questions to that? Councilman Morales.'",
        "'speaker_0': 'I'm good. Thank you. Great.'",
        "'speaker_2': 'Okay. We're going to move on to council members want. Do you have any questions for council central staff or the prime sponsor?'",
        "'speaker_0': 'I don't. Thank you so much.'",
        "'speaker_2': 'Thank you, Councilmember Peterson. Any questions for council central staff or the prime sponsor or just comments in general?'",
        "'speaker_1': 'No, thank you.'",
        "'speaker_2': 'Thank you. Councilmember Suarez, any questions or comments for council central staff or the prime sponsor?'",
        "'speaker_0': 'Nope.'",
        "'speaker_2': 'All right. Thank you. And Councilmember Strauss. Same. Any questions or comments for council central staff or the prime sponsor?'",
        "'speaker_1': 'Not at this time. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Lewis. Any questions for council central staff or the prime sponsor?'",
        "'speaker_0': 'Not currently. Thank you.'",
        "'speaker_2': 'Thank you. And Councilmember Mosqueda. Any questions for Council Central's staff or the prime sponsor?'",
        "'speaker_0': 'No, I'm good. Thank you.'",
        "'speaker_2': 'Great. Thank you so much. To cancel central staff for that description of the bill and for the follow up answers to some of the questions. And thank you to Councilman Morales for your attention to this detail. I know that economic developments, particularly protection of small businesses in our community, are very important to you and that you have'",
        "'speaker_2': 'continue to prioritize those issues. And this is certainly an important moment to continue doing that work. I also understand that you have an amendment to the bill, so we will go ahead and consider your amendment first and then we will go ahead and vote on the underlying bill if and once it is amended.'",
        "'speaker_2': 'So I will open up the floor to you, Councilman Morales, to make your motion to amend the bill.'",
        "'speaker_0': 'So thank you. So as as Yolanda said, we do have lots of businesses who are very worried about how they're going to survive this crisis. And this is going to be an important fund to help mitigate for a couple of hundred businesses.'",
        "'speaker_0': 'So I understand that we need to move quickly. And I worry that in our case to react to the crisis that we might set in motion some systems that will perpetuate some of the inequities in our city. So I just want to make sure that we have an equitable process for awarding these funds and any other funds'",
        "'speaker_0': 'that we make available to Seattle in response to this crisis. So we have, I think, about 36,000 small businesses in Seattle. Thousands of them are owned by people who don't speak English. Applications for this fund were available online, but only in English for the first couple of days.'",
        "'speaker_0': 'So if you speak English, you can fill out the application online and hit send. But it was a couple of days before they were made available in other languages and the online application had to be printed out and mailed in or handed over to to an outreach worker.'",
        "'speaker_0': 'So, you know, when we're when those who don't speak English have extra barriers put in place in order to participate, we know that we've got some some issues. And I know that there wasn't any mal intent here. What we have instead is a small example of how, you know, very often our city government operates with blinders on'",
        "'speaker_0': 'to anyone who isn't part of the dominant culture. And we really have to change the way our city functions so that everyone has access to these resources. So rather than slow down the disbursement of this particular fund, I'm asking that we hear back from OED this summer about how the funds were distributed.'",
        "'speaker_0': 'You know, how many applicants did we get from people who don't speak English? How many folks were awarded who don't speak English? And just making sure that, you know, non-English speakers also get access to these opportunities. So if we're going to live up to our recent social justice goals, we really have to be thoughtful about infusing these'",
        "'speaker_0': 'principles into every aspect of our work, and especially as we create these emergency responses to the COVID 19 crisis. I think it's really incumbent upon us to make sure that we aren't perpetuating these systems of inequity, even if it means that we slow down our response a little bit.'",
        "'speaker_0': 'We really need to make sure that people of color, low income folks, limited English speakers have access to the information they need so that they can receive emergency relief, too. And so that is the spirit in which this amendment is offered.'",
        "'speaker_0': 'It is not a requirement that we provide this report. It is merely a request that we hear back from them about how this money was distributed.'",
        "'speaker_2': 'Thank you for that description of the amendment. Councilman Morales, I still need you to move the amendment.'",
        "'speaker_0': 'I move that we adopt Amendment one.'",
        "'speaker_2': 'Great. So there has been a motion made and it's been seconded. So Councilman Morales is already, as the sponsor of this amendment, has already spoken to it. Are there any comments on the amendment? Hearing no further comments on the amendment.'",
        "'speaker_2': 'Will the clerk call the roll on the amendment?'",
        "'speaker_0': 'Council Member Strauss.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Herbold, I. Councilmember Juarez. Guy Council member Lewis. I. Councilmember Morales. I council member must get a. I. Councilmember Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council members who want. I. Council President Gonzalez.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'Nine in favor and then opposed.'",
        "'speaker_2': 'The motion carries and the bill is amended. Are there any further comments on the bill as amended? All right. Hearing no comments, will the clerk call the roll on the passage of the bill as amended?'",
        "'speaker_0': 'Councilmember Strauss.'",
        "'speaker_1': 'I like.'",
        "'speaker_0': 'Councilmember Herbold. I. Councilmember Suarez. I don't remember lewis. I. Councilmember Morales. Hi. Councilmember Mesquita. I. Councilmember Peterson.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Council members to launch. I. Council. President Gonzalez, I. Nine in favor. None at home.'",
        "'speaker_2': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? All right. We're going to go ahead and move to item two. Will the clerk please read item to.'"
    ],
    "AN ORDINANCE relating to the City Light and Seattle Public Utilities Departments; temporarily removing the charge of interest on delinquent utility consumption and utilization accounts; superseding several sections under Title 21 that authorize and require the collection of interest on delinquent utility consumption and utilization accounts; declaring an emergency; and establishing an immediate effective date; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Agenda item two? Constable 119 758.'",
        "'speaker_2': 'Relating to the City Light and Seattle.'",
        "'speaker_0': 'Public Utilities.'",
        "'speaker_2': 'Departments temporarily removing the charge of interest on delinquent utility consumption and utilization accounts, superseding several sections under Title 21 that authorize and.'",
        "'speaker_0': 'Require the collection of interest on delinquent utility.'",
        "'speaker_2': 'Consumption and utilization accounts. Declaring an.'",
        "'speaker_0': 'Emergency and.'",
        "'speaker_2': 'Establishing an immediate effective date all by 3/1 vote of the City Council. Thank you to the clerk for that. We're going to go through the same process that we did with item number one. So I'm going to move to pass it.'",
        "'speaker_2': 'I'll need a second. Then we will go ahead and invite the prime sponsor, who is Councilmember Peterson, to speak to the bill. We will then suspend the rules to allow central staff to address the council and answer any questions.'",
        "'speaker_2': 'Councilmember Peterson and I believe Councilmember Lewis have some substitutions and an amendment, and then we will go ahead and consider those and then vote on the full bill. So that is the the run of show, as they say, for this particular item.'",
        "'speaker_2': 'So I'm going to move to pass Council Bill 119758.'",
        "'speaker_1': 'Second.'",
        "'speaker_2': 'It's been moved and seconded to pass the bill again. Council members please note that Eric McKinney and Brian Goodnight of Council Central Staff have joined this meeting. Should you have any questions? I will move to suspend the rules if there are any questions for central staff after the prime sponsor speaks to the bill.'",
        "'speaker_2': 'Councilmember Peterson, would you like to address this bill?'",
        "'speaker_1': 'Yes. And welcome back, Council President Gonzales. And thank you for leading with a moment of silence for all of those suffering from the COVID 19 emergency. So with this of course, with this public health emergency becoming an economic crisis to all levels of government need to provide immediate financial relief.'",
        "'speaker_1': 'And that includes relief from the utility bills that all households, small businesses and nonprofits face each month with necessary public health protocols resulting in restaurants, cafes, other social establishments closing. Many of our neighbors are seeing reduced paychecks or layoffs, and the last thing they need to worry about are bills for essentials like electricity, water and garbage removal'",
        "'speaker_1': '. So this legislation I'm sponsoring, council bill 119758 will waive all late fees for utility bills to provide additional relief for hundreds of thousands throughout Seattle during this crisis. In addition to thanking the mayor, I'd like to commend both Deborah Smith of Seattle City Light and Mummy Hara, the head of the Seattle Public Utilities.'",
        "'speaker_1': 'This effort builds upon a separate policy of no shutoffs, which is a humane policy that our utility departments put in place in large part due to the leadership of Councilmember Mosquito. I also want to thank Councilmember Ed Lewis for requesting an amendment that we will consider shortly that will make it crystal clear that nonprofit 501c3 organizations would'",
        "'speaker_1': 'also benefit from this legislation. This ordinance would waive late fees and interest charges from both Seattle City Light and Seattle Public Utilities until the mayor's emergency declaration is terminated, or August one, which whichever comes first. If the COVID 19 emergency lasts beyond August one, the Council can take additional action to extend this waiver.'",
        "'speaker_1': 'So I am prepared to move the substitute and I can explain that, but let me know if that's the appropriate time.'",
        "'speaker_2': 'I think what we're going to do first is I'm going to go ahead and suspend the rules to allow council central staff to address the council if they need to, and then we can go ahead and move it into substitution.'",
        "'speaker_2': 'In the last Council member Peters, do you believe that speaking to the substitution first would be would allow for a smoother conversation with council central staff.'",
        "'speaker_1': 'Yes. The substitute is is fairly simple in that it makes it. Yeah.'",
        "'speaker_2': 'Why don't you go ahead and go through the substitution first. Just describing it will will hold off on the moving of the substitution until after we've had an opportunity to hear from council central staff. So go ahead and speak to that substituted substitution.'",
        "'speaker_1': 'Sure. So version two, the substitute makes it easier to administer this ordinance by clarifying that the income for small businesses is based on the annual receipts from 2019. It also adds some, whereas clauses to underline the public health emergency that we are in.'",
        "'speaker_2': 'Great. That's a very simple, clearer explanation of that substitution. I appreciate that. I'm going to go ahead and suspend the rules now. So if there is no objection, the council rules will be suspended to have council central staff address the council.'",
        "'speaker_2': 'Hearing no objection. The rules are now suspended. And I would invite Eric and Brian to provide us with any additional information about this particular council bill for consideration by council members.'",
        "'speaker_1': 'Hello. This is the Carnegie on the council's central staff. Thank you, Consul President. At this point, I don't have anything that I think is more clear than has been already offered. I am on the line. It would be happy to answer any questions.'",
        "'speaker_1': 'I will add a separate from the bill. It's already been mentioned that this bill is a part of a package utility relief that the city is offering. Under the emergency, the utilities will not be shut off. Folks can apply for flexible payment plans and the utility discount program has been opened up more broadly for folks to self-certify'",
        "'speaker_1': 'and make it easier for people to get into that program. So I just wanted to take the moment to mention those aspects of utility relief the city is offering in tandem with the effects of this bill.'",
        "'speaker_2': 'Great. Brian, anything to to add?'",
        "'speaker_1': 'I don't have anything at this time. Thank you.'",
        "'speaker_2': 'Great. Thank you, Eric and Brian, for being on the line and for and for being available for questions. So I'm going to go ahead and in the same fashion as I did on item one, I'm going to roll call each of you to see if any of you have any questions.'",
        "'speaker_2': 'If you do not have questions, just say that you do not. And we'll go ahead and move on to considering the substituted version of the bill. So we'll start with Councilmember Herbold. Any questions for council central staff or the prime sponsor?'",
        "'speaker_0': 'Yes. Thank you for council central staff as it relates to the impact of the bill, both to the utilities in the reduced.'",
        "'speaker_2': 'Revenue in.'",
        "'speaker_0': 'Interest payments, as well as the reduction to the general fund, the estimate to the reduction to the general fund. Can you let us know whether or not these impacts are eligible for.'",
        "'speaker_2': 'Federal.'",
        "'speaker_0': 'Reimbursement?'",
        "'speaker_1': 'Councilmember, thank you for the question. This is Brian Goodnight. I believe we would have to check with the department about that. That's not information that we have at this time.'",
        "'speaker_0': 'I think it might be useful for all of these bills coming forward that have financial impacts that I would have thought to ask, I might have asked as it related to additional CDBG fund allocations in the future or.'",
        "'speaker_2': 'Reimbursement.'",
        "'speaker_0': 'Under the COVID 19 crisis. It might just be a good standard practice for all of these revenue impacts to ask CBO whether or not the actions that we're taking to that that have financial impacts are our actions that we can receive reimbursement for under COVID 19.'",
        "'speaker_1': 'Okay. Thank you, Councilmember. We will follow up with you on that.'",
        "'speaker_2': 'Any other questions, Councilmember Herbold? None. Thank you so much. Councilor Morales, any questions or comments on the bill for counsel, central staff or the prime sponsor?'",
        "'speaker_0': 'I don't have questions, but I second Councilmember Herbold request that we keep in mind anything that we could possibly get reimbursed for later. I'm sure CBO is doing that, but the recovery plan is also on my mind, and that's an important piece of it.'",
        "'speaker_2': 'Great. Thank you. Council Salon. Any questions for council central staff of the prime sponsor or comments about the bill?'",
        "'speaker_0': 'None. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Peterson, I know you've already spoken to the bill, but any additional questions for council central staff or comments that you'd like to make?'",
        "'speaker_1': 'No, thank you.'",
        "'speaker_2': 'Councilmember Suarez, same questions or comments.'",
        "'speaker_0': 'About the.'",
        "'speaker_2': 'Building. Thank you. Councilmember strauss, any questions or comments about the bill?'",
        "'speaker_1': 'Great Bill. No comments, little questions. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Lewis, any questions or comments about the bill?'",
        "'speaker_0': 'Not at this time.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'And Councilmember mosqueda, any questions or comments about the bill?'",
        "'speaker_0': 'Thank you. The president I first, I want to thank Councilmember Peterson for all of your work that you're doing for those who are on limited incomes already, and especially thinking about them in the post-COVID world as it relates to families and to businesses.'",
        "'speaker_0': 'Given the financial impact that this public health crisis could have. I want to also come in the folks at Seattle City Light, who we've been engaged with since Mesa last year. Thank you for the shout out early, Erica Peterson and a huge shout out to the folks at Seattle City Light for their creative thinking, not only with'",
        "'speaker_0': 'stopping the implementation of shut off notices, but to being really open and receptive to community feedback on how to improve a number of their communications. So I look forward to a future conversation in your committee. Councilmember Peterson, where I think our council colleagues will be able to hear a number of provisions that they've put into place.'",
        "'speaker_0': 'Waiving late fees is a really great first step. And some of the other things that they're looking at that we really appreciate is how to simplify the language to make sure that notifications are less scary and intimidating, especially in times like these.'",
        "'speaker_0': 'Ensure that we're using language that is inviting to understand the ways in which payments can be done. And I'm looking forward to a future conversation about basically debt forgiveness at some point, given some of the conversations that have happened in other municipalities.'",
        "'speaker_0': 'As I say that I also recognize we need to be looking at the revenue impacts. And in our conversations with the Budget Director of Venable, we've been asking a number of questions on each of the executive orders. I really appreciate the suggestions from our colleagues to make sure that that is presented as we look at the various'",
        "'speaker_0': 'executive orders. I will echo that call and look forward to the future conversations about how we not only address the crisis now, but make sure that we're budgeting for the future recovery and that the funding going, especially to those in the biggest crisis.'",
        "'speaker_0': 'And right now, I think that this is an excellent example of us following through on those priorities and values in this legislation. So thanks again to Councilmember Peterson and to the mayor's office for their good work on this.'",
        "'speaker_2': 'Thank you, Councilmember Mosqueda. That concludes the roll call on any questions or comments on the bill. I want to thank Council Central Staff Brian and Eric for being available for questions and for presentation. Thank you so much for being available.'",
        "'speaker_2': 'So I'm going to go ahead and hand it back to Councilmember Peterson, who needs to say the magic words, move the substitution formally.'",
        "'speaker_1': 'Yes, I'd like this is Councilmember Peterson. I move to amend council bill 119758 by substituting version two. Version two is, as I described earlier.'",
        "'speaker_2': 'And we need a second. Second back. Okay. It's been moved and seconded to substitute the bill. Councilmember Peterson has already addressed the substitution as the prime sponsor of that substitution. Are there any other comments on the substitute? Hearing none will the clerk call the roll on the substitute.'",
        "'speaker_0': 'Councilmember Strauss.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Herbold. I. Council member, Maurice. I. Council member, Lewis. Hi. Councilmember Morales. I. Councilmember Macheda. I. Councilmember Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council members want. I. President Gonzalez, I. Nine in favor, nine opposed.'",
        "'speaker_2': 'Thank you. The motion carries and the bill is amended. Are there any further comments on the bill as amended? Councilman Peterson, any additional comments?'",
        "'speaker_1': 'Well, I would like to discuss amendment number one, which was published along with the agenda.'",
        "'speaker_2': 'Excellent. So I will go ahead and hand it over to you to discuss and ultimately move amendment number one.'",
        "'speaker_1': 'Thank you, Council President. So amendment number one, which was published along with this agenda, would amend section two of the substitute. And what it does is and I want to thank Councilmember Andrew Lewis for raising this and working with me and central staff on this to get this done.'",
        "'speaker_1': 'It will clarify, make it crystal clear that nonprofits are also getting the waiver of the late fees. So what it does is in section two, it adds a subclause, saying customers that are nonprofit organizations as defined under Seattle Municipal Code Section 5.30.040. C and basically saying that's 501c3 organization.'",
        "'speaker_1': 'So what we would consider as a traditional mission driven nonprofit would be crystal clear that they are exempt or we were giving the fees for them to.'",
        "'speaker_2': 'Great. I'm going to go ahead, Casmir Peterson, and ask you to say the magic words and move this for consideration. And then we'll go ahead and open it up for questions or comments.'",
        "'speaker_1': 'Thank you. So I move to amend Council Bill 119758 Section two as presented on Amendment one on the agenda.'",
        "'speaker_0': 'Second.'",
        "'speaker_2': 'It's been moved and seconded to amend the bill. Councilmember Peterson has already spoken as to that amendment as the prime sponsor. Are there any comments or additional information for Council member consideration by Council central staff?'",
        "'speaker_1': 'Uh, President, this is Carnegie. I don't have anything to add.'",
        "'speaker_2': 'Great. And Brian, nothing bad.'",
        "'speaker_0': 'Nothing to add. Thank you.'",
        "'speaker_2': 'Great. Excellent. Okay. Are there any comments on the proposed amendment?'",
        "'speaker_1': 'Uh, that's Councilmember Lewis. Madam President, I have a couple of questions at the appropriate time.'",
        "'speaker_2': 'Yes. Council member Lewis. The floor is yours for questions.'",
        "'speaker_1': 'Oh, sorry. Well, I. I don't have any questions. I just have a comment.'",
        "'speaker_2': 'Great, Councilman.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'I just. I called for question. Sounds like nobody had any questions. I'm now going to hand it over to you to provide some comments on the bill, please.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'So I just want to first thank Councilmember Peterson for working with me on this and putting this amendment forward. Obviously, District seven has a massive concentration of arts organizations in the city. The arts are really, really reeling from the response from COVID 19, given that so many of our artistic events involve gatherings of large numbers of people'",
        "'speaker_1': '. They have just been absolutely slammed as an industry with a lot of workers who, as we know, unfortunately, do not receive the renumeration that they should for the cultural contributions that they make so they have a particularly vulnerable population.'",
        "'speaker_1': 'One thing that has come up in talking to arts organizations in my district is that utilities are an ongoing concern for them. Most of them are organized as mission driven nonprofits. So I just wanted to make sure that the opportunities that we are looking to create, to provide relief through this ordinance, be set up in such a'",
        "'speaker_1': 'way that those arts organizations could take advantage of this as well. So I want to thank him for his leadership. It's been good to work with him on this over the last couple of days, and I do hope that my colleagues will join me in supporting the amendment.'",
        "'speaker_2': 'Thank you, Councilmember Lewis, are there any other comments on the amendment? Hearing not. Oh, go ahead.'",
        "'speaker_0': 'Sorry. Council President. This is Tourism Council Member Locator. Um, I do have a question, and I hope it's appropriate to ask an hour of central staff. I can hold it for the overall bill if that's more appropriate.'",
        "'speaker_2': 'If it's a question about the overall bill, I'd ask you to hold that question for when I solicit comments and questions about the the bill as a whole.'",
        "'speaker_0': 'Wonderful. Thank you so much.'",
        "'speaker_2': 'Great. Okay. So we're are just voting on the amendment right now. So we'll if are there any other comments or questions about the amendment? A hearing on Will Clarke call the role on the amendment.'",
        "'speaker_0': 'Council member strauss.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council members are both. I. Councilmember suarez i. Councilmember Lewis. I. Councilmember Morales. I councilmember muscular. I. Councilmember Peterson.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember. So what? I. President Gonzalez.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Nine in favor, nine opposed.'",
        "'speaker_2': 'Thank you so much. The motion carries and the bill is amended. Are there any questions or comments on the bill as amended? And I believe, Councilman Mosquito, you indicated that you had a question.'",
        "'speaker_0': 'Thank you so much, council president. This may be a question for either the sponsor or the central staff. Our utility fees also waived for our nonprofit partners in in contracts with the Human Services Department and other city providers.'",
        "'speaker_1': 'Yes. Because they would be under this definition of the Seattle Municipal Code, the 501c threes. Thank you for clarifying that.'",
        "'speaker_0': 'Thank you so much, Councilmember Ms..'",
        "'speaker_2': 'Mascara. Any other questions or follow up?'",
        "'speaker_0': 'No, I just I think that that's an important reminder for folks. A lot of our service providers are really trying to stretch their dollars right now as they respond to the COVID crisis as well. So I think this is going to be very welcome for them.'",
        "'speaker_0': 'Um, I think that Plymouth and the City, for example, we saw their presentation in years past about the cost of utilities. So thank you for thank you for that clarification.'",
        "'speaker_2': 'Great. Thank you so much for the for the question. Are there any other comments or questions on the bill as amended? Harry Dunn. Will the clerk call on the passage of the bill as amended?'",
        "'speaker_0': 'Councilmember Strauss.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Herbold. I asked Councilmember Juarez. I. Council member, Lewis. By Councilmember Morales. I council member must get up. I don't remember Peterson. I never saw one. I President Gonzalez I nine in favor and then opposed.'",
        "'speaker_2': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? All right, folks, that was our last item of business on the agenda. And we have no other items to discuss for today.'",
        "'speaker_2': 'So that concludes our item of business on today's agenda. Our next meeting will be Monday, March 23rd at 2 p.m.. Council is now adjourned. Thank you all and be safe and healthy.'"
    ]
}