{
    "AN ORDINANCE relating to transportation; providing for the submission to the qualified electors of the City at an election to be held on November 3, 2015, a proposition authorizing the City to levy regular property taxes for up to nine years in excess of the limitation on levies in Chapter 84.55 RCW for the purpose of providing City facilities and services, including transportation improvements, both capital and operating, with possible debt financing; creating a new oversight committee; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'The bill passes and the chair will sign it. The report of the Select Committee on Transportation Funding. Please read item one.'",
        "'speaker_5': 'The Report of the Select Committee on Transportation Funding Agenda. Item one Council Bill 118402 relating to transportation providing for the submission to the qualified electors of the city at an election to be held on November 3rd, 2015, a proposition authorizing the city to levy regular property taxes for up to nine years in excess of the limitation on'",
        "'speaker_5': 'levies in Chapter 84.55 RTW for the purpose of providing city facilities and services, including transportation improvements, both capital and operating with possible debt financing. Creating a new oversight committee. And ratifying and confirming certain prior acts. The committee recommends the bill pass as amended.'",
        "'speaker_1': 'Thank you, Councilmember Rasmussen.'",
        "'speaker_6': 'Thank you very much. First of all, just an item of bookkeeping or formalities. I have a substitute version to offer and this would be the number for version number four. It combines several grammatical and legal corrections that have been recommended to be made by the law department, and that it also includes Councilmember Harrell's revision to Section eight'",
        "'speaker_6': ', which is language concerning the racial equity toolkit analysis in the event that levee funds are used for streetcars. I also include clarifying that as to the suggested ballot title, we saw that the original version that had been submitted by the executive was unintentionally over the 75 maximum word limit.'",
        "'speaker_6': 'So therefore, I move to substitute version four for the version that we voted on last week in the committee meeting.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'It's moved in. Second, and that we substitute version four for Council Bill 118402. Are there any questions or comments all in favor of the amendment vote? I oppose vote no. The amendment is unanimously adopted. We now have version four in front of us.'",
        "'speaker_6': 'Thank you. First of all, Councilmember, thank you for your participation in the five meetings that we had of our Select Committee on Transportation Funding. We've had strong and very involved participation from each of you as well as from the public.'",
        "'speaker_6': 'And that's understandable because the number one issue, according to polls that we've seen of this region, is transportation through this measure. And to others that have recently been approved by Seattle, voters were responding to public concerns about safety for pedestrians and bicyclists, to frustration about the condition of our roads and bridges and frustration with traffic congestion.'",
        "'speaker_6': 'Last year, Kane County voters rejected a ballot measure to increase metro service throughout the county. But in response, the city placed a similar measure on our fourth ballot, and that was approved by 62% of Seattle voters. We are now funding hundreds of thousands of hours of transit service in Seattle, including more weekend and late night service that'",
        "'speaker_6': 'especially benefits transit dependent students and working men and women. But we have to do more. And this is a third ballot measure in four years to improve our transportation system. Voters approved last fall, as I mentioned, the transit measure, and they also voted to approve in 2012 improving transportation safety by funding the replacement of our waterfront seawall'",
        "'speaker_6': '. Now, we'll ask the voters again to approve a multipurpose levee to continue the work of the expiring Bridging the Gap transportation levy. If this is approved by the voters, $930 million would be invested over nine years to meet three fundamental needs.'",
        "'speaker_6': 'First, the largest amount at $420 million or 45% of the levy is for maintenance and repair of our bridges and streets. This will significantly help to pay for repaving major roads in every every area of our city from North 130th Street to south west Roxbury Street.'",
        "'speaker_6': '$140 million will go for seismic upgrades to 16 of our most vulnerable bridges and to replace the Fairview Avenue Bridge and eliminate the backlog of spot repairs. Planning and design funding is included for replacement of the Ballard and Magnolia Bridges, which one of the speakers spoke to during our public comment person?'",
        "'speaker_6': 'While those bridges are safe, they do not meet current standards, and each of those bridges is roughly estimated to cost between three and $450 million. Other funding sources will have to be found for those bridges. Secondly, the largest amount of funding after maintenance repair is to go to congestion relief in order for our expanded bus service to'",
        "'speaker_6': 'be more reliable and to gain ridership. We have to make our transportation system work more efficiently. For that reason, major investments will be made to improve the operation of transit along seven major transit corridors and identify. In our transit masterplan.'",
        "'speaker_6': 'Routes for transit throughout the city will be improved, including Ridgeway, Rainier Avenue, South and Jackson Street. Pardon me. Just changing pages. Market and 45th Roosevelt, Northgate, Madison and 23rd Avenue investments are planned to improve pedestrian access to the new light rail stations included in the north gate, bike and pedestrian bridge, the accessible Mount Baker Station Plan and'",
        "'speaker_6': 'the new Graham Street Station. Freight investments are essential and funding is included to rebuild East Marginal Bay and to match funding from the state for the line to street overpass and for spot improvements in manufacturing and industrial areas and for general traffic.'",
        "'speaker_6': 'Funding is included for a new traffic signal timing equipment and for intelligent transportation systems and more traffic signs and markings. And then the third major funding area in this package is for a safe route for all. The amount proposed for this category is $207 million or 22% of the levy.'",
        "'speaker_6': 'This category includes several schools, with the levy funding a project for every public school that is 90 schools and it prioritizes low income. Elementary schools across the city will increase funding to implement Vision Zero, and this includes 2215 corridors such as Rainier Avenue, 35th Avenue, Southwest and Lake City Way.'",
        "'speaker_6': 'Each of those are included in this to improve safety. There will be funding for 150 new blocks of sidewalks and repair of 225 blocks of sidewalks, 50 miles of new protected bike lanes and 60 miles of neighborhood greenways.'",
        "'speaker_6': 'And one half of our bicycle master plan will be able to be funded out of this levy. And with this funding, we'll see more productive, protected bike lanes downtown in the University District and our neighborhood greenways. Will ensure accountability and transparency in how the levy dollars are spent.'",
        "'speaker_6': 'We did that with an expiring bridging the gap measure and this will be done again. There will be a citizen's oversight committee and the Council will add requirements and has added requirements for implementing minimum spending levels in each category.'",
        "'speaker_6': 'And we're ensuring general fund contributions to our Department of Transportation are not reduced of the Mayor and the Council are committed to equity and the distribution of the funds of this levy. And the Department of Transportation presented to us an equity toolkit analysis for the levy.'",
        "'speaker_6': 'We saw that investments will be spread citywide and we will be investing substantially in areas and neighborhoods that have been overlooked in the past for transportation improvements. For example, a major safety project is planned for Rainier Avenue, and North Seattle will see many more sidewalks built and Delbridge will have significant investments in a transit corridor.'",
        "'speaker_6': 'And $10 million will be invested in South Park for drainage, repaving and sidewalk projects. While this levy is between 11 and $12 a month more for the average household than the current bridging the gap measure, I think it's important to note that we have a $1.8 billion maintenance backlog and more people than ever are traveling to Seattle'",
        "'speaker_6': 'or living in Seattle. We not only have to repair what we have, but people want improvements made to how the system works. Now people are frustrated with congestion. They want more sidewalks, more reliable bus service, and safer routes to schools and safer for for bicyclists and better free mobility.'",
        "'speaker_6': 'We must continue the successful work that is being funded nowadays or today by bridging the gap. And we have to make these investments. This is the mayor and the city council's answer to the needs that we're hearing from the public.'",
        "'speaker_6': 'But this only meets part of the need. Council members, last week, all of you voted on this at our last meeting, and the recommendation of the select committee is to pass this measure.'",
        "'speaker_1': 'Thank you. Questions or comments? Councilmember Lakota.'",
        "'speaker_3': 'Thank you for that summary, Councilman Rasmussen. I do believe that has been a number of improvements in the legislation. You made some amendments in Council. President Burgess made some idea, and I know other council members did as well.'",
        "'speaker_3': 'The categories have been tightened up and reporting requirements also have been, well, I would say, identified with periodic reports back to the Council of Government. I had two concerns. I still have them. One is that the mechanism we're using, I don't believe, is the fairest distribution, the financial burden that could be distributed across our residents or those'",
        "'speaker_3': 'people who will be gaining the advantage of this of this legislation. The question is, who will who will pay? I think that many of the renters who unfortunately will probably be impacted, as is the costs are flow through to them.'",
        "'speaker_3': 'And we each live in our own sort of world of who we hear from. I run through a number of of my colleagues in city government who say that they don't know anyone opposed to it. I seem to have gotten the emails that they did with people who are not necessarily all that excited about it and oppose'",
        "'speaker_3': 'it. I know that I can afford it and I believe in it is what they what's in the what's in the package. It's without a doubt needed in the city. I just don't know how my neighbors are going to file on this issue.'",
        "'speaker_3': 'And part of the reason is the size, as was pointed out by Councilman Rasmussen, again, this is quite a bit larger than bridging the gap, which replaces I think it's about two thirds larger. Bridging the gap past that 53% was on the lower end of the scale of what levees generally pass in the city.'",
        "'speaker_3': 'So I think there's some risk here. I think some some significant risk that it may not pass. And if it doesn't, more than a quarter, perhaps as much as a third of our budget in transportation will be lost for at least a year, if not two years.'",
        "'speaker_3': 'But I voted it out of committee. I believe that let the people decide on the ballot. And I hope that whatever the decision is, I hope we can move forward with the improvements that we need to make in this city, particularly in the area of fighting congestion and making a road safer for those who drive who like'",
        "'speaker_3': 'bikes or pedestrians.'",
        "'speaker_1': 'Thank you. Councilmember Lucchino, we'll look forward to having you on the campaign trail with us. Councilmember Bagshaw, thank you.'",
        "'speaker_0': 'I want to, first of all, extend my appreciation to all who worked on it, all of you who have been here encouraging us and moving us forward. I know that this is a big package, and I frankly am someone who's going to support this from the top to the bottom because of the changes that we have made'",
        "'speaker_0': '. And Councilmember Rasmussen, thank you for your leadership in reframing the kinds of investments we're going to make. First, we're going to be maintaining what we already have. And I think every taxpayer knows that that's got to be our first priority.'",
        "'speaker_0': 'And secondly, we're going to make sure that our investments reduce congestion wherever I go. People say to me, the worst problem that the city has is congestion. And unless we can reduce that and accommodate all the people that are coming, we're going to be in significant trouble.'",
        "'speaker_0': 'And I know that this package is going to be designed to do that. And thirdly, we're really promoting safety for all. I know that you have all heard that I am the poster child for Cascade bicycle clubs all ages and abilities and riding my bike again.'",
        "'speaker_0': 'And I ride all over the city. I want to have the protected bike lanes so I can get all over the city safely because right now I'm playing dodge a car and dodge a bus after the the lanes that we already have just end.'",
        "'speaker_0': 'So I am very much supporting this package, both as somebody who drives a car, occasionally rides a bus, rides my bike and walks. And I really appreciate all the work work that's gone into this. And thank you for bringing up Magnolia Bridge.'",
        "'speaker_0': 'That's something that I hear from neighbors in the north. And frequently we do know that the cost of replacing Magnolia Bridge is about half the size of this particular package. So it cannot be the resource that we use.'",
        "'speaker_0': 'But there are other resources. We do have money in here to do planning for Ballard Bridge and Magnolia, and I'm very pleased with that. But also, I want to encourage the state legislature, if they haven't already finished their work today, to make sure we have a transportation package that addresses the $15 billion that we need to have'",
        "'speaker_0': 'our light rail extended and to make sure that we've got resources so that we in the city and region can take care of what we have already got. And again, recognizing that freight needs to get around, that we need a network, we can't separate this from cars or busses or pedestrians or bikes.'",
        "'speaker_0': 'Our trucks we all need to get around. We've got 100,000 more people coming and a lot more employers. This is a region that's got to work. So I want to say thank you. I will be supporting this. And I also want to talk to you, the two women that stood up.'",
        "'speaker_0': 'I want to understand what your concerns are and how we can make sure that we listen to you and bring your concerns to the campaign. So please talk to me. Thank you very much.'",
        "'speaker_1': 'So I'll just close by saying that I too appreciate the work of the state, especially in all of the detailed analysis and recommendations that the plan is very specific and I think context is very important and that is the typical Seattle homeowner will pay on average 11 or $12 more per month over what they're paying now for'",
        "'speaker_1': 'bridging the gap. If this measure passes, some will pay less and some will pay much more. Especially commercial property owners are going to pay a lot more than 11 or $12 a month. So I think the burden of paying for improvements in our transportation system is is equitably distributed.'",
        "'speaker_1': 'Councilmember Rasmussen, do you want to close our discussion.'",
        "'speaker_6': 'Simply to say thank you to all of my colleagues on the Council for working so hard on this measure? We've taken it very seriously. We know that we have a significant responsibility to maintain our our transportation network and to address the concerns that we're hearing from the public also about congestion reduction and to provide safe routes for'",
        "'speaker_6': 'all. So specifically in terms of who I would like to thank, in addition to my colleagues on the council, the advocates from the public, the community advocates said neighborhood greenway organizations, there are many of them from many neighborhoods, our bicycle advisory board, our pedestrian advocates, feet first and Transportation Choices Coalition and also members of the freight community'",
        "'speaker_6': ', including our Freight Advisory Board. All of them have helped to inform this package long before it came to the City Council. We've only heard most recently from them, but there was a great deal of community outreach done by the Mayor's Office and the Department of Transportation for many months before this package was even brought to the City'",
        "'speaker_6': 'Council. Thank you again to the community advocates for your work to help shape this package then and then now the one that's before us today. Also, I have to thank the mayor and his staff for working with the community and working with the Department of Transportation to develop this package, in particular, Andrew Hastings of the mayor's office'",
        "'speaker_6': '. And then, of course, we wouldn't have this package assembled, as it is with some specificity and so much details without the work of the Department of Transportation, particularly Sky Crew Blake and his staff, including Hannah Mackintosh, Chris Ruffini, Doris Costa, Charles Schwab.'",
        "'speaker_6': 'Our Budget Office crunched the numbers a number of times for many of us, including when we looked at alternative funding sources. And then Nobel, who we know and have a great deal of confidence in, was very helpful on that, including his staff, Kristy Parker, Saroja Reddy and David Harris, and finally our council staff that worked on our'",
        "'speaker_6': 'behalf to ensure that this package reflected all of our priorities and the priorities that we were hearing from the public, and that includes Dan Heder, Calvin Chao and Peter Lindsay, and then Anthony Auriemma of my staff, who really kept us moving forward at the council.'",
        "'speaker_6': 'And I very much appreciate his work as well. So thank you colleagues and staff and the public for all of your work. And now we will take this out to the public. We'll work with organizations like the League of Women Voters to ensure that all of their questions are answered.'",
        "'speaker_6': 'Thank you again.'",
        "'speaker_1': 'Thank you. The clerk will call the roll on passage of Council Bill 118402 version four got an.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Harrill Right.'",
        "'speaker_2': 'Lakota Guy O'Brien Hi. Rasmussen I want.'",
        "'speaker_0': 'My.'",
        "'speaker_2': 'Back. I am President. Burgess My agent favored and opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. The report of the Transportation Committee. Please read item two.'"
    ],
    "AN ORDINANCE granting SDC Creative LLC permission to maintain and operate a skybridge over and across South Orcas Street, east of 5th Avenue South, for a ten-year term, renewable for two successive ten-year terms; specifying the conditions under which this permit is granted; providing for the acceptance of the permit and conditions; and ratifying and confirming certain prior acts.": [
        "'speaker_5': 'The report of the Transportation Committee Agenda Item to Council Bill 118421 Granting SDC Creative LLC permission to maintain and operate its Great SkyBridge over and across South Orchid Street, east of Fifth Avenue, south for a ten year term, renewable 4 to 2 successive ten year terms specifying the conditions under which this permit is granted, providing for the'",
        "'speaker_5': 'acceptance of the permit and conditions, and ratifying and confirming certain prior acts. The committee recommends a bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Rasmussen.'",
        "'speaker_6': 'Thank you. This is a new term permit for an existing SkyBridge at the Seattle Design Center in the Georgetown neighborhood. The SkyBridge is over South Orchid Street, just east of Fifth Avenue South. It was last authorized by ordinance in 1982, and the term permit is for ten years with a renewable option of 210 year terms.'",
        "'speaker_6': 'The public benefits that are required, in addition to paying an annual fee of $4,000, include tree replacement and enhanced landscaping on South Orca Street installed it wayfinding will have to be improved and installed and neighborhood signs will have to be placed in the area.'",
        "'speaker_6': 'And then a new bike rack will also be required to be installed and the committee recommends approval.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_0': 'Gordon High.'",
        "'speaker_2': 'Peril. The Carter I. O'Brien. I press myself. I want I lecture. I am President Burgess agent favorite and opposed.'"
    ],
    "Petition of GID Development Group and the Seattle Department of Parks and Recreation for the vacation of the alley between Westlake Avenue, 9th Avenue, and Lenora Street in Block 24, Heirs of Sarah A. Bell's Second Addition.": [
        "'speaker_1': 'The bill passes and the chair will sign it. Please read item three.'",
        "'speaker_5': 'Agenda item three. Clerk file 313843. Petition of GID Development Group and the Seattle Department of Parks and Recreation for the vacation of the alley between Lake Avenue, Ninth Avenue and Leonora Street in BLOCK 24. Heirs of Sarah Arpels second edition, the committee recommends for council to grant the petition as conditioned.'",
        "'speaker_1': 'Thank you, Councilmember Rasmussen.'",
        "'speaker_6': 'Thank you. This would grant conditional approval of an early vacation in BLOCK 24 is also sometimes known as the Enterprise car rental site at Ninth and Leonora. It's a bit unusual in that the application for the vacation has been made jointly between the private developer guide development and our Seattle Parks Department.'",
        "'speaker_6': 'Each of the petitioners would take about half of the 2400 square foot alley in the block. The developer private developer guide would take one half of the alley to complete a 400 unit, 400 foot tall residential building on the north side of the block.'",
        "'speaker_6': 'And the park department would take the other half of the alley to complete a much needed new 10,000 square foot park on the south side of the lot, alongside Westlake Avenue and Leonora Street. It would feature an open lawn and an activity area, place, structure, hillclimb and seating for gathering picnics and general leisure.'",
        "'speaker_6': 'The Disney Triangle Urban Center Village is being heavily developed, as you know, and more office space will be needed and welcome in this neighborhood all along. Westlake. While the two projects are separate, Jedi and the Parks Department are working closely to design and coordinate the development of this public park.'",
        "'speaker_6': 'Without a vacation, the opportunity for a complimentary design between the two groups would be lost and the alley would continue to be used for vehicular traffic and would actually be a detriment and a barrier between the residential tower and the new park.'",
        "'speaker_6': 'With the early vacation, there is an opportunity for many more amenities to be expanded on the block and better public use and public access to the park.'",
        "'speaker_1': 'Thank you. Questions or comments? Councilmember BENSHOFF.'",
        "'speaker_0': 'Just one. Councilmember Rasmussen, the last piece of legislation you mentioned that more bicycle racks were going to be added at the location. And I didn't hear you say that this time, but I would like to encourage us to do that where possible.'",
        "'speaker_0': 'I'm finding that more often than not I am locking my bike to a tree downtown, and if we're really encouraging people to use our spaces, a few more bicycle racks around would be very helpful.'",
        "'speaker_6': 'Thank you. I believe the the ballot measure that we just approved going to the voters will actually include funding for many, many more bicycle.'",
        "'speaker_1': 'Bicycle racks. Councilmember Gordon.'",
        "'speaker_0': 'I just want to say that this is really a parks development. Much more in a lot of respects than a transportation project. Aside from the fact that it was necessary to do grant vacation of the alley.'",
        "'speaker_3': 'In order to.'",
        "'speaker_0': 'Do it, but it's going to be harder and harder to get the park spaces downtown. And I think it's really the design is exciting and it's.'",
        "'speaker_3': 'Going to be really a great.'",
        "'speaker_0': 'Amenity for the area, which is very heavily now developed. And it will be wonderful to have.'",
        "'speaker_3': 'This little green.'",
        "'speaker_0': 'Space in this park right on that spot. When you think about what is.'",
        "'speaker_3': 'There now.'",
        "'speaker_0': 'An alley and a car rental park part, a development that has a whole lot of cars parked there. Think about how you're going to have green grass and you're going to have an opportunity to sit out on the sidewalk.'",
        "'speaker_0': 'It will be quite, quite, quite a good amenity and very pleased that we can have that kind of public, private cooperation.'",
        "'speaker_1': 'Thank you. Please call the roll. Excuse me. This is a clerk file, so we will. Those in favor of granting the petition as conditioned vote I those opposed vote no. The motion carries the request is granted as condition of the chair will sign the conditions of the City Council Report of the Energy Committee.'",
        "'speaker_1': 'Please read item for.'"
    ],
    "AN ORDINANCE relating to the City Light Department; granting authority to accept and execute revenue and funding source agreements to support the operation and services of the Lighting Design Lab; and ratifying and confirming certain prior acts.": [
        "'speaker_5': 'The Report of the Energy Committee Agenda Item for Council Bill 118399 relating to the City Light Department granting authority to accept and execute revenue and funding source agreements to support the operation and services of the lighting design lab and ratifying and confirming certain prior acts.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you, Councilmember one.'",
        "'speaker_0': 'Thank you, President Burgess. The Lighting Design Lab is an environmental project of Seattle City Life to promote the use of energy efficient lighting. They periodically accept grants in order to help finance their work, and every time they accept such a grant, they need council approval.'",
        "'speaker_0': 'And this ordinance would give city light the authority to accept those grants without a council in every instance. And the Energy Committee unanimously recommends that the Council pass this bill.'",
        "'speaker_1': 'Questions or comments. Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Gordon Harrell.'",
        "'speaker_3': 'All right.'",
        "'speaker_2': 'O'Brien. Rasmussen.'",
        "'speaker_6': 'All right.'",
        "'speaker_2': 'So aren't.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Back I and President Burgess eight in favor and and opposed.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; authorizing the Director of Seattle Public Utilities to accept the grant of a non-exclusive easement within the West Waterway of the Duwamish River from the Washington State Department of Natural Resources for a City-owned sanitary sewer line.": [
        "'speaker_1': 'The bill passes and the chair will sign it. The report of the Seattle Public Utilities and Neighborhoods Committee. Please read item five.'",
        "'speaker_5': 'The Report of the Seattle Public Utilities and Neighborhoods Committee Agenda Item five Council Bill 118395 relating to Seattle Public Utilities authorizing the Director of Seattle Public Utilities to accept the grant of a non-exclusive easement within the West Waterway of the dual mish river from the Washington State Department of Natural Resources for a city owned sanitary sewer line'",
        "'speaker_5': '. The committee recommends a bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_0': 'Thank you. This council bill authorizes Seattle Public Utilities to accept an easement from the Washington Department of Natural Resources. It will be for a new sewer line in the Duwamish West Waterway. We previously had a sewer line in this location and the original lease was in perpetuity.'",
        "'speaker_0': 'But in 2009, our sewer line was ruptured by a pile driving operation. We had emergency permission granted by Department of Natural Resources to repair and to install a replacement sewer line and now a new location. And we've got a 16 inch sewer pipe.'",
        "'speaker_0': 'It's providing a critical link from the north part of west Seattle. And this will be a 30 year, 20 foot wide non-exclusive easement. And our committee recommends this legislation be adopted.'",
        "'speaker_1': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Gordon Harrell. All right. The Carter O'Brien. I Rasmussen. All right. I want back shot. I am president burgess. Eight in favor. Nine opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read item six.'",
        "'speaker_5': 'Agenda item six Council Bill 118416. Relating to wastewater services of Seattle Public Utilities and Amending Subsections 21.2 8.04 OBE and 21.7 6.0 40a of the Seattle Municipal Code to adjust the wastewater volume rate and adjust credits to low income wastewater customers.'",
        "'speaker_5': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Would you also read in Council Bill 118417?'",
        "'speaker_5': 'Yes. Agenda item number seven Council Bill 118417. Relating to drainage services of Seattle Public Utilities amending sections 21.3 3.010, 21.3 3.030 and 21.33040. And Subsections 21.7 6.0 40a of the Seattle Municipal Code to update definitions, adjust drainage rates and provide clarification regarding assignment of parcels to rate categories.'",
        "'speaker_5': 'Define additional conditions under which rate credits may be applicable and revised credits to low income drainage customers. The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_0': 'Thank you very much. The Seattle Public Utilities and Neighborhood Committee spent two meetings this past month, plus multiple hours discussing and really digging into the drainage and wastewater rates. You will remember that we passed a strategic plan last year.'",
        "'speaker_0': 'I want to say thank you to Councilmember Harrell and council members who want for participating in this and asking some tough questions to Seattle Public Utilities. Under this rate change, customers are going to experience an increase in their wastewater fees, which are billed as part of ESPN's combined utility bill and drainage fees.'",
        "'speaker_0': 'And also they will be billed via King County's property tax system. The typical Seattle single family residential cover customer would have a combined increase of 4.6% over 2016 and 2018. Their monthly bills. They will be averaging about $11.60 per month more in 2018 than they are in 2015.'",
        "'speaker_0': 'And under the strategic plan that we approved last last year, increases in SP rates combined were going to be a little bit lower. But our overall drainage and wastewater rates are higher than were anticipated for a number of reasons.'",
        "'speaker_0': 'The first was an unexpected factor that the Port of Seattle made a decision to form their own stormwater utility rate or utility starting in 2016, which will result in a loss of about $4 million per year to Seattle Public Utilities and revenue.'",
        "'speaker_0': 'And then additionally, we're going to increase our financing of certain capital projects, particularly the one that is going to be a joint project with King County along Balad, and that's called the West Ship Canal Project. What that essentially is going to do is create a linear reservoir for those people that are in the north end of Seattle'",
        "'speaker_0': '. And it is a CSO project that we were anticipating. We were anticipating it a couple of years from now. So that's why this is going to come in earlier than anticipated. But the drainage rates are not going to overall as that.'",
        "'speaker_3': 'Would.'",
        "'speaker_0': 'Be too much of an imposition on our ratepayers because our drinking water rates were actually reduced this year. So the change is going to result, as I mentioned, and slightly greater customer equity bills. But we recommend that we proceed and adopt the rates.'",
        "'speaker_0': 'And I also want to say that our utility discount program, something that we are working very closely on, is going to make a difference for those with low incomes. And I'm working with Seattle Public Utilities and Seattle City Light and our Human Services Department to coordinated this as much as possible for low income residents so that they'",
        "'speaker_0': 'can also work with the King County and our Orca Lift project. So we're going to coordinate as many of these low income programs as possible, so we recommend this proceed.'",
        "'speaker_1': 'Thank you. Questions or comments on either item six or item seven? Council members who want.'",
        "'speaker_0': 'So as I've mentioned in the previous instances when rate increases have come before council, I think it is important to look at the rate increases even though they may appear small in the context of the overall tax burden.'",
        "'speaker_0': 'In Washington state, in a state that has the most regressive tax system in the entire nation, which means that working class people pay a far greater percentage of their income in taxes, and that is outside of the fees that they pay for the raiser.'",
        "'speaker_0': 'They pay for services than the richest. And in that context, even small utility rate increases are unacceptable when there are alternative ways that the council could explore to cover the costs of operation which are indeed necessary. I mean, these these are unnecessary cost that our utilities have to account for.'",
        "'speaker_0': 'But we should find progressive measures to to account for them. For example, in Seattle City, late in the work in the Energy Committee, we found several ways to reexamine cost allocation that would have resulted in the rates for regular working class people to go down rather than up.'",
        "'speaker_0': 'However, that was not at that time supported by the majority of the committee. And I would encourage members of the Energy Committee to support such a revised cost allocation mechanism. And I think the council members responsible for the Espoo, Seattle Public Utilities, myself included, should similarly look for different ways to allocate costs so that big business and'",
        "'speaker_0': 'the rich pay their fair share. So both for this and the next point, point number seven on the agenda, I will be voting no. But as of late, Councilmember Shino, I'm really excited to be able to work on the utility discount program that you mentioned and I think we should definitely go forward on that.'",
        "'speaker_0': 'And as we've said before, rather than reinvent the wheel, see what has worked at the county level and see if we can use that for the City Council and Energy Committee and the city light and public utility customers as well.'",
        "'speaker_1': 'Thank you. Any other comments? Well vote first on item six Council Bill 118416. Please call the roll on the passage of the bill.'",
        "'speaker_0': 'GORDON All right.'",
        "'speaker_3': 'HARRELL All right.'",
        "'speaker_2': 'The Carter.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'O'BRIEN All right.'",
        "'speaker_2': 'RASMUSSEN All right. So want.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Back shot at President BURGESS High seven in favor. One opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Item number seven Council Bill 118417. Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Gordon. But.'",
        "'speaker_6': 'Harrill I.'",
        "'speaker_2': 'Look at it.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'O'Brien All right. Christensen I so want.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Back shot. I am President Burgess.'",
        "'speaker_3': 'High.'",
        "'speaker_2': 'Seven in favor. One opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Please read items eight through 12.'",
        "'speaker_5': 'Agenda items eight through 12 appointments 57, one, 13 and 80 for the appointments of Rachel Kitagawa Joshi as member Pike Place Market Historical Commission for term of confirmation to December 1st, 2017 and the appointments of RICO, Kieran Dongo and Gloria Skog as members Pike Place Market Preservation and Development Authority Council for term of Confirmation to June 30th'",
        "'speaker_5': ', 2018. An Agenda Items 11 and 12 Appointments 84 and 86. The Appointments and the appointment and reappointment of Catherine H. Kraft and Mary McCumber as members. Historic Seattle Preservation and Development Authority Council. For a term of confirmation to November 30th, 2018, the committee recommends the appointments be confirmed.'",
        "'speaker_1': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_0': 'Yes, thank you very much. The first one with Rachel kid in our host today. She is an architect, loves working with the diverse community and has a strong commitment to preserving the market. And Rachel was with us this past Tuesday and we're recommending her appointment to the Pike Place Market Historical Commission and RICO Kieran Dongo is already'",
        "'speaker_0': 'on the Pike Place Market PDA. It's a reappointment. He's also an architect with extensive experience and knowledge in the adaptive reuse of existing buildings, and he has worked with community organizations to make a positive impact in their neighborhoods as well.'",
        "'speaker_0': 'This is his second term. Glorious Couch has been recommended for the Pike Place Market PDA as well. And she's been involved in the market community. She currently serves as the chair of Finance and Asset Management Committee for the PDA.'",
        "'speaker_0': 'And this will be her fourth term. Catherine Kraft is being recommended for historic Seattle PDA. She has a background in architectural history and cultural resources. She goes by Katie and she has extensive experience working with citizen design review boards and has been helpful on the current council.'",
        "'speaker_0': 'And this is her second term and Mary McCumber gets the prize here. We're recommending her going back to the historic Seattle P.D. She has served 18 years on the PDA. She was executive director of the Puget Sound Regional Council from 92 to 2003 and has been a long time supporter of historic Seattle.'",
        "'speaker_0': 'So this is her fifth term, and we recommend the appointment and reappointment of these five people.'",
        "'speaker_1': 'Thank you. Questions or comments? All those in favor of confirming the appointments listed in agenda items eight through 12 vote. I oppose vote no. The appointments are unanimously confirmed. The adoption of other resolutions. Please read item 13.'",
        "'speaker_5': 'Agenda Item 13. Adoption of the resolutions. Resolution 31597. Reaffirming the city's commitment to update the comprehensive plan in 2015, introduced on June 29, 2015.'",
        "'speaker_1': 'Thank you, Councilmember O'Brien.'",
        "'speaker_6': 'Thank you. So we discussed this a little bit. The briefing. This is a little unusual because it's coming straight to the full council instead of going to committee. And I just want to take a second to explain why that is.'",
        "'speaker_6': 'The city is required by state law to update its comprehensive plan periodically, and that deadline is June 30th. We had intended to update it by.'",
        "'speaker_1': 'June 30th, but when we filed to do environmental.'",
        "'speaker_6': 'Review on these on the proposed changes, there was a suit filed which has kicked this up to the hearing. Examiner Which means we will not be able to meet the June 30th deadline. And the state had requested that jurisdictions that were not able to do this to take some action to signify their intent, to meet the to'",
        "'speaker_6': 'complete the upgrades by the end of the calendar year. This resolution identifies the steps we had taken to have this done.'",
        "'speaker_1': 'By June 30th and also the.'",
        "'speaker_6': 'Revised timeline now that this is going to the hearing examiner.'",
        "'speaker_1': 'On how we will complete this by December.'",
        "'speaker_6': '31st. I'm also want to just clarify that there are a couple of major updates to the comprehensive plan. One is a set of requirements that are required by the state that's.'",
        "'speaker_1': 'Largely around.'",
        "'speaker_6': 'Enacting new growth targets for jobs and housing in the city, which this will be done.'",
        "'speaker_3': 'By the end of the year.'",
        "'speaker_6': 'The city chooses to go beyond just those simple targets and do a comprehensive planning process, which this time around is being referred to as Seattle 2035. There's currently a draft environmental impact statement out.'",
        "'speaker_1': 'On that process with a final environmental impact.'",
        "'speaker_6': 'Statement due at the end of this year and a longer process that will proceed into 2016. So this year, because of this requirement, the Council is dividing that major update of the comprehensive plan into two pieces, the Seattle 2035.'",
        "'speaker_1': 'Process.'",
        "'speaker_6': 'Which will be done next year, and the specific requirements required by the state which were intended to be done in the next couple of days, but are set to be done.'",
        "'speaker_1': 'By December 31st. Thank you. Any questions or comments?'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'So I would move adoption of resolution 31597. Second, it's moved in second. And that the resolution be adopted. All those in favor Vote I II opposed Vote No. The resolution is unanimously adopted and the chair will sign it.'",
        "'speaker_1': 'Is there any other business to come before the council? We will reconvene at 315 as the Seattle Parks District Board in about 14 minutes. They were adjourned.'"
    ]
}