{
    "AN ORDINANCE relating to land use and zoning; amending the title of Chapter 23.52, Subchapter I, of the Seattle Municipal Code (SMC); amending Sections 23.52.004 and 23.52.008 of the SMC; and repealing Section 23.52.002 of the SMC, to implement the Comprehensive Plan adopted level of service standard.": [
        "'speaker_3': 'Every part of the planning land use and zoning committee agenda item one Council 119 1388 relating to land use and zoning in many the title of chapter 23.52 Subchapter One The Sentences for code and in many sections 23.50 2.004 and .008 of the CMC and Repealing Section 23.50 2.002 of the CMC to implement the Comprehensive Plan Adopted'",
        "'speaker_3': 'Level of service standard. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Being very much transparent.'",
        "'speaker_1': 'Johnson thinks we in 2016 adopted an update to our comprehensive plan and within that we adopted a level of service standard that relies on what the industry would call a multimodal level of service. It sets a series of targets for reducing the number of folks that are driving alone, living in our neighborhoods throughout the city, and set'",
        "'speaker_1': 'some goals for those targets. The action that we contemplate today would implement those level of service standards in neighborhoods throughout the city and do it in a way that would require residential uses with more than 30 unique 30 dwelling units, nonresidential uses with greater than 4000 square feet of gross floor area or nonresidential uses, and industrial zones'",
        "'speaker_1': 'that have more than more than 30,000 square feet of gross floor area. To start to propose ideas for folks to be able to get to and around those uses without needing to have a car. Those kinds of ideas will take effect in an associated joint director's role, but it could include things like subsidizing transit passes, providing sidewalk'",
        "'speaker_1': 'improvements, or limiting the amount of parking that's provided on site. It also specifies thresholds that some projects are required to go through impact studies related to transportation that are more projects will be going through this than current. We are required to do so under the State Environmental Policy Act.'",
        "'speaker_1': 'So a complicated technical piece of legislation, but one with an under arching objective of trying to ask developers to pay more to the city, to allow for folks that are living or working in their units to be able to get around without needing to have a car.'",
        "'speaker_1': 'Very good. But ask for your support.'",
        "'speaker_0': 'Any questions or comments? Councilmember Herbold.'",
        "'speaker_2': 'Thank you. I just want to speak to some of the concerns that we heard during public comment today. We also heard similar concerns during the committee process in Councilmember Johnson's plus committee. And what we learned through that process is that mitigation of transportation impact impacts for downtown development.'",
        "'speaker_2': 'As a matter of policy is limited currently to programmatic measures. So there is CPA review for downtown projects. And the the one that is the the mitigation that is most often used are transportation management plans. In addition, development regulations in themselves create disincentives for single occupancy vehicle use downtown.'",
        "'speaker_2': 'Specifically, there are parking maximums for commercial development. There are floor area ratio disincentives for the provision of above grade parking. And there is a development standard where the there's a limit of floors above grade parking and there is also a limit on the on on requirements regarding screening.'",
        "'speaker_0': 'Thank you, Catherine Herbold. Any further comments? Okay. And I want to thank those that came out to testify on the plan, at least for expressing concerns and having a record clear on your concerns. And hopefully this will still work to your benefit, even though it may not be exactly the kind of legislation you wanted.'",
        "'speaker_0': 'So thank you for coming out. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Make sure you're.'",
        "'speaker_3': 'Herbold by.'",
        "'speaker_1': 'Johnson.'",
        "'speaker_2': 'Suarez macheda i o'brien. Right. So on President Harrell high aide in favor and unopposed.'",
        "'speaker_0': 'Bill pass and share with Senate. Please read the report of the Civil Rights, Utilities, Economic Development and Arts Committee. Read Items two and three.'"
    ],
    "A RESOLUTION supporting the Seattle Public Schools Proposition 1 and Proposition 2 and urging Seattle voters to vote Yes on Proposition 1 and Proposition 2 on the February 12, 2019, special election ballot.": [
        "'speaker_3': 'Agenda item eight Resolution 3186 Supporting the Seattle Public Schools Proposition one and Proposition two, and urging Seattle voters to vote yes on Proposition one and Proposition two on the February 12th, 2019 special election ballot.'",
        "'speaker_0': 'Okay. As provided for under RTW 42.17 a point 555, the city Council will now consider the adoption of Resolution 31860 that those read into the record. And at the conclusion of Councilmember comments, the Council will hear comments from members of the public who wish to speak on the resolution.'",
        "'speaker_0': 'This resolution, of course, endorses Seattle School, Seattle School District's Propositions one and two, which relate to operation and building infrastructure funding. On the February 12th, 2019 special election ballot and approximately equal opportunities to to speak will be given to members of the public.'",
        "'speaker_0': 'Thanks for reading the item into the record and I'll relinquish the floor to Councilmember Johnson.'",
        "'speaker_1': 'Thanks. I bring this forward on behalf of not only my colleague, Councilmember Gonzales, but also all those of us who are parents of kids in public schools. The two of in front of voters this February present a unique opportunity for us to continue our decades long partnership between the City of Seattle and the school district and its'",
        "'speaker_1': 'board of directors on complementary investments. And the investments that are in front of voters this February are critical ones. Not only do we have a very, very long list of capital investments that would transform and reconstruct several schools throughout the city.'",
        "'speaker_1': 'But also we'll make investments in nearly, if not every single school in the city of Seattle. But in addition, the operating levy, commonly referred to as the PTA levy, also has a set of critical operational investments that are necessary for all of our students to excel in all of our Seattle public schools.'",
        "'speaker_1': 'So there's an ongoing partnership between the city and the school district, I think is a critical one, and I'm super excited to see this ambitious plan on the ballot and looking forward to voting yes myself.'",
        "'speaker_0': 'Very good.'",
        "'speaker_4': 'Councilmember Becky Shaw, thank you so much, Mr. Johnson, for your leadership on this. And I'm wondering if you could just hold up that map and the back side of it. There are no.'",
        "'speaker_2': 'Further people can.'",
        "'speaker_4': 'Give it to you. Thank you. So what I appreciated about this map, and I'm not sure that we can even begin to have it focused from the Seattle Channel, but this is the number of schools that will be aided by this particular levy.'",
        "'speaker_4': 'And the back side of it identifies, I mean, almost to the dollar. What kinds of things will be done at each elementary, middle school and high school? So I know that there has been some controversy around this. People are saying, well, how come that the McCleary decision didn't take care of it?'",
        "'speaker_4': 'Well, then it clearly didn't. McCleary decision didn't take care of it. And so for us to continue to have the great air quality public school system that we want, we need to support this levy. And I'm happy to be doing that.'",
        "'speaker_4': 'So thank you for bringing this forward.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, thank you.'",
        "'speaker_2': 'And I did just want to speak to some of the controversy that Councilmember Bagshaw alluded to. There was a Seattle Times editorial last week that I made some inquiries about. They had to two contentions, one related to the size of the operations levy, and the second related to concern that it would be the levy would be undermining'",
        "'speaker_2': 'sort of the basic tenet of McCleary, which is to make sure that there is there there isn't unequal funding in school districts across the state where cities with school districts and taxpayers who are willing and able to fund basic education are able to do so more plentifully than other school districts.'",
        "'speaker_2': 'And what I learned from my inquiry is that it is true that the size of the operations levy, the request in the levy itself is a different number than what they can currently be legally collected. It is in excess of the legally authorized collection amount, but that doesn't mean that they're going to be able to collect all'",
        "'speaker_2': 'that money. The plan is, again, and I think this is very consistent with the intent of McCleary. The plan is to go back to the state legislature this year to increase the amount that can legally be collected. Under state law.'",
        "'speaker_2': 'Thus maintaining that strong commitment that we have to make sure that different school districts across the state are not put in different positions depending on whether or not those particular districts are able to to pass. LEVY So in in in essence, increasing the the collection amount gives the Seattle Public Schools some some flexibility because by asking for'",
        "'speaker_2': 'the additional capacity now, they don't have to go back if the state law is itself changed. And then the other point that I think is important to note that there was a question about the use of the dollars and again, whether or not the use of the dollars is consistent with the legislative decisions made in the legislature'",
        "'speaker_2': 'last year. And I think it's important to take note that the State Office of the Superintendent of Public Instruction approved the Seattle Public Schools plan for the operations levy and took the position that it is, in fact, consistent with state law.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thanks for those comments because my HERBOLD, any further comments? If not, we're going to move to public hearing any further comments. Okay. So as required by law, we have to sign up sheets for Proposition one and Proposition two.'",
        "'speaker_0': 'So I'm going to. Call you out in the order that you sign it. Sign up and we'll start off. Just one moment. Here, give me one sec. Okay. So we'll start off with Mr. Alex Zimmerman and following Mr. Zimmerman will be Melissa Pailthorpe.'",
        "'speaker_0': 'It's on proposition number one. I have to say she. So should I go to first and second?'",
        "'speaker_5': 'It's a little bit confusing, I'm sure.'",
        "'speaker_0': 'Mr. Chairman, I humbly apologize for interrupting. Can you start his time back, please? It may I have to sign up sheets, but the same people sign up for both. And so. Yeah. Why don't we just speak on both of them?'",
        "'speaker_5': 'No problem.'",
        "'speaker_0': 'One and two.'",
        "'speaker_5': 'So you're absolutely.'",
        "'speaker_0': 'Right. Proposition one and Proposition two.'",
        "'speaker_5': 'Absolutely. Absolutely right. Yeah. I'm very happy when I see something common sense, which was very unusual in this chamber. So situation right now, very simple. Yes, it's exactly what is I want explained you money need for school so exactly.'",
        "'speaker_5': 'Absolutely I'm not too much sure how much money this money what we have here, we're talking about billions. My experience with this board of school director. But as I come in circles as pupils, very low, primitive, not professional, we cannot give this people a chance.'",
        "'speaker_5': 'Operate with billion dollars. We need somebody who's have different opinion. They have same opinion like you should belong in you same principle. Like you use more money. More money in still in mind. Is this exactly what's happened? We are talking about billions and billion dollars.'",
        "'speaker_5': 'You know, I'm absolutely sure, like profession professional, business consultant, because I don't have speeches for couple of minutes. We have more than enough money. And now in this system, we can fix it every cent, ten times cheaper. Five times cheaper, maybe three times, but much cheaper.'",
        "'speaker_5': 'So this happen and happen again and again. But what this I want to talk to right now about the of our operation with money in business principle what is every business have government or not government seven under thousand idiot who live in this city deserve a government 7 billion and billion dollars.'",
        "'speaker_5': 'I'm very happy with this because when 700,000 idiot pay a billion and billion dollars per billion and billion dollars, a billion and billion dollars for transportation for school for every cent in got better. So I'm very happy when this 700,000 natural born degenerate idiot will be a cop and Colin Campbell like you totally in scold but I'd'",
        "'speaker_5': 'like to totally because of this you look right now is a pure fascism when government together with corporation suck blood and mind you from us stop fascism cleanse this chamber. Stand up, America.'",
        "'speaker_0': 'Okay, these were all in line with the public now. So Melissa will be followed by Jake Ewert.'",
        "'speaker_3': 'Hi. My name's Melissa Pailthorpe. I'm the president of Schools. First, the organization that mobilizes the Get Out the vote campaign for the school levies. And here as a volunteer and a parent in our public schools. Thank you all for supporting this resolution.'",
        "'speaker_3': 'I think council member bags have pointed out that the capital levy has significant funding and improvements for the buildings across the city, which is really critical. We have a number of aging buildings. We've been working on that for a while and we have to keep working on improving those for our kids.'",
        "'speaker_3': 'And as Councilmember Johnson pointed out, we do have a funding gap between the McCleary solution and what we're able to raise locally. So our E.P.A. levy this year is absolutely critical. And as Councilmember Herbold pointed out, we are asking for additional authority, knowing that we would have to, in fact, have legislative action to collect on that.'",
        "'speaker_3': 'Seattle is not unique in that several districts are taking this tack because we don't want to have to come back to voters and ask again and spend more resources and time on that. So thank you for your support for our 53,000 kids and appreciate all the work that you're doing.'",
        "'speaker_3': 'I would also like to remark that this does go hand in hand with the fact, Larry, we need both pieces to make this work in our city. So thank you for that as well. And I want to apologize on behalf of Greg Wang because he had to leave, but that was the point that he wanted to make'",
        "'speaker_3': '. So thank you.'",
        "'speaker_0': 'Thank you, Jake. You are.'",
        "'speaker_1': 'Hi. My name is Jake Ewert. I'm a volunteer with schools. First you just heard about I'm also a parent of kids in the Seattle Public Schools. I've got a second grader, a kindergartner, and a little guy will be in kindergarten soon.'",
        "'speaker_1': 'These levees are really important to me, very, very important to the city. The Capitol levee is obviously important to improve and replace some schools in the operations levee. Obviously important to bridge the gap between all the improvements and funding the state has made and the money that public schools need for services.'",
        "'speaker_1': 'Now, a lot of folks have been moving to this town and will continue moving here, interested in putting their kids in Seattle public schools. It's really important that we continue investing in them. I know one thing about the money that's going to be collected, every single dollar is going to be used to support our kids.'",
        "'speaker_1': 'So it's a great investment. I urge you to vote yes. Thanks very much.'",
        "'speaker_0': 'Thank you. And thanks for letting us know Greg was not here, but we did have him, his and Greg on the same street. And Greg, thank you for all the work you're doing. Okay. Seeing no further speakers signed up to speak either in favor or opposition to the resolution.'",
        "'speaker_0': 'The public comment period for this time will be closed. The Council now proceed with the vote on the resolution 31860. Okay. Those in favor of adopting a resolution 31860. Please vote i i. Those oppose vote no. The motion carries the resolution is adopted than chair will sign it.'",
        "'speaker_0': 'Thank you very much. With pleasure. Is there any further business coming for the council?'",
        "'speaker_1': 'It's a 3:00 for the Select Committee on Image as they've got about 12 minutes.'",
        "'speaker_4': 'Right. Thank you.'",
        "'speaker_0': 'And we'll be back on the dais. Counselor. I'm a skater.'",
        "'speaker_3': 'Mr. President, I'd like to ask to be excused. Next Tuesday, I'm going to be traveling to Washington, D.C., to serve on the National Task Force for addressing homelessness and housing with the National League of Cities and honored to be there on behalf of 18 other cities.'",
        "'speaker_3': 'If I may be excused, I promise to bring everything back that I learn.'",
        "'speaker_0': 'Okay. You said Tuesday, January 22nd, once you got it Castro Wyoming skaters moved in with second had to be excused from on January 22nd. Any comments. All those in favor say I oppose. The ayes have it. She's excused from 122.'",
        "'speaker_0': 'Any further comments? If not, we stand adjourned. See you in a few minutes. Thank you very much.'"
    ]
}