{
    "AN ORDINANCE related to KeyArena; authorizing the renovation of KeyArena into a world-class, multi-purpose sports and entertainment arena at Seattle Center, including its design, construction, lease, financing, and future operation; authorizing the Mayor to execute agreements with Seattle Arena Company, LLC, for the renovation and lease of the Arena, including a lease agreement, a development agreement, an integration agreement, and other related agreements; exempting the renovation and future operation of the Arena from the requirements of Chapter 20.47 of the Seattle Municipal Code; authorizing the Seattle Center Director to execute future joint purchasing agreements with Seattle Arena Company, LLC, notwithstanding Seattle Municipal Code Chapter 20.60; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'The Report of the Select Committee on Civic Arenas. Agenda Item one Constable 119 345 relating to key arena authorizing the renovation of Key Arena into a world class, multipurpose sports and entertainment arena at Seattle Center, including its design, construction, lease financing and Future Operations Committee recommends the bill passes amended.'",
        "'speaker_2': 'Councilmember Suarez.'",
        "'speaker_8': 'Thank you. Good afternoon, everybody. Before I go to my more official comments, I want to thank everybody who are here today who have been coming to all of our public hearings, our committee meetings, to provide public comment on this very important piece of legislation.'",
        "'speaker_8': 'Again, I just want to remind everyone that.'",
        "'speaker_0': 'It is 2018.'",
        "'speaker_8': 'Let's not live in the past. We just celebrated our third WNBA national championship.'",
        "'speaker_0': 'Go Seattle Storm. Thank you. Owners of Sales Storm.'",
        "'speaker_8': 'I guess sometimes when I hear people just go on and on about oh eight and their hearts being ripped out, I get a little annoyed because that was ten years ago, so you kind of gotta let that go.'",
        "'speaker_8': 'So we are starting a new day here in the city with a new partnership and a new partnership, and I'm very, very happy and excited. The Select Committee on Civic Arenas made a unanimous recommendation on September 14th, 2018 that the City Council passed Council bill as amended.'",
        "'speaker_8': 'This, as you, many of you know, is a few years in the making. The dozens of committee and committee in city council meetings, private briefings, community events, individual briefings and tons of paper and notebooks. But we're finally here.'",
        "'speaker_8': 'I want to thank my co-chair, President Harrell. I want to thank the client group who worked with me closely. Councilmember Bagshaw representing District seven in Council Member Johnson. Your participation and willingness to work with me as well as your staff was invaluable.'",
        "'speaker_8': 'I know we spent a lot of time together and you're probably tired of me and all the notebooks. A special thank you to my amazing five team in my office. Both both past and present. Brendel Nagy, Tyler, Mercedes, Sabrina and Shaina.'",
        "'speaker_8': 'Hundreds and hundreds of hours of putting together notebooks and reading and highlighting and collating and making sure that my colleagues had all the information they needed to make the right decision. And a very particular wonderful thank you to our director, Kirsten Anstead.'",
        "'speaker_8': 'Where are you? Kirsten, please raise your hand. This woman is amazing. Want to go a little bit off script here. I don't think people realize how hard and I think I can say Kirsten Kirsten.'",
        "'speaker_0': 'Is the is the glue that makes it.'",
        "'speaker_8': 'Happen. She's the one that makes sure all the charts, all the analysis.'",
        "'speaker_0': 'That it takes it much very sophisticated.'",
        "'speaker_8': 'Complicated ideas and all these transaction documents and boils it down. And we all work together to make sure they got done. And I could not have done this job without her. So I told her, when I leave this job some day, I'm taking her with me.'",
        "'speaker_8': 'So I'll leave it at that. I also want to be a special thanks to Ovg and their team. Your commitment, both financial and civically, to our great city is very, very much appreciated. We appreciate the time you took for us in the last about 18 months to work with us through many drafts and many documents.'",
        "'speaker_8': 'And I cannot tell you it was a labor of love, but it was well worth it. I want to thank the leadership and the cooperation of the executive team, particularly Mayor Jenny Durkin, Robert Nelms, Marshall Foster, the two Carls Carl Carl Steckel and Carl Hersch, Ben Noble.'",
        "'speaker_8': 'Thank you, Ben, for all your hard work and of course, our legal team, Greg Nava and our experts, most notably for me anyway, it was Mr. Abrams from NYU. Mr. Abrams again spent a considerable amount of time who the Legislative City Council hired to walk us through the most difficult documents, making sure that we understood due diligence'",
        "'speaker_8': ', equity, financing, backstops, all that stuff.'",
        "'speaker_0': 'So thank you. Thank you. Thank you.'",
        "'speaker_8': 'Thank you. We are all proud of the hard work everybody contributed to deliver us here today. And in particular, I want to thank the city of Seattle and all the dedicated public servants who I did not list off today, who spent countless hours in time.'",
        "'speaker_8': 'And of course, all my colleagues and their legislative staff that came to meetings and took the time to meet with me and Kirsten and anyone who would listen about any material or any information or anything that they didn't understand.'",
        "'speaker_8': 'And one last thank you to the wonderful community groups that reached out to me that we met with so we could accommodate all of the needs of the residents, not only within the development zone, but those outside of the development zone.'",
        "'speaker_8': 'And I believe that this is just the beginning of a wonderful new era. 2018 is our year to make our city. And we said that line, and I'm going to say I almost said, make city Seattle great again.'",
        "'speaker_8': 'No, that's not what I was going to say. Seattle is already great. We are going to make it greater. And this is a phenomenal partnership.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. Chair, where's Councilmember Bagshaw?'",
        "'speaker_8': 'Thank you very much. And thanks to all of you who are here. Many of you were here with us two and a half years ago, and I think I opened up my comments with something like, sometimes you have to stand up what's right, even if you have to stand alone.'",
        "'speaker_8': 'And fortunately, I had a number of my colleagues who were willing to stand with me. And notwithstanding some of the stuff that we heard over the last year and a half, we have really been heartened by the support that we have received from all of you and from Oak View Group and Kirsten and Robert and Marshall, all'",
        "'speaker_8': 'of my own. Deborah has already sung your praises, but I just also want to say that when we first put this out in an RFP, the goal was to say Seattle and the Seattle center and the key arena are assets that are worth saving and not just saving, but revitalizing.'",
        "'speaker_8': 'And I am so excited today that the objectives that we had laid out included provide the world class civic arena that will attract and present music, entertainment and sports events, potentially including an NHL and an NBA. We know the NHL is within our grasp.'",
        "'speaker_8': 'I believe we'll see NBA by 2025 that we're going to integrate and connect with Uptown and Debbie FRAUSTO recoup are many of you who have been leading this charge. This is so important to me as a person who represents District seven.'",
        "'speaker_8': 'This is an incredible opportunity for us to design and permit, develop and construct again with minimal financial participation from the city. This is a big deal. It is a different deal than we were looking at two and a half years ago.'",
        "'speaker_8': 'And I, too, want to extend my thanks to a few group for the work that you have visioned and envisioned, because it's going to be very exciting to see what Seattle Center can become. And I'm also thrilled that our Bicycle Network is going to be extended.'",
        "'speaker_8': 'Thank you to Cascade Bicycle Club to Neighborhood Greenways for the work you've done and also for those who want to see the pedestrian connections. So, you know, just want to also say thank you to our labor community. Daryl Bright, Nicole Grant for the participation and what you showed us that we are standing together here that is not'",
        "'speaker_8': 'an us versus them city, but having the community development agreement, the local hire. And then we've also heard from our arts we uptown is an art and culture overlay neighborhood now. So connecting that with Uptown and with Belltown is important.'",
        "'speaker_8': 'And also I just want. To know that then to remind folks that the neighborhood was involved in the neighbors were heard. The notion of building affordable housing units right in Uptown and Belltown establish an innovative mobility strategy that puts pedestrians first.'",
        "'speaker_8': 'This is what we're going to be doing. And I don't know if Alan Hart is in our audience today or not, but he's the one that introduced me to this mobility action plan, the map, and making sure that we are connected.'",
        "'speaker_8': 'I'm excited about what we're doing. I'm very grateful to my colleague, Councilmember Suarez. I just appreciate so much your leadership on this. And you're putting the stake in the ground and saying we are going to have a deadline.'",
        "'speaker_8': 'I love what Debbie FRAUSTO said. It's that dreams with deadlines. And your goal is was that to bring us here today, get us moving. And I'm so hopeful that we have the NHL team soon so we can start the construction.'",
        "'speaker_8': 'So many thanks again to all of you that have been here. I'm just very grateful to be working with you.'",
        "'speaker_2': 'Thank you. Councilmember Cast Member O'BRIEN Would you like to say a few words?'",
        "'speaker_4': 'Just briefly, I want to thank the folks that have worked on this when less than a year ago when we considered the agreement. And the more you to move forward, I had some concerns of those time and voted no on that.'",
        "'speaker_4': 'And I want to say that those concerns have largely been addressed. I'll speak to the specifics around transportation when we get to the resolution, but proud to be supporting it today and look forward for the next couple of years.'",
        "'speaker_4': 'There's still work to do, but I think we can get there.'",
        "'speaker_2': 'Thank you. Comments from Brian. So we have item one in front of us, but any of my colleagues like the Chairman Castro Johnson, please, just briefly.'",
        "'speaker_9': 'Since there's a lot of things on the agenda today and everybody else's speeches have been really short in the interest of time, I just want to say how proud I am to be here. We have had a long road to get to this point.'",
        "'speaker_9': 'But Councilmember Suarez's suggestion earlier, you know, it has been really incredible experience to work with so many different and great people on this project. We've got an agreement where we all share in some risks and some rewards, but we are going to build a world class venue that is going to be home to some world championship teams'",
        "'speaker_9': '. And ideally one of those will be a basketball team from the men's side to join the great basketball team that we have from the women's side. And.'",
        "'speaker_0': 'You know.'",
        "'speaker_9': 'I'd be remiss if I didn't mention, you know, I brought my little bobblehead friends today, thanks to a friend of mine who gave that to me after the last unsuccessful vote and said, stick with it. This is an important thing to a lot of people in the city.'",
        "'speaker_9': 'And and I'm really proud that we have a commitment not only to build a new arena, but also that that ARIN is going to contribute two and a half million dollars into our mandatory housing affordability program that it's going to commit $10 million to youth care and another $10 million in the Giving Fund, a three and a'",
        "'speaker_9': 'half million dollars in public art. And it's going to be part of a community in Seattle center where we have intentionally set up a lot of really incredible arts and cultural institutions. And it's going to respect and work with those arts and cultural institutions.'",
        "'speaker_9': 'My significant other spent six years on the fundraising staff for PNB, and I'm a big believer in the culture that we've created at Seattle Center, and I'm grateful to you, Director Dellums, for continuing that culture. So I'm just really excited.'",
        "'speaker_9': 'I'm going to get a lot less harassment from my taller, more athletically inclined cousins at Christmas this year. At six foot three, I got made fun of a lot for being one of the shortest members of the family and for for them.'",
        "'speaker_9': 'I am very grateful to you all for your vote today, because I think this is going to be a really, really incredible project. And I'm so proud of them both.'",
        "'speaker_2': 'Thank you, Kasper and Johnson. Now, the comments from many of my colleagues and we say a few words I just like to start off saying by that my heart was torn in 2008.'",
        "'speaker_5': 'Oh, God.'",
        "'speaker_2': 'I'm just joking.'",
        "'speaker_5': 'Oh.'",
        "'speaker_2': 'Yeah. In all seriousness, this is just a great deal for the city, for the residents, for the businesses. So I'll view hopefully with the success voters, it's no longer our adversarial in a contractual way. They are our partners and I think they've already proven through this process they've been outstanding partners.'",
        "'speaker_2': 'So just a few things councilmember worries really drove the process your thoroughness is was remarkable so thank you for that. Director Kirsten Aristide and your team were phenomenal. Robert Nel I'm sure team we, we had high expectations and you rose to the occasion as you always do.'",
        "'speaker_2': 'So we think. Thank you for that. And I just enjoyed Mike McQuaid's description that this is this is world class, this is a legacy project. And in the midst of, you know, we just got off a big Seahawk win and a big Husky win.'",
        "'speaker_2': 'So we're riding high in the midst of all that sports stuff. We're not forgetting about the people that matter the most the communities, the neighborhoods, the homeless, the housing needs. So this is a good deal for the city and I'm very honored to support it.'",
        "'speaker_2': 'So and with that, councilman was really like saying, are you ready to vote?'",
        "'speaker_8': 'Despite being called a bandito today? Yes, I think I'm ready for a vote.'",
        "'speaker_2': 'All right. We good? Okay. Here we go. Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Gonzalez. I herbold. I Johnson.'",
        "'speaker_9': 'Hi.'",
        "'speaker_3': 'Suarez. Hi. O'Brien. Sergeant Bagshaw. Hi. President Harrell. Hi. Eight in favor and unopposed.'",
        "'speaker_2': 'All right, Bill passes.'",
        "'speaker_7': 'I know this. That's got to be.'",
        "'speaker_2': 'A record in terms of the size of the bill. My goodness. It's called the next agenda item when you are ready.'"
    ],
    "AN ORDINANCE pertaining to Admission Tax revenue received by the City; amending Section 5.40.120 of the Seattle Municipal Code to revise uses of Admission Tax revenue.": [
        "'speaker_1': 'Agenda item to cancel Bill 119 344 pertaining to emission tax revenue received by the city amending section 5.40 point 124 Code to revise uses of admission tax Revenue Committee recommends the bill passed as amended.'",
        "'speaker_2': 'Councilmember Wallis, thank you.'",
        "'speaker_8': 'The Select Committee on Civic Arena has made a unanimous recommendation on September 14, 2018 that the City Council passed the Council bill as amended. I moved to amend Council Bill 119344 Section one B2 by replacing Council Bill with number 119344 with 139345 as presented on Amendment one.'",
        "'speaker_8': 'Okay.'",
        "'speaker_2': 'Okay. So let's just take the amendment first is somewhat of a technical build number change any questions on the amendment alone? So it's been moved in second to amend the bill by deleting the council bill number as described by Council Member Wars and adding a new bill number.'",
        "'speaker_2': 'All those in favor of the amendment, please say I. I oppose. The ayes have it. Councilmember Member Whereas you need to speak anymore to the base.'",
        "'speaker_8': 'Bill No, I don't. Thank you, Councilman Herbert.'",
        "'speaker_2': 'I'd like to share a few words.'",
        "'speaker_6': 'Thank you. I just want to thank the Select Committee, thank central staff Director Aristide for working with me to make some changes to the legislation before it came to full council. The the changes that we made in the Select Committee specified that the new use for admissions revenues applies only to the lease agreement for the arena and'",
        "'speaker_6': 'only with respect to the admissions tax generated through the operations of the new arena. The reason why this is so important is back in 2017, the city I'm sorry, 2015, the city council passed legislation allocating 75% of all of the ad tax revenue to go to fund the Office of Arts and Culture in the next year in'",
        "'speaker_6': '2016. The City Council sort of made a commitment to a multi-year ramp up of of admissions tax with 20 in 2016 going up to up to 80% in 2017 going up to 90%. And in 2018, just last year, we brought it up to 100%.'",
        "'speaker_6': 'So this this legislation that is as it is before us today, allows us to maintain that commitment to the Office of Arts and Culture. So thank you.'",
        "'speaker_2': 'Thanks for those comments, Councilman Herbold. Any further comments before we vote? Please call the rule on the passage of the amended bill.'",
        "'speaker_3': 'Gonzalez I. Herbold I. JOHNSON Whereas. O'BRIEN All right. So aren't I. BAGSHAW High President Harrow High eight in favor and unopposed.'"
    ],
    "A RESOLUTION requesting reports from the Seattle Department of Transportation, the Seattle Department of Construction and Inspections, and Seattle Center identifying transportation projects in the vicinity of the Seattle Center Arena and describing the process for administering the Arena Access Management Plan.": [
        "'speaker_2': 'Bill Pass in show assignment, please read agenda item number three.'",
        "'speaker_1': 'The Report of the City Council Agenda and three Resolution 318 41 requesting reports from the Seattle Department of Transportation and the Department of Construction Inspections and the Seattle Center identifying transportation projects in the vicinity of the Seattle Center Arena area, excuse me, and describing the process for administering the Seattle Center Arena Transportation Management Plan.'",
        "'speaker_2': 'Councilmember Johnson.'",
        "'speaker_9': 'Thanks. So we have had several conversations about the transactional documents, and this resolution has something to do with the transactional documents, but is really more off to the side about the city process as we contemplate the construction of a renewed key arena.'",
        "'speaker_9': 'I think it's really important that we think about how people get to and from that arena and the ways that we would build a transportation infrastructure to get people in, particularly people who are not driving alone to the arena.'",
        "'speaker_9': 'So this resolution responds to concerns that we've heard from community about the various different transportation projects that are planned for the neighborhood, which funding stream is going to be used to pay for those projects, and how the Department of Construction and Inspections, Department of Transportation, Seattle Center and other various departments are coordinating the completion of those projects'",
        "'speaker_9': '. It asks for some reporting back on the status of the construction of those projects and the funding associated with them, and ask those reports to be given back to the council twice a year starting in June of 2019.'",
        "'speaker_9': 'Two other points that I'd like to say before. I know we've got an amendment on this topic. You know, the city does have a set of goals and objectives we want the arena to achieve in terms of how many folks are driving to the arena versus carpooling, walking, biking, taking transit.'",
        "'speaker_9': 'And we've got those same objectives for folks that are working at the arena as well and the folks who are working in the construction. So this is a complicated way of saying we've got a set of goals and objectives.'",
        "'speaker_9': 'We want to have the city work with the arena, focus on meeting those goals and objectives. And we want to hold ourselves accountable to make sure we build those projects on a on a correct timeline. So with that, when I stop there, we'll talk about amendments and then we'll we'll get the thing in front of us.'",
        "'speaker_2': 'Thank you, Councilman Johnson. We'll walk through them. Councilmember O'Brien, did you want to reserve your comments to the amendment part or would you like to say anything now? We'll wait for the amendments. Okay. So, Councilor and Justin, I have you scheduled for a first day, probably a substituted version.'",
        "'speaker_9': 'So I think what I'm supposed to do here is move to pass resolution 31841. Stephanie and I and I don't think we have a substitute. I think.'",
        "'speaker_2': 'Okay, very good.'",
        "'speaker_9': 'I think we now just have done.'",
        "'speaker_2': 'So is been moved in second of the pass a resolution is stated so.'",
        "'speaker_9': 'And and now we're down.'",
        "'speaker_2': 'To a substitute.'",
        "'speaker_9': 'And I don't have that language in front of me. And there is is a substitute version for.'",
        "'speaker_2': 'Seven, eight, four, three, eight, I believe. Okay. So would you like to move seven, eight, four, three, eight. I love that. Okay. And I'll second that.'",
        "'speaker_9': 'A second that.'",
        "'speaker_2': 'This is a version change. Any other comments? All those in favor of substituting version 74, version three eight. Please say I opposed the ayes have it. And I believe Councilmember O'Brien has an amendment he'd like to speak on.'",
        "'speaker_4': 'I do. I would like to move amendment number two to Resolution 31841, which adds some clarity to future actions about the bike master plan in the area of citizen arena and some report backs. And I'll speak to those in a second if I get a second.'",
        "'speaker_4': 'Second, thank you. So, first of all, I want to say thanks, Councilmember Johnson, for your work on this resolution and and your attention to transportation issues around this project. I also want to take a minute to say thanks to the the staff team that are working on this.'",
        "'speaker_4': 'Mr. Dellums and his whole team at Seattle Center did an amazing work and worked particularly closely on the transportation issues with Marshall Foster and Kevin O'Neill and your team. So thank you for helping us get through the back and forth.'",
        "'speaker_4': 'I want to thank community advocate someone. We're here today speaking. I really appreciate the excitement about the project and the excitement that we can become the arena with the lowest single occupancy vehicle mode split and the future going forward.'",
        "'speaker_4': 'I think that's a great goal. It's an ambitious goal and I think we're committed to do what we can to make that happen. What this specific amendment does is well, let me back up for a second. The timing of this was obviously I've been working on this for quite a while, but it's also quite compressed with an'",
        "'speaker_4': 'environmental impact statement being done on the master use permit being issued. And so just in the last few weeks, we've been able to get clarity on what transportation projects are going to be required as part of the Environmental Impact Statement and part of the master use permit.'",
        "'speaker_4': 'And there's a lot of great projects that are included in there, and I'm really appreciative of the work and look forward to seeing, you know, Ovg and their team deliver on those. And there are other projects that we were excited to have happen that are not part of that permit.'",
        "'speaker_4': 'And so one thing this amendment does is ask the Department of Transportation to come back and say there are other connections to the network as there would be anywhere that are still missing. And we would like to make sure we have clarity on what those pieces are, what streets we had planned to build those to make sure'",
        "'speaker_4': 'there's there's a safe pedestrian and bike access throughout the whole Seattle center area. And then we can go through the bike masterplan process to figure out where that falls, the priorities and where there might be future opportunities to fund those.'",
        "'speaker_4': 'This this amendment also adds in some specific language about an expectation and requirement for the department to make regular reports back to the council and to work with the community in that process in the next two years. So the the transportation plan, the AMP document will continue to evolve as this project evolves and as it evolves, I'",
        "'speaker_4': 'want to make sure there's opportunity for neighbors and advocates to be providing continuous input on what is going to be in that kind of traffic management plan. And the Council wants to have a role in that, too. And so this amendment includes language on how that will work out.'",
        "'speaker_2': 'Very good. Any comments on the amendment? It's already been moved to second. So basically the amendment adds the new section three is described by Councilmember Brian. All those in favor of the amendment. Please vote I. I oppose. The ayes have it.'",
        "'speaker_2': 'The resolution is amended. Any further comments on the resolution as amended? Councilwoman Johnson, I.'",
        "'speaker_9': 'Just want to say thank you to Calvin Joe of our central staff. He really stepped into the space here and helped facilitate a lot of the coordination between different departments to get this thing done in a very short order.'",
        "'speaker_9': 'And so that. Kudos to you, Calvin Joe, and thank you for all your good work.'"
    ],
    "A RESOLUTION providing an honorary designation of 2nd Avenue North from Harrison Street to Thomas Street as Seattle Storm Way.": [
        "'speaker_2': 'Very good. Any further comments? Those in favor of adopting the resolution as amended? Please vote I. I opposed the ayes have it. The motion. The resolution is not done. Cheryl Simon, please read the next agenda item.'",
        "'speaker_1': 'Agenda item for resolution 318 40, providing honorary designation of Second Avenue North from Harrison Street to Thomas Street. Seattle Storm Way.'",
        "'speaker_2': 'Casper River, Back Shore. I think so. I mean, I did have it as Cancer Bay Shores, but she looked a little surprised there.'",
        "'speaker_0': 'So let's.'",
        "'speaker_2': 'We get all we're all going to help you.'",
        "'speaker_5': 'Just.'",
        "'speaker_8': 'So we can we can work on this. I want to say congratulations again to Seattle Storm. Thank you to the mayor's office. The mayor proposed and brought down one of the beautiful brown signs that designated that one block area to be Seattle storm way.'",
        "'speaker_8': 'So congratulations. And this is a honorary designation. It doesn't change anybody's address. So we'll be delighted to make this recommendation to call this Seattle storm way.'",
        "'speaker_2': 'Very good. So you are ready for it. See, I apologize. My note said Casper Factual. Any other comments? We want to she. She took the pass and she slam dunk it. So we're ready to vote on the resolution.'",
        "'speaker_2': 'This is exciting to change the storm way. Okay. I move to adopt resolution 31840. Their second second has been moved in second it to adopt the resolution. Any further comments? Those in favor of adopting the resolution please vote I.'",
        "'speaker_2': 'Those oppose vote no. The motion carries the resolution adopted and Cheryl, sign it. Please read the next agenda items.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon the Colonnade Hotel/Gatewood Apartments, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_8': 'Item.'",
        "'speaker_1': 'The report of the Finance Neighborhoods Committee agenda and five cancel 119 325 relating to historic preservation opposing controls upon the Colonnade Hotel Gate Wood Apartments, a landmark designated by the Landmarks Preservation Board. The committee recommends the bill pass.'",
        "'speaker_8': 'Thank you very much. I think the next dozen are belonging to me. I was a little surprised about that first one, but the Colonnade Hotel has received a landmark designation, and the recommendation of the committee is that we move forward to impose controls on this site and building exterior.'",
        "'speaker_8': 'It was designated a year ago. The control features are just the building exterior and the site itself, and we recommend moving forward with this landmark designation.'",
        "'speaker_2': 'Very good. Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Gonzalez I. Herbold, I.'",
        "'speaker_5': 'Johnson I.'",
        "'speaker_3': 'Was. O'Brien I saw what I. Bagshaw high president Harrell high aide in favor and opposed.'",
        "'speaker_2': 'The bill pass and chair of Senate Please read agenda item number six with the short title.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon Anhalt Hall, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_1': 'Agenda item six Council Vote 119 348 Related Historic Preservation Imposing Controls upon the Halt Hall, a landmark designated by the Land Risk Preservation Boards Committee, recommends a bill passed.'",
        "'speaker_2': 'This rare picture.'",
        "'speaker_8': 'Thank you very much. And Hall hall is in the you district is 711 northeast 43rd. It was actually moved the building was built in 1928 and they moved it from where I-5 is now over to where it is located on 43rd Street.'",
        "'speaker_8': 'This would be designated for the control features for the building exterior. The owner of the building was with us at our committee meeting and we would like to move forward with this landmark designation and move adoption of Council Bill 119348.'",
        "'speaker_2': 'Any comments on this bill? Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Gonzalez I. Herbold Hi. Johnson I was I.'",
        "'speaker_4': 'O'Brien I.'",
        "'speaker_3': 'Want I. To make sure President Herrell I Adan favor an unopposed.'"
    ],
    "AN ORDINANCE authorizing, in 2018, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Parks and Recreation, Human Services Department, Seattle Information Technology Department, Seattle Fire Department, and Seattle Police Department to accept specified grants, private funding, and subsidized loans and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'Bill passed and chair senate. Please read the next agenda item. The short title.'",
        "'speaker_1': 'Agenda item seven cancel 119338. Authorizing 2018 acceptance of funding from non city sources. The committee recommends the bill passes amended.'",
        "'speaker_8': 'Thank you very much. These next two items on our agenda are companions. The first is to accept approximately $2.6 million of funding from external sources. 2.2 2,000,000.06 in park related grants for Youth Play Field at Smith Cove. Play Field Renovation at Brighton.'",
        "'speaker_8': 'Play Field. 1.1 million for boat mortgage renovation. 169,000 for out-of-school time programs. And then the 137 for enviros, 137,000 for regional enviro stars, and 249,000 to update the Seattle Fire Department's hazardous materials response plan. So it's a total of 2.6 million.'",
        "'speaker_8': 'We will accept these grants and this external funding, and then I will move forward with our second quarter supplemental budget. But first, we have to accept the money and then we'll spend it.'",
        "'speaker_2': 'Very good. Any comments? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Gonzalez Herbold II. Johnson Suarez O'Brien. I so want a fake shot. Hi, President Harrell. Hi. In favor and unopposed.'",
        "'speaker_2': 'To a pasture senate. Please read the next agenda item. The short title scroll 119339.'"
    ],
    "AN ORDINANCE relating to the City Light Department (City Light); amending Ordinance 125493, which amended the 2018 Budget (Ordinance 125475), including the 2018-2023 Capital Improvement Program (CIP); changing appropriations within City Lights Light Fund; revising project allocations for certain capital projects in the CIP; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'Bill passes and the chair of Senate at least read the next agenda.'",
        "'speaker_1': 'Item. Agenda Item nine Council Bill 119 352 Wellington City Department Amending Ordinance 125 493 The committee recommends the bill pass.'",
        "'speaker_2': 'Spring BAGSHAW.'",
        "'speaker_8': 'Thank you very much. This is the supplemental ordinance with summary details. One moment, please. We are still back. I just want to make sure I've got the right materials here in front of me.'",
        "'speaker_2': 'Take your time. There's a lot of material going through, so.'",
        "'speaker_8': 'Thank you. I just don't want to lose all of this. Okay. Thank you. All right. So this is our $17.4 million budget transfer. So, Seattle City Light presented budget change to Art Committee for $17.4 million. This was really associated with their large capital project.'",
        "'speaker_8': 'And after they had gone through their project planning, they learned that there was an additional growth in our city of about 8000 more advanced meters that were added to the AMI purchase. The whole project was forecasted as being $84.1 million, which was within their budget plus last year.'",
        "'speaker_8': 'And then as a result, when you do the math that they needed to transfer $17.4 million in 2018, it's not a hit on our general fund. The money will be transferred from within existing resources to cover the budget changes.'",
        "'speaker_8': 'And we grilled them fairly hard about why did this happen. Many of us read about the failure to add sales tax in the original project. They had an explanation for why that happened. They've also put in procedures to make sure that it doesn't happen again.'",
        "'speaker_8': 'So with 14.7 million for the meter installation and another 2.7 for systems I.T. and licensing, that brings up the total of the 17.4 million they would like to transfer. And the committee recommends that they be that request be approved.'",
        "'speaker_2': 'Very good. Any comments or questions, Councilman Gonzalez?'",
        "'speaker_1': 'Thank you, Council President. I just wanted to thank the chair of the Finance and Neighborhoods Committee for allowing me an opportunity to be one of the individuals who was grilling the department around some of the additional allocations and appropriations that they were requesting.'",
        "'speaker_1': 'One of the concerns that I had expressed during committee was around what looked to be and is in fact a shifting of dollars from the city's led streetlight conversions program and also some funding that had been previously allocated to doing some right of way improvements.'",
        "'speaker_1': 'And my concern that the appropriation that was being suggested that we're about to take action on today would have a disproportionate impact on neighborhoods or communities who had been waiting for the LED conversion to occur in their neighborhoods.'",
        "'speaker_1': 'Of course, this is an important program for public safety reasons and livability concerns. I just wanted to report to my colleagues that I was able to work with the Seattle City Light Agency to get confirmation that this action that the full council is about to take will not affect the deployment of the led street light conversions and'",
        "'speaker_1': 'that the contractor who is performing the LED lamp conversions is in fact fully funded within this program through the end of the year. So it I'm comfortable voting in support of this bill at full council today with the reassurance from Seattle City Light that this will not have a disproportionate impact on neighborhoods who've been waiting for this'",
        "'speaker_1': 'infrastructure to come to their neighborhoods. And with the understanding that and the representation that from that agency that all 2018 planned replacements will be completed in 2019, even with this budget transfer.'",
        "'speaker_2': 'Very good. Any further comments?'",
        "'speaker_8': 'Just that, Councilmember Gonzales, you nailed that. Thank you very much for bringing it up and following it up.'",
        "'speaker_2': 'Okay. No further comments. Please call the rule on the passage of the bill.'",
        "'speaker_3': 'Gonzales. I. Herbold. I. Johnson. Suarez. O'Brien. So on Lakeshore High President Harrell high eight in favor and unopposed.'"
    ],
    "A RESOLUTION designating the Grand Street Commons Redevelopment Opportunity Zone pursuant to RCW 70.105D.150(1) and making findings in support of such designation.": [
        "'speaker_2': 'Bill passed and chair of the Senate. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item ten Resolution 318 36 designee the grants she comments redevelopment opportunities and pursuant to ICW 70.10 5.1 50.1 and making findings in support of such designation, the Academy Committee recommends the resolution be adopted.'",
        "'speaker_8': 'In your district. Good. So I am very pleased to be able to present this resolution. What we are doing here is identifying a parcel of property that is going to have a what is called a redevelopment opportunity zone.'",
        "'speaker_8': 'It is at or close to the future site of the Judkins Park Light Rail Station. I believe this is in your District Council President Harold the Grand Street Commons. It's an a very impressive project that will be going on a Browns field, very polluted area, but that area is going to be demonstrably cleaned up.'",
        "'speaker_8': 'And part of the reason that we're doing this resolution is the Department of Ecology requires us to make this designation. There will be approximately 700 units of housing total on the site. About half will be affordable. 150 will be for households earning less than 60% of the area.'",
        "'speaker_8': 'Median income and 150 will be for households earning more than that, and then the other will be market rate. So because we have to make the determination that this brownfield property is something that can get cleaned up, that we are supportive of the project, that we will provide the designation, then they can go forward for additional funding'",
        "'speaker_8': 'and approval. And we definitely recommend that the revitalization of this property is very much the the juice is worth the squeeze and we're prepared to move forward with it.'",
        "'speaker_2': 'Any further comments? Councilman Gonzalez, thank you.'",
        "'speaker_1': 'Council President setting aside that, saying that, I'm not sure what it actually means.'",
        "'speaker_8': 'A lot of work and you actually get something for it.'",
        "'speaker_1': 'Okay, good. Thank you for the translation. I I'm really excited to support this particular resolution there. There's been a lot of effort at the city and in the city council in particular to really take a look at a lot of publicly available land that the city regularly surpluses for purposes of identifying those parcels of land to build'",
        "'speaker_1': 'additional affordable housing or to develop in some other way to advance our priority around affordable housing. And one of the things that I think we need a greater strategy around is identifying more of these contaminated sites that are either publicly or privately owned that cannot currently be utilized to build affordable housing upon because of the degree of'",
        "'speaker_1': 'contamination. And this provides us, I think, a really good example and model in the city of Seattle moving forward in terms of how we can be a little bit more creative about identifying buildable lands within the city and work with our representatives in our state delegation to secure funding through the state budget to allow for this type'",
        "'speaker_1': 'of environmental cleanup to occur within neighborhoods who are really just in desperate need of land and property to build on. And I'm really excited about the opportunity to work with these developers in particular to see if we can move forward a body of work over the next year to take, take, take a riff off of the work'",
        "'speaker_1': 'that we did on that Hope for Home program and see if we can come up with an inventory list, for example, to begin identifying other brown sites throughout the city of property that would be able to be utilized for affordable housing, but for the fact that it's contaminated.'",
        "'speaker_1': 'So I'm excited about this being the first step and excited about more to come in this in this space.'",
        "'speaker_8': 'And if I can just build a little bit more of the comment you just made, I want to say and recognize that Lake Union Partners Joe Ferguson and the Mount Baker housing group, Connor Hanson have done a tremendous amount of work.'",
        "'speaker_8': 'And one of my colleagues and it may have been you, Councilmember Gonzalez, said, what's it polluted with? And the litany is unbelievable that there was former commercial equipment manufacturing. There was actually a former commercial dry cleaner offsite, but the water was leaching from one property to the other.'",
        "'speaker_8': 'We've got petroleum hydrocarbons, words that I can hardly even begin to pronounce, let alone explain what they are. And because of their willingness to go in and remove the soils completely and then bring in fresh, we're going to have a site where people can live in a very healthy way.'",
        "'speaker_4': 'Very good.'",
        "'speaker_2': 'There are no further comments. Those in favor of adopting the resolution. Please vote i. I. Those oppose vote no motion carries the resolution is adopted in the chair will sign it. Please read items 11 and 12 into the record agenda.'"
    ],
    "AN ORDINANCE establishing a new SODO Parking and Business Improvement Area (BIA); levying special assessments upon owners of business, multi-family residential, and mixed-use properties within the area; providing for the deposit of revenues in a special account and expenditures therefrom; providing for collection of and penalties for delinquencies; providing for the establishment of a Ratepayers Advisory Board; providing for an implementation agreement with a program manager; providing for the continuity of services and the distribution of remaining funds from the current SoDo BIA account that was established in 2013 by Ordinance 124306; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'Very good. And for the comments those in favor of confirming the appointments. Please vote i. I. Those oppose vote no. The motion carries and the appointments are confirmed. Please read the next agenda item.'",
        "'speaker_1': 'The Report of the Governance, Equity and Technology Committee Agenda Item 20 Council Bill 119 297 Establishing a new Sodo parking business improvement area. The committee recommends the bill passes amended.'",
        "'speaker_2': 'Thank you very much. So this council bill establishes is a business improvement area, otherwise known as a bi a and south of downtown or otherwise known as Sodo. And I think many of you are very familiar with this legislation.'",
        "'speaker_2': 'For those that aren't bills or an economic development funding mechanism that basically allows property and business owners to assess themselves, to fund enhanced services, programing and management for a business district and the current SODO business improvement area, or be it was originally established in 2013 for a five year period.'",
        "'speaker_2': 'It ends in December 31st, 2018. And, you know, in theory, it's based on an ability to provide service services valued by its ratepayers. The Soto Business Improvement Area developed a proposal recommending the creation of a new BIA with expanded boundaries for a period of ten years.'",
        "'speaker_2': 'And that's what this legislation does. The new service area would extend a roughly from South Rail Broadway way to South Hudson Street and I-5 to the Port of Seattle. The city generally considers a new or expanding bay. When presented with a petition by those who represent 60% or more of the total assessment in their proposed bill and'",
        "'speaker_2': 'are city staff and their employees follow the RTW that allows for this and calculated the dollar amount of the special assessment that each business and multi-family residential or mixed use property would pay and compare the dollar amount represented by the signed petitions and and letters of support to establish a total of the entire House total bill.'",
        "'speaker_2': 'And the result was 61%, which of course exceeds the threshold of 60. And in a nutshell, the programs allow for transportation, investment, safety, cleaning, advocacy, marketing, communications, business, community development within that existing zoning. A little bit about the the process that was used and of course, the assessments would begin January 1st, 2019.'",
        "'speaker_2': 'On July 16th, the Council passed Resolution 31823, which initiated the proposed bill for consideration and Resolution 31824, which establishes establish the intent to establish a bill and sought to set the public hearing date for August 7th. On July 17th, the committee had an initial discussion and briefing on the proposal, and we listened to ratepayers and community advocates'",
        "'speaker_2': '. On August 7th, the committee held another public hearing. And and on September 18th, the committee held its third discussion and voted on the legislation. A few remarks that we heard from and during the public testimony, we we've said all along that we are doing our best to make smart investments, and we are asking on businesses and ratepayers'",
        "'speaker_2': 'to assist us in that process. Looking again at transportation solutions, public safety solutions, and this is a good example where I think we have strong leadership of those running to be. I wanted to recognize you least by description, not by name, because I don't like start singling people out.'",
        "'speaker_2': 'But it was very clear that the work done by those running the BIA were to the satisfaction of the ratepayers. And I say to the satisfaction, I'd say that we solved all the problems, but I think that it is very clear we are we are committed and we're coming up with solutions and we take this work seriously'",
        "'speaker_2': 'and we are worthy of this kind of investment. So we want to thank the ratepayers think the bay folks and I look forward to supporting this this this ordinance. Any further comments from any of my colleagues? If not, please call the role on the passage of the bill.'",
        "'speaker_3': 'Gonzalez, I. All right. Johnson. I heard.'",
        "'speaker_6': 'My name.'",
        "'speaker_3': 'Whereas you did. O'Brien, I. So on. I make sure President Harrell I aid in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to surveillance technology implementation; amending Ordinance 125376 and Chapter 14.18 of the Seattle Municipal Code.": [
        "'speaker_2': 'The bill passed in show senate. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item 21 cancel 12 one one 9 to 18 relating to surveillance technology implementation amending ordinance 125376 and Chapter 14.18 of this yet year must because the committee recommends the bill passed as amended.'",
        "'speaker_2': 'So essentially my pleasure to present this Council bill which amends the surveillance ordinance which was passed by the Council in 2017. I'll talk a little bit more about the history during my latter part of my remarks. Just some background, though.'",
        "'speaker_2': 'The 2017 surveillance ordinance outlined requirements that included, number one, that surveillance technology get reviewed, reviewed and approved by the city council before acquisition. And that, of course, is an important aspect of the legislation that two counts of review and approve via an ordinance for retroactive technologies and three, reporting about surveillance, technology use and community impact.'",
        "'speaker_2': 'The chief technology officer now is required to compile a master list of surveillance technology technologies in use by city departments. And during this process, 28 technologies were identified in four departments City Light, the Department of Transportation, the Seattle Fire Department, and the Seattle Police Department.'",
        "'speaker_2': 'So what does this bill do? And I got to tell you, you'll see, as I describe it, there are a lot of positive fingerprints, excuse the pun, on this particular piece of legislation, because a lot of people were very interested in making sure both technologies use effectively and efficiently, but privacy interests were protected.'",
        "'speaker_2': 'Number one, it creates a community service surveillance working group. And this group will advise the city council and executive on matters of surveillance technology. From a community perspective, that's the bottom line directive that we're asking to be achieved from that group.'",
        "'speaker_2': 'The working group would provide a privacy and civil civil liberties impact assessment, or I'll just call it an impact assessment for each surveillance impact report, and we'll get that. Know that acronym, the SBIR or Sir will be part of our vernacular because that's what has created a surveillance impact report, which is a report that documents and identifies'",
        "'speaker_2': 'how surveillance technologies will be used, how data will be securely stored, retained and accessed and audited by departments. And of course, that is our commitment to transparency. The impact assessment would be included with any CAIR submitted to the City Council for ordinance approval.'",
        "'speaker_2': 'And thus far there are a total of 28 hours and the working group would be afforded. The way that ordinance works is they be afforded no less than six weeks to prepare this impact assessment. And if the working group does not prepare the assessment before the transmittal of the are, the working group would ask the Council for'",
        "'speaker_2': 'a two week extension that would be granted because we want them to do that kind of work at that level. The working group consists of seven members, four appointed by the mayor and three appointed by the City Council, and we'll have that achieved by December of 2018.'",
        "'speaker_2': 'Thanks to the leadership of Councilmember O'Brien and others. We sort of looked at how this will sort of roll out, since this is a work in progress. And I want to again think, I think toward the closing remarks.'",
        "'speaker_2': 'A lot of people really push the city, as they should, on what to do and how to how to respond when all of the work is not given, when to in terms of the the review process of existing technology.'",
        "'speaker_2': 'So what we came up with is the departments would begin submitting to the city council these hours, no later than January 31st, 2019. All 28 must be submitted to the Council by March 1st, 2020. The first annual equity impact assessment, which is again is an assessment looking at how it affects particularly communities of color underrepresented communities.'",
        "'speaker_2': 'Are communities particularly vulnerable to the misuse of technology and equity? Impact assessment will be filed beginning September 15, 2019, and continuing by no later than September 15th, each year after thereafter. And that was sort of a a a.'",
        "'speaker_2': 'Timeline sort of negotiated between the departments and council. O'Brien and myself looking at we need to give them some time given their limited limitation of resources, but we don't want to wait and have any surprises, so we want to see it as is developed.'",
        "'speaker_2': 'We thought that that kind of process made sense. I have some amendments that will actually describe these changes in a formal manner, but that's sort of where we arrived, and I think that was good policy. The first annual surveillance usage review will be filed no later than will be filed January 2020 and covers activities through the end'",
        "'speaker_2': 'of 2018. Usage reviews in subsequent years shall be filed in September and cover the data and activities of the previous year. Standing back from the legislation a little bit, I believe that the city has demonstrated a commitment to the privacy and security of the public's personal and people's personal information, trying to strike the right balance.'",
        "'speaker_2': 'You may recall that again in March of 2013, this council or a council, I should say, passed it council bill 117730, which required, again, city departments to obtain council approval prior to acquiring certain surveillance equipment and that and required council review and approval of department data protocols.'",
        "'speaker_2': 'And that was sort of a shift in how things, of course, had been done historically. In February of 2015, Council Council passed Resolution 31570, adopting six privacy principles, guiding the actions the city will take when collecting and using information from the public.'",
        "'speaker_2': 'In the fall of 2015, the privacy tool kit was distributed to city departments to incorporate the privacy principles into daily departmental departmental operations. July, July 2017. The city hired Ginger Armbruster as the city's chief privacy officer. The chief privacy officer will help the city implement and enforce practices that manage data in accordance with our privacy principles.'",
        "'speaker_2': 'In 2017, under the leadership of Councilmember Gonzalez, a Council bill passed the council passed council bill 118930, which updated the definition of surveillance technologies and the requirements that I stated earlier, requiring this kind of sort of stringent review and assessment as we review these technologies.'",
        "'speaker_2': 'A few, few things I'll do at the end, but I did want to make sure that I amended first. But before I do that, I sort of talked about the amendments embedded in the legislation. I'll walk through the formal amendments, but did any of my comments colleagues, first of all, are all of you awake, number one?'",
        "'speaker_2': 'But number two, did Councilman Bryan or anyone else want to say anything about this?'",
        "'speaker_4': 'Yes, the council president, Harold. First, I want to say thanks to you for your collaboration in this. This is a long and thorough process and just, you know, reiterate that what we are trying to do here in Seattle around surveillance and transparency of the public is really pioneering work.'",
        "'speaker_4': 'And so it's not something where we can just pick it up and see what other jurisdictions have done. And so we've had a lot of iterations back and forth and work with some community members who've been working closely on this and really happy with where we are today, especially with the three minor amendments that have come through'",
        "'speaker_4': 'today. And I'm excited to pass this. So thanks for your leadership on this.'",
        "'speaker_2': 'Thank very much. I want to shout some things, too, and that is Greg Doss on Central Staff. Thank you for working so feverishly on this. And Kate Garvin, the mayor's office and of course, my colleague, Councilmember Bryant, and many of you participated in this discussions.'",
        "'speaker_2': 'And I want to thank Shankar and Michel from the ACLU. They were truly, in my opinion, protecting the interests of the public in Giovanna Hudson, thank you for your work and your testimony as well today. We deeply appreciate that and we look forward to partnering through this this emerging issue that many cities will contend with.'",
        "'speaker_2': 'And I think we're on the cutting edge of how it should be done the right way. So having said that, I got to walk you through the amendments. And so I'm going to first bear with me here. I would like to.'",
        "'speaker_2': 'Move. Amendment one. Just one sec here. I'd like to move to amend counts bill 1192 and eight by adding three new sentences as presented on Amendment one. And those three new sentences I sort of described it basically talked about the dates of service being submitted to the Council by March one, 2020, and the other descriptions and the'",
        "'speaker_2': 'deadlines. You've been passed out and emailed the version that it was just the dates that I talked about that were sort of negotiated. So I'll describe that as Amendment 1/2. Okay. Any questions on that? All those in favor of Amendment one, please say I.'",
        "'speaker_2': 'I opposed the ayes have it. And on amendment number two. Which was, again, the it was a date insertion that Councilmember Brian and myself and others worked out dealing with the first annual impact statements. Just some language. I just read the language.'",
        "'speaker_2': 'When reviewing technologies that do not have SARS, the department shall look to existing documents and policies to address the requirements of Section 14.18 .050 and whenever possible, provide the information requested for each retroactivity. Technology in their or trying to achieve is making sure that even if a formal ESA is not developed, we get everything we can to'",
        "'speaker_2': 'make sure that it's included in the equity impact assessment. And we thought that was a good policy. So that's amendment number two. Is there a second questions? All those in favor of amendment number two, please say I. I oppose.'",
        "'speaker_2': 'The ayes have it. And last amendment number three is just a technical change. There were some things the center staff, I believe they were just some words were replacing a few words statement with assessment approval with consideration of statement assessment again or they were just technical changes as all.'",
        "'speaker_2': 'So I propose amendment number three to the council bills are second all those in favor of amendment number three say I. I oppose. The ayes have it. Okay. So that's the amended bill with those three amendments. So I will ask that the clerk call the roll on the passage of the amended bill.'",
        "'speaker_3': 'GONZALES I. HERBOLD High. JOHNSON Whereas. O'BRIEN All right. So aren't I. Lakeshore President Herrell. I didn't favor and unopposed.'"
    ],
    "AN ORDINANCE relating to land use and zoning; extending a moratorium established by Ordinance 125425 for six months on the filing, acceptance, or processing of applications for the establishment, expansion, or change of use for certain uses on parcels with a Commercial 1, Commercial 2, or Neighborhood Commercial 3 zoning designation within the Aurora-Licton Urban Village; declaring an emergency, and establishing an immediate effective date for this extension; all by a 3/4 vote of the City Council.": [
        "'speaker_2': 'The bill passed. Chair of the Senate. Please read the next report. The short title, please.'",
        "'speaker_1': 'The Report of the Planning, Land Use and Zoning Committee should own 22 Bill 119 342 ruling to any since zoning, sending a moratorium stoppage by ordinance 1 to 5 425 for six months. The committee recommends bill pass.'",
        "'speaker_2': 'Katherine Johnson.'",
        "'speaker_9': 'Thanks. This is the first of four items from the Pledge Committee. Fun fact since we're going along today. We almost called it the Up Beat Committee, urban planning, built environment and trees. I settled on plans instead. The first item is a moratorium on certain uses within the Araw Linton Springs Urban Village.'",
        "'speaker_9': 'Last October, we passed emergency legislation prohibiting certain uses that conflicts with our comprehensive plan goals for love. The moratorium was in response to continued application for uses such as storage and many warehouse facilities in a residential urban village.'",
        "'speaker_9': 'When those uses crop up, it tends to lock up our land use for two plus decades. And that's a place where we want to see more housing, not necessarily more self-storage units. So we asked for that emergency legislation, adopted it, and anticipated that those changes would be made permanent through the adoption of the citywide mandatory housing affordability'",
        "'speaker_9': 'proposal. But given the lengthy ness of that appeal, we are here asking for an extension of that moratorium by six months, as was outlined in public comment today. We've had a couple three folks in our position, maybe four or five, and received in excess of 100 emails and phone calls to the office in support of this extension'",
        "'speaker_9': '. So I would ask for your support in adopting the Council Bill 119342.'",
        "'speaker_2': 'For because remember. Brian.'",
        "'speaker_4': 'Thank you. Councilmember Johnson, thanks for your ongoing work on this and I will be supporting this. I want to just reiterate what I said. A committee, which is that I'm committed to the city, takes a kind of comprehensive look on the types of uses that are currently in this fight.'",
        "'speaker_4': 'I think the the feedback that you and others have talked about, about the number of comments are important. I also think, though, there are certain types of uses that we need to function as a city. Those uses have to be somewhere I've heard from because as soon as like the folks at Handy Andy that have talked about'",
        "'speaker_4': ', if we, you know, they will be there because they're invested. But if these uses don't exist in our city, where will they go? And I think it's worth a conversation to make sure that we are creating spaces for the types of uses we need and also honoring, you know, neighborhood desire to evolve over time.'",
        "'speaker_4': 'And it may be that these uses are not incompatible in certain ways, and we can figure that out. And maybe that there's there is some type of incompatibility and we just have to figure out where that goes and not just prohibit things.'",
        "'speaker_4': 'I do think continuing this with this legislation to extend the timeline to allow us more time where the process moves forward is makes sense, which is why I'm supporting it.'",
        "'speaker_0': 'Good.'",
        "'speaker_8': 'LS President Press if you.'",
        "'speaker_2': 'Would just council members.'",
        "'speaker_8': 'Thank you. This this location obviously is located in District five. And again, the purpose of this legislation is to extend a moratorium on certain types of heavy commercial development inside the Aurora Lipton Springs Urban Village, Ala. Boundaries by an additional six months.'",
        "'speaker_8': 'This moratorium was originally approved by council. As was stated earlier, one year ago. Restricting heavy commercial development will encourage more housing and pedestrian friendly development in the C-1, C-2 and NC. Three designations within the boundaries of ALA of the goals of this legislation are consistent with a two or three five comprehensive plan.'",
        "'speaker_8': 'They are the Aurora, Clifton Urban Village Neighborhood Plan and the mandatory housing affordability that is MH eight, the city wide reasons, all of which have had community and council review over the last several years. No businesses will be asked to leave or relocate as a result of the legislation.'",
        "'speaker_8': 'Any new businesses, any new business development. It has been has recently been permitted or is in the permitting process will still move forward. The ALA community has been welcoming to potential density and zone changing and a more pedestrian friendly development.'",
        "'speaker_8': 'However, since ALA was part of the citywide rezoning, those permanent changes will have to wait. And this is a way to ensure that we do not lose too much development capacity with things that are incompatible with the vision for that neighborhood, and we will be legally incompatible in the future.'",
        "'speaker_8': 'I want to thank the community members who brought this to our attention and who have contributed and continue their work with our office to achieve the goals for their community. Many individuals, but those in particular. Leah Anderson, Lee Burch, David Osaki.'",
        "'speaker_8': 'Brian, do you ever say that? Do you remember? Just to name a few. So I asked my council colleagues for your support today in voting yes to approve. Thank you.'",
        "'speaker_2': 'Thank. You can remember her bold.'",
        "'speaker_6': 'Thank you. I just wanted to mention, for the record, I believe that of the three or so comments that we received in opposition to this action, one of them was on behalf of a membership based organization, the Aurora Merchants Association, so likely representing more than three individuals.'",
        "'speaker_6': 'And I think that speaks to the interest that was discussed in committee in using this time not only to make sure that there are not any additional incompatible uses of filed for incompatible uses, but to actually have a more intentional engagement that includes that body as well.'",
        "'speaker_2': 'Very good. Any further comments before we vote? If not, please call the role on the passage of the bill.'",
        "'speaker_3': 'Gonzalez I Herbold II Johnson Suarez O'Brien, Sergeant Bagshaw President Harrell Aden favor and unopposed.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Section 23.41.010 of the Seattle Municipal Code to approve the 2018 South Lake Union Neighborhood Design Guidelines.": [
        "'speaker_2': 'Bill Passenger Assignment. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item 23 cancel 119332. Relating to license only in many section 23.40 1.0 ten of the of for code to approve the 2018 South Lake Union Neighborhood Design Guidelines Committee recommends the bill pass.'",
        "'speaker_2': 'Castro and Johnson.'",
        "'speaker_9': 'The Pledge Committee is also upbeat to bring you this other key new neighborhood design guidelines. These design guidelines have been in development by community for the last several years. Strong community support for this. We do have to make one small technical substitute amendment, which clarifies that a depiction of streets and the public realm in the proposed design'",
        "'speaker_9': 'guidelines does not supersede as Dot's requirements for right away improvements. But this is one of those items where we have been fortunate enough to have several members of the public come and talk about the good work of Jim Holmes and the Office of Planning and Community Development, who shepherded these design guidelines through the neighborhood process and happy'",
        "'speaker_9': 'to have your support for that today. So I'd move to pass countable 119332. But I also have an amendment, so maybe I'll wait for a second and then talk about that amendment.'",
        "'speaker_2': 'So the we're talking just about the amendment, which is the attachment one, I believe, but there's been moved in second on the amendment. So is there much to say about the amendments?'",
        "'speaker_9': 'I would just ask to for adoption to amend attachment one to council bill 119332 to modify the description of the public realm map on page 12 of the attachment.'",
        "'speaker_2': 'And it's been secured. And so any questions about the amendment? Are those in favor of the amendment as described by Councilman Johnson? Please say I oppose the ayes have it. And any more to say about the Bass legislation as a minute, Councilman Johnson.'",
        "'speaker_9': 'Just strongly support your yes vote.'",
        "'speaker_2': 'Okay. Any further questions or comments? If not, please call the rule on the passage of the amended bill.'",
        "'speaker_3': 'Zollars I Herbold. Hi Johnson. Whereas I O'Brien I want I make sure. President Harrell high eight in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Sections 11.14.150, 23.53.006, 23.53.015, 23.53.020, 23.84A.002, 23.84A.006, and 23.84A.030 of the Seattle Municipal Code for pedestrian access and circulation and to make corrections.": [
        "'speaker_2': 'Bill Pass and Chair of Senate. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item 24 cancel 119333. Relating to planning and zoning in many sections. 11.14 point 150. 23.50 3.006.0 15.3 2020 2320 48.002.006.0 37. District Code for pedestrian access and circulation to make corrections. The committee recommends the bill passes amended.'",
        "'speaker_9': 'Councilmember Johnson thinks this legislation is required to help bring the city into compliance with the Americans with Disabilities Act. It explicitly calls out curb ramps as a part of pedestrian access and circulation requirements would require corner lot development projects to construct new curb ramps and curbs, which was an ambiguity in the current code requires development inside urban'",
        "'speaker_9': 'centers and urban villages to improve existing sidewalks, curbs and curb ramps. The current standards and defines accessibility terms and makes minor changes to add clarity on the curb ramps are only one of many options possible for improvement during developments.'",
        "'speaker_9': 'This doesn't change the types of projects exempted from those requirements, but then again does require particular development projects like ones on corner. Lots to make investments in new curb ramps. A lot of public outreach done on this topic to both the Commission for People with Disabilities, the Bike and PED Advisory Board, the Master Builders Association, and was'",
        "'speaker_9': 'unanimously approved by committee.'",
        "'speaker_2': 'Very good. Any further comments in that? Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Gonzalez HERBOLD Hi. JOHNSON Whereas. O'BRIEN So on. I Lakeshore President Harrell eight in favor and unopposed.'"
    ],
    "A RESOLUTION making a preliminary decision on the University of Washington 2018 Seattle Campus Master Plan.": [
        "'speaker_2': 'The bill passed and the chair will sign it. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item 25 Resolution 318 39 Making a preliminary decision on the University of Washington 2018. Seattle Campus Master Plans Committee recommends the resolution be adopted as amended.'",
        "'speaker_9': 'Katherine Johnson Okay, this one I've got a lot of words about. So the Resolution 31839 contains a preliminary decision on the University of Washington master plan. As a refresher, we are at a one spot in a lengthy timeline here for approval of the major institution master plan.'",
        "'speaker_9': 'It started with the University of Washington preparing a draft master plan, an environmental impact statement for community input. Then they submitted a final version of those two documents. The City University Advisory Committee then produces comments and a report associated with it.'",
        "'speaker_9': 'The FBI has the Department of Construction and Inspections issued its own recommendations. The hearings examiner then held a hearing and recommended approval with conditions. All of that happened before we then as a committee had a hearing from the that included the University of Washington, the Department of Construction and Inspections, the Community Advisory Committee, and the parties of'",
        "'speaker_9': 'record that appealed the decision of those hearings. Examiner. After all of that public hearing, we then took a look at different conditions. We adopted 13 amendments to the plan last Wednesday, as follows Those amendments require the University of Washington to provide 300 units of affordable housing 80% ami on top of the 150 units that are conditioned by'",
        "'speaker_9': 'the hearings. Examiner. The other opposes this condition and argues the city lacks the authority to require housing, but has voluntarily agreed to 150 units. We asked for a reduction of the service goal rate from 15% to 12% in 2028, with interim goals tied to the opening of light rail stations.'",
        "'speaker_9': 'We included parking associated with residence halls and a cap on parking spaces and removed minimum parking requirements from residence halls with lowered the parking cap from 12,300 spaces to 9000 spaces, which was a part of incredibly wonderful, esoteric conversation about how you can cap something in 9000 spaces when there are already exists more than 1000 spaces.'",
        "'speaker_9': 'We included showers and other park bike parking facilities as part of the the draft recommendations. Trail widening and pedestrians operations along the Gilman Trail as development occurs along the trail. We exempted child care space. On the gross floor area cap maintain the current zone height limit on W 22 supported the use of priority hire and contracting exempted'",
        "'speaker_9': 'space for small businesses from the gross gross floor area. Cap. Encourage the incorporation of diversity in retail ownership on campus. Encourage the use of best management practices for reducing stormwater runoff and ask the University of Washington to negotiate an updated City University agreement.'",
        "'speaker_9': 'Should my colleagues agree that this monumental amount of work is acceptable to them and we pass this resolution today? The resolution then goes to the parties of record for a 30 day comment period, followed by 14 days of replies.'",
        "'speaker_9': 'Those parties of record include the Department of Construction and Inspections, the University Board of Regents, as well as all of the individuals and organizations that appealed to parties of record in front of the hearings. Examiners. The those bodies all get to make comments on our resolution.'",
        "'speaker_9': 'And then in December, we will discuss any comments that we've received and discuss whether or not we would like to pass an ordinance that reflects any changes based on the comments that we've received. Likely sometime after the first of the year.'",
        "'speaker_9': 'Please remember that this is a quasi judicial matter. So the appearance of fairness rules apply and the council rules related to experts. The community location continue to apply even after we passed the resolution today. But just because we are here doesn't mean that we're at the end, that there's more work to come.'",
        "'speaker_9': 'And at this point, why don't I pause? Because that was a good five straight minutes of opening remarks.'",
        "'speaker_2': 'Thank you, Katherine Johnson. The floor is open for remarks on the resolution dealing with the master plan. Councilmember Herbold and looks like I would.'",
        "'speaker_6': 'Say make it really, really short. Specifically, as it relates to the recommendations from the University District Alliance for Equity and Livability, one of the parties of record on at least at least two of the elements that Chair Johnson reviewed, specifically the elements related to small businesses and the element related to the need to address child care within'",
        "'speaker_6': 'the context of the master plan. We made some proposals for a strategies that were really not there aligned in the goals but not aligned in the methods as was recommended by by the alliance and and cookout. So I'm really eager to get to this next stage of the process so we can actually hear in a way that's'",
        "'speaker_6': 'consistent with the quasi judicial process, whether or not those are good approaches to address those needs, because I really have no idea.'",
        "'speaker_2': 'Very good. Any other comments before we vote on the resolution or concern? Just good. Closes out comes from Brian.'",
        "'speaker_4': 'Just say briefly thanks, Councilmember Johnson for all your work on this. Obviously a lot of staff support. I really appreciate this western's help on that, too. There's still a few months of work to go here, but it's a good benchmark I think we're clearing here.'",
        "'speaker_4': 'Very complex and important stuff working through. And really, I'm pleased to support this resolution and hopefully some version similar in the ordinance in a few months.'",
        "'speaker_9': 'There between his work on the convention center and then straight from the convention center here and to the major institution master plan list. Woodson has been a busy dude the last couple months. I'd like to briefly say thanks to no on from my office who's helped shepherd a lot of this stuff across the finish line.'",
        "'speaker_9': 'And, you know, we've had a lot of incredible conversations about the university district over the last couple of years between implementation of the mandatory housing affordability program that neighborhood design guidelines will get next year. And then also just generally a lot of transportation dollars that are being invested in the neighborhoods.'",
        "'speaker_9': 'So a lot of really great things that are happening there, a changing neighborhood that's growing. And this is going to be a critical piece to that growth and looking forward to continuing those conversations once we hear back from the parties of record after the first of the year.'",
        "'speaker_2': 'Very good. Any further comments? Okay. Those in favor of adopting the resolution please vote i. I. Those oppose vote no. The motion carries. The resolution is adopted and chair will sign it. Okay. Please read items 26 and 27 together.'"
    ],
    "A RESOLUTION relating to the Department of Parks and Recreation; authorizing the Superintendent of Parks and Recreation to act as the authorized representative/agent on behalf of the City of Seattle and to legally bind the City of Seattle with respect to the Project(s) below for which the City seeks grant funding assistance managed through the Recreation and Conservation Office.": [
        "'speaker_2': 'Very good. Any further comments? Those in favor of confirming the appointments. Please vote i. I. Those oppose vote no. The motion carries. The appointments are confirmed. Adoption of other resolutions. Please read agenda item number 28.'",
        "'speaker_1': 'Adoption of other resolutions. Agenda item 28 Resolution three 2042. Relating to the Department of Parks Recreation authorizing Superintendent of Parks and Recreation to act as the Authorized Representative Agent on behalf of the City of Seattle and to legally bind the City of Seattle with respect to the project below, for which the city seeks grant funding assistance managed'",
        "'speaker_1': 'through the Recreation and Conservation Office.'",
        "'speaker_2': 'Councilmember Suarez.'",
        "'speaker_8': 'Thank you. This resolution is the city's application for grant funding of 5.5 million awarded by the State Recreation and Conservation Office. Grant funds will be used to support 12 Parks and Recreation Capital projects. The committee was briefed on September 19th and is supportive of this legislation.'",
        "'speaker_8': 'I recommend that Council pass through Resolution 3184 to move.'",
        "'speaker_0': 'To adopt. Oh, no. That's it, right? That's good.'",
        "'speaker_3': 'Okay, I'm done.'",
        "'speaker_2': 'All right. Any further comments on this? All right. I move to adopt resolution 31842. Is there a second? Okay. Those in favor of adopting the resolution, please vote. I, i those oppose vote no. The motion carries. The resolution is adopted.'",
        "'speaker_2': 'Cheryl, sign it. Is there any further business to come before the council? No. Okay. Hearing. Then we stand adjourned. And everyone, have a great afternoon.'"
    ]
}