{
    "A RESOLUTION related to the redevelopment of KeyArena into a first-class, state-of-the-art, multi-purpose entertainment and sport center (the Arena) at Seattle Center; supporting The City of Seattle negotiating with Oak View Group, LLC (OVG) regarding the possible redevelopment and operation of the Arena at Seattle Center; and requesting the Mayor to negotiate a memorandum of understanding with OVG for the City Councils consideration and action.": [
        "'speaker_0': 'I'd like to move to pass Constable 119053. It's been moved and second of the bill. Pass it. Any comments? Please call the roll on the passage of the Bill O'Brien.'",
        "'speaker_2': 'I spoke to.'",
        "'speaker_3': 'Burgess.'",
        "'speaker_2': 'Gonzalez Johnson.'",
        "'speaker_3': 'I was Herbold. Hi.'",
        "'speaker_2': 'President Harrell. I aid in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Please read the report of the full council.'",
        "'speaker_6': 'To be part of the full council agenda. Item one Resolution 317634 related to the redevelopment of Katrina into a first class state of the Art, Multipurpose Entertainment and Sports Center at Seattle Center supporting the City of Seattle negotiation with Oak View Group, LLC regarding the possible redevelopment operation of the Arena at Seattle Center and requesting that the'",
        "'speaker_6': 'Mayor to negotiate a memorandum of understanding with OPG for the City Council's consideration and action.'",
        "'speaker_2': 'Councilmember Juarez I believe Councilmember Herbold has a substitute motion to make.'",
        "'speaker_5': 'I move to amend Resolution 31765 by substituting version two for version one B.'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'And moved in second to make a substitution and customer service. Do you want to explain what we're doing here, please?'",
        "'speaker_5': 'Yes, absolutely. So the substitute adds three new sets of language. The first is to add a recital to recognize the council's letter of June 26 and adds it as an attachment. Also, together with that, central staff included recommending a recital that actually refers to the letter.'",
        "'speaker_5': 'The second set of amendments actually incorporates two edits to memorialize and recognize in two separate places the work that Councilmember Suarez has spearheaded for an independent council consultant for Financial Review. The first edit adds a recital with language from the consultant funding request and the second notes Council's intent to review that council consultant work in Section two'",
        "'speaker_5': '. And then the third amended language is to Section one. And it says specifically, in order for the council to potentially carry out review by the end of the year. The intent is to add context to this section regarding what the Council needs in order to have a chance to fulfill the goal of taking final action by the'",
        "'speaker_5': 'end of the year, as referenced in Section four.'",
        "'speaker_0': 'Very good, Councilmember. Whereas we know this is a friendly manner and amendment, I take it. Would you like to say any more just about the amendment?'",
        "'speaker_2': 'I have no comment to the amendment, but I certainly can speak to the resolution.'",
        "'speaker_0': 'Okay. And just to sort of clarify the record, this is resolution 31764. I don't know if it's read correctly.'",
        "'speaker_5': 'I'm sorry, six five. My bad. Okay.'",
        "'speaker_0': 'So we're six four. So any questions? Just on the amendment piece. Okay. All those in favor of substituting version two for version one B, say I. I opposed the ayes have it. So now we have a new version in Council member.'",
        "'speaker_0': 'Whereas would you like to speak to that?'",
        "'speaker_2': 'Thank you. In regards to resolution 316 for this resolution, as we discussed this morning, is to memorialize the agreements and benchmarks we've already laid out in the last four meetings of this year. I want to thank Councilmember Bagshaw and Councilmember Harrell for co-sponsoring this resolution with me.'",
        "'speaker_2': 'This resolution expresses our commitment to review the MCU that is sent to us in any other documents or legal issues that would be would remain in the purview of the legislative branch. It would maintain authority to prove all subsequent agreements, and we will be ensuring the motion meets our expectations, especially those as laid out in the RFP'",
        "'speaker_2': '. I want to thank Councilmember Herbold, Gonzales and Johnson for raising many important and substantive questions and issues. And I also want to thank Councilmember Burgess for his words regarding our duty, our fiduciary duty, and our due diligence in any documents that come from the executive regarding these type of agreements.'",
        "'speaker_2': 'Always want to end is that more input is always better and I remain committed to this process and working with my colleagues. Thank you.'",
        "'speaker_0': 'Thank you. Councilman warns any further comments on the amended resolution from any of my colleagues? Okay. I think we'll be ready to vote. So I move to adopt resolution 31764, second and second. Those in favor of adopting the resolution as amended.'",
        "'speaker_0': 'Vote i, i. Those oppose vote no. The motion carries resin. Solution is adopted as amended and the chair will sign it.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'And then please read the next gen item number two.'"
    ],
    "AN ORDINANCE relating to housing regulations; adding a new Chapter 14.09 (Fair Chance Housing) to the Seattle Municipal Code to regulate the use of criminal history in rental housing; authorizing the Seattle Office for Civil Rights to enforce the regulations set out in this new chapter; and amending Section 3.14.931 of the Seattle Municipal Code to expand the Seattle Human Rights Commissions duties.": [
        "'speaker_6': 'The Report of the Civil Rights, Utilities, Economic Development and Arts Committee. Agenda Item three Cancel 1190 15 related to housing regulations. Adding a new Chapter 14.09 to the Senate is required to regulate the use of criminal history in rental housing, otherwise in Seattle Office for Civil Rights to enforce the regulation set out in this new chapter in'",
        "'speaker_6': 'amending section 3.14 point 931 of the CNM is required to expand this to other Human Rights Commissions. Duties Committee recommended the bill passed as amended.'",
        "'speaker_0': 'Thank you very much, Councilmember Herbold.'",
        "'speaker_5': 'I move to amend Council Bill 11 9015 by substituting version five. Version for.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'Has been moved in second and substitute version five for version four and comes from. I heard you just want to speak to the amendment, please.'",
        "'speaker_5': 'Absolutely. I want to speak first to the technical amendments and I'll defer to Councilmember Gonzalez to speak to a section that is consistent with the action of the committee. But a little bit more substantive for the technical amendments.'",
        "'speaker_5': 'There are three. One is to strike from the definitions section. That's 14.0 9.010 the phrase, except that pursuant to 14.0 9.0 to 5 convictions are limited to those found in registry information. The second is in 14.0 9.020, adding the phrase except for information pursuant to subs section 14.0 9.0 25a3 and also adding the phrase subject to the'",
        "'speaker_5': 'exclusions and legal requirements in section 14.0 9.10. I'm sorry, 110. And then the third is in section 14.0 9.025 to strike the term juvenile record.'",
        "'speaker_0': 'Very good. So we have a substitution for version five for version for any of the concerns. You want to speak just on the amendment piece?'",
        "'speaker_6': 'I just need to speak as to the police amendment that Councilmember Herbold is offering to me. So this is in section 14.0 9.1 15c. With regard to the definition of dwelling unit in committee, we had voted out a version that would that that excluded the phrase single family before dwelling unit.'",
        "'speaker_6': 'And upon further reflection and analysis, it appears that without the term single family, that would have essentially set up a framework in which all dwellings, all dwelling units, including apartments and micro-housing, would be excluded and exempted from the applicability of the of the new legal requirements being created under this ordinance.'",
        "'speaker_6': 'So we have modified that language to reintroduce the phrase single family before dwelling unit, to make clear that the City Council's intent is that multifamily housing spaces such as apartments and micro-housing will be subject to the restrictions and regulations reflected in this Council bill.'",
        "'speaker_0': 'Very good. Any further comments or concerns on the substitution to going to vote? Just on the substitution first? It's been moved in second to substitute version five for version. For all those in favor, say I. I opposed the ayes have it.'",
        "'speaker_0': 'Councilman Herbold, I'll turn it back to you for the base legislation as amended.'",
        "'speaker_5': 'Thank you. I'm going to start and end my remarks with thanks. I want to first thank the Fair Coalition. The voices of people with lived experiences have been very important to the development and passage of this legislation. We all know that one in three people in Seattle have a criminal background, but the reality is that no matter'",
        "'speaker_5': 'how many facts and figures exist, what actually creates structural change is our collective awareness of these lived experiences. They're worth more than all of the studies combined, and it takes incredible courage to speak in public about one's experience with the criminal justice system.'",
        "'speaker_5': 'And I want to acknowledge and honor those who have. You have humbled me, and we are here today because of your courage. The legislation before the council today was developed collaboratively over the past year through a stakeholder process that included renters, landlords, advocates, the Office of Mayor Ed Murray and the Office of Civil Rights.'",
        "'speaker_5': 'The bill the bill was considered in my committee at four different meetings, including a stakeholder discussion and evening forum highlighting feedback from formerly incarcerated people, tenants, advocacy organizations, the Rental Housing Association and the Washington Multifamily Housing Association. Before that process, it was a recommendation of memories, housing affordability and livability agenda in 2015, and even before that, in'",
        "'speaker_5': '2013, it was an issue that Councilmember O'Brien Laquita had spearheaded with the Office of Housing, focusing on the housing providers that receive city funds to ensure that they're removing barriers to housing funded with city taxpayer dollars. The Civil Rights Utilities Economic Development Arts Committee last week recommended approval of their Fair Chance housing ordinance by a60 vote.'",
        "'speaker_5': 'The legislation, sponsored by myself and Council President Harrell, prohibits landlords from screening applicants based on past arrests or criminal convictions. This ordinance would prevent landlords from screening screening applicants based on criminal convictions, arrests that did not lead to conviction, convictions that have been expunged, vacated or sealed juvenile records.'",
        "'speaker_5': 'The bill also prohibits the use of advertising language that categorically excludes people with arrests or conviction records. The legislation does not apply to people registered as sex offenders who committed their crime as an adult. Landlords will still be able to screen applicants based on employment, credit scores, income ratios or other criteria to ensure that people will be'",
        "'speaker_5': 'good tenants. They'll merely be unable to use criminal history when considering applicants. Something no study has shown affects a person's ability to successfully be a good tenant or neighbor today, largely because of the new access to data that historically has been less accessibly accessible.'",
        "'speaker_5': 'Landlords now can reject tenants because they've been harassed in the past seven years, not convicted, arrested for a criminal justice system that disproportionately arrest people of color. Punishing someone who has not been found guilty is a true injustice for those who have been convicted.'",
        "'speaker_5': 'The way I see it, you've paid your debt to society if you've served your time. Blocking formerly incarcerated people from accessing stable housing is an extrajudicial punishment and not consistent with the rule of law. It is also a recipe for recidivism and less safety for our communities.'",
        "'speaker_5': 'Recidivism decreases significantly when people get housing with housing. A person is seven times less likely to reenter the criminal justice system. I would expect anyone in favor of a safer. Seattle to support this bill. Further, we're in a homelessness state of emergency.'",
        "'speaker_5': 'If we do not do more to ensure housing providers provide housing for the 55% of unsheltered homeless people in Seattle who identify their criminal background as a barrier to access accessing housing, then we're derelict in our duty to address the homelessness state of emergency.'",
        "'speaker_5': 'In addition, the legislation will not go into effect for nearly six months in order to support a new Fair Housing Home program, in which the city will help landlords learn how they can implement practices that will affirmatively further fair housing by reducing racial and other biases in tenant selection.'",
        "'speaker_5': 'I've heard concerns that with passage of this law and others, that small landlords have been and will continue to leave the business of operating rental housing in a hot real estate market where property put on the market is quickly sold sometimes to developers who charge hard for higher rents after redevelopment.'",
        "'speaker_5': 'I share this concern using a combination of rental registration data as well as county sales records and taxpayer information. Central staff will work to identify the number of properties that have sold over a defined period of time. We can then compare the taxpayer's address with property addresses to get a sense of if it's still a rental.'",
        "'speaker_5': 'I hope to begin some of this work prior to the effective date of the ordinance. And in addition, the county auditor, the city auditor will be doing an assessment of the ordinance after its implementation as well. In closing, in addition to my thanks to the very coalition and specifically people with experiences with the criminal justice system, I'd'",
        "'speaker_5': 'also like to thank Leslie Pryce with the mayor's office, Erica, Pablo and Brenda Anna Barro at the Seattle Office of Civil Rights. Asha then then Carter Turman of counsel, central staff under counselor, formerly of my office that I'm sure is out there listening, as well as Councilmembers O'Brian and Gonzales and their staff whose leadership helped make the'",
        "'speaker_5': 'legislation stronger.'",
        "'speaker_0': 'Thank you, Councilman Herbold. Any other comments? I'm sure many of us have a lot to say about this and hear the comments from my colleagues. Councilmember Brian Foreclosures.'",
        "'speaker_1': 'Councilmember Herbold, I want to just add on to the thanks everyone you name. There has been some amazing work. This is a long process and I want to thank you for your leadership throughout this and kind of steadfast in holding this process and keeping it rolling, complex and challenging legislation like this.'",
        "'speaker_1': 'It is so easy for it to get derailed. And as we've heard from so many folks today at the multiple meetings, how important this is for so many community members to keep going forward. So I'm really grateful for your work on that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember back back Jordan Gonzalez.'",
        "'speaker_3': 'Thank you very much. Just to underscore some of the really good work that has been done. Councilmember Herbold, I don't know whether you mentioned or public defenders who are out there and if I see you sitting there. But I am so grateful that you came forward with this.'",
        "'speaker_3': 'As a former prosecuting attorney, one of the things that I'm keenly aware of is that if somebody is let out of prison but doesn't have a plan to get housing and to get a job, they are doomed to that spin cycle of being back on the street.'",
        "'speaker_3': 'And if they're back on the street, people have to survive and they figure out a way to survive. And oftentimes, unfortunately, it puts them right back in jail or prison again. We have got to stop this and to break that point, I think recognizing that we all need a second chance at some point, something Councilmember Herbold just'",
        "'speaker_3': 'already stated. But this legislation is going to give individuals who have been convicted of a criminal offense and had they have completed their sentence, we're giving them another opportunity to get stable housing. And as someone who's working really closely and hard with our Human Services Department, we know that getting people stable in housing.'",
        "'speaker_3': 'So it's a housing stability, housing first and a harm reduction model. That is what is going to change and really make things better for people who are out on the street and ultimately making it safer for everybody who is actually housed.'",
        "'speaker_3': 'So I want to say thank you to all who have been involved in this. It really matters. It is going to be something we can try. And if it works well, we will know that we're on the right track.'",
        "'speaker_3': 'If for some reason it doesn't work, we can always take a step back and fine tune. And I also want to acknowledge I've heard this from a number of landlords. I want everybody to be reassured if they're worried about the sexual offender list.'",
        "'speaker_3': 'The sexual offender list is still available. Landlords can check that. So this is just a step in the right direction. I think it's going to be much more fair and I appreciate all the work that's gone into it.'",
        "'speaker_0': 'Thank you very much. Councilmember Gonzalez.'",
        "'speaker_6': 'Thank you. I just wanted to lift up and highlight a set of supporting documents that goes along with this council bill. And that's the clerk filed 320351. And I think it's important to highlight, because I think it emphasizes many of the points that Councilmember Herbold has so articulately, artfully laid out for us.'",
        "'speaker_6': 'And that clerk file has well over 300 pages of literature supporting the policy positions that we are going to take here today on this council bill. And I think that's really important for the public to understand that this council, under the leadership of Councilmember Herbold and and under the guidance of impacted community members and advocates of impacted'",
        "'speaker_6': 'community members, really took this issue seriously. And we understood the complexities related to it. And we did our homework as it relates to reading through the literature that his informed the policy positions that are reflected in this particular ordinance.'",
        "'speaker_6': 'And I think that, you know, I think what that over 300 pages of literature says is that an arrest or a conviction is not an accurate indicator of bad tendency. It is, however, a tool for discrimination and it's judicial punishment for a crime for which penance has been presumably paid.'",
        "'speaker_6': 'And so I am incredibly proud to have been able to support Councilmember Herbals work on this particular bill. I think it is an important advancement for and in having a more equitable system in our society where we stand true with our with our state and values, that once you pay your debt to society by virtue of spending'",
        "'speaker_6': 'time in prison or jail for a conviction, that at that point you deserve a second chance. And this is in and of itself a second chance, Bill. And I'm really proud to be able to support it. And I'm really looking forward to seeing how this will advance our goals of making sure that we can provide folks a'",
        "'speaker_6': 'place to stay and to heal and to become and to continue to be contributing positively contributing members in our community. So thank you so much for your leadership.'",
        "'speaker_0': 'Thank you for those comments. I'll say a few words if my colleagues are finished to this point by now. Most of us, I think, fully understand that when you look at our country that we have truly been a country of mass incarceration.'",
        "'speaker_0': 'And I think when you hear that, I think we sort of get that. But even our state, when you look at every year, around 8000 people are being released from prisons and jails in our state. And about 15 years ago, there's a study done and looking at recidivism.'",
        "'speaker_0': 'And at that point in 2002, over 67% of the folks that were released had recidivate. And of that number, over 51% had actually gone back to prison. And so when I look at this, coupled with the banning the box employment legislation that we're that we passed a few years ago, that the only way to sort of correct'",
        "'speaker_0': 'these policies and those are policies and actions that we've taken are to embrace is to embrace this kind of legislation when we are looking at giving people a second chance now. I want I want to thank some of the folks who come forward today to talk about their past and the struggles they've had.'",
        "'speaker_0': 'I jokingly joked with a childhood friend, Daniel, growing up when he was serving our country and I was in college. But we don't have to go far to look at the folks that were arrested and charged. Many folks in our neighborhood have records.'",
        "'speaker_0': 'And as a not an old man, as a mature man, I talked to so many friends that have really they've paid their debt. I mean, that is the bottom line. They have paid their debt to society and they're just looking for they're looking to be evaluated on their strengths and not on a decision or an unfortunate circumstance'",
        "'speaker_0': 'that they found themselves in years ago. So, Murph, I want to sort of give you a shout out, because you remember years ago when I looked at embracing this, I didn't know if our city was ready for this, you know, ready for this kind of policy.'",
        "'speaker_0': 'And so we looked at the employment piece first. And again, I have such a great team here sitting on the dias, said, I'm sure this would be an eight no worst case scenario, I guess maybe Sharma may come in here and ask at the last minute.'",
        "'speaker_0': 'But in all seriousness, we have a council that understands that it's going to be through policy corrections that we address these evils that have occurred in our society. So thank you, Councilmember Herbold, and everyone else that amended and participated.'",
        "'speaker_0': 'And it's certainly my pleasure to co-sponsor this legislation. So having said that, thank you. Are we ready to vote? Councilmember Hobo, did you want any closing? Are we good and closed? Well, Usha Venkataraman, because we sort of slotted her name there.'",
        "'speaker_0': 'I just. I'm glad someone else did because I always had to write it out here. So she is. She's really been our whole center staff is pretty awesome. But this is a particular piece of legislation we would be very proud of.'",
        "'speaker_0': 'Okay, let's vote. Please call the role on the passage of the amended Bill O'Brien.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Bagshaw I.'",
        "'speaker_1': 'Burgess I.'",
        "'speaker_6': 'Gonzalez i.'",
        "'speaker_2': 'Johnson whereas I.'",
        "'speaker_3': 'Herbold I.'",
        "'speaker_2': 'President Harrell high eight in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will stand. Thank you again, Councilmember Herbold. Please called and please read the next gen item.'"
    ],
    "AN ORDINANCE authorizing the CEO/General Manager of Seattle Public Utilities to execute a contract with Cedar Grove Composting, Inc., for organic waste processing services; and ratifying and confirming certain prior acts.": [
        "'speaker_6': 'Into the agenda item for council bill 1190 36 authorizes the CEO, general manager of Seattle Public Utilities to execute a contract with Cedar Grove composting incorporation for organic waste processing services and ratifying confirming certain prior acts. The committee recommends the bill passed.'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_5': 'Thank you. Compost processing has been performed by.'",
        "'speaker_3': 'Our for.'",
        "'speaker_5': 'Espoo under service contracts with Lenz Enterprises and Pacific Cleanup Washington. These contracts began in April 2014 and continue to March 2020 with optional extensions to March 2024. In 2015, processing operations at Pacific Clean were shut down due to new agricultural regulations, and the company's share of city organic waste has been diverted to a backup facility.'",
        "'speaker_5': 'Cedar Grove Espoo initiated a competitive process for successor services last year. The utility received a competitive proposal in January from Cedar Grove composting and has been negotiating with Pacific Clean and Cedar Grove for successful financial and operational transition.'",
        "'speaker_5': 'This legislation would authorize a new processing contract with Cedar Grove to ensure clean continuity, clean service continuity, while the utility also pursues recovery of outstanding obligations from Pacific Clean. The new contract would continue to March 2020, with options to extend to 2024.'",
        "'speaker_5': 'Lenz Enterprise will continue to successfully process their share of city organic waste through March 2020 or beyond, if desired by the city.'",
        "'speaker_0': 'Thank you, Councilmember. Hold any further questions or comments from this legislation. Please call the roll on the pastor of the Bill O'Brien.'",
        "'speaker_3': 'High Bagshaw.'",
        "'speaker_1': 'Burgess I.'",
        "'speaker_6': 'Gonzales.'",
        "'speaker_1': 'Johnson.'",
        "'speaker_2': 'Juarez. Herbold II. President Harrell I. Aden favor an unopposed.'",
        "'speaker_0': 'Bill passed and chose. Sign it. Please read agenda item number five the short title.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; authorizing the General Manager/CEO of Seattle Public Utilities to acquire, accept, and record on behalf of The City of Seattle both temporary and permanent property rights from owners of property located along the alignment of the planned combined sewage conveyance and storage tunnel between 24th Avenue NW and Shilshole Avenue NW in Ballard and Interlake Avenue North and North 35th Street in Wallingford and property abutting the 24th Avenue NW pier in Ballard, that are necessary or convenient to construct, operate, and maintain the Ship Canal Water Quality Project and 3rd Avenue West Water Main Replacement Project, through negotiation or eminent domain (condemnation); placing the real property rights acquired under the jurisdiction of Seattle Public Utilities and designating the property rights acquired for utility and general municipal purposes; authorizing payment of all other costs associated with acquisition; and ratifying and confirming certain prior acts.": [
        "'speaker_6': 'Agenda Item five Constable 1190 52 relating to Seattle Public Utilities authorizing general manager CEO of Seattle Public Utilities to acquire except on record on behalf of the City of Seattle, both temporary and permanent property rights from owners of property, the committee recommends the bill pass.'",
        "'speaker_5': 'Councilmember Herbold This ordinance would authorize the city you general manager CEO to acquire temporary and permanent easements for the ship Canal Water Quality Project. The easements would be along the alignment of the plan combined sewage conveyance and storage tunnel between 24th Avenue Northwest and Chushul Avenue Northwest in Ballard and Inner Lake Avenue, North and North 35th Street'",
        "'speaker_5': 'in Wallingford, as well as property abutting the 24th Avenue Northwest Pier in Ballard. And the combined cost of these easements is $1.5 million.'",
        "'speaker_0': 'Thank you, sir. HERBOLD Any questions or comments? If not, please call the role on the passage of the Bill O'Brien.'",
        "'speaker_2': 'Make sure. Burgess Gonzalez.'",
        "'speaker_6': 'I.'",
        "'speaker_2': 'Johnson whereas I Herbold I President Harrell I in favor and unopposed.'",
        "'speaker_0': 'Bill pass and share with Senate. Please read the next agenda item.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the execution of a lease agreement with Marina Management, L.L.C. for moorage improvements, maintenance, and operation of the City of Seattles public Leschi and Lakewood moorage facilities on Lake Washington; and amending Ordinance 124927, which adopted the 2016 budget, to lift a budget proviso imposed on the Department of Parks and Recreations Capital Improvement Program budget in 2016 for the moorage facilities.": [
        "'speaker_0': 'Thank you very much. Any questions about this appointment? Those in favor of confirming the appointment. Please vote i i. Those opposed vote. No. The motion carries. The appointment is confirmed. Please read the report of the Parks. Seattle Center Libraries and Waterfront Committee.'",
        "'speaker_6': 'The Report of the Park's Seattle Center Libraries and Waterfront Committee Agenda Item seven Council 118996 relating to the Department of Parks Recreation authorizing the execution of a lease agreement with Marina Management LLC for mortgage improvements, maintenance and operation of the City Sails Public, Lesh II and Lakewood March facilities on Lake Washington and in many ordinance 124 927'",
        "'speaker_6': ', which adopted the 2016 budget to lift a proviso budget imposed on the Department of Parks Recreation's Capital Improvement Program budget in 2016 for the March Facilities Committee recommends the bill passes amended.'",
        "'speaker_0': 'Thank you, Councilmember. Worse.'",
        "'speaker_2': 'Thank you. This is the came out of unanimously out of parks. And so I want to begin with some information and some little background information for those of you who hadn't had a chance to actually read this lease.'",
        "'speaker_2': 'The Lake Washington mortgage agreement is for the management of public mortgages on Lake Washington. These public mortgages were operated by a contractor for over 34 years and have only been operated by the Department of Parks and Recreation since October 2015.'",
        "'speaker_2': 'So respectfully, two years in 2013, a request for proposal was released and Marina Management LLC was chosen as a successful proposal. The lease agreement provides for a 20 year agreement with up to two successive year successive tenure extensions.'",
        "'speaker_2': 'The superintendent of the Department of Parks and Recreation will provide written approval of the capital improvements. The superintendent will also provide approval of slip rent increases, slips of 30 feet and under will have a rent cap of $12 adjusted by CPI.'",
        "'speaker_2': 'All other slip increases will have to be rationalized with a market study and approved by the superintendent. The tenant marina management must give 60 day notice to the superintendent to permit or deny rate increase. What's more important is that we are in this agreement looking at public ask to access will be a key component of this new'",
        "'speaker_2': 'agreement, creating more opportunity for non boat owners to enjoy access to Lake Washington. I want to make a few comments based on the lease and some of the issues that have arisen and particularly address some of the people that have.'",
        "'speaker_2': 'And thank you for showing up for public comment and all the other hearings that we've had in the actual agreement. It is on our sixth draft. We've had three committee hearings, public comment. We've met privately with the community groups.'",
        "'speaker_2': 'I want to thank central staff and legal for assisting us. And my understanding is this issue has been active for at least five years. The history which I had included in the lease is that since the 1930s, 1931 has always been operated by a private operator or company from 1981 to 2015.'",
        "'speaker_2': 'We again had a private operator that was so from 1981 to 2015. That's 34 years. And then, of course, the last couple of years, Department of Parks and Recreation has been attempting to operate these two marinas. I want to state that we did address the rental rates and made sure that we had notice and that capital improvements'",
        "'speaker_2': 'were done before any kind of rates could be increased. My understanding is that the on board people will be grandfathered in. So we addressed the issue of displacement. We also made sure that the tenant cannot raise rates until all capital improvements are completed.'",
        "'speaker_2': 'And inside the lease agreement, we are subject to DNR leases which supersede, of course, this lease. I should note that no land is being sold nor land is being transferred at or change from park use to any other use.'",
        "'speaker_2': 'In addition or in conclusion. I think we should note that this is indeed a partnership. It is not anything new, and it's not anything we haven't done before. I'm learning in this committee we have many public private partnerships with many of the park assets and all the other properties that the city owns.'",
        "'speaker_2': 'I would note that Councilmember Bagshaw, I believe, who is part of our committee, had a few comments to make as well.'",
        "'speaker_0': 'Thank you guys for being back, Joe.'",
        "'speaker_3': 'Thank you, sir. So for my colleagues, this legislation is something that I actually was working on five years ago when I was part chair and we had an RFP that the community really didn't like. And we went back to the drawing board and it took several years.'",
        "'speaker_3': 'We went through a project advisory team receiving their input as well. And for those of you who have been to Lesh, you know that the docks in the finger piers out there are impossibly bad. To say that they are sinking is an understatement.'",
        "'speaker_3': 'You cannot walk on parts of them. Some of the others who are we still have small boats moored are in just deplorable condition. We needed to do something and it was million dollar, millions of dollars that Parks did not have.'",
        "'speaker_3': 'So we entered into or proposed to be entering into this agreement that will be financially sustainable, where we will have assistance not only in the. Rebuilding but maintaining the asset going forward. Parks, as Councilmember Suarez pointed out, will continue to own the property.'",
        "'speaker_3': 'It's not like we're transferring property. We are getting assistance from the private sector with people who are experts in doing this to build and then operate. We have heard from a handful of people here today. I do want to say thank you.'",
        "'speaker_3': 'You have been very, very committed to your community. And I want you to know that we've heard loud and clear what your concerns are with Lakewood Mortgage in particular. I also want to acknowledge that we've heard from dozens and dozens of families that have urged us to move forward with this.'",
        "'speaker_3': 'They are have small sailboats. They've got small boat, but small things like this. Also, there are a lot of kayakers who would like to have access to the water. That is what we're trying to accomplish here. And as was pointed out already, the parks will review and approve the lease rates.'",
        "'speaker_3': 'This is not something where it will be dictated to us, but we will make sure that the rates are consistent with fair market value and that families will continue to have access to this. Both marinas and something came up last week that I pointed out.'",
        "'speaker_3': 'I think there is an opportunity for the community to stay involved. Lots of concerns. I heard about speedboats and jetskis and I wanted to use as a model what San Juan County did in the mid nineties where they actually put an end to jetskis in and around Friday Harbor and places where there were noise was being extremely'",
        "'speaker_3': 'annoying but also impacting the orcas that were residents around there. I think this is an opportunity for us to work with King County. Should the community continue to want to be involved in this? There's something we can do there and that there is a model from which we can follow.'",
        "'speaker_3': 'So with that, I just urge my colleagues to proceed with this, to vote yes for this marina. I see our superintendent, Susan Aguirre, in the front row. We have put them through their paces. So thank you for being here and joining us today.'",
        "'speaker_2': 'President Harrell, can I just say one comment? I'm sorry. Absolutely. I'll just wrap it up and I apologize in which.'",
        "'speaker_0': 'I have some comments as well.'",
        "'speaker_2': 'But I know you do. I just want to say this. After six variations of this lease and working with legal and working with parks and work with marine management and thank you, Joe, Brian, for meeting meeting with you and giving us a lot of great feedback.'",
        "'speaker_2': 'Our goal here for Seward Park is that this is a community asset and it should be open to all of the public that this is everybody's marina, that the marina belongs to the public and not just people that own boats.'",
        "'speaker_2': 'And that is our main goal here. When we were plowing through the maps, the lease in the agreements and the attachments, including the parking lot. And so when we look back at the history from the throes up into the fifties and then up to 91 in 1981, I think it's fair to say that.'",
        "'speaker_2': 'And there's nothing wrong with that, that particular communities did enjoy the lake and access and boating. But now that we're in an era of race and social justice and access and everybody being able to enjoy all of Seattle's benefits, that was really our goal, is to make sure that we open this up and that we partner with'",
        "'speaker_2': 'somebody that can make that a reality. We did not enter into this lease lightly, and again, that was our main goal. Here it is and certainly wasn't to destroy or displace or not take into account the wonderful individuals and families that have enjoyed their slips in this lake since the 1950s.'",
        "'speaker_2': 'But to open it up to all of Seattle's residents and beyond. Thank you.'",
        "'speaker_0': 'Thank you. I'd make a few comments here. And I again, I want to thank Councilman Waters and Bagshaw and the Committee for and that I sit on for really trying to do as much of a deep dove as possible in reviewing the lease and sort of reviewing the record.'",
        "'speaker_0': 'I, I can't support this legislation. We'll be voting against it for, quite candidly, for a variety of reasons. While we're not conveying the property, it is a 20 year lease with an option, I think two options at ten years an option.'",
        "'speaker_0': 'So we're certainly tying it up for quite a long time. And you know, I look at this from two perspectives. One is what's in the city's best interests and what's in the community's best interest. And hopefully those don't mutually exclude one another from the city's perspective.'",
        "'speaker_0': 'If you look at that, you know, I asked during the committee, what's the value of these two assets? No one ever looked at each other. And I said, well, if I just use the the amount of capital investments, but the both the city and marina management, the privately owned firm that will put into it there, they're allegedly'",
        "'speaker_0': 'putting in around 8.2 billion. I see. Allegedly or theoretically, because if you look at the lease, there's really not a dollar amount that they stipulate to investing. It's there's a an attachment that describes the kinds of capital improvements.'",
        "'speaker_0': 'But we don't know from this lease what the amount of capital improvements will be. But let's say it's 8,000,008.2, which is the number that those that were shared at the committee table and the city will invest approximately 7.2.'",
        "'speaker_0': 'So roughly, if you just add those two and say this assets worth 15 million plus what the city receives is about $25,000 annually. 25,000 on a $15 million asset to me is not a good rate of return, nor is it a prudent investment.'",
        "'speaker_0': 'I go a step further to look at that. We have been receiving anywhere upwards north of 350 to 400000 over the years. And I've heard Parks say, well, we're not in the business of renting a marina. That's not our core competency, so to speak.'",
        "'speaker_0': 'And I push back on that by saying, you know, we're we're port city, we're surrounded by water. We regulate houseboat rates and rental rates in Lake Union. We should know this line of business should should be part of our fabric as a city, as is a port city at that.'",
        "'speaker_0': 'And so I look at, again, the numbers where even at this stage of the legislation where we can't see specifically what the new slip configuration would be, we can't say with specificity how much capital improvements will be done.'",
        "'speaker_0': 'I can't say when you look at the rate of return, this is a good deal for the city that we are tying up for 20 million to 20 years plus now. We've have some great public private partnerships that have worked for the benefit of the community and for the city.'",
        "'speaker_0': 'And I applaud and have supported these. When we put this out for an RFP, you may recall that these two are these two marinas to to lump them together. I think someone does each of those marinas a disservice.'",
        "'speaker_0': 'Less shy is literally falling in the water. Lakewood is not in dire straits, is is less shy. And you may recall that we did put in about 3.8 million in the budget to fix up to fix Lesher. And what we then did some time after that was we allowed Parks instead of using that for capped repairs to'",
        "'speaker_0': 'less shy to sort of leverage that for this RFP. And through that RFP process, we listened to the community and come up with a plan well out of that work and that was good work. We only really had one significant responder to the RFP.'",
        "'speaker_0': 'I think that some of the communities and some of the people that oppose it put together sort of a response. And I don't even know if that was for both marinas, but we really had one commercial response. And to me that should have been a flag that perhaps we need to re approach or reevaluate our approach to'",
        "'speaker_0': 'this whole dilemma that we found ourselves in. And it's a very important to realize that we found ourselves in this dilemma because the city neglected to invest the revenues we received for year after year after year north of $350,000 into the marinas.'",
        "'speaker_0': 'So I think this is a shortcut. This is a shortcut to tie up this land with a very, very minimal return on our investment to a private entity. And I don't think that that's good policy. I would also suggest that when you have one bid and you do not have an independent consultant or an economist or anyone'",
        "'speaker_0': 'really look at the land value and whether this is a good business deal for the city. And I don't believe because I asked several questions about that when you don't have that kind of record to suggest this is good business, that it wouldn't be ready for legislation.'",
        "'speaker_0': 'And I think that's the situation we find ourselves in now in terms of the community. I don't think anyone's arguing that this should be open, this should not be open to the public, and it's not a public gem.'",
        "'speaker_0': 'And I think that the community understands that. But in Lakewood as an example, most of the residents are from 98118. You heard testimony and repeated testimony that these aren't rich, wealthy, affluent folks who just have money just to spend.'",
        "'speaker_0': 'You have a lot of working class people who have affordable that are willing to pay affordable rates, and they're not trying to compare that to private mortgages in other parts of the city. So I won't support this legislation because I think we have an incredible gem here and we're not doing the hard work to really look at'",
        "'speaker_0': 'what makes best sense for the city and for the community. And we sort of took a shortcut by privatizing this arrangement at a very nominal rate of return. Again, 15 million getting 25,000 per year, which is significantly lower than even what we were getting when we were running it ourselves.'",
        "'speaker_0': 'So that's my position, particularly as a District two person is very familiar with this area and the other one is of course in the other district, but I know them both. So that's that's my opinion. Councilmember Herbold.'",
        "'speaker_5': 'Couple questions. First, clarifying question for you. Councilmember Harrell or Council President Harrell, are you saying that our our rate of return historically has been around $350,000 a year? In your back of the envelope calculation is it's it's looking like $25,000 a year with this.'",
        "'speaker_1': 'Deal.'",
        "'speaker_0': 'Correct. That 380,000 maybe. We asked this question during committee how much revenues are receiving now. We've we had a small operator and then we managed it ourselves. And I want to say upward of 350 to 400000 under the new lease that you're being asked to consider now will receive roughly around $25,000.'",
        "'speaker_0': 'It may go up as rents go up and rents will go up. So it'll increase, but only slightly based on the rent increase, but roughly 25,000.'",
        "'speaker_5': 'And that's my my second question as it relates to the rent increases. Chair Whereas you spoke to the fact that there can't be any rent increases until the capital improvements are made and that those parks superintendent has some oversight of rent increases.'",
        "'speaker_5': 'I was wondering if, one, you could speak to what constraints the park superintendent is under in approving requested rent and increases in two. Are there any expectations in.'",
        "'speaker_3': 'The.'",
        "'speaker_5': 'In the agreement that relate specifically to the number of slips? That would be another concern I would have is if under this new agreement, they were allowed to reduce the total number of slips.'",
        "'speaker_3': 'Available for for public.'",
        "'speaker_2': 'Use. Well, maybe you should it to my committee for the last six months, but I will answer that, first of all. Number one, we actually changed the conditions in the lease that the superintendent first of all, number one, we changed the first and most important thing is that nobody's slip increase, rent increase would occur unless all capital'",
        "'speaker_2': 'improvements were done. And there's an attachment that has a list of all the capital improvements. The second piece is, as you said, and that's a very good question because that was brought up by many people that came and gave public comment, is that the increases will be done if their lessee slips of 30 feet and under will'",
        "'speaker_2': 'have a cap of $12 adjusted by CPI. Some may argue that's rent control with people, with boats. All other slip increases will have to be rationalized with a market study. So what we did in this was council. Harrell's concern is that the tenant wouldn't just be allowed to just raise the rent.'",
        "'speaker_2': 'They would have to show the superintended a market, study a reasonable rates and give them the tenant would have to give the superintendent 60 days notice that this is what they intend. And then the superintendent can make a decision whether or not to allow the tenant to raise the rent.'",
        "'speaker_2': 'And the superintendent cannot unreasonably deny or delay the tenant's request. And then Councilmember Bagshaw made sure that there were particulars in the lease so that people have an opportunity to voice their concerns about raising raising the rent. And again, the people that live on board, I understand, will be grandfathered in.'",
        "'speaker_2': 'And as far as and I just want to share this and just briefly how we got here. And again, I wasn't here five or six years ago because that's how long this has been going on. The city and marine management will partner to support the renovation projects, which we estimate will actually be on an estimate between 16'",
        "'speaker_2': 'and $18 million, which we just don't have the money for. There's a reason why for decades and decades, we've had private operators managing these marinas, not the city. We've only been doing it for a couple of years. The partnership leverages the city's 3.8 million capital improvement allocation for the mortgages, increasing the scope of the improvements.'",
        "'speaker_2': 'So management will pay for all operating expenses related to the management and operation of the marinas. Re management is responsible for paying annual DNR lease payments, lease excise taxes and other taxes and penalties, including the lease and marine management, will pay rent in the amount of 3% of gross revenues.'",
        "'speaker_2': 'Now, this is a 20 term lease, and what I understand from legal that that's not uncommon. As you know, in the state of Washington, the the there is no. One of the few states in this country that allow private ownership of Thailand's.'",
        "'speaker_2': 'However, in this case, the state of Washington owns all the tidelands we own. Basically the effect not physical fixtures, but the buildings, which, as you can see from the pictures, if you looked at, are completely dilapidated as well as the docks.'",
        "'speaker_2': 'So this was what the agreement came to. Hence six drafts of it. And I want to add to that, we did take into the account about displacement and the DNR leases and we did make sure that we worked with legal and the superintendent on how what the process would be for people that are there, that people aren't'",
        "'speaker_2': 'displaced. And this is what we came up with.'",
        "'speaker_3': 'One other just answer to your question about the number of slips that's in attachment F to the lease agreement. And let's just take less shy as an example. You'll see reading down that there are 52 spaces for 25 foot slips.'",
        "'speaker_3': 'The same with 30. And then there are a couple of lines there for 60 foot slips. That's a pretty big boat to have a 60 foot slip, but those can be divided into throws or even two tows if they want to have some smaller boats on there.'",
        "'speaker_3': 'So in attachment, if you will see that those are the minimum set, what are expected, they may change as the configuration is put in play, but it gives that gives park some flexibility.'",
        "'speaker_0': 'So since we're all answering the question, I'll sort of give my answer as well. But I think what's critical about all these answers is, again, and this is not meant as a criticism of any of my colleagues, I just think it is what it is that the lease and even the attachment, these are aspirations, but it's not'",
        "'speaker_0': 'very specific. And I know that there's been emails to suggest that this slips and one of the marinas will drop from 138 to 1 or two. That's a those are very specific numbers, and I haven't seen anything to refute that.'",
        "'speaker_0': 'So again, I ask very simple questions like, when will the repairs be done? What's the schedule to be done? And if you ask central staff that, I think he would tell you he can't tell based on these documents because that's how scanty they are, in my opinion.'",
        "'speaker_0': 'Again, I think there's an enormous amount of sort of good faith in this lease, but I don't think we're here to make decisions on good faith. We're here to look at both the letter of the lease and the policy goals we're trying to achieve.'",
        "'speaker_0': 'And I say this particularly in terms of public private partnerships, particularly one that so long and again, this is these are, you know, I'm saying 15 to $16 million worth of assets and huge opportunities, by the way, when we're talking about particularly reaching residents in 98118, if you ask me, well, what would you how would you like'",
        "'speaker_0': 'to proceed? I'd like to fix like less shy and with capital improvements and really start from scratch on what the design to look from Lakewood. But you don't even have to start from scratch because all of that good community work has been done.'",
        "'speaker_0': 'But again, to sort of turn the keys over for 20 years, I don't think is a prudent way to go, given these very simple questions like, well, what exactly will the number of slips be? Because there's too many ambiguities, I think, in the attachments, because they're not we're not bound to the attachment.'",
        "'speaker_0': 'There's still there's still a lot of wiggle room.'",
        "'speaker_5': 'I have one last question that gets memorable. The two tenure extension options, we refer to them as options. But there if I if I'm correct, they're only options for the tenant. We we don't have the ability to say no.'",
        "'speaker_5': 'If the tenant wants to once the two tenure extensions. Is that.'",
        "'speaker_2': 'Correct? My understanding is that we do have the ability to say, well, cancel it.'",
        "'speaker_0': 'Yes, I could. Why don't I move to suspend the rules? Why don't I spin rules and. Mr. Goodenough, would you like to just answer that one question?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'On the options.'",
        "'speaker_1': 'Ranga Knight Council Central Staff. So it is the option of the tenants to it. As long as the tenant has completed the capital improvements and is not in default of the lease, then they have the option to exercise the ten year extension options.'",
        "'speaker_5': 'Thank you. Yeah.'",
        "'speaker_0': 'Thank you, Mr.. Goodnight. Uh, okay. Well, we've got sort of Councilmember Bryan, please. Yeah, I'll.'",
        "'speaker_1': 'Just be brief. Council resident here. I share your concerns and your comments, and so I will also be joining you in voting no on this.'",
        "'speaker_0': 'Thank you. Any other concerns or questions at this point? Councilman, where did you want to see any closing remarks before we vote? Thank you. That's picture. Okay. Just let me get my notes. Okay. So we have a bill that came out of committee, so please call the role on the passage of the Bill O'Brien.'",
        "'speaker_1': 'No. No.'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'You've got a choice as to. Who knows?'",
        "'speaker_2': 'Hi. Yeah. Yeah.'",
        "'speaker_1': 'Burgess Hi.'",
        "'speaker_2': 'Gonzalez Johnson Whereas I.'",
        "'speaker_3': 'Herbold No. President Harrell.'",
        "'speaker_0': 'Nope.'",
        "'speaker_2': 'Five in favor, three opposed.'",
        "'speaker_0': 'Okay, I'll kick. Please read the next agenda item into the record. I'm sorry. The bill passed and Cher was silent. Thank you for that. And please read the next gen item.'"
    ]
}