{
    "A RESOLUTION affirming The City of Seattles support of Marjory Stoneman Douglas High School students demand for gun reform in the wake of the February 14, 2018, Parkland, Florida, massacre that resulted in the death of 17 children and teachers.": [
        "'speaker_0': 'Bill Pass and Chair of Senate. Please read the new agenda item number one, which is actually an item number 13 as of the record.'",
        "'speaker_2': 'From the amended agenda. Agenda item 13 Resolution 31803 Affirming the City of Seattle Support for Marjorie Stone. Stoneman Douglas High School Students Demand for gun reform in the wake of the February 14, 2018 Parkland, Florida, massacre that resulted in the death of 17 children and teachers.'",
        "'speaker_0': 'Councilmember Gonzalez.'",
        "'speaker_2': 'Thank you. Resolution 31803 does a few things. One, it recognizes some of the work that we have done at the city of Seattle level to to address gun violence issues that we're here to discuss today. And I just want to talk a little bit about those, because we hear we heard a lot in public testimony about the'",
        "'speaker_2': 'frustration of our elected leaders ability to or willingness to act. And the reality is, is that there are things that we can do as local cities like the city of Seattle to to at least support some of the efforts that we're hearing about here and to address some of these significant public safety and public health concerns.'",
        "'speaker_2': 'And it's important for cities to fill that space with policies that are going to make a difference. But we know that what we really need are our congressional and state representatives to be bold in this area, to allow us to be able to do more at the city, to support and support folks who are impacted by gun'",
        "'speaker_2': 'violence and hopefully be able to prevent ongoing police violence. So here in the city, we've passed a law that imposes a tax on the retail sale of guns and ammunition in order to raise money for the city so that we can use that to provide broad based public benefits for residents of Seattle related to gun violence by'",
        "'speaker_2': 'funding programs that promote public safety, prevent gun violence, and address, in part, the cost of gun violence in the city. We've also passed previously a resolution related to responsible and progressive protocols for police gun procurement, including the destruction of service firearms that are no longer needed by the Seattle Police Department rather than selling those guns to the'",
        "'speaker_2': 'market. We've also passed a resolution related to supporting the creation of a statewide Extreme Risk Protection Order program, which allows family members and law enforcement to ask a court to take away the firearms of an individual who is presenting to be a serious danger to themselves or others.'",
        "'speaker_2': 'In the 2017 and 2018 city budget. The Council and Mayor. Dedicated funding to create and implement a Regional Domestic Violence Firearms Surrender program comprised of the City Attorney's Office, the King County Prosecuting Attorney's Office, the Seattle Police Department, and the King County Sheriff's Office to enforce the requirement for persons served with domestic violence or extreme risk protection'",
        "'speaker_2': 'orders to surrender their firearms and track and prosecute persons violating those orders. That's a first of its kind unit in the country, and I'm proud to say that we have been receiving a lot of inquiries by neighboring law enforcement agencies wanting to know how it is.'",
        "'speaker_2': 'We were able to implement this kind of a program and really looking forward to that, that taking a hold in other parts across our state and across our country as a clear way of removing guns out of a situation that that that is really ripe with and does see a lot of deaths resulted to gun usage.'",
        "'speaker_2': 'So those are the the different ways that we have already played a role in this particular space. This resolution does a few things. One, it encourages the Seattle Public Schools to support its students rights to assemble and participate in the national school walkout on March 14th, 2018 at 10 a.m..'",
        "'speaker_2': 'We see that here at the City Council as just a fundamental constitutional right of our students to be able to. A petition government, the city council and the mayor. This resolution also provides that the city council, the mayor will supports the efforts of our public school educators and administrators to also show their solidarity for the students rights'",
        "'speaker_2': 'to remain safe from gun violence in schools. And and again, students rights to assemble and to continue allowing those teachers and administrators to help students learn how to organize peaceful walkouts and protests to create positive and lasting change in our community.'",
        "'speaker_2': 'We also take some positions in this resolution as it relates to as it relates to enacting stricter and common sense gun reform laws, including creating tighter background checks, banning the purchase of bump stocks, reasonably restricting automatic assault rifles and semi-automatic weapon purchases, fully funding mental health, and a call to pass crisis prevention legislation such as what we'",
        "'speaker_2': 'recently saw proposed in our own house. So these are just a few things that this resolution does, and I will have some closing remarks. But I wanted to just describe the basics of the resolution before I made my closing remarks, and now would be also be an appropriate time for me to recognize the staff in my office'",
        "'speaker_2': 'who have really helped to draft this piece of legislation and helped get so many of you organized in here in in this room today. And so I want to thank Stephanie Landecker from my office, who is interning in my office this year, and Roxana Gomez, who is one of my legislative aides.'",
        "'speaker_2': 'So thank you to those two wonderful ladies for all the work that they've done to present this resolution for full council's consideration today.'",
        "'speaker_0': 'Thanks, Councilwoman Gonzales. Any further comments from my colleagues? Councilmember O'Brien.'",
        "'speaker_5': 'I just want to thank all the young leaders who are here today throughout the community, throughout across this country that are doing the organizing work. I'm really sorry that despite obvious actions that we could have taken for years, the adults in our country have not stepped up and made that happen.'",
        "'speaker_5': 'And that is falling upon you to fix something that so needs fixing. But I'm grateful when I see young people coming together to lead on this issue that's so critical to them. And I'm optimistic that despite failed attempts in the past, that things will actually change because of your actions today.'",
        "'speaker_5': 'So thank you so much.'",
        "'speaker_0': 'Thank you. Cuts from Bryan Councilmember Slot.'",
        "'speaker_3': 'Thank you, President Harrell. I will certainly be supporting this resolution, needless to say. And I also wanted to say to all the students here, both as an elected representative, but also as a teacher myself and as a teachers union member.'",
        "'speaker_3': 'I really applaud the leadership you're showing and also the incredible, just historic leadership shown by young people and students throughout the nation, starting, of course, for the leadership of the courageous students in Florida and the incredible courage in calling out something that has, you know, something that everybody knows about but really wasn't being called out in the'",
        "'speaker_3': 'way that young people have done, which is the gun lobby and corporate lobbying in general and the influence that they have in politics. It was incredibly empowering to me personally to see the video in which Marco Rubio was challenged by some of the students saying, will you will you stop taking money from the gun lobby?'",
        "'speaker_3': 'And he is flummoxed because he's not even he's not even at a point where he's willing to say yes after this horrendous tragedy and tragedy after tragedy. I will stand with ordinary people. I will stand with young people and I will stand against gun violence in schools.'",
        "'speaker_3': 'So I really support everything you're doing. I will be there with you on the 14th and the 24th. And let's make sure that we demand schools free of gun violence and also schools that are fully funded by taxing the same big business so that we have we make sure that affordable, high quality education is accessible to all'",
        "'speaker_3': 'students. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Swint, Councilman Herbold.'",
        "'speaker_2': 'Thank you. My colleague to my left here, Councilmember Johnson, also often speaks from the perspective of somebody who has school age children. I don't have school age children in public schools. I do have school age grandchildren. And, you know, what I've been hearing since these most recent shootings is something very different than the public outrage and outcry'",
        "'speaker_2': 'after other public shootings in schools. And it's not. Only what I'm hearing is courageous community organizing and coming together and making your voices heard. But what I'm hearing that pains me tremendously as I'm hearing children say that the adults aren't taking care of them.'",
        "'speaker_2': 'And I think that's what's really going to make the difference this time around and is going to compel us to do to do more to take care of our children. Thank you.'",
        "'speaker_0': 'Thank you. Comes from Herbold. Katherine Johnson.'",
        "'speaker_5': 'And and to that point, I think a request for action. I mean, what we're hearing time and time again is a demand from not just the parents, but more importantly, those children that we want to see action. I am fortunate enough to have a friend who graduated from Parkland and saw her shortly after the shooting, and she'",
        "'speaker_5': 'was so proud of those students and not only standing up for themselves in those moments of grief, but standing up for other students all around the country.'",
        "'speaker_0': 'Thank you. What I'd like to say is, first of all, I'm very moved and inspired by the voice of the youth. Believe it or not, I was I was young once and and I would question sort of the the idiocy of senior leaders in our country.'",
        "'speaker_0': 'And I'm reminded by a martin Luther King quote where he said, there can be no deep disappointment, where there's no deep love. Very moved by our this young man serving our country and serving his country and then still questioning, as he should, the lack of wisdom and gun responsibility.'",
        "'speaker_0': 'How many more lives do we have to lose before our whole country wakes up and realize we have bad policies in place in our state, in our state, long under. I think it's very. CW 9.41.290, which is just bad policy.'",
        "'speaker_0': 'It's just a bad law. Just preempts cities like ours from actually taking bold measures to enact reasonable, safe laws. The ability to just take a gun away from someone who's intoxicated as an example, just things that would just seem to make sense that we are prohibited by law from doing.'",
        "'speaker_0': 'And so we have some very bad laws in place. But I am inspired by the voice of the youth that. I think we'll have a culture change here through this kind of inspiration that we see. And so, yes, it starts with a walk out in 17 minutes and we turn 17 minutes into 17 laws that can change'",
        "'speaker_0': 'this, the city, the state in this country. So thank you for your testimony. I think, Councilmember Gonzalez, for pushing this and in drafting this and your staff for bringing this to the city's attention.'",
        "'speaker_3': 'No one less.'",
        "'speaker_0': 'Hey, you said no one else bring and back. So thank.'",
        "'speaker_3': 'You. Thank you. All this has been something that I greatly appreciate and all of, you know, not just the tragedy that we felt here in Florida, but the numbers that we have seen in this country. From Orlando up to Las Vegas, there were over 500 separate incidents of mass shootings.'",
        "'speaker_3': 'And what shocked me is that it took Florida. I thought that at Sandy Hook that was it, that when a gunman took after babies, I thought, this is it. It is going to be the last straw. Five years later, it took Florida and it's taken you.'",
        "'speaker_3': 'And I want to say thank you very much from my heart, because I think finally this country is coming together in ways that we have not. Moms rising, if you're still here, thank you for the work you're doing.'",
        "'speaker_3': 'The Grandmothers Against Gun Violence locally, it matters because it's not just our young people, but it is our seniors who are saying it is really time. It's really time for us to stop this nonsense and look at what we can actually do.'",
        "'speaker_3': 'And at the state, I want to say thank you to our attorney general. You know, last year he presented legislation that would have banned assault rifles are king county prosecuting attorney has done a tremendous amount to say we are going to do things differently and just in in our own city attorney's office, recognizing the gun surrender laws'",
        "'speaker_3': 'that we have done. And as Councilmember Gonzales said, we funded this last year. We got money up to do it. We are doing things with our courts that are going to make a difference. It's not even beginning to be enough.'",
        "'speaker_3': 'But thanks to the people that are here today, the students thank you for what your visions are. We can do these things locally. We don't have to wait for Congress. God knows will wait forever if we have to wait for them.'",
        "'speaker_3': 'But fully funding mental health here in the state is going to be something I think that we can accomplish getting our the assault assault weapons banned in Washington state next year, making sure we have our mental health laws such that we can pass prevention legislation and do that next year.'",
        "'speaker_3': 'But the fact that you're standing up is making a big difference. I want you to know that.'",
        "'speaker_0': 'Thank you. Casper and Back Shore cancer czar for years.'",
        "'speaker_2': 'Thank you. So I want to thank first and foremost all of the student leaders who are here with us this afternoon. I really hope that you hear from me and that you've already heard from my colleagues how much we acknowledge and respect the work that you all have been doing to to fill a very necessary role in'",
        "'speaker_2': 'advocating for for your own safety. And and I'm really sorry that we as adults have left you in a position where you have no other choice but to do that. But now it's time for us to support your efforts here at home and across the country, to demand that our state and congressional representatives enact sensible gun safety'",
        "'speaker_2': 'laws that are going to make a difference every day. So today, the Seattle City Council stands with all of those impacted by gun violence here at home and across our nation. This resolution is a response to the Marjory Stoneman Douglas High School shooting in Parkland, Florida, where we know that 17 students and teachers were fatally gunned down'",
        "'speaker_2': 'and 15 others were injured. But it is also our commitment to these students, to their teachers and to the administrators of the Seattle Public Schools that we continue to that you all can continue to count on us as the city of Seattle to stand with you in your fight for your safety.'",
        "'speaker_2': 'Students should not have to feel worried about walking into their classrooms and whether or not that will be the last time they have an opportunity to do so. Parents should not feel scared about the possibility of never seeing their child again for the simple act of sending their child to school.'",
        "'speaker_2': 'Teachers should not be deputized to be both educators and law enforcement. This tragedy should not have happened, and it probably would not have happened had there been common sense gun safety laws in place paired with the mental health services and system that we know we need shooting after shooting, there is public outcry for our state and congressional'",
        "'speaker_2': 'representatives to take action on this. Issue, but no such action has occurred. It is a failure to turn a blind eye to these public safety and public health crises. And as history shows, we must often look to our future generation to show us the way when we as adults, lack the courage to lead.'",
        "'speaker_2': 'And in tragedies, sometimes we struggle to find hope. Today. I'm hopeful because our youth are showing us what it looks like to stand as one to say, enough is enough. We should all be inspired by our youth, who, in response to the Marjory Douglas shooting, have organized to loudly call for action and have refused to stand down'",
        "'speaker_2': 'and be intimidated by adults who claim to know better. We must recognize that our youth at home and across the nation are change agents pushing to create healthier communities and higher quality lives, both in and out of school.'",
        "'speaker_2': 'Unfettered access to machines that kill threaten us all. Standing with empowering and following the lead of our youth as they organize for their lives is what every adult should be prioritizing and supporting, whether you're an elected leader or not.'",
        "'speaker_2': 'I want to thank all young people for demanding action and refusing to accept NO as a policy solution to gun violence. So this Wednesday, March 14th, at 10 a.m., young students from Nathan Hale, Roosevelts and Ingram High Schools will be marching together from Roosevelt High School to the University of Washington to protest Congress's inaction for common sense'",
        "'speaker_2': 'gun safety laws. There'll be similar walkouts across the country, across the city. But this particular walkout, they will be gathering on Red Square at 11:30 a.m. for a rally. And I hope that everybody who is here and all those who are listening at home will make time to show up for our students and to support their efforts'",
        "'speaker_2': 'as as they continue to fight for what we all know is the right thing to do. Your reluctance to back down in this moment? And your reluctance to conform to the status quo is something we should all admire, celebrate and encourage.'",
        "'speaker_2': 'And of course, you also heard that there's going to be the march march for our lives here in Seattle on March 24th. That's going to begin at 10 a.m. at Calendar's in Park, and it's going to end with a rally at Key Arena.'",
        "'speaker_2': 'So I hope that you all hear us that this is a first step for us in supporting you all. We want to continue to hear from you. We want to continue to understand how we as a city with some of the legal limitations that we have on us, how we can really show up for you and and'",
        "'speaker_2': 'support all of the efforts that you are calling for in terms of legislative action at the congressional level and at the state level. So thank you so much for being with us. And I'm really proud to call to ask for the council president to call this resolution for vote.'",
        "'speaker_0': 'Very good. Thank you. Come spring, it's all those in favor of adopting the resolution. Please vote i. I. Those oppose vote no. The motion carries and the resolution is adopted and the chair will sign it. Thank you again, Councilman Gonzalez, and thank you for your testimony, all of whom are out there.'",
        "'speaker_0': 'Please read the reports of the planning, land use and Zoning Committee. I would go one through for.'",
        "'speaker_2': 'The report of the Planning, Land Use and Zoning Committee Agenda items one through four appointments 929 through 932 Appointment to re appointments to Justin Clerk Benjamin William Deputies Laura Haddad and Mark Johnson as member Seattle Design Commission for Term two February 29, 2020.'"
    ],
    "AN ORDINANCE granting City Investors XXV LLC permission to construct, install, and maintain two sets of private communication conduits under and across 8th Avenue North, south of Harrison Street and north of Thomas Street, for a ten-year term, renewable for two successive ten-year terms; specifying the conditions under which this permit is granted; and providing for the acceptance of the permit and conditions.": [
        "'speaker_2': 'The report on Sustainability in Transportation Committee Agenda and five cancel 119204 Granting City Investors 25 LLC permission to construct, install and maintain two sets of private communication conduits. The committee recommends the bill pass.'",
        "'speaker_0': 'Councilmember O'Brien.'",
        "'speaker_5': 'Thank you. This ordinance will grant a ten year term to allow two projects on the east and west side of eighth Avenue North between Harrison and Thomas Streets and South Lake Union to connect two communication conduits under the street.'",
        "'speaker_5': 'This will allow the tenants of those projects. Facebook is going to be leasing up both those projects to have secure communications between the two buildings as if they on a single site. The term permit is for ten years, renewable for up to two additional ten year permit terms and say the the project will pay the city fee'",
        "'speaker_5': 'on an annual basis. Currently it's a little over 20 $600 will be adjusted annually based on property values. If at any point the city needs access to where those conduits are, we have the right to revoke the permit.'",
        "'speaker_5': 'And for instance, if we needed to put some other utilities or something in the right away, this was this came before the council conceptually last fall.'",
        "'speaker_0': 'Thank you very much. Any further comments or questions? Now please call the roll on the passage of the Bill.'",
        "'speaker_1': 'Suarez by O'Brian Salon. Thanks to Gonzalez Herbold High Johnson President Harrell High aide in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to grant funds from non-City sources; authorizing the Directors of Transportation and the Seattle Center to accept specified grants and execute related agreements for and on behalf of the City; amending Ordinance 125475, which adopted the 2018 Budget, including the 2018-2023 Capital Improvement Program (CIP); changing appropriations to the Seattle Department of Transportation; revising allocations and spending plans for certain projects in the 2018-2023 CIP; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Bill past chair senate please read a goodnight and or six to short title.'",
        "'speaker_2': 'Agenda Item six Cancel 119205 relating to grants fund grant funds from non city sources authorizing directors of transportation self-centered to accept specified grants and executed related agreements for on behalf of the city. The committee recommends the bill pass.'",
        "'speaker_0': 'That's why. I'm Brian.'",
        "'speaker_5': 'Thank you. This is an ordinance that allows us to accept grants that we've applied for and been successful at. There are five projects listed on this grant acceptance ordinance. The total is about $9.5 million. The grants are coming from a mix of sources.'",
        "'speaker_5': 'Puget Sound Regional Council has a couple in Federal Transit Administration as a couple, and the Federal Highway Administration has one. If folks have questions, I'm happy to try and answer any comments.'",
        "'speaker_0': 'Questions. If not, please call the rule on the passage of the bill.'",
        "'speaker_1': 'Or as I. O'BRIEN So aren't I? BEGALA Hi. Gonzales I herbold. JOHNSON I'm President Harrell high eight in favor and unopposed.'",
        "'speaker_0': 'Bill Pass and chair of the Senate. Please read agenda item number seven the short title.'"
    ],
    "AN ORDINANCE accepting twenty limited purpose easements for public sidewalk, alley, utility, or street and alley turn-around purposes; placing the real property conveyed by such easements under the jurisdiction of the Seattle Department of Transportation; and ratifying and confirming certain prior acts. (This ordinance concerns the following rights-of-way: the sidewalk adjoining Tilt49, a condominium recorded under Recording Number 20150526000478; the sidewalk adjoining Block 6, A. B. Grahams University Addition to the City of Seattle; the sidewalk adjoining a portion of the Southeast quarter, Section 31, Township 26 North, Range 4 East, Willamette Meridian; the alley turn-around in Block 4, Lawton Heights; the sidewalk adjoining a portion of vacated Northeast 40th Street (Northeast Campus Parkway) and Block C, Brooklyn Supplemental Addition to the City of Seattle; the sidewalk adjoining a portion of the Southwest quarter of Section 16, Township 25 North, Range 4 East, Willamette Meridian, vacated 15th Avenue Northeast, and Block 36, Brooklyn Addition to Seattle; the sidewalk adjoin": [
        "'speaker_2': 'And ten tab in Southern Council Bill 119206 accepting 20 limited purpose easements for public sidewalk, alley utility or street and alley turnaround purposes, placing the real property conveyed by such easements under the jurisdiction set upon transportation and ratifying, confirming search and prayer acts, the committee recommends the bill pass.'",
        "'speaker_0': 'Councilmember O'Brien.'",
        "'speaker_5': 'Thank you. I'm going to speak to this agenda item in the next two, if that's okay, because they're kind of bundled together, but folks can ask questions independently. As new construction happens throughout the city, the unique circumstances of each parcel.'",
        "'speaker_5': 'Sometimes it's required that the city either get an easement or a transfer of property through a deed. Sometimes that is to line up the right of way so the sidewalk is the appropriate width. Sometimes it's to allow access to part of the property where there would be utilities running or the likes.'",
        "'speaker_5': 'With the amount of development that's happening, we're seeing a number of these come through here. So this agenda item and the next two council bills each can contain about 20 projects, a total of close to 60, either easements or deeds.'",
        "'speaker_5': 'This particular council bills a series of easements. The next two relate to deeds where we're accepting ownership of the property.'",
        "'speaker_0': 'Very good. Any further comments? If not, please call the rule on the passage of the bill or else.'",
        "'speaker_1': 'O'BRIEN All right. So on bakeshop. Gonzalez Herbold All right. Johnson President Harrell eight in favor and unopposed.'",
        "'speaker_0': 'Bill passes and chair of Senate please read agenda item number eight to short title.'"
    ]
}