{
    "AN ORDINANCE authorizing, in 2017, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Parks and Recreation, Seattle Fire Department, Seattle Police Department, the Seattle Department of Transportation, and the Cable Television Franchise Subfund to accept specified grants and private funding and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'We can read the short title. Okay. And we'll take them individually, but we'll read a few in groups. And so we'll try to talk through that as we go through. So let's start with Jeanette in number five. Please read that in the record.'",
        "'speaker_10': 'The report of the Select Budget Committee Agenda Item five Constable 119 122 authorizing 2017 acceptance of funding from non city sources committee recommends the bill pass.'",
        "'speaker_0': 'Okay now just to puts Councilmember Herbert I was going to say before you describe what we're doing is I think we sort of have some. Notes on where there may be an adjustment here there. So I wanted to make sure our accounts members are more at ease or we're not going to sneak anything through.'",
        "'speaker_0': 'And you were you didn't catch it. So we'll make sure we slow it down when we have to. So, Councilman Herbold, you have the floor.'",
        "'speaker_9': 'Thank you. I was thinking that I would say just a few opening remarks.'",
        "'speaker_3': 'At the start.'",
        "'speaker_9': 'And then hold remarks related to the items contained within the budget itself until we get to item 35, which is the adoption of the budget itself.'",
        "'speaker_0': 'Very good.'",
        "'speaker_1': 'All right, great. Very good. All right.'",
        "'speaker_9': 'So with that, I will make my opening remarks. Thank you. So over the course of the last seven weeks, my fellow council members of the Budget Committee and I have scrutinized and debated Seattle's fiscal priorities. Our vote today to approve city spending reflects our collective attempt to balance the budget amidst a multitude of competing priorities.'",
        "'speaker_9': 'As Chair of the Budget Committee, I was responsible for assembling a final balancing package that was challenging and addressed the values of our constituents, especially those with the most urgent needs. I believe our most vulnerable communities deserve our best efforts and today the budget we pass will reflect that effort together.'",
        "'speaker_9': 'My council colleagues and I have managed to, through the committee process, pass several important amendments to the budget that we'll discuss a little a little later. And these amendments will meaningfully impact the lives of everyday people in Seattle.'",
        "'speaker_9': 'All the while maintaining current, current service levels. We often talk about prosperity, not lifting all boats, but the proposition that we are faced with and the reason why the head tax was proposed is because economic prosperity is not only failed to help everybody, but this economic prosperity is resulting in some people being harmed.'",
        "'speaker_9': 'And I believe that the beneficiaries of that prosperity must do more to address the impacts of the prosperity that has not been shared by all. In seeking a budget that had at its core, principle of fiscal responsibility and sustainability.'",
        "'speaker_9': 'I proposed a progressive, ongoing revenue source to support a surge in affordable housing production. I proposed it in my in my balancing package. The credit goes to councilmembers O'Brien, Harris, Talley, and so on for for identifying it as a proposed source.'",
        "'speaker_9': 'And though the council did not pass that that revenue source, the council will be considering a resolution, which we'll talk about a little bit later, to assemble a task force to develop recommendations for that dedicated progressive revenue source to support people experiencing or at high risk for homelessness.'",
        "'speaker_9': 'This is a huge win for those who have been waiting for something big and bold to address the city's civil emergency on homelessness. And I want to specifically thank the efforts of the Housing for All coalition and everyone who has come out to testify and support their priorities, not only at two public hearings, but folks have been'",
        "'speaker_9': 'here in each of 11 Budget Committee meetings testifying, holding our feet to the fire. Your engagement has made this a better budget process, a better budget. And I count on your ongoing activism to push the Council to enact ongoing, sustainable, progressive revenue sources in the future.'",
        "'speaker_0': 'Very good. So we have counts, Bill 119122 in front of us and we're going to proceed with the vote. Unless you're any further comments, please call the roll on the passage of the bill.'",
        "'speaker_1': 'Johnson, Maurice O'Brien. Sergeant Bagshaw. Hi, Gonzales. I tally I hold High President Harrow High nine in favor and unopposed.'"
    ],
    "AN ORDINANCE amending Ordinance 125207, which adopted the 2017 Budget, including the 2017-2022 Capital Improvement Program (CIP) (commonly known as the 3rd quarter supplemental); changing appropriations to various departments and budget control levels, and from various funds in the Budget; revising project allocations for certain projects in the 2017-2022 CIP; making cash transfers between various City funds; transferring positions; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Bill pass ensure assignment please read item six, seven and eight is the record short title.'",
        "'speaker_10': 'Agenda item six through eight Bill 119 123 and many Ordinance 125207, which adopted the 2017 budget, including the 2017 three 2022 Capital Improvement Program. The committee recommends this bill passes amended agenda item seven Clerk filed 31432 2018 Proposed Budget Committee recommends this file be placed on file the agenda item eight CR File 314 383 2018 through 2022'",
        "'speaker_10': '. Proposed capital improvement programs can be recommence at this resolution excuse me, in the file we place on file.'",
        "'speaker_0': 'Because for her vote.'",
        "'speaker_9': 'Nothing further to add.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'So seven, eight, we're just filing it. Six is the the ordinance. Any other comments on that OC? Please call the roll on the passage of the Council bill in June. Item number six.'",
        "'speaker_1': 'Johnson Suarez O'Brien. Sergeant Bagshaw. Hi, Gonzales. I Harris tally i herbold hi. President Harrell All right. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair assignment on agenda item number seven the clerk file those in favor of filing clerk file 314382 Please vote i i those oppose vote no. The motion carries on file is placed on file. The next agenda item.'"
    ],
    "AN ORDINANCE relating to regulatory business and professional license fees; adjusting business and professional license and registration fees associated with the regulated activities of alarm monitoring, trade shows, residential sales, tow companies, used and recycled goods, adult entertainment, and price scanning; and amending Seattle Municipal Code Sections 6.08.010, 6.10.010, 6.20.040, 6.204.030, 6.204.080, 6.214.270, 6.250.060, 6.270.060, and 7.04.645.": [
        "'speaker_0': 'Those in favor of filing. Clark 314. Clark file 314383. Please vote i i those oppose vote no. The motion carries and that file is placed on file feed read agenda items nine through 12 the short title as well.'",
        "'speaker_10': 'Legend Item nine counts bill 119111. Relating to regulatory, business and professional license fee, the committee recommends the bill pass agenda item ten Council Bill 119112 relating to pet adoption fees and other animal control fees. Committee recommends this bill pass agenda item 11 Casper 119106 related to fees and charges for permits and activities of the SEAL, Department of'",
        "'speaker_10': 'Construction, inspections and related fees by other departments and technical corrections. The Committee recommends this bill pass and Agenda Item 12 Council Bill 1190 99 relating to street and sidewalk use committee recommends the bill pass.'",
        "'speaker_0': 'Okay, this should be pretty perfunctory. Comes from a did you need to say anything on these?'",
        "'speaker_9': 'Do not.'",
        "'speaker_0': 'Okay. So please call the roll on agenda item number nine.'",
        "'speaker_1': 'Johnson Marez O'Brien Sergeant Bagshaw Gonzalez I. Harris Talley. Herbold. Hi. President Harrell. Hi. Nine in favor. Nine opposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Please read the please call the role on the passage of Council Bill 119112 Johnson Suarez.'",
        "'speaker_1': 'O'Brien Sergeant Bagshaw Gonzalez Hi Harris Talley Herbold Hi. President Arrow Hi. Nine In favor and unopposed.'",
        "'speaker_0': 'Bill Pass and Chair was silent. Please call the roll on council. Bill 119106.'",
        "'speaker_1': 'Johnson.'",
        "'speaker_6': 'Hi.'",
        "'speaker_1': 'Suarez. O'Brien. Sergeant Bagshaw. Gonzalez. Harris. Talley. Herbold. Hi. President Harrell. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you. The bill passed and chair of Senate. Please call the roll on council. Bill 119099.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien. Sergeant Bagshaw. Gonzales, I. Harris. Talley. Herbold. Hi. President Harrell. I nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; establishing the 2018 fee schedule for the use of park properties and other park and recreation facilities and services; and superseding previous park and recreation fee schedules.": [
        "'speaker_0': 'The bill passed and chair of Senate please read items 13 through 15 into record and a short title please.'",
        "'speaker_10': 'Agenda Item 13 Constable 119108 relating to the Department of Parks and Recreation, the committee recommends the Bill Pass Agenda and 14 Council Bill 11910 to relate to the drainage and wastewater system of the city of Seattle. The committee recommends that all pass and Agenda 15 Council Bill 119103 lead to the drainage and wastewater systems of the City'",
        "'speaker_10': 'of Seattle. Committee recommends the bill pass.'",
        "'speaker_0': 'Very good. And proceed. Councilman Herbert.'",
        "'speaker_9': 'Nothing to add.'",
        "'speaker_0': 'Okay. Please call the roll on, Constable 1191085.'",
        "'speaker_1': 'Whereas. O'Brien Sergeant Bagshaw. Gonzales, I. Harris. Talley. Herbold. II. President Harrell II. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chose. Sign it, please call the roll on council. 119102.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien. Sergeant Bagshaw. Gonzales, I. Harris. Talley. Herbold, i. President Harrell. Nine in favor. Nine A post.'",
        "'speaker_0': 'Will pass can show. Sign it. Please call the roll on the passage of council. Bill 119103.'",
        "'speaker_1': 'JOHNSON Whereas. O'BRIEN Sergeant Bagshaw. GONZALEZ Hi. HARRIS Talley. HERBOLD Hi. President Harrell, I. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to contracting indebtedness; authorizing and providing for the issuance and sale of limited tax general obligation bonds to pay all or part of the costs of various elements of the Citys capital improvement program and for other City purposes approved by ordinance, and to pay the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; amending Ordinance 125197 to rescind and reapprove the authorization for certain previously authorized but unissued debt; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Thank you. The bill passed in show senate. Please read item 16 through 21 in the short title.'",
        "'speaker_10': 'Agenda item 16 321 Council Bill 119110. Lean to Contracting Adeptness Committee Recommends the bill passes amended council bill 119109 relating to Contracting and deafness committee recommend civil pass cancel 119108. Related to the solid waste system the city of Seattle can be recommends the bill pass.'",
        "'speaker_10': 'And Council Bill 119105 relating to the electric system of the City of Seattle. Can we recommend that the bill passed? Cancel 119104 Relating to electric system the city of Seattle. The committee recommends the bill pass and cancel 119 100 the related solid waste water system.'",
        "'speaker_10': 'The City of Seattle. The committee recommends the bill pass.'",
        "'speaker_0': 'Very good, Mayor. Proceed. Councilmember Herbold.'",
        "'speaker_9': 'Yes, please.'",
        "'speaker_0': 'Okay. Please call the roll on council. Bill 119110.'",
        "'speaker_1': 'JOHNSON Whereas I. O'Brien Sergeant Bagshaw. I. Harris Talley. Herbold. Hi. President Herrell. Hi. Nine In favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of Senate. Please call the roll on. Constable 119109.'",
        "'speaker_1': 'JOHNSON Whereas.'",
        "'speaker_6': 'O'BRIEN All right.'",
        "'speaker_1': 'Sergeant Major Gonzalez, I. HARRIS Talley. Herbold hi. President Harrell I nine in favor and unopposed.'",
        "'speaker_0': 'Bill passing cheryl senate. Please call the roll on council 119101.'",
        "'speaker_1': 'JOHNSON All right. O'BRIEN Sergeant Bagshaw. Gonzalez I. HARRIS Tally I. Herbold President Harrell, I. Nine in favor an unopposed.'",
        "'speaker_0': 'Bill passed and show Senate. Please call the roll on cancel 119105.'",
        "'speaker_1': 'Johnson Whereas. O'Brien Sergeant Bagshaw. Gonzalez, I. Harris. Talley. Herbold. II. President Harrell, i. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chose. Sign it. That was 105. Correct. Okay. Please call the roll on council bill 119104.'",
        "'speaker_1': 'JOHNSON Whereas.'",
        "'speaker_6': 'O'BRIEN All right, Sergeant Bagshaw.'",
        "'speaker_1': 'Gonzalez I. HARRIS Talley. Herbold, President Harrell I nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chose sign it please call the roll on council bill 119100.'",
        "'speaker_1': 'Johnson. I was O'Brien. Sergeant Bagshaw. Gonzalez. I hear his tally. Herbold. Hi, President Harrell. I nine in favor and unopposed.'"
    ],
    "AN ORDINANCE amending Ordinance 125212, relating to the financing of Equitable Development Implementation Plan projects; changing the source of the interfund loan from the Finance and Administrative Services Fund to the Revenue Stabilization Fund; increasing the loan of funds from $6,500,000 to $16,000,000; and amending Ordinance 125207 to change appropriations to various departments and budget control levels and from various funds in the 2017 Budget.": [
        "'speaker_0': 'Bill passed in show sign please read. Agenda item number 22. And for the record, the short term.'",
        "'speaker_10': 'Agenda item 22 cancel 119 135 amending ordinance 1252 and two relating to the Finance of Equitable Development Implementation Plan Projects Committee recommends the bill pass.'",
        "'speaker_0': 'Concerning Herbold.'",
        "'speaker_9': 'I don't have any comments, but perhaps Councilmember O'Brien might have a comment. I believe this is related to the development implementation.'",
        "'speaker_0': 'Plan piece.'",
        "'speaker_6': 'I think and agenda item 33 is the one I'm. Okay.'",
        "'speaker_0': 'So we are just wondering if you wanted to grandstand a little bit on it. You're pushing.'",
        "'speaker_6': 'It. Are you good?'",
        "'speaker_0': 'Okay. He's good. Councilmember Branch. Good. All right. This is part of his leadership council. That's leadership right there. So he just gets the work done. Doesn't worry about the credit. Okay. Please call the roll on council.'",
        "'speaker_1': 'Bill 119135 JOHNSON Whereas O'Brien, Sergeant Bagshaw Gonzalez I hear his tally I Herbold I President Harrell I nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the financing of certain general government programs; authorizing an interfund loan from the Housing Incentive Subfund of the Office of Housing Fund to the General Subfund Fund.": [
        "'speaker_0': 'The bill passed and Cheryl sign it please rate items 23 through 28 together in the short title.'",
        "'speaker_10': 'Cancel 119 132 relating to the financing of certain general government programs. Can we recommend the bill pass as amended? Agenda Item 24 Cancel 119 129 relating to the financing of tax administration system improvements and regulatory license systems in the Department of Finance Administrative Services.'",
        "'speaker_10': 'The committee recommends the bill passes amended agenda item 25 Cancel 119 134 relating to the financing of 2018 activities evaluating effects of a sweetened beverage tax. The committee recommends the bill pass.'",
        "'speaker_0': 'Very good. I'm going to proceed.'",
        "'speaker_10': 'I'm sorry. I stopped at 25.'",
        "'speaker_0': '25. Very good. I mean, I.'",
        "'speaker_9': 'Appreciate you may proceed.'",
        "'speaker_0': 'Thank you very much. We're voting on item. Agenda item number 23. Please call the roll on council 119132 Johnson.'",
        "'speaker_1': 'Whereas O'Brien. Hi, Sergeant Bagshaw. Gonzalez. Hi there is Tally I Herbold. Hi, President Herald. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'The bill passed and chair of assignment please read the roll on Constable 119129.'",
        "'speaker_1': 'Johnson Suarez O'Brien Sergeant Bagshaw Gonzales I Harris Talley Herbold II President Harrell II nine in favor nine opposed.'",
        "'speaker_0': 'Bill Parsons show sign it, please call the roll on council Bill 119134.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien. Sergeant Bagshaw Gonzalez. Harris Talley. Herbold. Hi, President Harrell. Hi. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the financing of the Mercer West project; amending Ordinance 124904 to extend the term of an interfund loan.": [
        "'speaker_0': 'The bill passed in show senate. Please read login items 26, 27 and 28.'",
        "'speaker_10': 'Agenda Item 26 Constable 1190 98 relate to the financing of the Mercer West Project. The committee recommends the bill pass Agenda 27 Council Bill 119113 relating to employment in Seattle. The committee recommends the bill passed. Council Agenda Item 28 Counts Board 1119.'",
        "'speaker_10': 'When I was seven relating to the city Seattle's Emergency Relocation Relocation Assistance Program, the committee recommends the bill pass.'",
        "'speaker_0': 'Comes from her bill.'",
        "'speaker_9': 'Thank you. I would just like to speak briefly to item 27. Item 27 relates to the retirement savings program as proposed by Mayor Burgess, following up on his important work on this issue as a council member. This bill is modeled under after legislation establishing similar retirement systems.'",
        "'speaker_9': 'But passing this legislation will put Seattle at the forefront nationally of being the first city in America to implement this type of city facilitated, privately administered plan. It would give a framework to Seattle workers whose employers do not offer a retirement plan.'",
        "'speaker_9': 'An easier way to save for for retirement.'",
        "'speaker_0': 'Very good. Any further comments on items 26, 27, 28? If not, please call the rule on the passage of Council Bill 119098.'",
        "'speaker_1': 'Johnson. Suarez. O'Brian. Sergeant Bagshaw. Gonzalez. Perez. Talley. Herbold. Hi. President Harrell. Hi. Nine In Favor and unopposed.'",
        "'speaker_0': 'Bill Parsons Show Assignment. Please call the roll on Constable 119113.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien, Sergeant Bagshaw Gonzalez I. Harris Talley I. Herbold I. President Harrell I nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Please call the roll on Constable 119107.'",
        "'speaker_1': 'Johnson Marez O'Brien, Sergeant Bagshaw Gonzalez I. Harris Talley, I. Herbold, I. President Harrell. Nine In Favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the City Light Department; amending Ordinance 121176 to remove certain performance pay provisions.": [
        "'speaker_0': 'Bill Parsons Show Sign Please Read Agenda Items 29 332.'",
        "'speaker_10': 'Agenda Item 29 Council Bill 119115 relates to the City Department Committee recommends the bill pass agenda item 30 Council 119 120 Related to Organization of the Office for Civil Rights, the committee recommends the bill passes amended agenda item 31 Council Bill 119 124 Conditioning the Department of State excuse me conditioning the State Department.'",
        "'speaker_10': 'Transportation's 2018 Grant Applications Committee recommends the bill pass agenda item 32 Cancel 11913 6,000,000,002 Decreasing Mineralized Material Excuse me. Militarization of Police Activities Committee Recommends Bill Pass.'",
        "'speaker_0': 'Very good. Any comments and items 29 332 comes from Herbold.'",
        "'speaker_9': 'Thank you. I'm going to speak to items 30, 31 and 32, but I recognize that other council members might want to speak to those items as well. As it relates specifically to item number 30, this relates to the Office of Civil Rights.'",
        "'speaker_9': 'Back in September, in my Civil Rights, Utilities, Economic Development and Arts Committee meeting, we discussed discussion on an issue related to areas of the Seattle Office of Civil Rights that would actually benefit from having more independence for that office.'",
        "'speaker_9': 'Through incorporation of feedback from civil rights staff, through an engagement process that department ran. Our committee discussion and input from each. The Women's Commission, the LGBTQ Commission and the Human Rights Commission. We developed an ordinance that would require racial equity toolkit be done on the questions of permanent structure leadership and the duties and responsibilities as OCR.'",
        "'speaker_9': 'And it also outlined the governance structure of OCR during the the completion of the Racial Equity Toolkit Kit, including specifically allowing the Women's Commission, the Human Rights Commission and the LGBTQ Commission and the People with Disabilities Commission to advise on director appointments.'",
        "'speaker_9': 'Adding adding a firing for cause protection to the future associate director appointment and outlining a term for future directors of four years based on community input and request. We also included a recital regarding the intention to introduce an anti retaliation amendment in the next 60 days.'",
        "'speaker_9': 'As it relates to item 31, I just wanted to pull this one out because there's been much discussion and work done by my council colleagues, especially council member O'Brien, as it relates to how state can apply for funding on projects that this Council hasn't maybe fully vetted yet and given a green light on.'",
        "'speaker_9': 'And so this ordinance states that items that asked can apply for grants above 5 million. And then lastly, item 32 relates to demilitarization of police activities. This is an item that was brought to us by a network of progressive elected officials that each councilmembers, Gonzalez, O'Brien and myself are members of.'",
        "'speaker_9': 'And it specifically adds a new section of the municipal code stating that MPD will not participate in the U.S. Department of Defense's 1033 program, and it directs the department to take steps to withdraw from that from that program.'",
        "'speaker_9': 'This is in response to the issue of militarization of police departments nationwide. It's less of an issue in Seattle than in other places because we have not been participating, but we have not yet formally taken the steps to withdraw from that program.'",
        "'speaker_9': 'And we definitely want to memorialize the past practice, since police chiefs, mayors and council members come and go.'",
        "'speaker_0': 'Very good. Thank you for those comments. Guzman Herbold Councilmember Gonzalez.'",
        "'speaker_3': 'I just wanted to quickly talk about agenda item 32, which is the council bill that Councilmember Verbal just spoke about. So she and I sort of teamed up to get this over the finish line. And I, I took the lead on making sure all the right words were on the on the, on the paper and that the'",
        "'speaker_3': 'process was met so that she could focus on her budget share responsibilities. But I was really proud to be able to be the primary sponsor on this particular ordinance. And I think it is wise for us to memorialize this Council's desire and intent around federal surplus weaponry programs such as the 1033 program.'",
        "'speaker_3': 'And I think that this puts us on on on a clear and solid footing to make sure that that there is no slipping back in terms of the department's current commitment to not participate in that program. And they had an opportunity to review this ordinance and felt that it was a good step forward and they are completely'",
        "'speaker_3': 'willing and wanting to comply with this ordinance and are supportive of the passage of this particular bill.'",
        "'speaker_0': 'Excellent. Any further comments and items? 29 332. If not, please call the role on the pastor of Constable 119115.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien, Sergeant Bagshaw Gonzalez I. Harris Talley I. Herbold, i. President Harrell, I. Nine in favor an unopposed.'",
        "'speaker_0': 'Bill pass and show. Sign it. Please call the roll on the part of Constable 119120.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien. Sergeant Bagshaw.'",
        "'speaker_3': 'Gonzales, I.'",
        "'speaker_1': 'Harris. Talley. Herbold. Hi. President Arrow. Hi. Nine in favor.'",
        "'speaker_0': 'An unopposed bill passed and chose. Sign it, please call the roll on the passage of council. Bill 119124.'",
        "'speaker_1': 'Johnson Maurice. O'Brien Sergeant Bagshaw. Gonzalez Hi. Harris Talley. Herbold. Hi. President Harrell II nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and show sign it in, please call the roll on. Constable 119136.'",
        "'speaker_1': 'JOHNSON Whereas I. O'BRIEN So aren't I. BAGSHAW All right. Gonzales I. Harris Talley. Herbold Hi. President Harrell, I. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed in show side. Please. I'll try to give the clerks little time. You're shuffling just as fast as I am. So please read.'"
    ],
    "AN ORDINANCE relating to the Equitable Development Initiative; establishing a public purpose and authorizing the Director of the Office of Planning and Community Development to execute funding agreements for and on behalf of the City related to implementation of the Equitable Development Initiative.": [
        "'speaker_10': '33.'",
        "'speaker_0': 'Please read counts bill 119128 Jan 1933.'",
        "'speaker_10': 'Agenda Item 33 Counts Bill 119 128 Relating to the Equal Development Initiative, the committee recommends the bill pass.'",
        "'speaker_0': 'On key issues, I believe. Councilmember Herbold, it comes from O'Brien. I know. Councilmember O'Brien, you have the microphone.'",
        "'speaker_6': 'Correct me. This is the bill that I passed around, a proposed substitute on this morning, a council briefing. I just am passing around a revision to that based on our discussion this morning. Council President Harrell suggested something to remove the word marginalized.'",
        "'speaker_6': 'So the the copy you have in front of us removed that word from the second recital. It also some folks noticed that we had two sections for us this morning. And so this renumbered the last section to be a section number five for the public that wasn't watching.'",
        "'speaker_6': 'This is a bill around the Equitable Development Initiative. The substantive piece of this is it adds a Section four which says the Office of Planning and Community Development is requested to submit a resolution by July one, 2018 to formally create a community advisory board to advise on implementation of the Equitable Development Initiative.'",
        "'speaker_6': 'The Council's intent is that membership on the Advisory Board will consist of leaders from communities who have borne the burdens of racial inequity and from neighborhoods experiencing displacement. The resolution should clarify the role of the advisory board in city decision making.'",
        "'speaker_6': 'And as I mentioned this morning, we've worked with the Office of Planning Community Development and they are supportive of this amendment. So I would move to substitute version D to C for the one that is attached in the underlying agenda.'",
        "'speaker_0': 'It's been moved to second and the substitute version is a D to C or just to see. D2 C4 version one eight has been moved in second as any further comments on just a substitution. All those in favor of the substitution.'",
        "'speaker_0': 'But I, I opposed. But no, we have a new version. And any further comments on the substance of the legislation. Anyone else. Let's begin again. And under 33. Are we ready to vote? Okay, this is a bill. Please call the roll on the passage of the amended bill.'",
        "'speaker_1': 'Johnson. Suarez O'Brien. Hi, Sergeant Bakeshop. Gonzalez Hi. Harris tally i herbold i president Harrell I nine in favor an unopposed.'"
    ],
    "AN ORDINANCE relating to contracting by the Human Services Department; adding a new Section 3.20.050 to the Seattle Municipal Code to provide that the Seattle Human Services Department utilize a results-based framework for designing human service investments; amending Section 3.20.030 of the Seattle Municipal Code to clarify the duties of the Director of the Human Services Department with respect to contracting for human services to carry out department programs; and adding a new Section 20.50.020 to the Seattle Municipal Code to exempt contracts for human services executed by the Director from provisions of Chapter 20.50.": [
        "'speaker_0': 'Bill passed and show signage. Please read agenda item number 34.'",
        "'speaker_10': 'Agenda item 34. Cancel 119 125. Relating to contracting by the Human Services Department, the committee recommends the bill passed as amended.'",
        "'speaker_0': 'Very good. Who would like to speak on this item? Customer Herbold.'",
        "'speaker_9': 'Thank you. This ordinance was crafted with input from community providers, the Human Services Department, community based researchers. My fellow city council members. It is a new version of a bill that was referred to us by Mayor Burgess. Results based accountability is utilized at 77% of HST contracts.'",
        "'speaker_9': 'The ordinance is intended to direct HST and how to utilize our results based accountability in designing their future investments while maintaining some some oversight by the Council before that is done. It's crafted specifically to address potential unintended consequences related to results.'",
        "'speaker_9': 'Based contracting specifically includes the definition of culturally responsive research. And we did that because culturally responsive research is cognizant of and understands and addresses the cultural context in which the research takes place. This includes the inclusion of community based organizations and other stakeholder perspectives in designing the study, as well as designing the programs themselves.'",
        "'speaker_9': 'Developing the measures that those programs will be held to to meet. Interpreting the data and disseminating the findings. There's been a lot of discussion around pay for performance. This ordinance does not mandate performance pay, but allows it at the directors discretion.'",
        "'speaker_0': 'Very good. Thank you. Councilman Herbold, any further comments on this particular bill, Councilmember Sean.'",
        "'speaker_2': 'Thank you. President Harrell I made these comments at the Budget Committee meeting this morning, but I knew I should make them again because this is again being voted in for council. First, I want to say that I appreciate this version from Councilmember Herbold and the effort that was put into making the or trying to make the results'",
        "'speaker_2': 'based accountability contracting ordinance less harmful than the version that Mayor Burgess sent to council last month. However, the idea is fundamentally not beneficial to human service providers, and I intend to vote no. It will create additional red tape that human service providers will need to wade through to receive funding.'",
        "'speaker_2': 'The larger, well-resourced nonprofits will be able to hire the necessary accountants to make to get through. But community based nonprofits will find it difficult to meet the requirement no matter how excellent their work. It is to me akin to the standardized testing approach that has been shoved down the throats of our public schools by politicians who want'",
        "'speaker_2': 'to look like they're serious about. Improving education without doing the one thing that education needs, which is provide more funding for education so that class sizes are reduced. This is in the same vein, unfortunately, because our human service providers need more funds, not more red tape.'",
        "'speaker_2': 'When we talk about results, I think we have to you know, this is missing this. This approach is missing a fundamental reality, which is that how can human service providers possibly keep up with the expanding problem? And more and more people are in need of services because of the inherent situation in our in our city with the'",
        "'speaker_2': 'rising rents and so on. So I don't know how you can have results based accountability when it's a moving target that human service providers are dealing with. I think the Human Services Department should have the flexibility to approach each contract on its own merits rather than on the results based accountability trademarked framework.'",
        "'speaker_2': 'Plus, I'm not even clear why this was buried in the budget. It is not a budget legislation. The question I have is where is the task force but the human service providers who have expressed a lot of concerns?'",
        "'speaker_2': 'Where is the process? Again, I'm glad that Councilmember Herbold made this legislation less bad, but unfortunately, less bad does not necessarily mean helpful. So I will be voting no.'",
        "'speaker_0': 'Incumbents want any of their colleagues want to make any further comments. We'll just vote on it. I thank you for concerns to watch. I'll just say before I vote, I'm supporting legislation. But what she did articulate is probably my highest concern in this, and I just will believe that as we implement this, it is not a stick'",
        "'speaker_0': 'to thwart out some of these great organization, do some great work, but is to assist them even do the work better. But I'm hoping that the values in our hearts and trying to get this work done is shown in those service providers that we're working with.'",
        "'speaker_0': 'So we ready to vote? Please call the roll on the passage of council. Bill 119125.'",
        "'speaker_1': 'Johnson Maurice.'",
        "'speaker_6': 'O'Brien Hi.'",
        "'speaker_1': 'Sergeant. No. Bagshaw Hi. Gonzales, I. Harris Talley, I. Herbold i. President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Adan favor one opposed.'"
    ],
    "AN ORDINANCE adopting a budget, including a capital improvement program and position modifications, for The City of Seattle for 2018; and creating positions exempt from civil service; all by a 2/3 vote of the City Council.": [
        "'speaker_0': 'The bill passed and show sign it. Please read agenda items 35 and 36.'",
        "'speaker_10': 'Agenda Item 35 Constable 119116 Adopting a budget including a capital improvement program and position modifications for the City of Seattle for 2018. Agenda Item 36. Excuse me. The committee recommends that bill passes amended and item 36 clerk filed 314 384 City Council changes to the 2018 proposed budget and the 2018 three 2023 proposed capital improvement program.'",
        "'speaker_10': 'The committee recommends that the file be approved and placed on file.'",
        "'speaker_0': 'Any comments courtesy of Herbold?'",
        "'speaker_9': 'We read 36 into the agenda as well. Yes. I just want to take a few minutes just to do a quick overview. The council passed a number of items that ensured essential services already in place would not be rolled back.'",
        "'speaker_9': 'These include, but are certainly not limited to support for an emergency shelter serving over 230 survivors of domestic and sexual assault, existing permanent supportive housing services, transitional housing for homeless foster youth, sustained support for a homeless child care program, support for homeless youth employment programs and resources to continue funding the Zero Youth Detention Project.'",
        "'speaker_9': 'These are the actions, some of the actions, not all of them, but some of the actions that this council took. Simply to maintain existing services. But maintaining services is not enough. And we know that because of the crisis that we've identified, that we can see at our places of business or in our neighborhoods.'",
        "'speaker_9': 'In addition to the 4600 people in shelter and transitional housing programs, there are another 30 nearly 3900 people living unsheltered in our community. To begin to try to address some of those those those issues. We have identified funding in other key areas, but other things that we did beyond funding human services needs are include several items identified'",
        "'speaker_9': 'as priorities by by council members. Councilmember Gonzalez identified as a priority funding for public safety coordinator and pedestrian improvements identified by the South Park Public Safety Task Force. Councilmember Harrell identified as a priority funding for the Georgetown South Park Trail.'",
        "'speaker_9': 'Councilmember Johnson identified funding for positions to increase staffing at Magnuson Park. Councilmember Suarez included a priority funding for planning at Hubbard Homestead Park. Councilmember Johnson also prioritized in his budget, championing the creation of funding for a safe consumption site.'",
        "'speaker_9': 'Councilmember Bagshaw fought for funding for a new Homeless Youth Opportunity Center. Council President Harrell also added funding for priority hire. I worked to expand the ready to work. Program in southwest Seattle. Councilmember Juarez also fought for expansion of the lead program to North Precinct, as well as to begin taking referrals from the south and southwest precincts and'",
        "'speaker_9': 'southeast precincts. Councilmember Gonzalez led the fight for funding to support police accountability measures, including staffing for the Community Police Commission and positions of the Office of Police Accountability. Councilmember Swan put her stake in the ground for funding for tenant outreach and support statement services, as well as funding for additional authorized encampments.'",
        "'speaker_9': 'Councilmember Harris tally secured funding for additional HST staffing support, increased workload in addressing the homelessness crisis. Councilmember O'Brien got funding for a comprehensive Community Youth Diversion program. I also worked to support legacy business funding as well as including in that budget action funding for entrepreneurs who are women and people of color.'",
        "'speaker_9': 'And Councilmember Harris tally also worked to significantly increase participatory budgeting to allow the members of the public to identify their priorities for support for neighborhood parks and streets. Councilmember Bagshaw led the way to get additional funding for nursing support for public health needs, as well as nursing support for unsheltered homeless people.'",
        "'speaker_9': 'Councilmember O'Brien also worked to get funding to encourage employers to increase transit use among their employees. And Councilmember Gonzales also gets my thanks for leading the way to get additional funding for survivors of domestic violence and sexual assault, including mobile advocacy services and sexual assault protection order legal representatives.'",
        "'speaker_9': 'I want to thank my colleagues for their time, attention and patience throughout the process. I'm grateful for their bold actions and the rigorous debate in which my colleagues engaged in for the energy the public demonstrated throughout the process.'",
        "'speaker_9': 'Working together, we've created a budget that reflects our values. I want to also say it was a pleasure working with council central staff over Red Vines and Donuts, and over many long hours around the conference room table, central staff worked tirelessly in their analysis, as well as guiding me in the process, helping me develop options, agendas, speaking'",
        "'speaker_9': 'points and together with council clerk staff, provided important procedural guidance as well. Many people worked above and beyond the call of duty, and I don't want to get in trouble for singling out some over other, some over others.'",
        "'speaker_9': 'But hopefully all will agree that Eric Son deserves special consideration and recognition as the council's staff budget lead. In closing, I was honored to have an opportunity to be in the room where it all happens. I'm told that's a Hamilton reference.'",
        "'speaker_0': 'Thank you. Thank you. Kathryn Herbold, colleagues, I see Castro and Brian to my left.'",
        "'speaker_6': 'I want to say thank you to Councilmember Herbold. Two months ago, this was probably not on your agenda because we didn't know that there would be a vacancy in the chairing the Budget Committee. And for me, this was one of the most intense and chaotic budget clerks, not the right word.'",
        "'speaker_6': 'Let's just go with really intense budget process that I've been through in my budget processes here on the council. And I can't imagine anyone doing a better job, especially given the circumstances than you do. Councilmember Herbold, thanks to you, your staff and of course, all the central staff folks who were running around scrambling to make sure that'",
        "'speaker_6': 'we were able to get our job done right today. I also really want to thank there are folks in the audience today and all the people who turned out at any of the public hearings or public meetings who held various rallies throughout the process or contacted us via email, phone or mail.'",
        "'speaker_6': 'The public engagement in this process is always critical, and this year was especially critical. I'm really proud of a lot of the items that are in this budget. There are some things that I worked on that didn't advance at the moment, but I feel optimistic that then we'll discuss this in a few moments at upcoming resolution, that'",
        "'speaker_6': 'there's an opportunity for us to move forward and find some new resources in the coming months to again, considerably do an amazing job. Thank you very much.'",
        "'speaker_0': 'Well said, Councilmember. I've got my left hand back to my right councilman here. Sally.'",
        "'speaker_4': 'Yes, thank you. Committee chair Herbold. I just also I don't I don't have eight years of experience with the budget. This is my first budget in this capacity. But it was apparent to me, having followed from the other side, what the budget process that you added a level of.'",
        "'speaker_4': 'Transparency in every step of what ended up being a very complex budget process. And for that, I appreciate that is to me one of the paramount parts of democracy working well. And the budget is one of the most critical moments in the council's annual cycle of the choices made.'",
        "'speaker_4': 'So very much appreciate that, you know, whether we agreed or not on everything as a council, I think the public knew where each of us stood. And that had to do with the leadership that you had of making it transparent and accessible.'",
        "'speaker_4': 'So thank you for that.'",
        "'speaker_0': 'Well said, Councilmember Johnson.'",
        "'speaker_6': 'Thank you. This is the part for speeches, I take it. So I'm just going to take a minute and say thanks, Councilmember Herbold, to you for working so collaboratively with me throughout this process. I'm really proud of a lot of the work that we did in this budget.'",
        "'speaker_6': 'The work on expansion of the Law Enforcement Assisted Diversion Program, which I'm sure Councilmember Suarez will talk about in a minute, as well as some of the work that she and I did on access to those living inside food deserts, which is common in both of our districts.'",
        "'speaker_6': 'I'm also really proud of some of the transportation work that we did this year on pedestrian izing to block section of our city, connecting the University of Washington to the future light rail campus. Funding for small but important things like waiting pools and green stormwater infrastructure.'",
        "'speaker_6': 'A small but important remodel of community center. A magnificent park in the appropriate staff necessary to make that facility work well. But I think the biggest and boldest thing that I'm proud that we led on this year was around the creation of a safe consumption site.'",
        "'speaker_6': 'And that $1.3 million is a. So the $1.3 million is without a doubt going to be controversial. We're seeing cities all throughout the region take up resolutions in opposition to these kinds of concepts. And I want to highlight one of the reasons why I have been such a champion.'",
        "'speaker_6': 'I got an email earlier in the week from a constituent named Rose, and I asked her for her permission to read parts of the sermon and to permit my indulgence. Council President I want to read to you all why she believes it's so important that we set up safe consumption sites in the city.'",
        "'speaker_6': 'Rose is a first year medical student at the University of Washington and says all of the available public health and medical data says that safe consumption spaces reduce public drug use, reduce drug paraphernalia in public spaces, and not increase drug use in the surrounding communities.'",
        "'speaker_6': 'Having a space to go and interact with non-judgmental health care workers and access services has been shown to improve rates of seeking and completing detoxification programs by as much as 30%. Rose's Brothers in Recovery and Clean from Drug Use Disorder for four years.'",
        "'speaker_6': 'He and his partner, also cleaning and recovery, are expecting their families first grandchild in this Christmas. And Rose says even when he was using drugs and his brain chemistry and body wouldn't let him walk away from using, he was still my brother and I still loved him very much.'",
        "'speaker_6': 'People suffering from drug use disorders are valued and loved by their families and friends, and they matter to society as a whole. And I'm going to follow the trend of you. Council President Harrell. That is an important line that I feel compelled to repeated twice.'",
        "'speaker_6': 'People suffering from drug use disorders are valued and loved by their families and friends, and they matter to society as a whole. The country is watching Seattle as we endeavor to join the rest of the developed world in responding to drug use disorders with empathy and scientifically sound evidence based approaches.'",
        "'speaker_6': 'Properly funding safe consumption sites is critical to establishing their credibility and proving Seattle as a city ready to take on the challenges of the future. I'm really proud of the work I did with you, my friends out in communities, particularly Patricia, Allison and Lisa, and really grateful to my colleagues for support for such an important step in'",
        "'speaker_6': 'preventing future lives from being lost in our city.'",
        "'speaker_0': 'Well said. Any other words from any of my steam colleagues can spam back shock.'",
        "'speaker_4': 'Thank you. Councilmember Herbold, you have already been recognized by my colleagues. I want to add my thanks to you. I know that you had to dove in this at an opportunity time. That wasn't opportune necessarily, but you did a splendid job.'",
        "'speaker_4': 'I appreciate that. I also want to recognize people in the audience. And Alison Eisinger is holding the wall up over there. But I remember eight years ago, my first budget. One of the first things we talked about was how are we going to really improve conditions for people who find themselves without a place, without a home?'",
        "'speaker_4': 'And about the best we could do that year was to open the red doors. And that seems so controversial. I look back on that and think it was just such a scratch on the surface, but it was an important one.'",
        "'speaker_4': 'So I want to acknowledge the fact that you are here and you and all of the colleagues that have been working with us and in this council for all of these years, you're really making a difference. And I do want to acknowledge the hard work that you're doing.'",
        "'speaker_4': 'But if I can just take a moment and.'",
        "'speaker_1': 'Acknowledge my other.'",
        "'speaker_4': 'Colleagues as well. Council President here, all you're advocating and increasing.'",
        "'speaker_2': 'For reconnecting.'",
        "'speaker_4': 'Families, continuing our efforts to address the challenges of unreinforced masonry, both in international district Pioneer Square and elsewhere. It's going to make more opportunities for people who right now don't have places to live. And again, I know that it's something that is challenging, but finding that money, finding the resources, making it work is going to make our'",
        "'speaker_4': 'whole city better. Councilmember Gonzales, I get you. Just make me smile. And the stalwart work that you have done around police accountability, really supporting domestic abuse survivors, the criminal justice reform you've done, and then just over the weekend, gathering resources again for our CRC, our Court Resource Center.'",
        "'speaker_4': 'Thank you for doing that. Good, good work. Councilmember O'Brien. Obviously, the work that you've done around there championing this work around homelessness, we're going to hear more about that. We are going to see more. One of the things that I so appreciate is like, seriously, two years ago when the emergency was declared, we all expected more work'",
        "'speaker_4': 'to get done. Progress has been made. And I want to acknowledge all home and our Human Services Department, but now we are treating this emergency like an emergency. I'm very respectful to you for that good work. And Councilmember Johnson, you did mention the fighting for the working families, expanding summer parkways, the waiting pools for our kids.'",
        "'speaker_1': 'And especially what we're.'",
        "'speaker_4': 'Doing around neighborhood greenways and making those connections. So your three daughters in my granddaughter can ride their bikes safely to school and have a way around. So I just appreciate the work you've done. Councilmember Suarez It's always D5 and I just want to acknowledge what you've done on expanding lead as well to the north precinct, vigorously supporting'",
        "'speaker_4': 'for your food banks and bringing a voice to the seniors in North Seattle. Thank you for that good work. Councilmember So what you and I don't always agree on everything, but I think we agree on a lot more than we don't.'",
        "'speaker_4': 'And I want to protect and thank you for protecting our unsheltered communities and for helping me expand the number of encampments citywide. Councilmember Harris Talley I.'",
        "'speaker_1': 'Appreciate the fresh, fresh.'",
        "'speaker_4': 'Perspective that you have brought, and I appreciate how fast and how deep you got into this budget process.'",
        "'speaker_2': 'And kudos to.'",
        "'speaker_4': 'You and to your staff. I know you have any members of your staff who are out here, and it's been a real pleasure working with you, and I look forward to working with you in the next few months going forward.'",
        "'speaker_4': 'And. And thank you too, to Allison McClain and Alberta Black and Brian to my staff and to all of our central staff members. I know we haven't named you all by name, but Eric, you're here. There are a number and I'm sure people who are listening and I just the dedication, the countless hours, the donuts and red'",
        "'speaker_4': 'vines that Lisa mentioned. We'll get back to eating apples and health food next week. So just following up and finalizing this, my priorities coming in here were around increasing our housing options. Housing First works. It's a best practice.'",
        "'speaker_4': 'We're going to be able to increase those numbers significantly. I want to thank my colleagues for the work you've done in supporting me around the Firearms Surrender program so that we can protect protect survivors in our community. It's been several years, but we've made big progress there, working with the city attorney and our municipal court as well'",
        "'speaker_4': '. And a special thanks and shout out to my friends in D7. We have done a lot. Market to Mohawk has money that we didn't expect before, like Tebay is connecting. The work we've been doing in Seattle sent Seattle Center and finally to our new friends in the Seattle School District.'",
        "'speaker_4': 'We signed our council president signed an MRU today and we're going to see a lot more of these partnerships and getting our kids educated and getting those kids who are currently finding themselves in a bad situation to get the housing that they need.'",
        "'speaker_4': 'So many thanks to all of you.'",
        "'speaker_0': 'Excellent. Very good. All right, so we are ready to pass a budget councilmember. So what?'",
        "'speaker_2': 'Thank you, President Harrell. Sisters and brothers. This agenda item and the next agenda item which is tied to it, are the approval of the city budget as a whole. Just like in previous years and consistent with the principles of the people's budget movement, I intend to vote no on the budget as a whole.'",
        "'speaker_2': 'The previous votes that we have taken throughout the budget process have amended the Mayor's proposed budget in many important ways that I support and in many cases have personally fought for. And in a moment, I want to speak to those victories.'",
        "'speaker_2': 'But despite these amendments, the budget as a whole remains overwhelmingly the same. Business as usual, a budget that has failed to meet the needs of regular people in Seattle year after year. Every year since I took office in 2014, we have built a people's budget movement to fight for progressive changes to Seattle's business as usual budget.'",
        "'speaker_2': 'And every year our movement has won important victories that make a real material difference in the lives of regular people. Many of you were with us the very first time in the people's budget, Renee, for the first time in Seattle's history with one city sanctioned encampment.'",
        "'speaker_2': 'And that same year, we exposed to public light the regular annual practice of corporate council members going to the chamber retreat rather than meeting with community members for the budget. Last year to the people's budget movement. We took the BLOCK, the Bunker campaign, and then we made the Build 1000 homes campaign through which we won $29 million'",
        "'speaker_2': 'for affordable housing. And I've never been more inspired than this year by the courageous and tireless efforts of activists and the attempt to inject some humanity into the system. I want to take a moment to thank all the individual activists and organizations who have sacrificed so much time and energy to build a movement, to stop the sweeps'",
        "'speaker_2': ', to pass the progressive business tax. In other words, the end to fight for adequate funding for housing and homeless services and the demands of renters and regular people. Your efforts have truly shown what it means to be an activist and an organizer.'",
        "'speaker_2': 'The mass movements of the sixties and seventies that ended the Vietnam War past Roe v Wade and the Civil Rights Act were made up of activists like you. And we are in the process of a historic process of building an activist leader around the nation, not just in Seattle that we have not seen in decades.'",
        "'speaker_2': 'And I am so proud to be part of that process. And I hope you are, too. You came to Council Chambers dozens of times. You joined us on November 1st and second for an all night peaceful, civil disobedience demonstration consisting of public comment rallies, teach ins, camping outside and inside city hall.'",
        "'speaker_2': 'And a powerful day in the next morning. That effort of November 1st and second was a political turning point because it put the Seattle's political establishment on notice. It made very clear that regular people do not support sweeps, that it's not a fringe demand to say, stop the sweeps.'",
        "'speaker_2': 'And it's not a fringe demand. To say that big business should be taxed. We do not support protecting the profits of big business while neglecting affordable housing and homeless services. Regular people in Seattle are horrified by the way the city establishment treats ordinary people, especially the poor.'",
        "'speaker_2': 'It is council members who are the ones that are standing in the way of stopping the sweeps. It is council members who are standing in the way of the progressive business tax. Because of our movement's efforts. Now, they have had to scramble to make promises to try and rescue their reputations.'",
        "'speaker_2': 'This is important for the movement to claim as its own victory. So thank you to all the individual activists, the homeless community from the Housing for All Coalition and the many organizations within it from the Neighborhood Action Councils.'",
        "'speaker_2': 'Real Change The Transit Riders Union Sherill and Nichols Will Nichols about residents socialist alternative stop the sweeps and see camp out activist from the People's Party Democratic Socialists of America, the 43rd, 32nd, 34th and 36 legislative districts of the Democratic Party Tenants Union progressive unions like BFC 1488 who have all played critical role in building this movement'",
        "'speaker_2': '. And I am sure I have left some organizations out, but obviously, needless to say, it applies to all of them. Because of these organizations and activists, we have one real material victories that will have a meaningful impact on the lives of ordinary people.'",
        "'speaker_2': 'We have won funding this year for renters rights resources in organizing millions more in funding on housing and homeless services. Then Mayor Burgess proposed funding for a feasibility study to allow Seattle to take concrete steps to finally create a public bank funding to.'",
        "'speaker_2': 'Funding to expand, lead and other alternatives to incarceration funding to expand services for survivors of sexual and domestic violence and many important things. But most strikingly, we have built a phenomenal movement to stop the sweeps and past the homes attacks, and we have put the establishment on notice.'",
        "'speaker_2': 'I strongly agree with Travis Thompson's comments during public testimony that we are far from done here. We will be back. We will be demanding that councilmembers keep their promises. However, just like in other years, those victories are dwarfed at this moment by the overwhelming majority of the budget that continues the same business as usual that has so'",
        "'speaker_2': 'tragically failed to meet the needs of regular people in Seattle year after year. This year's budget, like last year's, fails to make a serious dent in the crisis of homelessness. This year's budget, like last year's, fails to address the housing affordability crisis.'",
        "'speaker_2': 'This budget, like in the past, invests hundreds of millions into an approach to public safety that prioritizes locking people up rather than investing in our communities to prevent crime in the first place. And this budget, like in the past, fundamentally depends on taxing the poor and working class people rather than super rich and big business.'",
        "'speaker_2': 'And just like in previous years, this budget fails to exercise its ability to curtail the inhumane and ineffective sweeps of homeless people. Unlike in previous years, this year, council members actually had the opportunity to vote to tax big business.'",
        "'speaker_2': 'I mean, technically, they have had the opportunity year after year. But this time they heard loud and clear from Seattle that Seattle wants them to do this. And they still failed to do so. I will be speaking more about the specifics of the progressive business tax when we discuss the alleged resolution later in the full council agenda'",
        "'speaker_2': '. But for now, I think it is important to state. There is so much wealth in Seattle that the homeless emergency is totally unnecessary and unacceptable. It doesn't have to be like this. And. The majority of the council. I am sorry you have not treated an emergency like an emergency, because if you had, you would have stopped the'",
        "'speaker_2': 'sweeps and passed the homes tax. Compare the few hundred affordable homes Seattle bills each year to the House building program conducted around the world under the Marshall Plan. For example, in Britain after World War Two, they built public housing at a rate that relative to their population would be the same as Seattle, building 15,000 affordable homes every'",
        "'speaker_2': 'year. They did that because it was in the best interests of big business and the political establishment at that time. Compare that to the few hundred affordable homes Seattle is building each year. This is what I mean when I say that this is a business as usual budget, that Seattle could do something big, something really big.'",
        "'speaker_2': 'And we cannot let the politicians and City Hall pat their backs by tinkering around the edges of the problem. 50 years ago, Martin Luther King Jr. Said, and I quote, If our nation can spend $35 billion a year to fight an unjust, evil war in Vietnam and $20 billion to put a man on the moon, it can'",
        "'speaker_2': 'spend billions of dollars to put God's children on there to feed right here on Earth. His words. His words from 1967 are, if anything, more meaningful today because there is more wealth in society today. This is a city where a single billionaire is financing his own spaceships, while thousands of people have been driven into homelessness, have overflowed'",
        "'speaker_2': 'their shelters, and are living on the streets in these brutal winter months. We do not have a people's budget today, but we are building. That movement that can win won in the future. And I'm honored to be with you as part of that movement.'",
        "'speaker_2': 'I want to thank all of the central staff who were here late every night. And I know that because my staff member was with you late every night and you never left. And I'm so thankful for all the work you did to allow us allow our movement to get to every small victory that we could.'",
        "'speaker_2': 'And their efforts cannot possibly be overstated. I'm extremely thankful to Ted Walden in my office and Adams in Koski. Ted worked tirelessly on the budget process. Adam worked tirelessly as part of the Housing for All coalition. But I also wanted to thank Rebecca Lieberman, James Parker and Jonathan Rosenblum from my office.'",
        "'speaker_2': 'We all pulled together and made sure that we gave this budget process our all. Let's have a break in the holidays, but let us come back rejuvenated to to continue the fight. And one thing that's coming up that I wanted to mention is on December 5th, the Rental Housing Association, which is a big landlord lobby association, will'",
        "'speaker_2': 'be having a big convention on December 5th at the convention center. They're going to have workshops that will teach landlords how to evict tenants, how to make sure that they oppress tenants even further. So Washington Community Action Network and other organizations and my office are coming together to organize a protest action.'",
        "'speaker_2': 'So please make sure you sign up on the Facebook even let's housing for all together. Be there on December 5th. Thank you, Mayor.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'There are no further comments. Thank you, Councilman Swann, for the comments. I think we're ready to vote. Okay. Please call the roll on the passage of council bill 119116 Johnson.'",
        "'speaker_1': 'Suarez O'Brien. So. No. Berkshire. Gonzalez I. HARRIS Tally. Herbold Hi. President Arroyo high eight in favor.'",
        "'speaker_0': 'One opposed bill passed and there was silence. And with respect to the plaque file will be those in favor of approving and filing clerk file 314384. Please vote i. I those opposed vote no. The motion carries and file is approved and placed on file.'"
    ],
    "AN ORDINANCE relating to the levy of property taxes; fixing the rates and/or amounts of taxes to be levied, and levying the same upon all taxable property, both real and personal, in The City of Seattle, to finance the departments and activities of City government and to provide for the general obligation bond interest and redemption requirements for the year beginning on the first day of January 2018; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Okay. So we're going to move to 37 and 38. Please read those items into the record.'",
        "'speaker_10': 'Agenda Item 37 Council 119117 Relating to Levy Your Property Taxes Committee Recommend Civil Pass. Agenda Item 38 Cancel 119118. Authorizes levy of regular property taxes for the city sale for collection 2018. The committee recommends the bill pass.'",
        "'speaker_0': 'Customer herbals. Do you have anything to say on those? No, we're ready to go on those. Pretty perfunctory on this part. Please call the roll on counts. Bill 119117.'",
        "'speaker_1': 'Johnson Whereas. O'Brien, I saw what I. Bakeshop. Gonzales, I. Harris. Talley. Herbold. High President era high nine in favor.'",
        "'speaker_0': 'An unopposed bill passed and chair of Senate. Please call the rule on the passage of Council. Bill 119118.'",
        "'speaker_1': 'Johnson. Suarez. O'Brien. Salon. Bakeshop. Gonzales, I. Harris. Talley. Herbold. All right. President Harrell. All right. Nine in favor. Nine opposed.'"
    ],
    "A RESOLUTION urging the President of the United States and the United States Congress to enact legislation securing the citizenship of internationally adopted adult individuals.": [
        "'speaker_0': 'Okay. The Bill Parsons chair will sign it. We're going to move to adoption of other resolutions. And we amended our agenda for the day to adhere to resolution. So I'm going to ask to the clerk call the resolution 31781.'",
        "'speaker_0': 'Read that one into the record and we'll relinquish the for the council members want.'",
        "'speaker_10': 'Resolution 317 81 urging the President of the United States and United States Congress to enact legislation securing the citizenship of internationally adopted adult individuals.'",
        "'speaker_0': 'Council members one.'",
        "'speaker_2': 'Thank you. As I said this morning in the briefing, council members were contacted recently by Chris Larsen, who is an activist with the Urban League here in Seattle, and he was here earlier for public comment. I believe he had to leave because I don't see him anymore.'",
        "'speaker_2': 'But my office had the opportunity to meet with him last Friday. He and others, as he said in his public testimony, were adopted as children from other countries, but they do not have their citizenship rights. In 2001 Congress U.S. Congress passed a legislation that granted automatic citizenship to all adopted children from other countries, but they left in'",
        "'speaker_2': 'a loophole. It applies only for those who are born after 1983. So there are more than 35,000 adopted children who were born before 1983 who don't have that option of automatic citizenship. I've watched what experts have said. They've said that a lot of the adoptive parents know that they need to apply for adoption, I mean, for naturalization'",
        "'speaker_2': 'paperwork. But what they say is that the adoption process itself is so onerous and expensive that by the time they're finished that they really find it very hard to now start another onerous process of naturalization. So it really makes sense to close that loophole so that all the adoptees who are now grown ups and they are in'",
        "'speaker_2': 'their forties, they should be given naturalization. I mean, they should be granted citizenship right away. Obviously, the city of Seattle does not have jurisdiction on this. This is a federal matter, but this is National Adoption Month. And activists are requesting that we pass this resolution in many different cities.'",
        "'speaker_2': 'Already, Philadelphia and Houston have passed such a resolution. I think it's only appropriate that Seattle, having declared itself as a sanctuary city, we do this in order to help our adoptees, sisters and brothers. So I will I will end with that.'",
        "'speaker_0': 'Thank you. Council members want any other members like to speak on this resolution? I just want to thank Councilman Swan for bringing this issue to our attention. I was not aware of this status and Mr. Larson certainly educated some of us on this issue.'",
        "'speaker_0': 'So I really appreciate you bringing this forward. And as I understood his testimony, we are trying to start a nationwide movement on this sort of problem that we're facing. So I'm very supportive of this. Councilman Sean.'",
        "'speaker_2': 'Oh, thank you, Brian. I just wanted to add a thank you to the city's law department, because we sent them this resolution last night and they had responded to us before 9 a.m. today. That's a really quick turnaround.'",
        "'speaker_2': 'And so I appreciate it.'",
        "'speaker_0': 'Good. Okay. So I will move to adopt resolution 31781. Is there a second second. It's been moved in second to the resolution be adopted. Any further comments? Those in favor of adopting the resolution please vote i. I. Those oppose vote no.'",
        "'speaker_0': 'The motion carries and resolutions adopted and the chair will sign it. Next, please read resolution 31782 and to the record.'",
        "'speaker_10': 'Resolution 317 82. Establishing a process by which the City of Seattle will determine new progressive revenues, including employee hours tax, expressing the City Council's intent to oppose such potential revenues and expressing the City Council's intent to make investments with these revenues that would assist people who are homeless or at a high risk of becoming homeless and obtaining'",
        "'speaker_10': 'and retaining stable housing.'",
        "'speaker_0': 'So Councilmembers Gonzalez and O'Brien, which one would like to speak first? I'll outwait.'",
        "'speaker_3': 'You. Tired? I'm waiting for Councilmember O'Brien just to be like, Oh.'",
        "'speaker_1': 'Don't worry, I'll do it.'",
        "'speaker_3': 'I'm happy to just talk about the framework of the base resolution, and I know that there are three amendments to come before us. So I will just talk really quickly about the resolution, and I'm going to look to the clerk to I have to move for its adoption before we can consider the amendments.'",
        "'speaker_0': 'Um, we'll move at the. Yes. Okay. Yes. Why don't you do that?'",
        "'speaker_3': 'Okay. So I'm going to move for the for the for council to adopt and pass resolution 31782.'",
        "'speaker_6': 'Okay.'",
        "'speaker_3': 'So the framework of the resolution is to create a expedited process over the next several months to bring together a group of stakeholders to form what we're referring to as an ad hoc task force to help this Council formulate recommendations around what an employee hours tax should look like.'",
        "'speaker_3': 'In addition, we are asking the task force to come up with recommendations of progressive revenue sources that would be in addition to an employee hours tax. And so this the intent with this resolution is to be able to really allow as much room as possible to receive all recommendations from this task force that would provide the city'",
        "'speaker_3': 'council with a suite of recommendations to be able to take a serious look at to pass in short order. As a result of that task force work, there have been some modifications to the base ordinance since we first distributed it this morning.'",
        "'speaker_3': 'And and and those are to the base ordinance, not to the not with regard to the amendments. So the base ordinance has changed. And, Councilmember O'Brien, keep me honest if I leave something out here, but in section four, section four, on page four, lines 20 through 23, the language around subsection A originally said evaluating an IHT in'",
        "'speaker_3': 'determining appropriate tax rates and possible exemption levels that will yield a minimum of $25 million. We've changed that to levels that are expected to yield between $25,000,075 million in revenue per year. And I am forgetting the other section that we modified.'",
        "'speaker_3': 'So maybe Councilmember O'Brien can pitch it for me and help me find that area. Thank you.'",
        "'speaker_6': 'The the other is we added a new recital, the third whereas clause which says the you the U.S. Internal Revenue Service defines a progressive tax, takes a larger percentage of income from high income groups than from low income groups, and is based on the concept of ability to pay.'",
        "'speaker_3': 'Thank you. So that's that that's the base resolution. And I have obviously given given a description in broad strokes. It's a it's a five page, five and a half page resolution. And so I appreciate Councilmember O'Brien's willingness to work on this language in this framework and this concept.'",
        "'speaker_3': 'And I appreciate my colleagues who have continued to engage on the formulation of of this resolution. And and I also want to thank a lot of the community stakeholders who helped me think through this particular issue and the language that is now in the resolution.'",
        "'speaker_3': 'And I'm hopeful that this will put us on a clear path to, again, come back in March with a set of recommendations where we can look at a comprehensive suite of dedicated, sustainable, ongoing revenue sources to be able to truly get serious about the civil emergency that faces us as it relates to our homeless neighbors.'",
        "'speaker_0': 'Thank you, Councilman Gonzalez and Councilmember Bryant, did you want to speak any more on the base legislation?'",
        "'speaker_6': 'My strategy worked. Councilmember Gonzales said everything I was hoping to say. So it was passed.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'Again.'",
        "'speaker_0': 'We have some amendments we'd like to work through and we'll just take them take them one at a time. So I don't know which one is first because they were hot off the press. Councilmember Harris Talley.'",
        "'speaker_4': 'I'm yes, I moved to offer an amendment amendment number two. It's like, how do I read the amendment now?'",
        "'speaker_0': 'Yes. And it has been second. And why? Why don't we talk about it? So it's been moved in second. Please explain what this amendment does.'",
        "'speaker_4': 'Wonderful. So this amendment looks at the opening of the resolution and adds the following language on starting on line 14 for folks who are looking at the current copy. So the full reads. Whereas all sectors of our society must work together to address and resolve the civil emergency related to homelessness and to ensure there are sufficient resources'",
        "'speaker_4': 'to and this is the added added language realized Seattle and King County's commitment to making sure that no person experiences homelessness and that if one does, it is rare, brief and only a one time occurrence. We thought it was important to add that this is a Seattle and King County collaborative issue.'",
        "'speaker_4': 'Again, we think that we need to acknowledge this is a regional problem that we're addressing. And we wanted to clearly state both Seattle and King County's previous goals of working towards zero homelessness.'",
        "'speaker_0': 'Very good. Any further comments? We can vote on these one at a time and may be a little cleaner that way. So I'm going to call this amendment number two just because that's what it says on the document.'",
        "'speaker_0': 'I have to make further comments on amendment number two. Just Councilmember Becky Shaw.'",
        "'speaker_4': 'Thank you. Council Member Harris Talley for bringing this forward. I believe bringing the council, this council, as well as the King County Council and their Human Services Department equivalent together, is really going to make a lot of difference that and then when we work with all home and United Way is going going to help us with that'",
        "'speaker_4': 'base and then reaching out to the community and bringing people who are experiencing experiencing homelessness now, make sure that they're on the committee as well.'",
        "'speaker_0': 'Very good. So all those in favor of what I'm calling amendment number two is describe Councilmember Harris tally, please. What I, I oppose the ayes have it. And then Councilmember Harris. Tally, just keep my paperwork clean. I think she's going to move to four and five, but I don't have a three.'",
        "'speaker_0': 'So am I missing a three anywhere?'",
        "'speaker_4': 'You are correct. Council President Harrell. Thank you. Councilmember Gonzales and O'Brien for actually integrating some of our other amendments into the base of the language so that they didn't have to be offered at this stage. So thank you.'",
        "'speaker_0': 'So we could just move to a minimum number four now. That's okay. Excellent.'",
        "'speaker_4': 'I move to offer an amendment. Amendment number four.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'Okay, please explain what we're doing.'",
        "'speaker_4': 'This is added to section one and adds to the full statement at the bottom of the statement that we believe that there should be a co chair structure and that that should include 1 to 2 council members and 1 to 2 committee members.'",
        "'speaker_4': 'So the added language starting on line 13 at the end of this section is the co-chairs should include 1 to 2 council members and 1 to 2 community members.'",
        "'speaker_0': 'Very good. And thanks for explaining that this morning. Any further comments on this amendment? No. Okay. Let's vote on it. All those in favor of amendment number four as described by Council member Harris Talley. Please vote i. I opposed the ayes have it.'",
        "'speaker_0': 'That amendment passes and amendment number five is from council member back office.'",
        "'speaker_4': 'Thank you. And the second sentence of this amendment, I am proposing that we add the language imposing ADHD and or other progressive taxes and at the bottom that language. Thank you. Thank you at the end also and or other progressive taxes no later than March 2018.'",
        "'speaker_4': 'The goal is to support.'",
        "'speaker_2': 'The open door so all creative ideas can be.'",
        "'speaker_4': 'Identified. Progressive taxes have, as.'",
        "'speaker_2': 'We have noted.'",
        "'speaker_4': 'Are one solution that I want to have on the table for consideration. There may be others. I don't want to leave those out.'",
        "'speaker_0': 'Very good. So we have councilmember backchannels amendment number five is I'm going to scrap it. Any further comments on this? Any further comments, Councilmember Harris tally?'",
        "'speaker_4': 'Yes, I wanted to speak to this amendment and some other considerations. And and I'm saying this because I want to make sure that we're being responsive to what we heard from community in the comment period. And thank you again to all of those who spoke to us and and did the due diligence of keeping track of this'",
        "'speaker_4': 'Wiley resolution over the last few hours. So I wanted to note that the resolution starts with the statement that the city of Seattle will determine new progressive revenues, including an employee head's tax. So I just wanted to be clear that this statement at its heart is about IHT, but what we don't want to do is close the'",
        "'speaker_4': 'door to a combination of IHT and other progressive revenue sources that could possibly bring us up to that full threshold of what we have right now of a ceiling of $75 million. We know there are some limitations to IHT about how much we can raise, and that with a combination of that and other progressive taxes, it opens'",
        "'speaker_4': 'up the possibility of what we have for revenue. I also wanted to note that for those who have concerns about whether or not there would be enough representation from community and those who are actually experiencing homelessness, that that's actually within Section two of this resolution and does take note, the task force should include members such as subject'",
        "'speaker_4': 'matter experts on housing, health care and homelessness service providers, civic leaders, labor representatives, individuals who have experienced or are currently experiencing homelessness, business organizations, economic equity experts, community organizations, community coalitions, community leaders, and small and large business owners.'",
        "'speaker_4': 'And I know for a fact that several council members added groups that we wanted to make sure would be represented in this task force to this list. And our hope is that some of those community based folks by adding the 1 to 2 community member co-chairs that we've.'",
        "'speaker_4': 'Add it here will actually be able to shape both the facilitation and the structure of the task force itself. Furthermore, I plan to vote on this and or clause and I say this because at the base folks have added a definition of progressive tax.'",
        "'speaker_4': 'If that definition were not there, I would vote no on this because of the and or clause. And my concern that somehow we would be moving to a regressive tax structure by having an andor clause. I feel confident that with the IRS definition of a progressive tax we have and we know as a council, literally two or'",
        "'speaker_4': 'three progressive tax options that could fall outside of the IHT structure. And that's why I feel very confident with how this is structured, that we will find ourselves leaning quite heavily on IHT. But I do want to have the open possibility of having other progressive revenue options to get as much dollars as we can in the door'",
        "'speaker_4': '. So I plan on voting yes on this. Thank you.'",
        "'speaker_0': 'Council members also want.'",
        "'speaker_2': 'The whole purpose of this resolution is to put in writing the verbal commitment of all those council members who voted no on the home stacks, the FG. But they made a verbal amendment to pass it to you by next spring.'",
        "'speaker_2': 'So the whole purpose of this resolution is to hold these council members accountable, as you all saw in previous drafts. The original drafts failed to make that commitment, actually. And in fact, we had to redouble the movement's pressure from my office in order to make sure that the resulting resolution that is in front of us today is'",
        "'speaker_2': 'actually substantive. It actually says now, because of our redoubled efforts, that the council will look at, I mean, will have a deadline for itself of March 26th or another date to make sure that we can have revenues coming in from January 2019.'",
        "'speaker_2': 'So that is a huge step forward that we were able to achieve. But that commitment was added in one place. Council member back shows amendment attempting to remove that one commitment from that one place that it appears on this resolution.'",
        "'speaker_2': 'We're not fooled by this and or other progressive taxes. And I and I find disingenuous these these comments from the council members who voted no, who say that they don't want to close the door on progressive taxation seriously.'",
        "'speaker_2': 'We have brought forward a progressive tax for four years and you have always voted no on it. You have closed the door on it. Repeatedly. And contrary to the impression that's being given, it's not like we have a special bug in our heads about the of the employee our stacks.'",
        "'speaker_2': 'We are insisting on the employee tax because it is virtually the only real progressive option that can be passed council manically. And I know this because my office has spent four years researching this assiduously. Those it is law department can attest to it because we have really bugged them and taken a lot of their time asking them'",
        "'speaker_2': 'to write memo after memo, because we don't want to take no for an answer immediately, you know? So it is disingenuous to say that we are going to look for other progressive revenue options because there aren't and we don't need the IRS to tell us what's progressive.'",
        "'speaker_2': 'Taxing big business is regressive. Taxing the super rich is progressive. And I am afraid that if we allow this amendment to happen, what is to stop the future task force from saying that? We tried sincerely, but we talk to our business stakeholders and they said the employers tax will not be good for the economy and it will'",
        "'speaker_2': 'be voodoo economics. And I can say that as an economist that it has no basis in reality, but they could say there is nothing to stop them from saying it. The chamber is fighting hard against that. They ensured that the issue didn't pass this year to ensure that their council members voted no on it.'",
        "'speaker_2': 'So what's to stop the task force from saying, we looked into this, we talked to the business stakeholders. They don't think that the idea is a good idea. Let's look at other options and then it's all an abstraction in the abstract.'",
        "'speaker_2': 'Every politician agrees that we should have progressive taxation. What is actually going to be voted on is the question that so I will vote no on this amendment.'",
        "'speaker_0': 'So you can see what comes. We have a herbold.'",
        "'speaker_9': 'Thank you. Councilmember Sawant mentioned that there is in her belief that there's only one section where the commitment to employee hours tax is made, and that's in section six. The re the way I read the title. There is also a commitment I had requested that this title be tightened up to give a strong, strong to to basically'",
        "'speaker_9': 'model the the same approach that we use for deliberations around the income tax, which were to say that we were going to enact a city income tax. The question was the what's in the House? And so I read this title is actually being good but that that the amendment as written with the and or is inconsistent with'",
        "'speaker_9': 'the title I read the title is saying establishing a process by which the city of Seattle will determine new progressive revenues, including an employee hours tax. Now, the amendment offered by Councilmember Bagshaw did not say and or but said and other progressive taxes.'",
        "'speaker_9': 'That's something that I could definitely get behind.'",
        "'speaker_2': 'I'm sorry. Guns are horrible. Can you say that last part again?'",
        "'speaker_9': 'The last part I said is if the amendment offered by Council Member Bagshaw, instead of saying and or other progressive taxes said and other progressive taxes, that was something I could get behind.'",
        "'speaker_3': 'I, i, i still can't hear the part of what you're saying because the applause me mutes out. The mikes though may be good. I am sure they're hearing it and I'm not. So can you can you. Can you guys please give us the gist just so we can hear it?'",
        "'speaker_9': 'This sounds different up here than it is out there. Yeah, it's weird. I said I could support the amendment offered by Council member Bagshaw if it instead of saying and or other progressive taxes, it simply said and other progressive taxes.'",
        "'speaker_6': 'If you get it, so be nice.'",
        "'speaker_0': 'So we have an amendment that actually has not been moved in second it yet. And so we can. So what we have to do is vote on the amendment before we vote on the bass. So we have an amendment.'",
        "'speaker_0': 'And then what I'm hearing from Council Member Herbold is a request from the maker in this point to take out the conjunction or and the implication being the obvious meaning being that it it it suggests that there would definitely be an ESG and possibly another progressive tax without the concern that there not be any employment our employee'",
        "'speaker_0': 'hours tax. And so you don't have to accept that as a friendly amendment. You could explain why you believe and slash or make sense and that's why you draft it that way. But perhaps you want to respond. It comes from a Herbold suggestion.'",
        "'speaker_4': 'Thank you, Councilmember Herbold.'",
        "'speaker_2': 'And I would like to vote.'",
        "'speaker_4': 'On this as is. If it goes down, I will consider a as an amendment. Okay.'",
        "'speaker_0': 'Any further comments? Councilman Harris, Charlie's grabbing the mic. Go ahead.'",
        "'speaker_4': 'I'm just asking a procedural question. Still wrap my mind around all the amendment rules. So if it were to go down, is it possible to walk on an alternative amendment?'",
        "'speaker_0': 'She is not a favorite practice, but we can I believe we can reintroduce it with a. Deletion of the word and we can reintroduce you on the spot here. Is that a is that.'",
        "'speaker_1': 'She's trying to.'",
        "'speaker_7': 'And it also.'",
        "'speaker_4': 'Once we.'",
        "'speaker_0': 'So once we there is a there is amendment, there's a rule that there be two hour advance notice up publishing of anything we consider. So I'd have to suspend that rule for us to consider. We can consider I have to suspend that rule.'",
        "'speaker_0': 'And if there is a, if there's a title change but there's not a title change.'",
        "'speaker_3': 'No title change.'",
        "'speaker_0': 'I don't have to worry about that. So what we'll have to do is waive the rule of the two hour notice to take out that one word or but to perk council members back shows request. She wants to see how this this amendment passes or not.'",
        "'speaker_0': 'And then let's cross that bridge if it if it fails.'",
        "'speaker_3': 'Now, can I just ask.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'You mentions of Councilmember Bagshaw was intent here so I'm I'm always sensitive to language in the legislation they may not be consistent with the bill title and I don't think that's what. Councilmember Herbold is saying is that this is or are you saying that this amendment is inconsistent?'",
        "'speaker_9': 'As I read the bill title, the bill title includes the employee hours tax. Because it says establishing a process by which the city of Seattle will determine new progressive revenues, including an employee hours tax. Mm hmm. And then.'",
        "'speaker_9': 'And so my concern is that an outcome that allows for something other than an employee hours tax is not consistent with the title is as drafted.'",
        "'speaker_0': 'So. Yes, go ahead. I'm sorry.'",
        "'speaker_3': 'Well, what I was going to say is that if in my mind, the bill title would would preempt such a vague interpretation of the language of the ordinance. So I'm so I'm I just I guess I'm trying to thread the needle on if the I mean, we worked really hard to create a improved bill title to make'",
        "'speaker_3': 'it really clear that that this was going to be happening in March. And I think what I have been trying to balance is, is, is is not precluding or I'm not I'm not you know, I'm I am definitely supportive of this bill coming before us in March, and I want that to occur.'",
        "'speaker_3': 'But I also don't want to preclude other things to come before us. So how do I read that? And. It. Does that mean that I can't bring if we only identified each tea? Does that mean I can't bring tea unless it's also attached with another progressive revenue source.'",
        "'speaker_9': 'As I read the offered amendment. It allows us to not considered tea at all in the future.'",
        "'speaker_1': 'Yes. Oh yeah.'",
        "'speaker_0': 'That's when I was saying, let's cut to the chase that I think that's the concern that after the process there's no.'",
        "'speaker_6': 'So no so.'",
        "'speaker_0': 'So councilmember back show you may want to explain your intent as wise and or.'",
        "'speaker_3': 'Not have that be your. Okay I'm just going to say this is a microphone. I just asked Councilmember Bagshaw if that was her intent and she said no. So now I'm asking, is there a modification of this language that you would accept as a friendly amendment to better communicate, indicate your intent as it relates to not creating'",
        "'speaker_3': 'a situation where the other progressive revenue source would supplant and replace movement on the employee hours.'",
        "'speaker_1': 'Tax, of course.'",
        "'speaker_2': 'So if we have an open.'",
        "'speaker_4': 'Door, so something else may come in as we are looking at both revenue and housing options. Councilmember Swan says that her team has looked at this for four years. That may well be true. There may be something else we don't know.'",
        "'speaker_4': 'I think it's very likely as we get into this.'",
        "'speaker_2': 'That that.'",
        "'speaker_4': 'The employee head tax I'm sorry, the employee hours tax is going to be and a critical part of this, but there may be something else and I want to allow that opportunity. Now, I have passed this through the law department.'",
        "'speaker_4': 'There was no opposition at the time. What I'm saying is let's trust the process and see what we can get across.'",
        "'speaker_0': 'Council Counsel I have two concerns and. Q Consumers want. Councilman Harris Talley.'",
        "'speaker_4': 'Yes, and I agree with you. Councilmember Bagshaw I appreciate that we've created, you know, a container now both on the high and low of what a revenue source could look like this size wise, and a really specific date about both how the task force will come together, who's going to be included there, and when the decisions will'",
        "'speaker_4': 'be made. But I can appreciate that. I think for all of us on the dais and the public who's here with us, that we want to just make sure we get all the other pieces right, too. I'm wondering if we keep an and or a clause, maybe if you.'",
        "'speaker_4': 'You seem really hesitant about removing the word or because I hear you saying you feel like it will somehow close a door. But what if we added the word business before progressive so that we know what's coming from the business community and not other sources?'",
        "'speaker_4': 'It's not my intention to limit this to the business community. I'm hoping all stakeholders that, you know, I'm really I'm really finding this offensive that.'",
        "'speaker_0': 'Please, I, I, I, we're trying to make a decision. Thank you very much.'",
        "'speaker_4': 'And I had made an assumption that that my hope is that stakeholders come.'",
        "'speaker_2': 'To.'",
        "'speaker_4': 'To the table with their eyes and ears open. And if we can get there and get past this one amendment, we move forward in the beginning of January. I think we've got everybody at the table that's willing that's willing to come.'",
        "'speaker_4': 'And I and I appreciate that. Councilmember Bagshaw And I apologize because I know we spoke and I shared with you all my considerations about why I was going to vote for this amendment. I want to be clear. My assumption by other progressive taxes was that we meant other progressive business taxes.'",
        "'speaker_4': 'So without that clarity, I would be hesitant to vote on this. So help me. Help me with that. What are you saying with. I'm sorry. I will not be able to vote on this if we're not clarifying that it's actually about the business community paying taxes, because I just feel like everyone else in the city has already'",
        "'speaker_4': 'paid so much into these solutions.'",
        "'speaker_7': 'So. So I apologize.'",
        "'speaker_4': 'I apologize that I have to change that.'",
        "'speaker_0': 'Consumers should want.'",
        "'speaker_2': 'Thank you. James Bagshaw I don't do this often, but I thank you for speaking the truth that you didn't want to keep this limited to the business.'",
        "'speaker_4': 'Now I'm trying to understand what council member Harris Talley was saying and what can I. Not quite yet.'",
        "'speaker_2': 'Because it's my turn.'",
        "'speaker_4': 'I'd just like to have clarification about what council member Harris Talley was saying.'",
        "'speaker_2': 'How would you President Harrell.'",
        "'speaker_0': 'You Councilman Swann does have the floor, Councilman. So I can you just relinquish for just for one moment, please? Councilmember Harris TALLEY Councilmember Baxter just didn't flinch down the point and then customers one has the floor. Thank you counts first one.'",
        "'speaker_4': 'And I apologize I think also with the clapping we're having trouble hearing each other as well. So I apologize. I was just saying that I had assumed that when this was added that it was speaking to other progressive business taxes being solutions offered along with.'",
        "'speaker_4': 'I apologize. I should have clarified that because you're right, the word business isn't in there. I should have clarified that before I agreed to move forward with this, and I feel uncomfortable moving forward with it, knowing that the intention could be beyond just business community paying in.'",
        "'speaker_4': 'Because my biggest concern right now is that I feel like everyone else has paid in tremendously. We voted for the levy, but we're not looking forward to our escrow with the doubling of the levy next year, even though we agree that it's for the public good.'",
        "'speaker_4': 'And the reason he is such a great solution, in my mind, is that it is coming from the business community. And so I just I have a real strong sense that any other progressive tax solutions also need to come from that same community.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'That's what has the floor.'",
        "'speaker_2': 'Thank you, President Harrell. I. I'm not clear what this whole mystical, magical world that some councilmembers live in where there are endless avenues for progressive taxation. And if there are such endless avenues, then why don't you vote on the one that was discussed last week?'",
        "'speaker_2': 'I really don't understand. And furthermore, Councilmember Gonzalez said, well, we don't want to we want to make sure we're not precluded from doing anything. GONZALES Maria Gonzales, you're an elected official of the highest legislative body in the city.'",
        "'speaker_2': 'Nobody is preventing you from passing progressive taxes when you want it. You don't need the permission of this task force that is not formed yet to pass any other progressive tax. So if magically, the city law department comes up with an idea, an alternate idea for a progressive tax on business, then we'll get on it.'",
        "'speaker_2': 'I promise you I will be right there with you burning the midnight oil doing that. We don't need the permission of a task force. We are elected officials. We have both the job and the power to do it.'",
        "'speaker_2': 'We should be exercising that power in the interests of working people. I'll stop there.'",
        "'speaker_0': 'So I'm going to say a few words about your amendment, and then I'm hoping we can vote because I don't have a clue as to where that's going to passionate. So here's my take on this, is that, you know, I'll say to the camera and you, we have to remember that we're creating a record as we speak'",
        "'speaker_0': 'is that I've been on record as this point as supporting an employee head tax. I did not like the process we used earlier. And as you may recall, this slide that we all pass that I drafted sort of crafted broadly this process and I see coming out of that process an employee hours tax.'",
        "'speaker_0': 'Now the thresholds to be determined, the amounts to be determined even what is called because sometimes school and all home stacks, all head tax and our checks all that to be worked out. So when I saw your amendment, I did not see this as a tactic to get out of it.'",
        "'speaker_0': 'I saw it as and you may recall in part of my slide, one of the things I said we need to to ask are some of these large employers for some one time money? It's not sustainable. But I'm not afraid to go to Amazon and say we need $50 million now for this urgently.'",
        "'speaker_0': 'You don't have to promise to do it in perpetuity. And so I also suggested that Sly, that we create a mechanism by which we can receive money because it's not as though we could just accept checks. So we have to work with the nonprofit, etc., that didn't get captured in this resolution.'",
        "'speaker_0': 'But that's okay because we did adopt that through the slide. Now, when I saw this, I was prepared to support it. I continue to be prepared to support it because quite candidly, integrity means everything to me. And when, you know, I have a wife and three kids, I have three kids that make everyone in here look conservative'",
        "'speaker_0': '. So so they they know how passionate I am about trying to get this. And if the business community will not come to the table, we are still marching down to what we need to do. So I this this this this untrusting of our local politicians.'",
        "'speaker_0': 'Okay, that's fine. But I believe that this is what you're trying to do. This is not an escape to get out of any. That is ludicrous. That's nonsense. And you can believe that if you want. So so that's that's why I was prepared to support it.'",
        "'speaker_0': 'If it fails, we could tweak it and move down the road. But but I'm not going to sit here and be impugned. When when I looked at this language, I did not see it as a means to get out of our obligation.'",
        "'speaker_0': 'Okay, so let's vote, see where we stand and see what we do after that. Everybody go with that. Okay. So it's been it's been moved. Amendment number five advanced by Councilor Bagshaw has been moved. Is there a second?'",
        "'speaker_0': 'Second all those in favor of Amendment five advanced by Councilman Bagshaw. Please say I and raise your hand, I. One, two, three, four, five. All those opposed. Say no and raise your hand. No, no. So that passes. So before we base on the base legislation for those that support it, council members back shows would you like to'",
        "'speaker_0': 'say anything about. The to clarify your record as why you support it. You don't have to. I'm just want to make sure you get the opportunity before it gets around. Gonzales.'",
        "'speaker_3': 'I mean, I echo the remarks that you made, Council President Harrell is that I, I my my vote last week on the ti was a vote on the process that was chosen to advance what I think to be a very serious policy issue.'",
        "'speaker_3': 'And, you know, I, I fully stand by the remarks I made during Budget Committee last week and the remarks that I've made today that I my sole focus over the next several months will be to craft a clear, cogent policy around an employee hours tax.'",
        "'speaker_3': 'And I say that knowing that the people who I am proposing to be taxed are not pleased with the fact that that's the direction I want to I want to head. And so and that I intend to to find myself in in March of 2006.'",
        "'speaker_3': 'So that is that has been that was my commitment last week during that budget committee. It's my commitment today, and it will be my commitment in March of 2016. It's part of the reason why I wanted this process.'",
        "'speaker_3': 'I'm not going to impugn anybody's motivation up here, but I will say that for me, I am going to stay the course. On making sure that that is one of the minimum outcomes of this process. And that is why I was asking Councilmember Bagshaw as colleague to colleague, what is your intent?'",
        "'speaker_3': 'And if your intent is to not preclude an employee I respect, but in fact create an opportunity where that can be considered after this process, then that is why I ultimately am supporting supported your amendment. If I if I believe that you were lying to me, then I would have, of course, voted voted no.'",
        "'speaker_3': 'But I want to make really clear for the record that it is one of my clear expectations at the end of this process that we fulfill the bill title in this resolution, and that that will definitely include a form of an employee hours tax in March of 2016 for this for council to consider.'",
        "'speaker_0': 'Thank you. That's straight talk. Councilmember Suarez and the customer. Here's Charlie.'",
        "'speaker_1': 'I want to state first of all, i want to thank councilmember gonzalez and o'brian for all the hard work that they did. I want to add.'",
        "'speaker_4': 'That I.'",
        "'speaker_1': 'Co-Sponsored, along with President Harrell, the Sligh of us moving forward, which became, I believe, was the the standard in which Councilmember Gonzalez and O'Brien moved forward to obviously make it better by talking about what this bill would mean.'",
        "'speaker_1': 'I believe that the bill title is correct in its intent that we are marching forward with an employee head tax or homes or whatever we want to call it. I don't believe that any of my colleagues are being disingenuous, are not trying to escape or get out of what the intent of this is.'",
        "'speaker_1': 'We are moving forward. We can no longer look away at the glaring disparity of our city and about having to tax those that have more. So I am voting and I did vote yes on this because I believe and or other progressive taxes does not take away from the fact of the intent that we are moving forward'",
        "'speaker_1': 'with it. And I'll leave it at that. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Whereas I was just reminding my colleagues, we have I think 20 items on the Parks Board agenda. So because.'",
        "'speaker_4': 'We only we have five.'",
        "'speaker_0': 'Resolutions, five resolution. Okay. Customers want you have the floor.'",
        "'speaker_2': 'Thank you. Brittain Harrell. I had prepared my comments not knowing. I didn't I don't have a crystal ball. So I didn't know exactly what was going to happen in the last several minutes. But what I'm going to say is so relevant, council members have made it more relevant.'",
        "'speaker_2': 'Whom do council members? The majority of the council, the corporate politicians represent. They would like to. They would like you to believe that they can represent all of Seattle, rich and poor workers and big business. But that is not reality.'",
        "'speaker_2': 'The reality is that the interests of regular people, low income people, people who are struggling to maintain a foothold in this city, are not the same as the interests of big business, and no politician can truly represent both.'",
        "'speaker_2': 'When council members accept campaign contributions from the Chamber of Commerce, that money comes with strings attached. That is why socialists refuse to take money from big business when we run our campaigns. As a socialist, I always assume that big business gets preferential treatment and special access to elected officials.'",
        "'speaker_2': 'But even I was surprised in these past few weeks, including just a few minutes ago, by the lengths that councilmembers will go to to do the dirty work of big business. After having voted no on the HD. Now we are still struggling to pass a meaningful resolution.'",
        "'speaker_2': 'There is no way to address Seattle's housing and homelessness crisis without serious and ongoing public resources. And the only way to fund that is to tax big business and the super rich, which is where all the wealth in society accumulates.'",
        "'speaker_2': 'There's a simple mathematical reason why we are talking about taxing big business, but for big business that is an acceptable idea. As I mentioned in the Budget Committee meeting last week, a representative of Dairy Gold talked to council members about her objection to the progressive business tax.'",
        "'speaker_2': 'This is a company with $2 billion in annual revenues that would pay, by our estimates, about $45,000 a year. When asked why such a big company should object to such a small tax, she said It is the principle.'",
        "'speaker_2': 'And to defeat that principle know sisters and brothers. She was being very honest because it was a private conversation. It is a matter of principle. And you know why? It's a matter of principle? Because every time big business allows working people and our social movements to win victories, we get emboldened, we get empowered, and we go on'",
        "'speaker_2': 'to the next struggle. They don't want us to be empowered because they know we won't stop with the employee hours tax, however. We also know that to defend that principle, the majority of the council voted to sacrifice the needs of regular people in order to stand with big business as principle that their property profits are sacred.'",
        "'speaker_2': 'Our movement is powerful, and council members not only want to do the bidding of the Chamber of Commerce, they also want you all to believe that isn't what they are doing. And lo and behold, you have the Seattle process.'",
        "'speaker_2': 'We have task forces. And if our movement remains vigilant, we can force council members to follow through on their commitments to pass an early next year. But we will have to remain vigilant because if we let up the pressure, the majority of the council will vote no again on a march and vote to create another task force'",
        "'speaker_2': '. And if you think that's an outlandish prediction, then the last few minutes have proved me right. Look at the lengths to which corporate politicians will go to doggedly, doggedly defend the interests of big business. And it is doublespeak, apparently, as far as ESG goes.'",
        "'speaker_2': 'No means yes.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_2': 'Well for me, I'm fighting to tax big business. I will vote yes on this resolution today, but not because another Seattle process is needed, but because I'm confident that our movement will hold these council members accountable. And if you all keep up the pressure, I will be there with you.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Okay. I'm going to call for the vote. We are not. Would you like. Say one more thing? Commercial. Okay. Sound like she can be real quick here.'",
        "'speaker_4': 'I just wanted to, you know, echo what council member Solon just said and what Councilmember Gonzalez and Suarez said. You know, I feel like what we have put through in this resolution is going to create a diverse state stakeholder.'",
        "'speaker_4': 'I believe that those most impacted will be central to that table and you all will hold the line on what what kind of structures and taxes happen here. I'm not overly concerned about the Andorra clause because the right folks are going to be at the table to make sure that that nothing goes awry there.'",
        "'speaker_4': 'And I also know from the work and style, the reason Councilmember Bagshaw and I get along so well is because we both believe in working in collaboration across stakeholders to find the best solution. And I truly believe, I think you and I have different audiences who we've been talking to about considerations here.'",
        "'speaker_4': 'But I truly do believe that you needed, you know, for the folks who you're trying to bring to the table that openness. And so I look forward to what it looks like in the process. That's going to be a quick expedient process, and we're going to know a lot more at the end of March about how many'",
        "'speaker_4': 'dollars were raised and how many homes will be built. And I look forward to that day. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Harris tally. Okay. I think we have a resolution ready for adoption. Those in favor of adopting the resolution as amended. Please vote. I, i. Those opposed vote no. The motion carries the resolution. Adopted chair was sign it.'",
        "'speaker_0': 'All right. Okay. That concludes our business for today. Is there any further business coming for the Council? Council member? So one.'",
        "'speaker_2': 'Thank you. General, I move to be excused from the full council meeting on November 27, 2017.'",
        "'speaker_0': 'Their second second has been moved in, saying that the council members want to be excused for November 27th. All those in favor say I. I opposed. The ayes have it. Any further business council on.'",
        "'speaker_6': 'Johnson Council member was I'm wondering how long of a break we have in between 10 minutes.'",
        "'speaker_0': 'For the business to become before the council. No. So we will we will adjourn will be back in 10 minutes at 510 for the Parks Board meeting. Everyone, have a great day. We stand adjourned.'"
    ]
}