{
    "AN ORDINANCE relating to the 2021 Budget; amending Ordinance 126237, which adopted the 2021 Budget; changing appropriations to various departments; creating positions exempt from civil service; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'The Report of the Finance and Housing Committee Agenda Item one Council Bill 120041 An ordinance relating to the 2021 budget amending ordinance 126237, which adopted the 2021 budget, changing appropriations to various departments, creating positions exempt from civil service, and ratifying and confirming certain prior acts all by a three quarter vote of the City Council.'",
        "'speaker_0': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you so much. I will provide this committee report on behalf of Councilmember Mosqueda. Council Bill 120041. Colleagues would appropriate nearly $18 million of federally granted corona virus relief funds, otherwise known as CRF, by increasing appropriations in several departments for programs that need additional funding to continue services through the end of 2021.'",
        "'speaker_1': 'These CRF funds were part of the Federal Cares Act that was adopted on March 27, 2020, and included about $131.5 million in direct funding to the city of Seattle. The $18 million of $80 million appropriated in this Council bill are the last remaining funds from the CARES Act grants to the city of Seattle.'",
        "'speaker_1': 'And these funds must be expended by the city before the end of 2021. These expenditures authorized in this legislation include child care provider stabilization grants, funding for emergency food access and grocery vouchers, renewed funding to maintain the Clean City Initiative and vaccine outreach.'",
        "'speaker_1': 'Efforts to reach underserved communities and ensure equitable access to the COVID 19 vaccine. The Finance and Housing Committee did debate this bill, and we voted on the passage of the bill. And the Finance and Housing Committee recommends that the full City Council pass this bill as.'",
        "'speaker_1': 'As as considered in our committee. Are there any additional comments? Hearing no additional comments on the bill. Will the Court please call the rule on the passage of the bill?'",
        "'speaker_0': 'Boris by Louis. I met Alice. Yes. Peterson.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Sergeant. Yes. Strauss Yes. Carville Yes. And Council President Gonzalez. I in favor not opposed.'",
        "'speaker_1': 'Great. Thank you so much. The bill passes and the chair will sign it with a clerk. Please affix my signature to the legislation on my behalf. Well, the clerk please read item two into the record.'"
    ],
    "AN ORDINANCE relating to cable television; authorizing the Mayor or the Mayors designee to approve the transfer of control, subject to conditions, of WaveDivision I, LLC; authorizing the Mayor or the Mayors designee to execute a Cable Franchise Transfer of Controlling Interest Consent Agreement for the purpose of implementing and administering the transfer; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'The report of the Transportation and Utilities Commission. Agenda Item two Council Bill 120043. An ordinance relating to.'",
        "'speaker_1': 'Cable television authorizing.'",
        "'speaker_0': 'The mayor or the mayor's designee to approve the transfer of control subject to conditions of Waive Division one LLC.'",
        "'speaker_1': 'Authorizing the mayor.'",
        "'speaker_0': 'Or mayor's designee to execute a cable franchise. Transfer of controlling interest consent agreement for the purpose of implementing and administering the transfer and ratifying and confirming certain prior acts. The Committee recommends the bill pass.'",
        "'speaker_1': 'Thank you so much. Councilmember Peterson is chair of the committee. You were recognized in order to provide the committee's report.'",
        "'speaker_4': 'Thank you. Council president, colleagues, as I mentioned during our council briefing this morning, this is council 120043, which pertains to one of our city's cable franchise agreements, specifically the Ways Company. This legislation simply has the city consent to the transfer of controlling interest in the parent company of where the city has the cable franchise agreement with Waive'",
        "'speaker_4': 'Division one LLC and Waive will remain the franchise grantee with the Waive brand and operations continuing as is in Seattle for customers. Seattle Municipal Code Section 21.6 0.110 requires us to consider even partial transfers of parent company ownership for cable franchises, and the federal law has a timeline for this consent.'",
        "'speaker_4': 'With that deadline approaching soon. Our Seattle Information Technology Department completed a thorough review of the proposed transfer and engaged both financial and legal experts to assist with the analysis. They all recommend approval as part of the approval are having the city receive from the company a strong corporate guarantee and consent agreement, which requires continued performance and service'",
        "'speaker_4': 'to customers. Seattle City presented all of this to our Transportation and Utilities Committee, and our committee unanimously recommends approval today. Thank you.'",
        "'speaker_1': 'Thank you so much, Councilmember Peterson. Are there any additional comments? Hearing no additional comments. Will the court please call the role on the passage of the bill?'",
        "'speaker_0': 'Paris by Louis. I. Morales. Yes. Peterson.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Sergeant. Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Herbold. Yes. And Council President Gonzalez. I favor Nipost.'",
        "'speaker_1': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Item three Will the clerk please read item three into the record?'"
    ],
    "A RESOLUTION prioritizing people over the profits of pharmaceutical companies; supporting the production of COVID-19 vaccine around the world; urging President Biden to end U.S. opposition to the Waiver from Certain Provisions of the Trade-Related Aspects of Intellectual Property Rights (TRIPS) Agreement for the Prevention, Containment and Treatment of COVID-19 at the World Trade Organization (WTO).": [
        "'speaker_0': 'Adoption of the result? Excuse me. Adoption of other resolutions.'",
        "'speaker_1': 'Agenda Item three.'",
        "'speaker_0': 'Resolution 32004. A resolution prioritizing people over the profits of pharmaceutical companies supporting the production of COVID 19.'",
        "'speaker_1': 'Vaccine around the world.'",
        "'speaker_0': 'Urging President Biden to end U.S. opposition to the waiver from certain provisions of the Trade-Related aspects of Intellectual Property Rights Agreement for the.'",
        "'speaker_1': 'Prevention, Containment.'",
        "'speaker_0': 'And Treatment of COVID 19 at the World Trade Organization, WTO.'",
        "'speaker_1': 'Thank you so much. Colleagues, I will move to adopt resolutions 3 to 0 zero four. Is there a second? Second. It's been moved and seconded to adopt the resolution because members want to hand it over to you as sponsor of the resolution so that you can address it.'",
        "'speaker_3': 'Thank you. This resolution urges President Biden to end the US opposition to the International Campaign Fund, an intellectual property rights waiver from the WTO for COVID 19 vaccines. It also adds the Seattle City Council as a signatory of a community letter to President Biden on that topic that has been signed by over 400 unions, community organizations and'",
        "'speaker_3': 'faith groups from Doctors Without Borders internationally to the Washington State Labor Council and the King County Labor Council. The rapid and widespread global dissemination of vaccinations at the center of every strategy by public health professionals to stop the spread of the virus.'",
        "'speaker_3': 'However, there are breathtaking inequities in the distribution of vaccinations around the world. According to the World Health Organization, nearly 90% of the vaccines have gone to well-off countries, while low income countries have received just 0.2 percent. This has meant that on average, one in four people in high income countries have received a coronavirus vaccine, compared with just'",
        "'speaker_3': 'one in more than 500 people in low income countries. The lack of accessible vaccines in the majority of countries around the world is creating an unimaginable human catastrophe on a scale not seen before. In India, where I grew up.'",
        "'speaker_3': 'Thousands are dying daily and the right wing Modi regime is suppressing the numbers. The reality is even more serious than the reported statistics. Crematorium workers report being instructed to list the cause of death as, quote unquote, sickness rather than COVID.'",
        "'speaker_3': 'Reuters is reporting, quote, gas and firewood furnaces at a crematorium in the western Indian state of Gujarat have been running so long without a break during the pandemic that metal parts have begun to melt and, quote, hospitals are completely, completely overrun.'",
        "'speaker_3': 'And there is a shortage of medical supplies like oxygen. It is dire. This human suffering is being caused by profit driven billionaires and big pharmaceutical companies with the blessing of the Biden administration, the European Union and other major controllers of the WTO policies.'",
        "'speaker_3': 'They are furiously blocking many countries like Brazil, India and South Africa from producing generic versions of the COVID 19 vaccine, all in the name of so-called intellectual property rights. If we don't fight to change this, starting with the necessary first step of removing the WTO patent restrictions.'",
        "'speaker_3': 'Public health experts say it will literally be years before people in the Global South get the vaccine. Over 100 countries have appealed to the WTO, which enforces these so-called intellectual property rights internationally to issue a waiver to allow COVID 19 vaccines to be produced around the world.'",
        "'speaker_3': 'But WTO representatives from richer countries, including the US and the UK, have opposed issuing the waiver. This this opposition was initially a policy of the Trump administration, who steadfastly defended the profits of Big Pharma over the lives of millions of people in the Global South.'",
        "'speaker_3': 'Unfortunately, even through ten day, 100 days of their administration, the Biden regime has continued that policy. The UN Secretary-General Antonio Guterres said the COVID 19 vaccine must be seen as a global public good a people's vaccine. On February 26, a letter to President Biden, signed by over 400 organizations, urged the administration to lift the US blockade of'",
        "'speaker_3': 'the waiver. And and the letter said quote, You can also help restore America's moral and public health leadership in the world by siding with the majority to prioritize saving lives over protecting pharmaceutical corporation monopolies and profits. This new position would be widely noted, given US officials shameful attack on the waiver at the January WTO meeting and quote'",
        "'speaker_3': ', An important Op-Ed appears in this morning's issue of The Washington Post. In strong support of removing the patent restrictions on the COVID vaccine, it's authored by Joseph Stiglitz, Co-recipient of the 2001 Nobel Prize in Economics, and Lori Wallach, the director of Public Citizen's Global Trade Watch.'",
        "'speaker_3': 'They say, quote, Unfortunately, the drug companies have consistently done what they can to preserve their monopoly control. Even today, as they battle the waiver and argue that existing compulsory licensing rights are sufficient, they lobby the US government to sanction countries to use that to.'",
        "'speaker_3': 'These corporations have also undermined this option by building, quote unquote, targets of intellectual property barriers. They fortified their monopolies by registering exclusive rights to industrial designs and undisclosed data such as trade secrets and test data. In addition to numerous patents and copyrights for each medicine, each element would require a license, and the WTO flexibilities might not even'",
        "'speaker_3': 'encompass all of them, end quote. This this update from Joseph Stiglitz and Lori Wallach captures exactly the kind of network of licenses that the WTO imposes to make it impossible for countries to do what is needed to save lives.'",
        "'speaker_3': 'All kinds of members have received important letters from the Washington Fair Trade Coalition and from the Association of Flight Attendants, and also from Hindus for Human Rights. Supporting this resolution from my office and urging the council to vote yesterday.'",
        "'speaker_3': 'The TRIPS waiver, which this resolution is calling for, is supported by, as I said, the Fair Trade Coalition, but also by Partners in Health. The American Medical Student Association. Doctors for America and National Nurses, United Health Gap. Public Citizen.'",
        "'speaker_3': 'Amnesty International. Oxfam Labor Unions and Faith Organizations and API. China. Indivisible Community Alliance for Global Justice. Global Exchange Code Pink Right to Health Action. Washington Federation of State Employees Bossi American Federation of Teachers, Washington and the Jewish Council of Greater Seattle and the Filipino Community of Seattle, among many, many others.'",
        "'speaker_3': 'This allusion is timely because a new round of WTO meetings are beginning, including a Trips council gathering planned for April 30th, which is four days from now, and a General Council meeting due in early May. Activists and organizers around the world are fighting for the waiver and are building momentum to prepare for those upcoming WTO meetings.'",
        "'speaker_3': 'And this resolution will join the Seattle City Council as one part of that effort if it passes today. My hope is that this resolution will inspire other cities to do the same, to make it clear to the Biden administration that we will not accept a continued policy of vaccine nationalism, and we can see how building movements can'",
        "'speaker_3': 'win victories. Just in the past couple of days, the Biden administration was finally forced to concede and send some vaccine materials and doses to India, which they previously report refused to do. And we should recognize that this is a victory, but it is only a first step, and it's not a substitute or an excuse for refusing to'",
        "'speaker_3': 'carry out the TRIPS waiver and allowing every country around the world to make the vaccines they need. On the one side, we have the health and safety of all of humanity, and on the other we have the endless greed for profits by Big Pharma and the billionaire class.'",
        "'speaker_3': 'I hope all council members decide to stand with human life and not billionaire profits. And and I know Councilmember Herbold has some amendments which I've already said I support them, so I invite you to describe them.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you so much, sir. So what I am going to call now on, Councilmember Herbold, what I understand has an amendment that she circulated earlier today. So, Councilmember Herbal. Herbal, I'm going to recognize you to make your motion.'",
        "'speaker_0': 'Thank you. I move to amend resolution 3 to 0 zero four as presented on Amendment One, which was recently submitted.'",
        "'speaker_1': 'There a second.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'Thank you so much, Councilmember Herbold. Please feel free to address the amendment.'",
        "'speaker_0': 'Thank you. I was hoping that the language could just be incorporated in the resolution, but I ran out of time. It's just simply the changes are simply intended to elevate the fact that during a global pandemic are the destinies of of the people in our city are especially connected to the destinies of folks in other cities, particularly'",
        "'speaker_0': 'those cities who have less access to vaccine. And so the amendment adds recitals to emphasize the the, the importance of disseminating vax vaccination everywhere to develop herd immunity. Again, that is something that must be done in a way that can can help all of us.'",
        "'speaker_0': 'The amendment also recognizes that new COVID variants continue to develop throughout the world, and the importance of getting vaccines distributed worldwide can increase the likelihood of success in the battle against COVID 19, and emphasizes the importance of vaccinations to reopening both in developed and in the developed countries and in the global south.'",
        "'speaker_0': 'And then finally recognizing that so many of our residents here in Seattle have family members in other countries and including those countries without adequate access to vaccine. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Herbold, are there any comments or questions on Councilmember Rebel's amendment? Hearing no questions or additional comments. Will the caucuses called a roll on the amendment to Resolution 32004, as described by and previously circulated by Councilmember Herbold.'",
        "'speaker_0': 'I, Lewis? Yes. What? Alice? Yes.'",
        "'speaker_4': 'Peterson Yes.'",
        "'speaker_0': 'So what?'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Strauss Yes.'",
        "'speaker_0': 'Herbold Yes. And Council President Gonzalez. I is in favor and opposed.'",
        "'speaker_1': 'The motion passes and the amendment is adopted to resolution 32004. Are there any additional comments on Resolution 3 to 0 zero four as amended? Charles Moore Peterson, please.'",
        "'speaker_4': 'Thank you, council president. I appreciate the good intentions of this resolution 32004 and the amendments that I just voted for. I believe we all share the goals to have the COVID vaccines widely available here and throughout the globe.'",
        "'speaker_4': 'I believe we agree on that goal. And I also believe our experienced congressional delegation, including Pramila Jayapal, Adam Smith, Patty Murray and Maria Cantwell are more than capable of providing advocacy and oversight on the issues impacting the nation and international relations.'",
        "'speaker_4': 'And that includes how best to curtail the pandemic as quickly as possible across the nation and abroad. Once again, I think we're reminded of the limitations of our own council rules, which do not currently allow council members to abstain, even on non-binding resolutions.'",
        "'speaker_4': 'I believe in abstention would be appropriate when we might agree on the overarching message of a resolution like this one, but may not have either the bandwidth to research the details as we deal with the multiple crises in our own city.'",
        "'speaker_4': 'Or we might not have the expertize in important underlying details. For example, I believe it's important to research these details, but because of the speed at which this came about, I'm not able to delve into the matters of pharmaceutical, intellectual property or World Trade Organization agreement on trade related aspects of intellectual property rights and other issues.'",
        "'speaker_4': 'I also do not believe this particular issue is within the scope of our influence as a legislative body of a city, nor is it directly tied to our duties under the charter of the city. So with no ability to abstain on this resolution, I'll have to be voting no.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilor Petersen, are there any additional comments on the resolution as amended? Counselor. Excellent. As the sponsor, you get the last word to close out debate and then we are going to call the roll.'",
        "'speaker_3': 'Thank you, President Gonzalez. I just in response wanted to respond to Councilmember Peterson quickly and then make a few other comments. In closing, Councilmember Peterson said, we I believe we all share the goal that vaccine should be available for everyone globally.'",
        "'speaker_3': 'But if a councilmember is planning to vote no on this resolution or even one thing expressing the desire to abstain on this issue, then no, then we don't share that goal, because if you share the goal and vaccine should be available, then as an elected representative at any level, one should be not only willing to, but eager'",
        "'speaker_3': 'to fight for the rights of all working people. But in this situation, this is a question of a human catastrophe that is happening at an unprecedented and indeed at an industrial scale. And so I think that it is simply impossible and it is unconscionable to view this issue solely to the narrow lens of what the Seattle City'",
        "'speaker_3': 'Charter says. It has to be viewed through the lens of moral and political obligations of this moment. And I just wanted to add the point that, you know, this is very much related to Seattle City Council's responsibilities, because we know that because it's a pandemic, which means it's a global epidemic.'",
        "'speaker_3': 'Public health experts are warning us that the virus has the capability of spreading, multiplying and mutating in different parts of the world. And the only way, as Duncan Rehoboth said, for us to help keep everyone safe is to reach the degree of herd immunity that that epidemiological statisticians are recommending that we urgently reach, which is going to'",
        "'speaker_3': 'be impossible without billions of people having access to the vaccine, which in turn will be impossible without this necessary first step of the WTO trips waiver. So I don't see how you can stand for Seattle's working people and the Seattle community without also standing up for the access to vaccines globally.'",
        "'speaker_3': 'Because such a thing is, you know, they're just mutually exclusive in the case of a pandemic. And so, in other words, not ensuring that the whole world has access to the vaccine means playing Russian roulette with the lives of people in America and in Seattle.'",
        "'speaker_3': 'And the city council's resolution is going to be but one step, important step, but it's just one step forward. We will need other elected officials to also weigh in. And I'm hoping that this resolution passes. So we put that example forward.'",
        "'speaker_3': 'I also just wanted to add that Big Pharma and the elected officials in Congress and including many Cabinet appointees in the Biden administration, claim that intellectual property rights and the massive profits for Big Pharma are necessary to create an incentive to develop future vaccines and treatments.'",
        "'speaker_3': 'But we should be recognizing that this is a complete lie. The reality is that no clinical innovation would be possible without overwhelming amounts of public funding and without overwhelming amount of work by armies of dedicated researchers and scientists.'",
        "'speaker_3': 'And these are salaried employees. These are not billionaires. And yet, once clinical innovations are available, their profits all go to the billionaires, not to the ordinary people, billions around the world who have contributed to make this research possible.'",
        "'speaker_3': 'For instance, The New York Times reported that Caitlin Perrigo, one of the heroes in the development of the groundbreaking mining technology that has made COVID vaccines possible and, as you know, has been the backbone of this lifesaving vaccine, spent her career going from publicly funded lab to publicly funded lab, supported by government grants, never herself making more'",
        "'speaker_3': 'than $60,000 a year. This is not new. We know this has happened with AIDS medications. And also in 2007, when the intellectual property rights to the EpiPen were purchased by a pharmaceutical company, it increased the wholesale price six fold from $100 in 2009 to $609 in 2016.'",
        "'speaker_3': 'All of this logic was clearly demonstrated in an investing article on CNBC last Wednesday titled, quote, Goldman Sachs Assets in biotech research are both. Is curing patients a sustainable business model? End quote. In other words, Goldman Sachs, which is an absolutely notorious Wall Street corporation.'",
        "'speaker_3': 'They are having to acknowledge publicly that while having one shot cures two results, which is completely possible given our technical knowhow today in humanity. While one shot cures are extremely beneficial to humanity as a whole, not to not only saving lives, but preventing any amount of.'",
        "'speaker_3': 'That people face because of diseases. It is not good for the profits and and more importantly is the repeated and chronic profit making of Big Pharma. It shows the logic of capitalism itself is completely in conflict with the needs of humanity.'",
        "'speaker_3': 'And we should remember in 1999, the people of Seattle filled our street streets to protest the WTO meetings, inspiring an international movement against corporate globalization. This is what the movement was protesting against. International trade agreements like WTO are written by the capitalist elite from around the globe to defend their profits against working people across the globe.'",
        "'speaker_3': 'And that is why we need international solidarity. And I want to thank all the organizations who have helped with this resolution and strongly build support for it. But I especially I'm going to thank everybody, of course, who have lent their support for this.'",
        "'speaker_3': 'But I especially wanted to recognize the coalition of Seattle Indian Americans, the Washington Fair Trade Coalition and socialist alternative organizations who really build strong support for this resolution. And as I said, it will be a small but very crucial step in building momentum towards the April 30th Council meeting.'",
        "'speaker_3': 'I'll end with a message to our movement. I agree with the activists calling for a Seattle protest on April 30th. Let's end the status quo of billionaire driven, billionaire profit driven vaccine apartheid and vaccine nationalism and save millions of lives by winning vaccine, internationalism and a people's vaccine.'",
        "'speaker_3': 'And let's make sure that we build on that in the United States by winning Medicare for All.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you so much. That does conclude debate on this particular item. So at this point, I'm going to ask that the clerk please call the role on the adoption of the resolution as amended.'",
        "'speaker_0': 'Boris Yes. Thank you.'",
        "'speaker_2': 'Lewis Yes.'",
        "'speaker_0': 'Morales Yes. Peter Son.'",
        "'speaker_4': 'No.'",
        "'speaker_0': 'Sir. I want yes. Strauss Yes. Herbold Yes. And Council President Gonzalez I seven in favor.'",
        "'speaker_1': 'One opposed the motion carries, the resolution is adopted and the chair will sign it. Will the clerk please affixed my signature to the legislation on my behalf? Other business colleagues. Is there any further business to come before the Council?'",
        "'speaker_1': 'I'm sorry, Lewis, please.'",
        "'speaker_4': 'Thank you, Madam President. I would ask the indulgence of the Council to be excused from both briefing and full council for the May 3rd meeting.'",
        "'speaker_1': 'Hey. Thank you so much. Colleagues, if there's no objection. Member Lewis will be excused from council related meetings on May 3rd. Hearing no objection. Councilmember Lewis will be excused from our full council meeting on May 3rd, as well as our council briefing.'",
        "'speaker_1': 'Any other further business to come before the council? Hey, hearing none, colleagues, this does conclude the items of business on today's agenda. Our next regularly scheduled city council meeting is on Monday, May 3rd, 2021 at 2:00 PM. I hope you all have a wonderful afternoon.'",
        "'speaker_1': 'We're adjourned.'"
    ]
}