{
    "2019 State of the City Address delivered by Mayor Jenny A. Durkan on February 19, 2019.": [
        "'speaker_1': 'The report of the City Council Agenda one clerk 5314415 2019 State of the City address delivered by Mayor Jenny Durkan on February 19th, 2019.'",
        "'speaker_0': 'Just one moment. So this is a just sort of a perfunctory filing of the file, the speech, if you will, and I believe we will vote on it. And we'll place the file on the file before we vote on filing the clerk file.'",
        "'speaker_0': 'But anyone wish to say any words? No regrets council members want.'",
        "'speaker_2': 'Thank you, President Hollande. Just wanted to explain to members of the public that the vote the council is about to take will file into the city's records, the mayor's State of the City address. And of course, it should be on record.'",
        "'speaker_2': 'So I will be voting yes, but my vote will not be a vote on the content of the speech. However, and I wanted to bring to light something that the mayor said that was, in my view, dangerously inaccurate.'",
        "'speaker_2': 'Three times in his speech, Mayor Durkan said that Seattle has invested over $710 million in affordable housing during her time in office, adding, however, compare that while the claim to what it actually says in her budget, in the mayor's budget, it lists the funds that she has made available to build affordable housing.'",
        "'speaker_2': 'It is, and this can be verified by council members. It is less than $50 million per year, not 710 million. And as a matter of fact, if the political establishment was actually willing to spend $710 million on building affordable housing instead of under 50 million, then we could actually begin to seriously address the affordable housing crisis.'",
        "'speaker_2': 'The problem is that when the mayor exaggerates the investment in affordable housing, it sounds like it is not necessary to tax big business to build affordable housing on a scale big enough to have a real impact. But that would be wrong.'",
        "'speaker_2': 'In reality, the mayor is not investing 710 million. Really. She is investing less than 1% of the city budget in affordable housing. And regular people will need to continue to get organized to build a movement, to build anything close to affordable housing worth $710 million.'",
        "'speaker_2': 'And let's remember that ordinary people in New York City just won a massive victory against Amazon in its attempt to get a $3 billion corporate handout, including a helipad for Jeff Bezos. It really shows that when people get organized, we can win.'",
        "'speaker_2': 'This was assumed to be a done deal by everybody, including business owners, who were surprised by the fact that Amazon had to back off. So I will be voting yes on filing this Clark file, but I do not endorse her false claim about investment in affordable housing.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you for those words, Councilmember. What would anyone else like to say anything before we file the Clark file? And for the viewing public, this is a public document. The facts are, I believe that Councilmember Swan was referring to our Page seven of the published document and I personally wanted to thank the Mayor for giving a speech'",
        "'speaker_0': 'and creating a vision for what this city could be. Okay, I'll move to file Clark. File 314415. Those in favor of filing the Clark. Please vote i i those opposed vote no. The motion carries no place. The file is placed on file.'",
        "'speaker_0': 'So please read the next agenda item into the record.'"
    ],
    "AN ORDINANCE relating to The City of Seattles Myrtle reservoir radio-transmitter facility; authorizing the Director of Finance and Administrative Services to execute a lease with King County for its use of part of the radio-transmitter facility for the new, regional Puget Sound Emergency Radio Network; declaring the part of the facility leased for King Countys use to be surplus to the Citys utility needs; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'The Report of the Governance, Equity and Technology Committee Agenda Item to Council 119 454 Relating to the City of Seattle Smart River Radio Transmitter Facility, the committee recommends Eagle Pass.'",
        "'speaker_0': 'This is an item that had come from the Governance, Equity and Governance and Equity and Technology Committee. This Council basically authorizes the finance and administrative services us to enter into a 25 year lease agreement with the King County, Puget Sound Emergency Radio Network, otherwise known as p cern in p cern, basically, or this sort of purpose on'",
        "'speaker_0': 'earth, or to install and operate an emergency radio equipment at the MYRDAL transmitter facility. And this again this system, this peace erm system is a countrywide countywide emergency radio system that was used by first our first responders. The older system was about 20 years old and the previous manufacturer ended their support for these many of its critical'",
        "'speaker_0': ', critical components that actually ended in 2018. And so, as you may recall, in 2015, the voters approved a $273 million levy to upgrade the aging emergency radio network. So this is the third such agreement that the city and the King County slash peace and governing that governs peace terms, use of a city owned property.'",
        "'speaker_0': 'And then there was a previous agreement between SB you and King County and agreed with FISA and King County Governance, the Maple Leaf Transmitter Facility. So. So on this series, any questions or comments are asked at the. Clark, please call a role on the passage of the bill.'",
        "'speaker_1': 'Flores must get a somewhat.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'Back. John Gonzalez Herbold high Johnson President Harrell eight in favor and.'",
        "'speaker_4': 'Unopposed.'",
        "'speaker_0': 'The bill passed in show Senate. Please read agenda item number three.'"
    ],
    "A RESOLUTION relating to misclassifications of workers as independent contractors when they should be designated as employees; requesting semi-annual updates to the Council starting at the end of the 3rd quarter of 2019 on the work the Office of Labor Standards and Labor Standards Advisory Commission is doing to investigate and correct misclassifications.": [
        "'speaker_1': 'Item 3.8 The Housing, Health, Energy and Workers Rights Committee. Agenda Item eight Resolution 318 63 relating to misclassification of workers as independent contractors when they should be designated as employees. Requesting semiannual updates to the Council starting at the end of the third quarter of 2018 on the work on the Office of Labor Standards and Labor Standards Advisory'",
        "'speaker_1': 'Commission is doing to investigate and correct Ms. Classifications Committee recommends the resolution be adopted as amended.'",
        "'speaker_4': 'Casper Mosquito Thank you, Mr. President. If I might, I might defer to the prime sponsor of the legislation, and I can make a few closing comments at the end. This came through my committee, but it was an honor to work with Councilmember Herbold on this.'",
        "'speaker_0': 'Councilmember Herbold.'",
        "'speaker_5': 'Yes, many thanks to the chair of the committee, Councilmember Mosqueda, for allowing me to move this resolution through her committee. The reason why this resolution is so important is that we are seeing that the the definition of employment is changing before our very eyes as we work to pass better labor laws to protect our employees.'",
        "'speaker_5': 'There are more and more employees who are being categorized as contractors and not eligible to receive access to our labor laws like $15 minimum wage, paid sick and save time, and a whole host of other protections for the workforce.'",
        "'speaker_5': 'The resolution itself asks the Office of Labor Standards to propose policy solutions to the Council in order to address the issue of misclassification. Misclassification. Misclassification is when an employer.'",
        "'speaker_1': 'Calls.'",
        "'speaker_5': 'Somebody who fits the definition of an employee, a contractor. The resolution asks the Labor Standards Advisory Committee to develop a work program and consider how the committee can work with the Office of Labor Standards to engage stakeholders in addressing this issue.'",
        "'speaker_5': 'It also directs the Office of Labor Standards to develop strategies that the city should consider based on the findings of a study that is being conducted by the Washington State Department of Commerce with a delivery date of June 1st, 2019.'",
        "'speaker_5': 'The. I've been corresponding with an Amazon flex driver who over the last year has described evolving practices from that employer. And it has gone from a situation where people were told a week in advance of shifts being available at the same time and individuals having the opportunity to compete for those that shift to what the practice is'",
        "'speaker_5': 'now is that shifts are offered at any different times of the day, different times of the week, and literally those shifts are gone within within a minute. So this means that people are actually having to spend large amounts of time at their computer, that they're not being compensated for waiting for these shifts.'",
        "'speaker_5': 'A Gizmodo report identifies that the issue at hand is labor misclassification. Companies pay the drivers to do the work of employees, but treat them as independent contractors, denying them basic amenities like health care benefits, worker compensation in the event of an on on the job injury.'",
        "'speaker_5': 'This is something that two drivers that were that were interviewed for this this article had themselves experienced. And we know from the National Employment Law Project that the determination of whether or not a worker is doing the job of a contractor employee comes down to some specific key factors.'",
        "'speaker_5': 'And that is not simply whether or not you call them a contractor or an employee. So I am really looking forward to the Office of Labor Standards, working with the Labor Standards Advisory Committee, to explore this issue and bring some policy recommendations back to the Council to act on.'",
        "'speaker_0': 'Thank you. Because we heard about. Jasmine Mosquito.'",
        "'speaker_4': 'Thank you very much, Mr. President. So when I came to office a little over a year ago now, the first conversation I had with Councilmember Herbold was regarding her longstanding interest in helping to address issues of misclassification so that our labor standards can ensure strong protections for all workers.'",
        "'speaker_4': 'As we know, misclassification affects many industries, many traditional industries, like the folks that I've worked with in the past, and home care janitor, janitorial work, construction and restaurant work. And now we've seen more and more examples of how misclassification is prevalent in the gig economy.'",
        "'speaker_4': 'Many workers who are misclassified, mischaracterized by their employers as independent contractors result in fewer labor protections and really put the workers in a precarious position when they try to avoid taxes or not pay worker's compensation or unemployment insurance or other financial obligations, that sometimes the workers don't actually know that they're in that situation until they get injured'",
        "'speaker_4': 'or they get let go. Also, we know that it's a really important issue to look at very carefully because there's a number of folks who are truly independent contractors. They're bona fide independent contractors who have direction and control, who set their own schedule, who have their own tools.'",
        "'speaker_4': 'And they are like our real estate agents and our hairdressers, folks who are truly independent contractors and many of the domestic workers that have created their own companies as well, which we'll talk about in a minute, are folks who truly have direction and control over their work.'",
        "'speaker_4': 'They should have the right balance so that our laws truly reflect their work. And I think the approach that Councilmember Herbold has put together through this resolution, her work with our business and labor partners at the table, will help us find that right balance to address misclassification.'",
        "'speaker_4': 'And we look forward to seeing how this issue continues to play out at the state level as well. I appreciate your leadership on this and happy to see this move forward.'",
        "'speaker_0': 'Very good. Castro Gonzalez.'",
        "'speaker_5': 'Thank you. So I want to thank Councilmember Herbold for her continued dedication and work in this particular space. I know she's been thinking through this particular subject for quite some time, including when she was the chair responsible for labor issues at the city.'",
        "'speaker_5': 'And I also want to echo thanks for Councilman ROSQUETA for making time in her busy committee schedule to hear this important issue. And I just want to say that I really support the direction of this resolution. As a young lawyer, I had an opportunity to work with my firm, Shrader, Goldmark and Bender and the Latino Latino Bar'",
        "'speaker_5': 'Association of Washington to establish a legal clinic at Central La Raza, still housed at El Centro. De La Raza has been going strong since 2008 and really proud of the fact that this legal clinic has been able to help and provide legal services to thousands of low wage workers that wouldn't ordinarily have access to legal services in'",
        "'speaker_5': 'a lot of different areas. But one of the things the reason I bring that up is because one of the areas that we received a lot of inquiries from from many, many, many people, dozens of people who would go to the legal clinic seeking legal advice is in this space of independent contractors and really struggling with understanding'",
        "'speaker_5': 'from a worker perspective whether you truly are an independent contractor or not. And the amount of egregious examples of abuse, of misclassification, what were just innumerable so many stories from people living here in Seattle, working in Seattle who were forced to, for example, sign contracts, signing their rights away, even though they didn't speak English, for example, didn't'",
        "'speaker_5': 'understand what they were signing, and even if they did speak English, the complexities of the documents that they're being asked to sign, that effectively consent to being an independent contractor when they're actually functioning like a worker. Those are the stories that I kept seeing coming through legal clinic that I know still are coming through that legal clinic'",
        "'speaker_5': '. And so looking forward to being able to really dig into this body of work and providing some protection for this class of workers is going to be really critical and important. And I would urge Councilmember Herbold and the Office of Labor Standards to figure out a way to partner up with many of the legal clinics that are'",
        "'speaker_5': 'currently happening throughout the city, through the King County Bar Associations or the Washington State Bar Association, and certainly through a minority bar associations who have real life examples of how this misclassification plays out from the worker perspective, and happy to create connections in that space to make sure that that that whatever the policies that are being developed'",
        "'speaker_5': 'are going to be truly responsive to some of the needs. And then in closing, I'll just say that we can have a better director at the Office of Labor Standards than Marty Garfinkel to address and tackle this issue.'",
        "'speaker_5': 'He is considered an expert in the state in terms of his legal expertize related to independent contractor misclassification. He's done some of the most seminal wage and hour class action cases in this area. And. You all will be very well-served by his expertize.'",
        "'speaker_5': 'And I know he this is one of his favorite topics in the whole wide world. So I expect that this work is going to be really robust and I'm really excited to see what the recommendations are going to be.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_0': 'Very good. Excellent. Okay. So if that list is any further comments, we'll go ahead and vote those in favor of adopting the resolution. Please vote i i. Those opposed vote no. The motion carries. The resolution is adopted. And Cheryl, sign it.'",
        "'speaker_0': 'Okay. Please read items nine through 12.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Section 23.41.010 of the Seattle Municipal Code to approve the 2018 University District Neighborhood Design Guidelines.": [
        "'speaker_1': 'The report of the Planning and Zoning Committee Agenda and 13 Constable 119 362 relating to the license earning in many section 23.40 1.0 ten and said I misspoke her to approve the 2018 University District Neighborhood Design Guidelines Committee recommended the passes amended.'",
        "'speaker_0': 'Katherine Johnson I'm sorry to say that applause is not for, you know, you know.'",
        "'speaker_4': 'Rarely does anyone applaud land use decisions. Council President But we don't do it for the recognition. We're going to take action this afternoon and to design guidelines that actually many members of the community have spent a long time working on to get us to this point.'",
        "'speaker_4': 'The first as our clerk read out, so everybody is the university district design guidelines. And these are really critical in this state of time because of the recent zoning changes that we made in the neighborhood and now prevalence of new projects that are going on in the neighborhood that are taller buildings.'",
        "'speaker_4': 'So these design guidelines reflect a change in the character of the university district and will allow for more compatibility with those new high rise character buildings of the University District by the light rail station. It started with a series of community workshops in 2017 2017 and resulted in the design guidelines that are here in front of us'",
        "'speaker_4': 'today. I'm happy to talk through some of these, but really this is about how do we create more opportunities for those tall towers to reflect both off of each other and have a presence in the neighborhood? How do we create better urban context and Ali space activation in particular?'",
        "'speaker_4': 'We've got a lot alleys in the University District, not dissimilar from downtown that we'd like to do a lot more activation. How do we create some setbacks, particularly in the University District, to reflect the unique character of the Ave itself?'",
        "'speaker_4': 'And then how do we do better with public space realm connectivity? So a lot of really great stuff in here. Happy to ask for your support.'",
        "'speaker_0': 'Thank you very much. Any questions or comments? If not, please call the role on the passage of the bill.'",
        "'speaker_1': 'Whereas I must get to I so what I thank John Gonzalez Herbal Johnson by President Harrell eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed and share of assignment. Please read the United Number 14.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Section 23.41.010 of the Seattle Municipal Code to approve the 2019 Uptown Neighborhood Design Guidelines.": [
        "'speaker_1': 'Agenda Item 14 Council Bill 119 439 relating to land since only in many section 23.40 1.0 ten of the system. The Speaker to approve the 2019 Uptown Neighborhood Design Guidelines Committee recommend still pass.'",
        "'speaker_0': 'From Johnson.'",
        "'speaker_4': 'To the Uptown Neighborhood. The Uptown neighborhood also is the beneficiary of having had some zoning changes in the last several years. This does set a design guidelines is really reflective of the community as it is today. And we had several very poignant moments in committee where we had folks coming to us and suggesting that the current design'",
        "'speaker_4': 'guidelines weren't working for them because the neighborhood wants to see development that is more funky, is more artistic, is more in concert with what their neighborhood itself identifies as. But their current design guidelines don't allow for that kind of flexibility and that kind of encouragement.'",
        "'speaker_4': 'And so these new design guidelines, do they put an emphasis on habitat of native species? They put an emphasis on important locations, gateways, corner sites and sites adjacent to Seattle Center and really try to incentivize developers to make this more the arts district that it is through visual interpretation in a lot of their buildings in Uptown, also'",
        "'speaker_4': 'a project that has been through several years of public comment and very excited to finally be able to bring this one forward.'",
        "'speaker_0': 'Very good councilman picture.'",
        "'speaker_2': 'Thank you, Councilmember Johnson. Thank you. And thanks to all of those folks from our uptown neighborhood. I want to recognize in particular Rick Hooper and many of us know Deb FRAUSTO, her partner, Allen Hart, who have done a lot around the urban design framework.'",
        "'speaker_2': 'I'm really excited about this, especially when we've got the art and culture overlay coming in with our new arena just outside making the connection for Belltown, not Belltown residents as well as uptown residents around the Arena and Seattle Center is going to make a big difference.'",
        "'speaker_2': 'So thanks for shepherding this one.'",
        "'speaker_0': 'If other questions or comments are not, please call the role on the passage of the bill.'",
        "'speaker_1': 'Suarez mosque matter. I want Bagshaw Gonzales purple Johnson President Harrell hi eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed and sure aside, please read the report of the Sustainability and Transportation Committee.'"
    ],
    "AN ORDINANCE granting Seattle Childrens Research Institute permission to construct, install, and maintain one set of private communication conduits under and across Terry Avenue, south of Virginia Street and north of Stewart Street; and one set of private communication conduits under and across the alley between Virginia Street and Stewart Street, north of 9th Avenue and south of Terry Avenue; for a ten-year term, renewable for two successive ten-year terms; specifying the conditions under which this permit is granted; and providing for the acceptance of the permit and conditions.": [
        "'speaker_1': 'The Report on Sustainability in Transportation Committee Agenda Item 15 Council Bill 119 457 Granting Seattle Children's Research Institute Permission to construct, install and maintain one set of private communications conduits. Committee recommends the bill pass.'",
        "'speaker_0': 'And thanks for filling in for Council Member Bryan Councilmember of Johnson Johnson.'",
        "'speaker_4': 'Briefly, this is the kind of usual term permit that we approve here at City Council, a tenure permit with two tenure options. If we were to act today, this would allow for Seattle Children's Research Institutes in the Denny Triangle neighborhood to create two new private communication conduits under Terri Avenue, south of Virginia Street, and north of Stuart'",
        "'speaker_4': 'Street and Stuart Street. And in the alley between Virginia Street and Stuart Street, north of Ninth Avenue. These will allow them to share data between research facilities on research related to cancer, lupus and other children's related diseases. In total, the term permits, I think, are in the neighborhood of about $9,000, which is generally our cost to recoup'",
        "'speaker_4': 'the staff time associated with processing these permits so they have an inflationary adjustment to them. So I think it's a couple of percent per year. And again, we use those resources from those permits to process the applications when they come in once every decade or so.'",
        "'speaker_4': 'So I can't answer many questions, but I don't anticipate there will be.'",
        "'speaker_0': 'Very good any questions or comments in that. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Suarez macheda i. So what.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Think john gonzalez herbold johnson resident Harrell eight and favorite unopposed.'",
        "'speaker_0': 'Bill passed and sure sign it. Okay. Is there any further business coming for the council? I have a few things I have to do. So first I'd like to move to excuse Councilmember O'Brien from next Monday's meeting, which is February 25th.'",
        "'speaker_0': 'All those in favor say I. I suppose the ayes have it and then I need to move to be excused from on March 4th and March 11th. He comments?'",
        "'speaker_5': 'Depends on who's going to be your protest.'",
        "'speaker_0': 'Tell you in a minute. All those in favor of me being excused in March 4th and March 11th say I. I oppose. The ayes have it. And Councilmember Juarez has ordered a much larger gavel than this little one.'",
        "'speaker_0': 'And she will be the president that that month. Thank you. With that, everyone, have a great rest of the day and we stand adjourned.'",
        "'speaker_2': 'Thank you.'"
    ]
}