{
    "A RESOLUTION relating to the acknowledgment of the various harms and ongoing historical and inter-generational traumas impacting American Indian, First Nations, and Alaskan Natives for the forcible removal of Indian children and subsequent abuse and neglect resulting from the United States American Indian Boarding School Policy during the 19th & 20th Centuries; supporting American Indian and Alaskan Native communities efforts in calling on the United States Congress to commission a study and report on the United States responsibility and role in adopting and implementing an American Indian Boarding School Policy; and committing to work with the local American Indian and Alaskan Natives in efforts of reconciliation in addressing the impacts of historical trauma, language and cultural loss, and alleged genocide.": [
        "'speaker_1': 'Item one agenda item one resolution 31621. Relating to the acknowledgment of the various harms and ongoing historical and intergenerational traumas impacting American Indian First Nations and Alaska Natives for the forcible removal of Indian children and subsequent abuse and neglect resulting from the United States American Indian boarding school policy during the 19th and 20th centuries, supporting American Indian'",
        "'speaker_1': 'and Alaska Native Communities efforts and calling on the United States Congress to commission a study and report on the United States responsibility and role in adopting and implementing an American Indian boarding school policy and committing to work with the local American Indian and Alaska Natives in efforts of reconciliation, in addressing the impacts of historical trauma, language and'",
        "'speaker_1': 'cultural loss and alleged genocide. Introduced October 5th, 2015.'",
        "'speaker_0': 'Thank you. Council Member So on.'",
        "'speaker_2': 'Thank you, Brian Burgess. I wanted to begin by thanking everybody in the Seattle Indigenous community for their activism, starting with the Indigenous Peoples Day resolution that we were able to pass unanimously last year. I wanted to call out my family specifically for his unflagging enthusiasm, for his community and for all of us who are fighting for social'",
        "'speaker_2': 'justice. I also wanted to especially thank Chris Jones as well for presiding over the celebration that we had at Burton Islanders. This resolution acknowledges the traumas and horrors of the U.S.. American Indian boarding school policy. For those who do not know throughout the 19th century and well into the 20th century, which was not that long ago, and'",
        "'speaker_2': 'you heard testimonies of people who here who have had relatives who went through this. The federal government had a policy that continued the genocide of the indigenous peoples of this continent. Over a hundred thousand Native American children were taken from their homes and families, often forcefully.'",
        "'speaker_2': 'As was said before, these children were not allowed to speak their own languages or practice their own religions. They were subjected to abuses including child labor and sexual abuse. Genocide. As the Seattle Human Rights Commission confirms, is not only the mass killing of a people, it is also the erasing of their culture, their language, their religion.'",
        "'speaker_2': 'And that is precisely what the US American Indian boarding school policy was designed to do. It was not accidental. This resolution demands that U.S. Congress acknowledge and take steps to correct the damage done by this policy. This resolution was initially drafted, as I said, by Madam Lee and has been supported by a long list of community organization'",
        "'speaker_2': ', the Seattle Human Rights Commission. Also Idle No More. Their speakers were here El Centro de la Raza and the Northwest to Spirit Society. All these activists are part of a growing movement for justice in Seattle against racism, against violence, and for housing and income justice.'",
        "'speaker_2': 'And I must mention the Black Lives Matter movement organizations are also in solidarity with this resolution. And just like the Indigenous Peoples Day resolution we passed last year, this resolution is so powerful because it is groundbreaking. The federal government has never even acknowledged this history, never mind taking steps to correct the harm done or offer any sort'",
        "'speaker_2': 'of justice or restitution. And this resolution demands that the US Congress do that. The timing of the resolution is also not an accident. We are voting on this today. On Indigenous Peoples Day 2015, because Indigenous People's Day is about celebrating Indigenous peoples, but also about using the symbolic importance of this day to continue the struggle against ongoing'",
        "'speaker_2': 'marginalization and oppression of these communities and indeed all communities. Please support this resolution. And to everyone in the community, let's start preparing for the next steps of our struggle.'",
        "'speaker_4': 'Councilmember Rasmussen Well, I strongly support this resolution. I think that what is more powerful than the resolution, though, is hearing from the people themselves who suffered in the boarding school experience. And several years ago, I attended an elementary school classroom of fifth graders, and a Native American elder came and spoke to them about his experience of being'",
        "'speaker_4': 'taken away from his family at about the same age as those young students at the elementary school I attended were, and they were shocked to hear that something like that had happened to him, and he was barely able to speak about his experience 60, 60, 70 years ago.'",
        "'speaker_4': 'He actually broke down into tears talking about that experience that still traumatizes him today to talk about that. And I think that it is important, as this resolution says, that our public schools do teach that history because the people who have experienced that history are here today.'",
        "'speaker_4': 'And nothing is more powerful than hearing from the people who have suffered that experience and know that experience. And they can convey that to the students of today more powerfully than any of us can and far more powerfully than this resolution.'",
        "'speaker_4': 'So I'm hoping that the school district listens to us and they invite people in to teach the young people of the experiences of this history and to. Thank you, President Burgess. It's I'm speechless that this has come before us.'",
        "'speaker_4': 'And it's long overdue. It's something that should have been said long ago when I was a child. My family would go out to near Bay and we would fish. And I found myself invited into Native families to play and eat.'",
        "'speaker_4': 'And it wasn't until later in my adult life that I began to understand the injustices and the harm caused by the country. I live in the country that I'm a citizen to the native peoples, just unspeakable harm that to this day continues on.'",
        "'speaker_4': 'My family suffered some hardships during World War Two, were imprisoned in prison camps, and the trauma that it caused my family was widespread. It wasn't until my father was an adult that I heard the stories of being imprisoned and the emotional harm that that caused.'",
        "'speaker_4': 'I support this resolution. It's a beautiful thing to hear your young speak, your native language that despite the injustices caused by our country to you, that you're recapturing the heart of who you are. So with that, I support this resolution and will continue to support the causes of sovereign nations in our country.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'I moved to adopt resolution 31621. It's moved in second and the resolution be adopted. Are there any further comments? Councilmember So on.'",
        "'speaker_2': 'Just wanted to say in closing that we've come a long way since Minneapolis and Seattle declared Indigenous Peoples Day last year. Many other cities are on the way and our hope is and we will keep fighting for this, that by next year the federal government will have abolished Columbus Day nationally.'",
        "'speaker_2': 'And did I hear correctly that the governor of Alaska declared today as indigenous peoples day? That's that's a huge step forward. We should make sure that happens at Washington State as well. And just very quickly, I also wanted to add that we should take all the energy that has been generated from what we've been able to achieve'",
        "'speaker_2': 'last year and this year to make sure that we win victories on affordable housing, racial equity in schools, and especially that we demand our elected officials support the educators who are pushing for the pushing to include the real history of America in the text books.'",
        "'speaker_2': 'I think that is all that is really necessary. And and last but not least, we've all also been together in fighting against Cherry Point Coal Terminal. And I really congratulate the Idle No More movement on that. And we've been in the canoes in front of the polar pioneer to fight against Shell's attempts to drill in the Arctic'",
        "'speaker_2': '. So the fight goes on. Can actually.'",
        "'speaker_0': 'Those in favor of adopting Resolution 31621 vote I II oppose vote no. The resolution is unanimously adopted and the chair will support. Thank you very much for coming down and come back any time you want. We'd love to have you.'",
        "'speaker_0': 'Please read items two through five.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Section 25.05.800 of the Seattle Municipal Code to repeal the categorical exemption for SEPA review of proposed infill development.": [
        "'speaker_1': 'The Report of the Planning, Land Use and Sustainability Committee Agenda Item six Council Bill 118518. Relating to land use and zoning amending sections 25.05.800 of the Seattle Municipal Code to repeal the categorical exemption for SIPA review of proposed infill development.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember O'Brien.'",
        "'speaker_4': 'Great. So this is the first of four ordinances that we're going to be voting on today. They all relate to the comprehensive plan, although this one a little peripherally. The amendment states sorry, is the bill title states. This would repeal the categorical exemption for SIPA that we passed a few years ago.'",
        "'speaker_4': 'Just as a reminder for folks that exemption allowed for projects within urban villages that hadn't met their growth targets, where area wide CPA analysis had already been done. Those projects could be exempt from CPA because later on in one of the bills they were adopting for the comprehensive plan in the amendments, the growth estimates that we will'",
        "'speaker_4': 'replace the growth targets with are not at the urban village level. There is no longer a possibility for this to happen. So we're repealing this allowance. It's possible that next year DPD may come back with a new bill, but for now this would be repealed.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'So I want back shot I got in.'",
        "'speaker_8': 'High.'",
        "'speaker_1': 'Hero I Muqata II. O'BRIEN Hi, Okamoto. All right. RASMUSSEN Right. And President Burgess, 90 favorite nine, opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item seven.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending the Seattle Comprehensive Plan to incorporate changes relating to housing affordability proposed as part of the 2014-2015 Comprehensive Plan annual amendment process.": [
        "'speaker_1': 'Agenda Item seven Council Bill 118471. Relating to land Houston Zoning Amending the Seattle Comprehensive Plan to incorporate changes relating to housing affordability proposed as part of the 2014 2015 Comprehensive Plan Annual Amendment Process. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember O'Brien.'",
        "'speaker_4': 'So now this is the first of three that are direct, direct amendments to the comprehensive plan. The scope of this particular council bill is adding language to the about around housing affordability to the comprehensive plan. So there's a series of amendments we make essentially establishing that it's a priority for the city to work on affordable housing.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the rule on the passage of the bill.'",
        "'speaker_3': 'Sir, want back shot?'",
        "'speaker_1': 'I got him. I Harrill, i Muqata. I O'Brien II Okamoto Rasmussen and President Burgess. Nine In favor nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item eight.'"
    ],
    "AN ORDINANCE, relating to land use and zoning, amending the Seattle Comprehensive Plan to reflect changes needed as part of the periodic review and to incorporate changes proposed as part of the 2014-2015 Comprehensive Plan annual amendment process and amending Section 23.52.004 of the Seattle Municipal Code.": [
        "'speaker_1': 'Agenda Item eight Council Bill 118469. Relating to land used in zoning amending the Seattle Comprehensive Plan to reflect changes needed as part of the Periodic Review and incorporate incorporate changes proposed as part of the 2014 2015 Comprehensive Plan Annual Amendment Process and amending Section 23.52.004 of the Seattle Municipal Code.'",
        "'speaker_1': 'The committee recommends the bill passes amended.'",
        "'speaker_0': 'Thank you. Councilmember O'Brien.'",
        "'speaker_4': 'So this particular amendment is the more we do traditionally the traditional component of the comprehensive plan amendment on an annual basis. There are a number of changes throughout the city. This includes what we heard testimony on about changing the land use map, the zoning around the Church of the Nazarene in West Seattle.'",
        "'speaker_4': 'But there's a whole host of other changes that have been through committee. I would like to amend this by adding some language around establishing growth estimates in urban villages. I discussed this at briefing, but I'd like to go ahead and read.'",
        "'speaker_4': 'In my amendment. They would add a Section four which reads The council requests that the Department of Planning and Development or its successor department develop a proposal for Council consideration in 2016 that allocates a share of estimated residential and employment growth outside of urban centers to urban villages.'",
        "'speaker_4': 'The Council further requests that the alternative include policies or a narrative description of a work program to monitor how growth in urban centers and villages will be tracked in relation to existing and planned infrastructure. Second rate. And so, as I mentioned, under the CPA ordinance and these amendments this year, we will no longer have growth targets anywhere'",
        "'speaker_4': '. We will have growth estimates in urban centers, but not in the villages. And what this amendment does is ask DPD to come back to City Council in 2016 with a proposal on how to include growth estimates broken down by urban village.'",
        "'speaker_0': 'Questions or comments? Councilmember Rasmussen.'",
        "'speaker_4': 'You're asking for questions relating to the entire bill.'",
        "'speaker_0': 'On this amendment first place. Councilmember Okamoto.'",
        "'speaker_4': 'The the latter part of the amendment speaks to.'",
        "'speaker_5': 'How.'",
        "'speaker_4': 'A work program to monitor how growth in urban centers and villages will be tracked in relationship to existing and planned infrastructure. Can you speak a bit more what planned infrastructure, what that refers to? I mean, it's intended to be broad.'",
        "'speaker_4': 'It would include things like transportation, parks, an open space, emergency services, fire stations, all the types of infrastructure utilities. And this puts it back on the department and the executive to come back with a plan as as the city grows that we're tracking the infrastructure investments concurrently you.'",
        "'speaker_0': 'Other questions or comments all in favor of Councilmember O'Brien's amendment. Vote I. I oppose Vote No. The amendment is unanimously adopted. Any questions or comments about the legislation? Councilmember Rasmussen.'",
        "'speaker_4': 'Thank you. I just need a clarification from Councilmember O'Brien, if you could help with that. With regard to the Murgon Junction heard the Church of the Nazarene minister speak about that and I'm familiar with the church and the wonderful work that it does.'",
        "'speaker_4': 'But can you explain that text? Is it the one that says except where as part of a development proposal, a long standing neighborhood institution is maintained? Well, how does that. Relate to the church in its proposals. Is that?'",
        "'speaker_4': 'Is that the one that I think the minister is if you have a question about that, is if you look if you're on online, if you look under attachment one, be current and propose future land use map Morgan Junction Residential Urban Village that will pull up a map and show an area of the future land use map'",
        "'speaker_4': 'where we're going to make the. Make the changes to include that property in a multi-family residential area instead of a single family residential area. Do you see that? I see the math. Right. That's where the hash marks. Correct.'",
        "'speaker_4': 'So you're proposing that it be it go from single family to multifamily in that neighborhood or right around that parcel? Yes, that's accurate. Again, this is this is the future land use map. It's not the actual zoning change, but this is a prerequisite.'",
        "'speaker_4': 'Right. Happens. And then the church is supportive of that. For what reason? I have heard repeatedly over the past year from both church and community members, frankly, an amazing outpouring for what is a relatively modest change. I believe it's going to allow the church to redevelop their parcel with some housing units, which will provide the financing to'",
        "'speaker_4': 'amount, allow them to stabilize the church and open space that has been used as a community park for a number of years to do that on into the future. I'm seeing nods, so I think I got it roughly correct.'",
        "'speaker_0': 'Thank you. Any other questions? Please call the role on the passage of the amended legislation.'",
        "'speaker_1': 'Sir want bagshot Gordon Harrell, I Licata II O'Brien.'",
        "'speaker_4': 'Okamoto, I.'",
        "'speaker_1': 'Rasmussen and President Burgess nine in favor nine opposed the.'",
        "'speaker_0': 'Bill passes and the chair will sign it. But before we do item nine, I want to alert folks that the Select Committee on Housing Affordability will meet approximately 5 minutes after the council meeting is over. Please read item nine.'"
    ],
    "AN ORDINANCE, relating to land use and zoning, amending the Seattle Comprehensive Plan to reflect changes to the University Community Urban Center goals and policies, as well as the Future Land Use Map, as part of the periodic review and to incorporate changes proposed as part of the 2014-2015 Comprehensive Plan annual amendment process.": [
        "'speaker_1': 'Agenda Item nine Council Bill 118470. Relating to land used in zoning. Amending the Seattle Comprehensive Plan to reflect changes to the university community, urban center goals and policies, as well as the future land use map as part of the Periodic Review and to incorporate changes proposed as part of the 2014 2015 Comprehensive Plan Annual Amendment Process.'",
        "'speaker_1': 'The committee recommends the bill passed as amended.'",
        "'speaker_0': 'And there's a divided report on this legislation. So we'll begin with the majority report. Council member O'BRIEN Thank you.'",
        "'speaker_4': 'So the probably clearest way for folks to track this is to look at the attachment attachment one amendment to the future land use map. And that should give you an overview with the little bubbles that explain all the different changes in the map, where the changes are being proposed in the legislation as it came out of committee'",
        "'speaker_4': '. This series of changes is all in anticipation of a neighborhood rezone that we're anticipate receiving from Department of Planning and Development sometime in 2016. It's something that's been discussed for a number of years. For a while, it was anticipated in 2015, but we expect to get that next year.'",
        "'speaker_4': 'And these are the future land use map changes that would accommodate the range of changes that will be be proposed in that in that rezone. Normally, we might take these concurrently. We know we traditionally do the comprehensive plan changes in March, but because next year we're doing comprehensive plan changes as part of Seattle 2035, and there's going'",
        "'speaker_4': 'to be a longer process. I anticipate that those changes won't come until much later in the year. And if we don't do these now, that would inhibit our ability to do the university rezone until after that was done, which likely would be too late in the year.'",
        "'speaker_4': 'Specifically in committee, there are a couple of differences. All that Councilmember Lucado speak to his alternative, but there are a couple of changes that we heard some concerns about. We discussed those. And Councilmember Burgess and I felt felt strongly that the proposal from DPD was solid.'",
        "'speaker_0': 'Thank you, Councilmember Licata. I will be voting against this legislation because I well, I do recognize that there was a lot of participation by community members as well as our staff over a period of a one or one or two years.'",
        "'speaker_0': 'Nevertheless, there was a great deal of opposition still remaining in that neighborhood from the community council and particularly from folks in the residential areas that were included in the areas that are proposed for changes. The there was some compromises made in reducing the area.'",
        "'speaker_0': 'However, people living in that community felt that it did not go far enough. And they're concerned that the nature of the university district will dramatically change, particularly since this will open the door for increased uptake of zoning and therefore probably what they call the towers that will change the.'",
        "'speaker_0': 'I think the quality and I think the quality of living as far as casting large shadows, increasing of traffic and make it more difficult to provide even more open space in an area that does not have that much open space.'",
        "'speaker_0': 'They had asked that more time be used to take a look at those concerns. They felt that in particular the community council was not involved enough and that they are concerned about the University Community Urban Center potentially being impacted.'",
        "'speaker_0': 'So there'd be an increase in displaced residents from the existing available affordable housing as it was torn down for new development and without a plan to see how those individuals would be housed in the future so they could still have access to university without having to move further and further away and therefore contributing to the overall congestion'",
        "'speaker_0': 'in the university district. That is, plan should at this time be on hold. So I support their efforts on that. Thank you. Any other comments or questions, Councilmember Rasmussen?'",
        "'speaker_4': 'Thank you. I would like to hear from the majority of the committee how their response to the concerns that Councilmember Lakota raised about what I would describe as loss of neighborhood character, displacement of affordable housing, and what we see now, if you go to the university district, an incredible homogenization of what is a very eclectic community, both'",
        "'speaker_4': 'with regard to the type of housing income levels who are able to live there are in cultural organizations, longstanding community organizations as well. So this is what I think Councilmember Lakota, you've expressed concern about. And if that is true, then how how can we prevent those risks and those losses from occurring if this legislation goes forward?'",
        "'speaker_4': 'Is this the last opportunity to prevent those kind of losses? But anyway, I would love to hear from the majority their response to Councilmember Carter's concerns. Councilmember O'BRIEN So the I think a lot of the concerns that Councilmember Alucarda raised.'",
        "'speaker_4': 'Are probably more directed towards what will likely be part of a discussion around the actual reason for the university district. The you know, if you look at the map on attachment one, the specific changes we're making on this amendment to the comprehensive plan are relatively modest.'",
        "'speaker_4': 'There were some concerns about in some of the pockets of the neighborhoods where they would be. There's nothing specifically about these amendments that I mean, even without these amendments, there's lots of areas that could be considered for zones and towers throughout throughout the university district.'",
        "'speaker_4': 'But where and how we do that will be determined in that process, which is to come in 2016. I can speak specifically to, you know, within the urban village there is no single family zoning. It's all multifamily and commercial.'",
        "'speaker_4': 'There's a couple tiny pockets where we've expanded the urban village. One is around a church that wants to be able to add more ADA accessible accessibility from a parking lot. But they're not allowed to do that because it's in a single family zone.'",
        "'speaker_4': 'I didn't hear any opposition to that change. There's also a small piece of single family that's going to be incorporated now along Ravenna, and it's going to be turned into commercial mixed use. Again, I had I didn't hear any I don't recall hearing specific concerns about that.'",
        "'speaker_4': 'There were some folks that wanted to see some area taken out of the urban village. And we took a little bit out and they asked to take more out. And there's an area that is where there currently is a tower that's currently zoned multi-family residential.'",
        "'speaker_4': 'And the map would allow that to be multi-family, residential or commercial mixed use like an some Seattle mixed zone.'",
        "'speaker_0': 'Thank you. Any other comments or questions? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Student Bagshaw. Hi.'",
        "'speaker_1': 'Gordon. I harrow.'",
        "'speaker_8': 'I.'",
        "'speaker_1': 'Licata.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'O'Brien.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Okamoto.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Rasmussen. No. And President Burgess high seven in favor to oppose.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Is there any other business to come before the council? We will reconvene at Councilmember O'Brien. What time? Three, ten, three, ten, 3:10. As the Select Committee on Affordable Housing, the council is adjourned.'"
    ]
}