{
    "AN ORDINANCE relating to City employment; authorizing execution of a collective bargaining agreement between The City of Seattle and the Seattle Fire Chiefs Association, IAFF, Local 2898 to be effective January 1, 2015 through December 31, 2018; amending Ordinance 125207, which adopted the 2017 Budget, by increasing appropriations to the Seattle Fire Department for providing the 2015, 2016, and 2017 payments therefor; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Passed and chair was silent. Please read the short title report of the full council.'",
        "'speaker_3': 'Every part of the full council agenda item one Constable 1190 44 relating to city employment authorizing execution of a collective bargaining agreement between the City of Seattle and Seattle. Fair Cheese Association 8if Local 2898 to be effective January 1st, 2015 through December 31st, 2018.'",
        "'speaker_0': 'Jasmine Burgess.'",
        "'speaker_7': 'Thank you. As I mentioned this morning at a briefing, this is a collective bargaining agreement between the city and the Fire Chiefs Association. This union represents primarily our battalion chiefs in the fire department located throughout the city. It's a four year agreement which ends December 31st, 2018.'",
        "'speaker_7': 'It represents approximately three regularly appointed city employees. And the conditions of this agreement are consistent with the parameters set by the Labor Relations Policy Committee.'",
        "'speaker_0': 'Very good. Are there any comments? Any questions? If not, I move to pass counts. Bill 119044. It's been moved to a second. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Marez O'Brien Bagshaw Burgess Gonzales Herbold Johnson, President Harrell I eight in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to automated fixed camera revenue; amending Ordinance 125207, which adopted the 2017 Budget; changing appropriations to various departments and budget control levels, and from various funds in the 2017 Budget; and amending Sections 5.81.010 and 5.82.010 of the Seattle Municipal Code; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Bill passed and chair assignment Please read the next agenda item.'",
        "'speaker_3': 'Agenda item to cancel Bill 1190 46 relating to automated fixed camera revenue.'",
        "'speaker_0': 'Customer in Burgess.'",
        "'speaker_7': 'Is this the this is the ordinance on the traffic? Yes. Right. Yes. This is an ordinance that allows for the use of city traffic ordinance or traffic camera fines and fees to be used for a one time expenditure to the Seattle school district to pay for transportation related services, specifically busses to shift from a three tier bell'",
        "'speaker_7': 'system to a two tier bell system.'",
        "'speaker_0': 'And I see why you hesitated. Because I was actually supposed to speak to that, right?'",
        "'speaker_7': 'Yes, you are. But I was happy to cover for you.'",
        "'speaker_0': 'As described by Councilmember Burgess, and you didn't push back right away. So I think we've again, this is follow up legislation accountable 118999 that we pass on June 14th, where we basically put a proviso in, as Councilmember Burgess stated, to appropriate $2.3 million solely for SDR to fund one time only transportation services for us out of public'",
        "'speaker_0': 'schools and maybe spent for no other purpose. And again, in order to use school safety, traffic and pedestrian improvement funds, this legislation allows us to amend our code to allow for that bus transportation. You know, during during the discussions, we sort of made it clear that, you know, the policy regarding Bill Times three, tier two tier is'",
        "'speaker_0': 'solely responsibility of public schools and they do furnish this with information. School transportation funding is the responsibility of school district safety. And I think based on our discussion this morning during our briefing, we reiterated the fact that the state must fully fund basic education, which includes transportation costs.'",
        "'speaker_0': 'But but at the end of the day, we also are incredibly concerned about safety, and we make a lot of investments towards safety. And so that's what this investment is all about. And so I would ask that the full council support it.'",
        "'speaker_0': 'And again, I want to thank you for your earlier support when we sort of describe this legislation. Thank you. Cast members. Sorry about that. Any questions? Okay. I'll move to pass Council Bill. QUESTION Yes, I see a couple of hands.'",
        "'speaker_0': 'Councilmember Herbold, thank you.'",
        "'speaker_2': 'I do have a question. As I only became aware of this legislation today, I would be interested to find out. And I understand that we probably don't have this information before us right now. How the allowance of 2.3 million in traffic safety camera funds will impact, if at all, plans for safe routes to schools projects in the'",
        "'speaker_2': 'in the upcoming year. This Council has identified as a priority that 20% of automated camera enforcement dollars go directly to infrastructure projects in communities that improve pedestrian and bike safety. And if we're going to end up with a reduction in those projects for for next year, I think we should prepare perhaps in our budget discussions for for'",
        "'speaker_2': 'how to supplement those those pressing needs.'",
        "'speaker_0': 'I think I'll take your question sort of a point and a point that I would agree that obviously we don't have excess money just sitting around for these kinds of one time investments. And as we get ready to scrub our budget here and we look at our safety investments, we will look at this in conjunction with the'",
        "'speaker_0': 'other safe roads who are trying to invest. So I think your point is well taken. Any other accounts parents want to respond to Councilmember Herbert's concern? I think many of us do share that concern. Councilman Burgess.'",
        "'speaker_7': 'Yes. Thank you and thanks. Thank you for raising that. I think one option we have this fall is to tap a greater percentage of those funds.'",
        "'speaker_2': 'Interested in doing.'",
        "'speaker_7': 'That. Exactly. But I also would just say to you colleagues that next year, a year from now, when you're asked to renew this one time funding and make it permanent, you should remember this discussion. And this is one time investment to help the school district because of the confusion around the McCleary funding.'",
        "'speaker_7': 'And I would just encourage us next year when I'm not here, that the city is not in the city government is not in the business of funding the school district for items that are in the definition of basic education.'",
        "'speaker_0': 'And Councilman Burgess, we invite you to public comment. Succession drop.'",
        "'speaker_7': 'Now, here, I'll come down and get my 2 minutes. Okay. You'll be brief, though, but I'll be brief.'",
        "'speaker_0': 'Yeah. Okay. Any further comments? If not your private? I will just. No, there's not. It's not a loan. It's a one time grant, if you will. Okay. I moved to pass Council Bill 119046. Okay. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Suarez, O'Brian, Bagshaw, Burgess, Gonzalez, Herbold Johnson. I eight in favor and unopposed to the.'"
    ],
    "AN ORDINANCE relating to City employment, commonly referred to as the Second Quarter 2017 Employment Ordinance; establishing new titles and/or salaries; designating positions as exempt from Civil Service status; returning positions to Civil Service status; and ratifying and confirming certain prior acts; all by a 2/3 vote of the City Council.": [
        "'speaker_0': 'Bill passed and sure will sign it. Please read the next agenda.'",
        "'speaker_3': 'Item 3.2 The Affordable Housing Neighborhoods and Finance Committee Agenda Item three Council Bill 1190 19 relate to city employment, commonly referred to the second quarter 2017 Employment Ordinance establishing new title center salaries designated positions as exempt from Civil Service Status, Returning positions and Civil Service Status and ratifying confirmed research in prior acts, all by a two thirds'",
        "'speaker_3': 'vote of the City Council Committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilman Burgess.'",
        "'speaker_7': 'Thank you. Each quarter we get an ordinance that moves positions from the civil service off the civil service rules, makes them exempt from civil service rules and procedures, and then sometimes that adds positions back. This particular ordinance moves five positions off of the civil service status, and it returns one position to civil service status.'",
        "'speaker_0': 'Thank you, councilmembers. Any further questions? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Suarez O'Brian Bagshaw Burgess Gonzales Herbold Johnson President Harrell.'",
        "'speaker_0': 'Right.'",
        "'speaker_1': 'Aden favor and unopposed.'",
        "'speaker_0': 'Bill pass the chair will sign it please read the next agenda item.'",
        "'speaker_3': 'Agenda item four Accountable 1190 20 Relating to city employment adopting in 2017 citywide position list. The committee recommends the bill pass.'"
    ],
    "AN ORDINANCE authorizing, in 2017, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Education and Early Learning, Department of Parks and Recreation, Human Services Department, Law Department, Information Technology Department, Seattle Fire Department, Seattle Police Department, and Seattle Public Utilities to accept specified grants and private funding and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'The bill passed the chair of the Senate. Please read the next agenda item and you can read the short title.'",
        "'speaker_3': 'Agenda Item five Council Bill 1190 23 authorizing in 2017 acceptance of funding from non city sources committee recommends the bill pass.'",
        "'speaker_0': 'That's my Burgess.'",
        "'speaker_7': 'Thank you. This is the second quarter grant acceptance ordinance. This receives $4.7 million from external sources. For example, there's $2.2 million from the King County Flood Control District to be used in Longfellow Creek in West Seattle. There's also $550,000 from King County awarded to our city Office of Immigrant and Refugee Affairs to provide civil legal assistance for'",
        "'speaker_7': 'individuals with matters before the federal immigration courts. This is King County money that's being paired with $1 million from the city of Seattle that Councilmember Gonzales advocated for. And this is King County's contribution. And then there's $490,000 from sound transit to assist the fire department in inspections, planning and safety work related to the East Link Light Rail'",
        "'speaker_7': 'Project.'",
        "'speaker_0': 'Get any further comments or questions? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Whereas O'Brian, Bagshaw Burgess I Gonzalez Herbold High Johnson, President Harrell I 18 favorite unopposed.'"
    ],
    "AN ORDINANCE amending Ordinance 125207, which adopted the 2017 Budget, including the 2017-2022 Capital Improvement Program (CIP) (commonly known as the 2nd quarter supplemental); changing appropriations to various departments and budget control levels, and from various funds in the Budget; adding new projects; revising project allocations for certain projects in the 2017-2022 CIP; creating both new exempt and non-exempt positions; making cash transfers between various City funds; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'Bill passed and chair of Senate Please read agenda item number six and you can read the short title.'",
        "'speaker_3': 'Agenda item six Cancel 1190 22 Amending Ordinance 125207, which adopted the 2017 budget, including 2017 through 2022 Capital Improvement Program. The committee recommends the bill passes amended.'",
        "'speaker_7': 'Councilmember Burgess, Thank you. This is the second quarter budget supplemental ordinance. We do this each quarter as we go through the year. This makes adjustments to the city budget that we adopted for this year. Last fall, for example, there's a $10 million allocation to Seattle City Light to respond to customer requests for utility connections and pole attachments'",
        "'speaker_7': 'that will be repaid to the city through fees that city light charges. We also in committee amended the ordinance to approve to video technology specialist for the police department. We had approved funding for these positions last fall but because the body worn video camera.'",
        "'speaker_7': 'Jack was not ready to be implemented at the time. We did not give authority for the positions. Now that that program is moving forward, this gives authority for the police department to hire these two video technology specialists. There's also a $75,000 ad from Councilmember O'Brien to assist the Magnuson Park Community Center.'",
        "'speaker_5': 'What's wrong, Councilmember Johnson?'",
        "'speaker_7': 'Excuse me. Councilmember Johnson. That's right. You weren't here, but it was Councilmember Johnson. Sorry. My apologies.'",
        "'speaker_2': 'Being Councilmember Wise.'",
        "'speaker_7': 'And assist with the Magnuson Park Community Center and some services there for primarily for young people and children there. And then there's funding for the city auditor who is awarding a contract to the Seattle King County Health Department to assist with baseline research and evaluation that needs to be done for the city's new sweetened beverage tax, which'",
        "'speaker_7': 'takes effect in January. This baseline work is necessary to establish a baseline for something to be compared to. As we move forward with the tax and this $480,000 for that work will be repaid out of the proceeds from the beverage tax.'",
        "'speaker_0': 'Any questions or comments? Councilmember Johnson.'",
        "'speaker_5': 'Just want to say a quick thank you to my colleagues for supporting that amendment coming out of committee. Folks in the park have continued to identify issues that they would like the city council to keep on our radar screen.'",
        "'speaker_5': 'This was a first opportunity for us to identify some short term wins, which included supporting services for expanded hours at the community center, as well as supportive services through funding through the Human Services Department. I also want to bring to the public's attention that there was funding in this proposed second quarter supplemental to have the Facilities and'",
        "'speaker_5': 'Services Department hire a consultant Round Charles Street Campus Development Plan, which would effectively start the discussions that many in the Chinatown International District asked us to do for several years now and consider disposition of public lands on the Charles Street campus for redevelopment for affordable housing and community ownership.'",
        "'speaker_5': 'So two really good adds as part of the discussion. Looking forward to voting yes.'",
        "'speaker_0': 'Very good. And for the comments. Caspar Herbold.'",
        "'speaker_2': 'Thank you. I just want to thank the City Budget Office for including some funding in the second quarter supplemental that I became aware of the need for during our discussions in the first quarter supplemental. During that time, I discovered that there was a 2000 Seattle Department of Transportation's study that identified 24 High Priority Street segments, a high'",
        "'speaker_2': 'priority for landslide mitigation, and discovered that 17 years later, we're only seven on on the list. I raised this as an issue and it did not does not require any sort of amendment did not require an amendment within within committee because the city budget office added 1.37 million into the second quarter supplemental to address several of these'",
        "'speaker_2': 'High Priority Street segments that are on this list of 24. The six different segments that this this funding will now go towards towards addressing. And we also have a commitment from the city budget office to get us back on track with completing the other high priority segments on this 2000 year study.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Excellent. No further comments. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Maurice O'Brien. Bagshaw. Burgess. Gonzales, Herbold II Johnson, President Harrell I eight in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of Senate Please read item seven through nine.'"
    ],
    "AN ORDINANCE relating to the Technology Matching Fund Program; making allocations and authorizing implementation of certain Technology Matching Fund projects in 2017; providing that 2017 appropriations for the Technology Matching Fund from the Cable Television Franchise Subfund and from the Information Technology Fund shall automatically carry forward into the 2018 fiscal year; allowing that any unspent funds from an individual project may be applied to another project that meets the goals of the Digital Equity Initiative; and ratifying and confirming certain prior acts.": [
        "'speaker_3': 'Short title The Report of the Education, Equity and Governance Committee Agenda Item ten Council Vote 1190 29 relating to the Technology Matching Fund Program, making allocations and authorizing implementation of certain technology matching fund projects in 2017, the committee recommends the bill pass.'",
        "'speaker_0': 'Thank you very much. So this is our annual technology matching fund legislation, and it's always an honor to look at these organizations and award them funds. And it's sort of a process I'll describe in a moment here about what our See Tab does.'",
        "'speaker_0': 'But again, this is a meaningful opportunity for us to make community investments intended to address the equity gaps and the digital gap that I think many of us know very well. This year's projects are projected to provide more than 600,000 community matching resources, and they will reach over 6000 residents, 3600 immigrants and refugees, 1500 seniors, 1100 people'",
        "'speaker_0': 'with disabilities, and other residents and workers throughout our city. So let me give a few highlights of these great projects. And again, I want to thank Councilmembers Gonzales and Suarez for, again, a very meaningful discussion at the table.'",
        "'speaker_0': 'The Ethiopian community in Seattle will upgrade their computer lab to provide Ethiopian communities with basic computer literacy classes for seniors and after school computer sciences classes for their youth. The Coalition for Refugees from Burma are awarded funds to provide computer literacy classes at Bailey Elementary and the Seattle World School and offer parent technology mentoring classes to support'",
        "'speaker_0': 'skill building for parents and students and community members. The Education for All Group and District One is a group that will focus on digital citizenship and communication project. It will establish a computer lab for East Africans offering workshops in computer usage, productivity and software and Internet citizenship.'",
        "'speaker_0': 'For Life Cares, an organization in District three Technology Access Enhancement Project. There they will expand the mobile lab to teach technology classes at nine more Seattle Housing Authority buildings. The Horn of Africa Services. They'll enhance East Africans access to technology.'",
        "'speaker_0': 'They'll upgrade a computer lab. This so serves over 200 East African community members and train home care home child care providers who use computers to improve their business and financial operations. Keen on community health care. And they're going to expand the senior friendly kitchen on Smart Lab that a senior friendly technology lab designed to enable Asian seniors'",
        "'speaker_0': 'in my that it's age 60 plus to increase technology and health literacy to prevent social isolation and increase access to health care and digital resources. Launch Code. They will provide 20 week computer programing classes that enables people with barriers to employment and technology to gain highly marketable tech skills.'",
        "'speaker_0': 'The North Seattle Boys and Girls Club Branch actually the Wallingford Boys and Girls Club in District four. They'll install new 14 desktop computer lab for 250 low income youth to use for homework help and hands on learning activities.'",
        "'speaker_0': 'One America. They will focus on English and digital skills for citizenship. I'll engage limited English proficient adult immigrants in the Chinatown ID District in increasing Digital Literacy Skills Senior Center of West Seattle. There, they'll upgrade an outdated ten station computer lab with new equipment, provide seniors and community members with current technology and Wi-Fi access.'",
        "'speaker_0': 'The Somali Family Safety Task Force is another organization, the East African Women Basic Computer Literacy Project, the South Park Information and Resource Center and District one. They'll empower South Park residents to gain and teach basic technology skills to 75 non-English speakers.'",
        "'speaker_0': 'STEM Paths Innovation Network, a project in the Dunlap Elementary Community, a program that provides math and reading interventions with infused science, technology, arts, engineering and math are steamed as students. And just two more. The West African Community Council in District two is empowering West Africans with technology to develop a mobile lobe, more mobile lab to increase digital'",
        "'speaker_0': 'literacy and access technology in the West African community. And last a wing luke Museum of the Asia Pacific American Experience will provide a mobile digital media lab for low income youth. And establishes mobile lab to improve, provide Asian Pacific American youth.'",
        "'speaker_0': 'And so before we vote on this, I do want to just make two points that came out of the discussions, one being that as we are now by districts that the you I want to thank the community technology technology advisory board, the volunteers looking at these under looking at these awards and looking at underrepresented communities.'",
        "'speaker_0': 'But now that we are by districts, I think a message we'll work offline with them as make sure that that the district representation filter is sort of part of the consideration as they move forward because we want to make sure that that is factored in.'",
        "'speaker_0': 'And then I think Councilmember Gosar made a point that we look at, again, how we award these presentations. If we there might be a possibility where we have an oral presentation part or at least utilize that as one tool to make sure that some groups that might be able to do a little better than that, that make'",
        "'speaker_0': 'sure that we're using the right filters to reach our communities were intended to do. And and that would be a good opportunity to sort of reset, if we will, how these awards are done. I think we're doing a great job of always improving those.'",
        "'speaker_0': 'That was the tenor of the conversation. We had a community at the at the committee table. Okay. That was a mouthful. Thanks for your patience. And you can get off your email and get ready to vote. Everybody set any questions or any comments.'",
        "'speaker_0': 'Okay, please call the roll on the passage of the bill.'",
        "'speaker_1': 'Suarez O'Brian. Big John Burgess. Gonzalez Herbold. Hi Johnson. President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Hate in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the Superintendent to enter into a Use, Occupancy and Maintenance Agreement with Seattle Public Theater for the provision of theater arts programming, education, and services at the Department of Parks and Recreations Green Lake Park Bathhouse Theater.": [
        "'speaker_0': 'Passes and Cheryl Senate please read the report of the Parks Seattle Center, Libraries and Waterfront Committee.'",
        "'speaker_3': 'The report at the Park Seattle Center Libraries and Waterfront Committee Agenda Item 11 Council Vote 1190 40 Relating to the Department of Parks and Recreation authorizing the superintendent to enter into a use occupancy and maintenance agreement with Seattle Public Theater for the provision of theater, arts programing, education services at the Department of Parks and Recreation, Green Lake'",
        "'speaker_3': 'Park, Boathouse Theater. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Because my words.'",
        "'speaker_2': 'Thank you. Let's see. This is a ten year agreement with an optional five year extension. The SEAL Public Theater will operate and manage the Green Lake Bathhouse as a theater providing a range of public benefits. The SEAL Public Theater has been operating the space since 2000.'",
        "'speaker_2': 'The facility was built in 1927. Sealed public theater will be responsible for routine maintenance and minor repairs, helping to keep the building going strong in its old age. Yes, that was my line in there. Seattle Public Theater will also provide free events to the community outreach and volunteer activities, scholarships and youth programs.'",
        "'speaker_2': 'All public benefits are clearly listed in Exhibit C of the agreement in the committee recommends approval of the agreement.'",
        "'speaker_0': 'Very good. Any comments or questions on the role on the passage of the bill?'",
        "'speaker_1': 'Whereas I. O'Brien Major Burgess Gonzalez purple Johnson, president hero height eight in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the Superintendent of Parks and Recreation to enter into a Project Partnership Agreement with the Seattle District United States Army Corps of Engineers for purposes of executing the Alki Coastal Erosion Control Project; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Will pass and chair assignment please read agenda item number 12.'",
        "'speaker_3': 'Agenda Item 12 Council Vote 1190 43 Relating to the Department of Parks and Recreation Authorizing Superintendent Parks and Recreation to enter to your project partnership agreement with the Seattle District, the United States Army Corps of Engineers. For purposes of executing the Coastal Erosion Control Project and modifying, confirming certain prior acts, the committee recommends vote passes amended councilmember'",
        "'speaker_3': 'words.'",
        "'speaker_2': 'Thank you. This is the other seawall issue. This is the Schmitz Elk Seawall Replacement Project. This council will authorize the superintendent to enter into an agreement to complete a replacement for the badly deteriorated seawall at the Emma Schmitz Memorial Overlook Park.'",
        "'speaker_2': 'The current seawall has a projected fail rate of almost 3%. This course will continue to grow unless the replacement project is done soon. The Army Corps of Engineers hold total of the project, I think is 2.9 million. The Army Corps will be spending 1.9.'",
        "'speaker_2': 'The city will contribute $1 million and the committee recommends passage of the bill.'",
        "'speaker_0': 'Very good. Any comments or concerns or questions?'",
        "'speaker_2': 'Customer Herbold I just wanted to thank Councilmember Juarez for her work on this, as well as the work with the Army Corps of Engineers. The cost share, I think, is a good, good deal for the city, and I appreciate that the design is two feet higher than the existing structure to account for what we know is very'",
        "'speaker_2': 'likely to be in the future, which is sea level increases and increased storm wave heights.'",
        "'speaker_0': 'Very good. Any further comments or questions? Please call the role on the part of the bill.'",
        "'speaker_1': 'Morris I O'BRIEN Thank John Burgess Gonzalez purple hi Johnson President Harrell all right Aden favor and unopposed will.'",
        "'speaker_0': 'Pass and chair of the Senate please read agenda item number 13.'"
    ],
    "A RESOLUTION adopting Seattle Parks and Recreation 2017 Parks Development Plan (hereafter referred to as the 2017 Parks and Open Space Plan); and authorizing the Department of Parks and Recreation to submit the plan to the Washington State Recreation and Conservation Office.": [
        "'speaker_3': 'Agenda item 13 resolution 31763. Adopting a set of Parks and Recreation 2017 Parks Development Plan and authorizing the Department of Parks. Creation to submit the plan to the Washington State Recreation and Conservation Office. The committee recommends that the resolution be adopted.'",
        "'speaker_0': 'That's been worse.'",
        "'speaker_2': 'Thank you. This is a little bit more lengthy, so I'm going to ask you to bear with me only because we had this in committee a few times. And I want to thank my my my colleagues, Councilmember Bagshaw and Councilmember Harrell, for making significant changes and having to go back to the department.'",
        "'speaker_2': 'So this resolution approves the adoption of the 2017 Parks and Open Space Plan. The department released their draft in May. They came to council briefing in June and attended two committee meetings where we discussed the plan and potential changes.'",
        "'speaker_2': 'I'll take a moment to share some significant changes. Number one, this plan has a more significant emphasis on physical accessibility of park space for residents. The plan not only takes into account the distance between the residents and their nearest park, but also takes into account physical barriers.'",
        "'speaker_2': 'Given our gap analysis, a more realistic view of how residents can access their parks. This new Gap analysis was also done through an equity lens to ensure we are prioritizing acquisition in park developments in communities most underserved by our current park system.'",
        "'speaker_2': 'The level of service commitment for the amount of park space per residents was increased from 3.3 acres per 1000 residents to eight acres per 1000 residents. This is a significant goal that commits the city to acquiring approximately 13.5 acres over the next six years to keep up with population growth and trends.'",
        "'speaker_2': 'This this plan also establishes goals for developing greenways for the first time. A Greenway strategy was not in the previous plan. Now there's a goal to enhance connections and access to parks through coordination with the Seattle Department of Transportation.'",
        "'speaker_2': 'There are many other great goals in this plan and a list of projects by priority. Priority, I'm sorry, in the appendix. We have a lot of great work to do over the next six years, and I want to thank the department for all the research, outreach and planning they have done to bring this plan to fruition.'",
        "'speaker_2': 'Once it's approved by council, it will be submitted to the state and used to help the city apply for grant funding to continue to enhance our parks and open spaces. Thank you.'",
        "'speaker_0': 'Thank you very much. Any questions or concerns? Councilmember Herbold.'",
        "'speaker_2': 'Thank you. I do have a question related to the open space plan. When if this is the same plan that you brought to briefings for council to get up to speed on it? I believe that we had a shared request that we had made to the Parks Department to do the analysis without the golf courses, and we'",
        "'speaker_2': 'never received that information. I don't know if this is maybe a different body of work and I might be confusing it. This is a different body of work. This is separate from you talk about when we do the Metropolitan Park District where we have our park hats on.'",
        "'speaker_2': 'That's what you're talking about, right? This is this is within the department. This is separate than the. Okay. I recall that we had a briefing, a monday morning briefings meeting separate from the MPD, but I might be I'll have to go back and check my notes.'",
        "'speaker_2': 'The concern was, is that in doing the open space gap analysis, there are properties that are, for the most part, they may be public in in definition, but in reality they're single use open spaces that only people who wish to golf can use.'",
        "'speaker_2': 'And so that we had looked at. I remember now I'm sorry, because we remember what you were talking about here, but what you did not want and we shouldn't count golf courses is a park in a green space.'",
        "'speaker_2': 'Right. And they were counting that. And I will get back to you on that. Thank you. But thank you.'",
        "'speaker_0': 'Very good. Any further questions or comments? If not, please, those in favor of adopting the resolution, please vote i. I. So week i. Those in favor of death. Religion. Please vote i. I. Okay. Those oppose. Vote no. The motion carries a resolution is adopted.'",
        "'speaker_0': 'And Cheryl, sign it. I got a motivator. We were going a little tired here saying, okay, please read the next agenda item.'",
        "'speaker_3': 'The report, the planning land use and Zoning Committee Agenda Item 14 Council Bill 118 985 relating to landing since only many sections 23.70 6.00, 4.0 22 and 23.80 8.0 22. A master code to provide that interpretation by the director and Seattle Department of Construction and inspections are not administrative remedies that must be exhausted prior to seeking judicial'"
    ],
    "A RESOLUTION identifying proposed Comprehensive Plan amendments to be considered for possible adoption in 2018, and requesting that the Office of Planning and Community Development and the Seattle Planning Commission review and make recommendations about the proposed amendments.": [
        "'speaker_0': 'Passenger please read agenda item number 15.'",
        "'speaker_3': 'Agenda item 15 Resolution 317 62 Identifying proposed comprehensive plan amendments to be considered for possible adoption 2018 and requesting that the Office of Planning, Community Development and the Seattle Planning Commission Review and make recommendations about the proposed Amendments Committee recommends resolution to be adopted as amended.'",
        "'speaker_0': 'Councilmember Johnson.'",
        "'speaker_5': 'Thanks. As I explained to my colleagues again this morning at a council briefing, but I'll just say again, for the benefit of members of the public, once a year, the Council adopts a resolution that identifies proposed amendments to our comprehensive plan.'",
        "'speaker_5': 'In that resolution, we ask the Planning Department to analyze particular ideas that come from members of the general public or from our Planning Commission for further study. This resolution today is that resolution. It's commonly called the darkening process.'",
        "'speaker_5': 'So we've got in front of us several ideas that have come from the commission, from members of the general public. We've got an amendment to discuss relating to items that we heard during public comment around Mawgan Junction. But before we get into that amendment, why don't I stop there and see if my colleagues have any questions about'",
        "'speaker_5': 'the darkening process?'",
        "'speaker_0': 'Any questions thus far? And I realize we have an amendment or two, so we'll hold off on that for a moment. So, Councilman Johnson, I'll follow your lead on sort of how you want to proceed with the amendments.'",
        "'speaker_5': 'As was discussed during council briefing. Council member Herbold and I were able to come to a consensus position on a proposed amendment that should be sitting at your table. And that proposed amendment effectively adds brief language that asks the executive to develop a plan for outreach to the Morgan Community Association in considering amendments to the Morgan Junction'",
        "'speaker_5': 'Neighborhood Plan. But I believe we have a late breaking amendment to that amendment from one of my colleagues.'",
        "'speaker_0': 'So because we have an amendment to the amendment, I'm going to have to suspend the rules. And so if there's no objection, Council Rule 386 relating to the presentation of full Council amendments 2 hours before the meeting, that rule will be suspended to consider Councilmember Backchannels Amendment.'",
        "'speaker_2': 'President Harrell Can we actually move the amendment that does not require the suspension of the rules first and then we can do that.'",
        "'speaker_0': 'We could do it either way. Is that your preference?'",
        "'speaker_2': 'I would like to start with the amendment that was distributed to council members in advance.'",
        "'speaker_0': 'Think you can go that way? That is very appropriate. So I can't recall. Was that formally moved yet?'",
        "'speaker_5': 'No, I think I discussed it, but I'm not sure that I can actually move forward. So I'm happy to move adoption of that proposed amendment.'",
        "'speaker_0': 'Okay. And why don't you second customer, Herbert. And then would you like to speak to it?'",
        "'speaker_2': 'Absolutely. The amendment as as drafted would clarify the Morgan Community Association's proposal to amend three three policies to the Morgan Junction Neighborhood Plan, policies to specify they should not be amended before a formal community planning process is undertaken.'",
        "'speaker_2': 'And it asks that the executive develop a plan for outreach to the Community Morgan Community Association. The original language that we had before us that that was not a part of the resolution that moved out of committee last week.'",
        "'speaker_2': 'And the language that Councilmember Johnson proposed this morning, central staff actually recommended against it because it represents sort of the current the current state of the environment as it relates to changes to these three proposals that are part of the Morgan Communities Neighborhood Plan.'",
        "'speaker_2': 'So the additive language that Councilmember Johnson and I agreed to would it would enhance the engagement. But again, voting in favor of this amendment is is not voting in favor of the comp plan amendment. It's only voting in favor of the darkening of the amendment for CDS study and analysis.'",
        "'speaker_2': 'Then to come back to us to recommend whether or not to move forward with the amendment itself.'",
        "'speaker_0': 'Very good. Any questions on that amendment? If not, it's been moved in second. Councilmember Herbert's amendment. All those in favor of that amendment. But I. I opposed the ayes have it for that particular amendment. Now, go ahead. So we're going to possibly a minute, but.'",
        "'speaker_2': 'Okay, that's that's fine. I, I think Councilmember Bagshaw shows amendment was a friendly amendment, so I thought maybe we would deal with that before voting on the amendment. But we can we can do it any way you want either.'",
        "'speaker_0': 'We have not suspended the rule, so I wanted to clean that up. Okay, now we'll suspend the rules and do it another way. So. Okay. Thank you. So having said that, if there's no objection, Council Rule 386 related to the presentation for council members 2 hours before the meeting will be suspended to consider council member back shows'",
        "'speaker_0': 'amendment saying No objection hearing no objection, the council is suspended and will now proceed with the consideration of the amendment. So can sperm back show you can speak to it.'",
        "'speaker_4': 'Thank you to my colleagues too for allowing this last minute amendment to come forward. The reason I'm bringing this forward is in response to a request from our Department of Neighborhoods, and I really respect the good work that Donna has been doing to reach out to the community in a broader way than maybe has been done in'",
        "'speaker_4': 'the past. So I support the work that Councilmember Johnson, Councilmember Herbal have done and am requesting that we add this language in that's read in front of you, and the whole paragraph would read the application to amend the policies 13, 14 and 19 to require formal community planning engagement as a prerequisite for further amendments to these policies'",
        "'speaker_4': '. The Council requested the Executive and here's my amendment in conjunction with the Department of Neighborhoods, develop a plan for outreach to the Morgan Community Association in consideration of this amendment to the Morgan Junction Neighborhood Plan. So again, the purpose of this is to support what the Department of Neighborhoods is already doing and recognize, frankly, their capacity needs'",
        "'speaker_4': '. They are working hard. I think OPD is recognized oftentimes as being the department that is helping with the policy. But Department of Neighborhoods also is the department that is doing the work on the ground, boots on the ground.'",
        "'speaker_4': 'So they were asking and I support the notion that we just acknowledge the work that the Department of Neighborhoods will be doing in this very good.'",
        "'speaker_0': 'Any further comments on that point, Councilman, here about.'",
        "'speaker_2': 'The that the friendly amendment to my amendment with a request that we not include the language or other make in as part of this. What what this amendment is about is about a planning process for amendments that are not yet known.'",
        "'speaker_2': 'They're anticipated, but not yet known. And I'm concerned that the language or other Amaechi related amendments puts bookends around these potential amendments to these three policies that may not be MSA related.'",
        "'speaker_4': 'So I believe. What are you asking that or other Amaechi related language? Stay in.'",
        "'speaker_2': 'Is it? Yes. Okay.'",
        "'speaker_4': 'Okay. Good. I will certainly recognize that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'So the only language that would be added then is in conjunction with the Department of Neighborhoods. Brendan. Okay.'",
        "'speaker_0': 'Okay. So I've just a question for the clerk. This document I have is not consistent with the motion that we are about to consider. Can I still proceed with it? Okay. So I'm going to move to amend the amendment and.'",
        "'speaker_7': 'The two hour rule.'",
        "'speaker_0': 'And the motion specifically is saying to reinsert the words or other image related to reinsert that, and which basically ignores the fact that it is read and stricken. Is there a second?'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Okay. So now Councilmember Back has proposed. Amendment reads, as I just described it, all those in favor. First of all, let me back up. Is there any further discussion about councilmember member? Let me back up again. I'm going to kind of keep back and I'm checking this right.'",
        "'speaker_0': 'We're going to first just vote on my amendment. Okay. Which is a reinserted. Any questions on my amendment? All those in favor of the amendment to reinstate that language. Please vote. I suppose the ayes have it. So now we have council member back shows, proposed amendment.'",
        "'speaker_0': 'The rules are still suspended. Is there any further discussion on that amendment, Councilmember or any other calls?'",
        "'speaker_4': 'No, but thank you.'",
        "'speaker_0': 'Councilmember Johnson.'",
        "'speaker_5': 'I'm going to read for the benefit of the members of the public the language that I believe we're about to vote on. Application to amend passes, MJ, P13, MJ P14 and MJ P19 to require formal community planning engagement as a prerequisite for further amendments to these policies.'",
        "'speaker_5': 'The Council requests that the Executive, in conjunction with the Department of Neighborhoods, parentheses d0n develop a plan for outreach to the Morgan Community Association in considering this or other MJ related amendments to the Morgan Junction Neighborhood Plan.'",
        "'speaker_0': 'Very good. Any questions or concerns? Okay. Has been moved in second accounts here, back shows proposed, minutes removed and second and all those in favor of the amendment. Please vote I. I oppose. The ayes have it. It has been amended.'",
        "'speaker_0': 'And are there any closing comments on the amended resolution before we vote on it.'",
        "'speaker_5': 'If I may.'",
        "'speaker_0': 'Please, Councilman Johnson.'",
        "'speaker_5': 'I just want to lift up. The darkening process has been especially complicated this year, and I want to say thank you to Councilmember Herbold for her engagement with me on this topic. This is not one that generally gets a whole lot of time and attention, but it has taken extra time and attention this year.'",
        "'speaker_5': 'So I want to say thank you to my colleagues for doing that. And also, this has been one that has had several members of the public show up and advocate for amendments to the comprehensive plan that will be started this year.'",
        "'speaker_5': 'That takes a lot of time and energy in itself. The darkening process is one complicated process. It requires generally some sort of consensus between three different departments the planning commission, our own council, central staff, and the Office of Planning and Community Development.'",
        "'speaker_5': 'That is a very complicated process, which is a high level way to just get through, to get the planning department to study your language. So it's it's been a good one this year. And now at this point, I guess I'm filibustering to make sure that less Whitson, who has emerged from the shadows of our council central staff'",
        "'speaker_5': ', has all the information that he needs before we actually take a final vote on this one. And it looks like he's walking away now.'",
        "'speaker_4': 'With his face.'",
        "'speaker_5': 'Smile, Amelia. Did we do? Okay, okay. We're good. All right, so with that, I conclude my remarks. Mr. President, we.'",
        "'speaker_4': 'Will filibuster.'",
        "'speaker_0': 'Johnson. Okay. Those in favor of adopting the resolution 31762 as amended. Please vote. I oppose the ayes have it. The motion carries, a resolution is adopted and the chair will sign it. Okay. Is there any further business coming for the council?'",
        "'speaker_0': 'If not everyone, have a great day and we are adjourned.'",
        "'speaker_4': 'You well done. Thank you, everybody.'"
    ]
}