{
    "AN ORDINANCE relating to affordable housing on properties owned or controlled by religious organizations; modifying affordability requirements adopted in Ordinance 126384; and amending Section 23.42.055 of the Seattle Municipal Code and Section 10 of Ordinance 126384.": [
        "'speaker_0': 'President Gonzalez. I h in favor and opposed. Thank you so much. The motion carries in the clear file has been accepted and filed with the clerk. Please read item two into the record. Agenda Item two Council 120157 relating to affordable housing on properties owned or controlled by religious organizations.'",
        "'speaker_0': 'Modifying affordability requirements adopted in ordinance 126324. And amending Section 23.40 2.005 of the Soundness four Code and Section ten of Ordinance 26 384. Thank you so much. I moved to pass Council Bill 120157. Is there a second back?'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded to pass the bill. I'm going to hand it over to Councilmember Strauss, who is the sponsor of this bill, in order to make comments on the bill.'",
        "'speaker_3': 'Thank you counts president. As this has been discussed at council briefing council but 120157 makes changes to council 2120081, which the Council passed on June 28 to increase the affordability requirements from 60% in May to 80% in my Council.'",
        "'speaker_3': 'Bill 120081 implemented a new state law that allows for larger buildings than zoning would have otherwise allowed for affordable housing developments on sites owned or controlled by religious institutions. The state law defined affordable housing as 80% in my as did the original bill Casper 120157 that was transmitted to council and voted out of the Land Use and'",
        "'speaker_3': 'Neighborhoods Committee. We did in committee considered the amendment to require 60% AMI but moved forward without that requirement before council, as we all know, ultimately passed a similar amendment lowering the affordability requirements to 80%. Am I making Seattle's law more restrictive than the state law?'",
        "'speaker_3': 'Following these votes, my office and others were contacted by churches and community organization organizations expressing deep concern with the amendment, including from the Nehemiah Initiative, which works with historically black churches in Seattle to save many black churches in the central area and to combat displacement.'",
        "'speaker_3': 'These stakeholders shared that 6% AMI requirements threatened the viability of certain affordable housing projects, meaning they would lose affordable housing units that would otherwise have been built under this ordinance. And additionally, I heard that churches had planned to use this ordinance in ways that are more broad than what the City Council discussion reflected.'",
        "'speaker_3': 'In some cases, churches may wish to build affordable housing to allow their members to return home to the communities that have already been displaced from. Some of these members may not qualify for 60% Army units, and they still have been displaced.'",
        "'speaker_3': 'I don't. Also understanding that churches can still have a range of affordability of the units. Not all units must be placed up to 80% AMI. At this point, I don't believe the city needs to micromanage how these religious organizations best serve their congregations.'",
        "'speaker_3': 'But I think I'm pretty much done. I just want to say that this legislation will amend the previous council bill to provide more flexibility to churches to serve the congregations, build the needed affordable housing, and maintain themselves financially so that they can too can continue providing services to their community.'",
        "'speaker_3': 'Thank you, Council President.'",
        "'speaker_0': 'Thank you so much, Councilmember Strauss, for giving us some initial comments on the bill as introduced as kinds of a120157. I do know that folks have comments to make about the the bill, the underlying base bill. We do have one amendment to consider.'",
        "'speaker_0': 'So as usual, we will go through the amendment, have a conversation and deliberation around the amendment. We'll take a vote on the amendment. And then once we know whether the bill is amended or not, we will open up the floor to comments on the general bill.'",
        "'speaker_0': 'So without further ado, I'm going to go ahead and hand it over to Councilmember Herbold to make her motion on Amendment One. And then I will ask if there is a second. Thank you. I commend Council Bill 12 0157 as presented on Amendment One, which was recently distributed.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'It's been moved and seconded to amend Council Bill 120157 as presented on Amendment one. I'm going to hand it back over to the council member for Bullet to walk us through. Amendment One. Thanks so much. So I appreciate the opportunity to discuss this amendment.'",
        "'speaker_0': 'This amendment would allow the higher 80% AMI rental affordability threshold in those urban centers and villages identified in the comp plan as having a high displacement risk. But should the amendment pass, it would maintain a 60% AMI rental affordability threshold in other locations throughout the city.'",
        "'speaker_0': 'Just for some context, what that all means at 60% ami a qualifying one person household would pay an affordable rent of $1,162. A qualifying four person household would pay an affordable rent at $1,726 a month for three bedroom rented units that are developed on property owned in urban areas, in villages with high displacement risk by religious institutions'",
        "'speaker_0': 'that receive this density bonus, allowing them to build in some cases, nearly twice the number of units would have a more permissive extent of AMI affordability threshold, and their units could be rented at a rate of a studio being rented at $1,545 a month and a three bedroom apartment renting at $2,295 a month.'",
        "'speaker_0': 'That's the description of of the amendment, just as you know why I why I think it's so important. I know we talked about the fact that state law permits a maximum 180% AMI affordability threshold. We discussed with the other version of the ordinance I really appreciate hearing via Councilmember Strauss's office that that's the sponsor for the legislation'",
        "'speaker_0': 'in the state legislature. Representative Whalen, who represents the 46th District of Bellevue, Redmon, Kirkland, Clyde Hill, Medina, Yarrow Point and Hunts Point, that her legislative intent was that it be at the 80% threshold. But again, we are no way prohibited from considering the needs of renters in our cities by lowering the affordability requirements, just like we do'",
        "'speaker_0': 'with other local housing programs that are authorized through the state legislature, for instance, MFT. There's a higher affordability threshold that that we could offer, but we don't. We are we reduce the affordability threshold because that's what renters in our city need.'",
        "'speaker_0': 'My knowledge, no one has demonstrated, and I know council members have asked how a 60% AMI threshold affordability requirement would thwart the goal of developing of of of incentivizing the development of affordable housing by.'",
        "'speaker_4': 'Our.'",
        "'speaker_0': 'Religious institution partners. Again, the density bonus can increase the development potential of these persons by up to double further. The development performance that we have seen when requested not seem to attack the value of land itself, which the religious institutions own.'",
        "'speaker_0': 'You don't account for the value of land that will lead to a return on investment calculation that looks like a loss. But only is whether the developers are religious institutions or private developers. We do not need to incentivize developers to build units at these rents.'",
        "'speaker_0': 'We are nearly market rate if we allow all religiously owned properties throughout the city to develop at 80%. AMI, we're actually creating a disincentive for religious institutions to partner with nonprofit developers, resulting in fewer rentals out at affordability rates.'",
        "'speaker_0': 'So now that we're reconsidering this issue, the alternate path I'm saying, maintains the 80% AMI threshold within urban centers and villages identified in the comprehensive plan as having higher displacement risk. This includes the Central District, Columbia City, Beacon Hill, Rainier Valley and other areas where historically and you'd be displaced.'",
        "'speaker_0': 'You. Okay. Colleagues, any comments or questions on that amendment? I see. Council member Strauss has his hand up, please.'",
        "'speaker_3': 'Thank you. Council President. Council member Herbal. I absolutely appreciate the spirit in which this amendment is brought in because you are correct in understanding we have to serve the poorest among us. And 80%, Amara, does not necessarily do that.'",
        "'speaker_3': 'This is there are many different avenues that we fund housing and sit in requirements for 60% AMI throughout the city. And that's but at this point, I do not believe it is appropriate to limit higher affordability levels only to some urban villages and centers.'",
        "'speaker_3': 'These are lines drawn on streets and the problems that our city faces and those are for zoning specifically. So I have heard of projects in other districts that would be prevented from using this flexibility and the flexibility that they were expecting because they are not located in urban villages or centers.'",
        "'speaker_3': 'I have also similarly not heard any external stakeholders advocate for this amendment. I have when I've reached out to my stakeholders and only heard of opposition. So nothing personal here. I absolutely appreciate the spirit in which you're bringing this.'",
        "'speaker_3': 'I unfortunately will oppose this amendment today. Thank you, Councilmember Girl.'",
        "'speaker_0': 'Councilmember Strauss Any additional comments on proposed Amendment one? Council Member Paterson, please.'",
        "'speaker_3': 'Thank you, Council President. And just for the viewing public, who might not be as familiar with this legislation. This is we had adopted the council adopted legislation and then some groups approached the mayor's office and wanted to see the legislation changed.'",
        "'speaker_3': 'And so the mayor submitted it to us. And because we're going in budget season, it's coming straight to the full council for discussion today. And I think there were some you know, I appreciate the points made by both council members who spoke, and it was a close vote to begin with on the original legislation.'",
        "'speaker_3': 'So it sort of makes sense that there would be these good ideas floated from the various council members. And I really think that council, our Herbold amendment is a compromise. It is it's it's it's basically saying that, okay, even though the original legislation allowed additional time under the higher income 80%.'",
        "'speaker_3': 'Am I that perhaps that wasn't enough time for for some churches. So what this amendment is doing is geographically it's saying those those churches that did approach the mayor's office and had were very vocal about it. They would be able to stay at 80% AMI And so I think that this compromise that, you know, we don't want'",
        "'speaker_3': 'to make a citywide policy when we don't necessarily we don't need to apply it citywide. It makes sense to apply it geographically as Councilmember Herb what it's done in the high displacement area. So I will be supporting this amendment.'",
        "'speaker_3': 'I do see it as a compromise from the original bill. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Peterson. I see that councilmember mosquitoes and hand is up. Please go ahead. Thank you very much. PRESIDENT Thank you, colleagues, for the opportunity to chime in on my my support for the underlying bill. I will be voting no on this amendment.'",
        "'speaker_0': 'I do appreciate that. We do have a chance to talk about this again. If you'll recall, the last time we talked about it, it was one of the hottest days in record for Seattle. And many of us were huddled near fans in the dark trying to stay cool on a very hot afternoon.'",
        "'speaker_0': 'So having the chance to now have a chance to look at the legislation that was passed with the amendment last time. I was a no on the amendment the first time around, but having the chance to really read through the amendment this time around and recognizing that it's slightly different, appreciate the nuance that was trying to be'",
        "'speaker_0': 'woven here. I do want to underscore why I am voting no on this. Even though it is a tweaked amendment up from the original, I think the bill as transmitted contained several large public benefits by maintaining the continuity of EMI levels across across the city.'",
        "'speaker_0': 'But I'm just going to focus on two very briefly. The first is that maintaining the Army threshold of 80% means that organizations will have the ability to create affordable housing without seeking as much public subsidy. And that is a huge public benefit.'",
        "'speaker_0': 'That means our public, affordable housing dollars can be stretched to go further to create more deeply affordable housing throughout the city. And I do think that it towards the goal of creating more affordable housing if religious institutions have to compete for public subsidies.'",
        "'speaker_0': 'If the threshold were to be lowered to 60%, that means there's fewer funding sources that could be rated together to create that affordable housing, which is the goal of this legislation both in the city. I know it's our goal as well as the state legislature, by keeping the 80% AMI threshold that the current level of where it's'",
        "'speaker_0': 'at. We are opening up the ability for more of these religious organizations to be able to access complementary funding sources that are not public subsidy only. And that way we can help these organizations build the housing. That is our overall goal.'",
        "'speaker_0': 'The Knight Nehemiah Initiative also emailed us earlier today, I believe, showing how if the threshold was lowered to 60% EMI, that it would actually support their existing projects. We don't want to be in a position where we are in any way, even unintentionally reducing the ability for us to build more affordable housing units across our city.'",
        "'speaker_0': 'And in the document that they sent us, they showed how their numbers don't pencil out under 60%. And I believe these religious organizations are potentially in the red, whereas 80% AMI would provide small income stream to make these projects more viable.'",
        "'speaker_0': 'Number two, the ability to build AMI to build that 80% and mine units will function as an anti displacement policy. This bolsters religious institutions ability to not only provide housing for communities that have been largely displaced, but largely affected by gentrification and displacement.'",
        "'speaker_0': 'But this also helps us prevent future displacement in our communities, where these religious institutions have experience with working with communities, especially our elders and our communities of color, who are experiencing higher rates of displacement. So working with them, allowing them to bring funding, keeping it in a percent, I believe is a win win.'",
        "'speaker_0': 'So I'll be voting no on this amendment and yes on the other line Bill. Thank you, Councilmember Moschino, for those comments. I see that Councilman Morales has her hand raising her hand overturned.'",
        "'speaker_4': 'Thank you. I, too, appreciate the the you know, what you're trying to accomplish. Councilmember Herbold, this isn't something that I will be able to support the amendment. That is mostly because we have heard from a lot of folks in our community who aren't supportive of this amendment and who specifically requested, as we were, the underlying legislation was'",
        "'speaker_4': 'being considered, who are waiting religious institutions here, who are waiting for this bill because they do have a project that they're waiting to proceed with and want to be able to provide housing for their young families. You know, the the amendment, as I understand it, would really limit, you know, limiting to urban villages doesn't provide flexibility to'",
        "'speaker_4': 'these institutions that are outside of those areas like the institution that I'm talking about, who contacted our office. So I think it's important that we proceed with the underlying legislation and and with the frankly, with the original intent of the state sponsor who had passed the 80%, Amy, which is what advocates had been pushing for at that'",
        "'speaker_4': 'level. So I worry about the underlying bill, but will not be supporting the amendment itself.'",
        "'speaker_0': 'Any additional comments for Councilmember? Councilmember bill, you'll have the last word. I'm just looking for any other hands raised on Amendment One. I'm not seeing any other hands raised. I did want to make some comments on Amendment One as well before we hand it over to Councilmember Herbold and have her close that debate.'",
        "'speaker_0': 'So, colleagues, the bill before us today does include reporting requirements that will help us better understand this policy tool and how we can support more community led affordable housing projects that is in the base bill without the amendment.'",
        "'speaker_0': 'Since this issue last came before the Council, I have had the opportunity to personally meet and hear from several impacted stakeholders, specifically from stakeholders representing the interests of black churches in Seattle, about the need for flexibility without losing sight of our goals around affordable housing across the city of Seattle, my staff have worked through some of the'",
        "'speaker_0': 'scenarios with the Office of Housing and Mural Staff on this particular issue, and I do believe that the bill before us without amendment will allow for a future decision on affordability thresholds to be informed by data collection. Therefore, today I'm going to vote yes on the underlying bill, but unfortunately cannot support the proposed amendment in doing so'",
        "'speaker_0': '. This does not deny the need for ongoing need for deeply affordable housing throughout our city and in every single neighborhood, including those that are at greatest risk of gentrification and displacement. Indeed, we know that the greatest housing needs are faced by those in the 0 to 30% area median income.'",
        "'speaker_0': 'The recent McKinsey report estimated housing costs in the Seattle King County region would be about $1 billion, and it pencils out to be about needing an additional 37,000 units of affordable housing to address the needs of those on the extremely low income spectrum.'",
        "'speaker_0': 'So I want to acknowledge that that I just, like many of my colleagues and so many in our region, share a really deep commitment to addressing these housing needs. But I have also heard loudly and clearly in the weeks after our initial vote on this Council bill, that the City Council should forego the temptation to place the'",
        "'speaker_0': 'burden of meeting this deep need on the few religious institutions who are in a position to realize affordable housing communities in our city. So, so, so in the letter, for example, that we received today from Michael Ramos of the church council, Greater Seattle, he writes, quote, Generations have lost wealth and assets to redlining and other systemic colonial'",
        "'speaker_0': 'violence, even as rents and property taxes rise to unaffordable levels. The majority of black land based assets in Seattle are owned by Seattle's historic black churches. It is essential that we recognize black churches as an essential asset, cultural hub and service provider for black Seattle residents, and consider the ways we may support them to leverage their assets'",
        "'speaker_0': 'towards community development in the face of ongoing white supremacist violence. We must also be mindful of the long term impact of our development decisions providing space for the return of displaced black renters in a sustainable way that does not contribute to further racial and economic segregation closely.'",
        "'speaker_0': 'I think it is important that we not substitute our judgment for the judgment of black churches who advocated for the new state law. The reality is that for their statewide advocacy, we wouldn't be in a position to be considering this affordable housing bill at all.'",
        "'speaker_0': 'So black church leaders have unequivocally also told us since the passage of a similar amendment, that this amendment before us now will similarly tie their hands. In this instance, the proposed amendment has the effect of reducing the income threshold from 80% to 60%, but now has a layer of geographic restrictions that could potentially further exacerbate the racial'",
        "'speaker_0': 'disparities associated with concentrating growth in our urban villages and urban centers. Or, in the words of Donald King from the Nehemiah Initiative, which was recently shared with me, he wrote, quote, I agree that the limit of 60% may be more aligned with most black households, but I still believe that 80%, Amy, provides for more choice and acknowledgment'",
        "'speaker_0': 'of the reality and aspiration of black renters to be considered more prosperous. The 60%, Amy, will negatively impact the land value of the property that our black churches seek to leverage for a more independent and less subsidized housing production.'",
        "'speaker_0': 'So I want to thank Donald King, the Housing Development Consortium, Community Enterprise, the Church Council of Greater Seattle, and all the other stakeholders who have reached out to share details of why this bill is needed without proposed Amendment One.'",
        "'speaker_0': 'And I encourage my colleagues to also vote no on this proposed amendment. Again, since my initial vote, I have had deeper conversations about the operational impacts of adjusting the income threshold. And while I am deeply committed to more deeply affordable housing, I think this bill is simply the wrong vehicle by which to effectuate that desired outcome at'",
        "'speaker_0': 'the level we truly need across the city of Seattle. So as a result, I'm convinced that voting for the Council bill. All that is before us without the proposed amendment will help black churches in our city combat anti displacement, and it will do so in a manner that respects their self-determination, while leaving the door open to address'",
        "'speaker_0': 'our shared desire to incentivize and or require other developers to incorporate a lower income threshold into the projects. So with that being said, I'm going to hand it over to Councilmember Herbold for purposes of closing out debate. I will keep it very short.'",
        "'speaker_0': 'As I've said, I believe that having the threshold at 80%, we are actually creating a disincentive for religious institutions citywide to partner with nonprofit developers. Something that feels really lost in this conversation is that this legislation affects religious institutions all across the city.'",
        "'speaker_0': 'According to the Stsci Directors report, there are six 692 parcels throughout the city owned by religious institutions. Of course, not all of them are large enough or have enough space to take advantage of this added density. But nevertheless, they are all over the city.'",
        "'speaker_0': 'They are not only in locations where black churches are facing displacement. The Housing Development Consortium wrote today to say that the 60% AMI will negatively impact the net operating income of the projects that the black church seek to leverage for more independent and less subsidized housing production.'",
        "'speaker_0': 'My amendment was intended to address this directly by allowing more expensive rental housing to be built in those areas where black churches are faced with displacement. Councilmember ROSQUETA, you referenced being able to review the the assumptions underlying the the conclusion and the analysis that 6% AMI housing would not pencil out.'",
        "'speaker_0': 'I would greatly appreciate the offer opportunity to review those assumptions when I have done so. As I mentioned earlier, I saw that the value of the land was not included in the assumptions, making it look as if there was a rate of return or return on investment.'",
        "'speaker_0': 'Sorry, that would would support the the the argument that they're not penciling out. But once you include the value of the land, that these density bonuses in many cases would double. That is not the case. I just want to also again underscore the point that I made this morning, that if you look at the data from the'",
        "'speaker_0': '2017 American Community Survey, 80%, sorry, 80% AMI housing. So housing that is developed at the 80% AMI threshold of affordability will be out of reach for 69% of black renter households that we have 14,320 black renter households in the city.'",
        "'speaker_0': 'And housing at these rates will be unaffordable, out of reach for 69% of them. I believe that when we're looking at a public benefit, we we should be looking at creating something that is not market rate housing. And 80% AMI housing is essentially market rate housing.'",
        "'speaker_0': 'Thank you. Thank you so much. Councilmember Herbold. Okay. That does conclude debate on Amendment one. So I'm going to ask the clerk, please call the adoption of Amendment one. Strauss No. Herbold. Purple X. Lewis now. MORALES No. Let's get a.'",
        "'speaker_0': 'No. Pietersen?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'So on.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'President Gonzalez now three in favor, five opposed. Thanks so much. The motion fails and the amendment is not adopted. Now we are going to open it up for general comment on the underlying bill. Are there any additional comments on the bill?'",
        "'speaker_0': 'Hearing none. Will the court please call the court? Never mind that we're silent. Go ahead.'",
        "'speaker_1': 'So I think you. So I think that in considering this legislation, we need to be concrete about what it actually accomplishes and what the cost is. You know, on the one hand, this program is based on increasing the height limits or density allowed on church land for affordable housing.'",
        "'speaker_1': 'And I certainly support increasing density. And so, in my view, the program as a whole does not sacrifice anything. On the other hand, this policy has been described as creating affordable housing to stop gentrification and reverse displacement. And I am very concerned that it will not accomplish that because of today's both policies.'",
        "'speaker_1': 'And the affordable housing limits are increased to 80% of area median income. It becomes shockingly expensive and a more horrible that actually has gone over the data quite comprehensively. But just to reiterate some of those points and also to add some other statistics, I mean, unbearable just now, as you were quoting, talked about how if you bring'",
        "'speaker_1': 'it up to 80%, it essentially becomes like market rate housing. Well, according to the Office of Housing, rent for a one bedroom apartment pegged to 80% of area median income is a is $851 per month, which is $550 a month, more than if it were pegged to 60% of am-I.'",
        "'speaker_1': 'And in fact, it's actually more expensive than the average mortgage rate rent for a one bedroom in Seattle. So we're not talking about, you know, minuscule differences. We're talking about a big difference and I believe comparable just referenced some of the conclusions that can be reached from State of Community American Community Survey, really, which is basically the'",
        "'speaker_1': 'census data which which will guide me if I'm wrong. But I think you said that 80% and my benchmark essentially would mean that 69% of black households will not be able to afford it. Actually, before I go on, would you just confirm that, please?'",
        "'speaker_0': 'Yes, 80%. And my housing is out of reach for 69% of black renter households in Seattle.'",
        "'speaker_1': 'Okay. Thank you. And so it's just it's just too expensive to actually have an impact on displacement and gentrification, which is the goal of this. It is the stated goal of this whole effort. And that's because the whole premise is to be dependent on for profit housing, on the for profit housing market, to make housing affordable.'",
        "'speaker_1': 'Which the for profit market has resoundingly failed to do for decades. In fact, affordability problems are dramatically worse now than a decade ago. The argument for increasing the rent limit by $550 a month, which is just whopping. I mean, what we just heard from renters who are just having an absolutely hard time and that problem is disproportionate'",
        "'speaker_1': 'and compounded for black households, as we know. So the argument for raising the rent limit that we have heard is essentially that developers and property owners, which are churches in this case, will not be able to afford to build the housing if it is less expensive without without public subsidy.'",
        "'speaker_1': 'But that is exactly where I mean, that's where the the problem lies. I mean, that is exactly why so many activists, including Black Lives Matter activists, helped to build the tax on movement when the Amazon home tax a tax on big businesses to fund affordable housing.'",
        "'speaker_1': 'I mean, that cannot be the last word. That's not enough. And in fact, we will need a massive fight using the people's budget movement this year to make to make sure that the actual funds are allocated to affordable housing in the way that it was intended when the council voted on it.'",
        "'speaker_1': 'I don't know what Mayor Durkan has planned to do, but, you know, we'll see when we look at the draft budget from Mayor's office and it and even even last year actually funds were from the Amazon tax were used to backfill the budget shortfall.'",
        "'speaker_1': 'I think we have to that's big business is more I mean they are making money hand over fist and we should make sure that all the money that was intended already to build affordable housing should be used and additional revenues should be raised progressively to make sure that there are no budget cuts either is not one against'",
        "'speaker_1': 'the other. And I mean, and it just it just foolhardy to depend on the for profit real estate market. And I just don't see how this is viable. I mean, I would be open to, you know, to supporting this.'",
        "'speaker_1': 'I mean, and to be very honest, I mean, I, I really acknowledge the good intentions of the Church Council of Greater Seattle. So many of the faith community leaders who I believe genuinely want to build affordable housing and my staff and I, again, very honestly, spent a lot of time looking into the numbers to see if this'",
        "'speaker_1': 'was going to be something justifiable. But it just again, if we want to be data driven, then I just don't know how this this is this is going to be viable. I understand that the faith leaders want to try this legislation to build affordable housing.'",
        "'speaker_1': 'And I also understand that many of them also support the Amazon movement. And so I would really urge them to understand that we cannot ask working class renters, much less the black community, working class renters, to pay on unmanageable rents and then call it affordable housing.'",
        "'speaker_1': 'That just cannot happen. We actually need to need the expansion of taxes and citywide citywide taxes on big business. And also, we need to bring enough pressure to bear to force the state legislature to tax the rich statewide to greatly increase funds for affordable housing.'",
        "'speaker_1': 'We also need to rent without corporate loopholes, not just in Seattle, but also statewide, so that we can make the market rate housing also affordable. So I think given all these gains, it's really difficult. And I would also note that as far as I know and my staff know, that we have made sure to ask a lot'",
        "'speaker_1': '. We have not heard from any renter or a black renter, much less advocating for this change. Thank you.'",
        "'speaker_0': 'Any other comments on the bill? Councilmember Mosquito. Thank you very much. I first want to thank the Nehemiah Initiative for their work and advocacy and deep education that they did on this legislation in the last few months and earlier this year.'",
        "'speaker_0': 'I am happy to see this legislation back before Council where we've all had a chance to sit with it and not 100 degree rules and trying to make some decisions in the moment. I feel like this has been an opportunity for us to really have engagement both with community and among council and restore here today a key'",
        "'speaker_0': 'facet of the legislation to ensure that this is workable, workable for religious organizations in our communities to actually build affordable housing that is needed. I also want to be really clear about something. No one is saying that this legislation alone is going to build the affordable housing that we know we all need across the city.'",
        "'speaker_0': 'We are all committed to building that affordable housing, and that is why the majority of council both sponsored and passed jump start progressive revenue for the payroll tax in Seattle. And that's why we had a unanimous council vote for the spend plan, which puts two thirds of that funding into building affordable housing.'",
        "'speaker_0': 'We all know that we need this, and I think by passing this legislation today, we should continue to underscore that building affordable housing is not on the backs of our community, church organizations or religious institutions, nor can it all be done on religious properties.'",
        "'speaker_0': 'So this is one small but important component to our overall goal to build affordable housing. I also want to say I am appreciative of the conversation that we've had around the Am I levels. Again, I think that restoring the and my levels to 80% am-I is going to be a win win in both achieving affordable housing and'",
        "'speaker_0': 'working towards our shared goal on this Council of advancing anti displacement strategies. Religious organizations as well do not have to build up to the 80% and my threshold. They can choose a different level of am-I affordable it if they want to, but by not requiring them to have a lower amount, they will be able to potentially partner'",
        "'speaker_0': 'with additional affordable housing developers, which we've heard time and time again. Many organizations don't want to be held to a paternalistic standard, and that's not language coming directly from them in our conversation. So I appreciate that we are taking an important step today and that we also, at the same time, in the same breath, are recognizing that'",
        "'speaker_0': 'this is not going to solve our affordable housing needs and that we're going to continue to work on building more deeply affordable housing, creating the funding sources to do so. And like we did last year through Jumpstart Progressive Revenue in Seattle, which focused on 60%, actually 30%.'",
        "'speaker_0': 'And below that, we will continue to focus on more affordable housing and workforce housing across the city, with more progressive revenue sources at our fingertips soon, which again as a stand alone, are not enough to solve our deep housing affordability crisis across this region.'",
        "'speaker_0': 'So much more work to do. But excited about this legislation today. Thank you so much. Are there any other additional comments before we hand it over to Counselor Strauss to close it out? I'm not seeing any of their hands raised.'",
        "'speaker_0': 'So, Councilmember Strauss, why don't you close us out?'",
        "'speaker_3': 'Thank you, council president and thank you, colleagues. Echoing Councilmember Skater's comments about the Jumpstart ordinance that is going to be funding so much of our housing needs. Councilmember Herbold, Council President Councilmember stated the four of us were the original four co-sponsors.'",
        "'speaker_3': 'So I absolutely see each of your dedication to this. I'll just briefly state that this is this bill does not require religious institutions to put the housing at 80% AMI. It allows them to go up to 80% AMI.'",
        "'speaker_3': 'It's my understanding that that there will be a mix of those housing units and the religious institutions are different than other institutions where that those dollars will be funneled back into their organizations to support their congregations that are providing services to their communities.'",
        "'speaker_3': 'I'm not here to micromanage them. I appreciate everyone's intent on this bill and where everyone's coming from. Thank you, Councilmember. Her book for your understanding of my position today. Thank you, Councilperson.'",
        "'speaker_0': 'It becomes more stress. Okay. That does close out debate on this council Bill. So I'm going to ask that the clerk please call the vote on the passage of the Bill Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'HERBOLD No. Lewis.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Morales a. Must get to. All right?'",
        "'speaker_5': 'PETERSON No.'",
        "'speaker_0': 'So what? No. President Gonzalez, I. Three. Yes. Five in favor. Excuse me. Six in favor. 3a5 in favor. Three opposed. There you go. Thank you. That's all right. I was keeping tally, too. Okay, so the bill passes and the chair will sign it.'"
    ],
    "AN ORDINANCE relating to land use and zoning; adding a new Section 23.49.167 to the Seattle Municipal Code to provide alternative development standards for small lots located in Downtown Mixed Residential zones.": [
        "'speaker_0': 'President Gonzalez? Yes. Eight in favor. Nine opposed. The motion carries in. The appointments are confirmed. Will the clerk please read item 19 into the record of Report of the Land Use and Neighborhoods Committee Agenda Item 19 Council Bill 120 153 Relating to land use and zoning at a new section 22.40 9.1 67.'",
        "'speaker_0': 'To challenge the code to provide alternative development standards for small lots located in downtown mixed residential zones, the committee recommends the bill pass. Thank you so much because member Strauss, you are the chair of the committee and I'm going to hand it over to you to provide the committee report once again.'",
        "'speaker_0': 'There is one known amendment to this underlying council bill that will address the Bass bill first and then move to the amendment.'",
        "'speaker_3': 'I think you council president. This legislation modifies development standards for small lots and build time to encourage development and to allow for the use of innovative construction methods like modular and penalize construction. For years, small one and two parcel lots and Belltown have been identified as being infeasible to develop due to the size constraints of these sites'",
        "'speaker_3': 'and the development standards for the neighborhood. This legislation does not increase the development capacity of the sites, but shifts setbacks and massing requirements to allow building shapes that enable modular construction where units essentially must be stacked from above after being built offsite.'",
        "'speaker_3': 'Modular construction is more sustainable and costs less to build owning to the offsite fabrication of these unit units. I support Councilmember Lewis's amendment and I urge colleagues for a yes vote. Thank you, council president as a community report.'",
        "'speaker_0': 'Thank you so much. Okay. I'm going to hand it I'm going to hand it over to Councilmember Lewis to make his motion to put Amendment One before us. And then after he makes his motion, I will ask for a second.'",
        "'speaker_0': 'Councilman Lewis.'",
        "'speaker_3': 'Thank you, Madam President. I move Amendment one to Council Bill 12015 3 seconds.'",
        "'speaker_0': 'Okay. It's been seconded. This much has been moved and seconded to amend Council Bill 120153 is presented on Amendment one. Because, Mr. Lewis, I know you already spoke to this during council briefing, but why don't you go ahead and walk us through Amendment One again.'",
        "'speaker_3': 'Thank you, Madam President. No need to go too deeply into this. Given my comments this morning, though, I will just think again, the community members who brought this amendment forward and had it further refined by our partners over at the Department of Planning, as well as the Seattle Department of Construction Inspections and Noah on in the Strauss'",
        "'speaker_3': 'office, who was helpful in assisting Parker Dawson in my office in cobbling this amendment together over the course of the last few days. The amendment, as I mentioned earlier, is designed to put in some accommodation and recognition of some of the existing development and setback standards in the Belltown neighborhood.'",
        "'speaker_3': 'It would revise the current bill to limit building width to 95 feet rather than 100 feet. It would also require setbacks to make sure that there's suitable space for light and pedestrian traffic in between some of the structures that would be built under this incentive legislation.'",
        "'speaker_3': 'As I mentioned this morning, it does have the support of the departments as well as Councilmember Strauss, as he just indicated. So I appreciate this as a as a testament to the value of people calling in for public comment and sending us emails, it does lead to material differences in legislation at times.'",
        "'speaker_3': 'So thank you so much and looking forward to just move on this amendment and proceed to the underlying bill so much.'",
        "'speaker_0': 'Casimir Lois, are there any additional comments on Amendment One? Hearing? None. Will the clerk please call the role on the adoption of Amendment One? Strauss.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Herbold as. Lewis.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Macheda I. Peterson.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'So what?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'President Gonzalez. Yes. Eight in favor. None. Oppose. The motion carries. Any amendment is adopted. Are there any further comments on the bill as amended? Because my address is already letting me know that he does not have any closing remarks.'",
        "'speaker_0': 'So with that being said, debate is now closed on the bill as amended. Will the clerk please call the roll on the passage of the amended Bill Strauss?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Purple. Yes. Lewis.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Morales. That's Macheda. Hi, Petersen.'",
        "'speaker_3': 'Hi.'"
    ],
    "AN ORDINANCE relating to residential rental properties; requiring a minimum of 180 days' prior written notice to tenants whenever the housing costs to be charged a tenant are to increase; and amending Sections 7.24.030, 22.202.080, and 22.206.180 of the Seattle Municipal Code.": [
        "'speaker_0': 'So one. Yes. President Gonzalez? Yes. Eight is in favor and unopposed. The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Well, please read item 11 into the record.'",
        "'speaker_0': 'The report is suspended. The bill excuse me. And Reference Rights Committee Agenda Item 11 counts 4119585 residential rental properties for clients, a minimum of 180 days prior eviction notice to tenants. Whenever the housing costs to be charge, a tenant are to increase and amending sections 7.20 4.0 or 3020 2.202.0 80 and 22.20 6.1 80.'",
        "'speaker_0': 'Of this code. The Committee recommends that will pass amended with councilmembers who want one Alice Suarez and Lewis in favor and council with an abstention from Councilmember Peterson. Thank you so much, Councilperson. Before we go through the steps of discussing the bill, would you also like to have Agenda Item 12 read into the record for purposes of'",
        "'speaker_0': 'discussion? Or are you fine handling each bill separately? I'm fine. We'll take it. We'll take a vote separately on both of them. But I just just for purposes of the conversation.'",
        "'speaker_1': 'Either way is fine with me if I think separately will also work.'",
        "'speaker_0': 'Okay. Well, we'll go ahead and do it separately. And if if it starts looking like people want to comment on item 12 as well, then we'll go ahead and take a pause and have that read into the record at that time.'",
        "'speaker_0': 'So. Okay. I'm going to hand it over to Councilmember Samant, who is the chair of the committee in order to provide the committee's report.'",
        "'speaker_1': 'Thank you. And I would like to make a few comments before moving the amendments, if that's okay. The this legislation. So I'm sorry, I'm speaking about item number drop.'",
        "'speaker_0': 'See what I mean? We're no.'",
        "'speaker_1': 'No, no. Go ahead. I know this legislation is the first of two bills from my office addressing the crisis renters face from rising rents as reported in the Sustainability and Rent Committee and and also in successive Monday morning briefings of the City Council.'",
        "'speaker_1': 'The data from apartment list dot com. A landlord website shows that rents in Seattle have increased over 25% in 2021 alone. I mean, this is just a staggering rate of increase. If this trend were to continue, rents will have increased by 40% by the end of this year.'",
        "'speaker_1': 'Imagine getting a 40% increase in your wages. I mean, that's just unheard of. So undoubtedly, this is an unmanageable situation for renters and also is a clear explanation of why we need rent control. And as members of the public and the members know, my office has drafted rent control legislation which we hope to bring to a vote'",
        "'speaker_1': 'in December. But in the meantime, we do need legislation to mitigate the harm that is going to be experienced by recent years because of the skyrocketing rents. And that's what today's vote for the bills today are intended to do.'",
        "'speaker_1': 'This bill in front of us right now requires landlords to provide six months notice for rent increases. Currently in Seattle, only two months notice is required, which is not nearly enough notice for renters to rearrange their lives when they are displaced by a rent increase, particularly given how difficult it's going to be for them to find another'",
        "'speaker_1': 'rental home, just given how unaffordable most housing has become across the city. And this is also a national phenomenon. And also, as I've mentioned before, this bill was originally requested by the City of Seattle Renters Commission.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Increasing the notice landlords are required to give renters already. Freezes cannot stop the rent increase, but it does give renters the time they will need to find new housing and rearrange their lives when the rent, if and when a rent and these forces them to move.'",
        "'speaker_1': 'The Sustainability and Renters Rights Committee recommends the city council pass this bill, as Amelia mentioned, with all votes in favor and unopposed and one abstention. I just wanted to read an extract from a letter that was sent to the city council by a social worker, Heather Steiner, who also spoke in public comment a little while ago, who'",
        "'speaker_1': 'works in the Washington State Department of Social and Health Services, who says, quote, I've had to move, slash, relocate eight times in ten years because my landlord kept raising my rent every year by 5 to 10%. I work in social services for the with disabled people, and I do not get income raises anywhere near this level.'",
        "'speaker_1': 'I cannot absorb thousands of dollars in increases every year. So I keep being forced to move every 12 months. And it is getting so hard on me, my pets and my work patients who operate out of my home office.'",
        "'speaker_1': 'These people are very disabled and any change in their schedule and structure is very hard on them. And I am drowning here. My work is very important to me. But if I cannot find a way to keep my head above water financially, I will be forced to abandon all my disabled patients and find a higher paying job'",
        "'speaker_1': '. So I really urge the City Council to vote yes in favor of this bill because it's clear that it will make a real, tangible difference in the lives of renters. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember San Juan. Are there any other comments on the bill? Elsewhere, Peterson pleads.'",
        "'speaker_3': 'To Council President colleagues on this bill. During the committee meeting, I proposed an amendment to exempt small landlords defined as owning four or fewer units in Seattle. And the amendment failed by a narrow vote. And so I abstained at committee to give myself more time to to think about what to do today.'",
        "'speaker_3': 'I do appreciate the intent of this bill and support helping struggling renters. A theme of our response to the COVID pandemic has been to boost rental assistance for those in need. We've also adopted several renters rights bills during the past two years, including the winter ban on evictions.'",
        "'speaker_3': 'I've heard from many small landlords, though, that the influx of multiple changes to the landlord rental regulations has created confusion and discourages them from continuing to provide rental housing in Seattle. Currently, we provide 60 days notice and so this bill would triple that time period.'",
        "'speaker_3': 'One approach would have been to perhaps double that to 220 days and then see how well that worked. These are tripling it. Regardless, I support expanding the notice period for larger corporate landlords, but my amendment again would have exempted small landlords owning four or fewer units.'",
        "'speaker_3': 'And since that committee meeting, nothing substantive has changed in the bill. In fact, I've heard from multiple mom and pop landlords concerned. So I will be voting no on this bill, mainly because it does not exempt small landlords.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. Next up is Councilmember Morales.'",
        "'speaker_4': 'Thank you. Council President. I am supporting this bill as I did in committee. In my opinion, this bill merely asks the landlord to give a few more months notice for rent increases. It does not because because state law currently bans rent stabilization.'",
        "'speaker_4': 'This bill does not prevent a landlord from increasing the rent, nor does it restrict the amount of an increase. And while this does mean that landlords have to wait a short amount of time before before implementing an increase, the more important piece of this bill for me is that it means tenants have adequate time to find a'",
        "'speaker_4': 'new job, to find new housing, to deal with childcare issues that may present as a result of this change, or to make any other number of adjustments that may be necessary so that they can pay for a rent increase or make the plans to move out and find something that's more affordable.'",
        "'speaker_4': 'So I think this is a relatively small ask from the landlords, but could have a really acute impact, a meaningful impact for for tenants. So I will be supporting the legislation.'",
        "'speaker_0': 'In due course their morals. Are there any other comments on the bill? I'm not seeing any hands raised. Customers want anything you'd like to see in closing.'",
        "'speaker_1': 'Just that. Of course, there are advocates that I would like to publicly thank, but I'll save them for the second bill because both the bills were advocated together, advocated for together, and only to add the small landlords are not the ones increasing rents by high rates which which is where it makes a difference how much notice you'",
        "'speaker_1': 'have. So as far as what the bills today that they're considering are concerned, they simply don't affect the small landlords who are not actually looking to gouge their tenants.'",
        "'speaker_0': 'Thank you so much, Councilmember. One paper does conclude debate on this bill. So will the clerk please call the roll on the passage of the bill?'",
        "'speaker_3': 'Strauss Yes.'",
        "'speaker_0': 'Herbold Yes.'",
        "'speaker_3': 'Lewis Yes.'",
        "'speaker_0': 'Morales That's. Must get a high.'",
        "'speaker_3': 'PETERSON No.'",
        "'speaker_0': 'So what?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'President Gonzalez I seven in favor one opposed. Thank you so much. The bill passes and the chair will sign it. Will a quick please affix my signature to the legislation on my behalf? Will the clerk please read the short title of item 12 into the record?'"
    ],
    "AN ORDINANCE establishing a new 15th Avenue East Business Improvement Area (BIA); levying special assessments upon owners of commercial property, multi-family residential property, and mixed-use property within the area; providing for the deposit of revenues in a special account and expenditures therefrom; providing for collection of and penalties for delinquencies; providing for the establishment of a BIA Advisory Board; providing for an implementation agreement with a Program Manager; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'President Gonzalez, high eight in favor. None opposed. The bill passes and the chair will sign it. Will the QUIRK Visa fix my signature to the legislation on my behalf? Congratulations, everyone who's been working really hard on this issue.'",
        "'speaker_0': 'Okay. Well, the clerk please read the short title of item 13 into the record and report that the Community Economic Development Committee Agenda Item 13 Council Bill 120 162 establishing a new 15th Avenue East Business Improvement Area. The committee recommends that all passes amended and.'",
        "'speaker_0': 'So much. Okay. I'm going to hand this over to Councilmember Morales, who is the chair of the committee to provide the report.'",
        "'speaker_4': 'Thank you. Council president colleagues, this is the bill to create the fifth avenue via. We discussed this in the Community Economic Development Committee on September eight. We heard from proponents of the idea and also held a public hearing on it.'",
        "'speaker_4': 'So as you know, the way this works, local businesses vote to assess themselves, to provide cleanup services, graffiti removal, to be able to host neighborhood events and marketing, provide marketing services to the local businesses. I will say we did have some concern.'",
        "'speaker_4': 'We heard from some commercial tenants about their concern. As you know, it is the property owners who get to vote on whether or not to assess themselves. The small businesses who may rent from these owners don't get to participate in that vote.'",
        "'speaker_4': 'So we hear from some of them that they were concerned about the impact on them, assuming that this may pass down in the form of higher rents. So I did amend the legislation in committee to ensure that at least two commercial tenants are on the board and that we include the option of using some of the assessment'",
        "'speaker_4': 'revenue to pay for small business assistance or other programs that can help keep small businesses from getting displaced. I do want to thank Councilmember Peterson and his staff who had proposed similar legislation when you district the air was passed several months ago.'",
        "'speaker_4': 'So thanks for working with us to do something similar here. And as Amelia said, we did pass this unanimously out of committee on September 21st. So I am encouraging my colleagues to support the bill.'",
        "'speaker_0': 'Thank you so much. Are there any additional comments on the bill? I don't see any hands raised so well. The police call the role on the adoption of the bill. Strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'Herbert. Yes. Lewis.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'Morales.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Mesquita, I. Petersen. I so want.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'President Gonzales. I A-10 favorite. Nunn opposed. The bill passes and the chair will sign it. Will the girl please affect my signature to the legislation on my behalf? Will the clerk please read items 15 through 18 into the record?'"
    ],
    "AN ORDINANCE relating to relocation assistance for economically displaced tenants; requiring the payment of economic displacement relocation assistance to households that are vacating a housing unit after receiving notice of a rent increase of ten percent or more or of less than ten percent where the cumulative effect for the households tenancy is ten percent or more; and adding a new Chapter 22.212 to the Seattle Municipal Code.": [
        "'speaker_0': 'President Gonzalez. Yes. Eight in favor and unopposed. The motion carries and the appointments are confirmed. Will it work? Please read item 20 into the record report of the Finance and Housing Committee agenda item 20 Constable 1201 78 minutes 26 to 37, which adopted the 2021 budget, changing preparations to various departments and budget control levels all from various'",
        "'speaker_0': 'funds in the budget and listing of proviso all 54 of the City Council. The committee recommends the bill passed as amended. Thank you so much. I'm going to hand it over to Councilmember Muscadet, who is the chair of the committee to provide the report.'",
        "'speaker_0': 'Thank you very much. Colleagues, this is the legislation that I mentioned this morning that I am so excited about. Council Bill 120178. Item number 20 on our agenda is the legislation that follows up on the priorities that many in the community had worked on for years and the priorities that you council had worked to prioritize in last'",
        "'speaker_0': 'year's budget and the budget cycle in 2019 as well. This legislation lifts the proviso excuse me, on the $30 million that we had set aside and put a proviso on for the Strategic Investment Fund, following through on the years long process and advocacy by community organizations that work to ensure that the city made good on its promise'",
        "'speaker_0': 'that when we sold the Mercer Mega BLOCK, that we maintained our commitment that $30 million would go to investments in historically and historically in communities, historically experiencing displacement and having lack of access to high opportunity neighborhoods. As a reminder that this legislation was fully established in 2019 when, in addition to allocating a portion of the Mercer mega'",
        "'speaker_0': 'sale to historic investments and housing, the City Council also passed a budget proviso to create a community driven strategic acquisition fund. This included an advisory board to make recommendations on how to spend the money to support equitable development projects in communities experiencing high rates of displacement and low access to opportunity as defined by the community themselves.'",
        "'speaker_0': 'Last year, we as a council worked to reinstate the $30 million fund when this funding was cut by the mayor's proposed 2021 budget and the 2021 final budget. We made sure that this funding was prioritized and the community celebrated.'",
        "'speaker_0': 'It is exciting to celebrate again today to see this proviso lift and the legislation today move forward. We will now be able to see the $30 million that had been requested by the community at a bare minimum get out the door to community driven anti displacement acquisitions, supporting investments for the creation of housing, child care, small business'",
        "'speaker_0': 'and community space. We've heard time and time again from community advocates that it is very important, if not one of the most important things that we can do to displaced, to combat displacement is to make sure that we are taking land off the open market and to make sure that the city does everything it can when we'",
        "'speaker_0': 'have under-utilised public property to hold it in our hands. Since the sale of the Mercer Mega BLOCK. We have changed our policies in the city to maintain public land in public hands and use it for promoting public good.'",
        "'speaker_0': 'But this sale had already been in the works prior to my arrival on council and the community. Organizations that knew that this transaction was already in place demanded that the community organizations be able to at least get $30 million in addition to the investments in affordable housing, to build assets that promote resiliency and support community vision.'",
        "'speaker_0': 'So this piece of legislation and this property has been through a long process, and I think we are in a much better position public policy wise to make sure that future properties like of the Mercer mega parcel are remain in public hands.'",
        "'speaker_0': 'And then today we're following through on that commitment and the vision of the community and the Community Advisory Board and the hard work of opacity, especially Juliet and Uber, who have presented to our community our committee meeting a handful of times and their intensive work that they did and their brave actions that they took to stand up'",
        "'speaker_0': 'to make sure that the project applications, the selection process, was really in alignment with what the community had been calling for. We know there are many, many worthy projects that have not been selected for this limited pool of funds.'",
        "'speaker_0': 'We are very much interested in continuing to work with members of the public council colleagues here to continue to leverage additional dollars coming in through the door, such as through the Jumpstart Progressive Revenue legislation that we passed last year to see which additional projects we can continue to move forward as we seek to fulfill the vision of'",
        "'speaker_0': 'those who had applied for these dollars in whole. Cause I want to thank you for your consideration today. I know many of you have been working on this for many years and to the community as well as the members that I mentioned at obesity.'",
        "'speaker_0': 'And I want to thank Erin House who has been working on this for a number of years as well for our work on this legislation in front of us today and hope to have your support. Thank you so much.'",
        "'speaker_0': 'Colleagues, are there any additional comments on the bill? Harry Nunn will a quick piece called the wall on the passage of the bill strauss.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'Herbold. Yes. Lewis.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'Morales. Let's get to Abby Peterson.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'So what?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'President Gonzalez I 18 in favor and unopposed passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Is there any further business to come before the Council? Here in non-college, this does conclude the items of business on today's agenda.'",
        "'speaker_0': 'Our next regularly scheduled city council meeting is on October 4th, 2021, at 2:00 PM. I hope that you all have a wonderful evening. We're adjourned. Thanks so much.'"
    ]
}