{
    "AN ORDINANCE amending Ordinance 125724, which adopted the 2019 Budget, including the 2019-2024 Capital Improvement Program (CIP); changing appropriations to various departments and budget control levels, and from various funds in the Budget; adding new CIP projects revising project allocations for certain projects in the 2019-2024 CIP; abrogating positions; modifying positions, and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_5': 'Oh, right. So next step is report of the committee reports. Will the clerk please read? Agenda item one.'",
        "'speaker_2': 'The report The City Council Agenda and one Council Bill 119 720 and many ordinance 125 724 which adopted the 2018 budget, including that 2019 through 2024 capital improvement program. The committee recommends that the bill passes amended.'",
        "'speaker_5': 'I just need a minute to get to my remarks here. All right. So Council Bill 119720 is the fourth quarter 2019 Supplemental Budget Ordinance, which proposes adjustments to the 2019 adopted budget, including appropriation authority for the grants accepted by Ordinance 126023, which was adopted by Council last month on December 16th.'",
        "'speaker_5': 'This ordinance would appropriate approximately $132.7 million, of which $101.6 million is for operations and $31.1 million is for capital. The operations appropriations include approximately $16.7 million or 16.4% from the general fund, of which $8.6 million are grant funded.'",
        "'speaker_5': 'This was an ordinance that was heard in the former Finance and Neighborhoods Committee, and the that committee recommends that the City Council pass as amended this council bill. 119720. Are there any comments or questions? Okay. Will the clerk please call the role on the passage of the bill?'",
        "'speaker_2': 'Herbold. I. Suarez.'",
        "'speaker_3': 'Lewis, i.'",
        "'speaker_2': 'Morales, i. Peterson. I so want strauss. I. Council President Gonzalez. All right. Eight in favor. Nine opposed.'"
    ],
    "A RESOLUTION relating to committee structure, membership, meeting times, and duties of the standing committees of the Seattle City Council for 2020 and 2021; and superseding Resolution 31883.": [
        "'speaker_5': 'The bill passes and the chair will sign it. Right. Adoption of other resolutions. Will the clerk please read into the record items two and three.'",
        "'speaker_2': 'For adoption of the resolutions agenda items two and three Resolution 319 22 Related Committee Structure, Membership Meeting Times and Duties of Standing Committees of the City Seattle City Council for 2020 and 2021. A Superseding Resolution 31883 Resolution 319 23 relating to Seattle City Council Member Participation for 2020 and 2021 on King County Committees, Regional Committee, State Committees'",
        "'speaker_2': 'and City of Seattle Committees and Superseding Resolution 31885.'",
        "'speaker_5': 'Thank you. Adam Kirk. So Resolution 3192 and Resolution 319823. Establish the committee structure and membership meeting times and duties of the Standing Committees for Seattle City Council for 2020 and 2021. It also establishes each of our participation on external committees, those being regional committees, state committees and other City of Seattle committees.'",
        "'speaker_5': 'For the next two years, I'm going to go ahead and move to adopt item two and then look for a second. And then once that occurs, if any of my colleagues would like to give remarks about the resolution and your committee assignment, I will go ahead and call on my colleagues for that purpose.'",
        "'speaker_5': 'So I will move to adopt Resolution 31922. Kate's been moved in second. Is there any of my colleagues who would like to provide any remarks or comments? Councilmember grumbled.'",
        "'speaker_4': 'I primarily just want to thank you and your staff for the hard work that you've done in putting together this, this resolution and our committee responsibilities and also shepherding a what will be a bit of a culture change with the establishment of new quorum rules, a higher level of participation required for committees to meet.'",
        "'speaker_4': 'I think the new structure will have significant demands of all of us, and I'm confident under your leadership that we will rise to the occasion. And I'm really excited about about your leadership and about the new committee structure and having a chance to to work with my colleagues and work on the issues most important to them.'",
        "'speaker_5': 'Thank you. Councilmember Herbold, any other comments from a salon?'",
        "'speaker_1': 'Thank you, President Gonzalez. I intend to vote yes on this resolution, of course. And just wanted to share with members of the public that I will be chairing the Sustainability and Renter's Rights Committee, which will hold a regularly scheduled meeting on the fourth Tuesday of every month.'",
        "'speaker_1': 'And the issues that we will be discussing, of course, will be related to rent control, economic eviction protections, 180 days notice for rent increases, portable background checks for renters. And most urgently upcoming legislation, of course, is something that has already been introduced in the council from my office, which is the moratorium propose moratorium on winter evictions to'",
        "'speaker_1': 'make sure that our renting families are safe from the element in the harshest months of the year. And we will also be discussing upcoming legislation to contradict what the outgoing City Council last year already made a commitment to, which is a Green New Deal for our city.'",
        "'speaker_1': 'And I just wanted to make a clarification quickly. At the council briefing this morning, I announced, unfortunately, mistakenly, that my first committee will be meeting on the 20th of this month. I just remember I'm actually personally not available on that day, so we will have to revise that date and I'll make sure my staff reach out to'",
        "'speaker_1': 'all your offices as soon as possible. Great.'",
        "'speaker_5': 'Thank you, Councilman. Isn't any any other of my colleagues want to make any remarks at this point? Okay. See, none. I want to really appreciate and thank each of you for your engagement, both personally with me over many, many weeks and with my staff on talking through what would what each of your individual priorities are for the'",
        "'speaker_5': 'next two years. That input, I hope you see reflected in this final resolution. It's always a bit of an art, not quite a science to to pull together committee structures and committee assignments and really have appreciated and had appreciated the opportunity to engage with many of you over many weeks to take your individual input for my thinking'",
        "'speaker_5': 'that to be able to distill it into what I think is, is a consensus resolution before us that really does hopefully reflect not only the priorities that each of you will have in working through some of the issues that your committees will be responsible for, but also in helping us establish a different culture here at the City'",
        "'speaker_5': 'Council that really allows for many of the difficult policy issues to be worked through effectively and openly, in a transparent way through our new committee structure, which will now require five members and one alternate. And it will also require that at least three council members who are members of the committee attend the committee hearing in order for'",
        "'speaker_5': 'the committee to be able to do its business again. A bit of a culture shift for us, but it also puts some responsibility on us as chairs to ensure that we have the bodies in in the chairs to be able to inspire confidence among the public that we are taking the policy work seriously.'",
        "'speaker_5': 'That is our duty here at the legislative branch and that will and that we're doing that in good faith. So I really look forward to to seeing the plan executed. And again, really have appreciated your all cooperation and willingness and transparency and having conversations with me as I thought through what the committee structure could be for this'",
        "'speaker_5': 'year. So thank you all so much for your commitment to that. So this this resolution has been moved and has been adopted. So those in favor adopting the resolution vote i. I any opposed the motion carries and the resolution is adopted and the chair will sign it.'",
        "'speaker_5': 'Okay. We're going to move on to resolution 31923. I moved to adopt resolution 31923 case, been moved and seconded that the resolution be adopted. Are there any comments? So, folks, this is the resolution that relates to each of our participation for the 20 2021 for the 2020 and 20, 21 years on King County committees, regional committees, state'",
        "'speaker_5': 'committees and City of Seattle committees. Again, this is in large part related to our City Council Committee obligations and duties, but also has a flavor of interest that folks have in serving in other regional issues and regional committees that we get to have representation on.'",
        "'speaker_5': 'By virtue of being Seattle City Council member. So again, I appreciate your willingness to serve on these committees as part of our ongoing obligations as City Council members to represent our city specific interest in these regional and statewide efforts.'",
        "'speaker_5': 'So it has been moved and seconded that we adopt resolution 31923 those in favor of adopting the resolution vote i. I any opposed? None oppose. The motion carries in. The resolution is adopted and the chair will sign it.'"
    ],
    "A RESOLUTION designating the monthly President Pro Tem of the City Council of The City of Seattle for 2020-2021 and superseding Resolution 31884.": [
        "'speaker_5': 'Okay. The Council will now discuss and consider one motion to suspend the council rules before we consider item four on the agenda. The Council rules require that the Council adopt by resolution a monthly rotation for the position of Council President Pro Tem in order of seniority and requesting that this Council rule be suspended to allow consideration of'",
        "'speaker_5': 'Resolution 31924, which does not delegate the Council President Pro tem rotation in order by seniority. Two thirds of council members must vote in favor of this motion for us to consider Resolution 31924 as proposed. If two thirds are in favor, the Council will then consider Resolution 31924.'",
        "'speaker_5': 'So I am going to move to suspend council rule one as yeah, one de point one relating to the delegation of a council president pro tem rotation in order by seniority. And I think this has been motion and it's been seconded.'",
        "'speaker_5': 'Are there any comments? You see no comments from my colleagues. Those in favor of the motion vote i. I. Those opposed vote no. The motion carries in the council rules suspended to allow consideration of the resolutions. So now the Council will consider resolution 31924.'",
        "'speaker_5': 'Which has not been read into the record. And we lost our clerk. Let me read here. We're going to go ahead and read it into the record first and then we'll we'll move through.'",
        "'speaker_2': 'A resolution designating the monthly president pro tem of the City Council of the City of Seattle for 2020 through 2021 and superseding Resolution 31884.'",
        "'speaker_5': 'Thank you, Judy. So we have now read. Agenda item four into the record. So I'm going to move to adopt the resolution, ask for a second and then we'll call for any comments. So I moved to adopt resolution 31924.'",
        "'speaker_5': 'It's been moved and seconded that the resolution be adopted. Are there any comments? Seeing none those in favor of adopting the. Sorry. No, it's okay. Those in favor of adopting the resolution vote i.'",
        "'speaker_1': 'I.'",
        "'speaker_5': 'Any opposed the motion carries and the resolution is adopted and the chair will sign it.'",
        "'speaker_0': 'I can get in here. It's going be.'",
        "'speaker_5': 'Okay, folks. And for those of you who weren't quite following what we did on agenda item four, we essentially suspended the rules around around the need to do our council president pro tem schedule by seniority. So we have shifted things a little bit.'",
        "'speaker_5': 'Again, it's wasn't controversial and it was a agreed upon thing. So I don't want folks to think that this is an affront or an insult somehow to to you councilmembers talent.'",
        "'speaker_1': 'And in fact, I appreciate.'",
        "'speaker_5': 'So it means that that Councilmember Herbold will be council president pro tem in January, followed by Councilmember Suarez and then followed by Councilmember Mosqueda. And the only reason I'm highlighting that is because it's particularly relevant for the first three months of this year, which we will get to in a moment.'",
        "'speaker_5': 'So before I talk about my other business, is there any other further business to come before the council? And for the for the new members. This is if you need to be excused for a full council meeting, this is the opportunity for you to do that.'",
        "'speaker_5': 'All right. So I am though I don't have I'm not required under the council rules to be formally excused by the full council. I am nonetheless taking the opportunity to, in oral form, request that I be excused for all four Council meetings between January 13th and oh, what's the week before March 30th?'",
        "'speaker_2': 'S.O.S. We have March 30th.'",
        "'speaker_5': 'What's the Monday before that? March 20, March 23rd. So January 13th and. And March 23rd. I will be and I'm excited to be leaving on maternity leave. I will be the second council member in three months and in the history of the city of Seattle to request maternity leave and am very excited about about the opportunity to'",
        "'speaker_5': 'step away from my council obligations to bond with my first child. And I'm looking forward to be to being able to spend some time away from City Hall a little this morning I was having a little bit of FOMO, hearing all of you all talk about the wonderful things that are going to happen in the first quarter'",
        "'speaker_5': '. But it is just an absolute humbling experience for me to be able to be in a position to start a family and to be able to have had some of the best prenatal care I could have ever asked for, and to have the support of my former colleagues and my new colleagues in carrying some of the work'",
        "'speaker_5': 'through in the first quarter. In my absence, I really appreciate all of the ongoing support from each of you up on the dais and from my own staff who have been key to making sure that the work will continue in my absence.'",
        "'speaker_5': 'So we have a solid work plan that we've been working on for weeks in my office to make sure that the roles and responsibilities of the council president office that are part of my office's responsibilities now are going to flow well with each of the three council president pro times that are going to be in place for'",
        "'speaker_5': 'January, February and March. And we are really looking forward to continuing to advance many of our policy priorities around child and and affordability and transportation issues and early learning and education issues throughout the city. And look forward to establishing all of that foundational work in my absence over the next three months.'",
        "'speaker_5': 'And then and then hitting the ground running on March 30th when I return to the city council. So really appreciate the again support from all of you as I step away and and focus on on family for for three months this this year undivided attention hopefully to that and really look forward to being able to do that'",
        "'speaker_5': '. So if there's no objection to my being excused, I will be excused.'",
        "'speaker_3': 'That's it. All right.'",
        "'speaker_5': 'So as a reminder, once again, there is a short reception and that will commence now in the Bertha Knight Landis room, which is on the first floor of City Hall. All are welcome to attend. That is the last item on our agenda.'",
        "'speaker_5': 'And with that being said, we are adjourned. Thank you, colleagues.'",
        "'speaker_3': 'Thank you.'"
    ]
}