{
    "AN ORDINANCE amending Ordinance 126237, which adopted the 2021 Budget, including the 2021-2026 Capital Improvement Program (CIP); changing appropriations to various departments and budget control levels, and from various funds in the Budget; and adding or modifying provisos; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the please affix my signature to the legislation on my behalf? Item one will please read the short title of item one into the record. The Report of the Finance and Housing Committee Agenda Item one Constable 1200 19 and many audience 26 to 37, which adopted the 2021 budget'",
        "'speaker_0': ', including the 2021 three 2026 Capital Improvement Program. The committee recommends the bill pass. Thank you, Madam Clerk. Consumer scanning. You are the chair of this committee, and I'm going to hand it over to you to walk us through the report.'",
        "'speaker_0': 'Thank you very much, Madam President. Council colleagues, thank you for all of your input on this item. Just as a reminder, this is our resolution that outlines the principles and our broad spending categories for the anticipated additional federal aid that is coming from the American Rescue Plan Act or ARPA.'",
        "'speaker_0': 'As Senator Bernie Sanders said recently in an interview on Democracy Now! This is the most significant legislation for working people that has been passed in decades, saying what this legislation does. He commented on the fact that this legislation advances priorities in this country that we have ignored for far too long, noting that we have the highest rates'",
        "'speaker_0': 'of child poverty of any major country on Earth. And this largest legislation expands tax credits and lowers childhood poverty in America by up to 50%. This legislation says that in the richest country in the history of the world, people should not be going hungry.'",
        "'speaker_0': 'The legislation passed by Congress provides help so that when moratoriums on evictions end, people will get the assistance they need to be able to stay in their homes, whether a rental unit or your own home. And the federal act more than doubles funding for community health centers.'",
        "'speaker_0': 'These are among other priorities. It is with great anticipation that the City of Seattle is looking forward to working with all of the residents in Seattle to allocate the funding to address the immediate needs that have become worse due to COVID and also address the underlying inequities that were present prior to COVID.'",
        "'speaker_0': 'The crisis of the pandemic has only exacerbated it and made worse many of the situations that families were living in, in poverty, or whether they were vulnerable communities or families who are living paycheck to paycheck, and the disproportionate impact, especially on women and people of color as a result of the consequences of COVID.'",
        "'speaker_0': 'I'm really excited about this resolution. It is the first of a few pieces of legislation that I know the Council will pass soon related to the American Recovery Act plan. But this resolution provides the backbone, the frame that we will continue to go back to as we allocate funding to provide necessary services both in the near and'",
        "'speaker_0': 'the long term, to recover from this crisis. The priority investments in this resolution are informed by policies that many in the community have engaged in deep conversations with the Seattle City Council on over the last year. This builds on previously passed legislation like the 2020 budget revisions like our Jumpstart Seattle COVID relief plan.'",
        "'speaker_0': 'The initial plan that we passed and the final one that was submitted as well, and it builds on the 2021 adopted budget all as key components as we look at items for immediate relief and flagging ongoing investments in the outyears.'",
        "'speaker_0': 'The resolution was developed with the following considerations in mind. First and foremost, data obscured. I'm so sorry, but I just realized that you're speaking to item two and we are on item one, so I apologize. You're so excited about this resolution that we weren't excited about.'",
        "'speaker_0': 'But yes, right over the first bill, I.'",
        "'speaker_2': 'Thought it was me. I thought I was off. Thank you. I thought I was going.'",
        "'speaker_0': 'To cry all that away for Bill two and I apology. I apologize to Councilmember Lewis.'",
        "'speaker_2': 'Yeah so I think.'",
        "'speaker_0': 'We're we're all.'",
        "'speaker_2': 'Equally excited.'",
        "'speaker_0': 'About council bill 120019. So I'm going to hand it back over to you to walk us through that one at first and if you'd like to defer to Councilmember Lewis, also happy to do that. Well, Councilmember Lewis, I appreciate your leadership on this.'",
        "'speaker_0': 'I will be very brief. Item number one, colleagues, is ordinance 120011. This does require a three fourths votes of Seattle City Council. So I'm equally as excited about this piece of legislation. I will note that it provides the 12 million appropriated needed for the non congregant shelter services, including hotel rooms, tiny house villages or enhanced shelter options'",
        "'speaker_0': 'for individuals experiencing homelessness and an increased risk for contracting COVID. Greatly appreciate the leadership of Councilmember Lewis and the Council President and the negotiations on this bill. And it comes to us after both receiving clarity and after a year of being in compliance and trying to be in compliance with CDC recommendations which require us to look at'",
        "'speaker_0': 'non congregate shelter options for all of those who are experiencing homelessness across our city. Councilmember Lewis, apologies for the delay and thank you again for your leadership. Councilmember Lewis, would you like to make comments on this bill as the prime sponsor?'",
        "'speaker_5': 'Yes. Thank you, Madam President, and thank you for your leadership. And in moving the ball along on this, in bringing all of the parties to the table, including FEMA, the city budget office and the mayor's office, as well as the key council stakeholders.'",
        "'speaker_5': 'Thank you, Councilmember Mosqueda, for co-sponsoring this and moving it expediently through your committee last week on a expedited timeline. You know, a lot has been said about this over the last couple of weeks, as we've discussed this in the news as a community, not just as a city government, that we make sure that we are aggressively pursuing'",
        "'speaker_5': 'every possible resource to make a impact on the really, really difficult issue that all of us see on a very daily basis of chronic homelessness in our community. Knowing that there are lots of things we can be pursuing with this federal reimbursable resource to mitigate the impact of this.'",
        "'speaker_5': 'Emergency, get people inside into a private, hygienic place with four walls and a door that locks where they can live with dignity and where they can be protected from the very real and rampant COVID pandemic. We know from some of the conversations this morning and Councilmembers Muscat and Morales and I know from our our briefings in Board'",
        "'speaker_5': 'of Health last week that despite a lot of cause for optimism, there is still a rampant virus out there that folks experiencing homelessness are more vulnerable to without having a lot of the places that we take for granted to be able to shelter in place in a safe and hygienic way from the unique challenges of the pandemic'",
        "'speaker_5': '. This resource specifically will help the city to address that, to provide the kind of non congregate shelter that is essential for people who are 65 and older, people with co-morbidities, people with enhanced vulnerability to the disaster can take advantage of.'",
        "'speaker_5': 'I do want to note that this is a resource that is on top of other resources this Council has appropriated and put forward to provide more non congregate shelter. It is additive to the 300 hotel rooms that the council provided funding for last fall.'",
        "'speaker_5': 'It is additive to the 120 additional tiny houses that the council provided, as well as the 125 enhanced shelter spaces. That is 545 total aggregate spaces. The executive is still in the process of setting up in collaboration with the Council, and we should get a pretty big update on all of those assets in the April meeting of'",
        "'speaker_5': 'the Council. But in the meantime, we can be leaning in with this additional resource to take advantage of the generous offer from FEMA to 100% reimburse for certain expenses that meet their criteria that we have spent a lot of time really drilling down into the specifics of.'",
        "'speaker_5': 'And this legislation addresses that. One last thing I do want to say on this, just to make sure we don't forget, I know council president had indicated an interest in being added as co-sponsor. I want to make sure that we do that before the full passage.'",
        "'speaker_5': 'And I don't know if this is the time to signify as prime sponsor that that is absolutely very warranted given the key leadership role council president played in bringing this together. But I just want to close my comments by recognizing that.'",
        "'speaker_5': 'And with that, I'll turn it back over.'",
        "'speaker_0': 'Thanks for that concern. Lois, really, really appreciate it. I went I would like to have my name added as I cosponsored to this really important bill and I appreciate your comments. Customer Lewis following up on that. So I'm hoping that the clerks are listening.'",
        "'speaker_0': 'I'm sure that they are so that they can make sure that the record reflects my co-sponsorship. And I will wait for one of them to tell me that I need to see specific, more specific words if I need to.'",
        "'speaker_0': 'And happy to do that. Okay with that.'",
        "'speaker_1': 'We've added you as a co-sponsor.'",
        "'speaker_0': 'Thank you. Thank you so much, Madam Clerk. Really appreciate it. Colleagues, any other comments or questions on on Council Bill 120019. I'm not seen any more comments on this. I am really excited to be able to vote in favor of this particular council bill and the things that we think it makes a lot of sense based on'",
        "'speaker_0': 'what the Prime sponsor and and Chair Mosqueda just just mentioned. And I'm glad that we were able to find some much needed clarity on the policy position related to this bill from the federal level that really allowed us to move this particular legislation forward.'",
        "'speaker_0': 'And of course, there is no 100% guarantee of 100% reimbursement. But I think that any opportunity we can to get reimbursement, even if it's partial, is critically important to continue to protect those who cannot shelter in place from the devastating, deadly impacts of COVID 19.'",
        "'speaker_0': 'We know that it is going to take us a while to catch up to the demand and the need as it relates to vaccination. And we also know that when we're talking about hard to reach community members like those who do not currently have housing or are unsheltered, it's going to be even more challenging to deploy vaccinations'",
        "'speaker_0': 'into the community. And it's going to take us, unfortunately, a little bit longer because of the transitory nature of the population. So this hoteling strategy and other strategies that allow us to focus on non congregate shelter for those individuals who will continue to be at significant risk to COVID 19 is is going to be critically important for'",
        "'speaker_0': 'the city moving forward. So I appreciate and appreciate the the good sense here in advancing this bill. All right. I'm not seeing any additional comments on this bill, so I'm going to ask that the clerk please call the role on the passage of Council Bill 120019.'",
        "'speaker_1': 'Morales. Yes. Macheda. Hi, Peterson.'",
        "'speaker_5': 'Hi.'",
        "'speaker_1': 'So what? Yes. Strauss.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Suarez.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Lewis. Yes. President Gonzalez I nine in favor and unopposed.'"
    ],
    "A RESOLUTION identifying the City Councils priorities to maximize local use of future federal funding to support COVID-19 relief and recovery efforts.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the court please affix my signature to the legislation on my behalf? Okay. Item two Will the clerk please read item two into the record? Agenda item two Resolution 31999.'",
        "'speaker_0': 'Agenda and the City Council's priorities to maximize local use of future federal funding to support COVID 19 relief and recovery efforts. The committee recommends that the resolution be adopted as amended. Councilmember Mosqueda This is the item that you were very excited about.'",
        "'speaker_0': 'So now when I hand it back over to you to finish your remarks and amend, well, we'll take up the resolution. Thank you, Madam President. Thank you, counsel. Colleagues, apologies for that. Thank you for letting me preview item number two and to pick up where I left off.'",
        "'speaker_0': 'As a reminder, this is the resolution that provides that backbone and guiding document for us as we consider future ordinances that allocate funding from the Federal Rescue Plan Act. So I appreciate all of the work that you provided.'",
        "'speaker_0': 'As a reminder, this includes priority investments that were made in the ACT in the following categories looking at investments grouped into categories such as vaccines and testing, food assistance, homelessness and housing services, including rental assistance, immigrant and refugee support, child care support, small business and worker assistance and workforce recovery.'",
        "'speaker_0': 'Community well-being. Transportation and revenue replacement and financial resilience. This is the foundation for the future work that our Council will work on, that the city will use as we respond to the crises that we see right now in the streets, a crisis that many small businesses and workers are facing with lack of access to security and the'",
        "'speaker_0': 'ability to open up shops or get back to work, and how we also invest in the long term when we create a more equitable economy as we look to recover. This resolution was developed with the following four principles in mind.'",
        "'speaker_0': 'First, I need to be I need to be prioritizing equity, prioritizing investments for those who are most impacted by COVID and the associated economic impacts. Second, coordination ensuring that the investments are coordinated with other entities to address gaps in services or provisions.'",
        "'speaker_0': 'Third, flexibility, as we heard from our federal partners this morning, who are tracking the development and allocation of funding out to cities and states. We need to be flexible and nimble, prepared to respond as needed both to federal guidance that comes out and also to the ongoing needs that are growing and evolving in our community right now'",
        "'speaker_0': '. And fourth, resilience. This allows us to guard against future austerity measures of future uncertainty and position the city to make new investments, such as the resolution that we passed that went along with jumpstart our concrete spend plan that was baked into Resolution 31957.'",
        "'speaker_0': 'This is our effort to make sure that we are a resilient, more equitable economy in the horizon so that we don't go back to normal, that we actually go back to a much better, more equitable city. The resolution was developed with the following considerations in mind.'",
        "'speaker_0': 'First, that we have a need to be pivoting the city efforts from acute emergency relief to longer term economic community recovery. The second for potential to leverage other local, state and federal programs and partners. And third, a recognition of the city's capacity constraints that would limit our ability to deliver services if we didn't do it in partnership'",
        "'speaker_0': '. A great example is the ongoing work that we're doing with the county where the ordinance just passed and led by Councilmember Lewis to partner with King County. As we think about responding to the crisis that's manifesting in terms of homelessness and growing homelessness.'",
        "'speaker_0': 'So we will be working through this public outreach process and look forward to working with you as we get word out to the community about how they can engage. Thank you very much, council president. Thank you so much, Councilmember Mosqueda, for that.'",
        "'speaker_0': 'Any other comments on the resolution? Casmir Peterson, please.'",
        "'speaker_5': 'Thank you. Council President I just wanted to thank the chair of our Finance Committee, Councilwoman Mosqueda, for providing the opportunity to non committee members to provide feedback on the resolution. I was able to make sure the resolution mentioned access to Internet supporting our transportation infrastructure, and I look forward to working collaboratively with the executive to invest these'",
        "'speaker_5': 'funds in the most effective manner possible. But I really want to thank the inclusiveness from our finance chair.'",
        "'speaker_0': 'Thanks so much, Councilmember Peterson. Any other comments on the resolution? Hearing no other comments. Will the clerk please call the roll on the adoption of the resolution.'",
        "'speaker_1': 'Or Alice as Macheda?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Peterson. Yes. So what? Yes. Strauss. Yes. Herbold. Yes. Juarez by Lewis.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'President Gonzalez. All right. Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the City Light Department; authorizing the General Manager and Chief Executive Officer to release a portion of an existing transmission corridor easement to the City of Kirkland; and accepting the payment of fair market value for the partial release of easement.": [
        "'speaker_0': 'The resolution is adopted and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read item three into the record? Every part of the Transportation and Utilities Committee and I have three counts above 120008 relating to the City Department authorizing the General Manager and Chief Executive'",
        "'speaker_0': 'Officer to release a portion of an existing transport transmission corridor easement to the City of Kirkland and accepting the payment of fair market value for the partial release of easement. Can we recommend the bill pass? Thank you so much, Madam Clair CASMIR Peterson, you are chair of the committee, and I'm going to go ahead and hand it'",
        "'speaker_0': 'over to you to provide the the report on this bill.'",
        "'speaker_5': 'Thank you. Council President. Council Bill 120008 facilitates the completion of part of the Regional Rail Trail Project by having Seattle City Light grant a small easement to the city of Kirkland. The City of Seattle is retaining sufficient rights for ongoing satellite access for maintenance of the power line.'",
        "'speaker_5': 'Our committee held the public hearing March 3rd and then recommended unanimously our committee on March 17. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Peterson. Really appreciate it. Are there any additional comments on this bill? Hearing none. Will the clerk please call the roll on the passage of the bill?'",
        "'speaker_1': 'Morales. Yes. Macheda. Hi.'",
        "'speaker_4': 'Peterson Hi.'",
        "'speaker_1': 'So what? Yes. Strouse Yes. Herbold Yes. Suarez All right.'",
        "'speaker_5': 'Lewis Yes.'",
        "'speaker_1': 'President Gonzalez High nine in favor. None opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read the short title of item four into the record?'"
    ],
    "AN ORDINANCE relating to grant funds from non-City sources; authorizing the Director of the Seattle Department of Transportation to accept specified grants and execute related agreements for and on behalf of the City; amending Ordinance 126237, which adopted the 2021 Budget, including the 2021-2026 Capital Improvement Program (CIP); changing appropriations for the Seattle Department of Transportation; revising allocations and spending plans for certain projects in the 2021-2026 CIP; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'Agenda item.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'Council 1 to 0 zero 17 relating to grant funds from non city sources. The committee recommends the bill passed. Thank you so much, Councilmember Peterson. This one is yours as well. So I'll hand it back over to you.'",
        "'speaker_5': 'Thank you. Council President Colleagues Council 120017, which is co-sponsored by Councilmember Herbold, accepts a grant from the Puget Sound Regional Council for the West Seattle Bridge. Many thanks to Council President Gonzales and Councilmember Arias as well as to our city government staff members who enabled us to secure this grant to help pay for the restoration work for'",
        "'speaker_5': 'this bridge that is so important to the city, the region and the state. We look forward to the high bridge reopening which is scheduled for the middle of next year. Thank you.'",
        "'speaker_0': 'And not a moment too soon, I tell you. All right. I imagine that there are additional comments on this bill. So are there any other comments? Councilmember Herbold, please.'",
        "'speaker_2': 'Thank you so much. What a. Send my.'",
        "'speaker_0': 'Thanks.'",
        "'speaker_2': 'Councilor Juarez. You're on my list, so I hope it's okay. I want to thank the IOC Executive Board Members Council President Gonzalez, Councilmembers Lewis Strauss and Mayor Durkan for their work at the Executive.'",
        "'speaker_0': 'Committee.'",
        "'speaker_2': 'And to the Our City Transportation Policy Advisory Board Members.'",
        "'speaker_0': 'And Alternate.'",
        "'speaker_2': 'Council President Gonzalez.'",
        "'speaker_0': 'And Councilmember Suarez and Petersen.'",
        "'speaker_2': 'For their work on the Transportation Advisory Board for making the recommendations in the first place to move this funding to the Executive Board for their final action. Really support. Appreciate the support and the commitment of all of the city's elected officials to obtaining funding for this critical work and a recognition that this is a regional asset.'",
        "'speaker_2': 'To date, $124 million has been secured for the overall project, in addition to the 100 million approved by the council. The total of grant secured so far is 15.9 million. With 9 million of the funds coming from the Transportation Benefit District.'",
        "'speaker_2': 'Last week we all signed a letter to your US DOT Secretary Buttigieg in support of an Infrastructure for Rebuilding America grant for around $2 million or $20 million. And that we're also the city of Seattle seeking 25 million in funding from the state during the current legislative session.'",
        "'speaker_2': 'So. Feeling feeling good about the funding piece. And yes, this this this bridge can't open soon enough for a lot of folks.'",
        "'speaker_0': 'Thank you for those comments. Are there any additional comments on the bill?'",
        "'speaker_2': 'Yes, I have one comment. Council President.'",
        "'speaker_0': 'Councilor.'",
        "'speaker_2': 'Warren thanked. I want to thank everybody for everything all the time, but more importantly, I want to thank how long it took us to get this money and not name names because it's been going on for about six months.'",
        "'speaker_2': 'Finally got across the finish line for people to recognize. At least Seattle needs their bridge fixed. A lot of people go over that bridge. It isn't just Seattle's bridge. It's everybody's bridge. And let's see, who did I forget?'",
        "'speaker_2': 'Yeah, everybody. I want to thank everybody. So thank you.'",
        "'speaker_0': 'I just want to make sure you got everybody.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Let it be known that we are very grateful group of council members from here and to every other corner of the state of Washington. We are incredibly grateful. So thank you so much to everyone. If there are no other comments, I'm going to ask the class to call the roll.'",
        "'speaker_0': 'Hearing no other comments while the clerk please call the role on the passage of the bill.'",
        "'speaker_1': 'Morales. Yes. Macheda. I. Peterson I so want. Yes.'",
        "'speaker_3': 'Strauss Thank you. Yes.'",
        "'speaker_1': 'Herbold Yes.'",
        "'speaker_2': 'Suarez Yes.'",
        "'speaker_5': 'Lewis Yes.'",
        "'speaker_1': 'President Gonzalez I nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to surveillance technology implementation; authorizing approval of uses and accepting surveillance impact reports for Seattle City Lights use of Current Diversion Technologies.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Will the clerk please read item five into the record? Agenda Item five Council Bill 120002 Relating to surveillance technology implementation authorizing approval of uses and accepting surveillance impact reports or city lights.'",
        "'speaker_0': 'Use of current diversion technologies. The committee recommends the bill passed as amended. Councilmember Peterson, you are the chair of this committee, and I'm going to hand it back over.'",
        "'speaker_2': 'To you to.'",
        "'speaker_0': 'Give us this report.'",
        "'speaker_5': 'Thank you. Council president and colleagues, bear with me. Some of these remarks will sound very similar to what I said at council briefing, but for the viewing public, I wanted to set the table again for this. The surveillance ordinance adopted in 2017 and refined in 2018 created for Seattle, a strong process to review technology that I'll use'",
        "'speaker_5': 'to increase the efficiency of government operations and services could have surveillance capabilities. And thank you to the council, President Gonzales and others who crafted the surveillance ordinance. It puts in place a thorough review process that requires the departments using the technology to justify and provide policies for use of the technology with a focus on protecting privacy and'",
        "'speaker_5': 'civil liberties. This is followed up with a review by a volunteer surveillance working group and by our Information Technology Department. Our committee received an overview of the Surveillance Technology Impact Report approval process back in January, and three ordinances were put forward for nine of the 26 existing technologies back on February 22nd on the introduction referral calendar.'",
        "'speaker_5': 'We heard from all the relevant city departments and central staff at our committee on both March 3rd and March 17. I want to thank the staff from the departments using this technology, the staff from our information technology department, the volunteers on this surveillance working group, our central staff analyst Lisa Kay, and my legislative aide to provide for'",
        "'speaker_5': 'their work on these group to existing technologies. The committee unanimously recommended the impact reports for both Seattle City Light and the Seattle Fire Department Technologies. And these are the two bills before us this afternoon Kalispell 120002 of which is for City Light and 1200083 the next item for the fire department.'",
        "'speaker_5': 'As I mentioned this morning, during our morning briefing, Councilmember Herbold published a friendly amendment on today's agenda to have the fire department explore the feasibility of an additional computer security feature based on the fire department's responses during our committee.'",
        "'speaker_5': 'And that's an amendment to the next bill. But this bill before us right now is just for City Light to improve their existing technologies. I'm happy to answer questions.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. And this bill, of course, is just related to Seattle City, LA. And does not have any amendments being proposed to it. And I'm happy to hear any comments or questions from any of our colleagues.'",
        "'speaker_0': 'Hearing none. Will the court please call the roll on the passage of the bill?'",
        "'speaker_1': 'Morales Yes, macheda I. Peterson All right. So what? Yes.'",
        "'speaker_4': 'Strauss Yes.'",
        "'speaker_1': 'HERBOLD Yes. Suarez, I. Lewis. Yes President Gonzalez high nine in favor nine opposed.'"
    ],
    "AN ORDINANCE relating to surveillance technology implementation; authorizing approval of uses and accepting the surveillance impact report for the Seattle Fire Departments use of Computer Aided Dispatch.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Okay. Item six Will the clerk please read item six into the record? Agenda item 6120003 Relating to surveillance technology implementation, optimizing approval of uses and accepting the Surveillance Impact Report for the Seattle Fire Department's Use of'",
        "'speaker_0': 'Computer Aided Dispatch. The committee recommends the bill passed as amended. Thank you so much. Customer repeater, so many. And this one back to you.'",
        "'speaker_5': 'Thank you. Council president and colleagues, as I mentioned before, this is Council Bill 120003, which is for the fire department. Their technology specifically, they're 911 computer aided dispatch and thanks. Thank you to Councilmember Herbold, who I think will be speaking to her amendment shortly.'",
        "'speaker_5': 'It's a friendly amendment. It was based on Q&A during our committee with the fire department. And this technology is is pretty basic. And it's something they already use and it's just something that falls within the definition of potential surveillance.'",
        "'speaker_5': 'But it's again, it's just their name on computer aided dispatch. So happy to answer questions and support Councilmember Herbert's amendment.'",
        "'speaker_0': 'Great. Thank you so much. I'm going to go ahead and hand it over to Councilmember Herbold to make her motion for consideration and discussion of Amendment One.'",
        "'speaker_2': 'Thank you. I move to amend Council Bill 12 0003 as presented on Amendment.'",
        "'speaker_0': 'One on the agenda. Is there a second?'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded to amend the bill as presented on Amendment One. Councilmember Herbold, I'm going to hand it back over to you to walk us through the amendment.'",
        "'speaker_2': 'Thank you. Chair Peterson did a nice job of.'",
        "'speaker_0': 'Explaining.'",
        "'speaker_2': 'What this amendment.'",
        "'speaker_0': 'Would do in a way.'",
        "'speaker_2': 'That's a heck of a lot more simple than I did this morning. It is really just that simple is simple. As Chair Peterson described it, it would.'",
        "'speaker_0': 'Ask.'",
        "'speaker_2': 'The fire department to look into whether or not an additional layer of security could be included as as part of access being granted to an account to, you know, again, to enhance the.'",
        "'speaker_0': 'Security and prevent somebody.'",
        "'speaker_2': 'From logging in, even if they have access to a password. So I don't I don't need to go into all the minutia about two factor authentication or token based authentication unless people want me to. But thank you.'",
        "'speaker_0': 'I think we're I think we're good on the lesson for today. But I appreciate your offer. Are there any additional comments on Amendment One? Now's your time to ask that two factor authentication or whatever it is. All right.'",
        "'speaker_0': 'Looks like nobody's taking taken the bait. So will the clerk please call the role on the adoption of Amendment One?'",
        "'speaker_1': 'Morales. Yes, Mr. Peterson. All right. So what? Yes. Strauss. Yes. Yes.'",
        "'speaker_2': 'Suarez, I.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'President Gonzalez. I favor an unopposed.'",
        "'speaker_0': 'Motion carries the amendment is adopted and we now have an amended bill before the Council. Are there any additional comments on the bill as amended? Hearing? None. Will the clerk please call the roll on the passage of the amended Bill Morales.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Mosqueda, I.'",
        "'speaker_5': 'Peterson Hi.'",
        "'speaker_1': 'So what? Yes. Strauss.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Suarez.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'President Gonzalez I nine in favor. None oppose.'",
        "'speaker_0': 'The bill passes as amended and the chair will sign it. Will the clerk please affix my signature to the legislation on my behalf? Other business. Is there any further business to come before the council? Hearing than colleagues. This does conclude the items of business on today's agenda.'",
        "'speaker_0': 'Our next regularly scheduled city council meeting is on Monday, March 29th, 2021 at 2:00 PM. I hope that you all have a wonderful afternoon. Did you have something to say or were you waving Councilmember Hesburgh? Whereas I was just waiting.'",
        "'speaker_0': 'Okay, we're adjourned.'"
    ]
}