{
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the Superintendent of Parks and Recreation to execute, for and on behalf of the City, a concession agreement granting Fifth Avenue Sports, LLC d/b/a Green Lake Boathouse the right to operate a concession providing boat rental service, and retail and food sales at the Departments facility at Green Lake Park.": [
        "'speaker_7': 'The Report of the Park Seattle Center Libraries and Gender Pay Equity Committee. Agenda Item 24 Council Bill 118487 Relating to the Department of Parks and Recreation authorizing the Superintendent of Parks and Recreation to execute for and on behalf of the city.'",
        "'speaker_7': 'A concession agreement granting Fifth Avenue Sports LLC, DBA, Green Lake Boathouse the right to operate a concession providing boat rental service and retail and food sales at the department's facility at Green Lake Park. The committee recommends a council bill pass.'",
        "'speaker_2': 'Thank you, Councilmember God.'",
        "'speaker_1': 'This is the long term operator of the Green Lake boathouse. A concession agreement between that that long time operator who's been there for many years and who has had great support from the community, they know him. What's been different about lately is that there are so many more different ways to enjoy the lake paddleboarding and boating on'",
        "'speaker_1': 'the lake. And this is an opportunity for people to enjoy one of the most popular parks in Seattle. And we definitely do. Or urge support from the other countries of the Council.'",
        "'speaker_2': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Carol. I look at it. O'BRIEN Hi, Okamoto. Rasmussen So want I picture garden? I am president burgess nine in favor and opposed the bill.'",
        "'speaker_2': 'Passes in the chair will sign it. Item 25 was referred back to committee.'"
    ],
    "A RESOLUTION relating to the Seattle Department of Parks and Recreation; authorizing applications for grant funding assistance to the Washington State Recreation and Conservation Office for Youth Athletics Facilities projects as provided in WAC 286 and subsequent legislative action.": [
        "'speaker_7': 'Item 26 Agenda Item 26 Resolution 31610 relating to the Seattle Department of Parks and Recreation authorizing applications for grant funding assistance to the Washington State Recreation and Conservation Office for Youth Athletic Facilities projects as provided in the WAC 286 and subsequent legislative action.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'The committee recommends the resolution be adopted.'",
        "'speaker_2': 'Thank you, Councilmember Gordon.'",
        "'speaker_1': 'This is a resolution authorizing application for grant funding assistance to the Washington State Recreation and Conservation Office. The grant would be used for youth athletic facilities, projects, and we certainly do endorse approval.'",
        "'speaker_2': 'Thank you. Questions or comments? All in favor of adopting resolution 31610 vote I. I oppose Vote No. The resolution is unanimously adopted. The report of the Planning Land Use and Sustainability Committee. Please read Item 27.'"
    ],
    "A RESOLUTION adopting revised rules for City Council quasi-judicial proceedings, and repealing the previous rules that were adopted by Resolution 31375.": [
        "'speaker_7': 'The Report of the Planning Land Use and Sustainability Committee Agenda Item 27 Resolution 31602 Adopting revised rules for City Council quasi judicial proceedings and repealing the previous rules that were adopted by Resolution 31375. The committee recommends the resolution be adopted.'",
        "'speaker_2': 'Thank you, Councilmember O'Brien.'",
        "'speaker_0': 'Thank you. This is largely a clean up bill. That was the work of the result of Martha Lester, one of our last pieces of work before she left us on the council. She staff the committee on a quasi judicial matter over the past year or so in the process.'",
        "'speaker_0': 'As you may imagine, she notified all sorts of things with our quasi judicial rules that could use them clean up. And she went in there and did that. There are a few areas where it wasn't clear on the unique matter we were staffing how to respond, and so we interpreted during those rules.'",
        "'speaker_0': 'But she made some recommendations on how we cleared that up. And so those are all passed out of committee.'",
        "'speaker_2': 'Thank you. Questions or comments? Those in favor of adopting Resolution 3160 to vote. I oppose Vote No. The resolution is unanimously adopted. The report of the Public Safety, Civil Rights and Technology Committee. Please read item 28.'"
    ],
    "AN ORDINANCE relating to the Seattle Police Department; authorizing the Chief of Police to issue Special Police Officer Commissions to qualified government employees to conduct limited law enforcement duties or to former police officers or parking enforcement officers to conduct traffic control; eliminating the authority to authorize Retired Police Officer Commissions; amending Section 3.28.150, and repealing Sections 3.28.450, 3.28.460, 3.28.470, and 3.28.480 of the Seattle Municipal Code.": [
        "'speaker_7': 'The Report of the Public Safety, Civil Rights and Technology Committee Agenda Item 28 Council Bill 118476 relating to the Seattle Police Department authorizing the Chief of Police to issue Special Police Officer Commissions to qualified government employees to conduct limited law enforcement duties, or to former police officers or parking enforcement officers to conduct traffic control.'",
        "'speaker_7': 'Eliminating the authority to authorize retired police officer commissions. Amending Section 3.28150 and repealing Sections 3.28.4 or 50.460.470 and 0.480 of the Seattle Municipal Code. The committee recommends the Council bill pass.'",
        "'speaker_2': 'Thank you, Councilmember Harrell.'",
        "'speaker_4': 'Thank you very much. So this is an ordinance that modifies the portion of our code that deals with special commissions and retired police officer commissions. So currently, the code authorizes the chief police to commission persons engaged in private security employment to assist the police department in enforcing the laws.'",
        "'speaker_4': 'However, Speedy does not issue the Special Police Officer commissions to persons engaged in security work. And as such, this kind of work is regulated under the RTW Chapter 18 170. So we now recognize the City of Seattle has a need for qualified persons with limited law enforcement authority to assist the police department where appropriate.'",
        "'speaker_4': 'And the city of Seattle has a need for qualified person to conduct traffic control. So currently, to explain the sort of the current situation, a retired officer with the retired police officer commission has the same authority as an active police officer.'",
        "'speaker_4': 'He or she may wear his or her Seattle Police Department uniform. They may carry a weapon. However, this retired officer with a retired police officer commission is not considered an employee. They have no assigned supervisor. They're not required to have an ongoing training as required by the settlement agreement.'",
        "'speaker_4': 'As an example, they're not readily identifiable to public. From from there, not publicly listing from active duty police officers and are not subject to the discipline for violations of the Seattle Police Department policies or city policy. So for these reasons, the department and the executive and the Council hopefully believed it appropriate to amend this section to grant'",
        "'speaker_4': 'the Chief of Police Authority to issue these types of commissions that grant limited law enforcement authority to certain qualified city employees or grant very limited law enforcement authority to conduct traffic control to these retired commission police officers and parking enforcement officers.'",
        "'speaker_4': 'So this council bill appropriately repeals the older sections 328450 through 328480 to eliminate the category of retired police officer commissions. So again, the problem we are solving with this legislation that are that we are ensuring that people who get special commissions only get the type of commission that they will need to do the work that they are'",
        "'speaker_4': 'in fact doing. In addition, Council Bill 118476 will narrow the focus on and the scope on who gets special commissions. This legislation again, again, is about narrowing the amount of work that is done and is about focusing or assisting the police department and the city as opposed to helping one individual in their employment situation.'",
        "'speaker_4': 'I'll sort of close by saying there's no fiscal implications with this legislation. And on August 19th, the Public Safety, Civil Rights and Technology Committee unanimously voted. This legislation passed. Thank you very.'",
        "'speaker_2': 'Much. Thank you. Questions or comments? Please call the roll and the passage of the bill.'",
        "'speaker_3': 'Harrell, I, Carter O'Brien, Okamoto Rasmussen, Sergeant Bagshaw, Gordon High and President Burgess nine and favorite and opposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read item 29.'"
    ],
    "An ORDINANCE related to the Citys Emergency Management Program; adding Sections 10.02.045 and 10.02.047 to the Seattle Municipal Code (SMC) to refine the roles and responsibilities of the Office of Emergency Management; and amending Sections 10.02.050, 10.02.060, 10.02.070, 10.02.080, 10.02.090, 10.02.100, and 10.02.110 of the SMC to accommodate these refinements.": [
        "'speaker_7': 'Agenda Item 29 Council Bill 118483 related to the city's emergency management program, adding sections 10.0 2.045 and 10.0 2.047 to the Seattle Municipal Code to refine the roles and responsibilities of the Office of Emergency Management Management and amending sections 10.0 2.050 through 10.0 2.110 of the Seattle Ms..'",
        "'speaker_7': 'Code. To accommodate these refinements, the Committee recommends the Council bill pass.'",
        "'speaker_2': 'Thank you, Councilmember Harrell.'",
        "'speaker_4': 'Thank you very much. So the city's emergency management program has evolved in the last ten years from primarily first responder focused program to what can be only described now as a full fledged whole community program, including the roles, responsibilities, training and practice for nearly all city departments and dozens of community partners.'",
        "'speaker_4': 'So the Seattle Municipal Cole chapter describing this program as enacted in the seventies, with only minor departmental name change in the last 15 years and really no longer reflects the strength and breadth of our current program. And so since that time, national standards for emergency management accreditation have been developed.'",
        "'speaker_4': 'And so the suggested revisions are more in line with the national standards and the substantive changes. Substantive changes can really be categorized in four areas. Number one, the new OEM director will be appoint an appointed position as it is now.'",
        "'speaker_4': 'The OEM director will oversee an established program. The program abides by an incident command system, and the mayor's emergency executive board will act as the policy oversight body during these extenuating circumstances. And the current code is basically silent on these issues.'",
        "'speaker_4': 'Ten years ago, when the current OEM director was appointed, this appointment was not subject to council confirmation. And just by way of context, context, the director technically reports to the Chief of police, but in practice this OEM director is a captain position reports also to the mayor.'",
        "'speaker_4': 'So six different chiefs of police and the current OEM deck director has served under all strike that have all been supportive of this kind of arrangement. This legislation establishes the Office of Emergency Management. However, the office will remain a division within the police department unless the Mayor wishes to move it, which is currently under charters within the'",
        "'speaker_4': 'mayor's discretion. Again, on August 9th, on August 19th, the Public Safety, Civil Rights and Technology Committee made a recommendation, passed this legislation. I ask for your support.'",
        "'speaker_2': 'Questions or comments. Please call the role on the passage of the bill.'",
        "'speaker_3': 'Harrell I Lakota High O'Brien, Okamoto Rasmussen, Sergeant Bagshot Gordon and President Burgess. Hi nine in favor and opposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read items through th4.'"
    ],
    "AN ORDINANCE relating to Historic Districts; adding a new Chapter 25.30 to the Seattle Municipal Code (SMC); creating the Sand Point Naval Air Station Landmark District; specifying the districts boundaries; adopting criteria for designating the district; establishing a procedure for preserving significant physical elements within the district; establishing the Sand Point Naval Air Station Landmark District Application Review Committee; providing for administration and enforcement of this Ordinance; and amending Section 22.900C.010 and Table C-1 for Section 22.900C.010 of the SMC to provide for the collection of fees for interpretation of Historic District regulations by the Department of Neighborhoods.": [
        "'speaker_7': 'The Report of the Seattle Public Utilities and Neighborhoods Committee Agenda Item 35 Council Bill 118438 Relating to historic districts. Adding a new chapter to 5.30 to the Seattle Municipal Code, creating the Sandpoint Naval Air Station Landmark District, specifying the District's boundaries.'",
        "'speaker_7': 'Abutting criteria for designating the district. Establishing a procedure for preserving significant physical elements within the District. Establishing the Sandpoint Naval Air Station Landmark District Application Review Committee. Providing for administration and enforcement of this ordinance and amending Sections two 2.900 C .1010.'",
        "'speaker_7': 'And Table C, dash one for section 2.900 C .010 of the Seattle Municipal Code to provide for the collection of fees for interpretation of historic district regulations regulations by the Department of Neighborhoods. The committee recommends a council bill pass as amended.'",
        "'speaker_2': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_1': 'Thank you, and thank you for reading that so nicely. This bill designates an area within Magnuson Park as the Sandpoint Naval Air Station Landmark District, and it adopts a procedure for preserving various physical elements within the park. And I specifically want to say thank you to Lynne Ferguson.'",
        "'speaker_1': 'You mentioned our two met to people mentioned earlier today during public testimony, Randy Williams and Jordan Bader. The great work that Lyn Ferguson in particular has done. And I do want to personally recognize her and others. The Sandpoint Naval Air Station Landmark District recognizes the importance of this historic Sandpoint Naval Air Station, and it was designated as'",
        "'speaker_1': 'a national historic district in 2010 and designated a local historic district by our Landmarks Board in 2011. And by us adopting this newest landmark district, we are taking the final step in creating the district. And I do again want to recognize so many people who are involved in this, including Councilmember Gordon.'",
        "'speaker_1': 'Thank you for coming to the committee and talking about it and the number of people from the Friends of Sandpoint, Magnuson Park historic district that have done so much work. And we encourage passage of this legislation which was unanimously recommended out of our committee.'",
        "'speaker_2': 'Thank you. Questions or comments? Councilmember Rasmussen. Thank you.'",
        "'speaker_0': 'This was one of the first issues I worked on when I became a legislative assistant.'",
        "'speaker_2': 'Many decades.'",
        "'speaker_0': 'Ago now. And the designation of.'",
        "'speaker_4': 'The district is really historic. It's been sought after by the neighbors in the community for many, many years. The neighborhood is really active, the particularly the various neighborhood of out of the east and strongly advocated for the historic preservation of the Sandpoint Naval Base.'",
        "'speaker_4': 'And what is remarkable today is that the community supports this.'",
        "'speaker_0': 'Designation and all the incentives and.'",
        "'speaker_4': 'Controls.'",
        "'speaker_0': 'Particularly given its contentious and.'",
        "'speaker_4': 'At times very.'",
        "'speaker_0': 'Protracted controversies that have arisen between the city and the neighborhood.'",
        "'speaker_2': 'Rusty Williams It was great to see him here appropriately mentioned.'",
        "'speaker_0': 'Lynne Ferguson But also I do think we have to remember.'",
        "'speaker_4': 'The work that former City Councilmember Jeannette Williams did. It was one of the key.'",
        "'speaker_0': 'Issues that she worked on during her time on the city council, preserving.'",
        "'speaker_4': 'The Sandpoint Naval Air Base, the magnificent park.'",
        "'speaker_0': 'And then her neighbor, who often isn't mentioned, but she was really an active partner with Jeannette on this.'",
        "'speaker_4': 'Was was Dorothy McCormick who McCormick who.'",
        "'speaker_2': 'Became an assistant to former Mayor.'",
        "'speaker_4': 'Royer.'",
        "'speaker_0': 'So it's my hope that this designation will spur restoration.'",
        "'speaker_4': 'And renovation and re-use of some of the other buildings on the.'",
        "'speaker_0': 'Site, including the fire station Building 18, which is in very poor condition right now. Thank you.'",
        "'speaker_1': 'Councilmember Gordon I just want to say that I'm certainly appreciative of all the work, all the hard work that's gone into this has taken many years to get this far. And we certainly do need to thank Lynne Ferguson, folks in her committee.'",
        "'speaker_1': 'We need to think a lot of the neighbors around the area and I might say that just as a little historical footnote, it was the first place that my father was stationed at when I came to the city and which brought me here.'",
        "'speaker_1': 'So it means a great deal to me personally as well. And I want to thank everyone who worked so hard on it. It's really great to see it finally coming to fruition.'",
        "'speaker_2': 'Thank you. Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Harrell I look at it. Right. O'Brien Hi, Okamoto. Rasmussen All right. So want back show? Hi, Gordon. Hi. Now, President Burgess. Nine in favor, nine opposed.'",
        "'speaker_2': 'Bill passes and the chair will sign it. Please read item 36.'"
    ],
    "AN ORDINANCE relating to the Landmark Preservation Board; amending Section 25.12.270 of the Seattle Municipal Code to change the qualifications for members of the Board, and making technical corrections.": [
        "'speaker_7': 'Agenda Item 36 Council Bill 118468. Relating to the Landmark Preservation Board amending section 25.12.270 of the Seattle Municipal Code to change the qualifications for members of the board and making technical corrections. The committee recommends a council bill pass.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Councilmember Bagshaw Thank you very much. This piece of legislation actually amends the qualification for members of the Landmarks Preservation Board. To date, we currently require a representative from the City Planning Commission to attend and be part of the Preservation Board.'",
        "'speaker_1': 'And the City Planning Commission actually raised their hand and said, we've got a lot to do. And rather than having members of the Planning Commission be part of this, the Landmarks Preservation Board members are suggesting that the volunteer be changed to recruit a member of the instead of the planning commission, but somebody who's got the similar kind'",
        "'speaker_1': 'of experience. So that's the recommendation and the legislation passed unanimously out of the committee. And we ask for your support.'",
        "'speaker_2': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Harold. All right. Look at it. Hi. O'Brien, Okamoto. Rasmussen. All right, sir. Want back shot? I got it. I am President Burgess nine in favor and opposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read item 37.'"
    ],
    "AN ORDINANCE relating to the Cedar River Municipal Watershed and amending the Secondary Use Policies, adopted by Ordinance 114632, to provide for the limited application of the herbicide Imazapyr to treat invasive knotweed species.": [
        "'speaker_7': 'Agenda Item 37 Council Bill 118481 relating to the Cedar River Municipal Watershed and amending the secondary use policies adopted by ordinance 114632 to provide for the limited application of the herbicide and Wmas appear to treat invasive knotweed spray species.'",
        "'speaker_7': 'The committee recommends a council bill passed.'",
        "'speaker_2': 'Councilmember Bagshaw.'",
        "'speaker_1': 'Thank you. Councilmember Liccardo, do you want to present your amendments? And I will support them and then I can speak to the amended legislation.'",
        "'speaker_5': 'Councilmember Liccardo Thank you, Customer Bagshaw And thank you for your work on this ordinance. I have two amendments and I'll read both of them. The First Amendment is I moved to amend the Council Bill 11 8481 with attachment one at page six, third paragraph, third sentence by the reading between early August and mid-September and adding a new'",
        "'speaker_5': 'fourth sentence entitled Prior to application. Visual inspection is made to verify that the plants are one in the pre bud stage at the time of the application and two are not actively being worked by pollinators and is conductive to such activity as the First Amendment.'",
        "'speaker_5': 'The Second Amendment. I move to amend Council Bill 11 8481, Section one, the second to last sentence by substituting a sentence with the following sentence. Seattle Public Utilities will provide Seattle Public Utilities and Neighborhoods a committee of the City Council, an annual report on the Knotweed treatment program in the Cedar River municipal watershed, summarizing the effectiveness of'",
        "'speaker_5': 'the Knotweed treatment program. Evaluating the long term financial and environmental implications for knotweed control beyond 2018. Evaluating the water quality monitoring results. Summarizing the latest available science on the environment and human health effects of IMA Zapper and describing any plans for the future application of a zebra within the watershed, including maps of proposed treatment areas.'",
        "'speaker_5': 'Estimated quantities of IMA zapper. I'm really destroying this name. Sorry. To be applied. The application methods and schedules and plans for water quality monitoring in front of each of our deaths is the actual wording in red to strike out in blue is the substitute and I'll address both amendments after the second.'",
        "'speaker_5': 'Secondly, these amendments came forward by those in the Washington Beekeepers Association, and they pointed out that the legislation could be improved by making sure that the guidelines provided were consistent with the guidelines provided by the Washington State Noxious Weeds Department.'",
        "'speaker_5': 'And that. By codifying them, we assure that we bring forward in the future that we do not fall back on practices that may fall through the cracks and therefore result in harming the population and the ability to pollinate plants in this area.'",
        "'speaker_5': 'I want to thank the citizens who are beekeepers, including our former mayor, Wes Allman, for participating in a activity that hasn't really been given much, I suppose attention but critical to the sustaining our agriculture that provides many of our food sources.'",
        "'speaker_5': 'So I'll leave sit at that.'",
        "'speaker_2': 'So the First Amendment is Mark Amendment number one. Are there any further questions or comments about this amendment? Those in favor of passing amendment number one, vote I. I oppose vote no. The amendment is adopted. Amendment number two is before us.'",
        "'speaker_2': 'Any questions or comments?'",
        "'speaker_1': 'One quick, quick comment and that we don't have line numbers on this one, but there's a specific reference to the Seattle Public Utilities and Neighborhoods Committee. And there's the intention of this amendment is to bring back regular reports.'",
        "'speaker_1': 'I would recommend and suggest that we have Seattle Public Utilities and Neighborhood Committee or its successor.'",
        "'speaker_5': 'Yeah, I that's a friendly amendment to the amendment because I caught that as I was reading it. And that's the language that we should be included that's accepted.'",
        "'speaker_2': 'And we'll we'll make that part of the amendment. Any further comments or questions? All in favor of adopting amendment number two, vote I.'",
        "'speaker_0': 'By a plebiscite. Vote No.'",
        "'speaker_2': 'Amendment number two is adopted. We now have the ordinance as amended in front of us.'",
        "'speaker_1': 'So just to speak quickly to this ordinance, it provides for the continued application of this herbicide. And the purpose of this is to abate the invasive knotweed that's found in the Cedar River watershed. And we've tried to do a lot of things.'",
        "'speaker_1': 'We first started off by injecting amounts up here into the plants. We tried light starvation by putting black plastic over it. And it really is an annoying weed that was brought here, unfortunately, years ago because somebody thought it looked great.'",
        "'speaker_1': 'But it's been taking over and taking over around the watershed, which provides the native species, provide the kind of of tenacity to hold the banks together. But the knotweed has proven not only to take over for the natives, but then also begins to diminish the water and the water quality and especially along the Cedar River.'",
        "'speaker_1': 'It's important because that's where we get our drinking water. We, the council, have twice approved the use of a mouse up here along the Cedar River. This legislation will allow it to continue through 2018. And I do want to recognize the beekeepers concerns.'",
        "'speaker_1': 'Seattle Public Utilities has reassured me that they are well aware of this, that they do not apply the mouse up here during flowering. They do the visual inspections. But as Councilmember Licata pointed out, this is good to have it clarified in our ordinance.'",
        "'speaker_1': 'So I certainly support the amendments as proposed.'",
        "'speaker_2': 'Any other. Councilmember O'Brien.'",
        "'speaker_0': 'Yeah. Just briefly comment. I. It's really disappointing, frankly, that we're at a point where we're applying pesticides within the watershed. And but for me, this is an issue that was important when I was chairing the committee a few years ago.'",
        "'speaker_0': 'And the threat of this invasive species in the watershed is so dire that I think it definitely justifies and warrants the steps we're taking. This knotweed has proved to be very hard to get a handle on as it's taken a number of years longer than we had hoped to eradicate it from the watershed.'",
        "'speaker_0': 'Based on my reading, it sounds like there's about 18 acres of it scattered throughout the watershed, and my hope is that we don't have to keep renewing this. I appreciate that the pesticide or the sorry, the herbicide that's being used has been studied.'",
        "'speaker_0': 'And has the study seemed to indicate that it has low impacts? I'm always skeptical of those studies and I would just much rather have the knotweed be gone and eliminate pesticides, herbicides completely from the watershed. I fully support this moving forward and I just hope that in the next couple of years we'll get to a point where'",
        "'speaker_0': 'we've eradicated knotweed from the Cedar River watershed.'",
        "'speaker_2': 'Please call the role on the passage of the bill.'",
        "'speaker_3': 'Harrow. McCarter, I. O'Brien, I. Okamoto. Rasmussen. I want.'",
        "'speaker_1': 'Bagshot.'",
        "'speaker_3': 'Garden and President Burgess. Nine. In favor and unopposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read item 38.'"
    ],
    "AN ORDINANCE relating to the Cedar River Watershed; authorizing five years of ecological thinning, in accordance with the Cedar River Watershed Habitat Conservation Plan, in Sections 15, 16, 21 and 22, Township 22, North, Range 7, East, W.M., Sections 8 and 9, Township 22, North, Range 8, East, W.M., Sections 2 and 11, Township 21, North, Range 9, East, W.M.; Sections 34 and 35, Township 22, North, Range 9, East, W.M., Sections 3, 4 and 10, Township 21, North, Range 10, East, W.M., and Sections 32 and 33, Township 22, North, Range 10, East, W.M.; declaring the logs resulting from ecological thinning to be surplus to the Citys needs; authorizing the sale of such logs pursuant to applicable City contracting and surplus property sale procedures; and directing deposit of the proceeds therefrom to the Water Fund for the purposes of the Habitat Conservation Plan implementation.": [
        "'speaker_7': 'Agenda Item 38 Council Bill 118484 relating to the Cedar River watershed authorizing five years of ecological thinning in accordance with the Cedar River Watershed Habitat Conservation Plan and sections 15, 16, 21 and 22. Township 22, North Range seven, East W.M. Sections eight and nine, township 22, North Range eight, East W M Sections two and 11.'",
        "'speaker_7': 'Township 21, North Range nine East W.M. Sections 34 and 35. Township 22, North Range nine East W.M. Sections three, four and ten. Township 21, North Range ten, East W.M. and sections 32 and 33. Township 22, North Range ten East W m declaring the logs resulting from the ecological thinning to be surplus to the city's needs, authorizing the'",
        "'speaker_7': 'sale of such logs pursuant to applicable city contracting and surplus property sale procedures and directing deposit of the proceeds therefrom to the Water Fund. For the purposes of the Habitat Conservation Plan implementation, the committee recommends a Council bill pass.'",
        "'speaker_2': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_1': 'Thank you. This ordinance will authorize Seattle Public Utilities to enter into a contract for five years of forest thinning projects. And these do have ecological benefits in our Cedar River habitat as part of the conservation plan. It authorizes the sale of surplus logs that result from the ecological thinning.'",
        "'speaker_1': 'I actually went out and looked at the site. The thinning activities are really small in comparison to what I think some people were concerned about. We're not going in and taking out old growth. It ultimately helps us with the water quality and the timber revenues are not that significant.'",
        "'speaker_1': 'They thin the the the forest generally with some things that are smaller in size, but then it'll result in about $40,000, which will be deposited in the water fund to offset the costs of implementing the plan. The design is to improve forest health.'",
        "'speaker_1': 'It also will decrease forest fires possibilities and it is consistent with our habitat management practice and we recommend approval.'",
        "'speaker_2': 'Thank you. Questions or comments? This is item 38, correct?'",
        "'speaker_1': 'Correct.'",
        "'speaker_2': 'Please call the rule on the passage of the bill.'",
        "'speaker_3': 'Harrell I look at it. I o'brien. I, okamoto. Rasmussen I so want I shot.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Got in I am president Burgess high nine and favorite on the post.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read item 39 to the first semicolon.'"
    ],
    "AN ORDINANCE relating to the management of the South Fork Tolt River Municipal Watershed; authorizing ecological forest thinning projects in accordance with the South Fork Tolt River Watershed Management Plan in Sections 25, 26, 27, 29, 30, 32, 33, 34, and 35, Township 26 North, Range 9 East, W.M.; declaring the logs resulting from said projects to be surplus to the Citys needs; authorizing the sale of such logs pursuant to applicable City contracting and surplus property sale procedures; and directing use of the proceeds therefrom to fund Plan implementation.": [
        "'speaker_7': 'Agenda Item 39 Council Bill 118485 relating to the management of the South Fork River Municipal Watershed.'",
        "'speaker_2': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_1': 'Thank you. This is almost exactly like the previous bit of legislation, although it applies to the South told River. The ordinance again is designed to authorize force thinning projects. For the ecological benefits, it's a five year contract. Timber revenues again are about $40,000 and would be deposited in the water fund.'",
        "'speaker_1': 'And the committee recommends that this contract as well be approved. And unanimously it came out of our committee.'",
        "'speaker_2': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_3': 'Harrell McCotter. By O'Brien Okamoto. By Rasmussen Sergeant.'",
        "'speaker_1': 'Bagshaw.'",
        "'speaker_3': 'Gordon. I am President Burgess. Nine in favor and unopposed.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Please read item 40 through the first semicolon.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; declaring certain real property rights relating to a sewer facility easement within a portion of property located at 14027 Lake City Way NE as being surplus to the Citys utility needs; authorizing the Director of Seattle Public Utilities to relinquish such easement rights and accept a new easement granted from 14027 Lake City Investors, LLC for a City-owned sanitary sewer facility; and ratifying and confirming certain prior acts.": [
        "'speaker_7': 'Agenda Item 40 Council Bill 118486 relating to Seattle Public Utilities declaring certain real property rights relating to a sewer facility easement. Within a portion of property located at 14027 Lake City, way northeast, as being surplus to the city's utility needs.'",
        "'speaker_2': 'Thank you, Councilmember Bagshaw.'",
        "'speaker_1': 'Thank you. This legislation authorizes Seattle Public Utilities to relinquish rights to an existing easement at the Bella Largo Apartments in Lake City neighborhood and then turns around and authorizes the director to accept a new easement that will be granted from the owner of these apartments.'",
        "'speaker_1': 'Lake City Investors for a city owned sanitary sewer facility. The property owner will use and develop a new mixed use building for both residential and retail use. The new building will require a larger sanitary sewer connection than the one that currently exists.'",
        "'speaker_1': 'Hence the reason that we're providing a new easement and the agreement meets the needs of both parties and the legislation passed unanimously out of the committee. And we ask for your support.'",
        "'speaker_2': 'Thank you. And questions or comments. Please call the roll on the passage of the bill.'",
        "'speaker_3': 'Harold Licata. I O'Brien. Okamoto, I Rasmussen. I so want Bagshot Garden. I am President Burgess High nine in favor.'",
        "'speaker_2': 'An unopposed bill passes and the chair will sign it. The report to the full council item one on our agenda please read resolution 31613 Excuse me.'"
    ],
    "A RESOLUTION creating the Demographic Data Task Force to recommend strategies to standardize and disaggregate demographic data used by City departments in allocating resources and developing City policies, programs, and services.": [
        "'speaker_7': 'The report of the full council agenda item one Resolution 31613 Creating the Demographic Data Task Force to recommend strategies to standardize and disaggregate demographic data used by city departments in allocating resources and developing city policies, programs and services.'",
        "'speaker_7': 'Introduced September eight, 2015.'",
        "'speaker_2': 'Thank you. Councilmember O'Brien. Excuse me, Okamoto.'",
        "'speaker_0': 'Thank you. It's getting to be a long day here. Yes, we always have it. Yes, yes. So have you. As you have heard me speak in the past about data, disaggregation and the importance of it. As the city becomes more and more diverse, we're finding new populations moving into our city, populations that have service needs but unfortunately'",
        "'speaker_0': 'are often invisible by government and the services we provide. For example, federal and city race data both for diverse immigrant and refugee communities from Europe, the Middle East and North Africa into the white category. Those from other parts of Africa into the black category, and immigrants and refugees from more than 25 unique countries and cultures into the'",
        "'speaker_0': 'Asian American and Pacific Islander category. The reality is, though, as we lump these different, diverse refugee and immigrant groups into these larger categories, we often miss their their unique needs that they have because their data and their needs are masked within these larger groups.'",
        "'speaker_0': 'I convened a group of data managers from several departments with the support of the Mayor, and in our discussion we determined that data is collected and analyzed in different ways across different departments. Some departments use federal data, which is often our data or has a high margin of error.'",
        "'speaker_0': 'In other cases, departments just captured data on populations they serve, but not on populations that they should be serving but aren't being collected. This resolution today takes a step forward on what we've learned. And basically, in a nutshell, it creates a task force made up of data managers from departments and offices across the city to find ways'",
        "'speaker_0': 'to standardize and just aggregate data and make it easily accessible for policymakers and make major administrative decisions when it relates to our services and allocation of resources. This task force will will come back to the City Council and make recommendations on what's needed to, again, both standardize and desegregate data so that we aren't missing high risk populations'",
        "'speaker_0': 'that need our services. I urge you to support this resolution.'",
        "'speaker_2': 'Thank you. Questions or comments? All in favor of adopting Resolution 31613 vote. I oppose Vote No. The resolution is unanimously adopted and the chair will sign it. The last item on our agenda today is consideration of an administrative appeal.'",
        "'speaker_2': 'The City Council will now consider an administrative appeal to an exclusion issued to an individual on August 13, 2015. The question before the Council is whether the decision to exclude this individual from council meetings for a period of 20 days should be sustained.'",
        "'speaker_2': 'Those in favor of sustaining the exclusion will vote, ie. Those opposed to sustaining the exclusion will vote no on August 13, 2015. Marguerite Richard was served with an exclusion notice. At the full council meeting on Monday, August three, 2015, the presiding officer repeatedly directed Ms. Richards to end her comments at the expiration of the allotted time.'",
        "'speaker_2': 'Ms. Richards ignored those directions and continued to shout from the podium and it became necessary for the Presiding Officer to request the assistance of our security officers to remove her from council chambers. On Tuesday, August four, 2015, at the park's Seattle Center Libraries and Gender Pay Equity Committee.'",
        "'speaker_2': 'Ms.. Richards engaged in similar behavior and continued to shout from the audience for several minutes after the expiration of her allotted public comment time. She ignored repeated requests from the presiding officer to stop this behavior and again was escorted from the chambers on Tuesday, August 11, 2015, at the Seattle Public Utilities and Neighborhoods Committee meeting.'",
        "'speaker_2': 'Ms.. Richards engaged in similar disruptive behavior by talking past her allotted time and then disregarding repeated directions to end her disruption, leading the presiding officer to request that she be escorted from the chambers. The same behavior was repeated at the Finance and Culture Committee meeting on Wednesday, August 12, 2015.'",
        "'speaker_2': 'Are there any questions or comments from council members? Those in favor of sustaining the exclusion vote by those opposed to sustaining the exclusion vote no. The motion carries and the exclusion remains in effect. Is there any other business to come before the council?'",
        "'speaker_2': 'Thank you. We are adjourned.'"
    ]
}