{
    "A RESOLUTION recognizing the importance of our healthcare workers; supporting the unionized workers of SEIU Healthcare 1199 NW exercising their right to strike and withhold their labor.": [
        "'speaker_1': 'Three part of the City Council. Agenda Item one Resolution 31917. Recognizing the importance of our health care workers supporting the unionized workers of SEIU Healthcare 1189 Northwest exercising their right to strike and withhold their labor.'",
        "'speaker_0': 'Cast member back.'",
        "'speaker_4': 'Shop. Thank you very much. And colleagues, thank you for voting with me on this resolution. It's recognizing the importance of all of our health care workers and supporting the unionized workers of SEIU Health Care 1199 Northwest to exercise their right to strike and withhold their labor.'",
        "'speaker_4': 'Clearly, these health care workers don't want to be doing that. We know their hearts. We and for those of you who are in the audience, I just want you to know how much we appreciate you. I think that Alison Eisinger from my office is over there.'",
        "'speaker_4': 'And. Yes. Alison McClain, thank you. Alison Wright, my legislative aide, who I think I ought to know by now, thank you for being here and for bringing this forward. And I am not blowing any secrets. You've been so honorable about this.'",
        "'speaker_4': 'Alison's baby was born at only 26 weeks. His name is Aiden. Right? And Aiden is in the hospital right now at Swedish. And we are doing everything. The family is doing everything that they can to take care of that little boy and they need the nurses.'",
        "'speaker_4': 'So I am honored to bring forward this resolution and just let people know that this is about safety for patients and workers. It's about wages and benefits. Yes. But mostly it's about the respect that they need and deserve.'",
        "'speaker_4': 'And we need these vacancies filled and we need to take care of Aiden. So I ask to pass this resolution.'",
        "'speaker_0': 'Thank you, Councilman Baxter, and thank you for bringing this forward. Any comments, questions or comments from any of our colleagues, council members who want.'",
        "'speaker_7': 'Thank you, President Howell. I needless to say, as an elected representative, working people and also as a rank and file teachers union member myself, I strongly support this resolution and I'm in complete solidarity with SEIU 1199 Northwest and all the healthcare workers they represent over the last several months.'",
        "'speaker_7': 'My staff and I and many of the community supporters, we have all marched with Swedish Providence workers and learned about their struggles. We've learned about the chronic short staffing that got to move back or to mention that endangers vote patient safety, and about the health care workers who are in jeopardy of losing their own health care benefits'",
        "'speaker_7': 'because Swedish providence wants to cut them. That's the irony we're facing here. It's outrageous that the health care system that operates 14 hospitals, hundreds of ambulatory care sites, and that generates $7.6 billion and pays its top 15 executives $41 million should treat its workers and our communities with such a cavalier attitude.'",
        "'speaker_7': 'Swedish Province's Profits Before Patients and caregivers attitude is precisely why we need to urgently fight for Medicare for All in this country. We need to put patients before profits. And if healthcare workers must strike and are forced to strike for a decent contract, it is entirely because of the failure of the Swedish Providence executives to support workers'",
        "'speaker_7': 'and patients. And if Swedish forces healthcare workers to strike, then socialist alternative. And I will be on the picket lines and I have no doubt many community members will be in support of you. And just very quickly, on a personal note, this whole campaign, you know, the reelection campaign that was so, you know, massively attacked by the'",
        "'speaker_7': 'Seattle Times editorial board, all the corporate elite of the city, Amazon among them. It took a real toll on all the campaign activists, including myself. And the day after election night, my health just and I'm and I don't usually share personal stuff, but I'm sharing this because it's relevant here, really.'",
        "'speaker_7': 'It's like my body got the memo that it's okay to fall sick. And I ended up in urgent care several times in the just in 15 days. And and it's when you are truly vulnerable and you end up in a health care facility and you see the dedication and just incredible caring with which the health health care'",
        "'speaker_7': 'providers address your needs and the needs of everybody who there all the patients who are there. It's really palpable why we should all be standing with our health care workers. And so I'm proud to be standing with you.'",
        "'speaker_0': 'Thank you. Councilmember Swan. Councilmember Mosquito.'",
        "'speaker_1': 'Thank you, Mr. President. Today, I'm honored to be standing in solidarity with the 1199 workers from SEIU Healthcare Northwest. Today, I'm honored to be standing with them in their call for a contract that respects the work that they do every single day, the care that they put into caring for their patients and our community.'",
        "'speaker_1': 'It will come as no surprise that I stand in solidarity with these workers as a long time labor activist and union member. But today, it's personal. Today I stand here with Camila, my daughter, who is healthy today because of the workers at SEIU 1199, the workers who helped to make sure that in the first three days of'",
        "'speaker_1': 'her life they were there 24 seven. It's those workers who came in every few hours to check her vitals to make sure that she was healthy. Who got the poop out of her lungs when she came out to make sure that she was breathing and to make sure that she was weighed and that she was clean and'",
        "'speaker_1': 'that we felt cared for. It's the workers in the delivery room, in the triage room. It's the folks who clean the room every day. It's the people who came in every single day from the people who take out the trash to the ones who are making sure that all the stitches are put in there.'",
        "'speaker_1': 'Right. Those are the folks who make us healthy. The workers. SEIU 1199, Health Care Northwest workers. Those are the folks who made us healthy. It wasn't the broken elevator that didn't work. And to our post triage area. It wasn't the light that wouldn't turn on when we needed the post delivery services.'",
        "'speaker_1': 'And it wasn't the hot water that didn't work in my sink that made it a great experience. It was the workers. When you're sitting on $23 billion in revenue. $11.3 billion in cash reserves. $780 million in profit. And an $11.5 million in compensation for the CEO.'",
        "'speaker_1': 'You would think that those things would be cared for. The elevator, the light, the hot water. But my God, we need our workers taken care of. When you are sitting on that much revenue, it is the workers who make that place function and make our community safe.'",
        "'speaker_1': 'So do it for the folks that we've heard about every single day. Do it for the workers who talk about not being able to afford to live in the city anymore because they don't get the compensation. Like I heard about the people who talk about crying on the way to work every day because their schedules are getting'",
        "'speaker_1': 'messed with the ratios, the nurse, the patient ratios that haven't been adequately staffed and the the refusal to hear the nurses and the health care team when they say they need more adequate staffing, do it for those folks who say that they used to love coming to work, that all they wanted to do was be a health'",
        "'speaker_1': 'care professional. Do it for them. Do it for folks like me, for mothers like Allison, for the folks who go to the McHugh, do it for the patients that they take care of. Respect your workers. And by respecting your workers, you will respect your community, respect the bargaining process.'",
        "'speaker_1': 'So no one ever has to worry about crossing that picket line because we respect workers and we want that contract to be passed. Now, do it for the workers we honor, usually of 1199.'",
        "'speaker_0': 'Oh. Does anyone dare speak after that? Thank you, Councilmember. Scared. I think we all felt that in the room, in the viewing audience. Okay. I think that would be an appropriate signal for us to vote on this important legislation.'",
        "'speaker_0': 'So I will move to adopt resolution 31917. It's moved. And second, those in favor of adoption of the resolution. Please vote i i those opposed vote no. The motion carries and the chair will sign it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. Please read the next agenda item.'"
    ],
    "AN ORDINANCE relating to City employment; authorizing execution of a collective bargaining agreement between The City of Seattle and the United Association of Journeymen and Apprentices of the Plumbing & Pipe Fitting Industry Local 32; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Agenda item to cancel Bill 119703 relating to city employment. Authorized execution of the collective bargaining agreement between the City of Seattle and the United Association of Journeymen and Apprentices of the Plumbing and Pipe Fitting Industry Local 32 and ratifying confirming certain prior acts.'",
        "'speaker_0': 'Cause my back.'",
        "'speaker_4': 'Show. Thank you very much. This legislation will authorize the execution of a council budget action between the City of Seattle and the United Association of Journeymen and Apprentices of the Plumbing and Pipe Fitting Industry. This Local 32. We'd like to say hello to Leon Guyer.'",
        "'speaker_4': 'The CPA is for a three year period from January 1st, 2019 through December 31st, 2021. It would affect the wages, benefits, hours and other working conditions for approximately 150 employees in three city departments. Seattle Public Utilities, Seattle Department of Transportation and Parks and Recreation.'",
        "'speaker_4': 'It is standard practice to refer this type of legislation from the Seattle Department of Human Resources through our Finance Committee directly to full council for consideration. And we appreciate the opportunity to move this forward today.'",
        "'speaker_0': 'Thank you, Councilmember. Any questions or comments? Okay, I'll move to pass counts bill 119703. Okay. The clerk, please call the rule on the passage of the bill Pacheco.'",
        "'speaker_1': 'I so I beg John Gonzalez verbal. Hi. Suarez, Macheda O'Brien. Hi, President Harrell.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and zero senate. Okay, let me sort of describe what we're going to do with these Select Budget Committee items. I'm going to read them off in groups. We've broken them out into groups, sometimes three or four items, sometimes two or three, and then I'll get a chance to get through it.'"
    ],
    "AN ORDINANCE authorizing, in 2019, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Education and Early Learning, Seattle Police Department, Seattle Department of Transportation, and the Seattle Fire Department, to accept specified grants, private funding, and subsidized loans and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'And then where there might be an amendment or a comment. I'll pause and we'll get through it and hopefully have a package. So we'll do that. So having said that, read the short title for items three and four and just three and four.'",
        "'speaker_1': 'The report of the Select Budget Committee Agenda Items three and four Cancel 119 677. Authorizing 2018 accepting of funding funding from non cities versus committee requirements both House Council Bill 119668 and many Ordinance 125 724, which adopted the 2019 budget, including the 2019 through 2020 for Capital Improvement Programs Committee recommends the bill passes amended.'",
        "'speaker_0': 'Okay, we're going to vote on these individually, starting with number three. Any questions or comments? And again, item number three comes bill 119667. Please call the roll on the passage of the bill Pacheco.'",
        "'speaker_1': 'So what? I beg John Gonzalez. Herbold, I Juarez. Mr. O'Brien. President Harrell. Hi. Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Any questions on a generic number for please call the role on the passage of council bill 119668.'",
        "'speaker_1': 'Pacheco I so want. I beg your. Gonzalez Herbal Juarez. I must get to i. O'Brien i.'",
        "'speaker_0': 'I.'",
        "'speaker_1': '9 a.m. favorite and opposed.'",
        "'speaker_0': 'Bill passed chair of the Senate. So please read items five and six.'",
        "'speaker_1': 'Genomes five and six clerk file 314 436 2020 Proposed Budget Committee recommends that the file be placed on file clerk file 314 437 2023 2025 Proposed Capital Improvement Programs Committee recommends that the file be placed on file.'"
    ],
    "AN ORDINANCE relating to fees and charges for permits and activities of the Seattle Department of Construction and Inspections, related fees by other departments, and technical corrections; amending Sections 3.58.090, 15.04.074, 22.900B.010, 22.900B.020, 22.900C.010, 22.900D.010, 22.900D.070, 22.900D.090, 22.900D.100, 22.900D.110, 22.900D.140, 22.900D.145, 22.900D.150, 22.900D.160, 22.900E.020, 22.900E.030, 22.900E.040, 22.900E.050, 22.900E.060, 22.900F.010 and 22.900G.015 of the Seattle Municipal Code (SMC); and repealing Section 22.900G.080 of the SMC.": [
        "'speaker_0': 'Any comments? Those in favor of placing the kirk file on file please vote i. I opposed vote no. The motion carries and that Kirk file is placed on file to please read item seven through 11. And you could read the short title if you'd like.'",
        "'speaker_1': 'Agenda item seven through 11 Council Vote 119669. Related to the fees and charges for permits and activities of the Seattle Department of Department of Construction and Inspections Committee recommends recommend Seattle Pass Council Bill 11967. An ordinance relating to the Traffic Code Committee recommends a bill passes amended Council Bill 119 671 related to the Department of Parks and'",
        "'speaker_1': 'Recreation establishing in 2019 through 2025. Schedule Committee recommends the Bill Pass Council Bill 119 672 relating to the solid waste system of Seattle Public Utilities Committee recommends the bill passed and Council Bill 119 673 Blaine to Contracting and Deafness Committee recommends the bill pass.'",
        "'speaker_0': 'All right. We're going to start with seven. Any questions or comments? No. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Pacheco I want to thank John Gonzalez Herbold II Suarez. Macheda O'Brien. President Harrell. Hi. Nine in favor.'",
        "'speaker_0': 'Nine opposed to a pass and sure sign it on number eight. Any questions or comments? Please call the rule on the passage of the bill.'",
        "'speaker_1': 'Chico. I want.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'John Gonzalez. Herbold Hi. Suarez Macheda. Hi. O'Brien Hi. President Harrell. I am favorite unopposed.'",
        "'speaker_0': 'Bill passed and chair of the Senate. Yeah. 671 So on number nine, are there any question number nine, please call the rule on the passage of the bill.'",
        "'speaker_1': 'Pacheco I want I beg. Gonzalez Herbal Suarez. Mr. O'Brien. All right. President Harrell.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Nine in favor. Nine oppose.'",
        "'speaker_0': 'This person. Sure. Sign it. I would say that. Confused? Look at my face there. Amelia, cut that one. There were ten. Any questions or comments? Please call the rule on the passage of the bill Pacheco.'",
        "'speaker_1': 'I want John Gonzalez. Purple Juarez Macheda O'Brien, President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Nine in favor none.'",
        "'speaker_0': 'Oppose the bill passed and show sign and number 11. Any questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'PACHECO Hi, Sergeant. I beg your. Gonzalez. Herbold Hi, Juarez. Let's get to O'Brien. Hi, President Harrell.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Nine in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the electric system of The City of Seattle; adopting a system or plan of additions and betterments to and extensions of the existing municipal light and electric power generation, transmission, and distribution system of the City; authorizing the issuance and sale of municipal light and power revenue bonds for the purposes of providing funds to pay part of the cost of carrying out that system or plan, providing for the reserve fund requirement (if any), and paying the costs of issuance of the bonds; providing parameters for the bond sale terms including conditions, covenants, and other sale terms; describing the lien of the bonds and authorizing their issuance as either senior lien parity bonds or junior lien bonds; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Bill passes. Sure, I'll sign it. The score items 12 through 16.'",
        "'speaker_1': 'Agenda items 12 316 Council 119 674 Link to the electric system of the City of Seattle Committee Recommend Civil Pass Council Bill 119 675 related to the financing of cable television franchise fund programs committee recommend civil pass cancel bill 119 676 Relating to the financing of Equitable Development Implementation Plan projects.'",
        "'speaker_1': 'The Committee recommends the Bill Pass Council Bill 1196 77 billion to the financing of the Central Waterfront Improvement Program. The committee recommends the Bill Pass Council Bill 119678 relating to the financing of the Central Waterfront Improvement Program. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. And item number 12, any questions or comments? If not, please call the role on the pastor of the Bill Pacheco.'",
        "'speaker_1': 'I somewhat beggar Gonzalez Herbal. Hi Suarez mascara O'Brien President Harrell hi nine in favor and unopposed.'",
        "'speaker_0': 'Bill pass and show sign it I'm 13 Any questions please call the roll on the passage of the bill.'",
        "'speaker_1': 'Pacheco I so what I thank John Gonzalez Herbold Suarez Macheda I O'Brien I. President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': '9 a.m. favorite unopposed.'",
        "'speaker_0': 'Bill passed and show sign it. Number 14. Any questions? Please call the rule on the passage of the bill pacheco.'",
        "'speaker_1': 'I want.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Beg John Gonzalez. Herbold, i. Suarez Macheda, i. O'Brien All right, president harrell, i. 9 a.m. favorite unopposed.'",
        "'speaker_0': 'Bill passed cheryl senate number 15. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Pacheco So what I beg John Gonzalez Herbal whereas Musgrave O'Brien President Harrell nine in favor and unopposed.'",
        "'speaker_0': 'The bill passes and show Senate number 16. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'PACHECO So on I beg John Gonzalez Herbold Hi. Suarez Musgrave O'Brien Hi President Harrell All right. Nine in favor unopposed.'"
    ],
    "AN ORDINANCE relating to the financing of the Mercer West project; amending Ordinance 125466 to extend the term of an interfund loan.": [
        "'speaker_0': 'Bill passed and chair of Senate. So please read item 17 through 22.'",
        "'speaker_1': 'Agenda item 17 322 Council 119 679. Related to the financing of the Mercer West Project, the committee recommends a Vote Pass Council Bill 119 680 related to the financing. The Sail Streetcar Operations Committee recommends the bill pass council vote 119 699 related to the traffic code the committee recommends if you pass Council Bill 119681 related to the'",
        "'speaker_1': 'sweetened beverage tax revenues committee recommends the bill pass council 119 682 related to the Business License Tax Committee recommend Eagle Pass and Council Bill 119 683 relating to taxation. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Any questions on any of these items? 17 through 22. I won't keep asking if there are any questions if I don't see a question on the body of them. So. 17. Please call the rule on the passage of the bill.'",
        "'speaker_1': 'Pacheco. Hi. So on. I beg John Gonzalez. I herbold. I Suarez.'",
        "'speaker_0': 'Wait. I get it. I hear in the other room, she's high.'",
        "'speaker_1': 'That's me.'",
        "'speaker_4': 'O'BRIEN All right.'",
        "'speaker_1': 'President Harrell. Hi. Eight in favor, nine oppose.'",
        "'speaker_0': 'The bill passed and show sign it. Number 18. Please call the rule on the passage of the bill.'",
        "'speaker_1': 'Pacheco.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Sergeant Major Gonzalez. Purple Eye, Juarez. Michaela. O'Brien all right. President Herrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Eight in favor and.'",
        "'speaker_0': 'Unopposed bill passed and sure sign it number 19 please read the. The roll call on the passage of the bill.'",
        "'speaker_2': 'Pacheco I.'",
        "'speaker_1': 'Saw what.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Picture. GONZALES Purple. Juarez Mosquito. O'BRIEN President Harrell.'",
        "'speaker_0': 'I. Bill passed.'",
        "'speaker_1': 'Over unopposed.'",
        "'speaker_0': 'Bill passed and chair of Senate. Whatever was that? I'm sorry. That 18. That was what that was 19.'",
        "'speaker_4': 'She's ready for 20.'",
        "'speaker_0': 'So 20. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Pacheco I so what I BAGSHAW Gonzalez Herbal Juarez mascara. O'Brien President Harrell I nine in favor not opposed.'",
        "'speaker_0': 'Bill passing sure sign it on number 21 please call the roll on the passage of the bill.'",
        "'speaker_2': 'Pacheco I.'",
        "'speaker_1': 'Saw what.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Saw. Gonzalez Herbal. Juarez mascara. O'Brien Hi, President Herrell.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed. Sure. Sign it. Just one moment. And item 22. Any questions? Please call the role on the passage of the bill Pacheco.'",
        "'speaker_1': 'I want. I beg your. Gonzalez Herbold, I. Whereas Musgrave O'Brien, President Harrell. I favored and opposed.'",
        "'speaker_0': 'The bill passed and sure, sign it just for a moment. God. Just try to fix it now. Sure. But just let me ask what I can do. Okay. So let me give you these signed bills. We were going rather fast.'",
        "'speaker_0': 'And and I want to show some flexibility if the rules allow that. I do have one council member that actually voted. Opposite how that member would like to vote. Because I went through it at a certain way. So what are my options now?'",
        "'speaker_0': 'Can I do a revote on a certain item? And we're talking about item number 19 that I sort of did through a. It's a little quickly.'",
        "'speaker_1': 'Do reconsideration, but.'",
        "'speaker_0': 'Do I do it at the end? Well, and I can do it at the end. That's one possibility. So I apologize.'",
        "'speaker_4': 'Can you can you proceed?'",
        "'speaker_0': 'Okay. So we'll proceed as though and we'll slow it down a little bit and figure out how we can correct the record on that one. For item number 19, we'd like to do a revote. Okay. So.'",
        "'speaker_1': 'Front item 23.'"
    ],
    "AN ORDINANCE relating to taxation; imposing a tax on transportation network companies; adding a new Chapter 5.39 to the Seattle Municipal Code; and amending Sections 5.30.010, 5.30.060, 5.55.010, 5.55.040, 5.55.060, 5.55.150, 5.55.165, 5.55.220, and 5.55.230 of the Seattle Municipal Code.": [
        "'speaker_0': 'Where an item number 23. And we'll take that one by itself, I believe. So why don't we read that one into the record?'",
        "'speaker_1': 'Agenda item 23 Accountable 119 684 Relating to taxation imposing a tax on transportation network companies. Committee recommends the bill passes amended.'",
        "'speaker_0': 'Okay. And this is the one I believe council members want has some has an amendment. I do have a question on not this amendment, but I can I'll ask Councilman Swan directly. Your amendments are four or four numbers, 23 and 25, but not 24.'",
        "'speaker_0': 'Correct. Okay. So let's take 23/1. That's been read into the record. And Councilman Swan, would you like to explain your amendment?'",
        "'speaker_7': 'Sure. Do you want me to do that before the description of the bill itself?'",
        "'speaker_0': 'So. Maybe in the bill you could sort of describe it. I wasn't prepared to. It's been sort of described a little bit. Let's see, this is let me look at your amendments. That'll give me a little. She's here.'",
        "'speaker_0': 'So one was just a simple language change. I think that that was the script, the name of the resolution center. Why don't you just start off with the amendment and I'll sort of chime in after, if you don't mind, because I got to get my notes together here.'",
        "'speaker_0': 'So let's start with number 23.'",
        "'speaker_7': 'So I would first move the bill to.'",
        "'speaker_4': 'Good guys.'",
        "'speaker_0': 'So the bills.'",
        "'speaker_4': 'It was I mean.'",
        "'speaker_7': 'It moved the amendment, not the bill.'",
        "'speaker_0': 'So cast members in and walk us through what document we are should be looking at I think it's.'",
        "'speaker_7': 'There should be.'",
        "'speaker_0': 'See we have on.'",
        "'speaker_7': 'Your desk that says TNC.'",
        "'speaker_0': 'Yeah so this is the first one is just the description of what we're calling it. Correct. And the second one is more substantive on the addition. So. Okay. So. So it's been moved counts bill 119684 is being moved.'",
        "'speaker_0': 'We have you should have this I have this this version which basically is section D, I think. Go ahead. Customers who want.'",
        "'speaker_7': 'I'm Amendment one to add a driver solidarity and resource center to the list of acceptable uses of the funds from the TNC ducks.'",
        "'speaker_0': 'Okay. That's the amendment as described as their second. Is there a second.'",
        "'speaker_2': 'Or second tier discussion?'",
        "'speaker_0': 'Okay. Councilmember O'Brien, second floor discussion. Go ahead, Councilmember. Sure.'",
        "'speaker_7': 'Thank you. As you said, President Harrell correctly, the substantive part of the amendments come into the language of the resolution. That will be item number 25. But since they're all related, I just wanted to speak once and for all and then have the points applied to item number 25 as well.'",
        "'speaker_0': 'Yeah, it's sort of hard. Your First Amendment supports the larger amendment, which is a more comprehensive center. So maybe what we could.'",
        "'speaker_7': 'Yeah, but both amendments are about that.'",
        "'speaker_0': 'Yeah, I understand that. So maybe just from a practical standpoint, what we can do, it's a little unorthodox, but maybe if this has legs, the name should logically change. So maybe we should just get into the substantive one and then come back and vote for the number 23 because.'",
        "'speaker_7': 'I'm okay with that.'",
        "'speaker_0': 'Are you okay?'",
        "'speaker_1': 'You can move to hold this item and then we can move on to item move to hold this item until after consideration of item 25.'",
        "'speaker_0': 'So what I was hoping to do, I can do it that way, but perhaps an easier way is just for Casper and SWAT to describe these two. And then we'll do the pro con or who likes who doesn't.'",
        "'speaker_0': 'And then after that transparent discussion and we'll just come back and take the votes. That's that may make sense to me at least. But does that. Is that so? Even though number 25 isn't, which is the resolution isn't introduced.'",
        "'speaker_0': 'We could openly talk about it because it's related to number 23. Okay. AM I'm going to go to Joe. So if I do that, you're get a.'",
        "'speaker_1': 'Sense the similarities but only item 23 stuff for you right now. Okay. Only one before.'",
        "'speaker_0': 'You. Okay. So only 23 is before me. It ties in 25. We're not going to vote on 25, but council members want maybe you could just try the whole concept which in bodies 25 but only 23 is in front of us.'",
        "'speaker_7': 'Yes. Okay. I can do that for sure. I think before going into the substance of my amendments, what it does. So we have item number 23, which is right now in front of us, which is the bill that establishes the the the language for how the proceeds of the tax on Uber and Lyft corporations would be used'",
        "'speaker_7': '. And so we already have a possible items for which the tax revenues could be used, like administrative costs related to tax investment, affordable housing, transportation and transit investments. So there's already a, B and C, of course, which all of which I strongly support and I strongly support all the efforts by the Teamsters Union.'",
        "'speaker_7': 'So first thing, firstly, to clarify, this is not in in conflict with what the d what the Teamsters Union has worked on. This is in addition to soit. So this amendment of that is relevant for item number 23 would add an item D in among the list of uses for potential uses for the revenues of the tax'",
        "'speaker_7': '. And that's a driver solidarity and resource center, including a driver resolution center. And the driver resolution center is already in in the original language. And then when we come to item number 25, that's a resolution. That's not the ordinance.'",
        "'speaker_7': 'That's a resolution to describe all the you know, what kind of eligible uses there would be for the funds generated from the transportation network company tax. And in that, the amendment goes into more detail about what does Solidarity and Resource Center, what kind of services they would provide if if we had such a center.'",
        "'speaker_7': 'So if I can clarify that and again, moderate, why.'",
        "'speaker_0': 'This. Yes, please do.'",
        "'speaker_7': 'Thank you. First of all, thank you so much to the Teamsters Union, everybody, all the organizers, staff, organizers and the members, both the Seattle and Bass Drivers Association, which is working more directly with the Teamsters and also the Seattle Rideshare Drivers Association, which is also associated with the Bass Drivers Association.'",
        "'speaker_7': 'And many of the drivers are collaborating among themselves. But there are additional points that the Right Rideshare Drivers Association wants to bring, and this is about that. It is not in any way in antagonism to the point that the Teamsters have already brought up, which we strongly support, my office strongly supports.'",
        "'speaker_7': 'Also, another thing I want to say at the outset is that as a union member myself and as a strong supporter of the Teamsters Union, I completely and unambiguously resist this about any anti-union sentiment or any anti Teamsters sentiment that has been that may have been brought up by certain individuals.'",
        "'speaker_7': 'Some of it is all from outright company, a company shills or company spokespeople, lobbyist, and sometimes they are brought up from genuine activists and workers who may have certain doubts or confusions. And I just wanted to assure everybody here and everybody who is watching or listening that this is in no way meant to and is and isn't'",
        "'speaker_7': 'as of, as a matter of fact, something that is antagonistic to unions. And and, in fact, I want to go even farther than that and say that all throughout history of working class people, not just in the U.S., but around the world, we have seen that without union organizing, there has been nothing that has stood for us'",
        "'speaker_7': '. It's literally it's when workers got organized into unions that we were able to win even a modicum of rights in a deeply hostile and exploitative system that we live in, which is capitalism. And unions were built in this country by workers who are organizing before there was a legal right to a union, which means that many of'",
        "'speaker_7': 'the earliest organizers made tremendous sacrifices, sometimes through life and limb, in order for the right for future generations to have unions. And that's the kind of courage we are we stand on the shoulders of. And so we have to be very, very clear about that.'",
        "'speaker_7': 'The purpose of this amendment is to support the demand of hundreds of Uber and Lyft drivers for Driver Solidarity and Resource Center. And I want everybody is listening to know that the reason my office and I came to support these demands is after having doctored dozens of the 300 drivers that were reported, you know, who have signed'",
        "'speaker_7': 'the petition. For this, many of whom over them overwhelmingly are immigrants or even refugees from East Africa, from South Asia, from my home country, India, many of whom face systematic marginalization and oppression in our society. And that the end objective of all of this effort, whether it's what the Teamsters Union brought forward or their solidarities and resource'",
        "'speaker_7': 'center, all of this, I think we have a shared objective of building the power of rank and file drivers, because that is the only thing building power among the rank and file and building really strong rank and file unions.'",
        "'speaker_7': 'That is the only thing that can go up against the massive power of this sweatshop on wheels, which is Uber and Lyft corporations. There's nothing, nothing new, nothing innovative about this exploitation. This is old fashioned, good, old fashioned garden variety exploitation of a so-called gig economy workers.'",
        "'speaker_7': 'And the only thing that we can do to overcome these powerful corporate executives, the venture capitalist and all the other gatherers who have a stake in maintaining these exploitative companies is for workers to get organized and always share that goal.'",
        "'speaker_7': 'So having said that, the reason I'm bringing this forward is because after having talked to dozens of drivers, I was quite convinced that this is even if we don't I mean, if I don't win this amendment today, which I don't think I will.'",
        "'speaker_7': 'I wanted to bring this forward as a topic of important discussion. And to accomplish this, it requires these two amendments. So we've discussed it. I've personally talked to dozens of drivers, but between my staff and I, we've probably talked to over 100 Lyft and Uber drivers about their working conditions, needs and concerns.'",
        "'speaker_7': 'We know that Uber and Lyft have generated, you know, really just incredible amounts of wealth for the top executives and other, you know, the major shareholders and so on. But the drivers, most of the drivers remain in deep and further deepening poverty and continue to do grow desperate.'",
        "'speaker_7': 'Drivers are struggling to survive economically, especially with the rising cost of housing. Many like healthcare. Some drivers are even living and sleeping inside their vehicles. Others are having trouble paying rent every month. And that is, you know, that's just worsening throughout the region.'",
        "'speaker_7': 'It's not just Seattle. Even drivers who are living in the southern extremity of King County are also facing that. Many of the drivers were former taxicab drivers who own taxi medallions and owning being. I'm using that term loosely because they run into massive amounts of debt to get a medallion in the first place.'",
        "'speaker_7': 'They borrowed huge sums of money in order to start their taxi business. And then Uber and Lyft disrupted the paid transportation sector, and the medallions lost nearly all of their value, destroying the hard earned assets of the taxi drivers and throwing many of the drivers into deep debt.'",
        "'speaker_7': 'Hence the need for suicide prevention and counseling in the Driver Solidarity and Resource Center. There is a strong need to prevent suicide, and the reason is because many of the drivers are stuck in debt. And in fact, I'm sorry to share with you and I already shared with you in earlier budget discussions that when we were when'",
        "'speaker_7': 'we were organizing for this in the last month and a half in that same period, one of the drivers who is of East African origin actually committed suicide in that time and lost his life. Deeply tragic event that falls directly at the doorstep of the Uber and Lyft corporations.'",
        "'speaker_7': 'And so I find this a very compelling issue, and I hope that in the coming year we are able to work towards it and make sure that it's not about what we call it. It's not about the name Solidarity and Resource Center, although it's a very apt name.'",
        "'speaker_7': 'It's about what what the drivers, the what the workers want out of such a resource center. And that is why I mentioned one of those things that they're asking for, which is suicide prevention and counseling, direct, you know, family assistance and support services, multilingual workshops, because many of the drivers are immigrants.'",
        "'speaker_7': 'English is the second, third or even fourth language for them. They need to be organized to advocate effectively for their rights in dealing with Uber and Lyft, an English language and English classes. Naturalization from immigrant into citizenship also is an important aspect of it because uber misclassified drivers as contractors rather than workers.'",
        "'speaker_7': 'Drivers are far more complicated taxes as well. And so there are all kinds of barriers and obstacles that the drivers face to have a decent standard of living. And, you know, we don't even imagine those things because as as non Uber drivers, we may not face the same needs.'",
        "'speaker_7': 'One of the most important issues that the best legislation is needed for is to address the long history that Uber and Lyft have had of arbitrarily firing drivers on. Or as they call it euphemistically, deactivating drivers. Deactivating drivers is nothing but firing without cause.'",
        "'speaker_7': 'That's what it is. And drivers will tell you they faced this almost on a day to day basis. It is absolutely outrageous. So the driver resolution center that is in the base legislation is intended to address that issue.'",
        "'speaker_7': 'However, I have a concern that all of that depends on Uber and Lyft agreeing to voluntarily participate in the driver resolution. Same token, I mentioned this before. And these companies do not have a good track record of treating drivers fairly.'",
        "'speaker_7': 'And I feel that that's a that's a stretch that it will happen. I will be thrilled if the companies are willing, but I also don't think we should assume that it will happen either. So if I drive a resolution center, start overturning the activations, we need to be real about how Uber and Lyft we anticipate will respond'",
        "'speaker_7': '. There is one way to actually hold Uber and Lyft accountable, which is do, and that is to truly have the power to stop unfairly activations and to win a living wage. And that is, as I already said, is for drivers to get organized into a powerful union, because Uber and Lyft could not make a penny if the'",
        "'speaker_7': 'drivers went on strike and refused to drive. And they did that refusal in an organized way until their demands were met. And I'm not raising this as if to say that would be simple. We, many of us who have been in unionizing, driving the labor movement, we know that is one of the hardest things to do.'",
        "'speaker_7': 'It will take a lot of sacrifice. It will take a lot of community support. But it is worth raising because it is so crucial in building worker power. And also because this has been done in New York State and in New York City.'",
        "'speaker_7': 'The New York Taxi Drivers Alliance has won historic victories against Uber and Lyft corporations, winning practically the right for the drivers to be considered employees and not contractors. So we're not talking in the abstract. This has this we have examples to follow.'",
        "'speaker_7': 'We also saw the extremely successful Ab5 bill in California that was just won. So we have tremendous examples that we can build off of, maybe not in every single detail, but the overall model of worker organizing and power building is something that is is going to stand us in good stead.'",
        "'speaker_7': 'So just to go to a little bit of a specifics in the drivers, all Italian resource center drivers can come together to advocate collectively for their rights within the rideshare industry and get services including the legal support, training and community organizing to challenge driver deactivation.'",
        "'speaker_7': 'It will help them get organized because they will come and talk to each other over there and, you know, build your own power membership, meeting space for these organizing meetings, multilingual workshops, tax and financial training, voter registration and voter rights training, immigration and Naturalization Assistance, which I can tell you as an immigrant myself that you absolutely need'",
        "'speaker_7': 'that in order to make sure that you are not falling into some sort of bad situation. Driver Family Assistance and support services, counseling and mental health care, as I said, suicide prevention, English language meeting. So all of this is sort of encompassed in the idea of a solidarity and resource center.'",
        "'speaker_7': 'And that's why, as I said, even if this amendment doesn't pass today, I hope I look forward to the new council working together in making sure that these needs are fully incorporated in the uses for the revenues from the tax collection.'",
        "'speaker_7': 'And also one more thing I wanted to say. I mean, just as a testament to how wonderful leader drivers of organizing, how much courage it has required on their part because they are some of the most marginalized sisters and brothers.'",
        "'speaker_7': 'We have the Right Shirt Drivers Association. You know, in 2014 they really began their organizing under the Egis of the Teamsters, and they organized a strike against unfair deactivation and low wages. And I was there that day when they were courageously throwing their phones into a cardboard box that that was their strike, because the phone is where'",
        "'speaker_7': 'the app you reach the app to be a driver. And it took incredible courage. And I'll never forget that moment when all the drivers were throwing the phones into the boxes. And I want you to recognize Omar Mumin and Abdi Chau, who are part of the leadership of that alongside the Teamsters.'",
        "'speaker_7': 'And I wanted to hold up the sign. The sign has been hanging in my office since 2014, and it's a testament to how long the drivers have been organizing. And and I and I bring this up to point out that organizing works, fighting back works, because we wouldn't be here today with this bill in front of us'",
        "'speaker_7': 'if the drivers and the union hadn't taken those steps five years ago. And just to clarify, as I said, the budget amendment does not say anything specific about how much money should be allocated to this Solidarity and resource center.'",
        "'speaker_7': 'Instead, it merely includes the center at Indy approved list of uses for DNC tax revenues. And that will be in the resolution. So I will stop there. But in conclusion, really reiterate my hope that the Teamsters Union, the King County Labor Council, the rank and file drivers and progressives on the city council that we can really fight'",
        "'speaker_7': 'to make sure that the drivers have their fully full rights guaranteed in the next year or so.'",
        "'speaker_0': 'Thank you. Council members want we have amendment on the table that's been moved in second and I'll have some discussion. I don't want to. I'll go first off if others don't want to go first. First of all, I appreciate all of the comments and there's nothing in the resolution that by any stretch of the imagination is bad'",
        "'speaker_0': '. It's all really good stuff. During the conversations on the base legislation, I talked about the name the first. We're on item 23, which really just changes the name Drivers Resolution Center for me. It should be more than that.'",
        "'speaker_0': 'And while Solidarity and Resource Center doesn't exactly roll off the tongue. The point being is I certainly would be receptive to a name that really talks about solidarity and empowerment and resources. And so I think that we're on to something there.'",
        "'speaker_0': 'Here's the challenge I have with the amendment and is why I will not support it at this time is number one. And what's likely to happen next year is the spending plan will have to come back to the council.'",
        "'speaker_0': 'It'll be more granular. We'll have data. The after labor standards will have gotten more information from the drivers and from customers and from the projections from the finance folks who know what kind of money we've generated. And there will be likely a supplemental budget or another ordinance in place.'",
        "'speaker_0': 'And it would seem to me that the primary thrust of the resolution center are that first resolving port deactivation. That's the first. That's the focus. And then what I had the language I had originally had come up with that got stricken by.'",
        "'speaker_0': 'We got some input from law and some other editors was retooling of drivers because at the end of the day we wanted them to have good jobs and if they didn't have good jobs to help them get good or even better jobs.'",
        "'speaker_0': 'And from that, we looked at it having an opportunity to both organize and have them have a stronger ability to do greater things for their lives and for their their families. But my concern at this point is whether we are losing focus on the sort of the competency of the center, number one.'",
        "'speaker_0': 'But number two, we've had to sort of look at this legislation during the budget process. That's been real tough. It's there's several components to it. And I just think, again, a next year that a council will sit down and talk to all of the drivers, get feedback and really make sure that we're investing the way consistent with'",
        "'speaker_0': 'what the all of the constituents are saying. It's a very sort of it's a tough constituent base because you certainly can't please anyone in this world of tenses. I've found that out. So I'm just wondering if it's a little premature at this point to be as granular in the approach.'",
        "'speaker_0': 'And that's pretty much my objection to it, not for what's what's in there. The other, I guess point I would make is that all of these components of the amendments, multilingual workshops, tax and financial training, voter registration, etc..'",
        "'speaker_0': 'Again, all outstanding investments. And we are sort of creating these great services for a subset of the of our population drivers. And I'm where the question I would have is whether this great enriched work is better served in looking at what other groups and demographics outside of just the drivers circle we may want to support if we'",
        "'speaker_0': 'are to invest in that kind of center. So again, I do not oppose this approach. In fact, it's all really good stuff. I just wonder at this stage of the legislation whether we should be that granular. And as you may recall, the language we did approve during the budget process sort of talked about an organization with a'",
        "'speaker_0': 'proven commitment to workers rights and experience in providing resources to drivers and contractors and workers, particularly with cultural competencies, competencies with disadvantaged groups and disadvantaged socioeconomic groups. And so I think we were trying to head in that direction this year in hopes that we could be a little more granular next year.'",
        "'speaker_0': 'So those are reasons why I'm not supporting the amendment, but I want to thank Councilmember Swan for bringing it forward during the budget process. Any other comments or questions? We're just voting on 23, by the way, although we're talking about 25.'",
        "'speaker_0': 'I'll just stop there and see if anyone else raised her hand. We can't remember her.'",
        "'speaker_5': 'But I'm just to reorient myself. You just said we're just voting on 23.'",
        "'speaker_0': 'Not well or. Yeah, because we haven't even gotten to 2420. Councilman Swan basically described and I asked her to describe number. 23 and number 25, but we haven't read 25 into the record. But I've we're sort of talking about 25.'",
        "'speaker_0': '23 is a name change of 25, the substance of what she's presenting. That's why I said.'",
        "'speaker_5': 'If we are intending to speak to the amendment, when is the appropriate time to do that now? Yeah. Okay.'",
        "'speaker_7': 'Just to clarify, clarify, I'm non if this amendment for item number 23 doesn't pass and I'm not planning to bring forward the amendment for item number 25 because that it doesn't make sense. But if you don't mind, personnel, I would like a few closing remarks.'",
        "'speaker_0': 'Absolutely. Absolutely. Because her role did you it was ask your question is you.'",
        "'speaker_5': 'Have a question.'",
        "'speaker_0': 'Okay. So now will be the time to talk about 25, although it's not read into the record as it relates to the name change. I'm trying to squeeze that somehow. So yes.'",
        "'speaker_5': 'So I do see this amendment as broader than a name change and I certainly.'",
        "'speaker_4': 'Support.'",
        "'speaker_5': 'Its objectives as I understand the process going forward is that we as the Council will be briefed on the components of an RFP before it goes out. And I want to thank you, Council President, for reminding me of legislative language that is actually in the ordinance or the are.'",
        "'speaker_5': 'Well, right now it's a council bill. I hope hopefully will be an ordinance soon. But language in the council bill itself, that gives, I think, some good direction to the executive of what we would like to see coming back before an RFP goes out.'",
        "'speaker_5': 'And it specifically says that we would like a driver resolution center to consider contractual partnerships among entities to achieve the direct participation of organizations primarily focused on diversity and advocating for the civil and economic rights of workers from disadvantaged socioeconomic groups.'",
        "'speaker_5': 'So for me, that language. Uplifts the council's intent for a driver resolution center. And I think it sends a strong message that we want a entity that is bidding on the funding for the center to do more than simply resolve employer employee conflict complaints.'",
        "'speaker_5': 'And so I'm comfortable with this direction and am supporting this language and not the amended language to the or the amendment to the resolution.'",
        "'speaker_0': 'Thanks, Herbert Council Member O'Brien. Did you have some comments you like to make?'",
        "'speaker_2': 'I did. Thank you all. And I reiterate some of the comments that I've heard from others, but I fully support. And Councilmember Swan, I think you're absolutely right on the direction that this work needs to go. I'm not going to support this amendment because frankly, as Council President Harrell said, the timing of this, not the amendment, frankly'",
        "'speaker_2': ', but the timing of this work coming to the council and the work required and the outreach required to do this properly. I think I haven't had that time during the budget to do that, but I do believe there will be opportunities in the New Year to do that work.'",
        "'speaker_2': 'I think that what's critically important going forward as we transition from this phase where legislation was drafted and introduced and started to be publicized during a very busy budget season and turn into a process that it will hopefully be a much more transparent and inclusive process where where people can engage thoughtfully in how they want to see'",
        "'speaker_2': 'this work move forward, that it's going to be incumbent upon the council next year to be making sure that that process is open to everyone and transparent. I've been aware for a number of months that this work was happening here at City Hall, but frankly, as a council member, I was not part of those discussions and was'",
        "'speaker_2': 'largely in the dark, and that's as a council member. I can only imagine how it felt to be a driver knowing that conversations were happening about your future and you're not participating in those conversations, let alone being even aware of where that happens.'",
        "'speaker_2': 'And when those when actions like that happen, it breeds a lot of mistrust. And I will say that the people that were party to that I understand why the conversations happened the way they did. I don't believe anyone is intending to undermine anyone else's interests.'",
        "'speaker_2': 'But there's an opportunity that I think the city needs to lead on in the new year, which is opportunity to bring the drivers together in a very transparent and inclusive way to understand their concerns. There's a lot of different drivers out there with a lot of different backgrounds and a lot of different interests.'",
        "'speaker_2': 'And those interests aren't always exactly aligned. But in my number of years of working with the drivers, what I know is that they're a dedicated, passionate group who can build consensus and work together to find a way to make this move forward to benefit all drivers.'",
        "'speaker_2': 'And if we fail at that and the drivers do not have the trust of each other, unfortunately, the folks who will continue to make money and exploit them will be the big corporations that are doing so today. And so it's in all of our interests to figure out, to do that hard work, to get folks coming together'",
        "'speaker_2': '. And Councilmember Swan, I think the language in here goes a long way to indicating that. I just have some concerns about the specific wording and how it's used and would prefer, since this is really just largely a resolution to say what the council is going to do next year to see what I hope the council does next'",
        "'speaker_2': 'year, but not vote yes on this resolution or the other name change. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Brian, before council members want closer debate on her proposal there, any other questions or comments from anyone our customers want? You want to close this out?'",
        "'speaker_7': 'Yes. Firstly, on your point, President Harrell and.'",
        "'speaker_4': 'Fully I mean, I.'",
        "'speaker_7': 'Didn't exactly understand, but I think your point about what can we have a broader impact, a broader community impact than just drivers? First of all, I just want to point out that the drivers come from marginalized communities themselves.'",
        "'speaker_7': 'So whatever we do to directly help the drivers also helps their families and their children and their spouses. And they are all part of a deeply marginalized community. So I honestly would not worry about that in any way.'",
        "'speaker_7': 'Also, I would say that in the New Year, when we think about revenues for this tax, we have to and I hope the new council will have the courage to do this, because the voters have certainly given us their mandate that we will have the courage to not do the business as usual of pitting Peter to, you'",
        "'speaker_7': 'know, robbing Peter to pay Paul and pitting various needs against one another, because which is a direct result of a lack of political courage to really aggressively go for progressive revenues of different kinds. So rather than posing the question of can we have a broader use of revenues from the TNC tax, I would much rather pose it'",
        "'speaker_7': 'as can we make sure that their drivers and their families get the maximum benefit out of the TNC tax? And can we also browse the Amazon tax? Can we also pass impact fees on corporate developers? And can we also post vacancy fees?'",
        "'speaker_7': 'And can we also make sure that every that no stone is left unturned in raising progressive revenue so that we don't say, well, are there other communities that need to be supported? Because, frankly, the vast majority of social needs in our city and region are not being supported at this moment.'",
        "'speaker_7': 'The other thing I wanted to say, just to echo other Councilmember Arun made a very important point, which is that I think all organizers on the ground have an obligation to make sure that we prioritize unity and power building among the drivers, and that that obligation lies with me as a councilmember.'",
        "'speaker_7': 'I take that responsibility seriously. And as a union member, I will say that responsibility lies on union organizers also. We all have to take that responsibility seriously. And I think we all understand the way the balance of forces work that if drivers are not brought together and don't work in a strong united fashion, then those entities that'",
        "'speaker_7': 'end up benefiting is not the union, but it's Uber and Lyft Corporation. And so I really appreciate this allows me to lift up an important point that came up during the organizing that both the drivers who are primarily organizing with the app based drivers association and the drivers who are primarily organizing under the banner of the Rideshare'",
        "'speaker_7': 'Association have actually themselves put an emphasis on their own unity regardless of what anybody else is doing, and that I wanted to appreciate. And so in addition to thanking brothers, Omar and Abdullah also wanted to thank Brothers Don Cleary, Peter, Cool and Latoya, Ammad and also Sister Julie Davis, who've all really well, I mean, we may not'",
        "'speaker_7': 'all be on the same page on every last thing, but we are clearly on the same page that workers, drivers need to be united. And that gives me a lot of hope and I look forward to the next year.'",
        "'speaker_7': 'And just last but not least, as far as the specific wording, I honestly don't think that the wording we've brought forward is specific. It's very general and these are all needs that we clearly know the community has. I don't think there's anything controversial in that.'",
        "'speaker_7': 'I hope that in the new year we will see driver needs being prioritized. But my message is also for my sisters and brothers who are drivers, that we are not going to win any of that unless we keep getting organized and we keep building unity and building power among ourselves to.'",
        "'speaker_0': 'Okay. So we have an amendment on item number 23. It's been moved in a second and I'm going to take a vote just on the amendment, not on the base bill. Okay. So we're just voting on the amendment.'",
        "'speaker_0': 'All those in favor of the amendment. Please vote I and raise your hand.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Okay. All those opposed. Say no and raise your hand. No, no, no. So the amendment fails, but the base legislation is still intact. And now we can vote on the best base legislation. So please call the roll on the passage of Council Bill 119684.'",
        "'speaker_1': 'Pacheco I saw what.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Saw. Gonzalez Purple. Juarez Mascara. O'Brien President.'",
        "'speaker_0': 'Harrell All right.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Bill passed. Sure. Sign it. Please call. Please read it. You're not number 24 and into the record.'"
    ],
    "A RESOLUTION adopting a spending plan for the proceeds of the Seattle Transportation Network Company tax to provide support to affordable housing near frequent transit, transportation, and a driver conflict resolution center.": [
        "'speaker_0': 'Bill passes and chair of Senate. Please read resolution 31914. Item number 25 into the record.'",
        "'speaker_1': 'Agenda item 25 Resolution 31914. Adopting a spending plan for the proceeds of the Seattle Transportation Network Company Tax to provide support to affordable housing near frequent transit, transportation and a driver conflict resolution center. Committee recommends the resolution be adopted as amended.'",
        "'speaker_0': 'Okay. Just one moment, colleagues. Here's the last piece of legislation. Oh, this is for the item number 19. Okay. I'll come back to that. Okay. This is the other part of the spending plan, a resolution that Councilmember Swan was going to amend in light of what happened in number 23 customers.'",
        "'speaker_0': 'What did you want to say? Anything else about the amendment or should I just proceed with the vote? I'll defer to you.'",
        "'speaker_7': 'Go ahead. Because I'm not you know, since the other amendment failed, I'm not planning to bring it forward today. And I do plan to vote yes on the spending plan resolution. But with the understanding that we will continue to be organizing with the drivers to make sure that their needs are met through the revenues raised.'",
        "'speaker_7': 'You know.'",
        "'speaker_0': 'I'm not I don't want to generate a long discussion, but I showed some I don't think I made my point clear. You didn't understand my point about when I said that the services provided in your amendment was sort of a subset, I think is the word that I used of drivers that would have my thinking as I'",
        "'speaker_0': 'look at what's happening to both our country is that we'll have a lot of potentially displaced workers, whether they are parking lot attendants or security guards or just certain segments that technology will replace. And I sort of when I read your amendment, sort of the spirit of it looked at a lot of the challenges that particularly immigrant'",
        "'speaker_0': 'refugees. But but many people have when being displaced are being challenged by large companies. And so the point I was making was that these great services that it might be advisable for the council to look at other subsets or other groups, other workers, other types of workers that may be impacted as life goes on in this country'",
        "'speaker_0': '. So that was the point I was making, and I hope that that was clear at least. Okay. So number 25 is here. So resolution so. Those in favor of adopting the resolution. Please vote i. I. Those oppose vote.'",
        "'speaker_0': 'No. No. You're voting no on the resolution.'",
        "'speaker_4': 'But we weren't even coming forward with this.'",
        "'speaker_0': 'You know, this is there's this is the base resolution. This is not an amendment. Okay. So let's do that one again. So those in favor of adopting a resolution vote i, i. Those opposed vote no. The resolutions adopted that show.'"
    ],
    "AN ORDINANCE relating to transportation network company drivers; establishing deactivation protections for transportation network company drivers; amending Section 3.15.000 of the Seattle Municipal Code; and adding a new Chapter 14.32 to the Seattle Municipal Code.": [
        "'speaker_0': 'Sign it. Okay. Okay. Let's go to 26 through 30 collectively.'",
        "'speaker_1': 'Agenda items 26 330 accountable 119 686 Ruling to the Transportation Network Company Drivers Committee recommends the bill passes amended council bill 119 687 relating to the transportation or companies driver labor standards. The committee recommends the bill passes amended cancel bill 119 688 relating to an employee giving program for City Employees Committee recommends the bill passed Council Bill'",
        "'speaker_1': '119 690 relating to Interphone loans. The committee recommends the bill passed and resolution 31916, acknowledging the inherent responsibility of the city to reduce unnecessary justice systems involvement. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Okay. And Councilmember one, I'm going to come back to item number 19 right before the full budget is approved. I'll do that with a and we'll have a motion to reconsider that item. Okay. So number 26 through 30, first of all, are there any questions on this group of.'",
        "'speaker_0': 'Of items, because then I'll just sort of go through it. Okay. Please call the roll on item number 26 Council 119686.'",
        "'speaker_1': 'Pacheco I so what I thank John Gonzalez HERBOLD. Hi, Suarez. Mr. O'Brien. Hi, President Harrell. I am in favor and unopposed.'",
        "'speaker_0': 'Okay. Number 27, please call a roll on the passage of the bill Pacheco.'",
        "'speaker_1': 'All right. Sergeant Bagshaw. Gonzalez, Herbold, I Suarez, Mesquita, I O'Brien. High President Harrell High nine in favor favorite unopposed bill.'",
        "'speaker_0': 'Passed and chair of the Senate. Please call the roll on item number 28.'",
        "'speaker_1': 'PACHECO So what I think. Shaw Gonzalez Herbold Suarez Moschella I. O'Brien President Harrell.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Am favorite unopposed.'",
        "'speaker_0': 'Bill passed and chair of Senate. Please call the roll on passage of number 29.'",
        "'speaker_1': 'Pacheco I so want to make sure. Gonzalez Herbold. Hi. Suarez. Macheda O'Brien. President Harrell.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Nine in favor.'",
        "'speaker_0': 'Nine oppose the bill passed, I'm sure. Sign it and please on the resolution number 30, those in favor of adopting the resolution. Please vote i, i. Those opposed vote no. The resolution is dropped. And, Cheryl, sign it. Just one moment here.'",
        "'speaker_4': 'That was fun.'",
        "'speaker_0': 'So we're going to take. Number 31 by itself.'",
        "'speaker_1': 'No reconsideration.'",
        "'speaker_0': 'Okay, let's do the reconsideration now. So we're going to go back to number 19. Item number 19, which. Is. Well, let me we'll get to it in a moment, but let me make a motion. I will move to reconsider the passage of Council Bill 119699, which is item number 19.'"
    ],
    "AN ORDINANCE adopting a budget, including a capital improvement program and position modifications, for The City of Seattle for 2020; and creating positions exempt from civil service; all by a 2/3 vote of the City Council.": [
        "'speaker_0': 'Please read the agenda item number 32.'",
        "'speaker_1': 'Gentium 3032 Council Bill 119 689 Adopting a budget including capital improvement program and position modifications for the City of Seattle for 2020 and creating positions exempt from civil service by two thirds vote of the City Council. The committee recommends the bill passes amended.'",
        "'speaker_0': 'Okay. This is the final adoption of the budget. We're going to turn it over to Councilmember Bagshaw, who I want to say before you begin, thank you, thank you for working. This is a lot of work and a lot of commitment from you, and I appreciate it the way you handled it from start to finish.'",
        "'speaker_0': 'Councilmember Bagshaw, you have the floor.'",
        "'speaker_4': 'Thank you. Well, I've got about five pages of thank you's, if you will all recognize the good work that you have all done. Council, central staff. How come you're hiding in the background and where are your colleagues? But let's let's say I want to start by saying last year in our 2019 budget, it really reflected what our'",
        "'speaker_4': 'collective commitment was to areas that needed our most attention, and it included what we built on this year around housing and homeless services, the hygiene. And we will get to all these thank you's and lead the criminal justice reform.'",
        "'speaker_4': 'And I just want to acknowledge Lisa Guard Tara moss, thank you very much for being here. And I'm going to get more to that in a moment. But this year, as we continue to focus on these commitments, I was so impressed by how all of us here not only got along, but focused on those commitments that were'",
        "'speaker_4': 'most important to us and that that's where we put our highest priorities. We did indeed build on the mayors budget, and that was that was great. But as Councilmember Gonzales, you said from the beginning, we're going to put our own priorities on this, our own mark.'",
        "'speaker_4': 'And I believe that we've done that. So just as a couple of examples, a few things that we ended up doing, 2.15 million to build up to 100 more tiny homes. We heard from so many people who are living in tiny homes saying that this was an answer for them.'",
        "'speaker_4': 'And as somebody who's been working on this for at least nine years, I could not tell you how happy I am. Clearly, I think we need more, but that is a good start. I am honored that the 1.8 million that we put in for the Bill Hopson Clinic moved forward.'",
        "'speaker_4': 'I want to say thanks to Daniel Malone, DC As many of you and I know, many of us were good friends with Bill Hobson, but this makes such a difference to me personally. I also want to say thank you for the 1.6 million and this is Councilmember Herbold and Councilmember Suarez for unsheltered individuals to get access to'",
        "'speaker_4': 'bathrooms and showers and then to provide diapers and women's hygiene products, expand trash collection at these encampments, that's made a big difference.'",
        "'speaker_5': 'And Councilmember Sawant, I just want to.'",
        "'speaker_4': 'Add, Councilmember.'",
        "'speaker_5': 'Saw the record. She was my co-sponsor.'",
        "'speaker_4': 'Thank you. And just the 1.5 million we put in today for the youth program, Education and Diversion. It was $1,000,000. Councilmember Herbold, that you did, as we pointed out, $3 million in our original budget and additional $2,200,000. Councilmember Swan, thank you for that.'",
        "'speaker_4': 'I'm very excited and this is Councilmember Pacheco that you push this with the 1.6 million to keep our enhanced shelter beds for youth open, for youth that are experiencing homelessness, to have that support, to have the legal services that they need.'",
        "'speaker_4': 'And I want to recognize all of the people, the advocates, the providers, whether it's Melinda Giovinco or others, that just make sure that we have services and places for youth to be at night and more. 24 seven more places, more support for them will help people get off the street.'",
        "'speaker_4': 'Councilmember wise, big thanks to you for the million dollars that you have really pushed to expand homeless services and improve outcomes for American native Indian Alaska Native homeless individuals makes a big difference that and the murdered and missing indigenous women.'",
        "'speaker_4': 'That's something that you have been advocating for. I'm deeply thankful for that. So we're also addressing the council's highest priorities around criminal justice reform, as we mentioned, public safety, transportation and environmental protection. So I'm not going to beat that one too much.'",
        "'speaker_4': 'You know where we're going with it. Thanks to our Seattle Fire Department for getting health one up and operational this year. It was a big deal. And then also the moneys that we put in to redesign Thomas Street to help complete market to fly the work we're doing down in Fortson Square to make yes crescent the improvement'",
        "'speaker_4': 'a reality. So with that and the 3.5 million to our local genius, thank you so much for all the work that you've done. With the additional money that you were able to get from the Ballmer Foundation. This is going to move us from a position, one of which we're proud of, to one that is going to be'",
        "'speaker_4': 'great. So I know that was we're being able to measure and monitor, and you've already done so much in that regard. We're going to come back and see, yes, this is an option that is way better than putting people in jail.'",
        "'speaker_4': 'So thank you so much, Lisa, for all your good work and all of your colleagues there working on that. So with that, I want to say some very specific. Thank you, Ali. Poochie, you're hiding back there. But to you and Dan, Peter, thank you for your leadership on this.'",
        "'speaker_4': 'It was a spectacular time for me working with you. And I just really appreciate your management, your calm, everything that you did to help this become a success. And Lisa. Okay, thank you. And Tom, thanks for the work that you two did on spreadsheets.'",
        "'speaker_4': 'A little known secret up here is that I break out in hives when I have to look at numbers by myself. So you really were terrific in making that happen. Thank you for that. Jeff Simms and Tracy there.'",
        "'speaker_4': 'They're hiding somewhere. I think Jeff is is gone. But Tracey Ratcliffe, he few are listening. Thank you for all the work that you did on Human Services and the regional governance, not only to date, but what's to come.'",
        "'speaker_4': 'Amelia and Jody, thank you to for the two of you. I am so respectful for your keeping us on track. Everything that you've taught me about substitutions and amendments and and adopting things, keeping us on track. So thank you both for that very much.'",
        "'speaker_4': 'Greg Doss I don't know where everybody is, but Greg, if you're listening and Carlos Lugo on the work that you've done on criminal justice reform. Special thanks, Greg, for working on lead with me and helping with all of the good work that we have done on the resolution, the drafting, just keeping that on track.'",
        "'speaker_4': 'So. Greg Doss thank you, Brian. Good night on. It's the special on education and utilities and thank you that we just had Calvin Chao and Eric McConaghy come in. Calvin, thanks for all the work that you've done on transportation.'",
        "'speaker_4': 'And of course, Eric, I'm just so appreciative of the work that you and Amy Gore have done. I mean, you've got a broad catalog of work you were doing on Seattle City Light and Human Services in the works on TNC.'",
        "'speaker_4': 'So thank you, gentlemen, both for that Lish Whitten and Ketel Freeman on land use. I cannot tell you how many times poor Ketel in ten years has had to explain land use 101 to me carrying a bull for your office, Office of Labor Standards.'",
        "'speaker_4': 'Thank you for your tutorials on that. I think I mentioned Brian Goodnight already around education and utilities, but the focus that you individually have had have have really meant a great deal to me. I share your work on civil rights Kelvin I've mentioned and Eric, you walked in the door just at the right time.'",
        "'speaker_4': 'Yolanda So the great work that Yolanda you have done around helping me support and get forward with our urban trees ordinance, the environment, climate change, you and Michael Brian are a great team there, so thank you all. And so colleagues, let me just turn my attention to you for just three more minutes if you bear with me'",
        "'speaker_4': '. And so, Councilmember Mosqueda, thank you for bringing Camilla here. Thank you for all of the work. I've missed you. I'm glad you're back. Truly your dedication to workers over this last year with the hotel workers that you've done, the domestic workers, it's just mattered so much.'",
        "'speaker_4': 'And I just appreciate your leadership and our work to promote more child care. And we are getting a mama's room here in city hall this year. We put $100,000 into it. So that is in your capable hands now going forward next year.'",
        "'speaker_4': 'And Councilmember Swan, I do want to recognize and say thank you for your dedication to the people of the city. Many people's lives are really better because of you. Excuse me, Councilmember O'Brien. It's been ten wonderful years working with you, your commitment to climate change, the good work that you've done on all environmental issues.'",
        "'speaker_4': 'One time I know that the stranger said to me begrudgingly, that that I was sort of a nice person, but I didn't hold a candle to you. And I'm I'm I'm honored and appreciate so much the work that we have done together.'",
        "'speaker_4': 'So thank you for that. And Council President Hiro, you have been my buddy, my favorite linebacker and defender for the ten years that I've been on this. And you really understand how much we all need each other in this community.'",
        "'speaker_4': 'And I think, above all, I appreciate the fact that, you know, that excessive individualism doesn't build. The city we want. It's something I've heard you say many times, and you are a colleague that I greatly appreciate. And I just want you to know that.'",
        "'speaker_4': 'And thank you for caring for all of us and for Seattle. And Councilmember Gonzales, since I'm now turning on this site. I just appreciate so much your knowledge of the law, your willingness to dove deep into all issues, including public safety issues.'",
        "'speaker_4': 'And you've done a tremendous amount about protecting and promoting and teaching us about immigrant and refugee issues. And that has meant so much to me. And I know that all of our neighbors are going to be better off because of you.'",
        "'speaker_4': 'And it's just been an honor working with you and your number your number two here. And Councilmember Herbold, I get so much appreciation thinking about your long journey. I mean, 18 years, I think, is the legislative aide and into where you are now, the number one champion of D1.'",
        "'speaker_4': 'And it's been my pleasure. But I also I want to thank you personally for your advocacy for not just your district, but the whole city and the work that you've done, bringing some special support and attention to South Park, better transportation to West Seattle, fighting for sound transit and ways that we need to, and being very smart'",
        "'speaker_4': 'about operation costs for roads, for the busses, for streetcar, that's really in your hands going forward. And I just want you to know how much I appreciate that. And Councilmember Pacheco, what a delight it has been working with you.'",
        "'speaker_4': 'Thank you. You jumped in here, I think, in April of last year with both feet and you have been unflagging. Thank you so much for helping us with this, for building on our colleague, council member Rob Johnson's legacy as well.'",
        "'speaker_4': 'You've done a lot for us, so I appreciate you. I want to recognize you and then Councilmember Suarez, not least at all. But I just I want you to know how much you make me smile thinking about D5.'",
        "'speaker_4': 'Everything is around five. But as I as I mentioned earlier, what you have done to promote justice for missing and murdered indigenous women and also to support our good friend Colin Echo Hawk and Chief Seattle Club. It's been my honor working with you, and I just want you to know, Holy Mountain Woman, how much deep respect I'",
        "'speaker_4': 'have for you. And we have a favorite movie character, wind in his hair. And as he said, you will always be my friend. Thank you. So thank you all, everybody for steering, helping me work this budget. It's been a complete honor to work with all of you and I am so pleased how far we've gotten this year'",
        "'speaker_4': '. So you can call me in Boston and I'll be here to work with you anytime.'",
        "'speaker_0': 'Thank you guys for your. Thank you very much. Well, we have item number 32 in front of us, which is the vote on the budget. And I think. Did anyone else want to say any words before he passed?'",
        "'speaker_0': 'Councilmember Revenue Councilmember Skater.'",
        "'speaker_1': 'I do want to say a few words. I thank you, Mr. President. I know I haven't had the chance to be with you over the last six weeks, so I do want to take a few minutes to express my appreciation first to my staff Sadia Parekh, Aaron House, Aretha Basu, Frida Cuevas, who have been working with all'",
        "'speaker_1': 'of you and all of your staff to get our priorities incorporated in this budget. Thank you, Councilmember Bagshaw, for your incredible work, to work with our office and to reach out and to ask for our input and feedback throughout the process.'",
        "'speaker_1': 'As I'm on parental leave, I thought it was important to come back and I had somebody asked me, a reporter asked me why come back today? I think the importance is to highlight the work that they have been able to accomplish in my absence.'",
        "'speaker_1': 'I do want to underscore it is really critical, though, that people who have the ability to take that parental leave, take it. You get 12 weeks starting in January thanks to the state and a law that passed. So don't forget to take it.'",
        "'speaker_1': 'After this budget vote, I will be going back on leave. And we know that it's important to have not just those laws on paper, but to make sure that they actually work. You all as colleagues, your staff, central staff, my team, the communications team have been able to support me and my office and my family in making'",
        "'speaker_1': 'sure that the leave was there for us and that we were able to take it. That it wasn't just black words on a white piece of paper that truly I was able to take that leave and have the support around me to make sure that these budget priorities were included.'",
        "'speaker_1': 'So thank you so much to again my incredible team at the team throughout the office and central staff and all of you council colleagues and your team for helping to make these priorities possible. I do want to highlight a few things that we were able to get into the budget.'",
        "'speaker_1': 'Mr. President, if this is the appropriate time, very appropriate. Again, thanks to the incredible work of our office, Aaron House and Central Creek on the housing, affordable housing, working with central staff. Ali and Tracy, we were able to secure an additional $20 million.'",
        "'speaker_1': 'It's $19.75 million that we could redirect to affordable housing efforts that are possible now. You heard people speak today about affordable housing efforts, like the folks from Africa Town who have projects that are ready to be built now and they just need additional funding and support from the city of Seattle.'",
        "'speaker_1': 'We redirected some of those funds so that $20 million can go into affordable housing efforts. Now, by redirecting $2 and making sure that the Mercer Walk sale dollars went into efforts that are ready to be built. Now we're really moving forward on affordable housing efforts that the community has prioritized.'",
        "'speaker_1': 'And with your help and with the Council share of actions support as well, we were able to get efforts into the housing budget that not only put the funding there for affordable housing, but the community preference. First, we funded community preference.'",
        "'speaker_1': 'We funded affirmative marketing efforts. These are two public policies that we've worked on with community over the last two years, and now we're putting funding forward so that there will be equitable engagement by those most affected by the legacy of redlining and racist, exclusionary policies that allow for folks to not only build the housing that we need'",
        "'speaker_1': ', but build it in the community's eyes and make sure that those who are most risk of displacement, those are the lowest income folks get to come and live in our communities. Still, we put funding forward to continue the efforts that we had last year.'",
        "'speaker_1': 'If you remember, we did the Racial Equity Toolkit on our current zoning policies because our current zoning policies are much like other cities throughout the nation where we've excluded, intentionally excluded through historically racist policies, communities, specifically communities of color from living in areas that have high access to opportunity.'",
        "'speaker_1': 'When we do the racial equity analysis and now with the comp comp plan that we incorporated here, we will be following in much of the same footsteps that cities like Minneapolis have done, where we've taken a look at the blueprint of our city and said, why do we continue to have a single family housing zoning in much'",
        "'speaker_1': 'of the city? 75% of the city still has that zoning. How is that contributing to displacement and gentrification and prohibiting people from being able to live in the city and stay in the city? I'm really excited about that effort to make sure that there's both anti displacement efforts and that we're looking at building more inclusive housing through'",
        "'speaker_1': 'by undoing these past discriminatory practices. I'm really honored to have worked with many of you, including Councilmember Sawant and others who've supported the tiny house villages with the $815,000 that we got in four tiny house villages. That's another 40 homes.'",
        "'speaker_1': 'If you think about it, that's about another 75 individuals potentially that can live there. That is a drop in the bucket to I know what we want to work on next year in terms of allowing more tiny house villages.'",
        "'speaker_1': 'It goes without saying that this council's in a constantly told be smart with the public dollar, invest in proven practices. Well, I haven't. And here for the last six weeks to see it. So I got to say it again.'",
        "'speaker_1': 'Tiny house villages are proven practice to get folks into permanent housing. 40% success rate of getting people into affordable housing versus a 4% success rate for math on the ground. This is ten times more effective. We ought to be investing in these small, tiny house villages and other enhanced 24 seven shelter models that I know the council'",
        "'speaker_1': '. Councilmember Bagshaw, as chair of the budget, has prioritized in past efforts. So thank you for including those tiny house villages. And that's the criminal justice work that has been done. This is another great way for us to be effective with our dollars.'",
        "'speaker_1': 'This is about an early intervention. It's like a public health model, right? If you want to invest early in keeping the community safe, you invest in public health or when you invest in restorative justice and harm reduction strategies.'",
        "'speaker_1': 'That is a public health strategy. That is a harm reduction strategy. It saves lives and it saves dollars. So thank you so much to all of our folks who've been working to move funding back into the sex worker harm reduction program, the Restorative Justice for Youth Programs, and working with community organizations like Park Slope, Creative Justice, We'",
        "'speaker_1': ', Passageways, Rain, Beach Action Coalition and so many more. I'm really excited about the funding that we got in there for the Green Light Project, which is run by the people of color sex worker outreach project. Very excited about the funding that we got in for retraining speedy officers who work with sex officers so that it's really about'",
        "'speaker_1': 'coming from those workers themselves and not a patronizing way of thinking about how somebody should engage with that work. This is coming directly from the workers themselves. Continuing the line of work and inventions investments. I'm appreciative of the support for the apprenticeship coordinator and the electrical compliance officer.'",
        "'speaker_1': 'Again, these are upstream investments to make sure that people get into high paying jobs. I wish we could have done more with investing in the Office of Labor Standards, and next year I'll be working with all of you to make sure that we can have additional enforcement measures and dollars put in place for both education and enforcement'",
        "'speaker_1': '. And this is important for the high road employers, small businesses who are doing the right thing and getting undercut by the guy next door who's engaging in wave stuff. And it's also important for the workers themselves. We passed so many pieces of legislation here with this incredible council and previous councils.'",
        "'speaker_1': 'We just need to make sure that those policies are followed through. And thank you, Councilwoman Bagshaw, for your past efforts on child care. And I know that we will continue fighting for additional child care throughout the city. I'm disappointed to hear that some of the private partners that we've been talking with about wanting to open additional childcare'",
        "'speaker_1': 'facilities across the city have just been told that some of the places that they're looking at is not possible. We need to look at this like we do with health care, that it is not getting picked up by the private market.'",
        "'speaker_1': 'This shouldn't be a market good and we shouldn't be thinking about everything we can do from the public policy perspective to invest in public childcare so that 0 to 3 and 0 to 5 child care is affordable, accessible and throughout our city.'",
        "'speaker_1': 'So that's something that I think is on our to do list next year and we'll continue working on that. Thank you for all your work. And lastly, I know you guys have been working on it for a long time, so I will stop talking.'",
        "'speaker_1': 'But I do want to thank our council colleagues who've been working with us over the last six weeks in my absence. I'm really proud of the the approach that we've taken in this budget and. Councilmember Bagshaw with the small amount of additional funding that was included that you found.'",
        "'speaker_1': 'I do think that there is it reflects the budget reflects that you put those priorities towards helping people who have been most marginalized and the highest need. So thank you for that. We had to work within the constraints that we have.'",
        "'speaker_1': 'And so I think that this, again, calls on us to find additional revenue, equitable revenue, so that we can have an equitable investment in our most vulnerable communities. So we're not thinking about investments for lead verses, investments in tiny homes, investments for child care versus investments in workers and health care.'",
        "'speaker_1': 'These are things that I know we all want to do. So I'll be looking forward to working with all of you to make sure that we find equitable revenue for a more equitable society. Thank you all for your work and I'm happy to be here and happy to be taken off after this.'",
        "'speaker_1': 'And thank you for your support as I do that.'",
        "'speaker_0': 'Thank you. Councilmember skater, this given given the fact that this is the last budget item, maybe we just sort of come down the. The day is here and if there's any comments I'm not saying comes from whereas comes from so on.'",
        "'speaker_1': 'May I say one more thing? Just as you were coming this way, I was also thinking of my mom. She came to watch her daughter. So thank you for watching her. That's my mom, Patty, in the back. I really appreciate.'",
        "'speaker_0': 'It. I didn't see anyone wave. Where's Mom?'",
        "'speaker_1': 'She's back in the office.'",
        "'speaker_0': 'Oh, in the office? She was on TV.'",
        "'speaker_1': 'Thank you, Mom.'",
        "'speaker_0': 'Very, very, very appropriate. Councilmember, what would you like to say? Something or catch from Brian? Yes, please. Councilmember 20th floor.'",
        "'speaker_7': 'Thank you to all our central staff members who, as usual, have provided incredible support. Ali Banerjee I shall Anker Drummond. Amy Gore. Kittel Freeman. Lisa Kaye, Calvin Chow Greg does Karina Bull, Geoff Simms, Yolanda Ho, Paddy Reagan and Kirsten Aristide.'",
        "'speaker_7': 'And done eda for everything that you have done to help myself and me make available all the people's budget amendments and for your commitment for on the issues. There are many people in the staff who have worked on other parts of the budget, but these are you know, this is about the budget amendments.'",
        "'speaker_7': 'And I apologize if I left any names out accidentally. I definitely also want to thank Amy Gore specifically for doing the final draft of our TNC and Restorative Justice amendments the last few days. I know that was rushed work, but it was done extremely well.'",
        "'speaker_7': 'I also thank councilmembers who have supported the amendment, and I also think that the support we've had from our activists around the city and especially those of us who have really campaigned around the people's budget amendments. And I wanted to say, you know, because it is also this this is a budget vote that we're taking after an'",
        "'speaker_7': 'incredibly historic election season where we had, you know, for for several months, I was saying we have had everything but the kitchen sink thrown at us. And then the kitchen sink was also thrown at us and we were able to prevail.'",
        "'speaker_7': 'And I think the people's budget, the successes that we have won to the people's budget movement and this is the sixth iteration of the People's Budget campaign that we have done this year is a small but important example of what you can win when you build a really active movement.'",
        "'speaker_7': 'I want to thank everybody who has campaigned not only for the people's budget demands this year, but for all the six years that we have done it. And I think it shows and as I said, in a small way, but in an important way, the people's budget successes show that organizing works, that when you fight, you do'",
        "'speaker_7': ', indeed, when you don't win everything every single time. But it really works. Some of the specific examples that we are one that are, you know, prominent this year but also have come on the shoulders of organizing for several years.'",
        "'speaker_7': 'Today, the Seattle Times has a really prominent article on the law enforcement assistance version. And Dan Diekman, one of the coauthors of the article, is right here, and I want to thank him also personally for his coverage of for several years on many important issues.'",
        "'speaker_7': 'And, you know, just to make a distinction between the Seattle Times reporters and The Seattle Times editorial board, talk two totally different components. I couldn't resist that. But, you know, the progress that we have seen this year on the law enforcement agencies diversion and undoubtedly I'm thankful to all the council members who have supported this.'",
        "'speaker_7': 'But narratives matter. And if our narrative is that a very generous council that this or that, I think it misses the point. As a matter of fact, expanding the lead and in fact having lead take form in the first place required community advocates to really, really push forward.'",
        "'speaker_7': 'Community advocates like Lisa Dugard and others who are sitting here who have played an incredible grassroots role. And I'm sure Lisa and others, you will remember the townhall that we did at the Miller Community Center on Capitol Hill several years ago, I think five years ago now.'",
        "'speaker_7': 'And there we built the initial pressure to expand lead from its original pilot in Belltown to Capitol Hill. And in fact, that meeting was momentous because I remember we I was actually treasurer of modestly trying to say, okay, can we please do Capitol Hill?'",
        "'speaker_7': 'And then we had representatives from the NAACP come there and say, why aren't you talking about a central district? And that's how that took shape. And I think that's extremely important to recognize. Doctor Mosquito, you mentioned the tiny house villages.'",
        "'speaker_7': 'It's very important and I thank you for signing in support of. Then I look forward to the passing the bill next year to make the land use code flexible so that we can also make sure that Daniel's villages can be sited throughout the city.'",
        "'speaker_7': 'And I thank you in advance for all your support on that one as well. And I'm excited about that. And thank you Councilmember Back show for also for supporting this. But I also wanted to make clear that one of the key things that this council did, you know.'",
        "'speaker_4': 'In in.'",
        "'speaker_7': 'Contrast to what the mayor has done, which is really important, is to take a really strong position against shutting down tiny house villages. And the initial proposal from the mayor has been to shut down Georgetown and not leg.'",
        "'speaker_7': 'And we are absolutely I think we are united in not shutting down Georgetown. But I also want to reiterate in solidarity with Nicole as well that we don't want to shut down like either. I know that there are issues and we need to resolve those issues.'",
        "'speaker_7': 'But shutting down a tiny house village is not a solution. It's never going to be a solution. And I find it quite egregious. And in the middle of a very cold winter, the mayor is proposing that December 9th is a date.'",
        "'speaker_7': 'I don't think that is viable. And I really appreciate community members, including host community members like Carol and others who have been here, who have said that they're going to be standing there, even engaging in nonviolent civil disobedience, disobedience, if that is needed.'",
        "'speaker_7': 'And of course, you can be sure my community organizers and I will be there in solidarity with them. I also want to. They say very clearly, we do. We don't want to pit and hand shoulders against Chinese soldiers because we do need to expand and shelters also.'",
        "'speaker_7': 'But we have to be clear that the the majority demand from home people who have experienced homelessness is for tiny house villages. It is not for enhanced shelters. Let's be very clear about that. We've also seen incredible community organizing to the people's budget from the Vietnamese Senior Association.'",
        "'speaker_7': 'And many of these seniors have put young people to shame by their enthusiasm and their energy. And I think they are not going to be stopping there. I think they want to fight for free, free public transit, among other things, and I'm really inspired by them.'",
        "'speaker_7': 'We were also able to win $15,000 for dedicated funding for Indigenous Peoples Day. I'm glad to say Councilmember Suarez and I were able to push for that together. And controversial. You already mentioned the mobile bathrooms. A real change said everybody poos and there and they have a chocolate cake not a book to celebrate the victory.'",
        "'speaker_7': 'And very, very importantly, we were able to win funding for one, a city funded only against evictions faced by renters. Last year, we saw just the unbelievable effectiveness in preventing evictions and preventing evictions. One of the major things we need to do to prevent homelessness.'",
        "'speaker_7': 'And so we were able to win one Adani in the initial draft of the budget. And then because of continued organizing, we were able to win two, organize, funded. And I think that is incredible as well. We also have won two important statements of legislative intent.'",
        "'speaker_7': 'One supports the demands of workers and their unions and the film and music industry. And I really thank Doug Newman and the whole consortium of labor unions who have spoken up to be included and also for those yet another one to ask the Seattle Department of Transportation to make.'",
        "'speaker_7': 'Funding proposals to make public transit free for all. And I think this is an incredibly important component of a Green New Deal. We're not going to win a green a real green new deal and a reduction in carbon emissions unless public transit is made free for all.'",
        "'speaker_7': 'So it doesn't matter what income you have, what age you are, you get to ride on public transit. And and finally but not least, we have just won the $522,600 that community organizers and activists have been demanding for restorative justice programs like Community Passageways, Youth Consortium, Corner Riders and Creative Justice.'",
        "'speaker_7': 'And that and I as I said this morning, I was so happy that that Councilmember Robert Shaw and I were able to co-sponsor that amendment. I'm glad we found a way to do that. And I wanted to really credit the community activists who have gone the extra mile to able to be able to win this.'",
        "'speaker_7': 'And they were right when they said in public testimony that this is only the beginning. Just to put this in perspective in numbers, the police get more out of the city's discretionary funding than any other department, 409 million.'",
        "'speaker_7': 'That is almost a thousand times more than restorative justice programs that, you know, the funding that we won this this year around. So we're talking about the fact that we have a lot know we have a long way to go.'",
        "'speaker_7': 'The city is spending more money on motivational speaker training for police sergeants than it is on racial justice at this moment. And so I think that's also important to recognize. So we have one incredibly important component. And as I said, I voted yes on the package of amendments that makes the mayor's budget proposal better.'",
        "'speaker_7': 'And I have been happy to support my colleagues proposals as well. However, and this will come as no surprise to my two other councilmembers I'm going to vote no on the whole budget. So I just want to make it clear I voted yes on all the amendments that make the budget more positive, but this is a vote'",
        "'speaker_7': 'on the budget as a whole, and I cannot and I've never been able to in good conscience vote for a budget that, despite the gains that were won on the council, still represents changes on the margins. And when you compare the budget, that is supposed to be a moral document to the social needs of our city and'",
        "'speaker_7': 'the deep inequality and racism in our city, it simply is not a moral document as far as what we have right now. It continues to rely on regressive taxes that burden poor and working class people. While corporations continue to get a free ride.'",
        "'speaker_7': 'It continues to fail to address the housing and homelessness crisis. Despite the gains that were made to our amendments, it continues to prioritize repressive policing over actual justice to our communities of color. It prioritizes regressive, regressive measures like tolling.'",
        "'speaker_7': 'And I don't want to be told yet again that somehow there is some progressive way of doing it, because as an economist, I have never seen a conjunction doling that is progressive. If there is, I'm happy to support it.'",
        "'speaker_7': 'But as of now, that is just funding, though what the mayor has proposed is simply funding propaganda to push this idea rather than guaranteeing renters a right to a lawyer and know. Because it's not enough what we have.'",
        "'speaker_7': 'One social service workers continue to be paid poverty wages in a city with some of the richest people in the world. So with all this insight, the budget still fails to meet human need. And I really hope that because of the mandate that we have won this year, that movements will come back next year with renewed vigor'",
        "'speaker_7': ', with strong statistical evidence that when you fight, you do win. Because we saw that happening this year, despite everything thrown at us, we were able to prevail. And I don't want us to rest on our laurels. And I hope that when January comes around, we will get back to serious organizing to win taxes on big business, to'",
        "'speaker_7': 'win rent control, and to make this city affordable and livable for everybody. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Swamp. Before we proceed, I do want to remind all of my colleagues we do have a parks board meeting after this meeting. Just to remind you. Councilmember O'Brien, would you like to say a few words on the budget?'",
        "'speaker_2': 'Q I, I just want to thank Councilmember Bakeshop for your leadership in the last two years on this. You've done an amazing job of balancing the needs of people in our city and council members. You've done a very successful job of shepherding our interests in a way that gets all of us wins in the areas you want'",
        "'speaker_2': '. You've also created space for us to have the public debate over issues and fight on on those things that are really important. And that's not an easy balance. I've never tried to get that job in my ten years here, and I'm grateful that you were willing to serve in that role, because I know it's a lot of'",
        "'speaker_2': 'work, something. Your customer base, I.'",
        "'speaker_0': 'Think it comes from Brian comes from members on my right comes from Gonzalez.'",
        "'speaker_1': 'I'm going to be fast.'",
        "'speaker_5': 'So I wanted to thank Councilmember Bagshaw as well. So that's a good pick up for me. I just really appreciate the last two years of the process that you've shepherded us through and let us through really appreciate all your leadership and your ability to be able to prioritize so many different desires and needs from your colleagues.'",
        "'speaker_5': 'Appears a really want to thank you for for the work that you've done over the last couple of years to make sure that this is a successful process. Also, I want to thank council central staff. You guys are amazing and do really awesome work and really appreciate your responsiveness and and just your the countless number of hours'",
        "'speaker_5': 'that I know that you all have worked to make sure that we have a balanced budget that really does reflect the council's priorities. So thank you all for that. I also want to thank my own staff, Cody, Brianna and V for all the hard work that they've been doing to make sure that our officers funding priorities are'",
        "'speaker_5': 'included in the budget. I just wanted to take a quick minute to go through some of the things that we're exceptionally proud of in terms of items that were included by the chair in the 2020 budget that we'll be taking action on.'",
        "'speaker_5': 'Now, we're really excited about being able to champion fully full funding for civilian led police oversight agencies. We're stoked about being able to provide additional resources to the Regional Domestic Violence Firearm Enforcement Unit to get dangerous guns off of our streets.'",
        "'speaker_5': 'We have advanced several statements of legislative intent to implement reentry workgroup recommendations to support formerly incarcerated individuals who seek to reenter the economy. We have also included statements of legislative intent to examine the impact of our investments in the criminal legal system on communities of color and other vulnerable populations.'",
        "'speaker_5': 'We've included additional funding for hub in the box, emergency response, emergency management communication stations across the city. We've included some funding for a public life study for the Capitol Hill Echo District to activate public spaces for climate resiliency and stronger community connections.'",
        "'speaker_5': 'We've allocated about $100,000 to address the diaper gap for families reliant on shelters, tiny villages, food banks and child care facilities. We've also included some additional funding and direction to the Department of Education and Early Learning to expand birth to three child care options, including investing in comprehensive development of a comprehensive set of strategies to be able'",
        "'speaker_5': 'to expand access and and affordability for Seattle families in the birth to three child care category, we've directed that the expansion of additional child care assistance program dollars be prioritized for infant care. We've modified the ADA in India ADU financing to make sure that it is within reach for low to middle income families with a racial equity'",
        "'speaker_5': 'lens applied to make sure that the future pilot doesn't unintentionally exclude communities of color. We have proudly championed a $750,000 pilot program. The hope the Home for Good Pilot Program.'",
        "'speaker_1': 'To provide a rental assist to provide rental.'",
        "'speaker_5': 'Assistance to to those individuals who may be on disability benefits and facing housing instability. Really want to thank so many of the advocates, the Spokane County Homeless Coalition, for their.'",
        "'speaker_1': 'Advocacy.'",
        "'speaker_5': 'In bringing the issue to us to really talk about why it was important for us to take this interim step. So this is a huge investment. Really proud of it, really grateful for all of the collaboration both in City Hall and outside of City Hall to stand this up and really looking forward to the impact that we're'",
        "'speaker_5': 'going to be able to have, the positive impact we're going to be able to have with with that investment. And then.'",
        "'speaker_1': 'Lastly, we were able to establish.'",
        "'speaker_5': 'A $375,000 resiliency fund to support our immigrant refugee neighbors from ongoing and emerging threats from the Trump administration in partnership with the Office of Immigrant and Refugee Affairs and so many of the community leaders who have identified that we need to be ready in 2020 for the ongoing attacks on immigrant and refugee folks who live in in'",
        "'speaker_5': 'our city. So really honored to have been able to champion some of these additions to the 2020 budget and really am grateful to Chair Bagshaw for hearing our priorities in my office and for including them in her budget.'",
        "'speaker_5': 'Really, really appreciate it and really proud of the work that my team has been able to do through this budget process to make sure that this budget reflects our priority.'",
        "'speaker_0': 'Thank you, Councilman Gonzales, because of our.'",
        "'speaker_5': 'Vote. Thank you. In addition to appreciating, honoring, valuing and just really not any words to say how helpful and useful the work of several staff has been through this budget process. Thank you. Thank you. I want to thank also my staff, Alex, Noel, Jean and Dmitri.'",
        "'speaker_5': 'Thanks to the budget chair for being very, very patient with me in particular and not pushing too hard when sitting down and in my office and hearing what my budget priorities are. My resistance to narrowing.'",
        "'speaker_4': 'Them down too much.'",
        "'speaker_5': 'And how patient you have been with me in my resistance to wanting to to give anything up. So I'm really pleased with how this budget has resulted in important budget initiatives for my district as well as for citywide issues that are really important to me.'",
        "'speaker_5': 'So as far as the District one specific proposals, I'm really excited that the D1 community network led the way to get funding for their West Marginal Way, Safe Streets and accessibility improvements at the Long Duwamish Longhouse, specifically new funding for planning and design of that project.'",
        "'speaker_5': 'Really excited that we've been able, by working with the residents of South Park and the Public Safety Committee, that we've been able to continue funding for a South Park public safety coordinator. That position is so important to that community in raising their voice to address their public safety needs in that neighborhood.'",
        "'speaker_5': 'Getting a commitment that we will receive some information from the Department and neighborhoods on a strategy to develop a community led, police based violence prevention initiative in Westwood and South Ridge to help address some of the public safety issues there and hopefully have it be modeled on the very successful Rainier Beach, a beautiful place focused on young'",
        "'speaker_5': 'people in that in that community as a restorative justice approach, also putting forward the ongoing and continued focus on the work being done for the rapid, rapid Ride H line. The budget actions that we've taken allow us to have continued focus on that work and make sure that the community's voice is heard.'",
        "'speaker_5': 'Finally, as it relates to District One issues, appreciate that the funding for a natural capital evaluation study is included in this year's budget. This is led by the Seattle Greenspaces Coalition, something that they've been working on for four years now to get the city to actually begin to continue, consider the value of our of our natural assets'",
        "'speaker_5': ', in our in our planning process. And then as far as some of the citywide priorities I have, as well as community members related specifically to public safety and public health, we were successfully able to add funds for a third firefighter recruit class to address long term staffing needs, while also giving them the flexibility to expand the sizes'",
        "'speaker_5': 'of their two existing recruit classes. We've added funding to expand the Encampment trash program of Seattle Public Utilities, allowing them to pick up garbage at more unsheltered encampment locations throughout the city. We have as been as has been stated earlier, we worked with the Real Change Everybody Pooh's campaign to fund five mobile pit stops to increase access'",
        "'speaker_5': 'to bathrooms and hygiene centers. And then we've also added funding again in SPU for a pilot program of mobile pump out services to Arby's to limit the environmental damage to our waterways as it relates specifically to homelessness and housing.'",
        "'speaker_5': 'As I mentioned earlier, I appreciate having the opportunity to work with both council members, Gonzalez and Juarez, in getting some funding into two initiatives that they had already proposed to actually deal specifically with the needs for diaper distribute distribution on one one area, diaper distribution in shelters and in the other diaper distribution in hopefully in in child'",
        "'speaker_5': 'care centers. We're also looking at. In the area of housing, adding funding to the Department of Construction inspections for two new positions to support tenant and property owner outreach and education associated with the about five new pieces of legislation that we've passed in the last couple of months.'",
        "'speaker_5': 'These new positions will allow the Department of Construction and Inspections to support tenants in having their rights enforced under those laws. Also adding funding for renters rights, outreach and education organizing. Many thanks to Washington can be Seattle, the tenants union and allyship and advocating for that for that work.'",
        "'speaker_5': 'And then our continued proviso on the navigation team appropriations in the Human Services Department so that this Council can continue to have appropriate oversight over the work that's being done around engagement with people living in encampments and maintaining the public safety of of the locations where those encampments are found.'",
        "'speaker_5': 'As it relates specifically to civil rights issues. I appreciate the opportunity to direct existing funds to community based organizations to respond to hate violence, as well as separately from that, requesting that the Office of Civil Rights spend a portion of its 2020 proposed budget on community based organizations that will create restorative justice approaches to individuals committing hate'",
        "'speaker_5': 'crimes and adding two new permanent positions for the Office of Civil Rights for a dispute resolution mediator, and another to help with anti-discrimination and anti-harassment training. Many thanks in the area of transportation and utilities to transit for all in their work.'",
        "'speaker_5': 'To advocate for a report from the Human Services Department on how we can work to subsidize transit passes for employees of Human Services Department contracted service providers, as well as funding to Seattle Public Utilities to improve, shut off notification to tenants in multifamily buildings who often do not get advance notice of impending shut offs.'",
        "'speaker_5': 'And then finally, in the area of economic development in arts and culture, I want to thank the workers and members of the labor movements representing the film, film and music industry. Folks specifically looking to redirect admissions tax to body OED specifically for a film and music program lead to help the film industry, requesting that the Office of'",
        "'speaker_5': 'Economic Development provide recommendations regarding the creation of a film commission. Imposing a proviso on the funding for the Creative Industry Policy Advisor position to require engagement with the film industry in developing the responsibilities for this position. And then lastly, related to arts, really appreciative of the ability to direct funding to support the Seattle Rep's Public Works program'",
        "'speaker_5': 'for for the opportunity for the Seattle Rep to work with many of our service provider and the recipients of services in our city to give them the experience of producing and participating in a live theater work. Thank you.'",
        "'speaker_0': 'Thank you. Cathy. Horrible. Kathryn. Rebecca, would you like setting words on the budget? And I do have time reserved at the end of the agenda for you especially, but.'",
        "'speaker_2': 'They just took the words from my mouth. But just thank Councilman Rebecca Shaw for being leading a very inclusive process in this budget.'",
        "'speaker_0': 'Thank you, Kathryn Pacheco. Okay, so let's vote on item number 32. Please call the role on the passage of the bill.'",
        "'speaker_1': 'Pacheco, i. So what?'",
        "'speaker_4': 'No.'",
        "'speaker_1': 'Major Gonzalez. Purple Eye, Juarez Mascara. Hi, O'Brien. Hi, President Harrell. Hi. Eight in favor.'"
    ],
    "AN ORDINANCE relating to the levy of property taxes; fixing the rates and/or amounts of taxes to be levied, and levying the same upon all taxable property, both real and personal, in The City of Seattle, to finance the departments and activities of City government and to provide for the general obligation bond interest and redemption requirements for the year beginning on the first day of January 2020; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'One opposed bill passed in show Senate. Thank you. Thanks for staying here to please read items 33 and 34 together short time if you can.'",
        "'speaker_1': 'Agenda items 33 and 34 Council 119 691 relating to the levy of property taxes. The committee recommends the bill passed Council Bill 1196 and 82 authorizing the levy of regular property taxes by the city of sale for the collection in 2020.'",
        "'speaker_1': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Any questions or comments? We're good. Okay. Please call the rule on the pass of council bill 119691.'",
        "'speaker_1': 'Pacheco I Siwan Bagshaw High. Gonzalez Purple High. Juarez Mesquita. O'Brien High. President Harrell High nine in favor nine opposed.'",
        "'speaker_0': 'The past and shortsighted and any questions on number 34. If not, please call the role on the passage of the bill.'",
        "'speaker_1': 'Pacheco. I want. I beg your. Gonzalez Herbold i. Suarez Macheda. I. O'Brien. High President Harrell. I favor, not oppose.'"
    ],
    "AN ORDINANCE relating to the Seattle Streetcar; authorizing execution of a new interlocal agreement with King County for operation and maintenance of the Seattle Streetcar system; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'The bill passed in the show senate. Please read the report to the Sustainability and Transportation Committee.'",
        "'speaker_1': 'The Report of the Sustainability and Transportation Committee Agenda 35 Council 119704 relating to relating to the sail streetcar. The Committee recommends the bill pass.'",
        "'speaker_0': 'Cast Member O'Brien.'",
        "'speaker_2': 'Q This, as I mentioned this morning, this is a local agreement between the city and King County for operation of the existing streetcar systems. That's the one on first health Capitol Hill and the one in South Lake Union.'",
        "'speaker_2': 'This will renew the existing Interlocal agreement which expires at the end of the year. A couple of changes. One is this will be a five year agreement with an option for the city to extend the agreement for two more five year terms.'",
        "'speaker_2': 'We also be moving towards monthly billing, a reconciliation system as opposed to what had been an annual system for a while, and also shifting some of the maintenance requirements for the for the streetcar. Barnes to the county.'",
        "'speaker_0': 'I think you can see from Brian any questions or comments that please call the roll on the passage of the bill Pacheco.'",
        "'speaker_1': 'So what I beg John Gonzalez I Herbold II Suarez Moschella. O'Brien. High President Harrell. 9 a.m. favor unopposed.'"
    ],
    "Petition of Willow Crossings, LLLP, to vacate a portion of 39th Avenue South and south of South Willow Street.": [
        "'speaker_0': 'Still passed Chair of Senate. Please read the next agenda item.'",
        "'speaker_1': 'Agenda item 36 Clerk file 314 422 Petitioner Willo Crossing LLP to vacate a portion at 39th Avenue, South and South Willow Street. The committee recommends the application be granted as conditioned.'",
        "'speaker_0': 'House member O'Brien.'",
        "'speaker_2': 'Thank you. So there's a vacation. There's a vacate. A portion of 39th Avenue South, just south of south Willow Street. This is for a private developer doing a affordable housing project. A little over 200 units at 60%. Ami without the city housing levy or other funds, they did get a loan from the city's acquisition fund to acquire'",
        "'speaker_2': 'the land. When the project's complete, they'll be paying that back so there'll be no permanent city dollars. But we do get 20 years of permanent 60% and my affordability for the 200 units. There are other public benefits, including public spaces and I believe a $25,000 donation to a project a block away.'",
        "'speaker_2': 'That's a community driven project to improve the streetscape. This project and that and the investment in that other project are all near the Othello light rail station.'",
        "'speaker_0': 'Thank you, Councilwoman Brian. Any questions or comments? If not those in favor of granting the petition as conditions, please vote i. I. Those oppose vote no. The motion carries the petition is granted as condition. And Cheryl Simon going to move to item number 37.'",
        "'speaker_0': 'Please read 37 into the record.'"
    ]
}