{
    "A RESOLUTION regarding a voter-proposed Initiative Measure establishing a public development authority (PDA) to build and operate a mile-long elevated park and other amenities along Seattles waterfront, integrating one block of the existing Alaskan Way Viaduct into the design of the elevated park; authorizing the City Clerk and the Executive Director of the Ethics and Elections Commission to take those actions necessary to enable the proposed Initiative to appear on the August 2, 2016 ballot and the local voters' pamphlet; requesting the King County Elections' Director to place the proposed initiative on the August 2, 2016 election ballot; and providing for the publication of such initiative.": [
        "'speaker_0': 'The bill passes and the chair will sign it. The report to the full council. Please read item number one.'",
        "'speaker_6': 'The report to the full council agenda. Item number one, resolution 31607. Regarding a voter proposed initiative measure establishing a Public Development Authority PTA to build and operate a mile long elevated park and other amenities along Seattle's waterfront, integrating one block of the existing Alaska Way Viaduct into the design of the elevated park, authorizing the city clerk and'",
        "'speaker_6': 'the executive director of the Ethics and Election Commission to take those actions necessary to enable the proposed initiative to appear on the August 2nd, 2016 ballot and the local voters pamphlet requesting the King County Elections Director to place a proposed initiative on the August 2nd, 2016 election ballot and providing for the publication of such initiative introduced August'",
        "'speaker_6': '17, 2015.'",
        "'speaker_0': 'Thank you. As we know, this matter qualified from King County elections by gathering the necessary signatures. In 2012, the City Council passed Resolution 31399, which established the city's support for the Strategic Plan Central Waterfront Concept, Design and Framework Plan and the funding plan for the Waterfront Redevelopment and improvements which rely on the removal of the Alaskan Way'",
        "'speaker_0': 'Viaduct as planned by the state. Proponents of Initiative 1 to 3 favor the establishment of a public development authority to build and operate a mile long elevated park and other amenities along Seattle's waterfront. Integrating parts of the existing Alaskan Way Alaskan Way Viaduct into the design of the elevated park and have submitted to the Office of the'",
        "'speaker_0': 'City Clerk a petition bearing sufficient signatures to qualify for the ballot. The measure before US Resolution 31607 rejects initiative Measure 123 as being inconsistent with the strategic plan, the Central Waterfront Concept, Design and framework plan, and the funding plan for the Central Waterfront Redevelopment and improvements.'",
        "'speaker_0': 'This resolution would send this matter to the August two, 2016 election ballot, which is the next regularly scheduled election. I move adoption of resolution 31607. It's moved in seconded. Are there any comments? All in favor of adopting Resolution 31607 Vote I II oppose Vote No.'",
        "'speaker_0': 'The resolution is unanimously adopted in this measure, is sent to the August 2016 ballot, and the chair will sign it. The report of the Energy Committee, please read item two.'"
    ],
    "AN ORDINANCE relating to the City Light Department; and amending Section 21.49.042 of the Seattle Municipal code to align income eligibility guidelines for the utility-funded Emergency Low-Income Assistance program with other city rate assistance programs and allow year-round program operation.": [
        "'speaker_6': 'The Report of the Energy Committee Agenda Item two Council Bill 118479 relating to the City Light Department and amending sections 2.49.042 of the Seattle Municipal Code to align income eligibility eligibility eligibility guidelines for utility funded emergency low income assistance program with other city rate assistance programs and allow year round program operation.'",
        "'speaker_6': 'The committee recommends a council bill pass.'",
        "'speaker_0': 'Thank you. Council member so on.'",
        "'speaker_2': 'Thank you, Brian Burgess. This council bill will change the eligibility requirements for the Emergency Low Income Assistance Program to make them the same as those used by the utility discount program. And that benchmark is earning 70% or less of the state median income.'",
        "'speaker_2': 'This change would facilitate two purposes. First, it will make processing applications more efficient because there will be only one set of requirements instead of two. And second, it will end up making more people eligible because the new requirements are more inclusive than the old.'",
        "'speaker_2': 'The committee unanimously recommends passing.'",
        "'speaker_0': 'Thank you. Questions or comments, Councilmember Beckstrom.'",
        "'speaker_2': 'Thank you. Councilmember Swan, thanks for working on this. Can you tell me, is this going to be run through Seattle City Light or through Department of Human Services? As of now, through Seattle City Light? And interestingly, sort of in the context of the what you brought up, we've been talking about it, as you know, you and I'",
        "'speaker_2': ', about expanding the utility discount program. And one of the points that was made by Seattle City Light is that the more we expand UDP, the less people will be needing this program. So as a matter of fact, the two go hand in hand.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_0': 'Please call the role on the passage of the bill.'",
        "'speaker_8': 'Gordon I.'",
        "'speaker_1': 'Harrow.'",
        "'speaker_9': 'I.'",
        "'speaker_1': 'O'Brien, I. Okamoto, I. Rasmussen I want my back shop and President Burgess Aden favored and opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. The report of the Finance and Culture Committee. Please read item three.'"
    ],
    "AN ORDINANCE authorizing, in 2015, acceptance of funding from non-City sources; authorizing the heads of the Executive Department, Department of Planning and Development, Department of Parks and Recreation, Human Services Department, Seattle Police Department, and the Seattle Public Utilities to accept specified grants and private funding and to execute, deliver, and perform corresponding agreements; and ratifying and confirming certain prior acts.": [
        "'speaker_6': 'The Report of the Finance and Culture Committee Agenda Item three Council Bill 118452 authorizing in 2015 acceptance of funding from non city sources authorizing the heads of the Executive Department, Department of Planning and Development, Department of Parks and Recreation, Human Services Department, Seattle Police Department and the Seattle Public Utilities.'",
        "'speaker_6': 'To accept to accept specified grants and private funding and to execute, deliver and perform corresponding agreements and ratifying and confirming certain prior acts. The Committee recommends the Council bill pass.'",
        "'speaker_0': 'Thank you, Councilmember God.'",
        "'speaker_8': 'This Council bill will accept is a grant acceptance ordinance sent along with the second quarter supplemental. This Council bill will allow the acceptance of 3.675 million in grants. The committee unanimously approved its passage.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Gordon I. Harrell, I. O'Brien Okamoto. Rasmussen All right, so want.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'Back show and President Burgess eight in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item four through the first semicolon.'"
    ],
    "AN ORDINANCE relating to the 2015 Budget; amending Ordinance 124648, which adopted the 2015 Budget, including the 2015-2020 Capital Improvement Program (CIP); changing appropriations to various departments and budget control levels, and from various funds in the Budget; creating new appropriations; adding new projects; revising project allocations for certain projects in the 2015-2020 CIP; creating both exempt and nonexempt positions; abrogating positions, modifying positions, making cash transfers between various City funds; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_6': 'Agenda item four Council Bill 118453 relating to the 2015 budget amending ordinance 124648, which adopted the 2015 budget, including the 2015 to 2020 Capital Improvement Program Program. C. I. P.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Councilmember gotten council bill 118453 is a second quarter supplemental ordinance. This council bill proposes adjustments to the 2015 adopted budget and includes funding for a new labor economist position to coordinate the work of the workforce equity and funding to coordinate performance management.'",
        "'speaker_8': 'We're very pleased about the fact that the new Labor Economist position will be very good for analyzing the gender wage gap within city department and we urge its passage.'",
        "'speaker_0': 'Thank you. Questions or comments? Council Members one.'",
        "'speaker_2': 'This is the item that's listed number five in the agenda.'",
        "'speaker_0': 'Number four.'",
        "'speaker_8': 'It's number four, but I guess mine says number five.'",
        "'speaker_2': 'Yeah, it's related to the previous burglary. But I did.'",
        "'speaker_8': 'I did quote the proper council bill number.'",
        "'speaker_0': 'Yeah. We're we're on item number four, which is the capital improvement budget.'",
        "'speaker_6': 'It's because we.'",
        "'speaker_0': 'Go ahead, Councilmember Swan, if you have any questions.'",
        "'speaker_2': 'Yes. I mean, this is just to make clear, this is a supplemental budget appropriations. Yeah, we're talking about. Yes, I'm voting yes, but I just wanted to take a moment to highlight the process that's being used. I mean, this is the summary of the changes to the city's budget that are included in this quarter's supplement.'",
        "'speaker_2': 'It's a pretty thick booklet, as you can see. I don't know if anyone has had a chance to read through this, but it's 22 pages of summaries. Many of these are small. Some of these are small changes, but many of them are not.'",
        "'speaker_2': 'They're substantive issues of city priorities. And some of the line items are million dollar changes. I'm not sure how it's possible to have a meaningful discussion about these items when they come as a package like this. And I'm sure that the committee discussed it as much as is possible.'",
        "'speaker_2': 'But I think that just for a future reference, these issues should be discussed one at a time as they come up not lumped together into one document of 98 different budget actions and extra credit to any of my colleagues who can name three of them without looking, which would be a does not of your memory, but of'",
        "'speaker_2': 'the fact that this process is so, you know, sort of really omnibus. But even though it should be actually individually discussed. One item I do want to highlight myself is an example of an extremely important item that truly deserves its own discussion.'",
        "'speaker_2': 'And it reads, This item transfers appropriation authority in the amount of $1.7 million from the litigation expenses of to the police action vehicle. The judgments and settlements are anticipated to exceed the available appropriation in the Police Police Action Vehicle in 2015.'",
        "'speaker_2': 'Does this mean that the Seattle Police Department expects to have to pay more money in lawsuits this year than in the past? What are the lawsuits or are they excessive force lawsuits? Are they related to free speech issues around Black Lives Matter protests?'",
        "'speaker_2': 'I think this sort of line item is an example where it's not just it should not just be part of a nine year item summary, but should be a separate discussion. Who is it? Who is accountable for the extra $1.7 million?'",
        "'speaker_2': 'And even more important, who is accountable for the $1.7 million worth of harm that is done to our communities for which the SBT will face lawsuits? My point is not simply about this packet of budget appropriations. It is generally about how can we structure these discussions to maximize democratic participation of the public in important issues?'",
        "'speaker_2': 'Again, I am not I am very confident that the Finance Committee has discussed this. This is not to point a finger at them, but just to discuss how we can do this going forward. Given that much of this agenda item funds important city department and programs and contains the logistical changes necessary for routine operations, I will not'",
        "'speaker_2': 'stand in the way of its passage, but I want to stress that they should have much more democratic participation.'",
        "'speaker_0': 'Any other questions or comments? Councilmember. So often these items were discussed in detail and there is a central staff memo that summarizes the various changes. The Budget Office and department folks appeared before the committee. I think we had three separate committee.'",
        "'speaker_8': 'Meetings as members.'",
        "'speaker_0': 'And you're certainly welcome to attend those and participate with regard to the Police Action Fund. There's a summary of those cases. It's distributed to council members and you could review those and then ask the law department questions about any of those matters that you're concerned about.'",
        "'speaker_0': 'Any other questions or comments?'",
        "'speaker_4': 'Councilmember Herold I would just add that the Council has had in place at some point any lawsuit that we settle that's 500,000 or more are required to come to the council for discussion. Many of us in the plaintiffs community talk to plaintiffs lawyers, and we know I've referred many cases actually to people to sue the city.'",
        "'speaker_4': 'I want sued the city of, well, more than once. And so these discussions are had to make sure that we are accountable. Quite frankly, we are self-insured, self insured as an entity, and many people encourage us to keep us accountable out there in the plaintiffs community.'",
        "'speaker_4': 'I think Councilman Swann's points are are understood, but hopefully we have the right policies in place to make sure that when we are liable, we are liable. And there are proven cases where we have been liable. And I want to certainly commend the process where these are brought to the council and we've been have had an opportunity'",
        "'speaker_4': 'to discuss them.'",
        "'speaker_0': 'Please call the roll and the passage of the bill.'",
        "'speaker_1': 'Gordon Harrell.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'O'Brien All right. Okamoto Rasmussen All right. So want I Bagshot and president Burgess eight in favor then oppose the bill.'",
        "'speaker_0': 'Passes and the chair will sign it. Please read item five.'"
    ],
    "AN ORDINANCE declaring the Property at 339 22nd Avenue East (PMA 156) as surplus to the Citys needs; authorizing the Director of Finance and Administrative Services to sell two parcels through an open and competitive process; and designating the disposition of sales proceeds.": [
        "'speaker_6': 'Agenda item five Council Bill 118412. Declaring the property at 339 22nd Avenue East. PMA 156 as surplus to the city's needs, authorizing the Director of Finance and Administrative Services to sell two parcels through an open and competitive process and designating the disposition of sale proceeds.'",
        "'speaker_6': 'The Committee recommends the Council bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_8': 'This legislation council bill 118412 was revised by Councilmember Liccardo and the Finance and Culture Committee to direct funding from a property sale to low income housing. This is a surplus property not suitable for housing development, so the proceeds will be directed to low income rental housing, half of those with 60% less medium income, half to those with'",
        "'speaker_8': '30% less annual median income. It is estimated to raise $700,000 towards low income housing. The committee recommends passage.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_8': 'Gordon by.'",
        "'speaker_1': 'Harrell O'Brien. Hi, Okamoto. Rasmussen. Right. So want shot. And President Burgess. Eight in favor. Nine opposed.'"
    ],
    "AN ORDINANCE relating to the Department of Finance and Administrative Services, declaring the vacant property located at 5622 40th Avenue West as surplus to the Citys needs; authorizing the sale of said property; authorizing the Director of Finance and Administrative Services to execute all documents for the sale and transfer of the property; and directing how proceeds from the sale shall be distributed.": [
        "'speaker_0': 'The bill passes and the chair will sign it. Please. Rate item six.'",
        "'speaker_6': 'Agenda Item six. Council Bill 118472. Relating to the Department of Finance and Administrative Services declaring the vacant property located at 5622 40th Avenue West as surplus to the city's needs, authorizing the sale of said property, authorizing the Director of Finance and Administrative Services to execute all documents for the sale and transfer of the property and directing how'",
        "'speaker_6': 'proceeds from the sale shall be distributed. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Councilmember Gordon Counter Bill 118472. This bill allows for the sale of surplus property at 5622 40th Avenue West is a small parcel between two lots. It is too small for development to the adjacent property owner who will be purchasing it for $26,250.'",
        "'speaker_8': 'The Council. The Committee recommended to passage.'",
        "'speaker_0': 'Questions or comments. Please call the roll on the passage of the bill.'",
        "'speaker_1': 'Gordon. I Harrell. I O'Brien. II Okamoto.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Rasmussen. All right. So want a back show and President Burgess eight in favor and opposed.'",
        "'speaker_0': 'The bill passes in the chair will sign it please read item seven.'"
    ],
    "AN ORDINANCE authorizing the Director of Finance and Administrative Services to execute an amendment extending certain lease agreements between The City of Seattle and KBS SOR CENTRAL BUILDING, LLC, a Delaware limited liability company, for office space the City leases at 810 Third Avenue; and ratifying and confirming certain prior acts.": [
        "'speaker_6': 'Agenda item seven Council Bill 118473. Authorizing the Director of Finance and Administrative Services to execute an amendment extending certain lease agreements between the City of Seattle and KBS. So our Central Building LLC, a Delaware limited liability company for office space, the city leases at 810 Third Avenue and ratifying and confirming certain prior acts.'",
        "'speaker_6': 'The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_8': 'This council bill allows for the. The extension of a lease agreement for space for the Human Services Department and the Office of Civil Rights Committee urges passage of this bill.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'Gordon. Hi, Carol. All right. O'Brien. All right. Okamoto. Rasmussen. All right. So want I back? Shall I? And President Burgess eight in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read item eight.'"
    ],
    "AN ORDINANCE relating to the North Precinct project in the Department of Finance and Administrative Services; amending Ordinance 124648, which adopted the 2015 Budget; authorizing the loan of funds from the Citys Consolidated (Residual) Cash Pool, or its participating funds, in the amount of $2,750,000, to the 2016 Bond Fund for bridge financing of the North Precinct  project; establishing a budget control level in the 2016 Multipurpose LTGO Bond Fund;  increasing 2015 appropriations of $1,500,000 in the 2016 Multipurpose LTGO Bond Fund; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_6': 'Agenda Item eight Council Bill 118474 relating to the North Precinct Project and the Department of Finance and Administrative Services amending ordinance 124648, which adopted the 2015 budget authorizing the loan of funds from the city's consolidated residual cash pool or its participating participating funds in the amount of 2,750,000 to the 2016 Bond Fund for bridge financing of the'",
        "'speaker_6': 'North Precinct Project establishing a budget control level in the 2016 Multipurpose Let's Go Bond Fund increasing 2015 appropriations of 1,500,000 in the 2016 and the 2016 Multipurpose Go Bond Fund and ratifying and confirming certain prior acts all by a three fourths vote of the City Council.'",
        "'speaker_6': 'The committee recommends the Council bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_8': 'Council Bill 1184785 is a bridge loan for the North Precinct Project. The loan is for 2.75 million and increases the 2015 appropriation of 1.5 million in the 2006 Multipurpose LTG o fund and will be repaid by 2016. LTG o bond.'",
        "'speaker_8': 'We urge passage.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the bill.'",
        "'speaker_1': 'I got in, Carol. I O'Brien.'",
        "'speaker_5': 'Hi.'",
        "'speaker_1': 'Okamoto. Rasmussen. I want back here. I am President Burgess. Eight in favor. Nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Please read items nine and ten.'",
        "'speaker_6': 'Agenda items nine and ten appointment 179 an appointment 178. The appointment of Marissa 810 Ameera as members Seattle Music Commission for a term of confirmation two May 1st, 2018 and the reappointment of Douglas Araf as member Museum Development Authority Council for Term of Confirmation to July 12, 2018.'"
    ],
    "AN ORDINANCE relating to land use, zoning, and environmental policy; amending Sections 3.58.070, 3.58.090, 23.22.024, 23.24.020, 23.28.030, 23.34.009, 23.40.060, 23.41.004, 23.41.008, 23.41.010, 23.41.012, 23.42.038, 23.44.010, 23.44.014, 23.44.041, 23.44.051, 23.45.504, 23.45.508, 23.45.510, 23.45.512, 23.45.518, 23.45.526, 23.45.529, 23.45.532, 23.45.536, 23.45.570, 23.46.002, 23.47A.004, 23.47A.012, 23.47A.013, 23.47A.014, 23.47A.016, 23.47A.032, 23.47A.039, 23.48.010, 23.49.008, 23.49.010, 23.49.012, 23.49.013, 23.49.041, 23.49.178, 23.49.242, Map 1I in Chapter 23.49, 23.50.020, 23.53.006, 23.53.015, 23.54.015, 23.54.025, 23.54.030, 23.58A.044, 23.66.020, 23.67.060, 23.75.140, 23.75.180, 23.76.006, 23.76.012, 23.76.026, 23.76.032, 23.84A.002, 23.84A.008, 23.84A.012, 23.84A.032, 23.84A.038, 23.86.006, 23.86.010, 23.86.012, 23.86.016, 23.88.020, 25.05.164, 25.05.508, 25.05.510, 25.05.610, 25.05.756, 25.05.800, 25.05.920, 25.05.960, 25.06.030, 25.06.050, 25.08.425, 25.08.590, and 25.08.655, and repealing Section 23.40.050 of the Seattle Municipal Code, to correct typographical erro": [
        "'speaker_6': 'The Report of the Planning, Land Use and Sustainability Committee Agenda Item 11 Council Bill 118407 relating to land use, zoning and environmental policy.'",
        "'speaker_0': 'Thank you. Councilmember O'Brien.'",
        "'speaker_9': 'Thank you. This is what we refer to as the omnibus bill. It comes through the land use committee. Every year, 18 months or so. It's a multiple page document that has a series of clean up pieces of legislation that staff basically accumulates over the course of a year or so.'",
        "'speaker_9': 'We've had a chance to review this legislation in committee over three different meetings and took public comment on this. At this point, there are three amendments that are on the agenda today to consider. And I want to talk through those in order just to clarify for folks.'",
        "'speaker_9': 'This omnibus bill is legislation that amends the current law. All three amendments we're talking about today are going to amend the omnibus bill by removing a portion. So these amendments would make the current law stay exactly as it is today.'",
        "'speaker_9': 'So it's a little confusing because we're amending a bill that amends it to undo it. So the First Amendment, I would like to put forward amendment number one, which I would move and ask for a second. This amendment relates to Wallingford design guidelines.'",
        "'speaker_9': 'So the omnibus legislation makes changes to the map where Wallingford design design guidelines apply. The Wallingford community had concerns about these changes and had not had a chance to be briefed on it. They raised those concerns in committee.'",
        "'speaker_9': 'At committee. We asked for an amendment. It wasn't prepared at the last committee meeting, so they brought that after discussion of committee. They brought that amendment to us today. This amendment would remove those map changes so the underlying existing current law would continue to apply.'",
        "'speaker_9': 'That would give the community time to hear why DPD would like to change that, and those could be considered at a future piece of legislation. I would go ahead and ask for a vote or questions on amendment number one, I guess.'",
        "'speaker_0': 'Questions or comments on the First Amendment. All in favor of approving amendment number one on the Wallingford design guidelines. Vote I. I oppose vote no. The amendment is adopted. Councilmember Harold, do you want to address amendment number two?'",
        "'speaker_4': 'Oh, I will. Amendment number two basically asked that Section eight of the omnibus legislation be removed, which would have been consistent then with what the department actually submitted for approval to the committee. Let me give a little background.'",
        "'speaker_4': 'If you look at the central staff's preparation of the committee discussions, they make it very clear what the purpose of an omnibus bill is. I'll just read from both memos, General. Generally, the omnibus bill corrects typographical errors, corrects cross-references, clarifies existing regulations, and makes other minor amendments identified by DPD in the course of code administration.'",
        "'speaker_4': 'The Omnibus Omnibus bill is not intended to be a vehicle for addressing significant policy issues. So I think Councilmember Brian and the committee that approved Section eight had some good intentions in mind about how we protect neighborhoods from developers circumventing the system, using what can be called loopholes and that kind of thing.'",
        "'speaker_4': 'And certainly we are now having discussions where we want to prohibit, discourage and not have that kind of activity. What we do know, though, is in 2016, the HALA Committee will look at design review and the HALA Committee will recommend that the program be streamlined, streamlined to facilitate quicker review.'",
        "'speaker_4': 'And so, in essence, what I'm asking for is a striking of Section eight, which basically modifies the design review process. I think it's very appropriate had that discussion and Hala actually looks at through the design review process, we may you, I think, fully understand that we will be asking developers, we're going to look for opportunities to streamline'",
        "'speaker_4': 'the design review process in certain circumstances. So basically what I am suggesting is that we remove this and be consistent with what DPD originally planned. Make sure that in the HALA process that we look closely at the design review process and then make sure we come up with our policy recommendations.'",
        "'speaker_4': 'And again, I started this by saying the purpose of an omnibus bill are pretty much typographical errors and technical clean ups. And I think we have to have more conversation when we start looking at the design review process.'",
        "'speaker_4': 'So I think a striking section in it would be appropriate.'",
        "'speaker_0': 'Do you want to move your amendment?'",
        "'speaker_4': 'So I move my amendment with strikes, section eight. And I asked Councilmember Brown what he gave me, a courtesy second.'",
        "'speaker_9': 'Courtesy second.'",
        "'speaker_4': 'And I'll say everything I just said all over again. So what this basically does is.'",
        "'speaker_0': 'We're not going to allow that.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'All right. We have proposed amendment number two design review in front of us. Councilmember Bagshaw, I.'",
        "'speaker_2': 'Think you have a question actually. This is going to be addressed to the two of you. And help me understand this. My goal is to make sure that neighborhoods have the opportunity to weigh in when we've got development proposed that are on lots that are close.'",
        "'speaker_2': 'And I agree with what Councilmember Harrell was saying about having a full review, and I'm all in on that. But my understanding of what Councilmember O'Brien is suggesting is that in the interim, that if develop if there's development planned on two adjoining lots, that Councilmember O'Brien's amendment would require design review in the neighborhood before both are given'",
        "'speaker_2': 'authority to proceed. That's the direction that I want to vote. So I'd like some clarification between the two of you.'",
        "'speaker_4': 'I think your understanding is correct. I mean, it's nothing else. I think you have a correct understanding. You know, when I use the term design review, a full design review is about 18 to 20 month and administrative review is 13 or 14.'",
        "'speaker_4': 'And the streamline reviews 8 to 9 months. And the OHA is going to look at all the review process and come up with strong recommendations. But you are correct that Councilmember Bryant's amendment addresses the situation you talked about.'",
        "'speaker_0': 'That's a member.'",
        "'speaker_9': 'O'BRIEN And so thank you, Councilmember Harrell, for bringing this forward. This amendment is an amendment that the committee put in and added to the bill. It wasn't a deputy's request. I think there's always a fair question to ask of what's appropriate for an omnibus bill or not.'",
        "'speaker_9': 'My intent in bringing this amendment forward, not the amendment we're discussing today, but the one that was already in the bill that's before us was to really honor the intent of the Council in regards to design review and what size projects should be going through that.'",
        "'speaker_9': 'Councilmember Harrell is correct in saying that there is an ongoing review of the design review process which will likely see recommendations later this year and legislation sometime in 2016. To Councilmember based on his point, my intent with the legislation is it is is that it would go ahead and bring these changes to date recognizing that sometime next'",
        "'speaker_9': 'year we may modify that when we consider the broader design review package. One just correction. I believe, Councilmember Harrell, that next year this will be taken up probably in the land use committee, not the whole committee. The whole committee will delegate that to the land use committee next year.'",
        "'speaker_0': 'Any other questions or comments. So we're voting on amendment number two related to design review, which deletes section 23.40 1.00, four point a eight and all in.'",
        "'speaker_9': 'Sorry.'",
        "'speaker_8': 'Yeah, I think. I think it's good to discuss this.'",
        "'speaker_0': 'Oh, I'm sorry.'",
        "'speaker_9': 'If I could just clarify one thing, Councilmember Gunn. So I will be voting no on this amendment and Councilmember Harrell's amendment to leave the legislation as it was previously amended in committee.'",
        "'speaker_0': 'Thank you, Councilmember Gordon.'",
        "'speaker_8': 'I was just going to repeat that, that I would also be voting. You know, it does seem to me that it requires more discussion. It seems to take away a portion of design review. It makes it more difficult for neighborhoods.'",
        "'speaker_8': 'And I think that this that I would like to vote no on this one.'",
        "'speaker_0': 'Thank you. Are there any other comments or questions?'",
        "'speaker_4': 'Councilmember Harrell Yeah, I want to make it crystal clear to that. I think it does warrant more discussion and that's why I am supporting it. And I had a note from central staff that that the holler would be making some rec and a recommendation to pretty much streamline some design review process.'",
        "'speaker_4': 'I think we all want to protect neighborhoods. I don't think there's any debate, a debate about that. We want to make sure that it's done thoughtful at a time where we're going to try to increase housing. So, again, I don't think it should be put in an omnibus bill.'",
        "'speaker_4': 'That's really the point. I'm not going to defend the pros and cons of the merits of this legislation. I just think it's a little dangerous to sort of do a one off during an omnibus omnibus legislation. I think that's that's the only point I wanted to make.'",
        "'speaker_0': 'Thank you. Any other comments or questions? All right. So this is amendment number two to delete Section eight of 23.40 1.00488. All in favor of the amendment vote. I.'",
        "'speaker_4': 'I. I. I. I.'",
        "'speaker_0': 'Nice try. All opposed vote.'",
        "'speaker_4': 'No, no.'",
        "'speaker_0': 'Sorry Bruce.'",
        "'speaker_4': 'Seven eight. I didn't I didn't complete.'",
        "'speaker_0': 'One in favor. Seven opposed. The amendment fails.'",
        "'speaker_2': 'There's two in.'",
        "'speaker_9': 'There. Were there. John was also.'",
        "'speaker_0': 'Oh I'm sorry. Two. Okay. Two in favor, six opposed, same result. All right, amendment number three, Councilmember O'Brien.'",
        "'speaker_9': 'Thank you. So I will go ahead and move. Amendment number three, relating to citation option. The citation option for noise variance. If I could get a second.'",
        "'speaker_0': 'Second.'",
        "'speaker_9': 'All right. So this is an amendment that we did not discuss in committee. So I want to just take a second to explain it in the omnibus legislation as proposed by DPD. Let me say first, the current law for a noise ordinance violation on a construction project gives the APD.'",
        "'speaker_9': 'The only option is to issue a stop work order. The legislation, as proposed by DPD would allow a separate path where they could also issue a citation. The reason I'm proposing this amendment is concern was raised in public comment over this, and I neglected to actually have a chance to discuss that in the committee.'",
        "'speaker_9': 'And so, without further discussion, my recommendation at this point would go ahead and remove that language. The DPD had proposed to leave the underlying current law, as is, until there's an opportunity to future time to fully discuss that.'"
    ],
    "Petition of Seattle City Light to vacate Pontius Avenue North between the south margin of John Street and the north margin of Denny Way.": [
        "'speaker_0': 'Thank you. Questions or comments? Those in favor of confirming the appointments listed in agenda items 12 and 13 vote. I oppose Vote No. The appointments are confirmed unanimously. The report of the Transportation Committee. Please read item 14.'",
        "'speaker_6': 'The Report of the Transportation Committee. Agenda Item 14 Clerk File 313195. The petition of Seattle City Light to vacate Pontious Avenue North between the south margin of John Street and the north margin of Denny Way. The committee recommends the full council grant the petition as conditioned.'",
        "'speaker_0': 'Please read item 15 as well.'",
        "'speaker_6': 'Agenda Item 15 Clerk File 314305 Council Concept Approval and waiver or modification of certain development standards to allow development of an electrical substation. The Denny Substation located at 1250 Denny Way Project Number 3014772 Type five. The committee recommends the full council approve the project.'",
        "'speaker_0': 'Councilmember Rasmussen.'",
        "'speaker_9': 'Thank you. The Council is requested to take two separate actions to enable the construction of the City Lights substation at Denny Way. First in item 14. The council is being requested to approve the vacation of Pontious Avenue North between John Street and Denny Way.'",
        "'speaker_9': 'The second item is item 15, and that would grant the waiver of several land use standards to allow the construction of the substation. This new substation is being built to meet the increased need for reliable electricity in the South Lake Union area.'",
        "'speaker_9': 'The project includes construction of the substation itself at John Street and Denny Way, and the construction of an underground distribution network that will connect power to the surrounding buildings. And finally, construction of a transmission line from the existing Massachusetts substation in the Sodo neighborhood to the new Denny Way substation.'",
        "'speaker_9': 'Our street vacation policies provide that vacations may be approved only when they serve the public interest and when a public benefits associated with the project are provided by the petitioner. After several discussions before the Transportation Committee, including a public hearing, the committee has determined that the vacation is in the public interest because vacating a Pontius will allow'",
        "'speaker_9': 'for construction of the substation in a manner that will include public benefits sought by the neighborhood. And it is supported by our Department of Transportation, which is determined that this portion of Pontiac's Avenue North is a minor street and its closure will not negatively affect the street cred.'",
        "'speaker_9': 'And then finally, the project does have the support of the adjacent community. Following extensive public involvement with the community to determine what they would like in terms of public benefits. There are nine distinct public benefits associated with the project and their value totals approximately $10 billion.'",
        "'speaker_9': 'Benefits are listed on page three of the attachment in the Clark file, but to comment on upon several of those are outlined a couple of those several of those there are improved pedestrian crossings that Danny way a 6000 square foot off leash dog park a community meeting room a public art will be provided on site and a'",
        "'speaker_9': 'new covered bus, shelter and transit hub along Danny way. I'd like to thank Seattle City Light for their work with the community and also to those in the community who have participated in our community meetings and attended the public hearing and work with City Light to develop the public benefits for the project.'",
        "'speaker_9': 'With regard to the hour, would you like to take action on this proposal to vacate first and then we'll I'll talk about the land use action and we can vote on that separately. Okay. So that's the recommendation of the committee to grant conceptual approval of the vacation.'",
        "'speaker_0': 'Thank you. Questions or comments? Those in favor of granting the petition as conditioned vote I.'",
        "'speaker_5': 'By.'",
        "'speaker_0': 'Those opposed vote no. The motion carries, the petition is granted as conditioned and the chair will sign the conditions of the City Council. Item 15.'",
        "'speaker_9': 'Thank you. This is the second part of the approval that's being requested of the council now to enable the construction of the Denny Way substation. The project also requires waiver of several land use standards by the Council. This is the first project of its kind in Seattle in 30 years, and when the South Lake Union land use'",
        "'speaker_9': 'development standards were developed, they weren't done with the construction of an electrical substation in mind. So for that reason, in order to build a substation, there have to be seven land use waivers made by the council. Each waiver was reviewed and discussed twice in the Transportation Committee.'",
        "'speaker_9': 'And the findings, conclusions and decision statement that's included in your Clark file provides a complete and succinct summary of each of the waivers. Following the committee review and discussion, the committee determined that the requested modifications of development standards are necessary to allow the project to be constructed and the site to effectively function as an electric substation again'",
        "'speaker_9': '. The Transportation Committee unanimously recommends approval of this action to grant the land use waivers.'",
        "'speaker_0': 'Thank you. Questions or comments? We're voting on item 15. Those in favor of approving the project and granting the modification of development standards. Vote I II. Those oppose Vote No. The motion carries, the project is approved and the chair will sign the findings, conditions and decision of the City Council.'",
        "'speaker_0': 'Adoption of other resolutions. Please read item 16.'",
        "'speaker_6': 'Agenda Item 16. Resolution 31608. Setting the public hearing on the petition of City Investors for LLC for the vacation of a subterranean portion of the alley and block 89 Denny's Fifth Avenue, fifth addition to North Seattle in the South Lake Union neighborhood of Seattle, according to Chapter three 5.17 Revised Code of Washington.'",
        "'speaker_6': 'Seattle in this code 15.62 and Clerk's file 313894 Introduced August 17, 2015.'",
        "'speaker_0': 'Thank you, Councilmember Rasmussen.'",
        "'speaker_9': 'This is a routine resolution that establishes September 22nd as a hearing date for the vacation of a requested proposal to vacate a subterranean part of the right of way in the Denny Triangle neighborhood. The alley is in the block where the Denny play field in the South Lake Union Discovery Center allow her now located.'",
        "'speaker_0': 'Do you want to move adoption of the resolution and.'",
        "'speaker_9': 'The I would move adoption of this resolution setting September 22nd as the hearing.'",
        "'speaker_0': 'Date. Second, are there any questions or comments? Those in favor of adopting the resolution vote i. I oppose vote no. The resolution is adopted unanimously and the chair will sign it. Is there any other business to come before the council?'",
        "'speaker_0': 'The Select Committee on Affordable Housing will meet beginning at 345. 5 minutes from now, the council's adjourned. Thank you.'"
    ]
}