{
    "AN ORDINANCE relating to homelessness; lifting a budget proviso imposed on Finance General's Reserves Budget Control Level; and making cash transfers between various City funds.": [
        "'speaker_3': 'The Report of the Human Services and Public Health Committee Agenda Item one Constable 118 619 Relating to homelessness, lifting and budget provides in person finest generals, reserves, budget control level and begin cash transfers between various city funds. The committee recommends the bill pass.'",
        "'speaker_2': 'Councilmember Bagshaw.'",
        "'speaker_6': 'Thank you very much. Since all nine of us were together last week, I'm not going to spend a lot of time going through again what we had heard. But you will recall that last November that this council approved a $2.3 million set and it was for one time funds for emergency homelessness services.'",
        "'speaker_6': 'And we placed a proviso on this. We were pending our Human Services Department creation of a spending plan which was presented to us. We first heard about it in January, then we had an opportunity to go through it specifically together last week.'",
        "'speaker_6': 'And the legislation funds are going to be provided for fundamental services for people who are experiencing homelessness, including child care support, emergency shelter for youth, more outreach workers and so on. But here's what I would like to say to my colleagues.'",
        "'speaker_6': 'I certainly approve moving forward with this, but I am calling upon all of us, as well as the mayor's office and our department heads, to really reexamine this emergency. It was presented and declared as an emergency on November 2nd.'",
        "'speaker_6': 'I believe there is a lot more we can do to treat this as an emergency and just as if it were an earthquake like what people did when we had Katrina, when we saw a tremendous flooding, the community came around and figured out things that they could do in months, not years.'",
        "'speaker_6': 'And I believe that that's where we are as well today. I've reached out to the mayor's office. I'm working with our service providers, with our advocates to really suggest that rather than dividing ourselves or being divisive, as the mayor had said at the end of his speech, that we focus on the big the big part of our'",
        "'speaker_6': 'work on permanent housing, whether we're working through Hadleigh and building on that, but that we focus on the emergency itself and something that Barbe Graff would do to have an emergency group pulled together. We're working with the mayor's office, with our service providers and yes, with our community.'",
        "'speaker_6': 'And Cindy Pierce, thank you for being here, because what I am hearing from neighbors is very much like what you had provided.'",
        "'speaker_1': 'Yes, let's.'",
        "'speaker_6': 'Get permanent housing, even if.'",
        "'speaker_1': 'It's interim.'",
        "'speaker_6': 'Get a lot of it out, make sure that it is available across our city and our county. Invite people to come into the.'",
        "'speaker_1': 'Warm, dry.'",
        "'speaker_6': 'Housing and have a certain expectation, expectation of behaviors that people will meet. Now, we will be working with our friends at ACLU and the Public Defenders, but I would like to call upon the mayor's office today to say, let's have an emergency together team together, like perhaps it's a hal a light, but we get.'",
        "'speaker_1': 'Started.'",
        "'speaker_6': 'And my call is that we commit ourselves in this city and the county to get 1000 new units of dry housing. I've been to the town encampments. They are not the answer. Yes, they are better than being out by yourself.'",
        "'speaker_6': 'Yes, they are definitely better than being cold and alone. But it doesn't provide a warm space. What I'm hearing from the providers and from our neighborhood is we would like to see people inside, we'd like them inside, but we'd also like to have garbage cans and recycling cans and Porta Johns available for people now.'",
        "'speaker_1': 'So this is.'",
        "'speaker_6': 'Part of the emergency more safe, dry places. And that we are whether they're tiny houses, whether they're modular units, whether they're boarding houses or rooming houses, that as an emergency. We have a call to say in months, not years, that we find 1000 spaces.'",
        "'speaker_6': 'So with all that, I want to move ahead, urging this council to adopt what we all voted.'",
        "'speaker_1': 'On last week.'",
        "'speaker_6': 'I believe Lisa Herbold has an amendment she'd like to present. I'll be supporting your amendment, and I will sit down and ask for that amendment.'",
        "'speaker_2': 'Before we move to Councilor Herbold amendment, are there any other comments on the base legislation or make sure we don't have any comments we're not hearing on the base legislation? Councilmember SUAREZ.'",
        "'speaker_1': 'My question was this. I was just checking with councilmember councilmember. Sharma are in Berkshire. So right now my comments are just in general not to. Councilmember Herbert's amendment, is this the time to make.'",
        "'speaker_2': 'This would be a good time for them.'",
        "'speaker_1': 'Okay, good. They're not too lengthy. But there is something that I think you've all seen in a theme of my representation. I'm really proud of the city that we have a racial injustice, social justice initiative. But there is something that's very glaring and important, and I think we need to look at it, and that's geographical parity.'",
        "'speaker_1': 'I did had a chance to read the implementation plan. I know that Seattle's investment in homeless services, the focus is on prevention, intervention and permanent housing. I had a chance to look at the Human Service Department homeless report as well.'",
        "'speaker_1': 'I guess my concern is that we do spend only 11% on prevention. Prevention, of course, in our district right now is eviction prevention and moving moving costs for the people that we service. I can't speak directly to District four, Councilmember Johnson's district or to District six Councilmember O'Brien's district, but I can speak directly to count to district'",
        "'speaker_1': 'number five. The North End, or at least District five, has been a has pretty much been a desert of social services. We have two social service organizations, which this is why this concerns me. District five makes up about 40% of the city's landmass, and we only have two social service organizations that serve as a great client base'",
        "'speaker_1': 'and offer many services. We have eight elementary schools, three middle schools and two high schools, and we deal with homeless children and two service and 15 north north help line provided eviction prevention services for over 200 children and kept their families housed.'",
        "'speaker_1': 'And also, I wanted to add that when we hand out motel vouchers, where do you think those people go? They go on Aurora. And when those motel vouchers expire, where do those people go? So in the north end, when those vouchers expire, we don't have the services to absorb the capacity of those people what they need.'",
        "'speaker_1': 'And it isn't just it's mainly women and children in the north and we have the north and help line and we also have Mary's place. So my concern is this, that we not just focus on a downtown only or south of the ship can now focus on addressing homelessness.'",
        "'speaker_1': 'That we learn and we see that the city is much bigger and much broader and that the homeless issue is very alive and very critical in the North End and in particularly for District five. And I would hope that you would consider that when we look at how we allocate this money.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilmember Juarez. Are there any other comments on the base legislation?'",
        "'speaker_6': 'Councilmember Swan I can make them know, but it doesn't make sense to do the amendment.'",
        "'speaker_2': 'Well, I think the amendments going to be a sort of a separate discussion. So I don't know if it's going to change any of the base comments. And so why don't you go ahead and proceed here.'",
        "'speaker_6': 'Okay. Thank you. President Harold. So firstly I'm glad to vote in favor of lifting the proviso to allow allow the $2.3 million to be spent on homeless services, particularly in increase in shelter beds. As we recall, this was the budget amendment passed by council after the mayor submitted his 2016 budget and after the state state of emergency'",
        "'speaker_6': 'was declared. Homeless advocates and activists will remember that grassroots pressure was required to make this a reality. Particularly, I wanted to commend the Seattle Human Services Coalition and the Seattle King County Coalition on Homelessness and Councilmember Former Councilmember Liccardo found the funds to make this possible.'",
        "'speaker_6': 'And as we know and as Councilmember Mexico said, this will make a difference. But also, as I wanted to join her in saying that, we should also be clear that the solutions have to be in proportion to the scale of the problem.'",
        "'speaker_6': 'And we know that the problem is far bigger. And I think at the end of the day, the success metric cannot be what we've spent so much now, we can't spend any more. These are human beings, so it has to be able to do whatever it takes.'",
        "'speaker_6': 'And obviously, as the one night count indicated, the problem has far from been solved. The problem is growing. And I also think that some good points have been made. You know, there is no one single solution. I think the people who are making points about the need for additional funding for social services directly related to drug addiction'",
        "'speaker_6': ', I think that is absolutely correct. That is what we need. I also join Councilmember Juarez in pointing out I mean, and I think are pointing out the geographical disparity, social service deserts. I think that that is also accurate and that also needs to be addressed.'",
        "'speaker_6': 'And we need to do everything in our power and we haven't done any everything in our power. During the same budget discussions that Councilmember Legarda last year found the funds to make what we're doing today possible. I had also proposed $10 million to be used out of the emergency sub fund for 2000 shelter beds immediately.'",
        "'speaker_6': 'And this was a proposal that was brought brought by Seattle King County Coalition on Homelessness. And I hope that now, after a few months have passed, the crisis and the scale of the crisis is clear to all elected officials.'",
        "'speaker_6': 'I really hope that councilmembers will approve the $10 million proposal in the first quarter supplemental budget of this year. And, you know, I intend to bring that up. And I also invite all members of the public to join me in the People's Assembly, where we will be.'",
        "'speaker_6': 'You know, this is the main call to action on homelessness on February 27th at noon. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Swan, are there any other comments on the base legislation?'",
        "'speaker_6': 'I have just one thing I would like to add, and that is I'm not talking about shelter beds, the idea of people being sent out at 630 in the morning and maybe have a space where they can come in the afternoon.'",
        "'speaker_6': 'I'm talking about places where they can be 24 hours a day. Just very quickly, make sure I totally support that. Any proposal you make to greatly alleviate the suffering of homeless people, I am absolutely there with you. So if we want to if you want to discuss how to spend the $10 million, I am absolutely for that'",
        "'speaker_6': '. But my concern is let's show the political leadership and actually spend those $10 million. I mean, the emergency funds in various emergency funds, the city has $106 million right now. The money is there. We have declared a state of emergency.'",
        "'speaker_6': 'Let's do it. And I'm happy to work with any councilmember who really wants to push that forward, and I'm happy that you're talking about it.'",
        "'speaker_2': 'Okay. So we're going to move from. Thank you, Councilmember Swan. We're going to move from the base legislation to a proposed amendment by Councilmember Herbold and Customer Herbold. Perhaps you could walk us through I don't know if there's two amendments or something that maybe you could just walk us through what you're proposing.'",
        "'speaker_7': 'So I'll make a motion first. Yes. I move to amend Council Bill 11 8619 by adding a new Section three and by remembering the last section accordingly. The new Section three is entitled as part of amendments to the 2016 budget, included in what is commonly known as the 2016 first quarter supplemental budget ordinance, the City Council intends'",
        "'speaker_7': 'to increase appropriations by up to $200,000 solely to meet remedy conditions directly associated with unsanctioned camping in Seattle that may pose significant threats to health and safety of people living in or adjacent to unsanctioned camps and may be spent for no other purpose.'",
        "'speaker_7': 'Such conditions include but are not limited to lack of running water or basic sanitation and a lack of facilities for disposing of garbage. Recycling and compost remedies may include, but are not limited to hand-washing stations, portable toilets and showers.'",
        "'speaker_7': 'Containers for disposing of used needles with collect. Service and containers for sorting into disposing of trash, recycling and compost with collection services. This appropriation may not be used for encampment removal.'",
        "'speaker_2': 'Okay. So I'm going to just refer to that as amendment number one, just so we can know what document.'",
        "'speaker_7': 'This is the only amendment I'm bringing forward.'",
        "'speaker_2': 'Okay.'",
        "'speaker_6': 'And that's blue, right? So we have two ones, red and one's blueprint.'",
        "'speaker_7': 'The difference is, if you look in the the header, it says council intention to appropriate funding dedicated to remedy public health concerns, etc.. And I've only passed one out. So if you have another one. So I didn't pass out just now.'",
        "'speaker_7': 'Toss it.'",
        "'speaker_2': 'So they both actually they're a little different. There's a similar caption on each one. So can you read the caption that you're intending to read? Is it council intention or proviso to appropriate.'",
        "'speaker_7': 'Its council intention? And just if I could get a second, I can explain why there were two in the first place.'",
        "'speaker_2': 'Okay. Let me make sure what we're moving though. So that one is a red copy that I have. And the top says council intention to appropriate funding, dedicated remedy, public health concerns, etc. and that's what you read. So does everyone have that copy in the red?'",
        "'speaker_2': 'So it's been moved in second to consider. Councilmember Herbert's amendment number one that I'm calling all those in favor of. Vote I. Whoa, whoa. I'm sorry. Let's have a discussion first.'",
        "'speaker_7': 'Thank you. I appreciate it. So the background on this is, yes, I did originally bring forward an amendment that appropriated funds $200,000 from hs DS, one of their BCL levels that would be appropriate to this. It was not intended to come from the state of emergency money.'",
        "'speaker_7': 'Neither the money that was appropriated last year in the 2015 budget, nor the money that the Council is appropriating today. It was in the general BCL level that relates to homelessness services. It's a bcr of about $44 million because the feeling was that given the fact that the executive we know does a they budget for an underspend'",
        "'speaker_7': 'of between two and 4% depending on which department. I felt that the department should be able to come up with $200,000. We heard from the mayor's office, CBO and HST. They were not supportive of the amendment. So I worked with Councilmember Bagshaw to instead put forward something that is more aspirational for what we intend to do in'",
        "'speaker_7': 'the first quarter supplemental as as to the need for this amendment in the spending plan, an earlier version of the spending plan, there was $200,000 that was earmarked for sanitation and and hygiene activities associated with unsanctioned camping. And as we got closer to the discussion in Councilman Baxter's committee, in the vote, the committee vote there, it became'",
        "'speaker_7': 'apparent from the perspective of HST that they actually need to earmark those sort of floating dollars for floating cleanups. They needed to earmark them for the two RV safe sites and the third sanctioned encampment that's going to be coming online.'",
        "'speaker_7': 'So there was a there is a an interest on the part of HST to do some work. We've clearly heard interest on the behalf of the community, both the human service advocates, the homelessness advocates and the neighborhood advocates, that it's understood that there are encampment removals that are going on.'",
        "'speaker_7': 'Those encampment removals are prioritized according to true public safety threats. That's the goal. But then there are encampments that are not a priority for removal right now, but they still very much need hygiene and sanitation help. And so this is to in to support the HST and the executive departments that are doing this work into moving into'",
        "'speaker_7': 'that area and mitigating the impacts of folks who are sleeping outside.'",
        "'speaker_2': 'Okay. Thanks for that explanation. I'm sure there are some comments or questions from my colleagues on the amendment proposed by Councilmember Herbold.'",
        "'speaker_8': 'Councilmember Burgess, thank you. Last week we met. In the Human Services Committee, and all nine of us were present at that discussion. And this concept of the council. Appropriating or stating its intent to appropriate funds for this purpose did not come up.'",
        "'speaker_8': 'That would have been an appropriate place in the committee to have that discussion and to properly vet this concept. This. This also, in many ways falls outside the normal process of how we would deal with mid-year budget adjustments.'",
        "'speaker_8': 'We would do that when the first quarter supplemental budget was actually being considered by the council. But this even jumpstarts that process. So I'm going to oppose this amendment for a couple of reasons. First, it's not consistent with how we should thoroughly review and vet allocation of funds.'",
        "'speaker_8': 'I know that Councilmember Herbold believes that there's underspend and this would be easy to allocate $200,000, but in fact, that would be a conscious decision that we would make when adopting a budget ordinance would be to either directly reallocate underspend if there is any present and to use it for these purposes.'",
        "'speaker_8': 'But that process is not followed here. The second, and maybe more substantive reason that I'm opposed to this amendment is that it is essentially asking city government to endorse the presence of unsanctioned encampments in the city and to spend money on those unsanctioned encampments.'",
        "'speaker_8': 'That is not a policy decision that we have made in the city. In fact, we've made a very different policy choice to sanction certain specific authorized encampments and specific RV parks. We have not made a policy decision to support unsanctioned encampments, and I think that kind of a decision should be made through our committee process, where we'",
        "'speaker_8': 'have an opportunity to engage in a robust discussion and to to weigh the merits of that kind of a decision, pro or con. So for these reasons, I'm going to oppose the amendment.'",
        "'speaker_7': 'May I respond?'",
        "'speaker_2': 'Councilmember Herbold would like to respond, and we may have other concerns from you. Want to chime in, please?'",
        "'speaker_7': 'I respectfully disagree. This in no way sanctions unsanctioned encampments. It merely recognizes that there.'",
        "'speaker_1': 'Are.'",
        "'speaker_7': 'There's garbage and there are needs associated within with with those encampments that are in the real world. In no way authorizes those unsanctioned encampments. And secondly, I do apologize for the timing of this. We because this is a state of emergency, we sped up our process for how we normally handle legislation.'",
        "'speaker_7': 'Normally, we would hear the legislation first and then vote on it in a subsequent committee meeting. And because we were trying to act in a way that recognized that we are in a state of emergency, we voted out this legislation the same day that we heard it, which was on Thursday.'",
        "'speaker_2': 'Councilmember Bagshaw.'",
        "'speaker_6': 'Thank you. And Councilmember Herbold, I want to say thank you for bringing this forward and notwithstanding the fact that some of my favorite friends in the audience feel very strongly against this, the reason I'm supporting it is not because it's the end all, be all.'",
        "'speaker_6': 'But likewise, I've had many conversations with neighborhoods who are saying The most important thing you can do right now to help is to help us clean things up and to provide places for people to put garbage recycling. And rather than having human waste put around making it, making Porta Johns available to people so they can use it'",
        "'speaker_6': '. And we are not suggesting that this go on forever, but right now I think we have an opportunity citywide to actually clean things up. It is a public health problem. So that's the reason I'm supporting this. And we will be working really hard in the next couple of weeks with the mayor's team to find a solution and'",
        "'speaker_6': 'many solutions that are going to help make this whole city a safer, healthier place to be.'",
        "'speaker_4': 'You've got Jackson.'",
        "'speaker_2': 'Please. Please, sir. I'm going to have to please myself. The right thing. Thank you. Thank you for removing yourself. Do I have any other. The police haven't removed this year's crop. Okay. Do your job. Okay. Can we got.'",
        "'speaker_2': 'Okay. Are there. Thank you, Casper and big show. Please have him removed. Phone number. We'll figure it out. Housing Council member Johnson.'",
        "'speaker_4': 'I'm going to take you to the recycling could take you from every intersection, see out because they're already here and nobody's using them. I wrote everybody in one place where we can put the recyclable cards.'",
        "'speaker_2': 'We can get hold.'",
        "'speaker_4': 'Of but everybody else in one place. This is the only way we're going to make this work. And you guys.'",
        "'speaker_8': 'Counting the ballots. Let's go right to focus.'",
        "'speaker_2': 'Because you are not a council member, Johnson. You're not.'",
        "'speaker_8': 'Well. So I had a question related to this. You know, one of the comments that I've heard from I've spent so in the six weeks that I've been here, I spend time every week trying to reach out to nonprofit providers or private sector folks in the fourth District who might be interested in hosting a semi permanent basis'",
        "'speaker_8': ', either for a couple of months or six months. Folks who may be living in car campers, maybe living in RVs or maybe living in one of the unsanctioned encampments. The most common refrain that I get back from individuals who expressed an interest is other city resources that would help, you know, either to provide mental health counseling for'",
        "'speaker_8': 'folks who may be hosted to provide, as Councilmember Bagshaw alluded to, sort of sanitary services or plumbing services that may not exist in the locations where these these nonprofits or these private sector folks are interested in hosting. Is it your intent that some of these resources could be used for that kind of outreach to folks who aren't'",
        "'speaker_8': 'currently hosting but would be interested in hosting individuals who are experiencing homelessness?'",
        "'speaker_7': 'The intent of this amendment is to deal with conditions related to no running water, basic sanitation, lack of facilities for disposing of garbage. Recycling and compost remedies may include but are not limited to hand-washing stations, portable toilets and showers and containers for disposing of sharps.'",
        "'speaker_7': 'So it's really to deal with the areas where we know that they're encampments. They are not sanctioned, but they are not on the city's priority list for removal. But they are still creating health and safety issues both for the community and for the folks who are living there.'",
        "'speaker_8': 'Well, you permit me to ask.'",
        "'speaker_2': 'Another question, please, Councilman Johnson.'",
        "'speaker_1': 'So in in.'",
        "'speaker_8': 'To review back what I think I heard from you. So our objective here is to say there are some encampments that are not receiving those services currently. And here sorry, I'm talking right next to me. So it's I don't want to overwhelm the volume of her.'",
        "'speaker_8': 'So my question, I guess, then, to restate what I think I'm hearing from you is, you know, we've got a system, as was explained to us last week, wherein an encampment is identified and services are offered to those folks living in that encampment.'",
        "'speaker_8': 'But that generally there are several encampments in the city that are not a high priority. But we are seeing in some of those places certainly a need for clean, safe, hygienic places for people to use the bathroom and dispose of garbage.'",
        "'speaker_8': 'And so the intent here is to try to provide additional services within the Human Service Department to be able to address some of those community needs that we're hearing from people.'",
        "'speaker_7': 'So I, I don't know exactly how we would implement this work. This was work that was identified by HST as in an earlier version of the spending plan that was not tied to individual encampments. So it would not be HST going out and providing services per se.'",
        "'speaker_7': 'It would be more funding for garbage cans and garbage pickup visits by people who are professional and know how to remove needles and dispose of them properly. It's though it's not it's not so it's not services as you think of social services.'",
        "'speaker_8': 'Okay. Look.'",
        "'speaker_1': 'I have a question, sir.'",
        "'speaker_2': 'Council member or us and Councilmember O'Brien.'",
        "'speaker_1': 'First of all, thank you. Council over her vote for the two points to make. So, as you know, one of the things that Councilmember Bagshaw asked of us in a memo is to ask our community. So I went to the Mennonite church and met with homeless groups about what the needs are in the north and in District'",
        "'speaker_1': 'five. So I had some questions along the same lines as Council Member Johnson how would we use these services and how would we implement or get access to these funds, to these quote unquote encampments that are actually in the North End as well as that?'",
        "'speaker_1': 'So I totally.'",
        "'speaker_7': 'Agree that geographic dispersion of these services is very critical.'",
        "'speaker_1': 'So, okay, I guess I'm sorry.'",
        "'speaker_2': 'I mean to asked one council member speak at a time please finish.'",
        "'speaker_7': 'KINSMAN Worse. That's not spelled out in the amendment. If you'd like.'",
        "'speaker_1': 'To.'",
        "'speaker_7': 'Suggest some friendly language to get at the need for geographic dispersion throughout the throughout the city and not just focused on. Okay.'",
        "'speaker_1': 'Can I just make councilman art council president. Can I just make a observation as somebody is. Councilor Johnson was saying we've only been here four or five weeks.'",
        "'speaker_2': 'Please.'",
        "'speaker_1': 'And I'll just be blunt and candid. This is one of the most frustrating and difficult things about being a newly elected council person, is that we don't always talk to each other. We don't always get amendments. I got this amendment in an email at noon.'",
        "'speaker_1': 'I didn't can't catch up with the changes. I understand the intent, the passion behind it. I get it. But my concern is, isn't it a issue of process is that we never get this stuff ahead of time to actually kind of go through these kind of questions that we're having so we can do more than just friendly'",
        "'speaker_1': 'amendments but ask these kind of questions. So, I mean, I, I agree with what you're saying here, and I agree with the intent and the actions that you're trying to achieve. I guess my concern is, and I do support this, by the way, is some of the questions that are just left out there is how to is'",
        "'speaker_1': 'this just another thing we're passing? We're saying $200,000 and then we don't know where it goes again. I don't know what neighborhood it's going to go to. I don't know what an encampment are you talking about? One tent or four.'",
        "'speaker_1': 'Are we talking about I mean, there's just a bunch of things I'm still not concerned. So, again, I just wanted to say and put that out there for my for my other council members about some of my frustrations of us not talking a little bit more about some of these issues, particularly when we call something an emergent'",
        "'speaker_1': 'situation that we don't we don't get the information till the last minute. Thank you.'",
        "'speaker_2': 'Councilmember O'Brien.'",
        "'speaker_8': 'And so not well, I guess I would just want to add, this is a intent to and so I'm prepared to support this. And I think that we will have an opportunity when the first quarter supplemental budget is actually before us to dig into it and talk about specifics.'",
        "'speaker_8': 'And you know, frankly, I'm looking for be looking for feedback from both community members and the Human Service Department on how best to get the language in there and the language you have here. I think Lisa makes makes it points well, but it may be that we modify that language between now and then.'",
        "'speaker_8': 'But the intent here, I'm fully supportive of and appreciate the amendments.'",
        "'speaker_2': 'Any other comments? Council members who want.'",
        "'speaker_6': 'I wanted to thank Councilmember Herbold for bringing this amendment forward. It provides essential funds for unsanctioned encampments. And as she said, these are garbage removal, you know, infrastructure type services that they need urgently and. I am particularly glad that consumer Herbold has taken care to write this amendment in such a way that it makes it clear that'",
        "'speaker_6': 'this appropriation may not be used for encampment removals. I am totally against the sweeps. Homeless advocates are against the sweeps, and council members, I think, should join me and advocate in asking the mayor to halt the sweeps. And I appreciate that.'",
        "'speaker_6': 'In supporting this amendment, I will not inadvertently supporting any funding increase for sweeps for councilmembers who are concerned about. Well, you know, first of all, I second Councilmember O'Brien's remind her that, you know, this is doesn't intend to approve funding.'",
        "'speaker_6': 'We will come back to this issue. So for those of you who agree with this amendment and spit it out, urge you to vote yes. And if you don't agree with it in spirit, then obviously you'll be voting no on it.'",
        "'speaker_6': 'And as far as the question of where the funds will come from, I mean, we're not dealing with that question right now. But there's a very simple answer. The mayor's office right now is spending over $1,000,000 on sweeps, stop the sweeps, divert the funds to essential services that homeless people need.'",
        "'speaker_6': 'And I would remind everybody that whether encampments are sanctioned or unsanctioned, we're talking about human beings. Human beings are going to have the same needs. Garbage removal is going to be a need. Whether it's a sanction encampment or unsanctioned, that doesn't make any difference.'",
        "'speaker_6': 'You're still going to have you're going to need to have your trash removed. And the whole community wants all trash removed so that we have, you know, maintenance of infrastructure everywhere. And again, I urge everybody to also support my proposal, which is really the proposal of the King County Coalition to End Homelessness on $10 million on emergency'",
        "'speaker_6': 'funding. Of what? Whatever kind. I'm happy to look at I'm flexible on how best to achieve it, but I am not flexible on the amount of funding that's needed because it is deeply underfunded. The last point I will make is on process and for those of you who are new, I can tell you I've been on the'",
        "'speaker_6': 'council for two years. The process is not followed when it's a question of immediately making sweetheart deals available for big corporations. So this isn't the Seattle the so the well-known Seattle process is really a process that grinds to a halt, virtually grinds to a halt when it's a question of making funds available for ordinary working people, for'",
        "'speaker_6': 'those who are marginalized and oppressed. So my personal appeal to everybody on this council will be is to follow your heart if you think that's the right thing to do, if you stand with the marginalized and oppressed and it's the right thing to do.'",
        "'speaker_2': 'Thank you for those comments, Councilmember Gonzalez. Wind up to be here pretty soon. Thank you.'",
        "'speaker_7': 'Thank you, council president. Thank you, Councilmember Herbold, for putting this issue in front of us. I think that, you know, really, really what I wanted to make a comment about is that in reality, I think this is the hardest part of our work as a city council members is balancing what I think we hear from our constituents'",
        "'speaker_7': ', which is a need to, as they like to put it, enforce our laws, which we continue to do and we will always continue to do and and the need to be compassionate and to understand that underlying the concerns that we hear from community about unsanctioned encampments are fundamental issues of public health and public safety.'",
        "'speaker_7': 'And I think that this proposal that you're putting before us that signals an intent for us to address that clearly is is is a good it's a step in the right direction. And so I want to I want to appreciate the fact that I think you are trying to strike a balance here.'",
        "'speaker_7': 'This does not take money away from continuing to do what we have been doing as a city, which is to go to unsanctioned encampments that present a clear public health and public safety concern and engage those folks in services or attempt to engage those folks, folks in services while also addressing the underlying public health and public safety'",
        "'speaker_7': 'concerns. This, in fact, will identify, hopefully, some additional money up to a certain amount that will address those public health and public safety concerns at unsanctioned encampments that may not fall into that Tier one list of unsanctioned encampments that has been identified by the mayor and the Human Services Department.'",
        "'speaker_7': 'So I am supportive of this intent, and I'm looking forward to working with you and with the departments that are going to be impacted by this to see how we can move this forward.'",
        "'speaker_2': 'Thank you. So I am going to call for a vote. I did want to at least put my $0.02 in and that is I'm going to support the amendment. But this notion but I do think it's bad practice for us to get into heavy substantive amendments at the last minute that I know your your former boss was'",
        "'speaker_2': 'known for that. But that is that is a discouraged practice because many of us have well-intended questions about, well, what are we exactly doing? And we want the opportunity to cross-examine department heads and to make sure we know what we're investing in.'",
        "'speaker_2': 'I think it's positive intent, but just legitimate questions. And so I don't want to encourage this over and over again. And I don't think I don't care if it's where there's big business or small business or immigrant and refugee work or whatever.'",
        "'speaker_2': 'It's just nice to have notice on what we're trying to agree on, what we're trying to legislate, irrespective of what the merits are. So and I think many of us are not moved one way or the other by the the topic.'",
        "'speaker_2': 'We just want to have it a chance to meaningfully respond. And I appreciate Councilmember Burgess's points in the process issue. So having said that, we're going to have a vote on the amendment and I'm going to ask this.'",
        "'speaker_2': 'You raise your hands those in favor of the amendment. Vote I in. Raise your hands I. Those oppose vote no and raise your hand. So no, the motion carries, the amendment passes. And now I will I will call for a vote on the amended legislation.'",
        "'speaker_2': 'Are there any closing comments on the amended legislation? Good. Thank you very much. Glad there's no comments. There are in all seriousness that Councilmember Herbold or anyone else, do you want to say anything? And we're good to go.'",
        "'speaker_2': 'Okay, so please call the roll on the passage of the amended Bill O'Brien.'",
        "'speaker_3': 'All right, so on. I beg your pardon? Burgess Gonzalez, I Herbold. Hi, Johnson Suarez President.'",
        "'speaker_2': 'Harrell I.'",
        "'speaker_3': 'Favor non.'",
        "'speaker_2': 'Oppose. The bill passes and the chair will sign it. It's the report of the Civil Rights, Utilities, Economic Development and Arts Committee. Please, please read the report.'"
    ],
    "AN ORDINANCE amending the 2016-2021 Adopted Capital Improvement Program; authorizing acceptance of pass-through grant funds from King County; granting budget authority for expenditure of said grant funds; and authorizing the Director of Seattle Public Utilities to use such pass-through grant funds and to enter into agreements for the acquisition of certain properties and the design of habitat restoration projects along the Cedar River.": [
        "'speaker_3': 'The report reported the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Item to cancel Bill 118 623 amended the 2016 through 2021 Adopt a capital improvement program authorizing acceptance of pass through grants. Funds from King County granting budget authority for expenditure of said grant funds and authorizing the Director of Public Utilities to use such pass through'",
        "'speaker_3': 'grant funds and to enter into agreements for the acquisition of certain properties and the design of habitat restoration projects along the Cedar River. The committee recommends the bill pass.'",
        "'speaker_7': 'Councilmember Herbold So this is pretty straightforward. It is the authorization of some grant funds in order to do some much needed salmon habitat restoration projects. They're going to be looking at actually acquiring a number of properties, and that's some work that we're going to be having.'",
        "'speaker_7': 'Espe you come back to committee and dig in a little bit more as far as the location of the different properties in the potential scope of the work moving forward.'",
        "'speaker_2': 'Thank you. Are there any are there any comments other than the ringing noise? If not, please call the roll on the passage of the bill.'",
        "'speaker_3': 'O'Brien So I beg your pardon? Burgess Gonzalez Herbold I Johnson Suarez President Harrell.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Am favoring unopposed.'",
        "'speaker_2': 'The bill passes and the chair with signage. Next matter, please.'"
    ]
}