{
    "AN ORDINANCE relating to City employment; authorizing the execution of a collective bargaining agreement between The City of Seattle and the Seattle Fire Chiefs Association, IAFF, Local 2898, to be effective January 1, 2019, to December 31, 2021; and amending Ordinance 126237, which adopted the 2021 Budget, by increasing appropriations to the Seattle Fire Department for providing the 2019, 2020, and 2021 payments therefor; and ratifying and confirming certain prior acts; all by a 3/4 vote of the City Council.": [
        "'speaker_0': 'The Report of the City Council Agenda Item one Council.'",
        "'speaker_2': 'Bill 120107 An ordinance relating to City Employment authorizing the execution of a collective bargaining agreement between the City of Seattle and the Seattle Fire Association. Fire Chiefs Association, IAFF Local 2898 to be effective January 1st, 2019 to December 31st, 2021.'",
        "'speaker_2': 'Thank you so much. I made the Pass Council Bill 120107. Is there a second.'",
        "'speaker_4': 'I guess?'",
        "'speaker_2': 'I think it's been moved and seconded a sponsor of the bill. I'll go and address it first and then happy to hear other comments or questions from your colleagues. So as I mentioned this morning, Council Bill 120107 would authorize the execution of a collective bargaining agreement with the Seattle Fire Chiefs Association, NFF Local 2898.'",
        "'speaker_2': 'The collective bargaining agreement is a three year agreement on wages, benefits, hours and other working conditions for January 1st, 2018 to December 31st, 2021. This collective bargaining agreement affects approximately 34 regularly appointed city employees, and the terms of this contract include wage adjustments of 6.6% for 2019, 2.7% for 2020, and 3% for 2021.'",
        "'speaker_2': 'The terms of this contract do meet the negotiation parameters set by members of the Labor Relations Policy Committee, and I recommend that my colleagues support the passage of this legislation. Are there any additional comments on the bill? Hearing.'",
        "'speaker_2': 'None will please call the bill on the passage of the bill.'",
        "'speaker_4': 'Let's get to. I. Peterson, I want. Yes, yes.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'For gold. Yes. Lewis. Yes. Morales. S Council President Gonzalez. I didn't say none of those.'"
    ],
    "AN ORDINANCE relating to the Board of Park Commissioners; changing the name to the Board of Parks and Recreation Commissioners; requesting that the Code Reviser revise the Seattle Municipal Code accordingly; amending the Boards composition and processes; authorizing an amendment to the Interlocal Agreement between The City of Seattle and the Seattle Park District; and amending Sections 3.26.010 and 3.26.030 of the Seattle Municipal Code.": [
        "'speaker_2': 'The bill passes and the chair will sign. It will please affix my signature to the legislation on my behalf. Will the clerk please read item two into the record? Agenda Item two Council Bill.'",
        "'speaker_0': '120098.'",
        "'speaker_2': 'An ordinance relating to the Board of Park Commissioners changing the name to the Board of Park and Recreation Commissioners requesting that the code revise or revise the Seattle Municipal Code accordingly, amending the Board's composition and processes. Authorizing an amendment to the Inter.'",
        "'speaker_0': 'Local Agreement between the City of.'",
        "'speaker_2': 'Seattle and the Seattle Park District, and amending sections 3.26.012 and 3.26.030 of the Seattle Municipal Code. The amount of work I moved to pass. Council Bill 120098. Is there a second?'",
        "'speaker_3': 'Second.'",
        "'speaker_2': 'Thank you so much has been moved and seconded. Councilor Peterson I understand that you are going to in councilor was his absence address this item?'",
        "'speaker_3': 'Yes. Thank you. Council president, colleagues, do you recognize this item? Because it's a companion bill to the Metropolitan Parks District, Resolution 43 that we approved last week. Councilor 1 to 0 098 merges the two official volunteer run organizations that oversee the activity of our Parks Department and the Metropolitan Parks District.'",
        "'speaker_3': 'That's the Board of Commissioners, the Park Board and the Park District Oversight Committee. Piddock In order to more efficiently utilize the time, knowledge and expertize of volunteers and address ambiguity and overlap between the Park Board and Peter, the co-chairs of both organizations requested that the two entities be combined.'",
        "'speaker_3': 'Doing so will allow all members to consider resources in the full context of overall funding policies and needs for Seattle Parks and Recreation. The newly combined board will retain the representative 15 member structure of the Park District Oversight Committee, and this body will be responsible for the traditional duties of the Park Board and oversight of programs, policies'",
        "'speaker_3': 'and reporting specific to the Seattle Parks District. The combined board will also be renamed the Board of Parks and Recreation Commissioners. This is the companion bill to Resolution 43 that we reviewed and unanimously approved in last Monday's Metropolitan Park District Governing Board meeting.'",
        "'speaker_3': 'The city council being the partner in this Interlocal agreement also needs to take parallel action. Current term appointments will not be interrupted by this action. Chair of the Committee Forest and I recommend City Council adopt this bill. Thank you.'",
        "'speaker_2': 'Thank you so much, Councilmember Peterson. Are there any additional comments on the bill? Hearing on what the critics call the roll on the passage of the bill.'",
        "'speaker_4': 'Must get a. I. Peterson, I so want. Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_4': 'For bold, yes. Lewis Yes. Morales That's. President Gonzalez I didn't favor none of those.'",
        "'speaker_2': 'The bill passes and the chair will sign it. Will the please affix my signature to the legislation on my behalf? Will. Please read item three into the record. Item three. Appointment 1951. Appointment of Jeffrey Earle.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon the Bordeaux House, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_0': 'The Report of the Land Use and Neighborhoods Committee Agenda Item 11 Council Bill.'",
        "'speaker_2': '120106.'",
        "'speaker_0': 'An Ordinance relating to Historic Preservation Imposing Controls upon the BORDO House, a landmark designated by the Landmark Preservation Board under.'",
        "'speaker_2': 'Chapter 25.12 of the Seattle Municipal Code, and adding it to the table of historical landmarks contained in Chapter 25.32 of the Seattle Missile Code. The committee recommends the bill pass. Great. Thank you so much, Councilmember Strauss. I'm going to hand it over to you to walk us through this committee report.'",
        "'speaker_1': 'Thank you. Council president, colleagues, this is a landmark designating ordinance for the BORDO House, which is located on 14th Avenue near Volunteer Park on Capitol Hill. The Bordeaux house was built in 1903, altered in 1913. The Landmarks Preservation Board recommended designation based on two criteria one that the structure embodies a distinct characteristics of an architectural style, and'",
        "'speaker_1': 'that this is an outstanding work of a designer or builder. Controls would apply to the site, the building exterior and the entry and stairwell on the interior and on the main entrance. We had the building owners present with us in committee who spoke about the desire to steward this in a historic way for future there themselves.'",
        "'speaker_1': 'Guests within the home, even though they own it and they have done immense historical research on all of the past residents of the home and are even in contact in communication with the descendants of the Bordeaux family. So I recommend you vote on this landmark designation today.'",
        "'speaker_1': 'Thank you. Council president, colleagues.'",
        "'speaker_2': 'Thank you, Councilmember Strauss, are there any additional comments? Hearing on will the clerk please call the role on the passage of the bill?'",
        "'speaker_4': 'This better? I. I want. Yes.'",
        "'speaker_1': 'Strauss Yes.'",
        "'speaker_4': 'Bold Yes. Lewis. Yes. Morales. S notes of President Gonzales. I didn't favor the menopause.'",
        "'speaker_2': 'The bill passes and the chair will sign. It will propose to fix my signature piece of legislation on my behalf. Will the clerk please read item 12 into the record and you can read the short title?'"
    ],
    "AN ORDINANCE relating to affordable housing on properties owned or controlled by religious organizations; modifying existing development standards to facilitate creation of affordable housing; amending Section 23.45.504 of the Seattle Municipal Code, renumbering Section 23.44.009 of the Seattle Municipal Code as Section 23.44.007 and Section 23.44.019 as Section 23.44.009; and adding new Sections 23.42.055, 23.44.019, 23.45.550, 23.47A.040, 23.48.100, and 23.49.037 to the Seattle Municipal Code.": [
        "'speaker_0': 'Agenda Item 12 Council Bill 120081. An ordinance relating to affordable housing on properties owned or controlled by religious organizations.'",
        "'speaker_2': 'Modifying existing development standards to.'",
        "'speaker_0': 'Facilitate creation of affordable housing. The committee recommends the bill.'",
        "'speaker_2': 'Passed as amended. Thank you so much. Once again, this comes out of Councilmember Strauss's committee, so I'm going to hand it back over to him about walk us through this item.'",
        "'speaker_1': 'Thank you, counsel. President, colleagues, this legislation, as stated, would grant zoning flexibility to affordable housing developments on land owned or controlled by religious organizations. The this is a long awaited bill. It first was passed by a state legislature, and we are now taking it up here within the city to make it a law within our city.'",
        "'speaker_1': 'And so there are many projects that are already underway, assuming that the language contained in the state bill would be passed at a city level. These are long awaited changes that stem from what was already adopted at the legislature.'",
        "'speaker_1': 'In most cases, affordable housing on eligible sites would be given one additional story of height in single family zones. Additional capacity would be granted without raising maximum heights. And in some of the denser multi-family and mid-rise zones, additional stories beyond the one floor would be granted.'",
        "'speaker_1': 'In order to qualify for this flexibility, sites would need to be owned or controlled by a religious institution, and the housing would be required to be affordable to households making up to 80% of the area median income. We do expect that for the majority, most of these projects using this flexibility will be providing affordable homes to incomes'",
        "'speaker_1': 'below 60% area median income due to the Office of Housing Requirements for funding. So if a if a site uses Office of Housing Dollars, they already have to meet the 60% area median income threshold, providing housing to people at 60%, median income or below.'",
        "'speaker_1': 'The difference between the 60 and 80% is flexibility that the legislature wanted to provide for institutions to use private dollars rather than city funded city funds to create this affordable housing. This is flexibility I have heard is desired.'",
        "'speaker_1': 'We heard from the Greater Church, the Church Council of Greater Seattle, that they would appreciate this flexibility, at least initially, so that we can see if this flexibility is going to be used as intended or if not. And that's part of why I really appreciated Councilmember Peterson's amendment to the bill.'",
        "'speaker_1': 'The Office of Housing, the Land Use Committee, chose to leave the requirement that 80% area median income because we have heard, as I said, there is interest from churches to see if this middle income, affordable housing development could be possible without city subsidy.'",
        "'speaker_1': 'Additionally, we have heard from the Church Council of Greater Seattle. They were again opposed to the lowering of the 80% threshold out of concern it would exclude churches who are navigating an already difficult process of financing and permitting affordable housing.'",
        "'speaker_1': 'I'm excited. I am excited to see this legislation passed today to open up more possibilities for much needed affordable housing across the city. I expect to see an immediate impact as there are projects awaiting this bill to pass today before we can begin development processes.'",
        "'speaker_1': 'And as we confront a homeless and housing crisis, more creative solutions like this are necessary to ensure we are doing all we can to meet these challenges at the scale of the crisis. Colleagues, I'm happy to take additional questions.'",
        "'speaker_1': 'That is the committee report at this time.'",
        "'speaker_2': 'Thanks so much, Councilmember Strauss. We do have a couple of amendments discussed this morning during council briefing, so we're going to go ahead and consider the proposed amendments. That's Amendment one. An amendment to both comes from Councilmember Herbold that we will have debate on each of those amendments and then we will take a vote on the respective'",
        "'speaker_2': 'amendments. And then I will open up the floor for discussion and conversation on on the bill as amended or not amended. So so if you are hoping to comment on the bill as a whole before final passage, you will have an opportunity to do so.'",
        "'speaker_2': 'Right now, what we're going to do is focus our energy on the two proposed amendments that Councilmember Herbold discussed during this morning's council briefing with a slight modification to Amendment one, as I understand it. So I'm going to go in and hand it over to Councilmember Herbold to make her motion on Amendment One.'",
        "'speaker_0': 'Thank you so much. I move to amend Council Bill 12 0081 as presented on the recently distributed Amendment one be.'",
        "'speaker_3': 'Second.'",
        "'speaker_2': 'It's been moved and seconded to amend the bill as presented on Amendment one. I'm going to hand it back over to Councilmember Herbold to walk us and the viewing public through Amendment One as proposed.'",
        "'speaker_0': 'Thank you. So Amendment one d would lower the average affordable housing income eligibility threshold to 60% of AMI average median income for renter households after an initial period at 80% average median income. State law requires a minimum 80% AMI affordability and allows cities lower affordability requirements, just like we do with MFT.'",
        "'speaker_0': 'The multifamily tax exemption program. That too sets a minimum affordability requirement and we have, as the policy body, have deepened those affordability requirements under the MFT program, most recently under the leadership of Councilmember Mosqueda. In response to the concerns that I heard from Council members just this morning, I have altered the amendment to change the effective date'",
        "'speaker_0': 'of the average 60% AMI until not be effective until July 1st, 2022, so that any projects that are currently in the pipeline that have been operating under the state's law will have the certainty that they need. 80% AMI Rent for a studio is $1,620 for a one bedroom.'",
        "'speaker_0': 'It's $1,851. We do not need to incentivize private developers to build units at these rents. It's practically market rate rent already. If we do that, if we if we create an incentive for churches to work with private developers to build these basically rather expensive, affordable housing units, there will be fewer mission based nonprofit developers partnering with these'",
        "'speaker_0': 'same religious institutions and less rentals at affordable, lower affordability rates. Though I really hope this sort of compromise version of this amendment can be supported by the Council today. Thank you.'",
        "'speaker_2': 'Thank you so much, Councilmember Strauss. You have your hand up.'",
        "'speaker_1': 'Thank you. Council President. Councilmember Herbold, as discussed at this morning's meeting. I will not be supporting this amendment today. I hear your. And I thank you for making that change. I did give you a call. You didn't? I didn't.'",
        "'speaker_1': 'We weren't able to connect by phone. So I think some of this could have been worked out on the phone. At this time, it is important for me to see if this program actually exists and if this flexibility is actually used.'",
        "'speaker_1': 'Because as we know and as I was stated just a minute ago, the majority, if not almost all of these projects that will be using this flexibility will receive city funds that meet that require meeting the needs that you just described of 60% AMI or below.'",
        "'speaker_1': 'It is important to me that we provide it when the Church Council of Greater Seattle, who are the majority stakeholders who would be utilizing this flexibility, have called in and just testified that they would not support this this amendment.'",
        "'speaker_1': 'It is important to me that we reflect that we respect that request, which is why I think that it would be important for us to take this up in a year when we have the data that Councilmember Peterson has requested in our hands to review the effectiveness of this of this plan.'",
        "'speaker_1': 'I share your concerns of wanting to have more affordable housing at lower rates. And that's why I would still be open to this conversation, because I know of the number of projects that are waiting for this bill to pass.'",
        "'speaker_1': 'I do not want to delay this today. Thank you, Councilmember, for.'",
        "'speaker_2': 'Are there any additional comments where. Peterson, please.'",
        "'speaker_3': 'Thank you, council president, and thank you, Councilmember Herbold, for bringing these amendments forward today. Is the the city council's central staff memo, when this bill was put forward, laid out issue ID and mentioned this as one of the issues to potentially lower the affordability threshold, which the state the bipartisan state bill representing the entire state put it'",
        "'speaker_3': 'at 80%. And I think that I, I support Councilmember remarks where we're trying to lower, you know, make it for very low income residents. I appreciate that it has the averaging so that you can bring in folks who are experiencing homelessness at 30% or lower and try to average it out with higher AMI.'",
        "'speaker_3': 'But still the average being at 60%. And appreciate that you put in that one year grace period. So I'll be supporting this amendment. Thank you for bringing it forward.'",
        "'speaker_2': 'Thank you, Councilman Pearson. Councilmember Morales.'",
        "'speaker_4': 'Thank you. I. I will. I'm a little conflicted here.'",
        "'speaker_6': 'I totally agree that we do need to be providing more options for housing that is affordable at lower rates at 60%. And I am concerned that this amendment would hinder or hinder religious organizations that can build affordable housing without public finance, as as there's been indications, some current and some are interested in.'",
        "'speaker_6': 'So at this time, I don't think I can support an amendment that would impede the synagogues and churches in my district from developing affordable housing for their seniors. And I know that there are some projects that are hoping to get started just that way.'",
        "'speaker_6': 'So at this time, I was.'",
        "'speaker_4': 'Supporting this amendment.'",
        "'speaker_2': 'Thank you. Customer Morales. I have a quick question. So, Councilmember Herbold there, there. It's clear that the council wants to create more deeply affordable housing. I think we're all aligned in that desire and that intent. And and and I think that Amendment one B is designed to hopefully create that incentive.'",
        "'speaker_2': 'And what I'm hearing from. The organizations that would be impacted by this legislation, that they are concerned that the law that in practice the intent or the sort of the theory that we're presenting in Amendment One be and may not be able to be executed in practice.'",
        "'speaker_2': 'And I guess I'm wondering whether you and your office have done any analysis on that particular concern that has been expressed by by religious institutions who have an interest in participating in the program as as structured.'",
        "'speaker_0': 'This amendment is intended to disincentivize religious institutions partnering with anybody other than mission based, nonprofit, affordable housing providers. If if it's at 60%, they're going to partner. If it's at 80. There's no there's no reason for a a religious institution to partner with the nonprofit, because the nonprofits are already going to be doing the 60% there.'",
        "'speaker_0': 'They are then going to look at a partnership that will result in a higher yield, a higher return to the religious institution. I'm just very concerned that we're talking about the position of the of the the owners of the property, as if that is the thing that should be driving our policymaking.'",
        "'speaker_0': 'Our policymaking is really about creating identifying the affordable housing that that we need to build in our city. Listening to people who would operate under those regulations and delivering policy that reflects the needs of our city. I am not surprised that an advocacy organization who is representing in this case is as fine as I am of the'",
        "'speaker_0': 'advocacy of the Church Council. They are. They are they're advocating for the interest of the property owners in this in this case. And just like we hear from private property owners when we're debating MSHA or debating MFT. Property owners have a have a have an inclination to prefer more flexibility with with the potential for greater financial return'",
        "'speaker_0': '. And I believe that our our decisions today should be based on the type of housing that we want to see developed using these these incentives.'",
        "'speaker_2': 'Because I don't I don't necessarily disagree with your analysis. My question is about the kind of housing stock we want to create and whether we are. Whether your amendment advances in practice. Not in theory, but if it will if if it will actually be achieved.'",
        "'speaker_2': 'I, i and I'll just sort of lay it out there. I don't want to support an amendment that is in theory, you know, values aligned and sending the right signals, but then in practice may not actually come to fruition.'",
        "'speaker_2': 'And that's that's that's that's what my question is about is about. Is about when you say that they're, you know, these religious organizations who are property owners who are interested in developing the property for affordable housing, if they that they will find someone who will construct at 60%.'",
        "'speaker_2': 'Am I I guess my question is, is how how do you know that? Because that has there been an analysis on that component?'",
        "'speaker_0': 'We have been told that the units that are at 60% army that are developed with this under this regulation would in effect, have city dollars in them because they would be built by nonprofits. We have heard from members of our nonprofit developer community.'",
        "'speaker_0': 'Sharon Lee has contacted, I think, many of us in support of this amendment. And I don't know if she was signing the letter that we all received from the Central Area Land Use Committee in her capacity as a neighbor or her capacity as an employee of roots housing.'",
        "'speaker_0': 'But Donna Moody signed the letter from the Central Area Land Use Committee in support of a similar amendment to the one that's before us right now.'",
        "'speaker_2': 'So. So, based on that letter, you believe that there are nonprofit housing developers who would be available and ready to participate with religious organizations to effectuate the intent of Amendment One be. I do. Okay. Okay. Councilmember Strauss, I see that you have your hand up.'",
        "'speaker_1': 'Thank you. Council President I think what I heard Councilmember Herbold say is that there's no incentive for. Property owners to use to get to 60% or am I? And I just need to call out the fact in my previous statements and I've said a couple of times today, the majority, if not almost all of these projects will'",
        "'speaker_1': 'most likely be using city funds requiring 60%. Ami the flexibility that we are looking at is to see if and to your point just now, do all of the nonprofit housing developers have the capacity to take on all of the projects that have now opened under this new legislation?'",
        "'speaker_1': 'And that's the question we just don't actually know the answer to. We also don't know how many of these institutions have the capacity to do that private fundraising, to utilize that 20% flexibility of AMI. These are questions not yet known, and I believe that we need to provide as much flexibility as possible and also not.'",
        "'speaker_1': 'I think we just need to allow as much flexibility as possible for the next year. I'm happy to come back to this in a year from now, analyze the data and make changes or come back smaller than that.'",
        "'speaker_1': 'I do think that at this time, you know, we made sure in my committee to have this I have to have this bill before us twice so that we met my desire to have the committee review an ordinance twice before passing or doing so as quickly as possible, because we know that there are churches waiting to utilize'",
        "'speaker_1': 'this policy as written from the state. Thank you.'",
        "'speaker_2': 'Okay. Kinsman. Harold, you'll get the last word. So I just want to scan the room and make sure no one else has any questions or comments on Amendment one. Be. Councilmember Peterson, please.'",
        "'speaker_3': 'Thank you. Council President Just a point of clarification for the people viewing this. The 80% am-I is still for the homeownership projects. This this amendment applies just to the the rental residential. So so there is flexibility already built in for homeownership projects where you tend to look for a higher AMI to be able to afford the mortgages'",
        "'speaker_3': 'so so that is there so those religious organizations that want to pursue homeownership projects will still have the 80%. And then this amendment applies just to the rental housing. Just wanted to clarify. Thank you.'",
        "'speaker_2': 'Okay. Thank you, Councilor Peterson. Any other comments before I ask Council Councilmember Herbold to close out debate? Customer, was it? I've seen you come off camera a couple of times. Would you like to add anything? I'll give you a minute to settle in.'",
        "'speaker_2': 'Thank you. Council President. I'm seeking cooler rooms in our home here, so apologies for the change in location. Okay. I appreciate the opportunity to again weigh in on this. I do want to make sure that I clarify for the record.'",
        "'speaker_2': 'There is. Not currently a policy that I think.'",
        "'speaker_0': 'We could put.'",
        "'speaker_2': 'Into place to.'",
        "'speaker_4': 'Deter nonprofit developers.'",
        "'speaker_2': 'From developing affordable housing. More than 1600, for example.'",
        "'speaker_4': 'The fact that.'",
        "'speaker_2': 'Rental units are so high is in part because we do not have enough.'",
        "'speaker_4': 'Rental units.'",
        "'speaker_2': 'It's not a matter of whether or not there's developers who are seeking certain price points. It's that we don't have enough rental units. And so if we want to address the cost of those rental.'",
        "'speaker_4': 'Units, I think one of the best things that we can do through this.'",
        "'speaker_2': 'Legislation is is increase the amount of rental units in Seattle across the market, especially up to 80% and live all of the lack of housing as pointed out by the McKinstry study that came out now twice in the last two years as constantly show that we don't have enough housing, including at 80% AMI or affordable housing units'",
        "'speaker_2': '. And all of that puts downward pressure on affordable units across the across the market. I, again, will be not supporting this amendment because.'",
        "'speaker_4': 'I do think that it is a.'",
        "'speaker_2': 'Counter to the shared goals, which is making sure that there's more affordable.'",
        "'speaker_4': 'Housing units out there.'",
        "'speaker_2': 'Overall period, and that we're doing everything that we can working.'",
        "'speaker_4': 'With these.'",
        "'speaker_2': 'Current.'",
        "'speaker_4': 'Property owners who.'",
        "'speaker_0': 'Are part of religious.'",
        "'speaker_4': 'Institutions, who have said, help us develop.'",
        "'speaker_2': 'This parking lot or this empty space into affordable housing.'",
        "'speaker_4': 'I think if we can.'",
        "'speaker_2': 'Work as fast as possible to build those affordable units up to 80% of AMI, it will actually help those who are 60% below estimate since.'",
        "'speaker_4': 'The report.'",
        "'speaker_2': 'Came to.'",
        "'speaker_4': 'The conclusion. So I apologize for not having that typed out to be.'",
        "'speaker_2': 'Able to more eloquently.'",
        "'speaker_4': 'Make the point as I've been shuffling through very.'",
        "'speaker_2': 'Warm rooms, but hope.'",
        "'speaker_4': 'That the point.'",
        "'speaker_2': 'Gets across that if we can encourage as many housing developers to build affordable units, including at 80% and below, then it does.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_2': 'The data shows that it does support affordable units opening up for folks who are at the lowest income levels as well. And I appreciate the leadership of Councilmember Strauss on the bill as underlined.'",
        "'speaker_4': 'That came out of committee and report supporting that today.'",
        "'speaker_2': 'A good customer. Mosqueda and I now have councilmembers still want in the cuz. I'm going to give her an opportunity to make some comments here before we close out debate council for a smart place.'",
        "'speaker_5': 'Thank you. First of all, I just wanted to second the points that Councilmember Herbold made in explaining why this amendment makes sense, because I think that all of the points you made are absolutely based, in fact, and like her, I also have a lot of respect for the judge council.'",
        "'speaker_5': 'You know, we are my office has worked with the church council and with many other faith leaders, and we will continue to do so, including the project that I mentioned this morning in briefing the. My office is going to be advocating for and hoping that.'",
        "'speaker_5': 'And I'm hoping that the rest of the council will support for affordable housing projects, especially in the Central District, but also on Capitol Hill and Othello and District two and so on. And we we need to continue that united work.'",
        "'speaker_5': 'But I think that in this case, it is a little bit akin to the debate that the then council had on the question of mandatory housing affordability. And it is a similar situation here where with or without this amendment, what we're talking about are changes on the margin, really.'",
        "'speaker_5': 'And that is what energy also and ultimately that work that, as I've said before, the main objective that the Chamber of Commerce and the landlord lobby had with the MTA was not so much that they were gaining a whole lot.'",
        "'speaker_5': 'What they did gain, though, was completely drowning the incipient affordable housing debate at that time or into this question of. You know, the esoteric, affordable questions of the Amaechi related legislation, which they didn't really ultimately talk about actual affordability.'",
        "'speaker_5': 'And I think I am supporting this amendment. I am going to say a few things in addition to what dancing both said. But also I wanted to say that, you know, at the end of the day and this is my message to also my friends at the church council and others that ultimately, you know, obviously, even though'",
        "'speaker_5': 'we may not agree on this particular amendment, I think we have to going forward, really continue to work together to massively expand affordable housing because the crisis is so acute, the affordability crisis. But I do think it is unfortunate that politicians continue repeating these supply side arguments about how it's mainly the lack of the number of rental'",
        "'speaker_5': 'units that is causing the affordability crisis. This is not borne out by the data, although, yes, of course we need. Do we need more density? Absolutely. Do we need much more of a zoning change in the city to allow multiple housing units to like apartment buildings to be built?'",
        "'speaker_5': 'Absolutely. Do we need more housing to be built? Absolutely. All of that is true. And yet none of that makes it true that the lack of the number of rental units is the problem. This is a supply side argument.'",
        "'speaker_5': 'This is the argument that the real estate industry makes. This is what property management corporations say. And I will you will certainly not catch me making those arguments at the end of the day. The question is affordability and simply building more does not ensure affordability.'",
        "'speaker_5': 'As an economist, I'm speaking, you know, in terms of just having looked at the data and there is no economist in this world who can tell you that, okay, you build up to this political threshold and then housing will start becoming affordable because rents will start coming down.'",
        "'speaker_5': 'There is no evidence to show that that happens. There's simply no evidence. And as a matter of fact, you know, in the pre-pandemic period, Seattle was the construction crane capital of the world, three years running. So if you look at the data and if the council claims to be data driven, then none of these arguments are supported'",
        "'speaker_5': 'by the argument that that is the main reason for the lack of affordability is not support. Do we need more density and more expansion? Absolutely. And I also think, though, there are important arguments that are made by are being made by affordable housing providers of one is that when you look at 80% area median income, that is'",
        "'speaker_5': 'if you look at the actual numbers, you know, in terms of what the rent actually is, it happens to be market rate in some cases. And it's just it's just difficult to believe that it is not possible to build housing more affordably than that.'",
        "'speaker_5': 'And we know there are housing providers who can build to greater affordability if there are avenues for them to get those opportunities. And there are public funding options available for even 80% of area median income housing like 4% federal tax credits.'",
        "'speaker_5': 'And so I will be supporting this amendment because from everything I have seen, the housing can be made more affordable than 80%. And I think it should be just if you look at the runs, the qualified 80% Amma, they are like market rate units.'",
        "'speaker_5': 'I mean, it's quite stunning actually when you see the numbers out of council members do look at those numbers as well. And I will, as I said, support this amendment. And I continue and my office continues to look forward to working with the faith community on really pushing for affordable housing and continuing to make the city much'",
        "'speaker_5': 'more affordable than it is today. Thank you.'",
        "'speaker_2': 'Think your customers want more herbal before I pass it back to you to close that debate. In having this conversation, there's been a few comments about how lowering the Army from 80% to 60% army would require.'",
        "'speaker_3': 'A.'",
        "'speaker_2': 'Subsidy from the city. What I'm what is confusing to me about that statement is, is whether that means that if this amendment didn't pass, there wouldn't be a subsidy required. And and I'm not sure that that's the case.'",
        "'speaker_2': 'But but secondly, if it is the case that a subsidy would be required, do you think that your amendment has the impact of requiring a deeper subsidy from some city resources in order to effectuate the intent of more deeply affordable rental housing units?'",
        "'speaker_0': 'The amendment itself has no impact on whether a subsidy is required. The fact that nonprofit developers working with religious institutions to develop land on the property owned by religious institutions. It's just a statement of fact that those nonprofit developers are likely to be getting funds from the city, and as a requirement of those funds, they will very'",
        "'speaker_0': 'likely be maintaining units at 60%. So this issue is being brought up to say that this amendment, my amendment is unneeded because as Desmond Strauss has said, the majority of developers that will be working with religious institutions will be receiving a subsidy from the city and will be maintaining their rents at 60%.'",
        "'speaker_0': 'AMI So that that is a that is a statement that is used to say that my amendment is unneeded. I, I believe my amendment is needed. I do not want to create the conditions where for profit developers are in a position to basically bump out our nonprofit housing developers in a in a situation where a religious facility'",
        "'speaker_0': ', a religious institution is choosing between which developer to work with if they choose to work with the developer who does not intend to take city dollars, does not intend to do mission based affordable housing development. The religious institution could then choose to work with the for profit developer at a greater financial return to the religious institution, which'",
        "'speaker_0': 'I understand that that is something that is desirable. But I'm just going to make these my closing comments, if that's okay, because answering your question, I think, is is is my closing comment. Sure. Go ahead. Reportedly, the the density bonus about doubles the land value.'",
        "'speaker_0': 'So religious institutions need to be, I think, in exchange giving a public benefit in exchange, as has been said before. 80%, AMI rents are basically market rate rents. And I would just to say those numbers, again, in case people didn't catch them when I saw them the first time, that's $1,620 for a studio and that is $1,851'",
        "'speaker_0': 'for a one bedroom apartment. That's 80%, Amy. That is basically market. If you do accept the argument, as Councilmember Saunders does not agree with the argument, but if you do accept the argument that building more supply of housing will drive the market down, well, then you're going to have a subsidy, a an incentive program where the rents'",
        "'speaker_0': 'are actually higher than market. And that just again, there's there's no there's no public value in that.'",
        "'speaker_2': 'All right. Thank you so much, council member Herbold, for both answering my question and wrapping up debate on this one. I appreciate it. I think we have exhausted our conversation and debate on Amendment one B. So I am going to go ahead and call this one up for a vote now.'",
        "'speaker_2': 'So will the clerk please call the roll on the adoption of Amendment one?'",
        "'speaker_4': 'The. Let's get a. Not so much.'",
        "'speaker_2': 'Sorry I got locked out. Yes, I am. I know.'",
        "'speaker_4': 'That's. That's Number Peterson.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Swan. Yes.'",
        "'speaker_1': 'Strauss now.'",
        "'speaker_4': 'Revolt. Yes. Yes. Thank you, Councilmember Lewis. Yes. Councilmember Morales. Oh. Council member or Council President Gonzalez, I. And Councilor Muscat. That was it. Yes. Is that correct?'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'It wasn't. Thank you. Just wanted to double check. Five in favor, three opposed.'",
        "'speaker_2': 'All right. The motion carries, the amendment is adopted and the amended bill is before the council. We do have another amendment, and that's amendment to some. And I hand it over to Council member Herbold to walk us through Amendment two.'",
        "'speaker_0': 'Thank you again. Skip over to my notes here. So I move to amend council bill 12 0081 is presented on the recently distributed amendment to.'",
        "'speaker_3': 'Second.'",
        "'speaker_2': 'It's been moved and seconded to amend the bill as presented on Amendment two. I'm going to hand it back over to Councilmember Herbold to address her amendment.'",
        "'speaker_0': 'Thank you. So this is pretty straightforward. This amendment would simply increase the term of affordability to 75 years from 50 years. I really want to, in offering this amendment, uplift the leadership of former Councilmember Rob Johnson. I think he really, with the MFA program, did the city a great service in moving our affordability requirements, the term of'",
        "'speaker_0': 'the affordability requirements to a longer a longer term. And I think that that is something that we should endeavor to replicate at any opportunity that we we have. So that, again, the the the value of the public benefit is more sustaining.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you so much, Councilmember Harold. Are there any additional comments on Amendment two? Okay. No additional comments. Oh, Councilmember Strauss, please.'",
        "'speaker_1': 'Thank council president. Much like the last amendment. I am encouraging my colleagues to vote no on this amendment. Came before the committee and did not receive enough support to pass on. This is all. And Councilmember Herbold, I appreciate you bringing this both of these amendments.'",
        "'speaker_1': 'These were both amendments that we had long conversations about in committee. And it is still my desire to see this program work as it has been written out for a period of a year. I understand that was it was your desire, and I appreciate you bringing forward a better amendment for that last one than what was originally'",
        "'speaker_1': 'put forward. So I do appreciate that. Again, there is confusion within. Within the community about the length of time. This amendment adds more confusion and clarity with some of these projects that are currently on their way to being being built.'",
        "'speaker_1': 'So again, I'm not seeing a one year delay in this amendment. Can you. Can you confirm that at this time this would go into effect today? Is that correct?'",
        "'speaker_0': 'It would go into effect with the passage of the legislation or the the the passage and signing and normal 30 day period. Yes, but you're right, there is no there is no phased implementation.'",
        "'speaker_1': 'So even more so, I think that through the process of these amendments over the last ten days, we have not had a cohesive stakeholder in process with the amendments, sponsors and the stakeholders, both the builders and the owners.'",
        "'speaker_1': 'This is an amendment that without the year delay poses, poses risks to projects currently desiring to use the legislation as written by the state so strong strongly encouraging colleagues to put down this amendment. Happy to bring all of this back up in a year or in six months when we have more data about whether this program is'",
        "'speaker_1': 'being utilized, is being utilized as intended, and if it needs changes. So not opposed to the intent. I'm very supportive of the intent. I am not supporting this amendment at this time and I remain open to future conversations regarding this.'",
        "'speaker_1': 'Thank you, colleagues.'",
        "'speaker_2': 'Thank you, councilmember strauss. Any additional comments? An amendment to. I'm not seeing any hands raised, so I'm going to go ahead and move towards calling the roll here. Will the park please call the role on the adoption of Amendment two?'",
        "'speaker_4': 'Let's get to know. Since then?'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'So. Yes.'",
        "'speaker_1': 'Strauss helped.'",
        "'speaker_4': 'Both.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Lewis. Yes. Morales. No. Council. President Gonzales.'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Four in favor and four oppose.'",
        "'speaker_2': 'The motion fails for a lack of a majority vote, so it is not adopted. Are there any further comments on the bill as amended? I'm not seen in any other hands raised because we're stressed. You are the sponsor of the bill, so I do want to make sure you get the last word if you would like to'",
        "'speaker_2': 'have one.'",
        "'speaker_1': 'Thank you, council president. Just looking forward to this bill passing so that the religious institutions who have been counting on this bill to be passed to move their projects forward. Thank you. Council President. Thank you, colleagues. I urge a yes vote.'",
        "'speaker_2': 'Thank you so much, Councilman Strauss. All right. Well, please call the role on the passage of the amendment bill.'",
        "'speaker_4': 'Let's get a. I. Peterson.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Swans? Yes. Strauss.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'We're both. Yes. Lewis.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Morales. As. Council President Gonzales. I wouldn't say none oppose.'",
        "'speaker_2': 'The bill passes as amended and then sure will sign it will place a fixed signature to the legislation on my behalf. Well, the clerk please read items 13 through 19 into the record.'",
        "'speaker_0': 'The report of the Sustainability and Renters.'"
    ]
}