{
    "AN ORDINANCE relating to Seattle Parks and Recreation; authorizing the acquisition of real property commonly known as 1902 NE 98th Street; authorizing acceptance and recording of the deed for open space, park, and recreation purposes; and ratifying and confirming certain prior acts.": [
        "'speaker_7': 'Civic Development, Public Assets and Native Communities Committee Agenda Item two Council 1196 16 billion to Seattle Parks and Recreation authorizing acquisition of real property commonly known as 1902 Northeast 19th Street authorizing acceptance and recording of the deed for open space, park and recreation purposes and ratifying confirming certain prior acts.'",
        "'speaker_7': 'The committee recommends the bill pass.'",
        "'speaker_1': 'Councilmember.'",
        "'speaker_3': 'Whereas thank you. Council President. This ordinance allows for the acquisition of the 1902 Northeast 98th Street Parcel in the South Fork of Thorn Creek up in District five for open space and recreation purposes. The Civic Development, Public Assets and Native Communities Committee recommends Council Full Council pass this ordinance.'",
        "'speaker_1': 'Thank you, customers. Any questions, comments or concerns? That those in favor of adopting the resolution. It's a bill. It's a bill. Council president, pay attention. Okay. I was excited about the next person. Okay. Please call the rule on the passage of the bill.'",
        "'speaker_0': 'Gonzalez, I Herbold.'",
        "'speaker_3': 'Hi for us. I Mesquita. I O'Brien.'",
        "'speaker_1': 'Pacheco, I so want.'",
        "'speaker_3': 'I thank President Harrell high nine in favor and unopposed.'",
        "'speaker_1': 'Bill passes and chair will sign it. Now read the resolution.'"
    ],
    "A RESOLUTION reclaiming the inherent responsibility of the City to protect its most vulnerable populations; acknowledging the disproportionally high rate of violence against women of Indigenous communities; urging City departments to deliver sustainable investments that address the Missing and Murdered Indigenous Women and Girls (MMIWG) crisis, and establish a new, racially appropriate framework of understanding an approach to ending violence against Indigenous women and girls; and calling on the Mayor of Seattle to drive systemic reform that requests and empowers and holds accountable related City departments to work in cooperation with Native Communities to build trust and engagement for stronger government-to-government relations.": [
        "'speaker_7': 'Agenda item for resolution three one 900, reclaiming the inherent responsibility of the city to protect its most vulnerable populations, acknowledging to the disproportionately high rate of violence against women of indigenous communities, urging city departments to deliver sustainable investments that address the missing and murdered indigenous women and girls crisis, and establish a new, racially appropriate framework of understanding'",
        "'speaker_7': 'and approach to ending violence against indigenous women and girls. And calling on the Mayor of Seattle to drive systemic reform that requests and empowers and holds accountable related city departments to work in cooperation with Native communities to build trust and engagement for stronger government to government relations committee recommends the resolution be adopted.'",
        "'speaker_1': 'Thank you. Customer Warriors.'",
        "'speaker_3': 'Thank you. Council President. I have a real lengthy, but there are some thank you's that I want to get the way before I go into the the text of the resolution. And then and on a more personal historical note, if that's fine, please do.'",
        "'speaker_3': 'All right. Thank you. I want to start by thanking elected leadership from Indian Country, former chair and council member Virginia Cross from the Walker shooting nation, who came here today and also, I understand, gave her staff the day off for people from Marcus to come down here today, which we want to thank you very much.'",
        "'speaker_3': 'I don't know if I've ever seen a tribal leader do that, but I love it when women are in power. Thank you. I want to thank Jessica Garcia Jones, who also accompanied Councilmember Cross for a mocha shoot with her daughter as well.'",
        "'speaker_3': 'I want to thank Melinda decree from the Snoqualmie Tribal Council. There she is. She didn't want to come up here, but. And I also want to thank, as always, Senator Claudia Kauffman, who I've known since I was 12 or 13.'",
        "'speaker_3': 'And we're still we're still here, Claudia. So with that, I want to go into some basic thank you. And then I would like to go right into the legislation of what it does for today and why it is so important and monumental.'",
        "'speaker_3': 'I want to thank the mayor's office, Mayor Jenny Durkan. I want to thank Chief of Police Carmen Best. I want to thank our city attorney, Pete Holmes, who I believe is in the audience and King County Councilmember Jenny Coles for leadership and support to partner on a regional level.'",
        "'speaker_3': 'We could not do this without our partners in the city government working with us and we've had great discussions with Chief Best and Mr. Holmes and the Mayor about how we get this legislation done and how we get it funded.'",
        "'speaker_3': 'Central staff. I want to thank the 18 the three A's Usher, but I say Asha's last name.'",
        "'speaker_0': 'So I'm going to set up.'",
        "'speaker_3': 'A system and.'",
        "'speaker_0': 'Thank God. Thank you.'",
        "'speaker_3': 'Amy Gore and Ali Pinochet. And I also want to thank Greg Doss. And I also want to thank amazing work, Danna Robinson Sloat, who has been working on our media. And more importantly, I also want to thank Negin Karmakar from my office was in the game.'",
        "'speaker_3': 'She's back there who's been working tirelessly on this for about six months. Very briefly, some of these people get public comment today, but my dear friend, thank you for your good words and being here. So the Sarah, the CEO of Sailing and Health Board, Abigail Alcohol, the chief research officer, Aaron Speck, the government affairs officer who I'",
        "'speaker_3': 'always bump into in Washington DC. Francesca Bernard Did I say that? I read Francesca. Where are you? Francesca. There you are. Phenomenal work with our staff in policy and central staff in drafting this, and that's what we want to call outward advocacy that we went to subject matter expertize folks and you guys actually drafted that legislation with'",
        "'speaker_3': 'this. Thank you so much. And Brad Engelman. Brad, are you here? Our media guy. Thank you, Brad. Good job from Selene Health Ward. And of course, again, one more time, the authors of the missing Murdered Indigenous Women and Girls Report.'",
        "'speaker_3': 'Abigail Alcoholic and the new Anita Lucchesi, they say. Right. The GC guy never gets write. Lucchese got it. Okay. All right. Now that I got that out of the way, let me just go right into the mechanics of what this resolution does.'",
        "'speaker_3': 'And it's no ordinary resolution that we're very proud of. The missing murdered indigenous women and girls crisis has been going on for decades. It was until recently that Indigenous stories have taken the stage for media government in the rest of the world to pay attention.'",
        "'speaker_3': 'It has been pivotal for our current leaders to take time to educate themselves and truly understand our history and our diverse identities from one tribe to another. We are looking at the systematic barriers for leaders to address missing, murdered indigenous women and girls, which include poor data collection, racially misclassified data reporting, lack of direct health services for'",
        "'speaker_3': 'victims of sexual abuse and lack of strong government to government relations. This crisis spans the entirety of the United States as well as into Canada. Back in 2016, as you heard, Canada issued their report, which was about 1200 pages long.'",
        "'speaker_3': 'And after thousands of interviews and days of investigative efforts, they decided that Native women were more vulnerable to violence and lack of state action in the United States or congressional leaders pushed forward policy recommendations, including Savannah's Act and VAWA, the Violence Against Women Act.'",
        "'speaker_3': 'And unfortunately, these pieces of federal legislation failed. We're excited that the state, through House Bill 1713 passed the Washington State legislator this year to create a liaison within the Washington State Patrol to work with indigenous communities across the state.'",
        "'speaker_3': 'Here in Seattle, Thistle in Health Board. And I have been also been working hard these last couple of years to help families right here at home for lasting, systematic change. You heard from some of our partners today. Noreen Hale from other nation.'",
        "'speaker_3': 'We have people here from United Indians and of course, Healing and Health Board. I'm honored to join the Clinton Health Board in their efforts by looking at what they did in Washington, D.C., and looking at what they did in Washington state by taking this action with Resolution 31900.'",
        "'speaker_3': 'This resolution aligns the city's resources, i.e., money, towards correcting this historical pattern of neglect of indigenous communities and towards deconstructing institutional racism with the first step that is passage of this resolution. La Salle Indian Health Board is a national leader in the fight against missing and murdered Indigenous women and girls.'",
        "'speaker_3': 'Crisis Solid Health Boards Chief Research Officer Abigail Alcoholic and colleague Dr. Nita Lucchesi published the nation's first response. And of course, our city is not proud of the fact that we have the most were ranked the number one city with the most missing murdered indigenous women and girls.'",
        "'speaker_3': 'But I think we can counteract that by being the first city to pass this legislation to address that. What is important to note is that the cell in Health Board's mission is to provide research and policy expertize to decolonize the data for indigenous people by indigenous people.'",
        "'speaker_3': 'And we see this in the resolution. The nucleus of this resolution, what the Urban Indian Health Institute research publication published in spring of 2019. That's the report that Abigail was holding when she gave public comment. This is the first ever publication in the nation on missing, murdered indigenous women and girls for native people who live in urban'",
        "'speaker_3': 'areas, including the city of Seattle. According to the study, Seattle ranks number one as having the highest rate of missing murdered indigenous women and girls across this country. What our resolution asks of this city in leadership, number one, we decolonize the data by improving data collection and reporting methods.'",
        "'speaker_3': 'We will be working with Carmen, best chief, best mayor, durkan city attorney Pete Holmes in King County prosecutor Dan Soderberg. And their support and leadership. Number to engage with the tribal community and confer with urban Indian organizations. This allows for subject matter expertize and we want to and will leverage the government to government relationship we share with'",
        "'speaker_3': 'tribes in all their vast resources. My aim is for a family of government response. Number three support capacity building assistance to organizations like the Seattle Indian Health Board. The city can provide direct health care and behavioral services for American Indian Alaska Native patients impacted by violence and sexual assault.'",
        "'speaker_3': 'And lastly, to provide a liaison, a real, actual human being who is subject, who has subject matter expertize and culturally attuned to bring indigenous approaches, resources and training to build relationships with the City Attorney's Office, with the King County Prosecutor's Office, with Seattle Police Department to improve data collection practices.'",
        "'speaker_3': 'My resolution is a necessary first step for the city to respond. Again, I want to thank Councilmember John Gonzales for their fierce commitment to this issue in committee, and I encourage my colleagues to please vote yes on this historic piece of legislation.'",
        "'speaker_3': 'I'd like to end on a more personal note and a little historical note for those of you who know me. My name in Blackfeet is not to Mrs. Takei, which means Holy Mountain Woman. What I want to share with you is that late in the 1970s and early 1980s, Indian country and tribal governments had a resurgence, a'",
        "'speaker_3': 'revival of our inherent sovereignty. Major cases from the United States Supreme Court and decisions and laws and congressional rights were passed regarding our basic human rights, most notably jurisdictional laws, religious protections. Tribal determination, sovereignty, and even finally recognizing that tribes will determine citizenship of their own people, not the federal government.'",
        "'speaker_3': 'So fast forward from 1978 to 2019, 41 years, but 41 years. But in 1978, a very important law was passed. A lot of people it's it's common knowledge now. But I remembered that I was 19. The Indian Child Welfare Act that took an act of Congress to stop the government, both state and local, from taking our babies'",
        "'speaker_3': '. Up until 1978, federal government and state and local municipalities could take our children. With no due process, no hearing. This wreaked unimaginable, horrific havoc on our traditional family, our social structures, and the break up of Native American families.'",
        "'speaker_3': 'The initial Welfare Act was brought and pushed by Native women to protect Indian children and families from removal by government agencies, denying them of their birthright. And today, in many languages, we have a word for them. They're called the lost one.'",
        "'speaker_3': 'And we're still looking for them. So that means every child born before 1978 could legally, illegitimately be taken by the courts and the state because they simply because they were Native American children. So today, like 1978, we're correcting or righting the historical wrongs of institutional oppression.'",
        "'speaker_3': 'As you heard, many of the women say today, missing, murdered indigenous women, girls is an unjust manifestation of institutional racism and colonization. Their policies, perspectives, procedures that don't value our lives or don't see us as human. Except today, unlike the initial, Wolf, Iraq, which took eight years to get past the city of Seattle, has bypass Congress, bypassed'",
        "'speaker_3': 'the state, and is poised to pass legislation to act to directly address and fund this very important human rights initiative, to address this crisis in human terms. Every native has felt the pain and trauma of losing our children a boarding school, a relocation of termination, assimilation and colonization.'",
        "'speaker_3': 'We know that trauma. Every native in this room has felt the trauma and pain of being invisible of someone, of loved ones being lost and nobody listening. We hope that today when our mothers, sisters, daughters and his cousins go missing, that people will hear us, that they will see us and they will go looking for them.'",
        "'speaker_3': 'We hope that when our people disappear, it won't just be our people looking for them, but it will be the Seattle Police Department. It will be the King County Prosecutor's Office. It will be the city attorney's office. It will be this council.'",
        "'speaker_3': 'I submit that is my promise to you. We hope that when one of us is murdered or left dying, that we will be identified so we can be brought home to the loving arms of our native people in our tribe so we can be buried the right way and recognize that our life didn't just exist for nothing'",
        "'speaker_3': '. Our people need to be returned to their family, to their tribe, to their people, to our way. So I just want to end. That we will be invisible no more. That this is just the beginning. And our very first step in making sure that when we lose our women and children, that somebody will be there to go'",
        "'speaker_3': 'look for them. Thank you.'",
        "'speaker_1': 'Think you can smell worse. This is a voting item, so comments are certainly welcome. Councilmember Bagshaw.'",
        "'speaker_0': 'This is going to actually be shorter than I expected. Councilmember Morris. Thank you. Thank you so much for bringing this forward. I am honored. To be with you through this. And to the people who are here today who have been invisible, you are very much visible to me.'",
        "'speaker_0': 'Your stories have just broken through. The fact that you brought this through your committee, it is a wonderful way of.'",
        "'speaker_3': 'Demonstrating how your background, your history.'",
        "'speaker_0': 'All of the good things that you have done in your life. You are sitting here and because you.'",
        "'speaker_3': 'Are sitting here, you have brought this to.'",
        "'speaker_0': 'Us. And I just I want to thank you for that so much and to acknowledge my good friend, the Holy Mountain Woman, and to say thank you. And also hello, Michael. I'm glad you're here.'",
        "'speaker_1': 'Thank you, Councilman Beckstrom. You know, the council members like to say a few words or. I think in this situation, the power of our silence means how much we support you and what you've brought to us and and the community.'",
        "'speaker_1': 'So I think we should have. Our silence is par for the course. And I've never seen this before. So thank you. Okay. This vote. Now. You got me. Yeah. You should apologize. Okay. Those who. Of. Those in favor of adopting the resolution, please.'",
        "'speaker_1': 'Or i.'",
        "'speaker_3': 'I, i.'",
        "'speaker_1': 'Those opposed vote no. The motion carries a resolution dubbed A.S.. I have a cold. That's why. Home coming for the council.'",
        "'speaker_3': 'It's okay to cry.'",
        "'speaker_1': 'Okay. We stand adjourned. Thank you.'"
    ]
}