{
    "A RESOLUTION requesting that the Department of Finance and Administrative Services, the Seattle Fire Department, and the City Budget Office include in the Citys contract for Basic Life Support Emergency Services provisions that provide to emergency medical technicians (EMTs) a prevailing wage and benefits comparable to other emergency workers employed in comparable cities and similar sectors in the City of Seattle; and requesting the departments to provide additional analysis, data, and information.": [
        "'speaker_3': 'The report The City Council Agenda Item two Resolution 318 31 requesting the Department of Finance, Administrative Services and the Central Budget Office negotiate contract for Basic Life Support. Emergency Services.'",
        "'speaker_1': 'Casper Bagshaw. Correct. I'm sorry.'",
        "'speaker_2': 'It's me.'",
        "'speaker_1': 'Oh, I'm sorry. I know this kind of pushed your customers to want. I'm sorry.'",
        "'speaker_6': 'No. Thank you, President Harrell. First, I need to move to amend. So I'm going to.'",
        "'speaker_0': 'Just.'",
        "'speaker_6': 'Read that out and then talk about it. Yep. A move to amend resolution 31831 by substituting version two for version one a second.'",
        "'speaker_1': 'Okay. You want to that's been moved in second that the resolution be amended. We'd like to talk a little about this amendment, but.'",
        "'speaker_6': 'Okay. I can talk about the amendment and then I'll have points about the resolution.'",
        "'speaker_1': 'The substantive resolution. Just we're.'",
        "'speaker_6': 'Just. So just to explain the amended version, this is a result of the discussions with Councilman Mosquito's office and with all the EMTs themselves and the union representatives. And there was there were many versions flying around. So I got a mosquito and I brought all of it together.'",
        "'speaker_6': 'And this version, version two, incorporates all of those changes and it has gone through law review as well.'",
        "'speaker_1': 'Okay. So we could address what it means more in depth, but right now we're just voting on the amendment. So any questions about the amendment process here? I'm going to we're going to vote on it because have mosquitoes.'",
        "'speaker_1': 'You want to say something?'",
        "'speaker_5': 'Thank you, Mr. President. And thank you to the program on this. I also want to acknowledge that this includes much of the hard work that Councilmember Gonzalez and I did prior to the weekend and spent a lot of time making sure that we had a good foundation.'",
        "'speaker_5': 'Minor tweaks this morning and late yesterday. So I think we're in a good place for this joint piece to move forward.'",
        "'speaker_1': 'Okay. So we're just going to do the procedural part of the amendment and then we could explain a little bit more. I think we're all sort of following the issue. So all those in favor of the amendment, please vote I.'",
        "'speaker_1': 'I oppose. The ayes have it. And I would like to address now the amended piece of legislation. And Councilmember SWAT.'",
        "'speaker_6': 'Thank you. As many of the MDs who spoke today indicated, this was this had come this resolution come to a vote to the city council last week. And I like them. I'm hoping that this will get voted in by the city council today.'",
        "'speaker_6': 'As everybody knows, our medical emergency medical technicians do or EMTs do vital lifesaving work in our community every day. They respond to assess, treat and transport people in all manner of emergencies, from psychiatric crises to car crashes to strokes.'",
        "'speaker_6': 'Last year, EMT has transported 43,000 times in Seattle. The emergency medical technicians that we're talking about who work for the private profit making company EMR, that the City of Seattle contracts with these MDs are members of Teamsters Local 763.'",
        "'speaker_6': 'I appreciate Les Brown, the representative of the Teamsters Local speaking, and I stand in solidarity with all of you as a member of the labor movement myself, as a rank and file member of the local teachers union, it's my honor to be standing with the Teamsters.'",
        "'speaker_6': 'The MDs work closely with and alongside the Seattle Fire Department, firefighters and medic one paramedics were employed by the city and are paid living wages and good benefits. We want all EMT to be making decent wages and benefits and for no one to be left behind.'",
        "'speaker_6': 'And as I clarified last time, I would like to clarify again, this is not the union's contract with AMR. This is the city of Seattle's service contract with AMR. And the city of Seattle has. And when I say city of Seattle, it means the mayor, the city council, the elected representatives of the city have a responsibility to'",
        "'speaker_6': 'make sure that all the workers get decent wages and benefits. As it happens, the current contract itself says that all EMT should get wages and benefits that are substantially equivalent to other workers who do similar work. But this contract provision is not being enforced.'",
        "'speaker_6': 'So despite that contract requirement, Seattle's EMT is working for AMR are paid fully 28% below. The starting pay for EMT is in comparable and even lower cost of living cities in California. And we want to make sure that this does not continue anymore, that the EMT are allowed to live a life in dignity.'",
        "'speaker_6': 'All workers should get to be live in dignity. But especially stark is the issue of the EMT who do life saving work for the rest of us every single day and are barely able to get by. At the current Seattle EMT wage, an emergency medical technician in Seattle would have to work more than 7075 hours every week'",
        "'speaker_6': 'without taking any vacation in order to be able to afford a typical one bedroom apartment in the Seattle King County area. According to data from the National Low Income Housing Coalition. Worse yet, Seattle EMT that provided a substandard health care plan that forces many workers to forgo necessary health care.'",
        "'speaker_6': 'Imagine the irony of this. They are transporting and helping workers, people who are facing the most emergent health crises, and they themselves are not able to have decent healthcare. This cannot be. It's just not okay. Workers are reported, M.D.s are reported that some of their colleagues are homeless.'",
        "'speaker_6': 'Others rely on food banks and other community services. They are many of them are living in unstable housing conditions. We have heard from an EMT, Meghan Scherzinger, who's who tearfully testified at the press conference a couple of weeks ago that she has had to sell plasma many times just to make a rent.'",
        "'speaker_6': 'And we heard from other EMT today that there have been cases of suicides. So we are talking about a very about a very critical situation here. And I hope that we don't delay this any more and that we wrote this through.'",
        "'speaker_6': 'I wanted to make sure that everybody your tanks, the EMT themselves, it is very hard to fight for your own rights. I know through personal experience, it's easier to fight for somebody else's rights, as strange as it may sound.'",
        "'speaker_6': 'It needs a lot of you need a lot of courage to fight for yourself. And so I really applaud my fellow workers. The EMTs who have organized themselves in this group say save, save our EMT. And I appreciate all the workers who have worked with Jonathan and Dead and others in my office to make sure that we'",
        "'speaker_6': 'have a strong resolution. That by itself is not enough. But it is a huge victory to propel the movement forward. So I look forward to the vote here. And I also want to say, you know, as EMT has indicated today, AMR lobbyists have been doing the rounds and we've got letters from the AMR lobbyist Paul Berrent.'",
        "'speaker_6': 'I just want to make sure the public is clear about who this guy is. AMR lobbyist Paul Berrent, who has been the one writing to city council urging that we not move forward with the resolution and has been crying a river about AMR's finances.'",
        "'speaker_6': 'He is the former chair of the Washington State Democratic Party and has formed strategies. 360 also takes credit for killing the Amazon tax, which would have built more affordable housing. So this is this is a nefarious source. So we have to make sure that the city council stands with the workers and not with the corporation that is'",
        "'speaker_6': 'making profits and yet keeping its workers from being able to live a life in dignity. And if this resolution does pass today, as I said, this represents a huge victory for the MTA and the workers who have been organizing with them.'",
        "'speaker_6': 'I should mention that healthcare workers and unions have stood solidly with the MTA. We've had SEIU 1199 Northwest Washington, 8488 vote unions that represent nurses and other staff at the Harborview Emergency Hospital, where they interact with the MTA on a daily basis, and they know the work that the MTA do.'",
        "'speaker_6': 'But we've also had incredible support from Certified Medical Assistance, many of them young women at the local Planned Parenthood clinics who are members of the U.S., CWA Local 21. So kudos to all the healthcare workers standing in solidarity with the EMT.'",
        "'speaker_6': 'I hope the City Council also shows that it is actually going to stand with the MDs and a message of the MTA. If this is a if this resolution goes through, it will be a historic victory for you, but it will not be the end of the road.'",
        "'speaker_6': 'We will need to continue organizing. So let's build on the momentum that we are able to win today.'",
        "'speaker_1': 'Okay. So we have a resolution that's been properly amended. We will be ready to vote unless there are some other comments. A few of my colleagues would like to make and I could wait for councilmember skaters like say a few words.'",
        "'speaker_5': 'Norm Well, thank you, Mr. President. I think that there's one thing I want to clarify. We took this last week to actually listen to the workers to incorporate additional protections. And I think that both the folks who've sponsored the amendments today, myself, Councilmember Gonzales, council members, Solent, we have actually created strength in this legislation because of all'",
        "'speaker_5': 'of your work. We have made sure that we're including language around health care and mental health protections, recognizing the trauma that workers see on a daily basis and wanting to make sure you have your health and mental health care protected.'",
        "'speaker_5': 'We have made sure that we're sending a clear message that a final contract that our city negotiates with Amara come back to this body so that we can see those provisions are upheld. We are making sure that there's greater oversight in terms of the contract and that we're living our values.'",
        "'speaker_5': 'And we're also making sure that the city require future contracts to retain workers so that if there's any changes, that there can be similar wages, benefits and jobs, so that if there's any switch in the future, workers can maintain employment.'",
        "'speaker_5': 'We're really excited about these protections today, and these came directly from conversations with workers themselves, from the conversations that the labor movement has had about making sure that we stand up and protect those who are the most vulnerable, and that we do so, especially for those who are caring for the most vulnerable.'",
        "'speaker_5': 'I want to thank the union members, the rank and file folks, union leaders. Thank you to the president who came forward to Chief Scoggins and the EMT for sharing your stories today over the last week and for your tough negotiations.'",
        "'speaker_5': 'We understand that this, as the councilmember said, is not a contract that we are amending between AMA and the union. But yet being clear in our perspective as a city what we value and what we want to see in any contractor.'",
        "'speaker_5': 'We also want to make sure that we strike the right balance so that we have clear follow up steps that are necessary to make sure that we can fulfill our values here that you see laid out. And I'll be working with the chair, Chuck Gonzalez, who oversees public safety to make sure that the next steps are very'",
        "'speaker_5': 'clear. And we recognize that there's additional barriers to making sure that we are protecting those who are caring for our most vulnerable. We care about workplace sustainability, which is something we'll be discussing in our committee this upcoming meeting on Thursday.'",
        "'speaker_5': 'We want to make sure that those who are providing care for our most vulnerable, whether you're picking up folks in the street or whether you are caring for folks and helping to place them into a new home that everyone can afford to live in the city that they are working and helping those to stay in the city'",
        "'speaker_5': '. We want you to be able to have a good living wage job as well. So thank you again for bringing this resolution forward. Council members want thank you to Councilmember Gonzales for your work on it with our team over the weekend.'",
        "'speaker_5': 'Looking forward to working with you on that next steps. And thank you all for your continued activism and making sure that we hear your voice.'",
        "'speaker_1': 'Thank you. Councilmember Mesquita, Councilmember Herbold.'",
        "'speaker_4': 'Thank you. I just wanted to make two quick points. When I met with the Teamsters on Friday, they identified that a tangible.'",
        "'speaker_0': 'Deliverable.'",
        "'speaker_4': 'For their union would be an answer to what areas Seattle uses as an objective measure to determine whether Amar'e or any other vendor is meeting its obligations under Article 7.5 of the RFP. That relates.'",
        "'speaker_0': 'Specifically to.'",
        "'speaker_4': 'The requirement that wages be comparable to the prevailing wage in other cities. We know that other cities in the West Coast range from a starting wage of eight, $8.09 to as high as $22. Whereas Seattle, Amar'e, it starts at.'",
        "'speaker_4': '1554. So I just want to uplift the fact that Section five of this resolution specifically asks, in consideration of the Teamsters request, that the executive provide us with information that basically.'",
        "'speaker_0': 'Lets us know who.'",
        "'speaker_4': 'Their what cities they are considering as the other comparable living prevailing wage cities. The other point I wanted to make is that I recognize that Amar'e has not received a rate increase on Medicaid reimbursements from the state of Washington since 2000.'",
        "'speaker_4': 'For Medicaid transports are reimbursed at a fixed rate of approximately 135 per transport. That is very, very low and I have connected with the Director of our Office of Inter-Governmental Relations to see that we highlight this issue in our legislative agenda that we use to.'",
        "'speaker_0': 'Lobby.'",
        "'speaker_4': 'Olympia and our legislators to address legislatively in this legislative session coming up. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Herbold. Case closed remarks by Councilor Swan and I think we'll be prepared to vote.'",
        "'speaker_6': 'I just wanted to share with the public that, you know, when we fight we do win. Already the MDC won something that the that a union approached the mayor about. And the mayor has sent a letter to the union.'",
        "'speaker_6': 'And that was the issue of the Seattle Police Department's use of IMR to transport arrestees to King County jails. And the EMT have been, you know, talking about this as an unfairness. I see the MDs nodding. Well, congratulations on a victory that you've already won, because you've got the letter from the mayor that says that that practice'",
        "'speaker_6': 'will stop and they will figure out other alternative means of transportation. And it says, Chief Bratton, I have agreed to discontinue the use of transporting detained suspects and arrested individuals who have no medical needs for the county's correctional facility.'",
        "'speaker_6': 'So congratulations on that. Congratulations and advance on what I think is going to be a unanimously voted resolution. Let's keep fighting for the next steps. Let's make sure you all win of our contract and a life with dignity as all the workers deserve.'"
    ],
    "AN ORDINANCE relating to the Pike Place Market Historical District; amending Chapter 25.24 of the Seattle Municipal Code to adopt an interim boundary expansion for the Pike Place Market Historical District.": [
        "'speaker_1': 'Okay. Those in favor of adopting the resolution as amended. Please vote i. I those opposed vote no. The motion carries a resolution is adopted. Same. The next agenda item into the record.'",
        "'speaker_3': 'The report of the Finance and Neighborhoods Committee to name three resolutions excuse me accountable 119 330 related to the Pike Place Market Historical District amending Chapter 25.24 Estate Code to adopt an interim boundary expansion for the Pike Place Market.'",
        "'speaker_3': 'Historical Districts Committee recommends the bill passes amended.'",
        "'speaker_1': 'Very good, Councilmember Baxter. Why don't you introduce the matter? I'm sure folks have something you should amend.'",
        "'speaker_6': 'Go ahead. Amended version and then.'",
        "'speaker_0': 'Yes, that's what I was going to bring forward this amended version. But if you would like to do that first, please go ahead.'",
        "'speaker_6': 'No other way. But I don't know what the familiar is specifically.'",
        "'speaker_1': 'Why don't you go ahead and make the motion for the amendment? That's what I thought you were going to do.'",
        "'speaker_0': 'So very good. Last week we looked at an ordinance which we amended a couple of times in my committee, and we have provided another amendment yet this morning, which, like I would like to put in front of us for discussion.'",
        "'speaker_1': 'Okay. So what let's describe with a little more particularity, Councilwoman Swan, would you like to describe this amendment a little more specifically or. No, you don't have to. Would you like to? I I'm sorry. Who would like to describe them.'",
        "'speaker_0': 'And I'm. I'm not. Go ahead.'",
        "'speaker_6': 'It's. Yeah. My legislation, I'm probably in the best position to explain it. So, first of all, I. I'll just make the motion. I moved to amend council bill 119330 by substituting motion for for version to.'",
        "'speaker_1': 'So second.'",
        "'speaker_0': 'There's second.'",
        "'speaker_1': 'Okay. And this version has been approved by law.'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'And as a matter of fact, just to quickly explain the the amended version, it actually and this came after the committee vote on Wednesday. It incorporates recommended amendments from the law department itself. And I can go over it again if you want.'",
        "'speaker_6': 'But these were the things that we discussed at the briefing. Yep.'",
        "'speaker_1': 'Okay. I think we're ready to vote any of the comments before we vote on the amendment. All those in favor of the substitution version for for version two, please vote I. I opposed the ayes have it. So now we have a version for for consideration.'",
        "'speaker_1': 'We'd like to speak to the version four of this ordinance. That could wait. I'm pretty informal on the process here, since we all worked on it. Sort of collectively, consumers don't like to tear up.'",
        "'speaker_6': 'Thank you. First of all, I wanted to thank all the all those who have been fighting to save the shoebox for also supporting the MDC in their fight. I won't really make too many arguments for why we should save the shoebox.'",
        "'speaker_6': 'Because you all have said it more than eloquently. And I didn't hear what there was, but.'",
        "'speaker_0': 'Related.'",
        "'speaker_6': 'It. It is. It is absolutely all related. I could not agree more. Yes, it's about saving our city. So just to let everybody know, the petition that was started by Jay Middleton, who spoke in the public comment this morning, when I checked, it had 92,975 signatures.'",
        "'speaker_6': 'And we have we have had tremendous outreach from the music community. You all know last Monday, Ben Gabel from Death Cab for Cutie was here and he called my office saying, I'm just calling as a constituent. And we've had now the Pearl Jam concert on Friday.'",
        "'speaker_6': 'I don't know how many of you were there, but but they some somebody somebody I know message me a clip a video clip from that concert where everybody was saying, save the shoebox, save the shoebox. So thanks to all the the music community for putting their weight behind us.'",
        "'speaker_6': 'We also know that a number of music musicians and music bands, everyone from Katy Perry to Sir Mix-A-Lot, you know, it's every genre you like to go out a two page ad in the Seattle Times, I had my staff member check how much it cost, and it costs roughly $22,500 for a 42 page ad.'",
        "'speaker_6': 'So now, granted, the musicians may be able to afford it easily. But I think what that ad represents is the tremendous commitment of the entire community, not just the most well-known musicians, to saving the shoebox. So this is really, really important.'",
        "'speaker_6': 'And it's it's been my honor to be able to be there with you. I think it is important to underscore the points that we made earlier, which is that this is not and again, I'm going to quote only one of the employees of the Showbox was sitting right there who I think said something like, this is not'",
        "'speaker_6': 'a conflict between culture and affordable housing. This is a conflict between culture and profit. And he asked City Council, Which side are you on? And I think somebody else also captured that sentiment. And I think it's important to clarify that this is this is not this entire community, which is probably far more than 100,000 people.'",
        "'speaker_6': 'Not everybody who wants to save the shoebox has openly spoken up or one has signed the petition. This is not against change. The question that all community members and working class people are asking is on whose terms does change happen in Seattle?'",
        "'speaker_6': 'That's the question. And I am. So I mean, I don't have words to describe my gratitude to everybody who has stood on the front lines of this, because that is the only reason we are here today. I thank all the council members who were there at the Wednesday committee because we were able to have a discussion and'",
        "'speaker_6': 'be voted the legislation out of committee, six votes for, no votes against and no abstentions. So that already shows how much how much support there already is for for this legislation. But again, I will also say that this won't be the end.'",
        "'speaker_6': 'This legislation is very, very important today, but that is step one. We need to continue to get organized. So those of you who are here, those of you who were here last week, we need to come together again, maybe in September and discuss our next steps for organizing.'",
        "'speaker_6': 'But thanks to everyone and.'",
        "'speaker_7': 'I know and I know.'",
        "'speaker_6': 'Special thanks to the Showbox employees themselves.'",
        "'speaker_1': 'I think the bill has been properly moved. And second, it is ready for vote unless anyone has any. Councilmember Herbold.'",
        "'speaker_4': 'Thank you. So one of the findings of the Arts Office's CAP report, which is the creation, activation and preservation of cultural spaces. I know there are a lot of people involved in it, but I want to recognize Matthew Richter in the office, who is one of the primary authors.'",
        "'speaker_4': 'Really, this report really does a great job.'",
        "'speaker_0': 'Of highlighting.'",
        "'speaker_4': 'Why this is an.'",
        "'speaker_0': 'Issue that is much.'",
        "'speaker_4': 'Larger than just a shoebox.'",
        "'speaker_0': 'That that report says, despite cultural.'",
        "'speaker_4': 'Spaces role in strengthening neighborhoods, creating and maintaining these spaces in strong real estate markets can be extremely difficult. The older, smaller.'",
        "'speaker_0': 'More.'",
        "'speaker_4': 'Eccentric spaces that often house cultural uses and small businesses are particularly vulnerable to development driven displacement. And I bring that up because.'",
        "'speaker_0': 'The CAT report itself has.'",
        "'speaker_4': 'A number of different recommendations to deal with.'",
        "'speaker_0': 'This larger.'",
        "'speaker_4': 'Larger issue. One of the one of the recommendations is to actually look at creating a cultural space management public development authority that we're going to hear more about that actually in my committee tomorrow morning. This council worked with the arts office in developing an implementation plan for its recommendations.'",
        "'speaker_4': 'So really, this is really about, I think, a much bigger issue. One of the things that we've been talking about since last Wednesday was the talk.'",
        "'speaker_0': 'About whether or not we should hold the legislation. And I'm glad that it appears that we've decided.'",
        "'speaker_4': 'Not to hold it. But I do want to. Yeah.'",
        "'speaker_0': 'I really want to sunlight the issue.'",
        "'speaker_4': 'The fact that the developer of this site agreed to voluntarily take steps to delay vesting in the hopes that this council would delay the vote. And happily, again, it appears that that we're not doing that.'",
        "'speaker_0': 'Though a hold would.'",
        "'speaker_4': 'Provide an opportunity for the developer to develop another plan. The description I've heard of, the plan that they're working on, calling it a win win solution gives me great pause. The developer's legal counsel contacted SGC last week in their agreement to delay vesting, and the description of the Win-Win effort was as follows We look forward to working'",
        "'speaker_4': 'with you on a win win solution that could sustain the performance history of the shoebox into the future.'",
        "'speaker_0': 'So as I.'",
        "'speaker_4': 'Understand the words, sustaining the performance history, this, of course, could result in space within the new building. Being dedicated to live performance rather than a preservation of the structure, like was successfully done in the instance of the sanctuary on Fifth Avenue, with construction costs approaching over $900 per square foot for some of the new high rise buildings'",
        "'speaker_4': 'in the city. I really doubt that any performance venue could financially support that cost per square foot.'",
        "'speaker_0': 'So that's to me, I think that's a it's up it's a hollow effort.'",
        "'speaker_4': 'Because one, as as you.'",
        "'speaker_0': 'Have really made.'",
        "'speaker_4': 'A great point of there are things.'",
        "'speaker_0': 'About this structure.'",
        "'speaker_4': 'That are so important to maintain. I'm really glad that somebody mentioned the spring loaded floor. That is really one of the things that makes.'",
        "'speaker_0': 'Makes a show at the Showbox, a really life.'",
        "'speaker_4': 'Changing experience.'",
        "'speaker_0': 'Almost in the stage from the floor.'",
        "'speaker_4': 'And so so all of this brings all of this brings me back to, again, the recognition that the CAF report has identified, which is that because we have.'",
        "'speaker_0': 'Such a hot.'",
        "'speaker_4': 'Real estate economy, we have to be creative in finding ways to save these venues. So thank you.'",
        "'speaker_1': 'Thank you. Okay. So I think we're ready to vote.'",
        "'speaker_0': 'Not quite. Oh, quite. Okay, well, now. Now we get down to the procedures, and I know you're all excited about how this is going to work. I am very much presuming that this is going to be a unanimous vote today.'",
        "'speaker_0': 'And what's going to happen is that it's going to bias about ten months time to consider how the Showbox property can be included as an interim basis and working toward a more permanent basis to be part of the market.'",
        "'speaker_0': 'But it's also going to take us some time to get there. The Pike Place Market itself, tenants, board members, many people in the music community, property owners, both people who are living there now and businesses have said that they would like to be part of this.'",
        "'speaker_0': 'They want to be part of the conversation about how we preserve the shoebox and this and the floor and the wall, as you've talked about, and the stage. So it's not anything that is going to be preserved if it is scraped and then something else is built there and the shoebox is put elsewhere.'",
        "'speaker_0': 'We have heard that loud and clear. Preserving the shoebox and its history and the cultural value, however, is going to take every tool in our book. And I think that already our historic Seattle. Thank you all for coming today and for getting in the landmark nomination.'",
        "'speaker_0': 'It was pretty amazing. For those of you who are not here on Wednesday, my committee people are sitting there working through talking about the conversation. Eugenia Wu is sitting there completely poker faced, and at the end of the meeting, we find out that they had submitted a landmark nomination in the middle of it.'",
        "'speaker_0': 'So we appreciate the fact that it's moving forward. But the plan and this is something I think is really important for people to work on with us together is to explore the potential impacts on the neighbors and the neighborhoods.'",
        "'speaker_0': 'And I want to get more specific about that. But the impact to the market and the key organizations could be profound. We want to make sure that they've got the time to think this through and what it means.'",
        "'speaker_0': 'And we've got to rely upon the roles and responsibilities of those who have been engaged in the market for over 50 years now. And it includes our preservation and development authority. I want to recognize that Mary Vaccarello was there on Wednesday, our market historic commission and Friends of the Market.'",
        "'speaker_0': 'Sarah Payton was there with us as well. The Day Stall Tennis Association, the Market Foundation, the Merchants Association and downtown neighbors and property owners that are around there, the market operations in them. So sells for maintenance, security facilities, the buskers, the events and all that, something that has to be considered as well.'",
        "'speaker_0': 'Also, just from the standpoint of what we will be looking at, First Avenue mobility is a big deal. Many of you have been listening to this for years about whether we have a First Avenue streetcar, yes or no, what we can do during this.'",
        "'speaker_0': 'What I love the marketing term of the period of maximum constraint, but freight deliveries are critical for markets, for merchants, for the hotels and residents. And a gentleman that was here from the Newmark mentioned that the alley is critical alleys all through.'",
        "'speaker_0': 'Whether it's between first and second or second and third are things that we really haven't come to grips with yet. And we're going to be working, continuing and call upon escort to make sure that the transportation mobility all around those blocks is really addressed while we're doing this kind of work.'",
        "'speaker_0': 'And many of you remember that the pipeline corridor improvements are something that this council has been working on. I don't want to see one of them get behind this other work. I do want to say thanks to my council colleagues, all of you who are here, every one of you have paid attention.'",
        "'speaker_0': 'You jumped on it. We had an excellent meeting on Wednesday where this came through loud and clear that preserving the shoebox was important. And at the same time, we have affordable housing we're trying to accommodate. We want to include more people in the neighborhood.'",
        "'speaker_0': 'So that said, the market charter itself are market guidelines. They provide the time tested kind of public processes. I'm looking forward to working with that. And I want to thank my colleague, Councilmember Gonzales. She's putting together a resolution right now that's going to set forth a schedule and how we're going to proceed that will probably be in'",
        "'speaker_0': 'front of us in September. I want to thank her staff as well, already is working with mine because as we're moving these conversations forward, I can just see that we can expand this conversation to the downtown neighbors as well as to the music community, residents and businesses.'",
        "'speaker_0': 'So that people see this. We're bringing the collective wisdom to the table, figuring out the best way that we can to preserve the shoebox without negatively impacting the market or in the neighborhood around it. So with that, that's the process you can expect.'",
        "'speaker_0': 'I want to say thank you. You've got my vote on this.'",
        "'speaker_1': 'Thank you very much. That's why I'm a skater.'",
        "'speaker_5': 'Thank you, Mr. President. One of the individuals who came up to testify said that they moved here many years ago and they moved here for the culture. And we have people who are continuing to move here every single day.'",
        "'speaker_5': 'In our region, we have over a thousand people who moved to our region because of the culture, because of us, the community, because of the environment that we've created and because of our progressive values. And another person who came forward testified to say that past city councils should have taken opportunities to up zone, up zone throughout the'",
        "'speaker_5': 'city so that we can have housing and density and affordable homes and cultural centers and child care and access to grocery stores. Those are the things that I hope that we can do together, because it doesn't have to be a false dichotomy.'",
        "'speaker_5': 'We must be able to preserve cultural hubs for individuals to come together, to gather, to either create activism or art or music. And we also we also need to have the ability to afford to live in this city so that those who are performing at the Showbox, those who are cleaning up the buildings, those who are building'",
        "'speaker_5': 'the buildings, those who are stocking the grocery shelves are taking care of our kiddos. And seniors can afford to live in the city. And right now. And right now, our restrictive zoning laws have focused most of the development to 15% of this city.'",
        "'speaker_5': 'And when 15% of the city is focused on development. It's no wonder that the cost of housing continues to go up, that folks are being pushed out of the city, that mostly black and brown and low income workers are being pushed out farther and farther and having been too forced to commute, commute to their jobs.'",
        "'speaker_5': 'And you know what? We want to make sure that this movement continues so that we can do development done right, so we can create affordable housing and more music venues and art centers and childcare facilities and grocery centers.'",
        "'speaker_5': 'So I want to keep working with you to make sure that we create that density throughout the city so that we can create the homes and the public services and more artistic venues. So we can truly be that creative hub that brought many folks here and that keep many people here.'",
        "'speaker_5': 'I know it doesn't have to be a false dichotomy. I'm hoping that we can continue to work through this committee and the effort that's been laid out in this new legislation to make sure that we can create an actual win win, because we have to not just say protect this one piece when what we want to do'",
        "'speaker_5': 'is protect cultural hubs, especially in black and brown communities that don't often have a historic designation. We want more affordable housing for those who are performing and wanting to raise their kiddos here and stay here as seniors on fixed income.'",
        "'speaker_5': 'So will you work with us to create affordable housing and a cultural center going forward? All right. I look forward to working with you, and I so appreciate all of the activism and I really appreciate you all coming forward.'",
        "'speaker_5': 'I did have my life changed by another motley concert at the Showbox, although Motley and really I think, you know, it helped that she kind of like me roots in the community and want to continue to be here so looking forward to working with you.'",
        "'speaker_5': 'Same saving the Showbox. Step one.'",
        "'speaker_1': 'So Councilmember Gonzalez.'",
        "'speaker_4': 'Thank you council president serve my remarks are I'm going to be a lot more boring than that and I apologize in advance because I use all my energy already on the first agenda. You know, I just wanted to I just really wanted to talk about what I keep hearing from folks about how much the show box means'",
        "'speaker_4': 'to them. And I know that there are some people who might be listening to this conversation. I don't know who they are, but there might be some people who listen to this conversation and think about how it's just a building.'",
        "'speaker_4': 'And and I think that what I hear from the public testimony, from the countless number of people who've been emailing and calling my office, is that this represents much more than just a building. It really is about who we want to continue to be in the future in our city.'",
        "'speaker_4': 'And we and and it's about taking a position that we value the arts and culture and music community and those who participate in it to be part of our story moving forward, not just in history, but in present and in the future.'",
        "'speaker_4': 'And I really want to thank you all for just reminding us as a city that that's important. And as as somebody who's who has participated and going to concerts at the Showbox or just going in to get drinks at the Showbox as I'm working my way through downtown and whatnot, I, I understand and appreciate and what this'",
        "'speaker_4': 'means to our community. And so I'm really proud that we're going to be able to take a step forward now to hit the pause button, really, and to make sure that we send the message to those who want to see the Showbox go away that the Showbox isn't going anywhere.'",
        "'speaker_4': 'And I'll just I'll just end by by talking a little bit about how I hope we can accomplish creating a path forward to making sure that whatever tool we use to create the greatest opportunity possible to preserve the shoebox through community driven approaches is is a resolution that I'm working to pull together that I'll be working with'",
        "'speaker_4': 'my colleagues on. I think I think you all should walk away with a sense of understanding and belief that we are unanimous up here on this city council, on this dais, that we need to create as many tools and options and pathways and rooms available to have a conversation about what the appropriate tool is to preserve the'",
        "'speaker_4': 'shoebox. And I'll be working really closely with my colleagues to do that. But I also want to work closely with a lot of you and with as many of you who are willing to continue to engage over the next several weeks and months to make sure that that that the tool that is chosen is one that is'",
        "'speaker_4': 'going to be most viable and most workable for everybody who's interested in making sure that we preserve the shoebox within our arts and culture community. So I look forward to working with you on that. For any of you who are interested in continuing to work with me and my office on this, you can reach out to my'",
        "'speaker_4': 'office and I'm literally one of the most easiest people to find. So just, you know, look, look, look us up. Give us a ring sheet, drop us an email, let us know how you want to be engaged and involved, and we'll keep you posted on making sure that the work plan is one that is going to keep'",
        "'speaker_4': 'up, keep up the urgency, but also create an opportunity for for the most creative solutions to to win out, to accomplish the common goal that I think we all have here.'",
        "'speaker_1': 'Thank you. Councilmember suarez. Councilmember war as you have the floor.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_0': 'Council president.'",
        "'speaker_3': 'I'm not going to be specifically on point about the Showbox, but I have an overarching theme here that has always concerned me since I've been on Seattle City Council that is with CCI or any of the PDAs or the Design Commission or the Historical Commission.'",
        "'speaker_3': 'While I appreciate that you're all here and the shoebox is important to you and you all have great memories as a Native American person is indigenous people that are this is our land. People have been deliberate in erasing us and making us invisible.'",
        "'speaker_3': 'What is more important, from what I heard today in this conversation, I've heard it my whole life is what is history and what is culture? And who gets to decide? Who gets to decide what's important? What is your soul?'",
        "'speaker_3': 'And I'm here to tell you that the soul of the city are the indigenous people that were here. I'm hoping that when it comes, when we have our issues, that we can count on you to step forward and support us in making us in seeing that we are the indigenous in the original folks here and that our'",
        "'speaker_3': 'culture and our history has to be represented. And I say this not to be on a down note. I say it because, again, these institutions that were put together, these commissions, these PDAs, these committees, were deliberate in keeping our voices of people like me who don't get to be on these committees and commissions and decide what is'",
        "'speaker_3': 'culture, what is important, and what is soul. Because I believe that this is Indian country and we should be.'",
        "'speaker_0': 'Represented across the board.'",
        "'speaker_3': 'So I'm hoping when some of you come forward and like listening to you today, I was mildly listening about your great memories of coming to Seattle, of your memories of going to a concert there. Imagine people who have been here for time immemorial in which the only thing that shows that we're here is that fake cheese Seattle'",
        "'speaker_3': 'thing over there and some other issues down in the market. So I'm hoping when the time comes, I can look for your support to talk about what it is to be indigenous and what it is to be representative.'",
        "'speaker_3': 'And that has that's neither here nor there for me about the Showbox. So I just want to end on that note. Thank you.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_2': 'Thank you. I am thrilled to support saving the shoebox today also. Someone said in public comment that what makes Seattle great is change in progress, but not at the expense of things we care about. And obviously. Councilmember Whereas I appreciate your comments about how we decide what that is.'",
        "'speaker_2': 'But clearly, we've heard resoundingly from the community that saving the shoebox is critically important. And it's amazing to see how many people come together so swiftly around this. And it was great that we've been able to find a legal path to move forward, to put a pause on this, to have further discussion, and to figure out how'",
        "'speaker_2': 'we can have a long term, permanent solution to saving this shoebox. I really appreciate all my colleagues work on this legislation and excited to go to the next step. So thank you.'",
        "'speaker_1': 'Thank you. Has asked, why would you like to close debate?'",
        "'speaker_6': 'Yes. Thanks to all the council members who who've spoken in favor of saving the shoebox and to the council members who participated in the discussion on Wednesday. I also wanted to thank Kittle Freeman and Lesch Watson is right here.'",
        "'speaker_6': 'These are these are staff members who serve all council members. And they are the ones who worked with my office to develop this ordinance. So they they certainly deserve a big measure of the things. And also, Kirsten arrested central staff director, historic Seattle who've been on the forefront of this from the very beginning.'",
        "'speaker_6': 'I also wanted to thank all my staff members Doug Vardon, Ellen Anderson, Nick Jones, Sasha Summer Adams and Koski, Jonathan Rosenblum, all of whom who worked on both the EMT resolution and the shoebox ordinance. We weren't expecting all of it to come all at once, but in a way, it has been a beautiful confluence because the shoebox'",
        "'speaker_6': 'struggle has supported the Mdhhs and the Mdhhs have supported the shoebox. And as you yourself said, it's connected.'",
        "'speaker_7': 'I also I.'",
        "'speaker_6': 'Also wanted to thank Joel Sanchez, who's standing there in the back, who's who's a Ph.D. doctoral student, you know, physics doctoral student at U Dub. And I first met him when his union was on strike for a fair contract a few months ago.'",
        "'speaker_6': 'But he's also happens to be a musician. So he's been on the forefront of the, I should say, the show back struggle as well. And and it really shows that a lot of these issues are connected in our heads and also in reality.'",
        "'speaker_6': 'You know, nearly 50 years ago, it was a community uproar and community organizing that saved the Pike Place Market. The shoebox is our struggle of our times. So it's really exciting that we will be able to take this first step and then move on to the next one.'",
        "'speaker_6': 'But also, let's remember, one is we need to come back to organizing. So, you know, please stay in touch with us. Make sure you're signed up on the sign up sheet that my staff have handed out, because we want to make sure we have an organizing meeting in September.'",
        "'speaker_6': 'But also, let's not stop. There are a lot of people who actually who are affordable housing activists and didn't didn't weren't immediately in tune with what was happening with the shoebox. Have said perceptibly to me that this this this need not just be about the shoebox.'",
        "'speaker_6': 'We could but we we we will succeed in saving the shoebox. We need to get organized for that further. But but what they said was, interestingly, was that this could be the catalyst for future struggle to build affordable housing.'",
        "'speaker_6': 'So how awesome would it be if you all became part of the people's budget movement for this year that we will be launching and maybe we can win the Amazon tax that was repealed. Maybe we can win a tax on big business to build affordable housing.'",
        "'speaker_6': 'Why should we stop at just saving the shoebox? We need affordable.'",
        "'speaker_7': 'Housing as well. You are.'",
        "'speaker_6': 'And after this vote, let's keep fighting. Yeah.'",
        "'speaker_1': 'Okay. Okay. Let's vote. Please call the roll on the passage of the amended bill.'",
        "'speaker_0': 'Whereas I macheda i. O'Brien. All right, so on. Make sure Gonzalez Herbold i President Harrell high ed in favor and unopposed.'",
        "'speaker_1': 'Bill passed Cheryl Senate.'",
        "'speaker_7': 'And. They? So.'",
        "'speaker_1': 'If you could hear me, Madam Clerk, please call Mother. Please read an agenda. Item number four.'",
        "'speaker_3': 'Agenda item 41193 ten Williams The City of Sails Volunteer Deferred Compensation Plan. The committee recommends the bill pass.'",
        "'speaker_5': 'A very quick go.'",
        "'speaker_0': 'Forward.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_7': 'Transition to. Oh.'",
        "'speaker_2': 'Can take a minute to go down and look. Okay. I'm a little bit what we want to say. I just want to say. I think it's. Okay. As you exit, please.'",
        "'speaker_1': 'Order restored. So go ahead and read the next gen item. Sure. Ciao. Thank you.'"
    ],
    "AN ORDINANCE relating to The City of Seattles Voluntary Deferred Compensation Plan; amending Section 2.5 of the Deferred Compensation Plan to clarify existing immunity from liability for offering certain investment options.": [
        "'speaker_3': 'Agenda item four Council Vote 1193 ten Relating to the City Seattle's Volunteer Deferred Compensation Plan amending Section 2.5 of the Deferred Compensation Plan to clarify existing immunity from liability for offering certain investment options. The committee recommends the bill passed.'",
        "'speaker_0': 'Good. Thank you. Colleagues, this is one of the simplest ones we're going to have in front of us today. This ordinance amends something that's already in our law, but it will, by adding a phrase from the selection of the investment options offered under the plan, provide a level of immunity from liability right here.'",
        "'speaker_7': 'Oh, my gosh.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_4': 'Colleagues, they're going to do some work there. Some work.'",
        "'speaker_0': 'Here. I'm sure everybody heard that. So I'm going to move forward.'",
        "'speaker_1': 'We just heard that this is an easy part. I think. Can we please report that? Rebecca Sharp. All right.'",
        "'speaker_0': 'Absolutely. This council will 119310 would provide a level of protection for members of our 457, which is our voluntary savings portion and investment options for city employees. This is consistent with what other cities have done. It just provides a level of immunity for the board members.'",
        "'speaker_0': 'And it should they select socially responsible funds into which people can choose to invest. So that's what this does. And I recommend that we move forward with its adoption.'",
        "'speaker_1': 'Very good. Thank you very much. Any other questions or comments on this bill? If not, please call the rule on the passage of the bill.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Whereas she said, I.'",
        "'speaker_0': 'I'm sorry. Sorry. Let's get to I. O'Brien.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Sergeant. BEGALA Hi. Gonzales Hi. Herbold. President Harrell. Seven in favor.'",
        "'speaker_1': 'Nine opposed the bill passed in show Senate. Please read agenda item number five.'",
        "'speaker_3': 'Agenda item five Council vote 1193 12. Really into the city employment adopting 2018 City Requisition List Committee recommends the bill pass.'"
    ],
    "AN ORDINANCE relating to the Technology Matching Fund Program; making allocations and authorizing implementation of certain Technology Matching Fund projects in 2018; providing that 2018 appropriations for the Technology Matching Fund from the Cable TV Franchise Fund and from the Information Technology Fund shall automatically carry forward into the 2019 fiscal year; allowing that any unspent funds from an individual project may be applied to another project that meets the goals of the Digital Equity Initiative; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Bill passed chair of the Senate. Please read the next agenda item.'",
        "'speaker_3': 'Part of the Governance, Equity and Technology Committee. Jan Item seven Council Bill 119 328 Relating to the Technology and Matching Fund, the committee recommends the bill pass.'",
        "'speaker_1': 'Thank you very much. So this year, the Technology Matching Fund celebrates 21 years of supporting digital equity in Seattle. Our goal is very clear as a city, to invest in communities that may not have access to technology, may now have access to some of the goods and services associate with technology.'",
        "'speaker_1': 'And since 1997, we've actually awarded 4.6 million to over 300 projects. So this particular legislation for this year awards approximately $400,000 of city funding to 12 new projects throughout the city. There are over 8000 residents, over 4600 immigrants and refugees, over 1000 youth, and approximately a thousand seniors and 1000 people with disabilities.'",
        "'speaker_1': 'And so I'll just describe a few of the projects. I may omit one or two, but just to give you a flavor for the kinds of investments we are making, but most importantly, the kind of investments that the community themselves are bringing as matching funds.'",
        "'speaker_1': 'So in District one is literary source. They actually in five, two and one, and they're going to expand basic digital literacy classes to serve more than to serve more adults with low literacy or low levels of English proficiency.'",
        "'speaker_1': 'Also, there's the Somali Family Task Safety Task Force, which will expand their current digital literacy program in Newhall to offer training for East African women living in West Seattle. So here we have sort of a cross city kind of expansion that works out very well.'",
        "'speaker_1': 'In District two, you have community passageways, which is established as a computer lab and Rainier Beach. You also have the East African Community Services Organization that will expand STEM and a STEM enrichment program to engage in Empower for the East African Young Ladies.'",
        "'speaker_1': 'Helping Link is also an organization. They're going to upgrade their aging computer lab lab in Little Saigon and they'll serve the Vietnamese community. And seed Southeast Effective Southeast Affective Development will implement a computer center at the Dakota Family Apartments for approximately 500 low income seniors and children.'",
        "'speaker_1': 'Again, Youth Care in District four will replace end of life hardware and install additional equipment at their youth cares. Five residential sites prevail in District five will establish an assisted assistive technology lab, especially designed to meet the needs of children and youth with disabilities in the age of 21.'",
        "'speaker_1': 'And again, I'll just mention one more where they give their civil organization to Millionaire Club charity. They'll expand an updated, heavily used computer lab. And I want to mention one other one in District seven, which is an update of the technology infrastructure from the the United Indians of All Tribes Foundation.'",
        "'speaker_1': 'And this will be at the center to improve Internet access and delivery, the delivery of a series of digital literacy programs. So again, there many other organizations, but just to name a few. But we're very proud to present this to the Council for your consideration.'",
        "'speaker_1': 'Any questions or comments on this particular legislation? If not, please call the role on the passage of the bill.'",
        "'speaker_0': 'Whereas I. Mosquera i. O'Brien Sergeant Bagshaw. Gonzalez Herbold. II President Harrell High seven in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passed and chair of the Senate. Please read the part of the Sustainability and Transportation Committee.'"
    ],
    "AN ORDINANCE vacating a subterranean portion of East Howe Street between Eastlake Avenue East and Fairview Avenue East, on the petition of Bender Development, LP, and Bender Equities, Inc. (Clerk File 313430).": [
        "'speaker_3': 'Agenda item nine Council Bill 119 326. Vacating subterranean portion of East House Street between East Lake Avenue East and Fairway Avenue East on the petition of Bender Development LP and Bender Equity Inc, can we recommend Civil Path?'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_2': 'This is a project that we discussed a number of years ago, and I'll remind folks for this agenda item in the next one, for three vacations, we go through an extensive process granting conceptual permission for folks to build a project and requiring them to meet public benefits and in order for public right away to be vacated.'",
        "'speaker_2': 'We did that process a few years ago on this project. They built a parking structure that spanned two buildings underneath what was a right away, and they've met all their public benefit requirements. And so at this point, we come back, we inspect to make sure they did what they're supposed to do and we can proceed with their'",
        "'speaker_2': 'actual vacation and transform the property. And that's what this bill does.'",
        "'speaker_1': 'Thank you. Any comments? Please go to the role on the passage of the bill.'",
        "'speaker_0': 'Whereas I must get to I O'Brien.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'Sergeant Bagshaw, Gonzalez Herbold by President Harrell High seven in favor and unopposed.'",
        "'speaker_1': 'The bill passed and chair of the Senate. Please read the next agenda item.'",
        "'speaker_3': 'Each an item ten cancel 119 327 Taking the alien block 22 Brooklyn edition additional decent adjacent to right of way and the alien block 23 Blocking addition on the petition of the University of Washington, the committee recommends the bill pass.'"
    ],
    "A RESOLUTION related to the Move Seattle Levy; establishing principles for developing a revised workplan for Move Seattle Levy projects to ensure transparency, accountability, and thoughtful community outreach.": [
        "'speaker_3': 'Agenda item 11 Resolution 318 30 Building to the Move Seattle Levy Establishing Principles for developing a revised work plan for MOVE Seattle Levee Projects to ensure transparency, accountability and thoughtful community outreach, the committee recommends the resolution be adopted as amended.'",
        "'speaker_1': 'Councilmember O'Brien, you may introduce I'm aware there may be an amendment to this, so I'll turn the floor to Councilmember O'Brien to introduce it.'",
        "'speaker_2': 'Sounds great. So as folks are aware, the a couple of things have changed since the vote passed the move Seattle levee. One is we have a new federal administration and as a result, we are concerned about not being able to get the same type of federal matching grants for transit projects that we originally had hoped for when'",
        "'speaker_2': 'we passed it. We've also seen a lot of construction in this town driving up price for construction, and so the costs of some projects have increased. This is a cause. Seattle Department of Transportation need to step back and do a deep evaluation of the levee projects that were proposed in the nine year levee when voters passed it'",
        "'speaker_2': 'and evaluate if they had if they need to make any changes that add to meet the current budget. But this resolution does is it establishes some principles for the department transportation. As they evaluate those changes and the requests following those principles, they come back to us by a committee meeting in early December with what any recommendation, any'",
        "'speaker_2': 'recommended changes they want to make to that plan. So we have a chance to review that and see how it goes forward. We had good discussion in committee, made a few changes to this legislation, but ready to move forward.'",
        "'speaker_2': 'And Councilmember Herbold discussed a change that would help coordinate with Seattle Public Utilities. The amendment wasn't ripe in committee, but it is. Right now. So I'll turn it over to Councilman Herbold. Thank you.'",
        "'speaker_4': 'So much. To get us started, I move to amend Resolution 31, 83 zero by adding a new subsection one H, a new Section three and Re numbering the section numbers accordingly as presented in the distributed amendment.'",
        "'speaker_2': 'Second.'",
        "'speaker_4': 'Thank you. So this amendment asks escort to coordinate with SPU to take into consideration the impact on SPU projects and ask for an initial assessment by December 1st and a final report no longer, no later than March 1st, 2019.'",
        "'speaker_4': 'This is because one of the questions that was asked during briefings this morning is why? Why focus on SPU? What about the other departments? Well, we learned through the strategic business plan discussions earlier this year that that these.'",
        "'speaker_0': 'Projects.'",
        "'speaker_4': 'That are associated with the levy are a significant cost driver of rate increases. And largely, it's because these kinds of projects, because they're underground, they are very expensive. And so there's 150.'",
        "'speaker_0': 'Million in must do projects associated with SPU.'",
        "'speaker_4': 'Related to levee projects and another 49 million in what they call opportunity projects. It just makes sense to do them while the streets are open to do the Levy project. And so it's I think it's really important for this.'",
        "'speaker_0': 'Council to have a more.'",
        "'speaker_4': 'Clear understanding not only how.'",
        "'speaker_0': 'SPU projects will be affected by the new prioritization of of MOVE Levy projects.'",
        "'speaker_4': 'But also how those changes might affect SPU customer rates.'",
        "'speaker_1': 'Very good. We're going to vote on just the amendment. Any other comments about the amendment pertaining to the SVU piece? Okay. So we're going to vote on the amendment first. All those in favor of the amendment, please vote.'",
        "'speaker_1': 'I oppose. The ayes have it. So, Councilman Brandies, you want to say anything on the amendment based legislation? Any other closing remarks on the legislation and the resolution?'",
        "'speaker_2': 'I'm sorry.'",
        "'speaker_1': 'That's former skater.'",
        "'speaker_5': 'I know everybody wants to get out of here. I just want to say thanks to Councilmember O'Brien for his leadership on this. I'm hoping that as we reset the Seattle or move Seattle investments, that we are going to be able to do so in a way that truly prioritizes improving safety and flow for all users, but particularly'",
        "'speaker_5': 'in light of the conversations that you have helped to lead in the last few months here, that we are specifically focused on pedestrians, cyclists and transit riders, and that we evaluate where projects may have been put on hold like the streetcar, how we can make sure that we're expediting opportunities to get people moving throughout the city.'",
        "'speaker_5': 'And I look forward to the report back and seeing a path forward to make sure that our invested investments in transit are meeting our values of both environmental protection and transit mobility. So I'm looking forward to working with you on that.'",
        "'speaker_5': 'I thought of a few amendments at the last minute where I, I think that those would better be reserved for another day. So I'd love to work with you on those. And, Mr. President, I wasn't going to do this earlier, but I'm gonna do it now.'",
        "'speaker_5': 'I just want to say thank you to all of our staff. It's been an intense week as we all worked on various resolutions and prepared for our normal council activities. So I just want to take a quick moment to say thank you to my staff, especially Michael Maddox and Sage, who worked on the EMT and shoebox issues'",
        "'speaker_5': '. And also to Patricia Lee, who I didn't get a chance to thank earlier from central staff who worked on the EMT resolution specifically. It's been a long week and we're closing it up so I won't take any more time, but to say thank you to the good sponsor of this legislation.'",
        "'speaker_1': 'Thanks for mentioning those great folks. We appreciate.'",
        "'speaker_2': 'That. And it's been a long week and it's only 430 on Monday. So.'",
        "'speaker_1': 'Yes. Councilmember Gonzalez, thank you.'",
        "'speaker_4': 'I just wanted to ask a question on this, since I didn't have the benefit of attending the Sustainability and Transportation Committee where this resolution was discussed. And I had just a sidebar conversation with Councilmember Herbold about the implications on the budget, which were about budget process, which we're about to undergo, and how the resolution interplays with any'",
        "'speaker_4': 'decisions that we may be considering during the budget related to transportation investments via the Muse Move. Seattle Levy And perhaps you can just highlight that for us before we we called us for a vote.'",
        "'speaker_2': 'So there's a lot of things moving here and I'll I'll take a just a couple minutes to walk through some the various parts. So there's a levy oversight committee that's been in place since the levy was passed and since the department announced that they were going to be evaluating all the different pieces of this levy, that Levy'",
        "'speaker_2': 'Oversight Committee has met, I think, a couple of times a month, and I'm part of that to go through a bunch of the programs. I think there are I can remember about 30 different programs that are part of the levy.'",
        "'speaker_2': '22 of those my number is not quite right, but about most of them are on track even when we've done some high level analysis to kind of meet the objectives. But their aid programs, they wanted to take a deeper dove out.'",
        "'speaker_2': 'And so they've gone with the oversight committee into a deep dove on all of those. Now, the Oversight Committee includes members of the pedestrian advisory board, the Bicycle Advisory Board and the Transit Advisory Board. And those advisory boards all went into deep dives on pieces of the levy.'",
        "'speaker_2': 'Look at their programs. The Levy Oversight Committee is having another meeting at the end of the next week or the following week where they will make a final set of kind of recommendations in a letter that we will be receiving from them in addition to this resolution.'",
        "'speaker_2': 'And then the motor boards will all receive in September, my committee will receive on behalf of the Motor Board's updated implementation plans for the Transit Master Plan, the bike master plan and the pedestrian master plan in September. And those are the five year implementation plans that we entered.'",
        "'speaker_2': 'We redo every single year to add an additional year at the end, but also show what are the priorities. And those plans will be very integrated with the investments in Seattle and other city investments in the transportation projects that are moving forward.'",
        "'speaker_2': 'This this resolution was largely designed just to lay out a framework as they're working through this. And to be clear, a lot of this work has already been done on how we want the department to make its final evaluation and select how they're going to prioritize which set of projects.'",
        "'speaker_2': 'There are some places where they've been able to figure out creative ways that we can still build, you know, the sidewalk blocks that we had proposed. We're going to kind of change some of maybe some of the sequencing of it, but we can still meet it.'",
        "'speaker_2': 'There's some places specifically around transit where they're probably going to say, we can't do the full. The scope of everything we wanted to do. But here's how we're going to. Here's what we think we can do in the sequencing of it.'",
        "'speaker_2': 'And this resolution is intended to say, look, when you when you look at, for instance, transit, we really want to prioritize speed and reliability of transit operations as you're making those investments. So keep that in mind as you set your priorities.'",
        "'speaker_2': 'But there will be future opportunities, including the implementation plan updates, which will come to us about a month from now. And then we'll come back with a final set of recommendations that will be driven by budget. Of course, that will be post-budget in December to talk about that, too.'",
        "'speaker_4': 'I appreciate that additional detail. As we head into the budget season, I just am reminded that oftentimes we receive many notes of advocacy and advocating from members of the community, particularly those who are very interested in seeing the fall in robust implementation of the city's commitment to Vision Zero.'",
        "'speaker_4': 'And I just want to make sure that we are taking into consideration the realities in trying to figure out how to thread the needle in this area with the move Seattle Levy that that in some instances is the appropriate revenue source for the things that folks are asking us to support in the budget process and the move'",
        "'speaker_4': 'Seattle Lovely Levy is one of the few dedicated revenue streams of revenue that we have to be able to meet some of the transportation issues that I think a lot of us hear from our constituents. So I would appreciate continuing to have an opportunity to engage, to sort of figure out how we're going to piece all that'",
        "'speaker_4': 'together as we head into the budget. Thank you.'",
        "'speaker_1': 'Very good. Okay. Any further comments? If not those in favor of adopting the resolution as amended, please vote i. I. Those oppose vote no. The motion carries and the resolution is adopted. Cheryl, sign it. Is there any further business giving for the council?'",
        "'speaker_4': 'Yeah, there is. Agenda item 12.'"
    ],
    "A RESOLUTION denouncing the enormous backlog of citizenship applications before U.S. Citizenship and Immigration Services that is currently preventing over 18,000 immigrants in Seattle from becoming U.S. citizens and voters; and affirming The City of Seattles recognition of immigrants as New Americans who: are an integral part of Seattles communities; supports them as they integrate into Seattle and the nation; upholds their right and opportunity to receive fair and equal treatment in their journey to obtain legal status, including citizenship, under the U.S. Constitution, statutes, and regulations.": [
        "'speaker_1': 'Item 12. Oh my. There is. Am I brothers? Please read agenda item number 12.'",
        "'speaker_3': 'Adoption of other resolutions and item 12 Resolution 318 32. Denouncing the enormous backlog of citizen applications before U.S. Citizenship and Immigration Services. That's currently preventing over 18,000 immigrants in Seattle from becoming U.S. citizens and voters in affirming the city's recognition of immigrants as new Americans who are an integral part of states.'",
        "'speaker_3': 'Communities support them as they integrate into Seattle and the nation, uphold their rights and the opportunity to receive fair and equitable treatment in their journey to obtain legal status, including citizenship under the U.S. Constitution, statutes and regulations.'",
        "'speaker_1': 'I apologize for that. Councilman Gonzales, you had the floor.'",
        "'speaker_4': 'That's okay. It's been a busy day and it's 4:40 p.m., so I understand. I will try to keep my remarks brief. I'm really excited about advancing this resolution. There are many immigrant rights advocates and service providers that have identified a disturbing trend since January of 2016 that has resulted in a significant backlog of applications for naturalization at'",
        "'speaker_4': 'USCIS. Specifically, since President Trump has taken office, the backlog of naturalization applications has increased by over 93% for a total of 753,352 backlogged applications across the country for two years in a row. USCIS has failed to naturalize more legal, permanent residents than they have actually naturalized.'",
        "'speaker_4': 'Here in Seattle, we are seeing this backlog impacted by the fact that there are nearly 19,000 local immigrants with pending applications awaiting a decision by USCIS just right here in Seattle alone. This is what we referred to as the second wall.'",
        "'speaker_4': 'And the intent of this backlog is clear. It targets our immigrant communities by preventing legal, permanent residents from becoming citizens with all the benefits and the sense that that permanence holds. Attaining citizenship is a transformative experience for immigrants, something my family knows firsthand, having gone through that process.'",
        "'speaker_4': 'My my mom went through that process several years ago. And I think it's important for us to continue to support immigrants who have a legal right to become naturalized citizens, to be able to do so as quickly as possible.'",
        "'speaker_4': 'USCIS is serving the political agenda of the federal administration rather than serving the people is harmful for individuals, families and the community that surrounds those individuals. The City of Seattle has long valued our immigrant residents and support naturalization efforts.'",
        "'speaker_4': 'We've dedicated resources to launch the New Citizen campaign in 2016. That work is led by our Office of Immigrant and Refugee Affairs. The New Citizen campaign supports both small and large, and mega workshops, facilitate partnerships with credit unions to help individuals manage the costs of applications, and has brought vital partners to this work from the private and'",
        "'speaker_4': 'public sector together. I want to thank some of the advocates that showed up today. They have stormed the length of this council meeting and are still in the audience of folks from One America in the Romanos and the West African Community Council have been so gracious to make sure that they're here to support this resolution and to'",
        "'speaker_4': 'take it back into community, to make sure that community members know that we stand with them and want to see and will continue to advocate for action at USCIS to meaningfully address the backlog issue. And I know that one America in particular signed on to a letter of national organizations last week demanding that the federal administration provide'",
        "'speaker_4': 'answers as to why the backlog exists and what will be done to create meaningful improvement in and reduction of that bag backlog. It's an incredibly important piece of advocacy for us to do and will be talking to our federal lobbyists to see how the City of Seattle can engage in conversations with our delegation and other members of'",
        "'speaker_4': 'Congress to continue to advocate for addressing this significant backlog. That has a real impact in terms of the work many of our advocacy organizations are doing to naturalize people and also the work that the city of Seattle itself is doing to naturalize folks.'",
        "'speaker_4': 'It's one thing to support the completion and the financing of these naturalization applications, but we end up damaging the credibility we have with the community. If, after all of that effort, that application sits on a shelf collecting dust because there isn't a judge or an administrative judge to just process the application.'",
        "'speaker_4': 'So this is a really important component of not just defending our immigrant refugee community, but advocating and making sure that we are advancing the immigrant and refugee community to to a legal right that they are entitled to and that they should be provided due process in in giving.'",
        "'speaker_4': 'So I'm excited that we are taking this position, that we are recognizing this, that we are joining a national movement around this issue and. And we'll be looking forward to working with my colleagues and other community based organizations in partnership to continue advocacy around here.'",
        "'speaker_4': 'Lastly, I just like to thank Joaquin we from the Office of Immigrant and Refugee Affairs for his leadership on this issue and helping us draft this resolution, along with being one in my office for helping to also shape the resolution and seeing it through fruition.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Very good, Councilman Gonzales. Any comments on the resolution? Okay. Those in favor of adopting the resolution please vote. I, i. Those oppose vote no. The motion carries a resolution is adopt and show. Sign it. Can now is there any further business cover for the council to?'",
        "'speaker_4': 'Thank you guys for sticking it out? I do.'",
        "'speaker_1': 'Councilmember Gonzalez.'",
        "'speaker_4': 'I know you guys have heard from me a lot today. I'm sorry about that. I need to be excused. I moved to be excused on September 4th.'",
        "'speaker_0': 'Oh, yeah.'",
        "'speaker_1': 'Two moved in second with the concern over.'",
        "'speaker_4': 'Wait a minute. Nope. Yep. Fourth, that's Tuesday.'",
        "'speaker_1': 'Councilmember Gonzalez be excused on September 4th. All those in favor say I. I opposed. The ayes have it unopposed. I'm okay. Okay. Councilmember Sharma. So on.'",
        "'speaker_0': 'Why did you execute? She said I did not.'",
        "'speaker_6': 'I didn't know. Just to clarify, I did not oppose the absence I raised my hand to.'",
        "'speaker_0': 'Soon she did.'",
        "'speaker_6': 'I also move to be excused from city council meeting on September 4th.'",
        "'speaker_1': 'Like I second it's been moving since September 4th has been moved in second to excuse consumers want on September 4th. Are those in favor say I. I opposed the ayes have it because my mosquito.'",
        "'speaker_5': 'Mr. President, I would like to move to be excused on September 4th. That's okay.'",
        "'speaker_1': 'We're keeping track. Second. Yes, but what? You guys worked out a deal before that.'",
        "'speaker_4': 'Word is dwindling?'",
        "'speaker_1': 'Yeah, it's. Let's not worry about that. I have to. That's my job to do that. So it's been moved in second and that counts. We're I'm a scared to be excused on September 4th. All those in favor say I.'",
        "'speaker_1': 'I oppose the ayes have it. Is there any other business come for the council? Okay. And we'll go over the scores as we always do it. Okay? Okay. With that, everyone, have a great afternoon. Afternoon will be on recess until September 4th.'",
        "'speaker_1': 'Have a great day, stranger.'"
    ]
}