{
    "AN ORDINANCE relating to the Seattle Transportation Benefit District; authorizing material scope changes to Seattle Transportation Benefit District Proposition 1; authorizing the Director of the Seattle Department of Transportation to execute an interlocal agreement with Seattle Public Schools to provide transit passes to Seattle Public Schools students; changing appropriations to the Seattle Department of Transportation to fund the ORCA Opportunity Program; and amending Ordinance 125493, which amended the 2018 Budget (Ordinance 125475); all by a 3/4 vote of the City Council.": [
        "'speaker_2': 'The report of the City Council Agenda Item one Council 4119 256 relating to the Transportation Benefit District authorizing material scope changes to the sale transportation benefit district Proposition one. The committee recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember O'Brien.'",
        "'speaker_6': 'Thank you. This was discussed in the committee a few weeks ago. It came to full council two weeks ago today, and we put a hold on that because of some concerns we heard between the committee meeting and the full council.'",
        "'speaker_6': 'I'm going to give you an overview of what the legislation does at the base level, and then we'll move forward with an amendment to make some changes. The base legislation essentially goes and make some adjustments to the Seattle Transportation Benefit District Initiative that was passed by citizens a few years ago.'",
        "'speaker_6': 'There are four areas where the changes are being made to allow greater flexibility to invest those dollars into transit outcomes that folks are hoping to see. The first would allow up to $7 million a year to be invested in or capacities for students in Seattle public schools.'",
        "'speaker_6': 'We currently do this for low income students, but the proposal would allow more flexibility to a broader range of students. And the mayor has proposed making sure that all high school students have access to our campuses, regardless of how far they live from school and also in the summer.'",
        "'speaker_6': 'And this legislation would allow that flexibility. Another change is where we can invest in buying additional service hours. The original legislation said service hour, additional service. Our investments can be made on routes as long as 80% of the stops on that route were within the city of Seattle.'",
        "'speaker_6': 'The ordinance before us today would adjust that to allow routes that have 65% of the stops to the city of Seattle. There are a couple high, high volume routes that are could benefit from some investments but are not currently allowed to have those investments because slightly more than the criteria, number of routes are happening just outside the'",
        "'speaker_6': 'city's borders. So that adjustment would allow greater flexibility. This would also the change would also allow us to make investments and capital improvements. We heard a little bit about that in public comment today. The city has made some great investments in capital improvements in particular.'",
        "'speaker_6': 'What I'm familiar with is along the 44, where some modest capital improvements on curb bulbs for in-line stops, queuing lines and huge jumps in the traffic signals allow busses to operate more efficiently in the corridor and has the same effect as buying more service hours because busses can complete their routes in shorter time and make more trips'",
        "'speaker_6': 'with the same busses and riders. Busses and operators, I should say. The final change is in the current legislation, which we're going to propose to remove, would have allowed flexibility for Metro for the city to contract with private operators as a pilot project during the periods of maximum constraint, which is a series of construction projects and other'",
        "'speaker_6': 'events happening in the next couple of years where we're expecting significant congestion downtown. So that is what the underlying legislation would do, and I'm happy to take questions on that. But first, I'd like to go ahead and move our amendment and maybe I'll ask it Councilmember Skate, if you want to move that, and then I'll second it'",
        "'speaker_2': '. Thank you, Mr. Chair. I'd like to move Amendment One to Council Bill 119256, which strikes subsection C from section two and deletes section four.'",
        "'speaker_6': 'Second.'",
        "'speaker_1': 'I would describe that as Amendment one. So would you like to comment on Amendment One before we vote on the amendment only?'",
        "'speaker_2': 'Yeah. Okay. Thank you, Mr. President. And thanks again to the good chair for his work to work on this amendment with me. I think that what you see in this amendment is a recognition that while we understand that there are limitations that are currently presenting itself to King County Metro, the answer is not a pilot program without'",
        "'speaker_2': 'consultation and work with workers and the community at large. The answer instead is, I think, as we heard today, greater investments in infrastructure and investments making sure that we have transit only lanes, that we look at the limitations around what we understand to be spaces for parking busses and work collaboratively to address some of those issues.'",
        "'speaker_2': 'And what you see in front of us is a recognition that the heart of this legislation, as it came down from the mayor's office, as I read it initially, was really around the worker card. This concept around a pilot program appears to have been included without the due diligence to have conversations with the folks who are doing'",
        "'speaker_2': 'the work, the drivers here, the community at large, and the labor community at large. So what you see in front of us is an effort to really try to pull that piece out with the recognition that we need to have longer conversations with the executive, with King County Metro, with the drivers, with community, with the labor movement'",
        "'speaker_2': ', to make sure that we're actually looking at how to meet our goals of moving individuals, commuters, families, students, and do so in a way that's inclusive. And I think I'll save some of my other comments for later on.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_1': 'Thank you very much. Any other comments? Just on the amendment. Amendment one. Customers want.'",
        "'speaker_5': 'Thank you, President Herrell. I support this amendment. While it is true that the privatization that the mayor proposed would represent a small section of our public bus service. Opening the door to privatization would be a major mistake. It could give private companies an opening a foot in the door to undercut our public transportation system, replacing living wage'",
        "'speaker_5': 'union jobs with low paid, precarious labor, and setting prices not to maximize public usefulness, but instead to maximize private profits. Those things would not happen immediately, but that is the direction inevitably that privatization points towards. In Chicago, corrupt Democratic Mayor Rahm Emanuel is pushing a private mass transit system to be built by billionaire Elon Musk.'",
        "'speaker_5': 'And with revenues, decisions and benefits going to that private corporation and privatization does not necessarily stop there in the neocolonial world. As in my home country, India, in the wave of neo liberalism that has marked the last several decades, all of the most profitable and beneficial sections of the state sector have been sold off to private corporations'",
        "'speaker_5': 'to profit from the workers there and from the deeply impoverished communities in the surrounding areas. And as a matter of fact, decades of research from the U.S. itself shows that privatization of public services, whether it is transit or electricity or garbage pickup, ends up costing municipal governments far more than public entities do, while destroying union jobs and'",
        "'speaker_5': 'workplace rights for workers. I would recommend a really, really good book written in 1997, way back in 1997 by an economist from the Economic Policy Institute called Elliott Carr. And the book is The Privatization of Public Service, in which he shows statistically how every study shows that privatization of public services is actually bad for the public.'",
        "'speaker_5': 'I wanted to thank Linda Errol, who is a bus driver and a member of Edu, and Jeremy Muni, the ADA co-chair, who volunteered their time to bring attention to this threat of privatization and to all the edu A.I. speakers who spoke today to stop this before it went further.'",
        "'speaker_5': 'So let's vote yes on this.'",
        "'speaker_1': 'Thank you, Councilmember Swan. So we're just going to vote on the amendment first. If I hear the comments. So all those in favor of amendment number one as described by Councilmember Mosquito, please vote i. I opposed. The ayes have it.'",
        "'speaker_1': 'And now we have the base. Legislation comes from Brown. We'd like to see some more remarks.'",
        "'speaker_6': 'I'll just add my gratitude for the folks who showed up today at a council meeting two weeks ago. I really appreciate all the operators. I really appreciate all the work you do day in, day out to make sure hundreds of thousands of people get around our city safely.'",
        "'speaker_6': 'And I also appreciate one out for my appreciation for the fact that as the city grows, we're relying more and more on your services and the transit agencies to move people around. And I know that I'm hearing from folks throughout my communities that they want to see more bus services soon as possible.'",
        "'speaker_6': 'And I know that that's a constraint on you all. And so thank you for working through this rapid growth in your industry and continuing to serve the people of our communities. I also want to thank the transit advocates who showed up and been engaged in this from the beginning.'",
        "'speaker_6': 'Thanks for your continued oversight and advice on this. I'm really excited about providing some flexibility here, and I'm also proud to be co-sponsoring the amendment to not move forward on the piling projects at this time and move forward on the other issues that I think will have an immediate benefit.'",
        "'speaker_1': 'That's a very good skater.'",
        "'speaker_2': 'Thank you, Mr. President. I am pleased to support this bill as amended. I think it's important that we do expand access to worker cards. I know that many of our council members have been working on this for a while, and I think that our amendment to the mayor's proposal makes this an actually fiscally sound policy as well'",
        "'speaker_2': '. We don't want to be privatizing or giving the impression that we're moving forward on pilots without full and robust discussions with workers, with the community at large. And I think we all recognize that our current busses are at capacity.'",
        "'speaker_2': 'I'm sure many of the drivers that are here know on a daily basis that we need more services. And the way to do that is, I think, is exactly as one of the drivers expressed, creating transit only lanes, investing in buying busses, creating that parking space for busses to actually be housed, and investing in drivers.'",
        "'speaker_2': 'And when we do so that invest in the health and safety of our community, then invest in the health and safety of the drivers. That allows for more individuals to be able to get a good living wage job in this industry.'",
        "'speaker_2': 'I'm also really interested in working with the community at large and the folks who are here today about how we make sure that the last mile is successful going forward. We want to make sure that people are getting to these rapid transit lines, that we're increasing access for people to be able to take the light rail or'",
        "'speaker_2': 'bus to work, and that we're creating opportunities for folks to really get out of their cars to meet our environmental goals that this city has established. I also think that it's important that we match these goals with our overall city's vision zero goals, which to date have, I think, in my opinion, taken a back seat.'",
        "'speaker_2': 'We know that individuals continue to be injured while walking or riding bikes, and we want more people to take the bus and get out of their cars. We need to look at this holistically and think about ways that we get people into busses and out of their cars.'",
        "'speaker_2': 'So as we move forward, I will be looking forward to working with the good chair and the Council as a whole on investments in worker training, safety investments in infrastructure, making sure that we have pedestrians and riders and cyclists in mind as we create our are our mission to complete our vision zero goals.'",
        "'speaker_2': 'And I just want to thank again the folks who flagged this issue for us and the ongoing conversation that's happening in community about how we meet our transit needs while being fiscally smart with the public dollars that we have for our good public servants.'",
        "'speaker_2': 'So thank you so much.'",
        "'speaker_1': 'Thank you. Astronomer Johnson, just.'",
        "'speaker_0': 'Briefly want to speak to an issue that was brought up during public comment. This bill that we're going to pass today, in addition to many of the things that my colleagues outlined, allows for up to $7 million a year to be spent on youth work implementation.'",
        "'speaker_0': 'It's not prescriptive in the way that maybe some of our other legislation that's adopted may have been in the past. This allows the Department of Transportation to then enter into negotiations with King County, Metro, SBC and other folks around the distribution of that additional to up to $7 million annually.'",
        "'speaker_0': 'So during public comment, the Speaker talked about the need for us to make sure that we are getting kids on busses, regardless of whether they're in private schools or in public schools. And we've received some information from Metro that we've shared in my office, with the mayor's office, about some of the different proposals that we could walk'",
        "'speaker_0': 'down if the city wanted to choose to partner with the folks on Metro in a different way than just subsidizing kids in high school. So we have a lot of different avenues that we could go down. This legislation today authorizes the expenditure.'",
        "'speaker_0': 'It doesn't execute the agreement that we're now putting into the mayor's hands to have her and the Department of Transportation then execute those agreements. My hope is that we can really use the up to $7 million a year to really maximize the number of kids that are getting on and off busses, particularly since the number of the'",
        "'speaker_0': 'amount that Metro generates in terms of youth or every year is 10 to $12 million a year. So we'd be making a very significant contribution to Metro in terms of an increase and hoping that that commensurate resource will allow for an increase for kids at all ages of the system.'",
        "'speaker_1': 'Excellent. Okay. Before we vote, I just wanted to thank 85, 85, 87 and the Transit Riders Union and the advocates for just strong and effective advocacy gets things done. Thank you very much for that. Madam Clerk, please call the roll on the passage of the bill.'",
        "'speaker_2': 'Macheda I O'Brien.'",
        "'speaker_0': 'I somewhat.'",
        "'speaker_2': 'Bagshaw Gonzalez Johnson Suarez President Harrell.'",
        "'speaker_0': 'Height.'",
        "'speaker_2': 'Eight in favor an unopposed.'",
        "'speaker_1': 'Bill passed and chair of Senate. Please read the report of the Civil Rights, Utilities, Economic Development and Arts.'",
        "'speaker_4': 'Committee.'",
        "'speaker_2': 'Three part of the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Items two and three appointments 1034 and 1035 re appointments of Nikki Hurley and Joseph Case Centers members Seattle LGBTQ Commission for Term two April 30th, 2020.'"
    ],
    "AN ORDINANCE relating to elections; raising limits of certain items on the statement of financial affairs in conformity with state law; changing deadlines and definitions related to the democracy voucher program to align better with other state and City practices; creating a crime of falsifying democracy voucher program qualification information; making technical corrections to and reorganizing and clarifying the content of the democracy voucher program; and amending Sections 2.04.165 and 2.04.370 and Chapter 2.04, Subchapter VIII of the Seattle Municipal Code.": [
        "'speaker_2': 'Please have you part of the Governance, Equity and Technology Agenda Item five Accountable 119 279 related to elections raising limits of certain items on the statement of Financial Affairs in conformity with state law, changing deadlines and definition of voter democracy voucher program to align better with other state and city practices, the committee recommends the vote passes amended'",
        "'speaker_2': 'pretty good.'",
        "'speaker_1': 'So as described this morning, this legislation modifies and improves, we believe the mailed the democracy voucher program. And so with some context in 2015 you may recall that Seattle voters approved initiative 122 was created the Democracy Voucher Program, and provided a voter approved levy funding for campaigns for City of Seattle elected offices.'",
        "'speaker_1': 'And it was funded by a ten year property tax levy levy of about $3 million per year. And we were in the first municipalities to implement this kind of innovative public campaign finance program. In its first deployment, we emailed as a city democracy vouchers to over 540,000 Seattle residents, and we provided all key program communications in 15'",
        "'speaker_1': 'languages. And as a result, we had about a 300% increase in the number of Seattle residents contributing to actual campaigns. So following review of that program, after it sort of first roll out, the Seattle Ethics and Elections Commission made several recommendations to improve the the program and to clarify the code under Chapter 2.04 of the Seattle Municipal'",
        "'speaker_1': 'Court. And a little about the process. It began with the hiring of a Berke consulting firm, firm to do extensive and extensive independent review of the program as it was deployed and as it was described by the voters.'",
        "'speaker_1': 'And then the Commission received public input at a public hearing on the program that was held in February, the commission staff experienced their experiences in administrators administering the program. They articulated some of their meetings, and on May 15th, 2018, Director Barnett provided the initial brief briefing to the committee, and the legislation was transmitted on the 25th.'",
        "'speaker_1': 'And then on the second meeting on June 19th, it was heard and the committee voted out unanimously. So here's some of the key changes that came from the commission. And then, of course, there were seven improvements slash amendments made by a few of the colleagues on the dais.'",
        "'speaker_1': 'The first changes had come from the commission was replacing the threshold for reporting financial interest to make it consistent with the threshold in place at the state and with the city prior to the passage as more of an administrative categorization of financial interests.'",
        "'speaker_1': 'And they believe that made sense. A second change was requiring that the Commission adjust the contribution limit to the nearest $5 or $10 with language that the Commission adjust the limits to amounts, quote unquote convenient for public understanding, because apparently there was little confusion there.'",
        "'speaker_1': 'There was changes of the date of the mailing vouchers from the first business day of January to the first business day of March per recommendation from Burke Consulting. Again, there are a lot of misplaced vouchers and a lot of as a first time deployment, a lot of mismanagement of the of the vouchers.'",
        "'speaker_1': 'I should just say they were lost. So based on public input and gathered judgment, I believe was the logical thing to do, democracy vouchers would be mailed to all active, registered, registered voters, but no longer mailed to inactive registered voters.'",
        "'speaker_1': 'And I'll address amendment that Councilmember Gonzales proposed on that issue. It reformatted to make it possible to assess a monetary penalty on a candidate who does not participate in three debates as it was previously word. The only option was to disqualify a candidate from the program, and certainly a penalty seemed to make more sense.'",
        "'speaker_1': 'As it turns out, it adds to the list of crimes created by I 22. The crime of falsifying qualification information clarifies that a candidate relief from the maximum campaign evaluation cannot redeem vouchers once they have reached that valuation.'",
        "'speaker_1': 'And this responded to the Commission's concern that the candidates banking vouchers for future elections, the amendments that were proposed and accepted by councilmembers Gonzales must get a clustering czar proposed amendment that would require notification of inactive voters, that they have the opportunity to request democracy vouchers if they continue to reside in Seattle.'",
        "'speaker_1': 'And that certainly made sense, given the fact that there could be mistakes. And we want to make sure every inactive voters has every opportunity to participate in the. Program. Casper Gonzales also amended the clarification that candidates who participated in the program but lose in the primary have until the first workday in September to redeem their vouchers again'",
        "'speaker_1': '. That date made sense based on how this actually plays out. And lastly, there was an amendment by counterexamples that increased the donation requirements and maximum campaign valuation limits for candidates for the city attorney's office. In the currency limits for city attorney candidates were they were equivalent to the district, the district, city council candidates, which was 150 donations'",
        "'speaker_1': 'and ordered to participate with the changes that were accepted. This makes the limits equivalent to the At-Large positions, and the city attorney is an at large office. So certainly that made all the sense. And thank you for accounts from Eric Gonzales for pointing those out and making those amendments.'",
        "'speaker_1': 'Councilmember Mosquito should I just describe your amendments are okay and councilmembers mosquito want to clarify that city employees and organization have contracts with the city that are unrelated to providing goods and services, are not considered contractors when considering whether contribution from a contractor is illegal.'",
        "'speaker_1': 'And we gave some examples as to why that made sense and councilmember mosquitoes. Her second of the four amendments. I should just say that in issue one, when she provided for 425 democracy vouchers to be provided to every participating donor in Seattle.'",
        "'speaker_1': 'And this amendment now would allow the commission to determine the value of the vouchers and retain the maximum amount of funds available to each recipient of a vouchers. Now, that doesn't sound like it makes a lot. I didn't describe it for fairly well, but what we considered was whether it should be five $20 vouchers or some other'",
        "'speaker_1': 'not ten, $10 vouchers. I just sort of said that as a joke at the table, but we looked around and what made sense, given the fact that there are going to be a lot more candidates for a lot more positions.'",
        "'speaker_1': 'And so councilmember skater wanted to address that possibility to make sure we had the flexibility councilmember skate also to allow a candidate in order to qualify of the program to receive contributions of signatures from adults. Shall residents see?'",
        "'speaker_1': 'Currently, the code requires contributions from adult child residents who qualify for the program, but not signatures. And her amendment allows the signatures and contributions to come from different residents. Still, there's a 400 person threshold, and the policy arguments were that some people were.'",
        "'speaker_1': 'It was a little confusing for some folks who were signing, making signatures and some people that were they thought that was part of the process and we want to encourage the signatures. For many people, that that's their participation.'",
        "'speaker_1': 'But we're also requiring that people that actually give the $10 amount that they sign as well. And so all people can participate in the process. I hope I describe that well. And it made a lot of sense, made a lot better sense when it was described at the table as I'm describing it now.'",
        "'speaker_1': 'But I think we get the gist of it. And last, the amendment will allow and this is sort of a really cool when I thought the amendment advanced by comes from state allows the commission to work with the King County elections to explore whether election drop boxes could be used as a place to transmit the vouchers to'",
        "'speaker_1': 'the commission. So a lot of people are filling out their vouchers when they're voting. And so with that, one depository may make sense. And and we had the Julie Wise from the King County elections at our table and she was very receptive to this and they thought that may make a lot of sense.'",
        "'speaker_1': 'So thank you for those fine amendments by councilmembers Gonzales and Mosquito. So that's the base legislation that was unanimously approved out of the committee. Is there any comments or questions or concerns? Casper Mosquito.'",
        "'speaker_2': 'Thank you, Mr. Chair. And I think Councilmember Gonzales and I, having lived the experience of democracy vouchers, want to make this workable and implementable and accessible for all future council colleagues and future candidates, and most importantly, to all the residents in Seattle.'",
        "'speaker_2': 'I think that some of these amendments today help make this a more accessible program, easily more implementable by the FCC, and I think reflects some of the feedback that we've gotten directly from community partners and most notably those who put forward the initiative in the first place.'",
        "'speaker_2': 'I want to acknowledge that many of these ideas were already incorporated into the suggested and based legislation that the FCC pulled together based on conversations that they had with voter justice folks and making sure that it was accessible to communities most historically marginalized from voting, talking to low wage workers, workers who speak English as a second language'",
        "'speaker_2': ', people who've been historically not on the voting rolls and trying to identify ways that we can make democracy vouchers a tool for people to be able to access so that more people are engaged civically in our local democratic process.'",
        "'speaker_2': 'I also want to just very briefly, if I might, Mr. Chair, call the Fourth Amendment that I put out there, the Aretha Basu Amendment, because she was really an advocate coming from communities of color, youth advocates, talking about how we can increase access to civic engagement.'",
        "'speaker_2': 'And it was her idea to put the democracy vouchers into the drop boxes, the ballot drop boxes, when they're open and available. So that comes directly from the youth advocates and communities of color groups who are trying to make voting more accessible thanks to her work and for her idea on that one.'",
        "'speaker_2': 'Very good.'",
        "'speaker_1': 'I thought that was your idea. So. Okay.'",
        "'speaker_2': 'Fix the team.'",
        "'speaker_1': 'It takes a team, actually. Okay. Any further comments? Councilmember Becerra.'",
        "'speaker_0': 'Thank you. And thanks to you both for your work on this councilmember. Miss Kate, I know I.'",
        "'speaker_5': 'Brought something up.'",
        "'speaker_0': 'Which was my concern that if democracy vouchers weren't available until March of the actual election year, that someone who hasn't been running for election before might get left behind because somebody who has been involved knows that the election cycle usually gets started somewhere around Thanksgiving, and then it's a full on effort for the remainder of the next'",
        "'speaker_0': 'year. So I had suggested that we keep the democracy at voucher funding available date in January. You convinced me that so many were lost, that it wasn't it wasn't really reasonable. But I'm wondering how how are we doing this to.'",
        "'speaker_5': 'Reach out to people.'",
        "'speaker_0': 'For an example. Right now people are and I always say, Hello, Polly Grow. Yes, I send people to Polly Grow first. But that people can get signatures now. If they want to run for city council for 2019, they're able to get the signatures now and the $10 contributions.'",
        "'speaker_0': 'So. Two questions. One, how are you getting people engaged and sort of informed about the program? And then secondly, would you explain how this signatures work? Can people now just have signatures without $10? To qualify for vouchers? Is that your idea or how's that working?'",
        "'speaker_2': 'It's okay if I address the police, constable. Thank you. First, I want to thank Councilmember Bagshaw. She had a really she and I had a really good conversation about accessibility to the program and wondering if we should keep the date when democracy vouchers are sent out at January versus March.'",
        "'speaker_2': 'In conversations that I had had with the CDC and community partners, we were trying to identify ways to make sure that more education and outreach could be done with the voting public at large to make sure that all residents knew that the democracy vouchers were coming their way to look out for them to not accidentally recycle them'",
        "'speaker_2': 'or have them get lost in the household. What we found is that when the democracy vouchers were sent out that first week of January, many people were still recovering from the holidays and just getting back into the work mode.'",
        "'speaker_2': 'And many people receive a lot of mail and have a lot of bills at that time. And many of those democracy vouchers were getting put at the bottom of the mail pile or were accidentally getting recycled. We have asked now that the CDC work very diligently in January and in February, so that by the time March rolls'",
        "'speaker_2': 'around and the democracy vouchers are mailed out, every household has a chance to understand that these democracy vouchers are being mailed to them. The importance of receiving $100 in democracy vouchers and the value that that has, especially to first time candidates and nontraditional candidates, especially thinking of nontraditional candidates who are more likely to be women and people'",
        "'speaker_2': 'of color and low wage workers and immigrants. We wanted to make sure that everyone had sort of a level playing field as it takes many of these first time candidates more time to get to yes to say yes to running for office.'",
        "'speaker_2': 'Having those all mailed out at the same time feels like it helps to level that playing field. So we're really going to be working and I hope to get future updates through the Council Presidents Committee from the FCC about their plans for outreach and engagement in January and February, which I think is part of your question how'",
        "'speaker_2': 'are we doing outreach and engagement, especially in various languages, which we know was a a desire of the community and a concern last time around. Translating the materials is one thing, but having ambassadors to go out and have a conversation with communities is another.'",
        "'speaker_2': 'So we'll be looking at that. And then to your last question about the signatures, you, a candidate, will still have to have the required number of signatures and the required number of small dollar contributions. So if you are running in a district, that required contribution is at least $10, at least 150 $10 contributions, and at least 150'",
        "'speaker_2': 'signatures for Councilmember Gonzalez and I it was $410 contributions and 400 signatures. And so you will still have to have those requirements, and one cannot supplant the other. We just wanted to make sure that the the distinction was clear, that it can be an individual who signs and donates or could be somebody who donates or somebody who'",
        "'speaker_2': 'signs. But you still have to meet that signature and dollar contribution requirement.'",
        "'speaker_5': 'So part of the.'",
        "'speaker_0': 'Idea I hear from you is that somebody can sign that's what he or she is able to do. They don't have $10, but they want to show their support to you so they can sign not $10. But that does not count towards 150 with $10 plus that you need.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'Very good. Any further comments or questions?'",
        "'speaker_3': 'I was just going to add in terms of the outreach as well, I know that the Seattle Ethics and Elections has already begun their work to advertise and talk to community about democracy voucher program for those folks who are interested in public financing of their campaigns for the 2019 cycle.'",
        "'speaker_3': 'And my understanding, based on a tweet they just put out timely, timely tweet just literally at the same time that we are having this meeting is that folks who are interested in qualifying for the DeMarco Street voucher program can begin the program and meeting its qualification criteria is beginning July 2nd.'",
        "'speaker_1': 'Very good. And further questions if that, please call the role on the passage of the Bill.'",
        "'speaker_2': 'Moschella I O'Brien I want to thank John Gonzalez Johnson whereas President Harrell.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Eight in favor and unopposed.'"
    ],
    "AN ORDINANCE related to land use and zoning; establishing an incentive program for high performance buildings in urban centers; amending Sections 23.40.060, 23.41.004, 23.41.012, and 23.41.014 to the Seattle Municipal Code (SMC); and adding a new Section 23.40.070 to the SMC.": [
        "'speaker_1': 'Bill passed Chair of Senate Please read the part of the planning land use and Zoning Committee.'",
        "'speaker_2': 'The Report of the Planning, Planning and Zoning Committee Agenda Item six Constable 119 252 Willing to lend you concerning establishing an incentive program for high performance buildings in urban centers? Amending Section 23.40 point zero 6,023.40 1.00. 4.0 12.0 14.'",
        "'speaker_2': 'Set of code needing a new section 23.40 .00 70 of the Civil Code. The committee recommends the bill passes amended.'",
        "'speaker_1': 'Katherine Johnson.'",
        "'speaker_0': 'Thanks. And I try to speed it up here a little bit because I know Councilmember Suarez as a meeting after hours. Ladies, nerds, this is about the living building pilot program and the establishment of a 2030 challenge, high performing existing building pilot program.'",
        "'speaker_0': 'It's a way for us to continue to encourage construction in. A city, both renovation of existing buildings and new buildings to meet a deep green standard. Couple of changes that were made out of committee would make it much more clear for the folks who are building these buildings what penalties they may incur if the buildings don't quite'",
        "'speaker_0': 'meet the standards that we call for on this. And I'm excited to bring this forward. It was unanimously recommended by committee and I encourage your support.'",
        "'speaker_1': 'Thanks very much for the comments. Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Macheda O'Brien. Somewhat beg John Gonzalez.'",
        "'speaker_0': 'Johnson.'",
        "'speaker_2': 'Suarez. President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Eight and favorite unopposed.'",
        "'speaker_1': 'Bill passed and chair of Senate. Please read the report of the Sustainability and Transportation Committee.'"
    ],
    "AN ORDINANCE relating to the Washington State Convention Center facility addition; authorizing the Director of the Seattle Department of Transportation to acquire, accept, and record, on behalf of The City of Seattle, a temporary right of way easement with the Washington State Convention Center, Public Facilities District for the temporary reroute of Olive Way during construction of the new convention center facility; placing the easement under the jurisdiction of the Seattle Department of Transportation; and ratifying and confirming certain prior acts.": [
        "'speaker_2': 'To report its Sustainability and Transportation Committee agenda item seven Council Vote 119 285 Relating to the Washington State Convention Center Facility Edition authorizing the Director of the State Transportation to acquire accepted record on behalf of the City of Seattle.'",
        "'speaker_2': 'Temporary right of way easement with the Washington State Convention Center Committee recommends the bill pass.'",
        "'speaker_1': 'Kassebaum O'Brien.'",
        "'speaker_6': 'Thank you. So this particular piece of legislation relates to the convention center and specifically about the right of way on all of this. Folks may recall when we went through the discussion, the city granted a subterranean street vacation for all of way.'",
        "'speaker_6': 'So the convention center will be building there, expansion underneath all the way, which requires that all the way be torn up for a while and where they build the structure from which will support it. Well, that's torn up.'",
        "'speaker_6': 'There will be a reroute where all of way passes over the property just to the north of currently on all the way. So this action is just to allow that right away easement to happen while they do that construction and the temporary reroute before they move the the vehicles back on to all the way and resume construction'",
        "'speaker_6': 'on other sites.'",
        "'speaker_1': 'Or get any further comments that please call the roll on the passage of the bill.'",
        "'speaker_2': 'Macheda O'Brien. Sergeant Major Gonzalez Johnson Suarez. President Harrell I eight in favor and.'",
        "'speaker_0': 'Unopposed.'"
    ],
    "AN ORDINANCE relating to the Bridge Rehabilitation and Replacement project; authorizing the Director of the Seattle Department of Transportation to acquire, accept, and record, on behalf of The City of Seattle, two deeds for street purposes from ARE-1201/1208 Eastlake Avenue, LLC, a Delaware limited liability company, located in a portion of Lots 1 and 2, City of Seattle Lot Boundary Adjustment Number 9604526, recorded under King County Recording Number 9611060361, and a permanent easement for sidewalk purposes from the Washington State Employees Credit Union, a Washington State chartered credit union, located in a portion of Lot 10, Block 4, Doyles Addition to the City of Seattle; placing the real property rights and interests conveyed by such deeds and easement under the jurisdiction of the Seattle Department of Transportation; laying off the deeds as right-of-way; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Bill passed and chair of Senate please read agenda item number eight the short title please.'",
        "'speaker_2': 'Agenda item eight Constable 119 290 Related to the Bridge Rehabilitation and replacement project operation Director of the State Department Transportation to acquire, accept and record on behalf of the city sale to deeds for street purposes. The committee recommends the bill pass the Senate.'",
        "'speaker_6': 'O'BRIEN Thank you. This this ordinance relates to Fairview Avenue in front of Zuma Genetics, that that road is actually a bridge. It's a structure. It's the last wood trellis structure arterial in the city of Seattle, and it's undergoing replacement in the coming months.'",
        "'speaker_6': 'The this legislation would accept a couple of slivers of property, either in temporary or permanent form in the forms of an easement or deed, as that project moves forward to allow the proper right away and the sidewalks and everything to fit in there.'",
        "'speaker_1': 'Very good. Any further comments? Councilmember Johnson My.'",
        "'speaker_0': 'Constituents been remiss if I didn't mention Council President Harrell that this is going to shut down a couple of busy transportation corridors for a long time, one of which is the number seven route. And the plan would have that route be rerouted through the Seattle Cancer Carolinas and then back onto Fairview and back through South Lake Union'",
        "'speaker_0': '. They would love if the city would continue to work with Metro to think about an express route that would take during rush hour, folks from Eastlink directly up to Stewart Avenue and get them downtown much more quickly, mimicking the old 66 bus route that we all lament the loss of.'",
        "'speaker_0': 'So my opportunity to continue to be a good District four councilmember for 90 seconds or less. Thank you.'",
        "'speaker_1': 'Very good point. Well noted. Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Macheda O'Brien. Somewhat. Bagshaw Gonzalez. Johnson Suarez. President Harrell. Eight In favor and unopposed.'"
    ],
    "AN ORDINANCE relating to parking; defining blockface; updating the definition of parking payment device; defining pay-to-park signage; allowing the Traffic Engineer to establish areas where parking is regulated by pay-to-park signage and to authorize additional methods of payment for parking; amending the description of certain parking penalties; amending parking and payment requirements; making technical changes; amending Sections 11.14.425, 11.16.300, 11.31.121, 11.76.005, 11.76.015, 11.76.020, and 11.76.040 of the Seattle Municipal Code; adding new Sections 11.14.062 and 11.14.438 to the Seattle Municipal Code; and repealing Section 11.76.010 of the Seattle Municipal Code.": [
        "'speaker_1': 'Bill passed into the Senate. Please read item number nine the short title, please.'",
        "'speaker_2': 'Agenda Item nine Council Bill one one, 1981 related to parking. The committee recommends the bill passed.'",
        "'speaker_1': 'Customer Brian, thank you.'",
        "'speaker_6': 'This legislation would change the parking code. Specifically, it will loosen language about how we restrict where and when certain parking meters are used. The legislation is fairly straightforward, but I should speak to why we're doing this. The Department of Transportation and the Executive have proposed making some modifications to the parking meters and parking stations, I should say'",
        "'speaker_6': ', later this summer. Currently, there are basically two options for how folks pay for parking. About 30% of people use a smartphone and a pay by phone application where they enter the license plate of the vehicle and the zone in which they're part.'",
        "'speaker_6': 'And 70% use the pay stations with credit card or cash and they get stickers that show how long they paid for and which they go put them on the windows of their car. What this legislation would do would allow greater flexibility.'",
        "'speaker_6': 'And with the executive and department transportation planning to do is do some retrofits to those pay stations so that going forward, whether you use a smartphone app or use cash or credit card at the station, you would enter the vehicle license number to verify that you paid.'",
        "'speaker_6': 'What this does is it streamlines the ability of parking enforcement officers to check one specific place and see if this vehicle has paid or not, as opposed to check both on their database, if it's paid for smartphones and check the sticker.'",
        "'speaker_6': 'It also eliminates the need for stickers, which for some has been a bit of a problem. The new parking base stations will continue to allow a receipt to be printed. So if folks want a paper record of what they paid in case they have concerns about verifying later if they get a ticket in there, it also will'",
        "'speaker_6': 'allow people to create accounts so that they can go online and see all the different payments they made. So that longitudinal track record of where they paid for it.'",
        "'speaker_1': 'Very good. Thanks for that explanation. Any further comments? Please call the role on the pastor of the bill Macheda O'Brien.'",
        "'speaker_2': 'So I beg Sean Gonzalez Johnson Morales President Harrell I ain't favorite unopposed.'"
    ],
    "AN ORDINANCE amending Ordinance 125471, which conditioned the Seattle Department of Transportations 2018 grant applications.": [
        "'speaker_1': 'Go past and sure sign it. Please read it and add a number ten.'",
        "'speaker_2': 'Agenda item ten Council Bill going to a 1982 amending ordinance 1 to 5 471 which condition the Seattle Department of Transportation 2018 Grant Applications. The committee recommends the bill pass.'",
        "'speaker_1': 'Council Member Brian.'",
        "'speaker_6': 'This legislation would add the corridor between Market Street and Ballard and the University of Washington 45th. The corridor is currently served by the Route 44 Metro Bus. This is one of the proposed rapid ride upgrade corridors, and the Department of Transportation would like to apply for grant funding for some of those upgrades in future years.'",
        "'speaker_6': 'We would like to apply this year to do upgrades in future years. Previous action by the City Council restricts grant applications for our site to only projects that are on our grant application list. And this project was not previously on that.'",
        "'speaker_6': 'So we are amending that list to add this project so that they can go forward and apply for a grant.'",
        "'speaker_1': 'Very good. Any further comments? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Macheda O'Brien. Hi, Juan Gonzalez Johnson Suarez. President Herald. Hi. Eight In favor and unopposed.'",
        "'speaker_1': 'The bill passed and chair will was it please read agenda items number 11 through 15. I'm going to call for individual votes on these appointments, but please read them all into the record and let Councilmember O'Brien do his thing.'"
    ],
    "A RESOLUTION affirming the human right to family unity and expressing opposition to the Trump Administrations practices separating and/or detaining migrant families seeking asylum at the U.S.-Mexico border, and strong concern about the Trump Administrations lack of family reunification plans for over 2,300 children and their parents or guardians and ongoing detention camps at the U.S.-Mexico border in violation of the Universal Declaration of Human Rights and the applicable international human rights framework.": [
        "'speaker_1': 'All the appointments are confirmed and the no votes on certain ones are registered. Thank you very much. Adoption of other resolutions. Please read the resolution.'",
        "'speaker_2': 'Adoption of other resolutions. Resolution three 2022 affirming the human right to family unity and expressing opposition to the Trump administration practices separating and or detaining migrant families seeking asylum asylum at the US Mexico border and strong concerns about the Trump administration's.'",
        "'speaker_3': 'Lack of family.'",
        "'speaker_2': 'Reunification plans for over 2300 children and their parents or guardians and ongoing detention camps at the US-Mexico border in violation of the Universal Declaration of Human Rights and the applicable international human rights framework.'",
        "'speaker_3': 'Catherine Gonzalez Thank you, Council President. It's my pleasure to bring resolution 318 2 to 2 full council today. As I mentioned in my communications with the with all of you in your offices last week, this is a resolution intended to take a position on the policy that is currently at play under the Trump administration, whereby ICE agents'",
        "'speaker_3': 'are literally taking children out of their parents arms and putting them in sometimes in cages, in detention camps, and oftentimes up to thousands of miles away from their parents. With no clear plan on how the federal government intends to reunify these children to their parents.'",
        "'speaker_3': 'There have been media reports and stories, and I'm sure all of us have been following about how in some instances it's the children that have been taken from their parents, have no clear identification or tie back to where they were taken from or whom they were taken from.'",
        "'speaker_3': 'And it is becoming increasingly unclear as to how that reunification is going to occur. And although we saw last week that that the Trump administration issued an executive order supposedly changing course in policy in this area, that executive order actually does does nothing to change the situation, that there is a zero tolerance policy that will now, instead'",
        "'speaker_3': 'of separating families, will result in jailing families in detention centers together for up to 20, 20 days based on a California Court of Appeals opinion that restricts the detention of children for no more than 20 days. That is a ruling that the Department of Justice under Trump is challenging with the hope, I'm assuming, of them being able'",
        "'speaker_3': 'to jail children for longer than 20 days in these particular situation. So the the resolution is quite simple. I want to thank Van Nguyen in my office for taking the charge on drafting it very quickly in consultation with some of the folks who make up part of the coalition and are actively planning for the June 30th Day'",
        "'speaker_3': 'of Action event. And I just want to spend a few minutes walking through some of the commitments that we are, in some instances reaffirming and new ones that we are taking on through this resolution, which has the concurrence of the mayor who went down to Tornillo, Texas, last week, along with other U.S. mayors and councilmembers from across'",
        "'speaker_3': 'the country, to stand stand in solidarity with those those families and those kids. So this resolution states our support for the Washington for Washington state Attorney General Bob Ferguson's lawsuit that he just announced on June 21st against the Trump administration zero tolerance policy for separation of immigrant children from their parents during US-Mexico border crossings.'",
        "'speaker_3': 'It also reaffirms our commitment through our city attorney's office to continue using legal avenues at our disposal, to resist efforts to impose upon the city any immigration, spending or funding policy that violates the U.S. Constitution or the laws of the United States.'",
        "'speaker_3': 'The City of Seattle commits to continuing to protect the rights guaranteed to the city and its people by the U.S. Constitution. And we also reaffirm our commitment and support to the immigrant community and to immigrant families and individuals through appropriate strategies in conjunction with community based organizations and local immigrant serving, community based organizations.'",
        "'speaker_3': 'In particular, it affirms the mayor's recent directive to city departments entitled City of Seattle Protocol and Federal Immigration Enforcement, which directs all city department directors and staff to refer any request for information from the U.S. to. Of Homeland Security's Immigration and Customs Enforcement to the mayor's legal counsel for addressing those particular issues.'",
        "'speaker_3': 'This is something that I had worked on with Mayor Durkan early on in the year after the Department of Licensing disclosure issue happened at the Washington state level. And she issued a mayoral directive. And we now recognize in this resolution that that is an ongoing expectation in this context.'",
        "'speaker_3': 'The resolution also recognizes that building resiliency and supporting empowerment of immigrant and refugee communities is just an essential immigrant defense strategy to increase family unity across the country and here in our city. And the resolution requests that our Office of Immigrant Refugee Affairs continue to work on identifying additional opportunities and resources to support organizing and resiliency building'",
        "'speaker_3': 'that will be led by the local immigrant community and that will seek beyond that, we will continue to seek the ongoing collaboration partnership of King County to build a regional resilience strategy. The resolution also supports the June 30th National Day of Action.'",
        "'speaker_3': 'There will be actions here in the city of Seattle as well, and this is an opportunity for us to, on the front end, support those efforts. And I again have been in communication with folks on the coalition and have offered my office's support and an opportunity to engage with other council members and their offices in the event'",
        "'speaker_3': 'that you all are interested in. Also helping out with that, with that day of action here in the city of Seattle, the resolution also requests that the residents of the city of Seattle pay close attention to the un-American and harmful policies coming out of this administration as it relates to the constant, constant dissemination of misinformation about immigrants'",
        "'speaker_3': 'and refugees that are being pushed out through mainstream media and otherwise by the White House, characterizing these as silly and refugee seekers, as criminals who are dangerous to us as as residents here in this country. And we will be working really hard in our office to continue to push out accurate information and accurate stories about what is'",
        "'speaker_3': 'actually happening down at the US-Mexico border. The resolution also encourages Seattle residents to, if they are able financially support legal aid, resiliency and rapid response focused organizations in Seattle. There are many organizations here who are just working around the clock right now to help families that have been separated and who find themselves detained in our region at'",
        "'speaker_3': 'the Federal Detention Center in SeaTac in particular. And just want to call out the work of One America Northwest Immigrant Rights Project, the ACLU Foundation, Kids in Need of Defense, Collective Legal Pueblo and Washington Immigrant Solidarity Network. As some reputable organizations who are doing amazing resiliency and organizing work in this space and providing much needed legal aid'",
        "'speaker_3': 'to these families that have been separated. And then lastly, this resolution takes a position on behalf of the City of Seattle whereby we support the recent bills introduced in Congress. It's Senate Bill 3036 and House Bill 6135, otherwise known as the Keep Families Together Act.'",
        "'speaker_3': 'And we encourage folks in our city to reach out to their congressional representatives in support of those two bills. And the City of Seattle will be working with the Office of Intergovernmental Relations to send a joint letter to Washington's congressional delegation, also expressing our support of those of that particular particular act.'",
        "'speaker_3': 'And this morning in briefing, we heard from Leslie Posner over at home tonight are our lobbyists at the federal level about Senator Patty Murray and Senator Maria Cantwell's effort to get a hearing on these issues in the Senate Judiciary Committee.'",
        "'speaker_3': 'And this resolution, sun's our support expresses our support for that hearing to occur.'",
        "'speaker_1': 'Thank you, Councilman Gonzales. Any other comments from any of her colleagues? Cats from Swan.'",
        "'speaker_5': 'I'm supporting this resolution because it is essential for local governments to take a stand against the horrendous and inhumane treatment of immigrant and refugee families at the border. We need to add our voice to those of the immigrant rights and social justice organizations and activists fighting to build a movement to end an immigration policy clearly designed for'",
        "'speaker_5': 'cruelty. In particular, I wanted to congratulate the courageous activists in Portland who shut down the local ice facility with an Occupy style direct action and spread the demand to abolish ICE. ICE is an extremely undemocratic and inhumane security force, which for decades has operated with a mandate to pull families apart, drag people out of their beds in'",
        "'speaker_5': 'the dead of night, pull workers from their jobs and imprison them in inhumane facilities like the Northwest Detention Center in Tacoma. Many progressive Democratic politicians are energetically opposing Trump's latest attack on immigrants. But we know this will not be enough.'",
        "'speaker_5': 'Trump's horrific policies can only be stopped by building fighting mass movements, something the Democratic Party has consistently failed to lead on. But that is not an accident. Just as an example, last Friday, the Seattle Times published an article titled Senator Patty Murray got campaign money from a company running Tacoma center where undocumented immigrants are held.'",
        "'speaker_5': 'This article talks about how she has received in as far as Washington state is concerned. Patty Murray is the biggest beneficiary of private prison campaign cash, and her 2016 reelection campaign received $7,500 from private prison operators, including 5000 from the Florida based Political Action Committee for the GEO Group, the nation's largest private prison firm, which also operates'",
        "'speaker_5': 'the Northwest Detention Center in Tacoma, which holds undocumented immigrants facing deportations by ICE. And it holds it owns 140 other such facilities nationally. The center, as you know, has been the center of a protest, hunger strikes and lawsuits, all led by activists and detainees themselves.'",
        "'speaker_5': 'So I think this is an example that shows that there is no substitute for working people of all identities, for for us to be organizing united movements independent of both the corporate parties, to successfully fight and defeat Trump's agenda and to demand an end to the seizure, detention, deportation and criminalization of immigrant working people and their families'",
        "'speaker_5': ', and for taxing the rich and big business to fight for jobs, afford affordable housing and health care for all. But this example of Patty Murray also shows that we cannot rely on politicians. And unless we build our own movement, build our own political representation that do not take money either from big business or from specifically from these'",
        "'speaker_5': 'types of big businesses. I support this resolution, but most importantly, in order to build a movement, I hope to see Seattle's working people, immigrant and otherwise, at the demonstration for immigrant rights on June 30th, this Saturday, 10 a.m. at the Federal Building.'",
        "'speaker_1': 'Thanks very much, Councilman Sean. Any further comments from Skeeter?'",
        "'speaker_2': 'Thank you. Thank you, Mr. President. Many of us have talked about how under this day and age, we will be judged throughout history on how we stand up for our most vulnerable and the actions that we take and the laws that we passed to push back illegal and immoral acts.'",
        "'speaker_2': 'The resolution that Councilmember Gonzalez has put before us is exactly the type of action that we need to make sure that we don't pass the buck, point the finger, or wait for somebody else to right the wrongs that are being committed by this administration as the world looks at us.'",
        "'speaker_2': 'They will look for those who are showing what it looks like to resist from the local to the national level. And I think Washington state, with the community that we have, with the faith and immigrant rights leaders that we have, with the elected leaders who are standing up and fighting back and showing how we will change laws'",
        "'speaker_2': ', object to any immoral and illegal act like the attorney general has done. And to stand in solidarity like this resolution has done by Councilmember Gonzalez are part of the path that will help shape our attempt to right the wrongs created by this administration.'",
        "'speaker_2': 'My husband has been at the border for the last week covering the illegal acts of ripping families apart. As many immigrant attorneys and community members who've been in our Sea-Tac detention and those who've been to the border to witness this corrupt interpretation of the law.'",
        "'speaker_2': 'We have a responsibility to show what it looks like, to make sure that we're responding to the cries of immigrant children who are being ripped away from their families, and to not just say that a executive order has been passed.'",
        "'speaker_2': 'So everything must be okay now. As Councilmember Gonzales said, things are not okay. This cannot be the norm. We cannot be numb to the cries of children who are at the border who are at risk of never seeing their parents again.'",
        "'speaker_2': 'So as we stand up as a community, whether it's standing in solidarity with the immigrants in our own community, like we talked about with my own meal feel they'll Pando tomorrow who has their own immigration case or we hear from the community members that are reaching out to each one of our officers or we think about our'",
        "'speaker_2': 'own experience. As I know, Councilmember Gonzalez has often mentioned her own roots as an immigrant as well. I think that what we hear on this council are saying is that we want to stand in solidarity with every immigrant, every refugee, every attorney who's spent their time making sure that they can reunite families with the community that's calling'",
        "'speaker_2': 'for action from the local to the national level. This is just one step among many that I know we will take as this council to stand up and right the wrongs of this administration. So thank you.'",
        "'speaker_1': 'Thank you. Katherine Skeeter. Any further comments from my colleagues?'",
        "'speaker_3': 'I'll just I'll just close this out. On this resolution, I want to thank everybody for their support. And I'm very confident that we'll pass this unanimously today. And I want to thank Councilor Mosquito for her insightful remarks. You know, this has been a really it's always been hard to be the other in this in this country.'",
        "'speaker_3': 'And, you know, this is the first time in my life that I've had to live through administration like this one that is hellbent on making sure that he dehumanizes immigrants from all nations, but particularly focused on on immigrants lately from south of the border, from here.'",
        "'speaker_3': 'And for me, it's very personal, given my own family story. But I really appreciate the city being able to come together to take a position that really continues to support a lot of the organizing and momentum building that I have personally been a part of and and will continue to be a part of regardless of what my'",
        "'speaker_3': 'title is in the world. And so I just want to really thank all of the advocates who helped me think through the concepts in this resolution. And more importantly, I want to just thank them for continuing to do the work that they're doing.'",
        "'speaker_3': 'And part of the reason Chambers is and not Fuller today is because I'm being respectful of their requests to allow them to organize for what really matters. And that's not to show up at full council today. It's to continue to deliver the services and to continue to build the immigrant rights movement outside of City Hall.'",
        "'speaker_3': 'And that's exactly what they're doing right now. So I want to just thank them for all the work that they're doing and for all the tears that they are shedding. You know, I'm shedding those tears along with them.'",
        "'speaker_3': 'I think we all are. This is a a moral crisis of historical proportions that is staring us down right now in this country. And we have to band together. Get past rhetoric, get past the politics, and recognize that when when people's human rights are being fundamentally destroyed by by our federal government and by others, we have to'",
        "'speaker_3': 'be willing to stand together to fight back. And that's that's that's what I hope we can do moving forward.'",
        "'speaker_1': 'Thank you, Councilman Gonzales. Okay. I moved to adopt resolution 31822 or a second. Second has been moved in second and the resolution to be adopted. Those in favor of adopting the resolution, please vote i.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Those opposed vote no. The motion carries and the resolution is adopted. The chair will sign it. Other business. I will move to rescind the July 2nd City Council excused absences for council members Bagshaw, Herbold, Mesquita and O'Brien because the meeting has been council as their second.'",
        "'speaker_1': 'All those in favor of that recession. Please vote i. I opposed. The ayes have it. And is there any further business to come for the council?'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': '5 minutes. We are going to reconvene as a parks commissioner here in 5 minutes or district commission 5 minutes. And with that, we stand adjourned. And everyone, have a great afternoon or at least a five minute break.'"
    ]
}