{
    "A RESOLUTION concerning Washington Referendum Measure No. 88 (Referendum 88), proposing voter approval of Initiative Measure No. 1000, and urging Seattle voters to vote Approved on Referendum 88 on the November 5, 2019, general election ballot.": [
        "'speaker_0': 'Pass and sure, I'll sign it. Okay. It's provided on our CW for 42 points 178.555. The City Council now consider the adoption of resolution 31913. And at the conclusion of our comments, Council members comments, the Council will hear comments from the members of the public who wish to speak on the resolution, and an approximate equal opportunity will'",
        "'speaker_0': 'be given to speak to members of the public and will clerk with that admonition, please read agenda item number one into the record.'",
        "'speaker_1': 'The Report of the City Council. Agenda Item one Resolution 31913 concerning Washington Referendum Measure number 88 Proposing voter approval of initiative Measure number 1000 and urging Seattle voters to vote approved on Referendum 88 on the November 5th, 2019.'",
        "'speaker_1': 'General election ballot.'",
        "'speaker_0': 'Can put the matter into the record. I will move to adopt Resolution 31913 to move in second to adopt the resolution will now hear from council members on the resolution. I'll begin the discussion. And if any of the customers I'd like to say a few words, feel free to.'",
        "'speaker_0': 'On the outset, there's been some confusion regarding Washington state referendum measure 88. That's in front of us too. Now, regarding initiative 1000. For that reason, I want to make it very clear that 31913 this resolution proposes voter approval and urging voters to vote approved on Initiative 1000 that will be found on the ballot in a Washington referendum'",
        "'speaker_0': ', measure 88. We are hoping that that word gets out and that there's very clear because when Initiative 200 was initially passed in 1988, I personally believe there were many voters that were confused on what the heck they were voting on during that time.'",
        "'speaker_0': 'In 1998, I'll say a few words about the resolution and about the the I 1000. I hope to not steal the thunder from some of our greater speakers in the audience, but I would like to sort of lay the groundwork.'",
        "'speaker_0': 'The groundwork. First of all, with with the support of the voters on the November 5th, 2019 General Election Ballot Initiative, I 1000 would affirm a new law from our Washington state legislature was passed this last past spring that would guarantee equal opportunity and access to public institution and businesses without discrimination based on race or sex or color'",
        "'speaker_0': 'or ethnicity or national origin or age or sexual orientation or disability or military status. The new law reverses a 20 year old ban on affirmative action policies while ensuring fairness by specifically forbidding quotas and preferential treatment based solely on the listed characteristics.'",
        "'speaker_0': 'And this law adds accountability by establishing Governance, Commission on Diversity, Equity and Inclusion to monitor the state agencies compliance with this legislation. Last spring, I attended a hearing on AI 1000 and I was very glad to see many of the people in the audience today.'",
        "'speaker_0': 'And at that public hearing, former Governor Dan Evans, the Republican who created the State Commission on Civil Rights in 1965, testified before the state legislators, and he said the door of opportunity is still just ajar and not fully open.'",
        "'speaker_0': 'We can do better than that. And I believe that Initiative 1000 is a responsible measure that will help us throw the doors of opportunity wide open. And that's coming from a Republican. So I understand that embracing change for some voters may be hard, but we are faced with, I think.'",
        "'speaker_0': 'Insurmountable data that reflects an unfair burden on societal inequality. And we can't just rely on good intentions of government or people. We must be very intentional about the decisions and the choices we make as a legislative body according to state data.'",
        "'speaker_0': 'When I 2000 was passed in 88, 13.3, 1% of expenditures by state agencies and educational institutions went towards certified minority and women owned businesses. However, in fiscal year 2000, that figure 13.31 declined to 3.6 of expenditures. From 1998 to 2019, the number of certified women and minority owned businesses has fallen 45% from 4917 to 2700.'",
        "'speaker_0': 'This is according to the Office of Minority and Women's Businesses Enterprises. In 2018, Washington veteran unemployment rate was nearly 25% higher than the national average. Washington is only one of eight states that restricted affirmative action. Like I said, good intentions are not enough.'",
        "'speaker_0': 'So I'm each asking each council member and each voter to really show, I believe, what their true values are so that we can respond to this new data and see the return to justice that we'd like to see.'",
        "'speaker_0': 'So that I'm asking our council to adopt Resolution 31913 with any of my colleagues like to say. Any remarks on resolution 31913? This would be the time. I can't remember Brian.'",
        "'speaker_5': 'I think it or it's council president Harrell and thanks for the advocates. It's been in my ten years in office here. The city has had to get creative to figure out how to advance our values, an agenda under the constraints of 1800.'",
        "'speaker_5': 'And it's great that we're at a point where the legislature has moved to reverse that. Unfortunately, we have to go to the vote for this. But I'm thrilled for the opportunity to be recommending to the voters of Seattle and anyone else listening to us that we should all vote yes on Initiative 1000.'",
        "'speaker_0': 'Thank you, Kasper O'Brien. Know comments from many of my colleagues. Yes. Yes. Councilmember Waters. You have the floor, ma'am.'",
        "'speaker_1': 'I'll be brief. Council President. I believe it was passed in 1998.'",
        "'speaker_0': 'Correct? I stayed.'",
        "'speaker_4': 'That?'",
        "'speaker_3': 'Yes, sir.'",
        "'speaker_1': 'Yeah, but that's okay.'",
        "'speaker_0': 'You're the only one heard.'",
        "'speaker_4': 'And that's why.'",
        "'speaker_0': 'My apologies.'",
        "'speaker_4': 'This is the time where I enjoy now being 60 years old. And I was in Olympia working for a governor when this went down.'",
        "'speaker_1': 'And I remember how volatile and how difficult it was. And some of the most racist and vile things were said about those of us affirmative action not being qualified, being led into the door of college and law school.'",
        "'speaker_1': 'And we didn't belong there. And I had hoped that we would never return to those kind of conversations again. I say this as a person who grew up on the Puyallup Reservation and put myself through college and law school with help from my tribe, but more importantly for other people of color behind me to be a mentor'",
        "'speaker_1': 'and keep that door open. And there's a reason why this law is focused on and this is why I am so supportive of it is public education and employment is the equalizer in our society to justice. If we don't have that equalizer, if we don't have this world in this country valuing our minds and our integrity into'",
        "'speaker_1': 'these institutions, then we will never be there because of this. I sit here today. I got into college in law school, not because I was Native American and Latina. I got in there because I was qualified. And the recent issues that we've seen with some people buying their ways through legacy into institutions and going to prison sickens'",
        "'speaker_1': 'me. We have watched the legacy. The only difference between affirmative action and a legacy of people with Rich is they have it, institutionalize it, and they made it okay. I've watched it my whole life, so I will have one more note before I will get off my soapbox.'",
        "'speaker_1': 'As some of you know, I don't always talk a lot, but we are one of 21 states in this country where we have a case pending in the United States Supreme Court where we recognize and protect the transgender community.'",
        "'speaker_1': 'One of 21 states. This case is now pending the United States Supreme Court, to whether or not, if you're LGBTQ and transgender, that whether or not that's a constitutional right to be protected for health care, for education. So only 21 states in our country recognize that.'",
        "'speaker_1': 'Right. So we are have gone back into time. I feel like it's 1980 again. 1970 again. I feel like this is a time where young folks, particularly people of color, are being told that that their mind and their value in their future isn't being valued, that they belong in these higher institutions.'",
        "'speaker_1': 'And so as a mother with two daughters, 28 and 25, they've had the blessing and the legacy of me being able to go to law school and have a provide for them. But not everyone does. And so I'm hoping that those of you here today and thank you, and I'm hoping that those who are out there watching'",
        "'speaker_1': 'support and vote yes and vote to approve Initiative one 1000. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Wise, for those comments. You know, the comments from the dais, from any of my colleagues I want to pressure, but I'll make sure you have the ample opportunity. Okay. Having said that, we will now have and a lot of time for comments from the public either in support of or in opposition to.'",
        "'speaker_0': 'And I will start with the in support of since we have an overwhelming amount of signatures there, as is our historical practices, we'd like to recognize current or former elected representatives. And in this case, we have an organizer, Mr. Jesse Weinberg, who's the chair and former state representative with Mr. Nathaniel Jackson.'",
        "'speaker_0': 'I 1000 sponsor or sign a. Please come forward and address some comments. You've identified yourself as being part of a group, so. Well, I'll 5 minutes and thank you, Mr. President.'",
        "'speaker_3': 'I need to apologize for Mr. Nathaniel Jackson, who is the sponsor, by 1000. He had a medical issue that kept him in Olympia. He lives in Lacey. And so he's not able to be here with us. But he's asked that I present these remarks on behalf of the entire committee.'",
        "'speaker_3': 'So, first of all, good afternoon, Council President Harrell and all council members. I'm an attorney and former State Representative Jesse Weinberger, chair of the One Washington Equality Campaign Committee, the authors of Initiative 1000 and organizers of the Approved I 1000 campaign.'",
        "'speaker_3': 'Before I go any further, I want to give honor on behalf of the One Washington Equality Campaign and acknowledge that we are on indigenous land, the unceded ancestral lands of the warmest people, Seattle's host tribe of people that has occupied this land since time immemorial.'",
        "'speaker_3': 'A people who are still living right here today fighting for federal recognition and bringing to light the dormant tribe's rich heritage. On this land, we come today to urge your passage of Seattle City Council Resolution 31913. We enthusiastically support this resolution, which encourages all Seattle voters to approve our 1000 the Washington State Diversity, Equity and Inclusion Act'",
        "'speaker_3': 'on Referendum 88. It's really quite fitting that the city of Seattle or for the city of Seattle to make its voice heard on this diversity act, because Seattle symbolizes the birthplace of diversity in our state. Over 170 years ago, one of the first acts of diversity was not by a member of the majority white community seeking to'",
        "'speaker_3': 'include people of color. It was an act of diversity by Chief South. A native man of color in chief of the majority of the white, Irish and Suquamish tribes. When he extended his hand of welcome to minority white settlers on to the land, which would one day become the city of Seattle.'",
        "'speaker_3': 'Today's I 1000 is the people's initiative to the Washington State Legislature. But it started over one year ago right here in Seattle. It was drafted in Seattle. And the first people to sign on i 1000 were Seattle residents of all races, ages and cultures at Mount Zion Baptist Church, a movement which started in Seattle, ultimately spread throughout'",
        "'speaker_3': 'the entire state. And when it was all said and done, more than 395,000 Washington voters had signed a 1000 the most signatures for any initiative to the legislature in Washington state history. We bring you now a peoples representative, which has been thoroughly vetted, unlike Initiative 200, which killed affirmative action for women and people of color in 1998'",
        "'speaker_3': '. I 1000 has been passed by the Washington State Legislature, approved by the King County Council, upheld by the Washington State Courts, endorsed by not only Governor Jay Inslee, but every living former Democrat and Republican. Washington state governor. I 1000 bans discrimination today and creates the state's first Governor's Commission on Diversity, Equity and Inclusion to monitor all discrimination'",
        "'speaker_3': 'in the future. That's one of the reasons why I 1000 has been endorsed by The Seattle Times, The Stranger, The News Tribune, the Olympian, and the Vancouver Columbia Newspapers. I 1000 replaces I two hundreds old racially blind policy with a new racially conscious policy which was recently upheld by the Federal District Court Judge Alison Burroughs and Students'",
        "'speaker_3': 'for Fair Admissions versus Harvard University. So the courts, state and federal, have spoken. The legislature has spoken. The state's largest county named for Dr. King himself has spoken. So now we're asking the Seattle City Council to speak loudly and proudly.'",
        "'speaker_3': 'And I 1000 by urging the state's largest city to approve I 1000 on referendum 88. And once I 1000 is law, we will be back to ask the City Council to pass an ordinance requiring every city agency to implement I 1000 because, as we all know, the only thing worse than a bad law.'",
        "'speaker_3': 'Is a good law that's never implemented. So thank you for allowing public testimony on resolution 31913. We urge your unanimous yes vote.'",
        "'speaker_0': 'Thank you, Mr. Weinberg. Thank you. Thank you much. We have the Honorable Representative Sharon Tamayo Santos here in our house today. Nice to have you here.'",
        "'speaker_1': 'Thank you very much. Good afternoon. Council President Harrell and members of the Seattle City Council. Thank you very much for the opportunity to speak to you today in favor of Resolution 31913. My name is Sharon Tony Santos. I am a state representative proudly representing the 37th Legislative District, the most diverse legislative district in the state of Washington'",
        "'speaker_1': '. I am here both on behalf of the residents of the 37th District, but as a private citizen as well. I am here because when I was elected 21 years ago, I 200 was also on the ballot. I can tell you that I 200 purported to level the playing field for all persons.'",
        "'speaker_1': 'I 200 purported to end discrimination. I'm here to tell you that that was a false promise, as both the council president and former Representative Wayne Barry have spoken. The the numbers tell the tale. In 1998 to 2016, I have a little outdated numbers.'",
        "'speaker_1': 'The state's investments in women in minority owned businesses plummeted 23.3% from 100 from $227 million to $174.6 million. The investments overall increased $1.7 billion to $6.1 billion. I could go on about subpopulations of our Seattleites who are not represented in higher education and employees who have met the glass ceiling.'",
        "'speaker_1': 'I am wanting to tell you that since this measure was enacted, I have led efforts in the Legislature to repeal i 200, including an up to on signing di voting on I 1000. Mr. Council President, members of the council, I want you to know that every single member of the Seattle delegation voted for I 1000.'",
        "'speaker_1': 'And so I ask you to to join with us in voting for this resolution and urging the citizens of Seattle to support Referendum 88 and I 1000. Thank you very much.'",
        "'speaker_0': 'Thank you. Representative Michael Santos, thank you very much. I'm going to go on the other list in opposition to and we'll draw from Mr. David Haines, who will speak in opposition to resolution 31913.'",
        "'speaker_2': 'Racist disgraces all over the places. This city is the most reverse racist city in America's 21st century. One of my heroes, Martin Luther King Jr said judge a man by the content of his character, not the color of his skin.'",
        "'speaker_2': 'Yet City Council is financing a racist budget that smudges on data as lives go splatter. In fact, a sponsor of this referendum is in violation of the U.S. Constitution separation of church and state. The church in question had hosted a city council meeting.'",
        "'speaker_2': 'Who created this ugly racist referendum? Used $1.5 million of church money to finance the petition drive. And now City Council is going to allow them to make that money back by shaking down tax payers, charging social welfare budgets to finance homeless encampments on toxic, unsafe soil at the church.'",
        "'speaker_2': 'A city council circumvents every first world zoning and soil and environmental law proving they really hate the poor and are okay with subhuman mistreating the homeless and treating the integrity of council for more reelection support at expense of health of homeless and taxpayers fed up with liberals who have imploded our society.'",
        "'speaker_2': 'Perhaps City Council should create a declaration of solidarity with the oppressed people of Catalonia and come out against the evil empire of Spain. Supporting Referendum 88 is proof Seattle is the most racist city in America and should be boycotted out of principle.'",
        "'speaker_2': 'Shame on city councils, race baiting and class war hating accommodation of hypocrites. You base their judgments on the past already overthrown, but for the educations of hate who feed off negativity and blame games.'",
        "'speaker_0': 'Thank you, Mr. Haynes. Now we'll go back to the support of the resolution and we'll hear from Mr. Heywood Evans to be followed by Mr. Eddie Ray.'",
        "'speaker_3': 'Haywood Evans is not here. I am Eddie Ray Jr, and I'm here in support of the resolution. You know, we talk about what the state has lost in terms of activity and opportunities for people of color and women.'",
        "'speaker_3': 'And it was like I calculated to be $3 billion that the state representative Santos already has submitted legislation in 2012. Unfortunately, it was never used. Her legislation, substitute Bill 1328 would allow municipalities to restrict bidding to three firms that their firm was doing under $250,000 a year, and the contract was for 30 or 40,000.'",
        "'speaker_3': 'You would select three and three firms, regardless of color or gender. In those three firms, those small firms would bid for that contract. It could also go another step contracts up to $250,000. Firms is doing under $1,000,000 a year bid terribly for those contracts.'",
        "'speaker_3': 'Unfortunately, those that law was never used. And after eight, nine years, it could have made a huge difference with a lot of our firms. Now, we also have to look at the fact the economic impact it has right now.'",
        "'speaker_3': 'The city of Seattle is 4% African-American or a of United States slaves, 4%. And all that has to do with economic inequality. So I'm proud it's here that the city council is intending on supporting this resolution. And I hope that the mayor and everybody else does the same thing.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Wright. Our next two speakers will be Royal Allie Barnes, followed by. Barricade Cairo's.'",
        "'speaker_4': 'Good afternoon. Your council president and council members. This is a true story. My name is Royal Ali Barnes. Royal Allie Barnes Consultants. In 2016, Washington State was home to 19 squaws, six coons, five Negroes, three Jim Crows, two Redmen and a Chinaman as names on Washington State maps.'",
        "'speaker_4': 'Academics have said, and I quote, These names were a product of a white supremacist society that sought to naturalize its racist and sexist ideology by inscribing it the ideology into the symbolic fabric of the cultural landscape. Elected officials have since coordinated efforts to scrub these racist references from our natural landscapes.'",
        "'speaker_4': 'In 2019. Economic and educational opportunity losses have been designed by a similar white supremacist and their collaborators. They have woven new patterns of economic and education inequity into the core fabric of brown and black communities. This must stop.'",
        "'speaker_4': 'We urge the City Council to shred these oppressive fabrics of economic and education inequities that are currently suffocating our communities. Support Initiative 1000.'",
        "'speaker_0': 'Thank you, Ms.. Barnes.'",
        "'speaker_2': 'Mr. President, and this the members of city council, my name is Burkhard Quiroz, and I am the co-chair of a coalition of immigrant and refugee and communities of color. The approval initiative. Affirmative action is necessary, and I argue that discrimination in the past has a profound impact on the future.'",
        "'speaker_2': 'And the generation of poverty and inequality leave minorities to a disadvantage even when society attitude changes. I argue that diversity is a good for the educational institution and workplace, that decades of discrimination. Discrimination will result in less diversity at school and work, which in turn reinforces poverty and inequality among minorities.'",
        "'speaker_2': 'The passage of Initiative 1000 Affirmative Action Policy Head Office in which historical and privileged minorities are given preference during hiring or university admission. It's no time to oppose Initiative 1000 affirmative action given the history of slavery and its continued, pervasive racial discrimination.'",
        "'speaker_2': 'To think otherwise is a selective loss of memory. The continuing failure to significantly reduce the effect of discrimination prevents many from preserving equal opportunity today. Black unemployment, poverty, homelessness are twice that of white workers. That accumulation for blacks is 1/20 of what it is for whites.'",
        "'speaker_2': 'Similar disparities also for Hispanic racial profiling in the criminal justice system is rampant. To prohibit affirmative action in admission to state college and university has flowed. Affirmative action characterized an unfair preference rather than a justified remedy. It is a travesty of justice.'",
        "'speaker_2': 'Especially is the age of Donald Trump. When our nation is deeply divided, but there is a better, less divisive way to achieve the goal of opening doors to elite universities to disadvantage students of all races who are no longer shut out of education.'",
        "'speaker_2': 'And so United is supposed to people associate affirmative action with a preference hiring or admitting African Americans. However, federal affirmative action laws are also in place for women, veterans and people with disability. Furthermore, local government has also also enacted different affirmative action laws.'",
        "'speaker_2': 'However, while some are, affirmative action is still necessary as it is not, and in fact in fact worsens the racial tension. It is now time for the City of Seattle to concede the passing into the law to create economic and educational opportunity for historically homogenous group of people.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, sir. Next, these figures, Tony Orange and Khabib Mooney. Tony Orange and Khabib. And then when Dona Hollingsworth age will age will follow that. One, two, three. Sorry I didn't give you much for warning there. Tony. Tony.'",
        "'speaker_0': 'Khabib. And we know. No. Have.'",
        "'speaker_3': 'Good afternoon. My name is Tony Orange. As a Seattle stakeholder. And Concerned citizen regarding everyday experiences of African-Americans. In public education.'",
        "'speaker_2': 'Employment and.'",
        "'speaker_3': 'Contracting. I come today? To show my strong support for Resolution 31913. Concerning Initiative.'",
        "'speaker_2': '1000.'",
        "'speaker_3': 'And. Referendum 88. The studies are in. The statistics are clear. 20 years and $3 billion is enough.'",
        "'speaker_2': 'Now is the time.'",
        "'speaker_3': 'This is the place. And we are the ones. Last but not least, I want to.'",
        "'speaker_2': 'Publicly thank.'",
        "'speaker_3': 'President Harrell and council members for your support of the Public Defenders Association. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Orange.'",
        "'speaker_3': 'It's KBB.'",
        "'speaker_0': 'Make sure we're here. We're followed by Winona and then Jodi only. Director of the Indian Services Commission.'",
        "'speaker_4': 'Good morning, counsel. Thank you very much for hearing our statement. My name is Gabe Monet and I'm the executive director of New Blackout West Theater. I'm here on behalf of my community. The system needs to be repaired. And these are some words from the last poet, and I hope it will touch your ears.'",
        "'speaker_4': 'For the millions who were shot, hunt, beat to death. Tarred and feathered, bald and old. Castrated, miseducated, segregated for the millions who have been lied to, denied to vampire. I too misguided to a native by the two. So we decided.'",
        "'speaker_4': 'We decided to get together and change the weather, not just for now, but forever. We decided to love each other. Stop the madness and be real. Sisters and brothers. Greatness is where we're coming from. For the millions who marched, sang praise said Laden lived in and jailed in boycotted, bigoted, spit at curse debt yelled at like blacks'",
        "'speaker_4': 'not where it's at like we should be satisfied to ride in the back for the millions who know, and those who have always known that no matter what truth crushed to the earth shall rise again. No matter how many bullets and prisons, diseases and deaths, no matter how much liquor and crack, nothing can kill.'",
        "'speaker_4': 'The fact that we are a divine creation started civilization built the pyramids and the Sphinx taught the world how to pray and think for the millions who are ready to turn this thing around, who are tired of being tired and crawling on the ground.'",
        "'speaker_4': 'It's time to turn this mess around. And we say for liberty and justice for all. Thank you.'",
        "'speaker_0': 'Thank you. It could be. Winona will be followed by Jodie and then Sean.'",
        "'speaker_4': 'Good afternoon. My name is Winona Hollins Hague. I am a former commissioner for African-American affairs for the state of Washington, also former council member for the Health Care Disparities Council. I have for the last. I'm a native of Seattle.'",
        "'speaker_4': 'And for the last 20 years, I actually have seen and felt the impact of discrimination that I 200 and Tim Iman's initiative brought here to the citizens of Washington State. I being 66 years old now I consider myself one of those older people that I used to think were the older people.'",
        "'speaker_4': 'And I say that I 1000 prohibits age discrimination and I 1000 in prohibiting age discrimination realizes that some of us may have to go back to work with the current economy as it is. So we are advocating that you look at I 1000 and make sure that you know that it also helps to support the aged people'",
        "'speaker_4': 'with disabilities and also it prevents gender discrimination, it prohibits the LGBTQ discrimination and it strengthens our veterans. And I'm a former US public health service officer, so I'm always concerned about the way we can do things to help to affirm and create a better opportunity for our veterans.'",
        "'speaker_4': 'Again, take this opportunity today to say no to the moneys that are coming in with the big sign saying reject all over the place. Say that because you know that that money is foreign money. And those Chinese nationals that are against this are being funded by very highly political foreign entities.'",
        "'speaker_4': 'We need to take control of this situation ourselves and say we affirm I 1000 because it's the right thing to do and it's the only thing to do. Thank you so much.'",
        "'speaker_0': 'Thank you, Jody. Shaun Bagby and then Pedro Espinoza.'",
        "'speaker_1': 'Janine, is this on? Yes.'",
        "'speaker_0': 'The green light should be on. Is it on? Okay.'",
        "'speaker_1': 'Good afternoon. My name is Jodi Olney. I work with the Seattle Indian Services Commission. I want to thank Council President Cairo and City Council for bringing this resolution. And what I want to speak about is more of my lived experience, me impacted by 200, the expectation that communities of color and folks who do get into various institutions'",
        "'speaker_1': 'in the city and in this state have the time and energy to continue to advocate for increased representation, increased access and and to find it. People don't want to violate it. They don't want to get in trouble. They you know, they're well-intentioned.'",
        "'speaker_1': 'And so I fully support initiative 1000 and and encouraged that this might actually mean that the teeth that have been missing through so many initiatives in the past, so many task forces they set about righting the wrongs and bringing more equity, might actually have the room to do that.'",
        "'speaker_1': 'I think that individuals get hit up for these, you know, can you give this to your community? Can you quietly tell people that we want people of color in these in these rooms even just to be heard? And I guess they felt important to come and say that because it might be lost on institutions, that this work'",
        "'speaker_1': 'is expected to come for free in addition to your day job. In addition to school. And it's you're supposed to be tireless and at the end of the day to hear. Sorry. I 200 blocks from doing that. So I just wanted to thank you all for your support.'",
        "'speaker_1': 'And I hope that Washington State gets some clarity from this and moves us in a positive direction.'",
        "'speaker_0': 'Thank you, Judy.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Good afternoon, members of the City Council. My name is Sean Bagby. My preferred pronouns are he and him, and I'm proud to serve as the political director of Membership Development Coordinator for the International Brotherhood of Electrical Workers, IBEW Local 77.'",
        "'speaker_3': 'We represent over 8400 electrical workers across a majority of Washington state, northern Idaho and northwestern Montana. I also serve as the National Board Member of the Electrical Workers Minority Caucus, and I'm going to speak on behalf of those two hats.'",
        "'speaker_3': 'Then I will transition to our third hat in a few moments. The negative impacts of EIT 200 are well-documented on my thank you from Council President for setting the groundwork and my other colleagues for speaking on that regard and also speaking about the battle that it took in order to pass.'",
        "'speaker_3': 'I went to the Washington State Legislature this year on behalf of all of our members, especially our veterans, our they don't like to be called old, but our more seasoned members, our sisters, our people of color, our LGBTQ, AIAA plus community that I urge you all to move forward and pass this resolution.'",
        "'speaker_3': 'Seattle is a world class city. I was fortunate to be born and raised here in Seattle right off of 26 and John in the old Central District. And Seattle is not dying and is a world class city. And it's up to us to make sure that it continues that to be that going forward, not just for us'",
        "'speaker_3': ', but for our children and our children's children. I just got those two hats down for a moment and speak on behalf of Sean Bagby, the son of a Boeing worker and a Seattle public schoolteacher, Velma Bagby, for 29 years and a black man here in the city of Seattle where I was born and raised.'",
        "'speaker_3': 'This is larger than all of us, and not everyone in this room will benefit from this. But as I stated earlier, it's for our children's children and for those that go forward that this great city, with all of the economic availability and opportunity to make sure that all people, regardless of what they look like, where they come'",
        "'speaker_3': 'from that are here, can benefit from it. That is why I went in is extremely important. So I encourage you to please adopt this resolution. Thank you for all your hard work.'",
        "'speaker_0': 'Thank you, Sean. Pedro, before you begin, let me read off the next three names following Pedro B, Kevin Washington, Nate Miles in, Rian Johnson, Covington, Kevin, Nate and Rio will follow Pedro yet for sure.'",
        "'speaker_6': 'Thank you Seattle City Council for the invite. Many of favorites. When I was I represent the Carpenters Union and I am here on behalf of the Corpus Union to support the Initiative 1000 and Referendum 88. As a union member, we represent about 29,000 members through six states.'",
        "'speaker_6': 'A majority of those members here in Washington state. And we are avidly advocating for them to support and pass Referendum 88 and support one over 1000. As an organization, we see it as a huge, huge step for our communities to come up and be part of society and not being left behind.'",
        "'speaker_6': 'You know, the government always says communities always follow. We can't leave some people behind. Well, our communities of color have been suffering. And it always seems that we're always left behind. With that being said, I want to speak on my behalf and I think coming from.'",
        "'speaker_6': 'A sector of people that have always been stepped on, especially now in this tremulous government that we have in office, where they tend to criminalize, demonize for who we are. Because I was born with the skin color. And.'",
        "'speaker_6': 'It hurts me when I hear that because my kids, I have two beautiful daughters that are part of the system. And for them to go through this because they have to fight just a little more. And I'm sorry for emotional, but man.'",
        "'speaker_6': 'It's time for this country to pull together. A lot of our communities are left behind. We're being oppressed. And I don't want people to think that it is the white people that are supporting this, that it's their fault.'",
        "'speaker_6': 'It's not. It's a system that's been catered by the rich to keep these communities down. We see this system on an on going where they buy their kids to go to school one day to have no reason to be in there.'",
        "'speaker_6': 'But because of the privilege and I call it a privilege because of what they are, they're white. And because I did not choose to be born this way. But I am proud of being a mexican and I am proud to be here to support Referendum 88.'",
        "'speaker_6': 'And hopefully you guys will support it, too. Thank you.'",
        "'speaker_3': 'Thank you for the. First, give me honor to God, who's the head of my life. Counsel, I want to thank you for this resolution. And I also want to give.'",
        "'speaker_0': 'Real some praise to Representative Santos and to former Representative Wayne.'",
        "'speaker_3': 'Barry, who without them, we would not be here in the hard work that they've done. And I also want to thank some of the other people who are nameless, people like my father, Booker T Miles. I have to call his name, Mr. President.'",
        "'speaker_3': 'He and other contractors who put everything on the line and risk it all mortgaged houses to start before they could get jobs in the union.'",
        "'speaker_2': 'To.'",
        "'speaker_3': 'Really start businesses and put them on the line and start the small businesses. And they were the ones who really made this day possible today. And I want to thank them for that. I want to thank people on the education front that went out and took over the president's office at the University of Washington and kicked those'",
        "'speaker_3': 'doors open and made sure that we had an opportunity to go to that school there. And so which is why it makes me so mad when I hear the opposition say they're not qualified and what have they done?'",
        "'speaker_3': 'They don't understand the fact that I've watched a mother like Elise Miles, my mom, who was a part time domestic and a part time bus driver, get up on a bus when it was icy and fall off that bus, getting arthritis in her knees every day, though, making sure getting back up there when she didn't have.'",
        "'speaker_2': 'Insurance, making sure that she worked her butt.'",
        "'speaker_3': 'Off to get us to school, making sure that she went without that insurance because she wasn't covered every day, making sure.'",
        "'speaker_2': 'When she would go and.'",
        "'speaker_3': 'Scrub those people's floor with those arthritic knees and that that diabetes in her system.'",
        "'speaker_2': 'But made sure that we would work hard.'",
        "'speaker_3': 'So don't tell us that we don't work hard and we're unqualified. She told us to go to school and we have just as much right to that university as anyone else. And so the fact that you guys are doing this, saying there's going to be some fairness in this system and that this city council believes in fairness'",
        "'speaker_3': ', we want to and on behalf the league smile and on behalf of Booker T Miles, I want to thank each and every one of you for taking a brave stand to do so.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_0': 'Thank you, Mr. Miles. Up there, Kevin.'",
        "'speaker_3': 'Good afternoon. My name is Kevin Washington and I'm a board member, Tabor 100. I'm also the education chair. I'm representing that organization. That's the hat that I'm wearing. Like to ask any of the table. 100 members who are here to please stand.'",
        "'speaker_3': 'Table 100 was founded right after I 200 passed. It was named after Langston Taber. It's an organization of largely, but not exclusively black and African-American businesspeople. In the 20 years since it was passed, the minority business community has been decimated.'",
        "'speaker_3': 'The number of contracts awarded low percentage of dollars of spend by the state, county, port and the city are not what they could have been and not what they should have been. If it had not passed. While I 1000 does not repeal I 200, it is a solid step in strengthening positive actions towards seeking an awarding of'",
        "'speaker_3': 'contracts within the minority business community. It also stands to impact. Admissions to the University of Washington or other public institutions. No more should city, county, port and state employees. People who award contracts, people who hire hide behind I 200 claiming that they cannot find a way.'",
        "'speaker_3': 'They cannot find the people there aren't qualified, blah, blah, blah, blah, blah. No more of that. I'm urging you to support your resolution. I 1000 and referendum 88. This is long overdue. You not have a place to stand and a role to play.'",
        "'speaker_3': 'Urge you to support I 1000. Referendum 88. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Washington. The last two speakers I have just been following, Miss Johnson Covington will be then Robert Stevens. For the last year. I have.'",
        "'speaker_1': 'Greeting President and Honorable Council. My name is Rhea Johnson Covington. I'm your neighbor from Pierce County. I've come to stand in support of 31 913 Initiative I 1000 and Referendum 88 as a leading member of our on a corporate DNA committee.'",
        "'speaker_1': 'We recognize the importance of having intentional conversations that surround sensitive and emotionally charged topics to create process and procedures fairly. So I'm asking you here today, the city of the citizens of Washington State, not only to set aside your opposition, but let's reconcile our party differences.'",
        "'speaker_1': 'Join together to ensure all the concerns are heard. Each of us are accountable and lead in the development and implementation of the Diversity, Equity and Inclusion Committee on behalf of Washington State. Thank you for your time.'",
        "'speaker_0': 'Thank you. I'm Richard Stevens. Good evening.'",
        "'speaker_3': 'Good afternoon to you. My name is Robert Stevens Jr. I'm one of those 19 year olds that got drafted in 1965 and went away with honors and served my country and came.'",
        "'speaker_2': 'Back to give.'",
        "'speaker_3': 'To my.'",
        "'speaker_2': 'Community. I was able to go to school.'",
        "'speaker_3': 'The University of Washington for.'",
        "'speaker_2': 'B.A..'",
        "'speaker_3': 'And to graduate school because those elements that are in this 1000 was in place at that particular time. I went to fight for my country so all of us can enjoy the bounties of this country. So I encourage you to support 1000 and to pass the resolution.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Stevens. So a few house came out and those are the speakers that I have signed up for. I also want to go back to the. In opposition to. And a lot an opportunity for the in opposition to once again to speak in opposition to resolution 31913.'",
        "'speaker_0': 'Holding the. Motion open. That opportunity is closed. Judge Shadid, I don't want to put you on the spot, but I assume you're here for the budget matter, not for this matter, because I would have afforded you some opportunities to speak if you'd like to.'",
        "'speaker_0': 'But I. I'm not sure that is correct. Okay. Yeah, I think there might even be some rules associated with you providing public testimony of something going on a ballot that I didn't want to. Yeah, I didn't want you to be unethical.'",
        "'speaker_0': 'A few things. And before we cast a vote, and I'll give my colleagues that opportunity to speak if you'd like. This has gotten very personal for many in this room. You've put your heart and your souls and your your time and your money and resources into this effort.'",
        "'speaker_0': 'And it's a beautiful thing to watch. It's one of the most, I think, well-organized and committed movements I've seen in political history. Overcoming odds, overcoming. Anger and hatred, even politics. And so just kudos to you. And I think you know who you are.'",
        "'speaker_0': 'I will. I've worked with you in the field and many of you I've known for 40, 50 years. Well, I'll show my age here. But as Councilmember West said, some of us are direct beneficiaries of the work you've done.'",
        "'speaker_0': 'So thank you for that. And certainly my ability to support this resolution. A housekeeping item and some good news here. And then our next four before we vote on it. I got hot pressing news that the mayor will be holding a.'",
        "'speaker_0': 'On Wednesday. On Wednesday. A signing ceremony of this resolution, assuming that it successfully passes at 515 and Norman B Rice Room at Wednesday at 515 there'll be a signing ceremony. So put that on the calendars before we vote on this exciting resolution.'",
        "'speaker_0': 'Does any of my colleagues, would they like to say any words before we close the comment section? Are we okay? Are we good? Everybody's happy. Okay. Those in favor of adopting resolution 31913. Please vote i i those opposed vote no.'",
        "'speaker_0': 'The motion carries a resolution. Adopt and share will sign it. Thank you. You all deserve the applause. That is our last agenda item. Is there any further business to come before the council today? I have one and that will be.'",
        "'speaker_1': 'Carefully.'",
        "'speaker_0': 'Prepared. I asked to be excused on November 4th from the City Council meeting. It's been moved to saying that I'd be excused from it November 4th and the city council meeting. All those in favor say I. I oppose.'",
        "'speaker_0': 'The ayes have it. And if any further bids come for the council and not everyone. Have a great day. And we stand adjourned. We're coming back and we are coming back for our budget hearings. Three 2320. We will be back.'",
        "'speaker_0': 'Yes, Mr..'",
        "'speaker_3': 'Representative Santos, this legislation.'"
    ]
}