{
    "AN ORDINANCE relating to the City Light Department; changing the operation of the Rate Stabilization Account, and amending Seattle Municipal Code 21.49.086.G.": [
        "'speaker_0': 'So thank you very much. The report of the Energy Committee. Please read item two.'",
        "'speaker_6': 'The Report of the Energy Committee. Agenda item number two Council Bill 118350 relating to the city light department, changing the operation of the rate stabilization account and amending the Seattle Municipal Code. 21.4 9.0 86g. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. Council member so on.'",
        "'speaker_7': 'Thank you. Brian Burgess. This is an ordinance that will push back the effective trigger date for the rate stabilization account until January 1st, 2016. The reserves in the account have surpassed the upper boundary of under $25 million. But the Energy Committee has been told by Seattle City Light that this could be a temporary anomaly from the early'",
        "'speaker_7': 'melt of the snowpack this winter and that by the end of the summer this will correct itself. And if we did not push off the trigger date, we would likely have to go through the process of discussing a new rate ordinance which would become obsolete before it was finished.'",
        "'speaker_7': 'And therefore, the Energy Committee recommends that full council pass this council bill.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the roll on the passage of the bill.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Rasmussen All right. So want.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Back up?'",
        "'speaker_7': 'Will you call me back?'",
        "'speaker_1': 'I got it. Hi, Carol. Hi, President Burgess.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Seven, seven. And favorite and opposed.'"
    ],
    "An ORDINANCE relating to City employment; adding a new Chapter 4.27 to the Seattle Municipal Code to provide a Paid Parental Leave Benefit to eligible city employees; amending Seattle Municipal Code Subsection 4.20.055 to provide the Paid Parental Leave benefit to eligible temporary workers; and establishing other conditions of implementing the new benefit.": [
        "'speaker_0': 'Thank you. The bill passes and the chair will sign it. The Report of the Park Seattle Center Libraries and Gender Pay Equity Committee. Please read Item three.'",
        "'speaker_6': 'The Report of the Parks, Seattle Center, Libraries and Gender Pay Equity Committee. Agenda Item number two Council Bill 118356 Relating to City Employment. Adding a new Chapter 4.27 to the Seattle Municipal Code to provide a paid parental leave benefit to eligible city employees.'",
        "'speaker_6': 'Amending Seattle Municipal Code Subsection 4.20.055 to provide the paid parental leave benefit to eligible temporary workers and establishing other conditions of implementing the new benefit. The committee recommends the bill pass as amended.'",
        "'speaker_0': 'Thank you. Councilmember Gordon.'",
        "'speaker_7': 'Well, let's first take a moment to think about the public testimony, money that we heard earlier from the women who had had experiences having given birth without any parental leave. This is a momentous day for our city. Passing paid parental leave legislation will make Seattle the first municipality in the region to have a paid parental leave policy'",
        "'speaker_7': '. It is also deeply personal, as we heard from the public comment, to add what we already heard. I would like to read a couple of excerpts from the many letters of support that I have received. Gunnar wrote council last week that while he and his husband do not plan to have children, he wrote on behalf of his'",
        "'speaker_7': 'sister, who has had a child last year without paid parental leave. After exhausting her vacation time to recover after the birth, she is now back at work but does not have any paid time off for when a call makes its way through the daycare or when family emergencies occur.'",
        "'speaker_7': 'Beyond personal family reason, Gunnar cites how the US is the only industrialized country without paid parental leave and where it is implemented. It is shown to have a positive outcome for employee retention and competition for talent in the labor market.'",
        "'speaker_7': 'The city should be and must be a model employer to attract the best talent and paid parental leave will make that a reality. The city of Seattle also must be an inclusive city, as we heard from Madeleine. Here is what she wrote to me in 2014.'",
        "'speaker_7': 'We were matched for an adoption in Texas. We drove to Texas a week prior to the baby's birth to ensure that we were in the state on time. And we were in Texas for about three weeks before returning home with our bundle of joy.'",
        "'speaker_7': 'While we had three months of protected leave under federal and state laws, none of this was paid. We had to weigh the importance of bonding with our child to being able to pay our bills with an adoption that cost $60,000 on a middle class income.'",
        "'speaker_7': 'There are a lot of choices. We each took an additional week once we returned home with vacation and sick time, already exhausted after the weeks in Texas. This was unpaid at my company. Women who give birth to a child receive short term leave, which at least qualifies and provides a portion of their pay while they are on'",
        "'speaker_7': 'maternity leave. Men do not qualify and I did not qualify, not having given birth. This inequity allows women who give birth to take maternity leave without fear of having to pay at all, whereas I was completely left uncovered.'",
        "'speaker_7': 'Those were Natalee's words. But this paid parental leave. But with this paid parental leave. Legislation. No family working for the city of Seattle will face what Natalie based. Having to choose between income and bonding with their child. Beyond this, however, paid parental leave is an important tool in combating the gender pay gap.'",
        "'speaker_7': 'When paid parental leave is prioritized for both men and women, it can shift the perception of women as the main child care provider in the home. Retention of female employees and their mobility into higher paying roles can be improved when paid.'",
        "'speaker_7': 'Parental leave is encouraged for both men and women. This legislation will make the city of Seattle a model employer, not just for families, but for helping to narrow the gender pay gap. The legislation before us will provide four weeks of paid leave to city employees with tender of more than six months, regardless of gender, who welcome a'",
        "'speaker_7': 'new child into their home. This can be by foster care, adoption or birth. The child must be 18 years or younger, and the leave must be utilized within the first year of the child joining the employee's family. I have added additional evaluation component to this legislation, including a presentation to the Council so that we can monitor how'",
        "'speaker_7': 'this paid parental leave policy operates. I would like to thank my colleagues for their continued support on this important legislation, and I would like to thank Mayor Murray for his unwavering commitment to narrowing the wage gap and to paid parental leave.'",
        "'speaker_7': 'I would also like to help, too. I would like to think I would like to give really big thanks to those who operate behind the scenes, but who are critical to the legislation that we have here today. Thank you to my previous legislative aide, Monica Gauche, for spearheading paid parental leave and keeping the conversation going despite any'",
        "'speaker_7': 'obstacles. Thank you to council central staff Patricia Leigh and Dan Peter. And thank you to Sarah Butler and Susan Cox Ski with the Human Resources Department, Katie Ewing and Ben Noble with the central business of the Central Budget Office and Sara Wilkinson from law.'",
        "'speaker_7': 'And thank you to everyone who wrote in or spoke on behalf of paid parental leave. I still have pictures of children that were born before we got paid parental leave posted in my office. And we're grateful for people who don't necessarily intend to have more kids.'",
        "'speaker_7': 'At least help us back this for others. I share this momentous day with you. With that, I had the mic back over to my colleagues who might have any questions or comments.'",
        "'speaker_0': 'Thank you. Questions. Comments. Council Members A1.'",
        "'speaker_7': 'Thank you, President Burgess. I fully support this essential workers. Right. And I thank the council for working on it. I also thank Meghan for her testimony as she so clearly highlighted. Despite having worked for nearly ten years for the city government that serves such a wealthy city as ours.'",
        "'speaker_7': 'She has had to struggle and many women like her and working close parents need paid parental leave, particularly when daycare is so expensive. It is particularly important for women who, statistically speaking, take more unpaid parental leave, end up having to target exacerbating the gender pay gap, as Councilmember Gordon said.'",
        "'speaker_7': 'And so this legislation such as this addresses the gender disparities as well as provides for better outcomes for children. And as a public institution, I am glad that the city is taking this step of offering four weeks parental leave, and I hope that the Council will, as a next step, look to expanding it to 12 weeks.'",
        "'speaker_7': 'In the next budget because that is so necessary. I think that also another step should be to looking to the private sector as well. Beyond setting a good example, the Council will require to actually pass legislation to ensure that the private sector is held accountable as well and paid parental leave becomes the norm in this city.'",
        "'speaker_7': 'But for this moment, I am very happy to vote in favor of this bill.'",
        "'speaker_0': 'Thank you. Please call the roll on the passage of the bill. O'BRIEN All right.'",
        "'speaker_1': 'Rasmussen I so want back shot. I got it. Carroll And President Burgess, seven in favor. Nine opposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Congratulations, Councilmember Gordon. And I understand also you have a proclamation that is related to this in a way. Do you want to do that at this time?'",
        "'speaker_7': 'Well, it is related to the gender pay gap. It isn't really quite a partial parcel of this, but it does have sort of some of the same elements. This is a proclamation proclaiming Equal Pay Day, whereas April 14th, 2015 marks the additional 74 days.'",
        "'speaker_7': 'The average woman would have had to work in 2014 to earn the same 2014 salary as the average man. And. WHEREAS, in Seattle, women who work full time earn 73% of what men earn, generating a $16,346 gap in pay.'",
        "'speaker_7': 'And. Whereas, the gender wage gap exists for all women, regardless of rape or anything in this in this and ethnic. This is. And. Well, anyway, regardless of race. Yet it is the largest for women of color. Whereas single women typically earn 21.2% less than married women, while a single woman earns only $0.57 to the dollar compared to'",
        "'speaker_7': 'married men. Whereas women face a pay gap in nearly every occupation, from schoolteachers to computer programmers and are paid less than men in female dominated gender balance and male dominated occupations. And. Whereas, the pay gap hinders Seattle families and the economy, as women make 75% of household spending decisions, they're now therefore be proclaimed by the mayor and'",
        "'speaker_7': 'the City of Seattle City Council. April 40, 2015 is Equal Pay Day and it is signed by all the council members and the mayor.'",
        "'speaker_0': 'Thank you very much. Thank you. Please read and read the remaining items. The appointments.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; declaring certain real property rights as being surplus to the Citys municipal utility needs; granting an easement to Burlington Northern Railway Company, for limited purposes, over and across the Citys Cedar River Pipeline #4 right of way (a.k.a. Bow Lake Pipeline), King County Assessor Parcel number 0005800017.": [
        "'speaker_0': 'Please read item 20.'",
        "'speaker_6': 'The report of the Seattle Public Utilities and Neighborhoods Committee Agenda Item number 20 Council Bill 118359 relating to the Seattle Public Utilities declaring certain real property rights as being surplus to the city's municipal utility needs, granting an easement to Burlington Northern Railway Company for limited purposes over and across the city.'",
        "'speaker_6': 'Siebert, Cedar River Pipeline number four, right of way. King County Assessor Parcel Number 0005800017. The committee recommends the bill pass.'",
        "'speaker_0': 'Thank you, Councilmember Banks.'",
        "'speaker_7': 'Yeah, thank you very much. This legislation is needed for a 30 by 50 foot easement over the city's Bow Lake water transmission pipeline, which for those of you who may not know exactly where it is, it's down near Tukwila and very close to the sound transfer.'",
        "'speaker_7': 'The sound transit station, the sounder station is expanding. And we are going to need to provide an opportunity for the Burlington Northern Easement to be made. What happens here is that the track will be provided, an additional track will be added, and the city is going to benefit because the BNSF has agreed to build a protection system'",
        "'speaker_7': 'for the benefit of the Cedar River pipeline. Number four, the cost is estimated to be $250,000 to Burlington Northern. We reap the benefits committee recommends do pass.'",
        "'speaker_0': 'Thank you. Questions or comments? Please call the role on the passage of the Bill.'",
        "'speaker_1': 'O'Brien Rasmussen Solent picture guy Gordon Carroll and President Burgess High seven in favor and unopposed.'",
        "'speaker_0': 'The bill passes and the chair will sign it. Is there any other business to come before the council? Seeing none. We are adjourned. Thank you.'"
    ]
}