{
    "AN ORDINANCE relating to the Ethics Code; amending Sections 4.16.030 and 4.16.070 of the Seattle Municipal Code to require City Councilmembers to disclose financial interests in legislative matters under consideration by the City Council prior to participating in those matters, and creating a limited exception to the requirement that City Councilmembers disqualify themselves from participating in such matters.": [
        "'speaker_7': 'The Report of the Full Council Agenda Item one Constable 118701 relating to ethics code many sections for point 16.0 39.0 70 of the code to require City Council members to disclose financial interests in legislative matters under consideration by the City Council prior to participating in those matters and creating a limited exception to the requirement that City Council'",
        "'speaker_7': 'members disqualify themselves from participating in such matters. The committee recommends the bill pass. The bill was held until June 20th, 2016.'",
        "'speaker_1': 'Thank you very much. So I'll say a few words and I'm going to basically make a motion to refer it back to the committee. I want to thank all my colleagues who are sort of following this issue. This is legislation that was presented to us by the Seattle Ethics and Elections Committee to deal with financial interests among'",
        "'speaker_1': 'council members and how to proceed. And and we had a recommendation that came out of committee, came out of the commission, was passed by the committee. Councilmember Burgess raised some concerns. And many people are following the issue and raised, I think, some concerns that certain warrant more discussion.'",
        "'speaker_1': 'And so because of that I will move to refer council bill 118701 to the Education, Equity and Governance Committee. Like any other further comments. Councilmember Member Whereas.'",
        "'speaker_4': 'I correct me if I'm wrong here, I didn't vote in favor of this.'",
        "'speaker_1': 'Are you? Well, I will correct you if you're wrong. I thought you. I think you're wrong. No, and that was just a committee vote. Just committee vote, I think. Did you attend the committee?'",
        "'speaker_2': 'I didn't vote yes.'",
        "'speaker_1': 'Okay. So then the minutes of the committee might have been sort of a moot issue now, but will will.'",
        "'speaker_2': 'Today with the way.'",
        "'speaker_1': 'It was committee.'",
        "'speaker_4': 'The when did it get introduced.'",
        "'speaker_2': 'When why are you smiling like that? You know, luckily this is all videotaped. So if you go.'",
        "'speaker_7': 'Back and look at the recording, my recollection, Councilmember Suarez.'",
        "'speaker_2': 'Is that in the in the committee, when we originally considered this bill, it was all three voted in favor of recommending that it move out of committee.'",
        "'speaker_1': 'It was again, there were two pieces of legislation. One had to do with us considering doing the ethics work for the city of Kirkland. It was a renewal of a contract. And the other piece came from the committee.'",
        "'speaker_1': 'Both came from the commission dealing with what councilmember may do and looking at legislation. Had a good conversation, good discussion, but I thought it came out of committee unanimously. But like I said, it's sort of a moot issue because we're going to send it back to committee, have more discussion from from that point.'",
        "'speaker_1': 'But we can always go back and look at the committee vote. Any other further discussion has been moved in. Second, those in favor of referring the bill to the Education, Equity and Governance Committee, please vote i. I those opposed vote no.'",
        "'speaker_1': 'The motion carries the bill is referred. Please read the next matter into the record place.'"
    ],
    "AN ORDINANCE relating to City employment; authorizing the execution of a collective bargaining agreement between The City of Seattle and the Seattle Police Dispatchers Guild; and ratifying and confirming certain prior acts.": [
        "'speaker_7': 'Agenda Item two Constable 118706 Relating to city employment authorizing the execution of a collective bargaining agreement between the City of Seattle and the Seattle Police Dispatchers Guild and ratifying confirming certain prior acts.'",
        "'speaker_3': 'Councilmember Burgess, thank you. This first item, agenda item number two is approval of a collective bargaining agreement between the city and the Seattle Police Officers Dispatchers Guild. This unit represents approximately 100 city employees that work in the 911 communications center.'",
        "'speaker_3': 'The terms of the agreement call for this contract to last until December of 2018. The wage increases and other benefits are consistent with the parameters that were established by the Council's Labor Relations Committee. And the agreement gives the city the authority to introduce a new Tier two hour employee retirement system for those hired January 1st, 2017 and'",
        "'speaker_3': 'after.'",
        "'speaker_1': 'Thank you, Councilman Burgess. Are there any further questions you're hearing? Then I move to pass Council Bill 118706.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'Is moved and seconded to the bill. Pass any further comments? Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Burgess by Gonzalez Purple Juarez. Hi, O'Brien. Hi, Sergeant. I make sure there's a hero. I eight and favorite nana post.'",
        "'speaker_1': 'Please read the next agenda item, please. The bill passed and the chair will sign it.'",
        "'speaker_7': 'Agenda item three can 118707 relating to city employment, authorizing the execution of a collective bargaining agreement between the City of Seattle and Teamsters local union number 117 and ratifying confirmed research and prior tax cuts.'",
        "'speaker_3': 'Member Burgess Thank you. This is another collective bargaining agreement between the city and Teamsters Local Union. 117. This union represents approximately ten city employees who work as warehouse employees at the Police Evidence Unit. This agreement also runs through 2018.'",
        "'speaker_3': 'The wages and benefits are consistent with the parameters set by the Council's Labor Relations Committee, and this agreement also allows for the implementation of a second tier in the city's retirement system for employees hired after January 1st, 2017.'",
        "'speaker_1': 'Thank you, Councilmember. Are there any further comments? I move to pass Council Bill 118707.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'It's been moved in. Second, the bill pass. Any further discussion? Please call a roll on the passage of the Bill.'",
        "'speaker_2': 'Burgess.'",
        "'speaker_3': 'AI.'",
        "'speaker_2': 'Gonzalez Herbold Suarez O'Brien Swan Bakeshop. President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Eight in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passes and chair will sign it. Report of the Affordable Housing Neighborhoods and Finance Committee.'"
    ],
    "AN ORDINANCE relating to City employment commonly referred to as the First Quarter 2016 Employment Ordinance; establishing new titles and/or salaries; designating positions as exempt from Civil Service status; amending Sections 4.13.010, 4.20.160, 4.20.401, 4.20.440, 4.20.450, and 4.34.035 of the Seattle Municipal Code; and ratifying and confirming certain prior acts; all by a 2/3 vote of the City Council.": [
        "'speaker_7': 'The Report of the Affordable Housing Neighborhoods and Finance Committee. Agenda item number four Accountable 118 697 relating to city employment, commonly referred to as the first quarter 2016 Employment Ordinance establishing new titles and or salaries designated positions as exempt from civil service status.'",
        "'speaker_7': 'Amending Sections 4.13 point zero ten 4.20 point 160 4.401.4 40.4 51.0 35 zero. Mr. Cote and Raffone confirm research in prior acts by two thirds vote of the City Council. The committee recommends the bills passed.'",
        "'speaker_1': 'Councilmember Burgess.'",
        "'speaker_3': 'Thank you. This is the quarterly employment ordinance. We do this each quarter. It cleans up various aspects related to our civil service employees. Nine positions are exempted from civil service through this ordinance. We also change or rather establish a new title and a corresponding salary range for the Fire Protection Protection Engineer's Supervisor.'",
        "'speaker_3': 'And it changes the municipal code to eliminate outdated pay rates for various job classifications.'",
        "'speaker_1': 'Thank you for the any further comments. But please call the role on the passage of the bill.'",
        "'speaker_2': 'Burgess. Gonzalez Purple Juarez. O'BRIEN All right, so on big shot. President Harrell I eight in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passed and the chair will sign it. Next agenda item, please.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; accepting easements granted to the City of Seattle for installation, operation, and maintenance of watermains, a hydrant, water facilities, a master meter vault, and appurtenances necessary for water utility purposes at various locations in Seattle; placing the real property rights and interests conveyed by the easements under the jurisdiction of Seattle Public Utilities; and ratifying and confirming certain prior acts.": [
        "'speaker_7': 'The report of the Civil Rights, Utilities, Economic Development and Arts Committee Agenda Item five Constable 118 688 relating to Seattle Public Utilities, excepting easements granted to the city of Seattle for installation, operation and maintenance of water mains in hydrant water facilities, a master meter vault and apparatus necessary for water utility purposes at various locations in Seattle, placing'",
        "'speaker_7': 'the real property rights and interest conveyed by the easements under the jurisdiction of the Seattle Public Utilities and ratifying confirm research and prior acts. The committee recommends the bill pass.'",
        "'speaker_1': 'Thank you, Councilmember Herbold.'",
        "'speaker_7': 'Thank you. Council Bill 11 8688 authorizes SPU the partial or full acceptance of 12 separate water utility easements. When private property owners develop or improve their property, they are sometimes required to put SPU facilities on their private land and alternately, alternatively, espe may require that existing facilities be moved.'",
        "'speaker_7': 'These facilities can include storm or sewer lines, easements, easements, establish space rights to operate city facilities on private property and are acquired at no cost to the city.'",
        "'speaker_1': 'Are there any additional comments or concerns? Please call the role on the passage of the bill.'",
        "'speaker_2': 'BURGESS Gonzalez. HERBOLD Whereas. O'BRIEN So what I think Shire President Harrell.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Eight in favor and unopposed.'",
        "'speaker_1': 'Thank you. The bill passed and the chair will sign it. You could read the next agenda item, but you can shorten the description if you'd like.'"
    ],
    "AN ORDINANCE relating to Seattle Public Utilities; accepting easements granted to the City of Seattle for installation, operation and maintenance of storm drainage facilities, sewer facilities, sanitary sewer facilities, a pedestrian walkway, retaining wall, combined sewer facilities, pedestrian and vehicular access, storm detention drain facilities, stormwater runoff, storm water drainage facilities, outfall discharge pipeline, storm sewer drain facility and appurtenances necessary for drainage and wastewater utility purposes at various locations in Seattle and unincorporated King County, Washington; placing the property rights and interests conveyed by the easements under the jurisdiction of Seattle Public Utilities; and ratifying and confirming certain prior acts.": [
        "'speaker_7': 'Agenda item six Constable 118 689 relating to Seattle Public Utilities, excepting easements granted to the city of Seattle for installation operation maintenance of storm drainage facilities. The committee recommends the bill pass. Councilmember Herbold The previous bill was an easement or easements for water utilities.'",
        "'speaker_7': 'Council Bill 11 8689 authorizes SPU the partial or full acceptance of 46 drainage and wastewater utility easements. Similarly, these are easements that are required of property owners when they develop or improve their properties and the their requirements of SPU to be able to either move existing facilities or access new facilities.'",
        "'speaker_7': 'These again are at no cost to the city. And we are batching these ordinances both 1186, 89, 446 separate drainage and wastewater utility easements, as well as the previous ordinance of 12 separate water utility easements. And we're batching these in two separate ordinances in order to save time.'",
        "'speaker_1': 'Thank you, Councilmember Herbold. Any additional questions or concerns? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'BURGESS All right. GONZALEZ Purple Juarez. O'BRIEN So on. I beg your eye. President. Harrell All right. Aden favor and unopposed.'",
        "'speaker_1': 'Will pass and Cher will sign it. Should you would you want to read counts for her vote? Should we read seven through 13 all at once?'",
        "'speaker_7': 'Let's start with seven and eight.'",
        "'speaker_1': 'First District seven and eight into the agenda place.'"
    ],
    "AN ORDINANCE relating to the Department of Parks and Recreation; authorizing the Superintendent of Parks and Recreation to execute a five-year concession agreement with Gary Warhaftig, d/b/a Point of View Telescopes, to manage, maintain, and provide coin-operated telescopes at various City-owned park facilities.": [
        "'speaker_1': 'Please read the report.'",
        "'speaker_7': 'The Report of the Park Sales Center Libraries and Waterfront Committee Agenda Item 14 Council Bill 118 699 Relating to the Department of Parks and Recreation authorizing the Superintendent of Parks and Recreation to execute a five year concession agreement with Gary Leftwich, doing business as point of view telescope to manage, maintain and provide coin operated telescopes at various'",
        "'speaker_7': 'city owned park facilities. Committee recommends the bill pass.'",
        "'speaker_1': 'Councilmember Walrus.'",
        "'speaker_4': 'Thank you, Carl. Mr. President, the Department of Parks and Recreation has proposed new concession agreement with point of view telescopes to operate maintain the telescopes around the city. This park amenities is a small scale project that provides great connection to our beautiful city and natural skylines.'",
        "'speaker_4': 'The committee recommends passage of the bill.'",
        "'speaker_1': 'Thank you. Are there any comments or questions? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Burgess.'",
        "'speaker_3': 'You're. Excuse me. Hi.'",
        "'speaker_2': 'Gonzalez. Gonzalez, I Pearl Suarez. I hope where I am. So on. I beg your pardon? President Harrell high eight in favor and opposed.'",
        "'speaker_1': 'The bill passes and the chair will sign it. That concludes our business for the day. Is there any further business to come before the council? I see council member Brian Chan going up.'",
        "'speaker_3': 'I would ask to be excused from the full council meetings on June 27th and July 5th. Second.'",
        "'speaker_1': 'It's been moved in, signaled that Councilmember O'Brien be excused on June 27th and July 25th.'",
        "'speaker_3': 'Fifth.'",
        "'speaker_1': '25th.'",
        "'speaker_3': 'July 5th, July 5th.'",
        "'speaker_1': 'I'm sorry, July 5th.'",
        "'speaker_3': 'I can be gone on the 25th, if you like that also July.'",
        "'speaker_1': 'Are those in favor? It's been moved in second. And all those in favor say I. I opposed. The ayes have it and we have that recorded. Any other further business coming for the council? If not, we will stand adjourned.'",
        "'speaker_1': 'I do see your hand, Will. I'll talk to you after lying for we don't. You're not taking comments and I'll stick around to talk to you.'"
    ]
}