{
    "AN ORDINANCE related to funding for the Equitable Development Initiative and affordable housing; creating a fund for short-term rental tax revenue.": [
        "'speaker_1': 'The bill passed in show Senate. Please read the report of the Finance and Neighborhoods Committee.'",
        "'speaker_6': 'The Report of the Finance and Neighborhoods coverage and Item one Council Vote 119402 relating to funding for the Equitable Development Initiative and Affordable Housing. Creating a fund for short term rental tax revenue. The committee recommends the bill.'",
        "'speaker_4': 'Passed as amended.'",
        "'speaker_1': 'Councilman Bagshaw.'",
        "'speaker_3': 'Good. I'm going to pass this quickly over to Councilmember O'Brien, but just to let all know that this passed out of our committee unanimously last week, actually ten days ago, we had many meetings to discuss this opportunities for public comment.'",
        "'speaker_3': 'I want to say thank you to all of you who have been so steadfast and working with us and letting us know what your priorities are. Councilmember O'Brien has led this charge, and I would like to pass this over to you.'",
        "'speaker_3': 'If you would like to speak to it, just know that I appreciate so much the work that you're doing. It's incredibly critical to our community that we are funding all of these things, both the ones that the sweetened beverage tax is funding now and what we intended to fund and what we will fund going forward.'",
        "'speaker_3': 'So. Councilmember Brian.'",
        "'speaker_1': 'Councilmember Brian.'",
        "'speaker_7': 'Thank you. And Councilwoman, based on think for working with me on this. Colleagues, we've talked about this a lot, so I'll try to be brief. The short term rental tax, as originally intended, was dedicated to support at least the first $5 million a year Equitable Development Initiative during last year's budget cycle.'",
        "'speaker_7': 'About a million of that was in the proposed budget by the mayor, was diverted to fund staff resources for the EDA as opposed to grants reducing the grant amount to 4 million. We found a way to increase that to 5 million in the budget by using CDBG money.'",
        "'speaker_7': 'But I understand that that money is really challenging for these organizations to actually use. And so it was a noble effort in really tight circumstances last year, but it's not something that can be repeated and it's not clear that that money will be able to be used as intended.'",
        "'speaker_7': 'What this legislation would do would dedicate in this order the revenues of this the short term rental taxes. The first $5 million would go to grants for EDA projects. We know that there are dozens of applicants, qualified applicants each year for these programs and only a small handful get funded.'",
        "'speaker_7': 'There is no shortage of really good programs that could be funded if there were money available. The second tier would be 2200 of the proceeds, or 2.2 million of the proceeds would be directed to pay off debt for affordable housing projects.'",
        "'speaker_7': 'Bonds that were issued a few years ago. The next $3.3 million would be directed to support permanent supportive housing. The next $1,069,000 would be directed to support staffing and consultants for EDA program and then any money on top of that cumulative amount, which is about $11 million a little over that would go back to additional grant funds'",
        "'speaker_7': 'for the I.'",
        "'speaker_1': 'Thank you. Councilman Bryan, any other comments or questions?'",
        "'speaker_3': 'Councilman Beckstrom Just one comment. I want to appreciate the fact that you were willing to amend the document as you went forward. Councilmember O'Brien I think we've reached a good compromise, and I'm certainly going to continue to support this.'",
        "'speaker_1': 'You know the comments before we take the road, Councilwoman Pacheco.'",
        "'speaker_9': 'I have an amendment.'",
        "'speaker_1': 'I didn't realize it. I do apologize for that. I think that's for the sweetened beverage tax amendment. Do we have a bottom? Okay. Councilmember Checker, you have an amendment and and I have a hard copy of it. And I believe it was timely to have to suspend any rules.'",
        "'speaker_1': 'It was timely. Councilmember Pacheco, give the floor. Sure.'",
        "'speaker_9': 'So I move to amend Council Bill 11940 to ask for an Amendment one.'",
        "'speaker_3': 'I'll second it.'",
        "'speaker_1': 'Okay. Catherine Pacheco, it's been it's it's been moved in second. Can you explain what we have here? Sure.'",
        "'speaker_9': 'The amendment establishes that the surplus funds in 2020 would be directed towards EDA grants in 2021 and beyond. The financial policies would prioritize paying the debt service on bonds issued for affordable housing projects by directing the first 2.2 million for this purpose.'",
        "'speaker_9': 'The next 6 million in revenues to the Eli would go to Eli, including 5 million for 88 grants and 1 million for staffing and consultant services, and then direct the next 3.3 million to permanent supportive housing and direct any excess short term revenue taxes, revenues to ELI Grants.'",
        "'speaker_9': 'The proposal is consistent with the 2020 endorsed budget and would not result in any budget shortfalls unless revenues come in below what is projected for 2020. Just to provide additional thoughts. First, I'm supportive of the programs that this grant funds and the mission of this underlying legislation.'",
        "'speaker_9': 'This amendment just clearly states that any surplus funds in 2020 would be directed to support EDA grants in 2021. The full 5 million would go to the grants, which is what the desire of the communities that the community desire and any surplus funds would also increase that dollar amount.'",
        "'speaker_9': 'My intent on introducing this amendment is to follow through with the plans made last year to fund the support required to carry out these grants. Given that this is my first budget session in my approach to the budget is to give us the flexibility we need to the important services we all care about and know that our'",
        "'speaker_9': 'community needs. I have inherited an endorsed budget and a series of decisions that have resulted in the complicated situation we're in. This amendment is about making communities whole in a manner that balances our fiduciary responsibility, our endorsed budget, and puts us on a path councilmember compliant intent in the underlying legislation.'",
        "'speaker_9': 'This amendment is about giving us the time to make sure that the program is whole for 2020, while still supporting the underlying financial policies beginning in 2021.'",
        "'speaker_1': 'Thank you, Councilmember Pacheco. I'm going to ask the speaker of the Bass legislation to speak on it. Councilmember O'Brien.'",
        "'speaker_7': 'Thank you, Councilmember Pacheco and Council President Harrell. I oppose this amendment. What this would do would be to defer the restoration of the full $5 million for an additional year, and I don't think that's acceptable. The demand for actual development investments right now is significant and will almost certainly continue to grow.'",
        "'speaker_7': 'Again, as I mentioned earlier, we found a what we hoped would be a workaround in last year's budget. But I know that the community organizations have struggled to take advantage of that. And I think the most appropriate thing to do is to be responsive to the I grant applicants who have been here today and in past meetings'",
        "'speaker_7': 'who want to see us stand up to the original commitment of $5 million a year, granted. So I'll be opposing this amendment.'",
        "'speaker_1': 'Okay. So we have. Councilmember Becerra.'",
        "'speaker_3': 'I want to say thank you. Councilmember Pacheco, as your budget chair, I am delighted to have the support of keeping things going in the direction that we endorsed last year. That said, I'm not going to be supporting this amendment in large part because of what we talked about at my committee ten days ago.'",
        "'speaker_3': 'Councilmember O'Brien, I really respect the fact that you were willing to work with me on a compromise, and I'm going to follow through with that agreement.'",
        "'speaker_1': 'Very good. Now, this is just for the amendment. Any other discussion on the amendment, and I'll just share in closing that I'm not supporting the amendment. Thank you for bringing it and having a transparent conversation. In my mind, this equitable development initiative and the investments we're making are absolutely critical for preserving cultures and communities that are vital'",
        "'speaker_1': 'to our city, many of whom are are priced out through historical practices of racism and discrimination, are finding challenges even more increasing with a president we have in this country. And these investments are urgent and we should treat them as such.'",
        "'speaker_1': 'And so I'm ready to support both this and a sweetened beverage tax as we move forward. In simple terms. So I won't be supporting the amendment, so we're just going to vote in the amendment. So having said that, all those in favor of the amendment, please say I and raise your hand.'",
        "'speaker_6': 'I Oh, I'm sorry. I'm sorry.'",
        "'speaker_1': 'That was one and a half. No. Okay. I believe it's one vote. All those opposed. Say no and raise your hand. No. Okay. So the amendment fails. So now we have the base legislation with the it'II in place.'",
        "'speaker_1': 'Councilmember O'Brien, did you need to see any more words or are we ready for a vote?'",
        "'speaker_7': 'I'm ready.'",
        "'speaker_1': 'Did anyone else need to close on this or. I'm going to call for a vote. CHEERING No hands. Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Must get up.'",
        "'speaker_6': 'Now. I'll say I.'",
        "'speaker_2': 'O'Brien. All right, let's go now. So what? I think John Gonzalez, purple. President Harrell, I. Seven in favor.'",
        "'speaker_1': 'One opposed, the bill passes and the chair will sign it. Please read the next edition item into the record.'"
    ],
    "AN ORDINANCE related to creating a fund for Sweetened Beverage Tax revenues; adding a new Section 5.53.055 to the Seattle Municipal Code; and providing additional guidelines for expending proceeds.": [
        "'speaker_6': 'Agenda item to cancel 119551 relating to creating a fund for sweetened beverages tax revenues. Adding a new section 5.50 3.0 55 to the settlement of code and providing additional guidelines for expanding proceedings. Proceeds excuse me. Committee recommends the bill passes amended.'",
        "'speaker_1': 'But actually I turn over to you first.'",
        "'speaker_3': 'Okay. Well, I believe that we have been speaking about this for the better part of an hour. And again, this was the item that Councilmember O'Brien allowed me to share in my committee about the sweetened beverage tax and how we are going to be spending that money.'",
        "'speaker_3': 'I just want to articulate from the get go, there isn't a single thing that either the small the sweetened beverage tax as intended would fund or as we had funded through the general fund. We're going to have to find a way to support all of these investments.'",
        "'speaker_3': 'But in the in the immediate time. Councilmember O'Brien, would you like to speak to it?'",
        "'speaker_7': 'I would, if that's okay.'",
        "'speaker_1': 'Council President Castro O'BRIEN Please.'",
        "'speaker_7': 'Thank you. Customer Base. I thank you again on this one, too, for finding the time in your committee and to work with me through this colleagues in public, we've talked about this in quite some length. My goal here is to commit to the original intent of the sweetened beverage tax.'",
        "'speaker_7': 'Community members we know are of low income community members and communities of color are disproportionately affected by this tax, and they are also disproportionately affected by the negative health health outcomes of consuming sweetened beverage. That's because of specific marketing efforts by soda companies and also because of ability to live in communities that don't.'",
        "'speaker_7': 'The reality that many low income people live in communities that don't have access to healthy food, whether it's not affordable or simply not even available in their community. And so the original policy intent of this was not to raise revenue, but rather to address the public health concerns, and thus there is a tax component of that that'",
        "'speaker_7': 'will raise some revenue. But it was critically important, has been and continues to be that those investments continue to go back to support access to healthy food and other investments like early education for folks in those communities. This will create a dedicated fund so that all revenues from this will go into that fund.'",
        "'speaker_7': 'That will make it easier for us all to track down exactly how much revenue is raised and where it goes. And it gives very explicit guidelines that this money is to be spent on certain priorities and not to displace other funds, but to be additive to existing general fund programs that underlie that.'",
        "'speaker_7': 'I want to also thank all the people who came out and testified, many who are still here, some who left last week. There was a lot of conversation about what this means. If we were to pass this, it certainly would mean that we would rededicate these fundings or that's the intent to the programs provided.'",
        "'speaker_7': 'That includes a variety of food programs that we heard from the mayor's office or at least department heads, that other certain programs would be cut. And I want to be clear that when the budget comes to us, we'll see what the mayor proposes.'",
        "'speaker_7': 'But the city council will have its process almost two months long in figuring out where to prioritize. And I will tell you that my commitment again this year, for the 10th year in a row will be that we're not cutting other human services programs because those are a top priority for me.'",
        "'speaker_7': 'We should dedicate this money as intended to sweetened beverage tax, and we should also continue to fund fully fund human services. And if the mayor sends a budget that does Perdue provide cuts to that, I will work as hard as I can with my colleagues to restore and potentially increase funding for human services.'",
        "'speaker_7': 'Council President. There are a series of amendments. I am sponsoring the first one and I'm supportive of the next two. And so if it's okay to move forward to amendments, I'd like to propose my First Amendment.'",
        "'speaker_1': 'Yeah, let's just walk through the amendments. Take the first one, please.'",
        "'speaker_7': 'So I move to amend council bill 119551 is presented in Amendment 1/2.'",
        "'speaker_1': 'Removed and second and.'",
        "'speaker_7': 'This is simply a clarifying amendment. Council central staff looked at some of the language that would add language that says revenues may be used to maintain program expansions and new programs in accordance with subsection 5.53.055. B. The the specificity is around central staff, recognizing that it may not have been clear in the original legislation that would allow'",
        "'speaker_7': 'that to happen. This doesn't change any of the intent that we've discussed. It just clarifies what we define it.'",
        "'speaker_1': 'Very good. This is the amendment only any other discussions on the amendment? All those in favor of amended amendment. Number one, please say I. I opposed the First Amendment passes. I believe Councilmember Herbold has amendment number two.'",
        "'speaker_4': 'Thank you. I am moved to amend Council Bill 11 9551 as presented an amendment to the second.'",
        "'speaker_1': 'Please proceed.'",
        "'speaker_4': 'Thank you. So this amendment is.'",
        "'speaker_2': 'Intended to.'",
        "'speaker_4': 'Provide some reassurance to community members, service providers, and also to express our.'",
        "'speaker_5': 'Hope.'",
        "'speaker_4': 'For the budget that the mayor proposes to us in September and our commitment to address issues of concern related to other funding for other programs if that budget does not come to us as we expect it. So the amendment itself states that the legislation is not intended to reduce funding for any impacted programs, and the Executive and'",
        "'speaker_4': 'Council are expected to identify other funding sources to maintain full funding for these programs.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'The amendment only. Any of the questions or comments on Councilmember Herbold amendment going back to.'",
        "'speaker_3': 'Councilmember Herbold, thank you for bringing this and also thank you for adding the ad council there. I thought I felt it was really important to demonstrate both to the community and to the executive that we're in this soup together.'",
        "'speaker_3': 'So I'm certainly going to be supporting it.'",
        "'speaker_1': 'Thank you to the amendment only. All those in favor of amendment number two. Please say I. I opposed oppose. The ayes have it. The amendment to passes leave council member Gonzalez has a third amendment.'",
        "'speaker_4': 'I do thank you. Council President Harrell. I move to amend Council Bill 119551 as reflected in Amendment three. Can elaborate thank you so much. So this is an amendment that would once again further clarify and address some of the concerns we heard from some of our service providers who work in the prenatal space and provide prenatal services'",
        "'speaker_4': '. We heard from a few of those individuals today during public testimony, but we also had an opportunity. My office had an opportunity to have direct conversations with some of those service providers who pointed out that some of the mandatory language that we included in our First Amendment related to expansion of services in this space of 0 to'",
        "'speaker_4': '3, may or could be read to exclude funding that we currently provide for prenatal services that would primarily be around our nursing home program, for example. So I have clarified the language by striking the word birth and including prenatal to ensure that we're covering the full spectrum of existing and intended services to be funded in the future'",
        "'speaker_4': '. And that would include those home visiting programs that I just mentioned in addition to child care assistance programs and parent child plus programs as well.'",
        "'speaker_3': 'Thank you for doing that.'",
        "'speaker_1': 'Councilmember Actually, do you want to come in officially.'",
        "'speaker_8': 'Instead of under my breath?'",
        "'speaker_3': 'And thank you for doing that, for including the prenatal. It's very important, as you well know.'",
        "'speaker_1': 'And I those. Thanks. Thank you, Catherine Gosar, any other comments or you should have some comments here. But, you know.'",
        "'speaker_6': 'We are.'",
        "'speaker_1': 'All okay.'",
        "'speaker_6': 'Oh, prenatal.'",
        "'speaker_9': 'Care.'",
        "'speaker_1': 'Okay. All those in favor of amendment number three. Please say I oppose. The ayes have it. And we have a Fourth Amendment I think will be advanced by Councilmember Pacheco.'",
        "'speaker_9': 'I moved to a Land Council bill 119551 as president and then 4/2.'",
        "'speaker_1': 'And moved to second. Please, please elaborate.'",
        "'speaker_9': 'On what change the proposed financial policies and council bill 119551 prohibiting the use of the sweetened beverage tax revenues to supplement other funding sources beginning on the effective date of the ordinance. This amendment would require that any unallocated surplus SVT revenues be used for expanding existing or creating new programs, including program cost increases in accordance with the'",
        "'speaker_9': 'statute. This would accept the use of SVT proceeds to supplement general fund moneys in the adopted 2019 and endorsed 2020 budgets, but ensure that unallocated surplus revenue in these years is used to expand existing or create new programs in accordance with the statute beginning in 2021.'",
        "'speaker_9': 'The amendment would require that all SVT revenues be used only for expanding or creating new revenues. New programs including program cost increases in accordance with the statute line. The Council of the Mayor. More time to create to either create additional revenue sources and or reprioritize appropriations to undo the fund swaps.'",
        "'speaker_9': 'I also want to thank the community members that are here for taking the time to engage on this issue. I have been personally benefited from many of the early learning services and food banks, and these programs are very much personal to me, and I want you all to know how much I am with you.'",
        "'speaker_9': 'Second, I am saddened that this conversation has shifted to pitting programs against each other and when in reality, this is a conversation how we fund these crucial community programs. Now, if we find them, tensions are particularly high around this legislation and the issue of revenue sources generally.'",
        "'speaker_9': 'I want us all to take a step back from the finger pointing and acknowledge that we all support the broader community need for these programs and these critical programs. They should not fall in the middle of internal city disagreements.'",
        "'speaker_9': 'Where we currently differ is in the approach we think is the most responsible way to budget for these programs. Personally, the path to restore and make the communities most impacted here is to have these financial policies take effect in the 2021 budget.'",
        "'speaker_9': 'It simply gives us more time to identify where the money will come from to fund the programs currently receiving SBC, SBT dollars. I want to thank my colleague. Councilmember backs off originally introducing the amendment that added this kind of flexibility which I supported in committee.'",
        "'speaker_9': 'Unfortunately, we didn't arrive at this decision point overnight. It is for this reason that I am seeking an amendment that provides a path for us to fulfill the intent of Councilmember O'Brien. I don't want to tie our hands before a budget season that I know will be a difficult one.'",
        "'speaker_9': 'This amendment reflects my desire to have some flexibility going into that process, to not make commitments before we identified solid revenue streams to back up our legislative goals. So again, I strongly support this legislation and intent. I just want to see us carry it without preemptively tying our hands about funding for other programs we all care about'",
        "'speaker_9': '. Lastly. The city and how we got to this point owes the community organizations that have been impacted by the decisions. We've made an apology, and I want to express my deepest sincerity and apologizing for the decisions that have led to this point and the conversations that have escalated in the last few days.'",
        "'speaker_9': 'You all deserve an apology. And so for that, I want to say sorry. I am asking I am pleading my colleagues to support my amendment so that we can move forward in the most responsible manner. Please.'",
        "'speaker_1': 'So we have a motion that's been second it and he even said, please. So Councilmember Beck shows you'd like to speak to the motion.'",
        "'speaker_3': 'I would. Thank you. Councilmember Pacheco, it's not too difficult to know which way the wind is blowing on this amendment, but nonetheless, I would like to speak to it, and I'm speaking as your budget chair here. I'm concerned about a couple of things, Violet, by the way, you're right in your conclusion.'",
        "'speaker_3': 'But in the meantime, I have concerns about binding future councils by tightening down how we spend the money. I also want to acknowledge that, like Councilmember Pacheco, I have been deeply concerned over the last couple of weeks at what I consider to be a really vituperative dialog and a misunderstanding between people that service people that are providers'",
        "'speaker_3': ', the executive in this council. But first and foremost, I want to acknowledge Councilmember O'Brien and all of us who have been at this table. I believe the intentions are good. What I see as a conflict is that last year during our budget, we made some agreements about how we were going to spend the money both in 2019'",
        "'speaker_3': 'and in 2020. And those endorsed that endorsed budget, I think is really important. But it now brings us here and I want us to stop this fighting, acknowledge what the good intentions were when the sweetened beverage tax was first passed.'",
        "'speaker_3': 'And I also want to acknowledge Kirstjen aerostat standing back there against the wall that you and I are going to have to start off and my colleagues are going to have to figure out where we're going to find $6 million worth of cuts in order to continue the programs going forward for 2020.'",
        "'speaker_3': 'But we will do that and I believe that are our good efforts. Now we will figure out a way to invest in the programs that are now being paid for in Human Services Department Deal and AOC by the sweetened beverage tax that now was supplanted.'",
        "'speaker_3': 'And we will have to find other general funds money but to make it clear. As Budget Chair, even though I believe it's the wisest thing to stay the course, I am going to support Councilmember Pacheco's amendment here. I have a pretty good sense of when this is going to come out and when it comes time to vote'",
        "'speaker_3': '. I'll be voting yes for the underlying bill.'",
        "'speaker_1': 'Thank you very much. We are voting just on the amendment yet we have a few more speakers. I saw council member herbals hand go up first.'",
        "'speaker_4': 'Well, I just wanted to clarify that the need for the council to find cuts during the budget process will only be if the mayor proposes a budget without funding for these programs through as as we all voted for in Amendment two as far as our.'",
        "'speaker_8': 'Our.'",
        "'speaker_4': 'Our intention as a council, in our hopes for the executive intention. So I am hoping that we do not have to find a find fund for cuts to repair the mayor's budget. And I just see this again. I see this as much like much like the budget.'",
        "'speaker_4': 'I mean, much like the action we took last week on the cost of living legislation. It's, it's pre-budget work and it's us choosing to tie our hands on some decisions that.'",
        "'speaker_6': 'We intend to make during the budget process.'",
        "'speaker_4': 'And to.'",
        "'speaker_5': 'Allow.'",
        "'speaker_4': 'Supplant supplanting of general funds in the 2020 budget would.'",
        "'speaker_6': 'Would go.'",
        "'speaker_4': 'Against our prior statements for what we intended to do and that we've voted on several times now. So I think this is really consistent with.'",
        "'speaker_8': 'Prior.'",
        "'speaker_4': 'Budget actions that we've taken. And it's it is not irresponsible. It is actually fiscally responsible for us to be making this commitment to the public for how we are intending to make our future budget decisions in just a couple of months.'",
        "'speaker_1': 'Thank you, Councilmember Herbold. I'll let you have the final word since this year. Motion. I'll ask Councilmember O'Brien to speak now.'",
        "'speaker_7': 'Thank you. I will be opposing this amendment as it would serve to potentially delay the standing up to the true original intent of the sweetened beverage tax and potentially allow for up to $6 million next in next year's budget to once again be diverted to other programs outside the intent of this.'",
        "'speaker_7': 'I think it's critical that we honor that intent. This is not the last time that we will have a tax do we work with community on and their expectations and what we do with that tax is critically important that we stand with what we tell them we're going to do so that we can continue to make good'",
        "'speaker_7': ', sound policy going forward. I also want to speak to I think Councilmember Herbold put it very well. This we are intentionally tying our hands. This is making a clear policy statement that this money should be off limits except for the stated purposes.'",
        "'speaker_7': 'I was disappointed to see attempts to divide the community and I was really grateful. It's so many community members coming out today on relatively short notice to speak. Whether they are recipients of this or would not be recipients or perhaps their funding might be threatened because of some of the claims to say that we're not going to'",
        "'speaker_7': 'divide low income communities and communities of color and turn against each other, but we're going to stand in solidarity. What happens next if this passes? Well, if this amendment fails and the underlying legislation passes, we will see a budget from the mayor in about two months.'",
        "'speaker_7': 'And I want to be clear that that budget will be the statement of the mayor's priorities. It will be over $1,000,000,000 in general fund money that she can allocate how she chooses in the proposed budget. We're saying this $6 million that we're discussing, which is less than a fraction of 1% of the general fund budget, is off'",
        "'speaker_7': 'limits for other needs. But that leaves over 99% of the other general fund budget to list your priorities. If at the end of the day, that mayor says. The mayor says that the lowest priority that she needs to cut is some of the human service projects that she talked about last week.'",
        "'speaker_7': 'I can tell you that I am committed to not do that and to continue to restore those funds. So, colleagues, I will be opposing this amendment and I, I hope you'll join me in opposition to it.'",
        "'speaker_1': 'Councilman Brown. Councilmember Swan.'",
        "'speaker_3': 'I will be opposing this amendment also. And I just wanted to say very clearly, first of all, the $6 million that we're talking about, yes, it's a very small fraction of the total city's total budget. But also, it it's it's something that we didn't expect we would have because the sweetened beverage tax has raised more revenue than'",
        "'speaker_3': 'it was than we had projected for. But let's go back to the original intent of the tax. It was not meant as a revenue generator. It was meant as a mechanism to eventually have the funds be flowing back to the communities that are, unfortunately, because of their economic and marginalized circumstances, are having to make, you know, having'",
        "'speaker_3': 'to consume foods and beverages that are not good for your health. But the intent of this tax was never to penalize the communities that are facing these unfortunate choices. The intent of the tax was to make their lives better.'",
        "'speaker_3': 'And so when you have when the city has 6 million extra dollars, then those dollars should go back to making their lives better as part of the original intent. And I have to say, I've heard Councilmember Bagshaw use our position as the current budget chair.'",
        "'speaker_3': 'You know, the budget chairmanship rotates, but the budget chair is one of the council members who as an as a council, we have to make a collective decision on the budget. And I don't accept that as a budget chair this this false idea of fiscal responsibility.'",
        "'speaker_3': 'We all have a responsibility to make sure that the budget passes by charter. The budget has to be balanced, but that does not absolve us as the highest elected body of the city to find progressive revenues. And if Councilmember Baxter is so concerned about revenues, then she should not have voted against the Amazon tax and for the'",
        "'speaker_3': 'repeal. And I would urge that all council members who feel that we don't have enough revenues, well, let's make sure that this year the budget has more progressive revenues, not fewer. Council members want you bring this up all the time.'",
        "'speaker_3': 'And I would like to point out that on May 31st, 2017, you voted against this and I voted for it. So it seems a little hypocritical. No hypocritical at all. I did vote against it and the community knows why I voted against it.'",
        "'speaker_3': 'And I'm going to bring those points up when we talk about the legislation itself. I think it is hypocritical of council members to vote for the Amazon tax repeal, vote against every progressive revenue measure that we have brought to the City Council in the last couple of years with the people's budget movement and then say that, well'",
        "'speaker_3': ', we don't have enough money, we're going to put paid programs against programs and all our good programs.'",
        "'speaker_1': 'So I'll I'll come back to this exchange in my closing remarks during the Bass legislation, as much fun as we're having here. Councilmember Pacheco, can you close us out on the amendment only, sir?'",
        "'speaker_9': 'Sure. This conversation started long before I joined the Council with the passage of the sweetened beverage tax in 2017 and the budget actions taken last year. It would also inevitably continue well beyond my time on the Council. I support the goal of this legislation to establish a set, a separate fund for the sweetened beverage tax so that'",
        "'speaker_9': 'we keep the promises we made as a city when we passed this tax. I think that the conflict we find ourselves in today is the result of several unfortunate actions taken in the past. We all share some blame, and I don't think people in Seattle want us to point fingers and play a blame game.'",
        "'speaker_9': 'They want us to get good things done. While I support the goal of this legislation, I think we must get there responsibly. This council voted to approve the 2020 endorsed budget and I do not think we should throw a wrench into that budget at the last minute.'",
        "'speaker_9': 'Community organizations that rely on SBT funding budgeted with the 2020 endorsed budget in mind. While we intend to backfill their funding in this legislation passes, the uncertainty introduced by this process is regrettable. I am asking that we get there and do so in a responsible manner that I think would best, most benefit the people of Seattle.'",
        "'speaker_9': 'The community organizations here today, as well as lead us in a path that is the most responsible way.'",
        "'speaker_1': 'Okay. So there's the amendment that's been moved. And second, I'm going to call for the vote. This is just for the amendment. All those in favor of amendment number four is advanced by Councilmember Chicco. Please say I and raise your hand.'",
        "'speaker_1': 'All those opposed. Say no and raise your hand. Nope. So that motion fails. And so now we have a base legislation that has been amended with three successful amendments. And Councilmember O'Brien, did you want to say a few more words about it?'",
        "'speaker_1': 'I emphasize the word few, but this is important legislation, so go at it.'",
        "'speaker_7': 'I just want to thank community members who have been so active in this. This was not an easy policy in the first place. A couple of years ago, you had to do a lot of work to help us get the policy right and working with community members.'",
        "'speaker_7': 'And I apologize that you have continued to have to come back and work with us on this. You spend a lot of time, especially in the last couple of months, and likely you'll probably have to spend some time during the budget making sure we still get it right.'",
        "'speaker_7': 'And that's all the time that we're taking away from conversation with community members to have healthy access to food. And so I apologize that I'm grateful for your advocacy. I hope through this effort, the solidarity we've seen in community today will help strengthen the organizations and will come out of this stronger than ever before.'",
        "'speaker_1': 'Thank you. Cast member Brian. Councilmember Swan.'",
        "'speaker_3': 'Thank you. President Harrell As Councilmember accurately pointed out, I did vote against the sweetened beverage tax and I made it clear at that time to all community members that I voted no because it is a regressive tax that falls disproportionately on the shoulders of poor and working class people, especially low income people of color.'",
        "'speaker_3': 'But as community members have mentioned repeatedly, the regressive nature of the tax can be mitigated if the revenues collected by the task tax find our way back to the lives of the people who are having to pay the tax in the first place.'",
        "'speaker_3': 'So in other words, that's the intent of the legislation today to make sure that whatever revenues are raised through the tax, go back to the communities that are impacted. To be clear, today's legislation is about how those revenues are used and not whether the tax should be in place.'",
        "'speaker_3': 'That tax is already in place. We are not relitigating that matter here. So I will be voting yes on this council bill because it will help ensure that the funds from this tax are used to support the communities who are overwhelmingly paying for the tax.'",
        "'speaker_3': 'However, I think we have to have a caution in our understanding. A legislation like this one by itself cannot necessarily succeed in mandating that the mayor's office do the right thing when it comes to the budget. The mayor can always reduce the funding from the general fund going into programs that are funded with a sweetened beverage tax'",
        "'speaker_3': 'like she did last year. The only way to really prevent that from happening is for community members to stay engaged and build a movement during the budget season, which comes in the autumn. So our work will not be done.'",
        "'speaker_3': 'I hope everybody understands that we will need to mobilize and and get organized for the budget. And I invite everybody to be part of the people's budget movement that has had a tremendous record of successes in holding the budget process accountable.'",
        "'speaker_3': 'It is totally unacceptable the way that Mayor Durkan has implied to social service organizations that their funding would be cut if they did not oppose or speak in opposition to today's legislation. And I congratulate all the community members and organizations for your courage in standing up to that pressure and also importantly, rejecting, as Violet and others have'",
        "'speaker_3': 'said, that rejecting a cynical attempt to divide marginalized communities. We should always reject this kind of divide and rule. And this is classic divide and rule. The reality is that these. Missions are being paused because, you know, like the question about what happens with the small amount of revenue generated by the sweetened beverage tax.'",
        "'speaker_3': 'What it demonstrates is the fundamental problem that social services are chronically, grossly underfunded across the board because the city has not made sure that big business and the super wealthy pay their fair share of taxes. That has not happened.'",
        "'speaker_3': 'That is why we keep revisiting this question. And always the question is posed as which programs to fund as opposed to other programs that are equally good, rather than making sure that all the needs of society in the city are funded.'",
        "'speaker_3': 'Because these are people's lives we are talking about. If Mayor Durkan was truly concerned about the funding that might not be available without the $6 million that she wants to go after, then she should not have repealed the Amazon tax.'",
        "'speaker_3': 'In fact, go to war against the city in order to repeal it because it was a one concrete legal measure through which big business could have been taxed. And as Gary Mooney pointed out, King County has 14 billionaires from 27 statistics.'",
        "'speaker_3': 'There are 68,000 millionaires. I'm sure the number of millionaires has grown as as as as just as a number of the people who are facing problems has also grown. So, you know, there are many ways that the mayor could actually design the budget in such a way that all programs are fully funded.'",
        "'speaker_3': 'She could, you know, promote progressive revenue, new progressive revenues. She could stop the sweeps and use of homeless people and use the $10 million that I spend on the sweeps every year and find 10 million is greater than 6 million.'",
        "'speaker_3': 'Why go after the sweetened beverage tax revenues in order to supposedly in order to fund some programs, end the sweeps. Stop the sweeps and make sure those $10 million are used for programs that we know work. In fact, just earlier today, we heard from the Human Services Department yet again that they do not have one iota of'",
        "'speaker_3': 'data to show that the sweeps of homeless people are doing any good. But we have ample evidence of the harm they create. And in the people's budget movement last year, my office proposed using that funding for housing instead.'",
        "'speaker_3': 'That did not pass. Again, the question is posed. Mayor Durkan tightens to cut funding for food and education programs, as she has, you know, promised to do so. Then we will need to build the people's budget movement to stop the sweeps to restore that funding.'",
        "'speaker_3': 'I will be voting yes on this bill to spend, to use or invest the SBT revenues on food access and education programs. And my office will continue fighting to make sure that progressive revenues are expanded so that all the necessary needs of society are funded.'",
        "'speaker_3': 'And I really reject the efforts of the mayor to pit one program against the other.'",
        "'speaker_1': 'Thank you. Catherine Swann. Any other comments or questions? Councilmember Mosquito.'",
        "'speaker_6': 'Thank you very much, Mr. President. I want to again thank the prime sponsor of this legislation for moving forward on the commitment we made in the budget last year to make sure that we did wall off this specific funding for the specific intent as we committed to the voters last year.'",
        "'speaker_6': 'I, too, am disappointed, disappointed by the language that's been used to create unnecessary and manufactured crises among some of our most vulnerable organizations. Sorry, our organizations who serve the most vulnerable. I think that the information that has been put out there has caused concern and deep anxiety among folks.'",
        "'speaker_6': 'And I hope what you heard today was clarification. Clarification that we can do both and we can both create a walled off set of funds that come in from the sugary sweetened beverage tax and continue to mean or maintain our commitments to these very organizations that are providing early learning and food access programs.'",
        "'speaker_6': 'I know that we have expressed multiple times today, but I want to underscore the intent of the ordinance, as outlined, was meant to be used to fund the expansion of existing programs and the creation of additional programs for outreach and education, for nutrition and early learning programs, not to replace the general fund that provided the baseline funding'",
        "'speaker_6': 'for these very critical programs. And so we know we can do both and expand the critical services and protect the funding that was always provided through the general fund. The city does face tremendous needs. We talk about it every day from housing affordability and homeless issues, from the crisis of equity in terms of access to economic stability'",
        "'speaker_6': 'and early learning needs. We need to be intentional about how we invest our public dollars. We need to make sure that we're not in a situation where we're robbing Peter to pay Paul, and especially in one of the most prosperous cities in the country.'",
        "'speaker_6': 'We need to not engage in us in austerity budget, not an austerity budget, when we have robust opportunities to identify funding, to go into early learning and food access programs. I want to thank some of the incredible speakers who've come forward today and the multiple emails we've received.'",
        "'speaker_6': 'And to also underscore what my council colleagues have said and what the Budget Chair has said, we can both invest in early learning and food access programs and maintain the integrity of the sweetened, sugar sweetened beverage tax. And I think it's been said are already up here on the dais.'",
        "'speaker_6': 'But it bears repeating that the reason that I think that it is important for us to maintain funding, to go into especially prevention and education programs as was promised in the sugar sweetened beverage, is to reduce consumption of soda, to reduce the consumption of this toxic product that is intentionally being marketed, especially to our black and brown'",
        "'speaker_6': 'communities, intentionally being targeted to our lowest wage workers. We want consumption of soda and sugary sweetened beverages to go down, and in order to do so, we need those funds to go into education and prevention programs in nutrition, to promote healthy eating, to ensure that our local convenience stores have access to fruits and vegetables and not just'",
        "'speaker_6': 'unhealthy food. And to make sure that our earliest learners and their families have the support they need. That was the intent of the sugary sweetened beverage tax. And today we're reaffirming that commitment that you all wanted in the initial language that was passed by the council, by by voters, by the council that was supported overwhelmingly.'",
        "'speaker_6': 'We want to make sure that this is a true commitment that we're keeping to the voters. So I'm really excited that we have the language that was included and proud to be a co-sponsor with Councilmember Herbold O'Brien and Gonzalez.'",
        "'speaker_6': 'To make it crystal clear that the legislation is not intended to reduce any from any programs currently funded with the with the sugar sweetened beverage tax, and that we will redouble our effort. Council members somewhat want mentioned it is every one of our responsibility when it comes to budget to make sure that these programs are kept whole'",
        "'speaker_6': 'in the budget. I reaffirmed that commitment for myself to you. I hope that the full council supports this underlying bill so that we can continue to work towards creating the both and approach. And it's so early, it's mid-July.'",
        "'speaker_6': 'We have plenty of time to continue to work on that. I appreciate all of the work that you all have put forward today in the effort to support the sugary sweetened beverage tax initial intent and to make sure that we keep these other programs whole so that we don't unnecessarily create additional angst and confusion in the community'",
        "'speaker_6': '. We stand with you in the desire to make sure all of these programs are served. Thank you again for moving forward this legislation so we can fulfill our commitment to you.'",
        "'speaker_1': 'Thank you. Comments from a skater. No questions or comments or good customer record sales. Okay. Customer Good.'",
        "'speaker_4': 'So I'll keep it brief because I know we're on agenda item two. I too, want to thank many of the community organizations who've been working on this particular bill, but more importantly, who've been working on the greater effort around getting the sweetened beverage tax passed in the first place.'",
        "'speaker_4': 'And I feel it's really important for us to anchor this conversation in the commitments that we had originally made way back when in 2017, when we first considered this this legislation to enable this tax to be levied against the people who consume sweet beverages in our city.'",
        "'speaker_4': 'And back then, one of the things that we we debated ad nauseum was whether or not we were passing a piece of legislation that created a new revenue stream for the sake of producing a new revenue stream, meaning that we could use the money for whatever purpose we wanted to, or if we were really committed to investing'",
        "'speaker_4': 'these dollars back into communities who were being disproportionately and negatively impacted by the soda industry, that in a manner that was so detrimental to our community's health and and safety. And and really, you know, I just want to go back to that period of time and remind folks that we have that debate and that.'",
        "'speaker_4': 'And in the course of that debate, we concluded that it was important for us not to create a revenue stream for the sake of revenue that really what we wanted to do is have a mechanism to collect additional revenue that we could directly reinvest back into low income communities and communities of color that would eventually interrupt the'",
        "'speaker_4': 'cycle of soda companies taking extreme advantage of our communities by targeting us for sugary beverage consumption, and that it was important for us to make sure that we tied the investments back to that purpose. So today for me is a follow through on that commitment.'",
        "'speaker_4': 'And the only apology I'm going to give to the community is that we didn't catch this when we first passed it in 2017, because it's always been our intent to have this type of dedicated revenue stream for these communities in particular.'",
        "'speaker_4': 'And so to those of you who have that expectation, it was an appropriate expectation. And we should have included this language in 2017 as part of the original legislation. But I don't think that those of us who are sitting up here now, who were there in 2017 imagined a world in which we would be put in this'",
        "'speaker_4': 'unfortunate situation of manufactured division among communities of color and low income communities, and frankly, the pumping out of terribly inaccurate information that has really resulted in creating a tremendous amount of fear among community based organizations who have very limited resources to begin with.'",
        "'speaker_4': 'And all the minutes that you have spent in these chambers to advocate for us to do the things we should have done in 2017, could actually have been spent right now serving vulnerable communities in the city of Seattle.'",
        "'speaker_4': 'And so that is a massive regret that we have to do this. But I feel very strongly that we need to continue to support this, this bill that has been introduced by Councilmember O'Brien. I think the intent is a follow through of the original intent.'",
        "'speaker_4': 'And I really want to appreciate Councilmember O'Brien's leadership in this space and do see it as an opportunity for the city council to be transparent and to follow through on commitments that we made to the public about what we were going to use these dollars for and why we were we were passing this revenue in the first'",
        "'speaker_4': 'place. I also just wanted to take a moment to my office, compiled a list of all of the organizations and coalitions that have written in in support of Council Bill 119551. And I think it's important for us to acknowledge that not everybody got a chance to perhaps speak and for the full amount allotted.'",
        "'speaker_4': 'But the list is is very large of the organizations who wrote to us rejecting the mayor's narrative around what was happening here and in doubling down on their support of creating this dedicated revenue fund. Those organizations include the Seattle Healthy Kids Coalition, which is made up of the Seattle Neighborhood Farmers Market, Childhood Obesity Prevention Coalition.'",
        "'speaker_4': 'Our core foundation, American Heart Association shape Washington Central Rosa. Washington Bass. Paul Sherman, who is with the Community Health Plan of Washington, also a member of the Community Advisory Board, got green Rainier Beer Action. Coalition routes of all roads.'",
        "'speaker_4': 'Mobile Farm stands for Youth Action Network's Yellow Human Services Coalition, including the Southwest Youth and Family Services, YWCA, SHC Saddle Farmers Markets as a Coalition. Pike Place Market Foundation Queen Anne Farmers Market Neighborhood Farmers Market Solid Ground Seattle Food Committee, Lake City Neighborhood Alliance Central Area Collaborative Kids Company and the Community Advisory Board, both as a board'",
        "'speaker_4': 'and and individuals from that organization have also stepped up in concert in support of this bill. And so I'm really appreciative of all these organizations really being able to come together and seeing through this strategy and helping us stay true to what the what the real intent is.'",
        "'speaker_4': 'So with that, I am excited to support the bill.'",
        "'speaker_1': 'Thank you, Councilman Gonzales. Any more brief comments? I'll say a brief comment to. I'll just say this. Look at my daughters over here saying, no, I haven't said anything. Okay. I'm not going to say I'm going to say this.'",
        "'speaker_1': 'But I was one of those kids that were I had never met a twink in a seven. If I didn't like growing up. I was not a big fan of this tax to begin with because I saw it how it went to poorer people and people that just were marketed to.'",
        "'speaker_1': 'Like our colleagues said. But that was our commitment to the community. And that's why I got behind it. And it's as simple as that. And this legislation was called irresponsible. I think it's very responsible. We're not cutting anything, so it's very responsible.'",
        "'speaker_1': 'Those are my comments. You see, I am brief. When I say I'm brief, I'm brief. Okay, now we're ready. I don't want to deny anyone an opportunity. Okay. Please call the role on the passage of the amended bill.'",
        "'speaker_2': 'Get to I O'Brien High Pacheco. Pacheco.'",
        "'speaker_9': 'No.'",
        "'speaker_2': 'So on. I beg Shah. Gonzalez, i. Herbold, i. President Harrell high seven in favor one oppose.'",
        "'speaker_1': 'The bill passed and the chair will sign it. The Housing, Health, Energy and Workers Rights Committee.'"
    ],
    "AN ORDINANCE relating to the sale of low-income housing; requiring owners of certain multi-family rental housing to notify the Seattle Office of Housing, the Seattle Housing Authority, and tenants of the owners proposed sale of that housing; and amending Sections 22.907.030 and 22.907.100 of the Seattle Municipal Code.": [
        "'speaker_6': 'The Report of the Housing, Health, Energy and Workers Rights Committee. Agenda Item three about 119537 relating to the sale of low income housing, requiring owners of certain multi-family rental housing to notify the Seattle Office of Housing, the Seattle Housing Authority and the tenants of the owners proposed sale of that housing.'",
        "'speaker_6': 'And in many sections 22.90 7.0 30 and point 100 of the transfer code. The committee recommends a bill passes amended.'",
        "'speaker_1': 'Customer.'",
        "'speaker_6': 'Thank you so much. And as people leave, I want to say thank you for both. Also commenting on the notice of intent to sell legislation. As you also talked about the need for a sugar sweetened beverage isolated fund.'",
        "'speaker_6': 'So thank you for that. I won't take their exit, Mr. President, as an indication that they don't like it because folks have weighed in. So I appreciate that. Today, I'm really excited to bring forward this legislation that creates the notice of intent to sell ordinance.'",
        "'speaker_6': 'I should say that updates the existing ordinance that's already on the book. We already know that Seattle's current real estate market, the tenants affordable housing providers, often struggle to compete. Many buyers come with cash in hand and snap up properties within days of being listed.'",
        "'speaker_6': 'And sometimes buildings are also sold without ever being listed on the market at all, leaving few opportunities for low income buyers to get a foot in the door, including tenants and nonprofit organizations, community organizations that are interested in preventing displacement and helping to make sure that people have an affordable place to live.'",
        "'speaker_6': 'So I believe, as this council has talked about multiple times, we need every tool in the toolkit to help make sure that we are creating new first time homebuyer options, that we are preserving affordability where we can, that we're creating and building more affordable housing units, both for renters and for first time homebuyers.'",
        "'speaker_6': 'And that, as we do all of this, we create additional options to exercise greater self-determination in terms of how we access affordable housing. The existing notice of intent to sell ordinance, which many of you passed years ago with Councilmember Burgess and Clark, I think, who led the effort, had identified that multifamily properties of five units or more'",
        "'speaker_6': 'with at least one rental unit at 80% AMI or below, should notify the Office of Housing of their intent to sell any property and provide a 60 day window before any transaction to allow an opportunity for affordable housing developers to submit an offer should they be interested in acquiring the building.'",
        "'speaker_6': 'However, as we've heard over the last year and a half, there is additional tools that we need in that toolkit. One is for those smaller buildings, those with 2 to 4 units, and to create more opportunities for those nonprofit developers and organizations, to have more of an opportunity to potentially make an offer on some of those larger'",
        "'speaker_6': 'units with five larger buildings, with five units or more. So we've engaged with community members and affordable housing providers. Some of the industry folks who you heard from today to try to get some feedback on the ordinance in front of you and ultimately have landed on this legislation with the amended amendments that Councilmember Herbold and Council Member'",
        "'speaker_6': 'Bagshaw have worked with us to include. And I believe that it really strengthens the opportunities for tenants, strengthens the opportunity for community organizations, and strengthens the opportunity for nonprofit, affordable housing developers to purchase multifamily residential buildings when they come up for sale.'",
        "'speaker_6': 'Be this either for individuals as tenants of the building who will now finally get notification before their building goes up for sale. Or nonprofit developers who we want to facilitate the ability ability for them to either preserve the building or create more affordable units.'",
        "'speaker_6': 'And also for our community partners who have said they would like to get more into this arena and to help preserve buildings or build more units so that there can be more affordable housing on the market as a whole.'",
        "'speaker_6': 'And with this legislation, we will be able to provide notice to those entities so that they have more time to make an offer. The proposed updates are not only intended to expand opportunities for tenants and nonprofits interested in purchasing properties come up for sale, but also to create a potential pool of new new purchasers.'",
        "'speaker_6': 'When we incorporate some of the language that Councilmember Herbold has been instrumental in, including by making sure that the Office of Housing is, let's say, hosting educational programs so that people understand where potential resources can come from. As we pull in existing funding that has come from the Office of Housing and other community development entities that have'",
        "'speaker_6': 'funding available for this type of purchase, we're going to build out our knowledge in the community about how to access these funds and potentially create more self-determination, homeownership and affordable rental units on the horizon. And we're also looking back as Councilmember Bagshaw has spearheaded the effort in the legislation.'",
        "'speaker_6': 'We're also going to be making sure that we'll hold ourselves accountable, that this tool is working in the future, and that we respond to the data that we get. We want this to be a benefit to tenants, to nonprofit organizations, to community organizations that are interested in this.'",
        "'speaker_6': 'And I believe that as we do so, we will potentially see more opportunities for those who've been historically not able to engage in this type of purchase, engaging in preserving affordable housing, and hopefully building out more affordable housing in the future.'",
        "'speaker_6': 'So creating a new pool of potential purchasers, obviously, this is not going to be one policy that solves any of our affordable housing. And Chris, this is again, one additional element to a much larger toolkit that we all need in order to create affordable housing across the income spectrum, but specifically for our lowest wage workers.'",
        "'speaker_6': 'And I really appreciate folks engaging on this legislation. We know we have other cities to pull from and the National League of Cities, again, in their report that they just released a few weeks ago, highlighted this policy strategy as one important tool to make sure that cities are offering more opportunities for people to purchase these types of'",
        "'speaker_6': 'buildings, and importantly, the nonprofit developers and community organizations along with tenants. So that is my comprehensive summary of the legislation and my huge thanks to all of the council that has engaged on this legislation. And I'm looking forward to hearing any concerns, but looking forward to really the implementation side of things.'",
        "'speaker_1': 'Okay. Any questions or comments? Councilman Bagshaw?'",
        "'speaker_3': 'Thank you all. I think we still have council central staff here for all of your good work. Thank you for your leadership on this councilmember mosquito. I want to underscore a couple of things. One, this does not impact single families.'",
        "'speaker_3': 'So single family homes with people that want to sell. It also does not impact the large commercial buildings that people are worried about. And I do want to acknowledge that, Councilmember Moss, Kate and I both reached out to representatives that work for landlords.'",
        "'speaker_3': 'The reason we added the tiers and the various gates for the 15 days was to make it clear that we're giving opportunities to people that might not have the information that they can get together and if they've got the financial wherewithal to put an offer forward.'",
        "'speaker_3': 'But I also, without blowing any attorney client privilege, I want to recognize and acknowledge that we did work with a lot apartment on this. So some of the issues that were raised in the last week, I believe have been addressed.'",
        "'speaker_3': 'So many thanks. I'm certainly voting for this. We'll see how it goes. We also have tied in an evaluation by the city auditor. If we find it's not working, it can be undone. So I think it's a it's a worthy effort.'",
        "'speaker_3': 'Let's try.'",
        "'speaker_1': 'Thank you, Councilmember Beck. Customer Well.'",
        "'speaker_4': 'Thank you. I want to thank the chair mosquito for moving forward some language in a shared amendment that was important to tenant advocates and organizations working to promote community land trust and low, low income homeownership. Specifically the need to do more to strengthen monitoring and enforcement efforts to improve compliance and help realize greater retention of affordability and'",
        "'speaker_4': 'promote tenant ownership in alignment with that. As it relates specifically to strengthening monitoring, making sure that properties that are that are required to comply with this law are or are likely to be required to comply with this law, are put on on a watch list that tenant groups and the city can work together in making early assessments'",
        "'speaker_4': 'of whether or not those are properties, should they go up for sale that the city should work together with community groups on identifying. Funding and opportunities to support the purchase of those buildings. And I think it also dovetails into some criticism that we've received from the the Rental Housing Association, which I actually don't see as a criticism'",
        "'speaker_4': 'whatsoever. They they refer to a similar legislation in Washington, D.C., called the Tenant Opportunity to Purchase Act. And they show that over a six year period, 5% of buildings, subject to the requirement, were purchased by tenants. I think that's given the fact that we don't have endless public dollars to purchase properties.'",
        "'speaker_4': 'I think 5% of eligible properties being purchased would be would be fantastic. And I think what we really need to do not only is to support this ordinance and support tenants who are looking to purchase properties in collaboration with the city.'",
        "'speaker_4': 'But we also need to work on on the funding piece as well, which I think is something that there's broad agreement on. No, thank you.'",
        "'speaker_1': 'Thank you. Customer Herbold Okay. I think we'll be ready to vote. Customer said you wanted to reach.'",
        "'speaker_6': 'Please, just to close it out, Mr. President.'",
        "'speaker_1': 'That was closed out, but go ahead and close this out.'",
        "'speaker_6': 'Okay. So I want to thank the council again and also underscore what Councilmember Horrible just ended with. We have so much more work to do to make sure that there is the funding necessary. So our community organizations are nonprofit developers and low income tenants do have funding that they can pull from and when a potential purchase comes'",
        "'speaker_6': 'up in the future. I want to underscore my commitment to that as well as we move forward. My hope is that this type of legislation, in combination with robust funding and other public policies that we've passed, will lead to more co-op models, more co-housing models, more public housing models, as we're also making sure that this list of'",
        "'speaker_6': 'notification goes to the Office of Housing, as well as Seattle Housing Authority. This is one critical element as we're looking forward forward to creating more affordable housing, both for first time homeowners options, first time home ownership options, and for affordable rental units.'",
        "'speaker_6': 'So we're excited about the prospect of this and will be looking forward to working with all of you as we do the evaluation. Just a quick thank you, Mr. President, to wrap it up to the community housing roundtable who's been engaging with us.'",
        "'speaker_6': 'I want to thank Puget Sound Sage and Washington Community Action Network, who testified today in support and on our team, Erin House, who's done a lot of research on this. And as Tracy is listening, Tracy Ratcliff from central staff for her intense research and drafting of this legislation, in addition to the law department, who Councilmember Bagshaw has'",
        "'speaker_6': 'mentioned, has been working with us very closely on this legislation. Very excited to bring it forward to you. And with that, I will stop, Mr. President, so we can vote.'",
        "'speaker_1': 'Thank you. Cathy, I'm a skater. Okay? If there's no other comments, please call the role on the passage of the Bill Musgrave.'",
        "'speaker_2': 'I. O'Brien All right, let's go. I want to thank John Gonzalez Herbold, President Harrell Aden favor and unopposed.'"
    ],
    "AN ORDINANCE relating to Broad Street; transferring jurisdiction over the portion of Broad Street between Thomas Street and Taylor Avenue North from the Seattle Department of Transportation to the Seattle Center Department for purposes of constructing, operating, and maintaining a public skate plaza.": [
        "'speaker_1': 'Bill Pass and chair of Senate. Please read the part of the Select Committee on Civic Arena's.'",
        "'speaker_6': 'The report of the Select Committee on Civic Arena's Agenda and for Accountable 119566 relating to Broad Street transfer jurisdiction over the portion of Broad Street between Thomas Street and Taylor Avenue North for the sale of primary transportation to the Seattle Center Department for purposes of constructing, operating and maintaining a public skate plaza.'",
        "'speaker_6': 'That can we recommend Civil Pass.'",
        "'speaker_1': 'Thank you very much. So I'm going to channel in co-chair of the Select Committee on Civic Arenas Deborah Suarez with me as I present this because it was a select committee, I think all of you are familiar with what we're trying to do in these three pieces of legislation.'",
        "'speaker_1': 'The first one is fairly straightforward. We're just transferring the jurisdiction for a portion of the Broad Street portion of Broad Street between Taylor Avenue North and Thomas Street without charge from start to the Seattle center. And that's simply for the constructing and operating and maintaining a public skate plaza.'",
        "'speaker_1': 'And, of course, this was caused by the work we're doing over at Key Arena and on the Seattle Center campus. And so that's basically what this does. And I look forward to your support. Any questions or comments? But please call the rule on the passage of the bill.'",
        "'speaker_2': 'Macheda I. O'BRIEN Hi. Pacheco. All right. So thanks. John Gonzalez Herbold President Harrell I eight in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to the Seattle Center Department; authorizing the Seattle Center Director to execute an amendment to the facility use agreement with Force 10 Hoops, LLC, authorized by Ordinance 125323 for use and occupancy of KeyArena for playing of professional womens basketball games; making findings of fact about the value provided by professional womens basketball in Seattle; amending the relocation payment structure in the agreement; and exempting the amendment from the requirements of Chapter 20.47 of the Seattle Municipal Code.": [
        "'speaker_1': 'Bill Pass ensures chair will sign it. Please read the next agenda in the short short time to.'",
        "'speaker_6': 'Please agenda item five cancel 119 549 relating to the sales center department authorizing sales center director to execute an amendment to the facility use agreement with Force Ten Hoops LLC. The committee recommends a bill pass go again.'",
        "'speaker_1': 'So this Council bill is relative to our. Beloved champions, the Seattle storm. And this basically modifies the facility use agreement amendment. It allows the basically it it doesn't increase our potential liability. The city was continues to remain capped at 2.6 million.'",
        "'speaker_1': 'But what it does is recall it modifies the formula used to calculate relocation payments. It it no longer makes a differentiation between additional costs and lost revenue. And by doing that change, it certainly encourages and incentivized the storm to play the storm to play their home games here in Seattle rather than electric the location like Everett.'",
        "'speaker_1': 'And I think many of you know that they're now playing it the pavilion at the University of Washington. And we want to keep our champions local. So that's what this does. And it was a agreed upon negotiation. Any other questions on this great nat please call the role on the passage of the bill.'",
        "'speaker_2': 'Must get to I O'Brien by Pacheco so I thank John Gonzalez purple by President Harrell. I eat in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Seattle Municipal Code (SMC) Sections 23.55.002, 23.55.003, 23.55.005, and 23.84A.036; and adding new SMC Sections 23.55.052, 23.55.054, 23.55.056, 23.55.057, 23.55.058, and 23.55.060; to establish a sign overlay district and sign regulations for the Seattle Center, including regulations for subareas containing the Seattle Center Arena and the Bressi Garage block.": [
        "'speaker_1': 'The bill passes and the chair of Senate. Please read the next agenda item.'",
        "'speaker_6': 'Agenda Item six Council 119 543 relating to Lenny since any amending seven sometimes because sections 23.50 5.002.003.005 and 23.84 8.0 36. To add new assembly sections 23.50 5.0 52.00. 54.0. 56.0. 57.0. 59.0 62. Subject Design Overlay Districts and sign regulations for the Sale Center, including regulations for sub areas containing the Seattle Center area excuse me, arena and'",
        "'speaker_6': 'the brassy garage block. The committee recommends the bill passed as amended.'",
        "'speaker_1': 'Thank you very much. So this last piece of legislation is basically creating what we call the sign overlay district, and by that it amends the land use code to define a sign overlay district that basically provides the tailoring of the sign code provisions at the Seattle Center.'",
        "'speaker_1': 'The both the developers and city leaders and those sort of vested in the project believe this is absolutely necessary incident and sort of a catalyst for wayfinding and for the creation of vibrancy in the Seattle center. And so the signage which do illuminate but they're not like Las Vegas type signs but are necessary for wayfinding and again'",
        "'speaker_1': ', creating the vibrancy that we want to see at Seattle Center Arena. We had a robust conversation, I thought, at the committee table, and there was some concern by both the design commission and some folks testified about sort of a be careful approach or whether this is the best approach.'",
        "'speaker_1': 'But we heard, I thought from the executive and the department some fairly compelling testimony in terms of how they limit the use of signs. There's actually a total reduction of the amount of signage by 2000 square feet that was allowed in the original lease, the hours that science could be illuminated, etc. all seem to be reasonable and'",
        "'speaker_1': 'as determined by the committee. And so this justice, this legislation was overwhelmingly passed out of committee. And we think it's the wise way to go. Any questions or comments with that? Please call the role on the passage of the bill.'",
        "'speaker_2': 'Mr. O'BRIEN. Hi. Pacheco. Hi. So one big John Gonzalez Herbold President Harrell.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Eight and favorite on a.'",
        "'speaker_1': 'Post please call off the bill passed and Cheryl sign it please read the report The Civic Development Public Assets and Native Communities Committee.'"
    ],
    "AN ORDINANCE granting a utility easement of surface and subsurface rights to King County, through its Department of Natural Resources and Parks, Wastewater Treatment Division (King County), to maintain an underground overflow pipeline and channel for the King County-owned reservoir within Discovery Park, which serves the regional wastewater facility, to meet federal guidelines for a potable water supply separation in the event of an emergency shutdown and backup of the incoming water supply.": [
        "'speaker_6': 'The Report of the Civic Development, Public Assets and Native Communities Committee. Agenda seven Council. Bill 119569 Granting a utility easement of surface and subsurface rights to King County Commission recommends the bill passes amended.'",
        "'speaker_1': 'Councilmember Bagshaw.'",
        "'speaker_3': 'Thank you. And on behalf of Councilmember Suarez, we've got the last three items. So we are going to go quickly on this. This is a Discovery Park ordinance that grants a utility easement of surfing and subsurface rights to King County.'",
        "'speaker_3': 'They will maintain the overflow pipeline and channel and Discovery Park. We amended the ordinance in committee to adopt Attachment one Version two, which stipulates that the city will be responsible for maintaining any natural causing disturbance to the easement.'",
        "'speaker_3': 'So if there is an earthquake, it's ours. This amendment was agreed upon both by the city and the county, and the committee recommends a do pass recommendation on this.'",
        "'speaker_1': 'Very good. Any questions or comments now? Please call the roll on the passage of the bill.'",
        "'speaker_2': 'Macheda I O'Brien. I Pacheco. I so want I beg John Gonzalez Herbold i President Harrell high eight in favor and unopposed.'"
    ],
    "AN ORDINANCE relating to Seattle Parks and Recreation; authorizing the acquisition of real property commonly known as 2318 NE 125th St.; authorizing acceptance and recording of the deed for open space, park, and recreation purposes; and ratifying and confirming certain prior acts.": [
        "'speaker_1': 'Will pass and share with Senate. Please call the next agenda item into the record.'",
        "'speaker_6': 'Agenda item eight Cancel 119 570 relating to Seattle Parks and Recreation authorizing acquisition of real property property commonly known as 23. Northeast 1/25 Street, authorizing acceptance and recording of the deed for open space, park and recreation purposes, and ratifying confirming certain prior acts.'",
        "'speaker_6': 'The committee recommends the bill pass.'",
        "'speaker_3': 'Thank you so much. This is an exciting piece of legislation for councilmember suarez and five and in particular, it will allow parks to acquire a piece of land that's located on 100 and twenty-fifths fifth street used for open space parks and recreation purposes.'",
        "'speaker_3': 'It's on the north fork of Thornton Creek. Councilmember was sent in a statement that says In protecting a pristine acre of salmon bearing stream, we will also boost the flood retention ability of defines main watershed. And Councilmember Suarez wants to thank Seattle Public Utility Seattle Parks and Recreation, Thornton Creek Alliance, King County Councilmember Rod Dombroski and the'",
        "'speaker_3': '46th District legislative delegation for coming together to get this done. So we recommend a unanimous approval that this piece of property be purchased.'",
        "'speaker_1': 'Thank you. Councilman Bagshaw, any other questions or comments? But please call the rule on the passage of the bill.'",
        "'speaker_2': 'Macheda I. O'Brien Hi. Pacheco Hi. So what? Gonzales. Herbold Hi. President Harrell All right. Eight in favor.'",
        "'speaker_1': 'Nine opposed to bill passed share of Senate. Please read the last agenda item.'",
        "'speaker_6': 'Agenda Item nine Appointment 1377 Reappointment of J.A. Richards, Member of Seattle Public Library Board of Trustees four Term two April 1st, 2024. The committee recommends the appointment be confirmed.'"
    ]
}