{
    "AN ORDINANCE relating to a sales and use tax; providing for the submission to qualified electors of the City at an election to be held on November 3, 2020, a proposition to collect a sales and use tax to fund transit and related transportation programs in Seattle.": [
        "'speaker_5': 'The report at the Select Committee on the Transportation Benefit District Funding Agenda. Item one Capital 119833 relating to a cell cellphone use tax, providing for the submission to qualified electors at the city at an election to be held on November 3rd, 2020.'",
        "'speaker_5': 'Your proposition to collect resale and use tax to fund transit and transportation programs in Seattle. The committee recommends that the bill passed as amended.'",
        "'speaker_0': 'Thank you so much, Madam Clerk. So here is what I think we need to do, because there's a lot of moving pieces on this particular council bill. So if there is no objection, we will first hear from the committee chair, Councilmember Peterson, to present the committee report, and then we can consider the possible seven amendments in the'",
        "'speaker_0': 'following order. I would propose that we consider Amendment two, which was published on the agenda. That is, Councilmember Morales's proposal to increase the tax rate from 4.1% to 2.2%. Then I propose that we consider Amendment six, which was not published on the agenda.'",
        "'speaker_0': 'That's my proposed amendment. That would increase the tax rate from 0.1%, 2.15%. And then there are there is another potential Amendment six B that was not on the agenda and would require the rules to be suspended. That is being potentially brought forward by Councilmember Mosqueda.'",
        "'speaker_0': 'And it would amend it would be an amendment to remove the increase to low income to the low income spending cap category with those with any additional funds being directed to transit service. We also have Amendment eight. We could then consider Amendment eight, eight or eight be also not on the agenda.'",
        "'speaker_0': 'That amendment would be brought forward by Councilmember Herbold and would propose to increase the emerging service category cap. Then we could consider amendment number one, which is on the agenda that's being brought forward by Council Member Strauss and proposes structuring the levy change, changing the time length of the levy from four years to to a six year'",
        "'speaker_0': 'term. And then we would hear amendment number seven, eight or seven D also not on the agenda, but amendments being brought forward by Councilmember Strauss, which would be technical fixes to clarify the term of the measure. If the term of the measure is extended to April 2025 or April 2027.'",
        "'speaker_0': 'And then lastly, we could consider amendment number three, which was on the agenda. That's my amendment to include explicitly essential workers in the low income spending category. So so if there is no objection to that order of discussion of the amendments, then we will consider them in that order.'",
        "'speaker_0': 'Madam Chair. Madam President, could you just repeat the numbers for me real quick, if you don't mind? I got the descriptions, which I appreciate, but I just wanna make sure I got that right. Okay. Amendment to. Amendment six.'",
        "'speaker_0': 'Potential Amendment six be. Amendment eight A or HB. Amendment one, Amendment seven A or seven B. And then we will conclude with Amendment three. All right? It's. It's it's like we're having a select committee meeting of the study over here, but here we go.'",
        "'speaker_0': 'Okay. I didn't hear any objection. No objections. All right, let's rock and roll. So here we no objection in the order of the expression of events will be considered in that order. Councilmember Peterson, as chair of the committee, you are recognized in order to provide the committee report.'",
        "'speaker_2': 'Thank you. Council President, colleagues, our Transportation Benefit District has been operating successfully for the past six years after voters approved the current version in 2014. On Friday, July 17, our Select Committee on Seattle Transportation Benefit District funding unanimously passed Council Bill 119833 to renew funding for that important transit measure.'",
        "'speaker_2': 'And we voted on all seven of the published amendments at that time. A theme at committee was to prioritize transit service over road works, which we did by moving more dollars for remote work into transit and requiring that a majority of all new funds go toward transit service.'",
        "'speaker_2': 'I think we can all agree it's disappointing that Tim Iman's initiative, 976, which was rejected by a whopping 76% of Seattle voters, has removed approximately half of the funding source. We hope to overturn that measure in the courts.'",
        "'speaker_2': 'If we do overturn I nine, seven, six, I support doubling the car tab revenues that we are allowed to increase as a council. At the same time, we can't ignore that ridership on King County metro has plummeted by over 72% during the COVID pandemic.'",
        "'speaker_2': 'Moreover, a second wave of the coronavirus is an imminent concern, as we've seen with our governor last week, imposing additional restrictions. Yet I am upbeat on the future and the future of transit. It's going to the demand is going to increase.'",
        "'speaker_2': 'And I'm hopeful we're going to get back to the high levels that were prior to the nation, and that will continue to increase that transit ridership. Today, there are additional amendments for consideration, and while we are likely to hear a robust debate about some of these amendments, just hope the general public sees that there is unity and'",
        "'speaker_2': 'that we all support transit and want to renew this measure. What are the key amendments or two amendments for debate today? Is it about the tax rates? One of the amendments proposed to double the tax rate to double the sales tax 2.2%.'",
        "'speaker_2': 'I am not able to support a doubling of the sales tax for all the reasons that we don't like sales taxes. I am pleased to see the compromise amendment from Council President Gonzalez to make sure we get more revenue for transit than the proposal that was transmitted to us.'",
        "'speaker_2': 'This amendment would increase to 0.15%, which we discussed a little bit this morning. So council president, after we vote on all the amendments, said, I'd like to make three final remarks before the final vote, if possible.'",
        "'speaker_0': 'Thank you. Absolutely. The prime sponsor of the legislation I was always gets the last word before we call things to vote. So. Thank you so much, Councilmember Peterson, for that. Those introductory remarks. It is 3:25 p.m. now, so i think we should go ahead and get started on the amendment work.'",
        "'speaker_0': 'So let's go ahead and start with amendment two and the primary sponsor of that is Councilmember Morales. So I'm going to hand it over to Councilmember Morales to make her motion to formally put amendments to before the council.'",
        "'speaker_3': 'Thank you. Council President I move to amend council bill 119833 as presented on Amendment two.'",
        "'speaker_2': 'On the agenda.'",
        "'speaker_0': 'Is there a second? It's been moved and seconded to adopt amendment to. Councilmember Morales, you are the prime sponsor of that amendment and you are recognized in order to address your amendment. Please.'",
        "'speaker_3': 'Thank you. Colleagues, we had a robust conversation about this this morning, but for the benefit of the public this afternoon, I want to thank you again for the discussion that we had last week about this amendment. As I said, I am working to try to protect as much as possible service hours, up to 150,000 service hours for'",
        "'speaker_3': 'our neighbors, even as we do struggle with an increase in a sales tax. I withdrew it last week to allow more time to hear from stakeholders. And I want to say that after speaking with several community organizations in my district, including across Refugee Women's Alliance, Interim El Centro de la Raza, when America began Safe Streets Rooted in'",
        "'speaker_3': 'Rights. The MLK. Lincoln County Labor Council. Teamsters 117. I've decided to bring the amendment back for consideration. These stakeholders understand what's at risk if we move something to the ballot that will reduce transit service so drastically. So I don't want to belabor the point.'",
        "'speaker_3': 'I will just say that the point 2% increase is an effort to protect the transit system that we've already invested in. And cutting Seattle's investment to 30 million a year will wipe out that system and harm those who need transit the most.'",
        "'speaker_3': 'So I am moving this amendment and asking for my colleagues support.'",
        "'speaker_0': 'Thank you, Councilmember Morales, for those remarks and really appreciated the, as you put it, very robust conversation around all of these amendments this morning. So this is a continuation of that conversation, of course. Colleagues, any other comments on Amendment two?'",
        "'speaker_0': 'However, I'm a skater. Please. Thank you, Madam President. As I said this morning, I'm supportive of the efforts to continue to increase the amount of funding that is going to these critical transit services. We know the Economic Opportunity Institute has calculated the impact at 0.1% sales tax increase would have on households and estimates that the amendment would'",
        "'speaker_0': 'mean an annual cost of about $9 per household, making about $25,000 a year, or about $12 per household making around $50,000 a year. So we can't under underestimate the impact of that dollar amount on working families. But we also know that cutting transit, which is a lifeline for the very same folks that we're concerned about having to'",
        "'speaker_0': 'pay this tax would have a much more regressive and harmful impact without being able to get to work or childcare or there are other critical services like medical appointments. We've heard from folks who are supporting this effort from labor partners and Sage and other folks today.'",
        "'speaker_0': 'So I will continue to support this effort. And if this does not pass, I will also support the other proposal from Council President Gonzalez. Looking forward to making sure, though, that we are doing everything that we can to get additional dollars in hand to preserve where possible or reduce the burden of the cuts that are expected.'",
        "'speaker_0': 'And I appreciate the efforts that have been put forward today to do just that. Thank you, Councilmember Mosqueda, for those comments. Are there any other comments on Amendment two? Oh, council members a lot, please.'",
        "'speaker_3': 'Thank you. Sales taxes are a terribly regressive tax that put the burden of funding transit on poor and working class people, leaving big business and the super rich relatively untouched. And many council members have acknowledged this reality. If, on the other hand, we allow the cuts to happen, it will impact workers who depend on transit for basic'",
        "'speaker_3': 'mobility. Some of those same working families who are hit by the regressive taxation and as was mentioned in public comment, it hits people with very low incomes, people with community members with disabilities in many different ways. And it will hurt transit workers, union members of 8587.'",
        "'speaker_3': 'The choice between increasing the sales tax and austerity cuts to budget hours is a false choice where working class people and the marginalized communities and poor people lose either way in deciding whether to support this amendment. What's decisive is whether other concern for me is whether other council members would be willing to support progressive funding alternatives to'",
        "'speaker_3': 'this. Regressive tax. I mentioned in committee ten days ago that legally it is not true that sales taxes are the only option for funding transit. Yes, the transportation benefit districts are a legal construct and have certain identified funding sources.'",
        "'speaker_3': 'However, there is nothing in the law. There hasn't been anything in the law that would prevent the council from passing some other progressive general fund tax and using those funds to pay for bus service. For example, the City Council could pass an ordinance to increase the tax rate in the just passed Amazon tax.'",
        "'speaker_3': 'Increasing those tax by a quarter of a percent would be sufficient to raise those funds to eliminate the transit budget charge without any sales taxes at all. I ask the question at that time, would council members agree to support that?'",
        "'speaker_3': 'Another example is the city could put on the ballot a point 2% increase in the D.A. tax rate and use that instead of sales taxes because they are not regressive like the sales taxes. It is less progressive. The taxes are less progressive than the Amazon tax because the Amazon tax only taxes the largest 3% of big businesses'",
        "'speaker_3': '. But they are more progressive than sales taxes because sales taxes hit the poorest households the most. Ten days ago, I asked if any council members would seriously support either of those progressive options instead of the regressive sales tax and budget cuts.'",
        "'speaker_3': 'And I said that, if so, I would be happy to make that motion. I indicated that I would abstain from a vote. 4.2% sales tax rate on the committee to give time for the City Council members to signal support for a progressive alternative.'",
        "'speaker_3': 'Unfortunately, I have to share with members of the public that in the past ten days I am not aware of any other council member supporting shifting transit funding away from sales taxes towards other avenues for progressive taxation. And the reality is, the political establishment in Seattle and elsewhere always tries to put the burden of taxes on working'",
        "'speaker_3': 'people unless there's a movement to fight back. We won the Amazon tax only because we had a massive and democratically organized movement with a ballot measure that was a credible threat to big business. The fundamental lesson of the false choice that we are left with today instead of progressive taxes is that the political establishment cannot be trusted'",
        "'speaker_3': 'to support the interests of workers unless they are forced to do so by a sufficiently powerful movement. However, faced with this situation, my office must vote to either accept the mayor's proposed cuts to Metro, which is not acceptable, or to vote to increase regressive taxes on workers.'",
        "'speaker_3': 'As I said, both choices are bad. But as many community members have said in public comment today and before, the budget cuts would be the most harmful. And for all those reasons, I will be voting yes on increasing the proposed sales tax rate by an additional 2.1%.'",
        "'speaker_0': 'Thank you, Councilmember Salon. Are there any other comments? Councilmember Strauss.'",
        "'speaker_2': 'Please. Thank you. Council President, as I stated in my comments earlier this or this morning, the duration is what's most important for me. Just by listening to my colleagues comments and consideration between .2.4 and 5.1. I'm not hearing a majority of comments because that's all we have to go off of here on either 1.1 or 2.2.'",
        "'speaker_2': 'I'm wondering if there is some folks are coalescing around one spot. Maybe that's a question out of order, but I figured I would ask it in open session.'",
        "'speaker_0': 'Governor Strauss will be considering a 0.15 amendment in the future. Right now, we're having no conversation around the Amendment two, which is Councilmember Morales's proposal for a point to increase, of course, can't compel colleagues to to say what they don't want to say.'",
        "'speaker_0': 'But there is obviously the alternative proposal of Amendment six, which is my .15. People are welcome to to signal preference one way or the other if they're comfortable doing so. And if not, then we'll, we'll we'll know where the where, where folks lie once we call the amendment to a vote.'",
        "'speaker_0': 'Councilmember Herbold, you're.'",
        "'speaker_4': 'Thank you. I will be supporting the Amendment six. I have expressed my concerns in the past about increasing taxes that have a disparate impact on low income people. And the sales taxes is one of the most regressive forms of taxation.'",
        "'speaker_4': 'I understand from the analysis that increasing the sales tax from 0.1%, 2.2% will be for car owning lower income households. It will be outweighed by not having to pay the car tax car, I think I should say car owning households generally will be outweighed by not having to pay the car tax as well as car owning lower'",
        "'speaker_4': 'income households. It's the low income households who don't have a car that would, under this proposal, see their total tax burden rise by increasing the sales tax 4.1% to 4.2%. I understand that there is a good conversation about whether or not the loss of transit service outweighs the the negatives around having the total tax burden rise for'",
        "'speaker_4': 'low income households who don't have cars. But I do believe that Councilmember Gonzalez puts forward a a good compromise to help address the the the the negative impact of of of loss of transit service to those to those households, and also while minimizing the progressivity of the taxation.'",
        "'speaker_4': 'And so I will be supporting that. I also, as Councilmember Gonzalez explained this morning, I have concerns that this is the first tax measure that we are going to be putting on the ballot in a post-COVID time, where people are very impacted across many, many socio socio economic economic spectrums, negatively impacted by the economic realities of COVID'",
        "'speaker_4': '19. And this is this is so important to our to our city that I just really don't want to risk losing it. And so I am maybe perhaps cautious and risk averse. But I want to thank Councilmember Morales for the the work that she has done over the last week to generate support for an increase.'",
        "'speaker_4': 'I believe that support for an increase will transfer over to a 1.15% increase. I also want to thank the the the. Transit Advisory Board for four. There were weighing in both on the size of the tax as well as the term of the tax.'",
        "'speaker_4': 'So things to get.'",
        "'speaker_0': 'Thank you so much, colleagues. Any other comments on Amendment two? Councilmember Lewis, please.'",
        "'speaker_2': 'Thank you so much, Madam President. You know, frankly. I'm still in a place where I would like to see no increase of the sales tax at all over the the 0.1%. I understand that there are a lot of.'",
        "'speaker_2': 'Trade offs that that would involve in terms of service future service cuts or potential service reductions. I continue to be very optimistic that the city is going to prevail in our litigation to unlock car taps again as a component of our transportation benefit district strategy.'",
        "'speaker_2': 'That Council magically we will be able to work with the county on a regional successor that could potentially go up to $100 on the car tabs above and beyond the $60 car tabs that we have currently had on, and that that revenue could have a massive impact, especially on a county wide basis, to restoring those transit hours'",
        "'speaker_2': '. But, you know, that's still a risk and there's still a lot that needs to be worked out for that to happen. So I do think it's warranted to send to the people of Seattle the 1.5 number so that we can have that option to go up that high in the event that we're not successful in Olympia, litigating'",
        "'speaker_2': 'in the court that the repeal of Simon's initiative. I would also signal that it would be my intent to seek only renewing the existing point one in the event that we are successful and that we do unlock those car tabs.'",
        "'speaker_2': 'For my comments this morning. But in the meantime, to avoid the worst of the reductions in service, I would support the the 0.15 that has been proposed by Council President Gonzales. I'm hoping that we would actually not have to realize that sales tax increase based on the successful result of litigation.'",
        "'speaker_2': 'So I just wanted to put that out there. And I do want to thank Councilmember Morales for giving us the option of having this discussion, because I know that it was a amendment that was walked on last week, but I think it was important that this was thoroughly vetted, that there was a really lengthy conversation about these'",
        "'speaker_2': 'impacts. And I do think that the compromise that the council president has put forward is is a good one, and it's what I intend to support.'",
        "'speaker_0': 'Thank you, colleagues. Any other comments or questions about amendments to. Seeing and hearing none. Councilman Morales, any any last words that you'd like to offer or would you just like us to have. Well.'",
        "'speaker_3': 'Let's just do it.'",
        "'speaker_0': 'I know. I see. For those of you who can't see the entire grid of the council, there's many of us who are fanning ourselves. So we hope everybody staying safe in this heat. Okay. Without there being additional discussion, I'm going to go ahead and ask the clerk to please call the role on the adoption of amendments to'",
        "'speaker_1': '. Morales i macheda II.'",
        "'speaker_2': 'Peterson No.'",
        "'speaker_1': 'I. Strauss.'",
        "'speaker_2': 'Yes. Lewis No.'",
        "'speaker_1': 'Her bold.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'War is.'",
        "'speaker_5': 'No.'",
        "'speaker_1': 'Council? President Gonzalez.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Or in favor five opposed.'",
        "'speaker_0': 'Thank you so much. Madam Clerk, the motion fails. An amendment to is not adopted. So we'll go ahead and move to Amendment six. I will move to amend Council Bill 119833 as presented on Amendment six, recently distributed. Second second it's been moved and seconded to adopt Amendment six as sponsor of this amendment.'",
        "'speaker_0': 'I will just briefly address it and then open it up for debate and discussion. Colleagues, we talked about this quite a bit this morning. I just wanted to reiterate that I think that at the end of the day, it's important for the members of the public to know that this city council is committed to increasing the original'",
        "'speaker_0': 'proposal that we received from the mayor to ensure to mitigate against deep service cuts to our frequent transit network. Again, as we mentioned and discussed during this morning's council briefing, even under 8.15% model, even under a 0.2% model, which would have been the maximum amount legally allowable for us to to send to the voters.'",
        "'speaker_0': 'Even under the maximum taxation amount, we are still expecting cuts to service from King County Metro as a result of the COVID 19 economic crisis and the significant decrease in ridership. In large part because our system relies on people paying fares in order for it to be viable.'",
        "'speaker_0': 'And so I think it's important for us as council members to. Fairly and accurately communicate to our constituents that the Seattle Transportation Benefit District is not going to be additive if passed by the voters as it has been in years past.'",
        "'speaker_0': 'But instead it will function to be a base and to hopefully allow Seattle the flexibility to buy the services that we need. But we will still be reliant on King County Metro to provide those services and to and to and to commit to providing those available services.'",
        "'speaker_0': 'So just really quickly, at .15 percent, it will in essence, provide us with an additional $14 million a year, according to the Seattle Department of Transportation. This would allow us to buy about 30000 hours for West Seattle, and between 120000 to 165000 service hours would be available system wide, depending on some policy decisions that we will have'",
        "'speaker_0': 'to make during the budget and on community outreach and feedback that we would consider as a council before finalizing the spend plan. Once the levy is approved but with, we will also get the potential if we do the math there, it gets us to a potential total range of 150000 to 200000 total service hours in a 0.15%'",
        "'speaker_0': 'tax scenario, tax rate scenario with the currently available revenue forecasting. So for a sense of scale and under normal circumstances, 175,000. 175000 hours could maintain our current estimated investments in the frequent transit network, including 30, 15 and ten minute service and night owl functions.'",
        "'speaker_0': 'But again, with Metro's 2021 service being being still quite uncertain, we, I think, are being prudent in and going with the .15 percent route and making sure that we can make some specific decisions about the budget once the levy is approved, I think is going to be helpful.'",
        "'speaker_0': 'So the. Sorry about the interference there. Parenting while making an argument about an amendment. Love it. Okay. So I'm going to try to focus here instead of multitasking. So I really appreciate, hopefully, the support that folks can give.'",
        "'speaker_0': 'This potential amendment, Amendment six. I think it's a reasonable alternative. I do want to thank Councilmember Morales and her staff. I know Lakisha and Alexis have been working really hard in your office, Councilmember Morales, to advance the prior amendment.'",
        "'speaker_0': 'And so I think I think it is important for us to recognize that right now we're having a conversation about how much more revenue we can generate in order to mitigate against deeper service cuts. And I appreciate the opportunity to work with all of you on bringing this forward and on making the best case possible to our'",
        "'speaker_0': 'voters who will be asked to tax themselves in order for us to continue to fund really critically important transit services. And I'm really happy that one of the amendments that we will be considering that I think is really critically important is an amendment that would include essential workers in our low income program.'",
        "'speaker_0': 'I just think that is so important for us to do, especially given what we know about who essential workers are in our city. And so I look forward to folks support of both Amendment six and Amendment three that will be considering later on this afternoon.'",
        "'speaker_0': 'That being said, I'm going to pass it on and see if anyone else has any comments or questions about Amendment six. Councilmember Morales.'",
        "'speaker_3': 'Thank you. Thank you. Council President. I know you and I had lots of conversations over the last few days trying to figure out what the best path forward is here. So I do want to say that I will be supporting this amendment, you know, for all the reasons we've been talking about for the day.'",
        "'speaker_3': 'We need to make sure that we are able to increase or preserve as much transit as possible, as much service as possible for our community. And I think this is an important step for us to take. So I do plan to support this.'",
        "'speaker_0': 'I think it gets more remote. I, I appreciate the support because when we say that I think you council president, I echo Councilmember Morales's comments. I want to thank the both of you again for continuing to make sure that there's additional dollars on hand in addition to Councilmember Peterson.'",
        "'speaker_0': 'Thank you for stewarding this through to this point so that we can have a final vote to the council president. I would very much like to support this amendment and if possible, include friendly amendments that we had not circulated before noon.'",
        "'speaker_0': 'And so I would love to have Amendment Six being in front of us if it's possible to suspend the rules to consider that as you consider Amendment six. Okay. Hold on here. Yes. I have one of my procedures script here.'",
        "'speaker_0': 'It would be appropriate for us to have. Consider your amendment to my amendment before we take a vote on Amendment six. So. So why don't we go ahead and go through those steps now, Councilman ROSQUETA? Thank you. Madam President, I assume that there is no objection.'",
        "'speaker_0': 'Then if I go ahead and make the motion to consider Amendment 60. Oh, thank you so much for that. I'm so sorry. I am needing more coffee today. Okay. Councilman Esqueda, I. We are going to go ahead and consider our amendment.'",
        "'speaker_0': 'Your amendment to Amendment six that was not circulated by noon that you would like to present, that did not meet the council rules. The council rule will need to be suspended before we can consider it. If there is no objection in the Council relating to the circulation of amendments, by noon will be suspended to consider Amendment six'",
        "'speaker_0': 'be. Hearing no objection. The council role is suspended and council members get it. Now you may proceed with moving your amendment. Thank you, Madam President. I move to amend Council Bill 119833 as presented in Amendment six, which was recently distributed.'",
        "'speaker_0': 'Second. Okay. So it's been moved and seconded to adopt amendment 60 and and consumers get a you may now address your Amendment six. Okay. Thank you so much, Madam President. Again, thank you to you and your office for your partnership on this potential amendment to Amendment Six.'",
        "'speaker_0': 'Amendment 60 proposes to increase the rate to 1.5% at 3.15%, as the council president has described it and as we discussed this morning. But it does not change the spending caps under 60. The spending caps would remain as they are in the bill as it came out of committee.'",
        "'speaker_0': 'And this means the increased revenue would be spent on transit services as well as the other items that are included in there. I really appreciate the conversations that we have this morning. We want to be honest and recognize that as we move forward in this recession, there obviously will be cuts of various nature together.'",
        "'speaker_0': 'This council member sorry, this council is working through these amendments to make sure that we're prioritizing key services, especially as Councilmember Morales described this morning, specifically in her district that are coming from more black and brown communities, lower wage workers who are especially reliant on transit right now to get to essential services and essential jobs.'",
        "'speaker_0': 'I want to thank Council President Gonzales for her Amendment three, which she just alluded to as well, which will specifically call out essential workers, which I think is a critical component of this proposal. Amendment six be in front of us really helps to make sure that we're supporting the goal of increasing the ability for individuals to access'",
        "'speaker_0': 'key transit services and making sure that we look at frequency and services as as this proposal moves forward or is implemented. I absolutely support the ongoing conversations around transit passes for low income individuals and essential workers. And I think that we have an opportunity to partner with the with the county.'",
        "'speaker_0': 'The county has an upcoming launch of their free and low cost fare program this fall, and that program will focus on leveraging existing lift infrastructure to fully subsidize metro services for customers who earn at or below 80% of the federal poverty level.'",
        "'speaker_0': 'So as we work in partnership with Metro, it'd be great for us to continue to promote our value as a council that we want more people to access transit services, making sure that the program can accommodate essential workers and have a better understanding where the needs are.'",
        "'speaker_0': 'And as we do so, I think that the amendment in front of us really make sure that we address what we continue to hear from a lot of the folks who call them today and community members around the city that we want to see how we can address the cuts in services and frequency that we're already hearing'",
        "'speaker_0': 'about. Folks who are concerned that low wage workers and especially communities of color are able to maintain access to transit services. So I'm really excited about this friendly amendment and working in partnership with the prime sponsor, Council President Gonzalez, to put forward this change so that we can really balance.'",
        "'speaker_0': 'I think, what we heard from in terms of the regional goals in the letter that came from the Council President audio about duty at King County and our ongoing commitments to make sure that we increase sorry that we preserve as many routes as possible and lessen the reductions in in key services so that we can promote ridership'",
        "'speaker_0': ', especially for our most marginalized neighborhoods, so that more people have access to transit and essential services. Thank you. Councilmember Mosqueda, are there any questions or comments on this amendment? I do consider it a friendly amendment. Councilmember Herbold.'",
        "'speaker_4': 'Thank you. Yes. So my question is, is that given that these are caps, not minimum spending requirements, I'm not quite sure why we wouldn't want to increase the cap for access to transit for youth, low income and seniors.'",
        "'speaker_4': 'Given that our proposal that we are we have before us now is talking about an increase in overall revenue. If we are going to increase the revenue collection from 1/10 of a percent to 0.15%, that's going to result in an increase in overall transit capacity.'",
        "'speaker_4': 'And it seems like having a funding of of a funding cap of 10 million is based on a 10th of a percent assumption of revenue. So I just think if we are expanding the capacity of transit, we also have to be able to contemplate the expansion of access of these these populations to 2 to 2 transit.'",
        "'speaker_4': 'And again, the that the 23 million in Councilmember President Gonzalez's amendment isn't required spending. It's a it's a maximum number of dollars to be spent. And so I'm just concerned that we're not allowing ourselves to consider, for instance, $11 million in spending, given that we have this this this increase in encompassing capacity contemplated by the increase in'",
        "'speaker_4': 'the size of the tax.'",
        "'speaker_0': 'As a mosquito. Thank you, Madam President. And thank you, Councilmember Herbold, for your questions. I would I would start by saying we know that even though it's just a cap, we know that those numbers can be very powerful.'",
        "'speaker_0': 'And we don't want to set expectations that we're going to have the ability to go to a certain level or that any money is going to be drawn away from other transit services in frequency. We also heard pretty strongly from community partners, including in transit and in labor, that services and frequency are some of the biggest priorities'",
        "'speaker_0': 'that they wanted to see invested in and. This is this is, I think, an effort to also say that there's ongoing investments in Pasos at our county level. So it would be a nice partnership to make sure that we're not drawing dollars over to certain areas, even though it's just considered a cap.'",
        "'speaker_4': 'I'm just concerned that if we're expanding frequency of service and numbers of routes and we're not also expanding the ability of low income people, seniors and young people to access that, that we may be doing ourselves a disservice.'",
        "'speaker_4': 'I'm not suggesting that 23 million as the cap is, is the right number, but it certainly seems like it should be something higher than the $10 million that was based on a on a 10th of a percent revenue spend.'",
        "'speaker_0': 'A customer must get any anything, anything else to respond to Councilmember Herbold at this point? No. I mean, I think these are the hard choices that were forced to make with very few dollars. I think that it's not necessarily and it's we are trying to preserve as many rounds as possible.'",
        "'speaker_0': 'We're trying to preserve frequency as much as possible. And we don't want to have folks have access to passes when the busses isn't coming, maybe every 20 minutes and starts coming every 40 minutes. I think the the we're making these tough decisions about access to passes versus frequency of service.'",
        "'speaker_0': 'And I think that when we partner with the county and we basically just lift the cap, we're able to then have the passes continue to go into effect with the county partnership and try to preserve as much frequency as we can with the number of routes and services that we have in place.'",
        "'speaker_0': 'So it was really trying to find that right, right. Hybrid between both making sure people have passes and that the busses actually came. And I know there's other members who have been working on this in the in the text of Morales's bill.'",
        "'speaker_0': 'I know that that was something that you were also grappling with. But I think that it's a it's both our need it and we're just trying to raise the cap so we're not drawing a line that we might not be able to meet.'",
        "'speaker_0': 'Okay. Thank you. Any other questions or comments on proposed Amendment six be. I would just say that I, I struggled with this question as well. I think really the policy question before us is whether we want to still stay committed to these low income programs.'",
        "'speaker_0': 'I think the answer to that is yes. And the question becomes at what level? And and I think that, you know, we could increase it by a little bit or we could increase it by a lot, which was my original amendment.'",
        "'speaker_0': 'But I think ultimately what the other policy question is here is what we want to see in terms of the overall health of the frequent transit network city wide that is accessible to to all transit riders, regardless of of income.'",
        "'speaker_0': 'And so I think I think for for that reason, I can understand why Councilmember Mosqueda is bringing forward Amendment six B, which leaves the low income programing intact, but at the level associated with a 0.1% proposal that was originally submitted to us, while still saying that the additional revenue generated from a 0.15% proposal can and should be'",
        "'speaker_0': 'used to focus on frequency and and and enhanced transit services throughout throughout the city. So so I'm you know, it's a it's a it's a tough call. But but I'm but I will likely support Amendment six B and favoring sort of a preservation of the entire frequent transit network through that model.'",
        "'speaker_0': 'So. Because remember Peterson?'",
        "'speaker_2': 'Thank you. And I don't know if it helps others making a decision, but the memo that we got from central staff breaks out the budget that Scott was planning going forward. They set the buckets, the categories at higher levels than what they're budgeting.'",
        "'speaker_2': 'So. They're only budgeting 7 million for the low income passes for on average. So the $10 million pocket is provides a lot of cushion for it to go up. If that helps folks today.'",
        "'speaker_0': 'That is helpful. Thank you, Councilmember Peterson. That's a good good reminder. Appreciate it. Okay. Any other questions or comments on Amendment six be. Anything else. In closing remarks, Councilor Mosquito just wanted to thank you. You summarized sort of the tough policy decisions in front of us better than I did.'",
        "'speaker_0': 'I apologize for that couple colleagues, but I really appreciate working with your office and the council members here today to advance this robust proposal that you have put forward, council colleagues, and to continue as much as we can in this really tough economic time to make sure that we're providing as much access to transit services and support'",
        "'speaker_0': 'to access passes as we know that the recession will be long and these services are really critical. So I appreciate the work that we've done with your office council president, and thank you for your flexibility on this commission.'",
        "'speaker_0': 'Absolutely. Okay. I'm going to go ahead and close out debate on Amendment 66 B, and ask the court to please call the roll on adoption of Amendment six, the Morales.'",
        "'speaker_1': 'Morales. Right. I guess. Okay. Thank you. Mosquera. I. Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what I. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'HERBOLD.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Whereas. Yes. Council. President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Not in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. Okay. Are there? The motion carries an amendment. Six B is adopted. Are there any other comments on Amendment six as amended? Okay. Hearing none. I think we talked about this a lot during council briefing.'",
        "'speaker_0': 'You've talked about we've debated it a lot here. So I'm going to go ahead and ask the clerk, call the role on the adoption of Amendment six as amended.'",
        "'speaker_1': 'Morales.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'Let's get to I.'",
        "'speaker_2': 'PETERSON No.'",
        "'speaker_1': 'So, aren't I. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis, I. Herbold.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Whereas.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Council. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor. One opposed.'",
        "'speaker_0': 'Thank you so much. The motion carries an amendment six, as amended is adopted. Thank you so much. Colleagues, we're going to go ahead and move in the order I describe. So we are now going to consider, I believe, Amendment eight B and this is going to be from Councilmember Herbold.'",
        "'speaker_0': 'And please correct me if I got the the letter the letter wrong, but I do think it's eight B, so I'll go ahead and recognize you in order to have you move your Amendment eight B Thank you.'",
        "'speaker_4': 'I move to amend council bill 11 9833 is presented on Amendment eight B recently distributed.'",
        "'speaker_0': 'Is there a second?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. It's been moved and seconded to adopt Amendment eight. The Council member. Honorable. You are recognized in order to address the amendment.'",
        "'speaker_4': 'Again, much like I argued in the last amendment, this does not require additional funding. It increases the funding cap for emerging mobility needs related to COVID 19 response in recovery and the closure of the West Seattle Bridge in proportion with the increase of the size of the levy to from 6 million to $9 million.'",
        "'speaker_4': 'It increases the funding gap again for both emerging mobility needs related to COVID 19 response and recovery. So that that relates to the social distancing requirements of Metro, but also for the closure of the West Seattle Bridge and impacts to West Seattle and South Park residents.'",
        "'speaker_4': 'The estimate has indicated that the bridge, as we all know, will be closed through the end of 2021, at least. And that is if a repair is chosen. Obviously, much longer if a replacement is chosen. Last week they indicated repair could take even longer than previous estimates and or could last longer.'",
        "'speaker_4': 'Sorry, it could could last longer than previous estimates. And my my request to Metro was to give me some information about how it how 8.1% steady with the addition of service would be how how it how the emerging needs funding in in that particular scenario would sort of stack up to two service capacity pre COVID 19.'",
        "'speaker_4': 'And the response from metro is that with a 10th of a percent with the, the, the spending for emerging needs, it would be, it would allow for capacity that would be close to pre-covid-19 levels, but not at those levels.'",
        "'speaker_4': 'And again, we need in West Seattle and South Park to do a mode shift from 17% of people taking transit, just 30% of people taking transit. There's no way we are going to be able to meet those goals if we are only able to add capacity that is close to pre-COVID 19 levels.'",
        "'speaker_4': 'Some of the improvements that Metro has indicated would require third party funding, like additional STP, include upgrading the water service to two boats up to all day and all year round, adding 773775 water taxi shuttle improvements and or a new third route.'",
        "'speaker_4': 'Again, rapid ride C service frequency upgrades for both peak and off peak. Robust service between Admiral and downtown doesn't exist right now. And similarly, Route 50 service frequencies upgrades to the Sodo link station. These are all things that are going to need additional revenue above and beyond what we're contemplating right now.'",
        "'speaker_4': 'King County Metro presented last week before the West Seattle Bridge Community Task Force and noted that their plans do include adjusting service in the event that there is a high bridge instability and or long term closure of the low bridge, which could shift even more towards a need for the water taxi.'",
        "'speaker_4': 'So again, this is not allowing for the change in the in the cap does not require this level of spending. But it would allow additional it would it would allow for additional spending of an additional $3 million going from nine 6 million to 9 million.'",
        "'speaker_4': 'And again, that is 6 million to 9 million specifically or West Seattle bridge related spending. That also includes the COVID 19 response and recovery spending. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Are there any comments or questions on a proposed Amendment eight be? How's my Rosita? Thank you. Councilmember Herbold, I am sorry if you've already said this, but can you repeat for us what type of stakeholder has been done or conversations with the department about what impact this sort of earmarking would have on the'",
        "'speaker_0': 'proposed use of dollars already?'",
        "'speaker_4': 'So again, it's not it wouldn't be earmarking. It's not it doesn't require the spending. But there already is an emerging emerging needs category that is for both COVID 19 recovery and emerging needs associated with the West Seattle Bridge closure.'",
        "'speaker_4': 'We spoke with King County Metro last week about what the impacts would be and what what these additional dollars could be spent for spent on. I just gave the list of those things water, taxi, the shuttle, the shuttle to the water taxi.'",
        "'speaker_4': 'And let's see, what else should I say? Additional peak in off peak service to a rapid ride. This is all information from from metro and robust bus service between admiral going downtown which absolutely does not exist right now and depot frequency upgrades to the station.'",
        "'speaker_4': 'And so it's an additional maximum of $3 million. Again, not all $3 million annually for the emerging needs associated with the West, yet a bridge closure, but also associated with COVID 19 response and recovery, which is very focused on on making sure that there are there is is the ability to add service commensurate with the the needs'",
        "'speaker_4': 'to reduce the number of people who are on each bus.'",
        "'speaker_0': 'Colleagues any other. Questions or comments on proposed Amendment eight. The. Councilman Peterson, please.'",
        "'speaker_2': 'So, Councilmember. Horrible. Just to clarify, I know one of the themes here is where we're increasing more dollars toward transit service. And so the the concern with the different categories is that they might be for things other than transit service.'",
        "'speaker_2': 'But just to clarify for me, subsection E that you're you would be amending includes transit service.'",
        "'speaker_4': 'It is it is only transit service. These are only transit service.'",
        "'speaker_0': 'So I think the the issue is, you know, I think the policy question is, is do we want to increase the amount in the emerging needs bucket to what I think would be a total of 9 million if your amendment passes and I get that.'",
        "'speaker_4': 'Number right at a total of nine, up from six.'",
        "'speaker_0': 'From six. So it would increase that fund by $3 million for emerging needs. So I guess the policy question is, you know, would we rather have the additional $3 million? Go to emerging needs that are not yet known or or do we want it to go to sort of existing needs that we're aware of now in terms'",
        "'speaker_0': 'of transit services?'",
        "'speaker_4': 'I mean, again, we have we have to shift our are the number of people taking the bus from 17% who are taking the bus pre-covid-19 percent. So that is a very known need and perhaps emerging needs is not the right term.'",
        "'speaker_0': 'Yeah, I was just going to pivot to that by saying that that, you know, I think I think these are emerging needs appears to be the category of things that that are still developing, but that we are aware are a gap in how we are able to meet the transit needs of riders throughout the city.'",
        "'speaker_0': 'And certainly the points you make about West Seattle in particular are rather significant. Even in pre-COVID, with with maximum transit services being provided, most busses, if not all of the busses in and out of West Seattle were just packed to the gills.'",
        "'speaker_0': 'And so I think we're going to see even more of that in the future. So. So I, I am going to support Amendment b8b with the understanding that it is going for transit service projects that will help our mobility across across the city and with the understanding that capital projects and needs related to capital infrastructure is dealt'",
        "'speaker_0': 'with in a different part of the levy. And also we are looking at a lot of federal, regional, state, county resources to address that the capital base needs of them. So so I'm I feel comfortable after this discussion and in supporting Amendment eight, the.'",
        "'speaker_0': 'Okay. Any other comments or questions? All right. I'd ask that the clerk please call the role on the adoption of Amendment eight be hours.'",
        "'speaker_1': 'No. Macheda. Rashida. Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'So aren't.'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis. Yes. Herbold.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Whereas.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Council. President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Councilmember was get I didn't get your vote. Okay. Okay.'",
        "'speaker_0': 'So can you. I'm sorry. Can you call and council members get out one more time?'",
        "'speaker_1': 'Sure. Councilmember Mosquito? Yes. Seven in favor, two opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The motion carries an amendment. Eight B is adopted.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'We're going to move along now to Councilmember Strauss, who is going to move Amendment one. So, Councilmember Strauss, I will hand it over to you to make your motion.'",
        "'speaker_2': 'Thank you. Council President I move to amend council 1833 as presented on Amendment one on the agenda.'",
        "'speaker_0': 'Is there a second? Okay. It's been moved and seconded. Thank you. To adopt Amendment one. Councilmember Strauss, you are recognized in order to address Amendment One.'",
        "'speaker_2': 'Thank you. Council President. I spoke at length this morning at council briefing for the viewing public reference. Understanding that we have lost the fourth today and many more agenda items on make this brief here. Six years allows for the continuity of service that four years does not provide.'",
        "'speaker_2': 'It allows us to have a predictable and dependable length of time for us to be able to fund our service. When we look at regional transit benefit districts, which I believe that we need to move to, there is still the opportunity for a regional transportation benefit district to be created in four years as well.'",
        "'speaker_2': 'And if that is the case, it is still important for Seattle to maintain some of its leverage within King County Metro, to be able to provide the level of service that Seattleites desire and require. So again, this is not in competition to a regional measure.'",
        "'speaker_2': 'This creates a continuity of service. If for you, if you have a habitat for years and the regional service, the regional authority was to be stood up, there would still be a six month gap in our ability to collect and implement the level of revenue and the services that we want.'",
        "'speaker_2': 'I do have another amendment to address that issue should this amendment fail and or pass. So we are able to make changes in the future. We are able to go back to voters. What we know now and today is that within this pandemic and this.'",
        "'speaker_2': 'It's. Static surprises, etc. It's hard to tell what next week will look like much less than four years from now. 2020 was set to be the year for a regional merger. I think that it is important that we have the 40.'",
        "'speaker_2': 'To run this Del Transportation Benefit District for six years. Even if we make changes in that. Thank you, Mr. President. Those are my remarks.'",
        "'speaker_0': 'If you can't remember. Strauss Are there any comments or questions on Amendment One?'",
        "'speaker_5': 'Council president, if I may, it's councilmember suarez.'",
        "'speaker_0': 'Yes, please. Councilmember. Whereas.'",
        "'speaker_5': 'Thank you. We had a lengthy discussion on this July 17th, if you'll recall, at ten in the morning, in which the motion to reduce this from 6 to 4 passed. And I was concerned then about reducing the term or the duration from 6 to 4 years.'",
        "'speaker_5': 'In light of some of the comments that we talked about before, the vehicle license fee in 1976, and my concern that Lou Seattle will expire and also some of the transportation dollars that we seek from the county and that particular election year also that the Transit Advisory Board wanted six years.'",
        "'speaker_5': 'And I tend to look to people who have subject matter expertize and who are pretty much waist deep in this stuff to advise us, hence the Transit Advisory Board if we are going to it. 1.1 people wanted to double the tax but lessen the year and then complain that this is a sales tax that's regressive or a'",
        "'speaker_5': 'tax on people. That seemed inconsistent to me. So in light of today's vote, we're now we have a compromise of we're going to the amendments that passed that we are not going to double the tax that we had a compromise.'",
        "'speaker_5': 'And thank you, GONZALES, Castro. GONZALES And look into that. We can look at a tax of .15 percent. And with Council Member Herbert's recent passage that we just did on her amendment, which I think was phenomenal, I again, I'm going to voice my support that this should have stayed at six years.'",
        "'speaker_5': 'And I can only say that it's a taxing authority. And our ability to have something on the ballot when we agree to tax ourselves is very powerful. And just a quick note. I know there's been a lot said today about a lot of things, and I'm not going to talk a lot because I don't think there should'",
        "'speaker_5': 'be an award show where we have to thank everybody in God. I just want to say that. I just a big proponent of putting things on the ballot when it comes to a tax. It doesn't mean that I'm against or for.'",
        "'speaker_5': 'It means, I think that people should decide and we should give them credit for that, that they have an idea of what's going on. The proposition that this council member me that somehow I'm against the police, against things and for the police is categorically wrong.'",
        "'speaker_5': 'Again, I'm back to a plan, a percentage. How we get there, what we decide to put out to the voters and what we don't, and that we have a respectful conversation about how that happens. And I'm sorry for that.'",
        "'speaker_5': 'Also, I note that, you know, I wasn't I wasn't able to be there this morning. So anyway, I am going to voice support for Councilmember Dan Strauss's amendment that the duration of this should go back to six years, not for for the reasons that were stated earlier.'",
        "'speaker_5': 'And Council President, thank you for giving me the opportunity to vent just a tad.'",
        "'speaker_0': 'Not at all. Thank you so much for your comments. Are there any. I see. I see more hands up. So we will now hear from Councilmember Lewis and Councilmember Herbold. We'll follow him as well. Lewis.'",
        "'speaker_2': 'Thank you so much, Madam President. So, as with the other day, I remain committed to the four year. I mean, I think all of us can agree that this is not a ideal transportation benefit district, given that all of our tools are tied up either in court or they haven't been invented yet.'",
        "'speaker_2': 'I think forcing the conversation earlier, as I discussed this morning during briefing, is the better course forward to get what I think we would all like to see, which is the county wide transit benefit district with the $100 car tap fees and with a with a 1% sales tax that is more broadly assessed rather than only on'",
        "'speaker_2': 'taxpayers. I would like to see that sooner rather than later. I think that setting it at four years creates that sense of urgency, and that is why I'd like to stick with it. I don't want to see the the imperfect transit benefit district we're going to make.'",
        "'speaker_2': 'Last more than that. It needs to last longer than it needs to.'",
        "'speaker_0': 'Councilmember Herbold, please.'",
        "'speaker_4': 'Thank you. I first want to thank Councilmember Strauss for bringing this back before us. I really appreciate this as somebody who voted in the minority last time in support of the six years. But we're having another another opportunity to discuss the pros and cons of both terms.'",
        "'speaker_4': 'I really believe that a six year term will give us more leverage in negotiation. We can opt not to collect funds in years five and six in the event of a successful regional measure. If and as it relates specifically to us having more leverage in a regional measure, if this is a six year term, I think that's'",
        "'speaker_4': 'simply because if Seattle has funding in place, our bargaining position is better. And one of the reasons why this is so important is because our measure includes funding for programs to support transit, access to low income residents, seniors and youth core, including the Work Opportunity Program, which, as we know, provides transit passes for Seattle Public School students'",
        "'speaker_4': 'in grades K through 12, as well as students participating in the Seattle Promise Scholarship Program, as well, again, as programs targeted to seniors and public housing residents. I think, again, our bargaining position is stronger to preserve the funding for these kinds of programs with the six year levy.'",
        "'speaker_4': 'And if a four year levy is on the verge of of expiring. Also, if a four year King County measure failed in 2020 for the county or the city would need to go to the ballot. And perhaps very early 2025, as we had to do after the April 2014 countywide measure, failed with 46% of the vote that'",
        "'speaker_4': 'year. So again, that doesn't give us very much time to come up with an alternative measure. And I just I don't want to repeat the experience this year when we were hoping that the county would put a regional ballot on a regional measure on the ballot.'",
        "'speaker_4': 'And as as we've seen, we've had to scramble a bit here to to get our version on when that didn't happen. I served on the Regional Transit Committee last year, and it was definitely challenging for King County Council members who wanted to be able to move forward.'",
        "'speaker_4': 'I don't want our city to be left in the position that we were left in, in 2014 and again this year, when we had to vote on a really quickly developed measure. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Herbold, are there any other comments on proposed Amendment one? Casimiro Mosqueda. Thank you, Madam President. I just wanted to signal, as I did at the beginning of today's discussion, that I will be supporting moving from four years to six years again.'",
        "'speaker_0': 'I know that we are all committed to working on a regional approach. The resolution that Councilmember Peterson and I are bringing forward later today will help with that stated commitment as we work for both more progressive options and faster options in our region.'",
        "'speaker_0': 'The STV package of six years supports better long term planning for that, and nothing prevents the city from replacing us with a regional package in four years to those conversations continue with the county and that they go well.'",
        "'speaker_0': 'So I did support four years previously. Now that we've increased the amount and we have some progressive revenue in hand, I think it makes sense to go to six years and ensure that we have the substantial amount of work, that we have more money to help with some of our critical services as we continue to engage with'",
        "'speaker_0': 'our county partners. So I'll appreciate both of these items going hand in hand and I'll be supporting six years. Any other comments? Everyone else.'",
        "'speaker_3': 'Thank you. Just quickly, I just want to restate my concurrence with Councilmember Lewis. I do think that we need to have the opportunity to have the conversation sooner with our regional partners. I don't think even with the additional funding that we are going to be able to have now that this is the package that will truly meet'",
        "'speaker_3': 'the needs of our community. And I think the sooner we can move toward a regional solution and encourage a different kind of conversation about how we fund transit in the area, the better all of our neighbors will be served.'",
        "'speaker_3': 'So I plan to continue supporting this. Sorry. Continued support for years over six.'",
        "'speaker_0': 'Okay. Any other comments, colleagues? Oh. Councilmember Strauss. Close out debate, please.'",
        "'speaker_2': 'Just wanted to say thank you to you Council President and Councilmember Juarez for your grace and spaces we take at a large, important issues before us all, virtually. And while there is a series and layers of other crisis facing our nation.'",
        "'speaker_2': 'So thank you for your patience, grace and space with me as we delve into the duration of this. Benefit District. Thank you.'",
        "'speaker_0': 'Okay, colleagues. So I'm going to go ahead and close out debate. And I'd ask that the clerk please call the roll on adoption of Amendment One.'",
        "'speaker_1': 'MORALES No. No. Sarah, I. Peterson.'",
        "'speaker_2': 'I just.'",
        "'speaker_1': 'So. No. Strauss. Yes. Lewis.'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'Herbold.'",
        "'speaker_4': 'I am sorry. Yes.'",
        "'speaker_1': 'Suarez.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Council President Gonzalez.'",
        "'speaker_0': 'Now.'",
        "'speaker_1': 'Five in favor, four opposed.'",
        "'speaker_0': 'The motion carries an amendment, one is adopted. Are there any further comments on. Oops. Sorry. Hold on a minute. Yeah. Motion carries and amendment one is adopted. We're going to go ahead and now move to Amendment. Seven. BE Which is Councilmember Strauss's amendment.'",
        "'speaker_0': 'So, Councilmember Strauss, I am going to ask you to make your formal amendment of seven B so that it can be before the council.'",
        "'speaker_2': 'Thank you. Council President A move to amend council bill 119833 as presented on seven feet.'",
        "'speaker_0': 'Is there a second? Second, it's been moved and seconded to adopt Amendment seven. Councilmember Strauss, you are recognized in order to address the amendment.'",
        "'speaker_2': 'Thank you. Council President. I'm bringing forth this amendment. Technical correction. This is meant to cover the delay in tax collection that occurs in the Department of Revenue implements a new measure. It would have been useful in the last measure.'",
        "'speaker_2': 'And assuming the sale transportation benefit district passes at the ballot box, we will still need to have a collection. We will have a collection gap. And this amendment ensures that the next time we're faced with this choice, we will be funded through the implementation of the next measure.'",
        "'speaker_2': 'Which means that there. This will ensure tax collection from January 1st, 2027. The first 2027 income tax.'",
        "'speaker_0': 'Thank you, Councilmember Strauss. Any questions about Amendment 70? Okay. Hearing, then we will go ahead and call the roll. I'll ask the clerk to call the roll on the adoption of Amendment seven B or else.'",
        "'speaker_1': 'Yes. Must. Yes. Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Excellent. Yes. Strauss.'",
        "'speaker_2': 'Yes. LEWIS Yes.'",
        "'speaker_4': 'HERBOLD Yes.'",
        "'speaker_1': 'Whereas.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_1': 'Council President Gonzales.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The motion carries an amendment. 70 is adopted. We are now going to move to the to amendment three. So I will move to amend Council Bill 119833 as presented on Amendment three on the agenda.'",
        "'speaker_0': 'Is there a second?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. It's been moved and seconded to adopt Amendment three as sponsor of the amendment. I'll address it really quickly. Pretty simple, straightforward amendments. We add a recital clause that acknowledges that transit provides mobility to essential workers as they perform essential functions to combat the COVID 19 emergency.'",
        "'speaker_0': 'It also revises Section two, Item C, to allow the low income program a bucket of dollars to be spent and used to provide transit passes for low income medical workers, health care workers, first responders, pharmacy workers, grocery store workers, and other workers deemed essential by any state order.'",
        "'speaker_0': 'So so the effect of this is to simply include essential workers in that levy spending plan if the voters approve the levy. I'm happy to answer any questions or hear any comments on Amendment three. Colleagues. Any. Any questions or comments?'",
        "'speaker_0': 'Okay. Hearing them, I will ask that the clerk please call Madam President. Oh, yes, please. I just wanted to chime in and say thank you for bringing this forward. I think that it's really smart to include this amendment here today to make sure that essential workers are explicitly called out and that we emphasize our ongoing support, not'",
        "'speaker_0': 'just for the work that they're doing right now, but for programs to support them. And during this crisis that is covered, we know that there is increased need for us to continue to elevate this this type of work and make sure that we're not decreasing services there.'",
        "'speaker_0': 'So I just want to say thank you, because I feel like this amendment strikes a very nice, healthy balance of what we want to accomplish and the emphasis on essential workers. Thank you so much. Casper Mosqueda, any other comments on Amendment three?'",
        "'speaker_0': 'Seeing none, I would ask that the clerk please call the role on the adoption of Amendment three.'",
        "'speaker_1': 'Morales. Yes. Must get a.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Salon? Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'LEWIS. Yes. Herbold.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Suarez.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Council. President Gonzales.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The motion carries and Amendment three is adopted. And we will go ahead and now move to the substantive bill. There are no additional there are no additional amendments for us to consider on this council bill.'",
        "'speaker_0': 'So I will make a general call for any comments on the council bill as amended. And Councilmember Peterson, you will get the last word when we close out debate. Colleagues, any questions on the council bill as amended? Seeing none.'",
        "'speaker_0': 'Well, I'll go ahead and recognize Councilmember Peterson for final remarks, and then we will call the roll on this bill.'",
        "'speaker_2': 'Thank you. Council President. You sure the no more amendments? No, I'm just kidding. This is a good day for public transit. Many were concerned that with the turmoil and uncertainty of the COVID pandemic and economic recession, we might not be able to renew the funding for this transportation benefit district.'",
        "'speaker_2': 'In fact, our colleagues at King County had to temporarily abandon a regional measure as they shifted their attention to the public health crisis. So it was up to us here in Seattle to beat the clock before the money for transit expired.'",
        "'speaker_2': 'Fortunately, we share a common ground that public transit is an essential and affordable option to move the most people in our region. As we look forward to a vibrant economy and a healthy planet. And despite the divisions and conflicts that many people might see reported in the media, the mayor and the city council can pull together and'",
        "'speaker_2': 'row in the same positive direction when we direct our energy toward the hard responsibility of governing. It was healthy for us to have this robust, yet respectful debate on the tradeoffs of the various details and then to compromise to move it forward.'",
        "'speaker_2': 'It may not be perfect for each of us, but it is necessary for everyone. We are ready to send that Seattle Transportation Benefit District to the voters. Let's do this.'",
        "'speaker_0': 'Thank you, Councilmember Peterson, for those remarks. I just wanted to before we have the clerk read excuse me, before we have to call the roll. I did want to take a quick moment to publicly thank Kelvin Chow from our council central staff policy analyst who's been working on this issue and really appreciate all of his work.'",
        "'speaker_0': 'And as you can, as the members of the public will see, we have kept it we kept him busy until the very last minute with all of these important amendments for our consideration. So thank you to Cowles. I wanted to thank my my own chief of staff, Brianna Thomas, for her work in shepherding the various amendments from'",
        "'speaker_0': 'my office through the process. So thank you all for the good conversation. And let's go ahead and have the clerk read excuse me, have the clerk call the roll on the passage of the bill as amended.'",
        "'speaker_1': 'Morales. Yes. Sarah. Yes. Paterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Swans? Yes. Strauss.'",
        "'speaker_2': 'Yes. LEWIS Yes.'",
        "'speaker_4': 'HERBOLD Yes.'",
        "'speaker_5': 'SUAREZ Yes.'",
        "'speaker_1': 'Council President Gonzales.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Nine in favor and unopposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The bill passes as amended and the chair will sign it. I'd ask that the clerk please affix my signature to the legislation on my behalf. Moving through our committee reports, we are now going to consider agenda item two.'"
    ],
    "A RESOLUTION relating to transit funding; declaring The City of Seattles resolve to work with King County on a future countywide transit measure, pursue progressive revenue options to replace the sales and use tax, and focus on equity and sustainability concerns.": [
        "'speaker_0': 'Will the clerk please read item two into the record? The clerk might be on mute.'",
        "'speaker_5': 'Thank you. Every part of the City Council Agenda Item two Resolution 31960 relating to transit funding to the City of Seattle resolved to work with King County on a future countywide transit measure. Pursue progressive revenue options to replace the sales and use tax.'",
        "'speaker_5': 'I focus on equity and sustainability.'",
        "'speaker_0': 'Thank you, Madam Clerk. I will move to adopt resolution 319860. Is there a second? Second? It's been moved and seconded. And I'm going to go ahead and recognize Councilman Mosqueda, you're as the prime sponsor of the resolution. You are recognized in order to address this item.'",
        "'speaker_0': 'Thank you, Madam President. In order to put the resolution as amended in front of us, I'd like to move to amend Resolution 31960 by substituting version four for version three. Second, it's been moved and seconded. Thank you to adopt the substitute councilmember Mosqueda.'",
        "'speaker_0': 'You are recognized in order to address the substitute. Thank you very much. And again, colleagues, I think this is a very exciting vote that we just took. So the resolution here today is coupled with the important piece of legislation that we just voted on to send to the ballots.'",
        "'speaker_0': 'It's complex in its nature that we're facing economic crisis at the same time that our lower wage households and most vulnerable families will need government services even more so, given the uncertainty that's created due to COVID and the impacts of Initiative 976 on the economic downturn.'",
        "'speaker_0': 'The proposal that will be on the ballot will be critical to making sure that people can access needed services. But the resolution calls for us to continue to do more. We know that there is uncertainty in economic recovery in front of us.'",
        "'speaker_0': 'We know that it is important for us to continue to invest in the resiliency of our community and that we can do so as we couple and work together with our county partners. Particularly, it's important for us as a region to continue to invest in our lowest income communities who are disproportionately people of color and disproportionately impacted'",
        "'speaker_0': 'by COVID and the economic recession and frankly, the inequitable economy that we had prior to COVID. Transit is a lifeline for all of our communities as we try to promote the use of transit and non car modes of transportation.'",
        "'speaker_0': 'It's important for us to continue to invest in those systems, especially for making sure that lower income folks and all Seattleites are able to access transit in this downturn in spite of lower ridership over the last several months due to COVID since estimate was approved in 2014.'",
        "'speaker_0': 'Transit ridership has increased significantly in Seattle. We needed the measure that we just passed, and we also need our county partners to continue investing with us to create a progressive system that will directly benefit our entire region, including low income communities.'",
        "'speaker_0': 'So the resolution that's been put forward in front of us is really a partnership, a partnership with King County, the jurisdictional partners, community advocates, transit advocates to re regionalize transit spending and create a future that is planning for a county wide transit measure.'",
        "'speaker_0': 'This resolution works towards replacing regressive sales tax and uses taxes in a more progressive way to fund transit services in Seattle with other progressive revenue sources. We've spent a lot of time over the last few weeks talking about the regressive nature of the tools in our tool belt, and we just talked about it this afternoon.'",
        "'speaker_0': 'The resolution in front of us puts forward our commitment to making sure that future transit packages are moving towards more progressive nature of transit sources, revenue sources for these important transit needs. And we'll also be raising revenues so that we can have a more robust investment in transit services around our region.'",
        "'speaker_0': 'The resolution, as I mentioned this morning, follows a letter sent by council president council by King County Council President Councilmember Bellucci and signed by Executive Constantine and King County members Coles and Bousquet and the group who affirmed their intention to engage in conversations around regional transportation benefit district conversations.'",
        "'speaker_0': 'Part of their letter reads Transit has provided much needed mobility options for essential workers and first responders and has helped to ensure that the people throughout King County have had a way to get to essential services, including grocery stores and medical treatment.'",
        "'speaker_0': 'Even with transit services significantly reduced in response to COVID, the network has continued to function, currently providing more than 125,000 trips a day. During the last few months of the pandemic closures, for instance, we've seen that the routes with the least reduction in ridership have primarily been from those in South Seattle and South King County.'",
        "'speaker_0': 'Those communities are using transit still to make sure that they can access key, essential trips to workplaces, to shopping, to childcare and other critical services like health care. I'd like to thank Councilmember Peterson for co-sponsoring this resolution and Mayor Durkin for concurring on it, as our understanding is that they will concur.'",
        "'speaker_0': 'I also want to thank advocates who spent time on both the legislation that we just passed and specifically the resolution in front of us from transportation choices rooted in rights, MLK, Labor and Puget Sound sage also to Blake Trask from Councilmember Paul Duties Office and my office.'",
        "'speaker_0': 'Thank you to Sigal, Perry and Aaron House for all of their work, both on the resolution and on the previous STB package that we just approved. Really appreciate your work. Thanks to Councilmember Peterson for helping shepherd us to this.'",
        "'speaker_0': 'Thank you so much. Are there any other comments on the resolution? How's Mercyone?'",
        "'speaker_3': 'Thank you. I will be voting in favor of this resolution for regional funding for Metro because working class people need transit service beyond Seattle's city limits, and especially as the cost of housing has pushed more and more working people, especially working people of color outside city limits.'",
        "'speaker_3': 'However, it is also important that we not allow the idea of regional funding to be used. As an excuse by any any any body in the city council to be used as an excuse for opposition to local progressive transit funding options.'",
        "'speaker_3': 'I'm not implying that this resolution is doing that, but I'm just saying that in general, I think we have to be aware of that because I recall when we started fighting for the Amazon Act in our movement, the Mayor and the Chamber of Commerce immediately responded by saying the issues of housing and homelessness were regional problems, which'",
        "'speaker_3': 'we don't disagree with. The regional problems, in fact, this is a nation wide problem. And but they said that therefore the city of Seattle should not tax big business to address them. I support the county or state enacting progressive taxes on big business or super rich to fund transit.'",
        "'speaker_3': 'In fact, I will warmly welcome any such development, but I don't think that given the past decades trajectory, we can we can just wait for them to do so. We will have to continue fighting to implement progressive developer impact fees.'",
        "'speaker_3': 'And I certainly in my office will be continuing that to fund transit and to use developer impact these funds transit in 2021. And I urge the ordinary people in the movement that we not be sidetracked by the vain hope that we have heard many, many times of progressive county funding or regional funding in general.'",
        "'speaker_0': 'There any additional comments? Customer referral, please.'",
        "'speaker_4': 'Thank you. So just real quickly, I want to just speak as a councilmember who represents a district at the southern edge of Seattle that we've really taken a deep, deep dove in our discussions around the Seattle Transportation Benefit District about how bus service doesn't stop at the city limits and the logic for designing routes doesn't necessarily fit'",
        "'speaker_4': 'with city boundaries. In fact, some of the bus service that very large numbers of people depend on have more stops outside of the city limits than within the city limits. So it's really important in designing this levy and in future levies that we struggle with how to provide service and what level of service for routes that go'",
        "'speaker_4': 'across the city limits but that our constituents desperately rely on. And this resolution or regional approach to transit funding is really important for that reason and many others as well. Thank you.'",
        "'speaker_0': 'Thank you so much, Councilmember Herbold. Any other comments on the resolution? Hearing none at the Clark. Please call the role on the adoption of the substitute Morales.'",
        "'speaker_1': 'Yes. Macheda?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Petersen.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sarwan. Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Herbold. Yes. Whereas. Council President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor, nine opposed.'",
        "'speaker_0': 'Thank you so much. The motion carries the substitute as adopted in version four of the resolution is before the council. Are there any additional comments on the resolution as amended? Okay. Hearing man, I'd ask that the clerk please call the role on the adoption of the resolution as amended.'",
        "'speaker_1': 'Morales. Yes. To.'",
        "'speaker_0': 'Sorry. Yes.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Slant? Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'HERBOLD. Yes. Council President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor and opposed.'",
        "'speaker_0': 'Thank you, Madam Clerk. The resolution, as amended, is adopted in the chair, will sign it as the clerk sees it. Fix my signature to the legislation on my behalf. Colleagues, really quickly, if there is no objection, Councilmember Juarez will be excused from the remainder of the July 27 city council meeting.'",
        "'speaker_0': 'Hearing no objection. Councilmember Suarez is excused from the remainder of today's city council meeting. Thank you so much. I'd now ask that the clerk please read agenda item three into the record.'"
    ],
    "A RESOLUTION establishing the City Councils goal to implement Internet for All Seattle, a vision of enabling all Seattle residents to access and adopt broadband internet service that is reliable and affordable.": [
        "'speaker_5': 'Agenda Item three. Resolution 31956. Establishing City Council's Goals to implement Internet for All Seattle Edition of enabling all residents to access and adopt broadband Internet service that is.'",
        "'speaker_0': 'Reliable and affordable. Thank you, Madam Park. Councilmember Peterson, we'll get to you right now. So just wanted to queue you up there. I will move to adopt resolution 31956. Is there a second?'",
        "'speaker_2': 'Second?'",
        "'speaker_0': 'Great. Thank you so much. Councilmember Peterson, you're the prime sponsor of this resolution that I had an opportunity to co-sponsor with you, and I'll hand it over to you in order to address the resolution.'",
        "'speaker_2': 'Thank you, Council President. I will also be reading the remarks from Councilmember Juarez, who's also another co-sponsor. So this, colleagues, is the Internet for all resolution resolution 31956. I announced and distributed the resolution on May 18 and we introduced it officially on July six.'",
        "'speaker_2': 'And we are happy to have the leadership of Council President Gonzalez and Councilmember Juarez and I know other Council members support this. So thank you for your commitment and leadership to this, the social justice technology issue. I do want to acknowledge the Executive for their efforts thus far to pursue digital equity and to acknowledge the over 25'",
        "'speaker_2': 'meetings. My staff had initial preliminary meetings with stakeholders. This will continue this outreach and engagement process. Our Department of Information Technology will continue this process, really this resolution. Kick starts the process of expanding access and adoption of Internet that's reliable and affordable.'",
        "'speaker_2': 'There is a substitute resolution. So Council President can remind me on the parliamentary procedure for that. That substitute simply makes minor and technical corrections and fleshes out a few sections. Staff distributed this. It's on the agenda today. The big picture is that this is just a resolution that outlines our aspirational goal.'",
        "'speaker_2': 'It states the importance of providing Internet access to all residents in Seattle and begins the work of hearing back from our Department of Information Technology. In a city that prides itself in leading the world in technology, the COVID crisis has laid bare the inequities and injustice of the digital divide.'",
        "'speaker_2': 'We can no longer allow limited Internet access to prevent learning, to impede our workers or to hinder our small businesses and nonprofits. In the words of a local nonprofit leader here in Seattle that supporting this resolution. Inequities in Internet access lead to disparate outcomes.'",
        "'speaker_2': 'Access to the Internet has become a fundamental way people participate in society. This proposal will move us closer toward equitable Internet access. It's time to ensure reliable and affordable access to the Internet as part of our city's vital infrastructure for social justice, for education, and for economic development.'",
        "'speaker_2': 'Let me now please read the comments from co-sponsor Deborah Juarez. Councilmember Juarez writes, With the advent of the COVID crisis, inequities in our society have been exposed. We have seen schoolchildren unable to access school work because of lack of access to technology.'",
        "'speaker_2': 'We've seen small businesses challenged to adapt to an economy that is more dependent on the Internet than ever before. This resolution presented today will help us take a solid step forward. We need to expand Internet access and make it more affordable to empower all students to participate in remote learning and to enable our small businesses to succeed'",
        "'speaker_2': 'in this new economy. I, Councilmember Juarez, have long advocated for equity and access by working with groups such as literacy soars. Our public library system and I'm pleased to have been a co-sponsor on this resolution to further expand Internet access for all.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Peterson. We do have to get a substitute version before us. So I would look to you to make the formal motion to introduce substitution version three for version to be.'",
        "'speaker_2': 'Yes. I'd like to move the substitute version to resolution 31956 as published on today's agenda.'",
        "'speaker_0': 'Thank you so much. Is there a second?'",
        "'speaker_4': 'Second?'",
        "'speaker_0': 'It's been moved and seconded to adopt the substitutes. Councilmember Peterson, I know that you just addressed the substitute. Are there any additional comments either from you or other colleagues on the substitute? Hey, hearing none of the Clark, please.'",
        "'speaker_1': 'Probable. Sorry.'",
        "'speaker_0': 'Okay, now, that's. That's okay. We're just voting on a substitute bill right now so that we'll will be voting on the on the whole whole thing in just a minute. Okay, great. So let's go ahead and have the clerk call the role on the adoption of the substitute.'",
        "'speaker_1': 'Morales. Yes. Mosquito? Yes. Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'So want. Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Verbal? Yes. Council President Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor and unopposed.'",
        "'speaker_0': 'I thank you so much. The motion carries the substitute is adopted and version three of the resolution is now before the council. And I'm going to go ahead and open it up now to colleagues for further comments on the resolution.'",
        "'speaker_0': 'I think I saw Councilmember Sawant first, then Councilmember Morales, and then Councilmember Herbold as a person, please.'",
        "'speaker_3': 'Thank you. I will be voting yes on this resolution, of course. Comcast and other for profit Internet service providers are not interested in internet for all or even in quality internet for some. Actually, they are interested in their own profits.'",
        "'speaker_3': 'That's why they make the internet so expensive. And that's why they sign up. Sign you up at one rate only to have your bills skyrocket. That is why your internet runs is at 1/10 the advertised speed. If you're lucky.'",
        "'speaker_3': 'What we really need is municipal broadband run like a utility. Public utility. My time with the council, I've seen many, many studies and reports on Internet for all and on municipal broadband. This resolution requests another report, and I will support that.'",
        "'speaker_3': 'But what has been missing in all these years is not another report. What has been missing is the political will to take on Comcast and actually build out a municipal broadband network in the city. Political will is the central component here because Comcast is completely opposed.'",
        "'speaker_3': 'Pass and other telecom corporations are completely opposed to municipal broadband. And winning municipal broadband, therefore, will require elected officials willing to take on the might of Comcast. The people's budget movement in the past has fought for the funding to build the pilot.'",
        "'speaker_3': 'It was proposed by one study that is building municipal broadband as a public utility in one neighborhood. Seeing learning lessons from that and then building out and building it out in the entire city. But at that time, the majority of the council did not agree.'",
        "'speaker_3': 'This autumn, though, this coming autumn, this year, the people's budget will bring that proposal back, the proposal to have a pilot program for municipal broadband. And I believe that all council members who will vote yes on this resolution today should vote yes on that proposal also.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. So what next stop is Councilmember Morales? And then we will hear from Councilmember Herbold.'",
        "'speaker_3': 'Thank you, colleagues. I do appreciate this resolution. Several years ago, I was working with the Upgrade Seattle folks to try to get municipal more interest in municipal broadband at the city council. So I do think it's important that we seek out the kind of solutions that other cities have tried and, you know, understand what lessons they've learned'",
        "'speaker_3': 'about municipal broadband. I would love to see that language restored. Well, I'm looking at the wrong version of the resolution. But I think more importantly, what I want to say is that there are two things that make sure we continue to bear, Doug, as my Texas family would say.'",
        "'speaker_3': 'A commitment to ensuring that the dog, once policies are followed so that whenever the city digs up the street or constructs a bike lane, that they put that publicly owned fiber down, that 90% of the costs of expanding a network in the first place.'",
        "'speaker_3': 'The second thing is that, you know, as Councilmember Stewart was saying, we've got stacks of reports. We know that this is an important tool, especially. That issue has been brought into relief in light of COVID and the understanding of how deeply inequitable access to Internet is in our community, especially for young kids who are struggling with trying'",
        "'speaker_3': 'to get their schoolwork done. So I really think we need to commit to a plan, a shovel ready municipal broadband plan, so that if there is any federal stimulus money that might be coming down the pike in the next couple of years, we can apply and we have our project ready to go.'",
        "'speaker_3': 'I think develop developing a plan for how we would build that out could really support any efforts that we want to make for potential federal money. You know, and we will need hundreds of millions of dollars to get this done.'",
        "'speaker_3': 'But Chattanooga did it. I think we need to be prepared to do it, too.'",
        "'speaker_0': 'Councilmember Morales for those comments. Councilmember Herbold.'",
        "'speaker_4': 'Thank you. So as we all know, everybody gets really excited about Internet for all. But in the past, when the city has studied implementing municipal broadband, the capital costs have proven to be a really big barrier. And it's my hope that we can, through the work of this resolution, allow for the consideration and study of more creative'",
        "'speaker_4': 'methods to building a municipal broadband network. Last year, I was really excited about a statement of legislative intent that I had proposed, and the statement of legislative intent would have directed Seattle Public Utilities to examine the feasibility of utilizing the city's white water pipe infrastructure for developing a municipal broadband network.'",
        "'speaker_4': 'I put forward the slide last year. Unfortunately, the budget does not bring it forward, and I was inspired by the success in an accord where they achieved significant cost savings and drastically minimized street disruptions by not having to rip up the streets because they were able to feed fiber optic cable into the water pipe.'",
        "'speaker_4': 'So I want to thank Councilmember Peterson and his staff for including mention of exploring this creative method to build a municipal broadband network. And then lastly, I want to just echo what we all know to be true, that the public health emergency has laid bare the gaps in access to so many essential services in our city.'",
        "'speaker_4': 'Access to Internet is no exception. And COVID 19 has showed us that it is more important now than ever that the city must ensure that everyone has reliable and affordable access to the Internet so that we can work safely from home, and so that our children have reliable access to continue their education.'",
        "'speaker_0': 'Thank you, Councilmember Herbold. Are there any other comments on the resolution? Okay. Oh, customer data, please. Thank you to the sponsors of the resolution. Can you just quickly summarize for me what the next steps are after this passes today, which I'm going to enthusiastically support?'",
        "'speaker_2': 'I sure. I'll go ahead and take that question. The next steps are. It puts it in the court of the executive. So the which who we've been talking to during the development of this resolution, they're already doing digital equity work, but we need them to come back to us with their initial short term, long term solutions and'",
        "'speaker_2': 'how they're going to put forward the action plan for implementing this. And so they're going to come back. Ideally, we'll be having the committees in September. So they're going to come back in the middle of September right before the budget is unveiled by the mayor for this fall budget process.'",
        "'speaker_2': 'In case there are any financial implications for what they're proposing to do. So, hope to hear back from Seattle Department of Information Technology, Wednesday, September 16 and the Transportation and Utilities Committee.'",
        "'speaker_0': 'Thank you very much. I thank you, Councilmember Peterson, for for that description. I think the resolution, the substitute version, aside from reestablishing and reiterating the city council's goals around enabling Seattle residents to access and adopt a broadband Internet service that is both reliable and affordable, and it does also do a thorough and succinct gap analysis.'",
        "'speaker_0': 'So this gap analysis would include lists, would include no cost and low cost programs that are already available in the city of Seattle, while also then looking at where the actual gaps in affordable Internet access and adoption for Seattle residents exists.'",
        "'speaker_0': 'And so this would be, I think, an update to excuse me. It would it would be sort of that novel approach that Councilmember Herbold has been sort of referenced. And so I think I think for me, the biggest part about this is sort of really getting into that gap analysis.'",
        "'speaker_0': 'It's also an opportunity for us to look at lessons learned from other cities who've been able to be successful in this effort. And then and then also creating an action plan that details recommended steps for that the city of Seattle can take to to expedite universal universal access to and adoption of affordable broadband Internet service for Seattle'",
        "'speaker_0': 'residents. And to do that in the construct of meaningful partnership with nonprofit organizations, business community, philanthropic interests, Seattle public schools, etc., etc.. And so it also, I think, will be important that action plan also include questions around the infrastructure, what resources might be needed in order to implement the action plan and and a timeline that that we'",
        "'speaker_0': 'would like to finally have as part of a clear workplan action plan on this. Because for those of us who've been serving on the council for a while, we know this is not the first time we've we've addressed issues related to broadband access.'",
        "'speaker_0': 'And so and so I think it's important for us to to make sure that we're advancing the ongoing analysis around Internet for for all. So I was really proud to be able to work with Councilmember Peterson and his office on co-sponsoring this resolution.'",
        "'speaker_0': 'And we'll belabor all of the points that folks have made. Obviously, we are seeing in this pandemic the disproportionate impact of the lack of Internet access when most of us are functioning almost entirely in our professions via the Internet.'",
        "'speaker_0': 'And and I think it's it's it's so important for us to finally pull together an action plan to implement the many previously stated goals of the city. And now is is the time to do that. So really excited about the opportunity to advance this resolution and advance this body of work.'",
        "'speaker_0': 'Any other questions or comments on the resolution before we call this to a vote? All right. Hearing none. I would ask that the clerk please call the roll on the adoption of the resolution as amended.'",
        "'speaker_1': 'Morales. Yes. Must. S Petersen. S Swans. Yes. Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'HERBOLD.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Council president Gonzalez.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor and in oppose.'",
        "'speaker_0': 'The resolution as amended is adopted and the chair will sign it and as the clerk, please affix my signature to the legislation. Okay, folks. Agenda item for us that the clerk please read. Agenda item four into the record.'"
    ],
    "A RESOLUTION approving a Memorandum of Agreement with Seattle Pacific University regarding the establishment, composition, and rules for a Citizens Advisory Committee for preparation of a Major Institution Master Plan for Seattle Pacific University.": [
        "'speaker_5': 'Agenda item for resolution 31958 Approving Memorandum of Agreement with Seattle Pacific University regarding the establishment of Composition and Roles for Citizens Advisory Committee for Preparation of a Master Institution. Master Plan for Seattle Pacific University.'",
        "'speaker_0': 'Thank you, Madam Clerk. I will move to adopt resolution 381958. Is there a second?'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you so much. It's been moved and seconded by Councilmember Strauss, a sponsor of the resolution. You're recognized in order to address the item.'",
        "'speaker_2': 'Thank you. Council President. Agenda item number four, which is Resolution 3198, approving a memorandum of understanding subsequent to the resolution. This resolution is an early step in this process for applying for new media institutions back to the city.'",
        "'speaker_2': 'Once a major institution informs the city of its intent to complete a new master plan. They're required to form Citizens Advisory Board or Advisory Committee in consultation with the Department of Neighborhoods. This resolution approves the new memorandum of Understanding with South Pacific University to establish its Citizens Advisory Committee and its membership.'",
        "'speaker_2': 'The membership of the committee has been recommended for approval by Department of Neighborhoods and has already been done informally because these masterplans are quasi judicial in nature. We should not be discussing the merits or demerits of the masterplans themselves.'",
        "'speaker_2': 'Rather instead, keep conversation limited to the memorandum of understanding or agreement up before us. Read this again on the subject of the judicial process.'",
        "'speaker_0': 'Thank you. Councilmember Strauss, are there any comments on the resolution? Hearing. Man Will the clerk please call the role on the adoption of the resolution?'",
        "'speaker_1': 'Morales. Yes. Mosquera. Yes. Peterson.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Silent. Yes. Strauss. Yes.'",
        "'speaker_2': 'LEWIS Yes.'",
        "'speaker_1': 'HERBOLD Yes. Council President Gonzalez?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor, nine oppose.'",
        "'speaker_0': 'Thank you, Madam Clerk. The resolution is adopted and the chair will sign it and ask that the clerk please affix my signature to the legislation. Agenda Item four. Will the clerk please read item? I'm sorry. Five. Well, the clerk please read item five into the record.'"
    ],
    "A RESOLUTION approving a Memorandum of Agreement with Seattle Central College regarding the establishment, composition, and rules for a Citizens Advisory Committee for preparation of a Major Institution Master Plan for Seattle Central College.": [
        "'speaker_5': 'Agenda Item five. Resolution 31959. Approving a memorandum of agreement with Seattle Central College regarding the establishment, composition and Rules for Citizens Advisory Committee for Preparation of a major institution masterplan for Seattle Central College.'",
        "'speaker_0': 'Thank you so much. I will move to adopt resolution 31959. Is there a second second? It's been moved and seconded. Councilmember Strauss, you are the sponsor of this resolution and are recognized in order to address the item.'",
        "'speaker_2': 'Thank you. Council President. Agenda item number five is this is similar to the reform which is approving a memorandum of agreement with South Central College this time. So it serves the same purpose as the previous resolutions in specified for South Central College.'",
        "'speaker_2': 'We will again approve the Memorandum of Agreement with South Central College to establish their own Citizens Advisory Committee and its membership. Membership of this committee has also been recommended.'",
        "'speaker_0': 'Thank you. Councilmember Strauss, are there any comments on the resolution? Hearing? No. Will the clerk please call the role on the adoption of the resolution?'",
        "'speaker_1': 'Morales I. Mosquito.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Peterson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'So what.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Strauss.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Lewis. Yes. Herbold? Yes. Council President Gonzales?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Eight in favor. Nine opposed.'",
        "'speaker_0': 'Thank you so much. The resolution is adopted and the chair will sign it. And as the clerk fees affix my signature to the legislation. Okay. Agenda items six through eight. Will the clerk please read items six through eight?'",
        "'speaker_5': 'Agenda Item six through eight appointments 1586 through 1588 Appointment of patients Messrs. Andrew Malaba as members of the Planning Commission for April 15, 2021, and appointments of Catherine Direct and Lawrence Squires as member Seattle Planning Commission for Term two, April 15th, 2022.'"
    ]
}