{
    "AN ORDINANCE relating to Volunteer Park; authorizing the Superintendent of Parks and Recreation to enter into a development agreement and lease with the Seattle Art Museum for the renovation and continued occupancy for recreation purposes of the building that has historically housed the Seattle Asian Art Museum; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'The Report of the Civic Development, Public Assets and Native Community. Agenda Item one Council Bill 119150 An ordinance relating to Volunteer Park authorizing the Superintendent of Parks and Recreation to enter into a development agreement and lease with the Seattle Art Museum for the renovation and continued occupancy for recreation purposes of the building that has historically housed the'",
        "'speaker_0': 'Seattle Asian Art Museum. And ratifying and confirming certain prior acts. The committee recommends the bill pass as amended.'",
        "'speaker_1': 'Thank you very much, councilmember suarez.'",
        "'speaker_2': 'Thank you. The agreement for the new seattle asian art museum. Before I get into the details of this bill, I believe Councilmember Gonzalez has an amendment to the ordinance to ensure proper advertising of the community benefits guaranteed in this agreement.'",
        "'speaker_2': 'So I will hand it over to Councilmember Gonzalez for the amendment and then we'll move on to the bass led the bass legislation.'",
        "'speaker_1': 'Councilwoman Gonzales, you have the floor.'",
        "'speaker_0': 'Thank you so much. This is an amendment to Council Bill 119150. So I will move to amend Council Bill 119150 by adding a last sentence to Section three, which will read as follows. With regard to any public benefits required under the lease system, it shall take adequate measures to clearly inform the public of these benefits, including identifying'",
        "'speaker_0': 'such benefits and marketing and outreach materials covering public activities at the same.'",
        "'speaker_1': 'Her second. Would you any further comments on Councilmember Gonzalez's amendment? Any questions? More need for elaboration. We prepare to vote. Okay. We're going to vote on the amendment first. All those in favor of Councilmember Gonzalez's amendment, please vote I.'",
        "'speaker_1': 'I oppose. The ayes have it. So we have an amended piece of legislation. Councilmember Juarez, thank you.'",
        "'speaker_2': 'First of all, I want to thank the SAM folks for working with us and being here. I also want to thank Council President Harrell. For the last two years we've been working on this as well as Councilmember Bagshaw.'",
        "'speaker_2': 'And now more recently, Councilmember Gonzalez. And I also want to thank the individuals that have showed up at every meeting to give their public comment whether they agree with this or not. I do appreciate and I did listen to your comments and your concerns, and I want you to know that I did hear you.'",
        "'speaker_2': 'But with that, I'm going to move forward. In 2008, voters approved the Parks and Greenspace levy, which included funding to renovate the Seattle Asian Art Museum and Volunteer Park. Due to the effects of the recession of the project, the project was not able to move forward.'",
        "'speaker_2': 'That would have been during the recession in oh eight. The city and the museum made an agreement to hold off on the project until economic conditions improved, and then they did. Today we are here to able to finally finalize plans.'",
        "'speaker_2': 'Nearly ten years in the making to not only renovate the museum but expand it to increase education and exhibit space. The $55 million project includes a $19 million contribution from the city and I believe $6 million from federal tax credits.'",
        "'speaker_2': 'This agreement includes a long list of public benefits, one in which we required the Seattle Asian Art Museum to go back to the drawing board at least two occasions, to come back and give us a more complete and robust description about what public benefits they would be providing to the city in the citizens of Seattle.'",
        "'speaker_2': 'For the full list, you can see Exhibit B in the lease agreement. I would like to highlight the following key benefits explicit. There's explicit commitment to partner with Seattle Public with the Sealed Public School District. Was there a criteria for targeting school partners and details in an annual outreach efforts?'",
        "'speaker_2': 'President Harrell insisted on that seven in-school art education programs and free tours for up to 75 schools annually. Eight workshops, three day camps and 15 free lectures and panel discussions. Again, the people on the committee at the time, myself, Councilmember Bagshaw and President Harrell, insisted this this component was crucial in order to be a public benefit.'",
        "'speaker_2': 'In addition, there's 15 $50,000 minimum scholarship assistance fund with an annual escalation equal to the escalation of the city's operating subsidy for the Seattle Asian Art Museum. I should add that we went from 25 to 15. We required that you double that, and you did also an annual fee, publicly accessible cultural event.'",
        "'speaker_2': 'Approximately the annual value value of all benefits listed in Exhibit B is approximately $340,000, 340,000 in about $2,016, give or take some change. The committee recommends the passage of this bill. Is there anything you want to add? Councilmember Bagshaw.'",
        "'speaker_3': 'Thank you. I just I want to thank you for your intrepid leadership on this and say thank you to the patients of Sam, also to the neighbors who have come out. I know that you feel like there haven't been enough public meetings, but I think over the years we've seen many, many opportunities for people to weigh in'",
        "'speaker_3': ', express their opinions. We know that there's disagreement. I believe that it's time for us to move forward on this, that the city had a commitment during our park levy early in 2008 that we were going to care for this building that was ours and also put forward the fact that was needed and the structural seismic changes we've'",
        "'speaker_3': 'got to do. That is our responsibility and I'm very thankful. Again, Councilmember Suarez, Councilmember Gonzales, for your keen eye on some of this language and it's really time to move on this.'",
        "'speaker_1': 'Very good, Councilmember Herbold.'",
        "'speaker_0': 'Thank you. I just wanted to speak to some of the issues around the use of park land for for this purpose. Back in 1997, the citizens of Seattle passed the Save Our Parks Initiative, Initiative 42, which stated that no land or facility shall be sold, transferred or change from park use to another usage unless the city shall'",
        "'speaker_0': 'first hold a public hearing and set out some process requirements, and then also required that the city shall at the same time or before receiving an exchange or land or facility of equivalent or better size, value, location or usefulness.'",
        "'speaker_0': 'You know, the city has. The city of Seattle has a long history of having Parks and Recreation Department land use for a wide variety of recreational activities, including including the arts. And in considering the the use of arts as part of the city's recreation offerings that ranges from the Green Lake Theater Dance, Madrona Dance Studio, Performing Arts'",
        "'speaker_0': ', Langston Hughes and Pratt Fine Arts Center. And so in looking at how this transaction intersects with the requirements of Initiative 42, I think it's very appropriate that the city has determined that this exchange does not does not need to be subject to the provisions of Initiative 42.'",
        "'speaker_1': 'Thank you very much, Councilwoman Herbold. Councilmember Suarez.'",
        "'speaker_2': 'Just briefly, I believe Councilmember Herbert is referring to the legal opinion that we requested, dated February 2017, which categorically concluded that the proposed museum use constitutes a, quote unquote park and recreational use and initiative. 42 therefore does not apply.'",
        "'speaker_1': 'Very good, Councilmember. So watch.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you, President Harrell. I just wanted to make some general comments on this and the next item on the agenda which relate to the expansion of the Asian Art Museum. My office staff have met with the museum and with the Capitol Hill residents who are concerned about the expansion and its impact on the bargains.'",
        "'speaker_3': 'Also spoke today. I generally support the expansion because I support museums. The importance of art cannot possibly be overstated, and of course it is. We're talking about the Asian Art Museum, so it is even more of a crucial importance for our region in terms of the cultural opportunities it can potentially continue to bring to the people who'",
        "'speaker_3': 'live here. There are some points that the opponents of this expansion have made that I believe have merit in themselves, and I just wanted to register them today for future reference. The Art Museum, the Seattle Art Museum, which owns which owns the Asian Art Museum, is not free.'",
        "'speaker_3': 'We all know and not open to the public in the same way that parks are. So I think that is something for us to think about. Everyone should have. Just like everyone should. You believe everyone should have access to parks.'",
        "'speaker_3': 'Everyone should have access to art in our society. And I think the amount of money that people have to pay for specific exhibits, I mean, people it makes even otherwise people with otherwise decent living standards balk at the amount of money to pay for any specific exhibit.'",
        "'speaker_3': 'And I think there should be much more access to that. And it's not on the shoulders of any one person who just wanted to register those points. Unfortunately, right now the museum is open, as I understand, only four days a month.'",
        "'speaker_3': 'The city did provide will be providing millions in funding for this museum expansion as well as for some extra park space. And I believe that when we had that kind of bargaining position in the future, we should be asking for more opportunities for the public.'",
        "'speaker_3': 'And I'm sure that there's not going to be any disagreement about that. And I think especially when you look at the fact that admissions make up a small portion of the museum's revenues. Clearly, there's a lot of other lot of other sources that could actually potentially help me to help the museum be open four more days a'",
        "'speaker_3': 'week, if not all days a week. And I think this is particularly true in the case of the Asian Art Museum, which features art historically from communities of color. So I will be voting yes on this expansion. Thank you, Councilmember Suarez.'",
        "'speaker_3': 'And but I also appeal to the De Sam to reexamine the opportunities to radically expand free access to the amazing cultural resources that they're able to bring to the city.'",
        "'speaker_1': 'Thank you, Councilmember. So once I'd like to say that I'm certainly very supportive of this legislation and I suppose reasonable minds can differ. It seems to me that when we are all dust that we will be known for our art, our music and our museums.'",
        "'speaker_1': 'And when we looked at the finances of this arrangement, it certainly was not rubber stamped. And we looked at the long schedule of payments and knowing that we are leveraging philanthropic dollars, private dollars and public dollars, I think that it certainly was not rubber stamped.'",
        "'speaker_1': 'I specifically asked during the committee discussions about what it cost to attend the museum, and it's my understanding that the museum asked for donations and that they don't turn down anyone who cannot pay. That was my understanding. I hope I'm not misstating what I heard at the table, that if a person can't pay, they're not required to'",
        "'speaker_1': 'pay. And these are suggested donations. And I also know that there are free Thursdays throughout the year. And this is because, as Councilmember Swan correctly points out, that this is a public gem and everyone should be able to enjoy the richness of this museum.'",
        "'speaker_1': 'So again, I want to thank the neighbors. They the the residents in the neighborhoods and the park advocates for always being the advocates that they are. And again, at the end of the day, perhaps reasonable minds can differ.'",
        "'speaker_1': 'But I support this legislation unapologetically. Councilman Waters, are we good to vote?'",
        "'speaker_2': 'We are good to vote. Okay.'",
        "'speaker_1': 'Okay. So this is a bill. So all those please call the roll on the passage of the amended bill.'",
        "'speaker_2': 'Whereas I macheda.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'O'BRIEN So, Sergeant.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'BAGSHAW Hi. GONZALES Hi.'",
        "'speaker_0': 'HERBOLD Hi.'",
        "'speaker_2': 'Johnson President Harrell nine in favor and an oppose.'"
    ],
    "AN ORDINANCE relating to land use and zoning; amending Sections 23.42.106 and 23.42.118 of the Seattle Municipal Code (SMC); to modify standards for the expansion of nonconforming uses and structures.": [
        "'speaker_1': 'The Bill Parsons show assignment. Please read the next agenda item.'",
        "'speaker_0': 'Agenda Item two Council Bill 119146. An ordinance relating to land used in zoning amending sections 23.4 2.106 and 23.4 2.118 of the Seattle Municipal Code to modify standards for the expansion of nonconforming uses and structures. The committee recommends the bill passed.'",
        "'speaker_1': 'Councilmember Worse.'",
        "'speaker_2': 'Thank you. The Land Use Code Amendment. This Land Use Code Amendment is a companion legislation to the law, a bill that we just passed 119150 for the Asian Art Museum Project. A museum sits in a community zoned single family area that does not allow for instant institutionalized uses like museums.'",
        "'speaker_2': 'However, the museum predates this zoning designation and was grandfathered in. I believe the museum was built in 1932. I'm getting a bunch of yeses 1933, 1933 for the museum to complete this expansion. This land use code is amendment is necessary.'",
        "'speaker_2': 'This code amendment will only apply to the museum building and the project. The committee recommends passage of the bill.'",
        "'speaker_1': 'Very good. Any comments? Please call the rule on the passage of the bill.'",
        "'speaker_2': 'Whereas I was Darragh O'Brien. Sergeant Bagshaw Gonzalez. I Herbold. I Johnson. President Harrell. Nine In favor and unopposed.'",
        "'speaker_1': 'Bill passed in show Senate. Please read agenda items three and four together.'"
    ],
    "AN ORDINANCE amending Ordinance 125429 to modify the effective date of certain sections of that ordinance.": [
        "'speaker_0': 'The Report of the Planning Land Use and Zoning Committee Agenda Item five Council Bill 119168 An Ordinance amending ordinance 125429 to modify the effective date of certain sections of that ordinance. The committee recommends the bill pass.'",
        "'speaker_1': 'Councilmember Mesquita I just if you're paying attention, Councilmember Johnson.'",
        "'speaker_2': 'Asked Mr..'",
        "'speaker_1': 'Hill as a.'",
        "'speaker_2': 'Small little.'",
        "'speaker_1': 'Bill to change the effective date. As the clerk mentioned, I'm happy to answer questions. If people have any questions of this piece of legislation, please call the rule on the passage of the bill.'",
        "'speaker_2': 'Whereas I macheda i o'brien.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'So aren't I make sure. Gonzales, i herbold. Johnson President. Harrell all right. Nine in favor.'",
        "'speaker_1': 'Nine oppose the bill passed and show sign it. Is there any further business come for the council? If notwithstanding adjourn and everyone have a great rest of the day.'"
    ]
}