{
    "A RESOLUTION to delay consideration of the Mayors nomination of Jason Johnson to be Director of the Human Services Department until a formal search process can be completed; and to convene a search committee representing all Human Services Department stakeholders to define qualifications, skills, and attributes for an appointee and recommend finalists for appointment.": [
        "'speaker_0': 'Right. Can you please read that into the do we have read into the record? And then I believe Councilmember Samant has agenda items two, three, four and five. Go ahead.'",
        "'speaker_3': 'The report, the Human Services.'",
        "'speaker_2': 'Equitable Development and Renters Rights.'",
        "'speaker_3': 'Committee turned that into your resolution 318 62, a resolution to delay consideration of the mayor's nomination with Jason Johnson to be director of the Human Services Department until a formal search process can be completed, and to convene a search committee representing all Human Services Department stakeholders to define qualifications, skills and attributes for an appointee and recommend two'",
        "'speaker_3': 'finalists for appointment. The committee recommends the resolution be adopted with abstentions from councilmembers Harrell and Herbold.'",
        "'speaker_0': 'All right with that. Councilmember So what?'",
        "'speaker_1': 'Thank you, President Maros. I will make opening remarks and I would like to make closing comments as the sponsor of the resolution.'",
        "'speaker_0': 'And please remind me to leave to have you do closing remarks in case I forget.'",
        "'speaker_1': 'There is no reasonable justification for the controversy around this resolution. When my office first discussed and was invited to discuss the appointment with human service providers, Human Services employees and other community members, we heard very serious concerns and as the many speakers today and in previous meetings of the Committee of the City Council where Human Services issues'",
        "'speaker_1': 'are discussed. What they have said is a very reasonable position, which is asking for an inclusive and transparent search for the leadership of a department, which is ground zero for the most emergent problem in our city, which is the housing affordability crisis and the homelessness crisis.'",
        "'speaker_1': 'In my view, this is an entirely reasonable proposition from the employees of the department and also from community members and human service providers. And as speakers today have said, the city of Seattle has agreed upon a reasoned social justice approach to the work of the department and that that be upheld in all the work that the mayor'",
        "'speaker_1': 'carries out. And that not that they not that the politicians do not engage in cherry picking where they will apply race and social justice and where they will not approach race and social justice. So from that standpoint, I think that there is nothing controversial about this resolution because it merely expresses what we have heard from hundreds of'",
        "'speaker_1': 'people in our community. This resolution is only controversial because the mayor has decided to go nuclear over it, writing threatening letters, refusing to send representatives to council meetings, threatening to close homeless shelters and so on. Our city faces an unprecedented housing affordability and homelessness homelessness crisis.'",
        "'speaker_1': 'Therefore, I do not think that issues are being conflated here. The issue of the leadership of the department is very intricately tied to the work that the department employees do in dealing with the crises faced by our most vulnerable community members.'",
        "'speaker_1': 'And so, in my opinion, behind a mayor's attempt to bypass a transparent and inclusive appointment search and to sideline the overwhelming and numerous voices of those who oppose her choice for Human Services Director position is a broader attempt to silence opposition to our under-funded and punitive approach to the housing and homelessness crisis.'",
        "'speaker_1': 'The mayor's strategy effectively ignores the deeply embedded economic inequality, unaffordable rents, racism, sexism and social inequalities built into the fabric of capitalism. Problems that in this situation have been dramatically worsened by City Hall's longstanding support for and reliance on the for profit market.'",
        "'speaker_1': 'Human Services workers understand that the human and humanitarian crisis in our city falls disproportionately on people of color, immigrants, women and the LGBTQ community. And they want a city leadership that also understands that. Unfortunately, despite the deputy mayor promising Human Services employees in fall 2018 of a transparent and inclusive search, the mayor did not engage with the'",
        "'speaker_1': 'community all year. Last year, while my office was asking her what she was going to do with the appointment, and immediately and on December 19th, we heard that we heard about her election. And immediately after my office began hearing from Human Services staff, the union that represents most of them protect 17 and human services providers and community'",
        "'speaker_1': 'members in I've been in office in City Hall since the beginning of 2014. So in my time in the Council, I have been asked to vote on any number of appointments of leadership in city departments. I have never seen a case where there has been such widespread concern about a director appointment.'",
        "'speaker_1': 'This is a petition signed by 130 members of Protect 17 Union who work in the Human Services Department asking for the Council to send the nomination back to the mayor to conduct an inclusive search. They also turned out in large numbers to their union meetings, to the changing meetings of the department to discuss how to respond.'",
        "'speaker_1': 'Dozens of Human Services employees have turned out to both the committee meetings, and these were committee meetings where we had over 100 people join us at these meetings. I would urge council members to think for a moment how much courage it would take for a Human Services employee to speak up on this issue and openly oppose the'",
        "'speaker_1': 'mayor's choice of the acting director of their department. I wanted to say to you all, I have the deepest respect for your resolve and for your solidarity among yourselves. And if there is any question of harassment or retaliation on the basis of the courageous position you have taken, I wanted to publicly state that I will stand with'",
        "'speaker_1': 'you and please let my office know if there is any such case. This is the letter from the Human Services Department Change team who, among other things, advocate for Seattle's race and social justice principles and urge the council to send the nomination back to the mayor for an inclusive candidate search.'",
        "'speaker_1': 'This is a letter from the Seattle Silence Breakers that also does the same. This is a letter from the Seattle Human Services Coalition making the same request. The coalition represents 182 nonprofit social services agencies in Seattle. They are the agencies that the Human Services Department contracts with to provide food, shelter, supportive housing, health care and services for'",
        "'speaker_1': 'people with disabilities, elderly community members, youth and survivors of domestic violence and sexual assault. These are community partners that the director of the Human Services Department must have a trusting and collaborative relationship with to be effective. Councils should also take their input very seriously and should consider their courage in writing a letter demanding a truly inclusive director'",
        "'speaker_1': 'search because they also fear retaliation. I also want you to share an important letter sent by the Transit Riders Union in solidarity with the Human Services employees and social service providers for demanding an inclusive search. I also wanted to comment on the fact that Cher and we have received a letter, I think two days after they testified'",
        "'speaker_1': 'in the committee in chambers that they are that that their contract from a year long contract will be cut to one terminating at the end of June. And in that letter, the mayor the letter says, quote, The mayor wishes to convey that she is happy with improved exit access to housing and and hopes that the revisited award'",
        "'speaker_1': 'will provide incentive for improved utilization, which could result in extension of the contract. I mean, it's a very technical way of saying you've done a good job and we are going to reward you by yanking your longer contract and making you fight for it every month.'",
        "'speaker_1': 'That's like telling an employee. I mean, this is Orwellian doublespeak and it's like telling you're telling an employee, you're not being fired, you're just being laid off. I think it is important that those of us who stand for human services stand with share and will, because they provide much needed basic shelters.'",
        "'speaker_1': 'And there's been repeated attempts by the mayor's office and by some councilmembers to take their funding away on the basis of not having numbers. But the mayor herself has admitted she doesn't have numbers for transitions to permanent housing.'",
        "'speaker_1': 'So why are we holding one small service provider accountable for that as a whole? If you repeal the Amazon tags and if you if you stand as an obstacle to any possible measure to expand housing affordability, then you're not in a position to tell individual service providers that they're not doing enough.'",
        "'speaker_1': 'I think the timing of this was very questionable. The timing of this announcement was very questionable. But whether or not it is retaliation, I will say the bottom line is, given the crisis that our city is reeling under, it is unconscionable to make any cuts to funding for social services and homeless services.'",
        "'speaker_1': 'And the Select Committee on Homelessness, which I will be chairing on March 12th at 2 p.m., will take up this issue to make sure that shelters are not closed. I also wanted to make sure that everybody knows that Project 17, the union that represents, I think half of the workers in the Human Services Department has signed a'",
        "'speaker_1': 'letter out in which they are clarifying that the union, as Melissa McClure said, the union stands with the membership in asking for a meaningful engagement with external and internal stakeholders. And it says Project 17 membership maintains the firm position that a transparent process that embeds the race and social justice principles and values of the city and department'",
        "'speaker_1': 'is required to establish accountability and leadership. So in other words, what this letter says is that whatever the mayor and the council may promise about the future is a separate question. Don't make promises about the future if you're not going to uphold this resolution today.'",
        "'speaker_1': 'So it's really meaningless for council members to say we will support a resolution that talks about what we will do in the future when the promises that were made about this are not being upheld. Why should HST employees and service providers trust promises of the future when current promises are not being kept?'",
        "'speaker_1': 'I will say in closing that that. This nomination is much more than about an individual. It's about the choice that council members have about whether they will listen to the hundreds of community members who have spoken and do the right thing.'",
        "'speaker_0': 'Thank you. Customers who want. Councilmember Johnson.'",
        "'speaker_9': 'Thanks. I'm going to be speaking against this resolution today. You know, in the the conversation and I think it's happened in community, this has become a proxy for the confirmation of the individual who currently serves as the interim director for the department.'",
        "'speaker_9': 'Jason Johnson So I want to go forward for the record that there have been dozens, if not hundreds of emails that we've gotten in support of Jason as the permanent director. Here are some of the qualities that people have expressed when talking about Jason.'",
        "'speaker_9': 'He's qualified. He's got a true concern for all Seattle residents. He's trusted, admired and competent. He's got a grasp of the complexity on a wide range of human service departments programs. He's got a commitment to positive solutions. He's an asset to Seattle.'",
        "'speaker_9': 'He's committed to accountability. He's got a continuity of leadership that's important in this time. He's committed to reform and continual review and improvement. He's a people focused leader and people oriented. He's a person with integrity. And these have come from individuals, not to mention the letters that we've received from organizations as diverse as solid ground, the Pride'",
        "'speaker_9': 'Foundation Chief Seattle Club, Accelerator, YMCA, Catholic Community Services, and others who have asked for us to quickly confirm Director Johnson. So while I know that much has been made about this being about a process, I think that this is really not about a process.'",
        "'speaker_9': 'This is about a person. And I will be voting no today in the hopes that we can actually take up the confirmation of this individual.'",
        "'speaker_0': 'And the other by the colleagues. Oh. Councilman Ryan.'",
        "'speaker_5': 'Yeah. Thank you. I'll be voting in support of this resolution. I wanted to speak briefly to my thinking on it. I'm I want to be clear that I've had a good working relationship with Jason Johnson as both deputy and interim or what's the proper term, interim and acting.'",
        "'speaker_5': 'Thank you. And I and I don't oppose his appointment ultimately, but I do believe that a process is important. I think there's an important role, and I think the request from community members and that there be a transparent, inclusive process and a chance to compare candidates and get them to vet some of their opinions, I think is'",
        "'speaker_5': 'a really important thing to do.'",
        "'speaker_0': 'Thank you. Anyone else? Councilor Mosquito.'",
        "'speaker_3': 'Thank you, Madam President. I think I want to be very clear up here. We understand fully that the mayor gets to nominate whomever she chooses for department directors. And also, I think we all understand that it's the council's job to run a confirmation process.'",
        "'speaker_3': 'There's a few things that are clear to me as we have this conversation today. Many of the people who work at HST and including those in the bargaining unit, including those from the change team, including those who are members of the Silence Breakers, as well as others who are contracted providers, don't feel like their voices were heard'",
        "'speaker_3': 'or that there was a thoughtful selection process in which they could make sure that their issues and their values were represented. Number two, we know that we can't go back and fix a process, but we can indicate that we wanted to see what we expected to see didn't happen.'",
        "'speaker_3': 'And at this point, without enough time to make sure that those who are frontline staff and providers feel like their voices have been heard at the table, it is imperative, I believe, to go back and ask for a more inclusive process.'",
        "'speaker_3': 'And I also think that we need to work together as a city to ensure that we focus on big picture policy issues and pressing issues. But this process should not be interfering either politically or policy wise, with the important role that HST has to play.'",
        "'speaker_3': 'We are very, very lucky to have all of the individuals who work at HST. We know we have a homelessness and housing crisis that is pressing and is getting worse every single day. And I, like Councilmember O'Brien, have had very positive interactions with the individual, Jason Johnson and his leadership team, as well as the incredible folks on'",
        "'speaker_3': 'the front line. But to me, the purpose of the resolution in front of us is to say that we need a process that is inclusive, that represents our commitment to race and social justice, that ensures that frontline staff and those who are being served by the department have had a chance to either be at the table or'",
        "'speaker_3': 'to make sure that their values are represented at the table. So we understand, I believe, that our our job is not to run the process, but as we look at the process that's in front of us, we don't have the right tools to evaluate whether or not individuals questions have been answered, whether or not they feel like'",
        "'speaker_3': 'their issues and their values have been heard, and whether or not there's a plan of action to ensure that the director and the new director will listen to those concerns and integrate public policy changes to make sure that there's a process moving forward.'",
        "'speaker_3': 'I also want to be very clear that this is our job. This is our job to evaluate nominees that come down. And I do take some offense with the staff member who wrote to us and said that resolutions aren't our job.'",
        "'speaker_3': 'It is our job as a council to ensure the impact of communities. Have a seat at the table. It is our job to ensure that there is a public and transparent process to decide on whether candidates are the right choice the to lead the department.'",
        "'speaker_3': 'And it is our job to be accountable to the people of this city. We don't make decisions in a vacuum. And as elected leaders, we ultimately don't get to decide who gets sent down to us. But it is our job to make sure that the process was inclusive and thoughtful.'",
        "'speaker_3': 'So from my perspective, regardless of how council members vote on this, on this resolution, I want to reiterate that I do believe that we're doing our job to clearly question whether or not we have the right tools in front of us to make this decision today.'",
        "'speaker_3': 'And from my perspective, this resolution is not about Jason's leadership or whether he's the right person to lead. This is a question about the process, whether we got it right and whether it was inclusive and saying that we've had other processes that haven't had to go this route or that we've done it this way in the past'",
        "'speaker_3': '. You know, we all also don't want business as usual. We have to make some changes. And in the time of MeToo and a time where people courageously speak up and tell their truth and speak truth to power, this means making space at the table and also recognizing that sometimes we do need to hit pause and ask if'",
        "'speaker_3': 'we've created the table for people to come to. So I'll be voting in support of the resolution in the hopes that we can either have a process that's changed or that we will be able to vote up or down on the nominee and move forward.'",
        "'speaker_3': 'And in deference to the mayor's office, I have held back the resolution that's forward looking. I do think that that helps provide us with additional additional clarity on what the city council hopes for in terms of a transparent and inclusive process.'",
        "'speaker_3': 'I do look forward to finding a resolution on that resolution, and I appreciate all of the council members comments throughout this process, regardless which way we vote. We all know that we want to make sure that our human service provider, frontline staff provide organizations and those who are experiencing homelessness get the direct services that they need.'",
        "'speaker_3': 'We're incredibly proud to work with you on a daily basis. And no matter which way folks vote today. Thank you for your incredible service. Thank you.'",
        "'speaker_0': 'Councilmember Bagshaw. Colleagues, I want to thank you all for the work that you've done. Councilmember Mesquita, you just outlined some things that I think are actually very important. Before we talk about this a second, I just want to say thank you to all and share and we all for being here.'",
        "'speaker_0': 'I know that many of you remember very clearly just a few months ago during our budget cycle that you were one of the first groups that came and said keeping people inside is critical. We passed the budget, making sure that you had that money to stay inside and warm.'",
        "'speaker_0': 'And I want to acknowledge that I will continue to do what I can to make sure that share continues, that the work that you do is supported and funded. So I just I do really do want to acknowledge how much I appreciate what you are doing to keep people inside.'",
        "'speaker_0': 'And also we need to improve the outcomes. We all know that. And this is the same thing we're trying to do up here. And I also want to acknowledge the concerns that many of you have brought forward about the process.'",
        "'speaker_0': 'And I'm taking a little different view on this. I was the chair of Human Services for the last couple of years prior to Councilmember Sawant. I know how important getting this right is. But that said, we've got human services to provide.'",
        "'speaker_0': 'We've got used to care for. We have our aging and disabilities group. We have our age friendly group and the efforts that we're putting to support those who are victims of domestic violence. DeLay is not going to help us.'",
        "'speaker_0': 'Another year long search is not going to help us. The Human Services Department has called me, service providers have called me, and we've received dozens and dozens of people saying, let's move forward on this. We have a great man that is leading this work.'",
        "'speaker_0': 'I've worked with Jason for years. I regard him as a man of integrity. I saw him back in Washington, D.C., where he was working very hard with national experts and he is well recognized. And I appreciate the work and experience he brings to this.'",
        "'speaker_0': 'So rather than saying, let's do another national search, I'd say let's focus on the people we have the excellent people and workers within the Human Services Department. If there's a problem with get that right, but I would like to move forward rather than delaying this.'",
        "'speaker_0': 'So I'll be voting against this resolution. Okay. Is there any other comments? Cashmere Herbal.'",
        "'speaker_8': 'Thank you. So I attended the last Human Services Committee meeting back on February 20th. I also listened to the testimony at the meeting previous to that, at this last meeting on the 20th, I abstained from voting so that I could continue to consider the thoughts and concerns of individuals about the proposed resolution.'",
        "'speaker_8': 'I've said before that I do not support maintaining the status quo as it relates to the Council's expectations for how the mayor conducts department search processes. Back in 2007, when the resolution that currently defines the expectations for the nomination and confirmation process was passed.'",
        "'speaker_8': 'Neither the council mayor nor department are items contemplated utilization of the racial equity toolkit as part of a nomination and confirmation process. I'm really glad that we're in a different and better place today, and I want to formalize the changes to the status quo that address sort of this new expectation.'",
        "'speaker_8': 'And as we've heard, in some cases, some council members have already made that part of their expectations to the executive for confirmation processes that they have seen that they have overseen. Members of the public are asking today that we change the nomination and confirmation process.'",
        "'speaker_8': 'I say let's do that. I support a transparent and inclusive process. But I believe that the appropriate time for the council to raise these issues is at the beginning of the nomination process. For that reason, I've requested that Councilmember Mosqueda include specific language related to that process in her resolution, specifically that prior to nomination that the Executive'",
        "'speaker_8': 'give to the Council a written description of that process, the use of any advisory groups that will be part of that process and the composition of that advisory group that way. The committee chair overseeing that nomination has the ability to engage with the executive about that process before the nomination comes forward.'",
        "'speaker_8': 'Again, individual council members have worked with the executive in the past and developing these sorts of expectations, as we heard from Councilmember Gonzales this morning. She described asking that the mayor use a racial equity toolkit during the police chief process.'",
        "'speaker_8': 'I have shared my concern that this did not happen in this particular case. Councilmember want produce emails from her staff that appear to have been unanswered. Asking questions about the unintended consent process that these emails were unanswered is unfortunate, but I'm unaware of any communication from Councilmember Sawant prior to the nomination to the expectation about her specific'",
        "'speaker_8': 'expectations for that process. If council members who want had made those expectations known prior to nomination and they were ignored, I might feel differently today. We heard at the Human Services Committee meeting on the 20th that the Human Services Coalition had been seeking a meeting with the mayor since the beginning of her term to discuss the Human'",
        "'speaker_8': 'Services Coalition's hopes for the future of the Human Services Department. The fact that they have not had such a meeting since the mayor has taken office was described by the representative of the Human Services Coalition as unprecedented. The Human Services Coalition represents dozens of providers, hundreds if not thousands of workers and tens, if not hundreds of thousands'",
        "'speaker_8': 'of recipients of services. I'm glad to report that the mayor's office has let me know today that the mayor will, in fact, be meeting with the Seattle Human Services Coalition as it relates to concerns that we've heard today from Share we'll residents and their supporters.'",
        "'speaker_8': 'I've spoken with HST about their intent in giving them a six month contract. Specifically in writing and verbally, HST has indicated appreciation for the progress made by share wheel and expectations for continued progress. Last week, Meg Gerberding assured me verbally in person that sheer will is a valued partner and then HST is sincere in its desire to'",
        "'speaker_8': 'continue to support their services as part of an emergency services continuum. As I have done before, I intend to try and facilitate a meeting with HST and share wheel. I put that request in today with HST about the specific issues that HST has identified as continued areas of improvement, as well as wanting to hear from share wheel'",
        "'speaker_8': 'about the barriers that they identify to improve completeness in this data. I want to clarify the issues that have been raised are less about outcomes to to permanent housing and more specifically about complete completeness.'",
        "'speaker_2': 'Of data.'",
        "'speaker_8': 'Itself. So these are things that I'm really confident that we can we can work to resolve in time for the the continued provision of the services that the council funded in last year's budget. And that's all I have.'",
        "'speaker_0': 'Thank. Councilmember customers want you want to close for us?'",
        "'speaker_1': 'Thank you. I just want first of all, I wanted to say that in for council members who are saying that, oh, they're worried about the delay. I just want to clarify. My office has been asking the mayor since March of last year, which is almost a year ago now, asking them what they intended to do about the'",
        "'speaker_1': 'agenda nomination. And in fact, the first e-mail that my policy analyst, Edward Jones, sent to the mayor's staff office specifically says that can we have the an idea for who's going to be nominated before the previous director left?'",
        "'speaker_1': 'Because we didn't want to have any delays. So I think it's disingenuous for council members to say we are, we are, you're voting no against a resolution because you're against delays, but we are against delays also. This is not a question of delay.'",
        "'speaker_1': 'It's a question of hundreds of people having spoken up. And we're and we have a council that is predominantly, it seems like, going to hide behind process oriented points in order to not respond to and listen to the people that have spoken.'",
        "'speaker_1': 'And I really appreciate Councilmembers O'Brian and Mosquito supporting this resolution, because voting yes on this resolution says that you as an elected representative are standing up for promises that were made to be fulfilled, as opposed to simply saying, well, let's just roll it over to another promise in the future, and why should people trust that those promises'",
        "'speaker_1': 'will be kept if these promises weren't kept in the first place? And in response to Councilmember Herbals points that I my office did not state the expectations. I'm sorry. These are very, very basic questions that ordinary people are asking about upholding the race and social justice process and including people.'",
        "'speaker_1': 'This was a promise that Deputy Mayor Ranganathan herself made in fall 2018 to address the employees. So I do not understand why the mayor's office needs instructions from my office to do the very basic and minimally required actions that are her responsibility.'",
        "'speaker_1': 'Furthermore. Furthermore, I don't understand why council members would elevate what my office did or didn't do in comparison to the many voices we have heard, regardless of what my office did or didn't do. I think your voices should count for far more than anything else.'",
        "'speaker_1': 'Anything else? It should count for more than any politician's voice. So given that you all have spoken, that is the most important thing. And that is why I agreed to bring this resolution forward. Based on what you all said, and I also wanted to share with members of the public that I had a meeting with the mayor'",
        "'speaker_1': 'this morning, and I asked her what she concurred with this resolution. In response to that question, she asked me a question. In response, she said, Will you withdraw this resolution? And I just wanted to let you all know that I said, of course, I cannot withdraw this resolution, because that would be unconscionable, that I have to remain'",
        "'speaker_1': 'accountable not to her, but to the ordinary people who have spoken. And I urged her to go with the resolution. I also told her, regardless of how right you think about the nomination, you send what matters the most, despite regardless of any other process point you make is that hundreds of people have spoken and you cannot just'",
        "'speaker_1': 'sideline those voices. I will I will say this. If if this resolution does not get the majority vote, I'm going to urge everybody who has fought for this to know that it's never the end of the road. We can still keep fighting.'",
        "'speaker_1': 'And furthermore, there are concrete ways that we can keep fighting in this issue. I'm not talking about in the abstract that somebody on the council will still need to move for the appointment of Jason Johnson. And I appeal to you all to not give up and to keep coming and and do for us to keep strategizing.'",
        "'speaker_1': 'And I will just end by quoting Gretchen wisely. I mean, I'm going to paraphrase paraphrasing, because I didn't write down the actual quote, but something along the lines of let's keep building and organizing so that we can meet every penny of opposition from the mayor or any other politician with a pound of organizing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_10': 'Hey. Okay. So.'",
        "'speaker_0': 'With that. Thank you. COUNCILMEMBER So what? We will move forward on a vote. Please call the roll on the passage of the resolution.'",
        "'speaker_2': 'O'BRIEN All right. So what? I beg your.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'GONZALEZ No. Purple.'",
        "'speaker_7': 'No.'",
        "'speaker_2': 'JOHNSON must get to Juarez.'",
        "'speaker_0': 'No.'",
        "'speaker_2': 'Three in favor. Five opposed.'",
        "'speaker_0': 'So the resolution fails. There's nothing for me to sign. Okay, so with that, I understand customers who want you have matters three, four and five that are appointments on the agenda for yours. Or I do have to sign something o number even into the record.'",
        "'speaker_0': '0a3 record. I'm sorry.'"
    ],
    "AN ORDINANCE relating to the Seattle Police Department; creating an incentive program for hiring police officers; and repealing obsolete Sections 4.20.530, 4.20.540, and 4.20.550 of the Seattle Municipal Code.": [
        "'speaker_3': 'You take these new Americans and Education Committee agenda item six cancel 119468 relating to the Seattle Police Department, creating an incentive program for hiring police officers and repealing obsolete sections 4.20 point by 30.5 40 point end point 557.'",
        "'speaker_3': 'As Speaker, the committee recommends the bill passed as amended.'",
        "'speaker_2': 'Thank you, Madam Clerk. May I Chair. Thank you.'",
        "'speaker_0': 'Bill.'",
        "'speaker_2': 'So I need to move to amend this bill with a substitution version. So I moved to amend Council Bill 119468 by substituting version three for version to.'",
        "'speaker_5': 'The.'",
        "'speaker_7': 'Library.'",
        "'speaker_0': 'That has been moved and seconded that the substitute may be adopted. Any comments? Hey. It's not a disaster.'",
        "'speaker_2': 'I think we need to vote on the substitute version. Is that correct? The amendment.'",
        "'speaker_0': 'I mean, I'm just not getting the scripting down, man.'",
        "'speaker_2': 'That's okay. I am here to help.'",
        "'speaker_0': 'And I know you are.'",
        "'speaker_2': 'Giving you some gentle prompt.'",
        "'speaker_0': 'You are? Okay, so there we go. Those in favor of the substitute vote, I, I suppose. Vote no. The motion carries in. The substitute is adopted.'",
        "'speaker_2': 'All right. Now I will speak to the substantive no substitution bill 119468. So council bill 119468 creates an incentive program for the hiring of new police officers at the Seattle Police Department. My committee and this council have closely watched the hiring and separations data coming out of the Seattle Police Department since the middle of 2018, when it'",
        "'speaker_2': 'became apparent that the department was lagging far behind their hiring forecasts. Department has continued to encounter hiring struggles in in recent months, and this is, as we heard in my committee hearing, a reflection of a very challenging landscape nationally in which police departments across the country are struggling to recruit new officers.'",
        "'speaker_2': 'The Seattle Police Department and the mayor originally proposed this legislation to offer lateral hires from other departments and jurisdictions a signing bonus of $15,000 in total. We have a through my committee process following the initial hearing on this bill in my committee identified several ways that I thought we could strengthen and expand this incentive program, creating additional'",
        "'speaker_2': 'accountability measures to ensure the strategy's success. So I proposed four changes in total to this legislation, which were adopted unanimously in committee at our last committee hearing on the 27th of February. The first is that my amendments would expand the incentive program to new recruits.'",
        "'speaker_2': 'The executive's proposal would have authorized a $15,000 hiring bonus exclusively for lateral hires. My amendment, passed in committee authorizes the Seattle Police Department to extend hiring bonuses to new recruits of up to $7,500 per recruits. Lateral hires only make up 20 of the 104 new officer positions in the Seattle Police Department's hiring forecast.'",
        "'speaker_2': 'So considering that the bulk of new hires, approximately 84 out of 104 the department is seeking in 2018 our new recruits. I believe it's important that Department direct its efforts and resources towards the new recruit strategy, as well as the lateral hiring strategy.'",
        "'speaker_2': 'In addition, a hiring bonus for new recruits can help reduce barriers to pursuing this profession and could enhance the department's efforts to recruit and hire women and individuals of diverse racial and ethnic backgrounds consistent with our police accountability ordinance and in connection with some of the progress that the Department has already made in terms of increasing the'",
        "'speaker_2': 'number of diverse folks to become police officers. Secondly, the Second Amendment that I advanced in committee was a new data collection, analysis and reporting requirement that will help the Council and the public determine if this program is successful, including data regarding the demographics of new hires and the lateral hires.'",
        "'speaker_2': 'Third is a sunset date, which would require the executive to seek the City Council's affirmative reauthorization from excuse me that it would seek our reauthorization before renewing or continuing the incentive program. And then lastly, a clause that ensures that new hires who receive the bonus serve the department for three years before leaving the department.'",
        "'speaker_2': 'Otherwise, they would be required to pay back the bonus to the city of Seattle if they depart before the end of those three years. So following some additional discussions with the Department and the City Budget Office, we agreed on several other updates to my original amendment, which is why I needed a substitute version.'",
        "'speaker_2': 'Most of that was wordsmithing and technical language, and that's all I have. Happy to answer any questions, but would urge my colleagues to support the passage of this Council bill, which is, as I mentioned this morning, revenue neutral and will be supported through salary savings as a result of ongoing vacancies at the police department in terms of'",
        "'speaker_2': 'its hiring forecast.'",
        "'speaker_0': 'Thank you, Councilman Gonzales. Councilman Muscat, I believe you raise your hand.'",
        "'speaker_3': 'Thank you, Madam President. And thanks to the good chair of public safety for her really intense work on this bill. I think when I initially came to your committee, when we discussed this, there was a lot of skepticism that I held about whether or not this was the right way to go, because I know many of us'",
        "'speaker_3': 'are interested in continuing to ensure that any additional dollars and efforts, programmatic strategies, go into community policing and trying to figure out how we can share some of the funds with our community partners. And what I heard in that committee, because of your leadership, was really about how do we create stability?'",
        "'speaker_3': 'The numbers spoke for themselves and having a chance to hear directly from the department and community members at large. I think you've really struck a nice balance here. It's important, I think, to underscore what you just ended with again, which is that this is not new money.'",
        "'speaker_3': 'There's three additional components for me that really make this a powerful piece of legislation in terms of accountability and transparency to ensure that this mechanism works for creating greater stability for our police force. One is the sunset on the duration of the hiring incentive.'",
        "'speaker_3': 'Two as the reporting requirements that you championed and included here, so that we could actually see whether or not the new dollar or the dollars were truly bringing in new recruits and lateral hires, and that we maintained our commitment to race and social justice by not just focusing on lateral hires, but also recruits for new hires.'",
        "'speaker_3': 'That would be hopefully younger folks, women, people of color. So thank you for your work to incorporate all of these components into the revised version, and I'll be supporting you in this effort.'",
        "'speaker_0': 'Okay.'",
        "'speaker_9': 'Casmir Johnson Just briefly, as a third member of that committee, I wanted to offer my support for the recommendation and highlight two things that we covered in committee that I thought are worthy of repeating. The first of which is the proposal is very consistent with what hiring bonuses are offered by jurisdictions are directly neighboring locales, whether that's'",
        "'speaker_9': 'the county or the city or Snohomish County or other neighboring cities. So this not having this puts us at a competitive disadvantage. By instituting this, it will put us at least on a level playing field with those other jurisdictions and the kinds of signing bonuses that they offer both to new recruits and lateral hires.'",
        "'speaker_9': 'And then the second is, I think it's very appropriate for us to highlight that oftentimes there is a rhetoric out there about this council not doing enough to ensure the hiring of new officers. It is a national challenge for the departments around the country to bring in new people into the world of policing.'",
        "'speaker_9': 'Some folks attribute that to the challenge of constitutional policing, some attributed to the low, historically low unemployment rates. Regardless, I think this council is doing our part to make sure that we are providing all kinds of incentives to ensure that not only are we doing fair and appropriate constitutional policing, but putting the resources necessary to make sure'",
        "'speaker_9': 'that we have the appropriate level of officers that are necessary to do that work. So I want to thank the Chair for a commitment to this, and I look forward to enthusiastically voting yes.'",
        "'speaker_0': 'Okay. Anyone else, councilman or herbal?'",
        "'speaker_8': 'Thank you. I just want to highlight a different element of this effort specifically related to meeting our staffing goals. The mayor's office is convening a hiring workgroup regarding relating to recruitment and hiring, and I know that the Council is a part of that hiring workgroup.'",
        "'speaker_8': 'I want to raise an issue that I've raised before. In 2017, the Community Policing Commission or the Community Police Commission published a report about specifically this subject. It was entitled Recommendations of Community Police Commission for Recruitment, Hiring and Training.'",
        "'speaker_8': 'It includes numerous recommendations that can inform this work, and these recommendations have never been implemented. And they serve, as, I believe, as a starting point, including comparisons to policies and studies in other cities, outreach to diverse communities. I've requested that the workgroup not only consider the recommendations of the study, but also find a way to incorporate the'",
        "'speaker_8': 'involvement of the CPC. They are specifically chartered to advise the city on issues related to recruitment. In addition, I want to highlight some other work.'",
        "'speaker_0': 'Related to.'",
        "'speaker_8': 'Recruitment that Councilmember Gonzales and I have done.'",
        "'speaker_7': 'Over the last.'",
        "'speaker_8': 'Couple of years after the accountability ordinance adopted by the Council included a section on recruitment and hiring related specifically to preference points. The two of us worked to get implementation of language related specifically to preference points to expand the pool of applicants and make it clear that their skill sets are valued.'",
        "'speaker_8': 'It is true that for all of the qualified applicants who who meet the requirements in the preference points policy, those folks are all being hired. But my hope for the preference points policy is that it will actually send a message to our diverse communities that their skills are valued and actually increase the size of the pool applying'",
        "'speaker_8': '. In addition, I've, you know, also had concerns that we're spending a lot of time, although I absolutely support the addition of bonuses for four lateral hires. And I appreciate Councilmember Gonzales, his expansion to the new recruits. I really want to have a laser sharp focus on what our approach is for new recruits of our hiring plan for'",
        "'speaker_8': '2019. I believe 20 of those are supposed to come from lateral hires, whereas 80 or. Most to come from new recruits. And to me, that is a real signal that that's where the lion's share of work really needs to be done.'",
        "'speaker_8': 'And again, it needs to be done in a way that we do not lose the ground that we've gain on. On hiring a diverse workforce. In 2013, 14% of all police hires were from racially diverse communities. In 2018, we're up to 42%.'",
        "'speaker_8': 'So again, we want to make sure that we're not losing losing ground in these efforts as as we move forward. But we really want to come up with, I think, new and innovate new and innovative ways to encourage people to want to be a police officer in our city.'",
        "'speaker_8': 'And then finally, one of the things that we've heard from the Budget Office is that the cost, the reason why there's this discrepancy between.'",
        "'speaker_0': 'What we're.'",
        "'speaker_8': 'Offering new recruits in a hiring bonus versus what we're offering lateral recruits is because there are more costs associated with new recruits. I would really like to see that those costs actually, you know, sort of calculated and put on paper.'",
        "'speaker_8': 'So we're not just seeing the total academy costs, which I understand we receive, but what the costs are for training, including field training. Understand that this includes overtime. I think that will help guide us on where we want to put our emphasis in, in developing with the department.'",
        "'speaker_8': 'The staffing plan.'",
        "'speaker_0': 'Thank you. Thank you. Counselor's one.'",
        "'speaker_1': 'Thank you. During the budget last fall, I proposed 11 amendments to increase what the city of Seattle spends on affordable housing. One of those amendments was to slow the hiring of new police officers and to free up approximately $12 million to build an additional 75 to 130 affordable homes each year.'",
        "'speaker_1': 'Studies over decades consistently have shown that decreasing inequality is far more effective in reducing crime and improving public safety than increasing policing, as the majority of the Council did not agree at that time. This Council bill would invest in, rather than investing more money, more funds in addressing inequality by, for example, expanding affordable housing is going to'",
        "'speaker_1': 'spend more money to speed up officer hiring. And I don't think there's any data to support that. Actually hiring more police officers reduces public improves public safety or reduces crime. It's actually addressing inequality that does that. And for that reason, I will be voting no.'",
        "'speaker_1': 'And on a side note, I will also mention how come we have not seen hiring bonuses for educators and emergency medical technicians and social service workers or any of the numerous other public jobs that do nonviolent life saving work.'",
        "'speaker_1': 'And I constantly ask to do so on some of the lowest wages in the city.'",
        "'speaker_0': 'Okay. And what else?'",
        "'speaker_2': 'I'm going to wrap it up. I'm going to try to make some closing remarks here. And so I think I wanted to just respond to Councilmember Herbals suggestions about some of the additional work that can be included as part of the work group.'",
        "'speaker_2': 'My office will be able to have a seat at that work group, so we'll make sure to loop in your feedback, Councilmember Herbold, to make sure that we are capturing some of that additional data that you've highlighted that I think is absolutely important and critical to this.'",
        "'speaker_2': 'I also just want to note that in terms of the hiring bonus for laterals versus new recruits, part of the reason why I was motivated to expand this to new recruits and not just be hyper focused on laterals is because laterals are are a very small portion of that of the type of officers that the police department'",
        "'speaker_2': 'has historically been able to hire to address the the hiring shortage and the staffing issues. And so my my hope is that by offering the new recruit hiring incentive, we will actually see a significant increase in bump of hiring in that particular section, in large part because we're the only jurisdiction that I'm aware of that will be'",
        "'speaker_2': 'offering a hiring incentive for new recruits. And then lastly, I just wanted to clarify one last fact that I think I, I, I think was misstated by Councilmember Swamp, which is that this is not a budget action. We are not allocating additional dollars to the Seattle Police Department for them to fulfill this hiring bonus.'",
        "'speaker_2': 'This is a policy shift in the policy change that would allow them within their existing appropriated budget to utilize the dollars that they currently have in their budget for staffing to also include this hiring bonus as a strategy.'",
        "'speaker_2': 'And if the hiring bonus doesn't work, we won't be paying out any money and there will be absolutely no dollars spent in this space. So the dollars that are going to get spent within existing budget authority of the Seattle Police Department will only be spent if there is success in this area.'",
        "'speaker_2': 'And if there is not, then that means we need to take corrective action and the data that we are requiring that the police department provide to us and the long term work of the work group to address the ongoing issues of hiring and the staffing models and the forecasting will need to be informed by any lack of'",
        "'speaker_2': 'success or success in this space with this strategy.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Gonzales. Okay. I think that wraps it up and we'll move. So we already did. The substitute bill was adopted. So right now I move to pass council bill 119468 as amended.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Are there any further comments? No. Seeing none. Will the clerk please call Raul O'Brien?'",
        "'speaker_6': 'I so want know by John Gonzalez.'",
        "'speaker_2': 'I herbold. I Johnson must get a I. President Juarez.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Seven in favor one.'",
        "'speaker_0': 'Opposed the bill passes as amended and the chair will sign it.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'So let's go on to o cancer. Gonzalez, you have another matter for us? An appointment. I'll let you go ahead and tee that up.'",
        "'speaker_2': 'I would love for the clerk to read this again.'",
        "'speaker_3': 'Agenda Item seven Appointment of 59 Re-appointment of Maya Butler as Member, Immigrant and Refugee Commission for Term two January 31st, 2021. The committee recommends the appointment be confirmed.'"
    ],
    "AN ORDINANCE relating to The City of Seattles datum point; updating the vertical and horizontal reference datum for City of Seattle departments and outside entities as a standard elevation reference plane; requiring certain measurements for preliminary plats to be based on the updated vertical and horizontal datum; amending Chapter 1.20 of the Seattle Municipal Code; and amending Sections 23.22.020, 23.75.100, 25.06.030, 25.06.070, and 25.06.090 of the Seattle Municipal Code.": [
        "'speaker_0': 'Please read the report. Do you mean please read into the record? Okay, that's where I was getting confused. All right, so I will report of the Civil Rights, Utilities, Economic Development Arts Council member Herbold. Please read into the record three.'",
        "'speaker_3': 'Point the Civil Rights, Utilities, Economic Development and Arts Commission and item eight cancel 119 420 relating to.'",
        "'speaker_2': 'The city scale starting point.'",
        "'speaker_3': 'Updating the vertical and horizontal reference.'",
        "'speaker_2': 'Item for city sales.'",
        "'speaker_3': 'Departments and outside entities. Committee recommends the bill passes amended.'",
        "'speaker_8': 'Thank you. So Council Bill 11 9420 reference is something called a datum point that you will not have to hear me talk about anymore after this. A data point is a reference point.'",
        "'speaker_2': 'That is used.'",
        "'speaker_8': 'For the entire city in surveying and construction in order to provide a known location to to measure from to measure the position of a height, the position or the height of an object in relation to the datum point itself.'",
        "'speaker_8': 'The datum points were last updated in 2020 I'm sorry, in 2023. This legislation would eliminate the need for future code updates and ensure that the city is at the most current current datum point. Both the horizontal and vertical datum will be updated in 2022, but that again will not require any vote from the city council.'",
        "'speaker_0': 'Right. Any comments? Hey, please call the role on the passage of the bill o'brien. I swi i.'",
        "'speaker_2': 'Picture Gonzalez Herbal Johnson mascara i president whereas.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Hate in favor not.'"
    ],
    "AN ORDINANCE authorizing the General Manager/CEO of Seattle Public Utilities to execute a contract with Waste Management of Washington for construction waste collection services; and ratifying and confirming certain prior acts.": [
        "'speaker_0': 'Oppose. The bill passes and the chair will sign it. Please read the next item into the record.'",
        "'speaker_3': 'Agenda item nine Constable 119 464 Authorizing General Manager, CEO of Seattle.'",
        "'speaker_2': 'Public Utilities to execute a contract with Waste Management in Washington.'",
        "'speaker_3': 'For construction.'",
        "'speaker_2': 'Waste.'",
        "'speaker_3': 'Collection services. And I think Information and Practice Committee recommend to go pass thermal.'",
        "'speaker_8': 'Thank you. Waste Management is the current provider of these services and was selected again after an open RFP request for proposal. The new contract is for 6 to 12 years and will begin in April 2019 if approved by the full council.'",
        "'speaker_8': 'The contract covers delivery and collection of temporary drop boxes at construction sites for non-recyclable waste. This contract actually covers a little less than 10% of total disposed construction waste, as most waste is actually serviced by independent recyclers or self hauled by large construction firms who basically cut out the middleman by delivering their waste straight to the rail'",
        "'speaker_8': 'yard. The new contract includes prices that are comparable to the current expiring contract.'",
        "'speaker_0': 'All right. Any comments? Okay, let's go forward then. Please call roll. Call the roll on the passage of the bill o'brien. So want I beg.'",
        "'speaker_2': 'John Gonzalez Herbold Johnson Machado hi president Suarez.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Adan favor and.'",
        "'speaker_0': 'Unopposed the bill passes and the chair will sign it. And please read the last two items for Councilmember Herbold into the record.'"
    ],
    "AN ORDINANCE relating to historic preservation; imposing controls upon the Broad Street Substation, a landmark designated by the Landmarks Preservation Board under Chapter 25.12 of the Seattle Municipal Code, and adding it to the Table of Historical Landmarks contained in Chapter 25.32 of the Seattle Municipal Code.": [
        "'speaker_0': 'I was just going to say that I was just getting ready to see it. Go ahead.'",
        "'speaker_3': 'And the report of the Finance and Neighborhoods Committee Agenda Item 12, Constable 119 467 Building Historic Preservation, Placing controls upon the Broad Street Substation Committee recommends the bill pass.'",
        "'speaker_0': 'Thank you. So this exciting item, after.'",
        "'speaker_1': 'Everything else.'",
        "'speaker_0': 'We've done, I'm going to move to approve this council bill 119467, which will add to the table of historic landmarks to particular points of light in the broad substation for Seattle City Light. We are looking at the significant aspects both cultural, political and heritage in this area, and there's some controlled features that include the control and queen'",
        "'speaker_0': 'buildings and the tower itself. So with that, I would like to move adoption of the designation second. Okay. Okay. Any other comments? All right. So please call the rule on the passage of the Bill O'Brien.'",
        "'speaker_6': 'Swan I beg.'",
        "'speaker_2': 'Shanghai. Gonzalez, purple Johnson Macheda I President Suarez.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Eight and favorite nine.'"
    ],
    "A RESOLUTION establishing a Watch List of large, complex, discrete capital projects that will require enhanced quarterly monitoring reports for the 2019 calendar year.": [
        "'speaker_0': 'Opposed the bill passes and the chair will sign it. Please read the next letter to the record.'",
        "'speaker_3': 'Pagina 913 Resolution 318 66 Establishing a watch list of large, complex, discrete capital projects that will require enhanced quarterly monitor reports for the 2018 calendar year. The committee recommends the resolution be adopted.'",
        "'speaker_0': 'Great. Excellent. Thank you. With much. Thanks to Council member Lisa Herbold at its other end, did you want to bring forward an amendment at this point? I do, actually.'",
        "'speaker_8': 'So we have a proposed amendment to the resolution as as discussed in committee that creates an expectation for where the.'",
        "'speaker_0': 'Quarterly reports.'",
        "'speaker_8': 'On the projects that are included on the watch list will be heard. Part of this enhanced reporting and oversight of large capital projects not only includes having some shared expectations with the executive, but it also requires, I think, a change in focus on the council that we actually agree to find a time and a place at our'",
        "'speaker_8': 'committee meetings to hear what the what the reports coming out of these specific projects say. And and with the idea that if we hear those reports in committee and we identify problems with projects on the the watch list, we will be able to better hold ourselves accountable for addressing those problems with scope or budget as they are'",
        "'speaker_8': 'identified. So it's important, I think, to actually embrace the role that the council has by affirmatively stating that we will hear these reports in a council committee. And so that's what this amendment does. Should I read it? Okay.'",
        "'speaker_8': 'So Amendment one two, Resolution 31866. Basically, like I said, memorializes the city's intent at the Finance and Neighborhoods Committee, review the enhanced quarterly reports, and it states the city Council anticipates that the Finance and Neighborhoods Committee or Successor Committee will review the intent enhanced quarterly reports.'",
        "'speaker_0': 'Any other comments? Oh, okay. So it's been. So are we moving? It was moving. She's moving it. I'm seconding it. It's been moved and seconded and the amendment will be adopted. Any comments? No more comments. Those in favor of the amendment vote.'",
        "'speaker_0': 'I think those opposed the motion carries and the amendment is adopted. Great. And I'll just speak to the underlying bill then as amended. So this resolution establishes a watch list of complex capital projects, something that Councilmember Herbold brought up during budget.'",
        "'speaker_0': 'And page three of the resolution establishes the initial watch list of the complex projects. Quarterly The mayor will provide us an enhanced list, and the oversight will primarily be focused on scope, schedule and budget of the individual projects.'",
        "'speaker_0': 'And as noted by this amendment, it will come to the Finance Committee. We will get this started in the next quarter and will invite all who are have any specific projects from their committee. As I mentioned this morning, if it's transportation, we will invite Councilmember O'Brien, give you plenty of notice to know when it's coming up and'",
        "'speaker_0': 'then if you've got any issues around it, we'll get more information before the vote. So with that, I would like to propose that we adopt this resolution as amendment. So all right, then we're done with that. So those in favor but lightweight to adopt resolution 31866 as amended.'",
        "'speaker_0': 'I think there's a second already. Yeah, yes. Yes. Okay. And there's any other comments. Oh, Councilor Johnson.'",
        "'speaker_9': 'Thanks. Just sorry about that. That's okay. I understand. I just want to thank Councilmember Herbold for continuing this conversation. I think the a lot of this germinated when we all many of us started on the council in early 2016.'",
        "'speaker_9': 'And we're faced with the prospect of several major capital projects that were at 100% of their budget, but maybe only 80 or 90% through their scope. And folks were coming to us and asking for forgiveness rather than permission.'",
        "'speaker_9': 'And and what were we going to do? We were we had left with no choice but to approve additional resources, because the thing that was going to get built or the thing that we were buying was the thing that we needed.'",
        "'speaker_9': 'And I think that the intention here is to create opportunities for the council to have better communication with these individual departments and individual project managers as the projects move forward so that we have a chance to choose maybe some changes in scope or changes in timeline of deliverable delivery without having to necessarily be the recipients of bad'",
        "'speaker_9': 'news at the end of a projects budget when the project wasn't still yet complete. So I'm looking forward to seeing how this plays out over the next several years. Councilmember O'Brien I wish you luck because 11 of these 18 projects are transportation related.'",
        "'speaker_9': 'So it seems like you're going to be spending a lot of time and councilmember back sales committee, though you are not necessarily a member of it. And, you know, I just think that this is at a base level a lot of what we should be doing as as government, working closely with those project managers to make sure'",
        "'speaker_9': 'that they are delivering their projects on time and on budget and making hard policy decisions early in the process as opposed to late. So I'm looking forward to voting yes on this.'",
        "'speaker_0': 'Well, well done. Okay. So let's move to a vote. Those in favor of adopting the resolution as amended. Vote. I was opposed. You know, who knows? The motion carries the resolution as adopted as amendment and the chair will sign it.'",
        "'speaker_0': 'So before we do that, we have to go on to other business. So is there any other business to come before a council councilmember skater.'",
        "'speaker_3': 'Thank you, Madam President. It was an exciting to watch you lead us through today's full council. Thank you for your leadership on that. I'd like to move to be excused next Monday as I will be in Washington DC for the National League of Cities Housing Task Force and convening.'",
        "'speaker_0': 'Okay motion and it's been seconded those all in favor of letting Councilor Mosquito go to Washington DC say I was opposed. No, the ayes have it. Go forward, do good.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Okay, so with that, I think we are adjourned. Good job. Thank God.'"
    ]
}