{
    "Ordinance to Amend Zoning Code and Map for North Housing Property on Former NAS Alameda.": [
        "'speaker_1': 'in order to convey the property to c, p b i Admiral's Cove, LLC, Habitat for Humanity and the Alameda Housing Authority. We do have space.'",
        "'speaker_0': 'Thank you. So, Kelso, I'm going to go ahead and call the speakers. Austin Tam, Dorothy Freeman and then Joseph Witter.'",
        "'speaker_2': 'Oh. Good evening, members of City Council. You know who I am? My name is Austin. Tim. I voted for some of you in in in the past. I am speaking on behalf of the p. The for seniors and disabilities committee.'",
        "'speaker_2': 'And as as a registered voter and as someone who lives with a disability, I am a I stand and I stand in full support of north housing, especially because seniors and disabilities, among many other people, need a roof over their head and affordable housing.'",
        "'speaker_2': 'And this is one way you can this is one way you can advocate if you support seniors and people with disabilities as well as everyone belongs. As as as as two of you were present yesterday for the MLK event.'",
        "'speaker_2': 'I think we should just not walk the talk. Walk the walk, the talk, the talk. And. Thank you for your time. And I again, I stand in support of north housing. And I am. I hope that you do the right thing.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Dorothy Freeman. And then Joseph Whitaker.'",
        "'speaker_4': 'Good evening. I'm Dorothy Freeman. The planning board and staff recommended against removing the.'",
        "'speaker_0': '435 unit cap on north housing.'",
        "'speaker_4': 'Those who say it was illegal to do so are incorrect. A group of units can be removed from the housing element as long as the unit numbers and acreage can be assigned to another parcel of land.'",
        "'speaker_0': 'That was not.'",
        "'speaker_4': 'Part of the 2012 housing element. Side promoted provided such units and acreage. There was nothing illegal about imposing the cap.'",
        "'speaker_0': 'Some of the council members.'",
        "'speaker_4': 'Stated the cap needed to be removed because of the housing crisis. Removing the cap actually makes the housing problem worse and not better. Presently, the offer to rehab 146 units into a much needed three and four bedroom units that would be available within approximately one year will do more to help the housing crisis than waiting 3 to'",
        "'speaker_4': '7 years.'",
        "'speaker_0': 'On another.'",
        "'speaker_4': 'Construction project. Not a very.'",
        "'speaker_0': 'Smart choice, a council member.'",
        "'speaker_4': 'Said, and I quote, I don't want by voting.'",
        "'speaker_0': 'For the cap to put roadblocks in front of someone that's.'",
        "'speaker_4': 'Coming in who's willing to rehab and have housing in a year.'",
        "'speaker_0': 'End quote. How can retaining the cap put a roadblock in front of Carmel's plans to retain the 146 units?'",
        "'speaker_4': 'It doesn't, but removing the cap can.'",
        "'speaker_0': 'Carmel Properties bought the federal property, assuming the combined.'",
        "'speaker_4': 'Developments would be 435 units.'",
        "'speaker_0': 'And that property is not and that company is not interested.'",
        "'speaker_4': 'In removing the cap.'",
        "'speaker_0': 'Carmel has.'",
        "'speaker_4': 'Agreed to install infrastructure for only 435.'",
        "'speaker_0': 'Units. Carmel has already.'",
        "'speaker_4': 'Stated that the city mandated.'",
        "'speaker_8': 'Infrastructure.'",
        "'speaker_0': 'Cost has placed a financial burden on them.'",
        "'speaker_4': 'But not to the point of making.'",
        "'speaker_0': 'Them pull out of the deal.'",
        "'speaker_4': 'Why would they reconsider then sense you have increased the value of their acreage well well.'",
        "'speaker_0': 'Beyond what.'",
        "'speaker_4': 'They paid the feds for it.'",
        "'speaker_0': 'Removing the cap can.'",
        "'speaker_4': 'Definitely put a roadblock.'",
        "'speaker_0': 'In Carmel's plans by offering them a windfall that will be hard for the board to ignore. The land will be more.'",
        "'speaker_4': 'Profitable to sell than to rehab the existing units for.'",
        "'speaker_0': 'Rental. The Housing Authority.'",
        "'speaker_4': 'Has nine acres for development at 15 acres per unit per acre.'",
        "'speaker_0': 'Their land has their plan has been to build 90 low income houses without the cap and allowing market rate.'",
        "'speaker_4': 'Homes at 30 units per acre and.'",
        "'speaker_0': '20% low and moderate.'",
        "'speaker_4': 'Unit density bonus.'",
        "'speaker_0': 'The number of low income.'",
        "'speaker_4': 'Units would actually be.'",
        "'speaker_0': 'Lower than the nine plan.'",
        "'speaker_4': 'Today, plus several years of delay.'",
        "'speaker_0': 'Staff recommended retaining the cap and holding the unit numbers above 435.'",
        "'speaker_4': 'To use when.'",
        "'speaker_0': 'The next.'",
        "'speaker_4': 'Housing element is issued in 2022. A smart.'",
        "'speaker_8': 'Plan for banking.'",
        "'speaker_4': 'For the future. By removing the.'",
        "'speaker_0': 'Cap now, you have removed the possibility.'",
        "'speaker_4': 'For negotiating a better plan in the future. When you have, what you have now is uncertainty.'",
        "'speaker_0': 'For all involved. The desire for possible high density market rate housing will take years to bring to fruition and has possibly put roadblocks in front of Carmel's willingness to rehab the 146 houses, housing units and all the.'",
        "'speaker_4': '90 low income units. Thank you.'",
        "'speaker_0': 'Thank you. Joseph Woodard. And then Katie. Derek. And Tony Grim.'",
        "'speaker_3': 'Good evening. Paul Foreman, a member of the Alameda Citizens Task Force, has written you a letter, and he has also written a summary of that letter, which I'm going to read. At the City Council meeting of January 2nd, 2018, the three city council, three city council members who voted against retaining the cap on north housing and all'",
        "'speaker_3': 'of the community speakers who supported the same raised the point that we have a critical need for affordable housing. A.C.T. fully supports the need for this housing, but submits that the retention of the CAP would actually increase the chances of developing additional affordable housing.'",
        "'speaker_3': 'Our reasoning for this conclusion follows our inclusionary housing ordinance, when combined with the density bonus law, gives the city only 12 and a half percent of affordable housing, leaving 87 and a half percent to be eaten up by market rate housing.'",
        "'speaker_3': 'Thus, we would need to construct nearly 8000 new living units to meet our current housing element goal of 975 affordable units. This is a goal we will never come close to meeting in our current housing element. The new anti NIMBY laws preclude any negotiation for a higher percentage of affordable housing than required by our inclusionary housing ordinance'",
        "'speaker_3': '. The suggested north housing cap of 15 units per acre by setting a very restrictive objective density standard, creates negotiating room for the planning department to push developers to offer a much higher inclusionary rate in order to achieve a waiver of the cap, perhaps as high as the 25% rate applicable to the adjacent Alameda point parcels.'",
        "'speaker_3': 'While North Housing is only 130 acre plot, it would have the potential to significantly increase the affordable housing potential of the same. In summary, notwithstanding all of the Council's stated concern about the critical need for affordable housing, the current path will leave us consistently far short of our affordable housing goals while crowding out affordable housing.'",
        "'speaker_3': 'With market rate housing, there are no easy solutions, but the North Housing cap presents a strategy that may at least make a dent in the problem.'",
        "'speaker_0': 'Okay. Next speaker, Katie Derek and then Tony Graham. And then there's Varella.'",
        "'speaker_8': 'Good evening.'",
        "'speaker_2': 'My name is Katie Derek. I'm the.'",
        "'speaker_8': 'Development manager at Operation.'",
        "'speaker_2': 'Dignity.'",
        "'speaker_8': 'I'm here to thank the Council for its support of affordable housing development at the North Housing site under item five.'",
        "'speaker_2': 'Kay. This housing stock is urgently.'",
        "'speaker_8': 'Needed in Alameda. For more than a.'",
        "'speaker_2': 'Year now, Operation Dignity has partnered.'",
        "'speaker_7': 'With the city to provide.'",
        "'speaker_8': 'Street outreach to people who are homeless. In this outreach program, we currently work with more than 60 individuals in Alameda who are without shelter. Many of them are long term Alameda residents.'",
        "'speaker_2': 'Who can no longer afford.'",
        "'speaker_8': 'Housing here in their community. As the housing crisis in the Bay Area continues, it is.'",
        "'speaker_2': 'More important than ever for local jurisdictions to build affordable.'",
        "'speaker_8': 'Housing now so that Alameda and all its residents can continue.'",
        "'speaker_2': 'To thrive in the years to come. So thank.'",
        "'speaker_8': 'You for your attention and your leadership in making affordable housing.'",
        "'speaker_2': 'A reality for all. Alamitos.'",
        "'speaker_0': 'Thank you, Tony Graham. And then this really. And then Irene Deeter and then Doug that I am.'",
        "'speaker_8': 'I'm speaking on behalf of the Alameda Renters Coalition Steering Committee. We endorse the position taken by renewed hope at the last meeting.'",
        "'speaker_0': 'Namely that the 435 unit cap.'",
        "'speaker_8': 'On this proposal is against the city's housing element. We urge you to.'",
        "'speaker_7': 'Support this proposal as an important step toward alleviating the housing crisis. A vote against the cap is a vote.'",
        "'speaker_8': 'Against affordable housing.'",
        "'speaker_0': 'Liz Rella and then Irene Dieter.'",
        "'speaker_2': 'For the. Yeah.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_8': 'Hi, I'm Lazaro. I'm executive director of Building a Future for Women and Children. And I'm here to thank you for removing the CAP last meeting and supporting affordable housing. We are one of the partners with the Housing.'",
        "'speaker_7': 'Authority and this.'",
        "'speaker_8': 'Project will not only alleviate.'",
        "'speaker_7': 'Much of the house of a do our part in alleviating the homeless crisis.'",
        "'speaker_8': 'We can only do what we can do. We can't fix the state of California and the affordable housing crisis, but we can we can go one parcel at a time and make a difference.'",
        "'speaker_7': 'And this is our chance to make a difference.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Irene. And then Doug Biggs and then Gabby. And if you want to speak on slide and please submit your set. Hello, Mayor and council members.'",
        "'speaker_8': 'I'm Irene Dieter, and I'm a member of the Open Government Commission. I'm here tonight to talk about the public notice that was in our newspapers. It was incorrect, and I think it should be corrected.'",
        "'speaker_0': 'I realize that the purpose of the notice was letting people.'",
        "'speaker_8': 'Know about the final passage tonight.'",
        "'speaker_0': 'And that the.'",
        "'speaker_8': 'Zoning ordinance change removes the cap. However, the notice went on further to say that Carmel Partners requested that the cap be removed. That is not true. Carmel Partners.'",
        "'speaker_9': 'Did not.'",
        "'speaker_8': 'They made that clear at the last meeting and so did city staff. So I'm not sure why that was in the public notice. I'm not sure how to remedy the situation. The only thing I can think.'",
        "'speaker_0': 'Of is, is to republish it.'",
        "'speaker_1': 'But I don't.'",
        "'speaker_8': 'Think that any of you would want a historical record that is incorrect. So I decided to bring this up tonight. Thank you.'",
        "'speaker_0': 'Thank you. Doug Briggs and then Gabby Dolphin.'",
        "'speaker_5': 'Good evening, Madam Mayor. Members of the City Council. My name is Doug Briggs and the executive director of the Alameda Point Collaborative and one of the partners along with the Alameda Housing Authority, to create 90 critically needed units of housing, or at least 90 critically needed units of housing for homeless here in Alameda.'",
        "'speaker_5': 'I want to thank you for the initial passage of the ordinance to remove the government overlay for the North housing property. I also want to make clear, I know there's been a lot of interpretations of this particular from speakers earlier.'",
        "'speaker_3': 'In the evening.'",
        "'speaker_5': 'You were not and you are not tonight talking about retaining a cap. There is no cap in existence once the true overlay went off. Some of you on the council I know have indicated an interest in imposing a new cap on affordable housing.'",
        "'speaker_5': 'I'd ask that you not do that. Not having a cap on, you know, releases the shackles on us that would prevent us from designing both a financially effective project and a strong community project. I had the opportunity to spend the afternoon here in the council chambers with a number of members from a variety of congregations, the faith'",
        "'speaker_5': 'community here in Alameda to talk about ways to help end homelessness in our city. Overall among every single congregation representative here. I know some of them are representing churches that some of you go to talk about the moral obligation that they have to treat the homeless like their brethren and provide housing for them.'",
        "'speaker_5': 'And so I would ask you tonight to do the morally right thing. And when you vote to approve the second reading of this ordinance, you make it a unanimous vote in favor. Thank you very much.'",
        "'speaker_0': 'Thank you. And our last speaker on this item, Gabby Dolphin.'",
        "'speaker_7': 'Hi, Madam Mayor. City Council. Good to see you guys again. Hope you're all well. Happy New Year. I too. I want to thank you so much. I know how much work this whole housing issue is for you guys.'",
        "'speaker_7': 'And you really you really pulled it a long, long ways. And to me, it's just a sense of sometimes you just have that jump and last meeting. It's like you made that commitment. I do hope you stick to it.'",
        "'speaker_7': 'I attended that same meeting that Doug Biggs just referred to, and it's nice to know that Alameda is discussing having what amounts to like a oh, just like a little drop off point to catch the human beings who are being pushed out of our system.'",
        "'speaker_7': 'It's called a warming station. I don't know if you've heard about this, but there's talk about creating one here in Alameda on the coldest, wettest nights. Alameda does. And I learned, too, that most of the homeless come from Alameda.'",
        "'speaker_7': 'They are our community can go there when it's really, really tough and get warm, get dry, possibly get a change of clothes and then they will be out and and they've got a great organization that way. So I, I really hope that we don't need to make they don't want to make that a permanent feature of Alameda'",
        "'speaker_7': '. I really hope we don't have to be a catch bay basin for the the situation we have rent wise and affordable housing wise. The last thing I wanted to say was I'll just kind of cut through all the details and the facts because I don't know all the details and I don't know all the facts.'",
        "'speaker_7': 'But I heard and I spoke this past Martin Luther King weekend about something I had seen on Facebook. And it said, and I do believe we are in a serious housing crisis. And the seriousness of it is when you see human beings under our freeways and sleeping on the streets that I know, I ask myself, Gee, what'",
        "'speaker_7': 'would I do during, say, slavery or the Holocaust or the civil rights movement? What would I do? What I would do is what I'm doing now. It's in our action. It's not our words. And I think the project is well enough defined and nicely managed and ready to go.'",
        "'speaker_7': 'And we'll be able to provide some housing for some people and start to really start to relieve the pressure. But the momentum will have started. That's an important thing too. Thank you all for the work you do.'",
        "'speaker_0': 'Thank you. She's our last speaker. If you'd like to go first, remember. Mayor.'",
        "'speaker_4': 'Mayor. Thank you. Thank you to all the speakers. Everyone coming out a second time. I was reflecting as I was listening to the speakers that. There are a lot of ways to oppose a project or a decision. And in this particular case, I think we do need to consider very carefully, because it is true that among the'",
        "'speaker_4': 'Mercury units we would be providing, we're also providing through the Housing Authority and Habitat for Humanity, very well needed units for formerly homeless individuals, for people in low income categories. And I am certainly heartened to know that AC key supports increasing the number of affordable housing units in our city because they have not always supported increasing the'",
        "'speaker_4': 'number of housing units. But if I had to decide whose remarks I would adopt and in follow, it would be the women from Operation Dignity, the development manager, Katie Derrick. We will hear more about Operation Dignity when we get to our regular agenda item six A where we are going to, I hope, approve the needs statement for'",
        "'speaker_4': 'housing and community development for the CDBG grant every year. And you will see when we get to that item that at the top of the list is providing housing for the homeless, for people who are on the edge of homelessness because they fall into such a low income category.'",
        "'speaker_4': 'So we've heard the argument that removing the cap, which came off automatically when we removed the government overlay as we had to do by law, is somehow going to reduce the number of affordable housing units that will ultimately be provided.'",
        "'speaker_4': 'I, I don't agree with that reasoning. And again, I'm, I am more attuned to the people who are, if you will, working in the trenches, Operation Dignity, Building Futures. And we need more, not less, of the kinds of housing we're hoping to provide.'",
        "'speaker_4': 'So I am ready to move forward on this. We we can't you know, you can personalize. It's like this every time with my microphone. You can't even personalize an issue by talking about statistics and numbers in this category, in that category.'",
        "'speaker_4': 'But when it comes down to it, it is, as I think most often said, the person sleeping under the freeway or not even under the freeway when the city manager and I it's been about a year ago now, partnered to help with the countywide homeless count.'",
        "'speaker_4': 'But in Alameda we learned to recognize where people were sleeping in cars. And there the homeless are hiding in plain view if you know where to look and what to look for. So I think that whatever we do is in some ways a drop in the bucket, but it's something.'",
        "'speaker_4': 'And as Ms.. Varella said, we can't solve the whole state of California's housing problems. But the five of us are responsible for making policy in Alameda, and I'm fully prepared to do what I believe is the right thing and approve the second reading final passage of this ordinance.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Number matter SB.'",
        "'speaker_3': 'I think it's unfortunate that that. When the G overlay was taken off that automatically the council voted to have 30 units per acre replace 15 units per acre. I think it was completely strategically and urgently needed that that 15 unit per acre restriction on the part that's going to be developed by the Housing Authority.'",
        "'speaker_3': 'And up and the Habitat for Humanity, those are the actual affordable units in this in this equation as it stands now. That that needs to come off and needs to be at 30 units per acre. It's unfortunate because when people talk about when a private property owner gets this property, we just took away the one thing that'",
        "'speaker_3': 'we had to bargain with and think about it for a minute. That site, a 800 units. 25% affordable. Was the trade off for this? It wouldn't have been. 25% of those units weren't traded to from north housing because there's going to be something less here.'",
        "'speaker_3': 'And developers provide more affordable units when they want something that when the city has something that they want, we can trade with. And we gave it away without a commitment for affordable units. So when someone says that we have to take care of people, people who are have disabilities, who are aged, who are low income, we need'",
        "'speaker_3': 'leverage to do that. And I submit that we need that leverage. When the plan comes, it is going to require something more than 15 units per acre and we say, okay, you want 30 units, staff is going to work with them and say, this is what you need to do to get the council to get us to'",
        "'speaker_3': 'give a recommendation to the Council on the Planning Board to change 15 to 30. So I would say I would like to see the resolution and the ordinance replaced. Remove the g over the g overlays remove replace it with 15 units in the parcel that is going to be privately owned and g and make it 30 units'",
        "'speaker_3': 'or they want the parcel that we know from the housing authority and from Habitat from humanity is going to deliver us affordable units. Then we can start negotiating on how to get affordable units out of the other half of the parcel.'",
        "'speaker_0': 'Staff couldn't even speak to these comments. We've had the suggestion that using, you know, from the council member matters in regards to what staff does to try to get a higher percentage of affordable housing. Could could one of you speak to that?'",
        "'speaker_9': 'Well, I think what that council member, Matarese, was talking about was. Using, not taking off the cap on the private property. And when a project comes in with the new development. So right now, it's a remodel. But if a if the castle is sold in the future, a new developer comes in and it's still at 15 dwelling'",
        "'speaker_9': 'units per acre, that new developer would come to the council first the planning board, and say, I would like additional units up to 30 dwelling units per acre at that time. Staff with the planning board and the planning staff would say, if you do that, then that is an increased value.'",
        "'speaker_9': 'And out of that increased value, we need additional community benefits. And depending on what the Council's direction is right now, it's affordable. Housing is the number one value that the council has been asked for, has been asking for.'",
        "'speaker_9': 'And so staff would say we want an additional higher percentage of affordable housing. It might also be additional transportation benefits for the community and might be better public access. It could be a whole bunch of different items that the community benefits from.'",
        "'speaker_4': 'Imagine a member.'",
        "'speaker_0': 'Addressing.'",
        "'speaker_3': 'Just one thing. Just. And we all know how much it costs to build affordable units. And if anybody doesn't know, look at Sherman and Buena Vista. 31 units, right? $18 million. That's almost $600,000 a unit. And this is being built by the housing authority.'",
        "'speaker_3': 'So we know it's expensive. But when you add 15 units to 15 units and get 30 units, the value of that land just increased without giving one thing.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_8': 'It's interesting because I kind of raised that point the first time we heard this and we heard from Andrew and Enrico, and they said that it was possible but very difficult to do because they would have to figure out the subdivision.'",
        "'speaker_8': 'I did specifically ask about that the first time around. So I appreciate Councilmember MODERATOR bringing that up tonight, but I also spoke with staff about it and it seems like a lot of hoops that we would have to jump through and a lot of time delays.'",
        "'speaker_8': 'And, you know, you also mentioned the costs of building affordable housing. So much of that cost is time. Time is a resource coming before council, coming before planning board, negotiating with staff as we see that time progress. We don't see things get built.'",
        "'speaker_8': 'City's a prime example of that. Yeah, we got a number of affordable housing units and tonight we voted to match the funds in case we get to the point where we can actually break ground. But we don't have those units.'",
        "'speaker_8': 'At the last meeting when we spoke about this issue. I said I wanted to remove administrative roadblocks to getting affordable housing. And I mean it. And I think we do it parcel by parcel. I think we have an opportunity here to do it.'",
        "'speaker_8': 'I, I understand the ability to negotiate. We've negotiated the max out on a number of projects and we don't really have anything to show for it. The Domani project we got the affordable housing. Thankfully, it's been a number of years since we've heard that project.'",
        "'speaker_8': 'We don't have the other units online. You know, I think when it comes down to it. I want to listen to our affordable housing providers. And they've spoken and they've spoken in unison on this and made a point collaborative Operation Dignity, the Housing Authority.'",
        "'speaker_8': 'And I want to respect that. I also think that there is a huge delay in terms of what happens and the amount of acrobatics that would have to be done in order to accomplish that verification, in order to negotiate just a few, you know, a few more things which may in the end, completely stall the project.'",
        "'speaker_8': 'We could love the project to death. I think we've seen that time and again. I don't want to do it. I'm in support of moving forward in terms of where we we were at the last council meeting and what we voted on.'",
        "'speaker_8': 'And I also think it's disingenuous, frankly, to say that Carmel Partners was bidding on the property, knowing that it was going to be capped. They knew that the government overlay was going to be removed. They didn't know whether or not council was going to then reinstitute a new cap on the property.'",
        "'speaker_8': 'Anybody bidding on it knew it was going to become private property and the government overlay was going to disappear. So I think in that regards, it's a little bit again, it's a little bit different from site, it's a little bit different from some of these other projects.'",
        "'speaker_8': 'I think we need to learn from the mistakes that we've seen. So I'm ready to move forward on this.'",
        "'speaker_5': 'We're already thinking as well as the city manager, so the clarification of the hypothetical was that Carmel could do this renovation and then in some undetermined years out in the future, they could decide to sell it to somebody else who would want to tear all that down and then build something else.'",
        "'speaker_5': 'I mean, is that the hype on that?'",
        "'speaker_9': 'Yes. I mean, that's how I understood it. On the private property, not on the housing authority. Castle.'",
        "'speaker_5': 'I mean. That's. Okay. I'm not quite sure how. I'm not sure how realistic that is. But I always appreciate my colleague, Mr. Matt Orestes thoughtfulness in his comments and his approach to these issues. I'm going to respectfully disagree on this.'",
        "'speaker_5': 'The one thing I was surprised since we voted on this, that how many people came up to me and said, thank you for that vote and. That kind of blew me away because I maybe I do the wrong thing and never hear that enough.'",
        "'speaker_5': 'But, I mean, people were just genuinely appreciative that we took that step to take a stand and and support more housing in Alameda. So, I mean, that that's something that that stuck with me over the past couple of weeks.'",
        "'speaker_5': 'So I plan on supporting as well. And I've actually like to motion or make a motion that we approve the item.'",
        "'speaker_4': 'Second, before.'",
        "'speaker_0': 'I'd like to, because I haven't been able to speak.'",
        "'speaker_4': 'To, I just was grabbing the chair. A follow up on something, the city manager member Ashcraft.'",
        "'speaker_0': 'I'd appreciate if I could do that if you could do that after I have the opportunity to speak. Thank you. Because okay. So I wanted to follow up in regards to these questions. Is it possible that Carmel Partners could decide to sell the property and not rehab the units at this time?'",
        "'speaker_0': 'Is there anything that actually requires them to build a rehab? I don't believe there's a restriction.'",
        "'speaker_9': 'It's private property. Once it's conveyed from the Navy to Carmel. And as a private property owner, they could sell it or remodel it or both.'",
        "'speaker_0': 'Okay. So. So they could in fact, not be given that the cap appears to be removed, will be removed, then they can reassess where they get the value of this property and decide then of if in fact they want to proceed with rehabbing units that would be online sooner rather than later.'",
        "'speaker_0': 'Or because the value the number of units is would go up from the 15 units per acre to 30 units per acre and greatly increase the value. If that were if the item, if the property were to be sold and that is within their purview, then to make that decision to.'",
        "'speaker_9': 'So because it's 30 units per acre, they have a right to build 30 units per acre instead of the restriction of 15. So, yes.'",
        "'speaker_0': 'Okay. So rather than rehab the units, they could actually decide a different business plan moving forward because they would and they would end up owning the property as opposed to the Navy.'",
        "'speaker_9': 'Yes. But it would start with a new it would be a new project. So I'd go through the normal process of going to the planning board, having community input and review, and potentially coming back to council for a call for a review or appeal.'",
        "'speaker_0': 'Right. But there's nothing that would legally bind them to have the units as opposed to selling the property or they themselves deciding to go forward with a different business plan.'",
        "'speaker_9': 'Right. Nothing.'",
        "'speaker_0': 'All right. And if, in fact, they ended up with a business plan that maximized the number of units without in fact, they have more significantly more retail value to them as a private developer.'",
        "'speaker_9': 'You mean is there more value in higher density?'",
        "'speaker_0': 'Correct.'",
        "'speaker_9': 'Generally that's the expectation from developers.'",
        "'speaker_0': 'Okay. And can you explain I know when we had them up the last council meeting, there were multiple community benefits that staff worked with on this project to obtain for the benefit of our community. And could you outline what those community benefits were?'",
        "'speaker_9': 'There. The two primary benefits are connection Singleton and Moseley that connects an area. No one basically adds access to Estuary Park, which was just completed. It also upgrades or cleans out the storm. Water puts in a lot, so high tide doesn't back into the system and upgrades the storm drain.'",
        "'speaker_9': 'There's a lift station for sewer that it would have to look at. We are also talking even today about having mostly be a straight street that goes through rather than trying to have it go around the existing sewer lift station.'",
        "'speaker_9': 'And so that is another component in the terms that we're still talking to them about. But from a planning point of view, I think it's critical to have a a straight street and also has street lights that they're putting in there, undergrounding the utilities and others.'",
        "'speaker_2': 'Providing infrastructure for the housing authority.'",
        "'speaker_9': 'And providing, yeah. The streets that go through and and utilities for the housing authority as well.'",
        "'speaker_0': 'Okay. So if they decided not to go forward with the rehab of the units, would the community receive all those benefits?'",
        "'speaker_9': 'Yes, they would. If you're assuming that they would build new that would.'",
        "'speaker_0': 'Receive at some point the property gets sold to a different developer to go forward or to them to come forward with a different project with the community receive.'",
        "'speaker_9': 'The community would probably receive more benefits than if it was a remodel. Right now what we're looking at is what the invitation for bid and what was required for the obligations. And that's what we've been looking at. If a new project came in and we had a higher density, we would look at it just like we look'",
        "'speaker_9': 'at any other North Waterfront housing project where we ask for additional transportation and asked for additional affordable housing. We could ask for a number of different community benefits if there was a bigger profit margin with the developer, and you get that from having the higher density.'",
        "'speaker_0': 'But would they have to agree to it since they already have? It's a.'",
        "'speaker_9': 'Negotiation. Yes. So it's a negotiation back and forth with the ultimate approval being either the planning board or the city council.'",
        "'speaker_0': 'Okay. And we're on Jane Sweeney Park. My recollection is there was money provided from Tim Lewis developers.'",
        "'speaker_9': 'And Lewis developers as part of dole money donated, I think, $2 million into Jane Sweeney Park. And there has been other contributions.'",
        "'speaker_0': 'Okay, thank you. Member Ashcraft.'",
        "'speaker_4': 'I wanted to go back and thank you, Mayor, and came back when you were talking about what would happen if the.'",
        "'speaker_2': 'You.'",
        "'speaker_4': 'Know, it's okay and. Every new developer brought back the Carmel Partners property. So. I mean, the city council still would have some say over what happens and what we would want to ask for, even if it did go to another another buyer.'",
        "'speaker_4': 'Isn't that correct?'",
        "'speaker_1': 'Well.'",
        "'speaker_9': 'It depends if. With the 30 dwelling units per acre. And the developer came in and did everything along the lines of what the zoning allowed and was permitted. Then it would just go to the planning board and design review.'",
        "'speaker_9': 'Of course, the council could call it up for a review or it could be appealed, and that's when the council would see it, unless there was a zoning change, general plan amendment or something else that would trigger having to come to council.'",
        "'speaker_4': 'So it could still come back to us, I think. But then the advantage of advantages of new construction is that when we do have requirements, when you're building new to go in and we do all the infrastructure and.'",
        "'speaker_9': 'Right. But the advantage to the remodel and the current project is that we get housing units that are not ultra luxury units and we get them at.'",
        "'speaker_4': 'Very soon there's a proposal and we get them sooner. And I think we can get a little hung up about who's making what profit off of land sales. But using the city example, I mean, I think it's something that should concern all of us because we're now midway into January, we have an April deadline for the developers'",
        "'speaker_4': 'to come back. And they've been pretty quiet. And I, I think we do need to keep an eye on the situation at hand and what we have within our within our grasp now. So and also the 25% affordable housing requirement at site, and I'm fully supportive of that.'",
        "'speaker_4': 'But wasn't that like this was before your time? But I think that was a requirement of the Navy.'",
        "'speaker_2': 'As I recall, last year.'",
        "'speaker_4': 'And that is the settlement. Right. Settlement, yes. Okay. All right.'",
        "'speaker_0': 'Thank you. Vice Mayor.'",
        "'speaker_8': 'I have one question and then I would like to call the question, since there's a motion in a second, has criminal partners indicated to you that they plan on building on completely redoing their plan and building 30 units?'",
        "'speaker_9': 'No, their plan is to remodel. Okay.'",
        "'speaker_8': 'Thank you. I'd like to call the question. We have a motion. I made a second.'",
        "'speaker_0': 'Okay. So all those in favor of calling the question I, I, I'm going to oppose because I didn't get to speak to it. So all those in favor.'",
        "'speaker_8': 'I, I.'",
        "'speaker_4': 'In favor of the motion. Correct? Correct. Yes. Yes, I.'",
        "'speaker_0': 'Pose.'",
        "'speaker_3': 'To pose.'",
        "'speaker_0': 'I propose. Thank you.'",
        "'speaker_4': 'So it passes 3 to 2, correct?'",
        "'speaker_0': 'Correct. Motion carries 3 to 2. Bathroom. And I will now call for a recess.'",
        "'speaker_4': 'You finished the confession?'",
        "'speaker_0': 'I see all council members here. I don't know. I'm only vice minister. Far as I know, everyone is here. All right, so let's go ahead and resume the meeting.'",
        "'speaker_3': 'They need a bathroom break.'",
        "'speaker_8': 'No, she's just going to raise it.'",
        "'speaker_0': 'So what are the rest of the. If everyone could take your seat.'",
        "'speaker_1': 'You wouldn't admit it.'",
        "'speaker_0': 'So we just had a couple of council members walk out. So we have to wait at this time for them to come back in, have some staff with one of you all could make sure they're aware that I have asked to resume the meeting.'",
        "'speaker_0': 'And they were here a moment ago.'",
        "'speaker_1': 'Oh.'",
        "'speaker_3': 'The unintended consequence.'",
        "'speaker_2': 'Well, I've always. Really?'",
        "'speaker_9': 'It was.'",
        "'speaker_2': 'Some things we can't control.'",
        "'speaker_3': 'But when something lose, thank.'",
        "'speaker_2': 'We're learning that every.'",
        "'speaker_0': 'All right. So just so you all know, we're going to go back to five H. I have had a request from counsel, our city attorney, to go back to five h. Yeah, our city attorney. To return to item five h, which is the adoption of the resolution approving parcel map number 10275.'",
        "'speaker_0': 'And I'm going to ask the clerk at this time what, you know, where either council members are. They were in the room when I called for the meeting to resume.'",
        "'speaker_1': 'They said that they're coming right back. They're using the restroom in the hall and coming right back as soon as they're done.'",
        "'speaker_0': 'They said, So can we continue this part of us?'",
        "'speaker_3': 'Madam Chair, I'd like to wait till they get back.'",
        "'speaker_7': 'Any three at the dias.'",
        "'speaker_0': 'Does anyone know what happened to member Odie?'",
        "'speaker_1': 'That where we've.'"
    ],
    "Parcel Map Approval for 1700 Harbor Bay Parkway Subdivision.": [
        "'speaker_0': 'As far as I know, they're in the in the hallway. Thank you. Thank you very much. So we just had a member of the community go out into the hallway to ask them to return to the chambers. Work.'",
        "'speaker_0': 'Could we find out what happened to our council members?'",
        "'speaker_1': 'I mean.'",
        "'speaker_0': 'Counsel. We're going to go ahead and continue the now in the room. All right. The attorney, please.'",
        "'speaker_7': 'So thank you, Madam Mayor and mayor and council. There is an issue that I believe needs clarification on the action you took on item five H on the parcel map on 1700 Parkway. Based on the action the council took, we want to clarify what the consequences of that action are.'",
        "'speaker_7': 'And I'm going to ask Selina Chen, assistant city attorney in my office, to explain that to you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'Evening. Selina Chen from the city attorney's office. I just wanted to give you a little bit of additional information about what the final vote meant. As you know, the project entitlements were approved a couple of years ago. What's before you today is was the parcel map approval?'",
        "'speaker_0': 'To clarify, it was over three years ago, not a couple. I think that's critical. This is back in 2014.'",
        "'speaker_4': 'Thank you, Mayor.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'Thank you. So the vote that was taken was two approvals, one no and two abstentions. In the MAP Act. The MAP Act requires the Council to either approve or disapprove a map. A partial map at this meeting or the next regularly scheduled meeting.'",
        "'speaker_7': 'If the findings are made, and if the map doesn't conform to the findings, you would disapprove the map. That goes on to say that if the Council does not approve or disapprove, it can be deemed approved. So it could be approved by a matter of law within a matter of time.'",
        "'speaker_7': 'So we just wanted to be transparent and let you know what the final vote was. Because by. I'm sorry.'",
        "'speaker_8': 'So can we recall the question then?'",
        "'speaker_7': 'I think your options are you could make a motion for reconsideration or move. The reconsideration has to be done by one of the abstainers because it has to be somebody who would change their vote that would impact.'",
        "'speaker_0': 'One of.'",
        "'speaker_5': 'The three of us.'",
        "'speaker_4': 'So I'm going to make no one of the abstainers. There were only two abstainers.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_8': 'I would like to make a motion for reconsideration.'",
        "'speaker_0': 'All those in favor. I. I saw that motion passes. All right. All right. So would someone like to make another motion?'",
        "'speaker_3': 'I would like to move the approval of the partial map.'",
        "'speaker_0': 'They're a second. I'll second all those in favor I others oppose.'",
        "'speaker_8': 'Oppose? No.'",
        "'speaker_0': 'So that motion fails. 2 to 3. So. I'd like to hear from you real quick.'",
        "'speaker_7': 'What I think I heard you say when you were having a discussion earlier is that you believe the subdivision is inconsistent with the general plan because the two resulting parcels exceed the general plans f.r, among other reasons. So to make.'",
        "'speaker_7': 'To disapprove. The map, you need to make a finding that the map is inconsistent with the general plan, and I would recommend making certain changes to the resolution if you choose to do so.'",
        "'speaker_0': 'Okay, so it's my end. So there was a list. It's not showing up here currently of multiple reasons, and my opinion is that the denial would actually be based on much more than just the one ground that there was only, I think one that I could have supported from that list, as well as the other reasons enumerated'",
        "'speaker_0': 'in the Unite Here letter. So I would like the findings to be exhaustive of all these enumerate all the multiple reasons, not just the meeting, the general plan, because I think there are multiple reasons raised and there was.'",
        "'speaker_0': 'So I don't have that sheet in front of me currently. The other.'",
        "'speaker_7': 'So if, if, if I might just insert here, I think that if you wish to take the action tonight that it would be relatively straightforward to go ahead and base the findings to disapprove on not being consistent with the general plan and let it go with that.'",
        "'speaker_7': 'If council wants staff to work through other potential reasons findings to not to disapprove, then we might have to bring this back.'",
        "'speaker_0': 'So like, I would think we can I would think we could enumerate all of the reasons because I anticipate we may have a lawsuit and I want to enumerate them all, not just one, but I don't I would think we can do that.'",
        "'speaker_0': 'We had the list up here earlier with like 13 reasons. And I personally would like to I'm happy to make the motion, but I think. Member Ody do you want to go ahead?'",
        "'speaker_5': 'Thanks, man. I mean, to me, there was a problem with the general plan and the development agreement. So I don't think those are things that couldn't be fixed if we either modified this somehow or modified the general plan incorporating some changes to this.'",
        "'speaker_5': 'So. As a hint for future action. I just at this point, I think it's in disagreement with this first development agreement. And that's the only problem I have with it.'",
        "'speaker_0': 'That is the only problem you have. I'm sorry. I couldn't hear.'",
        "'speaker_5': 'You. Yes. Yes, Madam.'",
        "'speaker_8': 'Chair. All right.'",
        "'speaker_0': 'All right. Vice Mayor, did you want to speak to this item?'",
        "'speaker_8': 'I just. I don't think it's consistent. I think it's very hard to follow. I think there's issues with the D.A.. I think there are issues in terms of just making it more clear. The example anyways, I defer to what our legal counsel saying in terms of if it's, you know, if it needs to come back to us'",
        "'speaker_8': 'to capture what the mayor's saying.'",
        "'speaker_0': 'And I don't I don't know why it would need to come back to us, because this is I would think that we should we could today make findings that it didn't meet that list and enumerate them all specifically, as well as the items that were raised in the correspondence from.'",
        "'speaker_0': 'And I don't know if I have, you know, if you all would be agreeable to that, but I think it is a better position than just enumerating to some.'",
        "'speaker_7': 'If I may. And I mean, Selina can go through all of the findings if you want to take the time to do that. But I believe you only need one. And I think we heard counsel and we've just heard counsel, including you, Manu, Mayor, that you are you do believe that it is not consistent with the general'",
        "'speaker_7': 'plan at this point in time and the three of you are supportive of that. So we could go with that. But I'm not arguing with you if you want to go through other findings.'",
        "'speaker_0': 'And so there was.'",
        "'speaker_4': 'Process to your question for the city attorney. What I heard my counsel, my colleague, Councilmember Otis, say is that he would like to see clarification of the development agreement, but that's not the same as saying an inconsistency with the general plan, is it?'",
        "'speaker_7': 'I believe that is it. That is the entire point. And I think and I don't mean to put words in any of your mouths or make your arguments, but I think what Councilmember Odie was suggesting is that something that could be fixed.'",
        "'speaker_7': 'So even though it would be disapproved tonight, staff could come back with clarifications to make the development plan and the general plan clearer that they are consistent. And once that happens, arguably, they can come back for a partial.'",
        "'speaker_7': 'I think it would only require an amendment maybe to the general plan, because the finding that is relevant is that the proposed map is not consistent with the applicable general or specific plan. It doesn't the map doesn't go into development agreements.'",
        "'speaker_7': 'So even if we did believe it was inconsistent with the development agreement, I don't think that would necessarily be a finding that would result in that would support denial. Of the map.'",
        "'speaker_5': 'It just in my mind, it needs to be clear. And and.'",
        "'speaker_7': 'I agree it should be.'",
        "'speaker_5': 'Clear. And I think there was some comment by staff when Alan spoke that it was a little bit fuzzy. So clarity is helpful. And I think the attorney captured my thoughts.'",
        "'speaker_0': 'So do you want to make a motion? The member already?'",
        "'speaker_5': 'So it would just be a simple move. Help me with this. So we do it the way you before.'",
        "'speaker_7': 'You make the motion, I would recommend making of some changes to the revised resolution, which I'd like to read into the record. We would revise the title by deleting the word approving and replacing it with the word disapproving.'",
        "'speaker_7': 'We would revise the first resolve clause and possibly bring.'",
        "'speaker_4': 'Bring that up on the screen.'",
        "'speaker_8': 'I'm sorry.'",
        "'speaker_4': 'Give us just a moment. Mr. Henry would.'",
        "'speaker_5': 'Make can we come back to this in, like 15 minutes? Do you do a mock up or. Oh, you have them.'",
        "'speaker_7': 'Oh, I have. Okay.'",
        "'speaker_5': 'I'm sorry.'",
        "'speaker_0': 'It's just you have.'",
        "'speaker_7': 'A red line to show you that.'",
        "'speaker_4': 'Even if we can at least revalue.'",
        "'speaker_7': 'And follow.'",
        "'speaker_4': 'Along and not only has, but the audience. Thank you.'",
        "'speaker_0': 'So, staff, pull the document.'",
        "'speaker_1': 'Trying to get it.'",
        "'speaker_0': 'We're having a.'",
        "'speaker_7': 'And this is the revised resolution, right? Yes. Okay.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_0': 'Because I think it has to. Could someone just go ahead?'",
        "'speaker_8': 'I can also pull up the list that Trish was referring to the objection.'",
        "'speaker_0': 'You know, there was a list of campaign items. I think.'",
        "'speaker_7': 'It's actually still on the.'",
        "'speaker_0': 'Table. Right. So if someone could actually pull that up before we do this. The one on the table. Just turn on the table, please.'",
        "'speaker_4': 'Will we be able to see them?'",
        "'speaker_0': 'No, but let's start at that.'",
        "'speaker_7': 'So what city attorney Kern said is accurate? The government code requires the legislative body to deny approval of the parcel map if it makes any one of the findings that are listed before you. And some of these findings, if you if you go through them quickly, there's findings about public health and safety.'",
        "'speaker_7': 'There's. Findings about conflicts with easements. Endangered species habitat. I mean, it's it kind of runs the gamut. And what I was hearing the most from the council members and most consistently was consistency with the general plan.'",
        "'speaker_0': 'Well, the first one, right, that the proposal is not consistent with the general plans and specific plans. But I would also like us to consider the second one that is on those two.'",
        "'speaker_7': 'Yes. Speak to the same issue.'",
        "'speaker_0': 'Okay. But I. So we would include them both. And then for the type for.'",
        "'speaker_3': 'We don't have a designer. Right. Yeah.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_3': 'Well, how can we include that one? If. If there's no design yet?'",
        "'speaker_7': 'It's actually the. I'm sorry. If I could. Go ahead. It's the design or improvement that's on the map. It's not actually the design that was approved by the planning board.'",
        "'speaker_3': 'Point taken.'",
        "'speaker_4': 'Thank you. So the improvement could be the division of the parcel? Yes.'",
        "'speaker_7': 'Okay. And sometimes any roads.'",
        "'speaker_5': 'So is it just number two then, or is it.'",
        "'speaker_0': 'One and one and twos, but I believe is appropriate. Looks like I have city attorneys could do. I'm sorry. I see nodding heads, but if you could just say I.'",
        "'speaker_7': 'Think wanting to both speak to consistency with general plan.'",
        "'speaker_0': 'Thank you. Right. So, um, would you like to make a motion?'",
        "'speaker_5': 'Do we want to go through the court?'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_7': 'Tell him the changes that you would make to the resolution. Get the resolution up. I could walk you through what changes I'd recommend if you'd like to make a motion to deny approval. So in the title, the first word approving, we would change that to disapproving.'",
        "'speaker_7': 'We would go to the first resolve clause. And revise it to read as follows it deals with. And we would say now, therefore, be it resolved that the City Council of the City of Alameda finds that its disapproval of parcel map number 10275 is not subject to the requirements of Sequoia pursuant to Sequoia guidelines section 15270.'",
        "'speaker_7': 'Sequel Guidelines Section 15270. Yes. And then delete the rest up through the semicolon and end. We would revise the second resolve clause to delete paragraphs two through eight in their entirety. And we would revise paragraph one to read as follows the proposed.'",
        "'speaker_7': 'Map comma together with the provisions for its design and improvement. Karma is not consistent with the general plan. Improvements. Is not consistent with the general plan, period. Page four. Of the land use element. Of the general plan. States that the maximum FFR.'",
        "'speaker_7': 'For the Harbor Bay Business Park. Is point five. Up with increases. Up to a maximum of two permitted. Of the number two committed. Karma. Proportional to the amount of.'",
        "'speaker_5': 'My like my typing.'",
        "'speaker_7': 'Proportional to the amount of required.'",
        "'speaker_5': 'Pressures on.'",
        "'speaker_7': 'Amount of required parking enclosed in a structure period. The proposed subdivision of the parcel. And development. Of a second hotel. Would result in two parcels. That exceed. The General plans. Apostrophe S. Point five. FMR limit. Semicolon and. And then we would revise the third and final resolve clause to read as follows.'",
        "'speaker_7': 'Now, therefore, be it further resolved that the City Council of the City of Alameda denies approval. Of Parcel Map number 10275. For the subdivision of the parcel at 1700 Harbor Bay Parkway into two parcels pursuant to. Government code.'",
        "'speaker_7': 'Sections. Six, six, four, seven, three, comma. 66473.5 karma. Six, six, four, seven, four, comma. And six, six, four, five, eight. And Alameda Municipal Code. Section 30, dash 78.5. Period.'",
        "'speaker_0': 'Three. Of the word of day. The second line denies removal of. Thank you.'",
        "'speaker_5': 'Yeah. That's it. That's it. So that I would move approval of that. The revised second resolution denying the property based or denying the map based on, as you describe it.'",
        "'speaker_0': 'Motion and the second. All those in favor I. I oppose.'",
        "'speaker_3': 'No, no.'",
        "'speaker_0': 'Emotion. Carriage 3 to 2. Thank you. Thank you. Then we can move on to the next item. Thank you. All right. So we have, uh, now we're on the regular agenda item six a.'",
        "'speaker_1': 'Public hearing to consider approving the Housing Community Development Needs statement for the Community Development BLOCK Grant in a plan for Fiscal Year 2018 19.'",
        "'speaker_0': 'And a mayor, council members and staff. I'm Lisa Fitz with the Alameda Housing Authority, and I'm here to speak on the Community Development BLOCK Grant needs for the fiscal.'",
        "'speaker_7': 'Year.'",
        "'speaker_8': '1819.'",
        "'speaker_1': 'Action Plan.'",
        "'speaker_0': 'Next slide. Do I have control over the site?'",
        "'speaker_7': 'Yes, that's right.'",
        "'speaker_0': 'So what is CDBG? The Community Development BLOCK grant is for federal funds that are provided by the Department of Housing and Urban Development, HUD, to develop their use to develop viable urban communities primarily for low and moderate.'",
        "'speaker_7': 'Income persons through decent.'",
        "'speaker_0': 'Housing, a suitable living environment and economic opportunity. The CDBG funded programs serve between 7000 to 8000 resident city residents per year. What are the required documents? The city is required to prepare a five year strategic plan, which outlines the housing and community development priority needs that will inform CDBG funding decisions for the upcoming five year period.'",
        "'speaker_0': 'To receive CDBG funding, the city has to submit to HUD an annual action plan detailing the program's.'",
        "'speaker_7': 'Activities and.'",
        "'speaker_0': 'Resources to address the housing and community development needs identified in the five year consolidated plan. In addition, there is a priority among the needs for non housing, community development.'",
        "'speaker_7': 'Social.'",
        "'speaker_0': 'Services.'",
        "'speaker_7': 'The Social Services and Human Relations Board.'",
        "'speaker_0': 'Shrub provides a refined priority statement to reflect the social service needs in the community, which is included in Exhibit.'",
        "'speaker_7': 'One of the packet. For the fiscal year 1819 needs process.'",
        "'speaker_0': 'There were three steps.'",
        "'speaker_7': 'The needs process commenced.'",
        "'speaker_0': 'With step one. On November 30th, Shrub heard public.'",
        "'speaker_7': 'Comment prepared the needs statement, which is.'",
        "'speaker_0': 'Included as exhibit one. And we also have Andre here to speak. Strub also conducted the needs survey in December.'",
        "'speaker_7': 'Jennifer Hastings will be.'",
        "'speaker_8': 'Speaking on the preliminary results of those.'",
        "'speaker_0': 'Of that survey, and those are included in exhibit two. I'm going to talk about exhibit three, which is not in the slides.'",
        "'speaker_8': 'What was included in your packet?'",
        "'speaker_0': 'So exhibit three.'",
        "'speaker_7': 'Contains the schedule.'",
        "'speaker_0': 'Beginning with November 30th. There. I've already talked about the first two items today. January 16th is the city council meeting. The next step will be releasing the NOVA. Right now I've got March 1st, 2018 listed. We are aggressively trying to see if we can move up that date to accommodate shrubs request.'",
        "'speaker_0': 'And if so, we will be.'",
        "'speaker_8': 'Releasing it sometime between.'",
        "'speaker_0': 'February 1st and March 1st. And that is the notice of funding availability.'",
        "'speaker_7': 'Yes, thank you.'",
        "'speaker_0': 'If we once we move up that date, that.'",
        "'speaker_7': 'Would move up the next stage.'",
        "'speaker_0': 'The date that.'",
        "'speaker_7': 'The responses are due as well, giving us.'",
        "'speaker_0': 'More time between the time that the responses are due and the notice of.'",
        "'speaker_7': 'The public hearing. The remaining dates are expected to remain the same.'",
        "'speaker_0': 'Provided no new information from the federal government.'",
        "'speaker_7': 'The last item. Exhibit four.'",
        "'speaker_0': 'Is an overview of the Community Development BLOCK grant priority.'",
        "'speaker_8': 'Needs and objectives.'",
        "'speaker_7': 'I'm just going to highlight that the priorities that are listed. They are affordable housing, homelessness, other special needs.'",
        "'speaker_0': 'Non and non housing community development. So tonight's.'",
        "'speaker_7': 'Goals will.'",
        "'speaker_0': 'Be for the city.'",
        "'speaker_7': 'Council to hear public comment and.'",
        "'speaker_0': 'To accept and adopt the needs, priorities and objectives for the five year strategic plan. And Annual Action Plan. That commences or that's the end of my part. All right. So I'm going to go ahead and call our members, our public speakers, Jennifer Hastings Rella and then Audrey Heineman.'",
        "'speaker_0': 'And I only have the three speakers. If there's anyone else I'd like to speak on this, please submit your step at this time. Thank you for your presentation, Mosfets. Now. She's she Shabazz. Hello.'",
        "'speaker_8': 'Mayor. Council members. My name is Jennifer Hastings. I'm a member of the Social Service Human Relations Board and included an exhibit in exhibit two. You'll see we have a very high level summary of the survey results, and I'm just going to give you some highlights of that document.'",
        "'speaker_8': 'So I'll be very brief. So as you probably know, we did a survey. We conducted a survey that went out to the whole community online, as well as hard copies.'",
        "'speaker_7': 'At various locations.'",
        "'speaker_8': 'For approximately six weeks, November to December last year.'",
        "'speaker_7': 'And it was also available in multiple languages, multiple languages.'",
        "'speaker_8': 'English, Spanish and Chinese, and both printed and online form. And it ultimately yielded over 1700 responses.'",
        "'speaker_7': 'And that which is representative. So you probably.'",
        "'speaker_8': 'Will know more than me approximately 5.8% of the households. So just the highlights, we're still analyzing the data. As you can imagine, 1700 is a lot because both the the the the parts of the survey, the first part was the needs.'"
    ],
    "Draft Ordinance on Tobacco Retailer Licensure and Flavored Tobacco Ban. (Councilmembers Matarrese and Oddie)": [
        "'speaker_3': 'Good evening. My name's Anthony Brown. I'm Operation Dignity resident, and I've been living at APC since March this year. Shortly after the water crisis, I had developed a severe illness of couple facilities and liver and kidney problems. At which time I took part in a community canvass and survey and I got to meet over 140 of my'",
        "'speaker_3': 'neighbors. Of those neighbors were residents from APC, Vxi and Lindsay. Housing in the back of APC joined with Western Service Workers Association. We held a house meeting and for a continue a weeks of pantry and gathering, collecting data on information on tenants, addressing their issues from the house meeting.'",
        "'speaker_3': 'Out of those tenants, about 20 or so live in the housing and another 34 were families with disabilities from APC. The issues that we're having there is there's been a lot of non safety and maintenance issues that have been brought up to housing authority ignored and are the tenants are afraid.'",
        "'speaker_3': 'They have been retaliated against. I have a friend here today who's looking to be homeless due to retaliation eviction because my group, Western Service Workers Association went and advocated on her behalf due to a maintenance issue that actually caused her to go from having bronchitis to a lung disease that's irreversible or curable.'",
        "'speaker_3': 'Of the tenants that I actually have access to 120 phone numbers that I called on a regular basis weekly to ask them about their issues. They haven't had weatherization, high electric bills, gas bills, and these are low income workers and families with disabilities.'",
        "'speaker_3': 'We'd like some protection out there in a way to help to to so that we can advocate for each other without having to worry about who moved out in operation. To me, where I live. Every apartment has been restructured.'",
        "'speaker_3': 'Every apartment I have wood floors where I live. Everything's good. We they take care of us. I actually have managers I can go to to talk about my health, whether mental, emotional or physical. And right across the street, I have my neighbors who can do none of that.'",
        "'speaker_3': 'They don't see case managers. They don't even know their case managers, and they can't stand up for themselves. I've been holding hands with the with my community there. And there's no one that can stand with this where they're issues I'm taking care of.'",
        "'speaker_3': 'I'm a veteran, but it's really hard when I look right across the street and I have friends who are getting put on the streets who used to work for APC, who now have no place to live. Okay.'",
        "'speaker_0': 'Thank you very much for your comments, staff. Could you circle back at some point with that information of of any concerns for safety concerns habitability and also in regards to the water situation, at some point we were supposed to get an update of of the breakdown of who, in fact, suffered injuries and all of that, who all'",
        "'speaker_0': 'was impacted out there. And that has not come back to us. So thank you for bringing that to our attention. And I look forward to getting the details from staff. And then our last speaker is Andrew's. Thank you.'",
        "'speaker_0': 'But evening mayor and City Council members and thank you for the opportunity to speak with you this evening. My name is Nai Andrews and I am.'",
        "'speaker_8': 'Here on behalf of disabled.'",
        "'speaker_0': 'Residents of Alameda Point that are being.'",
        "'speaker_8': 'Evicted unlawfully in retaliation for reporting.'",
        "'speaker_0': 'Uninhabitable living conditions. And we.'",
        "'speaker_8': 'Need immediate intervention.'",
        "'speaker_0': 'By the Mayor and City Council. I lived with a mouse infestation in my unit for two years. Mice took up residence in my stove, resulting in two stove replacements. I was cooking on the stove contaminated with hundreds of mouse droppings that exacerbated, excuse me, exacerbated an existing lung condition, causing me to be hospitalized for six days and'",
        "'speaker_0': 'diagnosed with sarcoidosis.'",
        "'speaker_2': 'I reported a leak from upstairs into my bathroom.'",
        "'speaker_8': 'In.'",
        "'speaker_0': 'July.'",
        "'speaker_2': 'Of 2017 that was.'",
        "'speaker_0': 'Neglected by property management, resulting in my.'",
        "'speaker_8': 'Entire.'",
        "'speaker_0': 'Ceiling collapsing, nearly collapsing on me, and exposed me.'",
        "'speaker_8': 'To mold for several.'",
        "'speaker_2': 'Weeks.'",
        "'speaker_8': 'After reporting these uninhabitable conditions. My rent was refused and the eviction process was started.'",
        "'speaker_2': 'And I was also told that I was playing victim.'",
        "'speaker_8': 'By Doug.'",
        "'speaker_2': 'Beck's.'",
        "'speaker_8': 'I was actually I am a survivor of domestic violence, and I endured that for over a year and a half.'",
        "'speaker_2': 'At.'",
        "'speaker_0': 'APC with no intervention by property.'",
        "'speaker_2': 'Management, no.'",
        "'speaker_0': 'Assistance.'",
        "'speaker_8': 'I will be locked out of my unit any day now. This eviction will cause.'",
        "'speaker_2': 'Irreparable.'",
        "'speaker_8': 'Harm. I have nowhere to go and currently.'",
        "'speaker_0': 'Am on general assistance due to disability. I have been alienated and ignored by property management, services and case management. That APC does receive.'",
        "'speaker_8': 'A substantial amount of funding for.'",
        "'speaker_0': 'Thank you for your time. Thank you. I'd like to ask our city attorney in regards to me the point collaborative. What? Is it possible for this to come back either with data or what can we do in regards to council, regards to the moratorium on unlawful evictions at actually evictions at AMI two point collaborative.'",
        "'speaker_0': 'For us to have the opportunity to review this, this is actually something I have heard ongoing that I've brought to staff's attention that we have issues raised out there and the repairs are not made. And for from my perspective, this is a serious matter because this is in fact some entity that is supposed to be working with'",
        "'speaker_0': 'our city. This is not a private developer. So what can let our options? Can this come back? But.'",
        "'speaker_7': 'Well, I can just say that and I don't think the city managers heard anything. And I don't know if Nannette is still here, but we can certainly reach out to the Alameda Point Collaborative Management and find out what the situation is.'",
        "'speaker_7': 'I don't know if the Housing Authority has heard anything from them, and I personally have not heard any complaints specific to Alameda Point Collaborative, but they just haven't filtered to me. So we can reach out and find out what the status is.'",
        "'speaker_0': 'Okay. So this is in regards to an unlawful eviction, in regards to alleged retaliation can so if I if council was interested in having a moratorium on those evictions, I mean, is that something that would be the pathway to do the.'",
        "'speaker_4': 'Mayor's.'",
        "'speaker_5': 'Agenda item?'",
        "'speaker_4': 'Yeah. I was going to say, I, I, I'm satisfied with the answer the city attorney has given us. I think we need to move incrementally and having her look into it would be the first step.'",
        "'speaker_9': 'And we'll we'll reach out to the last two speakers. We have their contact information we just got and see what we can do. Specifically.'",
        "'speaker_0': 'Thank you. Nine.'",
        "'speaker_5': 'I'd be like to hear more.'",
        "'speaker_2': 'Oh.'",
        "'speaker_0': 'Okay. Okay. Okay. So that completes our speakers on the public comment non agenda items. And now. Okay. Now we're on the first referral nine, a.'",
        "'speaker_1': 'Considered directing staff to draft an ordinance requiring the licensure of tobacco retailers, including a ban on the sale of menthol, cigarets and other flavored tobacco, and enacting an annual fee. This item was placed on the agenda at the request of council members matter.'",
        "'speaker_5': 'Yes. I'll just be brief. The whole idea behind this is to keep tobacco out of our kids. Our kids from smoke starting to smoke. And the best way to do that is to stop these flavored tobacco. I mean, I have pictures of them.'",
        "'speaker_5': 'They look like candies that you would get, you know, at least when I was a kid. This one is even called Sweet Swisher Sweets. So, I mean. Any normal kid would look at this and say, sweets, you know, and then it's not candy, it's it's addicting tobacco.'",
        "'speaker_5': 'So in order to do this, I've been working with advocates Adrina Chen, among others, and they suggested that first in the foundation, like the tobacco retailer license. And there's a list of of different things we could do once we do have a tobacco retailer license.'",
        "'speaker_5': 'As far as regulating that, these products don't get in the hands of our children. They're listed in the in the referral. And I know if Serena just mentioned this to me today, that we don't even have to pay for the development, that the attorney general has grants grant money available.'",
        "'speaker_5': 'And I think she can share that with staff at another time that, you know, we could actually get financial assistance in doing this. So those are my brief comments before we get to public comment. And I know that, you know, back when he was here the first time on counsel, my colleague Mr. Matarese was starting to work'",
        "'speaker_5': 'on this. So I'm honored to be able to work with him on this and we'll give the floor to him.'",
        "'speaker_0': 'Amber Matter SC.'",
        "'speaker_3': 'Thank you for recognition, Madam Chair. Yes, I agree with my colleague, Councilman Brody, that the primary purpose is to make sure that we limit the access to to of tobacco, to children and make it less attractive. And also to look at how we control some of these enticements and of.'",
        "'speaker_3': 'Given tobacco's very addictive nature and its huge public health consequences, I think. This is something I really want the council support to direct staff to bring us an ordinance that starts with the framework that's given here in the referral.'",
        "'speaker_0': 'Right. I'm going to go ahead and call the speakers. And 2 minutes for each Marlene Hird, Gordon and then Philip Gardner.'",
        "'speaker_3': 'Okay. Evening, mayor and council members. And it is Marlene Hird. I'm the president for the Miracle Youth Club. I was a member of the College of Alameda this club. I'm asking you to support this. We don't want our kids getting addicted at an early age.'",
        "'speaker_3': 'The other thing I meant is our board of trustees sent you a letter asking your support as well. I want to read one thing in the letter. In the letter it states according to.'",
        "'speaker_2': 'California Health.'",
        "'speaker_3': 'Its survey results from Alameda Unified School District 2016 2017. 42% of 11th graders believe that it is either.'",
        "'speaker_2': 'Very easy or fairly easy to obtain. Cigarets Oh my God.'",
        "'speaker_3': 'That's what they believe. We need to do it. 11th grade students use electronic cigarets and other vaping devices. In the final quote, the majority of 11th grade smokers reported continued smoking between ages 11 and 17. Councilmembers, please ask, is it worth it in Oakland?'",
        "'speaker_3': 'Just is. And that's going to go into effect this year. I'm asking your support. Please pass this. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker Gordon. And then Philip Gardner.'",
        "'speaker_3': 'Good evening, members of the council and public. My name is Bob Gordon, an ally of the Alameda County Tobacco Control Coalition. And as was just stated, our young people are so important, so vulnerable.'",
        "'speaker_5': 'To the tobacco interests.'",
        "'speaker_3': 'That addict them with candy flavored poison that's so attractive. And addicts our young people. Now, one of the provisions that our tobacco coalition respectfully asked you to consider would make it so. Tobacco retailer licenses are not granted to pharmacies.'",
        "'speaker_3': 'And you may not know, but 14 California communities have already done so, starting with San Francisco in 2008. So besides San Francisco, the other communities that have legislatively eliminated sales of tobacco from all drug stores and pharmacies are.'",
        "'speaker_3': 'Richmond, Healdsburg. Hollister, Berkeley Unincorporated. Santa Clara Unincorporated. Contra Costa Unincorporated. Marin Unincorporated. Sonoma County, Los Gatos, Fairfax, Nevada. Daly City and Palo Alto. So there's a lot of precedent for this. Now, why work on such.'",
        "'speaker_5': 'A policy in the city of Alameda?'",
        "'speaker_3': 'We know that our young people frequent local drug stores, and when they arrive at a front counter of a drugstore with their purchases, they often see that huge wall of tobacco and all the candy and fruit flavored and menthol advertising that's associated with it.'",
        "'speaker_3': 'So community members and their elected officials do have the power to decide that local pharmacies will not sell tobacco and therefore the power to change what a pharmacy is for a whole generation of Alameda, young people. Thank you very much.'",
        "'speaker_0': 'Thank you. To harbor diphtheria.'",
        "'speaker_5': 'Hello.'",
        "'speaker_0': 'I'm sorry. Philip Gardiner. And then Theresa.'",
        "'speaker_3': 'Good evening. I'm Dr. Philip Gardiner. I work at the. Tobacco Related Disease Research Program for the University of California Office of the President. I have for the last 20 years, I'm also the co-chair of the African-American Tobacco Control Leadership Council.'",
        "'speaker_3': 'And we've essentially been taking on this fight for a number of years to get flavors out of tobacco. I mean, essentially, you're putting sweetness and poison. And I want to encourage the Alameda City Council to take the bold step of removing them would have flavors in tobacco, for they mask the harsh tastes of tobacco.'",
        "'speaker_3': 'They allow people to start sooner. We have data that shows that kids between the ages of 12 and 17, over 80% of them begin with flavored tobacco products. This is even more true in the African-American community, where some 95% of youth in that age range start with menthol cigarets.'",
        "'speaker_3': 'Look, menthol allows you to inhale deeper. The more deeper you inhale, the more nicotine you intake, the more nicotine you intake the degree to your addiction, the harder it is to quit. And unfortunately and disproportionately, African Americans, poor people, women and other groups die disproportionately from tobacco related disease.'",
        "'speaker_3': 'Unfortunately, this has been the case for some time. I want to encourage you to join other cities around the Bay Area that have taken this step. Oakland. Richmond is taking this up actually next week. San Leandro is restricted flavors.'",
        "'speaker_3': 'We want to encourage them to include menthol. We want you to include menthol. I would even suggest and we were able to do this in committee in Oakland and if we get a chance here to do a full presentation and actually go over, I like to report on to the docs.'",
        "'speaker_3': 'That's I'm a scientist. So when you see Science Report, it helps. Let me say that you're going to hear a lot of stuff about it's going to harm people's livelihood. I would suggest it's not about retailers revenues. It's about children's lives.'",
        "'speaker_0': 'Thank you, Theresa Harbaugh and then Kwasi and then Vivo.'",
        "'speaker_10': 'Hi. Good evening. I want to express to you that. Banning does not work. I oversee 19 stores right now or a major C store company. We have been under San Francisco's direction. We have been under Contra Costa County's direction, having stores crossing borders.'",
        "'speaker_10': 'So the one store here has dropped in revenue and sales. Our store just outside those limits has increased tremendously. And they aren't underage sales. None of them are under age cells. The company that I work for has zero tolerance.'",
        "'speaker_10': 'We do training over and over and over again. We do not sell to underage period. The statistics show that most kids that get cigarets are getting them from a family member. They are not coming from the local drug store.'",
        "'speaker_10': 'They're not coming from the local liquor store on the corner. They're not coming from 7-Eleven. They're not coming from one of my stores. And Contra Costa County has. We have a very, very proud record that we have absolutely zero in that county of underage sales.'",
        "'speaker_10': 'And that was for last year, and that was county wide. So I haven't pulled the statistics for over here, but I'm pretty convinced they're going to be very similar. It's not the banning of it that's going to help.'",
        "'speaker_10': 'It's the education behind it. It's controlling the parents. It's controlling the family members. Thank you.'",
        "'speaker_0': 'Thank you. At 11:00, we need a motion to continue past 11:00 requires three votes is and we have ten plus speakers remaining. It might actually be closer to 50 with the motion.'",
        "'speaker_4': 'Just for clarification, this is only to hear 990.'",
        "'speaker_0': '989 being correct. A second all those in favor I oppose.'",
        "'speaker_5': 'Oh.'",
        "'speaker_0': 'And so motion carries 3 to 2. So we will continue questi and then vivo. So that motion was 3 to 2. And you all get 2 minutes up to 2 minutes. Thank you.'",
        "'speaker_3': 'Good evening. My name is Kwasi. I'm here on behalf of the African-Americans Birth Control Leadership Council and. I'm sure that there's nothing I can say that you are or already haven't heard or don't already know. But speaking from personal experience, I've seen what tobacco products do, not just to black youth, but to black people.'",
        "'speaker_3': 'It's killing us and. I know that you being in position of power, you sitting in those seats like you have the power not just to make change, but to save lives. And that's literally what your vote has the potential to do right here, right now.'",
        "'speaker_3': 'And it's so discouraging that there's even a conversation whether or not to sell deadly things to people. Right. I just want to say my piece and say that I believe that you are make the right decision. I believe that you have an obligation to make the right decision.'",
        "'speaker_3': 'And I hope that you do. Thank you.'",
        "'speaker_0': 'Thank you, Bebo. Then Rosalyn Moya and Rachel Grant Lazarus. Or Lazarus. Sorry.'",
        "'speaker_8': 'Good evening, city council members. My name is Vivo and I'm a member of the Alameda County Tobacco Control Coalition. Cigaret lighter cigars with kid friendly flavors such as mango and chocolate can be found at any convenience store in Alameda, priced at $0.99 or at most, a dollar 54 packs of 1 to 3 or more.'",
        "'speaker_8': 'In 2015, a survey of over 40,000 high school and middle aged, middle, middle and high school age students nationwide showed that the cigaret smoking rate was 6.7%. But when cigaret use was included, the rate shot up to 11.12% to 11.2%.'",
        "'speaker_8': 'So what this means is there is a large amount of teenagers smoking cigarillos and or using tobacco, the tobacco leaf wrappers to create marijuana cigarets otherwise known as blunts. Over 100 studies have shown that increasing the cost of tobacco products is successful in reducing the amount of underage smoke, underage smoking and the smoking rate of young adults'",
        "'speaker_8': '. As you may know, Haywood and Queen City have adopted a minimum price of five.'",
        "'speaker_0': 'Five, five for cigarets.'",
        "'speaker_8': 'With the idea that this will result in higher prices. But what has happened is that the stores in these cities have started selling packs of five for 90.'",
        "'speaker_0': '$0.99 or a dollar each.'",
        "'speaker_8': 'Here are some examples of colorful packs of Cigarets was purchased in Union City for $0.99. Here we have.'",
        "'speaker_0': 'Wild berry squeeze.'",
        "'speaker_8': 'Here we have strawberry cream. And here we have Wild Berry Cherry. Armed with this information, the city of San Leandro chose to address this concern recently by adopting a tobacco retail license that includes a requirement that cigars be sold in.'",
        "'speaker_0': 'Packs of five.'",
        "'speaker_8': 'And for a minimum price of $7 before you use the language that San Leandro used in this ordinance. Lastly, New York City, Sonoma County and other communities have also adopted minimum prices for tobacco products. Thank you.'",
        "'speaker_0': 'Thank you. Roslyn Moya. Then, Rachel. Then Kelsey Norman.'",
        "'speaker_1': 'Hi. My name is Rosalind Moya. I am a resident here in Alameda and a member of the Alameda County Tobacco Coalition. And I'm here to urge you to protect our youth from tobacco influences, from flavored tobacco, from coupons meant to protect us, protect them from cheap tobacco.'",
        "'speaker_1': 'And just have I urge you to have a strong TRL here for the city. I just got married and I want to have a family here. And so this is something that I it's very important to me to protect our youth and the next generation.'",
        "'speaker_1': 'So I want to show you something. This is a sour patch, Candy. This one's an actual candy. And this one right here is E-Liquid. It's an easy juice. It's used for e-cigarettes. And so I just want you to kind of notice some of the similarities there.'",
        "'speaker_1': 'This one says Can be King batch. And it's not just, you know, once a candy one. This one has 100 milliliters of nicotine in there. And just besides the looks, I also asked them how this tastes, and they said it tastes kind of sweet and sour and it has that fruity smell.'",
        "'speaker_1': 'I bought this about two blocks away from the high school over here, about a block away from here. And when I bought this, they didn't ask for I.D. and I gave cash. I don't know. The city gets money from this.'",
        "'speaker_1': 'I didn't get a receipt. And the you know, it's a little strange, but the person that was very friendly was very helpful when I asked for about information about this. It's hard to tell who has nicotine because it doesn't say nicotine anywhere in there.'",
        "'speaker_1': 'It's all the way in the back at the very bottom where it says this has nicotine and it's just kind of. Thank you. Interesting.'",
        "'speaker_4': 'You can can you picture for us? Can you possibly send them up here? And we promise to give them back to you.'",
        "'speaker_0': 'Rachel, thank you. And then Kelsey Norman, if you all could line up, I'm going to start out the names because we need to move it along. Thank you.'",
        "'speaker_8': 'Good evening, counsel. My name is Rachel Gratz Lazarus. I work with Alameda County Public Health Departments Tobacco Control Program. I'm also an Alameda resident and the mother of two young children here in Alameda. As a public health advocate and a parent, I am deeply concerned about the impact that flavored tobacco, especially menthol, has on the health of'",
        "'speaker_8': 'our children. These products are clearly marketed to young people as starter products, which is why the FDA banned the sale of flavored cigarets except menthol in 2009. We know that tobacco poses a serious health risk, but tobacco companies have everything to gain from addicting youth.'",
        "'speaker_8': 'And tobacco companies admit that the base of their business is the high school student. According to City of Alameda.'",
        "'speaker_2': 'Youth.'",
        "'speaker_8': 'Decoy Operations in 2012, out of 45 tobacco retailers sampled nine of them, or 20% sold tobacco products to minors. These are products that kill when used as directed. While store owners may be doing their best to comply with the law, the reality is that tobacco products are making their way into the hands of youth.'",
        "'speaker_8': 'Exactly as tobacco companies intended. Tobacco companies have historically targeted youth, communities of color and LGBTQ communities with highly concentrated menthol cigaret marketing, which is a major driver of today's tobacco related disparities. For example, it's not an accident that 95% of black youth smokers, 61% of Asian youth smokers, and 58% of Hispanic youth smokers smoke menthols.'",
        "'speaker_8': 'The health of our children needs to come first. Across the country, local governments are standing up to put the health of their residents above industry profits. Locally, Alameda can follow in the footsteps of Oakland, Berkeley, San Leandro and San Francisco, which all restricted the sale of flavored tobacco through a tobacco retail license.'",
        "'speaker_8': 'We know that tobacco retail licenses are an effective and sustainable policy solution to decrease access to flavored tobacco and to prevent youth from experimenting with and becoming addicted to these deadly products. Regarding e-cigarettes, they are not approved by the FDA as a smoking cessation product, and research has found that many people who attempt to quit.'",
        "'speaker_0': 'Kelsey Naumann I need to move along. I'm sorry. Kelsey Norman Lee Mighty Rodriguez and then Jose James.'",
        "'speaker_8': 'Good evening, councilmembers. My name is Kelsey Norman and I'm a part of the Alameda County Tobacco Control Coalition. I'm here today to talk to you about flavored tobacco products specifically related to youth. A lot of the previous speakers have mentioned some things, so I'm pretty much just going to talk for a few seconds.'",
        "'speaker_8': 'Flavored tobacco products are increasingly popular among youth. I know that you've heard this before. The sweet flavors and the cheap prices and the packaging are very appealing to our youth. These flavors, like we said, grape, strawberry, chocolate, cotton candy, these mask, the tobacco's harsh taste.'",
        "'speaker_8': 'And it's encouraging these young smokers, too. These tobacco companies have everything to gain from addicting young people to start flavored tobacco products. Studies show the earlier you start smoking, the easier it is to get addicted, the harder it is to quit.'",
        "'speaker_2': 'The best way to prevent tobacco related.'",
        "'speaker_8': 'Illness and death is to keep youth from starting to smoke in the first place. Creating strong laws that protect youth from accessing these flavored products are crucial to preventing a lifetime of tobacco addiction and ensuring that all of our immediate children get to have the long and healthy lives that they deserve.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_0': 'Thank you. The mighty Rodriguez and Yazzie dames. And then ride abdala.'",
        "'speaker_1': 'Good evening, counsel. My name is Lee Mario Zegers, and I am a member of the Alameda County Tobacco Control Coalition. I am here to voice my support for for a referral to develop a tobacco retail license ordinance that includes restricting restricting the sale of menthol cigarets and other flavored tobacco products in the city of Alameda.'",
        "'speaker_1': 'The tobacco industry spends around 1 million per hour, over 95% of its total marketing budget just to push tobacco products at the point of sale in convenience stores. Knowing that almost half of teenagers visit a convenience store once a week and that teens are more likely to be influenced to use tobacco products by tobacco marketing than by'",
        "'speaker_1': 'peer pressure. It is disturbing to see that the industry aims to make such products easily accessible to youth and distort their perceptions by making tobacco products seem popular and acceptable. Yes, the California State Tobacco 21 law already passed, but this ordinance would provide a more comprehensive approach to reduce youth smoking by addressing youth tobacco influences and the'",
        "'speaker_1': 'retail environment. The U.S. Surgeon General reports that tobacco industry advertising and promotion caused youth and young adults to start smoking. And nicotine addiction keeps people smoking past those ages. This issue significantly impacts the health of the youth residing in Alameda, and I urge you all to make a decision that will protect their life.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Jazzy James. And then right out, Dollar.'",
        "'speaker_3': 'Mayor, vice.'",
        "'speaker_5': 'Mayor and council member. I'm a retailer here in Alameda. I don't believe that this will stop. I think it would create a black market, which is scary. I've seen in other cities and states and it creates a lot more problems.'",
        "'speaker_5': 'You know. And they already changed the law at 21 and prices of cigarets are over ten bucks now packed. So I see a lot of. You know, even grown ups, Quentin And everybody's who were into like cannabis and other stuff.'",
        "'speaker_5': 'But I don't believe that. Taking away menthols from retailers is going to stop. Anything I think is.'",
        "'speaker_3': 'Going to create a black market, which, again, I've seen and loved. Thank you.'",
        "'speaker_0': 'Thank you. Right. And then Bob.'",
        "'speaker_3': 'Good evening, madam. There.'",
        "'speaker_6': 'Madam Vice Mayor and members of the Council. I'm a retailer here.'",
        "'speaker_3': 'In the.'",
        "'speaker_6': 'City of Alameda. I oppose this measure for multiple reasons. One is that there's going to be tax dollars lost for the city. We as a city will lose tax dollars. All it's going to do is it's going to send our our residents who come to purchase from the city of Alameda to other outside cities to purchase whatever'",
        "'speaker_6': 'tobacco products that they want. As far with regards to the flavor tobacco that you guys have been given by some of the other attendees here today. What needs to be known is that their tobaccos comes in different milligrams and they are clearly labeled.'",
        "'speaker_6': 'I know maybe the package that you received this evening.'",
        "'speaker_3': 'It wasn't as labeled.'",
        "'speaker_6': 'That well, but more often than not, the packages are labeled a lot better with regards to the flavored cigarillos that Councilman O.D. brought forth. What we have to realize is that a lot.'",
        "'speaker_3': 'Of those the youth are not smoking the tobacco in the.'",
        "'speaker_6': 'Product. What from personal view that I've seen myself.'",
        "'speaker_3': 'Is that the.'",
        "'speaker_6': 'Youth try to purchase these, those.'",
        "'speaker_3': 'That do try, or people who to purchase.'",
        "'speaker_6': 'These try to purchases to get rid of the tobacco that's in it and use the leaf for cannabis. Now, with regards to cannabis.'",
        "'speaker_3': 'We've heard rumor allegedly that Johnson and Johnson is one of the people who.'",
        "'speaker_6': 'Are pushing for this initiative. And the reason why they're pushing for pushing for this initiative is because they've got involved in the cannabis industry and it's a way to deviate potential customers for themselves away from tobacco towards cannabis.'",
        "'speaker_6': 'I'm not against cannabis, especially in the medicinal field. It's done a lot of help for especially for people who are suffering from cancer. And my own father is a cancer survivor. So there's that. 16 senators, their state level, has refused to address this issue in the form of SB 1400.'",
        "'speaker_0': 'You Bob Secon. And then and second. And then Serena Chen.'",
        "'speaker_3': 'Yeah. SB 49. That was a common. You know, Sacramento, out of 17 senators, only one senator who bring it in, he's the one who was in favor of it. It didn't even the second senator, even for the motion.'",
        "'speaker_3': 'It didn't go into voting at all. So they were trying to do the same thing. Right now, 23% of California. They have this kind of theater going through the city councils and county governments and 77%, they are not in it.'",
        "'speaker_3': 'Last month they tried this in San Jose. This is not. It's so controversial. We don't want to get into it. Alameda County. They said, no, we don't want to get into this. Now, our neighboring city, San Leandro, I have seen this in San Leandro.'",
        "'speaker_3': 'They didn't do anything with the menthol cigarets. They did. Flavored about. But I understand that single. We don't want to sell it. Then in Fremont, Hayward, Union City, Newark, all those cities there sit with the retailer and we make a program and it is working there.'",
        "'speaker_3': 'It could work here. But if you push us all, this is the way it goes. It's not going to work. Please. We are we as a retailer requesting you involve us in this, we can sit with you and we can go with it.'",
        "'speaker_3': 'Okay, let's do this. Let's do this. You know, that's all I can say. And. And our school turned out like for one for us. We don't have any for one care. These are our schools. We depend on them.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And second. And then Serena chan.'",
        "'speaker_2': 'Good evening. Freedom of choice. Approve legal adult product. Do we want to sell to minors? No, we don't want our children. We don't want our grandchildren doing it. Where is the facts? Where are the statistics that the convenience stores are selling it to the minors go on the Internet.'",
        "'speaker_2': 'It's adults. It's parents. It's their uncle who are giving them this product. It is not us. Get the facts. Black market on the Internet. 56.8% of the cigarets and tobacco that is used in the state of New York is now coming.'",
        "'speaker_2': 'R is being used from the black market. And if you think that's not coming to Alameda or here, hey, the $2 tax, $0.75 of the $2 tax that hasn't even taken place for a year yet goes to education of the youth.'",
        "'speaker_2': 'Guys give it a chance. We only went to 21. It's only been a year. The tobacco tax, $2 only went into effect last year. We don't want the miners. Sarina chan is going to speak after me. She was at a San Leandro event where she talked to children who told her that they are not buying the product'",
        "'speaker_2': 'from from large stores. They're getting it from adults. And this was brought up in a San Leandro council meeting and I do on product a property in San Leandro also. And we own a business right here in San Leandro in Alameda.'",
        "'speaker_2': 'Guys, we do not want it. We don't want our kids to do it. But you know what? All they have to do is go to Oakland. Oakland didn't ban menthols. They're going to buy it in a smoke shop.'",
        "'speaker_2': 'Who has the highest rate of selling? Cigarets.'",
        "'speaker_0': 'Thank you, Marina Chan. And then Paul Cummings. And then Lizzie Viljoen. And then Mrs. Shabazz. Hi. Good evening.'",
        "'speaker_8': 'Not good morning. My name is Serena Chen. Not to be mistaken for Selina Chen, your new city attorney. District Assistant City Attorney.'",
        "'speaker_7': 'The topic of tobacco control was like.'",
        "'speaker_8': 'The Star Wars trilogy. You have a good movie, and then you have a movie where the Empire Strikes Back and then it all resolves itself. So in terms of the good.'",
        "'speaker_7': 'News, yes, the state of California raised the minimum age of sale of tobacco products.'",
        "'speaker_8': 'To 21. The state of California defined.'",
        "'speaker_7': 'A broader realm of tobacco products to be tobacco products, including e-cigarettes. That's the good news. And they did this because they know that almost no one gets addicted before the age of 18. We know that 11,000 California youth under 18 become daily smokers every year.'",
        "'speaker_7': 'They're getting their tobacco somewhere and they're using those starter products that you have in front of you.'",
        "'speaker_8': 'So that was the good news that they passed these laws. The bad news is.'",
        "'speaker_7': 'That.'",
        "'speaker_8': 'Unless there's local enforcement, those laws mean nothing.'",
        "'speaker_2': 'So. That's only a very short part of the story, because the last part of the story.'",
        "'speaker_7': 'Is I have some really good news for you today.'",
        "'speaker_8': 'The attorney general has announced he has $30 million a year to disseminate to local law enforcement to reduce youth access to tobacco. And it'll be an RFP process which will be released sometime this month. You'll need community supporters to say that we will support you and help you to do this.'",
        "'speaker_8': 'And basically, cities will have to have a plan on how to reduce youth access to tobacco. And this $30 million fund will be given to disburse to local law enforcement, cities and counties who choose to make that decision to control tobacco.'",
        "'speaker_8': 'I've emailed that memo to all of you from the attorney general. Thank you.'",
        "'speaker_0': 'Thank you. Paul Cummings. And then Lizzie Belton.'",
        "'speaker_5': 'Good evening. My name is Paul Cummings, and I work for Alameda County Public Health Department. I'm the tobacco control program director. And thank you for discussing this this evening. So tobacco retail licensing is something that local jurisdictions can do, and it allows for a couple of things.'",
        "'speaker_5': 'One is it allows for local communities to decide.'",
        "'speaker_3': 'The standards that they want from.'",
        "'speaker_5': 'The retailers that sell.'",
        "'speaker_3': 'An addictive and deadly product in their communities.'",
        "'speaker_5': 'And as as Councilmember Otis said, there's a long list of those that that could be considered, and it's worth a community discussion to decide what the city of Alameda might want.'",
        "'speaker_2': 'The other thing.'",
        "'speaker_5': 'About tobacco retail licensing is that it allows a local jurisdiction to hold the retailer accountable.'",
        "'speaker_3': 'So state law when a. A minor is excuse me.'",
        "'speaker_5': 'When a clerk sells tobacco to an underage person. The clerk is cited under state law. And if that's as far as anybody can help be held accountable with local tobacco retail licensing, you can hold the retailer, the store owner accountable, and you can have graduated sanctions if a store were to violate multiple times.'",
        "'speaker_5': 'So it allows for for more control at the local level. And penalties can be decided.'",
        "'speaker_3': 'As you know, as as the community and, you know, maybe with input from retailers.'",
        "'speaker_5': 'Decides this fit. So there's a lot of things.'",
        "'speaker_3': 'That that.'",
        "'speaker_5': 'Are valuable for the city of Alameda to discuss around this. And thank you very much for considering.'",
        "'speaker_0': 'Thank you, Lizzie and then Rasheed and then Paul second.'",
        "'speaker_1': 'Hello, counsel. Sorry, I have laryngitis, but I really wanted to come out tonight because I'm a resident and I'm a mother of a little three.'",
        "'speaker_8': 'Year old boy who's at home in bed right now, who's.'",
        "'speaker_1': 'Going to grow up in your city, which I'm really excited about, but I'm really not excited about.'",
        "'speaker_8': 'The idea.'",
        "'speaker_1': 'That we would move forward without protecting those children from the marketing of really deceptive products that are meant to hook our kids on a deadly product. I think a 20% selling to minor rate on that sting that was mentioned to you is appalling.'",
        "'speaker_1': 'I'm here also on behalf of the American Heart Association, and I can tell you, as a staff member for the American Heart Association, I sent you all a letter from our president, who's.'",
        "'speaker_8': 'A local.'",
        "'speaker_1': 'Cardiologist. Tobacco control is one of our biggest priorities, and that's because the tobacco industry kills nearly half.'",
        "'speaker_8': 'A million people every year and they have to replace.'",
        "'speaker_1': 'Those dead bodies. With young people who are going to be lifetime smokers. And we know that because they've said that in their papers and they've said that flavors are their major way of doing it. I don't know what other evidence you need.'",
        "'speaker_1': 'How many more Alameda teenagers need to get hooked on these products before you limit access? And in terms of whether there might be a black market, I'm really afraid that Alameda might be the black market, that where people were coming over from Oakland and San Leandro were there.'",
        "'speaker_1': 'It's already gone into effect. And the councils there heard the same lines. And I'll just say to you. Let's make sure we're at peace with our neighbors and protecting our children. And and finally, I just want to say that it's really important to go home at night.'",
        "'speaker_1': 'And I think this is just a referral for a thing that we can have a further discussion later about the details of all of it. But I really encourage you to put our children above tobacco profits. And any argument that at the bottom of it, when you think about it, is about the profits of the tobacco industry'",
        "'speaker_0': '. Thank you, Rashid. And then, Paul, if you want to speak on this item, please submit your is.'",
        "'speaker_3': 'Ah. I'm so sorry. Pardon me. Second hand. They no joke. I was five years old the first time I smelled smoke. I coughed and I choked. Who'd imagine that one day I'd talk? I didn't get it from a black market, but still I sparked it.'",
        "'speaker_3': 'I fired up like I seen in Jet magazine or film. I passed it to a friend and he started coughing up phlegm for fourth graders alone, smoking cigarets. Passing it around, seeing who could blow that smoke the best.'",
        "'speaker_3': 'I was. Those minty flavors brought fire deep within. I was hooked to nicotine and I wasn't even ten. See, on the West End, with the exception of Luis. I was nine years old, buying cigarets from every store. Truly.'",
        "'speaker_3': 'They claim no tolerance for selling to children. Maybe times have changed. I pledge no snitching, so I'm not going to call out their store names. Here's the deal. From the factories to the field. They used to make us make it.'",
        "'speaker_3': 'Now my people are addicted. They used to make us pick it. And now my people are addicted. The tobacco harvest. When I think about it, I think about Bogie's finest R.i.p Jarvis.'",
        "'speaker_2': 'R.I.P. Laura Vargas.'",
        "'speaker_3': 'Millennials Die In Cancer Related Deaths. Newports ain't cool. They've taken our last breaths. They concerned about their livelihoods, but we concerned we dying in the hood. I know you concerned about I know they concerned about their private wealth, but we're concerned about the community's health.'",
        "'speaker_3': 'Draft ordinance. Thank you.'",
        "'speaker_0': 'Thank you, Paul. Second. And then he's our last speaker on this item.'",
        "'speaker_3': 'And with Rasheed, I'm not going to snitch. And I'm not a professional, nor was I paid to be here like a few of these other people in the if you want, you could watch from Cedar City. They say the same thing, but they just put Alameda in the place of whatever city they're saying.'",
        "'speaker_3': 'So my first concern is that what's going to happen is everyone's going to buy it on the Internet. Is that Internet stuff? There's no regulations. There's nobody checking it. At least we're checking it. I'm not selling to a ten year old.'",
        "'speaker_3': 'Do you think I'm going to sell to a ten year old? Come on. Number two, if we did sell and we do a violation and you own a C store, two violations, you lose your store. You think that I'm going to risk losing my store over $20?'",
        "'speaker_3': '$10? Come on, let's be real. And if you ask anybody about the black market, like the guy in New York who got killed in the protests or happening, he was actually selling cigarets outside of a store. The fine by the police department, if you ask them, Max, is a small infraction, $50.'",
        "'speaker_3': 'So what's going to happen is we're going to have people going store to store, store, get a ticket, go on from a store. It's not even a parking ticket. Fine. Okay. Also, the c. Alameda is getting tested. We pay fees.'",
        "'speaker_3': 'We paid to the state, the fda. The last check was in august. You can look on the website, we have a 95% compliance rate. We are not the problem. As he said, he was passing his cigarets to his friends.'",
        "'speaker_3': 'Thank you, sir. Also, last thing, we pay for secret shoppers. We have to check and we have to type in an ID agent date before we sell people. San Jose, third largest city, not even going to address it.'",
        "'speaker_3': 'They have housing issues, other issues. You're going to create traffic. People are driving all over the bridges. And while I drove a Honda, I'm not that wealthy. But if we do something, let's compromise. If anything, that's Korea workshop.'",
        "'speaker_3': 'Nobody here from the anti-tobacco, they just want everything gone. I believe that we have an age. We're grown, we can make decisions, we drink flavored beer, we drink everything. Do it like Hayward, do it like Fremont, Pleasanton, some other cities that are, you know, they think about it.'",
        "'speaker_3': 'Let's not just jump into it. Maybe take a year, look at the data because all the data is expired, it's obsolete. None of it works because at the end of the day, not even one year has passed since every initiative has gone into place.'",
        "'speaker_0': 'Thank you very much. He completes our public comment on the item. And at this point, vice mayor.'",
        "'speaker_8': 'So I just got my voice back today. I've. I'm sick. Which is why I did not vote to continue this meeting. I'm going to keep it short. I don't have a problem passing this. In fact, tobacco's the only product that we know kills that we were selling lawfully to people, which is bizarre to me.'",
        "'speaker_8': 'My grandfather died of lung cancer. He started smoking before he was ten years old. Smoked marble, reds. Most of his life stopped when I was a kid. My mom has asthma as a result of it. You know, I hear our retailers and what they're saying, but I also think that this is kind of the public health cost'",
        "'speaker_8': 'of this is is abysmal in terms of what it's doing to our community members and that there's a reason that we have a lot of different ordinances in place. I do think it's going to become problematic as we see cannabis coming out and the use of some of these products relative to cannabis.'",
        "'speaker_8': 'And I also, you know, I understand the request for a licensing process. My only concern is I'd like to know how many other licensing fee structures and other things we have coming before staff. And what department I'm looking at Debbie Potter.'",
        "'speaker_8': 'I have a feeling it's, you know. You know, I don't know what department it's going to be hitting, but I I'd imagine our city attorney's offices and community development are going to be impacted by this. And so, you know, we have a number of other things that are in the pipeline, and I'd like to get an assessment'",
        "'speaker_8': 'of where this would go relative to that. And we you know, we just reinstituted. We're going to hear it on the next agenda item, a fee for the the rental housing. And that's something that took a long time to put into place.'",
        "'speaker_8': 'And there are still issues that need to be worked out for it. So, you know, I'd like to know where this would fall into that and what the actual timeline would be in terms of what the staff report is and where it's going to be housed and how many how many man hours are going to be associated'",
        "'speaker_8': 'with it and all of that, because I think, you know, and obviously that's going to be included as part of the staff report if if council decides to move forward. But I think that to me, that's an important kind of calculation in terms of where this all goes.'",
        "'speaker_8': 'And you know, in terms of the labeling and stuff, it's a completely separate issue. But, you know, and and I know that there's been talk about what we should have this housed in smoke shops if we're going to ban it and ban it.'",
        "'speaker_8': 'If if if you're saying that there's no flavored tobacco, then there should be no flavored tobacco, period. Because just what you're doing is you're creating mini monopolies and you're allowing people to whole different, you know, sell different products.'",
        "'speaker_8': 'I think it's gonna be very hard to enforce.'",
        "'speaker_0': 'A member.'",
        "'speaker_4': 'Ashcraft. Thank you, Mayor. I'm actually prepared to direct staff to draft an ordinance as stated here. But there are a couple of things I would like to know. One is I and I would actually leave it to staff to come back to us to tell us where in the matrix of all of the items that we have'",
        "'speaker_4': 'thrown their way, this could this could fit. And I don't think it needs to come back instantly, because I do think we have some other extremely pressing items, especially around housing and homelessness and avoiding homelessness, some of which involve the same department.'",
        "'speaker_4': 'And the other part is the enforcement piece. And good news from Serena, if she's still here, that the attorney general has identified $30 million. But I'm also well aware that our police department still isn't fully staffed. And so I would want to also hear from Chief, from Larry about how I mean, it's money to hire an additional'",
        "'speaker_4': 'officer is only part of the problem if you've heard some of these discussions. So any any ordinance is going to have an enforcement mechanism, and we need to just take all that into account. But I think the the speakers, all of you are very are very compelling.'",
        "'speaker_4': 'And I did speak on the phone today with Mr. Second, their son, and I understand the concern of the retailers. But if this were a scale on balance, the the health and well-being of especially of our young people is so much more important.'",
        "'speaker_4': 'And I would hope that your livelihood does not depend on whether or not you're able to market these products. I hope there's other things you're selling that bring in profits. And and it's not an exact analogy, but a year or more ago, the retail chain, including pharmacies, CVS, announced that it was stopping the sale of all tobacco'",
        "'speaker_4': 'products. And I think it got some major pushback from the tobacco industry at first. But last time I checked, CVS is still up and running, but you don't see cigarets or tobacco products when you go there. So again, I would I would support the directing staff to draft this ordinance and ordinance to come back to us.'",
        "'speaker_4': 'But I would leave it to staff, including the police chief, to talk about everything that's required. It looks like the city manager's reaching for the microphone, so maybe she wanted to comment on.'",
        "'speaker_9': 'Both the vice mayor. Both of you have asked for staff resource discussion and some of the things that are ahead of this is minimum wage, the climate action plan. We approve the scope, but we still have the plan itself to do, which is a major effort for safe buildings, heritage tree night sky tax on cannabis, which has'",
        "'speaker_9': 'a time constraint on it. The Airbnb. Which was a low priority though. Shrub homelessness policy and inclusionary. And so all of most of that falls under community development, which means they also have rent control and cannabis on top of that.'",
        "'speaker_9': 'And so staff resources are tight. But if there isn't a time constraint on it, because this was labeled as important, not urgent, we can figure out the process. And maybe what we'd do first is come back with some questions for council, just like the community development director Debbie Potter did when she started out with the cannabis as'",
        "'speaker_9': 'here are some questions for the council and then get direction rather than coming back with a. Ordinance that we have done in a vacuum without council input.'",
        "'speaker_0': 'Member Mattress.'",
        "'speaker_2': '30.'",
        "'speaker_5': 'I was. Maybe he could. Leadoff hitter. Okay. Go ahead. Okay. I don't really have a lot to say.'",
        "'speaker_0': 'I. But I would like the opportunity to speak.'",
        "'speaker_5': 'Okay. I'm not.'",
        "'speaker_0': 'Mentioning that.'",
        "'speaker_5': 'I'm not mentioning anything. I mean, I draft this referral, so I'm not going to say too much about it. Although Malia said, man hours, we have women hours. So we're going to be efficient and work harder and.'",
        "'speaker_4': 'Person.'",
        "'speaker_5': 'Hours and get paid half as much. Unfortunately. You know, when we talked about this, my colleague and I and we debated about the urgent versus not urgent, and I understand the the workload that staff has. But, you know, there are other resources.'",
        "'speaker_5': 'There's the attorney general grant, which we just heard about today. There is Change Lab Solutions, which provides free technical support that's paid for by taxpayers or at least taxpayers who buy tobacco products. So we there are ways to do this that are not as staff intensive.'",
        "'speaker_5': 'But I do agree with the approach because we will need a little more extensive public hearing than just a referral. And, you know, there are some questions that need to be answered and there's some direction because I believe, you know, I listed a lot of the the options and included in the in the attachments, you know, other'",
        "'speaker_5': 'different model ordinance provisions. So, you know, I think that they all deserve and merit a discussion that would have to take place before we go through and actually come up with an ordinance. And then we'll have a first reading, second reading and so on.'",
        "'speaker_5': 'So understanding that, you know, we we looked at this, you know, hopefully when we do a priority workshop because I think, you know, obviously some of those have been in the queue longer. But, you know, in my mind, some of this is more important than a lot of those because, you know, there are statistics that I'm sure'",
        "'speaker_5': 'the advocates can talk about of how many kids are going to become addicted in the next year or if it takes us two years to do this, or how many people are going to die because of this. You know, one of the one of the commenters in the public, it mentioned this is the only product that if'",
        "'speaker_5': 'it's used as intended, you know, it ends up killing people. So, I mean, I don't want to wait too long, but I understand the constraints of of staff resources.'",
        "'speaker_0': 'Member matter. I see.'",
        "'speaker_3': 'Yes. And just to tail on with Councilman Brody, we did talk about the priority rating. This is important. But it's less urgent than neighbors. Our neighbors who live on the street. It's less urgent than the issues around rent control.'",
        "'speaker_3': 'And there's a time timing around cannabis, although I disagree that's more important than this. So I think we should give staff direction. We've given them a hint on where it sits in the priority list with this The Matrix here, if that's agreeable to the rest of the council.'",
        "'speaker_3': 'I have confidence that the city manager will work with the staff to put it in its proper place. And I like the approach of getting input. Questions to the community and questions to us so that when the audience does come back, it's shaped at least by some sort of pre discussion.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'So I am a cancer survivor and I have spent many, many hours at the cancer center. I also am a woman of color, and I'm very familiar with how youth get cigarets. And I also like to make data based decisions.'",
        "'speaker_0': 'I am concerned about. I am concerned about this approach, but I have researched and I think it's important to have a data based discussion is that education is critical. And I would we have looked at issues in the past where we've had input from our youth, and I would like to have input from Almeida's youth in regards'",
        "'speaker_0': 'to where they are purchasing Cigarets as my concern with the cannabis discussion of illegal sales, unregulated sales. My research in regards to online sales, which is a growing avenue of where people buy these items, is in fact that they are not regulated, that they come from outside of the United States.'",
        "'speaker_0': 'I am very concerned about. So so personally, I think it's critical that any any decisions we make. Keeping a look at where the statistics of almeida's youth, where the city of Almeida's youth are purchasing. If it is from if they're getting it from a family member, then and in fact, if in fact the best way to reduce'",
        "'speaker_0': 'youth smoking is through education, then I think that I would want to look at partnering with the school district and approaches like that as opposed and in regards to the ban. I think historically our country has found that a ban can result in unintended consequences.'",
        "'speaker_0': 'I strongly support what our state did in regards to increasing the legal age to purchase. And and at this point, we do not have that data as in fact, we all know it's only been a year and a half since that happened.'",
        "'speaker_0': 'I think it's important we see that data and. And if in regards to the data, 95% from our retailers. That is very, very high and it's different from the 80% and older data. So I think it's important that any decisions we make be based on the most recent data and not data from the past.'",
        "'speaker_0': 'Because I think it's this issue is so important. We need to know with better confidence, from my perspective, of what is our best approach to reduce access to use. And I'm concerned that this may unfortunately as well intended as maybe not not not achieve that result.'",
        "'speaker_0': 'So I do have I would like to see much more data and in fact, work with the school district and the youth in this community to figure out our best approach moving forward. And I'd submit it's not the city by ourself that it really is working with our school district and our youth in this community.'",
        "'speaker_0': 'That being said, we have.'",
        "'speaker_5': 'I'll make a motion for the referral with the consideration of the comments by all my colleagues.'",
        "'speaker_3': 'All second.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'I thank you. All right. So the next item is nine.'",
        "'speaker_1': 'Be considered directing staff to determine whether council can enact an ordinance to pass through a portion of the housing program. Rent fee to tenants. Clarify the city's collection efforts for landlords who do not pay the fee by December 31st, 2017, and clarify that the fee may be passed through as part of the rent increase.'"
    ],
    "Ordinance and Collection Options for Housing Program Fee. ": [
        "'speaker_1': 'This idea was placed on the agenda at the request of Mayor Spencer and Vice Mayor.'",
        "'speaker_0': 'Thank you. Did you want me? So this is an issue that has arisen in regards to the way these bills were sent out. Some of the comments we've received and we all have received them. So this was on.'",
        "'speaker_0': 'In fact, we do have some choose to public speakers. But this was really a result and I appreciate member the vice mayor joining me on this. Of. To determine the title. I'll just read this briefly to determine whether council can enact an audience to pass through a portion of the housing program rent free to tenants.'",
        "'speaker_0': 'Clarify the city's collection efforts for landlords who do not pay the fee by December 31st, 2017. Three. Clarify that the fee may be passed through as part of a rent increase. All right. And the two speakers we have, Eric Strimling and then Catherine Pauling.'",
        "'speaker_4': 'It's here.'",
        "'speaker_0': 'Oh, it's Mr. Strimling in the. All right. All right. Catherine calling them. Thank you.'",
        "'speaker_8': 'Just very quick issues. One thing we want to know.'",
        "'speaker_4': 'For.'",
        "'speaker_8': 'Actually, the first thing is.'",
        "'speaker_4': 'That we.'",
        "'speaker_8': 'Believe as far as stakeholders.'",
        "'speaker_4': 'That we actually.'",
        "'speaker_0': 'Be.'",
        "'speaker_8': 'Involved with staff on this.'",
        "'speaker_0': 'Issue.'",
        "'speaker_8': 'We're very interested in what the fees specifically may cover and.'",
        "'speaker_0': 'Also about enforcement and that there be maybe some sort of form of I like the term graduated enforcement or penalty.'",
        "'speaker_8': 'Be considered.'",
        "'speaker_0': 'And so basically, those are our three requests. All right. The just vice mayor.'",
        "'speaker_8': 'So part of this was, at least on my end in line with the fact that these notices went out right before the holidays. I think there was a lot of confusion, understandably. There was a lot of staff time put into structuring this and figuring out how it was going to work.'",
        "'speaker_8': 'And I know that in the interim, since we submitted this referral, there were there was new information that got posted on the website. And there was also a streamline clarification that came out from our city attorney's office in terms of.'",
        "'speaker_8': 'The interpretation of things. You know, part of this is to to actually direct staff to do a couple of things, at least from my perspective. One is to review what we've collected and see, you know, are there people that we haven't heard from?'",
        "'speaker_8': 'Are there people that are refusing to pay? You know, do we do we know what those numbers are? And and do we have a plan for enforcement? And if so, what is that plan and what are the grounds for any sort of enforcement?'",
        "'speaker_8': 'The other thing that, you know, I wanted clarification on is, you know, we had passed this separate from 3180, but in 3180, we had also referenced it. So is there, you know, to also direct staff to look into a separate ordinance relative to the fee and what would be included in it in and what the scope of'",
        "'speaker_8': 'it is? Because I think there was some confusion, at least, you know, from my end, and I'd heard from several constituents that, um, well, what about 31803180 was repealed. So, you know, how does that impact it? And a lot of our discussion was kind of combined, even though we did the separate motions.'",
        "'speaker_8': 'So really directing staff to look into the feasibility of crafting a separate ordinance relative to this. And in light of everything that happened with 3180 and then what the scope of that could be. And finally, I think we've heard, you know, from different community groups.'",
        "'speaker_8': 'I certainly think much like with transit and everything else, if we have active community groups who we know are working with our constituents to the extent that we can include them in conversations as we're, you know, a staff is researching this, that there's a clear understanding.'",
        "'speaker_8': 'And, you know, involvement and buy in. Think that that's important. We've heard that arc wants to be involved. I certainly think that involving them earlier rather than later would be helpful in terms of making sure that whatever we do, draft is going to be supported by our community.'",
        "'speaker_8': 'And I think the other question that's come up is this question of what the fees are going towards. And we've had part of that discussion before in terms of the operation of the rack and the other services that we're providing.'",
        "'speaker_8': 'I think some of the questions that I've heard is what's the specific breakdown of it? How much have we collected to date? How much do we anticipate? You know, how does that compare to what our anticipated collection is?'",
        "'speaker_8': 'What's the actual cost of of the programs that we're running and how much time is being spent on different issues? Going back to comments I'd make made earlier in this meeting, one of the things that's come up is, is there a way we can maybe be preventative?'",
        "'speaker_8': 'Are there, you know, do we would there be value in having a drop in clinics that people knew what their rights were ahead of time with that reduce the amount of staff time that we're spending on this later on.'",
        "'speaker_8': 'Certainly in other cities where I've spoken with people, they feel that that has, you know, certainly streamlined or expedited the process and really filtered through what staff ends up dealing with or their their rec groups end up seeing.'",
        "'speaker_8': 'You know, and then the other part of this is, you know. Kind of looking at everything that's been happening again in the state and everything else, you know, are there lessons learned that we can look out from other cities in terms of how they're structuring their fees and what they're spending it on?'",
        "'speaker_8': 'And I think there's other cities nearby that are using a portion of the fee to pay for these sorts of preventative kind of drop in clinics and that sort of thing.'",
        "'speaker_0': 'So I appreciate those comments. I actually don't think they're part of the referral. So when I look at the referral, there were three things that we spoke to. And as much as I may support that, I'm not sure that that was in here.'",
        "'speaker_0': 'Did you speak to my.'",
        "'speaker_8': 'Original proposal had been and I think is part of this is clarification about the impact of you know, the fee relative to 3180. And if we're going to do something, you know, can we have a standalone ordinance for some of these clarifications?'",
        "'speaker_8': 'Is that prohibited by what we did? I think it's absolutely part of this.'",
        "'speaker_0': 'Okay. So when I see it says there may be limited exceptions, however, to that general rule number one, direct staff to determine whether the city council could adopt a new ordinance without waiting for a year that would allow landlords to pass through a portion of the housing program fee to tenants in 12 equal installments, and if so'",
        "'speaker_0': ', to bring such an ordinance to the Council for its consideration. Also review whether the pass through could be retroactive. If not, have Council determine whether or not to change the landlords to charge the landlords the fee due December 31st.'",
        "'speaker_0': 'And is that a I'm sorry, maybe I didn't hear.'",
        "'speaker_8': 'I mean, I'm asking you that. I'm asking for clarification. I think there was a lot of language in 3180 that specifically address some of these points that is now no longer there. And I'm asking, one, do we even have the ability to to craft an ordinance?'",
        "'speaker_8': 'I think we need to direct staff to look into that. Two, if we do, what is the scope of the ability to craft something? Does it can address the points that are listed here? Are there other limitations? Is there a year limitation?'",
        "'speaker_8': 'If we're going to address the pass through, which is something that was, you know, has been clarified relative in the FAA. QS what is the structure of that? How does that look? I think, you know, we could we could direct I mean, I think what I'm saying captures what you're saying.'",
        "'speaker_8': 'But really, we need to start with directing staff to even look into what our ability is to craft anything.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_4': 'Thank you. Answer So I can't support this for a couple of reasons. I think we're piling a lot on staff and I think we were just a little bit patient down at the bottom of page two of the staff report.'",
        "'speaker_4': 'We note that city staff intends to bring forth, in the spring of 2018, just months away people a proposed program housing fee for fiscal year 2018 2019. This fee, if adopted by the Council, would be billed in the May-June timeframe and would be due by the end of July 18, in the same manner as the city's process'",
        "'speaker_4': 'for its business license tax. What waiting until the spring does. And by the way, by the time this referral got into the queue and was prioritized with everything else, we're. Directing staff to do. It probably would be around this spring when we hear back, but it would also give us the ability to have that much more data'",
        "'speaker_4': ', that many more fees or attempted collection of fees. And I you know, I understand that 3180 got rescinded, but that doesn't mean that the fee doesn't exist, that the fee was approved in 31, 48. It was just the pass through.'",
        "'speaker_4': 'And yet there's there's other ways landlords can, you know, increase the rent and use that toward the fee that they have to pay. But I, I just don't see the urgency of this when with a little more passage of time, I think we'll have more complete data to make informed decisions rather than trying to accelerate something.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_5': 'Thank you, Madam Chair. I'll just make a few quick comments. You know, I think when it comes to this issue, you know, the first question you ask is what is the value statement? You know, what is our priorities and what is our value?'",
        "'speaker_5': 'And to me, that should be keeping people in their homes. So when I hear a story and we've heard this before, although not recently, that housing authority is telling people how to fix their notices, then what you're doing is really helping people evict people from their homes.'",
        "'speaker_5': 'And yet we're not providing the same type of service or even, you know, any type of of assistance to tenants to fight what might be a defective notice which could defeat an entire eviction and maybe let them stay in their home.'",
        "'speaker_5': 'So, you know, if we're going to have a discussion on what things from 3180 and I thought the discussion was pretty clear when we rescinded it, we pretty much couldn't do anything that we did in 31, 80 or 12 months.'",
        "'speaker_5': 'So included in 3180 was the ability to pass through that fee. So we gave the landlords the opportunity to share that with the renters and the tenants. 5050 And that was there and they chose to referenda it because there were a lot of parts they didn't like.'",
        "'speaker_5': 'So I mean, you can't pick and choose which things in an ordinance you're going to rescind or you're going to referenda that you want to keep and then which ones you want to get rid of. So the whole thing went out.'",
        "'speaker_5': 'So, you know, to use the old expression, they threw the baby out with the bathwater. So in my thought, a number one, I don't see how we could authorize any pass through because we gave that pass through and then that, that, that right was rescinded.'",
        "'speaker_5': 'So I still think, though, like the vice mayor said, and we touched on this a little earlier, if we're going to take a look at, you know, rents again, you know, we do have to find a way, I think, to provide some type of legal services and legal support.'",
        "'speaker_5': 'And we're seeing these huge apartment complexes, the larger apartment buildings in the city getting sold, which to me is windfall onetime transfer tax. And in my opinion, there's no reason we can't, as we go forward, whether we do this in March or in the budget process, set aside some of that money so we can provide some legal'",
        "'speaker_5': 'assistance to tenants. I do remember getting to the third point of the referral. I mean, this is not rent. This is a fee. So, I mean, I disagree with the comment that there's not some urgency because if somebody puts this fee into somebody's rent and it's really not and I think Greg McConnell, who basically wrote Costa Hawkins'",
        "'speaker_5': 'and, you know, agree with him or disagree with them, I think he knows the subject matter better than anyone else. I think when we we put the thing in, he basically stood up here and said, you can't treat it as rent.'",
        "'speaker_5': 'And I think if you look at other cities, they don't treat it as rent. So the problem is if you treat it as rent and you allow it to be included in the rent increase, not only does that, what is it exponentially, you know, allow you to increase that over time, you can basically use it as your'",
        "'speaker_5': 'new base and go up 5% and so on. You know, you can evict somebody for not paying their $12 a month and. That was not the intention of that fee for us to evict somebody if they didn't pay, you know, I'm sorry, $6 if the tenant didn't pay their share of the pass on fee.'",
        "'speaker_5': 'I do think I think the mayor was starting to touch on this during agenda item eight, you know, the some type of moratorium and looking at these different evictions and application of the state of emergency that we have because, you know, we've seen these upticks in some of these large rent increases.'",
        "'speaker_5': 'You know, there was one rent increase or was it 90%? And then all of the sudden they pulled it back. And then I heard hearsay. That threat was okay. We only were allowed to do 5%. So we're just going to own my own move.'",
        "'speaker_5': 'And everybody.'",
        "'speaker_0': 'I'm sorry to interrupt. So I believe that that goes out beyond the scope.'",
        "'speaker_5': 'I think we're talking generally about rent. So I'm going to just I'll wrap up, really. Thank you. So I just think we need to take a look at those things. And if we're going to come back and at the end of March, we should talk.'",
        "'speaker_0': 'Further. Sorry. I appreciate it. I was going to give you the opportunity to wrap up.'",
        "'speaker_5': 'So I think a. You know, the landlords rescinded. So they pretty much have to live with their rescission. And in November, we can take a look at this again. And then the collections, I mean, I guess it would be interesting to see what we're doing if we're collecting, if we're not collecting.'",
        "'speaker_5': 'And third, I don't think this is that this fee is not considered rent. So I don't agree with any idea that would make this go into the base rent. Or you can calculate increases on.'",
        "'speaker_0': 'Thank you. I'm a member matters.'",
        "'speaker_3': 'I'd like to make a motion to not direct staff to. The three points that are listed here. I think these things are going to happen in due time. And as pointed out by Councilmember Ashcraft, I think we all know that as as explained when the referendum was approved, that it basically froze things for a year.'",
        "'speaker_3': 'And I think there's bigger discussions, as alluded to. Hey Councilmember Odie, that we have to have that I'd rather have than deal with this.'",
        "'speaker_0': 'So there's a motion and. Is there a second?'",
        "'speaker_4': 'I'll second.'",
        "'speaker_0': 'And I want to give Vice Mayor an opportunity.'",
        "'speaker_8': 'So I want to ask the city attorney, what's the current advice that's out there right now? Because it's contradictory to what Mr. O.D. just stated in terms of the pass through.'",
        "'speaker_4': 'Can I just clarify? Because I think it might have been my comment that you misconstrued. Mr. Witty I was just I wasn't saying that a landlord could pass the fee on as part.'",
        "'speaker_0': 'Of a member as part of Point of Order. I'm sorry. That amounts to honestly.'",
        "'speaker_4': 'But when.'",
        "'speaker_0': 'You could hold your comment and let the vice mayor ask a question.'",
        "'speaker_8': 'So I'm asking the city attorney what's currently on the queue on the city website?'",
        "'speaker_7': 'Well, I hope I'm understanding your question. The idea is that landlords are able to do a 5% rent increase every year. They do not have to break down what the components of that 5% are. They don't have to use the whole 5%, but they can go up to 5%.'",
        "'speaker_7': 'So right now, the fact that they have to pay $120 a year per unit, that arguably could be covered in whatever rent increase they give a tenant, what 3180 would have allowed was for the landlord to pass along half of that to $60 a year and not have that count toward that 5%.'",
        "'speaker_7': 'But the landlord was always having to pay the full amount.'",
        "'speaker_8': 'Okay. My second question is when this comes back and if not when this comes back, but when staff comes back with their report on the fees, is that going to include any sort of direction or clarification relative to any of the instructions that were given with 3180 in terms of the splitting?'",
        "'speaker_7': 'The answer would be yes. I think I'm hearing that it's a couple of things. One, we have to come back with an audit on the fees. The fees are only appropriate under Prop 26 that there there's a Nexus study.'",
        "'speaker_7': 'There was a Nexus study done. So the people who are questioning what the fees are for and if they're appropriate to the cost of the program and all of that, we will we are monitoring that. We have.'",
        "'speaker_8': 'To. Right. But but we're not monitoring whether or not there was this. So but not included in that is whether or not there's a pass through or whether or not that pass through is shared or anything like that.'",
        "'speaker_7': 'So the staff is hopeful and we kind of have a laundry list because 3180 had a lot of other fixes in it that staff really wanted just to make the program work better. So we have a laundry list and Debbie Potter could probably step up and start giving you her her list, which she probably has tattooed on'",
        "'speaker_7': 'her arm. I know we don't want to do that, but the point is, we are we yes, we have a list and we hope to come back to council with some suggested changes and certainly a pass through which wouldn't count toward the increase.'",
        "'speaker_7': 'The 5% increase would be one that could be included and we will come back within the year. Is is one we'll be back, which is coming very quickly.'",
        "'speaker_8': 'But my question so so it sounds like staff has already researched whether or not mean to Councilmember Otis point he said he thinks that that shouldn't be allowed because it was in 3180. And I mean, there seems to be an assumption from what I'm hearing from the city attorney that we're going to get all of this back'",
        "'speaker_8': 'as part of the fee proposal this spring. And part of my question is, what's the legal basis for that? If we've completely rescinded 31, 80.'",
        "'speaker_7': '31, 80 only did not address the establishment of the fee itself. That was done by resolution. And the Council had a Nexus study and you established the $120 per unit that would pay the cost of the process.'",
        "'speaker_8': 'So I understand that. But what you said you said a second point, which is staff is also going to come back with a recommendation that includes some fixes which were included in 3180, including language around the pass through.'",
        "'speaker_9': 'After the year is up.'",
        "'speaker_8': 'Okay. That's that.'",
        "'speaker_9': 'Timing.'",
        "'speaker_8': 'Question. Okay. So what you're saying is there's going to be two presentations from staff. One is going to be this spring relative to an audit.'",
        "'speaker_9': 'It's a Nexus.'",
        "'speaker_8': 'Study, the Nexus study get you.'",
        "'speaker_9': 'In and.'",
        "'speaker_8': 'Okay, but the second portion is all of the clarification that you're talking about wouldn't be heard until 12 months after the date of we rescinded it, which was not this spring. We rescinded it this part in in November.'",
        "'speaker_7': 'Frankly, I don't know what the timing is on all of that, but I mean, I envisioned it all coming back around the same time. But I don't know the answer to that question. I'm not sure on the calendar when those things are coming.'",
        "'speaker_7': 'And as far as us coming back with amendments that were in 31 A.D., I think the idea really is we've got even more experience with this program now. So our laundry list might be different than the things that were in 3180.'",
        "'speaker_7': 'What staff would be wanting to tee up for council is just some some ways we can help clarify and make the ordinance better.'",
        "'speaker_0': 'Which I think may also go outside the outside. The scope of this referral.'",
        "'speaker_5': 'You're I mean, I mean, judging is outside the scope of peers. And we talked about dredging. So I mean, we could be a little bit of a little leap.'",
        "'speaker_8': 'I mean, I'm trying.'",
        "'speaker_0': 'Point of what I'm going to say. So we had a motion. Do we have a second? All right. All those in favor, I.'",
        "'speaker_5': 'Sorry. What are we voting on again?'",
        "'speaker_0': 'If you could repeat your motion.'",
        "'speaker_3': 'The motion was not addressed to the three items here. Based on these items are already in progress in one form or another, in due time.'",
        "'speaker_0': 'His emotions, and that was seconded by member ashcroft. And I called the question of all those in favor. I. I. Others opposed.'",
        "'speaker_8': 'I oppose.'",
        "'speaker_0': 'Others abstaining. Did you want to rush to the vote? Remember already? Well.'",
        "'speaker_5': 'I think I'm going to abstain because I don't think we can enact the ordinance. And I would like to give direction not to enact the ordinance. But. Who is out there.'",
        "'speaker_4': 'So we don't have affirmative votes. So.'",
        "'speaker_0': 'So there was the motion. Correct. Okay. And I'd like to make a motion to adopt the proposed referral. There are second. All right. Seeing them right there.'",
        "'speaker_8': 'I would like to second with the caveat that we're really also looking for staff to give clarification about what can and can't be done, because to me, that still hasn't been. Articulated.'",
        "'speaker_7': 'I'm sorry, but I don't understand how I'm not answering your question. I'm just not understanding. The point is the the fee can be collected. We are monitoring.'",
        "'speaker_8': 'It. Not my question. My question is there were certain we adopted the fee separately. I understand that. But 3180. Specifically address some clarification points relative to the administration of the. And so that's.'",
        "'speaker_7': 'Correct. And that is not in play. And we would I would arguably we would come back with that if it's past the year.'",
        "'speaker_0': 'Let me ask Vice Mayor, would you like that to be as a friendly amendment to the referral? Yes. Okay. So I'll accept the friendly amendment. So there's a motion and a second clarification.'",
        "'speaker_4': 'Yes. So we craft for the city attorney to come back by next September. This September, is that it, when a year is up from the ordinance? But I mean.'",
        "'speaker_0': 'This is actually this would be certainly before that.'",
        "'speaker_8': 'This is what I'm asking is they're already saying that they're going to propose they're going to make proposals to the fee. What I'm saying is I don't want to be looking at the new fee structure for the next year without knowing what we potentially could or could not be considering relative to the administration of it.'",
        "'speaker_4': 'So you would like to know that by the spring of 2018 comes back.'",
        "'speaker_8': 'And what when what Janet saying is, is that it's going to be. I'm hearing two different things and hearing one thing from Joe, which is that they're going to have to be heard separately and one is going to come a year later.'",
        "'speaker_9': 'Not a year later. So we have.'",
        "'speaker_8': 'A year.'",
        "'speaker_9': 'For.'",
        "'speaker_0': 'This part about the.'",
        "'speaker_9': 'Timing of the study.'",
        "'speaker_4': 'We know you were trying to avoid I.'",
        "'speaker_8': 'If I if I could take a stab at this just to see if I can help to clarify. So prior to July one, we will be doing an update of the phe study. So I'm hearing two things. I'm hearing that there might be an interest in looking at what are the components of the work activity that goes'",
        "'speaker_8': 'into administering the program, for example, providing legal support for tenants that could be captured as part of the fee study that that's one concept or idea. I also heard earlier this evening that perhaps that's an initiative that's paid for from one time funds in from the general fund, which could be done separately as part of a mid-year'",
        "'speaker_8': 'mid-cycle budget adjustment. So there are potentially two ways to approach that, but that is something that we could come back. If the council wanted to look at that as part of the fee, we could come back and indicate what that cost would be.'",
        "'speaker_8': 'We would be doing this in the May-June time period. So that would be a standalone update of the fee study with a resolution that would adopt a new fee effective July one for the upcoming fiscal year. Whether or not.'",
        "'speaker_8': 'And we. In that resolution, we couldn't have just addressed the issue of pass through. That has to wait. The city attorney is saying for one year from when the ordinance was referenda. So. When the fee goes into effect for July one, there still won't be an opportunity to provide a pass through because.'",
        "'speaker_2': 'The one year you won't have been able to tackle the new ordinance.'",
        "'speaker_8': 'Until September of 2018. So that if that happens, you could possibly have the pass through for July one of 19. The other thing that I think all of us have to be cognizant of is if that ordinance is incorporated in the city charter, our ability to do anything as a council, as staff to amend that ordinance could'",
        "'speaker_8': 'be determined in November. So whether the council wanted to do a pass through or not, you might be precluded from doing that if if the ordinance becomes part of the charter. That's another piece that kind of overhangs all of this about what kind of tweaks we can ultimately make to the ordinance.'",
        "'speaker_8': 'And so that you may decide you want to wait until November and see the outcome. That's all in addition to. The exercise we must do to update the study and adopt a new fee schedule for the.'",
        "'speaker_2': 'Upcoming fiscal year.'",
        "'speaker_0': 'So can you clarify, is that the attorneys position and then if the charter? I want to make sure that I'm hearing this correctly from what you just shared, that if the charter amendment passes, that there could not be a subsequent action by council in regards to pass through.'",
        "'speaker_7': 'Actually, yes. Debbie raises a good point that frankly, I'd even forgotten about at this late hour. Yes. If if the charter amendment passes in November, then the only way we can amend that that charter, which is going to be the rent control or rent stabilization audience, would be through a vote of the people.'",
        "'speaker_0': 'Okay. Now, my recollection of it is that it doesn't speak to a pass through. But do you think you think it specifically prohibits pass through? We don't have the authority.'",
        "'speaker_2': 'All we.'",
        "'speaker_0': 'Have is the authority.'",
        "'speaker_8': 'That is provided in the resolution that was adopted by the Council in June, which is the authority to establish a fee based on the fee study and to implement that fee.'",
        "'speaker_7': 'So just to try to be clear, to make sure, because we seem to keep circling about this one. So if the charter provision is adopted. The only way you could get this technical pass through to the tenant, which wouldn't go against the 5% rent increase, which is what's in there now, would be if there was a charter'",
        "'speaker_7': 'amendment with the vote of the people, if the charter amendment passes. Because right now there's nothing that addresses that ability that is not in the rent stabilization ordinance as it as it stands now.'",
        "'speaker_8': 'Okay. So part of putting forward this referral, which was a couple of months ago, was that none of this you know, this is all I'm hearing this for the first time now, because when I first went and when the mayor first went and we spoke with the city attorney's office, there were kind of kind of conflicting questions'",
        "'speaker_8': 'or, you know, responses to the questions that we were posing relative to what was going on. And it was, you know, at that point, Michael Roush told me he still needed to look into it relative to the pass through, which was part of why we put the referral forward.'",
        "'speaker_7': 'And I appreciate that. And I apologize to the council and the community that we weren't immediately very, very clear in our advice, but we corrected it as quickly as we could. We've had the facts in the statement out for a long time.'",
        "'speaker_7': 'All of the attorneys in the city attorney's office are saying the same thing. They're saying the same thing, Debbie and the city manager saying. So I apologize that there was some confusion at the beginning. But we are very clear now.'",
        "'speaker_7': 'I think the message is out there. The housing authority is clear, and hopefully people understand what we're saying.'",
        "'speaker_0': 'Okay. So that actually, I think answers the first item on the referral. It's now that apparently staff has determined that that's not possible to have a pass through. The second point was direct staff to clarify what the city's collection efforts will be for landlords who do not pay the fee by December 31st.'",
        "'speaker_0': 'And could you state what that is?'",
        "'speaker_9': 'The collection is the same with any like our business license. If you don't, you know, it's the same across the board is we send a second notice. We could go after them if we want to put a lean go.'",
        "'speaker_9': 'As far as putting a lane, we can't because that has to come to council. But, you know, first notice. Second notice. It's the same thing that we do for small claims court over it's $60.'",
        "'speaker_0': 'Okay. And then are there additional fees, some sort of interest or something that is accruing for these landlords? Do you know what that. Is there anything like that?'",
        "'speaker_8': 'Resolution that was approved in June does not include provisions for penalties and interest that if there was a desire when the resolution comes before you for the upcoming fiscal year, you could add that to the resolution. It's not going that will not be applicable for this fiscal year fees, but there will be a new resolution that will'",
        "'speaker_8': 'be drafted when we come back before you in the late spring.'",
        "'speaker_0': 'Okay. And then the third point was direct stab. To clarify that for now, the housing program fee as any other operating expense may or may not be indirectly pass through. And your answer is, in fact that it that they can up to the 5%.'",
        "'speaker_0': 'Could you speak into the mic, please? Sorry.'",
        "'speaker_7': 'Yes. So again, the landlord does not have to justify up to a 5% increase on an annual basis. So whatever costs they're covering or if they're just taking, you know, if it's just profit or whatever, I'm not being judgmental.'",
        "'speaker_7': 'They don't have to justify it. So arguably, the $60 a year that we're talking about, which would have been passed through to the tenant, could be covered in that 5%. They don't the landlord does not have to explain that.'",
        "'speaker_7': 'All the landlord has to do is say that they want to increase their rent by 5% or less. And and that's justifiable under our current ordinance.'",
        "'speaker_0': 'All right. Thank you. I think that that this is of the three items that were raised, remember.'",
        "'speaker_5': 'I'm. Thank you. One quick question. I guess what I don't want to see in I guess we haven't seen it yet is that somebody says I'm entitled to 5% plus $60 and then they go and try to justify 5% plus $60.'",
        "'speaker_5': 'And while that they can't, quote unquote pass it through, if we're saying it's justifiable as a rent increase, then we would see an onslaught of 5% plus $60 saying we're justified to pass.'",
        "'speaker_8': 'So just to clarify, staff, neither city staff nor the Housing Authority staff is recommending that landlords. You know, add $120 per unit to any annual rent increases. Nobody's recommending that. I think what the city attorney is saying is that somebody could do that.'",
        "'speaker_0': 'But if you do 5% plus $60.'",
        "'speaker_8': 'You're going to trigger a hearing before RAQ.'",
        "'speaker_2': 'And so I think.'",
        "'speaker_5': 'Keep an eye on that.'",
        "'speaker_8': 'Yeah. So I think that's the point. If if a landlord figures out that they could recoup the cost under 5%, they don't trigger a hearing. They may decide that's a good sort of course of action as the business person starts not putting that forward as a recommended sort of workaround to to to the lack of a pass'",
        "'speaker_8': 'through option under our ordinance. And if a landlord raises the rent more than 5%, it triggers Iraq hearing, regardless of the reason that you're doing it above 5%.'",
        "'speaker_5': 'So do we need to go back to your. Or because I can reconsider. That one.'",
        "'speaker_0': 'Okay. So this is my referral and the vice mayor's referral. So I just would like to say that from my position, I think this I plan to withdraw the referral. I think it's been addressed, but I think we can move on.'",
        "'speaker_0': 'So so we're in agreement to withdraw the referral. Thank you. I appreciate the staffs. We took.'",
        "'speaker_3': 'Our time.'",
        "'speaker_0': 'Thank you. Next item, counsel communications. Do we have any communications from council? I do want to share that I was here for the Martin Dr. Martin Luther King event that took place. Here was the 39th year. There is a good turnout.'"
    ]
}