{
    "Appointment of Open Government Commission Member.": [
        "'speaker_1': 'All right, Councilman Knox, wait.'",
        "'speaker_2': 'Thank you. So I just wanted to both announce that Miss Montgomery, who I am nominated and will be appointed to the LGC tonight, was on is unable to attend the meeting due to a last minute family issue that came up.'",
        "'speaker_2': 'But I. So while she doesn't get her chance to introduce yourself and whatnot, I just wanted to take this time to quickly share my appreciation for her stepping up. I've gotten to know her over the last two and a half years.'",
        "'speaker_2': 'She has shown herself to be someone very interested in caring about the the business of the city and making sure that people are informed and involved and engaged in the work that we do. And I just wanted to honor honored that before we had the chance to vote, since she's not here to introduce and tell you why'",
        "'speaker_2': 'she's fabulous. So thank you.'",
        "'speaker_1': 'And we'll look forward to her having another time to do to do just that. But for now, we need to we need to vote on her appointment, the appointment of Melody Montgomery.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'So. And we, Madam Kirk, do we vote or do we do okay? Okay. And Councilmember Herr Spencer is at a motion you're making.'",
        "'speaker_0': 'I'm happy to move the item, but member Knox may want to add and I'll have a second.'",
        "'speaker_1': 'Why don't you go ahead.'",
        "'speaker_2': 'And move a second.'",
        "'speaker_1': 'We've got a motion. We've got a second. Any further discussion? Seeing, hearing. Then may we have a roll call vote, please?'",
        "'speaker_0': 'Meredith.'",
        "'speaker_2': 'I like her.'",
        "'speaker_0': 'Spencer, I. Knox like.'",
        "'speaker_2': 'I avella.'",
        "'speaker_0': 'I mayor as he ashcraft high that carries.'",
        "'speaker_1': 'By five. Thank you, everyone. And so the city clerk will make arrangements to square Ms.. Montgomery in, and then we will make arrangements for her to come in and do that brief intro that we've been doing with our nominees, which is just a really nice way for the council and staff and the public to get to know'",
        "'speaker_1': 'them. And I will tell you that there's one other nominee who wasn't able to make it tonight either. So Will. But take care of all that. Okay, perfect. Well, we are moving right along. So now we come to item.'"
    ],
    "Appointments to the Housing Authority Board and the Mayors Economic Development Advisory Panel.": [
        "'speaker_1': 'Well, we don't have an item six because we don't have any anything continued from the previous agenda. So now we have we moving into our regular agenda. And the first item is item seven. Madam Clerk.'",
        "'speaker_0': 'Adoption of resolutions, appointing Christina Moon as a member of the Housing Authority Board of Commissioners and appointing Eva Jennings and Dan Paretsky as members of the Mayor's Economic Development Advisory Panel.'",
        "'speaker_1': 'So council it is Ms.. Moon who is? I don't believe she was able to to join us this evening. Is that correct, Madam Clerk?'",
        "'speaker_0': 'Correct.'",
        "'speaker_1': 'Yes. So we can still vote on her nomination. Can we do all three of the nominations together?'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Okay. Two. I have I have. Councilor, we're not quite stand up as a motion.'",
        "'speaker_2': 'I remove approval of all three candidates.'",
        "'speaker_1': 'Thank you. And I see Councilmember Desai with his hand up to second. Correct. Okay. Any further discussion? Singh then maybe have a roll call vote, please, Madam Clerk.'",
        "'speaker_0': 'Somebody, shall I? PEREIRA Spencer, I'm not.'",
        "'speaker_2': 'Quite high.'",
        "'speaker_0': 'I may or as the Ashcroft high that carries by five eyes and we have this Jennings here but it looks like we don't have an mr. Prosecutor. So looks like we're missing the.'",
        "'speaker_1': 'Cases of missing nominees. Well, Ms.. Jennings, you will just stand in for all of the nominees. But first, we we want the clerk to do the swearing in. Are you ready, Madam Clerk?'",
        "'speaker_0': 'Yes, if you the way your right hand. You saw me to pull the Constitution of the United States, the Constitution. State of California, that you won't faithfully discharge the duties upon which you're about to enter and do. All right.'",
        "'speaker_0': 'Congratulations.'",
        "'speaker_1': 'Perfect. Congratulations. Welcome. Thank you for for accepting this nomination and for which you were just unanimously approved. And we would love it if you would just tell us a little bit about you and your interest in serving on this particular advisory committee.'",
        "'speaker_0': 'All right. Well, thank you, Mayor Ashcraft and members of the city council. As was mentioned, I think it was mentioned, I am currently the dean of Career and Workforce Education at the College of Alameda. And in this role, I continue to focus on career and workforce education, as I have throughout my entire adult working life.'",
        "'speaker_0': 'So I taught career ed in high school, in community college. I am invested and committed to educating people for careers and. You know, our economic in order to recover from the economic ills that the COVID pandemic brought upon us, it's dependent upon employing Californians with living wage jobs and the jobs that pay a living wage.'",
        "'speaker_0': 'Require increasing levels of education and training to meet our ever changing technological demands. So I look forward to sharing my knowledge and experience.'",
        "'speaker_2': 'In.'",
        "'speaker_0': 'Workforce education to advise the Mayor, City Council and staff on key economic development issues and initiatives. And I read that off the website because I haven't attended the orientation yet, and I don't know the specifics of what that entails.'",
        "'speaker_0': 'But I am honored to have been nominated to serve and represent the College of Alameda on the Mayor's Economic Development Advisory Panel. I am thankful to the City Council for approving my nomination and for and for my college leadership.'",
        "'speaker_0': 'Dr. Nathaniel Jones, the president, and Dr. Diana Bahrami, Vice President of Instruction for their support. I look forward to contributing as best I can and to this important work. And I want to thank you very much for the opportunity.'",
        "'speaker_1': 'Thank you so much for agreeing to serve. You will be a valuable member and bring a much added dimension to this this panel. So and you will be a quick study once you have.'",
        "'speaker_0': 'Your orientation.'",
        "'speaker_1': 'And first meeting and get to meet your fellow panelists. So thank you so much. We are delighted to welcome you on board.'",
        "'speaker_0': 'Thank you. I look forward to it.'",
        "'speaker_1': 'All right. Thank you so much. Okay, then we are moving right along to item seven. Be Madam Kirk for you. Introduce this item for us, please.'"
    ],
    "Options for Reducing Automobile-Oriented Events at Alameda Point.": [
        "'speaker_0': 'Imitation to provide direction to staff to pursue one or more options for reducing the negative impacts and public safety challenges associated with automobile oriented events at Alameda Point.'",
        "'speaker_1': 'Thank you. And this I'll note quickly as a follow up to an item, a council referral that Councilmember Knox White and I brought a while ago. And so I'm I know staff has put a lot of effort. I think staff in several city departments have put a lot of effort into this.'",
        "'speaker_1': 'So I'm city manager Leavitt, who is who's presenting this one now.'",
        "'speaker_2': 'I'm Mary Elbe, assistant city manager Boden. Okay.'",
        "'speaker_1': 'Hello, Assistant City Manager Jerry Bowden. Good evening.'",
        "'speaker_2': 'Good evening. Good evening, Mayor. As the Ashcraft. Members of the city council big team here tonight. Obviously our city manager and our city attorney, director of Public Works, Aaron Smith, is on the call this evening. We also have planning building transportation director Andrew Thomas.'",
        "'speaker_2': 'Lisa maxwell, our committee development director, may also be joining and we also have police chief, the Sean Joshi. So obviously multi departmental effort car events that are having negative impacts at Alameda point things like pedestrian and bicyclists safety.'",
        "'speaker_2': 'And I'll say next slide. Thank you. Pedestrian and bicyclists, safety, traffic congestion. There's concern about first responders being able to access the area during certain events that get so crowded that it might be challenging to do to be able to get folks in there.'",
        "'speaker_2': 'Noise, trash and property damage have also been associated with some larger scale events and those are having negative impacts on residents, businesses. And also we have an award winning climate action plan that has pretty lofty greenhouse gas reduction objectives.'",
        "'speaker_2': 'And so all of these things are at odds with some of the events that are happening. Next slide, please. So staff's recommendation this evening is really an attempt at striking the right balance between managing the different auto oriented events that are happening with allowing for the enjoyment of the area by residents, business, community and visitors.'",
        "'speaker_2': 'These four points on this slide will be discussed in more detail in the presentation tonight. Next slide, please. So as mayor, as the Ashcraft mentioned, staff did elevate this item to as a priority when the council referral came forward earlier this year.'",
        "'speaker_2': 'At that time, direction was given to the city manager to evaluate the situation and implement measures to mitigate or eliminate those negative impacts from certain auto oriented events occurring at Alameda Point, including the comings and goings from the point that there were also resulting in a lot of complaints and concerns from residents.'",
        "'speaker_2': 'So staff did identify three types of events that are happening at Alameda Point, things like city permitted events, special events, conditional use permit events that that were occurring. There are also non permitted events, informal, large scale events where hundreds of vehicles were coming through either online or just group meets.'",
        "'speaker_2': 'And then we're also seeing individual reckless driving. We're calling those events. Sometimes it's a couple of cars or an individual car, but those are also creating issues in the area based on our look into the situation. So next slide.'",
        "'speaker_2': 'We have scaled back staff has scaled back the permits that we've been issuing for auto related events at Alameda Point since the council referral in August. We did actually have a slide behind. I'll say next slide one more time, please.'",
        "'speaker_2': 'We did also scaled back the the permits. We also put a number of. We also look at key locations where informal event group events were or congregating for the parking lot. Next to the skate park is an example of that.'",
        "'speaker_2': 'And that area was the recipient, recipient of wheel stops, which are those concrete blocks that you have to stop your car at the shopping center parking lot? Those when those are installed, they deter faster moving vehicles, spinning car activities, things like that become a lot harder when the wheel stops are in place because there's just less room'",
        "'speaker_2': 'for that and there are physical barriers. Similarly, the south side of Building five on West Tower Avenue and the open area between the Lookout Tower and Building 25 near the end of Monarch Street, which is the street that runs north, south, west tower, west, midway, west redline all tie into monarch and monarch takes you out to the'",
        "'speaker_2': 'park area. Those barriers were put barriers were put in place at a number of locations. We've also had greater police presence in the area and as part of monitoring the events as they're occurring. Next slide. So this is what the area near building 25 at the end of just as you come down West Tower, if you come'",
        "'speaker_2': 'past palladium and keep going straight out to Spirit's Alley, West Tower cheese into monarch. And if you turn left, building 25 is is located in that area. There's a mix of rail and tree planters which kind of neck down or narrow the entrance to the larger I'll call it future deep paved park area or that larger parking'",
        "'speaker_2': 'lot area. This still allows bicyclists and pedestrians to navigate the area. Vehicles can still navigate through the area, but it just creates a kind of a slower entrance and exit area from the larger parking area. And that is the one of the near term solutions that were put in place, does a lot, still allows tenant access as'",
        "'speaker_2': 'well in that area. Next slide. So there were a number of there were obviously a number of improvements that have been put into place. Staff is wanted to take this opportunity to check in with the city council and and make a recommendation on additional refinements to our program.'",
        "'speaker_2': 'Obviously, the the improvements that have been put in place have been effective to some extent, but still allow for some of the negative activity or the negative impacts that were occurring through some of these activities. And so permitted events are obviously an area where we as the city have a lot more authority, land use controls and other'",
        "'speaker_2': 'permitting authority. So with policy direction from council staff could continue to modify or modify existing use permits or continue to more carefully monitor applications for auto related events. So that is an option for us to pursue and maybe more fully execute on.'",
        "'speaker_2': 'Next slide. Non permitted events continue to be more difficult to manage, even with the improvements that we've made to date, staff has developed three options that would allow for even less space for vehicle events at the end of Monarch Street.'",
        "'speaker_2': 'And I'm talking about the area that really extends past where that current neck down area is at Alameda Point. And I'll just briefly show each of these three options now. Next slide, please. So what we're calling barrier option one would maintain those existing vehicle barriers that north or the top end of the the of the slide shows'",
        "'speaker_2': 'the next down area the blue the blue barricade indicators on this map would be the the new barriers that would be put in place. And there would be mostly a complete limit of vehicle traffic beyond the barriers. This would allow for a limited amount of public and tenant parking.'",
        "'speaker_2': 'And then the areas that are kind of to the bottom of this slide beyond the blue barriers would be bike and pedestrian access only in option one. So this is one option for consideration. It would certainly limit any large scale vehicle events beyond those blue barriers would not be possible.'",
        "'speaker_2': 'It would be ten and access only. Next slide, please. Barrier. Option two is the retaining walls with which the retaining system would be maintained. Again, those blue barriers indicate the new cordoned off area, so there'd be a long, narrow road that would take you to public parking at the South End.'",
        "'speaker_2': 'The area that's closest to the water would be open to bicyclists and pedestrians in that parking area. At the bottom of the slide could be right sized over time to make sure that we had adequate vehicle parking but not created an attractive nuisance area at that far end.'",
        "'speaker_2': 'Next slide, please. So barrier option three is again really limited vehicle access tenants only beyond the tower building. And so this is the most limited and limited option. You have bicyclists and pedestrians allowed past that area. Next slide, please.'",
        "'speaker_2': 'Last week. The second bullet on this slide talks about the possibility of municipal code amendments. We're not recommending, though, this those this evening. There are already laws on the books that criminalize street racing, reckless driving events, and their coordinators often happen online.'",
        "'speaker_2': 'And that creates its own challenge in terms of resources to track people on the Internet, on social media. So we're not recommending that it is an option that we did look at one of their location that's not Deep Park is at the end of Mt. Hood, which is at the end of Monarch is the USS Hornet area'",
        "'speaker_2': 'across from the Wheeler facility on West Hornet Avenue. Next slide, please. This is a location that staff is recommending a temporary chain link fence, which would limit vehicle access, but still allow the city to readily lease the space for events or other uses that are deemed appropriate.'",
        "'speaker_2': 'And the last slide, please. So with that, staff is recommending the following actions for council consideration restrict or limit the large scale auto events. A policy direction like that would allow staff to consider applications but not facilitate events that could be problematic.'",
        "'speaker_2': 'Second, retain the barrier system that was put in place in August and implement the barrier option number two, which would allow for public access but restrict a larger area to just bicycle and pedestrian access. Third would be the installation of fencing across from Wheater and finally leave those wheel stops and other physical barriers that have been put'",
        "'speaker_2': 'in place. That concludes our presentation.'",
        "'speaker_1': 'Talk about perfect timing, Mr. Boden. Thank you so much. So, Madam Clerk, I'm sure we have some public speakers, but before we get to our public speakers council excuse me, we have a great array of city staff here who can answer your questions.'",
        "'speaker_1': 'So let's take clarifying questions at this time in Kalahari Desert. Go ahead and start a.'",
        "'speaker_2': 'Quick clarifying question for the the chain link fence around near the west, near the LEDA facility. Is there any reason why the chain link fence doesn't extend to cover that portion? That seems to be just right, right next to it.'",
        "'speaker_2': 'It looks like I think people practice motorcycle driving in that area. Is there a reason why we don't include that the chain link fence doesn't extend to that area? It's a great question. Councilmember de SAC, the the the answer to that question that we've received so far is that we think that the Hornet lease actually covers some'",
        "'speaker_2': 'of those other areas. And so we want to make sure we'll make sure that we align the fence and are as if council endorses this concept. We'll make sure that it's as inclusive as possible for that large area, but we don't want to infringe on anyone's rights.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. I saw a hand go up. Who was that? Councilmember Harris Spencer.'",
        "'speaker_0': 'Thank you. I want to follow up on member de SACS question. So sometimes the Hornet has events with a lot of people that are driving and I know they go beyond that area that's available outside of that fence.'",
        "'speaker_0': 'So with the area within the fencing be opened for when they're having their events.'",
        "'speaker_2': 'It certainly could be there. Their lease currently would not cover that area, but it's certainly something that we could talk with them and coordinate. We're in close coordination with the Hornet representatives, so if they were planning a large scale event and needed more parking, we could certainly be open to that conversation.'",
        "'speaker_2': 'And what we're talking about is temporary fencing that could be easily relocated or moved over time as necessary.'",
        "'speaker_1': 'I had Councilor Hurst answer.'",
        "'speaker_0': 'So I also know shopping centers have this issue too, but they actually don't block office spaces. What they do is they add speed lines or speed bumps or the bot stops. Oakland and Chief Joshi may know this, right.'",
        "'speaker_0': 'They've added a lot of these raised starts to try to address it, but they still keep the spaces available. So can I ask, why hasn't staff done other things like that that allow the space to be used by law abiding citizens, many of which go to the Hornet and want to be able to park.'",
        "'speaker_0': 'You want to watch the sunset, things like that. But it sounds like, you know, what I'm hearing is that staff is jumping to let's just cut off areas, make them not accessible to cars. And maybe that is what we're trying to do here is have everyone on bikes and walking and we have fishermen that go out there'",
        "'speaker_0': 'and use the area. Some of these proposals would take that opportunity away.'",
        "'speaker_1': 'Yeah. Can I ask Chief Joshi if you'd like to address the you know, what is it? What is the problem we're trying to address here?'",
        "'speaker_2': 'Sir. Good evening and thank you, Madam Mayor, and good evening to the city council. So the concern these recommendations are to mitigate the gathering of cars that that then so those bot dots or the the rumble strips or, you know, things like that can actually they would they would deter people engaging in in, you know, doing the'",
        "'speaker_2': 'burnouts and things like that in those specific areas. However, when they when they do leave through the, you know, that entry chute, I guess you could call that it's been referenced in that way that that's where a lot of the burnout activity is also occurring.'",
        "'speaker_2': 'So I think that, you know, we can still have vehicles go down into that area, into those areas, and people can still enjoy the scenery there. And so, I mean, these I mean I mean, these are recommendations that we came up with for the council to provide direction on.'",
        "'speaker_1': 'So I put further clarifying questions. Councilmember Spencer.'",
        "'speaker_0': 'I appreciate your asking a question, but I've had a question. It's not the same question. For instance, the area of chief that you just brought up where the cars can enter, there are no speed bumps or speed lamps, anything like that.'",
        "'speaker_0': 'To slow traffic in that area is just a it's just a more narrow area. It's like a lane. Right. So my question was, why aren't we doing speed lamps or speed bumps to slow down traffic, for instance, in that area?'",
        "'speaker_2': 'It was like.'",
        "'speaker_1': 'Any of the any of the staff who's worked on this, too, would like to have been Andrew Thomas plan planning transportation.'",
        "'speaker_2': 'To a day. I think they probably both strategies work, right? We're trying to make the area unattractive for people to do inappropriate activities with their automobiles. So whether it's the Dot's all over the place or whether it's the barricade system, I will defer to our public works director, but my hunch is that the dot's to do it'",
        "'speaker_2': 'well and to do it as effectively as the barricades. There's just going to be a more expensive strategy to implement and to maintain.'",
        "'speaker_1': 'Thank you, Mr. Thomas. Public Works Director Aaron Smith. Did you want to weigh in?'",
        "'speaker_0': 'I just wanted to add an additional thought. The bumps and there's both speed bumps and there's the dots that that folks are talking about. Those are definitely options. Where we went with just blocking off areas was really considering, you know, there's not a lot of travel.'",
        "'speaker_0': 'There's no travel lanes out here. It's just wide open space. And so this the intent here was to focus travel in one area and to focus it safely. That was the 40 foot lane that exists. If we just did the lumps or the bumps everywhere, then you just have that everywhere and there's still no identified travel lane'",
        "'speaker_0': 'and that presents and safety issues as well. There probably could be a way to create travel lanes with those bumps, but this is the approach that we took because it builds on what's existing with the 40 foot lane.'",
        "'speaker_1': 'Thank you. Katherine Harris. Spencer.'",
        "'speaker_0': 'Thank you. So I appreciate, you know, the safety plan. It sounded like from the chief's comments, though, that it's still not working, that, yes, there is an identified lane. So my question is why? Why aren't you considering adding maybe you are the speed bumps or bumps so that when the cars do funnel down that there is something'",
        "'speaker_0': 'that actually slows them down? I think that can definitely be an option within the 40 foot lane for sure. My understanding is another objective of what we're trying to do here is prevent the large scale congregation, not just the reckless driving that oftentimes happens at the tail end of these events, but a number of the events that'",
        "'speaker_0': 'I've been informed about and I've witnessed one, when I happen to be out there, it's the congregation. And so the bombs won't necessarily prevent the large scale congregation. So that was just another factor. But Councilmember Spence, you're absolutely right.'",
        "'speaker_0': 'In that 40 foot lane, we could certainly put in things that would if that became an issue of speed within that 40 foot lane, we could certainly put deterrents to reduce the speed within that. Okay.'",
        "'speaker_1': 'Further clarifying questions for you, Councilmember Herr Spencer. At this time. Okay. How about any other council members any any questions you want to ask of staff before we get to our public comments? Okay. I'm not seeing any hands up.'",
        "'speaker_1': 'So, Madam Clerk, how many speakers do we have?'",
        "'speaker_0': 'We have three speakers.'",
        "'speaker_1': 'Okay. So you want to explain what that means?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'So it means that we they all get 2 minutes unless we are 3 minutes, unless we get seven speakers, and then they would be lowered. And my thing is. Here we go. I can't find them. Okay, here. There.'",
        "'speaker_1': 'The case of the misplaced speakers.'",
        "'speaker_0': 'No, I can't. I can't see their names. It's really weird. And the first one is Laura. I have to maybe fini.'",
        "'speaker_1': 'Oh, okay. Laura. Well, yeah, I see her thing. Okay. Speaker fees are five. Go ahead. Welcome.'",
        "'speaker_0': 'Hello. Good evening. My name's Laura Fees. I'm executive officer at the U.S., a foreign art museum. So, first of all, thank you so much in this for differentiating between the various types of car events. That was really a very nice for me to hear and I could pass it along to everyone else on the crew.'",
        "'speaker_0': 'So from the museum's perspective, this kind of the car congregation is two fold. And the primarily, of course, is our general mission. You know, we'd really like to grow our general mission. We took a 90% revenue hit during COVID.'",
        "'speaker_0': 'So we are looking forward to getting that crowd back. And while generally the parking that we are leased is sufficient, ideally we'd like to sometimes, you know, peek into the what we referred to as the enterprise lot, which is a larger lot beyond us.'",
        "'speaker_0': 'And we already have that good coordination like assistant city manager was saying between us and the city to let them know when we have specific events that we are anticipating large numbers for and we can alert them that we are looking for more parking.'",
        "'speaker_0': 'But specifically also until the fantastic public public transportation options that have recently been introduced, Seaplane Lagoon and then Bus Line 78 are expanded to also cover the museum's hours of operation. And we will be depending on car traffic to bring attendance to the museum.'",
        "'speaker_0': 'Secondarily, I'd like to address the special events that we are looking forward to continue to hosting. We were allowed for events in our use permit, which I do hope we are able to keep because our museum, perhaps unsurprisingly, is particularly attractive to, I'll call them transportation enthusiasts, the planes, trains and automobiles types of people.'",
        "'speaker_0': 'So we've been having a great luck with kind of coordinating and city approved events where we are able to bring in car clubs who are generally well-behaved. I will not say perfectly, but I will say that specific car clubs that we have worked with officially have done things like reprimand and kick people out of their clubs for'",
        "'speaker_0': 'poor behavior. So I would hate to eliminate an entire car club on the bad behavior of one or two individuals who made poor choices during their visits. But yeah, I was just here in general to to advocate for the kind of differentiation on behalf of the museum, kind of consider those what is a, a good and safe'",
        "'speaker_0': 'and appropriate car club congregation, if you will. And then, of course, what is the dangerous stuff that we also don't want on the base? And we will do everything in our power to help eliminate that. And things like wheel stops and our parking lot would be lovely because we also don't want donuts and burnouts.'",
        "'speaker_0': 'So happy to talk to you more about it. It looks I'm just about to run out of time here, but thank you very much.'",
        "'speaker_1': 'Thank you for your comments. Our next speaker.'",
        "'speaker_0': 'Steve Shafer.'",
        "'speaker_1': 'Good evening, speaker. Maybe Shaffer.'",
        "'speaker_2': 'Schaffer.'",
        "'speaker_1': 'Schaffer It is. Okay.'",
        "'speaker_2': 'Yeah. I'm Steve Schafer. I'm the owner of Urban Legend Cellars in Building 25 or, as I've called it, ground zero for these events these days. First off, thank you very much to the assistant city manager, city manager, director Aaron Smith and to Chief Joshi and the council.'",
        "'speaker_2': 'I'm glad this is getting the attention it needs. The we really do need to do something here. If you look at option two, that entire area was full two weeks ago with a car show and a week before that.'",
        "'speaker_2': 'These shows have gotten very large, over 500 cars in attendance and well over 1000 people. You now have vendors coming out vending food. There appears to be a vendor coming out vending alcoholic beverages, which is completely illegal. The mess from the trash here and the sanitary mess that's leftover because there are no sanitary facilities out there are'",
        "'speaker_2': 'becoming a big problem. It is taking our customers 25 to 30 minutes to get into our site. We have been somewhat effective in being able to maintain a parking area for our customers, but we are at the last amount.'",
        "'speaker_2': 'We lost control of that. So if something needs to be done of the options that are out here, we prefer option two. It does not require vigilance as far as keeping a gate closed. It also provides a very nice public parking space out in one of the more scenic parts of the point.'",
        "'speaker_2': 'So I'm looking forward to seeing what action can be taken. And as always, I am here to do whatever I can to support this.'",
        "'speaker_1': 'Thank. Thank you. Thank you, Speaker Schafer. Were you were you finished?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Okay, great. Thank you. I think we have at least one more speaker.'",
        "'speaker_0': 'Yes, one more speaker. Victor. Yay!'",
        "'speaker_1': 'Welcome back, Speaker to.'",
        "'speaker_2': 'Thank you so much. This has been incredibly insightful. Thank you to everyone on the city council. So I am a resident of Alameda landing on the West End. So this is all new to me. I've recently realized I think the last speaker said maybe two or three weekends of there's just been these car shows.'",
        "'speaker_2': 'And I think it's the one at the Monarch Street that assistant city manager Jerry was mentioning. So I actually first noticed when I was at home these last couple of Sundays, that there was just a hundreds of cars that were just coming down, Willie Stargell and Fifth Avenue around that area.'",
        "'speaker_2': 'And they were near hitting kids almost like it was one per hour. And they were, you know, it was just like really mind boggling to see because they didn't care just rushing their way through. And so I definitely am speaking up in terms of like neighborhood safety for the West End.'",
        "'speaker_2': 'They are to address, you know, councilmember harass. Spencer with regards to the bumps, I think they would help but I drove over to the actual area and it's like I testosterone felt like a lot. So it's not even about like they would just go over the bumps like fast like that actually were probably a fun thing to'",
        "'speaker_2': 'do, but they're, they're just like, vroom, vroom, vroom, the whole thing. And it's when they leave the site that that's where our neighborhood gets impacted and they're just coming through and speeding, doing kind of wheelies in the area.'",
        "'speaker_2': 'And it's just a train. Just see down that down Atlantic. All right. I think that's the street. So I definitely agree with the recommendations. And I'm looking but I also have some compassion for the Hornet museum in a sense of maybe there is a compromise.'",
        "'speaker_2': 'But I actually think it would be great to have a fence for the Hornet site and then also the maximum barriers possible to prevent congregation and allow the permitted shoulder to keep going, but these unauthorized ones to be deterred.'",
        "'speaker_2': 'So thank you so much for your time.'",
        "'speaker_1': 'Thank you for your comments. Any further speakers, Madam Clerk?'",
        "'speaker_0': 'No, there are no more speakers.'",
        "'speaker_1': 'With that, I'm going to close public comment on this item and we'll go back to the council. And I guess I have a clarifying question. I thought that I wish I'd asked earlier, but I'll ask it of Chief Joshi.'",
        "'speaker_1': 'Now, if I could, can you just explain to us the challenges that your officers and I think you've actually been out at Alameda Point on some of these weekend days when there's been problematic auto activity. Can you just describe for us what you and your officers experience and how you control that?'",
        "'speaker_2': 'Sure. So a couple of things. I think that the previous speaker, just this last speaker that came on, really emphasized a point that are brought up, a point that I'd like to emphasize when you have the sheer numbers.'",
        "'speaker_2': 'You have so many hundreds and hundreds. In fact, I think it was in one of these events, as reported, somewhere around 600 vehicles that were out there. It's hard to get. There are no lanes. There's no way to get.'",
        "'speaker_2': 'You know, for example, if you need to get an ambulance down there, you need to get some type of medical attention to to someone that was down there. It's difficult to do that. And then the other thing is that the side sideshow, the whole mindset with these sideshows that you want to draw a large enough group, a'",
        "'speaker_2': 'large enough audience to to then do these sideshow, these stunts, the reckless driving and things like that. So when you have a bunch of participants that are there, that's what kind of fuels the activity. And so as they are leaving the site, that's when a lot of the reckless driving will occur.'",
        "'speaker_2': 'So I think it's it's by having an approach that addresses and minimizes the numbers, we're able to one, most importantly, be in a position to provide some type of public safety if there's a need for an emergent an emergency response.'",
        "'speaker_2': 'We can do that when the numbers aren't so thick. And then the other thing is that people are not they don't have a huge audience, a large audience, where they can engage in the reckless driving as they're leaving out from a paved park.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Okay. Council members. We've heard from one of you. And that's why you have your hand up. I saw that.'",
        "'speaker_2': 'But I thought. Huh?'",
        "'speaker_1': 'I was so serious. See where you get that?'",
        "'speaker_0': 'Oh, did you.'",
        "'speaker_1': 'You bagged the reason?'",
        "'speaker_2': 'I guess so. Thank you. I just want to thank staff for all the work on this. I know it's a complicated effort for me. You know, I have approached this since we decided to open this as from from the position that debate park is.'",
        "'speaker_2': 'We are going to spend millions of dollars to turn and turn this into a park where you can't walk, where you can't drive. And the only way to access is walking and biking. And I don't personally see any reason why, just because it's currently paved and not paved, that we need to encourage people to drive to the'",
        "'speaker_2': 'end there. I'm glad to see that a you know, a number of our the supporters of the future D Pave Park are now supporting the idea of turning this into a place so that it's a little bit more family and community oriented with walking and biking.'",
        "'speaker_2': 'You know, I was very saddened to learn about kind of the impact of some of. Activities that have been happening near Building 25 and the wineries out there. That was actually a bob of all the negative impacts. That was not one that was on my radar until very, very recently.'",
        "'speaker_2': 'So I would be very supportive of choosing option one. No, option two, if that's where we want to go. I don't understand why we would be creating yet another very long driveway for people to race up and down and go to the parking lot and whatnot.'",
        "'speaker_2': 'I fully support the fence over by the Hornet. I think we started this conversation with everybody, you know, pointing pointing fingers at the Hornet. And it turned out that it really wasn't the Hornet, but it was people using that space.'",
        "'speaker_2': 'And I think if we closed down be paved park, we're going to find a lot of folks heading back over to that large section of cement. And, you know, beyond the fact that these sideshows have become a real problem out there.'",
        "'speaker_2': 'Again, this the back end during the sideshows where the problem was the behavior of the all the people coming and going, racing through our neighborhoods. And we can as as presenters have mentioned, we can stop some of the sideshow like behavior within one of our lots, maybe using dots and curbs and whatever else.'",
        "'speaker_2': 'But at the same time, we're still going to be getting the calls from our neighbors who are unhappy with people doing 40, 50 miles an hour down in the Pacific and and through our neighborhoods. And so I think we can work.'",
        "'speaker_2': 'Personally, I would be more than happy to continue to work with the Hornet to figure out a way to support meaningful events that may have a have an auto focus as long as it also has some focus to what they need to do to the business of the Hornet as well, whether that's classic cars, etc., not just'",
        "'speaker_2': 'souped up cars that are that are that are racing their engines and causing problems out of the at the point. And with that, I will I will yield the rest of my time.'",
        "'speaker_1': 'Thank you, councilman rex. Wait. I think I saw cycles what councilmember de folks hand up. No, it didn't. Okay. Councilmember, her response. I think I saw your hand up. Did I?'",
        "'speaker_0': 'Yes. Thank you, Mayor. So I have a question is when the paper comes along, is dash sellers going to be still there? Building 25 going to be there. Kathleen, the.'",
        "'speaker_1': 'Message you want to answer that or.'",
        "'speaker_0': 'The current master infrastructure from the point now's the perimeter levee that saves building 25 building 25 is inland of the perimeter levee so. It is intended to be protected from sea level rise and not be part of deep far.'",
        "'speaker_0': 'Thank you. And then the area that's already cordoned off by the train did take part or I'm sorry, dash sellers. And I think the tower there, there's a big area that has already been blocked off. Is that going to be the park or is that still going to go?'",
        "'speaker_0': 'That's intended. I'm sorry to interrupt you, Councilmember Spencer. I just got excited to answer it is our the master infrastructure plan has it as a large stormwater detention basin kind of similar to what was put in like Bayport where it'll collect stormwater flow before it discharges.'",
        "'speaker_0': 'Thank you. Okay, so I've submitted some pictures and I don't know if the clerk was able to show some of my pictures because I want to answer some of the questions about what do people do out there that are law abiding citizens like myself?'",
        "'speaker_0': 'I go out there all the time. I pick up food, many of us social distance. Then we park, we congregate somewhere. I guess maybe the term is congregate, but I actually don't think that's illegal to congregate. So this is actually something I think staff has added these cement logs almost and quite often they are filled with skateboarders'",
        "'speaker_0': 'and they actually bring out cars and they film each other. There's nothing illegal as far as I know. With that, I think it's a great place to have young adults and youth families congregate there and they use these.'",
        "'speaker_0': 'And some of you may have gone out there and seen seen where this is, but it's towards the end. And as I'm looking at the drawings correctly, this will be not this area will no longer be accessible to the public.'",
        "'speaker_0': 'Are these going to stay for the skateboarders to use? Are they going to be removed or not accessible? Option two, the intent was to not remove those. So that would remain. And the reason why option two was presented was to allow for this just for those that aren't from this building 29 saw at the very end there'",
        "'speaker_0': 'are. Law abiding citizens that access the shoreline very regularly for fishing or for skateboarding or for however that whatever they're doing out there an option to actually keep this open. And this would be part of the space that's exterior to the barriers.'",
        "'speaker_0': 'So I appreciate that. And we can just imagine honestly, quite often it could be, I'm going to guess 50 young adult teenagers playing on this with their skateboards. I think that's a healthy activity. And, you know, it's like a playground for them that is, you know, more age appropriate.'",
        "'speaker_0': 'Okay. Next picture, please. Okay. And so I was out there this evening and you have your cars that come out and then the people stand there and they push and that's the ride along the bay. And that's an amazing view.'",
        "'speaker_0': 'And one of the this could also maybe start, if you could help me again, is this option too that would allow the cars to come out and fish people the fish. Yeah. This was this picture exactly. Was the to preserve this was the objective of option to keep this area accessible for vehicles.'",
        "'speaker_0': 'And I'm not sure how wide the point is. You know, at the end there, the staff is leaving, how much space. But you can see and quite often on weekends this will have multiple cars, it will add canopies so that they have shade because they're close to no trees and they'll have families come out, get a couple'",
        "'speaker_0': 'of cars together, put a canopy over it and put their chairs in there and sit there and enjoy the shoreline. Okay. So the next picture. Okay. So this is also from this evening, you can see the cars go all the way to the fence and that actually was starting to be sunset.'",
        "'speaker_0': 'So that's what they're seeing and why they go out there. Some of them are fishing, some are just enjoying the bay. And, you know, they're law abiding people. You're not doing anything wrong. Next picture. Okay. And here's another group that was from this past weekend.'",
        "'speaker_0': 'You know, they bring their chairs, they sit out there, they fish and enjoy the bay. So I would like us to be able to come up. I personally and I think that could be the the last picture. I guess I should check with staff to make sure that's the last one.'",
        "'speaker_0': 'Thank you. And so I. I want to speak for the law abiding citizens that hang out there and enjoy the bay. And I do know at some point that we won't have as much access via cars, which I support D.P. Park.'",
        "'speaker_0': 'But I feel like in the meantime, we should be able to have access via cars. And I personally, you know, I'm one of those people that had a terrible bicycle accident. This is a very long area to walk.'",
        "'speaker_0': 'And if you're going to be carrying your chairs, bringing your fishing equipment, people of all ages, I hope, you know, I would like us to come up with a way to allow, as law abiding citizens that like to congregate and not break any laws, but enjoy and during COVID.'",
        "'speaker_0': 'I do it almost every weekend, if not multiple times, because I pick up food to go. I get my chairs and you're going to see cars scattered the length along the water, socially distance. Right. So we're not on top of each other.'",
        "'speaker_0': 'So personally, I think the area is insufficient. I'd like to see the area so the cars could almost do like a new block out and fine blocking out more of the middle if that would help. But I would also like us to consider more of the speed bumps, just, you know, to honesty in regards to do you'",
        "'speaker_0': 'do donuts over speed lumps and bumps? I'm going to disagree. I actually think that I think that those work and deter and slow down. And I have seen car shows, if you will, not there. I've actually seen it down one of the other streets.'",
        "'speaker_0': 'That is long. And the issue goes across our city. We're really not going to be closing off all the streets. I need a staff that can help figure out how do we address the criminal behavior and support people like myself and these people that are efficient and people of all ages so that they can enjoy the bay'",
        "'speaker_0': '. And I think that may be the U-shape where the cars can pull up and still be along the water. For me, I think that could be a better solution instead of just saying, no, we can't, we can't do that.'",
        "'speaker_0': 'And I do support that. The Hornet also, I do want to work with them and the fencing and whatnot to try to accommodate the shows. They can have a lot of people. We all know the biggest event out there is the antique fair and they'll have like 10,000 cars.'",
        "'speaker_0': 'They can have a lot of cars. So this is not just the deep part. And I also think we should put trash cans out there. Think about putting trash cans out there. There are no trash cans. And even consider like one of the speakers said, the bathroom facilities, we don't have any out there.'",
        "'speaker_0': 'We've added them to other places in our community. Maybe we could do that too. But I am concerned about I'm going to call overreach. I'm really not addressing the problem. There are, I think like even that lane cars can go fast there.'",
        "'speaker_0': 'And to me, if the issue is to slow down cars, that's different than cordoning off big areas and not allowing people to have access. Thank you.'",
        "'speaker_1': 'Thank you. I would just like some clarification. I think, Mr. Smith, maybe when the staff report to to Councilmember Herb Spencer's point and desire for people to be able to enjoy that area of the shoreline that was shown in the photos under the barrier.'",
        "'speaker_1': 'Option two. Am I understanding this correctly that it.'",
        "'speaker_0': 'Would.'",
        "'speaker_1': 'So it would provide vehicle access and parking for building 25 customers that are wineries but and allow vehicle access to the southernmost shoreline. Wasn't that the southernmost shoreline we were looking at in the photos?'",
        "'speaker_0': 'That's correct. And it it would continue to allow vehicle access to the southern portion, not the full length of the eastern portion.'",
        "'speaker_2': 'So just the southern portion.'",
        "'speaker_1': 'Okay. Thank you. All right. Who would like to go next? Kalahari Desert. Go ahead.'",
        "'speaker_2': 'Thank you. Just a quick comment. You know, four West Enders traumatized by sideshows and reckless driving. I think the message is pretty clear that help is on the way. And so I certainly support the recommendation from staff. All of the recommendation from staff.'",
        "'speaker_2': 'I do think, though, that what council member Harris Spencer is raising about putting some some kind of speed lamps, especially around the that that that the length of option to use that road that might slow down if there's going to be speeding, you know, down that road, maybe speed lamps outside of the outside of the West Haunted'",
        "'speaker_2': 'Avenue area as well. But but I certainly appreciate what staff has put together. I think it's going to go a long way in addressing the underlying causes. As to why there's just so much reckless driving is because there's these big areas where people are able to hold, you know, these kinds of massive sideshows.'",
        "'speaker_2': 'But I think the options that you have laid out here is addressing that. So I certainly appreciate that. I also want to convey my appreciation to Councilmember Knox White and mayor as the crafting bringing this forward as a council agenda item.'",
        "'speaker_2': 'You're welcome.'",
        "'speaker_1': 'Thank you. Vice mayor of L.A..'",
        "'speaker_0': 'I appreciate the presentation by staff. I think getting the visuals really helps in terms of having this conversation. You know, I was out there today and kind of trying to to kind of better orient myself with some of the spaces that were that were listed in terms of the options.'",
        "'speaker_0': 'I do want to be I do want to be careful in that we can still preserve the bike and pedestrian access. But I do think that more needs to be done to limit vehicle access. We do have a number of spaces that are still left completely open.'",
        "'speaker_0': 'I don't necessarily think putting any additional speed bumps and things like that are going to be helpful. I think we can add certain things in or along the way, but if we're not going to block off these larger spaces, we're still going to have problems out there, which are the sideshows and the larger gatherings.'",
        "'speaker_0': 'So I. You know, I do support option two, I think and I think that there's that that'll offer, you know, some some more protections for us. And I just want to thank staff for their work on this. And, you know, I know that we get lots of calls from folks about, you know, events and things like that'",
        "'speaker_0': 'occurring out there. And I you know, I think our police officers are doing what they can to enforce. It's also very difficult, as our chief mentioned, to be at all places, at all times. And so I think taking into account these mitigation efforts through design and things like that will really make a difference.'",
        "'speaker_0': 'I think they have started to make a difference as well.'",
        "'speaker_1': 'Thank you. Vice Premier So so I'll go last and the I and I did was one of the the conveners of this council referral that underlies the staff report. And I think all of the staff lots of you were involved.'",
        "'speaker_1': 'Thank you for bringing all this good information forward. So what I've asked myself is what are the advantages and disadvantages of auto oriented events? At Alameda point to the city it was mentioned that there is the once the month for is a month antiques by the bay fair that takes place the people who come there, both the'",
        "'speaker_1': 'vendors who pay their fees to be there and the buyers who buy goods there are contributing to the city because they're paying sales tax for what the sales tax on the items and then the permit fees and whatnot that the the organizer of of that space collects.'",
        "'speaker_1': 'And and it is once a month and it does have an impact on the traffic. Sometimes it coincides with these spontaneous advertised on social media non sanctioned events and that can really create havoc on getting in and out of the island and on just the safety.'",
        "'speaker_1': 'As our Western resident who spoke and was one of many Western residents that I would hear from after every weekend about just the terror they felt about not being able to safely cross the street, ride their bikes with their families in bike lanes on our streets because of this reckless driving and weaving in and out and just'",
        "'speaker_1': 'disregard for for the the public safety of our residents and our visitors. And so when we're talking about these gatherings of autos, for the most part, they're just gatherings of autos. Somebody may be setting up as a vendor selling food and drink, which I think is probably illegal and unpermitted, but they're not paying any revenue back to'",
        "'speaker_1': 'the city. But what they're leaving behind, and we heard it described is the litter is, the human waste is and then all of the particulate matter that all of these cars are spewing into the atmosphere at a time when we as an island are struggling to get greenhouse gas emissions that contribute to climate change and sea level'",
        "'speaker_1': 'rise under control. So I don't see and the other disadvantages are that increased traffic, the speeding that impacts public safety, as I mentioned, risks to pedestrians, bicyclists and and then there's the interference with the businesses that are out there.'",
        "'speaker_1': 'And we have heard from the owners of urban legends of Dash Cellars that they're I mean, after all they went through with the pandemic and having to close down and now their visitors sometimes can't even get to them when things are open again.'",
        "'speaker_1': 'So and as far as the Hornet, you know, I've been to many events on the Hornet. I had the honor of presiding over a naturalization ceremony for 50 new citizens just before the 4th of July this year. I've gone out on the flight deck.'",
        "'speaker_1': 'It was wonderful. There's a lot of history throughout that vessel, but I really struggle to see the connection to the USS Hornet, this World War Two era ship aircraft carrier, with permitting auto related events of up to 1000 autos at the Hornet Museum.'",
        "'speaker_1': 'I don't see the connection, and I also think it's sending the wrong message that to the greater public in the Bay Area that, oh, this Alameda point out there, that's a great place for lots of wide open space.'",
        "'speaker_1': 'Come on out. And you can just do all kinds of things because it's it's pretty much the Wild West. They just, you know, it's it's you can do what you want. And that's the sort of message we're sending.'",
        "'speaker_1': 'I want to support the Hornet. I think there's ways we can do it, but I don't want to do it with allowing them to have events with up to 1000 autos, because those autos are coming down our city streets and sometimes driving too fast and just causing the traffic for our residents and any way I want to'",
        "'speaker_1': '. So what I would like to do is we can work to help the Hornet Museum. It's you know, it should be able to be marketed in a lot of different ways, but not as a car venue. So. I am very much supportive of what staff has recommended the both the restricting or eliminating use permits.'",
        "'speaker_1': 'I would eliminate them authorizing large scale automobile oriented events and to minimize noise, speeding and emission risks associated with these advance implement barrier. Option two that sounds reasonable to me. And also implement the West Hornet fence option, but also to work with the Hornet Museum when they're having events on the Hornet to make sure that they're there'",
        "'speaker_1': '. Visitors have good places, options for parking. So I and I guess the fourth one is to leave the wheel stops that were placed where they are. But I think that it's time to listen to our residents and to our businesses out there who are being impacted.'",
        "'speaker_1': 'I think that we still have options for people who want to enjoy the shoreline, but we can do it in a safe in much more environmentally friendly manner. So is anyone ready to make a motion? Councilmember decide?'",
        "'speaker_2': 'Yes. I'd like to move. Staff's recommendation. The one addition that I'd like to ask, and I don't think it's a substantive addition, but that staff as this as a situation warrants consider a speed bumps along that one path as the situation warrants the one path towards you know, the areas where Councilmember Harris Spencer took pictures.'",
        "'speaker_2': 'So and I'm not requiring it. I'm just saying that as the situation warrants. So but other than that, a moving staff recommendation.'",
        "'speaker_1': 'Okay, Councilman Ashley. Thank you, Councilmember. Not sorry. I think I saw your hand go to.'",
        "'speaker_2': 'Well, I will second that the motion ma'am asked for a clarification from councilmember decide which is a recommendation everyone says restrict or eliminate use use permits authorizing large scale automobile or car events. I would be very okay with eliminating use permits with the exception of maintaining the historic the existing contract we have with the Hornet.'",
        "'speaker_2': 'But that allows them to maintain certain of a certain number of events.'",
        "'speaker_1': 'Okay. So Councilmember. That's right. Are you okay with. With that addition.'",
        "'speaker_2': 'Yeah. I want everyone to find out. Councilmember Desai.'",
        "'speaker_1': 'I meant Cosmo Design. Did I say dockside?'",
        "'speaker_2': 'I'm okay. We had a discussion. Just. Just as long as I can ask this clarifying question. That wouldn't affect antiques by the bay, though. That. Correct. Okay. All right. I just. Yeah. Okay, good. Okay.'",
        "'speaker_1': 'To both the maker and second of the motion, I have a request. I personally think that a permit that allows up to 1000 vehicles is too many, and I would want to see that number reduced.'",
        "'speaker_2': 'That sounds fair. I refuse to let.'",
        "'speaker_1': 'Councilmember Knox wait.'",
        "'speaker_2': 'You know, I mean, we haven't actually seen that that the Hornets issue is the issue is the issue. And I just I do worry that we we will continue to bump up against this issue with the Hornets, where they are constantly looking for ways to keep themselves solid.'",
        "'speaker_2': 'And so this isn't where the problem's coming from. I personally, I would rather just kind of address that if it becomes an issue in the future where we're taking some pretty major steps as it is. I mean, I know if that's the only way to get the three votes, the ninth, and yeah, I would be happy to'",
        "'speaker_2': '. For me, I don't I don't see the need to limit that. If staff is working with the Hornets to improve appropriate order we're in, it shows that they're somatic and not, you know, just sideshows. You know, I.'",
        "'speaker_1': 'Okay. I will just add that I think the impact of a thousand vehicles, even if they're not sideshows, is significant. Councilor Everyday said you had your hand up.'",
        "'speaker_2': 'I just wanted to get staff's comments or observations on mayor as he Ashcraft thoughts.'",
        "'speaker_1': 'Thank you, Mr. Thomas. You know, I just I just.'",
        "'speaker_2': 'Thought it'd be helpful to clarify the current use permit for the U.S.. HORN It allows up to four car oriented events per year and limits those to 75 military and or antique cars 50 years or older. Oh.'",
        "'speaker_1': 'Okay. Where do they get the.'",
        "'speaker_2': 'Now what? They have to get special event permits for events where they think a thousand people or more might be attending. So the way they work, the way they use permit is set up for the Hornet, is that we we treat them as a museum and an event space.'",
        "'speaker_2': 'So basically, if you're having events, you can have events. If you think you're having more than a thousand people show up, then we need you to apply for a special event permit just so we can warn police and public works and everyone else.'",
        "'speaker_2': 'And then we put this additional limitation. If that special event is for a car show, you can only have four of them and you can. It has to be limited to those criteria I mentioned.'",
        "'speaker_1': 'Thank you for that clarification. I did not pick that up from the staff report. I just thought there's, you know, for more than 1000, it would require special events. Okay. I'm okay then with book promotion, the second is okay.'",
        "'speaker_1': 'All right. Thank you. We've had a motion. We've had a second councilmember Herb Spencer. I saw your hand up.'",
        "'speaker_0': 'Thank you, Mayor. I was going to ask for clarification, but I will not be supporting this. I think it's unfortunate that we're being I think doing overreach and not doing more what other cities are doing to actually slow down the problem.'",
        "'speaker_0': 'And I want to make it really clear we have a right to park our car and talk to other people. I'm very concerned about trying to eliminate what has been referred to as congregating. And I'm going to add that many times.'",
        "'speaker_0': 'It is people of color that come to these. Places, too. And honestly, they're not they're talking to each other and whatnot. So I think it's unfortunate.'",
        "'speaker_1': 'Thank you. I can't help it.'",
        "'speaker_2': 'So is it just a clear clarification? My understanding of option two is that people can still drive down the road to the tail end where where Councilmember Harris took pictures and fish. That's my understanding of option do.'",
        "'speaker_1': 'Nick Smith Director Smith.'",
        "'speaker_0': 'That's correct. And I did want to clarify, when I used the term congregate, I was talking about the large number of vehicles, not the access of the shoreline by individuals, but the large unpermitted events was when I used the term congregate.'",
        "'speaker_1': 'Okay. Thank you. Cause we're not quite.'",
        "'speaker_2': 'Sorry. And just for. For folks. What? I mean, you know, there is no prohibition against competition, and we have 840 acres of places people can park their cars next to each other, congregate, communicate, etc.. We're just trying to address some large areas that have attracted huge and illegal sideshows that have caused significant problems.'",
        "'speaker_2': 'But I don't want people to walk away thinking that we're somehow keeping people from parking, driving at this point or whatever else.'",
        "'speaker_1': 'Thank you for that clarification to. All right. We have a motion. We have a second. Any further discussion since then? Madam Clerk, may we have a roll call vote, please? It's interpretation.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'Her, Spencer. No, not quite. Avella by Mayor Ashcraft, I That carries 4 to 1.'",
        "'speaker_1': 'All right. Thank you, counsel, for all your valuable input and thank you so much to staff all of you for the work that went into putting this together. And I know our residents and especially our Western residents are grateful.'"
    ],
    "City Facilities and Street Naming Policy Adoption.": [
        "'speaker_1': 'So thank you so much. Okay. With that, we wrap up item seven B and we move on to item seven C, Madam Clerk.'",
        "'speaker_0': 'Recommendation to adopt the city facilities and street naming policy.'",
        "'speaker_1': 'And we have had we have on deck and we have our.'",
        "'speaker_0': 'Recreation and parks director joining us for a presentation. So we will get her in and start the presentation here now.'",
        "'speaker_1': 'Welcome, Director Amy Walter.'",
        "'speaker_0': 'It's good evening, I believe City Clerk We have a city planner.'",
        "'speaker_1': 'Yep. There he is.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'All right. The gang's all here.'",
        "'speaker_0': 'Exactly. Good evening, Mayor and Council City Clerk. If you could please put the. Presentation up.'",
        "'speaker_1': 'While she's doing that. Director Wooldridge knows I was the recreation parks director at Trails and Day Camp and other parks and we used to do they still sing Hail, Hail the gang's all here when they arrive.'",
        "'speaker_0': 'At trails in.'",
        "'speaker_1': 'Like I could lead that another time. Okay.'",
        "'speaker_0': 'That could be fun.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'So as we've discussed before, the names of our public spaces really are meaningful and powerful for our community and every community. And as we've seen through the chain, your park renaming process really can be a mechanism for for deep dialog within our community about the impact of names and anti-racism equity and inclusion.'",
        "'speaker_0': 'And it's really an opportunity to reflect our community's values. So some background. After the renaming of Titanium Park in February 2021, the City Council provided high level input and direction for an updated city facility and street naming policy.'",
        "'speaker_0': 'And in September we we took a draft policy to several boards the Historical Advisory Board, Planning Board and Recreation and Parks Commission, specifically the Historical Advisory Board. Their comments were a recommendation was to include non property owners, an application for renaming streets which we'll talk to more about later.'",
        "'speaker_0': 'And some of the planning board's comments were to consider waiting more than three years, which is the existing policy to name after deceased individual. And they felt that residents of a street naming or renaming or most impacted and needed to be given more weight than general community members.'",
        "'speaker_0': 'And there was also some other comments that they included that were in the staff report regarding number of signatures for renaming. And we'll get to that more in a minute. In regards to our current facility naming policy, that existing policy is quite old at this point was 2006 and only has had one minor update since then to'",
        "'speaker_0': 'include an option for corporate naming. And really, it's a very basic process with no additional requirements for public input on names other or noticing other than our standard Sunshine Ordinance and Brownout compliance. The current policy also has very minimal information and direction on renaming facilities.'",
        "'speaker_0': 'So what has not changed? What you have before you with this draft policy and what what is is the same in it? I'm sorry. Could you go one more forward, please?'",
        "'speaker_2': 'Actually one more.'",
        "'speaker_0': 'Thank you. What has not changed is that the planning board will continue to review street names from developers for new streets as part of subdivision plans. We kept the requirement that a person be deceased for at least three years to be considered.'",
        "'speaker_0': 'We kept the corporate naming criteria in the policy and that Alameda Point Street will still reflect World War Two. Naval seems to be consistent with the area's historical designation. Next slide, please. What has changed with this draft policy before you is it really has a focus and really baked in the criteria of values of inclusivity, inclusivity and'",
        "'speaker_0': 'diversity that names really specifically states that names should intentionally broaden the representation of people in the native community. The current policy has a focus. It requires names, have local, all need a significant significance. And we kept that. But we brought in it to allow for names that may also reflect California or national significance where appropriate.'",
        "'speaker_0': 'Also, historical advisory boards role has been adjusted from. From the keeper of an overall approved nameless to now only recommending names for historic properties. We also, as I'll get into in a minute, have a much more in-depth four step public process with with boards and commission and city council for a significant amount of public input.'",
        "'speaker_0': 'We also created a more definitive process for renaming facilities and streets and it now that process now starts with city council to determine whether facility or street will be renamed. The current policy starts that process on the board and commission level.'",
        "'speaker_0': 'Next slide, please. So the process that's being forced, the process that's being proposed is, as I mentioned, for public meetings. It's written in the policy that the staff is to really do extensive outreach at each of these steps.'",
        "'speaker_0': 'So to really go above and beyond the existing Sunshine Ordinance and really post on social media through email newspapers, really get the word out in the community that and be very intentional about the messaging that this conversation is happening so that people have an opportunity to to provide their input and make sure that that their representations felt'",
        "'speaker_0': 'and they felt heard. So the first meeting, which would be at a Border Commission level, would be a presentation on the facility and confirm the naming criteria. So using Chicano Park as an example, we talked about the history of the park.'",
        "'speaker_0': 'We talked about how the park was named and the group identified what the naming what the criteria was for the new name. And this would be the process for both new and renaming facilities. So for example, right now we have two new parks that are being built by developers at Alameda Point, our main landing spot that both'",
        "'speaker_0': 'need new names. And so this will be an opportunity to follow this process and determine what's the criteria we want for each of those parks, for those names. Then the second meeting would be to review a full list of names.'",
        "'speaker_0': 'I'm sorry, let me back up. After that first meeting would be significant public outreach to solicit name ideas and then those name ideas, along with any existing list of facility names, would be brought before the board or commission with a shorter list recommended by staff that meets the criteria that was identified in the first meeting that Border'",
        "'speaker_0': 'Commission. At that meeting within narrow it down to a short list of possible names, maybe 5 to 10 names. And then again, that would be pushed out to the community to to solicit feedback on that short list of names.'",
        "'speaker_0': 'And at the third meeting, the OR commission would recommend their final name choice to the city council. And that at that point is where staff should be bringing forward to the board to commission any research or consultation with any affected group.'",
        "'speaker_0': 'So, for example, sitting in a park, we met with the local Indigenous tribes regarding the names that were on the list, also researching any names of individuals so that we know the background of that person for the names that are being presented.'",
        "'speaker_0': 'So then at the fourth public meeting, city council will determine that final facility needs. In regards to renaming a facility. There is more of a process outline now. It's an application process that is initiated by the community. And that application would include the reason for renaming.'",
        "'speaker_0': 'Any supporting documents, letters, historical research, and also a petition signed by Alameda residents with a minimum of 500 signatures and four streets. Because those are more complicated as it impacts all of the residents who live or rent on the street or have a business on the street.'",
        "'speaker_0': 'We what we did is put in there a petition of 50% of of owners plus one of owners on the street or 500 signatures. I want to point out here, too, that in regards to City Street naming, we we there was discussion at the last council meeting regarding including renters, and there was a lot of discussion on'",
        "'speaker_0': 'the staff level on how we could we could do this and make it work. And so I want to clarify, too, that really the step is a is intended to be the start of the conversation. And as you heard me talk about in all that four step public process, that actually really is five steps, because the very'",
        "'speaker_0': 'first step is coming to city council determine whether or not that facility is to be renamed. So the renaming process, it's actually a five step process. And so it really is intended to start the conversation. And what staff would do, particularly with a street, is if this application comes in and the and and the staff with then'",
        "'speaker_0': 'notice can very easily notice both people who are tenants and who are owners on the affected street to let them know the conversation is happening at the city council meeting about whether or not that street should be renamed because it will be a public hearing.'",
        "'speaker_0': 'So then it will go to city council, as I mentioned, to determine whether or not to be renamed. And if the answer is yes, then it would go back down to the appropriate board or commission and follow those same four step process as I previously outlined.'",
        "'speaker_0': 'And with that, that concludes my reports. Both Mr. Ty and I are here for any questions.'",
        "'speaker_1': 'Another perfectly timed staff report with 47 seconds to go. Very impressive. So, Counsel, at this time I'll entertain clarifying questions for Ms. Wooldridge. Councilmember. I guess I want to go first.'",
        "'speaker_2': 'Quick clarifying question on the last slide for meeting number one where it says confirming criteria. Is the Council involved in terms of what the criteria is at that meeting?'",
        "'speaker_0': 'No, the as as written, the council is not involved in determining the criteria. The council determines if it's a new facility, it starts at the Border Commission level and makes its way through with council being the final deciding vote.'",
        "'speaker_0': 'If it's a renaming, it starts at the council level with a yes or no to rename, and then the criteria is determined at the Border Commission level.'",
        "'speaker_1': 'Head count murders are.'",
        "'speaker_2': 'At on renaming only now. So on renaming only. So it starts at the councils to say yes or no. We're going to rename. But there's nothing to stop a council member from expressing what she or he hopes to be a criteria.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Absolutely. It could be included in the motion. Absolutely. That would be an option.'",
        "'speaker_1': 'Okay. Is that all for you? At this time. Okay, Kels. Calcium monoxide. Did I see your hand up? Yeah. Your physical.'",
        "'speaker_2': 'Hand. Sorry. So just a quick question. There's a recommendation to maintain the list of potential names for use, but not to use that list. Can you explain the the rationale between having the list that is has no use?'",
        "'speaker_2': 'Sorry, that sounded worse than it was intended, but I'm trying to figure out what the what the what is the list for if it's not going to be used where.'",
        "'speaker_0': 'Where I'm trying to figure out where in the policy you're referencing a list that's maintained there was.'",
        "'speaker_2': 'Sorry. Well, there are other questions. Let me let me let me find it. I thought it was in the staff report. It was it was definitely a recommendation of the AP. And I thought that it was so so that.'",
        "'speaker_0': 'So that it may be the HB won't hold a list anymore. That's that's clearly not in the new policy. The I'll give you an example of the Recreation Parks Commission through this process is has expressed an interest and there's been a lot of work put into to what's now a three or four page list of names through'",
        "'speaker_0': 'the community process annual park. And they didn't want to just throw that in the trash. But next time there's a park to be named, go out to the community, find out, say, here's the park renaming, get in ideas and add to that list and see when the criteria is determined.'",
        "'speaker_0': 'See if anything on either what we already have or what's brought up in that process. What's the short list that that fits that criteria? Hopefully, that answers your question.'",
        "'speaker_2': 'Thank you. You're welcome. Did you.'",
        "'speaker_0': 'Find.'",
        "'speaker_1': 'It? No.'",
        "'speaker_2': 'I'm going to look. It's possible. I just confused myself. I apologize if that's the case.'",
        "'speaker_0': 'I think it may just have been in the staff report as that was the intention to not just throw out any previous community work that's been done, but to be more additive.'",
        "'speaker_1': 'I will just note that at the top of page two in the staff report under the Historic Advisory Board, the first bullet is keep the names list for future reference only. Was that what you're thinking?'",
        "'speaker_2': 'I think it may be that plus require this list lists, but I think it's the list that their coverage is mentioning are also mentioned. I think I may have completed the two as I as I was reading it.'",
        "'speaker_2': 'So my apologies. Okay.'",
        "'speaker_1': 'So thanks for that clarification, Kels. Over her, Spencer.'",
        "'speaker_0': 'Thank you, Mayor. I'm looking at the proposed draft policy on page four. Item number seven says that if a street's named after some business is my understanding of the business leaders and the new property owner. It says all costs associated with renaming such a street shall be borne by the new property owner record, including payment of all'",
        "'speaker_0': 'appropriate processing fees under the master fee resolution. So if I understand that correctly, we have a business. They come to the city, they want the street named after them. Then they leave and the new property owner is responsible for the fees to remove this businesses name on a street when the business is gone.'",
        "'speaker_1': 'Yeah. This was Richard. You want to address that? And can I just get. Can you help us? Where exactly are you? Councilor Herr Spencer, this is one of the exhibits.'",
        "'speaker_0': 'At the draft city facilities and street name policy. It's exhibit.'",
        "'speaker_1': 'One. Exhibit one. Okay. And page four, you said.'",
        "'speaker_0': 'And it's item number seven for Broad Street naming criteria. So I'm going to ask Mr. Taylor.'",
        "'speaker_2': 'Yeah. Good evening, mayors, members of the city council, L.A. City Planner, Planning Building, Transportation Department. So so that's a set of corporate street naming criteria isn't being modified and we're basically importing it. But that is existing policy and that was adopted by previous city council.'",
        "'speaker_2': 'And the again, the idea is, yes, if a business were to if it were to be named after business, if that entity leaves, then a new business or a property owner would be responsible for renaming that street.'",
        "'speaker_1': 'Okay. Go ahead, girls. Harassment. Yeah.'",
        "'speaker_0': 'Thank you. So I think counsel should look at what to do with that at some point. Just. Just clarifying questions. I'll speak to that more later. I also want to speak to any public outreach. Will those meetings be noticed so that the members of the council and the public can attend or there's going to be, you know'",
        "'speaker_0': ', confidential meetings for a select few? I know, but is that all? All four of the four steps are all at the board and commission level. So they're all required to be noticed for the the Sunshine Ordinance and ground.'",
        "'speaker_0': 'Okay. And then finally, my last question is in regards to renaming of a street name, you could have people that live on the street, I think want to keep the name, but you could have 500 electronic signatures. How does the city, first of all, know that those are, in fact, residents of the city and not just someone'",
        "'speaker_0': 'that says that they're Alameda? Is it all ages? So one family could have six members and then so and you know, what does that really look like? It's a great question. And there was a lot of discussion on the staff about that very issue.'",
        "'speaker_0': 'We really don't have a way to to verify, which is why I really wanted to emphasize, especially in regards to tenants and, you know, and and versus owners. So that's why we really wanted to emphasize that, that we would do a lot of public outreach to ensure that people on the street know that there's a public hearing'",
        "'speaker_0': 'at the city council meeting about the name of their street so that they can come make their voices heard. And I'm sorry.'",
        "'speaker_1': 'Continue. Yes.'",
        "'speaker_0': 'The attendant costs. Right. So you have a homeowner, then they have to actually have legal documents changed, as my understanding, to reflect the current name of their street. There can be costs involved and then those would be borne by the residents.'",
        "'speaker_0': 'Does the city assist in any of those costs?'",
        "'speaker_2': 'Mr. Ty So so there there would be a fee for the filing, the application. But let's just say once the city council approves of the street naming, then yes, the there would be social costs for in time logistics costs to the residents of that street to have to change their addresses, mailing addresses and work with the post'",
        "'speaker_2': 'office.'",
        "'speaker_1': 'Go ahead, Kelso.'",
        "'speaker_0': 'Thank you. I think actually, legal documents, they have to change the name of their street. Not just the puke, not just a dress.'",
        "'speaker_2': 'Some processes might might involve costs. Yes. And I think that is that is a key consideration to I would I would just add that after the staff report was published, staff did try to reach out to other cities with similar processes.'",
        "'speaker_2': 'I found a city in the southern states, Raleigh, North Carolina, who who has a very similar model. And their advice for the city council is do not underestimate the social costs of changing a street name. And they've experienced it in recent years.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. So at some point, I'd like more information about the costs, including social costs, but also just like on legal documents, what that really looks like.'",
        "'speaker_1': 'Okay. And with that, all the clarifying questions for you at this time. Okay. As a clarifying questions, counsel, I had just a couple. So Ms. Wooldridge on page three of this staff report there is. Oops. Not page three, page two.'",
        "'speaker_1': 'And this is the planning board process. Well, this is when it came to the planning board. And these are their recommendations for strategic changes. Consider increasing the number of signatures. You talked about that to more than 500 residents or apply a tiered system based on number of homes, fresh businesses on that street.'",
        "'speaker_1': 'Or consider allowing two thirds of residents to veto a name change on their street. Can you just tell us what the tiered system refers to? Or I could ask Mr. Tiny Stretch.'",
        "'speaker_0': 'I was at that step in that meeting.'",
        "'speaker_2': 'So the idea is on a relatively short street, 500. I mean, there are streets in Alameda where you may have ten homes. And so the majority would really be just six, six property owners. But on a very long street, 500 might not be proportional to sort of getting a majority.'",
        "'speaker_2': 'And so some part of that discussion really was focused on giving more weight to the residents who lived on the street. And these ideas are just variations of what the city with the city council might want to establish as a threshold to start the conversation.'",
        "'speaker_2': 'Start the question.'",
        "'speaker_1': 'Got it.'",
        "'speaker_0': 'Okay. The renaming.'",
        "'speaker_1': 'Right? That that's helpful. Thank you. So then under under the. So I on page three the these are the proposed changes and so the. The Last Bullet says creates an application process for renaming facilities and streets and requires that the city council first approve whether a facility or street will or will not be renamed.'",
        "'speaker_1': 'Are there criteria for that or is it just subjective or the staff will bring a report forward to us? How how will that work?'",
        "'speaker_0': 'So we did not create criteria in this policy for whether or not a facility will be renamed. Really, what staff will do is take the information from the application process and any other due diligence that we have done and bring that to City Council to make an informed decision.'",
        "'speaker_0': 'It might be different for for any given particular name.'",
        "'speaker_1': 'Okay. Thank you. Okay. And I would imagine that would be the case of kind of on a case by case basis. And then finally, there is on the top of page four, there is a draft policy and procedures for naming city facilities.'",
        "'speaker_1': 'And under that first paragraph, last sentence. The intent and the intent of broad outreach and notification is to involve a more diverse group of stakeholders in the community, including residents who are historically underrepresented in city public discussions. Who do you envision those residents to be?'",
        "'speaker_2': 'I think is.'",
        "'speaker_0': 'For example, as we've seen with Zoom, more people are attending council meetings because they have better access to council meetings and can't necessarily drive to city hall to sit at 7:00 until midnight. So I think it could be there's many underrepresented folks.'",
        "'speaker_0': 'It could be people of color, it could be our disadvantaged residents, lower income, it could be youth. I think there's a number of people. The intent of that that sentence was really that there's a lot of people that either don't know how or choose not to get involved in the city, the bureaucracy of city, public discussions.'",
        "'speaker_0': 'And so I think there's a lot of outreach that we can do and and more we can learn about doing outreach to to, you know, get this information out to them so they can actively engage in something as important as a park or facility or street renaming.'",
        "'speaker_1': 'I appreciate that. Thank you. I think we've learned a lot during the pandemic about how people get their information, some in venues like this, but not all. So I appreciate that. Okay. Those are all microphone questions. Anything from anybody else?'",
        "'speaker_1': 'I'm guessing we have public speakers that see any hints from the council for clarifying questions. So, Madam Clerk, do we have public speakers on this item?'",
        "'speaker_0': 'We have one. One.'",
        "'speaker_1': 'Okay, we have our two.'",
        "'speaker_0': 'Josh Geier.'",
        "'speaker_1': 'Good evening, Speaker Geier.'",
        "'speaker_2': 'Good evening, Mayor Ashcraft and vice mayor and council members. So I wrote in a letter expressing my my feelings about this item, and I'm just going to elaborate a little bit on that. So first I think the work of Director Wooldridge and her team is fantastic and is is to be commended and both, both at this in'",
        "'speaker_2': 'the previous work on renaming Jackson Park. I wanted to I'm very I wanted to say something about the expense question. My view is that we should subsidize this social cost period. Renaming Jackson Park wasn't the right move because it was relatively inexpensive.'",
        "'speaker_2': 'It was the right move because it was a moral imperative that we all have recognized. Now we're participating in the Simi Land tax now, because there's a sense that to be kind of consistent between our actions and beliefs.'",
        "'speaker_2': 'The next step, after acknowledging the role of colonialism and white supremacy, is taking substantive steps to start to material repair, materially repair the harm that those phenomena have done to people in our community. We we understand now that that the question about about whether we should stop perpetuating these white supremacists, stop honoring people with figures like Jackson'",
        "'speaker_2': '. Calhoun It's not a fringe issue. It's not a boutique concern. I think at this point it's clear that our decision between tacit acceptance or active rejection of the legacy of white supremacy and colonialism and our community is fundamental to our collective conscience and our identity as a diverse, inclusive community on the right side of history.'",
        "'speaker_2': 'I would just add that that as I wrote in my letter, the renaming of Street is the the circle of concern goes beyond the residents of the street. It's a concern to all of us in the community. And I think it goes the other way.'",
        "'speaker_2': 'If a if an action that we take collectively as a community has has individual implications for people who just happen to live on that street, we need to make them whole. Thank you for your time.'",
        "'speaker_1': 'Thank you. Our next speaker.'",
        "'speaker_0': 'Herman Reid.'",
        "'speaker_1': 'Good evening, Speaker Reid.'",
        "'speaker_0': 'Good evening. And and thank you for the opportunity to make this comment. In considering the Street renaming process, I'd just like to piggyback on Mr. Geiger's concerns also, and I would recommend that the city include a financial outlook plan as part of the consideration so that the homeowners would understand the financial impact that they may incur.'",
        "'speaker_0': 'And furthermore, perhaps the city should consider offering support if the cost would be more than nominal. Thank you.'",
        "'speaker_1': 'Thank you. And our next speaker is Garfinkel. Good evening. Speaker Garfinkel.'",
        "'speaker_2': 'Good evening again. In recent years, we've been increasingly been bombarded by, I guess, progressives who feel entitled to impose their sense of moral imperatives and justice on everybody else. I think that, as the last speaker said, this is an issue for the entire city, in which case name changes should be put on the ballot.'",
        "'speaker_2': 'There's nothing urgent on changing. Names have been in existence for 50 or 100 or 150 years. Put them on the ballot and get an eye or a name vote. I realize that the those who know what's right for the rest of us won't be happy with that.'",
        "'speaker_2': 'But I think that would be a more equitable way to approach this, since there are some 70,000 residents of the city. I don't see why a handful of of ideologues should be calling the shots. Thank you.'",
        "'speaker_1': 'Thank you. And our next speaker.'",
        "'speaker_0': 'Drew Dara Abrams.'",
        "'speaker_1': 'Good evening, Speaker Dara Abrams.'",
        "'speaker_2': 'Hi. Good evening, mayor, vice mayor and council members. My name is Drew Dara Abrams, and I'm calling in from our house on Calhoun Street tonight. I got a chance to share a lot of extended thoughts by email, so I won't belabor it too more, but just want to share the very, very high thoughts at a very high'",
        "'speaker_2': 'level that we're talking about of a pretty finite list of street names, park names here in the city that I my neighbors on Calhoun Street and other folks that I've met around town since we moved here in 2019 have concerns about now know one of the planning board meetings the that hypothetical about what if you rename a'",
        "'speaker_2': 'long street came up about Central Avenue and now I think it's just more useful to ground this in the specifics. I heard Calhoun Street where I've been meeting my neighbors and meeting much longer term folks who've lived here for many years who have their concerns about the street name.'",
        "'speaker_2': 'We have Jackson Street that raises some of the same concerns as Andrew Jackson Park and Godfrey Park as well. So three places. And so I, I think it's very useful to think in these finite terms because it makes the questions more tractable.'",
        "'speaker_2': 'You know, the questions about cost and effort, is this worth all of our time? It's a symbolic move. It's not the most important move we all could be making, but it's still important when we think in these very finite terms, I think it becomes much more possible to get creative.'",
        "'speaker_2': 'And that's what worked about the park renaming process. It culminated in a great event. It brought a lot of people who wouldn't have otherwise been involved in the process, as Director Wooldridge was saying, into the life of the city.'",
        "'speaker_2': 'So I'd just like to encourage all of you to adopt this process, to make it possible to, in the abstract conduct renaming on an ongoing basis, but then to really focus on making possible three of the potential renaming that have really brought together community members over the past years and move them forward.'",
        "'speaker_2': 'Very concrete, very finite, and use those as opportunities to address any and all concerns that come up and make them as positive and welcoming as experiences as that. You train park renaming process. Thank you.'",
        "'speaker_1': 'Thank you for your comments. Our next speaker, Madam Clerk.'",
        "'speaker_0': 'Megan Larson.'",
        "'speaker_1': 'Good evening, Speaker Larsen. Hi there.'",
        "'speaker_0': 'Thank you for your time. I appreciate it. I just wanted to follow up on the last comment that was made. I think that there's a difference of living in the town for two years versus there is a woman that I meet with every Wednesday who through friendly visitors from Meals on Wheels who has lived on Jackson Street'",
        "'speaker_0': 'now for over 50 years. So a transition and a name change for somebody like her, where it's in her will. It's in all of her legal documents. It's on her driver's license. It's on her mail, of course. But there are all of these documents where at 87 years old, trying to make a pivot into making all of'",
        "'speaker_0': 'those changes is is quite a tax on an individual, especially if they don't have the Internet. And so for me, I have major concerns for her. And I know that this is a big concern for her as well because of the change in the park.'",
        "'speaker_0': 'She knows that then it's a kind of a domino effect just because it's the same street name, in a sense. I can understand Park's park makes sense because people aren't necessarily tied to a park with their own personal address.'",
        "'speaker_0': 'But when it comes to streets and renaming a street, it does pay a large toll on that individual. Again, for somebody that's only been here for a short period of time, I imagine that's easy because you have recently just changed your driver's license to that current address.'",
        "'speaker_0': 'But for those who have been on the island for extended periods of time where their livelihoods are connected to that address, it's a big deal. And so that would be my concern there. Thank you for listening.'",
        "'speaker_1': 'Thank you for your comment. Our next speaker, Madam Clerk.'",
        "'speaker_0': 'That was our final speaker.'",
        "'speaker_1': 'Okay. So with that, we will close have a comment on item seven C and we will bring it back to the Council for discussion. Who wants to lead by mayor to you? I never know if this is an opportune time that we didn't hear too much for you before.'",
        "'speaker_0': 'I think that we've we've spent a lot of time the past few years discussing the naming and renaming processes, and we are trying to balance access as well as staff is trying to make sure that we and one of the issues that really hasn't come up is just that there was you know, we were essentially creating a'",
        "'speaker_0': 'large process just to get street names on a list and then not having enough names. I mean, these were part of the conversations that we had early on in that it was there was a lot of bureaucratic process involved that was unnecessary and also very cumbersome.'",
        "'speaker_0': 'And so I think we're trying to balance that with also having a process that's accessible. And I think I've learned a lot in my time on council as well as my time on the have discussing names, the amount of time and energy that has been spent by staff as well as our volunteers, many volunteers and council members'",
        "'speaker_0': 'has been you know, we spent a lot of time discussing it. So there's been a lot of effort put into this. And I think that there's, you know, feel comfortable with the process that Mr. Eldridge laid out. I think that there was a lot of input into that.'",
        "'speaker_0': 'I do think that. You know, and I hear the concerns about the different expenses of renaming expenses related to renaming. But that's why we need we need to have a public process and allow for input, which is, I think, what we're trying to do with what's been proposed.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Mary Kay. Councilwoman. That's why.'",
        "'speaker_2': 'Thank you for. For me, I. We're not you know, I think Vice Mayor Vella said it. Said it. Well, we're not creating a new opportunity to rename streets. We're clarifying a process that our it's something we can we can rename streets today.'",
        "'speaker_2': 'We could have renamed streets last year. We're not deciding whether or not to rename streets. And we were deciding how we're going to make sure that there is the people are plugged in on that. For me, I think I have three bullets, but one of them was very wrong.'",
        "'speaker_2': 'I would like to suggest the one thing that jumps out at me on the on the street renaming is that it's about property owners instead of residents. And in a town of 52% renters, I think renters voices are just as important as the people who live out of town, which we know a majority of, but a majority'",
        "'speaker_2': 'of our rental units are owned by people who do not live in Alameda. So if we want to have local input and make sure that we're getting that input, it should be residents, not property owners, who are the measure for supporting what's happening within their community.'",
        "'speaker_2': 'And I would like to I would like to see that change in the policy. Similarly, I just whenever we start talking about corporate naming public things, I think if, you know, if we were going to have a corporate naming policy, I appreciate that it's only for streets that only the corporation that's asking for the renaming accesses and'",
        "'speaker_2': 'whatnot, but then essentially becoming a private road with their name on it. And I think they should also, if they're to, we're going to change the name of the street. They should pay for the maintenance of that street as well.'",
        "'speaker_2': 'While it's while it has their name on it, I don't see why it becomes the city's business to start branding public public streets that we're paying for with people's corporate names. I think we can deal with it when it comes to it.'",
        "'speaker_2': 'I also think there is an issue if that if a business name is named after a person, are we going to put a person's name on a street where by they may be the name of the corporation, but they also may as again, there are many corporations out there where people are supportive of the corporation, but the'",
        "'speaker_2': 'individuals behind the corporation may not be people they want to name streets after. And I think it does get a little complicated. So I think making sure that there's some space for wiggle room in that discussion will be important.'",
        "'speaker_2': 'But beyond that, I really I think that this is a great policy. I will concur with Vice Mayor Miller's congratulations on on the work that was done. I think that this really carries forward a lot of the comments and discussions that we've had here at the council, as well as our boards and commissions.'",
        "'speaker_2': 'And I really think staff there are two we have received there are already two requests for naming that have come forward, that have met, I believe the criteria that was set. And there is a recommendation in here in the order alternatives to give direction to form an ad hoc committee to talk about street names.'",
        "'speaker_2': 'It's something we've talked about a couple of times. The last time we the last two or three times we've talked about renaming. And I would hope that council could give that direction to at least move those to which would be Godfrey Park and Calhoun Street, forward to some form of committee or through this process, I believe, to'",
        "'speaker_2': 'staff on how they wanted to bring it back. You know, I think the time is now. You know, the Jackson Park venue was sitting around for two and a half years until George Floyd was killed and there was interest all of a sudden to take action.'",
        "'speaker_2': 'And I think, you know, we don't we shouldn't have to wait for those type of momentous community uproars to take on some of these issues. We have some some some things that should at least be considered whether or not they should be renamed.'",
        "'speaker_2': 'And Godfrey and Calhoun are two very good examples that our community has stood up and said by the hundreds they would like us to consider. And so after we adopt the new policy, I hope that we can also give direction to bring those back forward for a conversation about how or where the vision for.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Who wants to go next? Counsel for her is Spencer.'",
        "'speaker_0': 'Thank you, Mayor. So I would like us to include residents plus property owners in regards to any collection of 50% plus one. Also, in regards to the corporate name, I agree with member Knox. One of if we're going to have it, be a street name after a corporation and they can maintain it.'",
        "'speaker_0': 'But I also think that they should include enough money so that if they leave that then the new owner should not have to pay to remove the the name of the former company. And then that we had received an email in regards to the proposed policy and maybe it's a current POS is a name could be named'",
        "'speaker_0': 'after someone who's deceased after three years and I would prefer the ten years that came in. One of the emails wait longer than just three years. And then also in regards to figuring out how to reimburse property owners for costs of changing legal documents and whatnot.'",
        "'speaker_0': 'And I think that that actually can and maybe they would submit what are their actual costs. But I think that could actually be expensive. And I and you know, for the social good then I think that it's not that and we've had multiple speakers speak to this and I support that of having letting them submit their actual'",
        "'speaker_0': 'expenses and then be reimbursed somehow for that if they if they are seeking that.'",
        "'speaker_1': 'Thank you. Our offer. You care for her? Special? Yeah. Okay. Castle, over dessert. Anything to add?'",
        "'speaker_2': 'Oh, well, thank you. You know what I am struck by and most appreciative of in the staff report is that when it comes to renaming of streets or facilities, the importance of having city council start that conversation. Because one of the one of the reasons why I voted no on Takano, because I felt that there was only'",
        "'speaker_2': 'one criteria that was that came out that I thought that, well, maybe there's other criteria is the one criteria that came out was, you know, racial diversity. Hey, racial diversity is great. You know, we want we definitely want to do it to to to make our community, you know, even more equal and representative for sure.'",
        "'speaker_2': 'But but maybe there was also other criteria that that that we also want to take a look at when we're kind of figure out, you know, what are the best names. And so, you know, I had no qualms in voting no on Chicano, but I felt that that what the staff has put together and the staff report'",
        "'speaker_2': 'kind of responds to the concerns that I raised. And so for that, I am most appreciative I see in this process one in which ideologues on the far left or ideologues on the far right or even ideologues in the center can't hijack for their own ends.'",
        "'speaker_2': 'That council will be certainly involved from the beginning to the end when it comes to renaming of streets. And for that I am thankful and I am supportive of this. On the question of property owners of renaming streets, I think it's important that we analyze what are the cost implications.'",
        "'speaker_2': 'I mean, because certainly I don't live on a street that whose name might be up for renaming. And, you know, I just want to know, you know, is there going to be am I going to have to bear some cost or anyone else is going to have to bear some costs if we have to change our mortgage'",
        "'speaker_2': 'documents or, you know, all those type of documents. On the other hand, maybe the costs are so low, I don't know. But I think, you know, we do when we are renaming streets that we that the staff should make sure to kind of understand and analyze those kinds of costs.'",
        "'speaker_2': 'But on the whole, though, I appreciate what has been put together. I think it's addressed the concerns that I had from the outset. So I look forward to supporting this.'",
        "'speaker_1': 'Thank you. Killed somebody said so. I will go last and I will echo my colleagues in thanking both Amy Aldridge and Alan Tai for excellent work and laying out this very descriptive process across all these various boards and commissions.'",
        "'speaker_1': 'I, I like everything that was, that was recommended. And you answered my earlier questions with regard to a couple of things that were raised. I think that we need to have a little more information. And I'm speaking specifically about where private companies have a street named after their company.'",
        "'speaker_1': 'I cannot speak to all instances where that happens, but I was involved when a number. It came to us a number of years ago and asked if, you know, if you're familiar with Penumbra, you know that they're spread out over a number of buildings in our horrible business park.'",
        "'speaker_1': 'I believe they're still our largest private employer and they're growing. They're, you know, expanding into more buildings. They're bringing a lot of good revenue into the city. They were in a real dilemma because their different buildings were on different streets.'",
        "'speaker_1': 'And so then when.'",
        "'speaker_2': 'The.'",
        "'speaker_1': 'Postal carrier was delivering mail, there was confusion about where it went. So they came to us and said, would it be possible to have that the building that is the corporate, that the main building where the mail is processed and things like just all the things because they're an international company, but they're headquartered here in Alameda, California'",
        "'speaker_1': '. So they wanted it. Could it have the address one penumbra way and Greg McFadden, the official and I can't quite remember why it was Mr. McFadden, but the two of us spent some time meeting with the postmaster for Alameda and explaining this and and that change was made.'",
        "'speaker_1': 'I don't know that that changed. In order for them to get their mail should then require them to pay for street maintenance. So I just would want staff to look into, you know, why is that done? How? How often is it done and what are the implications?'",
        "'speaker_1': 'But I just think that it might be a bit of a quantum leap to say you have a street named after your business, you now have to maintain the street. So, so just keep that in mind. And then I think a really effective process has been laid out.'",
        "'speaker_1': 'I would like to see that adopted and followed, which is what makes me hesitant to say, you know, Jackson, what is it? Jackson Street and Godfrey Park have been talked about for a while now. Let's just put together an ad hoc committee and make, you know, make those determinations.'",
        "'speaker_1': 'I think we could respect the process. Maybe they could be moved up to the top of the queue. I'm not trying to second guess staff, but that is true. We've been hearing discussions about about those particular names, but I'm not sure this is the time to say just one last time, let's just do an ad hoc committee'",
        "'speaker_1': '. I think this is a really good plan that's been laid out. And the other thing I was going to say.'",
        "'speaker_2': 'Is.'",
        "'speaker_1': 'Slipping my mind. But I forget about someone who's been deceased. I don't think we need to wait ten years to name something after them. I do understand that sometimes the body of a person's work and things in their past might not come to light immediately.'",
        "'speaker_1': 'But three years seems a reasonable time. And I think there's there are some illustrious meetings. I'm not going to share the names now, but that that we should consider and I don't know that we need to wait ten years.'",
        "'speaker_1': 'I very much like what the staff has proposed. So with that with. Yes, Vice Mayor Vella.'",
        "'speaker_0': 'That emerita question threw the chair to Councilmember Knox White. The on this on the street renaming. He had mentioned that he wanted it to be the resident signatories only. So is that getting rid of the option that we have, which is the 50 plus one of the property owners or the 500 residents enjoys?'",
        "'speaker_0': 'Or is it is Councilmember Knox White okay with this? The option.'",
        "'speaker_2': 'I would be I mean, I would be I guess I would be fine with the option I personally. You know, I do think that there is benefit in having the 50% of the street actually concurring. And I think it gets to the concern of people who live on the street who might be impacted by it or at'",
        "'speaker_2': 'least been alert and supportive of the general idea. Right. They're not signing off on what is the name? They're signing off on the. We would be okay with starting a process that considered a new name. But, you know, I mean, if people want to leave the leave it so that it only takes 500 and none of them'",
        "'speaker_2': 'have to live on the street. If that's the.'",
        "'speaker_0': 'Yeah, I was trying to I was just trying to clarify that you're not trying to get rid of the 50 plus one signatories of the property owners. It's on the other side of the 500 Alameda resident signatories. You're asking that a certain percentage of that be actual residents on that street, correct?'",
        "'speaker_2': 'Yeah, I would. I guess what I would say is I think the 50% plus one signatories are are not the owners, but the people who actually live in town and live on the street are that is that for me is the important piece, not somebody who lives in Southern California who, you know, doesn't really may not even'",
        "'speaker_2': 'really know the city at all. Right. Or the corporate. I mean, we have some large corporate landowners that that own, you know, hundreds of units that are going to say that their vote gets basically to be the up or down on this.'",
        "'speaker_2': 'I would rather be talking to them, talking to the residents of the street. I think that the intent is to make sure that the people who live on a street are have an opportunity to say, we don't want to live on a street with this name.'",
        "'speaker_1': 'So may I inject a question? Counteracts weight and vice versa. How do we determine that the online 500 people are Alameda residents? Or anyone who can answer that.'",
        "'speaker_2': 'Well, let's step into that. Yeah. Madam Mayor.'",
        "'speaker_1': 'Please.'",
        "'speaker_2': 'So we did spend a lot of time looking into this particular issue. First of all. Well, our initial approach was thinking about property owners just because we have very good data of property owners in Alameda. We don't have good data on tenants, especially near tenants.'",
        "'speaker_2': 'We just won't have that figure. But then where that sort of discussion led was really. And given the input from the boards and commissions and members of the public, we, we, we added the possibility of you. It could be either 50% plus one of the property owners and residents or at least 500 Alameda resident signatures.'",
        "'speaker_2': 'I would imagine that a petition that's submitted with an application would include a name as well as their address. So but in terms of verification, I don't believe we have very good data to be able to verify that all 500 are actually residents or residents of that street.'",
        "'speaker_2': 'But and that's where we led to the let to the discussion, really, this is a threshold to initiate the conversation. And so when we are scheduling the hearing before the city council to consider the item, that's where we would formally notify the residents and occupants of that street.'",
        "'speaker_1': 'A back to you. Where did you go? Councilmember That's right.'",
        "'speaker_2': 'Yes. So, I mean, I can go I'm not going to die on the Hill if it's 50% of resident property owners or 500 residents, no matter where they live, as long as they're in the city. On the corporate name one I, I still think, you know, I'm sure a number could have a number issue could have been'",
        "'speaker_2': 'addressed by naming the street a different something else as well, if necessary. And I think that this is, you know, at the end of the day, the city can always waive its fees and things like that if it wants in the future.'",
        "'speaker_2': 'This is a I just think we should be careful not to start down a road where corporations can name city streets.'",
        "'speaker_1': 'Councilmember Desai.'",
        "'speaker_2': 'Just to clarify in question on the petition, 500 signatures on a petition, does it have to be on a paper petition? Is it required to be a paper position or is it require or is there no requirement that it could be like, you know, some Internet kind of thing?'",
        "'speaker_0': 'That's right. And there's no requirement that it be paper, electronic or paper.'",
        "'speaker_2': 'Or combination.'",
        "'speaker_1': 'Council member, Harry Spencer.'",
        "'speaker_0': 'Thank you. So I had asked earlier about this 500 electronic signatures. It's my understanding from staff's answer that there is no way for them to verify that they are, in fact, residents of the city of Alameda. So I'm wondering, are you just going to be asking for the name or are you going to ask for at least'",
        "'speaker_0': 'an address within the city so that there could, in fact, be some sort of follow up to confirm that these people live in the city? It does. The policy does stipulate that it should be it needs to be 500 Alameda residents.'",
        "'speaker_0': 'So if a petition is turned in that just has a bunch of names and no address, then certainly it would not be it would be rejected because it doesn't comply with the policy. Thank you. And in regards to the company, if the if the company leaves and then someone else has to pay for this new incoming company'",
        "'speaker_0': 'doesn't want to, of course, fire a company's name on the street. I heard member not try. Maybe the city could waive this. I think that maybe we could also ask for the city could ask for more money up front.'",
        "'speaker_0': 'So that is suing, you know. But as long as they're there, fine, we want to spend it. But whenever they leave, I don't really think it's appropriate to ask the new company to pay to change the street name for a company that's left.'",
        "'speaker_0': 'And as much you know, we have companies of all sizes that come and go.'",
        "'speaker_2': 'Thanks. Councilmember data clarifying question in terms of verifying five 500 signatures, whether it's on a written piece of paper with name and address and signature, or whether it's on the Internet with name and address. Do have we thought through the process by which we will verify the 500?'",
        "'speaker_2': 'Are we going to do all 500 or are you going to? I think in some instances we don't do all 500 like we do a sample. And if the sample comes out, I mean, there's a methodology. I forgot what what it's for.'",
        "'speaker_2': 'But I think our city clerk knows what I'm talking about. So so what's the the process by which the 500 signatures would be verified? TBD.'",
        "'speaker_0': 'Essentially, yes, we don't have a verification method outlined in the policy, but both Mr. Ty and I want it to be clear that that both in terms of staff resources, that this petition is not on the same level of what would be submitted to the city clerk for a, you know, something that would ultimately go to the'",
        "'speaker_0': 'voters. Right. We're not considering it on the same level because it's the start of a conversation in which there would be a five step publicly noticed conversation in which people can make their voices heard.'",
        "'speaker_1': 'Okay. Anything further, Councilmember Knox, like.'",
        "'speaker_2': 'I was going to make a motion, please. I'm going to move approval of the staff recommendation with with one direction and 111 change, which is I would like under that I'm going under the corporate street naming criteria. I don't hear a majority saying they're concerned about it.'",
        "'speaker_2': 'But I do really appreciate that. Councilmember Hirsch, Spencer's idea of collecting funds to pay for future renaming if the company moves. And I think that that is a great idea. I am comfortable with staff writing that after the fact, but just with a caveat that as a part of a corporate renaming, there would need to be a'",
        "'speaker_2': 'fund, there would need to be a fee collected for future renaming of the street if the company were to move off that street so that the city in the in the future business is not stuck with it. The direction would be.'",
        "'speaker_2': 'And while I know the broader ad hoc committee created by recommended by staff was was not collected, I would like to direct staff since we have collected to work with the applicants, the submitters of the two petitions that have over 500 names on them to submit a real ID to to, to begin the process to submit an'",
        "'speaker_2': 'application for council consideration for Godfrey and count as, as those submitted to the city already for consideration. That was your.'",
        "'speaker_1': 'Mother and that was through the process outlined in the step through.'",
        "'speaker_2': 'Third through the process.'",
        "'speaker_1': 'Thank you. Okay. We have a motion to have a second vice mayor of L.A.. Second.'",
        "'speaker_0': 'Second.'",
        "'speaker_1': 'Okay. Any further discussion? Counsel Katherine Harris. Spencer.'",
        "'speaker_0': 'Thank you, Mayor. So I'd like a clarifying question to the maker of the motion in regards to the process. The 500 signatures are plus signatures. As far as I know. They may or may not be Alameda residents. So when you're saying start the process, are you saying that they would have to make sure that, you know, try'",
        "'speaker_0': 'to get 500 residents or can be 500 plus people from wherever?'",
        "'speaker_2': 'I think, yes, they would they would need to, you know, make a best case effort for that. Yes. But again, I do not personally believe that this is we're not going to the voters with this. This is we don't need.'",
        "'speaker_2': 'You know, Director Woolridge calling 500 people to make sure they live in Alameda. I believe I believe at face value of 1000 people have signed a petition and said that they live in Alameda. It's a good chance 500 of them live in Alameda and we can probably just roll.'",
        "'speaker_0': 'And then also in regards to reimbursing for costs of those if it's on the street.'",
        "'speaker_2': 'We will have that conversation. That's not a part of the policy tonight. And I think that that would be part of that conversation when it comes forward and the decision as to whether we want to move forward with it.'",
        "'speaker_1': 'He has cancer every day.'",
        "'speaker_2': 'So while I would rather not have those two things, part of the motion.'",
        "'speaker_1': 'Which two things?'",
        "'speaker_2': 'You know, the Godfrey thing and the whatever the other thing was Jackson's Jackson.'",
        "'speaker_1': 'There's two locations.'",
        "'speaker_2': 'It seems to me, though, that if they turn in 500 names and 450 of them have no address, then they've only turned in 50. So because that's what I heard was that if there was no address, if there was no basis by which.'",
        "'speaker_2': 'So that's their risk. If they're if they if they have a list of 500 names plus and there's no address, then. Okay. So anyways, while I would rather have those two not part of this, I think on balance, I think I'm still able to move forward.'",
        "'speaker_1': 'Great. Thank you. Okay. I'm not seeing any more hands up, am I? Let's take a roll call. Vote, please.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'From member station. Right over here, Spencer. Now.'",
        "'speaker_2': 'Knox, Phi Phi Phi.'",
        "'speaker_0': 'Alpha Phi Mayor. As the Ashcraft.'",
        "'speaker_1': 'High that carries 4 to 1. Thank you. And you know, I want to thank all the public speakers who spoke this evening who sent us letters. Thank you for your input. It is all valuable and thank you again to staff for a great job.'",
        "'speaker_1': 'And I think you've put together a really great process for us to move forward. And you're right, these are very important decisions. All right, counsel, we're a little beyond my zoom rules of a break every 2 hours. But this is a logical stopping point.'",
        "'speaker_1': 'It's 930. We're going to come back at 945 and do our excuse me, last regular agenda item. So I'll see you back here at 945 space, everybody. And you probably want to mute yourself. No hot mikes, okay. Or leave.'"
    ],
    "Resolution on Pension Obligation Bonds and Judicial Validation Action. ": [
        "'speaker_0': 'The issuance of one or more series of pension obligation bonds to refinance outstanding obligations of the city to the California Public Employees Retirement System, authorizing the initiation of a judicial validation action by the city attorney in approving and directing related matters.'",
        "'speaker_1': 'Thank you. And at this time, I would like to introduce our city manager, Eric Levitt, who is going to tell us how this item will proceed. Mr. Levitt.'",
        "'speaker_2': 'Thank you, ma'am. Mayor and City Council. I'm just going to briefly say that we have several staff members here, including the finance director and assistant city manager for questions. And the person that will be doing the presentation is Mr. Julio Morales, who's on the screen, and he'll be doing the presentation and then we'll be available for questions'",
        "'speaker_1': '. Thank you so much. And well, welcome to all of you. All right. Mr. Morales, the floor is yours.'",
        "'speaker_2': 'Thank you very much. Good evening, Madam Mayor, and members of the City Council. I'm going to quickly go over your pension liability, discussed a little bit about pension obligation bonds and the risks all within your timeframe allotted. So I'm going to go real quickly to your pension liability.'",
        "'speaker_2': 'If I can go to slide number four, if that's okay. Great. So we're going to start out with your annual pension cost. It's broken up into two components. And I apologize if some of you know this already. There's the normal cost.'",
        "'speaker_2': 'Some of these have new acronyms and terms, but that really is the current year's payment, what employees earn this year. And you pay that as a percentage of payroll and there's a past due amount of pass through payment.'",
        "'speaker_2': 'And that's what we're here to discuss, the unfunded accrued liability or past due amount. These are fixed dollar payments. So on the normal cost as the percentage of payroll, the other, you're on a payment plan with CalPERS, with fixed dollar payments, you and every other agency in California, it is a little bit different from any other agencies'",
        "'speaker_2': 'in the country. But every agency that participates in CalPERS as both a percentage of payroll and a fixed dollar fuel costs. Next slide, please. So your liability. As of the most recent actuarial report released this August, which is dated June 30, 2020, is $96.7 million.'",
        "'speaker_2': 'And that essentially comes up with the difference of the actuaries estimate that the liabilities that you have, the present value of liabilities is $822 million, both current employees and retirees. So they project out what the cost will be.'",
        "'speaker_2': 'They're going to have to pay in the future for all of these retirement benefits. And you have $525 million effectively in the bank with CalPERS. The difference is your net funding position. Now, the overall average net funding position is between 69 to 70%.'",
        "'speaker_2': 'So you're a little bit underfunded compared to some of your other agencies, but still within a modest range. Next slide, please. This is a little bit of detail, but I think it's very important to understand because that night, 296 or $1,997 million is comprised of a series of amortization bases.'",
        "'speaker_2': 'And if you were to think of it differently, I should say this is a series of loans, so you have to plan those for miscellaneous employees and those for sworn safety employees. Each plan is separate. The employees don't crossover between one and the other, though you are collectively responsible for both sets of plans, they each have a'",
        "'speaker_2': 'different adjustment. So the two subclans underneath the overall city of Alameda Plan and as you can see, there are a series of bases. So for the miscellaneous class 26 and for the safety plan it's 21, you can see the term is how long these are.'",
        "'speaker_2': 'So essentially these are adjustments that CalPERS makes every year. And if you want to look at it differently, that is a series of loans all at 7%. So I'm going to introduce a concept to you called the discount rate.'",
        "'speaker_2': 'And the discount rate really is their investment target and the rate at which you are charge these payments. So they essentially create a series of loans or if you want to see it, 47 loans all all factor it at 7% over time.'",
        "'speaker_2': 'The difference is they have different rates. So if you can go to the next slide. What we have done is created a model for you for each one of your bases. And this gives you an illustration of what your bases look like.'",
        "'speaker_2': 'For the miscellaneous plan. We call it the layer cake. So each one of the bases actually has a payment schedule. This is a graphical illustration, and then you receive net credits because if we knew a prior prior page, once again certain years, you actually when CalPERS outperforms the market, you get a credit.'",
        "'speaker_2': 'I will note that's a store credit. You don't get cash back from CalPERS, which you get a credit against your liability. So you can see, for example, in 2019, you had a credit for about $1.7 million. So if you can go forward to slides.'",
        "'speaker_2': 'What we're looking at and why we're here is that almost every agency in California. Has increased annual payments. Remember their fixed dollar? Next slide, please. Fixed dollar payments. So this is a combination of both your miscellaneous and your safety plan.'",
        "'speaker_2': 'And as you can see, your payment last year was 20 million. This upcoming budget year is 22 million and it's going to continue to rise up to 29 million. Now, I should also state a couple of things. These are fixed dollar payments, but they are adjusted every year.'",
        "'speaker_2': 'A little bit up and a little bit down. Some years can be more significant. But this is what the current picture looks like. So that totals $557 million. Or if we go to the next slide for really looking at is I cut off the mountain above $20 million and you can see this is the increase in payments'",
        "'speaker_2': 'for the next 27 years and that total $75 million. So as a former finance director, the way I look at it is those are resources are being cut or crowded out of your budget because those are fixed dollar payments.'",
        "'speaker_2': 'And as my colleague Jim Moore showed you before, in your long range financial planning model, in many cases, your revenues may keep pace with increasing revenues and expenses. However, regardless of whatever adjustments you make, these are fixed dollar increases.'",
        "'speaker_2': 'Similar, like saying your mortgage goes from 2000 to 20 200 to 2500 2900. And that makes it far more difficult to match on a budgetary perspective. So from there, what we've done and we've done with city staff is we look at possible solutions, how to address that 75 million overall $557 million, because once again, it's a it's'",
        "'speaker_2': 'a debt. It's a long term liability that you want to get hold of. So next slide, please. We looked at some funding strategies. These are fairly basic strategies. We take the same approach next. For every city. But the answers are very different depending on your underlying economics and policy objectives.'",
        "'speaker_2': 'The first thing we always look at is allocation between funds. The liability does not pertain solely to the general fund, but the super fund and the powerful also have that liability. So we will look at strategies there. The first and best thing that anyone can do if available is use reserves and one time money because there's no'",
        "'speaker_2': 'interest costs associated with you borrowing money. In fact, the opportunity cost is just the laugh rate. So it's the most efficient method of paying down your liability. Another method is looking at establishing the Pension Stabilization Fund, which is known as a 115 trust.'",
        "'speaker_2': 'We highly recommend that. And then those are just general budgeting approaches. How you think about each time you have this $550 million debt that you got to pay off, how are you going to get to it? And it usually involves multiple steps over a multi-year period, but there are also some financing approaches, leveraged funding, which is a'",
        "'speaker_2': 'financing mechanism, but unfortunately no current opportunities. Tax exempt exchange, which we think is a great idea but unfortunately is always limited in scale. You may be able to do 20, $30 million, but not address a $300 million liability.'",
        "'speaker_2': 'And that leaves you with pension obligation bonds. Which is a way to refinance your 7% liability with a bond at, say, three and a half percent. And finally, this notion of taking all of these options and recycling the savings from all of these to take over time.'",
        "'speaker_2': 'So those are the funding strategies that we've gone over. We're here today to discuss specifically pension obligation bonds, because it is the most it is the one action that can really significantly reset the table. So we've given you an illustration on two slides forward, please.'",
        "'speaker_2': 'Of of what a potential pension obligations would be. This is a 25 year pension obligation bond. And what we illustrate is really two components. So the the red line is what your fuel payments or your fixed payments to CalPERS look like.'",
        "'speaker_2': 'And the the blue line is what the payments would be like under a pension obligation bond. And one of the things we did is we kind of broke up your savings between true budgetary savings, where your level would go down from that 22 million that we're talking about today versus foregone or avoided fuel costs if you go'",
        "'speaker_2': 'to the next slide. Please. You can see that you can save about $2.7 million a year. That's actually true. Budgetary cash flow saving in the yellow is something that, as the city managers noted, this is savings to the city, but it's not one that you can reprogram day to day or from your current baseline of $22 million'",
        "'speaker_2': '. It's very important to note that these is an illustration you can do any portion. We can model out a half, $20 million. You can do a five year POB. This is just an illustration of the full potential savings and we don't necessarily recommend to do that, but it is something as a baseline to establish the conversation.'",
        "'speaker_2': 'So next slide, please. It is really important to have a conversation, I think, and I have to hit it a couple of times. So all these components to talk about the GF advisory, the GF ways, the Government Finance Officers Association of which I actually served on the National Debt Advisory Committee and helped write this policy several years'",
        "'speaker_2': 'ago. However, I believe a number of these things are not germane to California and have not kept pace with the changes that have happened recently in the market. So you're going to have to hit it a few times to get all these things to show up.'",
        "'speaker_2': 'Hit enter, I think. There we go. So the first comment is that these are complex instruments that have swaps, cabs, derivatives and gigs. A lot of acronyms. I. That they increase.'",
        "'speaker_1': 'Mr.. Mr.. MORALES. If I'm reading the clock right. Madam Clerk. With that time.'",
        "'speaker_0': 'That was 10.'",
        "'speaker_1': 'Minutes. Now, I will say that this is a very important topic to the council, to the city. And so with a motion approved by four council members, we could extend you more time. About how much time do you think you need to finish your presentation?'",
        "'speaker_2': 'Two or 3 minutes.'",
        "'speaker_1': 'To 3 minutes. And is anyone else on this screen also going to want to chime in, Mr.. For Minsky or anyone else?'",
        "'speaker_2': 'No. The main discussions, Hulu and everyone else's. For Mr. Morales, everyone else is here just for answering questions.'",
        "'speaker_1': 'How about motion for five more minutes for our presenter? Councilor Knox, why are you making that motion? Thank you. In his second year, Vice Mayor Val Seconding. Let's have a roll call vote if we could, please.'",
        "'speaker_0': 'Councilmember Jay.'",
        "'speaker_2': 'Shacknai.'",
        "'speaker_0': 'Her sponsor, now.'",
        "'speaker_2': 'Knocks.'",
        "'speaker_0': 'Right.'",
        "'speaker_2': 'By the fella.'",
        "'speaker_0': 'I know. I see Ashcraft High. That carries 4 to 1.'",
        "'speaker_1': 'Please proceed, Mr. Morales. Thank you.'",
        "'speaker_2': 'Thank you very much. Just to make it a little easier. So there are six items, five of which have been addressed. The first is they're complex instruments. And now now every issue in California of the 77 have been done in the past few years.'",
        "'speaker_2': 'All are plain fixed rate bonds. So these complex structures are no longer done, that they increase the debt burden or take a soft to a hard liability. As the finance director will tell you, the Government Accounting Board now place the liability on a balance sheet and CalPERS has you on a fixed dollar payment schedule.'",
        "'speaker_2': 'So really just refinancing a loan with a loan. They used to have these make hole calls which made them non callable. They're now issued with standard ten year calls. In the past you have a number of agencies that are extending repayment do in a number of features due to financial difficulty.'",
        "'speaker_2': 'We always recommend that you do that all within the same term. Rating agencies read this as a credit negative back in the day. Now it's a credit positive and it comes to the one and only thing that we think you have to be aware of is the fact that if you actually take the proceeds, you now have'",
        "'speaker_2': 'some risk to market timing risk and its inherent risk to pension obligation bonds. However, it is also a risk for any type of investment that any individual makes over time is market timing risk. So it's not specific to pension obligation month, but is a risk.'",
        "'speaker_2': 'Next slide, please. Okay. So when you when you take a look at this, it's really important to say one part is the refinancing. You can refinance from a 7% to three and a half percent. You get this great savings.'",
        "'speaker_2': 'However, you have to take a look at. The second component of it is once you take that money, let's say 300 million and you give it to CalPERS. You will not know whether it is a truly successful financing until the end of the financing 20 years from now.'",
        "'speaker_2': 'So it makes it a little more difficult than the standard mortgage refi. And there are some things that you can do to mitigate that risk. Namely, dollar cost averaging. But I think it's important for you to understand that risk.'",
        "'speaker_2': 'And I'll get to the last slide, if that's okay. Which is we believe in studying and thinking through these things. You already have a plan which is fantastic. We believe that plan should look for some additional edits as you go through this process.'",
        "'speaker_2': 'Looking at financial targets and metrics, how to use one time money, how to potentially use excess money, and lastly, potential funding solutions that you might contemplate. Thank you very much for the time.'",
        "'speaker_1': 'Thank you, Mr. Morris.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Counsel, do we have clarifying questions for staff before we go to Madam Clerk? I'm assuming we have public speakers.'",
        "'speaker_0': 'We do.'",
        "'speaker_1': 'All right. So, Councilor Harry Spencer. So you can go up.'",
        "'speaker_0': 'Go ahead and thank you for the presentation. My understanding is Mr. Rouse is a consultant for the city. Can someone tell us how much he's being paid today, how much he's been paid, and if there's an issuance, if he gets paid additional money, what is the structure of payments to him?'",
        "'speaker_1': 'Who would like to answer that, Mr. LeVay.'",
        "'speaker_0': 'Or.'",
        "'speaker_1': 'Yes, whoever you can have it.'",
        "'speaker_2': 'I can I can answer ma'am there. And Councilmember Herrera Spencer, for our pension analysis, it's been about $32,000.'",
        "'speaker_1': 'And I think there was a second part to your question for her, Spencer, which was if there is an issuance, is it go ahead and finish.'",
        "'speaker_2': 'The issuance on the way. And the agreements tend to work. They would be a financial advisor for their component of an issuance. It would be a flat fee that would be somewhere around 90 to $100000.'",
        "'speaker_0': 'And I just like clarification. So I'm trying I'm going to try again. City Manager, the 32,000 that is in full at this point, correct.'",
        "'speaker_2': 'For the coaches for that. It's an analysis that doesn't include the financial planning that you had earlier this year.'",
        "'speaker_0': 'Okay. But then the next step to go, going to the judge to get approval. Is there any if that is approved or for that work, is there any additional moneys to Mr. Rouse or his firm? Is that included in the 32,000?'",
        "'speaker_0': 'Where does that come from?'",
        "'speaker_2': 'I would defer to someone else on that question.'",
        "'speaker_1': 'Is there a question for the city attorney? Mr. Chan, if this we go forward with the validation action.'",
        "'speaker_2': 'Oh, I'll try, Madam Chair. So the validation action is a legal action, and obviously we share what legal fees might be like that confidentially with you in close session. And it is attorney client privilege with respect to legal fees.'",
        "'speaker_2': 'Those legal fees do not cover Mr. Morales's fees. And so I defer to the city manager or his team on whatever fees that might be paid to Mr. Morales.'",
        "'speaker_1': 'Thank you, Mr. Sand and Mr. Morales. Go ahead. You have your hand up.'",
        "'speaker_2': 'I believe the services that I've read to date will provide what you'll need through validation. I was supposed to provide a good faith estimate, which is included. So essentially at this point, unless you want to do additional workshops, study through validation, yes, my fees are covered in the quote that he provided.'",
        "'speaker_0': 'Thank you. And if there's multiple issuances of the bond over the 20 years or 30 years, whatever, what I'm hearing is 20 years at this point. But could there be additional issuances and then would there be additional money paid to his firm?'",
        "'speaker_2': 'Each time you do a bond financing, you have to pay the people in the suits lawyers, financial advisors, underwriters for each transaction that you issue.'",
        "'speaker_0': 'Okay. And then how many transactions are you anticipating and what would be the total cost at the end of all, say, 20 years? What is your best estimate?'",
        "'speaker_2': 'Typically council member you issue one bond, say, for example, with a 20 year financing timeline and often you have the opportunity to refinance it for cost savings within a ten year because you have a ten year call feature.'",
        "'speaker_2': 'So this would be like doing a mortgage and then refinancing your mortgage for savings five, ten years down the line. So at least one, possibly two is what would be a reasonable estimate.'",
        "'speaker_0': 'I'm sorry. What? Dollar amount for each one?'",
        "'speaker_2': 'I can tell you what. The current market is now approximately 90 to $100000. In ten years, I anticipate that the costs will go up given the cost of inflation.'",
        "'speaker_0': 'Thank you. And then my question to staff is, will we be hearing from the city's elected auditor and treasurer in regards to their recommendations and any feedback we have from them?'",
        "'speaker_1': 'Mr. Levitt, you're still muted.'",
        "'speaker_2': 'Yes. I've been talking with the city's treasurer about how they would be involved in the in that as we move forward and as we start to refine whether or not we would do a plan B if you approve this first phase.'",
        "'speaker_2': 'But in addition to that, I believe he's got his hand raised to speak tonight also.'",
        "'speaker_0': 'So though they being a lot of 3 minutes or 2 minutes, or are they being treated like Mr. Rouse, who is a paid consultant.'",
        "'speaker_1': 'A council member who are expensive, will proceed, as we do according to council rules, will take a vote like we just did to give them extra time if they needed. It will take four affirmative votes.'",
        "'speaker_0': 'So I appreciate that, Mayor, because it is my understanding would be hearing from them tonight. Thank you.'",
        "'speaker_1': 'Somebody has a way of looking at speakers coming up. I'm just just trying to connect the meeting, but whatever the clerk tells me. Okay, who else has the hand up? Councilmember de.'",
        "'speaker_2': 'Just a quick question. If both are outside consultants, Mr. O'Hara's in the act. And Mr. Morales, if they can kind of diss each other for no more than one minute, talk about themselves and their certifications, are they financial planners?'",
        "'speaker_2': 'Are they CPAs? What are they? What's their background with regard to to to to this line of work? Thank you.'",
        "'speaker_1': 'Who'd like to begin? Mr. Morales.'",
        "'speaker_2': 'My name is William Morales. Summit Director, Urban Futures, Inc.. I have over 30 years of public and corporate finance experience. I have a degree from the city of Michigan, from Harvard University, a master's in public policy, and then be in finance and real estate as being fellow from UCLA.'",
        "'speaker_2': 'I have worked at Transamerica Corporation, where I learned a great deal as actuarial math. I also worked abroad, most recently at the U.S. Treasury, working as the technical adviser for the country of Paraguay. I have extensive derivative, mathematical and quantitative experience doing complex financial transactions, including P threes, travel transactions and complex valuations and workouts.'",
        "'speaker_2': 'Thank you. And good evening, Madam Mayor. Members of the Council and the public. James was in the act here. Bond Council to the city from the law firm Jones Hall. We are a Bond Council only firm. Which means we represent public agencies such as the city in public finance transactions, pension obligation bonds, lease revenue bonds, other kinds'",
        "'speaker_2': 'of municipal financings. Our offices in San Francisco and we have been a bond council firm for 50 years there and represented literally hundreds of cities and other local agencies throughout the state. Personally, I've been working in multiple cities around the Bay Area for the last five years, and before that practice, corporate law.'",
        "'speaker_2': 'Before that, graduated from Harvard Law School. And it's nice to be with you tonight. Thank you. Appreciate it.'",
        "'speaker_1': 'All right. Those were your only clarifying questions. Councilmember de SAC, any other clarifying questions from the council? Okay. So we will hear from our public speakers and then we'll come back for council deliberation. Madam Clerk.'",
        "'speaker_0': 'So far, we have three speakers. The first is Kevin Kennedy.'",
        "'speaker_1': 'All right. Good evening, Speaker Kennedy.'",
        "'speaker_2': 'Good evening. Can you guys hear me okay?'",
        "'speaker_1': 'We can.'",
        "'speaker_2': 'Excellent. I'm going to try to keep this quick. My 3 minutes here. I do think this idea may have some merit, but obviously it carries a lot of risk. So I think we owe it to the public to really give this a thorough vetting before we actually issue any bonds at all.'",
        "'speaker_2': 'And prior to this appearing on the agenda tonight, the auditor and I have not been involved in any discussions recently on this issue, and I haven't seen any public discussion. I do see in the appendix of this presentation on page 34.'",
        "'speaker_2': 'There's a what I think is a great outline of an outreach program. It includes council workshops, community meetings, and I really think we need to follow that outline before taking any final action. I would also say a lot of cities have put this issue on the ballot so the voters can weigh in and we might think about'",
        "'speaker_2': 'doing something like that. The other point is the resolution, as I read it, indicates that you're not only going for the judicial approval, but also to some degree approving the issuance. And I've spoken to the city manager about this.'",
        "'speaker_2': 'I think maybe get some clarification on that section for that resolution even seems to hire a finance team, but that seems a little bit premature if all we're doing right now is is is looking for judicial approval and then coming back to council and preferably doing the public outreach in the in the workshops before we actually decide'",
        "'speaker_2': 'on doing any bonds. So with those two issues, you know, I would say I am in favor of of getting judicial approval. I think it puts us in a position to make an educated decision. But I do think this requires a lot more discussion publicly and among council.'",
        "'speaker_2': 'And I think we really need to understand this thoroughly before we take a risk of this magnitude. And I will hang on if anybody has any questions. But that's the end of my comment.'",
        "'speaker_1': 'Thank you. Speaker Kennedy. Thank you. Our next speaker.'",
        "'speaker_0': 'Jay Garfinkle.'",
        "'speaker_1': 'Good evening. Speaker Garfinkle.'",
        "'speaker_2': 'Good evening again. This is great presentation. I'm not sophisticated at all in these issues. So I would ask one how the payments are made on the bond. Does this come from property taxes or the taxes, or would the payment include just property owners or would renters be charged this?'",
        "'speaker_2': 'If renters are not charged for this, would their landlords be allowed to add the payments to their rent? You know, I think that since the current generation of residents ran up this bill, we should be the ones paying it.'",
        "'speaker_2': 'On the other hand, if we could pay it using money of RDF, such as the $29 million windfall that we received from the feds recently. On the other hand, I like the idea that if we pay it over time, it will be paid by all the NIMBYs moving to these apartments that they're pushing for.'",
        "'speaker_2': 'So anyway, the question for me really is how is this going to be paid? Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker.'",
        "'speaker_0': 'Kearney.'",
        "'speaker_1': 'Good evening, Speaker Kearney.'",
        "'speaker_2': 'Good evening. Can you hear me?'",
        "'speaker_1': 'We can.'",
        "'speaker_2': 'Welcome. Fantastic. Nice to see everybody. I too, like the Treasurer. I'm hoping that we can follow that that plan on page 34 of the presentation. I think this is a very important decision. The plan that was outlined by Amy to rename streets in Parks, I thought was very thoughtful, and I'd like to see us have an equally'",
        "'speaker_2': 'thorough analysis of this, considering the fact that the dollar amounts are significant. The issue that I have a little bit with, though, is if we undertake this type of an obligation, how does that affect our our possible borrowings in the future for, say, for example, an infrastructure bond to repair our streets?'",
        "'speaker_2': 'We talked about that maybe several years ago, and that amount was $300 million. That didn't seem to. Go anywhere. And so if we add this other borrowings, how does this, again, impact our ability to borrow in the future?'",
        "'speaker_2': 'The other thing that that I'm a bit concerned about is once the proceeds from the bonds, if if if you guys decide to go forward or whatever the mechanism is, how is the allocation of the funds going to be among the two groups?'",
        "'speaker_2': 'I would hope that it would be pro-rata. That seems to be the fairest in my mind. But I think that's something to be considered. And I would like to hear your thoughts on that if this actually does go through.'",
        "'speaker_2': 'I would also like to see that in your discussion on whatever you decide, the possibility that the voters be involved in this, this is a significant undertaking. If it works out, it's great. If it doesn't, it's not good.'",
        "'speaker_2': 'The city of Oakland had that experience where it didn't work out, and Mr. Morales certainly indicated that time in the market is one of the crucial elements of this. And so in light of the current circumstance where our markets are and where we seem to be going, I'm not 100% sure that you know where we're going, and'",
        "'speaker_2': 'I don't think anybody knows that. But I would hope that all of you would consider that. And so I just would like to close by saying, I think there's a long ways to go before you actually make this decision.'",
        "'speaker_2': 'I think the public needs to be involved. I think there needs to be further communication to everyone, you know, city council, to the public, just to convey the, you know, the ins and outs of this so you guys can make a good decision because after all, once you pull the switch, the future generation is stuck with it'",
        "'speaker_2': '. And we got here because of some bad decisions. So let's hope this isn't a bad one. Thank you.'",
        "'speaker_1': 'Thank you. Speaker Kennedy, our next speaker.'",
        "'speaker_0': 'That was our final speaker.'",
        "'speaker_1': 'Oh, okay. So with that, we will close public comment on item seven E and we will bring it back to the council. And I, I would appreciate one of our one of our speakers clarifying a question that was asked by one of our speakers about how are the payments made on on how does how does a pension'",
        "'speaker_1': 'obligation bond work? And, and what implications are there for, say, property owners?'",
        "'speaker_2': 'So if I if I may, I think I'm. Well.'",
        "'speaker_1': 'Well, please. Please.'",
        "'speaker_2': 'Payment on the pension obligation bond is paid exactly the way your unfunded liability is paid to CalPERS. That is through the city's general fund. So the general funds of the city, the property taxes, sales tax that's collected by the city is available for all purposes currently is paying.'",
        "'speaker_2': 'CalPERS would be available instead of paying CalPERS, which would be received. The proceeds of the bonds would be available to make debt service payments on the bonds, and accordingly, no new additional taxes would be levied.'",
        "'speaker_1': 'Thank you. Okay, council members. Your thoughts? Councilmember Herrera Spencer.'",
        "'speaker_0': 'So there was a comment from the public. And I want to thank all the members of the public who spoke in regards to this is the result of the current generation or the former generation, and that we're somehow, you know, now moving forward, though, and it's is it's from pensions that were promised and not paid for as'",
        "'speaker_0': 'we went along, is my understanding. And so speaking so today are are recovering for the pensions that we have contracted for as we go along, or are we continuing to accrue more unfunded pension liabilities today today to recover all the pensions we promised?'",
        "'speaker_1': 'Who'd like to take that one? I think that's probably more on the city side of things. Mr. Levitt.'",
        "'speaker_2': 'I can start. And then I think Mr. Morales could actually probably go a little bit further in. But so what this is paying for is is the unfunded liability. It's paying for liabilities and accrued over time. Are unfunded as far as current liabilities moving forward.'",
        "'speaker_2': 'The person actually sent out a schedule and a cost per employee for current and future liabilities. Now, whether those will stay up to pace or not, that's the way it's formatted to do that. But there's no guarantee. But that is the way the first form formula is.'",
        "'speaker_2': 'So as you hire more employees, then you actually pay that extra current percentage per employee that you hire at their rate. But I don't know. Mr. Morales may be able to give a more technical answer on that, too.'",
        "'speaker_2': 'Thank you. If I may, if we go back to Slide four, that's exactly where I would start is with your normal cost is really your current bill. So as long as you have the minimum pay your normal cost.'",
        "'speaker_2': 'And then that orange part that we went to a while ago, if you recall, that usually is a pass through amount. The good and the bad about that pass to amount is it's $300 million. So you really have this big mountain that you have to climb that eventually is going to go from $22 million all the way'",
        "'speaker_2': 'up to $30 million, approximately. So you have your normal cost and as the city manager mentioned, as you increase or make raises or other adjustments, that will fluctuate a little bit. But as long as you make these other payments, I hear the 20 million plus to $6.7 million in normal cost.'",
        "'speaker_2': 'Remember, this 20 will grow to 30 in the next 10 to 15 years. Then yes, you should be able to pay it off. With one last caveat, if I may, which is each and every year CalPERS makes adjustments.'",
        "'speaker_2': 'So this is a dynamic, an ever changing life. If you keep pace with those adjustments, then you should be able to keep pace with your liabilities. If, however you don't, then each year, for example, if I may, one last slide.'",
        "'speaker_2': 'The next slide shows you two slides from that. If you go to slide six that each year CalPERS makes adjustments. These are essentially truing up your account. CalPERS actually is kind of like a like a bank. They whatever you deposit into the system, they go in, they manage, they manage the investments, but they throw up every single'",
        "'speaker_2': 'year. So you could fall behind. And what they do, for example, you may have a 30 million base, $30 million liability, and you can't pay $30 million in cash in one at once. So it would be your 6.7 plus your $20 million payment, plus that new base of 33 million.'",
        "'speaker_2': 'So they they spread that out typically over 20 years. So it's important for you to know and this is the most important thing the rating agencies have to know is this is not a static amount. This is a changing and ever dynamic liability.'",
        "'speaker_1': 'Thank you. Councilor Spencer, you're speaking about your muted. I'm not so good at reading that picture.'",
        "'speaker_0': 'Thank you. So I wanted to get back to currently and someone knows how much money the city has in reserves. So someone can answer the question, does the city have enough money in the reserves to pay as we go?'",
        "'speaker_0': 'And I'll say for the next five years or ten years, when I look at the numbers, I don't think so. But you are you know, I'm hoping that someone has sent, you know, overlay that. Do we have enough money in reserves to pay for the ongoing moving forward?'",
        "'speaker_1': 'Mr.. Are you two? Are you meeting to speak, please? Finance Director.'",
        "'speaker_0': 'Hi. Good evening, everybody. I just want to clarify that the normal cost is based on a percentage of payroll. So each budget cycle we do budget for that. So right now we are good with the normal cost because as a percentage of payroll and the Council has adopted the budget and that that budget is sufficient to cover'",
        "'speaker_0': 'the next current year and next year.'",
        "'speaker_1': 'Councilmember Harry Spencer.'",
        "'speaker_0': 'So there was a thank you there. So there's a chart that shows what the current payments are. And I think like a year, ten or 15, it does start dropping. Can we see that? And then can you show me where the lines are going to be of what this is going to I know, balance it out.'",
        "'speaker_0': 'So in those last years, are they paying will we be paying more than currently? And without doing this.'",
        "'speaker_2': 'You're talking about slide I believe, slide eight, the overall dual payment schedule, is that correct?'",
        "'speaker_0': 'I'm not sure if it has. I know.'",
        "'speaker_2': 'That.'",
        "'speaker_0': 'We have. Is that the orange slice?'",
        "'speaker_2': 'The next one is the orange slide. It's one in the same. So many cities have a profile that looks like that. And this is just chopping off the mountain council member. So it is the same part. If you went to the prior slides, just cut it off with 22 million.'",
        "'speaker_2': 'This is the increase in costs. But the way that the base is and your payment schedule is structured, it has to peak many cities. Almost every agency has a peak from 30 to 33, and then it goes down some some more precipitously than others.'",
        "'speaker_2': 'Now it is important, and we can we can talk about this, that there are credits and liabilities added each and every year. So the structure of this may change as it has in the past. Maybe.'",
        "'speaker_1': 'Mr. LEVITT Yes.'",
        "'speaker_2': 'And maybe go to the previous slide so you can see what the, what the. Yeah. And so that is the current uel if you do not finance right now. Is that correct. That's correct. You have $557 million of the payments that you expect to make over the next 25 plus years.'",
        "'speaker_2': 'And then you have a slide that you show what the current what the payments are for the real over the years versus if you borrowed under the current interest rate. Yes, that's the one. That is slide number. 13.'",
        "'speaker_2': 'So that might be helpful.'",
        "'speaker_0': 'So. Thank you. Thank you. City manager. So. So this is under the current interest rate. So it appears. Right. The red line. That's the current. Yeah. The blue is under this plan.'",
        "'speaker_2': 'So that's an illustration of the 25 year of pension obligation bond in approximately 3.8%.'",
        "'speaker_0': 'Yes. Okay. So the blue doesn't is not higher than the or the red isn't really higher than the blue until you get to the farther out years. How how does it drop like that at 2044, 2043. The red is the current.'",
        "'speaker_0': 'I know. So it does drop at some point. But your yours, the blue lines lower all the way across until you get to 2044 counts.'",
        "'speaker_2': 'Remember, I structured it to match the final year. That's the same dollar amount. Graphically. If you look at the actual numbers, go to the next slide, you'll see that they're a couple thousand dollars difference. Okay. So after 20 years, they you know, by the way, bonds are done in $5,000 increments.'",
        "'speaker_2': 'So that's that's essentially as close as we can get mathematically.'",
        "'speaker_0': 'Okay. So you said you used current interest rates to do this.'",
        "'speaker_2': 'Yes. That's a scale based on the current interest rate.'",
        "'speaker_0': 'Okay. And what what is the number that used?'",
        "'speaker_2': 'Well, if you. One of the things that's different is municipal bonds are a series of bonds. And as you see, each year has a different interest rate. So there is the coupon rate inside. There are also prices, a spread to Treasury, which is different from a tax exempt month.'",
        "'speaker_2': 'So when you price them on the day of, you're going to have the two year Treasury rate. And the underwriter who sells and buys your bonds to investors is going to say these the market rate for this is 25 basis points above the two year Treasury rate.'",
        "'speaker_2': 'And then they price it up the three year Treasury rate, the five year Treasury rate, the seven year Treasury, the 20 year and the 30 year, they're all indexed. So these are all indexed off of the spread. And we use that on a scale that we provided.'",
        "'speaker_2': 'And the scale was that's what is kind of current interest rates. We use it off a pension obligation bond. I priced it off of the city Manhattan Beach based on current interest rates, plus a spread of 75 basis points.'",
        "'speaker_2': 'So there's an interest rate cushion here. In fact, the bonds that we've done recently have all been below 3% on the back end. But there's a significant cushion, given the 4 to 6 month validation period that's required.'",
        "'speaker_0': 'Okay. So if you have fluctuation the other way, then what happens to your numbers?'",
        "'speaker_2': 'Well, you're saying if interest rates go down.'",
        "'speaker_0': 'And you just said, I think that used 3%. So if it goes down or if it goes higher.'",
        "'speaker_2': 'Well, if it goes down, obviously the borrowing rate is lower. Household. But I did say you don't use one interest rate. You use multiple. All of these are the different interest rates for the year and the term. But I gave you a gross spread of the average rate is 3.33.'",
        "'speaker_2': 'If it goes up, obviously the cushion or the savings down, but there is a 75 base or three quarters of a percentage point. Question from somewhat current market rates. So we believe by that time that should be a pretty conservative cushion, but whenever certain.'",
        "'speaker_2': 'So. So essentially you put in a 70. You put in three quarters of 1% higher than what the current rate is that we would be borrowing at. That's correct.'",
        "'speaker_0': 'Okay. So then just one more question. So the cities that did lose money on doing this. Do you want to explain why they did it wrong and why this would be right?'",
        "'speaker_2': 'Certainly. First, we talk about when you go. We talk about jobs. They did it in a much higher interest rate environment and the timing was not ideal. So I've done a number of case studies. You might have seen them publicly available.'",
        "'speaker_2': 'If you issued bonds, for example, in 2008, that would have not been a good time. You would have been borrowing at 6%. And also they used cab structures which are deferred or zero coupon bonds. They extended the payments and took payment holidays.'",
        "'speaker_2': 'So there are a number of things that I believe when you look at the old issues, they did not use the most prudent financial management practices. Nonetheless, in no way do we guarantee the financial outcome. But if you study and understand your risk, then it's something substantially different.'",
        "'speaker_2': 'But in many cases, you'll see there is timing, high interest rates and then deferred payments, all of which are financial dominoes.'",
        "'speaker_1': 'Okay. Other Council comments. Questions. I'm going to jump in with a thank you for all the good information. I really appreciate hearing all this and and that I'm intrigued, but I'm also mindful of what our city treasurer and auditor raised in their comments.'",
        "'speaker_1': 'And I feel like we we should make sure we have as much information as possible and, you know, a little more public information and outreach. What are the things that I noted in the staff report? It came right at the end on page.'",
        "'speaker_1': 'This is Page. Not a good time for the iPad to freeze. Okay, it's vitamins. Page five, where the city manager manager makes the recommendation and there was no reference to this in the body of the staff report. But it says city manager recommends authorization of the issuance of pension obligation bonds.'",
        "'speaker_1': 'The city manager anticipates if authorized, there will be further steps taken with City Council prior to a final decision to issue papers in the future. I'd like to know what those further steps would be, but it's this sentence that I'd like a little more flesh on the bones.'",
        "'speaker_1': 'Further part of the strategy recommended would be to set 50% of the savings through the PBE on an annual basis to create a sinking fund to be able to stabilize any risks in the future, as well as to pay down future pension obligations.'",
        "'speaker_1': 'I mean, that sounds smart and prudent, but I would have liked a little more information about how do we go about doing that. And and anyway, I it's just struck me as well that I just would have liked to have seen more information.'",
        "'speaker_1': 'It was just in the very end and your city manager's recommendation. But I feel like I, for one, would like to know more about this before voting to authorize issuance of pension obligation bonds, I'm intrigued, you know that I've been preaching for a long time about how we needed to take a portion of all an anticipated revenues'",
        "'speaker_1': 'and set it aside once we pay down the debt to make sure we had our reserves for the general fund, but to take it in a sign it to pay down this unfunded liability. But I before we embark on this step, which might be a great next step for the city, I would like a little more information'",
        "'speaker_1': 'on that. So if someone wants to provide that tonight or and and that's that's my field. I don't know how the rest of the council feels and what information they might like. Cal seven KNOX Right before we hear from staff writer Cecily.'",
        "'speaker_2': 'I just wanted to ask a clarification. My understanding is the recommendation is for us to authorize the moving forward of starting to put together the information to return through through the process. That is on page 41 of the report that that that I believe City Treasurer Kennedy remarked it's a 4 to 6 process month process and that'",
        "'speaker_2': 'at the time we could give that direction. Because I agree there are some questions I would like to come back and including policy recommendations for how we would create that sinking fund. But my, my, I just want to make sure that what we're being asked is to start the process and and give direction on what we would'",
        "'speaker_2': 'like to come back for conversation as a part of that process before we vote to authorize any bonds.'",
        "'speaker_1': 'Well, I'm reading the first line of the staff report, which describes the adoption of resolution authorizing the issuance of one or more series of pension obligation bonds to refinance outstanding obligations. And then I'm reading literally in the first sentence of the city manager recommendation.'",
        "'speaker_1': 'At the bottom of page five, the city manager recommends authorization of the issuance of pension obligation bonds. The city manager authorizes anticipates that if authorized, there will be further steps taken with the City Council. I'm wondering if that might not be putting the cart before the horse, and I'd like to know what those additional steps and further'",
        "'speaker_1': 'steps and additional information would be. So I'm reading it literally as that. Look at City Manager Levitt. That was your recommendation. So why don't you go ahead and.'",
        "'speaker_2': 'I can start right.'",
        "'speaker_1': 'Now. Thank you.'",
        "'speaker_2': 'I can start. And then I think Mr. Morales could probably fill in some of the some of it. So as far as the first, when you go to the first paragraph of my recommendation, which was that there will be further steps taken, that that is correct, that this issue is the first step in the issuance, but we'",
        "'speaker_2': 'would have to come back with the any final issuance before we can issue bonds that you would not be able to issue bonds based on this alone. For instance, the official statement would have to come back as one step.'",
        "'speaker_2': 'Also, if the council wants to go with the process as it I think it's on page, someone said 34 or 41 as put on that page, then there would be other steps. But this step tonight is actually the first step.'",
        "'speaker_2': 'So if we delay this everything, it's a critical path item. So this step needs to be taken before we can. Do the other steps to the next 4 to 6 months. So if we delayed this a couple of months, that would delay everything out another 4 to 6 months.'",
        "'speaker_2': 'And that's fine. You can do that. It just creates more interest rate risk as the economy goes forward. The second part of it, the 50%, there's a chart, the chart where the savings is, it's just a different way of saying the same thing that that chart said.'",
        "'speaker_2': 'And I can't read what page that was, was that page eight or ten in the policy? Now, the chart that showed the savings between the budget savings and the other, that is chart page number 14.'",
        "'speaker_1': 'But we're talking about the presentation.'",
        "'speaker_2': 'Yeah, it's a different way of saying the same thing that Mr. Merrill said, and that is when you look at it, or at least I believe it is. So if we can pull that off, that might help.'",
        "'speaker_1': 'While we're playing it up, if I could ask. So is it correct to say that the city treasurer and city auditor were not consulted on any of this process?'",
        "'speaker_2': 'So that there have been brief discussions, but now they haven't been fully involved in that would be correct.'",
        "'speaker_1': 'Mr. Morales, I see you have your hand up. Why don't we hear from you?'",
        "'speaker_2': 'So typically I've done about 22 of these in the past four years. And a number of the pension advisories that don't involve pension obligation bonds of like. So it's not the only solution. But because of the 4 to 6 month waiting period due to the delay in court and even in the best case, you're talking 60, 90'",
        "'speaker_2': 'days for the validation process. Often what we do is we if you're contemplating it, I say this is similar to applying for a building permit. You know, you're contemplating doing this and you know, the building permit takes quite a bit of time and every day of delay is costing about $30,000 a day.'",
        "'speaker_2': 'Given your $300 million liability, then obviously accelerating this process and knowing that it doesn't really improve anything. As the city manager noted, you legally have to come back to council to approve the offering document known as the official statement.'",
        "'speaker_2': 'It certainly will save the city money and you have plenty of time to put on workshops, ask questions or analysis of, you know, I have 50 slides right here. I wrote a 50 page report for the city of San Jose.'",
        "'speaker_2': 'I have done up to 18 sessions for certain cities, so I have more than enough time and ability to answer almost every question you have. I don't know if they come to the satisfaction of the risks that people have, but we certainly can provide the type of analysis that you're looking for.'",
        "'speaker_1': 'Thank you, Mr. Rawls. Actually, that was helpful. So what you're saying is we would proceed on more than one front at the same time.'",
        "'speaker_2': 'It's best practice. Yes, ma'am.'",
        "'speaker_1': 'Okay. Okay. And city attorney. Give me a second, Mr. Levitt. City attorney san, is are you in agreement with the 4 to 6 months for the validation process to go through the courts?'",
        "'speaker_2': 'It's always difficult to predict litigation timelines, so I don't want to do that in open session. And we're happy to talk with you privately in closed session.'",
        "'speaker_1': 'Well. Okay, I'm well. Okay. But argue with the attorney. Mr. Levitt, you were trying to say something.'",
        "'speaker_2': 'I was asking her to keep the chart up because I was going to refer you to the chart. So when you go to the chart and you see the blue, that's water current, or that's what the estimated debt service would be if under the assumptions provided tonight.'",
        "'speaker_2': 'When you go to the white next to it, that's what the well, we're currently we lost it.'",
        "'speaker_0': 'We were trying to make it bigger because it was an issue.'",
        "'speaker_1': 'I'm so glad I don't have to do that.'",
        "'speaker_2': 'Oh. Let's hear. 13.'",
        "'speaker_1': 'There now or it's the next one is 14.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'We were having trouble getting rid of the side panel. I'm sorry about that. Just to say that's okay.'",
        "'speaker_1': 'Let's not worry about it. Talk me through it. Mr. Morales. You've got your hand up. Yeah.'",
        "'speaker_2': 'No, I mean.'",
        "'speaker_1': 'Oh, there it is. Look at that. Well, it's.'",
        "'speaker_2': 'Eight, 14, 14.'",
        "'speaker_1': 'There you go. I think that's big enough.'",
        "'speaker_2': 'So you have the blue, which is the the debt service that projected under the interest rate of 3.3. On average, you have the CalPERS payments, which is what we're projected through the CalPERS actuarial, what we're going to be paying per year.'",
        "'speaker_2': 'If you do nothing, that's a do nothing approach. And then you have the budgetary savings, which is true savings in the budget in the green, and then you have the fuel cost, which when you add which would be what we would be paying in additional unfunded liability if we do nothing.'",
        "'speaker_2': 'So you add those two, you have the savings over on the side, which is about which goes from six to 8 to 9 million. And my recommendation would be you would not spend all that money, but you would you would put aside up to 50% of our money and we would have to bring back a process to'",
        "'speaker_2': 'do it that if you did that over the first two or three years, that any volatility, any risk that we're talking about would practically be solved at that point, because if you were setting aside 4 to 5 million per year, you would have about 10 to 15 million in your first three or four years that would be'",
        "'speaker_2': 'set aside to mitigate against any risk of downsides of investment risk. And that's what I was talking about, because that would actually resolve the biggest or the greatest risk as far as the interest rate risk of this of this option.'",
        "'speaker_1': 'Thank you. Mr.. So I'm going to go back to Mr. Morales on page four of the staff report. There is the sentence in the middle of kind of in the middle of the page that talks about rating agencies have taken a neutral position on PBIS.'",
        "'speaker_1': 'More importantly, agencies are taking the time to study their pension liabilities and understand the risks. I'm reading that to mean the risks of policies. Is is that is that what it means? And what what are the risks that we should be aware of?'",
        "'speaker_1': 'Mr. Morales. I mean, Mr. Levitt just talked about market timing and trying to predict interest rates and that sort of thing. Is there anything else we should be aware of?'",
        "'speaker_2': 'No. If I can go to the next slide, slide 15. And you're going to recall that there were a number of things that were being done. And now we deem this PDBs 2.0. And we said that most of them have been addressed if you take this systematic process.'",
        "'speaker_2': 'What is that risk of investment? And this is once again not germane to pension obligation bonds. You could just ARPA money cannot be used for pension and specifically written in the guidelines that say there was a pension money and you got $100 million, you now would have the same risk.'",
        "'speaker_2': 'Is now the right time to invest regardless of the source of money, whether it's from pension bonds, your reserves? Another kind of financing you now have to say, is this the right time to invest in the market? And that is a risk or a component of everyday investing that anyone in this room would invest.'",
        "'speaker_2': 'Any type of money has to think about if you put $20 into a savings account as opposed to the stock market or vice versa, you've made a decision as to when is the right timing. This, if I may say one thing, is the most difficult part about pension obligation.'",
        "'speaker_2': 'Bonds and pensions in California, or almost every system in the United States is that municipalities are not inherently designed to take on equity risk. If you really think about the suitability of investment, when we changed over from all bonds, fixed income investments to equities and fixed income, everyone was looking for that game that we got.'",
        "'speaker_2': 'But note, equities are a roller coaster ride and government. Now I'm speaking as a former city manager is not designed to take that inherent risk and everyone wants a risk free option, but that doesn't come with the gain in the benefit of equities.'",
        "'speaker_2': 'So we're kind of all pregnant in taking equity risk. We do it every day with CalPERS. The pension component is an added part. So if you have $500 million in CalPERS and you give them another 50 million, your first 500 million is still at risk.'",
        "'speaker_2': 'It's just whether I'm going to place that 50 million in the market now or later. This will take a bit of time. And I think people have to start to understand that it's one, a liability we all have to live with.'",
        "'speaker_2': 'And the risk is very difficult to address. So you can take some systematic methods, but it is that market time that is the primary risk that you're dealing with. And all the others have been pretty much addressed. And the only thing you can do is dollar cost averaging easily.'",
        "'speaker_1': 'Thank you. I appreciate that. I just. And then I just want to raise this is something to consider. And this is for mostly for the city manager, but also for the council. Because we vote on these decisions, which is what I wrote in my notes, that simultaneously, as we consider this way to pay down our obligations and'",
        "'speaker_1': 'in a manner that costs the city less, we also need to be looking at ways to keep our pension obligations from increasing unreasonably. For example, hiring contractors rather than salaried benefit, you know, fully loaded employees, doing things like perhaps using actual inspectors to do code compliance.'",
        "'speaker_1': 'And, you know, we had a discussion about our fees for building inspections and just those really need to be firefighters that go out do that. And I and this is what I look to the city manager to help us manage, because we we can't keep digging out of a hole with one shovel while we're filling it with'",
        "'speaker_1': 'another. So I just want us to realize, as we make decisions about adding folks, you know, that there's there's an obligation that we're going to have to pay. I mean, some of these will continue long after any of us are working here.'",
        "'speaker_1': 'But but we owe that to to our city. Okay. You know, for me, who else can sort of desert has his hand up? We can probably go back to the the gallery view. And that's all you want to do.'",
        "'speaker_1': 'You want to keep this up? Counselor Desa.'",
        "'speaker_2': 'Put up the slide where city manager Levitt pointed out the blue column.'",
        "'speaker_1': 'The savings and the different.'",
        "'speaker_2': 'Yeah, yeah.'",
        "'speaker_1': 'Page four, page 1403. Sorry, that's 14. So it's before that.'",
        "'speaker_2': 'They tried before you 14.'",
        "'speaker_1': 'So wait a minute. Are there to page 1414.'",
        "'speaker_2': 'What do you know? Okay.'",
        "'speaker_1': 'Everyone's right.'",
        "'speaker_2': 'Councilmember A thank you. You know, I think for the public, I think we need to understand the magnitude of the decision that's before us. And on the one hand, we talk about the possibility of issuing a pension obligation bond of 200 roughly $298 million to cover our unfunded liabilities.'",
        "'speaker_2': 'But as you see in the blue column, when you add in the interest, it comes out to almost be a total of $420 million. Now, yes, I understand the net present value depending on the discount rate that you use, the net present value of that stream of dollars in the blue column, net present value of this technical'",
        "'speaker_2': 'term of trying to take into account inflation, etc., etc.. It doesn't really come out to be $420 million will probably come out to be $298 million. So the value of $419 million as expressed in current dollars, is probably $288 million.'",
        "'speaker_2': 'But still, you know, we're not just talking about a $298 pension obligation bond, but we are talking possibly of $420 million, as indicated in this in this blue chart. So the residents really have to understand the magnitude of the decision that's before us.'",
        "'speaker_2': 'I think given kind of the technical aspects of this, I'm just going to try to focus on four, four areas. I think the first thing that I that that that I want to draw attention to is that.'",
        "'speaker_1': 'Councilmember Desai, I'm so sorry. I don't mean to be rude, but I just looked at that time and it is 1051 and we're getting to that magical 11 p.m. hour. So what we need is.'",
        "'speaker_2': 'A.'",
        "'speaker_1': 'City clerk help me out. So I get this right. We need to take a vote on what, if anything, we are going to consider after we finish this item, sir. Correct, madam?'",
        "'speaker_0': 'Correct. And there's six remaining referrals are the agenda items. Okay.'",
        "'speaker_1': 'And we need four votes to go past 11.'",
        "'speaker_0': 'You need to consider the items after 11 going past. Yeah, it's just okay that she has to.'",
        "'speaker_1': 'Consider any items. Okay. Okay, so time for a motion and we can't take too long or it'll just become 11 p.m. and it'll be commitment. So he would want to make a motion to go past 11. And if we don't, then we finish this item and we we go home.'",
        "'speaker_1': 'So I see Councilmember DeSantis got his hand up.'",
        "'speaker_2': 'I'll move to go past 11 and complete at least until the second council referral. So at the 80, the second council referral is completed then and work will be complete for the night.'",
        "'speaker_1': 'Okay. Is there a second to that? Cast over her. Spencer, you're certainly.'",
        "'speaker_0': 'Yes. Thank you.'",
        "'speaker_1': 'Thank you. May we have a roll call? Vote, please, Madam Clerk.'",
        "'speaker_0': 'Celebrity. I have our Spencer I. Knox.'",
        "'speaker_2': 'Wait now.'",
        "'speaker_0': 'The villa now. Mayor, as the Ashcraft know, that motion fails. Two, two, three.'",
        "'speaker_1': 'Okay. Any further motion or we're going to end this when it ends. Cats are not sweet.'",
        "'speaker_2': 'But my understanding is we will still be able to have council communications and what not because those are not items. Is that correct? It's just no new business items to turn around. Correct.'",
        "'speaker_1': 'Is that correct? Or do we decide.'",
        "'speaker_0': 'How much it so? So it's new items that are actually agenda items. But those sections that were mentioned or communications canceled, vacations, city manager previous is already done. So you don't need to go back to that with those two.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. So we would still hear oral communications and council communications bracketing. Okay. So set a motion council member or not quite. Are you just saying to let it go?'",
        "'speaker_2': 'Yeah. Doesn't need a motion.'",
        "'speaker_1': 'Okay. All right. Okay, everyone, then. I'm not saying hands up for another motion. It's 1054. Let's move along.'",
        "'speaker_0': 'I'm sorry. I totally forgot five f you guys had delayed five f, and I think.'",
        "'speaker_1': 'You're so right.'",
        "'speaker_0': 'Thank you, guys. Producer, director, just being means and thank you. So thank you. Thank you. So I think if you want to hear that.'",
        "'speaker_1': 'Yeah, actually, what I think we need is, is that well that that is actually part of the agenda is next. We just.'",
        "'speaker_0': 'Moved. Yes. Yes. So it's out there. So if you want to hear that, you need to vote to hear that Councilmember Knox.'",
        "'speaker_1': 'Right.'",
        "'speaker_2': 'I move to I move to continue the meeting past 11:00 in order to hear five F and the regular business. No items for now.'",
        "'speaker_1': 'All right. And do I have a do I have a second to that motion? Second. Vice Mayor Vela, seconds. May we have a roll call vote, please.'",
        "'speaker_0': 'On de SAC.'",
        "'speaker_2': 'No, her.'",
        "'speaker_0': 'Spencer. No, not quite.'",
        "'speaker_2': 'Yes, but it doesn't matter. Yes.'",
        "'speaker_0': 'There is, Ashcroft.'",
        "'speaker_1': 'Yes. But I would say what's going to happen is it's going to roll over to be item six on the next agenda. Would that be correct?'",
        "'speaker_0': 'Yes. If you want to continue to that section or we can just bring it back on the content. It's it's up to council's discretion if you want to take a motion to continue it specifically to Section six.'",
        "'speaker_1': 'So we could put it back on consent for the next meeting?'",
        "'speaker_0': 'Yes, staff could, but then it would probably be pulled again.'",
        "'speaker_1': 'Why don't we? My preference is we make it item six. So it's actually heard at the next meeting because I don't want to to this dance too many times.'",
        "'speaker_0': 'Okay. So you just get a motion on that and it only takes three votes.'",
        "'speaker_1': 'All right. May we have a motion to bring item current item five. Help me out, madam.'",
        "'speaker_0': 'Circling, move five, Frank.'",
        "'speaker_1': 'Okay. The move by the vice mayor to have a second councilor. And that's why. 8 seconds. Maybe we have a roll call vote, please.'",
        "'speaker_0': 'I really.'",
        "'speaker_2': 'Know.'",
        "'speaker_0': 'Her, Spencer. I'm not quite all right. I may as the Ashira.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'That carries by 4 to 1.'",
        "'speaker_1': 'Okay. Thank you. Okay. We've gotten housekeeping out of the way. So, Councilmember De Saag, again, apologies for the interruption. The floor is yours again.'",
        "'speaker_2': 'So just to recap, the first point that I made, that the magnitude of this is beyond the initial $298 million pension obligation bond. But when you take into account the interest, as you can see in this blue column, the sum of which is roughly $420 million.'",
        "'speaker_2': 'Again, yes, I understand that the net present value of that is different. So let me just be clear that I do understand that. I think the second point that I want to make is that, you know, I don't think we should take lightly the GFA and what they have to say with regard to pension obligation bonds.'",
        "'speaker_2': 'The GFA is the Government Finance Officers Association and we you know, we all know who the Government Finance Officers Association is, by the way. They're the people who every time we do our biannual budgets, they're the people who we slap on that certification at the beginning that says you did an excellent budget or you did an excellent'",
        "'speaker_2': 'Kaffir. So they're a reputable organization who we ourselves turn to for validation. And what the GSO has to say about pension obligation bonds is is specifically this. State and local governments should not issue pension obligation bonds. That's their advisory.'",
        "'speaker_2': 'So I think we I think we need to frame this discussion from that vantage point again. JF Okay, state and local governments should not issue pension obligation bonds. Now. Let me talk about four points. We talked you heard earlier about pension obligation bond.'",
        "'speaker_2': 'Version one, we're not. Pension obligation bond version. When we're now pension obligation bond. Version two. And that's good because just by way of background, the way that pension obligation bonds used to work with with that was that cities would issue pension obligation bonds.'",
        "'speaker_2': 'And they would take those proceeds and save $300 million. And they would actually invest it in the market. So they would hope that, you know, that the return on the $300 million that they invested in the market would be above the 3.5% interest rate that they're paying.'",
        "'speaker_2': 'But we are not doing pension obligation bond version one. We're doing instead pension obligation bond version two. And what this is, is basically, again, we would generate we would issue with a $300 million pension obligation bond, and we would then basically take that 300 million or $298 million and that we would prepay our our unfunded liability.'",
        "'speaker_2': 'In other words, we'd give it to CalPERS now. So that's good that we're not doing pension by obligation bond version one, but we're doing a pension obligation bond version two. But that's not to say that version two. Is without its risks.'",
        "'speaker_2': 'And this is what is meant by timing risks, for example. So you see this this chart where it says our unfunded liability is $298 million with a $298 million. Unfunded liability is a function of the 7% return rate that CalPERS expects.'",
        "'speaker_2': 'So if next year. CalPERS is return is not 7%, but instead it's 4.5% or 5%. What that would do is that would then recalibrate, you know, what our unfunded liability is, because suddenly CalPERS said, oh, you know what?'",
        "'speaker_2': 'We didn't get as much money as we anticipated, but we're going have to make up for that shortfall. And by the way, that shortfall is going to come from you. And if it comes from you, I in the cities in this pension obligation bond version number two, what that means is that the budgetary savings that would that'",
        "'speaker_2': 'that's in the green chart would not suddenly be $2.7 million. It would be something south of that. The concern, though, is that if CalPERS is return falls. To the same amount of interest that you're paying. Or even less.'",
        "'speaker_2': 'That basically eliminates the the savings. So that's the timing. One of the timing risks that we're talking about. So that's why I'm very I think we need to be very concerned about that. Now, another thing that we need to be concerned about is do you take a look at the the the the green column here and you'",
        "'speaker_2': 'look at the series of $2.7 million, $2.7 million, $2.7 billion of budgetary savings. Now, think about it. If you hire. Roughly 13 people. Who were not expected. Well, you know, you hire these people who you did not expect to hire, but for whatever reason, you do.'",
        "'speaker_2': 'You know, 13 times a fully loaded average of $200,000, you've you've basically eliminated the budgetary savings. So you would have eliminated the very purpose of having done the pension obligation bonds. That's why city manager Eric Levitt is correct in saying that if you're going to pursue this, you have to have a strict fiscal strategy to make sure'",
        "'speaker_2': 'to lockbox the budgetary savings that you're seeing there. So. So I think, yeah, that's an important point. I think the fourth point I want to get to is a scenario of, well, what if CalPERS has a return rate?'",
        "'speaker_2': 'That's higher than 7%. Suppose CalPERS has a higher return rate of eight or 9%. Well, guess what? CalPERS doesn't suddenly give you a refund. You know, whatever excess that you ended up paying, CalPERS won't do that. You're still going to pay the the the the annual debt service that you've you've agreed to.'",
        "'speaker_2': 'So there's really no real upside to that. I mean, certainly if CalPERS has a greater return for four new payments, it will be it will be lower than what you've been. But but for for what you've already prepaid, you're not going to get any money back from CalPERS and saying, hey, you know, you get to you get'",
        "'speaker_2': 'to share in the upside the fact that, you know, we got a 9% return instead of 7% return. So. My recommendation is, is to go very slow on this. I know there's a lot of Southern California cities doing this, but then again, there was a lot of Southern California cities doing the Orange County deal way back in'",
        "'speaker_2': 'the early 1990s, if we remember what happened then. So so I'll leave it at that and not support this.'",
        "'speaker_1': 'I thank you, Councilmember. And Mr. Morales has your hand up to run to address some of this points.'",
        "'speaker_2': 'Yes, Mayor, I can give you an illustration because I think there's some good news and this is far more complex as we're trying to do. Remember, the suggestion was to kind of move forward on building permit. But if the clerk could go to slide number 23 in the appendix, it would be helpful to give the Council an'",
        "'speaker_2': 'understanding of how this operates. So as you may know. CalPERS returned excessive 21.3 or 21.4% return this past fiscal year that's been announced. That means you're going to get a credit of $73.3 million. However, at the same time, according to the funding risk mitigation policy, they have announced that the discount rate has to go down to 6.8%'",
        "'speaker_2': '. So you would actually increase your liability and net that by $20.4 million. What's that mean? You're $295 million liability would likely be somewhere closer to $241 million. However, there's always a non or a demographic adjustment that comes into this.'",
        "'speaker_2': 'So if you if you're starting really oh my God, there is a lot of numbers and a lot of estimation. It is because this is a $300 million liability. It moves each and every year and there are a number of component parts.'",
        "'speaker_2': 'So even then, we would never borrow or I would recommend 295 million because I already know about this adjustment. You don't have to borrow the full amount, but there is a lot of mathematics involved to this and a lot of moving parts.'",
        "'speaker_2': 'But I do know a couple. Desai said, Hey, you wouldn't get the share in it. The next slide, actually, we'll show you kind of what the credits and the cash flows come out with. Next slide, please. So you can see what your payments are currently, what the credit would be with the offsetting reduction in the discount rate'",
        "'speaker_2': 'and the net impact. So your payments will actually go down. Now, these are the type of projections that I have been sharing with city staff and obviously given a ten minute time frame. This takes about 4 minutes just to explain.'",
        "'speaker_2': 'But there's a lot of process to go through. And it's a refined concept. It's not not a recommendation issue, the full amount, but rather what you're paying your attorneys. The dollar value might as well ask for the full amount at that day and then decide what amount, what structure and when you're going to do it in the'",
        "'speaker_2': 'future.'",
        "'speaker_1': 'Okay. Thank you. How can you address what Councilmember Desai raised about the DOJ FOIA saying state and local governments shouldn't issue poppies? Yeah, it's an obligation. Bonds. Yeah.'",
        "'speaker_2': 'I certainly can. The Government Finance Officers Association has a big yellow warning sign on there on their website says do not issue pension obligation months. And as I disclosed upfront, I was on the National Debt Advisory Committee for the way, as was Julian Cooper, who the finance director at the same time for the city of San Jose'",
        "'speaker_2': '. I can tell you specifically when I've written a number of policies, how they're designed to be written, they are written for the entire country. So the city of Alameda, city of New York or anyone, its financial sophistication is very different from a very small place on the plain fog in Illinois that does not know what Poppy stand'",
        "'speaker_2': 'for. Do not have the kind of sophisticated staff or council that can analyze this. So their policies are written for that measure and then written nationwide. The reason I say that's important is because each plan is different. The laws in each single state and the funding levels are completely different.'",
        "'speaker_2': 'So what you have in the CalPERS system is completely different from what you have. A county are very different from Alameda and very different, for example, what happens in New Jersey, Illinois or Minnesota, which is well funded. So you have to write this one universal policy.'",
        "'speaker_2': 'I think that's important for people understand, because the financial circumstances of each agency in the entire country are very different. We believe we've addressed a number of these, and probably what's most disconcerting about the Geoffroy is they basically say don't do it, provide no alternative options.'",
        "'speaker_2': 'In other words, you have this $300 million liability and we don't give you this. We take the tool out of the Senate and recommend nothing as far as alternatives outside of using reserves. And if cities had $300 million in reserves to pay off their liability, you would not be you would not be talking to me at this'",
        "'speaker_2': 'time, but. You should feel free to listen to that. And you should also read the points and counterpoints that the GOP has actually mentioned. My my mentor also wrote a counterpoint, Juror Miller. That's a very interesting one because he says you don't throw the baby with the bathwater.'",
        "'speaker_2': 'These are complex. They do have some downside I mentioned. Part of the downside is you're always you're stuck with equity risk. This is not an easy answer. Someone can say, I don't want to do it because the risk involved.'",
        "'speaker_2': 'The problem is you're facing the risk one and two, doing nothing has a detrimental impact on your operating budget going forward. If you recall the projected operating deficit that my colleague showed you, all of that, if you did the math and back ended it.'",
        "'speaker_2': 'All of that has to do with the increase in pension costs. If you recall, there was that shortfall for the next four or five years. If you did the math, you'll see that increase in our payments is primarily due.'",
        "'speaker_2': 'Are that deficit is due to increased annual payments.'",
        "'speaker_1': 'I've got a question for you, Mr. Masters. Does the current economy, the the stock market that's been doing amazingly well, even though that's not necessarily reflected, you know, across the board and, you know, among the American people, the the very low interest rates.'",
        "'speaker_1': 'Do do you think that's sustainable? Do you see that? I mean, no one's got a crystal ball, but how are you feeling about that? How are you factoring this? I think rather unusual time, maybe it doesn't seem so unusual to you, but sure, you know.'",
        "'speaker_0': 'If you're.'",
        "'speaker_2': 'Exceptionally unusual, rates are at historic lows. And that's what makes it very compelling, too. I do not believe and that's why they are lowering the discount rate. And so the state in New York lowered their discount rate from 6.9% down to 6%.'",
        "'speaker_2': 'I personally do not believe that on a long term basis that we continue that growth due to various factors. One, we've had kind of what I call the second industrial revolution. When you look at the Facebooks and Amazon's of the world that have and the Teslas have had tremendous economic growth, you have to look for that continue'",
        "'speaker_2': 'to sustain growth. So can we continue at 21.3% growth? Can we outperform this problem? No. And that's what the actuaries are doing. They're taking more measured steps and saying, let's see what's realistic at the end of the day, most of the time, as the finance professional people love one end of what we call fat tails, everyone loves'",
        "'speaker_2': 'the gain and no one likes the downside. But as we know, they're typically parallel. So you have to think about that downside. I really do believe some are based on is correct. That is the risk and there are things that you can do to prepare themselves.'",
        "'speaker_2': 'Note I am not the one. I've done a number of pension obligation bonds. The President is on the line listening to the same time we say the same thing. This is this is not a panacea. It is not without risk.'",
        "'speaker_2': 'There are some steps you should take. But the most important thing is you should take the time to understand and then really think what alternative options are. What we don't think in both of us have been city government executives doing nothing is probably also the other part.'",
        "'speaker_2': 'That's not. You can't say it's too risky. And I'd rather do nothing because this has been growing for 20 years. So there has to be some type of plan to address it. And you have taken some steps already.'",
        "'speaker_1': 'Thank you. Council members. Others want to weigh in. Make a motion.'",
        "'speaker_0': 'Councilmember Spencer So I also do not plan to support this at this time. We did hear from our elected treasurer and auditor very, very briefly. I would have liked them to have had more time and to actually be able to answer questions and receive fresh answers to their questions.'",
        "'speaker_0': 'I think it's premature to proceed at this time. I have serious concerns of the fact, Mayor, you raised some points about what can we be doing at the same time to reduce our expenditures and so on versus non sworn officers or just really what are we doing moving ahead?'",
        "'speaker_0': 'And I don't hear that side of the equation and I think that is really a serious part of the equation. And so that also goes to I personally am not ready to proceed at this time. I think we do have to look at both sides of the equation.'",
        "'speaker_0': 'And I do want to hear more from including our community members. I would really like to have more back and forth workshop, if you will, something like that, to hear from them. This is a huge risk. I really appreciate Member De Sykes comments.'",
        "'speaker_0': 'I think that that helps for. That helped me a lot to understand really what we're talking about do pointed out so clearly and I just feel like we were rushing through a huge risk here that doesn't need to be.'",
        "'speaker_0': 'So I would like this to come back if we're going to entertain it and have more information and really give us the risk. I'm sorry. Just that there have there are cities out there that have lost a lot of money over this and they're minimized in this report is what I would say is where are the examples'",
        "'speaker_0': 'of the cities that have lost a lot of money? I don't see them in here.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_1': 'Thank you. And Mr. Levitt, if I could just ask and I thought it right to you afterwards, Councilman. That's why I bet. Mr. Levitt, if I could just ask you, give us that overview. You I think you touched on it briefly a little earlier when I asked.'",
        "'speaker_1': 'So the way you envision this going forward, if we're to take the recommendations to tell us how we're going to be moving forward on several different fronts to allay some of our concerns.'",
        "'speaker_2': 'Or so I can live. So what we would do is we would start the process of the court process. At the same time, I think one of our concepts was that we would come back with a work session with the council and we would also include public meetings.'",
        "'speaker_2': 'So similar to what the lawyer and Treasurer had agreed with the Treasurer's ideas of having some public meetings and public engagement as well as those meetings, and we'd be able to refine those policies as we go forward so that when we come back after the court decision, we'd be able to come back and bring back a full'",
        "'speaker_2': 'recommendation to the city council. I think the timing, I guess from my perspective there, there is risk with it. The risk of not doing anything is you're looking at it was shown when we were looking at the site and customer base.'",
        "'speaker_2': 'I was talking about the 290 million or 290 million being 420 million. When you look next to it, doing nothing was about 530 million. And so I think that's the risk you're talking about by not moving forward with some solution.'",
        "'speaker_2': 'And this solution, if it goes even half of the savings that we're showing, the programs the council's wanting to initiate and we're trying to find funding for this would be a solution to help you with some of those funding options.'",
        "'speaker_1': 'And then just briefly, the timeline. If if you you know.'",
        "'speaker_2': 'Yeah, the timeline is about 4 to 6 months. I mean, everything I've heard from other cities, obviously, when you go into to the courts and especially during COVID, that can delay things. But 4 to 6 months is what I've been hearing, has been what's typically occurred in other communities.'",
        "'speaker_1': 'And when would you expect this to next? Come back to the council?'",
        "'speaker_2': 'Well, I think in that period, the first thing we would do is and hopefully in the next couple of months, we would have a workshop to continue to have this educational period, and then we would be doing other steps during that 4 to 6 months.'",
        "'speaker_2': 'So you would be prepared if you want to make a decision whether to go for it or not. You would be able to do that in about 4 to 6 months from that.'",
        "'speaker_1': 'Well, thank you, Councilor. And that's why it's been waiting patiently.'",
        "'speaker_2': 'For you to ask, can we pull up page 41? Side 41. It just because it helped me a lot and this is the side of the city trigger referred to in thinking this was a good process. I just want to confirm this is the process we're talking about in general that the dates are clearly from when we'",
        "'speaker_2': 'thought this was coming forward to 2020, just right around the beginning of COVID. So not paying attention to the is this the as the general process that we're thinking the part a six month process.'",
        "'speaker_1': 'Yeah. City manager. That's what you're referring to. Correct. Or is it.'",
        "'speaker_2': 'Yes. No, that's correct. But Mr. Morales. Because this chart might be able to help to. Yeah. I just wanna make sure I mean, because from what I see, it's like in February, it's sometime between now and February we'll have a workshop and then we're going to come into a bunch of meetings in March, April, and sometime around'",
        "'speaker_2': 'May or June we might be back for that. These two council approvals at the end. No, I would agree that that is correct. Okay. So from from my standpoint, I know, and I'd be happy to make a motion, but I would.'",
        "'speaker_2': 'I have been doom and gloom on the economy for a couple of years now, and I continue to be proven wrong and I will be happy to be proven wrong again. But I think that if we're going to if we decide we want to take advantage of this, taking advantage of it earlier rather than later is going'",
        "'speaker_2': 'to be a big is going to be important because that the bond rates are going to most likely only be going up. And every couple of months we wait. Chances are it's going to cost us more to do this and whatnot.'",
        "'speaker_2': 'I think that there have been some reasonable concerns and raised and I think we have you know, I appreciate council member disagree asking for everybody's bona fides because it's clear that we have people who really know this stuff that we can listen to to at least provide an understanding.'",
        "'speaker_2': 'And then we can make decisions about what makes sense for Alameda based on the information we get. And clearly there will be a role for our city auditor and treasurer to provide their input and opinions as well. And they've both said that they generally approve moving forward, at least with starting the conversation, so that we can actually'",
        "'speaker_2': 'have this tradeoffs conversation and risk conversation and whatnot. And so tonight I'd like to move approval of the staff recommendation, which is to start the process with direction to ensure that there are, I'm going to say, two workshops, and I think they should not be council meetings.'",
        "'speaker_2': 'I think they should be workshops so that we are not stuck in this. It's 11:00 and we're trying to get out of here then to workshops between now and that first council approval whereby we can have Mr. Morales and staff and the necessary people here to really have a deep dove conversation with the council and our community'",
        "'speaker_1': '. Thank you. Well said. Council Member Vice Mayor, will I see your hand that.'",
        "'speaker_0': 'I'd like to second the motion and I haven't spoken on this so it's.'",
        "'speaker_1': 'Always yours. You've got 9 minutes to a lightness.'",
        "'speaker_0': 'I'm not going to use all 9 minutes. I think we owe it to the city, to our constituents to have the conversation and explore. This is an option. As the experts have said, now is the time to to have this conversation based on the bond ratings.'",
        "'speaker_0': 'And, you know, yes, there have been other jurisdictions who have maybe done things at less less opportune moments. I don't want to be in a situation where we are making decisions out of desperation. I want to be in a position where we are making decisions based off of the best possible set of facts, knowing that we are'",
        "'speaker_0': 'acting in a fiscally responsible manner because doing nothing is frankly fiscally irresponsible, because we know what awaits us. And so I'm not I hope we can we can take a step forward in giving direction to come back to look at this as an option that has been allowing for a vetting process that allows for a number of'",
        "'speaker_0': 'different folks to weigh in, for us to have a work session as a council, and then to make an informed decision of if this is the right thing at the right time for our city. This does not exclude the ability to to look at other options and to have parallel tracks out there.'",
        "'speaker_0': 'I think we need to do all all of those things to make sure that we are placing our city finances in a position that is responsible. So that's why I think we should move forward tonight. I didn't hear any opposition from our our city auditor or treasurer to exploring this as a possibility and allowing for full vetting'",
        "'speaker_0': '. I think that this timeline laid out gives us exactly that opportunity. So I hope we can move forward. I look forward to supporting this. Thank you. And sorry, I just want to say that it's almost double. If we do nothing, we are looking at hundreds of millions of dollars that we are going to have to pay, which'",
        "'speaker_0': 'really we all know creates a bigger problem. So I just I really hope that we can we can take a positive step forward.'",
        "'speaker_1': 'Thank you. And for the maker and center of the motion, I, I don't know how exactly to incorporate it, but I, I do think it's important that we consider steps to make sure we're not. Creating even more unnecessary liability that we move very carefully forward.'",
        "'speaker_1': 'Or ask city manager to explore ways to minimize getting further into debt as we're judiciously paying off.'",
        "'speaker_0': 'Where.'",
        "'speaker_1': 'We are already. So it's okay to include staff direction as well.'",
        "'speaker_2': 'I mean, as long as the direction is not that we should look at how we can outsource public positions, I'm happy to look at solutions. When I when I hear contractors and not hiring staff, I get a little nervous.'",
        "'speaker_1': 'It's a broader conversation to be had, but I think it's necessary to look at alternative ways or just, you know, to explore that not to.'",
        "'speaker_2': 'Pretend doesn't exist. I'm happy to have direction. That does not include looking at contracting out public employee jobs, but looking for other solutions to make sure that we do not increase pension liabilities.'",
        "'speaker_1': 'To look at ways that we not raise public public liability. Public pension liabilities. Perfect. Carl Zimmer. Spence, raise your hand up.'",
        "'speaker_0': 'Thank you, Mayor. So I want to ask for clarification, I think, from the maker of the motion, because there's a proposed resolution, and if I'm hearing correctly them, the motion is not to approve this resolution, but to approve this timeline.'",
        "'speaker_0': 'And I might be able to clarify it, which is full of the staff recommendation, which was the adoption of the resolution. Yeah, that's the way I interpreted the motion.'",
        "'speaker_1': 'I think it was it was certainly sorry.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Go ahead, counselor. That's right.'",
        "'speaker_2': 'I was going to say, I mean, the city manager's recommendation is specifically that that they will start the process and come back for future votes before anything moves forward. And I believe we had earlier staff corroboration that that is the that that the resolution itself does include a step for council approval.'",
        "'speaker_2': 'So we are not approving the issuance of anything. We are just approving the beginning step and giving direction that this that we are committing to this timeline and process, which includes two of two future council approvals, one for the underwriter and pension funding policy in the second one following that of the the I'm going to say process'",
        "'speaker_2': ', I don't actually don't know what that stands for. And I don't want to guess at this time of night and the amount of the permits.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'I'm asking I just want to make sure that the city clerk. Do you is that your understanding of the motion that's being made? From what city manager Levitt had said and council were not quite right.'",
        "'speaker_0': 'Yes, I. I understand the resolution is part of the motion and with the additional direction. Yes.'",
        "'speaker_1': 'And we want to hear from Mr. Morales, who's got his hand up. And then I'm going back back to Councilor Spencer. Go ahead. This was.'",
        "'speaker_2': 'Council member. But I think it's important to note that on the left is the process and two workshops don't pertain to the actual bonding process that we do kind of hand-in-hand. So the workshops would be, for example, a community stakeholder meeting and a council workshop and or one on one, for example.'",
        "'speaker_2': 'So and we do this for almost all of my clients and you know that. But it's actually, I think the direction you should be to provide to workshops, for meetings, to address this topic and not specifically as an underwriter.'",
        "'speaker_2': 'Those are kind of internal. Just wanted to be clear. It reminds me I was just questioning them as things would be improving in the future.'",
        "'speaker_1': 'It's still okay, Madam Clerk.'",
        "'speaker_0': 'I believe so.'",
        "'speaker_1': 'Okay. Is there anything we can clarify? Because I don't want to put you on the spot.'",
        "'speaker_0': 'I think I think the motion is clear. And I think that, you know, the resolution will be certified based on the motion, which is the first step that you guys are taking tonight.'",
        "'speaker_1': 'Okay. Councilor Harry Spencer.'",
        "'speaker_0': 'Thank you, Mayor. Well, the reason I'm asking is the resolution begins. Authorize is issuance of one or more series of pension obligation bonds. And that is, in fact, the first section. Council hereby authorizes the issuance of one or more series of bonds.'",
        "'speaker_0': 'And I actually think that that contradicts what we're talking about here. I think that this resolution has a lot more legal significance than is being suggested tonight.'",
        "'speaker_1': 'Either Mr. Levitt or Mr. Morales. Do you want to just agree with the city attorney?'",
        "'speaker_2': 'He was the one who actually gave me so and I see him chomping at the bit.'",
        "'speaker_1': 'Oh, you can me and Mike any time. Mr. Shannon, just raise your hand. Yes, go ahead.'",
        "'speaker_2': 'Mr. Mayor. Mr. Wozniak and I might tag team this, but the reason why section one of the resolution exists is that we cannot validate, we cannot bring a judicial action for a bond that don't exist. So if you are asking us to go file a judicial validate action validation action bonds actually have to exist.'",
        "'speaker_2': 'And that's a requirement under state law. Staff is giving you assurances verbally and in Section five of the resolution that they will come back to you before they're finalized. But if we take out Section one, there will be nothing for us to validate.'",
        "'speaker_1': 'Yeah. I actually was going to reiterate that probably not as eloquently as you just did, but it is that process has to take place for getting started on it. But there's still some checkpoints, if you will, in the in the the timeline.'",
        "'speaker_1': 'But go ahead. And even Mr. Resnick, do you want to add it now?'",
        "'speaker_2': 'Mr. City attorney said it perfectly. Section one and Section five, I think, accomplish what the council's looking to accomplish if they want to move forward.'",
        "'speaker_1': 'Okay. Thank you. Okay. Anything further? Mr. Morales, go ahead.'",
        "'speaker_2': 'Just want to clarify. The city manager really noted you cannot sell municipal bonds securities without approving the offer authorizing sale. Right. That is actually the one that designates what you talk about in your full disclosure, and it's your legal and fiduciary duty to review that.'",
        "'speaker_2': 'So in no way could Bond be sold without you authorizing that. And that document has not and isn't currently been generated. So there is no way legally you can issue or sell bonds without coming back to council and authorizing that specific document at minimum, as well as the amount and the size.'",
        "'speaker_2': 'It's just a number of things that have to be done. I believe the city attorney basically said you need to have a bond to exist in order for the judge to say, hey, I actually have this to to finance.'",
        "'speaker_1': 'Thank you. That was helpful. Okay. I think we're ready to have a real cover. Right. We've had a motion has been seconded. We've had a discussion. And.'",
        "'speaker_0': 'Clark Councilwoman Patricia Herrera. Spencer, no. Knox, right. Yes. Vela. Yes. Mayor, is he Ashcraft?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'That carries 3 to 2.'",
        "'speaker_1': 'All right. Thank you, everyone. Staff are consultants, our public speakers, council members. Good discussion. This is. It's complicated, it's big, it's important. And I'm glad we're moving forward on this important next steps. Thank you all. And, well, we'll be seeing more of each other, I think.'",
        "'speaker_1': 'All right, everyone. Goodnight. Well, not council and not, of course. Yeah. The consultants and Ms. to you can go head home. Or hopefully, maybe you're there. Okay, so now let's see. Madam Clerk, we've had signature communications, so we go to oral communications.'",
        "'speaker_1': 'Non agenda items. Do we have any?'",
        "'speaker_0': 'I his hand was up for the last item. But Jay Garfinkle I guess is not for this.'",
        "'speaker_1': 'Yes. Speaker Garfinkel. Four items. Not on the agenda, correct?'",
        "'speaker_2': 'Right. Thank you. I want to acknowledge that I understand the responsibility of being the only member of the public sufficiently interested or concerned to ask questions or make comments during these meetings. And I accept it humbly. This is a touchy situation.'",
        "'speaker_2': 'You know, please. I brought this up in a meeting a few weeks ago. Police departments across the country have learned that it was much better to be forthright immediately rather than delay giving out details when there's a police incident, even though there would be litigation expected down the road.'"
    ]
}