{
    "Lease Amendment for Alameda Marina with Pacific Shops, Inc.": [
        "'speaker_0': 'Okay. Thank you. So, then, Councilmember de. So you pulled item five J. Yes, I did. Okay. And whose? See, this report is community development. Do we have somebody who's on this? This is the, uh, the lease with Pacific shops for the second reading, correct?'",
        "'speaker_0': 'Yeah. Come on up to the microphone, just in case. Do you have questions or is this just you want to vote? No.'",
        "'speaker_6': 'Yeah, I want to remain consistent with my no vote the last time by voting no again.'",
        "'speaker_0': 'Okay. Thank you. So then let's take a motion. So this is the we're voting on the final passage, passage of ordinance authorizing the city manager, their designee, to designate to execute amendment to the lease with Pacific Shoppes Inc for Tidelands property located along Clement Street between Third Avenue, Clement Avenue, whatever, between Alameda Marina Drive and Willow Street'",
        "'speaker_0': ', commonly referred to as Alameda Marina to allow Pacific Shops Inc to exercise its lease option requires four affirmative votes. Okay, Madam Clerk, we need to vote. Oh, we have him. I'm sorry. I do have a motion.'",
        "'speaker_3': 'So move.'",
        "'speaker_0': 'The. Have a second.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'I have a motion from Councilmember Odia. A second from Councilmember Vela.'",
        "'speaker_1': 'Councilmember de san. Nope, not quite.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'I, i may ask.'"
    ],
    "Resolution on Recruitment and Hiring Incentive Policy for Lateral Police Officers.": [
        "'speaker_0': 'Why the motion carries for 2 to 1. Thank you. Okay. So we have dispensed with the consent calendar and we move on to our regular agenda items.'",
        "'speaker_1': 'Six days adoption of resolution amending the recruitment and hiring incentive policy for lateral police officers in the Alameda Police Department.'",
        "'speaker_0': 'Okay. And who's presenting? I think we have our H.R. director and our police chief. Come on up.'",
        "'speaker_7': 'Good evening, Madam Mayor. Members of the Council. Paul. Hillary, chief of police. Our director, Nancy Braunstein, is going to help me out with the slideshow. And she's also here to answer any questions that might be specific that I'm unable to answer.'",
        "'speaker_7': 'So thank you for allowing us to do this presentation tonight. This is, in my estimation, a very big deal for the police department, and I hope that you will see it the same way. As everybody knows, we've been struggling for many years now to bring our bring our sworn staffing up to our full capacity of 88.'",
        "'speaker_7': 'We have, for a variety of reasons, struggled with that. And it is it is not a situation that is ours alone as the slide that's flashing up before you shows. These are primarily articles that are referencing Bay Area police departments, but it is a nationwide problem and for reasons that we don't have enough time to talk about'",
        "'speaker_7': 'all of them. The big ones for us lately have been, as a lot of people in the room have experienced, the high cost of housing in the Bay Area has created a situation where a lot of departments in the East Bay are unable to have officers.'",
        "'speaker_7': 'Even well-paid officers cannot afford to buy a home, especially those with families and children. So they're commuting from long, long distances away, and it's frankly not sustainable. We've lost a handful of our officers over the last couple of years, probably five or six to be exact, to do the commute where they've gone somewhere to take a job'",
        "'speaker_7': 'with another police department for less pay, but with only a five or ten minute commute instead of a two and a half hour commute. We have done many things over the past several years to to try to fill the positions.'",
        "'speaker_7': 'And this is a short tenure slide with a little bit of a history lesson to let you know where our authorized staffing is, which is the darker column on the left. Um, we were at 92 back in 2009.'",
        "'speaker_7': 'We were cut to 88. Back in 2011, we lost four positions the same year that we closed the jail, and we've remained at that for the last eight years running, but we have not been able to get up to 88.'",
        "'speaker_7': 'The this slide is really a snapshot in time of January I'm sorry, December 31st of the year in question. So for example, I'll bring it to one sort of stark column, which is if you look at the difference from 2014 to 2015, we went from four down to ten down and it looks like that happened overnight and'",
        "'speaker_7': 'it didn't. Well, it did. And it didn't. On December 30th of 2015, five five officers, a captain, a sergeant and three officers left the department on full service retirements all in the same day. So overnight we went from five down to ten down.'",
        "'speaker_7': 'And that's why the 2015 slide reflects a bigger discrepancy. We've been up and down at various times during each of the years that have followed at one point, and Nancy and I talked for a minute and a half, I think we we actually were at full staffing and then immediately lost some people and and went backwards again'",
        "'speaker_7': ', not on the slide. But worth mentioning both to the council and to the community is that when I was hired back in 1992, the police department was had a sworn authorization number of 111. So the number the current number of 88 represents a 21% decrease in our staffing.'",
        "'speaker_7': 'The city, in large part, hasn't really understood why our staffing or service levels have dropped a little bit. But that is a huge reason why the 21% drop. The ten people that I'm missing now, I need and we need them for for for a series of reasons.'",
        "'speaker_7': 'But. We're just we're just having trouble filling the spots. And so that's what brings us to what we're trying to do today. Um, can you go to the next slide, please? So looking back at this slide, this shows our applications received, the people that actually made it onto the eligible list and then the very, very small column'",
        "'speaker_7': 'on the right is who we've actually hired. So we've maintained a very high level of scrutiny in our applications. We are not too careless in who we pick, very selective. Less than 1% of the people who apply get hired.'",
        "'speaker_7': 'And when you only have 274 or 69 people applying, as we did in 2013 or 14, we just don't seem to do as well. We made some changes that I'll get into in another slide where the city went from a closed recruiting process where we would just occasionally open up and accept applications and then close it again'",
        "'speaker_7': '. Back in 2015, we were able to successfully lobby the city to do open and continuous recruiting, and we now do backgrounds or I'm sorry, all boards every two weeks. And so that's why you see the application numbers jump up, jump up considerably in 2015.'",
        "'speaker_7': 'At the end of the day, you know, we picked up nine, ten, 11 and eight people, but we were already operating at ten down. And then we've had other attrition issues, people that either quit or failed the academy quit or failed the field training program or quit or failed during their two year probationary status.'",
        "'speaker_7': 'Um, all of that has led us to the point where we have been literally treading water to stay ten positions down for most of the last several years. We just hired four people, swore them in on November 19th.'",
        "'speaker_7': 'So they're all in the early stages of the field training program. We have two more recruits in the academy, one that will graduate in the early spring, one in the late spring. And then we have other people in in process and actually have a an applicant in the audience tonight who decided to come out and watch a'",
        "'speaker_7': 'city council meeting. So hopefully, hopefully in a year, he'll have a badge on his chest. The struggle for us hasn't always been visible to the public or to the to the city at large. What we have done over the years, and I've talked about it in some other settings, is we have removed people from special assignments and'",
        "'speaker_7': 'detectives or in the traffic unit and we've put them in patrol. That's the backbone of the department, always has been, always will be. And we have done everything we can to keep that staffing level somewhere between 40 and 45 officers.'",
        "'speaker_7': 'We're at 40 today. Uh. Hopefully going to 41 here in a couple of weeks because we have somebody nearing the end of the training program. The hidden cost of that is that we have fewer people in investigations. So.'",
        "'speaker_7': 'The backlog is bigger today than it has ever been before. We're still getting to our cases, but we don't we don't have the same complement of detectives because everybody's out in the street. The other thing that that does is it creates a ripple effect where we have officers who get into the and this happened with me and'",
        "'speaker_7': 'probably most of the people that work in the department. You get to about the five or seven year range and you're looking to spread your wings a little bit and learn how to do new things and get new challenges and go into detectives, go into motors and get special assignments.'",
        "'speaker_7': 'And I can't offer that to them right now. And that's that's hurting it's hurting us. It can, at its worst, cause people to leave and go somewhere where they're going to have more opportunities. The blessing and the curse of Alameda is that we're a small enough department, that everybody knows everybody, and we operate like a family.'",
        "'speaker_7': 'The curse is that there aren't a lot of positions that are available on a good day, and when we're ten down, there are fewer positions. So it creates and creates an overtime burden. We have police officers that are getting pulled in different directions, traffic enforcement.'",
        "'speaker_7': 'We've got children that have been hit going to and from school. We've got car break ins. We've got issues on Park Street that we've been dealing with. And and we've got the well-documented issues with homelessness around town that, frankly, the island is split on how we should handle it.'",
        "'speaker_7': 'And we try to do all of that. And the cops are doing the officers on the street are doing, I think, a very commendable job. Tiptoeing through all of that and working a lot of overtime. Most of what we're getting accomplished recently that the traffic, the stepped up traffic enforcement is all being done by officers on their'",
        "'speaker_7': 'day off or who are coming in early or staying late. We just don't have the bandwidth to do it with people during the regular duty hours. So I think that that is something that, again, to the naked eye people probably in the community don't realize that that's what happened.'",
        "'speaker_7': 'What's happening? Uh, our crime is up a little bit. I'm not here to say that the sky is falling. It's mostly property crime. Ah, violent crime is largely down. The numbers that we that we present, percentage wise, it's just statistically they're not significant numbers, but we have a significant issue with property crime.'",
        "'speaker_7': 'And it's again, it's a regional problem. Probably taking an extra report and a half per day of people who are getting their cars broken into some some level of theft, grand or petty theft. Now, I'll take that every day and twice on Sunday versus violent crime.'",
        "'speaker_7': 'But it is still an issue that affects the quality of life of the people on the island. And ten extra police officers would help us have people in investigations that would help us put hopefully a couple of people on motorcycles to do traffic enforcement and put some extra people on patrol and maybe on walking beats on Park'",
        "'speaker_7': 'Street and Webster Street. That's what I hope to accomplish. This is just a recent slide. The November numbers won't be out for another week or so, but in October you can kind of see in a descending way how many applications we received during the month where we are year to date.'",
        "'speaker_7': 'So 427 for the year. The numbers, obviously, by the time you get through the entire process, it's much smaller and the people that we hire is even a smaller number than that. So we're publishing this now internally at the department so that our employees can see what efforts are being made.'",
        "'speaker_7': 'And I'll forward that over to the city manager as well, so he can also see that next slide. So I talked about this a few slides ago. These are some of the improvements that we've made since 2016 to increase the number of applications open and continuous.'",
        "'speaker_7': 'I can't overstate what a big deal that was for us. We it was not uncommon for us to go to recruiting fairs and have people say that they were interested and we'd hand them an application and say, you know, we'll let you know when it's when we're open.'",
        "'speaker_7': 'And by the time we got around to it, they had already moved on somewhere else. Now, now we have the ability to bring people in immediately, and we are doing that. We get all boards scheduled within two weeks of the application.'",
        "'speaker_7': 'We've been attending job fairs and doing kind of innovative. We've gone to CrossFit CrossFit events. We've gone to. We had a female officer present at the women leaders in law enforcement. We're doing all kinds of things to try to increase our visibility.'",
        "'speaker_7': 'But we have you know, we have a $10,000 recruiting budget. And, you know, we could we could probably at some point try to beef that up a little bit. Back in 2017, some of you were here when we implemented the initial lateral hire incentive programs, which we greatly appreciated.'",
        "'speaker_7': 'We're continually evaluating the changes to the hiring process and trying to expedite these things because frankly, everyone, it's a it's a buyer's market. And every department, every department in the Bay Area is looking to hire people. There are several departments in the East Bay in Alameda County that are down in excess of 20 officers.'",
        "'speaker_7': 'Percentage wise, it's similar to us. But, you know, it's a big it's a big deal. I think the county sheriff's office might be down as many as a couple of hundred right now. So we're all hiring or trying to recruit the same folks.'",
        "'speaker_7': 'It's a buyer's market and a lot of times the winner goes to the first offer. And so we're trying to by doing these things and by hopefully getting this approved tonight, as I mentioned to another area, chief, I'm trying to improve my place in the line and get us up to the front.'",
        "'speaker_7': 'And that's why we're here tonight. Next slide, please. So on the left side, February 2017, the Council adopted the current existing lateral incentives, and on the right is what we're proposing and hopefully, hopefully going to get approved tonight.'",
        "'speaker_7': 'I will tell you quickly that $30,000 sounds like a lot of money and it is a lot of money. It doesn't get paid out all at once. A fully burdened police officer with salary and benefits is probably a little north of $200,000 a year.'",
        "'speaker_7': 'So if we filled ten of these positions, it's basically costing us one and a half bodies. It's not new money. It's money that's already been allocated in our budget. These are these are salary savings, which you all know that we've had a couple of million dollars for a few years running.'",
        "'speaker_7': 'And I appreciate that. Thank you very much. So I think for a relatively small investment, I'm hoping to attract people who might already. And I think that they're out there, that there are people who are sitting on the fence who are thinking about making a move.'",
        "'speaker_7': 'And I'm hoping that this will, in addition to some other things, will help incentivize them to come our way. The reduction of the probationary period from two years to one year is going to be a big deal. Also, if you're a police officer that's already been working for four or five, six, eight years in another city to'",
        "'speaker_7': 'to leave the comfort of that civil service position to it to a city where you now are at will for two years, is a big pill for people to swallow. And I don't think that we need to do that for the laterals.'",
        "'speaker_7': 'I think one year is plenty of time for us to evaluate whether or not they can and should remain on the job. We would we would retain the two year probationary status for new hires, new recruits. The the referral incentive used to be only.'",
        "'speaker_7': 'Offered to our existing police employees. We are now proposing to extend that so that anybody who works for the city of Alameda, who might know somebody who's interested in a career in law enforcement and is a lateral not not not a new recruit, but a lateral officer that we would offer you two additional days of vacation time'",
        "'speaker_7': 'or a $1,000 non-personal lump sum bonus. If you bring us somebody who makes it get, makes it through the process, gets hired and stays on for is it three years or two, three, three year commitment? So hopefully that will help some people in the city who might know, some folks that are thinking, I've I've already received a'",
        "'speaker_7': 'couple of phone calls. So I think in anticipation of this going well. So I'll keep my fingers crossed looks like. There you go. So if you have any questions, I'm happy to answer them again. I can't tell you enough, personally and professionally how big of a deal this would be to the police department.'",
        "'speaker_7': 'I can't guarantee its success, but I am super optimistic that it will help move us to the front of the line. Help us fill the vacancies and stay ahead of. What we anticipate are going to be additional departures in the next year or two.'",
        "'speaker_7': 'There are going to be 13 people, including myself, who are eligible. It doesn't mean that they will leave, but they could. And we have to keep that in mind. Every year I've got a list on my desk and I know January 1st exactly how many employees are in that that 350 zone, and that's going to be 13'",
        "'speaker_7': 'in a month. So they won't all go, but I can guarantee you that six of them will. I already know that to be true. So we're trying to catch up. Bring it. Bring us up from the nine that we're down nine or ten down today and then stay ahead of the people that are leaving next year.'",
        "'speaker_7': 'So with that, if you have any questions.'",
        "'speaker_0': 'Thank you for Larry. Before we do any clarifying questions on the report, before we do our discussion, because I think we may have a public speaker when. Public Speaker Any clarifying questions on the report? Councilmember de SA.'",
        "'speaker_6': 'Good question, no. Several slides ago there was a acronym DHS.'",
        "'speaker_7': 'Personal History statement. I forgot about the acronym thing. I said personal history statement. So basically they fill out they fill out their whole life story in a in a booklet. And then we go through that. Some people are are eliminated during that process.'",
        "'speaker_7': 'And then other than for other folks who continue in the process, it becomes the basis for the background investigation, becomes fact checking. Thank you.'",
        "'speaker_0': 'That's Councilmember Vela.'",
        "'speaker_5': 'Chief, you had mentioned that the cost of living is a barrier for some folks. Some cities have have done like moving bonuses and things like that. Did you look at that at all.'",
        "'speaker_0': 'Or a.'",
        "'speaker_5': 'Little bit? How would this compete with that?'",
        "'speaker_7': 'I it's hard and it's hard. It's hard to say. We did the city manager I did consider a proposal that was actually brought forward by a couple of my employees about. The possibility of an apology for bringing this out.'",
        "'speaker_7': 'We're not moving forward with it right now because it would have been a police only thing. And I think if we're going to do this, in fairness, it really should be offered to other departments, other city employees, where they are.'",
        "'speaker_7': 'There's some form of a a either a preferential loan, low interest loan, some kind of the city might provide the the employee with a down payment assistance that could be repaid through, you know, payroll withdrawal or something like that.'",
        "'speaker_7': 'Right. It it gets complicated. It's totally legal to do. And there are a few places that do it, I think. San Mateo County does it, but it's it's it's almost like a lottery.'",
        "'speaker_0': 'Where.'",
        "'speaker_7': 'It's not they don't do it for everybody. You can apply for it. And then there's a handful of folks that are lucky enough to get selected and then they can they can qualify for that program. I think we sort of have to suss all that out and it would take us some time.'",
        "'speaker_7': 'Mm hmm. Interesting note. San Mateo County is I think the poverty line there has now been designated at $100,000 a year for your household income. So if you're going to be a brand new police officer and you're making 105 or even hundred $10,000 a year, you still have to come up with a down payment in a county'",
        "'speaker_7': 'where the median home price is close to $2 million a year. You're still going to be commuting from Tracy? Mm hmm. And that's. And that's a problem. So there are cities that have similar hiring incentive bonuses. Palo Alto is 25,000.'",
        "'speaker_7': 'San Mateo is 30. We've lost two people to San Mateo, by the way. But they're not necessarily attracting the candidates because, again, the cost to buy a home in that area. Mm hmm. Makes this look like a bargain on the East Bay.'",
        "'speaker_7': 'Mm hmm. It's. It's just. It's a difficult time. I mean, I can't even imagine being a 20 or 30 something with a good job and good benefits. But the prospect of buying a home is a million miles away.'",
        "'speaker_5': 'And this is the 30,000 especially passed out the way that it is. Is that going to be sufficient, do you think? How did we end up with the 30,000? Because we are competing with other cities out there. I know Fremont recently passed something.'",
        "'speaker_5': 'They've been down by a number of positions.'",
        "'speaker_7': 'So I guess we don't know because we haven't tried it yet. But the the concern I would have would be if we if we give $30,000 to somebody and then they don't stay. Mm hmm. I think getting it back could be.'",
        "'speaker_7': 'I think we want to incentivize people to stay, not just to not just to come through the door, but to stay.'",
        "'speaker_0': 'Mm hmm.'",
        "'speaker_7': 'And so I and the other cities that are doing this all do it incrementally. Fremont is 15,000, and I think they do it 7500 up front, 7500 a year when they've finished probation or something like that. So I don't think anybody pays it all out at once.'",
        "'speaker_7': 'Mm hmm. Um, I think it would be. Fiscally prudent for us to just to to part it out that way. And I think I think it will be successful. I have already been contacted by a few chiefs who.'",
        "'speaker_0': 'Are mad at you.'",
        "'speaker_7': 'I'm not mad. But I mean, you know, again, it's a friendly it's a friendly competition. But but it's a competition. I mean, my brother works at Berkeley and we oftentimes talk about many things related to work, but we don't discuss who's on our radar.'",
        "'speaker_7': 'For that reason, I mean, we have some awkward moments of silence sometimes about certain people. And because it is it's a it's a competition and it's a buyer's market. Mm hmm.'",
        "'speaker_5': 'And my final question is, I know that you're proposing reducing the probationary period. Did you consider reducing it further for somebody who's been an officer in good standing for so many years? I think.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'I think that there's there isn't necessarily a monetary value that you can put on that, especially when people are walking away from being vested in a retirement system, things like that.'",
        "'speaker_7': 'So it's a good point and I'm going to look over my shoulder because I should know this and I don't. But I believe that post requires I believe.'",
        "'speaker_0': 'In post would be.'",
        "'speaker_7': 'Well, I'm sorry, the California peace officer standards in training. So that's the agency that sets all of the training and certification requirements. I could be wrong.'",
        "'speaker_0': 'They're all grim. That's a.'",
        "'speaker_7': 'Bad one. I could be wrong. I don't I can't think I don't think that there's a single law enforcement agency in California that has a probation period that's less than a year.'",
        "'speaker_5': 'Okay.'",
        "'speaker_7': 'I will double check that, but I don't think that's the case.'",
        "'speaker_5': 'What would it be more helpful to just say that the minimum like. And this is just a hype like, I suppose. But would it be more helpful to say that the the probationary period is equivalent to the minimum, you know, the minimum required by post or something like that?'",
        "'speaker_5': 'Would that give you more?'",
        "'speaker_7': 'Um, yeah. And we can look at it again. I don't I don't have it. I don't have it memorized.'",
        "'speaker_0': 'Well, let the chair director come up the mike. What I would say is that actually it was Paul. When you check with your folks. It was actually labor who brought up reducing it from 2 to 1.'",
        "'speaker_4': 'And one of our laterals who.'",
        "'speaker_0': 'Felt that confident that that change would make a difference. So that's why we left it at one.'",
        "'speaker_5': 'Yeah, I'm not I'm.'",
        "'speaker_0': 'So I'm at this point, we're just doing clarifying questions because we'll do our discussion after we have public comment.'",
        "'speaker_5': 'My my question is just kind of how did we get to it and do we think it's going to be effective? Do we think something less than that would be effective?'",
        "'speaker_7': 'So here's here's the definitive answer from post probation periods range from 12 to 24 months, although a few agencies have reported a six month probationary period. The commission regulations require in bold print that every full time peace officer serve in a probationary status for not less than 12 months from the date of appointment.'",
        "'speaker_0': 'Understood. Thank you. Thank you. Any other councilmembers with clarifying questions, Councilmember Odie?'",
        "'speaker_3': 'Thank you. So I was going to ask if you evaluated other successful programs, but I think you answered that in Customer Miller's question. But in doing that comparison of places where these type of incentives have been successful, are there any other ideas that you found that maybe you decided not to pursue at this time besides maybe the'",
        "'speaker_3': 'mortgage or homeowner assistance?'",
        "'speaker_7': 'Oh, I think honestly, I think I think that's. That's the big one right now that in the probationary period. So I, I spoke with another when I was in Chicago for the International Police Chiefs Conference last month. I, uh, I had dinner and met with a lot of different chiefs during that time.'",
        "'speaker_7': 'And there's one area chief who told me that they had lost a handful of officers to another agency who offered retiree medical and their agency did not. And they lost a bunch of people. Well, we already offered that.'",
        "'speaker_7': 'So that would be a big deal if we didn't. I would probably be asking you for that right now. But since we already do, one one agency has lost half a dozen people to another agency who who now offer that to their employees.'",
        "'speaker_7': 'But since we already do, I think there are some things here that are the foundation is really good. We're just trying to build up on it a little bit.'",
        "'speaker_3': 'But you have to be here five years for that, right? Or ten years. Ten years medical. Yeah. The ten. Five. Okay. Yeah.'",
        "'speaker_7': 'Yeah. It was it was longer when I first got hired, but it was reduced to five several years ago.'",
        "'speaker_3': 'Okay. Thanks for the answer. Sure.'",
        "'speaker_0': 'No problem. Thank you. And Councilmember Knox White, do you have any clarifying questions?'",
        "'speaker_2': 'No options at the time. Thank you.'",
        "'speaker_0': 'Thanks. Okay, so then we'll go to a public speaker or speakers.'",
        "'speaker_1': 'Only one will.'",
        "'speaker_0': 'Be when.'",
        "'speaker_1': 'Jenny McCarthy.'",
        "'speaker_0': 'My nap.'",
        "'speaker_4': 'Good evening, Madam Mayor. Council members that returned my note around. What is this?'",
        "'speaker_0': 'I don't know. That's new to me too. But it's so fancy. They're going to wrap it as a Christmas present.'",
        "'speaker_4': 'My name is Janet Mckelvie, and I'm the executive director of the Downtown Alameda Business Association. And our downtown district and its merchants have felt the effects of cuts to the police department over the years. Our district lost its beat cops some years ago, and it has indeed been a trial.'",
        "'speaker_4': 'Our hardworking business owners want and need their employees and customers to feel safe and secure. Having additional officer officers on the street is key. The Downtown Association enjoys a first rate collaborative relationship with Chief Larry and his team, and we look forward to supporting an effort to recruit and hire more qualified personnel.'",
        "'speaker_4': 'It seems that the plan presented tonight is relatively inexpensive and a proactive way to attract qualified officers who can be out on the street in a fraction of the time it takes to produce new recruits. Please join us in supporting our excellent police force, as they do to compete and bring additional officers to our island community.'",
        "'speaker_0': 'Thank you. Thank you. And that was all our public comments. So I'll close public comment and we'll go to council discussion. And actually, I'd like to lead this one because I was in attendance at a meeting today at the police department with Miss Maccabee and probably 2020, more than 20 of the businesses just from Park Street, because'",
        "'speaker_0': 'you may or may not know that there's been a spate of petty and not so petty crimes and some that have resulted in personal injury. And to the extent that some of the park merchants are even considering not opening in the evenings and during the Howard holiday times is when we always have the stay open, stay late'",
        "'speaker_0': ', open late on Thursdays or even on Saturdays because, you know, people can shop and bring more revenue to these businesses and indirectly the city. And it it was quite compelling to hear person after person lament the fact that we just don't see that police presence.'",
        "'speaker_0': 'And Chief Larry did a good job of explaining the five sectors that the city's divided into and the numbers that I don't even want to announce in public. But it's they're they're stretched thin. So my feeling is this is not an area where I want to second guess.'",
        "'speaker_0': 'The police chief and our h.r. Director, who have worked closely together, have looked at other departments in the in the bay area because it's true we're competing with all of them. And what just I mean, in the council, we all get the same emails from our constituents.'",
        "'speaker_0': 'We have had children and adults too. But just since the start of the school year, ten children have been hit by cars while they've been either walking or on bicycle. And we have seen this increase in crime in our business districts and not just Park Street, South Shore Center as well.'",
        "'speaker_0': 'It's private development. But, you know, they they're experiencing that car break ins. We hear about almost every day package thefts from porches and the issue of homelessness. And I have to give a big shout out to our police officers because they have the the homelessness outreach team.'",
        "'speaker_0': 'They're highly trained in how to approach and and work with unsheltered people. And there's no one way to do it. But it's done with a lot of sensitivity, getting people referred to other places where they can be sheltered, and then to make sure that, you know, there's not criminal activity, but yet we're treating people humanely anyway.'",
        "'speaker_0': 'We we expect a lot of our officers and we can only stretch people so thinly. And I worry that I mean, I think it's great that they have stepped up enforcement around traffic and speeding. We seem to be seeing a lot of that and just inconsiderate driving.'",
        "'speaker_0': 'But to do that, as we heard the chief say, he's taken people off of working at as detectives and also bringing people in and to work overtime. And it's just, you know, that's never a good thing when people people need their downtime and they need to rest.'",
        "'speaker_0': 'So I think this is a well thought out proposal. I think it's something that is worth adopting in and let's give it a try and see how it goes. So that is those are my remarks. Who would like to go next?'",
        "'speaker_0': 'Councilmember Odie.'",
        "'speaker_3': 'Sure, I'll go next. I don't have much to add, except we had a discussion about the children getting hit. It wasn't maybe a month ago and I asked our city manager to bring back ideas and things that we could do to help with police recruitment.'",
        "'speaker_3': 'So I appreciate that. And and I also appreciate the fact that we have deployed our limited resources in a way that makes them most effective for providing on the ground services. And I just had that experience about a month ago where there was a middle of the night accident in front of my house, and they were there'",
        "'speaker_3': 'quickly. And I just sat there and watched in awe of how quickly our police and our fire personnel just worked just to save those people and clean it up and investigate. And so that was super impressive. And, you know, to me, maybe I'm a little biased, but I think Alameda is the best place to live and is'",
        "'speaker_3': 'probably the best place to work. So my only ask on this is I'm happy to support it. But you know, if you need more and come ask us because I want to solve this much problem as much as you do, and I'm happy to give you whatever support you need.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'You even just go down the line. I'm Councilmember Vella.'",
        "'speaker_5': 'So I'm ready to support this tonight. I do still have concerns about how we retain our officers because we are losing them. And this while this will help us bring in laterals. I want to find a way to shore up the folks that are here.'",
        "'speaker_5': 'And I think we should. I think the next part of figuring out this problem is also figuring out who's leaving and at what point in their career they're leaving. And what we can do to Councilmember Oates point what we can do as a city to to incentivize them staying.'",
        "'speaker_5': 'And that's where I think looking at some of these other options, whether it's a mortgage assistance or something like that, not all of our departments have this unique problem of being this understaffed for this long. And this isn't kind of one year of being understaffed.'",
        "'speaker_5': 'This is multiple years and it's getting increasingly worse. And I don't want to get to a point where we're so understaffed and we're overworking our existing officers that there's burnout. I think there's there is something to be said about quality of life and time off the job.'",
        "'speaker_5': 'And I think it's incredibly important, especially for our first responders, to be able to have that. And I think if there's you know, I think this is something where we're going to need to be creative about making sure that we can find those solutions.'",
        "'speaker_5': 'But I do think that we need to figure out that retention portion of this, because I don't want to lose folks that we're training up and getting to a spot where we've done that solid recruitment portion. We've weeded out the best of the best.'",
        "'speaker_5': 'We're investing a lot in them to get them ready to go, and then they leave after three years or they leave after five years. And I think that that that means that we're not supporting the folks who are here for the long term.'",
        "'speaker_5': 'In fact, we're making it harder for them to to grow. And as our chief said, in their careers. I would also say, in terms of the referral, the thousand dollars on the referral, I'd be willing to increase that, especially if it if it results in us.'",
        "'speaker_0': 'You got anyone in mind?'",
        "'speaker_5': 'Well, no, no. But I think that, you know, you know, especially if the person's coming on, you know, doubling that or something like that and then paying them the thousand, you know, kind of upfront. And then a thousand later, once, you know, once they passed academy and then a thousand after they've stayed three years or something like'",
        "'speaker_5': 'that, that's not a lot of money. And that might mean that we get real serious and obviously we're getting a police officer out of it. So I think tacking on an additional thousand dollars onto that wouldn't I'd be willing to do that.'",
        "'speaker_0': 'When we did the.'",
        "'speaker_5': 'Motion. Okay. And, and yeah, I just can't stress enough. Let's find a way to figure out how we do the retention portion of this and if there's a way to incentivize people even staying on after they've reached their three at 50, which I know is enticing to leave.'",
        "'speaker_5': 'But if we can find a way to to keep those solid folks here who have that breadth of knowledge and experience and and and keep them here instead of leaving at the 350. But let's work on that because we do have really good officers and they have a knowledge of the community.'",
        "'speaker_5': 'And I think that we're going to need to retain people just as much as we need to recruit them.'",
        "'speaker_0': 'Thank you. And Councilmember Odie, I'm sorry, Council Vice Mayor Knox White. I look up like Australia. Is that. I don't know. It's really down. It's down. Yeah. He's down under.'",
        "'speaker_2': 'That.'",
        "'speaker_0': 'I remember.'",
        "'speaker_2': 'I know it was back in January. I just got the one. You landed on it. And I'm really going to be coming forward and I think I'm going to have to address my emotions. I would love to see some of my reporting matches in general, and not just for me to be moral, but I am going to'",
        "'speaker_2': 'remember those comments about, you know, pretending or attacking new and now we're creating more. We can be environmental issues.'",
        "'speaker_0': 'And I think those last words were, I'm ready to support. Okay. Councilman Rudy.'",
        "'speaker_6': 'So I just want to quickly say thank you very much, Chief, for the service that you, your men and women do for the citizens of Alameda. I think we're renowned in the Bay Area for being a safe place.'",
        "'speaker_6': 'And I know, you know, certainly the data might indicate a little hiccup there. But but I think all in all, we're really safe place. And it's a testament to the work that your men and women do over there at the APD.'",
        "'speaker_6': 'So thank you very much. And I just wanted to quickly say that, you know, if there is any modifications you need to do to this, you know, program, you know, do not hesitate to make modifications if you see it's necessary to be done.'",
        "'speaker_6': 'So I look forward to the implementation of this. Thank you.'",
        "'speaker_0': 'Okay. Thank you. So we I am I'm looking for a motion to adopt this resolution amending the recruitment and hiring incentive policy for lateral police officers in the army to police department. Does someone want to make a modified motion?'",
        "'speaker_0': 'And I'm assuming that it would be okay with the chief. I see thumbs up there. So. Councilmember Vela, I'm not sure I should say the staff. Is there any city attorney, legal eagle, anything I should be mindful of?'",
        "'speaker_8': 'I'm sorry.'",
        "'speaker_5': 'Are we allowed to make a modified motion?'",
        "'speaker_8': 'Yes. Yes, Madam Mayor.'",
        "'speaker_0': 'Okay, good. I'd like a short, succinct answer. I don't think it could have been much shorter. Councilmember Vela, take it away.'",
        "'speaker_5': 'So I'd like to make a modified motion to adopt staff's recommendations. Do you want me to read the resolution.'",
        "'speaker_0': 'For the whole thing?'",
        "'speaker_5': 'That the amending the recruitment and hiring incentive policy for lateral police officers in the Alameda Police Department. The one modification I would like to make is to double the referral incentive from $1,000 cash to $2,000.'",
        "'speaker_0': 'Right. And actually, the resolution doesn't have the dollar amounts. Right. But the specifics. But it's in the in the. I was in the policy, too. So. Okay. So so we have a motion to increase that lump sum referral incentive bonus from 1000 to 2000 and otherwise the, the ordinance would remain the same.'",
        "'speaker_0': 'Or the resolution of the resolution. It's a resolution. Okay. So we have that amended motion to have a second. Yes, second. Okay. It's been moved by Councilmember Vela, second by Councilmember Ody will take a voice vote.'",
        "'speaker_1': 'Councilors decide. Yes, not quite. I'm Odie. Yes, Bella. I mayor as the Ashcroft.'",
        "'speaker_0': 'Yes. Motion passes unanimously. Thank you, everyone. Good work. Okay, I'll make an exception to my no applause party for that. I think it's applause worthy. And thank you all, all of you APD personnel in the audience. Thank you for all the good work you do for us.'",
        "'speaker_0': '24 seven 365 days.'",
        "'speaker_7': 'Just like to. These guys have all been here more than 20 years.'",
        "'speaker_0': 'Thank you. Thank you. All right. Very nice. Okay. All right, then. We are moving on to item six B. But before we do, Councilmember Odie has asked to to make a comment.'",
        "'speaker_3': 'Sure. I just. Two quick sentences. As previously indicated, I personally chose not to pursue a claim against the city. It therefore feels appropriate for me to recuse myself from this particular vote in favor of allowing my colleagues to discuss and decide.'",
        "'speaker_0': 'Thank you, Councilmember Odie and Councilmember Vella.'",
        "'speaker_5': 'So I would like.'",
        "'speaker_0': 'Let's actually let's make a given moment for Councilmember Odie to step out of the room. He. Thanks. Councilmember Vela.'",
        "'speaker_5': 'I was wondering if it would be possible to bifurcate this so that I could there be to essentially to I'm looking to our city attorney about how to word this, um, to, uh, votes.'",
        "'speaker_8': 'So maybe I can provide some assistance.'",
        "'speaker_0': 'To the station.'",
        "'speaker_8': 'It is my understanding that Councilmember Val's request is to bifurcate this hearing so that the Council hears this policy in two different time segments. It would be a policy possibly applying to events occurring prior to today where a request for reimbursement could still be made.'",
        "'speaker_8': 'That would be phase one, whereby I.'",
        "'speaker_5': 'Would recuse.'",
        "'speaker_8': 'That. Councilmember Vela would choose to recuse herself. And then if the council chose to do that, then the Council would have a second part where the Council considers the policy again for all activities occurring after today, and during which time Councilmember Vela would not recuse herself if the Council chose to bifurcate this hearing by three votes, three'",
        "'speaker_8': 'affirmative votes to do so. The one thing I would caution the Council is that the second part of the hearing could not influence how the council made its decision on the first part. In other words, if the council wants whatever decision the Council makes on past activities and how a policy would apply could not be changed as'",
        "'speaker_8': 'a result of discussions undertaken in Part two. And so I believe that as councilmember of this motion, yes.'",
        "'speaker_0': 'And Councilmember Vela would be allowed to make and vote on this motion.'",
        "'speaker_8': 'Yes, Madam Chair.'"
    ],
    "Resolution on City Council Policy for Legal or Other Fees Reimbursement.": [
        "'speaker_0': 'I see. Okay. So you want to make a motion? Yes. You're welcome to make a motion.'",
        "'speaker_5': 'So my motion would be to bifurcate this hearing into two parts. The first part I would not participate in, I would recuse. And that is for. All events occurring prior to this, for which there could be a claim filed.'",
        "'speaker_5': 'And then the second vote would be, uh, which I would like to participate in would be for any events happening after the adoption of this policy. Uh. Where in a claim could be filed.'",
        "'speaker_0': 'Okay, we've had a motion. Do I hear a second? If someone wants 2 seconds so we can have discussion, that could happen. If no 1 seconds, the motion will die for lack of a second.'",
        "'speaker_2': 'I'm sure you have got no idea what you think we discussed briefly.'",
        "'speaker_0': 'Okay, I take that as a second. Okay. So it's been moved by Councilmember Vella, seconded by Vice Mayor Knox White. Did you want to lead the discussion? Vice Mayor.'",
        "'speaker_2': 'I understand my question, and I believe it's going to get to the issue of how we have the conversation. I think that there are a few things that I'm a little concerned about how we can be comfortable using language in conversation, but not playing out in the second part, where in a way you can also say, you'",
        "'speaker_2': 'know, we're not talking about now we are going to discuss this problem adequately in North Carolina. There are currently no jobs.'",
        "'speaker_0': 'He still has a flaw. Are you?'",
        "'speaker_2': 'I'm not clear. I can try to clarify.'",
        "'speaker_0': 'I I think he was saying that it was would be difficult to keep the issues separate was what I heard. Okay. All right. Council Councilmember Desiree.'",
        "'speaker_6': 'Well, thank you. I think the thing that concerns me is that. If there is litigation. I'm concerned that if we proceed down this path, if I say something in a way that. Could be injurious. So I just I'm not.'",
        "'speaker_6': 'I just have to be careful about that. And I'm not sure I can be that. Eloquent and trying to do that song and dance. It just seems to me if we just have a clean discussion based upon what's in front of us.'",
        "'speaker_6': 'Because. As a council member speaking, you know, from from my perspective. I don't see how even though there might be a bifurcation, I don't see how I would have two different thoughts just because there is this. Procedural layer that we have imposed.'",
        "'speaker_6': 'So if I'm not and if I'm not going to have two different speaking patterns, I just want to make sure that. I don't see something in one hand that potentially proves injurious if there is litigation. So to me, the wiser course of action is just to proceed.'",
        "'speaker_6': 'Like we had agenda this on. So.'",
        "'speaker_0': 'And I'm sorry I didn't. Okay. Thank you. Councilmember Desai, for my part, I favor action that is simple and straightforward, because I think that at the end of the day, that's easier for the public to follow and understand our thought processes.'",
        "'speaker_0': 'And I also go back in recent history to the reason that we're even considering this policy tonight is it was one of the recommendations that came out of the grand jury report and the council, the three non recused council members voted unanimously to adopt all all of the recommended policies of the grand jury.'",
        "'speaker_0': 'And so I see this as a continuation of finishing that task that we started. This is just one of a number of policies that will be coming forward to us. But, you know, it's taken staff time to put this together.'",
        "'speaker_0': 'So while I appreciate the motion to bifurcate, I cannot support it. So, Councilmember Vela.'",
        "'speaker_5': 'Can we hear from the city attorney because there was a question initially posed by Vice Mayor Knox White.'",
        "'speaker_8': 'I think the vice mayor's question and if I get it wrong, the vice mayor can correct me. Was that would it you know, what would the vice mayor would have which would he have to compartmentalize his thoughts between the two processes?'",
        "'speaker_8': 'The answer's yes. The law authorizes you to do it if the council chooses to vote that way. But you do have to compartmentalize your thoughts so that you are taking two different actions so that you would. And I'm hoping that answers your question.'",
        "'speaker_8': 'And if I missed understood your question, I hope you'll re-ask it so I can provide a better answer.'",
        "'speaker_9': 'Thank you. Now, you know, if there was.'",
        "'speaker_2': 'A breakthrough in order to turn signals to computer. I think you're going to have a little bit more information before on and understanding how I think we may forgetting the first time taking care of your arm in a situation where the discussion in the second part of June is somehow still playing out, and then the ongoing issue'",
        "'speaker_2': 'that no one has ever been. Well, you know. Little legal issue, one of the leaders of a conference in Europe. I'm struggling with how our nation can achieve the kind of discussion in which we actually have a conversation and don't really bring them.'",
        "'speaker_2': 'Have you done that? I think you design the discussion forum together, but I you know, I that that's how we how we understand. I mean.'",
        "'speaker_5': 'So can.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_5': 'So I think that there's a number of different portions of the proposed. Well, first of all, it's a council policy. And so as it's a policy as applied moving forward to events that. Potentially could apply in the future, I feel like.'",
        "'speaker_5': 'I should be allowed to weigh in on those as it especially for the elements that do not necessarily relate to even the portion related to the Council. There's other elements of the policy that include other things. I suppose I could bring a referral for those matters if it's not discussed to those specifics.'",
        "'speaker_5': 'In fact, the things that I care about don't relate at all to the Council, and that's what I had wanted to discuss. But it's I understand the conflict, which is why I'm trying to bifurcates it so that it doesn't at all apply and that the two to anything where there could be a potential conflict for things that'",
        "'speaker_5': 'have occurred.'",
        "'speaker_0': 'Thank you. Are there any further council comments or questions? Okay. We've had a motion. We've had a second to the motion to bifurcate this this item of motion. Second. All in favor. Oh, I'm sorry. Oh, sorry. So we do roll call votes.'",
        "'speaker_1': 'Thank you, Councilor of dissent. No, not quite.'",
        "'speaker_2': 'I know.'",
        "'speaker_1': 'Vela, I and Mayor, as Ashcraft know.'",
        "'speaker_0': 'That fails. All right, so the motion fails.'",
        "'speaker_5': 'And just to confirm, I can bring a referral for the. I'd like to get it.'",
        "'speaker_8': 'Councilmember Avila In theory, if a referral is forward looking, you likely could do so.'",
        "'speaker_5': 'Okay, thank you.'",
        "'speaker_0': 'Thank you. Okay. Who's presenting on this? I will. All right. And. And we can. Can we see even just fine on the screen? If he stays where he is, he doesn't need to come. Okay. Perfect. Okay.'",
        "'speaker_8': 'Good. Good evening, Mayor and Council. And today we bring forward to you one piece of the recommendations that you directed us to bring back to you as a part of your adoption of the grand jury recommendations. The grand jury made a recommendation, and it's it's number three of the recommendation that asked the council to consider a policy'",
        "'speaker_8': 'whereby council members would not be entitled to reimbursement from the city for legal or other fees incurred as a result of such persons knowing violation of the city charter. We've taken the council direction which was to bring this back to you before the end of the year, and we are doing so to you for you tonight.'",
        "'speaker_8': 'I want to add a couple of things that we've received in terms of comments so that the Council can have a full consideration. One was that we received comments to indicate that it may be helpful to lead with something to the effect of to the extent authorized by law and and not otherwise preempted.'",
        "'speaker_8': 'While we recognize that that preamble exists in every policy in the city. For this policy, there may be utility to include this preamble explicitly. So we are recommending that you consider that as part of your discussion tonight.'",
        "'speaker_0': 'To the extent allowed, say it again.'",
        "'speaker_8': 'To the extent authorized by law and not otherwise preempted. And I'll just interrupt my presentation to indicate to you that it is my understanding that the city clerk will be putting the substance of this policy on the screen for you.'",
        "'speaker_8': 'So that much like what you did with the grand jury responses, you will be able to have live discussions, direct the city clerk to make life changes, and you and the public will be able to see it on the screen.'",
        "'speaker_8': 'And so that preamble is one recommendation we're making to you tonight. We've received another communication, which was that perhaps this policy should apply to boards and commissions. We don't have any concerns with that, though. That was not part of the grand jury recommendation.'",
        "'speaker_8': 'And so we did not include it. But the council chooses to do so. You could direct you can give us that direction tonight. And finally, we've received some communications regarding delegation of authority there. We've received some concerns with respect to, in particular, delegating decision making authority to the city manager or the city attorney, especially with respect to'",
        "'speaker_8': 'council members, because both the city manager and the city attorney are retained at the pleasure of the council, and that delegation may not be appropriate.'",
        "'speaker_0': 'Well, and it wasn't I'm sorry to interrupt, but it wasn't just decision making. It was a determination of whether a council member had.'",
        "'speaker_8': 'That's right. That's right. And to be more specific, it's, you know, to to make the decision to to make the determination of whether or not a council member had indeed violated a charter provision or an applicable statute. The comment we received that it was a direct report of the council may not be the best suited to make'",
        "'speaker_8': 'that determination. And we that is a point well taken and it is something that the council could also make modifications to tonight. One solution could be that for council members, if the council wishes to delegate, that may only be to special counsel.'",
        "'speaker_8': 'All of these potential changes are at the Council's disposal, and we are ready to answer your questions.'",
        "'speaker_0': 'Thank you, Mr. Chen. Comments as well. Any clarifying comments and questions and do we have public speakers? We have to public speaker. So Council, at this point, let's just have any clarifying questions or comments you might have that we'll hear from our public speakers.'",
        "'speaker_0': 'Then we'll come back and discuss. Councilmember de SAC Councilmember I'm Vice Mayor Knox White.'",
        "'speaker_2': 'I think my only question would be, I think I am concerned in the media environment and my own students, I know right now is going to be the winner because our income line has been touched by and we can play a little bit of that in the council by an individual from the point of view of innovation'",
        "'speaker_2': 'about how to impress me, perhaps some some form of formal determination of one of.'",
        "'speaker_0': 'Oh. Did you understand the question? You that?'",
        "'speaker_8': 'I think so. There was a little bit of garbled communications, but I think the question was, you know, who's making the determination to delegate? And the answer to that question is that the policy as written is that the city council or a majority of the council will make the decision to delegate, if any.'",
        "'speaker_0': 'I think I might add, and I don't want to put words in your mouth, but everybody might have heard him say, will there be a formal process to determine a knowing violation of the charter or law? Was that a fair, approximate approximation or not?'",
        "'speaker_0': 'Vice Mayor Not quite.'",
        "'speaker_2': 'Yeah. I think the question was who is there any consideration of any more formal consideration?'",
        "'speaker_0': 'Of the other violation. Correct.'",
        "'speaker_2': 'Engineering should have happened because right now it seems dangerous to go looking out a manager or company telling me to find out whether or not there were the nine violations and you know, how they have been, you know, barred across the board.'",
        "'speaker_2': 'If you have the discretion to decide whether or not to use them by this point in time, I'm just trying to figure out how we how we find out. Do I think, you know, raising the bar further, if we know, for example, to be an issue and be really clear my mind or is clear right away, I'",
        "'speaker_2': 'think about anything.'",
        "'speaker_0': 'And and if I could just interject, I was at least one council member who raised the concern. And this goes back to my firsthand experience with the saga that gave rise to the grand jury report to begin with.'",
        "'speaker_0': 'It's a very difficult task to ask a direct report as the city manager or city attorney or city clerk or the city clerk wouldn't be making these determinations, but to to make a decision, a determination of a violation of the law or charter against one or more members of the city council, knowing that those members, those same'",
        "'speaker_0': 'members of the city council vote on their at will employment. And that's a that's a very significant factor. And so I felt that it would be better if the council were to delegate to a special council outside council so as not to put any of our direct reports in a a potentially precarious position.'",
        "'speaker_0': 'And you know it. Okay. Then the other thing, I mean, there's a lot of projection that goes into this or, you know, you try to look into the future a little bit, but you wouldn't want to establish a process that could give rise to political attacks.'",
        "'speaker_0': 'I mean, there might be a reason that a majority of the city council was turned against another member. So that's why I think the outside special counsel is just the best avenue on a number of levels to to pursue.'",
        "'speaker_0': 'Those are my thoughts. Um, do we were we in the middle of getting the decision? I think I cut you off in mid-sentence, probably. Were you put up? Are you going to tell us about comments or whatever?'",
        "'speaker_8': 'Yeah, I think we're at the council question stage and I think the mayor may have answered the vice mayor's question. A mr. Vice Mayor, if there's if there were anything else that was unanswered, I'm happy to answer it.'",
        "'speaker_8': 'If you wouldn't mind just repeating any portion that you would still like answered.'",
        "'speaker_2': 'She must have begun the language here in Southern Africa, which now is very much African American or more about at the time, and very new ground. And just from proceeding down the reporting of the conversation from there.'",
        "'speaker_8': 'I think that's right, Mr. Vice Mayor. We wanted we are breaking new ground in many areas, and we were keeping this policy short and simple. I think if you were if your question has to do with, you know, could this policy lay out a more detailed approach to how the council make the determination?'",
        "'speaker_8': 'We do not propose it because that could be, you know, procedure could be up to the council at the time and how the council wants to handle it. And we did not think it was essential to this policy, though if the Council wants to direct us to come up with more detailed, you know, beforehand policies on detailed'",
        "'speaker_8': 'procedure, you're certainly welcome to direct us to do so and we'll certainly do our best.'",
        "'speaker_0': 'Thank you. Council Did you have any further Vice Mayor.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'Councilmember Desai So here's my question on this subject matter about delegating or so. So what's the theory behind it? Because in the sentence, the first part of the sentence says that the city council can exercise its authority to not reimburse.'",
        "'speaker_6': 'And then in the latter part of it, or they can delegate. So what's the theory as to why a city council might want to delegate that?'",
        "'speaker_8': 'And so one example could be because the policy applies to staff. The Council may want to delegate to the city manager or the city attorney to make those determinations, especially vis a vis staff. And it you know, the mayor's point is well taken that you may not want to make that delegation to the city manager or the'",
        "'speaker_8': 'city attorney with respect to council members. But with respect to determining whether or not staff has violated a particular, you know, charter provision, let's say it is relatively common that, for example, city attorney or county council officers oftentimes will make the determination on whether a staff member acted outside the scope of their employment.'",
        "'speaker_8': 'And that determination is critical to whether or not the city would then defend that particular staff member in a civil litigation.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'All right. Any further clarifying questions or comments before we go to our public speakers? And let's take public speakers.'",
        "'speaker_1': 'Steve Swanson and then Kathryn Polley.'",
        "'speaker_0': 'And you'll each have 3 minutes to speak.'",
        "'speaker_3': 'Good evening. Mayor Ashcroft, council members Steve Schlosser live at 2426 Otis Drive. Before we get into the meat of the subject, I believe there's a typographical error on page six or paragraph six of the resolution regarding the date that this takes place.'",
        "'speaker_0': 'That it's been noted.'",
        "'speaker_3': 'Good. Okay. We are in agreement with Mayor Ashcroft's idea of an event.'",
        "'speaker_0': 'Just for the record, Ashcroft not like Ashcroft.'",
        "'speaker_3': 'ASHCROFT Sorry about that. ASHCROFT Yes. We are in agreement with Mayor Ashcroft's thoughts on an independent special counsel speaking on behalf of a group of concerned citizens. We are upset over the previous expenditures made by the city of Alameda for certain attorney's fees incurred by Councilmember Ody and Councilmember Vela.'",
        "'speaker_3': 'The total cost of this is approximately $40,000. I spoke with a member of the city attorney's staff this morning and have found that none of these monies have been recovered by the city of Alameda. We would like Councilmember O'Day and Councilmember Abella to take the high ground and voluntarily reimburse the city of Alameda for these expenditures.'",
        "'speaker_3': 'Barring that, we demand the city of Alameda take whatever action is necessary to recover those monies. Thank you.'",
        "'speaker_0': 'Thank you. Ms.. Pauling.'",
        "'speaker_4': 'I'm mayor and council. I'm. 1/2. So in looking at this, I understand that staff wanted to be good on their promise to begin to bring these articles before the end of the year. But I am concerned that you start with Article three.'",
        "'speaker_4': 'It appears to me that you're really putting the cart before the horse. The one of the big problems noted by the earlier I investigation and by the grand jury was the vagueness of the term undue influence. I can't help but think, you know, if we're talking about a thief, I mean, is it someone who robbed you at'",
        "'speaker_4': 'gunpoint or is it someone who accidentally left something in the basket and you have not yet completed the work on whether on what exactly how you're defining the violations, what is the scope, and to determine a penalty and an outcome before you've even defined that seems just simply out of order.'",
        "'speaker_4': 'I'm also very disappointed that Council has decided to have this very important discussion with only three members present, because somehow it's going to be difficult for you to compartmentalize, I think, on an issue as poor as this is going forward.'",
        "'speaker_4': 'I would really prefer a full discussion by all five people and it's very disappointing to me that you've chosen to limited just to three people who have already made a determination that actually picks the grand jury decision over the much more intensive earlier investigation.'",
        "'speaker_4': 'There are a number of things here that I find distressing, and I respectfully request that you wait on this decision until table it, until you actually decide what is undue influence. The two council members on this last debacle didn't have the benefit of knowing that clearly.'",
        "'speaker_4': 'And there is a line between free speech and what happened. I'm clearly someone who puts a letter of recommendation on letterhead is not subterfuge. Someone who discusses something in a meeting is told it's violation, then does not continue with any discussion.'",
        "'speaker_4': 'And I think it's very important that this that you follow the grand jury's recommendations and not start with the penalty phase before you even done the hard work of defining what the violations are. Thank you.'",
        "'speaker_0': 'Thank you. And are there any further penalties? Okay. So with that, the public comment is closed. Who wants to? Oh. I would like to make a comment and then I want to hear from everybody. I heard the city attorney's say that there had been some suggestion that board and commission members should be included in this policy.'",
        "'speaker_0': 'I would not support that. These are volunteers who apply to serve, who are appointed and voted on by the council. They receive no reimbursement. We don't receive a lot. They receive absolutely none. And I, I also don't really see the potential harm again.'",
        "'speaker_0': 'I don't have that crystal ball. But in in the case of the hiring of the fire chief by the former city manager that involved, as I mentioned previously, council members who were direct reports of that city manager who had the ability to hire or fire her at a board and commission member wouldn't have that power.'",
        "'speaker_0': 'So, I mean, that was not my suggestion. If anyone wants to make a case for why we should include board and commission members. I'm certainly willing to hear it, but I'm. That certainly gives me pause. Anyone want to chime in on that one?'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_6': 'My feeling is the grand jury had given us recommendations and we're putting in place policies that that kind of grow. It's like a tree. And then we've got these limbs that are now growing. And to add in this extra item regarding boards and commissions, while in and of itself, that might be a sound policy, I think, if'",
        "'speaker_6': 'we just stick to. The Council and what the grand jury had suggested. I feel that I'd be on firmer ground. I mean, continue with my tree metaphor. I feel like if we go.'",
        "'speaker_0': 'Out and go out on a limb, exactly where.'",
        "'speaker_6': 'We're going out on an on a tree limb, the further you go, I don't know how steady it is. Whereas, you know, the the matter regarding the council and whether or not to allow reimbursement for legal costs, I mean, that there's a substantial body of discussion and actors who are involved in that discussion and there's a substantial'",
        "'speaker_6': 'amount of understanding people might disagree with with some of the policy recommendations. But nonetheless, there is some agreement on the policy recommendations, and I just feel that's firmer ground if we just stick. To the essentials that the grand jury had suggested.'",
        "'speaker_0': 'So I will just note that this policy recommendation goes a little bit beyond what the grand jury recommended, because it also adds city staff. No council member nor city staff member should be entitled to reimbursement from the city for legal or other fees incurred as a result of such persons knowing violation of the city charter.'",
        "'speaker_6': 'I mean, I can live with the city staff portion. I mean, there's some some limbs. I could you know, it might be a little bouncy, but I could still feel a little comfortable on it. But perhaps the board, the commission might be taking me a little too further out.'",
        "'speaker_6': 'But I could live with the city staff passing.'",
        "'speaker_0': 'Hey, Vice Mayor Knox White.'",
        "'speaker_2': 'In terms of the average amount by the city attorney, I should like to be able to write that, but better. But I think we're we're starting to get into conversation more and more with the commission, but I don't think we should be, you know, not moving very quickly.'",
        "'speaker_0': 'Q Okay. Okay. And I will say that I am I also agree with that in the preamble that Mr. Shen started out with that the lead with the language to the extent authorized by law and not otherwise exempted.'",
        "'speaker_0': 'And then, okay, so we and we don't want to add board and commission members. And again, I think that the city of Alameda is, you know, a little bit on the cutting edge here. But I also think that, as has been said, more than once, the city of Alameda is also making an attempt to make to rectify'",
        "'speaker_0': 'past situations and to follow the grand jury's recommendations. So then we touched on briefly, but the the question of so in the resolution, I was concerned with the language on page two that says that says that the I'm sorry, it's not on page two.'",
        "'speaker_0': 'It is the, uh. Okay. Where is it that. Is it just in the. I'm looking for the language that says we could delegate to the city manager or the city attorney.'",
        "'speaker_8': 'If I may help you.'",
        "'speaker_0': 'Please help me.'",
        "'speaker_8': 'It's right there. It's on the top of page two. You were correct.'",
        "'speaker_0': 'It is in the seduction to.'",
        "'speaker_8': 'Yeah. And where the cursor is. Right?'",
        "'speaker_0': 'You're right. You're right. Yeah. Okay. I'm looking at my finicky iPad. Yes, it is. So I. I believe and I will say that I discussed this with Mr. Shen a couple of days ago, that we. What was the language that we said that, um, uh.'",
        "'speaker_0': 'Do you remember the language?'",
        "'speaker_8': 'I do. I believe the gist of it was that your preference would be that the delegation would be to special counsel with respect to council members, and that you were comfortable with the delegation to city manager, city attorney or special counsel with respect to city staff?'",
        "'speaker_0': 'That's exactly right.'",
        "'speaker_8': 'And so we can make that change on the screen. Okay. As you deliberate further on the item, I'm going to go and work with the city clerk to make that change.'",
        "'speaker_0': 'Okay. Council member de is GAZETTE does that sound okay to you?'",
        "'speaker_6': 'Yeah, that's fine. I think, you know. Teeny bit of wordsmithing here, but you know, the part where it says committed the violation or delegate such decisions shouldn't be committed the violation comma or because that's a whole independent clause of its own.'",
        "'speaker_6': 'After the word or those it should be a comma or.'",
        "'speaker_8': 'Sure would be happy to add a comma right in front of or.'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'Especially since you're going to add these other.'",
        "'speaker_0': 'Yeah, right. And then at the top of the page you've already made that ex. Yes. The, um. There was a extraneous word than you already. Yes. Okay. Okay. And then, let's see. Did we put in the, um. Do we put in the preamble?'",
        "'speaker_0': 'Yep, we did. There it is. Highlighted. Okay. Okay.'",
        "'speaker_6': 'Oh, you know what?'",
        "'speaker_0': 'It's where we look in.'",
        "'speaker_6': 'The OR is after a violation where your cursor is right now, right underneath the cursor, the word violation and then comma or because I think that's what we're intending. Right. Because delegate is the verb that's associated with the city council over there, the city council.'",
        "'speaker_6': 'The city council may decide comma or. Or delegate. Comma or delegate. Right. That's.'",
        "'speaker_0': 'So we start from the beginning here.'",
        "'speaker_6': 'Aware that the city council and then may decide is the is the verb. And then and then all that. And then right where she has a cursor, that's where you put a comma. Because when you say or delegate, you're saying the city council.'",
        "'speaker_6': 'I don't know.'",
        "'speaker_0': 'It's not it's not a numerical kind of thing.'",
        "'speaker_6': 'I don't know.'",
        "'speaker_0': 'What I would.'",
        "'speaker_6': 'And take out the Corvette. That's all I'm saying. You put the comma there or delegate. That's grammatically correct. Yeah, I believe. Okay.'",
        "'speaker_0': 'Thanks. So it's there, right? Exactly. The comma is there. Okay. We found the comment. Any other. Any other proposed changes or.'",
        "'speaker_2': 'Vice mayor of New York, a conversation about the European Union and concerns about it. And I'm going to try to get to the video of this meeting in about ten or 15 seconds by time, so that we have the language where we're going to prepare for the showdown between me repeating that.'",
        "'speaker_0': 'Oh, absolutely. Yeah.'",
        "'speaker_2': 'People said to me that I think the first time is going to be somebody is going to commit a violation in not really adding too much power. So, you know, you don't already have the ability to detain them.'",
        "'speaker_2': 'If they're not going to reimburse conventions, she's going to influence the Supreme Court. I guess I would say that the grand jury's reporting that we're doing to, you know, kind of where is the trigger for even for somebody being declared to have knowingly violated that according to the rules?'",
        "'speaker_2': 'And I am a little uncomfortable with it just being the special counsel I had for ten years to a leading special counsel. And one of those I thought that was just alcohol in it, you know, not even following it should be not California law and, you know, the grand jury and about it.'",
        "'speaker_2': 'But, you know, you're very correct. And so, you know, even even, you know, the special counsel's just a big old. And I knew.'",
        "'speaker_0': 'You were going to.'",
        "'speaker_2': 'Bind the future council by making you determine that it needed to be not being allowed to determine whether to buy I. And there should be more than just the first two years in the company after being ordered, you know, an hour before not going.'",
        "'speaker_2': 'I'd hate the idea I or my mind, but NPR could be in the grand jury or could be a finding of the court, etc. But I think that we are trying to litigate the past and in doing most important, really thinking through, I don't know, we're totally battling or intervention of our novel in the future.'",
        "'speaker_2': 'And I'm just a little worried and that I'm just saying you can go. You don't even think.'",
        "'speaker_0': 'That you.'",
        "'speaker_2': 'Did that.'",
        "'speaker_0': 'Yeah, so I'm too. And I didn't want to cut you off. Vice Mayor, I heard you finish your sentence.'",
        "'speaker_2': 'No, I don't think so.'",
        "'speaker_0': 'I think those are well-taken points. What I might suggest and again, from direct experience, I think part of the problem was that the city attorney, who was also a recipient witness to the events that gave rise to the grand jury report and the events examined by the special counsel also chose that special counsel.'",
        "'speaker_0': 'So I would say that moving forward, I would leave it to council members to determine who that special counsel should be. So I think that this gives us more control over the process. We can interview some firms. But it also I'm still trying to build in that protection from council members who might be a majority and might'",
        "'speaker_0': ', you know, have it out for a council member. I want fairness in the process, but I do think that this is a responsibility that the city council could delegate by being the ones to choose the special counsel. That's my thought.'",
        "'speaker_0': 'Gentlemen yours.'",
        "'speaker_6': 'I am. This is. This is Tony.'",
        "'speaker_0': 'Yes. Chasm of desire.'",
        "'speaker_6': 'I thought the point that Vice Mayor Knox White raised about a higher threshold or his use of the word trigger is spot on. I. Because I. I'm going to try to make this summarize. I think what I hear you saying is.'",
        "'speaker_6': 'Okay. The policy of reimbursing or not reimbursing should follow an event or a decision made by some. For lack of a better word, third party entity, whether it's the grand jury finding or the district attorney finding that that some kind of charter violation had occurred.'",
        "'speaker_6': 'So once that hire that that trigger is pulled, so to speak, then the council can can decide to pull its subsequent trigger of not of not reimbursing legal fees. But the first trigger has to be pulled first. My correct in saying that that's what you're getting at.'",
        "'speaker_0': 'That's a question posed to the vice mayor.'",
        "'speaker_2': 'At the end of the day. You already are a property that are legal in Quadrangle and you follow and you have that trigger point because you put in another comment in a meeting about, you know, how do we if we have nothing but we involve people that are more political among themselves.'",
        "'speaker_2': 'And I think I think we need to be careful about what rules you put in place with respect to the future.'",
        "'speaker_6': 'So follow up question. So right now, is it your reading that by virtue of being silent about that? About the grand role of the grand jury in making a determination or or the role of the D.A.? I don't know which one you prefer.'",
        "'speaker_6': 'By remaining right now silent about that role, it's almost like, well, okay, if three council members decide you made a it's the policy is reading such that it's almost like if three council members so decide. Is that the concern?'",
        "'speaker_6': 'So in that sense.'",
        "'speaker_2': 'I think Germany or America could decide to hire a special counsel and give them very specific instructions about what they want to see.'",
        "'speaker_0': 'Oh, okay.'",
        "'speaker_2': 'I think Israel may not be even a reality for you, but to be able to respond in a private way, all you know is a grand jury also has no due process in its court. I just think that, you know, that, you know, we in my minority, we had one grand jury in 20 years.'",
        "'speaker_2': 'I live in town. It's not overly difficult to independent reporters and a lot of people in town. I was reporting on both sides in case you feel it was wrong and you did not do a good job and you got a great job and the was.'",
        "'speaker_2': 'But there are a lot of people I don't know if you can talk about anything you can support. And therefore, you know, I think that indicates that the only thing we have to be doing with the grand jury, I would think that that would be it needs to be much.'",
        "'speaker_2': 'I think you can ask information.'",
        "'speaker_0': 'Okay. And the minimum threshold, again, if I'm understanding, is that three or four council members could vote to bring in a special counsel.'",
        "'speaker_2': 'I believe the threshold for me would be in a grand jury found a violations of the rules.'",
        "'speaker_0': 'Yeah. Well, so here's the thing to keep in mind that the grand jury, we don't direct the grand jury to look into as a scenario. They they reach down and and do what they do. So I, I think we need to build in a little better protection than that.'",
        "'speaker_0': 'And again, and maybe I wasn't being clear enough, I, I think the process of selecting the special counsel itself was flawed. And, and didn't have the the input of the city council. Councilmember Daza I.'",
        "'speaker_6': 'Hear what you're saying, and I probably would have agreed with you had I been there. But I think the situation that we're dealing with now has specifically to do with reimbursing legal fees. So the point at which most of the time people ask for reimbursement of legal fees is after some kind of process had had unwound most'",
        "'speaker_6': 'of the time. Unfortunately, this previous time, some legal fees were were were reimbursed prior to the decision by the grand jury. But let's let's forget about that for now. Let us suppose that there were no reimbursement of legal fees that had occurred in 2018.'",
        "'speaker_6': 'Let us suppose that and let us suppose further that the grand jury made a determination in June 2019, and the grand jury report comes out. That's the trigger that I believe Vice Mayor Knox White is referring to when it comes to the question of do we reimburse or not reimburse for legal fees?'",
        "'speaker_6': 'And to me, I would agree that that that on the question of reimbursing legal fees, that that is that is the I think that it's appropriate to have that it's appropriate to have that that that triggering event, that IEEE, the grand jury, had made some kind of determination in terms of the issue of the counsel.'",
        "'speaker_6': 'I think that was kind of a parallel issue that was leading.'",
        "'speaker_4': 'Up to the grand jury.'",
        "'speaker_6': 'That that I think.'",
        "'speaker_0': 'Okay. So if I can just jump in. I am just saying that I. So the reason that someone's legal fees would be denied is that there was a determination that they either violated the charter or violated an applicable law and in the language proposed.'",
        "'speaker_0': 'It leaves the possibility of who would determine that to be the city attorney, the city manager or a special counsel. I think it's perfectly fine to for the the the for the city attorney or the city manager to determine a violation or not for a member of city staff.'",
        "'speaker_0': 'I worry about, for the reasons I stated previously, of giving them that responsibility when it puts them in a precarious position, as the director reports to the City Council. So that's the only circumstance under which I would bring in a special counsel.'",
        "'speaker_6': 'Oh, I see.'",
        "'speaker_0': 'But but again, the and maybe the city attorney wants to weigh in here, but it just I don't think it's just after a grand jury makes a finding that someone will claim their legal fees. I'm we've seen it before, and I'm not sure that it's just the outlier and the exception that will never be repeated.'",
        "'speaker_0': 'And again, we are following a recommendation that emanates from the grand jury's findings based on the the the events that occurred in 2017. So that's the only I don't want to belabor the part of the special counsel, but I just think that there is a time when it's appropriate to take that decision outside of the city, especially'",
        "'speaker_0': 'for people who are our direct reports. And Mr. Chin, do you want to weigh in?'",
        "'speaker_8': 'Yes, I think I understand exactly where the mayor is coming from, and I think I also understand where the vice mayor is coming from. Mr. Vice Mayor, I think the concern expressed by the mayor, which in a way I share, is that there are very few times that the grand jury actually is involved in a city process'",
        "'speaker_8': '. And so if the triggering event is a grand jury determination or a district attorney or an attorney general investigation, and that triggering event could be both over and under inclusive. It could be under inclusive in that those law enforcement agencies just intervene so frequently that this policy would never be applied, essentially.'",
        "'speaker_8': 'It could also be over inclusive, because this policy makes more clear what a knowing violation is. And because the Council has no control over those other agencies, you could not be confident that those agencies are applying your policy properly.'",
        "'speaker_8': 'They may be applying some other policy and decide there's a violation whereby you may or may not agree with. And so that's why this policy is drafted, to give the council as the elected governing body of the city, to essentially make the ultimate call.'",
        "'speaker_8': 'I think the mayor's point is also well-taken that special counsel should be appointed by the council, and that was always our vision that the council would appoint the special counsel. And so I'm proposing that right in front of special counsel, we could add council appointed to make clear that special counsel would be appointed by the council and'",
        "'speaker_8': 'not by some other appointed employee in the city. And I hope that was helpful.'",
        "'speaker_0': 'Thank you, Vice Mayor.'",
        "'speaker_2': 'It was helpful. I guess I would be counsel have already been denied company indemnification because they feel that they knowingly committed a violation. We're not changing that ability right now. What we what we're doing is whether or not there should be more specific policy, any specific trigger for requiring that to happen.'",
        "'speaker_2': 'I concur with Mayor, when you read your comments about Josh, the attorney, David, out of that investigative role and and the. Bob, is your point about picking up all of the need? The question is, can we report the need for anything, anybody to figure out that they're going to improve our lives?'",
        "'speaker_2': 'And perhaps we're not really at any point where we need to kind of pick up all of that time and being able to get a reimbursement for a fee. But I feel like we are a policy. Yeah, I.'",
        "'speaker_2': 'We had such a mouthful. You know, you're right. They were. I thought that they were hired by the city attorney and the people related to that. But I hate to call it the council, but I think you have to be there for it is going to be without parties or governments or whatever else.'",
        "'speaker_2': 'I honestly believe in the fact that we have a council of the people who are really trying to act ethically in this regard. And I have very little problem working with the Council to do that. But I think we're talking about, you know, I mean, I'll talk to you tonight in person out there.'",
        "'speaker_2': 'Although I feel obligated because I'm looking for somebody to make me an attorney.'",
        "'speaker_0': 'So if I could just chime in, I do hear your concerns. I have a concern about due process and to make sure that whoever is making a determination has the the background and the ability to do so. And I think in some cases and I don't say this because I'm a lawyer, but I think in some cases'",
        "'speaker_0': 'you do need a lawyer. But what if rather than just delegating to a special counsel, we bring a special counsel in to work with us the the non recuse council members. Council member I mean, Madam Clerk. Yes, I'm.'",
        "'speaker_1': 'Sorry to interrupt, but if the council could just take a vote to authorize additional time since two members. Yes.'",
        "'speaker_0': 'This is true. We have our clerk. Okay, I will move that. We allow this discussion to take as much time as it needs to take. I think it's too important to cut us off at a certain number. We do have a second thing.'",
        "'speaker_0': 'Okay, wait a second. Let's take a roll call vote.'",
        "'speaker_1': 'Council members desire. Yes, not quite. I may or as Ashcroft.'",
        "'speaker_0': 'Yes. That's two yeses in an I three. Affirmative. It's okay. It passes. Thank you. Okay. So I think I was saying that, you know, maybe a compromise position would be we don't just send it out to the special counsel, but we bring that counsel, that special counsel in to work with us, because after all, we would know'",
        "'speaker_0': 'the the case facts certainly the best. But I, I just am not sure that in every instance, the Council is is equipped to make that determination. And there might even be a way to word this so that the council reserves the discretion to appoint a city council, a special counsel, to work with it, if, if necessary, if'",
        "'speaker_0': 'it felt the necessity to do so, or words to that effect. You're grimacing Councilmember De. So what? Yeah, translate that into words.'",
        "'speaker_6': 'I don't know if I'm becoming more Catholic than the Pope and by by glomming on to Vice Mayor Knox's white's phrase of triggering triggers and higher thresholds. But when he referenced grand juries, I believe in particular, I might use the word D.A. I don't know if he used the word D.A., but when he referenced grand juries, as'",
        "'speaker_6': ', you know, an example of of a higher threshold decision making body, I still I think that that is a correct point so far. So, for example, one way that we could potentially deal with that is in the very first in in section one, in the first sentence of paragraph two, it reads, No council member nor city staff'",
        "'speaker_6': 'member shall be entitled to reimbursement from the city for legal or other fees incurred as a result of such persons knowing violation of the city charter. An applicable criminal statute or an applicable ethical code of conduct period. Maybe where we say period, we introduce comma as determined by a grand jury, D.A. or counsel appointed special counsel.'",
        "'speaker_0': 'Well, I mean, that's a possibility. I would also just be mindful. I mean, I think you probably wrapped up wrapped into that language. The city attorney's reminder that law enforcement agencies intervene so rarely that we it could be an under inclusive policy to rely on their determination.'",
        "'speaker_0': 'But maybe we're getting both that we can have our cake and eat it, too, or whatever. But, um.'",
        "'speaker_6': 'But I take what you're saying about what you just said. But again, we're responding to this very rare, historic event that we just don't want to see happen again. And so and so that historic event was, you know, some some some violation of 7-3 that then, you know, required the D.A. and the grand jury to make a'",
        "'speaker_6': 'determination. And they did that. And so going back to the tree metaphor, staying close to the trunk as much as possible. That's why I don't know. I'm still okay with inserting or asserting a role of the grand jury or a D.A. in this.'",
        "'speaker_6': 'I don't.'",
        "'speaker_0': 'Know. Well, I and again, I'm sorry, did you finish? Okay. So I am I'm also mindful of the fact that we will not pass this policy unless all three of us agreed to it because we were the three person majority.'",
        "'speaker_0': 'It will take I, I think the language that Councilmember de SA just suggested that we referred to a grand jury proceeding, the district attorney, or a determination by a special counsel.'",
        "'speaker_6': 'I thought you said council appointed special.'",
        "'speaker_0': 'Okay. Well, it is counsel by special counsel. Yes. That that might suffice. And I again, yes, I hope that this is a rare occurrence, but we don't know that. And I think that it's really important to have clear policies that just leave.'",
        "'speaker_0': 'No question about. And this is you know, this is what what what you can expect if this if a in alleged violation were to occur again.'",
        "'speaker_6': 'I mean, and Vice Mayor Knox. Right. Are you about to say something or. Because I was about to make a comment.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_2': 'Mike Huckabee.'",
        "'speaker_6': 'Okay. The weakness of what I just said and you know, I want to of course, I would love to say it's all good, but there is a weakness. The weakness is that if something goes wrong, does that mean that let's say a city staff does something wrong?'",
        "'speaker_6': 'Does that mean the city staff has to go to work and get some kind of grand jury seal of approval or so?'",
        "'speaker_0': 'No, because, again, the special counsel involvement is only triggered when it's a it's a city council member. And that's only to keep us from requiring our direct reports to make that determination. Yeah. And I guess as I hear myself saying that, well, the city attorney is obviously an attorney.'",
        "'speaker_0': 'City manager isn't, although he's a wise man. But, you know, he won't always be here. But. But I think we I'm hoping we, with your suggested language council member decide the the specification that it would be a council appointed special counsel that we might have enough to move forward on.'",
        "'speaker_0': 'But what do you think, Vice Mayor.'",
        "'speaker_2': 'I don't think I'm going to support any litigation and having internal counsel, regardless of who they are appointed by.'",
        "'speaker_6': 'During the.'",
        "'speaker_2': 'Day. We need to be clear about that. I think we have to be able to feel comfortable that we're open minded. Both of them are problematic in their own way. And I think that giving an individual or firm, even if they're voyeurs, to trying the power with you on the left hand side, you know.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'I'm here about the attorney. I'm concerned about how people interact. It's not that big of a concern. They can hire a special counsel and they can use the special counsel's report of a referral to an individual with that in mind and so on.'",
        "'speaker_2': 'I mean, the model that I would hope is that you gave the grand jury to take it out. I don't think that the ability to hire language when you do that. I guess I may have less to do with special counsel, both of which I know you agree with.'",
        "'speaker_0': 'Okay. So I'm not suggesting that we go down either of those two paths. What I'm suggesting is that I do think that there may be times when a city council needs to confer with a special counsel to get an opinion.'",
        "'speaker_0': 'We aren't we wouldn't need to be looking for a special counsel's report, I would envision as sitting in a closed session with that person and raising our concerns and getting legal advice. And so the fact that there have been two examples in recent memory where special counsel didn't, you know, it fell short of the task they were'",
        "'speaker_0': 'assigned. I'm not looking to replicate that, but I am looking to at times and only if a majority of the non recused counsel decides that we could bring in an attorney to work with us and advise us. We could also decide, no, that's not the path we need to take.'",
        "'speaker_0': 'But I think that there is an element of safety in at least knowing some legal considerations that if we're not consulting with our city attorney, I don't think that it's reasonable to assume we can just rely on ourselves for the legal advice that may be required.'",
        "'speaker_0': 'And obviously, you you're willing to to take the determination of of some attorney, like a district attorney. And the district attorney certainly advises the grand jury. So I'm just saying, this is just be like a resource vice mayor.'",
        "'speaker_0': 'I'm not I'm not saying we do what was done before. Okay. Have at it and come back and tell us what you think. It's come sit with us. Here are questions. Here's where we think we want to be.'",
        "'speaker_0': 'Is is are we, you know, going down the right path anything that to keep us out of legal jeopardy and to ultimately achieve the outcome we're trying to achieve. But I'm not looking to replicate past models.'",
        "'speaker_2': 'So I guess I'm still not sure I'm on board with it being a sympathetic company for determination and have their interests in consultation with the special counsel.'",
        "'speaker_0': 'I'm sorry at their interest. What they.'",
        "'speaker_2': 'Can handle any special counsel in higher education, that special counsel will be notified not to do.'",
        "'speaker_0': 'So again. I didn't say delegate. I'm saying to bring them in to sit and work with us. It would only take place in the presence of the counsel and this legal adviser, that of our choosing. Right.'",
        "'speaker_2': 'To give them the language and instruct them.'",
        "'speaker_0': 'So. Well, I yeah, I mean, we we're in the drafting stage. And so, yeah, I am trying to.'",
        "'speaker_2': 'Say that whatever it was that needs to be done to get the proper training going, including being helpful in coping with the special counsel that we're not hearing that special counsel is threatening to.'",
        "'speaker_0': 'Be if we are not. And I'm not suggesting that. Okay. Let's work with that wording. I think we might be on to something. Okay. So we're looking at me. Put it up in my screen.'",
        "'speaker_2': 'This is going to have to be guided by on all of these triggering of an execution by or not back. Yeah. I mean, are you saying that the council will determine whether they are going to come on board with everything else but making the determination of violations and giving them patients based on their findings?'",
        "'speaker_0': 'Do you want to jump in, Mr. Shin?'",
        "'speaker_8': 'Sure. Vice Mayor. Vice Mayor Knox White. I think what this policy does is that once a decision or body makes the determination that there is a violation, then the Council could not exercise its discretion to indemnify. So in essence, once a knowing violation is found, the council doesn't get to step two.'",
        "'speaker_8': 'The council just simply doesn't exercise its discretion to indemnify. That's that's all that this policy does. I think the grand jury recommendation was not an intended to be a sea change. It simply just moves the discretionary indemnification to mandatory non indemnification to the extent that the council or whatever body has found a knowing violation.'",
        "'speaker_8': 'I've been scribing.'",
        "'speaker_2': 'I guess my question is where is that? What is that threshold for that finding of the city council.'",
        "'speaker_8': 'As it is currently? Yes.'",
        "'speaker_2': 'Right? I mean, I think that's all right.'",
        "'speaker_0': 'So how would you how would you address that problem?'",
        "'speaker_2': 'No, I wouldn't do anything by injecting that. We're going to just buying something that probably I think it has to be following to get there. The company decided to not get it down the highway or not to pick up the rights of the individual, you know, and after November five, regardless of the fact that the grand injury'",
        "'speaker_2': 'is involved or not. We're not we're not trying to eradicate it with Germany. And again, we're just trying to figure out at what point in time, but no longer the council's ability to say that. And I think at that level, that personal need to be much higher than just to be on the level.'",
        "'speaker_0': 'Yeah. So we're. Well the okay go ahead cancel everyday.'",
        "'speaker_6': 'So I think you know the way in which the city attorney had modified the first sentence of a second paragraph to section one, the modification occurring where we, we replaced code of conduct period with code of conduct comma as determined by dot, dot, dot the things.'",
        "'speaker_6': 'I think everything is satisfactory there except for the last thing or the city council. I think it's just basically attorney general, the Alameda County district attorney and or the Alameda County grand jury, period. I think that's what Councilmember Vice Mayor Knox White is getting at.'",
        "'speaker_6': 'Is is those are the decisional that those are the higher authority, higher threshold decision making bodies that signal to the council. Okay. Council, yes, indeed. These reputable bodies have made a decision that that, you know, goes to the due process that the vice mayor not Suarez speaking to.'",
        "'speaker_6': 'And based upon that decision through that due process, the council will not reimburse legal fees. So so I don't think you can have the last thing or the city council is it does that some close to what you're getting at.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Mr. Chan.'",
        "'speaker_8': 'May we ask the Vice Mayor? Could you. Could you actually see these live updates from where you are?'",
        "'speaker_2': 'Oh, you know, on my camera, on the screen.'",
        "'speaker_0': 'I will ask them to. Oh, okay. So you're not actually seeing the changes that are being made. Okay.'",
        "'speaker_2': 'I enjoy it because I go.'",
        "'speaker_0': 'Has got.'",
        "'speaker_2': 'It. After.'",
        "'speaker_8': 'And I'm going to highlight the sections that were changed for your viewing convenience.'",
        "'speaker_0': 'That would be helpful. Yeah. Okay.'",
        "'speaker_2': 'So on the screen.'",
        "'speaker_0': 'Um. Can't. Can we email it to him?'",
        "'speaker_1': 'It should be okay.'",
        "'speaker_6': 'Your concept of that just having to do with city staff?'",
        "'speaker_0': 'No, I think.'",
        "'speaker_2': 'I believe based on what I see in Europe, there will be karma or the city council. I will be under my watch because I don't think they will have a significant change of anything sitting up our country ability to not have anything.'",
        "'speaker_6': 'Yeah. I think that's where he's going at.'",
        "'speaker_0': 'The top. Oh, well, I would still leave in that. The city council may have that right, but we should still specify specify that that should be should not include the council members who are alleged to have council member or members who are alleged to have violated the law.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_8': 'Okay. May I ask a question of the vice mayor?'",
        "'speaker_0': 'Yes. And then I have a question for you. Mr..'",
        "'speaker_8': 'So, Mr. Vice Mayor, if your your request that the lead comma or the city council. Are you okay with the rest of the highlighting? The rest of the highlighting essentially provides that if none of these public bodies actually make a determination, then the council gets to do it.'",
        "'speaker_8': 'Or is it your request that we delete everything? If you look at the second round of highlighting.'",
        "'speaker_2': 'Yeah. Yeah, I think the the situation. So that we can create a very small industry by saying that whatever, you know, get motivated by people finding the particular looking children not to identify that, correct?'",
        "'speaker_8': 'Well, essentially, the policy as it's written would be that the city council would then make the finding.'",
        "'speaker_0': 'Right, that there was a violation. Yeah. Yeah. And so I. I just want to jump in and say, I'd like to get to a vote, but I also want to make sure that whatever policy we're adopting, the city attorney thinks will hold up to legal scrutiny because there's no point in having a policy that just brings us'",
        "'speaker_0': 'into court to to clarify, did we you know, did we have the ability to make that determination? Maybe we do. And it you know, we just haven't had a specific policy telling us that. Councilmember de SAC.'",
        "'speaker_6': 'On the point that the discussion item that we just had where we said if none of those three top echelon decision making bodies make a decision, then the city council could make a decision. I'd be concerned about that because if the attorney general or the district attorney or the grand jury is not is not making a decision'",
        "'speaker_6': 'on this item, that that's telling you something. So then I don't but but yeah.'",
        "'speaker_0': 'I think I think that we can't read too much into that. The Alameda district attorney has quite a few items that the grand jury considers. And, you know, even topics that are suggested. And then they vote on which ones are going to hear kind of like the US Supreme Court.'",
        "'speaker_0': 'So that doesn't mean just because it didn't come to their attention that it's not significant. It just could say that that particular year there were a lot of things that took more time and attention.'",
        "'speaker_6': 'King.'",
        "'speaker_2': 'Question.'",
        "'speaker_0': 'Yes, vice mayor.'",
        "'speaker_2': 'Has been saying that match the game by game council can make a finding that something was knowingly done in their lifetime themselves to not reimburse. We don't have that language. We use the. That's not appreciated.'",
        "'speaker_0': 'Well, I mean, I would say that we want to make sure we have a firm legal foundation for making that determination, which we might, because maybe the charter language is so straight forward. But I again, this is this is a recommendation of the grand jury that we not pay legal fees to council members who are found to'",
        "'speaker_0': 'have violated the charter. So how is it they're found to violate the charter? And I try to when I look at a situation and maybe this is my, you know, Arbitrator Day's coming out, I try to look at it from both sides.'",
        "'speaker_0': 'So it's one thing for the three of us to be sitting here determining this policy. How would it feel if we were on the other side of the equation is, you know, did we maybe, maybe once you elected a council, you were just, you know, imbued with that wisdom and knowledge.'",
        "'speaker_0': 'I, I wouldn't mind having someone to consult with, but I don't think it should be the city attorney in this instance. Um, and I, and I think if I'm hearing you correctly, you're saying just leave it silent. But I again, I'm just trying to do what we said we would do, which was to adopt this policy that'",
        "'speaker_0': 'the grand jury recommended in the three of us unanimously agreed to do that. So how best to do that? Let's let's see. We can come up with some language that I mean, I think you I think you understand my concerns.'",
        "'speaker_0': 'I'm hearing yours. I think there's got to be some some middle ground language in there that can satisfy all of our concerns.'",
        "'speaker_2': 'I mean, I have no concerns about the use of the special counsel's counsel in their actions. I'm not proposing anything that would change that. I don't know that we can call a meeting in my mind. We will make a determination about whatever.'",
        "'speaker_2': 'And I just I feel like that's already been my part of what we're doing, is following the grand jury's recommendation that people who are knowingly found guilty of violating the charter cannot be identified. And I think what we're just tapping into, where is that determination going to violating the charter or other rules?'",
        "'speaker_2': 'And I think jumping the gun is a part of it. Even if the due process that you do not spy three politicians sitting on people who may or may not be aligned. So your options are strong. And if I was on the other side, you know, never to be.'",
        "'speaker_2': 'But I know that there was some sort of due process that I was following that would be followed in making that determination. And I didn't feel that the three people that I am opposed to or something like that, which I think that might be, and I think we've seen in the past few days around the Bay Area'",
        "'speaker_2': 'and country in the world that you don't need to be doing anything other than just kind of climbing, that it's a binding issue.'",
        "'speaker_0': 'Of.'",
        "'speaker_2': 'Being in a council meeting, that determination, making and determination and choosing to follow the lead of the attorney general and not have done that by any time we talk about the country.'",
        "'speaker_0': 'I think, again, it is awkward when we're asking the city attorney to make that determination with regard to another city council member. The reason that I would leave in the council appointed special counsel is to make sure that a future council is aware of that.'",
        "'speaker_0': 'And I see that as a protection because I've seen what happens when it's not a council appointed by the city council. And again, it is exactly what you said only to consult with us. We're not delegating any authority, but I think to your earlier point about how the the the ones who are seeking legal reimbursement would feel'",
        "'speaker_0': ', I think that consulting with a lawyer is actually is actually a a level of protection and safeguard. Right.'",
        "'speaker_2': 'So what I'm proposing, I think people are buying a couple of things. I don't know if you disagree there at all. You know, I'm already part of the determination. I mean, I think that the council should make up the language.'",
        "'speaker_2': 'I don't think that they can be precluding community banking, and I don't think we're not trying to or politically unpopular, but that's what we're trying to do. Anything else about the competition?'",
        "'speaker_0': 'Well, right. Is there a way we can sit in the affirmative rather than the negative?'",
        "'speaker_2': 'I'm sure make.'",
        "'speaker_0': 'So let's see. So here's the highlight. So in the absence of any determination of etc., etc., the city council, excluding bereavement share, shall shall retain the ability to make.'",
        "'speaker_2': 'You design.'",
        "'speaker_0': 'So retained. Did you say the authority to decide to determine the time to decide whether. Okay, sure.'",
        "'speaker_2': 'So this term.'",
        "'speaker_0': 'You shall retain the authority to I think we're saying determine rather than decide or that's pretty close to determine, but a better idea. Okay. And then, um, I would like something about that gives us the ability to consult with a special counsel appointed by the city council.'",
        "'speaker_0': 'Those are two different spellings, but city clerk knows that.'",
        "'speaker_2': 'I'm bored with that.'",
        "'speaker_0': 'Okay. Let's see if we can get it offline. Are you and by the way, Vice Mayor, are you seeing these changes in real time? Okay. Um hmm. Okay. Let's see how this looks now. In the absence of a determination by a court.'",
        "'speaker_0': 'Um. The City Council shall retain the authority to determine whether the Council member knowingly committed a violation or delegated, um, decision. Okay. Um, in making determinations required by this. Okay. So on that last highlighted sentence that I think should be modified and moved because it's not going to apply to staff at all.'",
        "'speaker_0': 'Right. We don't need to. And city manager, city attorney can make that those determinations with regard to city staff. So I would like to say, um, uh oh, I know that, um. Is the council actually going to make a determination about the city staff member or are we leaving that to the city manager and city attorney?'",
        "'speaker_0': 'Mr. Chin.'",
        "'speaker_8': 'So as written, it gives you the choice to either.'",
        "'speaker_0': 'Downgrade or relegate guy to zero vice mayor.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Okay. In making determinations required by this policy, the city council, I would say, may consult with special counsel. And it's a make and sell with council appointed special counsel to provide necessary advice.'",
        "'speaker_6': 'Consultant not consulted?'",
        "'speaker_0': 'Yes. Okay. In that last year, take the EDF rate. Yeah, you got it. Okay. In making determinations required by this policy, the City Council may consult with counsel, appointed special counsel to provide necessary advice. What do we think?'",
        "'speaker_6': 'So let me go back up. So the first sentence that starts with to the extent and then right now we have as determined by court of competent jurisdiction jurisdiction, the attorney general, Alameda County district attorney, the Alameda County Grand Jury Karma or the City Council?'",
        "'speaker_6': 'Do we really intend to have or the city council there at the tail end?'",
        "'speaker_8': 'Councilmember de SAC I think you do if you want to keep the latter part of the policy, because the latter part of the policy makes clear that the Council retains the jurisdiction to do it. And so if you delete the City Council from the first sentence, then it could clear.'",
        "'speaker_0': 'That confusion.'",
        "'speaker_8': 'As to whether or not the council could do it at all.'",
        "'speaker_6': 'Oh, I see. Okay.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_2': 'Yeah. That sounds good. Okay. I would be okay with that.'",
        "'speaker_0': 'Okay. And that just just.'",
        "'speaker_6': 'For the.'",
        "'speaker_0': 'Record, some every day.'",
        "'speaker_6': 'So I want to make sure that we captured what the city attorney just said in the minutes, because that to me, it's it has to be understood what we mean by that phrase or the city council at the tail end.'",
        "'speaker_6': 'So yeah.'",
        "'speaker_0': 'In the minutes of this meeting. Yeah. Okay, we got it. And then okay let's see here. Section two. In Section three. I don't see any necessary changes unless you all do. Council Member De SA. Vice Mayor.'",
        "'speaker_2': 'Are.'",
        "'speaker_0': 'You ready to support that? Me You'd like to make a motion.'",
        "'speaker_2': 'I'm open to all of the document as written.'",
        "'speaker_0': 'Okay. As amended. Right. As amended, yeah.'",
        "'speaker_2': 'Now that we have this kind of thing going on.'",
        "'speaker_0': 'Okay. So we have a motion by the vice mayor. It's been seconded by councilmember designee. We have a voice vote.'",
        "'speaker_1': 'Councilmember DeSantis knocks way. I mean, as the. Ashcroft.'",
        "'speaker_0': 'Yes. All right. The measure the this ordinance to enact this policy passes unanimously. Thank you. All right. So, yeah. Good work. Good work, everyone. Thanks. And now let's let's take a brief. I'm going to call a ten minute recess.'",
        "'speaker_0': 'It's 924. Well, let's make it 11 minutes. We'll be back at 935. And let's bring our council colleagues back in. Thank you, everyone. Okay. Ready in the balcony. All right. Okay, everybody. Well, we're all here. It's 934. We'll go a minute early.'"
    ],
    "Policy Option for City Employees to Supplement Pay with Paid Leave.": [
        "'speaker_1': 'Nine eight considered directing staff to enact a policy to give all city employees the option to use any paid leave, such as sick vacation or other paid time off to supplement pay while out on paid family leave. This item was placed on the agenda at the request of Councilmember Vela.'",
        "'speaker_0': 'Okay. Councilmember Vela.'",
        "'speaker_5': 'So my referral is really as stated, it's pretty simple. I think that the what I'd be looking for is to direct staff to look at this option as well as other options and look into whether or not this is possible and the pros and cons of it.'",
        "'speaker_5': 'This came up partially for me when I was out on leave, but also I started looking into this issue a little bit more. And not that I've even exhausted my leave or been able to take it, I think.'",
        "'speaker_5': 'Well, first of all, we don't get, uh, leave being on city council, so we're volunteers in this job. I basically make less than the minimum wage. So. Although it's still work. And I was back here, I think, what, ten days postpartum.'",
        "'speaker_5': 'I think, which is a bit. Uh. Bit extreme. But anyways, with California paid family leave, it's partial wage reimbursement, not all. And I think that there's an extremely high cost of living in the Bay Area. And so if you're taking time off to care for a sick family member, taking a wage reduction while you're doing so could'",
        "'speaker_5': 'be a lot. I know we have different policies on the books, depending our on our different employee groups. It's not that we don't allow them to supplement, but this would just be asking staff to look into, um, all of the types of leave that folks are allowed to take and run to supplement and seeing what we could'",
        "'speaker_5': 'do with that.'",
        "'speaker_0': 'Okay. Are there any council questions or comments? Um. Vice Mayor. And do we have any speakers on that, please? Vice Mayor.'",
        "'speaker_2': 'Not quite sure you can. I mean, given the direction we to give you kind of calibration on how we would want it to be looked at or just come out with a variety of options.'",
        "'speaker_0': 'QUESTIONER I think it.'",
        "'speaker_5': 'I think it would be fairly open ended to have staff look into this in terms of the options I've laid out, the different I don't know, all the different types of leave that we have. I don't know what our contracts currently state for each bargaining unit group.'",
        "'speaker_5': 'But one thought is just to make sure that people are allowed to supplement with various types of leave. And the other would be, you know, what the benefit or cost of the city would be relative to that.'",
        "'speaker_0': 'And I mean, the con the city manager did that. Vice Mayor Knox, why did you finish your remarks or your clarifying question?'",
        "'speaker_2': 'I have no comment for me. I mean, you've been.'",
        "'speaker_0': 'Doing conversations, right? And my my concern was with the wording, although the explanation I heard might have been a little different, but it says, consider directing staff to enact a policy. And I'm a little hesitant about directing staff, I think, you know, to to actually enact a policy.'",
        "'speaker_0': 'I think, you know, looking into it, coming back, we have bargaining units. But let's hear from the city manager.'",
        "'speaker_8': 'All I was going to say is that our director and myself has talked to Councilmember Vella and the way she explained it just now, we're supportive of that concept of looking at the different options and bringing back proposals with options for the council's consideration.'",
        "'speaker_0': 'Okay. That that that helps. Okay. Council, what's your pleasure? So it's so if I'm understanding the city manager correctly, he and our H.R. director, Nancy Bronstein, who's in the audience, are amenable to doing some some research on this and bring it back to us early next year, I would imagine, because we've got one more December meeting and'",
        "'speaker_0': 'we've already approved that agenda, so. Okay, so that's on the table. Councilmember Odie.'",
        "'speaker_3': 'Sure. I mean, I'll make just a few brief comments. Even though it's not that late, I think it's particularly poignant that we had this discussion today, given the person that advocated on the national level for six months family leave and our Senator Harris decided to end her presidential campaign.'",
        "'speaker_3': 'So I think a lot of us, you know, talk about how we want our national leaders and our state leaders to promote this type of policy. And this gives us a chance to actually do something locally and, you know, do our part, too.'",
        "'speaker_3': 'So I think it's a good idea and I'm glad that the referral is brought forward. And with the clarification, you know, I'd be willing to move move it forward. Make a motion to move it forward.'",
        "'speaker_0': 'Okay. We have a motion, but, um, do you want to hold the motion so we can go down and. Okay. I will come back to you for the motion. Councilor Villa. I was.'",
        "'speaker_5': 'Yeah. If he makes a motion, we can suck it in, then we can discuss.'",
        "'speaker_0': 'Yeah, we can do that too. Okay. Okay.'",
        "'speaker_5': 'So I'll second. Okay.'",
        "'speaker_0': 'We have a motion in the second. And so councilman days are going to be comments. Vice Mayor Knox White.'",
        "'speaker_2': 'I was a member of the board, I think is an example of a time when we probably should have had more of a requirement and the time limit ongoing. I just encourage the staff as part of their expertize and then the work.'",
        "'speaker_0': 'I'm okay. And I too, am agreeable to having the H.R. director and city manager bring this back to us with some details of how it might be implemented here. And I would just note for the record that we still have Senator Harris in the Senate.'",
        "'speaker_0': 'Right. And, yes, so that's his politicals. I mean, again, on the national level for now. Okay. So we have a motion, we have a second. And the motion is what what I stated to.'",
        "'speaker_3': 'Move the item forward with the clarification that was discussed.'",
        "'speaker_0': 'The city manager. Okay. And it's been seconded. All in favor. Oh. Wait, wait, wait, wait. To say we did so well. I think that's.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'Odie. Yes. I mayor. As the Ashcraft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Carries by.'",
        "'speaker_0': 'Five days. All right. That passes unanimously. We move on to Council Communications. Council members, let's start with Councilmember Vela. Any communications?'"
    ]
}