{
    "Support for Emergency Solid Waste Funding Proposal for Alameda County Industries.": [
        "'speaker_0': 'Bella. Yes. Mayor. As the Ashcroft. Yes. That carry Sativex. Okay. Perfect. So we have approved the balance of the consent calendar. So now let's take them one at a time. Item five F as in Frank, I was pulled by Councilmember O.D., Councilmember O.D..'",
        "'speaker_1': 'Thank you, Madam Chair. Just real quick, I'm supportive of this. I would just like to see if we could have the opportunity for all of us if we so desire to sign on to the letter.'",
        "'speaker_0': 'And, Councilor, could I ask you to just give a little thumbnail description for people who might be watching from home, but not following the agenda of what gives and your your particular knowledge about this?'",
        "'speaker_1': 'Well, that's recommendation support. I'll read the agenda item. Recommendation to support Resource Recovery Coalition of California's Emergency Solid Waste Funding proposal, which provides additional support to Alameda County Industries in response to financial impacts of the pandemic. So ACR had reached out to, I think, individual members, at least myself and I'm sure others, because this got on the'",
        "'speaker_1': 'agenda to have us send a letter to the state to include, you know, recyclers and waste haulers as part of any recovery efforts. And, you know, I think this is a good thing for us to do. And again, I just wanted the opportunity, you know, if if the council agreed to have all of us sign on, if'",
        "'speaker_1': 'we also agreed so.'",
        "'speaker_0': 'And one of the things that they talked about, and I think sent me a letter to was that, you know, we have a time where because of the shelter in place ordinance, many businesses are closed and those that are operating are operating at reduced capacity.'",
        "'speaker_0': 'They've had a number of client businesses simply cancel their accounts. And the way we have public works director Liam Garland here. I see. But the way that they do their funding and calculate their rates is all, you know, balanced on how much commercial business they have and how much residential it impacts our residential rates.'",
        "'speaker_0': 'So, um, so then you would, would you like to make a motion that we support this recommendation?'",
        "'speaker_1': 'Oh, sure.'",
        "'speaker_0': 'Because it was pulled from the consent calendar, right? Yeah. Go ahead, Mr. O.D. and then we'll go to Councilmember Geller.'",
        "'speaker_1': 'Oh, okay. Thank you. I'm of approval of the item with the caveat that we have to have the opportunity, if we so desire to attach our signatures to it in addition to yours.'",
        "'speaker_0': 'Okay. And Councilmember Vela, do you want to vote? Seconded and then discuss? I just wanted to. Yes, I wanted to. Second and and then also just say that I think that if we could send a message to the full council, I think that that really will be helpful.'",
        "'speaker_0': 'And and I look forward to signing on in support. I like that. And Mr. Garland, did you want to add anything?'",
        "'speaker_1': 'Nothing to add. Thank you.'",
        "'speaker_0': 'All right. Any other questions? A discussion council. Okay. Seeing then the city collectively you would do a roll call that this. Councilmember DeSantis?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Looks like.'",
        "'speaker_1': 'I.'"
    ],
    "Resolution on Annual Report and Public Hearing for Island City Landscaping and Lighting District.": [
        "'speaker_0': 'O.D.. I vla I may or as the Ashcroft Zacarias. Bye bye bye. Okay, great. Thank you. All right, then we come to five G and Councilmember de SAG. Is this one where you're recusing?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Yes, I will be. Thank you.'",
        "'speaker_0': 'All right. So do we need to let him step away for a moment? Yeah. There you go. This is not as simple as it sounds these days. Okay. Okay. Councilmember Odie.'",
        "'speaker_1': 'Thank you, Madam Chair. I think I make this request almost every year, but I'm hoping that in the future, if our staff knows that it's given council member is, you know, recused from a certain portion of this, that they would split this into two resolutions.'",
        "'speaker_1': 'I think our council's done a good job of reaching unanimous decision during this crisis. And I think we've we've assisted, you know, some of our colleagues to come along by, you know, either changing the wording or splitting up the question to allow them to be able to support things and work in a collaborative manner.'",
        "'speaker_1': 'And, you know, I can't speak for my colleague because he recused himself, but I mean, there may be something on here he wants to support. And, you know, I think that if we can give him the opportunity to in the future, that would be helpful.'",
        "'speaker_0': 'All right. And would you also like to make a motion?'",
        "'speaker_1': 'Yes. I'll move approval of the item.'",
        "'speaker_0': 'All right. I have a second. Second vice mayor knocks way his second. So could we have a roll call vote, please? Any discussion? Any further discussion? Hearing. Now we have the roll call, please. I see. And not quite.'",
        "'speaker_0': 'I can't. Councilmember Odie. Hi, Vella. I may or as the Ashcroft high now carries by for as one top rate. And then can we retrieve Mr. Days? Lock him back in. Right. All right. All right. Places, everyone. Okay, so then we move to the last consent calendar item that was close at five K.'",
        "'speaker_0': 'Mr. Day. Thank you.'",
        "'speaker_1': 'Just quickly, I didn't support this one. This was on the regular. So and I will continue to hold the same position.'"
    ],
    "Development Agreement for Boatworks Project at Clement Avenue.": [
        "'speaker_0': 'All right. Thank you. Any further discussion? Do I have a motion to read? And this is approval of an ordinance approving a development agreement signed between the City of Alameda and Boat Works, LLC, governing the Boat Works Project for Real Property, located at 2229 to 2235 Clinton Avenue.'",
        "'speaker_0': 'It's been moved by the vice mayor and seconded by. Councilmember Odie. All right, roll call. Vote, please. Councilmember Jason.'",
        "'speaker_1': 'Know?'",
        "'speaker_0': 'Not quite.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Odie.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'La la. High May as the Ashcroft high that carries four, two, one. Thank you. All right. So with that, we will move on to the regular agenda items. And I should ask at the top of the agenda, Madam Cook, do you have public comments on all of these, any of these?'",
        "'speaker_0': 'So far I only have one public comment on six a. Okay. Well that's the first of will hear the staff report first. And so who is presenting that. I believe Andrew should be joining momentarily. Oh, that's good. Are you waving your hand?'",
        "'speaker_0': 'Yes. Is John is John presenting? Yes, I think he is. John? I could read.'",
        "'speaker_1': 'It's been a long day. I'm a little punchy. I apologize.'",
        "'speaker_0': 'Yeah. We're giving you McCartney a little slack. That there may be demerits in your performance evaluation. Okay. And so. Well, I'm in. Andrew's on his way to his computer or. I mean.'",
        "'speaker_1': 'He was on a. Michelle Mute.'",
        "'speaker_0': 'So is that a fire drill? And we all need to run outside.'",
        "'speaker_1': 'She was on a few minutes ago and married. He went on. So he might be coming back on.'",
        "'speaker_0': 'You know what I'm going to do? I'm going to move on to He's got me on 62. Oh, okay. Are you there, Andrew? There's Andrew. Yes. Send that. And can you can you also can we hear you here in muted.'",
        "'speaker_0': 'Say something, Andrew. Andrew, can you hear us believe he's working on his audio still? I think connecting via phone and that might be that might be a. Okay. Are we ready to go or. I'm going to jump to item six.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Oh.'",
        "'speaker_0': 'Okay. Are you there?'",
        "'speaker_1': 'Yes, I am.'",
        "'speaker_0': 'Can you hear me? Yeah. You're good now. That's great. Well, good in there. Whoever has our, like. Oh.'",
        "'speaker_1': 'Yeah, hold on, hold on. Let me take care of that.'",
        "'speaker_0': 'Yeah, cause we'll get feedback.'",
        "'speaker_1': 'Oh, gosh. Hold on a second. Uh.'",
        "'speaker_0': 'Uh.'",
        "'speaker_1': 'I gotta make sure I'm turning off the right thing.'",
        "'speaker_0': 'We'll know in a minute and I'll leave.'",
        "'speaker_1': 'Uh oh.'",
        "'speaker_0': 'Oh. Mike. Andre.'",
        "'speaker_1': 'Oh. Oh, my goodness. It sounded like it worked. But I am lost. But.'",
        "'speaker_0': 'Still. I think you're still on the line. Pretty much. Laura, can you tell? Yes. It doesn't sound like it's on anymore. I think he's good. Great.'",
        "'speaker_1': 'All right. Take it away.'",
        "'speaker_0': 'I think you are.'",
        "'speaker_1': 'Sorry about that.'",
        "'speaker_0': 'No worries. We're all new at this, Andrew. Mr. Thomas. Just like.'"
    ],
    "Resolution and Direction on Policies and Tools for Safe and Sustainable Streets.": [
        "'speaker_1': 'That. This is harder than it looks at first glance. Sorry about that. They got set up. So, my name's Andrew Thomas, planning director. I am representing for today's item a team, a team of transportation planners and also public works department staff who have worked together on this.'",
        "'speaker_1': 'This has really been a joint effort. Today on the phone, I think I also have with me to help answer questions if necessary are our excellent city engineer, Scott Wickstrom, our well qualified. Senior transportation planner Rochelle Wheeler, and our overqualified part time transportation planner, Brian lives.'",
        "'speaker_0': 'In a tie. Oh, hi, Brian. Good.'",
        "'speaker_1': 'Is Brian wearing a tie?'",
        "'speaker_0': 'That's the first time I had to look at the name plate. But no. Okay.'",
        "'speaker_1': 'Just a little background. Back in September of last year, the city council approved a council referral to direct staff on transportation priorities and in advance of active transportation plan work. This resolution that we're presenting tonight addresses several of the requested short term actions that this council requested of us back in that referral.'",
        "'speaker_1': 'So we're responding to that referral. But it also and just as important. This this policy really is a step forward in the ongoing effort that this council is making to really transform Alameda transportation system, to make it safer, more environmentally sensitive, and just work better for all of our users, particularly our most vulnerable users of our transportation'",
        "'speaker_1': 'system. On November 5th of last year. This City Council adopted a Vision Zero policy aiming at reducing and ultimately eliminating severe and fatal injuries caused by traffic collisions in Alameda. This policy that we're bringing to you tonight, which was put together by our two departments working together, establishes safety as the number one priority for the design, reconfiguration'",
        "'speaker_1': 'and maintenance of city streets. Vision. Vision Zero dictates that we change the way the public right of way looks, feels, and operate. To achieve Alameda Transportation Safety and Climate Action Goals just for some of the viewers who might be listening in.'",
        "'speaker_1': 'This is a very important issue here in Alameda. This council taking a real leadership role in this, that the just one data point here between over the last ten years are on a ten year average between 2009 and 2018.'",
        "'speaker_1': 'Each year, an average of two people die and nine suffer severe injuries while traveling by either car by four foot on Alameda Streets. And just last fall, 12 collisions involving school aged children walking or biking occurred on our city streets.'",
        "'speaker_1': 'So we think this policy is an important step in transforming our network to be safe for all of our residents. It's not the final step. We still have a lot more work to do, but we do think it's a very important step.'",
        "'speaker_1': 'What I'm going to do now is just quickly, I'm not going to go through the entire policy and every single step, every single piece of it. But I want to just highlight some of the major policy directions that that are included here.'",
        "'speaker_1': 'This policy really states and reinforces the Vision Zero policy by stating that safety is our first and foremost priority when designing or redesigning streets. The resolution establishes a hierarchy and clear priorities for how we're going to allocate rights of way space.'",
        "'speaker_1': 'When we designing, redesigning or resurfacing streets safe and convenient, access for the most vulnerable road users is the highest priority, including children, seniors, people bicycling and walking. Transit priority is the second priority, as well as Americans with Disabilities Act accessibility.'",
        "'speaker_1': 'And then third priority will be space for on street parking. So we're establishing a very clear hierarchy with this policy. We know that all of these things are important to Alameda residents and businesses, but it's important to set that higher up that hierarchy so that when we have to decide how to use limited space, we have a'",
        "'speaker_1': 'clear set of priorities. The second aspect of this policy that we think is very important is that this relationship, that if we want to reduce deaths on our streets, we need to reduce speed. And by reducing and we can reduce speeds of vehicles by reducing travel.'",
        "'speaker_1': 'LANE With measures that reduce motor vehicle speeds can save lives. A person walking has only a 50% chance of living if hit by a car that's traveling 42 miles an hour. But if that same person but that same person has a 90% chance of living, if the car is only traveling 23 miles an hour per ngakoue, the'",
        "'speaker_1': 'National Transportation Organization's Urban Street Design Guide. Wider travel lanes are directly correlated with higher vehicle speeds. So what this policy says is that our streets in Alameda, our goal is to have our streets be 25 miles per hour.'",
        "'speaker_1': 'That is not only how we want to establish speed limits, but also how we want actual speeds to occur. What we see in Alameda is even though in some of these streets that are assigned for 25 miles an hour, we have people driving much faster.'",
        "'speaker_1': 'So with a couple exceptions, of course, we have Doolittle Drive and Harper Bay Parkway. So this policy says our standard width for travel lanes in Alameda will be ten feet. This as per national standards. There is an exception when working with trend on transit streets where we have transit busses or designated truck routes.'",
        "'speaker_1': 'Will the standard will be 11 feet. Less than ten feet is also possible when we are dealing with low volume residential streets. In other words, we're going to keep those travel speeds low. Next that I'd like to highlight bicycle lane and parking lane with the allocation of space between an automobile travel lane and the curb for bicycle'",
        "'speaker_1': 'lanes and on street parking. This requires a really careful balance and marking of space to ensure the safety of the people. Bicycling The people on the bicyclists on a bicycle are the more vulnerable of the users. So what this policy states is that the use of space for the safety of people bicycling is a higher priority than'",
        "'speaker_1': 'the use of space for on street parking. The policy states that separated bicycle lanes should always be provided instead of unprotected bike lanes whenever we can. So if we can find the space to protect the bicyclists, that should be our highest priority.'",
        "'speaker_1': 'And there's a standard width for a parking is eight feet, but seven feet is acceptable if necessary, to provide that safe bicycle facility for the more vulnerable user on the bicycle. As we move on now to the pedestrians, crosswalks and bulb outs, pedestrians and children walking and biking or being struck by automobiles in Alameda, shortening are crossing'",
        "'speaker_1': 'distances, slowing turning movements and visually narrowing roadway through the use of marks. Ball boats will increase pedestrian safety in Alameda. The safety impacts are even greater when accompanied by the use of bollards and other physical barriers and indicators.'",
        "'speaker_1': 'The City of Oakland did a study and found that 80% and 80% increase in the frequency of drivers yielding to pedestrians after they installed a paint and bollard pulled out at the uncontrolled intersection of Harrison Street and 23rd Street.'",
        "'speaker_1': 'This resolution states that more crosswalks should be placed at regular and interval and frequent intervals, arterials and collective streets that going forward. We are going to look at not just how many pedestrians cross the street today when we think about where to put pedestrian facilities.'",
        "'speaker_1': 'But what how many would use this crossing if we put in a safer crossing or with future development in the area? So looking forward to future pedestrian levels as well as current and looking ahead, placement will be prioritized according to high injury corridors, uncontrolled crossings at arterials and collector streets and locations, corridors and typologies identified in our'",
        "'speaker_1': 'upcoming active transportation and Vision Zero plans. Finally, the resolution also acknowledges that striping adding crosswalks both about this will require additional adventures of limited public funds for roadway improvements. Yes, we felt it was important to acknowledge that these facilities, bollards and striping require maintenance and physical barriers, will reduce the efficiency of things like the city street sweeping'",
        "'speaker_1': 'program. But we will we acknowledge in this resolution that these increased costs will need to be reflected in future city budgets, and that those issues and cost implications will have to be addressed with each, you know, capital improvement program and city budget as we move forward.'",
        "'speaker_1': 'And there may be tradeoffs between things like street paving priorities and other things. So this policy, we think, is an important step, aided by by no means the final step. We still have lots of work to be done to transform Alameda Transportation Network into that network that is safe and convenient for all users, especially the most vulnerable'",
        "'speaker_1': ', and a network that supports our immediate climate action goals. As work continues on our planning effort, we will still we will be back in the future with more pieces of this and more steps in this process. It's going to be a long process, but staff is committed to working with the council to achieve these goals.'",
        "'speaker_1': 'It's not just about the climate. It's not just about traffic reduction. It's really about saving lives. So from our perspective, there's really nothing any more important than that. We're here to answer any questions you might have about the resolution.'",
        "'speaker_1': 'I think we have Scott and Brian and Rachelle and maybe some others on the phone to help me answer those questions. So with that, I'll turn it back. Turn it over to you.'",
        "'speaker_0': 'Thank you, Mr. Thomas. Great report. Important topic, miss. Why do we have any public comments on this item? We have three so far, and one more person has said that sending it in in the moment. Okay. So right now, I just want to hear from council.'",
        "'speaker_0': 'If you have any clarifying questions to ask of Mr. Thomas, we'll hold our praise and our discussion and all that after the the public comment and even have any clarifying questions. Councilmember Otis.'",
        "'speaker_1': 'Thank you, Madam Mayor. Just a couple of quick ones. And forgive me for asking this because I know we discussed this, but these buttons have been in the news. Could we do something on that already? Because I didn't see anything in there.'",
        "'speaker_1': 'And the belly button.'",
        "'speaker_0': 'You know, I might like to call on our city engineer, traffic engineer, city engineer, Scott Wickstrom to answer that one. Yeah, you are. Scott.'",
        "'speaker_1': 'Hello? Hello? Yes. Enter the number of his question. Beg buttons. We're not specifically part of this referral.'",
        "'speaker_0': 'And if I could just ask that you tell us what a big button is. But actually, let me just go to Mr. Chan, our city attorney. I do try to keep him happy, or Mr. Rasch or both of you in tandem.'",
        "'speaker_0': 'Segments can be about crosswalks.'",
        "'speaker_1': 'So, yes.'",
        "'speaker_0': 'You know what that what you're talking about, it's the button you press to ask for the pedestrian crossing icon to come on. And so.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Status sufficiently related to the topic at hand?'",
        "'speaker_1': 'Yes. Yes, I think so.'",
        "'speaker_0': 'Okay. All right.'",
        "'speaker_1': 'This is Michael. Can you hear me?'",
        "'speaker_0': 'Yes, Michael.'",
        "'speaker_1': 'Yes, I think it's relevant. It's relevant enough in this whole scheme of the transportation discussion. But I think it's appropriate question for for the best guy to answer.'",
        "'speaker_0': 'Thank you. Thank you both. Okay. I just want to make sure. So. So tell us I mean, my my description was a little brief that when we when we hear the term big button, what does that mean?'",
        "'speaker_1': 'Yes. Really, it's a pedestrian push button that you'll see at signalized intersections and at some particular locations. The pedestrian is actually required to push the button in order for the green walk symbol to come up. And that's referred sometimes as a garden, as a possible tree in response to something very complex.'",
        "'speaker_1': 'Here's the first one is this referral is really the first component of the referral is really looking at the lane with some crosswalks and some bollards. There will be a separate response coming back to look at what is termed intersection access equity, which is a broader term between the relationship and the priorities between cars, bikes and pedestrians'",
        "'speaker_1': '. We will be coming back. Transportation engineer Daniel Mira and I leading that referral at some point in the future. There's a separate question more related to the COVID 19 response, and we are looking into exactly where in the city the number of instances where pedestrians are required to push the button prior to cross.'",
        "'speaker_1': 'And we're looking to get that information gathered by either end of this week or early next week to have ready that make up for making it better.'",
        "'speaker_0': 'I appreciate that. My second.'",
        "'speaker_1': 'Question. You had a in your outstanding questions you asked us should crosswalks I think place intersection pairs of clubs. Can you kind of maybe talk about the pros and cons of of pairs versus clubs to help us provide input on that question?'",
        "'speaker_1': 'Right. I will go ahead to start on that. I might ask Rochelle to kind of add a little bit of context to that as well. We have a number of locations where for one reason or another, historically, there's only been a crosswalk on one side of the street.'",
        "'speaker_1': 'And what would what attend obliges a pedestrian to do is to walk. If they're just trying to go across that one leg without the crosswalk, they have to cross three sides of the road as opposed to going straight across.'",
        "'speaker_1': 'So the question, the desire, is it whenever possible to have them in pairs or quads? We're kind of speaking, soliciting your input on it. There are times I will say and it's not common, but there are some times where it is preferred from a traffic safety standpoint that you would only locate on one leg and not on'",
        "'speaker_1': 'all legs. But if there's no traffic safety consideration that's found, that's more of a general question. Would you prefer them in pairs? And we can't do anything to add.'",
        "'speaker_0': 'Hi, Michelle. Welcome. Hi. I know I don't have anything more to add. It's it's a matter of.'",
        "'speaker_1': 'Visibility of.'",
        "'speaker_0': 'Pedestrians.'",
        "'speaker_1': 'To motorists.'",
        "'speaker_0': 'By having more of the.'",
        "'speaker_1': 'Crosswalks straight. So to for.'",
        "'speaker_0': 'Rather than just to it's I think it's also a matter of.'",
        "'speaker_1': 'Signifying to the roadway.'",
        "'speaker_0': 'Users, all of the users that the street.'",
        "'speaker_1': 'Belongs to everyone to use. Thank you.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Thank you. Okay. My time to run. So just be aware of that, and I'm done. Thank you. Oh.'",
        "'speaker_0': 'But, madam. Okay. You're running out of time. But, Madam Clerk, we make sure that you're timing the speakers, including us. So Larry's muted the. I'm sure she's nodding her head. There's the. Um. So any other council clerk. Staff reports.'",
        "'speaker_0': 'I see no hands.'",
        "'speaker_1': 'I have questions. Tony. Yeah. Can you hear me? I think things are going in and out.'",
        "'speaker_0': 'Oh, dear. I'm losing people here.'",
        "'speaker_1': 'Oh. Can you hear me? Yeah. Yeah. I can hear you, Jim. I don't see me at all. Oh, yes, you're right. I think she. I hear her, but I don't see her. Oh, I don't hear her. Sorry, Marilyn, I don't.'",
        "'speaker_1': 'The voices. Her face is back. Okay. Yes, yes. Same with me. Um. I only hear you, Jim. Is there anyone else? I'm here. Oh, okay. All right. Not not talking to. Yeah. Only I can hear you, too. Okay, so I go ahead and ask my questions.'",
        "'speaker_1': 'Okay. Okay. I'm going to ask you a question. Oh. I'll hold off on them and say something.'",
        "'speaker_0': 'I want to just be. Okay. That was that. You took it from there. Oh, I shouldn't. Yes, you are correct.'",
        "'speaker_1': 'Great. I can hear you merrily.'",
        "'speaker_0': 'And I'm sure the staff is. Yeah. I think staff is frantically. Working on it. It's appear that people are we're having some various bandwidth issues. So I'm getting. So you're lucky. Well, I see. And seeing if there's anything we can do about it.'",
        "'speaker_0': 'But if you end up losing both video and audio, I would suggest you put your video on mute and your audio will hopefully continue better. But we just think, okay, you want us to put our video on mute?'",
        "'speaker_0': 'Just if you run into bandwidth issues again. Okay. And I have I have a request, Laura. I actually think I should be watching this meeting in real time. But we should not have we should not have to email them to get their attention, especially after last night.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Yeah. Thank you. Please. Yep. Okay.'",
        "'speaker_1': 'It's like, you.'",
        "'speaker_0': 'Know, let's just hold for just a minute because I think the city clerk may be working on getting us a connection, but.'",
        "'speaker_1': 'Okay. Sounds good.'",
        "'speaker_0': 'Yeah. Thank you. I hope that people establish. I think. Okay. But Laura. Yeah? I texted. I like them, and we're getting them in real time until I adjourn this meeting. Yeah. Thank you. Yeah, I hear you. Yeah. Lightning is not going to strike twice.'",
        "'speaker_0': 'Okay. Thank you. Okay, so our next clarifying question is you Councilmember De.'",
        "'speaker_1': 'Well, thank you. I have several clarifying questions. The first is I received an email from a Web history business owner who was concerned about the placing on street parking as the lowest priority. What concerns and particularly he he felt that that would definitely affect small businesses, not just on Webster Street, but elsewhere.'",
        "'speaker_1': 'What kind of thoughts have been given to how this affects local small businesses on Webster Street or Park Street?'",
        "'speaker_0': 'I'm sorry, what was it that what what particular aspect was hit just.'",
        "'speaker_1': 'So at the very top of page three, that three of five at the very top, there's the first bullet point. And I think the second or third sentence says that the on street parking will be the lowest priority.'",
        "'speaker_1': 'So the question that I have is, in what ways has staff, you know, discussed among themselves as well as stakeholders, how this affects small businesses?'",
        "'speaker_0': 'Got it. Okay. And Mr. Thomas is going to address that.'",
        "'speaker_1': 'Can you hear me?'",
        "'speaker_0': 'Yeah, I can hear you just fine.'",
        "'speaker_1': 'Yeah, no, it's a great question. I think it's we we have to be very clear here. What we're saying is we're not. This policy does not say we are going to run out and start removing a bunch of on street parking.'",
        "'speaker_1': 'We know on street parking is important. We know it's important in the business community. What this resolution is saying is if we are balancing a situation where we have an unsafe situation for a vulnerable user, like for pedestrians who might be walking to that same business or children biking to school and the we have to decide how'",
        "'speaker_1': 'to use a limited amount of space. The priority is going to go to making sure that we we, you know, we make that pitch that that. That location safe for the user, the most vulnerable user. And in this case, it is going to be the child going to school or the senior crossing the street.'",
        "'speaker_1': 'Obviously, we want to be able to provide for everybody's needs. We get it. We local businesses need parking. I think.'",
        "'speaker_0': 'In in.'",
        "'speaker_1': 'Cases like Webster Street, where we are looking at pedestrian safety.'",
        "'speaker_0': 'Issues.'",
        "'speaker_1': 'On Webster Street, if we have an intersection where we do not meet our our visibility needs, you know, the recent council policy that said we need 20 feet at at two daylight intersections. Yes, we're going to for example, that policy already establishes the priority.'",
        "'speaker_1': 'We remove the parking space to get the visibility for the pedestrian. But this doesn't mean that we just randomly go around the city and start pulling out parking just for the sake of pulling up parking. It's only where we need it to ensure that the other users are are safe.'",
        "'speaker_1': 'So this is not we will always try to preserve as much on street parking as we can. But if it's a tradeoff between a single parking space and preserving somebody's life, we're always with this policy says we're always going to air on the side of saving somebody's life.'",
        "'speaker_1': 'Okay, follow up question, which is separate.'",
        "'speaker_0': 'Coverage. Okay, great.'",
        "'speaker_1': 'Is it correct that the transportation element hasn't been updated since 2009 or. And so, if that's correct, what thought has been given to doing this kind of changes that are contemplated tonight within the context of the transportation element, as well as within the larger context of the general plan, updating the general plan as a whole in June'",
        "'speaker_1': 'and updating the general plan as a whole, one chapter, which is a transportation element, you're looking not just at traffic transportation issues, but in combination with a set of other issues housing, how you want your built environment, etc..'",
        "'speaker_1': 'So I think I think I think that as the as the planner guy, I love that question. I think that's a great question. I completely agree with the the direction of that question, which is we have to make sure that all these documents are consistent and that they are comprehensive and consider all these different issues.'",
        "'speaker_1': 'So what this this you know, your staff under the direction of this city council is working on multiple fronts simultaneously. We have a complete rewrite of the general plan, load it up on the city's website today. The one chapter that we are probably the final chapter that we're updating is the transportation element.'",
        "'speaker_1': 'It will be up on the city website probably within two weeks. Meanwhile, we're doing an active transportation plan, which is the plan for bicycle and pedestrian planning update. Meanwhile, we're doing a Vision Zero plan which the council authorized.'",
        "'speaker_1': 'So all of this work is going on simultaneously. It was really the count this council that said, yeah, we and this goes back to the when you authorize the contract for the active transportation plan and when you did this September referral that this council said, yeah, we don't I mean, this is my words, not yours.'",
        "'speaker_1': 'But essentially this council said, don't wait. You know, we don't want to wait for a year and a half to see these plans start bringing some of these policies to us as soon as you can. And from that perspective, we love that approach because it is each of these opportunities come back to you with these policies are'",
        "'speaker_1': 'an opportunity for us to check in with you and and make sure that we're headed in the right direction. So if you adopt these policies tonight, some of these policies that are we are bringing to you now in this draft policy are also when you see the transportation element posted on the website in probably two weeks, you'll'",
        "'speaker_1': 'see these same policies there. Now, of course, tonight you say, hey, we don't want these policies, we don't like these policies. We don't support them more than we'll pull them right out of that draft transportation element. And as the taskforce says, if you if you adopt these policies tonight.'",
        "'speaker_1': 'You will see these policies not only in the transportation and also in the upcoming active transportation plan. So where we're doing it all at once and we agree it all has to be coordinated. So the general plan looks at and updates the policies in the general plan around climate change, around transportation, around land use and housing, around'",
        "'speaker_1': 'economic development. So it's all being coordinated together. I think it's the right way to do it. It's a big job, but it's the council's up for it. Staff is certainly ready and putting you in position to take action on all these plans.'",
        "'speaker_1': 'The one wrinkle in all of this has been COVID 19. We can't we're not scheduling any public hearings other than these council meetings at this point on the general plan. We're going to wait. We're putting stuff up on the website, but, you know, we're not holding big public meetings on the general plan update.'",
        "'speaker_1': 'So until things settle down with the COVID 19. I have one more question, but I can wait.'",
        "'speaker_0': 'You want to wait until after we hear the public comments.'",
        "'speaker_1': 'Or if other council members have questions?'",
        "'speaker_0': 'Okay. Any clarifying questions before we go to our public speakers? Okay. Councilmember Desai, if you have another clarifying question and you appear to be the only councilmember. Before we go to public comment. So I do.'",
        "'speaker_1': 'Ask. I do. Mike, I sent an email last week and there was a pretty strong statement in the staff report that correlated narrow streets with safety. And the question that I sent was if there was any academic research to back that up, because when I read the the when I read the article in the the staff report'",
        "'speaker_1': ', I thought that was a very strong statement in that and that that some kind of.'",
        "'speaker_0': 'Data is there. Is your question is there academic research behind it? Because this is clarifying questions.'",
        "'speaker_1': 'Well, what, you know, I guess did in addition to Marketo, which is a stakeholder organization, did you find academic research to support that claim?'",
        "'speaker_0': 'Thank you, Mr. Thomas.'",
        "'speaker_1': 'Thank you. Well, Nextel is a national organization of transportation professionals that set guidelines that are followed by cities around the country. And they've done a lot of research on the relationship. And there is quite a bit I don't have the study at my fingertips, but we can certainly provide them.'",
        "'speaker_1': 'There's there's a lot of research. Let me hand it off to Brian Maguire, if it's okay with you, Mayor, to help out with it.'",
        "'speaker_0': 'Is that okay with Brian? You're ready for that?'",
        "'speaker_1': 'Sure. Yeah. Brian McGuire. Just just to jump in and add that the standards that Maxo uses and that we're trying to adopt here are based off of several like FH subway research and people, you know.'",
        "'speaker_0': 'Tell us that. Why don't you tell us what that acronym stands for, for this insiders?'",
        "'speaker_1': 'So to answer the question, yes, the data is used in study by academics to study like Federal Highway Administration type data and other resources to develop these standards. So they are are definitely academic, you know, academically valid studies and and data driven standards.'",
        "'speaker_1': 'And that's okay.'",
        "'speaker_0': 'Thank you. All right. So seeing that further clarifying questions, I am going to go to public comment. So, madam, quickly, you call first or read our first comment, I guess. Yes, I can read the first comment. I think there are 545 comments now, so we still get 3 minutes each.'",
        "'speaker_0': 'The first one is from Linda Astbury, West Alameda Business Association. Please note that within the WAPA Business District we value our customers that prefer bicycling from there for their form of transportation. However, on street parking is a critical element in the preservation of local business.'",
        "'speaker_0': 'The agenda item in question six May 20, 2070 761. That parking identified as the lowest priority, suggests the business district and the local businesses are a low priority, particularly when we will be Post-Coronavirus times. Business revenues will be down to reduce street parking hits businesses even more.'",
        "'speaker_0': 'To reduce parking would be a large hit for small businesses in the area. Parking preservation should be noted as a priority, not as a dismissed item. Okay. Okay. That was one. Okay. You did that in less than 3 minutes.'",
        "'speaker_0': 'Okay. Yes. Next is RN and I'm going to apologize for the at you. Very, I believe. Madam Mayor, council members and city staff as commercial and residential property owners in Alameda, we would like to express our deep concerns of providing vision and or plan language within the resolution item six eight, which may and will be utilized to'",
        "'speaker_0': 'eliminate on street parking. The city utilized similar language, a vision and or a plan to place the current plans being developed involving the arterial roads on Central Avenue and Webster Street and its intersection in development at an approximate cost of $12 million.'",
        "'speaker_0': 'The outcome of this language and idea they will push traffic away from the business district and toward the city owned developing property at the old Naval Air Station by lane reduction or on street parking elimination on the arterial roads of Alameda without any serious development consideration as to removal of on street parking and its effects on homeowners'",
        "'speaker_0': ', businesses and the business districts as a large mistake during any time the business community and property owners who have contributed investment dollars, tax dollars, sweat, blood and tears seem to be being left out of consideration by the elimination of on street parking without as much as a study as to what each parking spot lost equates to within'",
        "'speaker_0': 'a business district or on a non residential street. Parking lost means lost to home values, lost to business, which means lost staff and loss of our lives. The return on investment is what Mom and Pops are counting on in their retirement and from their prop real property investment, presenting parking as the lowest priority.'",
        "'speaker_0': 'Denigrates the business district's small businesses, which rely on local parking in each and every real property owner. Hurting the financial position of property owners does not do anyone any good. You must protect on street parking so residents, businesses and the business districts can survive long term in a business shutdown like we have now more than ever on'",
        "'speaker_0': 'street parking. Preservation needs to occur and needs to be a high consideration. Having on street parking saves businesses, saves lives and save cities. And the next speaker is Jay Lucy. Madam Mayor, council members and city staff as longtime property owners in Alameda.'",
        "'speaker_0': 'We are surprised that this item is before the council at this time. The perspective of parking preservation for on street parking remains the same as with the Webster Street and Central Avenue intersection. Within the best business district on street parking is critical.'",
        "'speaker_0': 'A critical element in the preservation of local businesses. Resolution item six eight presents that on street parking be noted as the lowest priority, suggesting the business districts and the local businesses are a low priority. Business districts are critical to the city, the residents and real property owners.'",
        "'speaker_0': 'It would make a lot of sense for the City Council and its staff to openly discuss this topic with the city's business associations, local businesses and property owners on an upcoming agenda. On street parking, preservation should be noted as a priority.'",
        "'speaker_0': 'Hurting the financial position of businesses and property owners only denigrates the city the council must protect on street parking so residents, businesses and the business districts can thrive. Let's preserve on street parking for the future. And the new speaker is Jim Strelow, a lifelong resident.'",
        "'speaker_0': 'Deaths and injuries are just statistics. Accidents happen. We need to drill down into fault factors. Was the pedestrian or bicyclist or the driver distracted e.g. cell phone? Or both of them was accident caused by poor lighting, fog or dark clothing?'",
        "'speaker_0': 'Worn was either person under the influence travel lane width narrower than ten foot road lanes can lead to more head on collisions, which would send crashed vehicles into straight bike lanes, making bicycling more dangerous instead of less dangerous.'",
        "'speaker_0': 'Delivery trucks and moving vans on narrower streets create an even more hazardous passing situation, meaning three and a half feet. To clear a bike, a six and a half foot wide, average vehicle width means zero inches as vehicles pass each other on the roadway.'",
        "'speaker_0': 'How safe is that on the streets now? All Alameda streets are straight. Not all Alameda streets are straight. Streets that curb half to allow for a truck's slept width where a truck travels inside the curve or outside the curve of a roadway.'",
        "'speaker_0': 'Are you allowing for the AFC? T o's slept with wit pass recommendations. The Transportation Commission was concerned about enforcement, police, understaffed and policy versus guiding principles. Where the Commission argued against the details of ten foot lane width and using bollards since your policy policy just.'",
        "'speaker_0': 'Should just be general strategies. There is no mention anywhere for of safety for the evacuation of the island. Narrowing lanes reduces the width of many streets necessary for the safe evacuation of the island in an emergency for convenience.'",
        "'speaker_0': 'A very limited few bicyclists versus the necessary safety of a majority population in Alameda are misguided priorities. Is the port in the policy is accepting these priorities necessarily prioritizes the preservation of on street parking. Adoption of this resolution will result in less space in the public right of way for the short and long term storage of private'",
        "'speaker_0': 'vehicles, taking away parking spaces from businesses at a time when businesses need all the help they need, all the business that they can muster is again the wrong priority for this city. Thank you. Thank you. And one more comment, right?'",
        "'speaker_0': 'Yes, that's the last one. And this is from Suzy Hofstetter. Mayor as the Ashraf City Council members. My name is Susie Hofstetter. Hofstetter and I am both a constituent and advocacy manager with Bike Eastbay. I have already submitted comments to you via email and I'd like to add a comment for the public meeting to repeat my many'",
        "'speaker_0': 'thanks to our excellent staff team in transportation, planning and public works for developing excellent standards for transportation safety in our city. As Mr. Thomas said, we have had an unfortunate sequence of tragic crashes on our streets in the past few months.'",
        "'speaker_0': 'The standards you are reviewing today are the first step in a more robust revamp of our standard designs that will take place during the process of the Vision Zero Action Plan and Active Transportation Plan. The standards ensure that new projects coming online during re paving and redevelopment will be as safe as possible, reducing traffic speeds and making'",
        "'speaker_0': 'our city safer for the most vulnerable road users. Thank you in advance for your support of street safety. And that is the last. Thank you. That's what I said. I just want to I have a clarifying question about some of those comments, especially from the business community.'",
        "'speaker_0': 'Mr. THOMAS I've attended a few of the Labor West Alameda Business Association board meetings probably then this week and this week this year, but last year and all of the ones I attended, you were also there. Have you made it a point to attend business association meetings to talk about these plans?'",
        "'speaker_1': 'Well, we've been we've been meeting with we've been talking to business associations, various groups around the city about Vision Zero, about and about specific plans. And I think that's where there seems to be some misunderstanding here. This is an overall policy.'",
        "'speaker_1': 'This is a policy establishing what the city will do when we have a specific situation where we're trying to balance the needs in a specific location, space needs. This is not a policy that is saying, hey, we're going to go and start taking out all the on street parking in the business districts.'",
        "'speaker_1': 'Of course, we're not going to do that. This is when we do a project in the business districts. We always involve them. We've been working with the labor, the West Alameda Business Association for years on the Central Avenue Project.'",
        "'speaker_1': 'Rozelle met with them today about the active transportation plan and future plans for Webster Street to make it more bicycle friendly. This is, you know, I guess I'm I'm a little bit. So I think there's this misconception. I mean, I guess no.'",
        "'speaker_1': 'Have we have we gone to the business and said, hey, what's more important, a parking space or the life of a child? No, we have not, because we think we know what their answer would be. It's of course, the life of the child is more important.'",
        "'speaker_0': 'And I don't want to belabor the point and we'll get into the council discussion. And by the way, Mr. McGuire, could I say I love the cat rocking back and forth cat and they should be safe on the streets, too.'",
        "'speaker_0': 'But I just and you have done your outreach to the business communities for years, and that outreach continues.'",
        "'speaker_1': 'So this is. Yes, I.'",
        "'speaker_0': 'Wanted to confirm. So with that, we've had our public comment period and we didn't receive any further public comment. Is that correct? Correct. Okay. Public comment. Okay. So then public comment is now closed and we will open the discussion and entertainment of the the this resolution.'",
        "'speaker_0': 'So who would like to start? Council member delegate. I see your hand that.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Your muted. Did I see your hand? But I didn't. I didn't. I didn't raise my hand. But I'm happy to say that that lovely blue background, a three off a little death. I'm Mai Mai. I'm calling in from my son's playroom so I can.'",
        "'speaker_0': 'I can simultaneously mom and participate in the meeting my son had. That's what we do. Yeah. So, yeah, I mean, I want to thank staff for their work on this. This has been a priority of the council as we've been talking about it for some time.'",
        "'speaker_0': 'I know that there's been a lot of outreach and a lot of conversation, both with the public and among the council at our publicly notice meetings. I did want to just say, you know, again, from a perspective of a mom and somebody who routinely walk the west end of our need, especially down Webster Street and in the'",
        "'speaker_0': 'surrounding areas, you know, the return on investment of removing a parking space to save a life is. Huge. It's preserving the safety of pedestrians. And we have a farmers market that draws in a lot of people that walk over there and a lot of people that walk to the businesses on Webster Street.'",
        "'speaker_0': 'And I want to make sure that, you know, everybody who's walking and biking over there, especially now that we have the the bikeway that's going to be crossing out and needed across our new trail, that that we really are making our streets as safe as possible.'",
        "'speaker_0': 'And so there really isn't a price you can put on saving a life and making it safer. And so if that means removing a parking spot from a corner so that we can make sure that there's better visibility, I think that that's a just an easy, easy fix and something that that really doesn't take a lot of'",
        "'speaker_0': 'thought on my end other than let's do it and let's get that done. I hear what the businesses are saying. I think that, you know, one of the things that's come out in this during the shelter orders is that we're seeing a lot more delivery and then takeout and pickup.'",
        "'speaker_0': 'And I think perhaps some of what we need isn't for potentially long term parking, but we need more, you know, kind of short term parking zones in our business district so that people that are picking up and doing the food delivery have a place to kind of pull in safely rather than double parked, pick up the food'",
        "'speaker_0': 'and go. But I also think that one thing that is coming out of all of this is that many, many of us are now walking or biking to go pick up our takeout food and enjoying the outdoors on the way over.'",
        "'speaker_0': 'Obviously, masks and following social distancing protocols. But I think we all need to evolve and I think traffic safety doesn't stop just because we're in a shelter order. In fact, we've we did have we've had a few bike versus vehicle or vehicle versus bike accidents.'",
        "'speaker_0': 'One was a fatality and that was during the shelter order. And I think we need to keep that in mind. And so I think that it absolutely makes sense that we continue forward with implementing what's safe. But I'm looking forward to supporting staff recommendations tonight.'",
        "'speaker_0': 'Thank you. Thank you, Councilmember and Councilmember Data.'",
        "'speaker_1': 'Well, thank you very much. I will have to say that I'm very troubled at the direction that this this item is going, in the sense of how we're linking traffic safety issues with, you know, changes to the physical environment.'",
        "'speaker_1': 'Um, you know, I'm not a traffic planner or a transit planner, but I did go to Berkeley's City of Regional Planning School to get my master's of city and regional planning from Cal. And I think one of the basic things that you always learn is when it comes to safety, you want to incorporate the three, the three'",
        "'speaker_1': 'E's, which is basically taking into account, you know, educating people kind of change the culture of traffic and the way in which people use the roads. So there's education. E And then there's also the engineering. E which is, you know, altering the streetscape in the, you know, perhaps in the manner that we're doing so right now.'",
        "'speaker_1': 'But then the third E would be enforcement. This is all very basic. And the thing that's concerning me about the trajectory of a discussion is we're we're really going overboard, in my opinion, on just emphasize emphasizing engineering aspects to all of this.'",
        "'speaker_1': 'I mean, if we really care. If we really care about the the the tragic statistics about, you know, two deaths per year and that, you know, one death or any death whatsoever is tragic. If we really care about the increase in society of pedestrian safety issues or basic life issues, and we can't just look at this from'",
        "'speaker_1': 'an engineering lens. We also have to certainly look at it, you know, from a from an enforcement position. Leading up to this this evening last week, I had asked city staff to give me some data on on traffic on citations for traffic speed violations.'",
        "'speaker_1': 'So, you know, speeding tickets, basically. So I asked for 20 years worth of data from the year 2000 each year until the year 2019. And I also asked for data on the number of traffic police officers, police officers in dealing with traffic.'",
        "'speaker_1': 'The interesting thing, though, is that. Over the course of those 12 years of those 20 years of the course of those 20 years, in 12 of those years, we had five or more traffic officers. And when we had five or more traffic officers, on average in those 12 years, they had citations.'",
        "'speaker_1': 'They generated citations of roughly 2300 speeding citations. Now, right now, I believe the number of traffic officers, we're down to three and four. And when you look at the average for those years, over the 20 years as well, of the 20 years we had 12 years where we had five traffic officers or more.'",
        "'speaker_1': 'The balance eight years we had five less than five traffic officers. And when you look at the amount of speeding citations on average in those eight years, we generated basically 1500 speeding violations per year. I mean, that's obvious.'",
        "'speaker_1': 'You have more you have more traffic officers. You catch more people who are speeding. It's obvious. It's very basic. And I think we're overemphasizing the engineering aspect of this. And as a and to me, as alarming as the fatality statistics are, as alarming as the as the pedestrian accidents are.'",
        "'speaker_1': 'To me, that's crying out for an emphasis or looking at this item with a lens, especially of enforcement, when you have five officers or more, if you generate on average 23,000, 2300 traffic speed citations a year, when you have less than five, 1500, that's a 55% difference.'",
        "'speaker_1': 'And and and it does go back to the very first question that I asked about, you know, why aren't we looking at this within the context of our general plan and within the context of our transportation element? Within the general plan?'",
        "'speaker_1': 'Because I think when you look at things like what we're dealing with tonight, you can't just look at it in isolation. You can't just look at it, you know, with the the lens of an engineer. There has to be an education component.'",
        "'speaker_1': 'There has to be an enforcement component. And finally, there has to be certainly an engineering component. But I think tonight we're looking at a document that's just too heavy on the engineering. I want to close on this much on this note.'",
        "'speaker_1': 'You know, I think one of the reasons why you're hearing a lot of concerns about Webster Street is we have to remember that Webster Street lost a lot of parking. They lost a lot of street parking because of the the bull belts that we've created.'",
        "'speaker_1': 'And they're wonderful. People use them, especially the one in front of West Cafe, the one in front of, you know, the other places on Webster Street. But also, we've also created those bus extensions. And so Webster Street does feel especially hard hit.'",
        "'speaker_1': 'So I think that's why they're they're clamoring right now. And, you know, the concern about the Central Avenue Webster Street bike project, certainly let's not kid ourselves necessarily is an issue here. I just want to end by summarizing.'",
        "'speaker_1': 'I think this is way too heavy on the engineering view of things. I think we need to look at it more holistically. As you're taught in basic, you know, city planning school, we need to look at how engineering enforcement and in education come together to bring down those fatality numbers that we're talking about.'",
        "'speaker_1': 'So it will be very hard for me to support this. Thank you.'",
        "'speaker_0': 'All right. Thank you. And I've seen that I have not had his agenda, but he has his hand up. So your next vice mayor.'",
        "'speaker_1': 'Thank you very much. I well, I appreciate the the comments that have come before me. I have to say, I'm a little flabbergasted in the. Okay. Sorry. Everybody just froze for a second. In in in the transportation, planning and world, it is very well understood that the environment and the design of the environment is the number one'",
        "'speaker_1': 'thing that we can do to make sure that we have safe streets, that that is what actually pushes the behavior. And when you're finally getting to the point of of enforcing behavior, it means you've designed the streets badly.'",
        "'speaker_1': 'And now we're penalizing people for behaving the way that we've encouraged them to do it. So. Well, I appreciate the comments and I appreciate the educational background of Councilmember Dessau. I would say his basic planning tenets that that he outlined represent more of an old school perception of how this is done and that the folks coming out'",
        "'speaker_1': 'of Cal and UCLA and University of Texas and and MIT and whatnot would would beg to differ. Today, I'm going to move forward. Again, I want to reflect I understand the concerns that we've heard from from Ms.. Astbury and onwards and and folks.'",
        "'speaker_1': 'And I think Mr. Thomas did a fine job of explaining that this is not an attack on parking. This is a win. There is a tradeoff to be made in something that is unsafe and people dying and and a parking space.'",
        "'speaker_1': 'We're going to choose protecting the residents and the safety of our residents. And I think that that is consistent with the policies and plans that we've put in place over the last 18 months. I think it's consistent with the policy and the planning that's been done in the last three or four years by the majority of the'",
        "'speaker_1': 'city council. And so I think this is a continuation of it. I think we have a very solid transportation element and that these these policies, as they're moving forward, are just a continuation of that. And I see no reason why we can't move forward.'",
        "'speaker_1': 'I want to thank so I'm excited. I will be supporting this. I do have one minor change. There were there were some questions in here. I also just wanted to we've received this as a part of this item, a number of comments asking about so streets.'",
        "'speaker_1': 'And I wanted to thank staff for circulating the map with the pilot, the two street pilot that's going around excited to see that we are moving forward with that concept. I want to really call out that in my mind, the pilot is a scheme, it's a short term pilot so that we're.'",
        "'speaker_0': 'Going to stay on topic.'",
        "'speaker_1': 'I understand. I'm also going to talk about traffic safety just for a few seconds. So I do want to make sure that that that the pilot really is our short term first step and that it leads to a more city wide, brighter place.'",
        "'speaker_1': 'I want to make sure back to back to the letters we got that as we're considering the safety impacts, including future projects like the Slow Streets that we're building, networks that will support our businesses as we come out of the time of COVID and maintain our social distancing.'",
        "'speaker_1': 'I want to highlight and concur with Councilmember Ody. A number of our cities are really moving forward with the intersection access in the time of COVID, COVID at a time when we don't want to be touching public infrastructure, people are turning their the pedestrian buttons off at their intersections.'",
        "'speaker_1': 'I see no reason why we can't be doing that. I don't think it should take a council direction. I think we can just start now where where activation is not required. We should just turn these things off. The council or the staff ask stuff five questions.'",
        "'speaker_1': 'And so on the question of intersections, I think Mr. Wheeler did a just fabulous job of explaining why we would want to have all of the crosswalks painted. It's because it signals that you're allowed to be there. Right now we have designed again back to design.'",
        "'speaker_1': 'We've designed a network where people who are in their cars actually think that that pedestrians have to be channeled is, as the question puts it, to a specific place where they are allowed to cross in any way, whether they're crossing that or isn't paint is there is thereby illegal and it basically inhibits people walking, it makes it'",
        "'speaker_1': 'less safe and it and it causes confusion. So I think that the pairs is very important. I understand that there's concern about the cost of extra paint and the wear and tear. And that's that is very real. I think that use of zebra striped crosswalks without the perpendicular bars has been shown in some cities to be one'",
        "'speaker_1': 'way to at least reduce the impact of those cross costs, because a lot of the cars actually travel between the bars and so there's less wear and tear on the actual paint. On the question of balancing safety versus areas where we want to create safety, you know, I think that our staff think through the active transportation program'",
        "'speaker_1': 'as well, can look at some sort of balance. Right. You're never going to be able to say it's just one thing. We're not going to do it. We're not going to say only high crash areas and we're not going to create safe places around schools so that they become high crash areas.'",
        "'speaker_1': 'I think that we can find a way to do a 7525 split or something like that whereby we can reflect that safety is our priority, but that there are also generators like schools, parks, business districts, etc., where safety, safety improvements are very important, not just from a safety aspect, but also from a encouraging people to use the'",
        "'speaker_1': 'space aspect. On the question of speed, obviously we want to be smart and data driven, but we also want to make sure that we don't plan ourselves into inactivity. And I think that, you know, I will continue to push for us to be tactical in our ways of implementing quick and effective things.'",
        "'speaker_1': 'That may not be the perfect solution, but they get us 95% or 90% of the way there while we're doing the data work in the background. And I say all of this with great respect and appreciation for the the the small but mighty staff that we have working on here.'",
        "'speaker_1': 'And I know that everybody is working very hard. And so my words are not that anything is being done wrong. But if you ask the question, should we do more now or should we plan to do more sometime later?'",
        "'speaker_1': 'You know, the answer is, of course, yes. And then lastly, the question about bollards and I think this is not just about bollards. Bollards can be ugly. I think it's unfortunate that people drive illegally and require us to put bollards up so that we can make sure they don't park in places that they are not supposed to'",
        "'speaker_1': ', that they turn slow enough that they don't run over people, etc.. But at the end of the day, much like the trade off between a parking space and safety, I think that it's very important for us to get to safety and that concerns about ugly people think everything is ugly when it's new.'",
        "'speaker_1': 'The bollards are just a new piece of infrastructure and we will get used to them and their garish yellow, pink, gray and purple colors. And sometimes, I mean, 15 years ago, if 15 years from now, they'll look like the the trash cans we put out every night.'",
        "'speaker_1': 'I remember when that changeover happened in Alameda about 15 years ago and people flipped out about the garish trash cans. What happened to the metal? You never rarely hear that concern anymore so quickly. Yeah. Again, I want to thank staff.'",
        "'speaker_1': 'This is a fabulous staff report. I really appreciate it. The one change I would like to propose is in the final voyage of the first. Now, therefore, be it resolved that separated bike lanes should be provided instead of unprotected standard bicycle lanes.'",
        "'speaker_0': 'And when you do not swipe left. Hey, John.'",
        "'speaker_1': 'I'm on paper. I can't tell you.'",
        "'speaker_0': 'Well, could you count because it's a five page reserve, so maybe. Okay, when you say so sorry.'",
        "'speaker_1': 'Yeah, hopefully we're going to run out of time, but I think it's about time. Thank you.'",
        "'speaker_0': 'Page three to look for the page. Thank you.'",
        "'speaker_1': 'I'm going to go with page three of the resolution.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'And fourth. Fifth, pull it down to two.'",
        "'speaker_0': 'Okay. Separated bike lanes.'",
        "'speaker_1': 'Yeah, separated bike lanes. Okay. So where it says separated bicycle lanes should be provided instead of unprotected standard bicycle lanes. When feasible, I would change that too, unless not feasible. I think that language needs to say that we should assume we're doing it unless we can prove that it's not as opposed to making the decision now, they'",
        "'speaker_1': 'don't seem feasible. And then we move on. I know it's it's just a little tweak, but I think that the goal here is to basically say we want the highest level of safety and encouragement and that that becomes a meaningful just reminder as people are thinking about the policy that I look forward to supporting this tonight.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'And I would add that, Jody, before I go to you, I just wanted to ask Mr. Thomas if you could just comment on the vice mayor's suggestion. Is there is that is it feasible to change when feasible to less invisible?'",
        "'speaker_0': 'And just go ahead and mute yourself so we can hear your lovely voice.'",
        "'speaker_1': 'Yes, it's fine.'",
        "'speaker_0': 'It's.'",
        "'speaker_1': 'It's fine. Okay. Do you hear me?'",
        "'speaker_0': 'Yes, I did. Yes. Thank you. Okay. So keep that in mind, Counsel, and then we'll go to Councilman Brody.'",
        "'speaker_1': 'Thank you. I want to thank staff for all their hard work on this. And I'm going to adopt a lot of what the vice mayor said. So I'm not going to take the whole 8 minutes or 9 minutes that I have.'",
        "'speaker_1': 'You know, I appreciate that they took this referral and ran with it. And, you know, I've been reading the updates from the city manager and at this time, you know, still working. Everyone's working really hard, but, you know, you're still working on your your area, working remotely and able to produce some high quality output.'",
        "'speaker_1': 'So I appreciate that. Just quickly on the questions. All right. The you know, I asked the question about the pairs versus Clark because, you know, there's really not my my area of expertize. So I'll defer to the engineering folks when it comes to that.'",
        "'speaker_1': 'And I would agree with the vice mayor that, you know, the more across work opportunities we have, the better. And, you know, if we can even have some of those X ones where the whole intersection is shut down, you know, that's even more the better and the limited resources and where to prioritize.'",
        "'speaker_1': 'You know, again, I'm kind of going to defer to staff on that. I know that every time we have an accident, you know, there's a lot of clamoring and the squeaky wheel and so on and so forth. But, you know, sometimes we're told by our our professional staff that, you know, well, this is the first time that's'",
        "'speaker_1': 'happened there, and there are other areas that need more priority. So, you know, I'm happy to defer to you. You know, I do think there is around school, though, our high priorities there is around parks in the areas, you know, in our business districts where we have, you know, the most pedestrian traffic.'",
        "'speaker_1': 'So as far as I mean, you know, I don't think ugly, you know, they serve a purpose. Well, I think it's I believe when people run over them and, you know, they're not replaced or we put one there and it gets destroyed and we don't go back and fix it.'",
        "'speaker_1': 'So, you know, the more we could do on there to help change behavior, the better. I appreciate the hierarchy. You know, it's not that we're saying that parking is a low priority. We're basically saying that life, especially children's lives, are a high priority.'",
        "'speaker_1': 'And it's interesting that we're having this discussion. At the same time, the national discussion is about, you know, do we reopen the economy at the risk of hundreds of thousands of lives or do we keep everyone safe and make that our priority and then, you know, open when it's safe?'",
        "'speaker_1': 'So, you know, just kind of food for thought. You know, I think when we had a big discussion on parking and bike lanes, you know, I think it was the Central Avenue traffic. And if I remember correctly and those that were there can correct me if I'm wrong, but I thought we took out one parking space on'",
        "'speaker_1': 'Central. It could have been two and it was on the eastbound side, so it wasn't even anywhere near going towards the business district. So I'm glad that we're to codify these these priorities. You know, there's always a risk that some, you know, road councilmember in the future may, you know, behind the scenes try to kill projects and'",
        "'speaker_1': 'you know now that it's codified and and also staff gets you know an idea on how to write their staff reports and our council gets an idea on, you know, what the priorities are. We won't have that lingering like we did with Central Avenue before.'",
        "'speaker_1': 'So I know that we've talked about the three E's and, you know, when the vice mayor and I had a town hall or what it just seems like forever ago, it was only like maybe two months, you know, we added the enactment.'",
        "'speaker_1': 'E because, you know, some of these solutions need an act in the state legislation. But on the engineering side, I think that we kind of under emphasized engineering, and that was the message that we kept hearing from residents across the city, you know, whether it be on websites or whether it be on LinkedIn, whether it be on'",
        "'speaker_1': 'Bay Farm, whether it be on, you know, Park Street or Otis, you know, we haven't done enough engineering. So and I also caution, you know, enforcement is such human capital intensive activity and we continue to ask more of our police department with, you know, fewer or fewer resources for reasons that pretty much are outside our control.'",
        "'speaker_1': 'So I think we have to be cognizant of that. But see, and, you know, I know there was some concern about the lack of traffic, but I think there are solutions that the engineers could look at, you know, try to cut off people from going or stop people from going from cutting around.'",
        "'speaker_1': 'And, you know, I remember that that the discussion was, well, if you put this bike lane in on Central, then you're only going to have maybe like a minute or two delay. So I mean, to me, a minute or two delay, whether you're going to make a left hand turn or right hand turn, I think is is'",
        "'speaker_1': 'totally acceptable if it means that you're going to save somebody's life. And we're just going back to the engineering. I mean, there are little things we do that impact that reduce the need for enforcement. I mean, I'll say a stoplight is one of them.'",
        "'speaker_1': 'And the speed bumps, you know, it's kind of a moderate example. You know, that's a that's an engineering tool that, you know, if it is deployed, right. People are not going to speed. I mean you can go to.'",
        "'speaker_1': 'Extreme and say, you know, every time that a stoplight comes up, you're going to put a pretty foot barrier and then nobody will ever go through the stoplight. Right. But, you know, that's not feasible. But the point is that fine line and a balance between enforcement and engineering and we need both.'",
        "'speaker_1': 'But, you know, I just think we're under engineered right now. So lastly, I think this also ties in with our goal. You know, we want to make a more pedestrian friendly design in this district. I mean, that is, as the vice mayor said, you know, that's what the experts that are coming out of school now say you'",
        "'speaker_1': 'want to do before San Francisco shut down Market Street. You know, this is the trend, Sixth Street or Fourth Street in Berkeley. And these are the places that we kind of want to emulate, you know, not where we have cars rushing down our business thoroughfares, you know, 80 miles an hour.'",
        "'speaker_1': 'And the last point, I can't even read my writing. Oh, it's also about, you know, the current thinking. Now, there's a lot of ink spilled about how poorly designed our streets are, whether they're in California, generally, the Bay Area or Alameda.'",
        "'speaker_1': 'So, I mean, the sooner we can go about it, fix that and, you know, undo the bad engineering and put in good engineering I'm all for and I appreciate all the hard work staff has done and I appreciate my colleagues for prioritizing this.'",
        "'speaker_1': 'And I'm glad that, you know, for once we're complaining about a problem, but actually coming up with a solution. And that's what I love about this council.'",
        "'speaker_0': 'All right. Thank you, Mr. Oteh. Okay. And to that, I'm going to take my comments next. And again, thank you to staff all of you who have contributed to this report. And this is is a very important topic and near and dear to my heart.'",
        "'speaker_0': 'And I'm going to start with the topic of speed and slowing down drivers. One of the things I've noticed now in Alameda that we do have less traffic on our streets because most businesses are closed, the schools are closed, the people are driving faster.'",
        "'speaker_0': 'They're driving faster than the 25 mile per hour speed limit. I've talked to our police chief, Paul O'Leary. He confirms that if the officers are out and see you, you can count on a citation. But in the meantime, and I say this every chance I get, more people are out walking because although we are physically distancing and'",
        "'speaker_0': 'we're sheltering in place except to go out for those essential activities, getting some fresh air and exercise are essential activities. Take your mask with you. I would suggest wearing it because you may run into other people closer than six feet away.'",
        "'speaker_0': 'But get out and and walk. Explore the city. We're flat, you know, take a different route every time you go out. But my husband and I try and walk in the early evenings and we're very careful crossing streets because and we carry a flashlight if it's starting to get dark because drivers are going fast.'",
        "'speaker_0': 'So this is not a good thing. And by the way, speaking of the restrictions from COVID 19, I do appreciate staff bringing this forward to us. There are things that are important and just can't wait and traffic, safety and the lives of our residents are certainly among them.'",
        "'speaker_0': 'So I want to also ask or just inquire to take this under consideration, to go after as much grant funding as possible for for these projects. And I know your office always does your department. Mr. THOMAS As far as the concerns from the business folks that we heard from, I was a little surprised because I have been'",
        "'speaker_0': 'at some of those meetings where Mr. Thomas is there and answering questions and presenting, and I know he's doing it at our business associations around town, so that's great to go out and inform people. It doesn't mean you get by it.'",
        "'speaker_0': 'It doesn't mean that everybody agrees with you that the fact that someone disagrees is one data point that needs to be considered. You weigh all the factors, and I and I look to the professionals who are informing this this decision or helping us make informed decisions.'",
        "'speaker_0': 'I did not study traffic engineering. I'm not an engineer, but I went to UC Davis. And one of the things I loved about Davis, besides the fact that it's an all bicycle campus, your professors will be riding alongside of you, that the whole city is bright as a bike, bicycle, friendly city.'",
        "'speaker_0': 'The bike lanes are wide enough in one direction for two people to ride side by side and have a conversation. And drivers understand there's bikes all over the place and they they stop. And so we can learn a lot of things.'",
        "'speaker_0': 'But I think good design and all of the inspired thinking that went into this report are so important. And as far as the enforcement piece, of course it's important. And of course, our police department takes that seriously. That's a reality, as in Councilmember De.'",
        "'speaker_0': 'Alluded to this. We only have a certain number of patrol officers out on any given shift, and that is the reality. And as with everything we do as a council, we play the hand we're dealt. We can aspire to have more officers, but we also deal with the reality on the ground that the workshop that was organized'",
        "'speaker_0': 'by Vice Mayor Knox played in Councilmember O.D. and noticed is a public meeting so others could attend. And I did. It was very impressive. We had our city engineer, Scott Wickstrom in, and Dana Emery, our traffic engineer, Miss Wheeler presented and the police officers.'",
        "'speaker_0': 'Oh, I'm just going blank on his name. Tall. Yes, there are many of them tall. Their his grandiosity. And it was such an informed decision, good audience participation. I think one of the maybe last public forums we had that the police were definitely on top of this, but they could also use the help with the good design'",
        "'speaker_0': 'to be able to to help keep people safe. But but but we are seeing how cars are speeding with these wide open thoroughfares that are they're finding right now. So so we do need to protect our the safety of all and and the accessibility of our streets to all.'",
        "'speaker_0': 'And I am looking forward to opening Alameda up again for business. It'll be gradual. As the governor said last week in his press conference, the new normal will be anything but. And so to our Planning and Transportation Department, I want you to be thinking about maybe some new ways that you haven't even contemplated yet, because, A, we'",
        "'speaker_0': 'don't know exactly what things are going to look like. But the governor certainly told us that, you know, restaurants, for instance, they're going to be removing tables because they'll need to do some physical distance. It's not just a matter of flipping a light switch and we go back to the way we were.'",
        "'speaker_0': 'It's going to be a gradual process. So think about, you know, new ways of of maybe dealing with all that. But I do hope that one of the things that will come out is always the silver lining and the fact that we've been sheltering in place, but getting out for some exercise.'",
        "'speaker_0': 'And I'm seeing lots of walking and I hope people will keep that up. It's a great habit. It's a healthy habit. You know, discover your city. Don't just walk down the same streets, try, try different ones. And I think that will also impact and benefit our business districts.'",
        "'speaker_0': 'And I will say that Webster City I mean, I do go to Webster Street and have coffee and shop and whatnot. Usually I'm on my bike, but when I sometimes I'm in my car, I always find parking at the municipal lot.'",
        "'speaker_0': 'I will say quickly that I know during the farmer's market days that's that's used as a farm, as part of the farmer's market. But I always find parking maybe not in front of the business that I'm going to, but down a side street, it's healthy to walk a little away from your car.'",
        "'speaker_0': 'And I know for people who are disabled and need to park right there, we've got those spots, too. And let's see really quickly, I wanted to ask two quick questions. One of Mr. Wikstrm, which is about the so-called big buttons.'",
        "'speaker_0': 'I thought I saw an email, I think, from you that said, the reason we can't just go and flip a switch in and be done with them has to do with some of the the equipment we're dealing with.'",
        "'speaker_0': 'Is that is that accurate? Mr. Wickstrom.'",
        "'speaker_1': 'That is correct. I think it's been brought before the council when Dani presented in February that we have a very old system. If you look at our aggregate, 87 intersections with a variety of controllers and not all of them are easily programable to just quickly remove where buttons are being attached.'",
        "'speaker_1': 'So we have to look at intersection by intersection. Another consideration that we also keep in mind is some of those intersections are programed for what's called audible pedestrian signals. The status and accessibility component for someone blind that we also want to keep those active.'",
        "'speaker_1': 'So they hear here there's some signage, things that could be done to improve that so that people know they don't have to do that. We are we're looking into really trying to catalog our entire system and then trying to attack it systematically.'",
        "'speaker_0': 'Okay. Thank you for that. And by the way, for anybody out there wanting to cross the street, don't touch it with your hands. Use your elbow. That will activate it. And and then last question is for you, Mr. Thomas, on the Central Avenue Project.'",
        "'speaker_0': 'I was under the impression that we were still waiting on Caltrans. But remind us, where are we on the Central Avenue project?'",
        "'speaker_1': 'Thank you for asking. We just met about it today. We will be we are refining the design with our consultants. We hope to be back to the council with those final design refinements, including the final design for the portion that goes by Webster Street Transportation Commission and May Council in June.'",
        "'speaker_1': 'That will then set us up for the final step with Caltrans. That then puts us in the construction drawings. If things go very well and we can go sort of everything goes as, you know, full speed. We would hope to start construction next calendar year, 2021.'",
        "'speaker_1': 'But it's a it's a big it's a big step. I mean, it's just a big, complicated, expensive project. The money for the public, just to the public as we have the money ready for us to spend on the construction.'",
        "'speaker_1': 'So it's just about getting through the design process with Caltrans, we hope in the near term to start construction on the Clement bicycle and pedestrian safety improvements from Grand to Broadway for the Cross Army Trail. That project is ahead of Clement.'",
        "'speaker_1': 'And then the project that is we're hoping to that's even ahead of that will be the bicycle pedestrian improvements for Otis. So the council has set up a whole series of of actual, you know, projects to improve bicycle and pedestrian safety.'",
        "'speaker_1': 'Central is just the biggest, most complicated of the three that we're working on right now. And just as an example, all three of those have had extensive public process. So just to reassure the business community, if we're doing anything in your business district, you will be seeing a lot of us before we start changing any on street'",
        "'speaker_1': 'parking. So that's I hope that is.'",
        "'speaker_0': 'What it is. Yes, it does. Mr. De Soto, you have 12 seconds. What would you like to tell us?'",
        "'speaker_1': 'Weekly Vice Mayor Knox White called my views on the three E's and traffic safety as old school. Actually, it's not. All you need to do is Google three E's in traffic safety. And I, in fact, came out with a I found a study put.'",
        "'speaker_0': 'Out by.'",
        "'speaker_1': 'Time.'",
        "'speaker_0': 'Next year, your time is up. Well, thank you. And thank you for your take you all for your comments. And and this is this is a good, lively discussion. I appreciate it. Okay. With that, what we are being asked to do is to vote in a resolution.'",
        "'speaker_0': 'Vice Mayor. And I thought you had your hand up.'",
        "'speaker_1': 'I'd like to make a motion.'",
        "'speaker_0': 'My right. What's that motion?'",
        "'speaker_1': 'I'd like to move approval of the staff recommendation. With apologies for my lack of clarity to Councilmember De Saag, I meant the his views on the.'",
        "'speaker_0': 'Unemployed of.'",
        "'speaker_1': 'Engineering. I just wanted to apologize.'",
        "'speaker_0': 'And you can take that off line through the motions.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'We always strive, by the way, not to be personal. I'm sure it was meant with this. No, we're okay. Okay, great. Okay. We're okay. And so what was that modification with.'",
        "'speaker_1': 'The modification of the bullet separated, changing as discussed when feasible to unless not feasible where the under the separated bicycle lanes to shall be provided bullet tried it.'",
        "'speaker_0': 'Okay, we have that motion. Do we have a segment? Okay, we have 2 seconds. That's a force. So our I think it's thought councilmember village hand at first that at the thank you there'll be more opportunities. Okay. Could we have that roll call vote please.'",
        "'speaker_0': 'Councilmember de Cut.'",
        "'speaker_1': 'Three. Not one? No.'",
        "'speaker_0': 'Not slate.'",
        "'speaker_1': 'I with an e0di with enthusiasm. Oh, good. That was good.'",
        "'speaker_0': 'Fellow. I may or as the Ashcroft that's I with for it that's already. That carries I five eyes. All right, well, now I want to take care of your math to find out why you might not want to do as.'",
        "'speaker_0': 'I was getting too excited, too easy. All right. Okay. So that is that takes care of item six. A item six be has been continued to. Our next meeting on May 10th. Let me pull my counsel really quickly.'",
        "'speaker_0': 'People, do you want to take a quick break now? Do you want to do another? What do we have? We've got four more. Do we have four more items? Yes. Yes. Everybody. Vice Mayor.'",
        "'speaker_1': 'I was saying five more items.'",
        "'speaker_0': 'Okay. Five more items. Thank you. And has them restaurants. Yeah. No, it's for. It's for. Yeah.'",
        "'speaker_1': 'I didn't remember from my pile. Apologies.'",
        "'speaker_0': 'Okay. So to have a break or not to have a break. Is that? Keep moving, Mr. Eddie.'",
        "'speaker_1': 'Yes. I'm sorry. Go ahead. I'd prefer to take of if we could.'",
        "'speaker_0': 'Yeah. Okay. He's hungry. Hi. Sorry I'm not serving food tonight, but there's good takeout support. Alameda business is okay. So much for that commercial. Okay, our next item, Madam Cook. Introduction of ordinance amending the Municipal Code Chapter 30 Development Regulations to modify Accessory Dwelling Unit Regulations to implement and comply with State Law and make other administrative, technical'"
    ],
    "Ordinance Amendment on Accessory Dwelling Unit Regulations and Other Planning Issues.": [
        "'speaker_0': 'and clarifying amendments pertaining to appeals and youth center definition as recommended by the Planning Board. Thank you. And who is that? You, Mr. De? This is L.A..'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Hi. Yes, I can hear you and see you. Good evening.'",
        "'speaker_1': 'Great. Nice to see you all. Good evening, Madam Mayor, Vice Mayor and members of the City Council. This is Valentine City Planner with.'",
        "'speaker_0': 'The Planning.'",
        "'speaker_1': 'Building and Transportation Department. So this is an ordinance to amend Chapter 30 of the municipal code, otherwise known as the zoning ordinance, specifically the amendments pertaining to accessory dwelling units or more commonly known by its acronym. And the purpose of the amendments is to bring Alameda and new regulations into compliance with the new state laws.'",
        "'speaker_1': 'Eddie is referring to backyard cottages for those who aren't familiar and granted units or second units that California law allows by rights when associated with a primary show unit. These units are accessory to the main house, and state law prohibits cities from applying any sort of density rules to use or otherwise try to limit the number of'",
        "'speaker_1': 'abuse in their city.'",
        "'speaker_0': 'In 2019, the state.'",
        "'speaker_1': 'Passed a number of new laws that standardize many requirements for any use in California. These laws are in effect as of January 1st of 2020. The new requirements mainly pertain to zoning standards such as height limit, minimum unit size, building setbacks.'",
        "'speaker_1': 'The laws also allow 80 use now on multifamily lots, as well as making way for greener, more efficient use. Overall staff. Definitely the changes in the law make it easier and more economical for Alameda residents to build, and new staff has already begun implementing the new requirements as mandated under state law.'",
        "'speaker_1': 'The Planning Board held a public hearing on February 10th and recalled City Council approved the ordinance. The ordinance also includes two very minor cleanup.'",
        "'speaker_0': 'Amendments related to appeals in.'",
        "'speaker_1': 'The definition of use centers. These cleanup amendments are administrative in nature, as described in the staff report, so I won't go into detail unless the council has specific questions tonight. Staff is recommending that you approve this ordinance, but with a slight modification, which is to omit.'",
        "'speaker_0': 'A.'",
        "'speaker_1': 'New provision identified as subsection J on page ten of the ordinance published on the agenda tonight. And just for me to explain, this provision allows you to be sold separately from the main dwelling by a nonprofit to a low income buyer.'",
        "'speaker_1': 'This is not a mandate by the state. And on the surface, sounds like a good idea. But after consulting with the city attorney, we believe this matter raises some larger policy questions that warrant further study. So we ask the council to omit subsection K on page ten if there's a motion to approve this ordinance tonight.'",
        "'speaker_1': 'That was my staff report, and I am here for question. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Tiny. And then, quick. Do we have any speakers on this one? We do not have any public comment on this one. Public comment. And so any clarifying questions of Mr. Ty, Mr. Otis. Councilmember Odie.'",
        "'speaker_1': 'Thank you, Madam Chair. Just briefly. I mean, do we I remember when we first tweeted a couple of years back, there was a fear that there'd be a mad rush of ideas. If you know, can you tell us how many we've had in the last couple of years?'",
        "'speaker_1': 'If not, it's fine. Right. We actually do have we have been tracking very closely. We since 2017, which is the last update to the ordinance, we have seen 30 to 80 use construct in Alameda. So meaning the definition of pass inspections, about half of those are really in basements that are basement conversion, very hidden and the remaining'",
        "'speaker_1': 'half are backyard cottages, conversion of existing garages. And the average size has really been under 600 square feet. I think comedians are taking advantage of opportunities to create units for extended family or rental opportunities with the least cost.'",
        "'speaker_1': 'Thanks. 32 total, not 32 per year, right? 32 total since 2017. And the city has approved 120 applications to date. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. That was all your question. Yeah, thank you. Yeah. Let me know when you're done. Okay. Any other clarifying questions? Council. Okay. Well, then council comments. I I'm going to actually lead with comments because this is a topic near and dear to my heart.'",
        "'speaker_0': 'This year I am the co-chair of the League of California Cities Statewide Policy Committee on Housing, Community and Economic Development. My colleague, Councilmember Vella, sits on the committee and we have worked very hard over these last couple of years to promote more building, especially of housing that is affordable, whether designated affordable or affordable by design because of'",
        "'speaker_0': 'its smaller size, and also to work to remove some of the roadblocks that were in place in some cities that made it difficult to do something that shouldn't be so terribly complicated. And so what I can say is that the housing crisis in our state is not going away, not because of the COVID 19 pandemic or any'",
        "'speaker_0': 'other reason. And in fact, it has really highlighted for those of us elected officials who are being given mandates by our governor and by our county public health officers to go into encampments and get people out of them, because it's just a place where the virus can grow and flourish.'",
        "'speaker_0': 'And we're scrambling to find hotel rooms. The governor's working with Motel six in the South Bay to do that. And at the end of the day, we need more housing. People should not live unsheltered. They should not be sleeping under our overpasses or in the bushes.'",
        "'speaker_0': 'And I mean, it's a complicated a complicated topic, but we need to to pick the low hanging fruit. And ideas are certainly one of them. And I also want to just note that until last year, I was a member of the Casa Compact CASA Combat Practice, a suite of very aggressive housing protection bills.'",
        "'speaker_0': 'And so I was one of the committee that oversaw the recommendations to the legislature. And I want to say it was maybe a planner from San Mateo County had brought to us a really nice booklet like a how to that San Mateo County does either San Mateo County or the city of San Mateo.'",
        "'speaker_0': 'I think it's the county. But anyway, so if you came to the counter and said, hey, I think and I want to do an ad for you in my back yard, you would get this or that. You can probably download it from the website and it's it's a how to and it makes it simple and easy.'",
        "'speaker_0': 'Do we have anything similar to that or anything in the works? Mr. Tanner. Mr. Thomas, whoever wants to answer. By the way, I'll just note for the record, when I'm writing my notes and I'm identifying who spoke. I just put your initials.'",
        "'speaker_0': 'But when I've got Alan Tie and Andrew Thomas, I'm going to have to write someone's name out. But it's okay. Which of my eighties would like to go this year? Yes, thank you. That helps.'",
        "'speaker_1': 'I will go to that one. Mm, yes. I think one of our next steps is really to focus on developing collateral material and doing some outreach. So, you know, some of the ideas that we've had might even include working with the building department and building inspectors to do maybe a community workshop or something that would be very'",
        "'speaker_1': 'informative, that would let residents understand the entire process from the initial application to some to think about the construction. So we've seen other cities successfully do that, and that's something that we would certainly love to model.'",
        "'speaker_0': 'Oh, that sounds great to me. Did you want to add anything, Mr. Thomas? Yeah, this is good. Okay. Yeah. Great idea. I'm all for that. Okay. That's all for me. Who else wants to speak or make a motion or what have you?'",
        "'speaker_0': 'As I said earlier. That's right. And then you. Councilmember de. Sure.'",
        "'speaker_1': 'I'd love to move approval of this. I will say really quickly that I did listen to the planning board discussion on this, as is very frequently the case. They had a fantastic discussion about it as some really good, tough, clarifying questions, and I think it was very well vetted.'",
        "'speaker_1': 'I really appreciate. And it's always a testament to the work of Mr. Ty on this issue, how well this comes forward. I really am very grateful at that. So I'm very happy to. Tim, if approval.'",
        "'speaker_0': 'All right. Well, thank you for the comments. And we've got a motion and we have a second councilmember. Dave, thank you. Had your hand out.'",
        "'speaker_1': 'Yes, thank you. Just quickly, I appreciate the modification that had been raised with regard to I think it was item J of the item. But for me, the larger concern is still there. And I think you you all your staff especially know where I'll be coming from.'",
        "'speaker_1': 'This is a larger concern about Measure a Chapter 26 of our city charter Part three. I'm I'm not sure how the ACTU really is aligned with with our city charter chapters 26 item three. It might be and might not be, I don't know.'",
        "'speaker_1': 'I mean, maybe it is state law, as some might say, you know, trumps everything. But so for tonight, I, you know, I'll need just to look at this a little bit further. So tonight I'll just I'll just abstain on this and then I'll come to a decision next time we have the ordinance.'",
        "'speaker_0': 'Thank you, Mr. David. So I don't want to leave the audience with any mis interpretations or misimpressions. So if someone want to step in and talk about it can be one of the lawyers or Mr. Thomas, you'd be in a good position to sit here.'",
        "'speaker_1': 'Yeah, let me just just for the audience and giving this and we certainly respect member Dave Dog's position and need to think through our interpretation or interpretation of you know, state law. You know we are our ability as a city to pass local rules and regulations and laws is confined by the limits imposed upon us by the'",
        "'speaker_1': 'state of California. As a member of the state of California, as a city within the state, we we have our laws must comply with state laws. And the state has been, at least from the stats perspective and our interpretation of state law, and this is supported by our communications with the State Department of Housing Human Development, which'",
        "'speaker_1': 'we, we communicate with them on a regular basis. In fact, they they pointed to our ordinance selling this to too modest. He didn't tell you about that our how the state has requested to use our new ordinance and amendment as a model for other cities.'",
        "'speaker_1': 'But there are there are conflicts between the city charter and and and new state law around housing and and abuse. Absolutely. I think the voters, you know, state law and the laws around second units that we have today in California are not the same that we had in 1972 when the measure was passed in 1991.'",
        "'speaker_1': 'It was then further added to in our charter. So it's not the first time we've run into these conflicts with the charter around these these kinds of housing issues. In this case, it's pretty clear to us, with the exception of that section J, which which Alan mentioned, the state law is very clear for all cities that you'",
        "'speaker_1': ', the accessory dwelling unit, cannot be considered when considering whether you're violating the the density limit imposed on a particular piece of property. So essentially, under state law, a second unit doesn't count towards the density. And I think that's the provision that Councilmember de Song was referring to the one unit per 2000 square feet of land with density'",
        "'speaker_1': 'standard in our charter. Under state law, you cannot treat accessory dwelling unit as a as an additional unit. It's accessory to the main unit. I'll just leave it at that. But that's just for the public, just sort of how that plays out.'",
        "'speaker_0': 'Thank you. And I will also note that the governor, certainly before he became consumed with leading our effort to fight COVID 19 and doing a spectacular job in our in our state, he had had said that housing is his priority.'",
        "'speaker_0': 'He is very well aware of the crisis, the housing crisis we have in this in this state and has even taken a city or two to court over some of their housing laws. So I want to make that clear, too.'",
        "'speaker_0': 'And then if I could just go back to the makers of our motion, both Mayor and Council Member Odie, you were making the motion with the request about S.J. Inc, correct?'",
        "'speaker_1': 'Yes. I'm sorry. I should have been more explicit in my.'",
        "'speaker_0': 'ED just to make sure. Okay, perfect. And then, Councilmember, do you had your hand up?'",
        "'speaker_1': 'Well of because I agree with everything you said except for the part where you serve on the committee, because I don't. But everything else I agreed with committee as a you can take a video of that minute because it seems every couple of months you have to repeat yourself on that.'",
        "'speaker_0': 'And also, I just want to extend my congratulations to Mr. Ty for. I had heard that about the the ordinance being used as a as a model. And that's and we're very proud of you. So congratulations on that.'",
        "'speaker_0': 'And so right back to you. So anybody else want to comment or should we vote? But. Okay. Let's take a vote then. Councilor Vella, that's not. I think we should vote. Do you think we should vote? I agree.'",
        "'speaker_0': 'All right. Now I'm quick with your roll call. Vote, please. Councilmember de SAG.'",
        "'speaker_1': 'Exiting.'",
        "'speaker_0': 'Next site.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Odie.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Bella. I may as the enthusiastic I that carries by four eyes one abstention. Thank you. So, item six. Thanks, everybody. Staff who was on this one? Item six has been withdrawn and we move to item six e introduction of ordinance authorizing the city manager or designee to execute a 12 month amendment to the lease with Pacific Pinball'"
    ],
    "Lease Amendment with Pacific Pinball Museum for Building 169 at Alameda Point.": [
        "'speaker_0': 'Museum. 501 C3 Nonprofit organization with the option of for one year extensions for Building 169 Suite 121 located at 1680 Viking Street at Alameda Point. And the thing is that. Mr. Levitt, you're presenting it. Who's presenting. And then that's here and go.'",
        "'speaker_1': 'Oh, man, America. Yeah, I can rise to a point of order.'",
        "'speaker_0': 'Mr. Daystar gave an lecture.'",
        "'speaker_1': 'On a similar issue to this. I had recused myself because of the proximity of the pinball Wizard of Pinball.'",
        "'speaker_0': 'There's a song that goes with that.'",
        "'speaker_1': 'Near my house, so I'm going to it. So I'm going to entertain once again and reduce recuse myself once again.'",
        "'speaker_0': 'So. So you do understand that this address is.'",
        "'speaker_1': 'Yes, it's the one on Alameda point. Yes. But they have their main offices right near my places. I think there could be still some economic issues there. And similarly, there's a similar subject issue where I did recuse myself and I think I was it was okay to do that.'",
        "'speaker_0': 'So I can't I can't force you to stay. So. Okay. So you're recusing.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Thank you. Okay, let's give him a minute to exit. And then there's Mr. McConnell. Hello? Oh, hi. Oh, excuse me. No. We can't see you. All right. I think.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Can see you and hear you. Okay, perfect. So what do you name of the council members on the net mechanism, the Community Development Department? What you have in front of you now is essentially a renewal of an existing tenant and that lease has expired.'",
        "'speaker_0': 'So it's actually released, but for all intents and purposes, it doesn't.'",
        "'speaker_1': 'Work.'",
        "'speaker_0': 'At that location. So in a one year term, with the ability.'",
        "'speaker_1': 'Of the city.'",
        "'speaker_0': 'Manager to maintain for well up to four additional.'",
        "'speaker_1': 'Years as special session on time.'",
        "'speaker_0': 'So. With the candidates specific in their facility, serves as a warehouse and staging gallery and a workshop for supporting their museum art gallery. Network 66 Amendments extends the.'",
        "'speaker_1': 'Term.'",
        "'speaker_0': 'For 12 months, and I hope that you will consider minimally and return our date. And I hope that you'll consider renewing. Thank you. And do we have any public comment on this item? No public comment on this item.'",
        "'speaker_0': 'All right. Staff of Staff Council. Does anyone have a clarifying question as Ms.. Marcano? We have discussed this in closed session, and now we come to the public for our open vote. Okay. Well, no discussion and no questions.'",
        "'speaker_0': 'Any discussion or should we have a motion?'",
        "'speaker_1': 'A move approval.'",
        "'speaker_0': 'Of a motion by Mr. Ody to approve. And a second by. I'll second my second by Vice Mayor Knox. Why? Any discussion? Hearing none. Roll call. Vote, please. They say Knox might.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Ody.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Avella. I mean, there is the Ashcroft high that carries by four eyes one option. All right. Councilmember De Sorkin returning to his spot. All right. Thank you. Thank you. All right, then we move on to item six F introduction of ordinance amending the outdated missile code by amending Section two Dash 19 Commission on Disability to change the'",
        "'speaker_0': 'number of 97 inches the Commission name to the Commission on Persons with Disabilities. Thank you. And we have our public information officer, Sara Henry, who has been a very busy individual during this COVID 19 crisis and who had this is actually like connecting to her audio, though.'"
    ],
    "Direction to the City Attorney on Conflict of Interest Waiver Request by Goldfarb Lipman.": [
        "'speaker_0': 'Whitman's request to waive conflicts of interest in connection with his legal representation of the City of Alameda and the housing authority of the City of Alameda. And is that you, Mr. Roush, or it.'",
        "'speaker_1': 'Is, Madam Chair.'",
        "'speaker_0': 'Great. Take it away. Thank you.'",
        "'speaker_1': 'Marin Counsel Michael Roush on behalf of the City Attorney's Office in Alameda. This is an item where our office is requesting a direction from the city council as to whether or not to waive a conflict of interest between the.'",
        "'speaker_1': 'GOLDMAN I'm sorry. GOLDFARB The law firm and the city and the city of Alameda. It just comes up rarely. But it happened here because that firm happens to represent the housing authority on a number of different issues, including some discussions we are going to have with the housing authority about an amendment to the Housing Services Agreement, but'",
        "'speaker_1': 'they also represent the Housing Authority and some other matters as well from time to time. And in addition, the firm also represents or has contracted with the city to provide legal advice and assistance with respect to a number of housing projects that the city is involved in.'",
        "'speaker_1': 'So because under the professional rules of responsibility, there is the actual conflict between what the firm might provide to the housing authority on the housing authority matters and the advice that they would be providing to the city. On what I call the transactional matters, we're requesting the Council to consider whether to grant a waiver of conflict as'",
        "'speaker_1': 'a practical matter. Different attorneys are involved on the housing authority side versus the city side, and the firm has certainly has agreed to and will set up an ethical wall so that there isn't any conflict. There's no inter relationship or interface between the attorneys providing assistance on the city side and the attorneys providing assistance on the housing'",
        "'speaker_1': 'authority side. So the matters before you and we'll be glad to answer any questions regarding this matter.'",
        "'speaker_0': 'Thank you, Mr. Roush. And do we have any public comment on this item? There are no public comments on this. Okay. So, Counselor, any clarifying questions? No clarifying question. Any discussion, Mr. Modi?'",
        "'speaker_1': 'Oh, thank you, sir. I had one. So is there a similar waiver signed by the Housing Authority? The goal from the answer is yes. There would be a conflict both ways. I mean, a conflict way or both ways.'",
        "'speaker_0': 'And and this is Debbie Porter. And I just like Debbie say that this ties in sort of high housing authority board of commissioners last Wednesday approved the their way their approval of the.'",
        "'speaker_1': 'Conflict.'",
        "'speaker_0': 'Waiver. So the board of commissioners has already taken action on this item. Thank you. Okay. That's good to know. Mr. Eddie, back to you.'",
        "'speaker_1': 'All right, Doctor. Thank you.'",
        "'speaker_0': 'That's it. Okay. And if I might note, I believe we've lost John. Oh, we've lost John. That's. You're right. Texted me or anything, so I'm not sure what happened. Okay. Let me text him really quickly. Oh, he's coming back.'",
        "'speaker_0': 'He's back. He's coming back. He's on his way back. There he is. Okay. Okay. Welcome back, Mr. Knox. Can you hear us?'",
        "'speaker_1': 'I can. I lost the audio, so I will and we will continue.'",
        "'speaker_0': 'All right. So did you hear Mr. Roche's discussion? No. That you've read this staff report?'",
        "'speaker_1': 'I have, yes.'",
        "'speaker_0': 'Do you have any questions and clarifying questions? Any comments?'",
        "'speaker_1': 'I do not.'",
        "'speaker_0': 'So Mr. Potter is joining us and she let us know that last week the Housing Authority Board voted to waive the contract from their side and. Okay. So any other questions, comments, or do I have a motion? Someone raise your hand and we can proceed.'",
        "'speaker_0': 'Did you decide?'",
        "'speaker_1': 'Yes. I'd like to move. Staff recommendation.'",
        "'speaker_0': 'All right. We have a motion to have a second. That's guys getting heavy. Is anyone going to second this?'",
        "'speaker_1': 'I will second it for discussion. And like I'd like to I quite honestly, after reading the staff report, was hoping to hear from my more legally minded council member colleagues about pros and cons of this a little bit.'",
        "'speaker_0': 'You wanted to hear from me, legal advice from your colleagues rather than the city attorney? I just wanted to hear from other council members.'",
        "'speaker_1': 'Yeah. To hear from other.'",
        "'speaker_0': 'As I can hear you and of L.A.. Yeah. Okay. Um, I. I've discussed this with the city attorney's office, and I am satisfied with the procedures put in place. So, Councilor Verity, did you want to add anything further?'",
        "'speaker_1': 'Pneumonia.'",
        "'speaker_0': 'Huh? Either of you. Councilmember Vela. So I get the article while I understand that there can be different attorneys involved. I'm just wary. There's a number of different law firms that are available that we work with and that are available to help on various issues.'",
        "'speaker_0': 'And because of the types of issues that we're going to be in talks with the housing authority on, I think, you know, I'm not comfortable with this waiver at this time. Well, this isn't to say that I think that anyone involved would be asking acting unethically, but I am concerned about providing a waiver.'",
        "'speaker_0': 'And if there is an issue in the talks that we're having coming up, just the fact that the same firm is involved. I think there's a number of other firms that we have on retainer and that we can work with.'",
        "'speaker_0': 'And I would hope that we can.'",
        "'speaker_1': 'Work with one of those.'",
        "'speaker_0': 'Instead. Thank you. Do Mr. Roush or Mr. even want to address? Do you think Mr. San want to? I don't know if we still have Mr. Sand with us, but Mr. Ash, do you want to.'",
        "'speaker_1': 'Just address that? So, Madam Chair, it's even said. I just want to tell you that I'm still on. I'm just not on audio.'",
        "'speaker_0': 'You're not on video.'",
        "'speaker_1': 'And I hope I get clarification. I'm sorry I'm not on video. Is that council member that was just just.'",
        "'speaker_0': 'Mr.. Sorry date time. I'm sorry. I, I completely sympathize. And then maybe your voice.'",
        "'speaker_1': 'Yeah, right. We're going to hire Devin as our outside counsel for that. But I just want to make sure I heard Councilmember Avella correctly, which is that Councilmember Valley's preference is that the city engage different counsel. It was asked was that the gist of the comment?'",
        "'speaker_0': 'Yeah. That's basically I'm not comfortable with the waiver just because I would hope that with with all of the parties involved, just the appearance of it. I think with the discussions that we're going to be undertaking, I would hope that we could engage different attorneys rather than attorneys from the same firm.'",
        "'speaker_1': 'I do want to let the counsel know that if the counsel does decline the waiver, what is more likely to happen is that the housing authority would engage different counsel, and that's probably practically what likely would happen. But we don't.'",
        "'speaker_0': 'Know about you. And why is that? Mr.. Mr.. SPENCER Whoa.'",
        "'speaker_1': 'Whoa, whoa. Because at this moment, Goldfarb is providing very, very limited services to the city. On the other hand, their services are ongoing with the city. They have advised Alameda Point for many years, and so their knowledge is fairly valuable.'",
        "'speaker_1': 'On the other hand, we don't have immediate need for Goldfarb to do any specific work right away. On the other hand, I think the housing authority needs. Housing Authority needs. GOLDFARB to sort of be engaged right away. So I think decline of the conflict we have at this moment will probably result in Goldfarb being hired and not'",
        "'speaker_1': 'being hired by the Housing Authority. I'm, of course, just speculating. I don't know what exactly they would do, but that's my understanding. I'm going to limit myself, and I apologize.'",
        "'speaker_0': 'For that so that I don't apologize for that. That's great. Okay. So that was that was helpful to know. And just really, I think you had had your hand up, correct?'",
        "'speaker_1': 'Oh, thank you, Madam Mayor. It was nice to get to see little, little children at our meetings or at least hear them. So I.'",
        "'speaker_0': 'Appreciate that.'",
        "'speaker_1': 'Yeah, I'm kind of a I'm not ready to support this now. That doesn't mean I couldn't in the future, but I know that the city manager is working on a response to a referral that's probably taking a lower priority now.'",
        "'speaker_1': 'And, you know, I'm just not I'm not quite comfortable with it. So I'm going to abstain on this one and vote no. But I'm not ready to vote yes. Yes.'",
        "'speaker_0': 'Um, let me and Mr. Levitt, please.'",
        "'speaker_1': 'And Debbie Debbie Potter might want to comment on this, but one of the reasons it's coming to you at this point is because those meetings that Councilmember Odie is referring to of what we're trying to move forward with and do I don't know if you call mediation, but trying to work through a series of meetings with ourselves'",
        "'speaker_1': ', the Housing Authority and Feeds and the Renters Coalition with with all of those parties. One of the reasons that this is coming to you is because the housing authority, at least in one meeting, what to say, maybe not in that particular set of meetings, but another meeting had one of their attorneys there.'",
        "'speaker_1': 'And so that's part of what I think brought this to the urgency. And so that's what they held up, not necessarily just the mediation process, but some other things that we're working with the housing authority on that maybe Debbie Debbie could expand on this because I'm not sure what would occur under a normal circumstance.'",
        "'speaker_1': 'I. I could see the hesitancy and in doing a waving, I'm doing this action. But in this because this is their main attorney, it does create a little bit more of a dilemma for us.'",
        "'speaker_0': 'Okay. Sounds like it.'",
        "'speaker_1': 'I'll let you go ahead.'",
        "'speaker_0': 'Okay. Okay. Thank you, Eric. Thank you. Yeah. Just to clarify a few items. Goldfarb is the general counsel for the Housing Authority. So Goldfarb, the attorney who serves as general counsel, is different, obviously, than the Goldfarb attorney who works with the city.'",
        "'speaker_0': 'So the housing authority has an ongoing day to day relationship with Goldfarb as their general counsel. We are currently taking off negotiations on the rent increase, not the rent increase, the rent program and the contract with the Housing Authority, which will be coming to council in June for the new three year contract of what staff will be'",
        "'speaker_0': 'bringing to council for its consideration. We are also bringing an amendment to the Staffing Services Agreement that we have with the Housing Authority, where we anticipate recommending to the City Council that we bring the CDBG and home programs back into the city to be administered by city staff.'",
        "'speaker_0': 'And those two agreements are really what brought this conflict waiver request forward to the council, because the housing authority would like to engage its firm on this work. We would be using our in-house attorney, Michael Ralph. He's working with me on both of those housing services agreements.'",
        "'speaker_0': 'And however, our work with Karen Peterman of Goldfarb is.'",
        "'speaker_1': 'Integral.'",
        "'speaker_0': 'To the work we do at that site. As Michael Walsh noted, all the transactional work we have done at site A has been done with the support of Karen Tiedemann as outside counsel. So clearly we had staff strongly value our relationship with Goldfarb, and we do also recognize that Goldfarb served a different attorney, served as general counsel'",
        "'speaker_0': 'for the housing authority. And from that perspective, we would like to maintain those relationships and feel that some firewalls and some of the other things that have been proposed may be adequate to ensure those.'",
        "'speaker_1': 'Relationships go.'",
        "'speaker_0': 'The way they need to be done for the ethics that the attorneys have to abide by. So that's more of a context of how we work with Goldfarb and how the housing authority works with Goldfarb, and how we will be working with the Housing Authority over the next several months on some some agreements.'",
        "'speaker_1': 'Between the city and the Housing.'",
        "'speaker_0': 'Authority. Thank you, Mr. Potter. So I'm going to ask if either of my colleagues, Councilmember Avella or Councilmember Ody, give you a minute, Mr. Northway, who expressed that they weren't ready to support this at this time. If there were a time when you might be ready to consider a waiver, if I was understanding your remarks correctly, what'",
        "'speaker_0': 'would it take to do so? Because what I'm hearing is this might delay the process, but maybe it's worth the delay that that councilmember I think you're probably giving it some thought any any any suggestions. And you can also take a pass.'",
        "'speaker_0': 'I don't mean to put you on the spot, but. You've got to get an analytical mind. Yeah. I guess my concern is just because of the types of conversations that we're going to be engaged in, I just don't want there to be any.'",
        "'speaker_0': 'Yeah. And I understand we would be having.'",
        "'speaker_1': 'Our our.'",
        "'speaker_0': 'In-House attorney, Michael Roush, representing us. I just I'm wary of kind of giving having a waiver at all, putting a question or, you know, any sort of cloud of uncertainty around the talks or whether or not something could be worked out.'",
        "'speaker_0': 'I just want everything to be done in a in, you know, in a way that that seems.'",
        "'speaker_1': 'Above.'",
        "'speaker_0': 'Board. And I understand the relationship with with both the housing authority and with the city. And it probably is because at one point the housing authority and the city were also one entity, you know. And so I could just.'",
        "'speaker_0': 'And we lost Mr.. Not quite again but but I'm so there I mean are there any criteria if you were to lay down. I don't I Goldfarb is a fairly large firm, I believe. And and are these attorneys both working out of the same office or physical form?'",
        "'speaker_0': 'Has to go far, has more than one office, I'm reasonably sure. Do we know that they're both here out of the Oakland. Yeah. They would both be out of they're both out of the same office in Oakland. Okay.'",
        "'speaker_0': 'Okay. So I mean, if you at some point or maybe I misunderstood you, but were there criteria that there should be no communication? I mean, professionally speaking, that would mean that would be the case if you were two attorneys working on opposite sides of a case.'",
        "'speaker_0': 'Um, I, you know, I'd never practice in a big firm. My husband does. And, and, you know, conflicts come up, and sometimes they get waived and sometimes they don't. But. Okay, and I know both. Mr. Knox. Vice Mayor, have we lost you?'",
        "'speaker_0': 'Well, when. When we get the Vice-Chair back, I will call on him. Then this. Jody, I think you had your hand up as well, did you?'",
        "'speaker_1': 'Yeah, sure. But I can wait till our colleague returns.'",
        "'speaker_0': 'Well, since you had your hand up and you're here.'",
        "'speaker_1': 'All right, let's try to answer your question. I think when what I think could be potentially delicate negotiations over some of these take backs and all of these issues that the city manager is working on, I think when those get resolved and I thought I heard there was some other, you know, I don't know, links, big issues'",
        "'speaker_1': 'with the, you know, service agreement and, you know, different policy decisions the council was made that the housing authority disagreed with. So I just like to make sure all those get ironed out before. Before I'd be willing to entertain this.'",
        "'speaker_1': 'So, I mean, it's not a no forever, but it's not a yes right now.'",
        "'speaker_0': 'Okay. But it seems that that's a no to having the housing authority use this attorney while they're trying to iron out these issues. Is that correct?'",
        "'speaker_1': 'That's my concern.'",
        "'speaker_0': 'All right. So what what would that time what would that look like? I mean, I guess Miss Potter or Mr. Levitt, you'd need to go back to the housing authority and see how long they think it will take them to engage new attorneys, for those attorneys to be brought up to speed on this.'",
        "'speaker_0': 'And so we could just push whatever the item is out as far as long as it takes.'",
        "'speaker_1': 'I would be one. Oh, Mr..'",
        "'speaker_0': 'Levitt. Mr. LEVITT Yes.'",
        "'speaker_1': 'I would probably want to defer initially to Michael Roche or even to see what their thoughts are, because this is the first time I've probably experienced where we had an occasion where I work or had an attorney that was the same firm that was the main representative for another entity we were negotiating with.'",
        "'speaker_0': 'Okay. And I think either Devin or even Shan would like to speak.'",
        "'speaker_1': 'For Madam Chair. So my understanding is that if the counsel does not grant the waiver or is not inclined to grant the waiver at the moment, the housing authority, I believe, would engage special counsel for this particular set of negotiations without having to disengage their general counsel generally on all matters.'",
        "'speaker_1': 'So they probably would engage special counsel from a different law firm just for these sets of negotiations, much like the city attorney's office might, for a matter that require special expertize.'",
        "'speaker_0': 'Yeah. No, I assume. Believe. Hold that. Well, do they you think they have another firm on tap that they'll just turn to and that that firm will be brought up to speed readily on the on these issues? Or maybe we don't ask.'",
        "'speaker_1': 'That's a hard that's a that's a hard question to answer. I, I can't imagine that this would be that complicated to be brought up to speed on because these are these are fairly routine contract negotiations. You know, I think if it were me, I think I'd probably be able to be brought up to speed reasonably quickly.'",
        "'speaker_1': 'But it's obviously would take a little more, you know, a little bit of time to be brought up.'",
        "'speaker_0': 'That you're exceptional. Look at the multitasking you're doing right now. All right.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'Go ahead. I I do think Devin wants to speak to us, though, so don't don't stifle that. Tell us. Did did you, Mr. Ten, did you finish your remarks? Mr. Ash has his hand up.'",
        "'speaker_1': 'I did okay. Yes. Thanks, Major. Yeah. The only issue and maybe that we can speak to it better than I can is the timing issue with respect to the two agreements that we have with the housing authority and whether there is anything particularly time sensitive about the the staffing agreement on the matter.'",
        "'speaker_1': 'I know that is scheduled to come back from the council in June, but I'm not sure as much about the other agreement, which I think has the more difficult issues to resolve. So maybe Debbie can speak to the timing on both of those because she's a little more on top of that than I am.'",
        "'speaker_0': 'Okay. Thank you, Mr. Potter. Yes. Thank you. So both of us, we're anticipating bringing both the new contract for the rent program in June, as well as the amended Staffing Services Agreement. And I do agree with the city attorney that they should be relatively straightforward documents and agreements.'",
        "'speaker_0': 'And I would hope that if the waiver is not granted, the housing authority would be able to retain special counsel quickly and we could continue on. That would be the hope. And Mr.. You mentioned that the Housing Authority Board met last week.'",
        "'speaker_0': 'When are they going to meet again, if you know. They need monthly. So they need but the second one, I believe it's the second Wednesday of the month. So they would meet and then in May next month they would have a meeting.'",
        "'speaker_0': 'Okay. And that should give enough time to prepare the staff report and all those things. To get it to June. Yeah. Oh, the contacts and whatnot. Yes, I would I would anticipate that we would work with them and they they have been flexible in the past.'",
        "'speaker_0': 'If a special meeting is warranted or needed, they have been able to accommodate that in the past. Okay. All right. Okay. So I'm a little concerned that we've lost a vice mayor. Is anybody in communication? And I haven't heard back from him.'",
        "'speaker_0': 'I'm sorry. I he said he would turn his video off if he was having bandwidth issues, but then I asked if his audio is still working. And maybe. Oh. Do you know what? He's texted me that he had to go to address an urgent work issue.'",
        "'speaker_0': 'And it will come back if he can. So that. Yeah. Sorry. Something just blew up at work. Not literally. That was a figure of speech to.'",
        "'speaker_1': 'Come back and go to Sarah.'",
        "'speaker_0': 'Oh, we could do that. He may not be back before the end of the meeting, but is it? Well, let's see. We don't have the full council. We do have a majority. I don't think you know Mr. not quite indicated.'",
        "'speaker_0': 'Seem to be hesitating. I don't want to speak for him but I didn't think he was supportive and well one of the city attorneys wanted to suggest what we should what we should do. And this one.'",
        "'speaker_1': 'This is this is Mr. Roush. What I would suggest is that why don't we just continue this item for the moment, see if we have Mr. Henry on the line and we can take up the Hunter issue or that agenda item, and then let's see where we are with respect to the conflict issue, if that would please'",
        "'speaker_1': 'the Council.'",
        "'speaker_0': 'Sure. And given the fact that I don't think you were going to get a waiver out of this counsel at all. I mean, what would be the harm of just. We're trying the issue or do we need a determination?'",
        "'speaker_1': 'Well, I guess I wasn't quite sure where the vice mayor was on it, and I'm not sure I heard from Councilmember de Saag either. So I'm not sure where the where the most might be. Maybe I misheard.'",
        "'speaker_0': 'I think he indicated his his agreement. But that's okay. We can do that. Let's just let's continue this either until we finish the items that we skipped. Item six S And then if the Vice Mayor is able to rejoin us when we finish that item and the rest of the agenda, we'll hear it.'",
        "'speaker_0': 'If not, we'll have to continue it. Okay. All right. So right now, we're we're going to adjourn this meeting. Not this meeting agenda item or just ask to be set aside. We're taking the next round. Okay, next item.'",
        "'speaker_1': 'Meeting's for you.'"
    ],
    "Ordinance to Change the Name and Number of Members of the Commission on Disability.": [
        "'speaker_0': 'So we're going back to the previous item, which was six F introduction of ordinance, amending the municipal code by amending Section 2019 Commission on Disabilities to change the number of members to seven and change the name to the Commission on Persons with Disabilities.'",
        "'speaker_0': 'And it does look like Sarah is still having connection issues. Oh, no.'",
        "'speaker_1': 'She.'",
        "'speaker_0': 'She's got her family.'",
        "'speaker_1': 'Yes, she does have her idea.'",
        "'speaker_0': 'And that is why I forgot. I just had a mention for you. I have to turn in my volume every time you speak. It's very soft and of other people and your teeth. So I don't know what it is.'",
        "'speaker_0': 'Pardon me. That's a first. I'm always loud. Try speaking louder. Okay. All right. So, okay, then. And we've got an attendee here to present the staff report for item six F. Okay. Dating counsel, can you hear me? I can.'",
        "'speaker_0': 'We can. I can. Terrific. Okay. Right here. My. My computer audio is spinning out of control, but I'm on my phone, and I'm glad it works. Good evening, counsel. My name is Sarah Henry. I'm your public information officer, and this item is being brought back to you.'",
        "'speaker_1': 'Following a.'",
        "'speaker_0': 'Referral from the mayor and the vice mayor by 2019, directing staff to return to council with an item reducing the number of members on the Commission on Disability from nine. The staff is recommending that we reduce the number of members to seven consistent with other boards and commissions.'",
        "'speaker_0': 'In the last year, three seats were vacated and there are currently six members on the commission. So the commission is very eager to recruit another member when the time is right. We also recommend changing the name of the Commission from the Commission on Disability, which is what it is right now to the Commission on Persons with Disabilities'",
        "'speaker_0': '. And so that's why I'm here to answer any questions that you have. Okay. Any. And Ms.. Vestager, do we have any public comment on this item? No public comment. Okay. Counsel, any clarifying questions? Discussion.'",
        "'speaker_1': 'Motion rules approval of the item.'",
        "'speaker_0': 'Okay. And counts over days. Like where there's two fingers your second. Okay. I'm getting good at this. And I would just say I want to give credit to my friend and neighboring mayor, Libby Schaaf. We were talking about something and she mentioned something that her Commission on Persons with Disabilities was doing.'",
        "'speaker_0': 'And I heard that and I thought, I like that. It's so much more respectful than commission. I mean, we never meant to be disrespectful. I don't mean that to be taken the wrong way, but if we really are concerned about persons with disabilities and they have, you know, helped inform many things that we're doing in this city'",
        "'speaker_0': 'so well. So I appreciate folding that into this item. Okay. So it's been moved by Councilmember O'Shea, seconded by Councilmember Desai. Any further discussion? Hearing none. Roll call. Vote, please. Councilmember de SAG.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Odie.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Vela. Yes. Mayor, as the ash guy. Yes. That carries by four eyes with their next white. Absent. Absent. All right. And so with that, and my granicus is crashing, but I'll bring it back. I can do this one without my iPad.'",
        "'speaker_0': 'Our next item is number seven. That's the city manager communication. And this is another very busy person, Mr. Leavitt. So what have you got to tell us?'"
    ]
}