{
    "Short Term Agreement with East Bay Municipal Utility District for Potable Water Services at Alameda Point.": [
        "'speaker_3': 'Okay, so I pulled this one and I gave this Smith from public works very short notice that I was doing this. I'm sorry, but it's. So this one, just for the public is falling. Following along is a recommendation to authorize the city manager to execute a short term agreement with the East Bay Municipal Utility District, our water'",
        "'speaker_3': 'provider to provide services for the city of Alameda potable water system at Alameda Point. The language in this is a very brief staff report. There's a language that caught my eye. Was that talking about in the first paragraph of the background paragraph on page one that we are looking at a short term agreement for East Bay Med'",
        "'speaker_3': 'to continue services up to six months while the city and has been met to continue negotiating in terms of an agreement that addresses the phasing of new incremental development in the adaptive reuse area of Alameda Point. That's where our Alameda Point collaborative and historic Alameda Point areas are.'",
        "'speaker_3': 'And this was the language that I wanted to ask about and explore the possibility of the city transitioning from East Bay Med to an outside contractor for operations and maintenance services of existing water infrastructure, if possible, and if authorized by the State Water Board.'",
        "'speaker_3': 'Resources Control Board Division of Drinking Water City Staff is conducting due diligence on multiple fronts on the water quality and public safety implications of changing from East Bay Med to a private contractor and is not currently recommending this approach.'",
        "'speaker_3': 'And I think given that, you know, nothing operates in a vacuum and we follow the news from around the Bay Area, around the country, and we've all heard of Flint, Michigan, and the horrendous situation there. So my first question is, why would we even be considering looking at someone besides our water utility to provide this these services'",
        "'speaker_3': 'operations and maintenance of existing water? And this is apparently drinking water, potable water. And also, who else does this? Are there are there private contractors in and what was the impetus for for this consideration?'",
        "'speaker_2': 'Thank you both. Really good questions. So we are actively doing our due diligence to better understand what it would look like to have an operator that's not used. Payment is East Bay, mud is the potable water provider for the area.'",
        "'speaker_2': 'They typically aren't in the business of providing this operation and maintenance services for a system that's not their own. So they have been providing the service for us since late 1990s through this JPA. The JPA expired in this short term agreement and.'",
        "'speaker_3': 'The JPA would be a.'",
        "'speaker_1': 'Joint sorry, ours with the.'",
        "'speaker_2': 'Waters Agreement. This short term agreement essentially extends the services that was in that Joint Powers Agreement for six months. So we can better understand from a legal, regulatory and technical front what that would mean to have an operator that's not East Bay mud.'",
        "'speaker_2': 'So we don't have the answers that you are seeking now. But this six months should allow us the time to better understand that we're also working with an outside specialist, a special counsel, to assist us in understanding what it would mean.'",
        "'speaker_3': 'So was the primary consideration for looking at other possible providers. The fact that he's been made doesn't normally do service and maintenance on facilities that aren't their own correct.'",
        "'speaker_2': 'And we're also in parallel to us doing our due diligence for a possible alternative operator. We are in discussions about what the new development would look like in that reuse area, meaning the replacement of the old, the Navy water infrastructure with East Bay mud.'",
        "'speaker_2': 'So as we have more clarity on that, the operational piece might be able to piece into that as well. So a lot of moving parts at this point, but hopefully the six months will allow us to get the clarity we need.'",
        "'speaker_3': 'Right. And so then we will expect to report back to the council. Absolutely. Okay. Great answers, as always. Thank you, Ms.. Smith.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Any other.'",
        "'speaker_1': 'Question?'",
        "'speaker_0': 'Questions then and thank you.'",
        "'speaker_3': 'Thank you. So then. Thank you. I will move it. A move approval then of this recommendation to authorize the city manager to execute a short term agreement with the East Bay Municipal Utility District to provide services for the city of alameda potable water system in alameda point.'",
        "'speaker_0': 'We have a second. All those in favor of my motion carries unanimously. Thank you. So now we move on to regular agenda item six.'",
        "'speaker_2': 'Hey, introduction of ordinance approving a First Amendment to a lease and authorizing the city.'",
        "'speaker_1': 'Manager to execute.'",
        "'speaker_3': 'Documents necessary to implement the terms of the First.'",
        "'speaker_2': 'Amendment to the lease agreement with Advanced Roofing Services. The California Corporation for Building 612.'",
        "'speaker_1': 'Located at 1450.'",
        "'speaker_2': 'Viking Street at Alameda Point.'"
    ],
    "Bird-Safe Buildings Ordinance.": [
        "'speaker_0': 'Yeah, go ahead. So. Who wants to present.'",
        "'speaker_2': 'So I think that I think that a number of us have met with, as well as our city planner, has met with the Golden Gate, Audubon Society. They've done a lot of work here in Alameda, and specifically with our leashed terns and other bird sanctuaries in Alameda and have done a great job working towards conservation and wildlife'",
        "'speaker_2': 'care standards in other cities, including San Francisco and Richmond. And they have put forward just basic language that would help advise potential developers, people building anything here in Alameda, different practices that could make their buildings bird safe. And I've I've also spoken with a number of other individuals who are architects, planners and developers.'",
        "'speaker_2': 'And a lot of these things end up coming up later in the process, in particular during the sequel process and other things. And so this would just codify it and put them on alert earlier on to some of the best practices and basic things that they can do to make their buildings bird safe.'",
        "'speaker_0': 'All right, so then. Well, here. Question member matter.'",
        "'speaker_4': 'So we're not giving people ideas. The purpose of this referral is to establish an ordinance that people have to follow, make buildings burn safe. Correct. Thank you.'",
        "'speaker_0': 'All right. Speakers. Marjorie Powell. Then. DeCarlo Annie. Patricia McCann and. Cindy Margolis. And then they are a fat, skinny. Go ahead. All right.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Mayor Spencer, members of the council.'",
        "'speaker_6': 'My name is Marjorie Powell.'",
        "'speaker_0': 'I've been a resident of Alameda.'",
        "'speaker_6': 'Now for just over.'",
        "'speaker_3': 'Three years. We selected.'",
        "'speaker_0': 'Alameda out of the Bay.'",
        "'speaker_6': 'Area because of its.'",
        "'speaker_3': 'Wildlife friendly reputation.'",
        "'speaker_6': 'And because, frankly, I was familiar.'",
        "'speaker_3': 'With the LC.'",
        "'speaker_0': 'Romer Bird Sanctuary.'",
        "'speaker_3': 'Which is now.'",
        "'speaker_6': 'Across the street from where we live. Across the street from it, I guess I should say. I'm also a member of the Golden Gate, Audubon.'",
        "'speaker_3': 'Society and the.'",
        "'speaker_6': 'The Friends of the Alameda.'",
        "'speaker_3': 'Wildlife Reserve, which.'",
        "'speaker_6': 'Focuses on the least tern colony up at.'",
        "'speaker_0': 'Alameda Point. But I want to.'",
        "'speaker_6': 'Urge the Council to adopt an ordinance that in that requires.'",
        "'speaker_3': 'Planners to make their buildings bird safe.'",
        "'speaker_6': 'There are several reasons for this. First. If it is.'",
        "'speaker_3': 'An ordinance, then planners.'",
        "'speaker_6': 'Know ahead of time what they have have to comply with. And a number of planners have told.'",
        "'speaker_3': 'Golden Gate Audubon, as you will hear later in.'",
        "'speaker_6': 'Our testimony, that knowing ahead of.'",
        "'speaker_3': 'Time this is in fact.'",
        "'speaker_6': 'Not expensive, it there are many options that will make the building easier to heat and to cool.'",
        "'speaker_3': 'So it eventually.'",
        "'speaker_6': 'Saves money in the long run. But it's also important to note that there are three potential factors that would be involved in making buildings bird safe. Depending on the height of the building and the nature of the design of the structure.'",
        "'speaker_6': 'One is what you do with windows. Birds don't see glass, so they will fly into windows. That's important both for tall glass buildings, but also for lower buildings that have large glass. Because many areas in Alameda have nesting, breeding birds, and they're the ones who will crash into the building's windows that are lower down because they're moving'",
        "'speaker_6': 'quickly, particularly the smaller birds. So windows are one concern. Lighting is another concern. The lighting shouldn't be directed where it's not needed, particularly on to water, but also landscaping. If the building is a large building designed with an interior courtyard, you don't want windows that are going to.'",
        "'speaker_3': 'Be attracting birds.'",
        "'speaker_6': 'To fly into a landscaped interior courtyard. Speakers coming behind me will highlight many of these issues. But I did want to say that we think this is very important. It's not particularly difficult for architects to including in planning if they know ahead of time what they need to do.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Linda. First, I want to thank you so much for spending 2/1 for.'",
        "'speaker_6': 'Staying so you could hear our request. We are really.'",
        "'speaker_0': 'Appreciative. So I'm Linda Colonia, a village in Alameda, about six years. I'm a member.'",
        "'speaker_6': 'Of the board of the Golden.'",
        "'speaker_0': 'Gate Audubon, and I'm the co-chair of the Friends of the Alameda Wildlife Reserve.'",
        "'speaker_6': 'And I just want to urge.'",
        "'speaker_0': 'You to adopt this referral to establish. Building standards to protect our birds. So glass in our built environment is a significant.'",
        "'speaker_6': 'Hazard to birds. 300 million birds are killed in building collisions.'",
        "'speaker_0': 'Each year in the United States.'",
        "'speaker_6': 'More birds.'",
        "'speaker_0': 'Are killed by collisions with buildings than.'",
        "'speaker_6': 'Any other single source other than free.'",
        "'speaker_0': 'Roaming cats. And Alameda is really a critical place for birds. We're right on the Pacific Flyway. We have these incredible.'",
        "'speaker_6': 'Shorebirds.'",
        "'speaker_0': 'And we have all.'",
        "'speaker_6': 'Kinds of birds that nest here. So it's really important for Alameda.'",
        "'speaker_0': 'And Alameda has a history.'",
        "'speaker_6': 'Of making.'",
        "'speaker_0': 'Environment and wildlife protection a priority from kind of creating the LC from sanctuary.'",
        "'speaker_6': 'To.'",
        "'speaker_0': 'Zoning, the wildlife reserve up on Alameda Point. So we think this is really the next step. As Marjorie said, it's competitive so long as you do it at the beginning.'",
        "'speaker_6': 'Both San Francisco and Oakland did this several years.'",
        "'speaker_0': 'Ago and Richmond just did.'",
        "'speaker_6': 'It.'",
        "'speaker_0': 'In November of last year. So we think it's time for Alameda to do this, too. Thank you for your time and I hope you'll adopt the referral. Thank you.'",
        "'speaker_6': 'I guess.'",
        "'speaker_2': 'Good morning. City council members. I'm Patricia again, and I also am a member of Golden.'",
        "'speaker_0': 'Gate Autobahn.'",
        "'speaker_1': 'And the friends of.'",
        "'speaker_6': 'The Alameda Wildlife Refuge Reserve. And I also.'",
        "'speaker_2': 'Just strongly endorse.'",
        "'speaker_6': 'This bird building.'",
        "'speaker_2': 'Anti bird safe building ordinance.'",
        "'speaker_6': 'This would establish Alameda as credentials.'",
        "'speaker_3': 'As a bird friendly.'",
        "'speaker_6': 'City and could encourage nearby communities.'",
        "'speaker_2': 'To do the.'",
        "'speaker_6': 'Same. Please move forward. And while I am here, I am also supporting the city, exploring taking title to the uncompleted strip of Shoreline Park, which also would be good.'",
        "'speaker_0': 'With.'",
        "'speaker_3': 'An agenda.'",
        "'speaker_0': 'Okay. Thank you. These lips. I just noticed these lips we should actually had, like on hers. That has agenda item nine and nine city. Okay. And then Cindy's has nine A and nine. See also. And then the one's nine.'",
        "'speaker_2': 'Yeah. We combine nine B's.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Well, we'll make another one.'",
        "'speaker_0': 'Okay. There's two of them. All right.'",
        "'speaker_6': 'Hey. Thank you all for hanging late. I really appreciate it. And so do all of us. The reason this is so urgent is because there are so many development plans in Alameda. And so it's very important that we get ahead of the development cycle so that we don't add additional costs to the developers who want to develop'",
        "'speaker_6': 'in an environmentally responsible way. In Alameda. As some of the speakers have told you, the wildlife cohort in Alameda is incredibly special. It's actually very special relative to all the other Bay Area. So we have more than 200 species which live just at the refuge alone, just in that little section of Alameda have been seen.'",
        "'speaker_6': 'So if you take the whole island and the cross-section of all the different varieties across the island, there's a lot of different birds. That includes endangered species, threatened species, species of special concern. These are birds you really don't want to lose.'",
        "'speaker_6': 'And we've used birds as a harbinger of the environment for all Alameda schoolchildren. So we've had a program for years where we're going into the schools and educating the kids about the birds. And they get so excited thinking that they're special birds in their own community.'",
        "'speaker_6': 'And it helps them identify with the community and with the nature that's around them. As this other speaker said, it's the second leading cause of bird mortality, and it's totally preventable with a smart ordinance. I am going to encourage that.'",
        "'speaker_6': 'The city of Alameda take a leadership role nationally on this topic, and it's actually not very difficult. So three other Bay Area cities within our catchment of Golden Gate Audubon have adopted these as well as some in the South Bay.'",
        "'speaker_6': 'But what you are able to do based on the science which was provided, which is in the referral packet from Cal Academy, that study establish that the standards for bird safe windows should be a little bit smaller in terms of single plate design.'",
        "'speaker_6': 'So you can have multiple plates, but each individual plate of a certain size should be mitigated in some way. It doesn't mean you can't use glass, it just means the glass has to be mitigated properly. If you do that, Alameda is able to take a national prominent role on this, which is a very important statement for a'",
        "'speaker_6': 'city that holds the most important protective colony of an endangered species in the nation. And the American Bird Conservancy has assured me that they will step up with Alameda and declare how important what you've done is. So I am going to ask that the planner take that additional step of the leadership position because of the bird life'",
        "'speaker_6': 'that is so special in the city, adopting the bird safe building would govern all new construction. And as we're looking at increased density of housing, one of the things that's going to make Alameda so special is our shoreline and our access to public space and birds become a way to connect people to those spaces.'",
        "'speaker_6': 'And what you don't want to do is build a bunch of buildings that are going to have dead birds outside their windows. So this solves a lot of problems for the city. It reconnects the city with its island heritage, with the wildlife around us, and with the beautiful shoreline that we enjoy as an island city.'",
        "'speaker_6': 'In addition, there were priority around dark-sky and lighting is another important factor. That's part of the bird safe constellation, if you will, part in the face of issues that were talked about. So there's buildings, there's lighting, and there's also the relationship of the landscape to the building as those things relate to each other.'",
        "'speaker_6': 'And this would solve that in the way that other cities have solved that. No up lighting, no downloading, no water lighting, but lighting for security. Thank you very much.'",
        "'speaker_0': 'Thank you. All right. So she's our last speaker on the nine A, if I'm reading this correctly, your. Now are there's nine be. I'm sorry on this form.'",
        "'speaker_6': 'Good morning. I am not going to speak much because.'",
        "'speaker_0': 'You are sorry for this already. I'm sorry. Before you continue. So she's speaking on nine. B is. But the slip says.'",
        "'speaker_7': 'We agree to continue.'",
        "'speaker_0': 'So I didn't know that. Or is that okay? Work is perfectly fine, right? Yeah. Okay, then. Go ahead. Thank you.'",
        "'speaker_6': 'I just wanted to say I'm. Especially excited to see Almeida potentially join the growing list of people that are concerned about bird safe buildings and cities that have adopted ordinances already. And I think it's especially fitting to have this decision made in April when we have Earth Day and we have a lot of friends birthday and a'",
        "'speaker_6': 'lot of a lot of attention toward. Our natural resources. And I'm here tonight just to say hello and hope you support us. Thank you.'",
        "'speaker_0': 'Thank you. And hello. So she's our last speaker on. So we have other speakers online. So then do you want to hear about them or an online? Okay, Pat Lambrew, I'm 90 also. So if anyone was here on nine A or nine be.'",
        "'speaker_0': 'I did already call you.'",
        "'speaker_6': 'I wasn't sure. So we combined nine B, 99 D, I think we've probably said enough. Then I was going to just mention how important landscaping and trees are in conversations with folks who live right near a well-lit building.'",
        "'speaker_6': 'They have been in a long conversation to get ahead. There is some speaking up for the hedge. Thank you.'",
        "'speaker_0': 'Okay. Thank you. All right.'",
        "'speaker_7': 'So may I suggest may are you? You said there was a slight nuance difference. Maybe you can explain that. And then maybe we can dispose of this before.'",
        "'speaker_0': 'The night on 99. So I did a separate referral because I want to make sure I actually from reviewing the Golden Gate Audubon website, they have make the city safe for wildlife. And they have multiple things. They have the buildings standards for bird safe buildings, but then they also have tree care and bird safety tree care, and'",
        "'speaker_0': 'then they have lights as another thing. So the artificial light and referred speakers on all those. So I wanted to make sure we're looking at a comprehensive. Effort to protect our wildlife. So in addition to the word safe buildings and and I have previously done referrals for the artificial light and the trees.'",
        "'speaker_0': 'And I, you know, I I'm hopeful that we could. Look at the whole appetite for birds. And the other two, the artificial light and the trees were ranked as medium level on our priority thing. And I don't know where we're going to put this, but I would hope that we're providing a good habitat as well as looking'",
        "'speaker_0': ', you know, the trees, lighting and build building safety together, which is why I yeah. And I did my seven to make sure we're doing a comprehensive effort here.'",
        "'speaker_2': 'And I think the sample basic draft for the Alameda Bird Friendly Ordinance Framework, which is one of the attachments, includes things on the importance of landscaping and feature related standards as well, including atriums, greenhouses, things like that, as well as the lighting aspect I think.'",
        "'speaker_2': 'I hope that that addresses some of the concerns, I think. My hope is that this this gets folded in with some of the other elements that we're looking at and so that we get something that's comprehensive instead of something that's piecemeal.'",
        "'speaker_0': 'That's why I was bringing it to you as a comprehensive effort. I appreciate hearing that. Vice Chair.'",
        "'speaker_7': 'I mean, I would agree with the vice mayor that I think the the draft ordinance from Richmond accomplishes that. I mean, I would like to be able to have us celebrate that we're nationally recognized for this effort. So to the extent that there's extra things that are not in that Richmond ordinance, then I'd be in favor of'",
        "'speaker_7': 'that. But, you know, not to pontificate for too long because it is late. But, you know, we do care about our wildlife here. And, you know, we've done a lot of work. Councilmember Matt Arrestee. I mean, taking the lead on protecting the SEALs.'",
        "'speaker_7': 'Mm hmm. So, I mean, that that's really strong. And I, you know, just real quick, I remember I was out there on first sight over the weekend, and I remember getting distracted by just watching this bird play in the sand.'",
        "'speaker_7': 'And I was supposed to be paying attention to the property owners. But so I do think this is an important thing. And I know it's kind of a small thing, but, you know, all of our wildlife is important.'",
        "'speaker_7': 'So I think it's important we take this the step.'",
        "'speaker_0': 'So it sounds like I may have heard that. So if you're agreeable to combining them somehow so that we are looking at a comprehensive partnership, and that's just that's what I want, but I want to try to make sure we're doing that.'",
        "'speaker_3': 'Yeah. And I mean, we're going to look at where this fits in the priority that we established. And also it will go to our city planner right to to look at. And we you know, I want to know what all the considerations are.'",
        "'speaker_3': 'And I have met with a lot of these ladies out here, the advocates. But we need to find out from a practical matter, what will that mean in terms of. You know what? More financial pressure on developers. We've had a little experience lately about how, you know, the changing landscape, but oftentimes you can meet a lot of'",
        "'speaker_3': 'criteria. But yeah, well, yeah, that's something that our planning department.'",
        "'speaker_0': 'Can take a look at. That's. Oh, yeah.'",
        "'speaker_2': 'So do you want to set a priority on where this fits in?'",
        "'speaker_4': 'And may I suggest that it's a medium just like the lighting ordinance.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'And I think it might.'",
        "'speaker_4': 'And I'm right. I move that we adopt a we give direction to a to consider a comprehensive. A bird friendly ordinance with protections for other wildlife as consideration is referred to. And I can be.'",
        "'speaker_7': 'I'll second.'",
        "'speaker_3': 'That. And and just by way of discussion, if we were looking at applicable criteria, I think that this is a referral dependent on other city projects or work efforts because I know we are there is an effort in planning to update a number of our codes.'",
        "'speaker_3': 'So oftentimes work product can be grouped together just saying sometimes it helps to look at applicable criteria. Thank you.'",
        "'speaker_4': 'The medium status.'",
        "'speaker_3': 'With medium.'",
        "'speaker_0': 'Priority. Yes, we have a second. Second. And so then I just want to clarify. So we're actually combining 99 versus. Yes, yes. All right. All those in favor. I motion carries unanimously and we've disposed of nine B now we can go to nine C.'",
        "'speaker_1': 'Consider directing staff to prepare for it.'",
        "'speaker_7': 'Thanks for waiting.'",
        "'speaker_1': 'On the city of Alameda acquiring.'",
        "'speaker_2': 'Taking title the uncompleted strip of Shoreline Park next to Harbor Bay.'",
        "'speaker_1': 'Parkway.'",
        "'speaker_0': 'All right. And I brought this referral. That's pulling up and we have one speaker on this and an and this is considered directing staff to prepare a report on the city of Alameda acquiring or taking title to the uncompleted strip of Shoreline Park next to the Harbor Bay Parkway.'",
        "'speaker_0': 'And some background is as the proposed hotel was being discussed at Bccdc, there was discussion of the strip and and it wasn't really clear it was being discussed as a benefit of building the hotel. But it really wasn't clear that this, in fact, is actually the city's as they are.'",
        "'speaker_0': 'This is something that the city could take possession of, is my understanding from the discussion. And so I brought the referral because I'd like us to consider taking possession of it just on our own and seeing what the if that's a possibility and the costs involved.'",
        "'speaker_0': 'And so that's why I brought this. Now we'll have our speaker, Pat Lamborn.'"
    ],
    "Report on City Acquisition of Shoreline Park Strip. ": [
        "'speaker_6': 'Thank you all so much. Thanks to the entire city council for staying and including this and the nine, A, B, and C, thank you to the city staff for staying so late. And thank you to my sisters from the Golden Gate, Audubon Society.'",
        "'speaker_6': 'So there were some visuals, maybe that we don't need. There was a map that might be helpful, basically. Right. This is to us to ask the staff to prepare a report on just two places geographically for you. You know, maybe you have the map in front of you.'",
        "'speaker_6': 'It's essentially 23, 50 Harbor Bay Parkway. It's a small piece of land. It's actually two parcels. Right. And on one side is Shoreline Park, small, you know, grassy park with the bathrooms. The other side is a concrete extension of that park shoreline part of the map.'",
        "'speaker_6': 'So I don't know if we can pull up the map item. I mean, I don't want to lengthen things. There's also a darling 10/2 video of a girl on a bike. So anything you want to do. But it is helpful to place it geographically.'",
        "'speaker_6': 'Parcel one personal one is 1.17 acres. It's zoned commercial for an office building or a restaurant. Right. That's clear. Parcel four is what we're talking about. It's a strip of land right in front of the bay. And I sent you all a memo, and I don't know if you remember reading it.'",
        "'speaker_6': 'I certainly wouldn't imagine that you would remember it at this moment at 130 on or whatever the heck time it is on on Wednesday. But I did write up the memo. I went through planning documents and went through B, C, C amendment agreements and amendments.'",
        "'speaker_6': 'And I did that precisely to ask that you when you directed staff to prepare the study, that you put a timeline and a deadline on it. We're in possession of these documents in. One of the things I cited is actually a public document.'",
        "'speaker_6': 'It was a letter from Dan Reidy of Harbor Bay Associates when they zoned parcel one to be commercial. He literally referred to this parcel four as parcel one is next to the strip of land reserved for the Shoreline Park.'",
        "'speaker_6': 'So I truly believe this parcel is dedicated land to our city. And if I wrote the memo, hopefully to hasten that study, I think it's in our hands. Our staff has written many of the B, C, D, C amendments.'",
        "'speaker_6': 'So I think we could set that. The other thing I wanted to say is I wanted to ask that you make this a high priority and why would I do that? You have all these priorities. This well, this is why I was going to put this more diplomatically to city council meetings ago at 11 at night.'",
        "'speaker_0': 'But it's too late.'",
        "'speaker_6': 'To be that diplomatic OC. Why should this be a priority? Parcel one is owned by Mina Patel. She is its own commercial. The last commercial development she brought to our planning board was for a five story building. Our planning board okayed that.'",
        "'speaker_6': 'She planted that building right on the property line of parcel four. Now, if that's a public park, I don't think we allow that. And the former city council approved that plan. So I think it's time to really clarify.'",
        "'speaker_6': 'This is Parkland. You know, Patel still owns the other parcel. Let's make it clear, it's adjacent to a public park, if that's what the study brings back. Thank you.'",
        "'speaker_0': 'Thank you, Cindy Margolis. She's our last speaker on this item.'",
        "'speaker_6': 'In case you're not sick of me yet. I am Cindy Margolis, the executive director of Golden Gate Audubon. And I strongly urge the city to take this under consideration. What Pat has just talked about, this is really important.'",
        "'speaker_6': 'You almost had a giant, ugly motel planted in the middle of one of almeida's gems of a shoreline park with a vista facing the bay. And in San Francisco. And it would have obstructed that entire shoreline. If you don't take proper possession of that land and claim that for the city, with all of the covenants that would'",
        "'speaker_6': 'govern how a park property would be treated, you, that could happen again. But for the grace of a decision by Bccdc, the city was spared that decision, and it shouldn't be up to Bccdc to make those decisions that should be up to our city.'",
        "'speaker_6': 'So I encourage you to do that. Thank you very much. And we appreciate your time tonight.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Um.'",
        "'speaker_0': 'Member matters.'",
        "'speaker_4': 'Do I think we should do it? I want to know. So I move the referral.'",
        "'speaker_3': 'And the utilities. The rest of us have made comments.'",
        "'speaker_0': 'What did you want to set a priority in your motion? I want to hear some rationale.'",
        "'speaker_3': 'For any specific. So I spoke to our city planner, Andrew Thomas, about this because I wanted more information. What he informed me is that this is actually this strip of Shoreline Park and the city attorney may have even more clarity on.'",
        "'speaker_3': 'It is something that the city would require the developer of the adjacent property to pay for developing as parkland and improving and maintaining. And so we have had some pretty lively discussions about our budget, our upcoming budget and the fact that it's not unlimited, that we'd like to do things with it and we need to do things'",
        "'speaker_3': 'with it. So I could not support the city taking on a responsibility that rightfully will belong to a developer. But I would love to hear the city attorney's amplification.'",
        "'speaker_6': 'If I may, just briefly and frankly, I didn't go back and look at all of my notes on this, but we have done some some preliminary research and all of the documents as well. And first of all, this that's why I want some clarity from you all what we're looking at, because this strip of land that has'",
        "'speaker_6': 'been mentioned is actually already to be dedicated to the city. So we have there is already a public access easement across it. So we have our public has free and unfettered use of this property. There are minor improvements on it.'",
        "'speaker_6': 'But the idea is that when a developer, as we've done throughout throughout this area, when a developer develops the adjacent property, we typically require that they do some additional improvements to this this strip of land, which is why we have not yet taken the property.'",
        "'speaker_6': 'We can take the property, we can accept the property. We all again, we have an easement already, but it has just as councils have determined that they wanted to wait until they had a developer who could add some improvements before we accepted the fee title.'",
        "'speaker_0': 'Never matter.'",
        "'speaker_4': 'I think one of the original format of this council referral was to direct staff to bring back a report on the request. And I, I appreciate the the explanation, but it's buried in the minutes. And it's also maybe it's not what you would do if you were writing a report.'",
        "'speaker_4': 'So I again, I would like to know. And the referral says direct staff to if you read the referral, it says direct staff. Find out what steps it would take to acquire this property and what considerations are. And we would get that in a report.'",
        "'speaker_4': 'And then we can decide what to do with it, that we're not deciding whether to take it tonight or not. We're seeing what the rules are around it, and we're saying that we're interested.'",
        "'speaker_6': 'So, Councilman Madras, my my point was and I'm sorry, maybe I was unclear because it's so late is I'm just trying to understand if you're interested in it.'",
        "'speaker_0': 'Only that strip.'",
        "'speaker_6': 'If you're looking in some at some broader piece of property. That's what I want to get clarification.'",
        "'speaker_0': 'That strip. Just the strip. Okay.'",
        "'speaker_2': 'And because you want cost estimates of a purchase, I mean, that's more.'",
        "'speaker_0': 'Well, I understand you can take title. All right. So I'd like the analysis of what the status is. All right. Vice Mayor?'",
        "'speaker_2': 'No, I think I think the the other thing that would be helpful is just what is the you know, if we take title, which it seems like we can as as right. We can take title what the costs would be to fix up the park or maintain it or both.'",
        "'speaker_2': 'And then also, you know, if if we lose the ability to get those improvements from somebody who develops the property later on.'",
        "'speaker_7': 'Yeah. I guess that's what I'm concerned about. Thank you. I guess that's what I'm concerned about, too. I mean, in my day job, every couple of months, the city of San Leandro wants to take title to East 14th Street, but they want Caltrans to improve it and make it pristine.'",
        "'speaker_7': 'So, I mean, the question to me is then, I mean, if we already have a right to take this title, I'd rather take title when it's developed and then we're not paying for it to be developed. Then take it now when it's raw and then we have to pay and foot the bill to to develop it.'",
        "'speaker_7': 'So, you know, that's my concern. I'd rather take something that we don't have to spend any money on. So.'",
        "'speaker_0': 'So I was hoping to be able to have staff give us the information of what the status is, what the you know, the questions that vice mayor raised and then have that discussion and then we would give direction.'",
        "'speaker_0': 'At this point, we wouldn't be making a decision on the merits.'",
        "'speaker_3': 'Is it? QUESTION Thank you. Is it is this issue even right? Because I thought that we've heard that the hotel owner is planning to make another application. I mean, I've heard it.'",
        "'speaker_0': 'That could be part of the information you provide. But this isn't supposed to be a discussion on the merits right now. This is actually just supposed to be that we would be directing staff.'",
        "'speaker_3': 'To decide whether whether we direct them to or not. And. Yeah. And what priority we would assign it.'",
        "'speaker_6': 'I know we are. We are. We are happy if three of you are directing us to do that, to come back with a report on what the current status is, that's not a problem. I just wanted to make sure that we were looking at the right amount of property.'",
        "'speaker_6': 'So it's only the strip. Okay.'",
        "'speaker_0': 'And it wasn't just the currency, as I like other questions.'",
        "'speaker_2': 'So if if there's if there is a new proposal that's submitted, perhaps we could roll this report in. Presentation that is made relative and that application.'",
        "'speaker_3': 'Rather than asking staff to spend.'",
        "'speaker_2': 'Staff if if. If. A new application.'",
        "'speaker_0': 'So my concern honestly was when I went back DC My recollection of the hotel and the presentation. Really suggested that this is not property, that the city has access to, that their gift to the community for their trade, their benefit to the community was this.'",
        "'speaker_0': 'And it wasn't really made clear that this is actually something the city already has a right to. And they weren't separating that right to this property and the additional benefits they were making it seem as though this whole strip was a gift to the city, which isn't true, which is why I think it's important that that's actually'",
        "'speaker_0': 'my in bringing this, because I think it's very important that if a developer is going to be supposed to be giving us a gift because it's for the public benefit, because they're within 100 feet of the water, that it actually be a real gift and not something that we already can take right frame to.'",
        "'speaker_0': 'So.'",
        "'speaker_2': 'So perhaps what we're also seeking is it appears as though there's our our city attorney's interpretation is different from the developer's interpretation. So I think it would be helpful to get guidance of that in either case.'",
        "'speaker_3': 'So such time as the project comes back now.'",
        "'speaker_0': 'So the priority I would agree that it be. So I don't want to wait until they this developer I if they end up doing an application of that, like you said, then then we can look at if it makes sense to include it then.'",
        "'speaker_0': 'But otherwise I would like us to resolve this issue. So that's very clear. That's very clear. So that we as a community know, is this our.'",
        "'speaker_2': 'Property, whatever the cost? I have a question for city. Do we have a timeline on how you have this information readily available that you would be basing your analysis off of in terms of whether or not we we actually could take it by.'",
        "'speaker_2': 'Right. Or.'",
        "'speaker_6': 'You know. Yes, we started doing we started pulling together the document so we could do it relatively quickly, at least to confirm to you what the city's rights are. If you want us to do additional analysis about us of potential improvements or things like that.'",
        "'speaker_6': 'We haven't begun that.'",
        "'speaker_0': 'Analysis. I mean, I'm sorry.'",
        "'speaker_7': 'But then my my concern then is, you know. The last in line now bumps the others. So, I mean, I, I don't know if this is any higher priority than any of the others that we've we've approved, especially given the fact that some of those have of lingered for months.'",
        "'speaker_7': 'So, I mean, I don't know which one I would push aside in order to do this one. Maybe my colleagues could suggest one. I don't know.'",
        "'speaker_3': 'Well, that council member matter. I made a motion. Why don't we see where that goes? That might.'",
        "'speaker_4': 'Well, I just want to make sure I will appreciate the motion. That includes the question the council member, Villa Vice Mayor Villa asked, and also it considers the question if we take title to it, does the A future developer still have to provide land to the improvement to it?'",
        "'speaker_0': 'Or could they.'",
        "'speaker_4': 'Or could we compel them to or could they provide that as a as a benefit, a public benefit? So that's emotion.'",
        "'speaker_0': 'That is there.'",
        "'speaker_2': 'Well, are we going to discuss where it goes priority in terms of priority?'",
        "'speaker_0': 'That's the second version.'",
        "'speaker_4': 'I'm going to suggest a priority if you go back to that. I don't think this is more important than homeless homelessness or social services or the other or the Amex development. Those are those are front line issues. And I think it's a medium.'",
        "'speaker_0': 'Miriam? Yes. Okay. So there's emotions there. Second. A second. But all those in favor. I.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'I suppose I can afford one motion carries. Thank you though. Was our motion to continue going through all these referrals or is it just the first three?'",
        "'speaker_2': 'So you did.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'A full agenda. Okay.'",
        "'speaker_7': 'The nine are that it. But before we did that.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'So you make your notes.'",
        "'speaker_0': 'Yes. I'm going to make a motion that we adjourn at this time and bring back these other referrals. It's 135 member matter. I see.'",
        "'speaker_4': 'Um, can I make a motion first to table the remaining?'",
        "'speaker_0': 'However you want a word that.'",
        "'speaker_4': 'I'd like to suggest and make a motion that we table. Um, what.'",
        "'speaker_0': 'Is to.'",
        "'speaker_4': 'Nine DNF?'",
        "'speaker_0': 'Okay. What does that mean then? When do we hear those?'",
        "'speaker_3': 'You know what? I'm actually I want it. And if it's a motion for reconsideration, definitely have to be someone who voted against it, considering that. No, the motion to adjourn because before you you all voted to hear all the agenda items and I voted no.'",
        "'speaker_0': 'How is the work as a. So as city attorney, I.'",
        "'speaker_6': 'I didn't. Okay. So you do need it does need somebody who would be changing their position, which could potentially change the result, who has to bring a motion for reconsideration.'",
        "'speaker_0': 'There was this a motion for reconsideration. And we're at 1:30 a.m. to adjourn at this point to table this points.'",
        "'speaker_4': 'I think the if I'm successful in getting a motion to table the remaining agenda items. Then we can adjourn without having to vote on.'",
        "'speaker_0': 'A motion for reconsideration, a motion to table.'",
        "'speaker_6': 'I think you could I think with the council member matter, he said is correct. If you vote to table, then there's you finished your agenda.'",
        "'speaker_0': 'So that was a motion motion to table.'",
        "'speaker_3': 'And I want a discussion, though, on this, because we have kept the housing authority executive director here all evening long and her item is next. And I actually think that we would do well to 90 here.'",
        "'speaker_0': '90. Okay. So you have a motion that very.'",
        "'speaker_3': 'Okay so if you want to.'",
        "'speaker_0': 'In and.'",
        "'speaker_3': '90 and then we table.'",
        "'speaker_4': 'The rest. I'm willing to do that. I withdraw my motion.'",
        "'speaker_0': 'To the motion to hear 90 and then table the rest the second.'",
        "'speaker_7': 'Second.'",
        "'speaker_0': 'All those in favor I any oppose. Okay, we'll do 90.'"
    ],
    "City Council's Role as Board of Commissioners for the Housing Authority.": [
        "'speaker_4': 'Okay. This was my referral. Um, the referral is to propose to return the City Council to its role as the Board of Commissioners for the City of Alameda Housing Authority. And my request is that a request that the city council direct the city manager and city attorney to present to the Council the steps necessary to reinstate the'",
        "'speaker_4': 'City Council as the Board of Commissioners for the Alameda Housing Authority with the responsibility for policy and approval of the HRA budget. What I would like people also, and I'm mindful of the threats that the federal government has made against sanctuary cities.'",
        "'speaker_4': 'And there's quite a bit of federal money that comes in the form of housing vouchers and housing subsidies. So I also like the the report to include an analysis of that and. I think I'm not insisting that we actually do it immediately, but I would like to have us consider taking the steps.'",
        "'speaker_4': 'The justification for this is we all know that there's a housing crisis here, and I believe that the best way to address affordable housing has been and will continue to be through the housing authority. It's more reliable and it's more has more certainty than the home market rate.'",
        "'speaker_4': 'Deliverance of affordable housing units. Alameda residents also expect the city council to do something about housing. They also have expected in the past when that council was the policy board to do something about when there were problems with the housing authority.'",
        "'speaker_4': 'And I've heard some complaints about from the residents of Constitution Plaza about the change in atmosphere and changing some of the rules there. That's a minor point. But those individuals expect to go to an elected body to seek to seek of a voice, to a sounding board and in a direct line to action.'",
        "'speaker_4': 'I also think personally that if I'm being held accountable for housing the city as a council member, I think we should have the authority and with our rec system, whether it stays or goes, all of all of the rental activity goes through the housing authority as well.'",
        "'speaker_4': 'And we're being the council is the expectation of people as council. Responsible. That's my justification.'",
        "'speaker_0': 'Hey, we have a speaker. Uh, I know it's the first, but unless. Or is it just one too?'",
        "'speaker_2': 'There's a.'",
        "'speaker_0': 'Okay. Vanessa Cooper.'",
        "'speaker_3': 'Sara, are you speaking with Officer?'",
        "'speaker_0': 'I have left if you want to speak on this.'",
        "'speaker_6': 'Well, actually, no, because I thought the room would be full and you wouldn't know I was here. I just wanted to make sure that I was here to answer any questions that you have. We are mindful that, you know, in December, we got a 5% cut on our Section eight program that approximates to about 82 families that'",
        "'speaker_6': 'we have to unhoused somehow by the end of the year. So we're really looking at that. We expect to do that through attrition, but we don't have budget authority until April 28th. And if the government shuts down or the president's bill for the budget passes, we can expect increasing changes to the Section eight program, which is really'",
        "'speaker_6': 'the bulk of the work we do. There's not a lot of policy making there, unfortunately. It's not driven policy. And so I'm here to answer any questions that you might have. We are concerned about sanctuary city. We are concerned about the just the sort of level of tension right now in terms of the federal and the state'",
        "'speaker_6': 'government. And my staff are fully occupied on getting people housed, keeping people housed. We are at almost zero vacancy every week. And so we're busy tackling the housing crisis.'",
        "'speaker_0': 'I remember Ashraf.'",
        "'speaker_3': 'I'm so. And Ms.. Cooper, we heard Councilmember Matt Arrestee refer to complaints. He's heard about Constitution Plaza, I think maybe Independence Plaza perhaps. Are you aware of what those complaints are?'",
        "'speaker_6': 'Right. So so when I first came to the housing authority, we looked at our policies, we looked at our lease, we brought in a new lease, which, frankly, was not that popular, actually, it had been designed by my predecessor and implemented under me.'",
        "'speaker_6': 'We have really moved through the housing crisis to try and maximize the use of our housing. And frankly, sometimes that has meant we've had to enforce the rules more clearly. So, for example, Independence Plaza, we have clearly enforced the rules about extra guests.'",
        "'speaker_6': 'There were multitudes of people leaving early in the morning who were not on our lease. Similarly, we have enforced payments so people were behind on their rent. And in order for for this type of housing to work, you have to get the rents in place.'",
        "'speaker_6': 'What I do realize is for some people, they don't like a more formal property management approach. But I will tell you, for those that have complaints, there are those that come up and say to me, thank you so much, you know, we want addressing such and such or this wasn't getting getting done.'",
        "'speaker_6': 'So the other thing to say is that the housing authority also has a much more formal complaint process now. So there's a site manager, the manager is available. There's someone on site seven days a week for people to talk to.'",
        "'speaker_6': 'Then there's a supervisor that's available. And then then we have a complaint form. We have a social worker who is available to every single resident, not just in a properties, but also in the private market in a section eight units that social worker and our translators will help them fill out the form if they can't do it'",
        "'speaker_6': 'and they will get a response back. We say ten days, but I will tell you, those responses go out in 2 to 3 days unless there's some kind of data inquiry. You know, sometimes and I think you've probably seen this yourselves where perhaps what you're getting from the tenant is not exactly what the data shows on the'",
        "'speaker_6': 'other side. So I'll be honest with you. You know, we're in the business of housing people. And when you house people, you have to address the rules. And there are some people who don't like the rules and there are some people who do.'",
        "'speaker_6': 'Those that get caught in perhaps stronger enforcement of the rules are more likely to be unhappy. What I will tell you is that the residents at Independence Plaza have had lots of new improvements. They have had us go through and sort out a lot of their parking issues, which has been a 20 year problem from what I'",
        "'speaker_6': 'can see in the documents. But not everyone is happy with that. And some people would like to have a softer touch in terms of that. But it's our job really to maximize the use of affordable housing in this market.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Anyone know the background in regards to why was it separated by was housing authorities?'",
        "'speaker_6': 'Well, yes. So there's a long history of coming together and coming apart. What I will say is that at least from the research that we've done, the work that was done in 2012 to separate was predominantly to put in place a fiscal and reputational firewall so that the assets that the housing authority has, which, for example, have'",
        "'speaker_6': 'large capital needs, would be dealt with by the housing authority and not impacted by the city. And similarly, you know, we're very much a retail business, and other than your permit center downstairs, you're not an amp, you're not really a retail business.'",
        "'speaker_6': 'So in terms of tackling those tenant issues, those types of things, this sort of reputational and financial firewall was put in place.'",
        "'speaker_0': 'All right.'",
        "'speaker_7': 'I mean, I'd like to hear more about this plan and this idea, mostly for the reasons that my colleague mentioned. You know, and I, I don't receive a lot of complaints, but, you know, I do. I have received one kind of continuing complaint.'",
        "'speaker_7': 'And if the complaint is with the person who said the resident manager, what would you call.'",
        "'speaker_6': 'Right. So so your complaint is with me actually, we've been been working on that, but they do pass them up very quickly. They are instructed as soon as they get those complaints, as long as they can be resolved right there, face to face, they come on right up.'",
        "'speaker_7': 'Now, her her issue is not with you. Her issue is with the person that runs the. The building so mean. But the point of that is that there's no accountability to an elected official like a council member matter, he said.'",
        "'speaker_7': 'So I'd like to hear more about this. And I also think that the rent thing, if we do do a contract with the Housing Authority, I mean, the buck stops here with us on all that rental stuff. And to not have a lot of these considering having some control over that when we're making the policy and we're'",
        "'speaker_7': 'dealing with the constituents, I really think it's important to have this discussion. So I think. Mr. Matter SC for bringing this forward.'",
        "'speaker_0': 'Member Ashcroft.'",
        "'speaker_3': 'Um, so I, I mean, it's true. As Council members, we hear from disgruntled constituents all the time. When I look at the housing authority, I try to figure out what what's broken that we would be fixing, what's the problem that we're trying to address.'",
        "'speaker_3': 'I mean, I think that, you know, as the city, we do have rental properties that at Alameda Point and we keep ourselves busy just making sure that's all administered well. But my biggest hesitation and why I won't support this council referral is we have the potential of placing these housing authority section eight funds in jeopardy.'",
        "'speaker_3': 'And I don't take that lightly, and I would not in any way want my name associated with taking that first step. I think this is a very dangerous time. And, you know, for all intents and purposes, people the next four years to be fooling around with something as essential as funding for needy people housing.'",
        "'speaker_3': 'So I think there are a myriad of ways to address problems that people have with their housing providers. And we should know as well as anyone that, you know, there's always many sides to an issue. So I just think this seems like an extreme remedy with a lot of dangerous repercussions.'",
        "'speaker_3': 'And I I'm kind of chicken when it comes to stuff like that.'",
        "'speaker_0': 'Last year.'",
        "'speaker_2': 'You know, I have concerns about the fiscal impacts of a decision like this. And I also would just say that I think that there are other checks because just like we have when we have a contract with any other provider of services, I think there are there are connections.'",
        "'speaker_2': 'Our staff is working with the Housing Authority staff, and I think we could maybe address some of the issues relative to the rent program in connection with the contract for services. And I would prefer to do it that way than to kind of take a bigger step right now when there are so many so much funds at'",
        "'speaker_2': 'Jeopardy. Based off of what's coming down the pipeline from the federal government.'",
        "'speaker_0': 'All right. And. So great. So at this point I'm hearing two to choose member two just said and I'm going to I wanted to ask Steph, could we have just some some more of a discussion rather than this?'",
        "'speaker_0': 'So this referral is speaks to looking at having the city return a housing authority to the city. But could we just have a presentation from the Housing Authority? Where we could talk about, you know, what about these complaints?'",
        "'speaker_0': 'How do they address it, things like that. And then at some point, we could reconsider if we decide based upon that, that we do want to look at more. But at this point, that's what I would suggest, is that we have a presentation by about the housing authority where we talk about things and answer these questions.'",
        "'speaker_0': 'But I would not be agreeable to supporting this referral. And my concern is that that's why I asked why did we set it up this way initially fiscal firewall. And I think that that could and I wasn't on the council when they did that 2012.'",
        "'speaker_0': 'And were Madras were you on you weren't on the council then either. Was there anyone here that was on the council in 2000? Okay.'",
        "'speaker_3': 'So elected at the end of 2012, I said, okay.'",
        "'speaker_0': 'So it was a fiscal firewall apparently. So I would think that that is an important reason to keep it separate for fiscal reasons. And then yes, member Ashcraft.'",
        "'speaker_3': 'I didn't mean to cut you off. I didn't mean to do that. Oh, well, what I was going to say is we have this council referral in front of us and we've just tabled a couple of others. I.'",
        "'speaker_3': 'I think that we, there's other ways we can. You know, find out more about what the housing authority is doing. But right now we have a council referral to present the steps for the City Council to return to its role as the Board of Commissioner for the City of Alameda Housing Authority, which would make the Housing Authority'",
        "'speaker_3': 'part of our sanctuary city resolution that we did. And that's what's before us. And that is what involves giving direction to staff and nothing beyond that. It's just not agenda.'",
        "'speaker_0': 'Okay, so, so.'",
        "'speaker_7': 'But modify.'",
        "'speaker_0': 'It. But we want to list that we'd like a report.'",
        "'speaker_7': 'On and just get a report.'",
        "'speaker_0': 'To review. All right. Very. Member matter as you. Would you consider modifying your referral? Well, then I.'",
        "'speaker_4': 'Don't think it would be a referral, I would think. You know, maybe concurrent with the next report on. The Rent Review Advisory Committee and the. Managing of of rental complaints and supervision that's being contracted by the housing authority could be expanded to include.'",
        "'speaker_4': 'The status of the of the housing authority projects. President.'",
        "'speaker_0': 'Okay. All right.'",
        "'speaker_3': 'Yeah, it was their privacy issue.'",
        "'speaker_6': 'I was just trying to ask if there's a privacy issue, because, like the Section eight folks have privacy. Yeah. Well, yeah, so so I. I'm not there's a federal privacy rule that is specific to section eight. So I can't come to you and say, Mrs. Smith and my unit, such and such, I can tell you is how'",
        "'speaker_6': 'many complaints you received, how they were resolved to a certain extent, except for the very smallest properties. I can't tell you. I could tell you, you know, there were five from Independence Plaza and three of them.'",
        "'speaker_4': 'Were getting worse.'",
        "'speaker_6': 'Yes. That that we could do.'",
        "'speaker_0': 'Yeah. All right. So we're good with that one?'",
        "'speaker_4': 'Yes. Withdraw or referral.'",
        "'speaker_3': 'So you were.'",
        "'speaker_0': 'Saying thank you. And now.'",
        "'speaker_3': 'Uh, that was the last.'",
        "'speaker_0': 'Time enabled.'",
        "'speaker_3': 'Everything. Yep.'",
        "'speaker_0': 'So we just. So do I. I'm sorry. I don't. During the meeting. Do we just continue to. Right. So there's still during the meeting then at this time. Okay. So it's now 155 in the morning, um, during the meeting.'",
        "'speaker_0': 'Thank you, everyone. Have a wonderful morning.'"
    ]
}