{
    "Contract Award for the Design of the Cross Alameda Trail.": [
        "'speaker_1': 'Recommendation to award contract in the amount of 205,000, including contingency the PFA engineers for the design of the Cross Alameda Trail, Webster Street two Sherman Street through June 28. Open Space Park.'",
        "'speaker_2': 'Did you? Yes.'",
        "'speaker_0': 'Did you want to go?'",
        "'speaker_7': 'Yes. Thank you, Madam Mayor. The reason why I pulled this is because this is such an important project for the city of Alameda. And wanted to express my appreciation to city staff, particularly the park head, Ms.. Amy Woolridge, as well as outgoing city manager John Russo and this council and previous councils in bringing us to this point'",
        "'speaker_7': ', look forward to whatever designs that Bcf comes up with a project like this. You know, we do need on important city projects like this, we do need expertize like from outfits such as Bcf design and we'll have to do so on many other things.'",
        "'speaker_7': 'I think the key thing though is that we're clear as to the scope of work that's involved our expectations and it's all outlined in the detailed information packet that that Ms. Woolridge had had provided. So I'm excited about this and I know that on this and any other projects, we'll always scope out carefully the costs and the'",
        "'speaker_7': 'type of work that we expect because we we anticipate and we hope to have a variety of things, not just things like the Jean Sweeney Park, but perhaps even a workable traffic transit solution. So thank you very much.'",
        "'speaker_7': 'I'd like to move on.'",
        "'speaker_5': 'Can I.'",
        "'speaker_0': 'Remember Ashcroft?'",
        "'speaker_6': 'As long as you pull this, I just want to commend once again our recreation and Parks Director, Amy Wooldridge, because what the public might not realize is that this project, the design that we're approving now, the the approval of the contract to for the behalf engineers to design this cross Alameda Trail going through Jean Sweeney Park is'",
        "'speaker_6': 'actually funded by a federal grant and also a local match requirement that comes from our some of our portion of the transportation sales tax measure B and open space funds. And I. Ms. Wooldridge has been an amazing source of the ability to find and then apply for and get grants for our city.'",
        "'speaker_6': 'So when you see her say thanks. Thank you.'",
        "'speaker_7': 'Madam Mayor, I'd like to move approval of item five.'",
        "'speaker_0': 'I all those in favor.'",
        "'speaker_6': 'I just want to say thank you.'",
        "'speaker_0': 'Motion passes unanimously. Thank you. Five F.'"
    ],
    "Acquisition of One Police Boat and Trailer with Grant Funds.": [
        "'speaker_1': 'Authorize the acquisition of one police boat and trailer for 202 832,000. By approving an agreement with lake assault boats plus a. Authorizing the applicable sales.'",
        "'speaker_0': 'And we have the speakers on this. And so is it all right if I call? Because at this point, okay, we have three speakers, Kurt Braun for the lap and then Rob Rado.'",
        "'speaker_3': 'Good evening, Curt Brown.'",
        "'speaker_9': 'Waterfront homeowner and lifelong Alameda resident.'",
        "'speaker_3': 'I support Alameda.'",
        "'speaker_9': 'Having a police boat. The recent.'",
        "'speaker_3': '$8 million law enforcement and salvage.'",
        "'speaker_9': 'Expenditure shows that an ongoing problem with infractions does exist, and the sheriff and Coast Guard boats are not being used to patrol the estuary.'",
        "'speaker_3': 'So that job.'",
        "'speaker_9': 'Now falls to the cities of Oakland and Alameda.'",
        "'speaker_3': 'And the old boat that Alameda has is irreparably damaged. And and the new one is state grant funded. So I have no.'",
        "'speaker_8': 'No fiscal.'",
        "'speaker_9': 'Impact on the on the general fund.'",
        "'speaker_3': 'So. Um. Um. The Department of Voting Waterways. Has also has.'",
        "'speaker_9': 'Grant moneys to actually operate the boat. So I'd like to put a plug in for the the aware funding that's also available from the voting waterways and.'",
        "'speaker_3': 'To abate whatever vessels become abandoned derelict in our waters. And we don't want our estuary to revert back to the dump site.'",
        "'speaker_9': 'It was becoming just two years.'",
        "'speaker_3': 'Ago before.'",
        "'speaker_9': 'The cleanup. Thank you.'",
        "'speaker_0': 'Thank you. Rock the lap. Then Rob Rado.'",
        "'speaker_3': 'At a mayor council. I would like to second Kurt's position of support for the patrol boat, given the extensive shoreline of Alameda with really literally millions of dollars of assets along that shoreline, waterfront housing, marinas. It's absolutely critical that the police department have the equipment necessary to patrol and do law enforcement from the water side of our'",
        "'speaker_3': 'island. I think that Chief for Larry has done an excellent job parlaying both the support from the Division of Boating and Waterways, as well as other grant funds, so that there will be zero impact on the general fund of the city to support this critical piece of equipment that's necessary for officers to be out on the water'",
        "'speaker_3': '. One of the things that point I made earlier in a discussion about this was that the boat be an all weather capable boat. And Chief Larry has definitely met that requirement with a fully enclosed pilot house for his officers.'",
        "'speaker_3': 'So I strongly encourage the council to support receiving these grant funds to get this necessary piece of equipment for the Alameda Police Department. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Rob Rando Park Street Business Association Executive Director. And I'll make it unanimous. We believe we believe that you should support this agenda item this evening, as I've said it numerous occasions, including the last time we were all here last week, I believe the police department in this town does a fantastic job of keeping us incredibly safe in'",
        "'speaker_3': 'one of the most urbanized areas. In the entire country. I'm not going to pick on Oakland tonight. But you know what I mean. Any tool that the police department can receive to increase their vigilance, especially as the other speakers said on our coastline.'",
        "'speaker_3': 'Because we're an island, you remember, right? We're an island. Okay. You know, that is a good thing. We urge you to approve it quickly so we can move on to other things on the agenda this evening. Thank you very much.'",
        "'speaker_0': 'Thank you. I remember they sort of pulled us, right?'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'Oh, remember?'",
        "'speaker_8': 'You think I didn't pull it? I think the.'",
        "'speaker_6': 'Because we had the three spot.'",
        "'speaker_8': 'All right. But actually, Matt Amir, thank you. For the reasons contained in the staff report and outlined by our three speakers, I'd like to move approval of Agenda Item five to authorize the acquisition of one police boat and trailer for $202,032.33 Bitcoin.'",
        "'speaker_0': 'Any comments.'",
        "'speaker_6': 'And I just want to add, I mean, I agree with all the speakers. Thank you for the comments you made. And I did meet with Chief Hillary last week because I had a few questions, but I think one of the speakers alluded to the fact that we are replacing a police boat that is 15 years old and'",
        "'speaker_6': 'this new one is also estimated to last for another 15 years. And and it's being built custom built for our needs. And better still, it is all grant funded. So, again, commendations to chief for Larry. We love it when our department heads find funds outside of our general fund.'",
        "'speaker_6': 'So thank you, Madam Chair.'",
        "'speaker_0': 'And I also want to thank Chief Larry for reaching out to all of us to answer our questions in advance of the meeting. Any other comments? All those in favor.'",
        "'speaker_9': 'I either both.'",
        "'speaker_5': 'Oppose.'",
        "'speaker_0': 'A motion carries unanimously. Thank you. All right. Six a. We're moving on to the regular agenda items now. Six A.'",
        "'speaker_1': 'Doctor resolution commending Johnny Russo for his service to the city of Alameda as city manager.'",
        "'speaker_5': 'On.'",
        "'speaker_6': 'A.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'All right. So now I'm going to read the resolution. Now that we have his name cleared up, John. A Russo. Whereas John Russo began his service to the city of Alameda on June 13th, 2011, and John Russo, through decisive action, was able to create an efficient and responsive city hall building employee morale by providing a consistent message'",
        "'speaker_0': 'of excellence and accountability. Accountability. And. WHEREAS, under his leadership and based on his personal philosophy of openness and transparency, John Russo facilitated the city's first ever Sunshine Ordinance, which was adopted on November 1st, 2011, and promotes transparency and responsiveness in local government.'",
        "'speaker_0': 'And. Whereas, under John Russo's decisive and determined leadership, the city made significant strides to put the former Naval Air Station and as Alameda back into productive reuse, including the no cost conveyance of 900 acres of former military property.'",
        "'speaker_0': 'Ex executed the Nassau Alameda Tidelands Trust Exchange Agreement with the State Lands Commission approved a rezoning amendment, master infrastructure plan, environmental impact report, transportation demand management plan and Waterfront Town Center Plan and establish an exclusive negotiation agreement for a first phase development of a 68 acre mixed use site.'",
        "'speaker_0': 'And first, through his collaborative approach, John Russo was instrumental in working with the public safety labor groups, whereby safety employees now contribute more toward their pension and health care than any time in the past leading the way in Bay Area Cities.'",
        "'speaker_0': 'And. Whereas, Gianni Russo balanced the city's general fund budget while increasing reserves, maintaining service levels and creating a 22 year plan for repairing and replacing all city sewers and roads. And. WHEREAS, during his tenure as city manager, John oversaw tirelessly, advocated for more parks, played a critical role in identifying funding and support for estuary park athletic fields'",
        "'speaker_0': ', the Alameda Point Sports Complex and the Jane Sweeney Open Space Park and protected the beloved Chuck Greca golf complex to sustain it for future generations to enjoy. And or, as Gianni Russo focused on reestablishing a robust economic development program, creating jobs and growing the City of Alamitos tax base.'",
        "'speaker_0': 'In an effort to fund central city services and work, Johnny Russo is committed to providing the community with professional, courteous and efficient service, oversaw the remodeled permit center and launched the new Alameda Your Service Program for commercial development projects and rose through his insightful directives as both the city manager and a public utility board member, Johnny Russo'",
        "'speaker_0': 'has made a major contribution to the operation and future success of Alameda Municipal Power AMP. And with his innovative recommendations, AMP has been able to accrue significant resources to enhance its green program and efficiencies customers and various. Johnny Russo has been a strong advocate for the city of Alameda, both locally and regionally, evidenced by the numerous grants'",
        "'speaker_0': 'the cities received during his tenure. Securing a regional seat on the rest on the Water Emergency Transportation Agency Leader Board and earmarking Alameda County Transportation Commission Measure B funds for Alameda is complex but essential transportation efforts. And. Whereas, Johnny Russo never saw an In-N-Out Burger that he didn't like, brought a refreshing sense of humor to the position'",
        "'speaker_0': 'of city manager, serenaded the office regularly and perfect pitch and will be greatly missed. Now, therefore, be it resolved that the City of Alameda does hereby express its sincere appreciation for Johnny Russo's years of service to the Alameda community, it further resolved that the City Council of the City of Alameda does hereby congratulate Johnny Russo on his'",
        "'speaker_0': 'many accomplishments as city manager and wishes him well in his new position as city manager of Riverside.'",
        "'speaker_5': 'Oh, right.'",
        "'speaker_0': 'Okay. I understand. We need a motion. Oh.'",
        "'speaker_6': 'And then we can make comment.'",
        "'speaker_5': 'Yes. Okay.'"
    ],
    "Resolution Commending John A. Russo as City Manager.": [
        "'speaker_6': 'Well, I will. I move. Adoption of the resolution commending John E Russo for his service to the city of Alameda as city manager.'",
        "'speaker_0': 'All right, now discussion. You want to make comments?'",
        "'speaker_6': 'Thank you, Madam Mayor. Well, I would just like to say, and I think that many of us who know John know that, knows that he has a big personality which has enabled him to achieve some very big accomplishments in Alameda.'",
        "'speaker_6': 'And those were enumerated in the in the resolution and especially the conveyance of the Naval Air Station. We're going to be talking about that tonight and for some months to come. And your work with labor groups, it goes on and on.'",
        "'speaker_6': 'Suffice it to say that, John, you leave us better than you found us. And I know you're moving on to the city of Riverside, a much bigger city with a bigger population, bigger challenges, your equal to the task.'",
        "'speaker_6': 'And the city of Riverside is in good hands with you. And we'll miss you.'",
        "'speaker_0': 'We do have four speakers. Three have them speak at this point.'",
        "'speaker_6': 'Should we vote?'",
        "'speaker_8': 'Well, I think we're supposed to have public comment before. Actually, we do know.'",
        "'speaker_6': 'Well.'",
        "'speaker_0': 'All right. I'm going to go ahead and call the speakers Gray Harris, then Jeff Del Bono, then Helen Soares and then Dianne Lichtenstein.'",
        "'speaker_2': 'Good evening. I'm Greg Harris. I'm here as the co-president of the city of Alameda Democratic Club. I wanted to thank John and Alex. I'm going to do six A and B all at once in the interest of time for their service to the city of Alameda.'",
        "'speaker_2': 'I was formerly the president of the teachers union in Alameda. And during that time, the school district was going through some rocky times. The city of Alameda also went through some rocky times. And then John and Alex came.'",
        "'speaker_2': 'And the rocky times kind of evened out and smoothed out kind of like the school district is hopefully doing now. And now you're going to leave. So I am sad about that. But I also know that Riverside is lucky to have you.'",
        "'speaker_2': 'And we really appreciate all the time and work you have spent here. Helen Source most everything's been pretty well covered, especially in the resolution. But I just wanted to reinforce see a team that John is a symbol. This fine team of professionals have brought a high standard to our city, a high standard of excellence.'",
        "'speaker_2': 'His knowledge of how cities work and the regulatory process and expertize and guiding careful development to enhance our city, and most especially redirecting Alameda Point from our three times, going down the same rathole and teeing the city up for success with his strong start for actual development that will strengthen our economy for years to come.'",
        "'speaker_2': 'Credibility and address are social needs. What a big thanks. And I wish you and Alex all the best. And thanks to both of you for being such fine team leader sitting. Good evening, Diane Liechtenstein. I am not as eloquent as little Arnie Rich or certainly as a proclamation or as Helen.'",
        "'speaker_2': 'But I do know all the wonderful things that have been said about John. And since he has been here, he surely has propelled our city along. And I wish him and his family all the best.'",
        "'speaker_0': 'Thank you, Jeff de Bono. And thank you for waiting. And then I'll be Karen, be.'",
        "'speaker_8': 'Mayor, council, city staff. So I have one word quitters, but I'm going to do it in the efficiency of time. Two, I'm going to combine the both A and B, and I want to thank both of both John and Alex for their service.'",
        "'speaker_8': 'I think everybody knows the history with the firefighters here before they came. I know that for me and for every single guy that sits in the station, and I think I can speak for every police officer on the street.'",
        "'speaker_8': 'John and Alex brought dignity to city hall. They brought respect. And that's what we felt in the firehouse. And that's what we felt as employees here when they got here. The collaborative process, the mutual respect, we had to open communication.'",
        "'speaker_8': 'And it wasn't always easy at times. I know. I know sometimes. Like I told the guys in Riverside, when you have a problem with John, sometimes you got to work through Alex to get back to John because, you know, we don't always we don't always see eye to eye, but the mutual respect that was shown brought a'",
        "'speaker_8': 'lot back to this city. And I hope that continues forward. I think Riverside deserves deserves to have you, especially with how conservative it is down there. But I thank you again for your service. And Alex, I know that you reached out to the fire department personally and worked hand in hand with our fire chief and some of'",
        "'speaker_8': 'our employees, such as Jim Colburn, and really put the effort and time. And I don't know how to thank you guys. It meant a lot to us. It means a lot to us. And I think we've accomplished some great things here.'",
        "'speaker_8': 'I hope we can accomplish other great things that's unprecedented in the state of California in the future. Meetings coming up. But once again, thank you again, both of you guys. I consider you guys friends and thank you very much for your service.'",
        "'speaker_0': 'Evan Bayh.'",
        "'speaker_5': 'Hmm. That evening, Madam Mayor, the city council and Mr. Russo. I'm so glad that I didn't miss this part. I just wanted to say thank you from the bottom of my heart. You have been, I think, one of the best city managers we've ever had.'",
        "'speaker_5': 'And I can say that because when we took on the role as master developer, I really don't think we understood exactly what we were accepting. But you made it seem easy. You know, you knew just what we had to do.'",
        "'speaker_5': 'You knew how to negotiate the deals. You knew how to keep us moving forward. And that's what I'm used to. I've worked for developers for 15 years. And you have been an incredible developer. And I appreciate all of your hard work.'",
        "'speaker_5': 'And we're going to miss you. I'm going to miss you. And I wish you the best. Thank you.'",
        "'speaker_0': 'Thank you. Counsel comments. The other memory.'",
        "'speaker_8': 'And just want to echo a lot of what the public said. And I was having a conversation with a constituent earlier today, and she said to me, is it typical that we give proclamations and recognize outgoing city managers as like, well, it's not often that we have won leave voluntarily in recent times.'",
        "'speaker_8': 'So that's that's what was my first thought. But my second thought was, you know, it's not it's not often we're blessed with somebody of John's talents and skills here in Alameda. I remember talking to the then vice mayor four years ago when I first learned that you were interested in doing this job.'",
        "'speaker_8': 'And my apologies to Mr. Arnovitz. You know, my first comment was, well, if you can get Michael Jordan to come play for your team at his peak, then that's what you should do. And I think that's what we did.'",
        "'speaker_8': 'And not only do we get Michael Jordan to the Chicago Bulls reference, I'm sorry, that's where I'm from. Not only do we get Michael Jordan, we got Scottie Pippen with him. So we had an amazing team. And, you know.'",
        "'speaker_8': 'I'm so glad that I'm sitting in the seat now and not four years ago, because you've turned around the morale at City Hall. You've turned around. Now there's labor peace, which is very important, and you've turned around the city finances.'",
        "'speaker_8': 'And I'm really going to miss you, man. Wish you were here, but I know we're in good hands, so thanks.'",
        "'speaker_0': 'Member, De Saag.'",
        "'speaker_7': 'Thank you very much. Several days ago, on April 19th, the city of Alameda celebrated its 161 year, having been founded in April 19th, 1854. I think over that time, Mr. Russo and his tenure as city manager will stand out as one of the best, in my opinion.'",
        "'speaker_7': 'He took a city that was in disarray and put us in the right direction, not just internally within the walls of City Hall, but externally in terms of how we work with the community and how we work on major projects like Alameda Point, which was long stalled.'",
        "'speaker_7': 'I think history will be kind to Mr. Russo and also the city council's that he worked with Mayor Gilmore or Mayor Chris Spencer. And I think for your time here and also Mr. Nguyen's time here, Alameda is the much richer and I think your place in art in the chapters of it as is city hall.'",
        "'speaker_7': 'History is certainly going to be a good chapter.'",
        "'speaker_0': 'Assistant City Manager Liz Wormley. Did you want to be vice mayor? Sorry.'",
        "'speaker_9': 'I just wanted to say, I hope people understand just how difficult the job is. Appreciate. Your energy to that. And I wish you the absolute best in Riverside, and I hope you enjoy it.'",
        "'speaker_0': 'This one right now.'",
        "'speaker_2': 'Thank you, Madam Mayor. First, I'd just like to invite everybody tomorrow to our going away party that we're hosting for both Alex and John at the Elks from 5 to 7 p.m.. And we have some special treats for them.'",
        "'speaker_2': 'But everybody is invited. I also just wanted to say that, you know, 17 years ago I worked here as management analyst, as one where where I started my career in California. And and I left to go on to bigger, better things.'",
        "'speaker_2': 'And I always had an eye coming back to Alameda because I always lived I continued to live in Alameda, but there was never really an opportunity that I saw where I really wanted to be part of a team until I saw that John actually took the helm.'",
        "'speaker_2': 'And when I realized that he was here, it was an organization that I really wanted to be part of. And he has not let me down. John has brought transparency and accountability to city hall and accountability. And I really want to emphasize that.'",
        "'speaker_2': 'You know, in cities we have a. Employees, long time employees. And sometimes it's hard for us to accomplish the tasks that we want to accomplish. John brought that accountability to City Hall that I really have not witnessed in cities that I've worked with, and I've been in cities for 25 years.'",
        "'speaker_2': 'One of the things that people don't realize about John, I think everybody thinks he came from a large city and he had the large city mentality, but at his core, he really cared about the individual, the small guy.'",
        "'speaker_2': 'Oftentimes when we would talk about business transactions or with developers, he was always the hardest on the developers, on the people that had the big pocketbook. But on the little guy, on the small business, on the person who was trying to pull a permit, he always if he could cut not cut corner corners, because we're not allowed'",
        "'speaker_2': 'to do that. But that was his mentality was was to go after the big folks and actually do what he could and bend over backwards for the average citizen. And, you know, that's just I don't think people really realize that.'",
        "'speaker_2': 'And that's such a such a great gift. And and just I'd like to acknowledge him for that. I just want to say I'm really going to miss you, John and Alex both. Let me say a few words about Alex.'",
        "'speaker_2': 'It's hard to be to work with John. I think you all can imagine as a council member, Ashcraft has said, as he Ashcraft has said, you know, John has a big personality and. We've got Alex, who is sort of part of that partnership.'",
        "'speaker_2': 'And I think it's been Alex has always been at his side and has always provided, I think, to our staff council, the perspective of the average citizen. How would our decisions that we make here at City Hall affect the average citizen?'",
        "'speaker_2': 'And has really brought a perspective, I think, that really is unique to City Hall. So, Alex, I want to say thank you to you, to both of you. I wish you the best of luck. We're really going to miss you.'",
        "'speaker_2': 'And I'll do my best to fill your shoes. But as I'm sure everybody knows, they're quite big shoes to fill. I will do my best. And again, good luck.'",
        "'speaker_0': 'And I want to say a few words for those of you who don't know. When I was on the school board, I had the pleasure of working with Mr. Russo. We would regularly have joint meetings and he was always professional.'",
        "'speaker_0': 'And then during the campaign, very gracious and afforded really me every opportunity to learn what the city was about. He always took the time to to answer questions. And now, with the transition again, always professional. And I truly respect you as your work.'",
        "'speaker_0': 'And then you personally, what you bring to the table. I wish you and your family absolutely the best. And it really has been a benefit to our city to have you serve. And now we will vote all those in favor.'",
        "'speaker_8': 'I.'",
        "'speaker_0': 'Oppose.'",
        "'speaker_5': 'Motion carries.'",
        "'speaker_0': 'Unanimously. We're good to go. Thank you. All right. Next six be.'"
    ],
    "Resolution Commending Alexander Nguyen as Assistant City Manager.": [
        "'speaker_1': 'Adoption resolution, commending Alexander Nguyen for his service, the city of Alameda as assistant city manager.'",
        "'speaker_0': 'RS Alexander Nguyen began his service to the city of Alameda on July six, 2011 as deputy city manager and was promoted to Assistant City Manager on February 10th, 2013. And. Whereas, with his keen understanding of the public's concerns, Alexander and Nguyen increased community engagement by placing Alameda at the center of the city's work, improving upon the city's'",
        "'speaker_0': 'outreach to residents, ensuring community input on projects and using technology to assist residents in communicating with their government. And. Whereas, Alexander and Nguyen fulfilled the role of the public information officer increase in City Hall's formal communication with residents and the media, as well as providing all better access to information.'",
        "'speaker_0': 'And. WHEREAS, during his tenure with the city, Alexander Nguyen revamped the city's website to streamline content and make it more accessible to the public. And. Whereas, in an effort to increase government transparency and efficiency, Alexander Nguyen led the efforts in initiating a city wide records retention policy and records management program.'",
        "'speaker_0': 'And. WHEREAS, through his insightful directives and innovative recommendations, Alexander and Nguyen led the efforts in taking the first steps toward modernizing the city's information technology infrastructure. And. WHEREAS, Alexander and Nguyen provided a thorough analysis of the city's lobbying efforts and streamlined contracts to better suit the city's long term needs.'",
        "'speaker_0': 'And first, through his collaborative approach and calm demeanor, Alexander Nguyen was committed to improving employee engagement and morale, smoothing the transitions caused by the restructuring of the Public Works Department. And. Whereas, Alexander Nguyen has been a strong advocate for the city's disaster preparedness program and coordinated efforts to transform the city's approach to resiliency and improve upon the'",
        "'speaker_0': 'city's emergency operations. And. Whereas, Alexander Nguyen brought a large dose of humor and humility to his work, maintained an open door policy with his colleagues, anxiously awaited the enactment of the Backyard Farm Animal Ordinance and will be greatly missed.'",
        "'speaker_0': 'Now, therefore, be it resolved that the City Council of the City of Alameda does hereby express its sincere appreciation for Alexander Nguyen's years of service to the Alameda community before the resolve of the City Council of the City of Alameda does hereby congratulate Alexander Nguyen on his many accomplishments as assistant city manager and wishes him well in'",
        "'speaker_0': 'his future endeavors. And we have a motion.'",
        "'speaker_8': 'I move adoption of item.'",
        "'speaker_6': '6/62 and.'",
        "'speaker_0': 'We have one speaker pro rata.'",
        "'speaker_3': 'Thank you. Don't start. Rob Reiner. I'm still the executive director of the Park Street Business Association, and you'll notice that I wanted to speak on Mr. Nguyen's agenda item, not yours. Thank you. I guess I'll get to you in a minute, but I just wanted to get up and say that Alex had the unenviable job of usually'",
        "'speaker_3': 'dealing with me, because sometimes I have a chance to make requests on behalf of my organization that sometimes are in the best interests of my organization, but may not fit within the procedures of the city of Alameda. And he was the one that inevitably had to yak with me and say, Nice try, Renato.'",
        "'speaker_3': 'But no, but I will tell you that when he said no, he always did it with a smile on his face. And he was always he would always listen to my argument. Sometimes I could convince him that maybe I was right after all, and sometimes not so much.'",
        "'speaker_3': 'But I always respected him and I appreciated his good work on behalf of the city of Alameda. And if you're Scottie Pippen, I still thought you were a lot taller. I'm sorry. Pertaining to Mr. Russo. And I'm going to address Mr. Russo.'",
        "'speaker_3': 'Now, I'm very proud to say that I was part of the citizens panel that interviewed city managers candidates four years ago. And as soon as I met him, I went, Oh, this guy might make a pretty good city manager.'",
        "'speaker_3': 'And I'm sure that my recommendation had at least 1/100 of a percent of you getting the job. Thanks. So I'm very proud of that. We are certainly going to miss you. But I will just give you both this one warning.'",
        "'speaker_3': 'As you know, I go to Southern California many, many times, and I'm sure I could sneak in a trip to Riverside to speak about nine agenda items. So just just keep thinking about that one, okay? We're going to miss you both.'",
        "'speaker_3': 'We're going to have a lot of fun at your party tomorrow night. Thank you very much.'",
        "'speaker_0': 'Thank you. Thank you. Council comments. Member Ody.'",
        "'speaker_8': 'I thank you, Madam Mayor. So. You're the right hand man. Right, Alex. And has someone who does that in his day job. I have a special appreciation for that. You know, you're. You're the one I've been able to go to because, you know, we had that camaraderie and that connection as the right hand guy.'",
        "'speaker_8': 'And no one, that's who you go to when you want something to get done. You know, but you're also, you know, the one who helps smooth out the rough edges. And, you know, who makes the phone call after the the bad meeting and who tells the constituent bad news.'",
        "'speaker_8': 'And, you know, as the general flak catcher so know I get how that works and I really appreciate, you know, everything that you've done and and supporting John and helping move our city forward. And. And thank you for everything you did.'",
        "'speaker_8': 'Because I came to you probably more than anyone else given, you know, we kind of served similar positions. And I really appreciate everything you've done and helped help me get up to speed and becoming a new council member.'",
        "'speaker_8': 'And I'll miss you, too. And good luck. And best of luck in Riverside.'",
        "'speaker_0': 'Amber Ashcroft.'",
        "'speaker_6': 'I just I echo my colleagues. Thank you, Alex. We'll miss working with you. Best of luck. Happy trails.'",
        "'speaker_0': 'Member De Saag.'",
        "'speaker_7': 'Thank you very much, Mr. Nguyen, for your service to Alameda. When I started back on council, you helped me out tremendously. When there was a traffic matter on the Oakland side of High Street and the connections that you had have with people in Oakland and I helped smoothen that fix.'",
        "'speaker_7': 'There was near the warehouse, that many warehouse, there was some kind of thing on the road that was causing a hazard for Alameda. And I've always appreciated that. And among all the many other things that you had helped, not just City Manager Russo, but all of us on council.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_9': 'Vice mayor and not to repeat, but I do want to thank you for continuing to give me access to the city manager's office, regardless of what's happening. You do your job well, and I wish you much success in Riverside.'",
        "'speaker_9': 'Hope you enjoy it as well.'",
        "'speaker_0': 'All right. So I also want to thank you. And what I want to say really is people may not realize what a team the two of you are. You may see Mr. Russo more at events or whatnot. Alex is always right there.'",
        "'speaker_0': 'If you look if you're in the office, he's there toiling away long hours. He is a go to person for staff and community members. And again, I thank you for your service. And I really wish you wish the two of you the best when you're down in Riverside.'",
        "'speaker_0': 'So although those favor I. Motion carries. Thank you.'",
        "'speaker_3': 'I would like to say thank you and I'll seed all my time to.'",
        "'speaker_7': 'Low earners because we.'",
        "'speaker_3': 'Ready to tell them thank you.'",
        "'speaker_0': 'All right.'"
    ],
    "Ordinance on Grocery Worker Retention for Large Grocery Establishments.": [
        "'speaker_1': 'Six C Introduction of Ordinance Amending the Alameda Municipal Code by adding Chapters six, Article 13, Section six, Dash 56 to impose requirements relating to the retention of grocery workers in certain circumstances involving the transfer of ownership of large grocery establishment.'",
        "'speaker_2': 'Good evening. I'm Debbie Potter. I'm the city's community development director. How about a short staff report on February 3rd of this year based on a referral from Councilmember Jim Odie, the city council directed staff to prepare an ordinance to require a workforce retention period when there was a change of ownership, control or operation of a large grocery'",
        "'speaker_2': 'store. The proposed Grocery Worker Retention Ordinance is modeled on the City of Los Angeles ordinance. That ordinance has been upheld by the California Supreme Court. In addition to Los Angeles, his ordinance staff identified three other cities with grocery worker retention ordinances in the state.'",
        "'speaker_2': 'All of these ordinances define grocery establishments as being over 15,000 square feet. Therefore, staff drafted an ordinance that maintains that same definition. There are 12 grocery stores in Alameda and five of which are over 15,000 square feet. So they would be required to comply with the ordinance if it is adopted.'",
        "'speaker_2': 'We captured all other key provisions in the city of L.A. ordinance in the draft ordinance. So pursuant to City Council's direction, we recommend that the Council introduce on first reading a grocery worker retention ordinance, and that's staff's presentation.'",
        "'speaker_2': 'I'm happy to answer any questions. Q Thank you.'",
        "'speaker_0': 'We do have four speakers on this. All right. So I'm going to go ahead and call the speakers. It'll be Jeff Dale Bono, Mike Canterbury, Tim James, and then Gary Harris.'",
        "'speaker_8': 'Mayor, council members, city staff Jeff Bono and resident of Alameda, president of the Firefighters Union. And I'm here to support our grocery store workers tonight and this ordinance. And I think one of the things that I think about is being 15 years old.'",
        "'speaker_8': 'And my first job, one of my first jobs, was being a bagger at a grocery store. And at that time, the grocery store industry being a checker was kind of a big deal, like you could support a family on it.'",
        "'speaker_8': 'You had health care, you had a pension. And I think all of you know, over the past decade that's deteriorated. And that's unfortunate because the grocery store is probably where we spend some of what a big part of our life and a lot of our time.'",
        "'speaker_8': 'And it's important to have good workers in there, but not only good workers. A grocery store is the center of a town. It's a hub, and that is where the community comes together. We buy our food there, we break bread there.'",
        "'speaker_8': 'You buy your bread to break there. But the workers that live there are part of the community and most of the time are residents. And I think that is something that we really need to consider in Alameda, too.'",
        "'speaker_8': 'When you look at the housing prices and what the cost of living is here, we want to retain good jobs, good workers. And I'm going to end with this note. We talk about 15,000 square feet. I think Encino Market would be a prime example of a shop that retains good union workers and good jobs for working families'",
        "'speaker_8': 'and thrives. So I know Safeway. I know Nob Hill. I know our biggest grocery stores can absolutely do that. And we can provide great grocery stores, a great economic return. At the same time, thinking about the workers are checkers, are baggers, are produce, people are butchers, the delivery people that come there that deliver food.'",
        "'speaker_8': 'So I'm in complete favor of this. I hope you guys can find it tonight to support it. It's important. Thank you.'",
        "'speaker_3': 'Thank you, Madam Mayor. Members of the City Council. Lou Gehrig. Scottie Pippen. And I hope Babe Ruth becomes the next city manager. That would be awesome. Be a real dream team. My name is Mike Henneberry. I live on Otis Drive between Mountain View Sales.'",
        "'speaker_3': 'I'm a lifelong Alameda resident. I'm also privileged to be the communications and political director for United Food and Commercial Workers. Local 35 or Local 35. Local five You guys can correct me if you want.'",
        "'speaker_6': 'Dave.'",
        "'speaker_3': 'It has been a long day, actually. Let me introduce the members. Local five, they're here. Could you guys stand up? Right. Thank you. We have members from Safeway Food, Max and Lucky's here tonight. We do not have any members from Nob Hill because those members are in the process of taking a strike vote.'",
        "'speaker_3': 'So I hope this is in 2012 all over again, but that's why the Nob Hill members are not here. But thank you. Thank you very much, guys. Thanks for coming. I want to commence evening, make a few comments about the grocery workers ordinance and urge you to support it.'",
        "'speaker_3': 'Alameda Grocery workers face the same issues as our sisters and brothers elsewhere, and one of the primary issues that they face during their term of employment is when their employer changes. It's a it's a tough time for any worker.'",
        "'speaker_3': 'Fortunately, our members have been pretty fortunate with the Nob Hill takeover by Reilly's, the Albertsons takeover by Cerberus, Andronicus take over by Renault Evo and Safeway by Cerberus just this year. In each of these interest instances, the new entity purchasing the chains kept the staff on the payroll and for the most part, continued by keeping all the'",
        "'speaker_3': 'stores open. This worked out well for the employees in terms of being able to get on life without the threat of termination hanging over their heads. And it worked out well for the shopping public also in terms of having skilled clerks and meat cutters continue on the job and produce the quality products and services that the shopping'",
        "'speaker_3': 'public has become justifiably accustomed to, particularly here in Alameda. Despite the positive results of the above takeovers, the fact remains that when a new owner takes over, they have the unilateral right to keep or terminate any employee for any reason or no reason.'",
        "'speaker_3': 'And as a matter of fact, that's exactly what happened here in Alameda when the Snow family sold chestnuts and now the new owner let the staff go. And many of those people had been with that store for many years.'",
        "'speaker_3': 'So the dynamic of a small chain or a single store sale is addressed by this ordinance, and it's been implemented in Los Angeles, San Francisco, Santa monica and Gardena. The ordinance that is enacted by those cities also addresses another phenomenon that is just starting to take place in the grocery industry.'",
        "'speaker_3': 'Since Wal-Mart has reached capacity in rural areas and suburban areas with their supercenters, they're now entering the urban marketplace with their neighborhood stores. Those stores are 20 to 40000 square feet. And what they're doing is they're coming into urban areas and they're buying businesses that have gone out of business like Circuit City and putting stores in.'",
        "'speaker_3': 'And with Wal-Mart, it's only a matter of time before they start buying existing stores with existing employees. In this case, this ordinance is really going to be needed because under this ordinance, the new employer is obligated to keep the staff on for at least 90 days.'",
        "'speaker_3': 'This legislation does not restrict new owners from buying stores. It just requires them to retain the workers who are skilled in delivering safe, high quality goods and services to the public. And it will alleviate the stress also associated with a takeover for the employees.'",
        "'speaker_3': 'The staff has done an excellent job researching and put putting together an excellent staff report and ordinance. However, one item I would mention, there's a 15,000 square foot trigger for this ordinance. If it passes with a 15,000 square foot trigger, then Trader Joe's and it's now market who both have great staffs are going to be left out'",
        "'speaker_3': 'of this. I would suggest that you reduce that to 10,000 square feet so they are covered. I know there's some discomfort in apprehension about being sued because the L.A. ordinance had 15,000 square feet. I would recommend to reduce it to ten.'",
        "'speaker_3': 'And then if some someone threatens a lawsuit, I would say we could come back and discuss it at that time. So thank you very much. Thank you for your support of grocery workers and to the city manager and assistant city manager.'",
        "'speaker_3': 'Good luck. And have you been to Riverside? I was just wondering because you might want to check that out a little more carefully. Now.'",
        "'speaker_5': 'Now I.'",
        "'speaker_0': 'Jim James. Then Gray.'",
        "'speaker_10': 'Mayor Council members Tim James with the California Grocers Association representing several grocery companies.'",
        "'speaker_3': 'Operating here in Alameda. I think we haven't.'",
        "'speaker_10': 'Had the full conversation.'",
        "'speaker_3': 'Yet about this ordinance. When you really look at what this ordinance does, it's basically a real estate encumbrance. It's an economic development issue for a lot of ways. One of the issues that we've.'",
        "'speaker_10': 'Seen with the very few jurisdictions that have passed this type of ordinance, and I'd like to point out that no ordinance in the last over eight years has passed this type of ordinance. I think because they've learned.'",
        "'speaker_3': 'This lesson is it actually can be a issue between grocery stores selling it to another grocery store. As previous speaker speakers have recognized. Grocery stores are very important to the community as well as the workers that work there.'",
        "'speaker_3': 'But by placing an additional mandate, this additional regulation on grocery stores, they might grocery stores are looking to move to Alameda might not look at stores that are current stores are selling or look for open space that's it's already there.'",
        "'speaker_3': 'What we've seen in L.A. in a couple.'",
        "'speaker_10': 'Of other jurisdictions is that this has actually.'",
        "'speaker_3': 'Reduced the amount of grocery.'",
        "'speaker_10': 'Stores.'",
        "'speaker_3': 'In some areas and neighborhoods.'",
        "'speaker_10': 'Because of the retention issue and the challenge that that may present.'",
        "'speaker_3': 'There's a lot of open space in cities where grocery stores can choose to operate. So if you make it easier for them to not replace the current store, then that's a direction they may go.'",
        "'speaker_10': 'We've also seen these communities as non retailers purchasing grocery stores, since grocery stores may not want to encumber this additional regulation.'",
        "'speaker_3': 'We've seen grocery stores turn into karate studios.'",
        "'speaker_10': 'Other types of non retailers and whatnot that you then lose that value.'",
        "'speaker_3': 'As the city of Alameda for having the grocery store available there.'",
        "'speaker_10': 'So I think the challenge that we're looking at and the issue that I.'",
        "'speaker_3': 'Think Alameda should look at for yourselves is does this.'",
        "'speaker_10': 'Disincentivize?'",
        "'speaker_3': 'Grocery stores buying other grocery.'",
        "'speaker_10': 'Stores that are for sale.'",
        "'speaker_3': 'In Alameda? Or are you creating potentially creating a barrier where grocery stores may not want to move into Alameda or you are attracting or attracting non grocery.'",
        "'speaker_10': 'Retailers to take their space? So with that, that's our major concern. In all those scenarios, there's the very much potential to either.'",
        "'speaker_3': 'Lose a grocery store and if you do lose a grocery store, then the retention of employees, not an issue. Those employees would be also out of a job as well.'",
        "'speaker_10': 'So thank you very much for your time and consideration.'",
        "'speaker_0': 'Thank you. Gray Harris and then William Smith.'",
        "'speaker_2': 'Good evening. I'm Gray Harris resident. I also work for the California Teachers Association. I am here tonight in support of the grocery workers. With all due respect, I'm not really sure what else is missing from the conversation other than I see no reason why you wouldn't want to give someone 90 days to prove that they're still doing'",
        "'speaker_2': 'a good job. Basically, what I do all day, every day is advocate for people to have the right to some kind of process before they get laid off, fired or otherwise terminated. I don't know why grocery workers should be any different.'",
        "'speaker_2': 'I heard Mike say that without an ordinance like this, people can be fired for any reason or no reason. And I firmly believe that that is the wrong thing to do. If we want to build a sense of community and if people are doing a good job and they prove that they're going to continue to do a'",
        "'speaker_2': 'good job for a new employer, I see no reason why that would be a bad thing. So thank you.'",
        "'speaker_0': 'Thank you. Joe Smith.'",
        "'speaker_3': 'Good evening, Mayor Spencer, members of the council. I'm William Smith, the resident of Alameda and also president of the Society of Professionals and Scientists, engineers at the local level and of the university, professional and technical employees. And I am speaking as a resident of Alameda on this one.'",
        "'speaker_3': 'And just like I said, I definitely support the the ordinance as written and wanted to point out that the national laboratories frequently change hands in terms of management. And one of the things that is very, very important to do is retain the workforce at all levels.'",
        "'speaker_3': 'And it's very important, especially at the lower levels where a lot of the institutional knowledge resides. And we certainly have a lot of institutional knowledge. When I go to the grocery stores in town here and see the clerks and the people and it's just a friendly place and and I'd like to keep it that way, and I'",
        "'speaker_3': 'hope this ordinance will help us do that. So thank you.'",
        "'speaker_0': 'Thank you. As far as I know, we don't have anymore speaker setups on this issue. All right, we have a motion. Did we want to have comments first? Council member Ashcroft Thank you.'",
        "'speaker_6': 'Thank you to all the speakers and thank you to the staff and city attorney's office and Miss Potter for your research. And I actually went back and read the California Supreme Court decision on this. And and I thought it made a lot of sense that this is there is a public health and safety issue at play here'",
        "'speaker_6': ', because these grocery workers also are trained in handling food safely. And we want to make sure that the groceries we buy are safe. But I think even more importantly than that, we we do want to make sure that people have their jobs.'",
        "'speaker_6': 'They've worked hard to get their jobs to advance through the ranks. And still market was mentioned. I grew up in Alameda and I can remember going every Saturday to the grocery store to internal market with my dad and the same checker lady was there.'",
        "'speaker_6': 'I think, you know, even by the time I grew up and had my family and then she retired. But there was a reason that, you know, people held this jobs. For all these years. I support this measure the way it was drafted by our city attorney's office.'",
        "'speaker_6': 'I, I have great respect for Mike Hanna, Barry, but this was the measure that we asked our city attorney to look into. And in Ms.. Potter office, and this is what the State Supreme Court has vetted and this is what I feel comfortable supporting.'",
        "'speaker_6': 'So I am certainly in favor of the the ordinance amending the municipal code as currently drafted. Thank you, Mayor Brody.'",
        "'speaker_5': 'Sure.'",
        "'speaker_8': 'I feel I can go after everyone else.'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_9': 'Yes, I think the risk of. The Wal-Mart scenario outweighs the risk of the of the empty store becoming a karate studio in Alameda. I don't think that's that is our particular issue. I think the 90 day. A period is a good backstop for people in this in these unsettled times, economic times, where there's current turnover at corporate'",
        "'speaker_9': 'levels. And the litany was given to us from the podium, and I don't see that slowing down. So I think this protection is necessary. I live next to a lucky in Marina village, and I worry about that store.'",
        "'speaker_9': 'And I think for our own economic development, we need to have this kind of protection as well as for the people who service those stores.'",
        "'speaker_0': 'Member De SA.'",
        "'speaker_7': 'Thank you very much. For many years now, within the grocery store industry, there has been basically a race to the bottom as a result of the introduction of the Wal-Mart Supercenter and breaking even further into food. And I think this is just one way to help the working family in this era of change within the grocery industry'",
        "'speaker_7': '. It's a small way, and I think comedians can play a part in it. When I look at the reason why we should play a part, certainly there is a public safety issue, a public health issue. But also, you know what?'",
        "'speaker_7': 'For many of us, grocery stores are places of community gathering. You know, you say Lucky's, I say Dana own tag. You know who works at the fish counter at Lucky's marina village? You say Safeway. I say Todd, my friend, who who?'",
        "'speaker_7': 'Greenwell, who and his and other friends who had worked at Hilo Steel, who had worked at Lucky's when there was one at the base of What's the Street, if we all remember. So there is certainly a community role that grocery stores have is a part of our fabric and.'",
        "'speaker_7': 'We should do what we can. We're not. We're not promising so much. We we should do what we can in the face of the changes that this industry has been going through. And to the extent that, you know, we're remaining aligned with.'",
        "'speaker_7': 'The Los Angeles model. I think this is a small, prudent step forward. On a final note, I can't speculate what would happen if a grocery store closed and it was difficult to re tenant. That is a possibility. Let's not romanticize this.'",
        "'speaker_7': 'But by the same token, think, you know, in Alameda, this is just one small part that we can do to help the working families in a much impacted industry. Other places like Oakland or Berkeley can can pass $15 minimum wage things.'",
        "'speaker_7': 'I'm not sure we can do that here in Alameda, but this is one small thing that we can do to protect working families.'",
        "'speaker_0': 'You want me to go ahead? You want to go last?'",
        "'speaker_8': 'I can go last.'",
        "'speaker_0': 'All right. All right. So I appreciate the comments raised by the speakers as well as my fellow council members. I agree with member Ashcraft in regards to the I would prefer staying with the 15,000 square feet as written that was tested by the Supreme Court as opposed to making a change at this point.'",
        "'speaker_0': 'I think that this brings balance in regards to maintaining the food supply or the safety of the food supply for 90 days. And then it allows the current workers to continue having a job and working and providing that service for the 90 days.'",
        "'speaker_0': 'So it's to me, it's not an undue hardship because it's a 90 day period. And I think it is a great benefit to our community to protect the safety of our food supply. And it also gives an opportunity then for the new buyer to meet the current employees and and make an informed decision as to who they'",
        "'speaker_0': 'think is would be a good match for their store. So I will be supporting this.'",
        "'speaker_8': 'So I want to thank the public for their eloquent comments, especially Mr. Barry, and thank Ms.. Potter for putting together this ordinance and also thank my colleagues for their thoughtful and eloquent comments. Just to address a couple a couple of points.'",
        "'speaker_8': 'I also had a chance to look at the case and the point that, you know, this could be disruptive to some employers. I mean, we have this at the 15,000 square foot level. I'd like to see it go down to ten, but it doesn't sound like there's consensus on the council to do that.'",
        "'speaker_8': 'But the comment from the the case was that the city rationally could conclude that disruptions at larger stores involving larger workforces would have a larger impact on the community and that larger stores would be more readily positioned to absorb any short term burdens the ordinance requirements might impose on employers.'",
        "'speaker_8': 'So, I mean, what that tells me is our large stores, our Lucky's, our ah, Nob Hill foods are Safeway's know this, they're, they're anchors to our neighborhoods. They're they're anchors to our city. And that these workers, as the staff report says, play a vital public health and economic role in our communities.'",
        "'speaker_8': 'So what we can do to to preserve, you know, some sense of security, even if it's just for the 90 day period, I think is worthwhile for these workers. And I think that if you look at the size of the employers we're looking at and even Trader Joe's, if we went low, I mean, they are a large'",
        "'speaker_8': 'enough corporation. I don't envision them moving out and I don't envision a Safeway moving in next door. But, you know, they would be able to absorb the impact of of keeping workers on and evaluating them for 90 days.'",
        "'speaker_8': 'And I, I do want to thank my colleagues for, you know, their their words of support and their support of of all of our working families, especially our working grocers.'",
        "'speaker_0': 'We have emotion.'",
        "'speaker_6': 'Oh, I would say this is a first reading of the ordinance. Is it? Okay. So I will move. Introduction of an ordinance amending the Alameda Municipal Code by adding Chapter six, Article nine, Sections six, Dash five six to impose requirements relating to the retention of grocery workers in certain circumstances involving the transfer of ownership of large grocery'",
        "'speaker_6': 'establishments.'",
        "'speaker_8': 'I'll second that.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_8': 'I.'",
        "'speaker_0': 'Oppose motion carries unanimously. Thank you. Now moving on to 60.'"
    ],
    "Expansion of Municipal Services and Territory for CFD No. 13-2 (Alameda Landing Municipal Services District)": [
        "'speaker_1': 'Complete actions to expand municipal services and territory for financing district at Alameda Landing and Levy of corresponding special tax community facility to District 13 Dash to Alameda Landing Municipal Services District. You'll do so by conducting public hearings and adopting for resolutions.'",
        "'speaker_0': 'So open. Do we have a presentation?'",
        "'speaker_1': 'Debbie's coming.'",
        "'speaker_2': 'So good evening once again, a short staff report. So on February 4th, 2014, the City Council established a community facilities district for Alameda Landing Phase one to fund maintenance of public infrastructure and other municipal services. Catullus has now requested that the city extend the existing CFD to include the Phase two property, which is primarily the property north'",
        "'speaker_2': 'of Mitchell. And there's a little piece of the property north of Mitchell that's actually part of phase one. But we're talking about approximately 40 acres north of Mitchell Street, which is the phase two property. So they would like to increase expand the CFD to include phase two property and the DDA.'",
        "'speaker_2': 'The disposition and development agreement that that we have with Catullus requires that the city cooperate with the establishment of a CFD if requested by the developer. Tonight's public hearings have been set to consider adding eligible municipal services that can be funded and to consider adding the Phase two property to the existing CFD by annexing Phase two property'",
        "'speaker_2': 'and adding additional services. The cost of maintaining the future waterfront park and additional Phase two public infrastructure can be covered by the special taxes to be collected from the resident, the property owners in the district. So that's essentially what the annexation and the addition of of eligible services does.'",
        "'speaker_2': 'It expands the size of the existing CFD and expands the eligible services that can be maintained via the special taxes. So I do have Paul Kimmage, who is our bond counsel here this evening. If there are any technical questions otherwise, I would recommend that the mayor open the public hearing and commence the proceedings.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_9': 'I have a request because there are two agenda items in the second. One is completely tied to the first and my right. Well, you can execute the first without the second.'",
        "'speaker_2': 'So you could the first. This this community facility, there are two existing community facilities districts. They were both adopted, one in January of 2014, one in February of 2014. This one the item. First up, CFD 13, dash two.'",
        "'speaker_2': 'It has to do with the municipal services and the funding of the municipal services, the cost of maintaining the backbone infrastructure. The second item has to do with the authority to issue bond bonded indebtedness to reimburse Catalist for the cost of the construction of the public improvements.'",
        "'speaker_2': 'So they are two separate community facilities districts there. Both of them work in the sense that both of them assess a special tax on the property owners in the districts. One to fund the municipal services. The other to fund the bond.'",
        "'speaker_2': 'The debt service on the bonds.'",
        "'speaker_9': 'And that requires an election.'",
        "'speaker_2': 'Both of them require an election so that that's what those are. Sure.'",
        "'speaker_9': 'Before we start the discussion that everybody.'",
        "'speaker_2': 'Knows they both require an election. And those are the proceedings that that will commence this evening is the election involving the property owners.'",
        "'speaker_0': 'Member de SA.'",
        "'speaker_7': 'So the question that I have has to do with the second item specifically. The item after this agenda specifically calls out. Moving the or in it from where it is now to here without without specifying a cost that it would be one of the items for which things could be covered.'",
        "'speaker_7': 'But there is no cost associated with with the $55 million or so and bonds, $26 million of which is for the Fort Worth alterations. The question I have is. While we have not vetted the merits or demerits of moving the Hornet from one part of Alameda point to another, it might be a good idea.'",
        "'speaker_7': 'The question I have is in moving forward with the first thing or even the second one, can that happen as an item that's a standalone that that. That all of this isn't predicated somehow that we have to we have to move the Hornet.'",
        "'speaker_7': 'Rather, it's predicated on the fact that, you know, we whether or not the Hornets, they are, we want to make these kind of changes to the the wharf area.'",
        "'speaker_2': 'Right. So the latter characterization is the accurate one. All of the work that's being proposed is predicated on the need to stabilize the existing wharf and to put in the park improvements. And it is not tied to the to the relocation of the Hornet.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Any other council questions? Right. All right. This is now the time and place where the public hearing in the City Council's proceedings for changes to community facilities. District Number 13 dash to the hearing is to allow public comment regarding additional municipal services to be financed by the CFD.'",
        "'speaker_0': 'Before I formally open the public hearing, are there any owners of property and CFD 13 Dash two or registered voters who reside in the Alameda Landing area who wish to file a written protest against the proposed changes to CFD 13 Dash two.'",
        "'speaker_0': 'If so, they must be filed with the city clerk now. Seen on the public hearing is now officially open. Does anyone in the audience wish to make any comments on this matter?'",
        "'speaker_1': 'We have no public speakers.'",
        "'speaker_0': 'I will now close the public hearing counsel discussion. During a council discussion. S Vice mayor, can.'",
        "'speaker_9': 'We have staff summarize the residential component of this transfer so that the public knows when their land is an expert, what zoning it carries and what the unit load is?'",
        "'speaker_2': 'To the Alameda landing. Phase two property is currently zoned a mixed PD. So it's a mixed use plan development. It is approximately 40 acres and a portion of that 40 acres, ten acres has a multi-family overlay in addition to the mixed PD zoning.'",
        "'speaker_2': 'Alameda Landing. Catullus is currently working on their master planning for phase two, and they don't have a completed proposal, land use proposal at this time. They will be working with city staff on that entitlement process as it moves forward.'",
        "'speaker_2': 'I was mentioned in the staff report that pursuant to the DDA, Catullus has to commence an initial phase land take down on the phase two property by December 31st of 2017, which is why they're working to put the pieces in place and are beginning their pre-development process.'",
        "'speaker_2': 'So they there is not a set there is not a set land plan yet, but they do have the ability to take advantage of the multifamily overlay on ten acres of that property and.'",
        "'speaker_9': 'The approximate number of units just by the zoning.'",
        "'speaker_2': 'As well. Ten acres, 30 acres to the unit is 300 units.'",
        "'speaker_0': 'So I have a question. Does this decision have does this impact the zoning?'",
        "'speaker_2': 'Not at all.'",
        "'speaker_0': 'Any other comments?'",
        "'speaker_9': 'I just have a comment because.'",
        "'speaker_0': 'I swear I.'",
        "'speaker_9': 'Was looking at the housing element and I didn't see this as part of our land. Listen, the 1523 background report. I didn't see it as part of the land inventory and I also didn't see it discussed. LME two point was discussed as being outside the land inventory.'",
        "'speaker_9': 'But this wasn't is is there a reason why? Is it before is it before the plan or was it an unknown at the time or I assume that the zoning was there.'",
        "'speaker_2': 'It's in the 2007, 2015 housing element, and I believe it's on a tape. I believe it's number six. So it's state 16 on the table.'",
        "'speaker_9': 'Is there a reason it disappeared from the current housing element? It's not even mentioned.'",
        "'speaker_2': 'And I. I don't I believe that it's just it's been you know, it was it was part of the the package initial housing element 27 to 2015. And so it's just carried over as one of the properties with the multifamily overlay designation was done as part of the 2007 2015 housing element.'",
        "'speaker_9': 'And that overlay was placed on it in 2012. Mm hmm. Thank you.'",
        "'speaker_5': 'You're welcome.'",
        "'speaker_0': 'Any other council questions? Comments?'",
        "'speaker_2': 'And.'",
        "'speaker_0': 'Q So then it's my understanding at this time, and I asked the city clerk to open the ballots of the owners of land in CFD 13, Dash two four. And if you will.'",
        "'speaker_1': 'Yes, really quickly, the first action is for the council to adopt the resolution calling the election.'",
        "'speaker_0': 'All right. So then do we have a motion for that?'",
        "'speaker_1': 'The first. Yeah.'",
        "'speaker_6': 'Yes, I will. Oh, sorry. Wrong way.'",
        "'speaker_1': 'Yeah. Mm hmm. Okay.'",
        "'speaker_6': 'All right. So I move. Adoption of the resolution calling special election regarding alteration of the municipal services to be financed by community facilities. District number 13 Dash to Alameda Landing Municipal Services District.'",
        "'speaker_0': 'We have a second.'",
        "'speaker_7': 'Second.'",
        "'speaker_0': 'Although some favor.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Unanimously passes and now at this time I asked the city clerk to open the ballots of the owners of land in CFD 13, dash two and announce the results of the election. We will pause while she opens the ballot.'",
        "'speaker_6': 'And by the way, how many owners are we? Are we talking about five?'",
        "'speaker_1': 'Five? This one has four. All right. Oh, okay.'",
        "'speaker_6': 'Sorry.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_1': 'You know what I mean? I need an assist. No, no. They still do well.'",
        "'speaker_5': 'They won't.'",
        "'speaker_1': 'Of. There is 534, five, six, three, six. They'll have different number of votes each time to just give me.'",
        "'speaker_6': 'Yeah, this party. Do you want it? Just for a little filler? So land owners, property owners have a different amount of votes depending on the amount of acreage they own. Is that correct? I'm just remembering this. When our the last council voted on this last year.'",
        "'speaker_6': 'I know I'm putting you on the spot, but generally speaking.'",
        "'speaker_2': 'That the the 51% yes vote has to be is based on the percentage as opposed to one one person, one vote, its percentage acreage relative ratio of the ownership. So total so that if you if you own 20% of the property, then your vote is weighted, 20% of you own 60%, it's weighted 60%.'",
        "'speaker_2': 'And there has to be a 51% affirmative buy percentage of of acreage of land ownership. If that's clear.'",
        "'speaker_6': 'News here is.'",
        "'speaker_2': 'That two thirds, not 50%. You need two thirds. Affirmative.'",
        "'speaker_6': 'Okay. Thank you, Miss Potter.'",
        "'speaker_5': 'Oh.'",
        "'speaker_1': 'And three for this one. Too for this.'",
        "'speaker_5': 'One. Oh.'",
        "'speaker_1': 'Okay. Got it. Let me juggle my own lives. Oh, one more. It was hiding there. Wait. Oh, I think I got it. Is society. You guys want to? I. The thing is that.'",
        "'speaker_0': 'We're going to take a recess.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_1': 'I think I have it now. Yeah. Yes, I do have it.'",
        "'speaker_2': 'Oh.'",
        "'speaker_1': 'Okay. So the votes for this one are 12, 11, ten and 14 in favor. You got it. Okay. So do you want to tell us about that resume? So they're all in favor and it passes all in favor.'",
        "'speaker_0': 'The results of the election being that all of the votes are in favor of allowing 5013 dash to the finance additional services. You may now proceed with the final actions for the changes to CAFTA 13. Dash two Do we have a motion to adopt the next part.'",
        "'speaker_1': 'Which is the resolution declaring the results?'",
        "'speaker_9': 'No.'",
        "'speaker_6': 'Moved a second. The resolution declaring results of the special election regarding the municipal services.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Passes unanimously. Well, now open the second public hearing regarding the annexation of property to CFD 13 Dash two. This is now the time and place for the public hearing and this city council's proceedings for the annexation of property to community facilities, District Number 13, Dash two and the levy of special taxes in the area to be annexed'",
        "'speaker_0': 'to the district. For I formally open the public hearing. Are there any owners of property in CFD 13, dash two or in the area to be annexed to CFD 13? Dash two are registered voters who reside in the Alameda Landing area who wish to file a written protest against the annexation of land to CFD 13 Dash two'",
        "'speaker_0': '. If so. They must be filed with the city clerk now. Seeing no protests. A public hearing is now officially re-opened. Does anyone in the audience wish to make any comments on this matter? I will now close the public hearing.'",
        "'speaker_0': 'Is there council discussion? CNN. We will now proceed with is there a motion to adopt this resolution?'",
        "'speaker_6': 'And this is the resolution.'",
        "'speaker_0': 'Of annexation.'",
        "'speaker_1': 'Taxation. Okay.'",
        "'speaker_6': 'So. Okay. I want to hand me the script. This is very scripted. We have to say the exact words so.'",
        "'speaker_2': 'Far this.'",
        "'speaker_6': 'Year. Okay. So I move that the council adopt the resolution of annexation of territory to the city of Alameda Community Facilities District Number 13 dash to Alameda Landing Municipal Services District authorizing the levy of a special tax therein and submitting levy of special tax to qualified electors.'",
        "'speaker_0': 'Is there a second? All those in favor.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'Motion unanimously passes. Thank you. At this time, I asked the city clerk to open the ballots of the owners of land in the area to be annexed to CFD 13, dash two and announce the results of the election.'",
        "'speaker_0': 'We will pause for that.'",
        "'speaker_1': 'We received two ballots for this one. Both are in favor. One is 48 votes. One is two votes. So that's 50 votes in favor.'",
        "'speaker_0': 'The results of the election being that all of the votes are in favor of the annexation of land to CFD 13 dash two women now proceed with the final actions for the annexation of property to CFD 13 Dash two.'",
        "'speaker_0': 'We have a motion to adopt a resolution declaring results of special annexation, election determining validity, validity of prior proceedings and directing recording of amendment to notice of special tax lien. Alameda Landing Municipal Services District. We have a second.'",
        "'speaker_8': 'Second.'",
        "'speaker_0': 'All those in favor. My motion unanimously passes. Thank you. And that was the end of that idea. Now we're going to proceed with six E.'",
        "'speaker_1': '60 is. Or sorry if a t e is clean actions to expand public improvements in territory for financing district add Alameda Landing and levy of corresponding special tax community facility District 13 Dash one Alameda Landing Public Improvements. You'll do so by conducting public hearings to adopt resolutions and introduce an ordinance amending and restating ordinance levying special taxes'",
        "'speaker_1': 'within the City of Alameda Community Facilities District 13. Dash one. Alameda Landing Public Improvements.'",
        "'speaker_0': 'As Potter.'",
        "'speaker_2': 'Okay. Once again, briefly. So this CFD was established on January 7th of 2014 and it was established for Alameda Planning Phase one to fund public facilities constructed by Catullus. This CFD allows bonds in an amount not to exceed $20 million to be issued to fund the public improvements.'",
        "'speaker_2': 'And they will be repaid. The bonds will be repaid by a special tax assessment on property owners within the district. Catullus has now requested that the city extend the existing CFD to include the Phase two property. Tonight's public hearings have been set to consider increasing the bonding capacity from 20 million to $40 million, adding eligible public improvements'"
    ],
    "Special Election and Resolution for Expanding and Financing Public Improvements at Alameda Landing - CFD No. 13-1": [
        "'speaker_2': 'to be financed and to consider adding the additional phase two property to the existing CFD annex in the Phase two land. Adding public services to be financed and raising the bond limit, Catullus will be able to finance the necessary work to stabilize the existing wharf, to build the public waterfront park, complete Mitchell Street to the project boundaries'",
        "'speaker_2': ', the western boundary, and to build other critical public infrastructure. So with that, staff is recommending that you commence the proceedings this evening to do the annexation and raise the bond limit and add more eligible public facilities. Thank you.'",
        "'speaker_0': 'Any comments by council at this time? This is I'm going to proceed. This is now the time and place for the public hearing and this city council's proceedings for changes to community facilities. District Number 13 Dash one. The hearing is to allow public comment regarding additional facilities to be financed by the CFD, changes to the rate and'",
        "'speaker_0': 'method of apportionment of special taxes for the CFD and an increase in the bonded indebtedness limit of the CFD. Before I formally open the public hearing. Are there any owners of property in CFD 13 Dash one or registered voters who reside in the Alameda Landing area who wish to file a written protest against the proposed changes to'",
        "'speaker_0': 'CFD 13 Dash one. If so, they must be filed with the city clerk now. Seeing no protests. The public hearing is now officially open. Does anyone in the audience wish to make any comments on this matter?'",
        "'speaker_1': 'There are no speakers.'",
        "'speaker_0': 'I will now close the public hearing counsel discussion. And can we have a motion to adopt the resolution calling special election regarding alteration of the facilities to be financed by and the rate and method of apportionment of special taxes for and an increase in the bonded indebtedness limit of community facilities.'",
        "'speaker_0': 'District Number 13 Dash one meter land in public improvements.'",
        "'speaker_6': 'Sum of madumere and.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_10': 'I.'",
        "'speaker_0': 'I. Motion unanimously passes. Thank you. At this time, I asked the city clerk to open the ballots of the owners of land in CFD 13, dash one and announce the results of the election. We will now pause while she opens the ballot.'",
        "'speaker_1': 'We have two ballots in response to this one, one with ten votes, one with 12 votes, and all votes are in favor. That's 22 votes in favor.'",
        "'speaker_0': 'The results of the election being that all the votes are in favor of the changes to CFD 13 Dash one. You may now proceed with the final actions for the changes to CFD 13. Dash one device mirrors. We are now asking for the adoption of a resolution declaring results of special election in community facilities.'",
        "'speaker_0': 'District Number 13 Dash one the land in public improvements determining that alteration of the facilities to be financed by and the rate and method of apportionment of special taxes for. And the increase in the bonded indebtedness of the District are lawfully authorized approving and authorizing the execution of a supplement number one to acquisition agreement and directing recording'",
        "'speaker_0': 'of an amendment to notice of special tax lane. We have a motion for that, so.'",
        "'speaker_5': 'Go ahead.'",
        "'speaker_9': 'Yeah.'",
        "'speaker_0': 'Any comment? All those in favor. I motion passes unanimously. Thank you. No first reading of ordinance amending and restating ordinance levying special taxes within the City of Alameda Community Facilities. District Number 13 dash one Alameda Landing Public Improvements.'",
        "'speaker_0': 'This is now the time and place for the public hearing in the city council's proceedings for the an and.'",
        "'speaker_6': 'I did we I think we have.'",
        "'speaker_1': 'We have to.'",
        "'speaker_6': 'Introduce the approved the the first reading of the ordinance.'",
        "'speaker_0': 'We have a motion for that.'",
        "'speaker_6': 'So I'll move the first reading that we accept the first reading of the ordinance, amending and restating ordinance levying special taxes within the city of Alameda Community Facilities. District number 13 dash one, Alameda Landing Public Improvements.'",
        "'speaker_0': 'Thank you. Do we have a second? All those in favor. My version passes unanimously. Thank you. Now. Now I'm going to move on. All right. Thank you. This is now the time and place for the public hearing and the city council's proceedings for the annexation of property to community facilities.'",
        "'speaker_0': 'District Number 13, dash one and the levy of special taxes in the area to be annexed to the district. Before I formally open the public hearing. Are there any owners of property in CFD 13, dash one or in the area to be annexed to CFD 13, dash one or registered voters who reside in the Alameda Landing area'",
        "'speaker_0': 'who wish to file a written protest against the annexation of land to CFD 13 Dash one. If so, they must be filed with the city clerk now. Seeing no protests. The public hearing is now officially reopened. Does anyone in the audience wish to make any comments on this matter?'",
        "'speaker_0': 'I will now close the public hearing and also discussion. We have a motion to adopt the move. Of that, let me read this whole thing. The resolution of annexation of territory to the city of Alameda Community Facilities. District Number 13, dash one.'",
        "'speaker_0': 'Alameda Landing public improvements authorizing the levy of a special tax therein. And submitting a levy of special tax to qualified electors. We have a motion removed. Vice Mayor moved. We have a second.'",
        "'speaker_6': 'A second.'",
        "'speaker_0': 'All those in favor and passes unanimously. Thank you. At this time, I ask the city clerk to open the ballots of the owners of land in the area to be annexed to CFD 13, dash one and announce the results of the election.'",
        "'speaker_0': 'Proposition opens the ballots.'",
        "'speaker_1': 'Or this, there were two ballots cast, one with 48 votes, one with two votes, and both were in favor. So there are 58.'",
        "'speaker_0': 'If the results of the election being that all of the votes are in favor of the annexation of land to CFD 13 Dash one, we may now proceed with the final actions for the annexation of property to CFD 13 Dash one.'",
        "'speaker_0': 'We have a motion to consider the adoption of resolution declaring results of special annexation, election, determining validity of prior proceedings and directing recording of amendment to notice of special tax lien. Alameda Landing Public Improvements.'",
        "'speaker_6': 'So with the second year move I've done a lot.'",
        "'speaker_5': 'So I.'",
        "'speaker_0': 'All right, all those in favor. I i i a motion passes unanimously. Thank you. And that is the end of that agenda item. Yes. Thank you, everyone, for your patience. And we are now moving on to the six F.'"
    ],
    "Site A Development Update at Alameda Point.": [
        "'speaker_1': 'Status report on site eight development in Alameda Point, including presentation of update to development plan, approach to transportation disposition and development agreement.'",
        "'speaker_2': 'Good evening, mayor councilmembers. My name is Jennifer Ott, Chief Operating Officer for AMI to point. I'm going to be brief because we actually have some really exciting presentations on some new topics tonight from the developer team. So I just want to do a little bit of housekeeping up front is that we are as we mentioned before, this'",
        "'speaker_2': 'is an ongoing iterative process that we're going to the council first to the planning board, council planning board as other boards and commissions. And so I wanted to just make the council aware of some things that are on the horizon.'",
        "'speaker_2': 'Before our next meeting. We will be coming back to the Council on May 19th with an update on status, say with a focus on the fiscal impact analysis for Alameda Point in general and city in particular and how we're approaching that.'",
        "'speaker_2': 'But between now and then, we'll be going to the Planning Board on April 27th with the development plan, um, the draft of the not the disposition agreement, but the development agreement because the Planning Board has to review that before the Council can take action on that to make sure it's conforms with the general plan.'",
        "'speaker_2': 'So we'll be looking at kind of a final draft, final package on April 27th with the intent to come back. We believe that packet that's before the planning board on April 27th is essentially done. We want to get kind of give everyone a final call at the planning board hearing and the planning board, a chance to kind'",
        "'speaker_2': 'of make any final tweaks or edits that we would come back with a recommendation on May 11th for the planning board to approve the development plan or site A as well as a. Prove a consistency finding with the general plan for the development agreement.'",
        "'speaker_2': 'And then we back to the Council on May 19th for update and then in June, June 16, it is our right now our scheduled target for coming to the City Council with a final disposition, disposition development agreement, development agreement and all the other kind of transaction documents that make up the package for site.'",
        "'speaker_2': 'But I did want to say that the development plan is approved. The final approval actually is by the planning board that, as we said earlier, that's scheduled for May 11th at this point. We are. Thank you. If the.'",
        "'speaker_2': 'We'd love to get the city council's kind of some comments tonight. We have time. Until April 30th or, you know, April 27th if there are written comments. The city council would like to make. You're welcome to do that.'",
        "'speaker_2': 'We can incorporate those comments. Also, if what the planning board approves on May 11th, a city council would like to call that a full review for city council. Fine. You know, to to take a look at our approve.'",
        "'speaker_2': 'You could call that for review on May 19th when we're here back here for our status update. But technically, the way the city's process works is that the planning board makes the final approval on the development plan unless it's called for review by the city council.'",
        "'speaker_2': 'So we just want to make sure we just don't want any surprises. So about that process so everyone understands we've obviously you've seen this developing plan many times. We've been updating it. We've made the one that's before you on the dais tonight is there's been more edits and changes to it to respond really to your comments and'",
        "'speaker_2': 'the community's comments. You're going to hear from those about those briefly from the architect to put this together. Then you're going to hear from the transportation consultant on the Transportation Demand Management Compliance Strategy for site A. And then lastly, there was a request for shooting with a really good one about the commercial strategy, both commercial in terms'",
        "'speaker_2': 'of, you know, not retail and other non-retail commercial uses and what the strategy is for attracting those to the base. So it's a great, very exciting presentation tonight. So I'm going to stop talking and turn it over to David Israel with our architects to just give you a quick update, show you some pictures of the development plan'",
        "'speaker_2': ', the latest, and then we'll keep going through that agenda. Thank you.'",
        "'speaker_3': 'Good evening, Madam Mayor and members of the city council. Nice to see you again. And as Jennifer mentioned, we have a lot to go through. So I'm going to keep my comments very brief. I wanted to just bring you up to date on some of the refinements and additions to the development plan package that we've been putting'",
        "'speaker_3': 'together in direct response to the comments we've received from this party and members of the Planning Board and the community at large. So as you may recall, just as a refresher, this was the initial development plan that we had presented up on the screen that has now been refined and tightened up to be much more accurate and'",
        "'speaker_3': 'much more specific in all of the various components that were mentioned, things like the historic boundary and so forth have been defined. All of the items, as I mentioned, that have been discussed at this at this body have been reflected in this plan.'",
        "'speaker_3': 'One of the comments that was also requested or one of the items that was also requested, was that we show the proximity of the ferry, the ferry terminal to site A, and so that has that exhibit has been added as requested.'",
        "'speaker_3': 'And then we have gone through and done further refinements, added both plan refinements, plan detail and additional imagery to help convey the feel and character of some of the public realm elements, including the open spaces adjacent to the waterfront park.'",
        "'speaker_3': 'Again, just as a reminder, all of these will be coming back for detailed review, detailed design, review process. So this is purely for the the overall plan discussion, the discussion about the entry portal and characteristics associated with the nature of that entry.'",
        "'speaker_3': 'Those have been reflected in the new plan as well as some of the character images associated with that. And then in direct response again to comments by this body, the aerial perspective to show the general buildup of massing from the existing residential as we move towards the nodal center of Alameda Point.'",
        "'speaker_3': 'So one looking for from the residential, the other looking from the water to start to give you a sense of how this really sort of feeds into the context of the region, which I think is a really telling slide and I'm glad it was requested by this body.'",
        "'speaker_3': 'I think it's helpful for people to see. Again, just issues of the waterfront park and open space. The primary issue here that I wanted to bring your attention to is the refinements to the neighborhood park. As you might recall in the earlier development, we had a road encircling that entire neighborhood park.'",
        "'speaker_3': 'And that that that one of those roads adjacent to the existing commercial buildings has been eliminated to create a broader green space than we had before. Again, in direct response, both to comments from this board and the planning board as well.'",
        "'speaker_3': 'And then we started to really just take our first few snapshots of what we think this might start to feel like as a space. This diagram shows those three view perspectives. This set at Building 77 with the adjacent kind of community activity spaces on either side and the the the broad public green in front of the old'",
        "'speaker_3': 'Pan-Am building 77 and what the scale and character of that is intended to be. Again, just as a reminder, we did reduce the height of those buildings from the original precise plans designation of 55 feet down to 35 feet, a perspective of existing building 113 and you can see the existing building in the image to the to'",
        "'speaker_3': 'the lower left. So that's the scene today. The idea is that building is is right on the waterfront. So to use it both as a opportunity for people to have active use dining and so forth adjacent to the water and then potential for the sailing center and new other commercial and retail uses.'",
        "'speaker_3': 'And then lastly, building 67, the existing building shown in the image to the lower left and what the context of that component of the urban park that we've discussed on many occasions with this body, what the character of that space is starting to feel like and what the nature of those existing buildings can really become, which is'",
        "'speaker_3': 'very exciting. So that is where we are. And as I say, we will you will be receiving the, you know, the overall entire development package, but wanted to just highlight those things which have been further refined and changed.'",
        "'speaker_3': 'So I am available to answer questions, but I can do that now, or you can wait until you've seen the remainder of the presentation.'",
        "'speaker_5': 'Council.'",
        "'speaker_0': 'Any comments at this point?'",
        "'speaker_6': 'Amber Ashcraft This is just a compliment to the the development team of a couple of Saturdays ago. They held a walking tour and you were one of the presenters, right? And I've some 300 Alameda INS came out to take the tour and there were different groups.'",
        "'speaker_6': 'I was in one of them. And it was very inspiring to actually be able to walk on these streets and to see the view corridors, what they look like now, that building that you just showed that is is actually the one that's that's going to be adaptively reuse building that 150 is it 6767.'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Yeah. And I mean and there's a number of them that are going to be actively reused but adaptively reuse. But anyway, it was really a nice opportunity to be able to be out there and get the scale and the pedestrian scale.'",
        "'speaker_6': 'It was a walking tour. So thank you all for putting that together.'",
        "'speaker_3': 'Yeah, we did have all of these images present at that tour, so people really had an opportunity to stand right in the location where these images were generated from. So it was a really successful and exciting tour. There was a lot of a lot of energy and excitement at Amir.'",
        "'speaker_0': 'Remember Day.'",
        "'speaker_7': 'I had a chance to take part in that. That was a very good, good Saturday morning there. And there were in the group that I was with, there was a lot of questions by the people with regard to Building 67 because the Pan Am building is nearby.'",
        "'speaker_7': 'I think I think one of the aerial renderings really is very helpful in that regard and helping people. And I get a sense visually how the new buildings complement or not complement what's there. I also like the aerial in the sense of how it kind of shows the proximity of Building 13 and the and the space dedicated'",
        "'speaker_7': 'to a water use there. Because that was a question that I had raised. And I think this is very helpful. I mean, there's another slide to that that's also very helpful in that regard. So I appreciate this. Thank you.'",
        "'speaker_3': 'And there has been quite a bit of study in direct response to your comments about the scale of that that space between building 113 and the waterfront and also very sensitive addressing of sea level rise and how we can do that and still make it fully accessible.'",
        "'speaker_3': 'So those things have all been considered in a much more detailed way.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'The other council comments that we can proceed with your presentation.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_10': 'Good evening, Mayor. Members of the council, members of the public. My name is Phil Olmstead from Nelson Ayer Consulting Associates. We're working on the transportation strategy, the team compliance strategy for Site A. I'm going to provide you an overview of the draft compliance strategy this evening.'",
        "'speaker_10': 'I want to emphasize that this is not a this is not final. We're still working with city staff to refine the program and certainly implementation of many of the specific programs. The details of that are still being worked out.'",
        "'speaker_10': 'And obviously we're seeking your feedback here tonight and we'll be incorporating that as we move forward. As you're all aware, the ER for Alameda Point requires that transportation demand management be a mitigation measure and the 2014 team plan provides guidelines for how that will be implemented.'",
        "'speaker_10': 'This is site compliance strategy. The primary goal, of course, is to reduce peak hour vehicle trips per city policy. Alameda Point Partners, the developer and its successors have an obligation to do that, and we'll be doing so as part of as part of their project.'",
        "'speaker_10': 'And we believe we have designed a team program that will allow them to meet those obligations. I want to make four quick additional points about our overall approach to transportation demand management. One is that the TMA is really, really going to play a crucial role in making sure that implementation and management of these programs is as effective'",
        "'speaker_10': 'as possible. I encourage you all not to fixate on one specific any specific strategy in isolation, but really think of how all these strategies work together as a package and how they support one another to achieve the goals.'",
        "'speaker_10': 'This is a living document. We will be refining it as the project is developed, as tenants move in. As we learn more about the travel patterns of the residents and employees and how people are getting to and from the site.'",
        "'speaker_10': 'And finally, this is part of a coordinated one piece of a coordinated citywide effort to address traffic and transportation issues. And Alameda Point Partners is really committed to being a part of that discussion. We see this project as being a catalyst for that, for further discussion around that issue.'",
        "'speaker_10': 'So what exactly is Alameda Point Partners proposing? This is a summary diagram. I don't expect you to strain your eyes too hard, but I want to. What I really want to illustrate here is that it is meeting the required elements of the 2014 TDM guidelines as well as going above and beyond those guidelines.'",
        "'speaker_10': 'So Alameda Point Partners is really making a firm commitment to meet its obligation, and we're still going to be working out and finalizing the implementation of all these programs moving forward. I want to step back in and talk about the infrastructure piece because it's not just about the TDM programs in the policies, but how infrastructure, how important'",
        "'speaker_10': 'infrastructure is to supporting and providing a framework to make sure that those policies and programs work. Almeida Point Partners is making a significant investment in multi-modal infrastructure. The ferry terminal. It's proximity to site a really make this a really convenient and accessible transit option.'",
        "'speaker_10': 'The new bus infrastructure, both the dedicated lanes stop amenities will provide enhanced connections throughout the island and to the region as a whole, making transit much more attractive at Alameda Point than it is today. If you want to get people biking and walking, you have to provide them the facilities to do so.'",
        "'speaker_10': 'They want safe. They want they want safe facilities. They want convenient facilities. They want accessible facilities in the street network. And the infrastructure that's being proposed really will allow people to walk and bike safely in this in this new community.'",
        "'speaker_10': 'Management and marketing is crucial to the success of the program. If people don't know what programs are out there, they're not going to take advantage of them. The ultimate goal is to make it easy to take it, to make it easy to sign up and administer the program as well, so that once again, the TMA is crucial'",
        "'speaker_10': 'to that effort. It's going be responsible for team implementation. Alameda Point Partners will be a key member, but the board and the stakeholders will grow over time as Alameda Point develops. And those Stakers stakeholders should really be invested in the day to day management of the TMA program or the TMA and the team program.'",
        "'speaker_10': 'In addition to a site a coordinator on site coordinator that's going to liaise with the TMA staff in the city of Alameda. We're proposing that there be onsite representation at both all of the residential units as well as with the Commercial Tenant Association.'",
        "'speaker_10': 'This direct interface with residents and employees will be really crucial to making sure people are aware of the programs and can sign up and participate easily. Marketing will be diverse. Getting the word out there as best as we can, as much as we can in as many different formats and venues as we can.'",
        "'speaker_10': 'So a dedicated website for the for the TMA and for the for Alameda point. And utilizing social media and new technologies as well to get to get the information out there is crucial. So what are some of the specific strategies?'",
        "'speaker_10': 'One of the key ones is a as a direct, fast and convenient connection to BART allowing residents, employees, visitors to and from Alameda point to access that regional transit service. We're still figuring out the service plan of how this is going to work, where exactly we're going to go, where the stops are going to be.'",
        "'speaker_10': 'But in general, I want to emphasize that we're we're the initial plan will we'll start small, but we'll design it so that it can grow as ridership as the site develops. I would also note that the proposal, what we're proposing is 15 minutes service in the peak period.'",
        "'speaker_10': 'We really think that's important to make it a convenient choice and a convenient mode for people to connect to BART. And I would note that that it goes above and beyond what is outlined in the 2014 TDM plan.'",
        "'speaker_10': 'If you want to get people riding transit, one of the best ways to do that is to provide financial incentives. We're not talking about getting everyone to ride transit for all of their trips. We're talking about getting a portion of people to take a portion of their trips on transit.'",
        "'speaker_10': 'So we'll be providing transit subsidies. One of those subsidies will be the easy pass program that's offered by AC transit. This essentially eliminates the cost barrier, the convenience barrier that a lot of people encounter when they want to continue to ride transit or try taking transit for the first time.'",
        "'speaker_10': 'And once again, we're working out the details of this program, and it's going to require some negotiations with AC transit. But we ultimately want to maximize the coordination with the TMA, the city and AC transit. One of the things that the developer is proposing is an additional subsidy that goes beyond what is required in the plan to'",
        "'speaker_10': 'provide an additional per month subsidy to employees, essentially clipper cash that would allow employees to use any transit service that they want. So the ferry, BART, whatever it may be, and this is once again really trying to incentivize transit use to and from the island.'",
        "'speaker_10': 'Additional investments are key. Car sharing. Bike sharing are all part of supportive strategies that will really.'",
        "'speaker_0': 'All right. Remember Audi.'",
        "'speaker_2': 'High tech.'",
        "'speaker_3': 'Oh, sure.'",
        "'speaker_8': 'So quick, go back to the subsidies and then the screen before. Also when you were talking about the.'",
        "'speaker_10': 'This one or.'",
        "'speaker_8': 'The other, the last mile. So the cost of that is the public. And to be able to see the numbers and how how much this costs, how much the developer is paying, how much the public is expected to pay, and you know how financially stable that is in the long run.'",
        "'speaker_8': 'For example, like when it assuming site is finished at some point in time, you know, what are the obligations going forward long term? I mean, is that something we're going to be responsible for? Is that developer going to be paying in perpetuity?'",
        "'speaker_8': 'Are the rest? I'm just curious about some of those things.'",
        "'speaker_10': 'Those are all great questions. And I think the answer is we're we're still figuring out all those details right now. You know, the cost of the service is largely dependent on on how much service you want to provide.'",
        "'speaker_10': 'How frequent do you want to be? How many service hours are you providing? Right now, we're we're we're trying to design a program that is as cost effective as possible that that, you know, ultimately fits within the within the financial constraints of the developer, that the funding strategy will be diverse.'",
        "'speaker_10': 'And, you know, I don't know if city staff when I want to talk about that as well I can.'",
        "'speaker_7': 'Joe Ernst, allow me to point partners. So yes, we will be more than happy to share our costs, our, you know, sources of revenue.'",
        "'speaker_8': 'Which will be a combination of.'",
        "'speaker_7': 'Assessments on the properties, parking revenues, grants, all those things. You know, as we fine tune this program and, and dial it in, we will be more than happy to share it, be completely.'",
        "'speaker_8': 'Transparent and less worried about when when you're here, then more worried about when, when you're finished.'",
        "'speaker_7': 'Yeah. No, it'll. It'll all be documented and tied to the property. Run with the land.'",
        "'speaker_0': 'Remember they Daisuke.'",
        "'speaker_7': 'What excites me about this slide, I think you can kind of guess, is the third bullet point every 15 minutes in peak periods. I mean, for those who don't know Alameda landing I think runs I think it's every 30 minutes or could be every 20 minutes I get mixed up marina village runs every 30 minutes or every'",
        "'speaker_7': '20 minutes one of the two. And I think. We would all love to have a ten minute headways that that that the merry go round has. But if we can get 15 minutes every 15 minutes. A and B, if if if our hypothesis is right that the availability of this free shuttle is going to spur even more'",
        "'speaker_7': 'people to take it, then, you know, the demand to go from 15 minutes to 10 minutes might be there. Yeah. So 15 minutes is a great start and it's light years ahead of 30 minutes headways for sure. So and I think this is important because, you know, we're going to be hashing out the business deal, the terms'",
        "'speaker_7': 'of the agreement and air here is something that is there that will be within the DDA, though, if for whatever reason, you know, there's some backsliding to 25 minute, hey, why is this going 25 minutes? Why is it going 30 minutes?'",
        "'speaker_7': 'You know, we here's the contract basically or one deal point. So I'm really happy to see that.'",
        "'speaker_10': 'You know, I would I mean, I would note that the what we were talking about with I guess it's the fifth bullet point performance based contract that would that would whatever would essentially happen would be the HTML or the city would issue an RFP to operate this service.'",
        "'speaker_10': 'We would hope that AC transit would would be you know, they would be the natural provider for the service or really coordinate with their future plans for for service on the island. But there would be provisions within that contract that whoever operates it would have to meet.'",
        "'speaker_0': 'Remember Ashcroft.'",
        "'speaker_6': 'I think this is as good a time as any to raise this. This was a question slash suggestion that came from one of the members of my walking group on that Saturday tour of the site. They wanted to know what the possibility would be of having light rail, a light rail system that connected Alameda point to the'",
        "'speaker_6': 'rest of the island and before the developer falls over in a dead fade. And I suggest now that we add that, but it's something, I think, for the council to just consider in for city staff that some day it might be nice to have that kind of connectivity.'",
        "'speaker_6': 'I'm really excited about the the proposals that are are in the the team plan. But I'm just you know, we have a whole island that we'd like to to get connected out here too. So, you know, it's the kind of business you do, not specifically your task on this one.'",
        "'speaker_10': 'But would you would you like me to respond?'",
        "'speaker_2': 'Sure. Yeah.'",
        "'speaker_10': 'I mean, a light rail service is is you know, it's it's a matter of scale, right. And it's it's extremely expensive to build light rail. So you're going to be evaluating that in a series of trade offs. And, you know, the AC Transit has plans for BRT service, which really provides a cost effective solution to improving transit'",
        "'speaker_10': 'service on the island. You know, BRT systems have always have, have have scaled to LRT in other contexts before. But certainly what we're talking about now, I would not support light rail service. I think we're a long way from there, but it's it's certainly something to keep in mind as as the city talks about its overall approach'",
        "'speaker_10': 'to transportation. Thank you. Yes. Okay. So additional investments are really key. These are supportive strategies that that allow folks to really begin to transit, take transit, bike and walk. So car, car sharing, bike sharing are really designed to support those those trips, those mid-day trips, those those errands that that folks might have.'",
        "'speaker_10': 'There's a whole host of employee programs that we will be instituting. I'm not going to go through these in a tremendous amount of detail. But the ultimate goal here is to provide a lot of options for employees, whether it's financial subsidies, whether it's programs like Guaranteed Right Home, which eliminates some of the convenience factor, convenience barriers that'",
        "'speaker_10': 'that employee that people taking transit or biking or walking might have. And these would be required through leasing agreements to the greatest extent possible. Parking is crucial to meeting the trip goals and how much parking you supply and how you manage it.'",
        "'speaker_10': 'The zoning code and the team plan really set the the city policy around parking and we're just trying to meet those policies already adopted by the city. So the parking will be provided, there will be parking provided. That's in the development plan.'",
        "'speaker_10': 'It's going to be provided to support the target market. And I think that's something that Joe's team is really taking a closer look at, but it's going to be provided in compliance with the code and will not exceed the maximum ratios as defined in the zoning code.'",
        "'speaker_10': 'It's going to be a combination of facilities and it's really going to emphasize shared parking to the greatest degree possible. Unbundled parking?'",
        "'speaker_0': 'Yes, Ashcroft.'",
        "'speaker_6': 'I'm sorry to keep your train of thought, but I. So I was reading exhibit five, the Alameda Point Transportation Demand Management Plan. And on page 36, there is there's a paragraph that says, bottom of page 36, the amount of public parking the city provides will be dependent on the choices development makes regarding onsite parking.'",
        "'speaker_6': 'For example, if it one extreme development leans toward as little private parking as possible, the city will need to make up the difference and provide more public parking than anticipated, increasing the amount of land required for public parking, as well as increasing the cost to construct public parking.'",
        "'speaker_6': 'My question is, is is the city responsible in some way at some point for constructing public parking structures?'",
        "'speaker_10': 'I would defer to the staff on the exact intent. You know, we didn't write the DA.'",
        "'speaker_6': 'I never. So the so and I will hasten to say that there's a table on page 48 of this document that says that it would be funded by parking. That parking structure, if I'm reading this right, would be funded by parking revenues.'",
        "'speaker_6': 'But the cost to construct those parking structures was in excess of $19 million, which I said is a lot of parking revenues. So, Miss, I'd enlighten us, please.'",
        "'speaker_2': 'Yeah, sure. So the way there we have it structure now and the team plan is that the transportation management Assoc because parking I mean I think this is Phil is talking about is there's the carrot and the stick carrot is really that fast convenient transit service the stick being the parking management.'",
        "'speaker_2': 'You have to have both to make sure that you're meeting your trip goals that people are using transit. And so the way that we structured the TDM and the zoning code was to make sure that because the more parking you put into private the controlled and owned land, the less control you have over it in terms of'",
        "'speaker_2': 'pricing or supply. And so we wanted to have these shared parking areas that were essentially just start with a parking lot. There's no real cost effective standpoint to build a parking structure when you don't know that the demand.'",
        "'speaker_2': 'Right.'",
        "'speaker_6': 'In the early phases, we're just talking.'",
        "'speaker_2': 'About surface.'",
        "'speaker_6': 'Parking lots and.'",
        "'speaker_2': 'What really happens when if there's sufficient demand. The assumption is that if there's sufficient demand and you're at you're you're you're raising the prices for those public lots because there's so much demand in there full 85 to 90 or 100% of the time, you're going to get revenue from that that you're going to be able to use'",
        "'speaker_2': 'to help essentially create a bond or to finance a parking structure. And so that's the thought behind that. And that that those that would come later when that demand was there and when it was appropriate. But you wouldn't make that investment until that time to get it.'",
        "'speaker_2': 'Your question, the Transportation Management Association would essentially be making recommendations, working with the city to determine when's the best time to be raising the rates in those shared parking lots. When is the best time to be making recommendations regarding a parking structure because they're so important that parking piece is so important to the overall achievement of these'",
        "'speaker_2': 'goals, to have the TMA meeting making recommendations to the city on how to manage that, how to deal with it. And so that's the thought was that answer your question.'",
        "'speaker_6': 'It does. Thank you.'",
        "'speaker_10': 'So as I'll talk about unbundling, so unbundled parking is a requirement for the site. It's required for multi-unit residential. This does not include the townhomes. We strongly recommend that the unbundling be done on a month to month leasing basis.'",
        "'speaker_10': 'Leasing in this way provides the maximum flexibility to effectively manage the program, both from the property owner perspective and from the leases perspective. Affordable units would would have the equal opportunity to lease lease these spaces. That's that's part of the specific plan.'",
        "'speaker_10': 'It's like very likely that some of the affordable units will be exempt from this requirement. And that's that's related to how they're financed and some restrictions around financing mechanisms for affordable units.'",
        "'speaker_0': 'So can you clarify when they're exempt? Does that mean that they would have bundled parking?'",
        "'speaker_10': 'Yes. They would not be required to meet to unbundle their parking.'",
        "'speaker_0': 'And the required for the multi-unit residential. Can you clarify what that is about? The apartments? What is a.'",
        "'speaker_10': 'That is, I believe. Yes. No, that's.'",
        "'speaker_0': 'Not townhomes.'",
        "'speaker_10': 'Right? It does not include the townhomes then.'",
        "'speaker_0': 'It's not apartments.'",
        "'speaker_10': 'Apartments and condos and condos.'",
        "'speaker_0': 'Okay. Thank you, Mayor Brody.'",
        "'speaker_8': 'Thank you, Madam Mayor. So the affordable units having equal opportunity to lease to the low and very low likely to be exempt. Will other below market rate have the same parking charge or would that be.'",
        "'speaker_10': 'It's it's typically done it would be done at a proportional price based on their unit. Okay.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'And how many spaces would there be offered per unit? If it's multi-unit.'",
        "'speaker_10': 'You know, I believe the the final the final numbers are still being worked out. But it would. You guys want to clarify exactly this. The ratio per unit, it's getting just 1.5.'",
        "'speaker_0': 'So I'd like to speak to just my understanding there's one. The tall building will be all rentals. That's apartments, right? Correct. That's right. So for that in the phase one. I'm sorry.'",
        "'speaker_7': 'What? In the phase one. Yes.'",
        "'speaker_0': 'Okay. In the phase one, it's it's illustrated as a tall white building scribe. Is that fairly? And how many units, how many rentals would be in that building there?'",
        "'speaker_7': 'In the parcel 11, the one closest to the plaza area, there's about 220 units based on the initial plan.'",
        "'speaker_0': 'Okay. And then how many parking spaces do you anticipate for that? For those 220 rentals.'",
        "'speaker_7': 'Probably, you know, 220 units. You know what, we looking at the apartments on roughly a one per unit ratio.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_10': 'So it's not just about the supply, as Jennifer was alluding to. It's it's really important about how you manage that parking and really want to think about a comprehensive management system for the district as a whole. So these are some of the there's a lot of tools at the city's disposal exactly what that management plan is.'",
        "'speaker_10': 'I don't I can't say it yet. It's really going to depend on on how the site develops, what we see in terms of occupancies, it's really going to get down to the details, but it could include any and all of these or a combination of all these strategies.'",
        "'speaker_10': 'And so it's there's a lot of tools and ways in which we're managing parking in that. And the key goal is to manage parking to make it as convenient as possible for visitors, for residents and employees. Of course, the final piece is the monitoring program.'",
        "'speaker_10': 'This is essential to program success. If you don't know how things are going, it's impossible to say. It's a it's a it's a success or whether you're meeting your targets. So once again, the team plan is a living document.'",
        "'speaker_10': 'And if you're not adjusting, it's not going to work. So there's, you know, kind of five, five steps to the monitoring program. It's it's going to be based on data. We're going to every year, they'll go out and collect do traffic counts, do parking counts, do surveys of employees and residents to gauge the participation in the programs'",
        "'speaker_10': 'and also see qualitatively how programs are being perceived and how they're working or not working. And then you're going to be reporting and refining the strategies based on based on that data, whether you're meeting the targets, whether you're exceeding the targets, you know, how you're doing in terms of the overall metrics of the site.'",
        "'speaker_10': 'It's hard to say exactly what those mitigations might be. It's really going to depend on what we're seeing from the data and how those how the the site as a whole is developing and how meetup point as a whole is developing.'",
        "'speaker_10': 'But it could include any number of strategies and those are outlined in the in the compliance strategy. And I'm going to stop there.'",
        "'speaker_5': 'And Vice Mayor on that.'",
        "'speaker_9': 'On that analysis, on this this grid here of work, who does this work? Is it employees of the TMA or employees of the city?'",
        "'speaker_10': 'It it's to be determined. I mean, it could be it.'",
        "'speaker_9': 'Pays for who pays.'",
        "'speaker_10': 'For this work. This would be as part of this would be funded as part of the team overall team program. So it would be funded via the the assessments on the units. It would be funded via potentially the parking revenue, via via all the different financing strategies that would fund the overall TDM strategy.'",
        "'speaker_9': 'Will there be general fund money that. Those who paid for this.'",
        "'speaker_10': 'That's my understanding.'",
        "'speaker_8': 'And then one more question. So this time and this is going to be a day one phase zero type. It can be implemented then or is we're going to have to wait till there's more more units out there or how's that going to work?'",
        "'speaker_2': 'So we just answered no. The answer.'",
        "'speaker_8': 'To the.'",
        "'speaker_2': 'Vice mayor matter is that no, the general fund will not be responsible for paying for this. We have budgets. We have we have detailed budgets. And I'm a point team plan that showed how much we estimated parking revenues, we estimated the cost of all these things and compared them.'",
        "'speaker_2': 'And then now we're doing the same thing with sight to look at all the costs of the services that they're going to be provided, some of them from day one. And Phil can answer that question more specifically. And then we're actually comparing special tax revenue or fee revenue from the development versus what we think those costs are'",
        "'speaker_2': 'going to be over time to make sure and it may be in certain years. And I think it's assumed that the developer may have to supplement that until you get enough development to support those day one strategies. And so that we will have more detail as as Mr. Owens said about the funding, the costs and the funding'",
        "'speaker_2': '. But there will at no point will the General Fund be responsible for paying for anything.'",
        "'speaker_9': 'And just kind of flipping back and forth from the 16th. Our budget meeting and the 29th, our next budget meeting, will these be city employees who are doing this? So will these revenues keep pace with the PERS burden that those employees carry?'",
        "'speaker_9': 'Is that being worked?'",
        "'speaker_2': 'And so what we what the team plan says and some of this and right now what we have is a grant with $150,000 grant that we got from MTC to actually hire experts. The woman who set up the Mary Emery go round and Emeryville is actually acting as an expert along with another transportation firm, Fair Peers, and'",
        "'speaker_2': 'they're actually helping us set up the team to get all these things figured out in place, not just for this project, but for all. Allow me to point make sure we have our policies are procedures ultimately so but so for right now though staff is working with that money and we're kind of working with them because it'",
        "'speaker_2': 'may not make sense right from day one to create a TMA without any development and have bylaws of some organization. Ultimately, there will be an organization, will be an independent organization and have bylaws and and it will have its own staff that will be the transportation coordinator, presumably would.'",
        "'speaker_8': 'Would be would work.'",
        "'speaker_2': 'For would be part of that TMA and so it would be a separate organization. In the beginning we've got to be a little flexible again as because we're trying we have this grant right now to pay for it, but over those next three years, we'll see it.'",
        "'speaker_2': 'Will city staff be playing some role for a period of time? Yes, but over time it's going to transition to an independent organization to run that. We don't anticipate hiring any new staff to help us with this effort.'",
        "'speaker_2': 'We're trying to use this MTC grant now and then. We're hoping when there's enough revenue to support the budget and the developments going forward that you'll have the transportation coordinator that they're funding through their fees that then takes over that role and those issues so that we'll have a plan for kind of phasing out of this grant'",
        "'speaker_2': 'to to staff funded through the TMA. We're going to have to be a little flexible about that because the timing may not be perfect, and we're going to have to work that out to see how fast this goes, how it all works out.'",
        "'speaker_2': 'And so we're just trying to be nimble. So I'm going to let Phil answer your question about the day. I mean, the day one.'",
        "'speaker_3': 'Sorry. Could you repeat.'",
        "'speaker_10': 'It?'",
        "'speaker_8': 'First time apologize for vice mayor was I was not sure that your question answered. So I didn't mean to step on your toes and interrupt. Apologize. It was. Is this team going to be in place in day one, phase zero, or is this something you're going to roll out as we get more units?'",
        "'speaker_10': 'I think the expectation that a large that that a large portion of this program would be in place on day one. So certainly the shuttle service would be there on day one. You know, the scale of each of the programs and exactly how it's implemented, depending on the tenant mix and number of employees you have, you know'",
        "'speaker_10': ', there's a lot of variation within each of the within each of these different strategies. So to say what exactly of the of of any number of the strategies is, is there on day one? It's a little hard to pinpoint, but certainly the infrastructure, the framework for the program and the ability for the TMA and the different staff'",
        "'speaker_10': 'to immediately liaise with the residents and with the employees is going to be there on day one.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_10': 'Now. That was all I had. Unless I'm open for unavailable for questions as much as you like.'",
        "'speaker_0': 'Are there other speakers? Here. Does that complete the presentation? All right. So, Counsel, did you want to ask questions on the speaker before we move on? All right. We'll continue with our next speaker, Mr. Ernst.'",
        "'speaker_7': 'Good evening. So, Mayor Spencer, members of the council, I'm Joe Ernst with Alameda Point Partners. Glad to have the opportunity to. That's it. Yep. Glad to have the opportunity tonight to talk to you about our commercial and retail strategy.'",
        "'speaker_7': 'You'll hear from both me on the commercial side and Pam White with Madison Marquette. You know, as we developed our strategy for this project, again, we focused heavily on the mixed use, both, you know, from the precise plan.'",
        "'speaker_7': 'And, you know, as a result of our own experience, we focused heavily on what's there, you know, and what would be a logical next step. You know, what's happening in Alameda Point today, both the scale and compatibility with the side project, the market, what's happening outside of Alameda in our East Bay and San Francisco markets, you know'",
        "'speaker_7': ', we're very active in our local markets. So we have a good take on on what's happening there. But we really believe that the retail and the commercial is going to go a long way, if not, you know, be the lead here role take the lead role in defining the place, defining the culture at site A and the'",
        "'speaker_7': 'strategy here in you know, our opinion is it's as important about jobs and services and amenities, etc. as it is about creating those same services and amenities that will support business growth elsewhere at the base. You know, at this early stage, I'm going to spend a little more time talking about kind of the the foundation for the'",
        "'speaker_7': 'strategy, the what's behind it, as opposed to, you know, specific companies and uses. You know, the core of the strategy across these many different uses is really going to be, you know, what we've talked about in the past, the, you know, the creativity, the maker, you know, specialty manufacturing, you know, even, you know, think about entrepreneurship, you'",
        "'speaker_7': 'know, and entrepreneurship really as a job creation strategy. There'll be art, design, engineering, the retail is going to be destination. It's going to be neighborhood. It's it's not formula. On this slide, this here shows the locations of the various commercial uses.'",
        "'speaker_7': 'The red the pink that you see are primarily our retail uses focused around kind of the critical mass, the central core of the project. You can see that in phase two. We we have plans for a hotel. We've already seen a lot of interest.'",
        "'speaker_7': 'And we think as the project grows and develops, that that interest will continue to increase. We've certainly heard from a lot of businesses at the point that they would like to see a hotel. And then, of course, up on Tower Avenue in the existing buildings, 117 118 this will be our creator maker hub, the production area.'",
        "'speaker_7': 'You know, these, you know, again, as we talked, you know, these are going to be, you know, I think a very high value add. You know, we're going to have our retail and our commercial strategies are going to be very closely aligned.'",
        "'speaker_7': 'You know, there'll be jobs and sales, you know, occurring in the same facilities. These will be local, but also Internet sales here located in this. And the focus here will be a broader job base. You know, we think it's going to be better at creating a sustainable, durable jobs base by focusing on companies that say ten companies'",
        "'speaker_7': 'with ten employees versus the one company with 100 employees. You know, again, what's really motivating changes in the market and how we think about workforce, workplace business, places of business is, you know, this new generation workplace district and this has really become the basis of what we've seen in many precise plans.'",
        "'speaker_7': 'Our neighbor, San Leandro commissioned a large study on this and has really focused a lot of their recruitment strategy around this. But the nature of it is a very tight mixed use where, you know, each of these three functions you see on the screen are really dependent on one another.'",
        "'speaker_7': 'And we saw this in Oakland, too, and how the downtown in the uptown area is really taking hold. You know, the housing came in and brought people that led to amenities, services and transit. And now as a result of that, you know, jobs are really coming into the area and good jobs, good quality jobs.'",
        "'speaker_7': 'So, again, you know, the workforce that the workplace district today is really and what facilities decision makers are looking for are very mixed use communities. And so that really is fine. You know, a part of the basis of our strategy, you know, this it's a little dark this here really, you know, I don't think any of this'",
        "'speaker_7': 'is necessarily earth shattering, but I think it's all things we have to think of as a whole and how. Things have changed, you know, from the late 20th century to now as we think about, you know, the economic development strategy for both city and for Alameda Point, you know, in the late, you know, in the in the'",
        "'speaker_7': 'eighties nineties, you know, we were still focused on mass production, low cost, and that is clearly moved to more to specialty production. Economic development strategies were really focused on attracting big, vertically integrated companies. But I think what's really important and what we're seeing clearly a lot of today, particular in the Bay Area, is the building of business'",
        "'speaker_7': 'ecosystems, you know, supply chains, spaces that truly promote collaboration, networked clusters. And, you know, one of my experiences when we did the Pixar campus way back when, you know, Steve Jobs was very visionary on this and he was really about collaboration and for end creating spaces that forced collaboration.'",
        "'speaker_7': 'And that place was set up to force people to get out of their offices, force people to get together and run together. And and that's really what we're seeing, you know, now in the workplace, suburban commuting, you know, this goes to the heart of some of our traffic issues with CBD, central business district, you know, outside of'",
        "'speaker_7': 'the central business district, you know, downtowns, you know, we've seen, you know, traditionally, you know, the big separation of workplaces and living spaces. And now we're seeing much more of that come together. Mixed uses, complete communities. And traditionally, you know, buildings and real estate, you know, places for machines about infrastructure.'",
        "'speaker_7': 'And now places are really being designed. The communities, again, the amenities, you know, for engagement, for emphasis on traction of people. Just a few notes here. You know, again, you know, the makers, you know, this can be across many different companies, you know, metals, food and beverage.'",
        "'speaker_7': 'Clearly, I think a strong opportunity for us at the point energy, you know, with some of the companies. Again, we have at the point in Alameda Municipal Power Apparel, Wood Craft, 3D printing design, engineering companies. But, you know, these all are not necessarily technology companies, but technology has made this work environment what it is.'",
        "'speaker_7': 'These will be smaller companies, you know, with a variety of shared spaces, shared resources, tenant spaces ranging from 500 to up, you know, on up to 10,000 square feet. You know, and then, you know, some of our local inspiration for this, you know, these are things right in our own market.'",
        "'speaker_7': 'Very, you know, strong job generators, cradle to scale, you know, the American Industrial Center in Dogpatch in San Francisco. It's just a wide variety of small companies and spinning off a lot of great jobs. The active space program where, you know, can at least makerspace San Leandro has created the gate, you know, again, for a wide variety'",
        "'speaker_7': 'of uses, you know, Oakland makers, tech shop, which spawned, you know, a national focus on R&D. And again, this is a big part of the movement. And I think just lastly, you know, I think you're going to hear this, too, from Pam and Madison.'",
        "'speaker_7': 'Marquette, you know, how to execute this strategy, I think, is really, you know, having a clear vision. This is about environment. This is not just offering real estate. This is creating an environment. It's it's offering services. It's marketing the program and not just the space.'",
        "'speaker_7': 'It's and it's not, you know, just hiring a broker and putting up a sign. It's very active ownership. It's local relationships, which this team clearly has. And it's, again, discipline and execution for this plan to be successful. But I think this will, again, create a good foundation for job creation at Alameda Point.'",
        "'speaker_7': 'And so with that, I'd like to hand it over to Pam White to talk about our retail strategy.'",
        "'speaker_2': 'First time here. So you have to excuse me if I'm. Which one's.'",
        "'speaker_5': 'Oh. There you go.'",
        "'speaker_2': 'Madam Mayor, members of the city council, thank you for taking this late hour to hear this. I'll try to be brief, but Joe asked me to take out a few slides. But it was so it was so important to me to make sure I got everything in here.'",
        "'speaker_2': 'So I'm going to use a few words, but I'd like you to really pay attention to the images here, because I think that there's a story that I'm trying to tell here as I sat and thought about what are the words that come to my mind with Alameda Point, I came up with these five that are really'",
        "'speaker_2': 'important to me first as often to a city. It's a very authentic space. It feels very real to a lot of folks who have been there for many, many years. It's got great fabric. There is a tremendous sense of pride.'",
        "'speaker_2': 'That's both at Alameda Point and within the city itself. There's a tremendous history and yet there's great opportunity that that we can all hope to have happen here. The first few slides are some of the images of the buildings that we've already seen.'",
        "'speaker_2': 'You know, it's I came across the same bit of the same images of building 67 that that David you so it's kind of interesting how we're telling the same theme here but these are all existing images of the buildings that we intend to use in phase one.'",
        "'speaker_2': 'Tremendous interiors. They've got, you know, a lot of interest. And this is building 113. That's, of course, on the A Lagoon. They don't want. Take a little step back and talk a little bit about history of a couple of other projects in the Bay Area.'",
        "'speaker_2': 'I don't know. I'm sure you're all familiar with Fourth Street in Berkeley. It was fallow land and a bunch of empty buildings back in 1976 when the city of Berkeley started working on this area. And in 1976, Dennis Abrams and his partners began to work here in a craftsman homebuilding industry.'",
        "'speaker_2': 'With. With. Businesses that supported the home building. But one of the things that they built was the Four Street Grill. I remember that when I moved here was established. I moved here in 81 and I was one of the first places that we went to.'",
        "'speaker_2': 'So you look at these old images that were from that time period and look at where it came to where it is today with a tremendous range of national and local businesses that's continued to thrive over the years.'",
        "'speaker_2': 'So again, this is probably about 200,000 square feet of retail now, but it's just continued to organically evolve. And I think it starts with the vision that didn't Denny Abrams started years ago. And these are just images from a project that's continuing to evolve in Sebastopol called the Barolo.'",
        "'speaker_2': 'But I think the images are important because it's got this industrial sort of organic feel to it, I think. Again, these are things that we want to establish at Alameda Point. But I want to switch gears a little bit and talk about a project that we're have completed in Los Angeles.'",
        "'speaker_2': 'It's called a La Brea. Yes, I know. Is Los Angeles less? I know it's not Alameda. But I think, you know, the story here is there's a consistent story here to tell. We these are all existing images of the buildings that we bought, which is, again, about 100,000 square feet.'",
        "'speaker_2': 'We bought these in 2008, which is not the most opportune time to start a, you know, a retail development. But here here we go. And I want you to pay particular attention to the image in the lower left hand corner, because I'll point that out to you in a minute.'",
        "'speaker_2': 'So this was what we bought in 2008. These are some of the existing images of the buildings that we bought at that time. So now I want to talk about our approach, which I think is really key. The first thing that we do with any project is we have to come up with a vision.'",
        "'speaker_2': 'And this was actually the vision statement that was crafted 2009 or 2010, but it was established very early on, I think, and this is something that we've adhered to throughout the process. You'll see the rate of collection, the evolution cohere at destination.'",
        "'speaker_2': 'But this in this does not take one month to come up with this. This can take six months. This can take a year. But there's a lot of research and emotion that sort of goes into this. Next we establish the branding.'",
        "'speaker_2': 'And in this case, the words that we used were contemporary, understated, bespoke, which is craftsman built on heritage, eclectic and oblique. Next. There has to be a commitment and to properly attract the businesses, they have to understand and believe that you are going to follow through with your vision and your brand.'",
        "'speaker_2': 'If you don't do that, they won't believe it and they will not listen to you, you know, not commit to you at the same time. So, again, you see what we started with in 2008, and these are actual images of what's of what's occurred over time.'",
        "'speaker_2': 'The next piece is activation. Obviously in 2008 and nine, we didn't have a lot of you know, there was not a lease, a lot of leasing to be done. So we had to think about activation. We staged events.'",
        "'speaker_2': 'We engaged the arts, we engaged low local artists to paint a simple thing as a barricade. So the barricade became interesting for all the years that the buildings were under construction or renovation. In this case, we you know, Shepard Fairey was engaged to work on the corner mural.'",
        "'speaker_2': 'And that mural is still there today because we liked it so much. We started with pop ups. You know, there are some tenants who are still in the in the spaces right now that have been there since the early days.'",
        "'speaker_2': 'We'd like to move them to more permanent tenants, but pop ups were very important at that time. We engaged social media because we wanted to create a buzz and get people going to this new district. Public relations, we engage part of relations to, again, make this an attractive space.'",
        "'speaker_2': 'Lastly, we come to leasing. And so everyone always says to me, Who are you going to lease to? But leasing is it's really the last step of the process, as hard as that is for some folks, you know, for some people to understand.'",
        "'speaker_2': 'So these are images of Libya as that exist today. And the picture up in the upper left corner. That is the image that I said. Do you pay attention to that little courtyard that has become the Sycamore Kitchen, which is, you know, extremely, very vibrant restaurant.'",
        "'speaker_2': 'And these are all images from La Brea. I didn't pull in things from other projects. We also have creative office space here on the upper level. So vision, branding, commitment, activation and leasing. You know, you if we have found that if we follow these steps and generally we like to follow them in this order, though sometimes we'",
        "'speaker_2': 'get. I'm working on a project now that the branding is a little ahead of the vision, but, you know, we'll get it back in line again. And lastly, I love these images because this talks about opportunity. Now, this is this is not Alameda, but that these are this is actually in Seattle.'",
        "'speaker_2': 'But I think it will show to you what this what this area can be. And I just love these images. So I wanted to make sure I shared them. And that's so I think you can sort of see how this process falls.'",
        "'speaker_2': 'So many questions, but. Great. Thank you.'",
        "'speaker_0': 'Thank you. But we do have this at the end of the presentation.'",
        "'speaker_2': 'At the end of the presentation. All right.'",
        "'speaker_0': 'Councilmembers, do you have any questions? You have six.'",
        "'speaker_5': 'Figures.'",
        "'speaker_0': 'All right. I'm going to proceed with calling the speakers Leslie Cameron, Catherine Pauling and then Carey Thompson. And if you'd like to speak on this, please turn in your slips.'",
        "'speaker_5': 'Hello, Mayor, Vice Mayor, council members and staff. My name is Leslie Cameron and I'm co-owner of Bay Shipping Yacht Company. This month we're celebrating 21 years in Alameda. Our business is a full service shipyard. Repairs built and refurbishes commercial military vessels, superyachts and historical watercraft.'",
        "'speaker_5': 'I'm also on the board of directors for the Alameda Chamber of Commerce and the working waterfront cohort. When we first arrived in Alameda, Vice Mayor Matarese was a champion for holding town hall meetings to educate folks about the Tidelands lease issues.'",
        "'speaker_5': 'Since then, we did negotiate a lease that will allow us to operate here for 66 years. And as you may know, we also recently purchased the Alameda Gateway property where Rosenbloom used to be. We are landlords now, too.'",
        "'speaker_5': 'We employ about 350 to 400 employees here in Alameda, but yet only about 10% of them actually live here on the island. It's hard for them to find affordable housing. Actually, I think they all would wish to live and work here if they could.'",
        "'speaker_5': 'We are also a green employer. Our employees are issued bikes and many bike to work. We invest in the state of the art systems for our shipyard and we've been the recipient of many government grants. With more in the works.'",
        "'speaker_5': 'I personally reviewed the plan for the redevelopment site A and I think this plan is very cool and needed since it's been eight years since the Navy left. I don't live at an island on the island, so I don't always get involved in some of these topics.'",
        "'speaker_5': 'But this issue actually really moves me and I do spend a lot of time here in Alameda. And objectively speaking, I believe this is a great plan and I'll tell you why. BAY Shipping needs affordable housing for all the folks we put here to work.'",
        "'speaker_5': 'They need to be able to walk and bike to work. It's good exercise. It's good city planning, and it makes sense. And it's what this generation is doing. Site is designed for this generation. My son Max is pushing 20 and he actually thinks that driving a car is not cool.'",
        "'speaker_5': 'The plan is designed to cut down on traffic by offering transit alternatives like shuttles and bus passes, carpooling, car sharing. And this developer will put in a new ferry terminal, which we really need. And also, maybe most importantly, this for the safety and sustainability of Alameda Point.'",
        "'speaker_5': 'The developer will put in a water main. And frankly, the status quo is is a little bit scary for us. They will also improve all the other infrastructures like utilities, communications, sewer, etc.. And I'll just end here by saying we have hundreds of people that come to visit as customers.'",
        "'speaker_5': 'And if we made it easy for them, I'm sure they would love to spend their money here in Alameda, the amenities, the retail shops, the dining and the hotel. We all use our customers and our hundreds of employees.'",
        "'speaker_5': 'Let's have them spend our their money in Alameda. I believe that this project is the time is now. And as the largest employer at Alameda Point, I want to improve the safety of the site and explore its untapped potential.'",
        "'speaker_5': 'I urge this Council to do the right thing. Some of US citizens and staff that have been building this for a very, very long time and we did a tremendous amount of community input already. I urge you to adopt, develop, to develop this this plan with this developer and let's refine it together.'",
        "'speaker_5': 'Allow Alameda to set the stage for the 21st century green city planning as a model for the whole Bay Area. We have an opportunity to do something really great here. Please let us help it to be safe and to move forward.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Kathryn Pauling and then Kari Thompson.'",
        "'speaker_2': 'Though not a mayor council staff. I'm I'm nervous. I'm Catherine Pawling. I'm a renter here in Alameda. Eight years ago, I became legal guardian of my grandchildren. I was in the Richmond Marina with a wonderful waterfront view and a much, much cheaper rent.'",
        "'speaker_2': 'But I came here for the community, for the schools, for everything that's wonderful. And the children recognize Alameda as home. It's developments like this with a very large share of affordable housing. That gives me a bit of hope, because right now, even though as renters, we are half the city, we live in constant fear.'",
        "'speaker_2': 'Rents have gone up 50% in just the last two years, although my landlord has been reasonable. Just last week, when I asked for reimbursement for a plumbing expense, she pointed out she could charge a thousand more for a three bedroom apartment.'",
        "'speaker_2': 'And she's right. But a 30 day notice for that kind of rent increase would basically be an eviction. There is simply no way I could do that. Also, I'm Mr. Daza. I would like to personally thank you for being a numbers wonk.'",
        "'speaker_0': 'And.'",
        "'speaker_2': 'Actually going and mining the census data on the city of Alameda. The fact that.'",
        "'speaker_1': 'Property owners.'",
        "'speaker_2': 'Had their incomes increase, but renters and Alameda have lost income. I retired this year, so that has been definitely an adjustment is a reality that this is something which impacts half of your half of your people. And we look to you for these kinds of developments in this kind of consciousness of having affordable housing continue to be'",
        "'speaker_2': 'a piece of it. There are opportunities with converting industrial sites and the base to be able to have these pieces and solve the transportation and the all the attendant issues. But we rely on it as a renter here.'",
        "'speaker_2': 'It's like living in the Wild West. Not only are there dramatic rent increases, but they're tagging on new. A friend is having a water charge, added. She's going to be billed $60 a month, even though she has no garden to water, no washing machine or personal dryer.'",
        "'speaker_2': 'It's really going unchecked. And I know you're doing data collection on these issues. I want to support this project. I want you to look closely and wherever you can, please, please add affordable housing components for low income and low medium the various the various levels.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Carrie Thompson and then Christopher Seewald.'",
        "'speaker_5': 'Good evening.'",
        "'speaker_2': 'Everyone. Thank you so much. My name is Kerry Thompson. I am also with the Chamber of Commerce. I'm also a lifelong resident here in Alameda and work here. And I'm fortunate that I do have to commute. I'm sorry I have to go across a bridge.'",
        "'speaker_2': 'I have to go across the Bay Farm Bridge.'",
        "'speaker_5': 'But I do kind of have to commute.'",
        "'speaker_2': 'But if I could, I really would bike. But first of all, I want to thank the city council and the staff for your efforts to make sure that this project is a really great project. Because, you know, every time you guys make a comment, I notice that this team takes it to heart and they really try very'",
        "'speaker_2': 'hard to incorporate whatever comments come. Whether or not I might think it may be not reasonable. They really do listen and try to their best to work with everyone and I really appreciate that about them. This project is laying a really good foundation for further development.'",
        "'speaker_2': 'Alameda Point Site A is to me a cornerstone of the future actually of Alameda as far as economic development, affordable housing and jobs. I mean, this project is bringing jobs to Alameda. And as we know, commercial developers are not willing to provide the infrastructure needed for other projects without city funding.'",
        "'speaker_2': 'So this project is laying that infrastructure at their own cost without touching the city funds, which is just amazing to me. And I think it also provides a boost to future site development at Alameda Point, which we all know is necessary.'",
        "'speaker_2': 'It's going to happen. It needs to happen. And I really again, I appreciate the willingness of the Alameda Point Partners team to listen and incorporate the con the comments into the the project. And it shows their commitment to Alameda and their willingness to make this an outstanding project.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Christopher. And then Michael McDonagh. And then Helen's off.'",
        "'speaker_8': 'Mayor Council staff. My name is Christopher Seewald. I'm a Alameddine of 26 years. Barely long enough to savor sales either. I'm also a business owner.'",
        "'speaker_9': 'Here in Alameda. I employ people here. I'm a developer and a somewhat hapless restaurateur. I'm here to.'",
        "'speaker_8': 'Review a petition of Alameda business leaders.'",
        "'speaker_9': 'Hopefully somewhat dramatically. And we'll get past this.'",
        "'speaker_8': 'Dear Mayor and city council. We represent some of the larger employers currently operating in Alameda. One of the many attributes that attracted us to locate on the island is the promise of desirable housing and recreation for our employees.'",
        "'speaker_8': 'An attractive environment for jobs. We call upon you to fulfill this promise. Collectively, we employ thousands of people, many of whom commute, commute on and off the island each day. Our employees work hard and play hard and prefer to rent or own in Alameda.'",
        "'speaker_8': 'However, the persistent housing shortage, lack of mid-size apartment rentals and rising costs create obstacles.'",
        "'speaker_9': 'And present a recruiting and retention.'",
        "'speaker_8': 'Challenge for local businesses. The city is presented with a real opportunity to attract quality commercial tenants with plans to redevelop the former naval base. Most employers are no longer looking to fill large office parks and force employee and force employees into long commutes.'",
        "'speaker_8': 'Corporate campuses. The site plan will attract commercial businesses in the technology and new economy sectors. But to start up or relocate.'",
        "'speaker_9': 'Here and to recruit and retain a durable.'",
        "'speaker_8': 'Workforce, they need a community to support them. This includes infrastructure, capital facilities, a collaborative culture and places to live. Plans for two thirds rental housing, workforce housing.'",
        "'speaker_9': 'Including a quarter.'",
        "'speaker_8': 'Of affordable units, are part of this business ecosystem. Housing employees near their workplaces will also alleviate rush hour traffic in the tube and on our bridges. A new ferry terminal bus, rapid transit and bike path are also part of this network.'",
        "'speaker_8': 'Artisan dining and retail parks and recreation complete the community. Without an interconnected system, we cannot grow or sustain jobs. Sight as a catalyst for jobs.'",
        "'speaker_9': 'Generation at Alameda Point.'",
        "'speaker_8': 'There is a reason Alameda is considered one of the most sought after places to live in the country. It is also one of the best places to work by joining in this public private partnership. Alameda can model the success of other cities have had planned for a thoughtful mix of housing near workspaces, creating a sense of place'",
        "'speaker_8': 'for employees seeking to improve their lifestyle by living closer to where they work. This is signed by over 140 people in the last two weeks.'",
        "'speaker_9': 'Including Brad Shook of the.'",
        "'speaker_8': 'Palladium, Leslie Cameron of Bay, Ship and Yacht, Rob Dowd, Mike Hester and Brooke.'",
        "'speaker_9': 'Brockman, Grant of McGuire and Hester. Kate Pryor of Tucker's.'",
        "'speaker_8': 'Dennis Pagonis and Rich Creeks of Harbor Bay Realty. Patty Pierce of V.F. Outdoors. Mark Sorensen of the Alameda Chamber of Commerce. Doug Biggs of the Alameda Point Collective.'",
        "'speaker_9': 'And myself. I'm going to go a little off script here.'",
        "'speaker_8': 'And say that just because 140 odd people say something doesn't necessarily make it true. But I would point out that many of these people, most of them both live and work in Alameda.'",
        "'speaker_9': 'So they are pretty much walking the walk.'",
        "'speaker_7': 'Of.'",
        "'speaker_8': 'The talk. They talk and and for my part, the reason that I employ people in Alameda and do redevelopment on Park Street and run somewhat haphazardly, a cafe is not because just because when I was 25, I found a job in Alameda, but because when I was 27, I was able to move here.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_0': 'Michael McDonagh, then Helen Source.'",
        "'speaker_3': 'Good evening, madam mayor and the council and staff Michael McDonough from i'm president of the Alameda Chamber of Commerce. And you know, what I have to say really repeats a lot about what what some of the other people have said.'",
        "'speaker_10': 'What I what I also want to say is today I did a speech at Argosy University, which we're proud to call the San Francisco campus of Argosy University.'",
        "'speaker_3': 'Is home right here in Alameda. And I told them at that time that Alameda. Is on the verge. Speaking mostly of Alameda Point is on the verge of becoming a a thriving hub of.'",
        "'speaker_10': 'Business.'",
        "'speaker_3': 'To high tech, to green tech and many other sectors that are looking to relocate to.'",
        "'speaker_9': 'Alameda Point.'",
        "'speaker_3': 'And we have the opportunity here to develop a thriving business ecosystem.'",
        "'speaker_10': 'I loved it that.'",
        "'speaker_3': 'Joe had that in his presentation. It's something I've been saying. This ecosystem can attract capital, and we've talked about the creation of jobs, but really raised the standard of living for all Alamitos by accepting this proposal from facility.'",
        "'speaker_3': 'But, you know, this is what the city project or this Alameda point really is one of the most desirable pieces of property in the entire Bay Area. But really, we cannot let it fulfill its its potential unless we get the infrastructure required to do so in this site.'",
        "'speaker_3': 'A plan will bring that infrastructure to not only attract those businesses and that capital and create those jobs, but to keep the existing companies that are out there and businesses that are out there, for instance, out there at the very end of the point at Monarch Street, they don't have any streetlights.'",
        "'speaker_3': 'They really want streetlights out there. But there's no money for that that to happen unless we have a better infrastructure. And this site, a plan is what can provide the infrastructure for, again, not only attracting new businesses, but providing the existing businesses out there with their badly needed facilities as well.'",
        "'speaker_3': 'And I went on to talk to the Alameda to the Argosy University people about the fact that this this project, as we'll all benefit from it, we'll all enjoy it. But really, it's being built for another generation. It's being built for the millennials.'",
        "'speaker_3': 'And these millennials have grown up with different values than we have. We heard them talk about how the young people don't want to drive cars. They want to ride bikes.'",
        "'speaker_10': 'It's so true.'",
        "'speaker_3': 'They want to live near where they work. They want to ride their bike to work. They want to ride their bike to school. They want to be able to have activities like the water activities that we'll have at the point right in their own neighborhoods.'",
        "'speaker_3': 'They want to make an impact in their own community. They're very technology savvy. They're very environmental savvy. They really want to be around hubs of innovation and and and green energy hubs. You know, Alameda is known for that.'",
        "'speaker_3': 'And I just want to urge you to to really take a look at all the benefits we'll get from this project. And in the end, when it comes time for approval to think about the good, because as the president of the Chamber of Commerce.'",
        "'speaker_10': 'I can say that this project is not only good for business.'",
        "'speaker_3': 'But it's good for Alameda and.'",
        "'speaker_10': 'It should be passed.'",
        "'speaker_0': 'Here along source and then William Smith.'",
        "'speaker_2': 'I really appreciate the comprehensive report we've had tonight. It's been well thought out in all aspects and will certainly jump start Alameda Points Development. This really begins fulfilling the plans and hopes of Olympians that have gone on for over 20 years, which culminated in the Base for use plan adopted in the mid-nineties.'",
        "'speaker_2': 'That plan was formed by the community and reflecting goals that came out of dozens of community meetings. We also worked with a talented consultant. So it was based on factual, practical ideas, all of which have evolved in the last 20 years to a new generation that have traded in their car keys for clipper cards.'",
        "'speaker_2': 'And that's a good thing. But the plan was envisioned to be a new neighborhood with a mixture of uses reflecting planning, excellence and provided development of homes for all incomes. And to provide jobs, good transit and public amenities.'",
        "'speaker_2': 'This plan has it all. It would be also a good economic engine, beneficial from the development itself. And now, after the recent recession, even more important is the rest of the story. This development is a major gift to the social and economic development benefits for decades to come and will benefit Alameda so much.'",
        "'speaker_2': 'Over time. I know that night the focus was on the physical, the trance, all of which are critical. But it also necessitates really looking at what a benefit it's going to provide in the years to come. It would be interesting to see how those economical aspects are quantified over time.'",
        "'speaker_2': 'All of the jobs, all of the taxes people pay, all the money they spend in shops, all of those things. It would be interesting to quantify that. So again, thanks to the developer and the Council for presenting this excellent educational opportunity for the communion community.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'You. William Smith appears to have left. All right. So next is Laura Thomas and then Ron Silverstein. And that's the last clip I have. If there's any other speakers, please turn on your slips.'",
        "'speaker_2': 'Good evening. Laura Thomas Renewed Hope. Housing advocates and the other speakers have spoken so, so well about all the reasons why this city plan keeps getting more and more exciting. So I'm probably just going to go into my usual reminder about how important housing is.'",
        "'speaker_2': 'It really is an ecosystem. Has Mike McDonough said. And I'm really very excited about the way Joe Lawrence described it as a new generation workplace district, because I think the key thing here is it's something we've never seen before.'",
        "'speaker_2': 'And I've always felt like Alameda Point was going to be almeida's chance to show the Bay Area how how innovative we can be. And Joe Lawrence is giving us that chance to do that. I really think it would.'",
        "'speaker_2': 'You know, it's it is very contingent on the housing. You know, we've seen commercial industrial research, research, development, parks all over the Bay Area without housing around them. And they're just really pretty gloomy places. They're places where people are cocooned during the day and at night and over the weekend, they become deathly still environments that nobody ever'",
        "'speaker_2': 'wants to be near. And I would hate to see I mean, I hate to see Alameda Point turn into that. And so the the 20, you know, it really is a 21st century concept. The 20th century concept, which we've lived in all along, is very dependent on cars and suburbs and separation of uses.'",
        "'speaker_2': 'And we're in the 21st century and our children are going to grow up in this century. And they're they're the people we're really doing this for. I think we have to remember getting back to housing. You know. It's going to make the point successful.'",
        "'speaker_2': 'We're getting a pretty big chunk of affordable housing and we're getting it because Renewed Hope sued the city back in 2000. That's why it's 25% and not the normal 15%. And developer has not complained. They've stepped right up and said they're going to do it.'",
        "'speaker_2': 'All of us, advocates and citizens, have been waiting over a decade for our city leaders to step up and get it done with a reputable developer. The affordable housing will come out of the profit from the market rate housing just like all the other benefits that are going to.'",
        "'speaker_2': 'Come out of this development. There's going to be a large number of affordable units, both family and seniors, which will simply not come out of any other sources. I think that's I have to remind you all of that, that the idea that we can build affordable housing out of other other sources is a little imaginary because it's'",
        "'speaker_2': 'basically vanquished redevelopment, extremely competitive tax credits, and just maybe a little glimmer of hope of new funding at the state level. So if we truly want this affordable housing, this is this is the moment. So we either get it with Joe EARNEST and this development or I think we kiss it goodbye for a while, at least on'",
        "'speaker_2': 'Alameda point. And I'll I'll stop with that. Thank you very much, Ron.'",
        "'speaker_0': 'And he's our last speaker, unless anyone else has the slip.'",
        "'speaker_8': 'The mayor and city council members and staff. I'm Ron Silberstein. I have the enviable position of being the last one to speak. I won't put anyone to sleep. I just I just want to reiterate my support for the the plan for the city development, as has put forth to you today.'",
        "'speaker_8': 'I'm an Alameda resident.'",
        "'speaker_9': 'My children go to school here.'",
        "'speaker_8': 'I would be I think that Alameda has a really unique opportunity in this particular development. It has all the components as everyone's expressed. I'm not adding anything new, but it's got the critical and very needed housing needs. The transportation is extremely well thought out.'",
        "'speaker_8': 'That's a very important element, especially its links to public transportation. I'll be using all the bike lanes, no doubt. The commercial component is super exciting. I have a lot of friends and colleagues who are.'",
        "'speaker_7': 'Already out at Alameda.'",
        "'speaker_8': 'Point. Some of the businesses there in particular on Spirit Alley. And I know just everyone's super excited about this coming out there. So the the less critical element is the kind of infrastructure this is going to bring out there.'",
        "'speaker_8': 'It's just going to allow even more creative and.'",
        "'speaker_7': 'Innovative businesses to to be.'",
        "'speaker_8': 'Out there. And also a place where I very much would love to open my next business.'",
        "'speaker_7': 'So I just encourage everyone to. To support this. Thank you.'",
        "'speaker_0': 'Thank you. All right. No more. No other speaker. Okay. So before 1030, we have two more items after this one, six H and 9 a.m. to consider those, we would need a motion with four affirmative votes. I'll second all those in favor.'",
        "'speaker_5': 'I.'",
        "'speaker_8': 'No.'",
        "'speaker_0': 'I will also vote no then.'",
        "'speaker_3': 'Hmm.'",
        "'speaker_0': 'So three, two.'",
        "'speaker_2': 'Four seats for both states.'",
        "'speaker_0': 'But then it fails for lack of a votes.'",
        "'speaker_6': 'What if we have?'",
        "'speaker_8': 'By 11:00.'",
        "'speaker_2': 'So that.'",
        "'speaker_0': 'Motion failed. Okay. Let's continue now with Council of Comments.'",
        "'speaker_6': 'I'll make a comment. So thank you to all the speakers and presenters. Pam White of Madison Market. I think you get my prize for the evening for. Really? I'm glad you didn't let Jo correct any of your slides, because that was that was really very exciting and innovative, especially the library presentation and also to Phil Olmsted of'",
        "'speaker_6': 'Nelson Nygaard. I spent a lot of time reading about the transportation demand management program, the Transportation Management Association. And if I get all those acronyms right and something that struck me in reading through and this was again in exhibit five is so there is a.'",
        "'speaker_6': 'A really nice description if anybody wants to go back and read it. Exhibit five on page 29. It talks about what Nike we all know. Nike, you know, just do it the swoosh. And so they're located in Oregon and they have put together a very impressive team plan for their employees in in Oregon and among other things'",
        "'speaker_6': ', and I won't go through all the bullets, but they have introduced an incentive based program giving away prizes and Nike bike vouchers. Get it? The Nike cafeteria, Nike's stores, they had an onsite employer transportation coordinator. Nike helps subsidize the cost of annual bus rail passes, promoted carpooling through the use of an in-house rideshare.'",
        "'speaker_6': 'All Passholders were eligible for the Guaranteed Ride Home program that we'd be looking at here too. Administered by local transit authority, allowed employees flex time so they could come to work at different times, not necessarily clog the transportation infrastructure only at rush hour.'",
        "'speaker_6': 'Bicycle commuters had lots of amenities, access to Nike's to fitness centers, use of showers and the locker room. I could go on, but the thing that you really should know about this is they did this in 1996 in response to the state of Oregon.'",
        "'speaker_6': 'Department of Environmental Quality is establishment of a commute trip reduction mandate aimed at employers. So we're not exactly on the cutting edge. But that said, this is and I think it was brought out earlier, this is the the first major comprehensive team plan to be implemented in Alameda.'",
        "'speaker_6': 'If obviously, if we go forward with with the plans for site A and that just goes to the point brought out on page 53 that the plan does need to be flexible because again, this is a case of first impression for you lawyers in the room that in the initial phases of development at Alameda Point, it says'",
        "'speaker_6': 'on page 53, the characteristics of the employers, the employees and residents attracted to Alameda Point are not yet fully understood yet and not fully understood yet. So the TMA services and programs may not precisely match the needs of new employees and residents, and therefore there will need to be this and this flexibility.'",
        "'speaker_6': 'And and I think, you know, those are all things that we can really aspire to. And just lastly, I also liked the fact that on the last page it page 82 of 82 pages of this particular exhibit was a great list of examples of residential specific transportation demand strategies.'",
        "'speaker_6': 'So we think a lot about getting employees out of their cars and getting to getting to their work using public transit. But there's also ways that can be built into a new development like Friday, where you can actually get residents out of their cars for those mid-day trips, in weekend trips and getting the kids to school.'",
        "'speaker_6': 'And there's a whole list of strategies here. And I just come in command everyone's city staff. Jennifer, you've done an awesome job and we've been able we've been very fortunate to have some good grant money to help us get the plans in place.'",
        "'speaker_6': 'And so thank you for keeping us so well informed along the way and look forward to doing more together. Thank you.'",
        "'speaker_2': 'Speaker.'",
        "'speaker_0': 'Member. I remember the.'",
        "'speaker_7': 'Raid. Well, thank you very much. Let me just start off with a comment that I pieced together in light of the comments raised tonight by the residents and by the present presenters. If they are if the breathtaking views of San Francisco, the fact of Spirit's Alley and Antiques by the Bay suggest anything.'",
        "'speaker_7': 'It's that there is a budding funky coldness to Alameda point. And everything that Joe Ernst and Pam White and the Alameda Partners team members said tonight. With their emphasis on craft artisanal economy. Everything that they said tonight burnishes that funky coolness even more.'",
        "'speaker_7': 'As a chamber president. Mike McDougal said, this project is being built for the millennials and I might add, the male, the millennial minded as well. But even more, the ideas discussed tonight by all of Alameda partner team members need to be understood against the backdrop of the Great Recession.'",
        "'speaker_7': 'Which revealed in tragic ways the economically and socially unsustainable, sustainable ways of Wall Street, with its emphasis on suburban style communities, oversupply of national chain, real retail, as well as oversupply of office parks going long vacant. So with pass delay, with the ideas that you saw tonight.'",
        "'speaker_7': 'I believe we're designing a site a primarily is a human scale and not necessarily though obviously we'll need we'll need them not necessarily to Wall Street investors in mind. I think the great thing about what we saw, not just tonight, but over the course of the past several weeks and months, was this incredible progression.'",
        "'speaker_7': 'I mean, starting many, many years ago when you looked at plans put forward by. AP ZB in the early 2000, subsequently by Roma Design in 2005, and then subsequently by son Karl. You really saw kind of your typical suburban type of product with this emphasis on single family homes, with this emphasis on.'",
        "'speaker_7': 'Demolishing sites as opposed to reusing sites with an emphasis on kind of a business park. And I think, you know, where things started to turn. I think let's not forget, was that the city of Alameda staff began kind of the next steps forward.'",
        "'speaker_7': 'I remember back in 2010 or so when they began kind of had this discussion about. And a more sustainable ways of looking at Alameda Point. And then pushing that even further. We had the swim plan, which the hallmark to me, the hallmark of the SOCOM plan was kind of providing the broad contours vision for Alameda Point.'",
        "'speaker_7': 'Again, kind of emphasizing on reusing, emphasizing on finding ways to create a sole for the place. And I think with the work of Alameda Partners tonight, I think they really fleshed out the details that was revealed and they saw when plan and in ways that I think a lot of us will be proud.'",
        "'speaker_7': 'With this emphasis on, you know, the type of housing that that is aligned with the needs of businesses here. And more importantly, aligned with potentially the needs not just of the workers, but with the community struggling with our housing supply issues.'",
        "'speaker_7': 'And I think for me, the biggest takeaway maybe I don't want to overemphasize this, but, you know, to see that bullet point that says that we're going to have a 15 minute headway. Now, I know many maybe think not many people are thinking, who cares?'",
        "'speaker_7': '15 minute shuttle headway. Well, to me, that says that's a lot, because, you know, the other projects that we've seen, you know, they're coming in with a shuttle coming by once every 30 minutes. It might work if you're there when that once every 30 minute shuttle comes.'",
        "'speaker_7': 'But now, if we within our agreement, if we have a shuttle agreement that says once every 15 minutes. To the extent that it proves itself. I think that the possibility of going to once every 10 minutes is strong without overstating the case.'",
        "'speaker_7': 'But at least we're starting with something that's more that that's possible. So so I really appreciate seeing that because to me. We've taken a concept channel and now we've put in an implementation aspect to it a shuttle that goes once every 15 minutes.'",
        "'speaker_7': 'So I think that I know we were warned not to focus on one thing. I just did. There will be other things that we still need to discuss, though, within the context of the shuttle. I mean, for example, one of the things that's indicated is that in the supplemental report, Exhibit five supplemental, there's reference to that the'",
        "'speaker_7': 'shuttle would only operate within Alameda Point. We need to talk about that and. No. But I think you know what we have. There's a lot to work with. And really taking us in the right direction. And I do want to second what former chamber president Harry Thompson said, that this was a process, this was kind of an'",
        "'speaker_7': 'iterative process where we raised concerns and then the developers then came back and said, okay, well, let's try to meet these concerns. Now, I think what we next steps really is to flesh out the business detail and part of this.'",
        "'speaker_7': 'I mean, there will be a substantial part investment on the part of Alameda. But I think when you look at the project itself and its impacts, I think we've got a lot to believe that the returns from the project itself warrant, you know, at least a first hurdle saying, okay, this, this, this, this looks good.'",
        "'speaker_7': 'But then the other types of returns that we might think about in terms of like whatever community facilities where we were interested in in those, too. I mean, there's some positive things out that that that might come out.'",
        "'speaker_7': 'You know, the details will come out in that when we start discussing the DDA for sure. But. And I like what I heard tonight. You know, I think, you know, the concerns that I raised about, well, proximity to the water, you know, the building 13.'",
        "'speaker_7': 'Well, they flush that out so we can physically see. Okay, I get it. I understand there are still other points that that we will need to work out. Like I said, like the the shuttle, how much how often does it stop outside of Alameda point?'",
        "'speaker_7': 'I mean, maybe there are good reasons for it not to. I understand that there and there was one or two or three other things, but I'll have to send that via email. I just can't find it in my notes right now.'",
        "'speaker_7': 'Well, thank you.'",
        "'speaker_0': 'Member.'",
        "'speaker_8': 'Thank you, Madam Mayor. I just want to thank the folks who came out from the public to speak on this. I think this is is the third meeting we've had. And I still think I haven't heard a speaker from the public speak against this.'",
        "'speaker_8': 'So. If you're waiting to the last minute, it'd probably be better to kind of ring your concerns now at these meetings because has you seen the developer is very amenable to listening to the concerns of the community and adapting and adjusting.'",
        "'speaker_8': 'And I do want to just say to Tim, is that the work you do on this is amazing. I mean, to get to where we are today, every day the pictures look prettier. So I'll talk about that in a second.'",
        "'speaker_8': 'But just to see, you know, the community engagement, the level of the commissions and as the community as this percolates through the community and through the planning process, it's great to see in the collaboration between the staff and the developer and the community.'",
        "'speaker_8': 'And I know you are probably now that we're losing, Jon, the most valuable player here in Alameda. So I just want to continue that sports metaphor. So as we go forward, you know, there's four things I'll be looking for updates on in the next meeting.'",
        "'speaker_8': 'You know, like I said, the pictures are pretty, but, you know, it's crunch time now. So as a council member doesn't mention it's time to, you know, see the economics of the business deal. So I'll be looking forward to hearing more about that in our next meeting.'",
        "'speaker_8': 'The Economics of the TDM, you know, it sounds like, you know, it's an amazing plan, but you know, is it sustainable over the long term? I mean, we had the picture of the Amerigo Amerigo around, you know, and that's facing trouble.'",
        "'speaker_8': 'So I want to see if we're going to put in a TDM plan, you know that 20, 25, 30 years, you know, if people are still on busses or whatever, you know that it's sustainable on that. We're not building something that that's, you know, that's set up to fail.'",
        "'speaker_8': 'And then I also think, you know, we need to you know, we talked earlier about, you know, wage inequality and, you know, fighting to keep the wages up in our community. And, you know, we have this housing issue.'",
        "'speaker_8': 'And one of the reasons why I'm so excited about this plan is because it deals with our housing shortage. And if we can, we've seen our employers, they want housing for their employees. You know, they've made that unfortunately clear today.'",
        "'speaker_8': 'You know, we've heard from from tenants in the last few months about the pressure on rents. And if, you know, this development could act as a steam valve and then release some of that pressure, you know, then some of our tenants may not feel the heat that they've been feeling, you know, from increasing rents.'",
        "'speaker_8': 'So I think we have to be cognizant of that. And, you know, one thing I'll be looking for two things. Looking for an update on, you know, one is the project labor agreement. I hope that we have some positive updates on that at the next meeting.'",
        "'speaker_8': 'And I was excited about the innovation, you know, and the green tech and the hubs and, you know, the ten businesses of ten. But, you know, there are still some protections that need to be made, in my mind, for the legacy businesses.'",
        "'speaker_8': 'So if we're putting a hotel out there that's not ten of ten, you know, that's one of 100 or one employer, you know, employing, you know, hundreds of people. And the same thing with, you know, large grocers, I'm you know, I'm excited about The Hub.'",
        "'speaker_8': 'But, you know, as the vice mayor mentioned earlier, you know, I'm worried about, you know, Walmart putting getting a foothold in Alameda. And I don't want to see them go to, you know, one of these spaces ultimately. So, you know, I've talked to, you know, folks about this.'",
        "'speaker_8': 'I see Ty in the audience and I've talked to, you know, a couple of the developers. And the this issue of labor, peace and card check neutrality, you know, is important to me. And for those that don't know, I mean, it basically says, you know, for these large hotels and if there's a large, you know, 15,000 type'",
        "'speaker_8': 'square foot grocer that we talked about early that decides to come in there, that, you know, they agree to what's called labor peace. You know, if somebody wants that, the employees want to organize, they don't stand in the way.'",
        "'speaker_8': 'And in exchange, the employees decide not to, you know, cause a work stoppage during during the organization. So I've talked about this and it's the developer and I hope to see some progress reported back and those four issues at the next meeting.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_9': 'My major concern on this, the concept of this is still this project in the context of the entire West and the northern waterfront and the burden of residential units that are in the pipeline already and that are currently zoned.'",
        "'speaker_9': 'And we heard about another one tonight to keep an eye on, and that's the annexation of the two parcels at Alameda Landing. So I think that that is still a concern of mine. And real job creation is the other concern.'",
        "'speaker_9': 'And I a second councilmember Otis reference to labor peace which is really a fairness issue, particularly for workers at the lowest end of the spectrum when you talk about hotel workers and there's a hotel that is prominent in this plan.'",
        "'speaker_9': 'And I think at some point there's going to be a hotel at our middle point, regardless of what happens with site or site B or Main Street. I think those are important factors. I think of the kind of energy that goes around building these job clusters.'",
        "'speaker_9': 'I think we've already started with wider. And I think I'd like to see that energy continuous. Well, I'm taking lots of notes on this and. Trying to look at the best way to deliver workforce housing. I think we have enough market rate housing in the city.'",
        "'speaker_9': 'We do need workforce housing and I'd like to be able to champion a way to make that 100% rather than 25% or 15%, because that's where the need is.'",
        "'speaker_0': 'Thank you. And I agree with many of the comments of my council members and of the public. And I actually would like to just start with the last comment from vice mayor regards to workforce housing. We've had and and I've had many people come to us thinking that this will accommodate this housing here, will serve their particular'",
        "'speaker_0': 'needs of having rent increase and not being able to afford to live in Alameda. And when I look at this. As far as I can tell, when we're looking at the number of apartments in that, it's actually the tallest building, which I think is the closest to the water.'",
        "'speaker_0': 'The white building in regards to housing is apartments. I would like to know what entry level rates we're looking at for market rate apartments. I attended the RAC hearing this past, the past RAC meeting and there was a gentleman who said that he makes over six figures and cannot afford the rent increase for a two bedroom rental'",
        "'speaker_0': 'here in town. I think it's I'm very concerned that we are talking about entry apartment rentals of a rent of 3 to $4000 for market rate. And I don't think that that is actually.'",
        "'speaker_5': 'And.'",
        "'speaker_0': 'I don't think that that's not likely to happen. And I really think it's important that we be upfront with what we're talking about with our maidens so that the mother that comes here and says her daughter's a teacher and she's looking to live in one of these apartments, we need to know what would the rent be?'",
        "'speaker_0': 'And I think and also in regards to here in California, new apartments built after apartments built after 95. We cannot ever put rent control on per state law unless the state law changes. So anyone that is thinking that rent control could at some point attach to these new rentals.'",
        "'speaker_0': 'Not unless state law changes is not going to happen. So I personally, my priorities are to meet the needs of our maidens and people that work here currently and the workforce that I know of. I'm happy to have the 20% below market rate.'",
        "'speaker_0': 'It appears that 128 will be the low and very low, and that's in one of these 50 foot buildings, if I'm correct. And then that leaves 72 more. And could someone tell me where will the other 72 be?'",
        "'speaker_0': 'Could it be in the townhomes, or will that also be an apartment store? And I actually don't see condos in here if there are supposed to be condos. And I'm looking at page 11 of the supplement and if someone could actually get that up on the screen so we can talk about the height and how it is'",
        "'speaker_0': 'highest, where the rentals are near the water and the lowest as you get to the townhomes. That I think is what would be available for people to purchase.'",
        "'speaker_5': 'So the first question. Yes.'",
        "'speaker_8': 'Was.'",
        "'speaker_7': 'Can you state your first question?'",
        "'speaker_0': 'Okay, I'll start if you have any idea what Brentwood started, and I believe it's building 11 is the white tall building. Is that Building 11?'",
        "'speaker_5': 'Yeah. I have to see Beyonce going.'",
        "'speaker_7': 'To be you know, they're going to be market rate rents. I don't have a residential developer here tonight. You know, they will not be. The cheapest rents. I mean, this this is new construction. We're supporting a lot of new infrastructure.'",
        "'speaker_7': 'So but we will be providing 25% affordable in the project, which is two thirds more than, you know elsewhere in the city and elsewhere in the Bay Area.'",
        "'speaker_0': 'And that's. So I appreciate that as a. So instead of 15% below market rate will be 20% below 25, 25% below market rate. Thank you. Page 11 on hair. Could you get to start as it's slow? Okay, thanks.'",
        "'speaker_0': 'Okay. So at some point I'll be looking to know you have disclosed to us before I vote to approve this and when I want to have an numbers on what the entry and what the rents will be in this building 11.'",
        "'speaker_0': 'And it's this orange one here. And that one it says 65 feet, but it could be higher because it has a two asterisks. Do we have an idea do you have an idea of how high you expect that to be?'",
        "'speaker_7': '65 feet. I mean, so that we can go unless there's a finding supported by the planning board that. But, you know, our expectation is it will be 65 feet. That's what we're planning today.'",
        "'speaker_0': 'Okay. And within those apartments, do you expect any of the remaining 70 to moderate rate housing to be in there or will all that be market rate?'",
        "'speaker_7': 'Some of the 72 moderates will be in that building. They'll be in podium nine. You know, in the first phase, we currently assume they'll be in the apartments. We have the ability to move them into the townhomes. That's really going to be a function of, you know, as we get closer to the market and look at, you'",
        "'speaker_7': 'know, how rents continue to move versus for sale prices continue to move, you know, we'll have that flexibility. But right now, you know, we've assumed that those moderate would be in parcels nine and 11.'",
        "'speaker_0': 'Okay. So as we get more condos.'",
        "'speaker_7': 'So on the parcel three in phase two, that is a podium project. We've assumed all of phase two will be for sale currently, and so that's 104 units that would be condo.'",
        "'speaker_0': 'And what about housing?'",
        "'speaker_7': 'And we typically put on all of our apartment buildings. Condo maps is a fairly common practice. So, you know, if the market were to shift, you know, we could convert some of the apartments to condos. But, you know, again, we think, you know, apartments are important.'",
        "'speaker_7': 'Rentals are important for the reason we haven't built any market rate rental in Alameda for quite some time. And it's very important for workforce development and that's a very key. We want to support that around midpoint.'",
        "'speaker_0': 'And that's why I'm looking for what the entry level would be, because I think we might have different, different definitions that have been used tonight in regards to what is workforce. And I think it's very important that we determine who could actually afford to live in these apartments.'",
        "'speaker_0': 'So I will be looking for a breakdown of how many of those will be moderate and if they will be apartments versus the shadows. And then a number of it's shown here is number nine will also be condos.'",
        "'speaker_0': 'Then it's 182 residential units.'",
        "'speaker_7': 'That's currently planned as all apartments.'",
        "'speaker_0': 'That's all apartments.'",
        "'speaker_7': 'And that can include some of the moderate to affordable as well. That will include some of the moderate affordable as well.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'And that's.'",
        "'speaker_6': 'What what buildings that I lost track.'",
        "'speaker_0': 'Of nine.'",
        "'speaker_6': 'Or something.'",
        "'speaker_0': 'Is orange on here.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Because I want to work across and that's also 65 feet. Are you planning for that to be 65 feet?'",
        "'speaker_7': 'That'll be up to 65 feet. That's very possibly be lower. You know, it could be a four story right now. I think we've shown it as a four story, but it could be up to 65 feet per the precise plan.'",
        "'speaker_0': 'Okay. And I'm sorry, going back to 11 when you're talking about apartments, but they be within each unit, it would be one floor.'",
        "'speaker_7': 'It's flats. Yes, one floor. Correct.'",
        "'speaker_0': 'And same with number nine on those units. Would those be one floor, one floor flats?'",
        "'speaker_7': 'That's correct.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'And then the the low and very low is number eight.'",
        "'speaker_7': 'That is correct.'",
        "'speaker_0': 'And that could have some senior housing.'",
        "'speaker_7': 'Is that right? Yeah. There's a couple different programs being looked at. You know, a blend of senior and family and an all family.'",
        "'speaker_0': 'And when will we know what that will look like?'",
        "'speaker_7': 'I would.'",
        "'speaker_0': 'That's. I'm sorry. That's been another need. Senior housing has something that I've heard repeatedly for both affordable and below market rate.'",
        "'speaker_5': 'Yes.'",
        "'speaker_7': 'Definitely. We've we've heard that a lot from the community.'",
        "'speaker_0': 'So if you could both.'",
        "'speaker_7': 'We we need both.'",
        "'speaker_0': 'Right. So if you could get back with me or us on that. Yeah.'",
        "'speaker_2': 'I just want to add, we have a settlement agreement with renewed hope, as you heard from the executive director, Laura Thomas. And we're working with them to determine mean. I think, to be honest, if it were up to staff and the developer, I think we were proposing a half senior half family.'",
        "'speaker_2': 'We right now, the way our agreements and transactions are looking is we're going to keep the flexibility open to make sure that we confirm with renewed hope and that agreement that we have with them that that that's consistent with that agreement.'",
        "'speaker_2': 'And we just have to make sure there's all these other documents and agreements that are in place. We have to make sure that they're all consistent.'",
        "'speaker_8': 'But if we.'",
        "'speaker_2': 'So we're working with them to determine that they think that how doing have senior half family is consistent with that settlement agreement. That's why you haven't heard a more definitive commitment from us because we just want to make sure we all of our transaction documents are consistent with those other agreements and legal obligations that we have.'",
        "'speaker_2': 'And so we're working through that and we don't want to. You don't want to move that too fast.'",
        "'speaker_0': 'Thank you. I appreciate that. And before we continue, because we're approaching 11 p.m., do we have a motion to continue the meeting and we require three votes to do that?'",
        "'speaker_7': 'On the move.'",
        "'speaker_0': 'All those in favor. I.'",
        "'speaker_5': 'I. I.'",
        "'speaker_0': 'A number of them did you vote for? I think at least four were in favor of not. Thank you. All right. So continuing on the townhomes from reading the House report, it appears that those will be three level homes, that's for sure.'",
        "'speaker_0': 'And so if it's a three level home, will it have a home above it or because it's 40 feet?'",
        "'speaker_7': 'The vertical will all be a single home.'",
        "'speaker_0': 'A single home, three levels. And all the townhomes will have three levels.'",
        "'speaker_7': 'That's the current plan.'",
        "'speaker_0': 'Yes. And you have. So the entry floor would be on the first floor.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Okay. And then where would you expect to have the washer and dryer up? And I'm going I'm going to ask because I also attend meetings for the disabled here. Our Commission and universal housing. An issue has come up that some homes are now being designed with a bedroom on the first floor with a kitchen and a bath'",
        "'speaker_0': '. But the washer and dryer are on the second or third floor. So in regards to access for a mobility impaired, that's pretty difficult.'",
        "'speaker_6': 'Could I could I just interject a related question? Is there any thought given to universal design in these units?'",
        "'speaker_7': 'Yes, there is. We have provisions in the development plan and I think in the conditions of approval for universal design. So we haven't designed anything yet. So but yes, there are provisions for it and we plan to incorporate it.'",
        "'speaker_6': 'Okay. Which I think will answer some of those questions.'",
        "'speaker_0': 'All right. So I wanted to raise the issue of the washer and dryer so you're aware of that has been a concern, um, regards to access of course for everyone then. Okay. The distance between the existing ferry and your new ferry.'",
        "'speaker_0': 'Do you have an idea how far they are?'",
        "'speaker_7': 'I mean, I don't.'",
        "'speaker_0': 'The staff the staff have an idea how far the current area on Main Street is from where the new ferry proposed new ferry will be.'",
        "'speaker_2': 'Try the existing ferry on the estuary. Yeah, it's about a mile, mile and a half from the site.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Thank you. An issue. And then when I looked at these drawings, I was trying to find one that has the fairy in the sea playing lagoon. Is that where the theory is proposed to go in sea? Playing lagoon.'",
        "'speaker_7': 'In sea. Plain lagoon? Yes. Closer toward the. The Ready Reserve Fleet.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'So Civic Avenue.'",
        "'speaker_0': 'Okay. So I'd like to see what that will actually look like because the drawings I saw in here of Sea Playing Lagoon had in fact like the page 20 on the presentation. It has what appears to me to be very recreational use and I'm not quite sure how ferry coming in and out of that same lagoon will'",
        "'speaker_0': 'look like. So I'd like to see in the future where the fairy where the new fairy proposed fairy will be. And I'm also interested in how that will impact the use of the sea playing lagoon.'",
        "'speaker_2': 'Beijing, the development.'",
        "'speaker_7': 'I know it's been purposely located at the foot of Pacific Avenue to avoid the conflicts with recreational uses and and to, you know, keep the wake away from recreational uses over closer to the main plaza of the seaplane lagoon.'",
        "'speaker_7': 'That was the intent of locating it there.'",
        "'speaker_6': 'Although, for the record, I'll just note that if you take the existing Main Street ferry, you do certainly see sailboat traffic and container ships and other, you know, traffic all the way from Alameda to San Francisco. But certainly in that channel in the estuary, those juxtapositions exist.'",
        "'speaker_0': 'So in regards to the drawing, I'm looking at page 20 that has the use. I don't I don't see it in there. So I'd like it to be accurately depicted so that when we're looking at this.'",
        "'speaker_2': 'You know.'",
        "'speaker_0': 'And and it does.'",
        "'speaker_2': 'It was fun.'",
        "'speaker_0': 'And it doesn't show that corner. But I, I, I think it's important for our meetings to understand what we're talking about here.'",
        "'speaker_6': 'Absolutely.'",
        "'speaker_0': 'Thank you. Um.'",
        "'speaker_5': 'Okay.'",
        "'speaker_2': 'All right. On page 29.'",
        "'speaker_0': 'Okay. So that's. So I'm looking for a drawing that has the recreation. So the, the drawing I'm looking at page 29, actually, it doesn't have any sailboats or recreational use. I mean, assuming you're referring to the one of the top left corner.'",
        "'speaker_2': 'Page six does the town. I mean, you just want to make sure we understand exactly what. Can. So we show this on a show. The show where two. Here's the very. It really is. That is have this come in in right here.'",
        "'speaker_2': 'Get there fast and avoid you know, this is 111 acres and. So looking at it, coming in right here at the base to try to just keep, you know. I.'",
        "'speaker_0': 'Right. So. I'd like a depiction that clearly shows like the sailboats and the wherever the ferry supposed to go.'",
        "'speaker_6': 'Not to put too fine a point on this, but in that pretty picture you showed us. Remind me, what patient was mayor aged 20?'",
        "'speaker_0': 'Has that pretty what I call the pretty picture with the sailboats and whatnot. And it doesn't show that corner. Uh, if that isn't.'",
        "'speaker_6': 'Isn't that vessel steaming across? Is that not a ferry? No, no, it doesn't come out.'",
        "'speaker_7': 'That's the fairy. Would not be their.'",
        "'speaker_0': 'The fairy would not be there, I think.'",
        "'speaker_5': 'Mm hmm. I mean.'",
        "'speaker_2': 'What you're looking at there is. That's probably.'",
        "'speaker_0': 'I think it's just.'",
        "'speaker_6': 'A little pleasant. Also, it's not. It's intense. This is the aerial massing view looking east, though.'",
        "'speaker_9': 'On calcium.'",
        "'speaker_5': 'You know.'",
        "'speaker_0': 'Okay. And then the comments in regards to this reduced price passes and I agree with member de SAC, if there's a way to make that available to all at our meat and somehow because we really are trying to get all elements of access this reduced price passes, I'm not sure how you're getting the prices, but if we'",
        "'speaker_0': 'can get find out somehow. But there are other Allen meetings that are interested in buying this pass. So yes. So that we could somehow make it less expensive for all our meetings. And I think that would go to reduce encouraging the public transportation for.'",
        "'speaker_2': 'All.'",
        "'speaker_0': 'Our meetings. And I agree with Member De SAG in regards to trying to make it more available for everyone.'",
        "'speaker_5': 'Um.'",
        "'speaker_0': 'You know, anyone that goes there, hopefully they can take public transportation there and back to their homes or back to BART or back to the ferry. And then I have a question in regards to the drought. I have had Al Maidens ask me so recently we've been told that we need to reduce our water usage.'",
        "'speaker_0': 'And are these homes being designed in a manner to use as little water as possible? And do we have and not necessary for me, but from staff, possibly what the net increase in water will be to accommodate these homes?'",
        "'speaker_0': 'And do we have communications with East Bay mud and to see how this will impact all of almeida's access to water during the drought.'",
        "'speaker_7': 'Yeah, I mean, the East Bay mud process in and of itself has certainly become much more strict over the last several years in terms of applying for water before we just sent in an application saying we wanted certain size meters and paid a fee and they showed up.'",
        "'speaker_7': 'And now it's you know, we are submitting very detailed counts on all of our water demand, very low flow fixtures. We will be plumbing this for reclaimed water use, you know, both exterior and interior. So this will be, you know, the lowest water using project in Alameda when it's complete.'",
        "'speaker_7': 'I mean, I'm fairly confident with that, you know, just because the standards are clearly moving in that direction and consistent with other projects we've developed in town.'",
        "'speaker_0': 'Remember.'",
        "'speaker_6': 'I believe along those lines that we will have an upcoming staff report related to these be met in the drought and water regulation. So more information coming to us.'",
        "'speaker_0': 'Yes. And including the additional 800 some homes in this project in its entirety. Thank you. So overall, the concern I have is that I think the homes with the water view will be the market rate homes. It will be in the towers and they'll have the activity of the water and the and the homes to purchase would'",
        "'speaker_0': 'be. The townhomes. And this is phase one I'm looking at. Mm hmm. And those are closest to Main Street. And there are so so I think that that the the the the renters paying the highest rent will have views of the water, the people.'",
        "'speaker_0': 'And I'm not sure what the entry level prices would be on the townhomes if those will be available to what I'm going to call workforce housing at two. So I'd like to see when you have the prices of what you think the entry level prices will be on those two, but that is closest to Main Street.'",
        "'speaker_0': 'That's all I have at this point. Any other council comments?'",
        "'speaker_7': 'I guess so. In terms of like. Eight. Making owner occupied housing affordable. I mean, there's a lot of ways to slice and dice that we can have some kind of strategy with regard to FHA. First time homebuyer type of program.'",
        "'speaker_7': 'Because when we're talking about affordability for owner occupied housing, sometimes it's not simply the price that that's the roadblock, but it's also the amount of the time for a down payment. So things like an FHA program, to the extent that, you know, the project qualifies for that, which I'm sure it would.'",
        "'speaker_7': 'No, it's it's a way of of of of making market rate housing available to a broader segment of homebuyers.'",
        "'speaker_5': 'Mm hmm.'",
        "'speaker_7': 'Something to keep in mind, right.'",
        "'speaker_6': 'Mary?'",
        "'speaker_0': 'Yes, Mary Ashcroft.'",
        "'speaker_6': 'Very related to that. There's an assembly bill pending right now. One of the co-sponsors is our assembly representative. Our Assembly member, Rob Bonta. It's Assembly Bill 1335. Those of you who were at the recent development forum heard me talk about it.'",
        "'speaker_6': 'Right now, as I understand it. It's this bill is going into committee this week, toward the end of this week. And if it indeed comes out of committee, we are going to ask that this council do a resolution in support.'",
        "'speaker_6': 'And what it does is it it imposes certain fees on real estate transactions, but not transactions involving the purchase or sale of a residential home that's that's being acquired by an owner occupier. But what the the fees will go toward is a trust fund that helps to construct affordable housing, helps for first time buyer affordability programs.'",
        "'speaker_6': 'When when member de SAG just mentioned that, it jogged my memory and there's a whole list of other really great benefits. So it's something that the League of California Cities has asked has come out in support of and has asked other cities around the state to do so as well.'",
        "'speaker_6': 'So I believe we have a connection to this family member's office is going to keep us posted on whether the bill comes out of committee at the end of this week and then look at a resolution coming to a council close to you.'",
        "'speaker_7': 'Yeah, it'll be one tool.'",
        "'speaker_6': 'April 29th, which is Thursday. No. Oh, it's next. It's next week, actually. Okay.'",
        "'speaker_8': 'And the speaker's authority.'",
        "'speaker_0': 'Mr. Ernst, did you want to add any more comments?'",
        "'speaker_5': 'No, I just want to say.'",
        "'speaker_7': 'That I think one tool that's being designed to try to replace redevelopment, you know, funding for affordable. You know, right now without redevelopment, it's being funded by heavily subsidized by private development.'",
        "'speaker_0': 'Thank you. Any other council comments? All right, then. I think we can. STAFF Did you want any more direction on this? You're.'",
        "'speaker_3': 'I don't think we need anymore. I think we have a direction.'",
        "'speaker_0': 'All right. So then I think we're finished with this agenda item. And then I'm going to move on to number seven, City Manager Communications. Is that where we jump to now?'",
        "'speaker_5': 'Mm hmm.'",
        "'speaker_9': 'I think we aren't.'",
        "'speaker_6': 'Well, I think under the circumstances you can make.'",
        "'speaker_3': 'No, that's quite all right. I'm I don't have any communications this evening. Thank you very.'",
        "'speaker_0': 'Much. But my.'",
        "'speaker_6': 'Understanding now, therefore.'",
        "'speaker_9': 'I'm expecting to hear tomorrow.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'So then no additional speakers.'",
        "'speaker_0': 'All right. Council communications. We can skip that and we can now during the meeting. Yes, I will. Now, during the meeting. Thank you. You.'"
    ]
}