{
    "Agreement with Creative Build, Inc. for Day Center and Safe Parking Program for Homeless Individuals.": [
        "'speaker_2': 'Yes. To a is a recommendation to authorize the city manager city manager to negotiate and execute a $310,000 agreement with creative building to operate a day center and safe parking program for individuals experiencing homelessness funded through the Emergency Homeless Emergency Aid Program.'",
        "'speaker_1': 'Thank you. And I believe this is Miss Potter's idea. I see. I see. And a Baptist from community development. Welcome. And I see Debbie Potter now. Okay, so who's taking the lead on this one?'",
        "'speaker_0': 'I can speak to that item. All right.'",
        "'speaker_1': 'Action, please. Thank you.'",
        "'speaker_0': 'Anything there? And members of the city council, thank you for the opportunity to speak with you tonight about the Alameda Day Center and Safe Working Program for an exciting program that are going to be coming to Alameda. As you all know, the city of Alameda has been allocated 700 of the $6,524 in homeless.'",
        "'speaker_1': 'Emergency aid program late.'",
        "'speaker_0': 'Last year. He a $500 million block grant from the state designed to provide one time funding for projects that have immediate impact to address homelessness in our local jurisdiction. At City Council's January meeting last.'",
        "'speaker_1': 'Year, you directed Community Development Staff to work with the Social.'",
        "'speaker_0': 'Service Human Relations Board to develop a proposal that identifies projects that may be funded through.'",
        "'speaker_1': 'The Social Service.'",
        "'speaker_0': 'Human Relations Board subsequently created an ad hoc committee that works with staff to gather input from community stakeholders and possible projects to fund the review. And two of the key projects that were recommended and approved by the City Council on July 16 of 2019.'",
        "'speaker_0': 'Whether they center and the Safe Parking Program, the Bay Center and Safe Parking.'",
        "'speaker_1': 'Will be.'",
        "'speaker_0': 'Located at 431 Stardust at Alameda Point. And the building was used by the Alameda Fire Department as a training center a few years ago and which has been unused for.'",
        "'speaker_1': 'A couple of years or.'",
        "'speaker_0': 'So and had some structural problems that would otherwise be a great space for both programs. The building is currently under construction and should be ready in the next couple of weeks, which is exciting. Meanwhile, the city issued an RFP or request for proposal on April 22nd.'",
        "'speaker_1': 'To seek a provider or providers to operate the either.'",
        "'speaker_0': 'The Bay Center, the safe parking are both programs. The city received two applications for the Bay Center and three applications for the Safe Parking Program. Two of the organizations that submitted proposals applied for both Safe Parking and the center.'",
        "'speaker_0': 'We had an RFP review committee comprised of a community advocate working with the homeless and Alameda resident who coordinates homeless services for the city of San Leandro. A city staff who manages projects like Alameda Point and a city staff coordinated homeless services for the city of Alameda.'",
        "'speaker_0': 'We independently scored the applications and conducted Zoom interviews with the applicants. There was a clear winner and Creative Build Inc, which is a data driven, results based nonprofit organization that will work with the Village of Love, an organization that has extensive experience working with the Thomas Carl Business Improvement District.'",
        "'speaker_0': 'Jack London Square, downtown Berkeley in East Oakland, is providing street outreach meals and shower services to the unsheltered population. They will be conducting the.'",
        "'speaker_1': 'Services for.'",
        "'speaker_0': 'Their clients at the Bay Center and the Safe Parking Program. We are here today.'",
        "'speaker_1': 'To seek.'",
        "'speaker_0': 'Your.'",
        "'speaker_1': 'Approval to authorize the.'",
        "'speaker_0': 'City manager to negotiate the contract to execute a 300,000 $310,000 agreement with Creative Build Inc to operate the adult the Bay Center as well as the safe parking. Our goal is to launch the Bay Center and Safe Parking programs on July 1st.'",
        "'speaker_0': 'So it's coming up soon and we're very, very excited for these programs to be launched. Thank you for the opportunity to speak with you tonight and have an answer.'",
        "'speaker_1': 'QUESTION Thank you. He is back to saying, I want to get over the feedback, but I want to just really thank Ms.. Bacchus for all the work that she has done from her position as community development in the Community Development Department.'",
        "'speaker_1': 'She serves on numerous committees around the county. She has kept up to date on the latest developments, the best practices for how to address our unsheltered population. I know the two of us have made field trips to visit things that other cities are doing because we don't have to reinvent the wheel.'",
        "'speaker_1': 'But it takes a lot of compassion and understanding and just plain tenacity to keep moving forward on projects like this. And so thank you. I'm very excited to see this come to our council. Um, before and um, Madam Quirk, I didn't ask you, do we have public speakers on this item?'",
        "'speaker_2': 'We need to ask when we're ready to get to the public comment portion, we'll have to ask them. So.'",
        "'speaker_1': 'Okay, so. I was going to ask if council had any clarifying questions about the presentation or Ms.. Potter if there was anything you wanted to add? No, she's shaking her head. No. And if there are no clarifying questions, then why don't we see if there's any public comments we'll hear then?'",
        "'speaker_1': 'If there are, and if not, we'll launch into council discussion and hopefully a motion.'",
        "'speaker_2': 'So if any attendees that are on the line would like to comment on this agenda item, please indicate so now by raising your hand. Okay. Nobody has raised their hand, so we have no comment on this item.'",
        "'speaker_1': 'Excellent. All right. City Council. Anyone want to take the lead? I have a motion. Vice mayor, not quite.'",
        "'speaker_3': 'Seeing nobody jumping in here. I would be happy to. Second all the comments you made in your thanks to this back tests and the community development and move approval of this item as proposed.'",
        "'speaker_1': 'Thank you. We have a motion to have a second by Councilmember Ody and I also would be remiss not to recognize Debbie Potter, the director of Community Development Department. She she knows this stuff off the top of her head.'",
        "'speaker_1': 'And she is another very compassionate individual who always sees possibilities out there, even when it's sometimes hard to keep hope. But I am I am feeling hopeful. And I read something recently that one of the things we've seen exposed more in this COVID crisis is there is there are a large number of very wealthy individuals in our'",
        "'speaker_1': 'country, in the world, and there's an increasing number of very poor people who are just falling through the cracks. And and there's a connection, by the way. As a city council, we can address every wrong. But there are things that are within our powers to to impact.'",
        "'speaker_1': 'And this decision tonight is one of them. So we've had a motion. We had a second. Any further discussion? Uh, Councilmember de SAG.'",
        "'speaker_4': 'Yes. Thank you very much. I'm not convinced that the street parking idea is, um, is a good use of the of the limited dollars, but that, you know, I, I'll abstain on this item. I'm just concerned about that.'",
        "'speaker_1': 'And one of the things that I also want to highlight, because I've been working with staff on the safe parking concept for a while, is you and I and I hope you had an opportunity to read that. But the staff report and the code of conduct, because we are modeling what will be done after the successful models'",
        "'speaker_1': 'of other cities and Union City is one of them. And we so it isn't just a matter of come on down and and and park here people will register. There is not only supervision but also resources are provided because the idea is not just to give you a place to park but help you to move out of'",
        "'speaker_1': 'your circumstances and into eventually a roof over your head, a permanent roof, not a car roof over your head. But thank you for that comment. If there are no further comments, let's have a roll call vote.'",
        "'speaker_2': 'Councilmember Jason.'",
        "'speaker_4': 'Epstein.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_4': 'I i.'",
        "'speaker_2': 'Sabella. I may or as the Ashcroft high that carries four eyes one abstention.'",
        "'speaker_1': 'Thank you very much. All right. With that, we move on to item to be. Like Hamlet her. Okay. And Madam, quick, could you introduce item to be for us, please?'"
    ],
    "Creation of Alameda Strong Community Relief Fund for COVID-19 Impacts.": [
        "'speaker_2': 'Sorry. My mute was on recommendation to create a strong community relief fund to provide grants or other types of relief to small businesses, nonprofits and residential renters that have been negatively financially impacted by the COVID 19 pandemic.'",
        "'speaker_1': 'Thank you. And so this is is Lois Butler on or who's Sarah are you presenting? No. Who's presenting tonight? Uh.'",
        "'speaker_0': 'Miss Butler is scheduled to present. She's having the same difficulties as the last meeting, and I know she's on a phone line. And, Laura, it sounds like she's trying to communicate with you about her, her situation. But I am once again happy to wing this.'",
        "'speaker_0': 'Sarah. Sarah is here to help, too. It's a good thing we are a team. A team effort. Right?'",
        "'speaker_1': 'Right. Dalton suspenders. Yeah. I would send Shawn over to help low as he solves everything, but.'",
        "'speaker_0': 'Okay, I'm.'",
        "'speaker_1': 'Probably a little too far.'",
        "'speaker_0': 'If it's okay. Looks like I know that I could use that here. Yeah, I saved by the music. I love everything you guys were saying.'",
        "'speaker_1': 'So great.'",
        "'speaker_0': 'Hear?'",
        "'speaker_1': 'Do we not get to see your lovely face, Lois?'",
        "'speaker_0': 'You know this way. Okay.'",
        "'speaker_1': 'I saw you earlier today.'",
        "'speaker_0': 'I remember. What you.'",
        "'speaker_1': 'Okay, so here's another hardworking member of our economic development staff. She has been working with our businesses just about since day one of the shelter in place and has really been an invaluable member of the team and a big help to the local business community.'",
        "'speaker_1': 'So so, Lois, tell us what we need to know about this item, this fellow.'",
        "'speaker_0': 'Thank you. Honorable Mayor and members of city council. This read this report recommends the creation of an Alameda strong community relief fund to provide grants to small businesses, nonprofits, residential renters that all have been negatively impacted by the COVID 19 pandemic.'",
        "'speaker_0': 'And just I'm giving you some background. On the 21st of April, the city council approved $600,000 for a COVID small business relief grant. And this will provide 81 excuse me, 81 time grants of 70 $500 each and a total of 238 have applied for this grant program.'",
        "'speaker_0': 'You have a general summary of the applicants that I have applied in in exhibit one. I won't go through those staff is currently reviewing all the applications. We've actually made it through the application review the first round, and we need to go through a second round to make sure that everything is correct.'",
        "'speaker_0': 'We are expecting a delayed end review point of the end of the month. It was originally anticipated that we would complete this process by the 21st. UM, grants will be awarded thereafter. We're hoping that it'll be in the same amount of time, given that we are going to be asking applicants to submit information electronically so that we'",
        "'speaker_0': 'can get it out electronically to them. So that'll cut down on some time. On May the fifth, staff provide an update to City Council regarding the grant applications. We also received directions from the City Council to create a community relief fund and that's what we're going to be talking about tonight.'",
        "'speaker_0': 'The feedback from city council was as follows Given the number of applications, consider additional funding of 2 to 300000 for relief grants. Consider funding for residential rent relief. Explore a public excuse me public private partnership for raising funds.'",
        "'speaker_0': 'Work with the West Alameda Business Association, Waba and others who have expressed interest to set up a Go Fund Me fund campaign as soon as possible while still developing this Alameda Strong program on a parallel track. And this is to capture as many donations as possible and as quickly as possible and outreach to put potential applicants in'",
        "'speaker_0': 'the top three languages. As part of this new campaign and also as part of the new program, consider the following criteria perhaps have a greater loss than 20% due to. COVID provide additional consideration to businesses that are open or opened when they were allowed to open.'",
        "'speaker_0': 'Versus those who remain shuttered. Allow. More than one apple at one location if a business has more than one location, allowed them to have more than 25 employees across several locations. Allow grantees to give back a portion of their 70 $500 grant and then use the same pool of applicants for awarding nutrients from the GoFundMe they can'",
        "'speaker_0': 'claim. And then, per your direction, the city manager and staff have looked for additional sources to claim additional grant, and on June 2nd, staff will present a recommendation to the City Council for approximately $600,000, just slightly less than that in emergency relief grant funding for low income tenants.'",
        "'speaker_0': 'And this would come from the Community Development BLOCK Grant Program CARES Act funds. And if that is approved, then City Council would have allocated $1.2 million towards relief grants. So that will be a recommendation of ours at your lot, at your next meeting.'",
        "'speaker_0': 'And then City Council also directed staff to look at the $2 million allocated from reserves to add to authorized relief. Expenses. And then you asked us to look at reprograming existing budget funds. You also suggested. Thank you. So excuse me.'",
        "'speaker_0': 'Of the $2 million that you you've allocated and you suggested 200 to $300000, staff is not recommending that to the council. Use any of these funds for this program at this time, given that you will have funded $1.2 million.'",
        "'speaker_0': 'We. We feel that that. There are still a lot of issues ahead of us in terms of the city budget needs. And so we suggest that we reevaluate this in December and or the Fall City Council also previously approved through the budget process, $200,000 for branding, for economic development.'",
        "'speaker_0': 'And you asked us to also looked at that. We have looked at that, those fundings. And we're not recommending that either, because we are. We're looking to use that if if approved for recovery efforts related to our long term recovery plan.'",
        "'speaker_0': 'And this would help to provide for consulting resources and support of a task for which the Council was notified of through through another process within the city, the EDA panel process. So staff recommend that the additional funding be the funding that is coming through the CDBG funds.'",
        "'speaker_0': 'Regarding the Alameda Strong Community Relief Fund, you asked us to create a public private partnership. And so based on that, we met with the the Business Association to wow the Gabba Gabba and the Alameda Chamber of Commerce downtown.'",
        "'speaker_0': 'This is downtown Alameda Business Association with Alameda Business Association and the Greater Alameda Business Association and the Alameda Chamber of Commerce. And we talked with them about the Alameda Strong campaign and they had some suggestions. Their three primary concerns were that the goals of the program be clearly defined, that there be a separate fund for both residential'",
        "'speaker_0': 'and business, and that there would be some urgency and establishing the fund, even if it means setting up a go fund me fund prior to setting up the fund that we're recommending. I will talk about that a little bit later.'",
        "'speaker_0': 'The Gulf and the U.S.. They also discussed the eligibility and structure of the community fund. And there was general consensus among the following points the number of employees, they agreed that that could remain the same at 25, that the grant size could remain the same or should remain the same.'",
        "'speaker_0': 'They did also say that recipients, they could apply for a lesser amount and the remaining funds could be used to support other businesses within the fund. And they they wanted to have an inclusive public support marketing component to it, which would include T-shirts and Windows signs and a message of unity.'",
        "'speaker_0': 'And they also and and people would pay for some of this, like the t shirt if they put so much money in. But they also wanted it to be inclusive in that if people can't afford to pay for anything, that there be a component developed.'",
        "'speaker_0': 'Even if you didn't make a donation that showed that we're we're absolutely too strong, we're one. We were supporting each other. And one example was to have a poster that people could print on a printer and then a child perhaps could color it and stick it up in a window.'",
        "'speaker_0': 'And they also thought that kicking it off with a community fund and having a virtual town hall meeting would be great. We're proposing that this community fund is set up through the East Bay Community Foundation and that they be the fiscal agent and all of that people who are donating could get a tax deduction.'",
        "'speaker_0': 'A tax deduction. And East Bay Community Foundation, they worked with Berkeley on on a fund similar to the one that we are are asking you to approve. And one of the things that they believe in is that government partners that are working with them should be bold, courageous and innovative in their actions.'",
        "'speaker_0': 'And I think that this is an apt description of what the city council is doing through this whole process. Poor grant administration. This has been a lot of work. Staff is working all hours of the day and night through the morning, in some cases trying trying to process the applications.'",
        "'speaker_0': 'And so we're recommending. That that we work with working solutions. They work directly with the community foundation. I mean, they would be associated with them, but we would also work with them. The legal arrangement will be through the foundation, but we would have to approve them.'",
        "'speaker_0': 'They are a U.S. Treasury Certified Community Development Financial institution, and they they recently worked with Oakland, with their with their grants, and they established the grant program and implement it within a two year time frame. And we think that they would be good for us to to get their money out quickly as well.'",
        "'speaker_0': 'The cost of working with those there is their community foundation and the working solutions is between 14 and 16% of the funding. 1% to East Bay Community Foundation and then 13 to 15% to Working Solutions.'",
        "'speaker_1': 'The Butler. I I'm sorry to interrupt your presentation, but I have a question now. I was kind of hoping when I read that in the staff report there was a typo. Is 13%.'",
        "'speaker_0': 'Yeah. That's that would be the time that it would take to administer the program. If you don't want to do that, we could do what we've been doing and process everything internally.'",
        "'speaker_1': 'Well, we'll have a, we'll have a, uh, council discussion about it. Um, the, in the staff report, it says they would take 13 to 15% and, um. Okay. Uh, my clarifying question was, please tell me that was a typo and maybe it was 1.3 to 1.5.'",
        "'speaker_1': 'But saying that it's not a typo, let's well, we'll hold that from when the council is having its discussion. At least one of the members of the council wants to probe that some alternatives. Okay. I'm sorry. So you were saying you're getting, I think, toward the end, right?'",
        "'speaker_0': 'Yes, I'm getting towards the end. I know it's a long report that I know it makes sense that I considering very important.'",
        "'speaker_1': 'I'm really excited about this.'",
        "'speaker_0': 'And and then there's the community relief fund itself which it staff recommendation staff recommends that the the grants being split 60% to the small businesses 20% to nonprofits since they can participate last time have that designated amount to nonprofits, 20% to renters.'",
        "'speaker_0': 'And this would be renters that showed needs not just low income renters, as will be reported. And that's next at the next meeting that the amount of the grants remain the same for small businesses and then for nonprofits as well at 7500 2500 max for renters.'",
        "'speaker_0': 'And that we we still have the following requirement applicant must show a 50% up from 20% loss as recommended by several community members and one member of the um, the business association. And this is as of the application date and that additional consideration be given to those that opened and this is a council recommendation versus those that'",
        "'speaker_0': 'remain closed when allowed to open that the small businesses have up to 25 employees. No, no limit to the number of employees. Um, if they are a restaurant and that 50 employees be allowed if the business has more than one location, this would mean including sole proprietors without employees as well.'",
        "'speaker_0': 'And also we're recommending also proprietors, even those who are in residential units that. The grantee could apply for 70 $500 or less. It would be up to them. The applicant must have a physical establishment in Alameda and physical meaning any any type home based or one that is in brick and mortar or office building, etc. and then'",
        "'speaker_0': 'the business must have a current business license and have paid their business improvement assessment. If in fact they're in a business improvement area by the application date and then the applicant must have a W-9 and apply online. And so staff is.'",
        "'speaker_0': 'Require requesting that the following be were renters. They they must have a residential lease. They must have had suffered a 20% loss. The applicant must verify that the that the tenant's rent was current to proceed into the date of March 4th.'",
        "'speaker_0': 'And that's consistent with the staff report that we're going to bring forward. The applicant cannot have received a CDBG grant, so we would coordinate that and provide documentation from the landlord to confirm the amount of unpaid rent and then payments must be made directly to the landlord.'",
        "'speaker_0': 'So once they qualify for the grant, the check would be cut to the landlord and then applications must be submitted in the online portal there. There has been a a committee set up for the alameda strong campaign in anticipation of it being approved.'",
        "'speaker_0': 'And it consists of wapa darbar and the chamber and the city's pio sarah henry. And together they have put together and are putting together a program. And if you'd like to hear from Sarah, she's here to talk to to that.'",
        "'speaker_0': 'Regarding the Go Fund Me campaign, one has not yet been set up. However, the group is saying that if in fact, we can't get the community foundation piece set up quickly, that they're they're willing to pursue setting up a go fund me program alternatives are as follows approve the report as is, modify any aspect of it direct'",
        "'speaker_0': 'staff to use all or any portion of the $200,000 budgeted for the rebranding campaign. Direct staff to create and implement a loan program in lieu of a grant program decided not to establish the Alameda Strong Community Relief Program.'",
        "'speaker_0': 'That is my report.'",
        "'speaker_1': 'Thank you, Ms.. Butler. I appreciate that. Um, Counsel, do we have any clarifying questions on the staff report? Um, I know I do. Who else does? And then we'll go to for that public comment. Councilmember Odie.'",
        "'speaker_4': 'Thank you. Thank you. Ms. Butler. So quick question. Couple of quick questions on the renter side. So the applicant is the tenant, right?'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'And then if the landlord gets this, then there's no other obligation for the tenant to pay rent for that particular dollar amount, right?'",
        "'speaker_0': 'Correct. Okay. So if they're there, they could be right now two months in arrears. And so this would only pay up to one month.'",
        "'speaker_4': 'Right. But, you know, up to 25. So, yeah. I didn't say their rent is 3000. They get 2500. They still owe the 500. Right.'",
        "'speaker_0': 'They would still owe at the time. Correct.'",
        "'speaker_4': 'Okay. And then when we did the. The 600,000 we excluded publicly traded companies. Was there a discussion about excluding publicly traded companies for the Strong Community Belief Grant?'",
        "'speaker_0': 'Yes. I assume that that would be in this. This was more to clarify some of the points that that the council made and some of the points that the that Darva and Wahba made regarding amounts. But we would still exclude publicly traded company.'",
        "'speaker_4': 'And then if somebody received one of these these grants, the process that we're currently wrapping up, would they still be eligible for one of these two strong community relief grants or.'",
        "'speaker_0': 'No, they would not be eligible.'",
        "'speaker_4': 'Okay. All those are my questions.'",
        "'speaker_1': 'Thank you for clarification about the publicly traded companies, as I recall. And it came up before the example was made. If someone might be a franchisee holder of, say, I don't know, Burger King or something, which is probably a publicly traded company, but if they weren't getting any form of assistance from their, you know, the franchisee, the'",
        "'speaker_1': 'franchise, then why would we why would we exclude that small business person or would we go more by the size of the business? I mean, we don't want them to be gay if they've avail themselves of other assistance.'",
        "'speaker_1': 'And that's not what this is intended for. But I just hold that. That's I guess that's something we'll come back to when we do counsel discussion. Any other clarifying questions? Councilmember Vela.'",
        "'speaker_0': 'I thank you, Miss Butler. And a couple of questions. One was for the sole proprietors. Is it a single? It's the same amount that a sole proprietor would be eligible for as a business with 25 or 50 employees.'",
        "'speaker_0': 'Yes. Currently, yes. And is there a reasoning for that or. While we do the process, we came across a few sole proprietors. Well, there's two issues. There's the sole proprietor that has employee. So we're not talking about that.'",
        "'speaker_0': 'The other issue is we have families who have their children and everybody in their business, and there's a lot of them. And they they take a draw from the business instead of paying individually and putting people on the payroll.'",
        "'speaker_0': 'So there are a lot of instances of that.'",
        "'speaker_1': 'So that sounds like something for council to discuss and decide on because we're going to we're going to refine our suggested criteria so further.'",
        "'speaker_0': 'Councilmember Adobe. Another question I had is the 20 $500. What is that amount based off of for the tenants, residential tenants. So they speak to this one. Whatever what I'm told. Debbie, why don't we go?'",
        "'speaker_1': 'We need to move this along a little bit because we haven't even gotten to public comment or council comment, so we don't need to deliberate. Just, you know, if you've got the answer. So, Miss Potter.'",
        "'speaker_0': 'If she's not answering.'",
        "'speaker_1': 'I'm. She's.'",
        "'speaker_4': 'You're on me.'",
        "'speaker_1': 'You're muted still.'",
        "'speaker_0': 'Laura, let me let me give you the best answer I have so we can move along. It was based on the average grant, to my knowledge, in Academy this year. And and there's a is there again, it's not based off of the number of tenants living at a given property.'",
        "'speaker_0': 'So it's not based off of like a like a person that lives, for instance, in a studio isn't going to get a low. It's is up to. Up to. So what do we mean by sort of just up to 2500?'",
        "'speaker_0': 'If your rent was 1300 dollars, you only get 1300 dollars a month. I don't think you. That's what I was getting at. And then finally, are landlords available able to some landlords that landlords also have to pay for business license here in Alameda.'",
        "'speaker_0': 'Are they able to get qualify for the 70 $500 grant? And then would they also be able to get paid through rent relief? So landlords would not be able to get paid through rent relief, except if a tenant within their building is qualified for it and it's only for residential rent relief.'",
        "'speaker_0': 'And then secondly, we don't have landlords coming in as a qualifier. So even though they pull business licenses, they're still not part of the recommendation to say yes. Okay. Thank you.'",
        "'speaker_1': 'Offer you Councilmember Gill. Yes. Okay. Any other clarifying questions for here next week?'",
        "'speaker_3': 'Thank you. I have two questions and I'll ask them both. Then you can answer them both. Can you speak a little bit to the I understand the need to have a physical establishment, but the home based business is a single, single sole proprietor working out of their out of their house.'",
        "'speaker_3': 'I'm a little curious how that decision was made and what the thinking was there. And similarly, I'm curious about the conversation that had that was had around showing 50% loss of income versus the last program. 20%. And and obviously, I understand that the.'",
        "'speaker_3': 'Likely thinking was, Oh, we should help people who have lost more money. But if we thought about whether or not the impact that the money that's being received in terms of bringing people back and then keeping them moving forward is the same.'",
        "'speaker_0': 'Okay. So the physical establishment we do we we found that people who have sole proprietorship proprietors, they are sole proprietors and then working out of their home, a lot of them are not able to work any longer and they have no source of income at all except, you know, the ones that that that businesses that are in'",
        "'speaker_0': 'established locations have. And so there there really wasn't. If we're going to bring sole proprietors, then there wasn't any difference between them and and the folks working out of their home. Both of them have like mortgages or rent to pay.'",
        "'speaker_0': 'And so so we didn't find that there was a good reason to exclude them. And then with regards to the 50% versus 20%, it was it was a consideration that council asked us to come back with not the amount, but with a higher amount other than 20%.'",
        "'speaker_0': 'And in in conversations with with people that have called the city and emailed the city, a number of them asked for higher amounts. And in our webinars, a number of people asked for higher amounts. And so we, we, we went with the 50% amount because it was the amount that was most asked for.'",
        "'speaker_1': 'Thank you to all of you, Vice Mayor. Yes. So asking me a follow up in a couple of the answers you gave Miss Butler. So on the home based business, um, I understand that your home based business might be out of business and you're not making income, but I wrote in my notes.'",
        "'speaker_1': 'But you don't have the overhead that a commercial business who has to rent their space would have. And then you you mentioned whether they have mortgages to pay. But are we also looking at this program to provide mortgage assistance?'",
        "'speaker_1': 'Because I. A, I think there are federal programs if you have a federally backed mortgage that you can apply for. So, um, I, this doesn't also include general mortgage assistance, doesn't it's butler.'",
        "'speaker_0': 'Well, it includes operating costs. So somebody with a business, even if they're looking at what this is, if this is similar to the last grant where you can pay employees operating expenses, etc. a little bit.'",
        "'speaker_1': 'So okay, but just a homeowner who's having a trouble paying their mortgage, we're not providing relief under this program for that. Right.'",
        "'speaker_0': 'It's for their business. It's for their business.'",
        "'speaker_1': 'All right. Um, let me get to my other clarifying questions that I have. Thank you. Um, let's see here. Um, I. Uh, um, in the staff report on page three and this is kind of the middle of the page and it's under the section on city funding.'",
        "'speaker_1': 'And the last paragraph is staff recommends, given the anticipated $1.2 million in direct funding for small businesses and tenant relief. And that's the, you know, putting, I think, CDBG money into it. And our previous 600,000 or maybe it's the additional 600 you were talking about that the city used this use its resources to leverage this commitment with'",
        "'speaker_1': 'a community wide effort to support local businesses and neighbors through a foundation led drive to raise money from residents. What what are we talking about? How are the how is the city going to leverage its resources?'",
        "'speaker_0': 'So it would be like staff time, for example. Okay. We're we're spending we're spending a ton of time. We're not we're not asking consultants to spend that time to help with the development of this program.'",
        "'speaker_1': 'Okay. I understand. Thank you. And then on the, um, this group Working Solutions. So we ultimately administer the moneys raised. I guess if we approve them, are there are they the only fish in the sea or are there other other entities that do this sort of thing?'",
        "'speaker_1': 'Do we do comparison shopping only because that 13 to 15% of the money raised takes my breath away. Did did we have the opportunity to.'",
        "'speaker_0': 'Look at it? I, I, I have tried to find others that do similar work, but this report was doing in a short period of time.'",
        "'speaker_1': 'Quick turnaround. Okay.'",
        "'speaker_0': 'So I didn't I didn't find anyone. I'm sure there's others out there.'",
        "'speaker_1': 'Oh, right. That's that's certainly a fair answer. And then a couple other questions. The, um, so I understand that you met with all these representatives of the business associations and consulted with Ms.. Potter about the rent relief. I think, you know, she's certainly knowledgeable from her vantage point.'",
        "'speaker_1': 'What about nonprofits? How were they represented in the discussion?'",
        "'speaker_0': 'Unfortunately they weren't. They had two days from the time, took the last meeting.'",
        "'speaker_1': 'That's adequate answer. And I just want to say, um, this is just my, um, editorial comment for those who are urging the city to move quickly and don't hesitate, people. We brought this to you. The city council moved really quickly and staff is multitasking like there's no tomorrow.'",
        "'speaker_1': 'We are moving quickly. If if any business association wants to go out and do their own go fund me campaign. We are stopping you. But thank you. Okay. With that. Those are all my questions. But there's another one.'",
        "'speaker_1': 'Sorry, Tony. I'm sorry.'",
        "'speaker_4': 'Just a quick question on the $600,000 for rent relief that's I guess, funded in part by the CDBG dollars. And I think there's an expectation that this will be for low income tenants. How are we going to do that?'",
        "'speaker_4': 'Let's say for a particular example, if there are three people who are unrelated and they're sharing a unit, are we going to have because that that by definition, even though they're unrelated, they were a household. Are we going to take all of their their income data or are we just taking the income data of the leaseholder?'",
        "'speaker_4': 'So how are we going to account for household income? Because I think that's what.'",
        "'speaker_1': 'Yeah, I can, Potter. You want to take that?'",
        "'speaker_0': 'Yeah. I think I'll take a run at this one. So an interesting question. The staff report that will be published later this week is going to talk about the program, which is CDBG funded. And we're proposing to contract with building futures to run the program.'",
        "'speaker_0': 'They did a similar they ran a similar program for us back in the days of the Obama administration, the RCN, when we got rapid rehousing money. And we will work with them so that we all have an answer for you at the next meeting about how a household would be defined.'",
        "'speaker_0': 'You can appreciate.'",
        "'speaker_4': 'It.'",
        "'speaker_1': 'All right. To be continued, Councilman Brody.'",
        "'speaker_4': 'So just a couple of questions that popped up. So the 600,000 CDBG that you're proposing the city put into this fund, is that subject to this 13 to 15% cert or administrative charge?'",
        "'speaker_0': 'So yeah. Just to go back to the leveraging the question about the leveraging. I think what we're saying is that the council has independently approved the small business, the COVID grant relief program, and then we will be bringing a rent relief program to you for low income tenants.'",
        "'speaker_0': 'And the two programs in combination add up to a $1.2 million funding commitment by the city that we then can go to the community and say the city has stepped up with 1.2 million in programs. Here's an opportunity for you to match that to exceed that.'",
        "'speaker_0': 'But it'll be its own program.'",
        "'speaker_4': 'Okay. Well, thank you. And then, I mean, if someone maybe a landlord, but they're also have a property management business, I mean, they would be eligible, right. Because, you know, they're not technically I mean, that's not their only line of work.'",
        "'speaker_0': 'I believe rent. Oh, yes. A property management firm would be eligible.'",
        "'speaker_4': 'Okay, good.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_1': 'All right. Any further clarifying questions? Do we have any public speakers, Madam Clerk?'",
        "'speaker_2': 'We have no one that has submitted anything to be read into the record. But at this time, we can ask any attendees who would like to comment on this agenda item, which is just to remind everybody the Community Relief Fund.'",
        "'speaker_2': 'Anybody who wants to speak on this. There's two who have raised their hand. And we will meet them in time them.'",
        "'speaker_1': 'And if they're only two, then they would each be eligible for 3 minutes of.'",
        "'speaker_4': 'Am I on?'",
        "'speaker_1': 'Yes. I mean, if you want to call that for a speaker.'",
        "'speaker_4': 'Ron Muni, I appreciate the count, but thank you.'",
        "'speaker_3': 'Madam Mayor. Council I appreciate the council and staff's quick.'",
        "'speaker_4': 'Work to assist our community in this trying time. I support the creation of funds to assist the community to raise needed moneys for residents and businesses. I do believe that the funds should be split though, so potential donors may donate to a residential fund and a separate business nonprofit fund.'",
        "'speaker_4': 'I would say nonprofits probably can do their own fundraising, but I don't think they should be excluded. I would hate to see someone not donate if they objected to either receiving funds from the percentages described or revised. I also believe that what is normally considered confidential information by those requesting the grant should not be made public.'",
        "'speaker_4': 'For example, a business's exact income and expense figures should not be released publicly. Likewise, whatever personal income residents should have would not be released if they request the grant. The city needs to protect the residents and private businesses.'",
        "'speaker_4': 'Confidential information. And finally, I don't understand the mayor's comment. I believe we're all trying to work together quickly to help our community members. Thank you.'",
        "'speaker_1': 'Okay. Our next public speaker.'",
        "'speaker_4': 'Felix Diaz.'",
        "'speaker_1': 'Yes. You're on.'",
        "'speaker_4': 'High. Hi.'",
        "'speaker_1': 'Yes, we can hear you, sir.'",
        "'speaker_4': 'Hi. My name is Felicia. I licensed massage therapy and working for the office. So my question is due to the situation with the coronavirus pandemic. So we a has been has been big affect a little bit more and with with our business.'",
        "'speaker_4': 'So my question is am I going to be how the city of the what and I doing really well no.'",
        "'speaker_3': 'So what my I am wondering if I if I can.'",
        "'speaker_4': 'Come come back to work in the.'",
        "'speaker_3': 'Chiropractor office.'",
        "'speaker_1': 'So I'm just going to make a statement. And Madam Clerk, I shouldn't be timed on this. Mr. Diaz, this is simply public speaking where we hear public comment. But I will tell you that in answer to your question, because I want you to receive assistance as a small business person, you should go to the website of the'",
        "'speaker_1': 'Alameda County Public Health Department that has updated information about what what businesses are open and that that email address is a c.'",
        "'speaker_0': 'T.'",
        "'speaker_1': 'H d dot org crate. Correct.'",
        "'speaker_0': 'So a.'",
        "'speaker_1': 'C, p, h d or gets the initials for Alameda County Public Health Department.'",
        "'speaker_0': 'Talk. Right.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'All right. Thank.'",
        "'speaker_1': 'Bye bye. Okay. All right. And that was the extent of our public speakers.'",
        "'speaker_2': 'Correct?'",
        "'speaker_1': 'All right. So I will close public comment and I will open counsel discussions. Who wants to to lead us? Councilmember De Foxx.'",
        "'speaker_4': 'I just want to say I just want to say thank you very much. When I in reading the staff report and the reference to looking at CDBG. I really appreciate that you guys turned as much stones as possible in looking for possible source of funds for for these programs.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'That was it.'",
        "'speaker_4': 'Now that.'",
        "'speaker_1': 'Certain sweet. Okay friends merry next. Right then Councilmember Odie.'",
        "'speaker_3': 'So I had a quick question. The first half that related to the EDC, uh, the community fund, how quickly can they solve it? Other communities already have these set up. How long do we expect if this is we gave direction four weeks ago.'",
        "'speaker_3': 'How long do we think this is going to be before we have something set up?'",
        "'speaker_0': 'We're hoping to have it set up by the end of the week. There's there there's a back and forth with community. Is there community foundation? And hopefully we will have terms by the end of the week.'",
        "'speaker_3': 'Excellent. Thank you very much. So I think my my comments did, I think play on some things that the vice vice mayor the other council member Vela still vice mayor in my heart. Uh the is Mr. Mooney mentioned separate funds for residential and, and business.'",
        "'speaker_3': 'And I think that I would like to hear a little bit more thought on that. I personally, I think most people who want to help our community are going to be happy to help our community. And it might just be easier to have one place to put the money.'",
        "'speaker_3': 'If this is if this is the proposal that came out of the discussion with Waba and Darva and the folks who who were engaged. I think I'm comfortable with that. But I do think that there's I'm uncomfortable with the sole proprietor in House proposal.'",
        "'speaker_3': 'I, I want to make sure that we are that that what we move forward here is attacking the the problem or the, you know, providing the solution for what we want to achieve. So whether or not this is to just provide debate, I think at least in the original round, we really wanted to make sure that we'",
        "'speaker_3': 'were providing support that would continue the viability and the strength of our community, business districts and whatnot. Which isn't just to say that there aren't people that are hurting who could use help as well. But I think we just want to think about whether or not that, you know, we are this this is a big shift.'",
        "'speaker_3': 'We're going to be, you know, I mean, CPA's could be getting money who are working in their in their office or or whatnot. I'm not confident that. I'd like to I'd like to make sure that we're being mindful that that that is that is what we are aiming to do.'",
        "'speaker_3': 'I as as I was to you two weeks ago, I am a little concerned about the 50%, the shift towards making a lot of money, a threshold here. I think that there are probably businesses that will receive the 70 $500 and never come back because they have lost too much, too much money and they have had to'",
        "'speaker_3': 'come back. Whereas I think that there are businesses that may be struggling very greatly who have lost 20% and for whom this could be the lifeline that continues allows them to continue. I don't you know, I don't know what that analysis looks like that would need to be done if we're going to drop this 50%.'",
        "'speaker_3': 'But I would want to make sure that we're not providing money to businesses that may have been so harmed that they are not going to come back. Because I think really what we're trying to do is, is I see this as this program.'",
        "'speaker_3': 'The previous program is really about that, like that lifeline that serves to really help people stay afloat while we get to a place where they can reopen and and continue to be strong. Other than that, I do appreciate there's a lot of work that went into this.'",
        "'speaker_3': 'And I appreciate how knowing that this is going to could be set up and working. And on Friday, I think it's a it's a fine model. I you know, my experience, which is somewhat limited, but I have worked with a number of foundations, 13 to 15%.'",
        "'speaker_3': 'Administrative costs is not anywhere near unheard of. In fact, I would say it's fairly standard for managing funds. And so I wouldn't want to lose weeks trying to you know, I think we should should see what we can do to negotiate that down.'",
        "'speaker_3': 'But, you know, my interest is in seeing this getting out there so that we can actually start collecting donations from our community and getting them where it needs to go. So thank you.'",
        "'speaker_1': 'And before I call on Councilmember Odia, I will just in response. I do think we have a fiscal duty to at least explore more than one option for administrative. It might be that 13 to 15% is just standard in the industry.'",
        "'speaker_1': 'I have no experience with that. But you stop and think about if this is a fund that raises $1,000,000, that's money that if if if it's the going rate, it's the going rate. But that's money that isn't going to help the people we're trying to help.'",
        "'speaker_1': 'And then I would just question how much administration it's requiring, but we can further discuss that. Councilmember two You had your hand up next.'",
        "'speaker_4': 'Thank you, Madam Mayor. And thanks to Lois, Ms.. Butler and Ms.. Potter for that presentation. And I think the mayor had mentioned it earlier. You know, we have been moving really quickly, and I know you guys are running on fumes, so I appreciate it.'",
        "'speaker_4': 'Just to pick up on the mayor's point, I mean, that that is a big chunk of money. I mean, everyone is taking, you know, a literal haircut of sorts, you know, in their businesses. I don't have my real one, but that's my first world problem.'",
        "'speaker_4': 'I mean, maybe some of these people that are managing this, you know, should also take a little bit of a haircut and, you know, lower their rates for us because, you know, this is something that we're doing to help all of our businesses and our tenants and our nonprofits.'",
        "'speaker_4': 'And, you know, to the mayor's point earlier, also, I mean, we are in this together. So I hope that we can we can work on getting that number lowered a bit. I I'm glad we have the, you know, landlords that are property managers because, you know, they're business people, too.'",
        "'speaker_4': 'And, you know, I know we've asked a lot of them recently, and so we should allow them to be treated as business people. You know, the one thing I district we did in the staff report, I do think we should consider adding another 300,000 to the grant program.'",
        "'speaker_4': 'I realize that's a big chunk of money. But, you know, to me, it's not spending as much as it is investing because if it is, the difference is that the vice mayor said and the mayor said between going out of business and surviving, you know, these are the businesses that are actually going to generate tax sales tax'",
        "'speaker_4': 'revenue in the future. These are the businesses that will be paying workers who will be spending money is money and other stores. So, I mean, to me, it's worth an investment of 300,000. You know, if if, for example, if we don't spend it and we lose another, you know, 2 million in sales tax revenue, you know, then'",
        "'speaker_4': 'we, you know, we're kind of pennywise pound foolish. So I'd like to see us augment that that fund and the home based businesses. I mean, I know a lot of them have recurring expenses that are just not related to their mortgage.'",
        "'speaker_4': 'They can have their business insurance, they could have utilities, you know, they could have their licenses. And I thought it was instructive that I assumed the person that came on, Mr. Deeds, was a massage therapist. You know, that's a business that, you know, a lot of people run out of their home and, you know, they're not able'",
        "'speaker_4': 'to do their job. So, I mean, I I'm glad that we're we're looking at sole proprietorships and and helping out some of these sole proprietors because, you know, they're really struggling. And if you cut hair, you know, in your in your spare in your garage or something, and you can't do that.'",
        "'speaker_4': 'I mean, that's something that, you know, people need to be able to be, uh, eligible for assistance. You know, I'm, you know, attorneys and accountants and other professionals, you know, they're probably facing a loss of work too, so I don't have any problem adding them to the list.'",
        "'speaker_4': 'And, you know, I'm the mayor. I mean, I go on the Tuesday afternoon call and there always seems to be a discussion about how sole proprietors have been left out of the programs that we've done so far. So, you know, these people help move our economy and our city as well.'",
        "'speaker_4': 'So I'd like to see them involved. I think that was all I had. Yeah. I mean, my colleagues are interested in, you know, awarding more grants out of the original 600,000. That's something I think is is money well spent?'",
        "'speaker_1': 'And all for you, Mr. Modi? Yes. Councilmember Vela.'",
        "'speaker_0': 'Thank you. One thought that I had was relative to administering the fund or fund is whether or not we could have an Alameda business actually apply to do that. Maybe this isn't, you know, could could we perhaps that's one way that we help a business out is to give them that business so that the percentage is actually'",
        "'speaker_0': 'going to them. So it's just the thought that I had. I wouldn't want that process to be too encumbered in terms of causing an unnecessary delay. But I know that staff was trying to turn this around in a in a quick timeframe, but it seems to me that maybe some of these individuals who are looking for work'",
        "'speaker_0': 'and have some experience administering funds, we could we could get it out to them or a couple of people that could work on it, maybe somebody doing the accounting side of it and something else doing the other administration in terms of the residential, I actually think that we need to increase it.'",
        "'speaker_0': 'I have a problem saying this is the average. I worry about our families that are perhaps paying a little more in rent to the money is going to go a longer way in keeping a larger group of people housed and also who have a higher held to to climb in terms of coming back from, you know, perhaps'",
        "'speaker_0': 'having a loss of income and being unable to pay. So I would actually consider increasing the amount to residential to up to 3000 or 3500 based off of whatever a single month's rent is. And then obviously you might have some people who have substantially less.'",
        "'speaker_0': 'And I think we could make up the difference. But I just to me, if we're only going to be paying a portion of one month's rent and it seems like we're hurting people who might have more bedrooms and that means hurting families.'",
        "'speaker_0': 'I think in terms of the strategy for all of this, I do I do want to prioritize. DICKERSON Brody's point that, you know, there are some businesses that generate sales tax, that there will be some businesses that don't generate sales tax.'",
        "'speaker_0': 'And I do think that when we're looking at this and we tried to be kind of mindful, but there are some businesses that are going to be really necessary to and helping other businesses get back to work and things like that.'",
        "'speaker_0': 'And I think that we need to maybe think about how we can go about prioritizing that. Childcare, for instance, is going to have to completely change how they operate, which could impact their ability to operate if they aren't getting assistance because they can only have 12 children together.'",
        "'speaker_0': 'There's different requirements now that are in place that might make it harder for them to operate. And that's going to mean it's harder for people to get back to work because they don't have childcare. In terms of the sole proprietors, I would want to reduce the amount.'",
        "'speaker_0': 'I'm not saying that they are valuable, but part of the intent of establishing the grants was to help as many people as possible and to have that down to helping workers. I'm sorry. Hold on. I am concerned that if we if we have it where we aren't going to cap the amount for sole proprietors, potentially we're giving'",
        "'speaker_0': 'a lot of money to one individual and one individual's overhead is substantially less than somebody who is employing a number of different people. And I've been on those calls, too, and I know that people support sole proprietors are getting left out.'",
        "'speaker_0': 'One thing that I will remind my colleagues is that they're now also included in the pandemic unemployment assistance and can can now recoup through that which which hadn't been established when we started these calls. So I'm willing to help them, but I do want to cap that and I do want to cap the number of sole proprietors'",
        "'speaker_0': 'that we would ultimately help as well. So I'd be interested in saying a sole proprietor could maybe get up to half of what we're offering the other grantees and that only so many sole proprietors. And we would only be giving out so many to so many sole proprietors because I really do want to, you know, hopefully we'",
        "'speaker_0': 'get to a place where we can help everybody that applies. But I do. And I would be interested in kind of cheering things to say kind of in the first round that we're including them. We're only going to help this money and then we'll expand it after we've helped the first wave of people.'",
        "'speaker_0': 'And then the other question that I had was, is there a difference of cost or for some time involved in administering two funds versus one fund? So we had a residential rent fund versus a commercial business fund. Does that increase the amount of work that goes into actually administering?'",
        "'speaker_0': 'And if so, is that worth the cost of having the two separate funds? And that and that's something that I just would need a little more information on before I make that decision. I will also say that the other thing that that happened before was, you know, originally back this is weeks ago, I had had some conversations'",
        "'speaker_0': 'that they would start a go, fund me, let's help our businesses. And some of the pushback that I actually got from one of our business associations was, well, different businesses have different followings with each business, have their own go fund me.'",
        "'speaker_0': 'And, you know, some businesses don't necessarily have that fund fund following. And so I'm a little concerned, again, about kind of further separating. I think that. But now now people are saying, let's have this go fund me. I think it's easier, administration wise to just have one fund and then go from there rather than the two.'",
        "'speaker_0': 'And to the vice mayor's point that I think people who are willing to help are willing to help regardless of who's included. But I happen to think you.'",
        "'speaker_1': 'Thank you. So I really go last. And I actually do think that we should follow the model of other cities and make the pots separate. It's kind of like when I'm donating to one of the different educational institutions I've attended.'",
        "'speaker_1': 'You can donate to the the general fund and that institution, or even like Doctors Without Borders, you could say, Oh, I wanted to go to this country or just put it where you need it. But I do think it respects the donor.'",
        "'speaker_1': 'And and I and other cities are doing that. They're having the separate parts. And as far as the cost of administration and administration itself, I am I'm concerned. I like the idea of supporting Alameda business by bringing the work to them.'",
        "'speaker_1': 'But this is very specialized business. And if a firm had not done something similar working with the city fund like this, then I don't think this is the time to try out something new. I think it's and probably staff has even done this.'",
        "'speaker_1': 'It reached out to Berkeley, Oakland, San Francisco, seeing who they're using, what percentage are you paying? I liked whoever it was who suggested maybe it's this is the time to negotiate a little. Let's be bold and courageous. But I would say.'",
        "'speaker_1': 'But the donors decide where they want to put their money. And I think we'll get some pretty generous philanthropy and also just, you know, everyday individuals. I I'm having a real hard time with the sole proprietor, and I just want to make sure we understand there's a difference between being a sole proprietor and being home based sole'",
        "'speaker_1': 'proprietor. I'm not sure. The gentleman who is the massage therapist told us he was home based. I might have missed it, but. But I just think if we had nothing but money to disperse, I would look at this differently.'",
        "'speaker_1': 'But I do believe that we're trying to help our business districts and and then the various institutions that help support our community, and that includes nonprofits. And so I just think that we should really give thought. I mean, we saw how many grant applications we got for a limited amount of grant funding, and we weren't even I'",
        "'speaker_1': 'don't think doing home based, I don't think we were doing home based sole proprietors then. Um, and then I like the suggestion that Councilmember Vela just made about increasing the amount of available rent because again, you can only get one month's rent.'",
        "'speaker_1': 'It's not like you're going to make a windfall, but this actually has a double impact because it helps that family or individual or what have you stay in their home and it's paying that landlord who would be out of their income.'",
        "'speaker_1': 'So so let's do that. I also would like council to consider maybe shifting the percentage of these pots just a little, because right now it is 60% to the small businesses and then 20% renters, 20% not nonprofits, I would say maybe 50% of the fund to small businesses, 25 renters, 25 nonprofits.'",
        "'speaker_1': 'But I'm that's just, you know, my my thinking. And I and I do think we've got a lot of nonprofits out there that are are serving our community in in many different ways. I think that we also go into my notes really quickly.'",
        "'speaker_1': 'Um, I'm a little concerned with just transferring over all of our applicants from the grant program into this Alameda strong program because it might give the impression that some people are getting a head start when this is a new program where we're introducing.'",
        "'speaker_1': 'But consider that. And then, um, I, um, I think that that is, oh, should we require a minimum time of business has been established something to consider. Um, and then I do want to just give profuse thanks to not only the amount of work you've done to bring this forward to us, but the short time in which'",
        "'speaker_1': 'you did it, given the length of time that a staff report has to be submitted ahead of time. So. Yeah. Mr. Potter. Yes.'",
        "'speaker_0': 'Hi. I just wanted to clarify. Vice Mayor Knox White had said I'm okay with these percentages since they've been vetted with the business community. And I just wanted to clarify that. I think the business community, they are primarily interested in seeing all of the funds go to the small business community.'",
        "'speaker_0': 'However, staff, based on the comments we heard from council at the May 5th meeting, there was interest in making these funds available to renters as well as to nonprofits. So this is staff. Dation. We have input from the business community, but the six 2020 was staff recommendation.'",
        "'speaker_0': 'But I will say if there's a consensus on the council that the parts be separate and people can select. You don't really need those percentages at that point because then you would just be designating where you would want your funding to go.'",
        "'speaker_0': 'So it would probably be helpful for us to have some consensus direction from Council on on that issue.'",
        "'speaker_1': 'So I'll put in my $0.02 worth. Ooh, I think I need a motion to have a couple more minutes. It's always tricky when you're running the meeting because some of your time gets there. May I have, uh, Councilmember Vela?'",
        "'speaker_0': 'I'll move to add 2 minutes time. Is that sufficient or. 3 minutes.'",
        "'speaker_1': 'Is good.'",
        "'speaker_0': 'Okay, 2 minutes for the second.'",
        "'speaker_3': 'Second.'",
        "'speaker_1': 'Who is that? Councilmen. Vice mayor. Vice mayor. Okay. A roll call vote, please.'",
        "'speaker_2': 'Councilmember de SAG. Knox Light.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Odie. Hi, Vella. I may or as he Ashcraft.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'That carries my faith.'",
        "'speaker_1': 'Thank you all.'",
        "'speaker_0': 'Last night and raising my hand.'",
        "'speaker_1': 'Hi. Lois and Isabella. Yes.'",
        "'speaker_0': 'I just wanted to clarify one point, and that was with regards to transferring all of the the applications to the new fund, we weren't recommending that. We were only recommending if there was a go fund me set up ahead of time.'",
        "'speaker_0': 'The business associations had indicated that they would use the same the same applications, but for the new fund that we weren't recommending to do it the same way.'",
        "'speaker_1': 'I see. Thanks. Thank you for that clarification, Mayor.'",
        "'speaker_2': 'As you said, it's the city clerk and we have an attendee who keeps raising and lowering his hand to try and get our attention. But you have closed public comment, so we just need to announce that anyone with a raised hand public comment on this item is closed and therefore will not be heard.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Yes. And it goes the same way it does in a regular council meeting. We we hear the folks who have their hand up or have seen their comments and we ask if there are any more. There were. And then I close public comment.'",
        "'speaker_1': 'So my concern is that we might lose some donors if we said, you donate to this and we'll decide where it goes. But I also want to be able to help our businesses so council come up with a solution.'",
        "'speaker_1': 'I'm delegating. Councilmember Vela.'",
        "'speaker_0': 'I don't have a problem having the two funds or the would the nonprofits be in the fund with the businesses or would they be in the fund with the residential?'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'I think I think we had, at least in the staff report, that the non-profits would be their own fund at 20% residential assistance. So three training and then 63 fund. And I just wanted to clarify, because we've been we've been talking about it as if the two funds that I just wanted to go.'",
        "'speaker_1': 'No, I was going by the percentage breakdown and just suggesting we shifted a little over.'",
        "'speaker_0': 'I'm a little.'",
        "'speaker_1': 'Cautious. I know our businesses have huge needs, but there was no representation from the nonprofit community. And, you know, I'm thinking of we could name a whole list of them in our community. And so and I think I was making the analogy that say you donate to Doctors Without Borders, you could say, I want to donate to'",
        "'speaker_1': 'the efforts in X country or region. But you can also say, I just donate to you and put it where you need it. And I think it's possible to do this sort of thing. At least the gentleman who approached me about starting this indicated that it was so in that.'",
        "'speaker_0': 'In that instance that a mayor would have been if I gave, let's say, $100, $50 would be given or it would be distributed based off of the percentages of funds. In that case, if I was a general donor.'",
        "'speaker_1': 'These are good questions that were down there. Yes. Ms.. Potter. Ms.. Butler.'",
        "'speaker_0': 'Yes, yes. Yes. Okay.'",
        "'speaker_1': 'Butler And if you didn't wanted to do it that way, I guess you could designate your percentages. Correct. I want to donate $50 to the renters and $50 to nonprofits or. Something.'",
        "'speaker_0': 'And then I did have another.'",
        "'speaker_1': 'Sorry. Someone's going to clarify, Miss Butler.'",
        "'speaker_0': 'I was going to clarify that. I didn't ask them that, but I'm sure that we could work something out.'",
        "'speaker_1': 'Okay. Missoula.'",
        "'speaker_0': 'Councilmember Vela My other question was, if we have a fund that gets substantially funded and we have one or two other funds that is substantially underfunded, and is there an ability then to move the money or is it then stuck in that one fund.'",
        "'speaker_1': 'That's sort of seen as like a legal as well as procedural answer? As a city attorney, do you want to weigh in? I realize why it might be too strong a verb, but would.'",
        "'speaker_4': 'I don't I mean, I don't. I think there are a lot of flexibility in how the council would direct us to set up these funds. And depending upon your direction, we won't do it, given the flexibility possible.'",
        "'speaker_0': 'But I do believe that once you give people the option to pick, I don't think you would want to go back if there was an under-funded fund and move money around, because I think that then that's not the spirit of you you're allowed to select.'",
        "'speaker_1': 'Mhm.'",
        "'speaker_4': 'Right. And so to add to Miss Hunter's point, if, if the council's interested to have funds shipped around, we would have to advertise that early on to say that funds might get moved depending upon a certain threshold. So it will largely depend on where your direction is as to how we do it.'",
        "'speaker_1': 'Well, Mr. Shand, wouldn't it also be possible that the shifted funds would come from the donors who just said put it wherever the need is?'",
        "'speaker_4': 'Sure. Sure.'",
        "'speaker_1': 'Okay. Vice Mayor, you had your hand up. I think.'",
        "'speaker_3': 'I think this conversation is.'",
        "'speaker_0': 'In the weeds.'",
        "'speaker_3': 'Well, no, I was going to say is moving me toward supporting the idea of separate funds. I think I feel like I. I was a little surprised to see when we came back that there was a single fund for three different uses.'",
        "'speaker_3': 'I think when you're going out and asking people to contribute to things, they are more likely to contribute to things. If they, you know, if it if it's really clear what it what it is, they're they're doing it and I think fund a mix of different things in Alameda is a less successful pitch then help me help'",
        "'speaker_3': 'renters in need help nonprofits in need help businesses in need. I do think with the businesses and nonprofits, I think we should look at possibly three. I think if we can always have a submittal form that says, would you like to add money for renters or nonprofits as well so that you can ask people to donate to'",
        "'speaker_3': 'all three at the same time? Um, but I think if, if we are going to do that, I think, you know, I know we had a number of nonprofits that were successful in getting PPE funds and so making sure that we are if we're going to, if we're going to do nonprofits and if we're going to do'",
        "'speaker_3': 'businesses, maybe we're helping people who are not successful in those other programs.'",
        "'speaker_1': 'And I do believe that's a criteria, isn't it? Yeah. And then I think. Did I see Councilmember? No. No, it's.'",
        "'speaker_0': 'Uh, it's.'",
        "'speaker_1': 'Um, it.'",
        "'speaker_3': 'Was a criteria that they had to have applied for it in the last round of.'",
        "'speaker_0': 'My career. Well, well, wouldn't it.'",
        "'speaker_1': 'Would it not be something you'd consider when you were looking at income? You know, losses and an income.'",
        "'speaker_0': 'Um, it's, it's not something that we consider for the last round, but it is something that we could consider for this round.'",
        "'speaker_1': 'Okay. All right, counselor Brody.'",
        "'speaker_4': 'Thank you. And I neglected when I talked earlier to recognize Sara Henry Arpaio, who's also done a great job on this and many other things. It was nice to have her have a Saturday off. As you can see, she's in the EEOC right now.'",
        "'speaker_4': 'You know, I worry about whether, you know, I like the allocation of staff here, but I worry that if you know. One of these funds may get nothing. And, you know, in the end, I know it's for rent, but in the end, that rent is going to go to property owners who are basically business people.'",
        "'speaker_4': 'Nonprofits hire people and get out money in the community. And small businesses are small businesses. So, I mean, it's not like you're you're giving money to a tenant. It's actually going to be used to pay rent. And I worry about it being super complicated by splitting it up.'",
        "'speaker_4': 'And I also worry about if it's more complicated, is it going to be more costly? Um, you know, I'm not sure. Yeah, I'm just not sure I'm there yet.'",
        "'speaker_1': 'Well, I'll tell you, we need to we need to wrap this up because we've got a number of other items to cover, and we want to move this forward so we can start getting the money out. I, I don't think it's so terribly complicated.'",
        "'speaker_1': 'As I've said before, um, other, other charities do this sort of thing on a regular basis. And you know what I think? I think at the end of the day, people are generous. I've been very moved by just the stories of people coming forward, businesses, the things they've done to help other people.'",
        "'speaker_1': 'Right now, even businesses, even restaurants who are operating at a loss are helping provide meals for people who are hungry. So, you know, at some point, I don't know. I think you've you've got to see, um, the, the good in human nature.'",
        "'speaker_1': 'And I, I feel like I'm seeing more of the positives and the negatives through all these hard times. I would like to really see this move forward so we can start getting we have people lining up, wanting to donate to this fund.'",
        "'speaker_1': 'So, um, Councilman Brody.'",
        "'speaker_4': 'I may be in the minority on that issue anyway, but was there any other folks that would support the idea of, um, awarding more grant money?'",
        "'speaker_1': 'Oh, could I just address that really quickly? I in my notes, I said, could we wait until the budget hearing to decide on that? Just learn a little bit more about our finances.'",
        "'speaker_4': 'But.'",
        "'speaker_1': 'And do we need to know that to move this element a strong program forward?'",
        "'speaker_4': 'I know, but I guess it's not on the agenda for the budget meeting tomorrow and if the awardees are going to be announced by Friday. Um, you know, I don't know how long would I get if, if there was a sense that folks wanted to do that, how long it would delay getting money into the hands of'",
        "'speaker_4': 'our businesses?'",
        "'speaker_1': 'I don't know. Does the city manager want to address that again? I use the term loosely. Liberally. Hi.'",
        "'speaker_3': 'So we gave the council some options. You could do a couple items if you wanted to talk about tomorrow. I don't know. Can you continue this this item to following the meeting tomorrow? I don't know. I'm asking even on that.'",
        "'speaker_3': 'So that would be one option if you want to look at it after the budget to continue this item to, I guess, the council meeting and just this item to after the budget meeting so that you could make that decision.'",
        "'speaker_3': 'The other thing is we could come back on June 2nd. So if you're talking about adding money to this program, Alameda Strong, you could come back to June 2nd. But what I think Councilmember OTE is talking about is actually adding.'",
        "'speaker_4': 'To the.'",
        "'speaker_3': '$600,000 grant program itself. Is that.'",
        "'speaker_4': 'Correct?'",
        "'speaker_1': 'Councilman Rudy.'",
        "'speaker_4': 'Thank you, Madam Mayor. I mean, is it possible to just continue that discussion on possibly augmenting the grant fund to tomorrow and move forward today on the Alameda strong portion?'",
        "'speaker_1': 'Um. City attorney.'",
        "'speaker_4': 'So, Madam Mayor, I'm my city councilmember. It's my.'",
        "'speaker_3': 'Recommendation.'",
        "'speaker_4': 'Would be that you just simply continue the item so that you have a complete agenda item for discussion. You could certainly give direction on the item today.'",
        "'speaker_3': 'But.'",
        "'speaker_4': 'Nonetheless continue.'",
        "'speaker_3': 'The entire item till.'",
        "'speaker_4': 'Tomorrow.'",
        "'speaker_1': 'I would like to find a way to move forward on the Alameda Strong Program Community Relief Fund now, because I think it's we're really pushing staff to get this pulled together. And I and we've got a lot to talk about tomorrow to Councilmember Odie.'",
        "'speaker_1': 'Any other way you can seek and let's hear from the vice mayor. We'll hear a different from a different person right now.'",
        "'speaker_3': 'What I heard the city attorney say is that we could get very strong direction tonight to move forward in a very particular way with the community fund and then just delay the action along with the the other funding issue, too, after the budget hearing tomorrow, so that the staff would know exactly what we were directing them to'",
        "'speaker_3': 'do tonight. And it wouldn't delay it. It would it just wouldn't be the formal vote until tomorrow night. Is that correct, Mr. Chan?'",
        "'speaker_4': 'Yes. All I'm saying is that you don't bifurcate this item into smaller slices and continue the item. But yes, you could even take votes on this item tonight. It just that.'",
        "'speaker_3': 'You give yourself.'",
        "'speaker_4': 'The option to reverse yourself tomorrow night.'",
        "'speaker_3': 'Got it.'",
        "'speaker_1': 'Councilmember Vela, any thoughts? Councilmember de Thug Councilmember Vela.'",
        "'speaker_0': 'I'd like to wait and just take up the the conversation about potentially putting in more grant money, more money into the grant program with the budget. I also would like to focus on just getting this project off and launched.'",
        "'speaker_0': 'I think that if we if we could give money later, but hopefully we can focus our efforts on getting others to contribute now, which might actually reduce the need for more funds from the general fund, which is, I think, the goal.'",
        "'speaker_0': 'I am a little wary of kind of making it overly complex in terms of administering. So I defer to staff or whoever is going to administer about the number of funds. We can also just have one fund that people can earmark what they put in.'",
        "'speaker_0': 'That's another way people do it. Can they get a little less complex of administering multiple funds and you can market it to say, look, this gives to this. I just wonder if there's different nonprofits or grant making places out there who will only give to certain things like they won't give to businesses, but they'll give to a'",
        "'speaker_0': 'fund to support nonprofits. And that's why I think there would be a value in kind of allowing nonprofits to have their own funding. If that's the case, I'm out of time.'",
        "'speaker_1': 'But I think we voted to give everyone every.'",
        "'speaker_0': '20 minute minutes. Okay, so this.'",
        "'speaker_1': 'Is good for the gander. Yeah.'",
        "'speaker_0': 'And then, you know, so I think, you know, I defer to them, but I would like us since we are setting this up, since we really only went to one person. I if there is somebody in Alameda who has experience administering funds and I think there are because the city's office and yeah right but but there might'",
        "'speaker_0': 'be somebody I would like us to see if there's an Alameda business that has done that or a professional that has done that. And there may be somebody. And then at least where we're giving back to an Alameda an Alameda business.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'And I would want it to be I would want it to be anybody who has experience administering any public fund because their cities, their special districts, their school districts. But if you have that sort of experience, I would want to consider them at least.'",
        "'speaker_1': 'Okay. Ms.. Potter, then Mr. Odey. Did you have your hand at my left?'",
        "'speaker_0': 'Yes. Thank you. I was just going to say that I fortunately the budget workshop is tomorrow evening. So I think that staff is fully able to keep moving on, setting up the foundation and can then incorporate any decision that might be provided tomorrow night regarding funding.'",
        "'speaker_0': 'So I feel that we can absolutely move forward with the direction we proceed tonight.'",
        "'speaker_1': 'If it's at all possible to move this item tonight, I would like to do that. Councilmember Brody, you've got your hand up, sir.'",
        "'speaker_4': 'I would also like to move it forward, but I'd also like to have the option to consider the additional funding tomorrow as part of this.'",
        "'speaker_0': 'Plan and.'",
        "'speaker_1': 'Make a motion.'",
        "'speaker_4': 'Is there a way to do that? I mean, I got like a fuzzy maybe you shouldn't, but I didn't get like, well, you can do this if you do X, Y and Z. And if you can tell me what X, Y, and Z is, I'll make that motion.'",
        "'speaker_1': 'Um, who are you referring that to?'",
        "'speaker_4': 'The city attorney. Yes. And so, Councilmember.'",
        "'speaker_3': 'Odom, my recommendation would be that you.'",
        "'speaker_4': 'Make a motion.'",
        "'speaker_1': 'I got it right there. Go ahead. Mr. Shinn?'",
        "'speaker_3': 'Yes. And Councilmember o.T.'",
        "'speaker_4': 'My recommendation is that you make whatever substantive motions you want to make tonight and then make a motion to continue this item along with the special meeting until the conclusion of the budget hearing tomorrow night for a time, certainly you can set it at, let's say 7 p.m. and you start when you can start.'",
        "'speaker_4': 'And then this item will.'",
        "'speaker_3': 'Again be called.'",
        "'speaker_4': 'The special meeting. And the I, along with this item will be called after the budget item. And then at that moment you can add whatever.'",
        "'speaker_3': 'Other funding.'",
        "'speaker_4': 'Or anything else you use that makes sense. Well, that is a recommendation. Is there anything preventing us from doing it the other way? Approving because this was multiple parts. You know, it wasn't just one one item. We can sign off on the alameda strong portion and then defer the discussion on the, um, whether or not we agree'",
        "'speaker_4': 'with staff's recommendation to not provide more money until tomorrow.'",
        "'speaker_1': 'So essentially the bifurcate is.'",
        "'speaker_4': 'What you're saying is, is that not permitted? Or is it just your recommendation? Because can you get us to. Yes.'",
        "'speaker_1': 'Here and as far before we go back to city, no. And then before we go back, the vice mayor has had his hand up. And I want to I want to.'",
        "'speaker_3': 'Well, I guess I believe we've been given that direction. Direction? Why did we not vote on how we would like to move forward with Alameda Strong and take that vote tonight and then continue the item for future discussion at which we can have the discussion about the funding tomorrow night and the vote perhaps for the motion.'",
        "'speaker_4': 'I'll make the motion. Let's just set the vice mayor just said. All right. And well, I'll just it doesn't really matter to me. I will put in a recommendation for multiple funds.'",
        "'speaker_1': 'Okay. Okay. So you've made the motion. You made the motion, Councilmember Odie.'",
        "'speaker_3': 'I will second that motion. I'm going to ask it if I can just make a couple friendly, just clarifications of things I heard. But I would would that in their motion include restricting grantees who got previously received keep funds which would be a would which would be different than the last one so that we're funding people who'",
        "'speaker_3': 'were unsuccessful in past grant applications so giving.'",
        "'speaker_1': 'Staff. The leeway. Is that what you're saying?'",
        "'speaker_3': 'Well, I don't want to get the leeway I want to give. Okay. Personally?'",
        "'speaker_1': 'Okay. Councilor Brody, that's your motion. What's your thought?'",
        "'speaker_4': 'Um, so they didn't receive the 7500? That that that's what you're suggesting?'",
        "'speaker_3': 'No. P federal grants. There are. There are there are nonprofits that have received hundreds of thousands of dollars in Alameda. But my feeling is they shouldn't be competing with other nonprofits that have not received any funds but.'",
        "'speaker_4': 'Saying, I'm okay with it, I'm okay with that. I just think our staff's not administering this, though, right? Isn't either Ebix and working solutions administering it it.'",
        "'speaker_1': 'Once the payments are made. But as far as the decision of who's getting the money right and the list of applicants and then just the distinction, as I understand about the PGP, is a payroll protection program. It starts out as a loan that needs to be repaid unless you retain 100% of your workforce for a certain period'",
        "'speaker_1': 'of time. But, you know, if if you're saying you would like receipt of those funds to be a criteria that would wait against you receiving our fans, is that what you're asking?'",
        "'speaker_3': 'No, I would say if you've received them, you cannot apply. You do not qualify for these funds that I would prefer to. I would prefer to expand the number of businesses and nonprofits in Alameda who receive support rather than allow some people to receive double support and others receive zero.'",
        "'speaker_1': 'Okay, that's fair.'",
        "'speaker_4': 'I mean, I would agree to that.'",
        "'speaker_3': 'Okay. Okay. And then my other my other clarification, Jim, is just just because we had a lot of conversation, but I don't know that we ever heard consensus around the sole proprietor in-home issue and what your intent was there.'",
        "'speaker_3': 'I, I, I'm not overly supportive of that, but, but I wanted to find out.'",
        "'speaker_4': 'It was in the staff recommendation. So I would, I was going to suggest keeping it in there.'",
        "'speaker_1': 'Council has got to hand it.'",
        "'speaker_0': 'Can I. Yes. Okay. So two things. One, with the maker of the motion, be willing to at least limit the sole proprietors to 50% of the the grant amount, because that's a significant amount of money to give to one person who can also qualify for the federal payments, the federal pandemic assistance, which means that they can get'",
        "'speaker_0': 'unemployment plus $600 a week.'",
        "'speaker_1': 'And again.'",
        "'speaker_4': 'I'm sorry. Inside America, sorry.'",
        "'speaker_1': 'This is a distinction between I heard home based business sole proprietors and sole proprietors. Do you do you see a distinction there, Councilmember Avella?'",
        "'speaker_0': 'To me, I there is.'",
        "'speaker_1': 'But maybe too far in the weeds.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Again, I mean, so I want to get clarification on that. And then I also wanted to find out if that's because if that's not to me, that's a significant thing because then we'll get we could give out more money to more people.'",
        "'speaker_0': 'If we if we are limiting that and I would hate for, for instance, a bunch of people that are sole proprietors who are working out of their house are the ones that end up getting all of these grants or a substantial portion of them.'",
        "'speaker_0': 'So I was also interested in perhaps giving some direction to staff to limit the number that we would be giving out.'",
        "'speaker_1': 'So can somebody make.'",
        "'speaker_0': 'Sure.'",
        "'speaker_4': 'That they are lowest? I mean, that sounds reasonable. I have no problem with it. But that just whenever your take.'",
        "'speaker_0': 'So from staff's perspective, if the council wants to say sole proprietors would be eligible up to half of the 7500, which is like 4750 or something like that. I don't have a problem with that. And if we want to cap the number or make it a percentage of what we receive, I think we're fine with that, too'",
        "'speaker_0': '. And I would just add back to the p p issue. I would just say that the reason that we are asking that people have applied is because there was discussion previously by the council that we don't want to be the funder of first resort.'",
        "'speaker_0': 'Right. So I guess policy direction on that is helpful for us. Mm. But we can make the full propriety of one work at a reduced formula.'",
        "'speaker_1': 'Council member Villa.'",
        "'speaker_0': 'And then the other two clarifications that I wanted to see if they were included as if if we could increase the residential rent relief to 30 $500 still at the one month cap.'",
        "'speaker_1': 'Quickly, you just ran out of time. Make your second.'",
        "'speaker_0': 'And then the second point was on the TPP. If that's limited just to the not the larger nonprofits that have qualified for it, I would be fine with limiting it. And if that's part of the motion.'",
        "'speaker_4': 'Okay for me if that works for the vice mayor who made that suggestion.'",
        "'speaker_3': 'I will. I will. I will. If that if that's what gets us to moving this forward.'",
        "'speaker_1': 'Great. Great. Okay. And Madam Clerk and staff, do you have any information on the residential? Everything that's in it.'",
        "'speaker_0': 'Yes. And on the residential, I think we would say one month's rent not to exceed 3500. And that's how we would address that issue.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. All right. We have a motion by Councilmember Otis, a second by Vice Mayor Knox. Let me we have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Hi. Hi.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Mayor. As the Ashcraft high that carries by five days.'",
        "'speaker_1': 'Good work, everybody.'",
        "'speaker_2': 'The second motion.'",
        "'speaker_1': 'Are in effect. A motion? Yes. Councilor Rody.'",
        "'speaker_4': 'I guess I'll make that second motion to continue the discussion on whether or not to accept the test recommendation to not provide additional funding for the grant program until after the budget meeting tomorrow.'",
        "'speaker_1': 'A motion to have a second.'",
        "'speaker_3': 'If we can amend the motion, just be continue this item to include that conversation to the next, which is the advice we got. I would be happy to.'",
        "'speaker_2': 'Second and I think you need a time specific in there.'",
        "'speaker_3': 'Just 7 p.m..'",
        "'speaker_2': 'Yeah.'",
        "'speaker_4': 'Okay. Sure. But I don't really want to rehash this motion. We just passed.'",
        "'speaker_3': 'It. We all get that.'",
        "'speaker_1': 'Come on, guys. We got it. We're going to move this along. So you're okay with that amendment? Yeah. Okay. Move by Odie, seconded by Inox. Right. Draw cover, please.'",
        "'speaker_2': 'Roadside guy. Right. Hi.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'I. Mayor has the Ashcroft.'",
        "'speaker_1': 'Eye.'",
        "'speaker_2': 'Carries by five eyes.'",
        "'speaker_1': 'Very good. All right. We're moving on to item to see. Madam, would you introduce that item, please?'",
        "'speaker_2': 'Recommendation to authorize the city manager to opt for commercial tenants in city owned properties. A loan conversion and forgiveness assistance program in response to the COVID 19 pandemic.'"
    ],
    "Loan Conversion and Forgiveness Program for Commercial Tenants in City-Owned Properties.": [
        "'speaker_1': 'Thank you. Okay. And this is being presented by his presenting. Hi. And I'm going to ask for brevity. This was not a long staff report, and our council members read their materials and the public is always capable of going to the website and reading too.'",
        "'speaker_1': 'So, Councilmember Vella, did you have your hand up with that? No. I'm very sensitive to any motions. Okay. So, hi, Ms.. Mercado. Nice to see you.'",
        "'speaker_0': 'Hi. Good evening, Mayor and city council members. Evening. So and in the interest of brevity, I have two things that I'd like to talk to you about. So you guys sent us off several, several weeks ago to address the issue of being a landlord and how to how to help some of our tenants.'",
        "'speaker_0': 'At your last meeting, you gave us some direction. We had initially done a 60 day deferral of rent and establish a repayment process that began in October. At your last meeting, you extended it.'",
        "'speaker_1': 'For a 30.'",
        "'speaker_0': 'More days, for a 90 day, for a 90 day deferral. What I'm bringing this up because we resolve the deferral issue, but we're through meetings with our tenants. The tenants have asked you guys specifically said April, May, June, and our tenants have said we need it to be 90 days and we can figure out what what three'",
        "'speaker_0': 'months we would like to defer specifically so that they could be eligible for federal funding. The some of the federal funding requires that they be current on their rent. And so if we defer it, then they're not eligible.'",
        "'speaker_0': 'So I would just ask that you consider whatever motion you make to make to to change that to a 90 day deferral rather than the April, May, June. So you you resolve the issue of deferral of rent. But there was another portion that you wanted us to consider, which is the rent abatement.'",
        "'speaker_0': 'And there was lots of conversation about what a rent abatement program would look like. And you guys said staff manager. So I'm saying help us think about that and look at we looked at some white papers that were done by some real estate experts.'",
        "'speaker_0': 'We talked to property management companies in the Bay Area and down in Southern California. We tried to figure out what everybody was doing. And one of the things that we learned was one of the major pieces of advice and a couple of the white P papers were don't make decisions that for the long term, for a short'",
        "'speaker_0': 'term problem. And so we kind of were looking at what does that mean? And so one of the things that there were three different kinds of programs that were described in some of our research. One was the application of deposit, which would allow us to use security deposits with the agreement of the tenant to pay their rent'",
        "'speaker_0': '. And then when the economy turned around or a tenant was better suited, they would replenish that security deposit fund so that we wouldn't be caught with a destroyed building and not be able to do anything at the end of the lease term.'",
        "'speaker_0': 'The other option was a program called Subletting Program, which essentially allowed us to well, we as landlords are tenants to sublet portions of their part of their building so that they could make their rent. And then the third program is the program that we're actually recommending tonight, which is a loan conversion program, which is the way we'll'",
        "'speaker_0': 'describe it as sort of an abatement for them. But you have some options, you have some flexibility. And the loan conversion program is rather than abating paths to rent, we agreed to convert the past to rent into a loan, a loan from the city to the tenant payable over time.'",
        "'speaker_0': 'And then the loan is evidenced by a promissory note that is cost defaulted with the lease. This we like this because it gives us a lot of flexibility in the promissory notes. There can be individually crafted to meet the needs of each of the tenants as well as we'll be able to say what the financial or the'",
        "'speaker_0': 'fiscal impact of each of these agreements would be, because they would be precise. The one of the things that we really liked about this program was that, let's say a tenant wanted to defer 24 months of rent. We could give them some benchmarks.'",
        "'speaker_0': 'And if they met these benchmarks, we could convert the loan into a grant. It's similar to the TPP program that if there were things that we'd like to see, like retention of employees or revise if it was a catalyst tenant or something like that, we could we could we could forgive all or a portion of it, however'",
        "'speaker_0': ', we think would be best for the city and based on the individual financials of the tenant. So we like this program because it's flexible. And again, it can be our full abatement or it could be a partial abatement based on whatever benchmarks we would set up or that the council would be looking for.'",
        "'speaker_0': 'And finally, let me just talk about some of the alternatives to not doing this loan conversion program, and then you guys can have at it. Because what we're really looking for, the council is, if you like, this loan conversion program, what would be some of the benchmarks of some of the metrics that you'd be looking for for'",
        "'speaker_0': 'us to get from tenant job retention, you know, resiliency by a certain period of time, some things like that. But some of the alternatives would be that, okay, we do this program or we consider a rent reduction program, which was the thing that the broker talked about and you guys were remotely intrigued with last time, which is'",
        "'speaker_0': 'we we rebate the rent for a, let's say eight months and then the tenant has a period of time to catch up. So that way that there's cash flow to us and cash flow for the tenant. So that's an option.'",
        "'speaker_0': 'The other thing is we could allow the tenants to sublet. We could just do an active subletting program with our tenants. But that would also require that the sublet that sub tenants would be compatible with our zoning and permitting and it could be time, time consuming for the tenant, but it's something that we could do.'",
        "'speaker_0': 'And then the other thing is we could do the security deposit program. That may not be enough, because typically our security deposit is one month's rent. And then finally we could just stick with our deferral program and not offer any alternative to that and just do the 90 days and everybody has that.'",
        "'speaker_0': 'So I think that's all I'm going to talk about, because you guys have read the self-report and and I'm trying to be brief.'",
        "'speaker_1': 'Thank you. I appreciate a good report. Do we have any any questions about the clarifying questions about the staff report before we go to any vice mayor? Next.'",
        "'speaker_3': 'Quick question. So it seems like once you get direction, there's a whole program that's going to be set up with benchmarks and criteria. And if if we were to follow the staff report, there would be the the criteria for the 50% loan grant or whatever the direction was would come back.'",
        "'speaker_3': 'And what is the timeline on that?'",
        "'speaker_0': 'So I'm we are looking for you guys to tell us what kind of benchmarks you're looking for. We want to set this up as soon as possible because our deferral program ends in June. And I think you guys might be getting as many emails as we're getting from technically anxious about the expiration of that 90 days and'",
        "'speaker_0': 'and tenants who are who are saying the deferral program isn't good enough. So we would like to be exploring, negotiating with tenants right now to to get into the promissory term sheet, whatever you want to call it, to move this project along.'",
        "'speaker_0': 'And then at the same time, we would have some real time information. I know you're considering the budget tomorrow, but probably in the Q1 of next fiscal year, we should have a really good picture of what we've negotiated and what it means for our budget.'",
        "'speaker_1': 'Okay. Um, I have a couple of quick questions, actually, maybe just one. Can you explain what cross defaulted means? So the, um, the tenant agrees with the, uh, is that with the. Now it's about the loan conversion.'",
        "'speaker_0': 'So essentially it means that they default on their promissory note, they default on their lease so that both of the Oak Hill rated. Okay.'",
        "'speaker_1': 'So if they if they default on the promissory note, then they then they have to repay the loan.'",
        "'speaker_0': 'Well, I think we have the option of evicting them because.'",
        "'speaker_1': 'Okay. Because they've.'",
        "'speaker_0': 'Defaulted. Yes.'",
        "'speaker_1': 'On their rent. Got it. Okay. Okay. Okay. Do we have any were there any further clarifying questions? Okay. Do we have any public comment, Madam Clerk?'",
        "'speaker_2': 'We we have received one public comment for me to read in the record. And now I will ask any attendees who are interested should raise their hand and. It looks like there's one. And so we'll have that person go first and then I will read the other one.'",
        "'speaker_0': 'Very good.'",
        "'speaker_4': 'Jonathan. al-Khalifa.'",
        "'speaker_1': 'Yes, please. Mr. Barkley, that I don't see your whole name, but you're on. We're ready to hear from you.'",
        "'speaker_0': 'Yes, I'm his wife. Hello. Hi. Hi. I have a question about the sole proprietor we are. We have a business. My husband is the owner and we're working there as a family and for ten years. And I.'",
        "'speaker_1': 'Just want.'",
        "'speaker_0': 'To know if we're, like, included in the farm.'",
        "'speaker_1': 'Okay. So that actually is a question about the fund that we just and please don't take me on this one. That was from the last item. Now we're talking about something else about tenants who are who are tenants of city owned property, however.'",
        "'speaker_1': 'Starting is it tomorrow. Madam Clerk, the tape of this meeting will be available.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'All right. So you can catch up with that information that you missed. Thank you.'",
        "'speaker_2': 'And I made the next comment into the record. Okay. Jim Strelow, Alameda. I enjoyed the council's earlier discussions about considering a loan forgiveness assistance program because most commercial tenants were denied use of their rentals because of government restrictions.'",
        "'speaker_2': 'Some council members earlier said that it would show to other landlords that the city was setting the example for others to follow. I encourage you to discuss that program some more. Thank you.'",
        "'speaker_1': 'Thank you. Are there any further public comments?'",
        "'speaker_2': 'There are none.'",
        "'speaker_1': 'All right. So with that public comment is now closed for this item. All right. Counsel, how would we and I think as as Ms.. Mercado has indicated, she's looking for a direction from us on. Well, a first of all, do we want to go forward with I'm sorry, my temperamental iPad is freezing on me, but do we'",
        "'speaker_1': 'want to go forward with a loan conversion and forgiveness program? And if so, what are the benchmarks that we want to be considered?'",
        "'speaker_0': 'All right, I'm back.'",
        "'speaker_1': 'Or maybe not. Anyway, why? Okay, so we've. We've got the, um. Uh. The staff report and you know, direction about a staff has recommended a loan conversion approach because it offers the city flexibility. And I will throw out that I think flexibility is important these days and also individualized assistance.'",
        "'speaker_1': 'It's not one size fits all and our businesses are of very different natures and sizes and have different needs. Could be administered like a federal loan converted to a grant if the recipient complies with certain requirements. So council what's what are the benchmarks we want included?'",
        "'speaker_1': 'Councilmember De Soto has his hand up.'",
        "'speaker_4': 'Thank you. You know, I think like all of you, I did receive that email from the owner of Rockwall Winery and the fact that she had, uh, indicated that that she employs 81 people and she is facing dire situations.'",
        "'speaker_4': 'It seems as though what we are considering tonight could potentially assist her through this difficult period. So I think definitely job retention is certainly one of the key benchmarks that I would love to see. And I think what's unique about that venue is it does seem to be a catalyst.'",
        "'speaker_4': 'So that might be another benchmark. Um, so those are the two things that I'd like to see are one thing though that I would discourage is sub10 ending. And the reason why I'm going to specifically talk against Sub10 Inning is because what I have seen in the past is a lot a good number of facilities have leased'",
        "'speaker_4': 'out or subleased out areas to container cargoes. And I just I don't think that's that's in keeping of of kind of a type of built environment that we're, we're striving for. Um, and I think it's happened along, um, the winery RO Area Spirit's Alley, but I've seen it elsewhere too.'",
        "'speaker_4': 'So that's one reason why I'm going to speak against Sub10 anything, because I do think that there's an easy dollars to be made for leasing out to container trucks from coming from the Port of Oakland.'",
        "'speaker_1': 'Thank you. Thanks, Mr. De. So who's next? Cousin Rudy. And then you, Vice Mayor.'",
        "'speaker_0': 'Thank you. Yes.'",
        "'speaker_4': 'I want to go next. I understand, um, the vice mayor's question that this was going to come back to us. And then we'd have to vote on it. Is that the question?'",
        "'speaker_1': 'Oh, no, I thought it was the vice mayor asked. I think, what's the timeline? And once you get direction, what's the timeline? And I'd have to look back at my notes to Ms.. Mercado. She said, We we need to move quickly because the deferrals are ending in June.'",
        "'speaker_1': 'But, no, I don't think this is back to us, does it?'",
        "'speaker_0': 'It's not it's not our goal to bring this back to you. We want to implement the program and report back to you in the fall Q1 of next fiscal year about where we are, how many of these loan conversions that we've done and and give you a report and maybe we think about what are there any next'",
        "'speaker_0': 'steps? Are we have we satisfied what we need to do to get the tenant through that step?'",
        "'speaker_4': 'Okay. So I just, you know, I like the concept of converting deferred rent into a promissory note. Um, some of the things that concern me that we brought up when we had our subcommittee read out was just, there was no cap.'",
        "'speaker_4': 'And the way this looks now, it seems like there's no cap because a tenant could request rent deferral for up to 18 months. That's a year and a half. And the staff could determine that they want to convert that rent deferral into forgiveness or either 50% into a grant or a 100% forgiveness.'",
        "'speaker_4': 'And that was the whole thing that we wanted to at least I thought I wanted to avoid in the beginning was, you know, just a blank check and this looks like a blank check. So granted, there are, you know, some requests to have some criteria and metrics.'",
        "'speaker_4': 'But, you know, unless we come up with those today at 912 when we haven't even got to our regular agenda, then we're not going to have an opportunity to have a discussion on them again. So, I mean, I again, I like the idea and I'll hear my colleagues and get back into the, you know, the nuts and'",
        "'speaker_4': 'bolts of it, but that this just looks like a blank check to me. And that's exactly what I didn't want to happen in the first place. So but I do like the concept of a promissory note, you know, with an extended due date.'",
        "'speaker_4': 'Um, but, you know, given the size of potentially 18 months and given the fact that our staff could just either forgive half of it or all of it, you know, just leaves me queasy because I have no idea how much it's going to cost.'",
        "'speaker_1': 'Councilman Brody, may I, may I make a request of you? Councilman Brody I think so. What I really want to do is keep these special meeting items moving forward, because after all, this is all about COVID relief and the need is now, I think you really you hit the nail on the head, one of a few nails'",
        "'speaker_1': 'on the head. How about seeing if you can come up with what you think a reasonable period of time would be? I think there's a figure out there, the time period out there, I'll give you give you a moment to think of it.'",
        "'speaker_1': 'While I hear from two other colleagues who have their hand up. Let's hear from Councilmember Vela, then the vice mayor. Councilmember Vela.'",
        "'speaker_0': 'Thanks. So a couple of things. I am okay with the concept of the promissory note. But I also want to understand what the finances were pre-COVID. I am very wary of a business basically saying that they're going to be shut down if we don't just automatically forgive all of their rent.'",
        "'speaker_0': 'I'd like to know what the state of the business is and whether or not the business, because we are investing at that point and I would want to know that they're that they have an ability to continue to operate.'",
        "'speaker_0': 'I also think that employee retention needs to be part of that. And while a business may employ anyone, people or 100 people, how many of those individuals are employed full time with benefits here in Alameda? I won't say with benefits because I am I want to understand how many of the employees are benefited versus how many people'",
        "'speaker_0': 'there might just have their temporarily or hourly during high season. Other things that I would like to look at, I personally would be interested in capping it at three months. And I think, you know, if we're talking about anything beyond the three months, then I think that I would just have it.'",
        "'speaker_1': 'I'll get to next year. Okay.'",
        "'speaker_0': 'I would want it I would want it to come back to council to discuss why there is an extended need and what the plan is or the model. I think I'd also be interested in understanding what businesses in the criteria I'd want to look at or what businesses found a way to continue to operate in some form'",
        "'speaker_0': 'during the shutdown, and some of our businesses find new ways to operate. There was an entrepreneurial spirit that I think has kept some of our businesses afloat. Again, this is the last resort, not the not the bailout out where a city with a limited budget, we don't print our own money like the federal government.'",
        "'speaker_0': 'And, you know, these are these are policy choices. And if we if we give to one person, that means taking from something else. And so I want to be very cognizant and intentional with how we go about making these decisions.'",
        "'speaker_0': 'The other thing that I would want to know is the number. Well, I think we can give points for being a catalyst, but to me a catalyst is what I would want to define, what cattle, what we mean by that.'",
        "'speaker_0': 'And I think the other thing that I would want to look at is what's the what's the potential sales tax that we think that they can bring in? And I am for for some of these other businesses, or is their business model going to change under under the new kind of continued restrictions?'",
        "'speaker_0': 'Do they have a plan for continuing to operate? So those are those are my initial thoughts on this. But I am more drawn to the promissory note option because I think that that protects the city and and address some of our concerns that we expressed earlier on when we discussed this.'",
        "'speaker_1': 'Okay. And so can I hear from the city manager? Had his I saw you put your hand up. Yes, Mr. Levitt.'",
        "'speaker_3': 'I just had one question for Councilmember Vela. And then as a comment and the question for Councilmember Vela is, you said about capping at three months. We currently have the deferral for three months. Are you saying capping at an additional three months for the for this program?'",
        "'speaker_3': 'So that would be a possible total of six months?'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'And then the second comment is, we had talked about whether we could get this to in front of you tonight, May 19th, or whether it would take more staff work to get to June 2nd. And then Debbie and then that in my conversation, I push for it to be May 19th, in part because I thought there might'",
        "'speaker_3': 'be more questions that came up and that way we could bring it back on June 2nd. And so that was part of the reason we brought it on May 19th is to give us some more time to try to deal with it on June 2nd.'",
        "'speaker_3': 'If you have more items that you wanted us to consider and bring back for your consideration.'",
        "'speaker_1': 'Well, and I'll continue just kind of but I'm not sure. Again, I'm I'm not wanting to rush things that are not well thought out. But I'm wondering if we can't give sufficient detailed instruction to staff and say this is what we want.'",
        "'speaker_1': 'Go forth and start doing it. Let's hear from Ms.. Mercado. What were you going to say?'",
        "'speaker_0': 'I wanted to just respond that one of the things that we read in the documents was that in order to qualify for this, we, the tenant, would have to provide us with an extensive list of extensive information. And i.'",
        "'speaker_0': 'I. I am. I. And the staff report which like current cash on hand payroll information list of creditors. And then one of the things that we would do that I didn't want to go through the whole is that one of the things that we would use to evaluate an applicant is the tenant would have to provide us'",
        "'speaker_0': 'with a resiliency plan, like how do you plan on digging yourself out of here? So a business continuation plan. And we also like the the grant program that you guys approved last council meeting and you're discussing again this council meeting.'",
        "'speaker_0': 'We think that there should be an employee like the tenant should have more than 30 employees to be eligible for this sort of program. So we want to make it a little bit different. And then we also think that they should demonstrate significant loss of income of 30%.'",
        "'speaker_0': 'And we want to be able to just make it a little bit more difficult to to have to to be eligible for this, because we want to we want to make sure that we're we're using this program strategically.'",
        "'speaker_1': 'Okay. Mark Potter and then the vice mayor who has a chance to be heard yet, I think as.'",
        "'speaker_0': 'Part of and just two, one, one approach the council might think about this evening about how to balance the desire to kind of get it right and cover all the points and keep things moving is that there are a lot of criteria that are contained in the staff report about how this program would be done.'",
        "'speaker_0': 'But there's a desire from the council maybe not to have it open ended. So one one potential approach is for the council to say, go forth and council, you're authorized to negotiate up to X amount of loan conversion or you're authorized to do something for X number of tenants for X number of month months.'",
        "'speaker_0': 'And so then we have we have parameters and we have a framework within which we can then apply the criteria that are contained in the staff report and the direction we hear tonight. And I think that may be a way to kind of strike that balance between getting it right and keeping it moving.'",
        "'speaker_0': 'Something to the council might want to.'",
        "'speaker_1': 'Okay. I guess I would wonder about how the council would come up with a particular amount of assistance, because I think, again, it would depend on the amount that the company, the business is paying. But hold that thought.'",
        "'speaker_1': 'Vice Mayor, you've had your hand up for a while now.'",
        "'speaker_3': 'Thank you. Um, so for me, I think one of the, one of the interesting things about these discussions is we've talked with the community and read about what our community, so many communities are going through, is that our employees are having their wages cut or losing their jobs and businesses are seeing significant reductions.'",
        "'speaker_3': 'It's it's struck me and it's actually something that I've heard from a number of Alameda businesses who do don't rent from the city. But it struck me that it's interesting that there is a perception that people who are in the business of renting land must be made whole at all times through this through this process.'",
        "'speaker_3': 'And so everybody is taking a haircut and taking cuts and struggling. And, you know, we can't tell commercial landlords what to do in terms of we don't have the authority, but I think we can show moral leadership. And I do think that there is something I you know, we get about $1,000,000 a month in rent.'",
        "'speaker_3': 'And I think that we need to be thinking a little bit about the fact that we're collecting rent from people who are not legally allowed to use their buildings. And to me, that's the threshold I think we should be using, is that people who are not allowed to use their buildings because they were not legally allowed due'",
        "'speaker_3': 'the public health order, the length of time for for for the for for for a loan program would be based on how long that their business was impacted by the public health plus one month so that they have a chance to get in and start up.'",
        "'speaker_3': 'I think that we know that Councilmember De Saag mentioned job retention. I think if somebody can show that they retain 75% of their jobs over a year, we should look at 50% just taking 50% now and converting it.'",
        "'speaker_3': 'That would be our metric to to grants a year after. And then they might have an additional couple of months to pay the other 50% of rent that they were due. I struggle. I am struggling with the idea that our goal is to make sure that we're having people pay us for for land and buildings that they're'",
        "'speaker_3': 'not they're not allowed to even be in and use. Right now, I don't think every business that we rent to is going to qualify for this. We have some who have changed their business models or who are open and whatever else.'",
        "'speaker_3': 'You know, I think we could go to the city manager's recommendation. We could give some direction and some numbers could be come back. In terms of what we think we're based on the deferral program and whatnot, what we think that this might impact, we obviously don't know when things are going to be able to open up, but'",
        "'speaker_3': 'we do know that certain businesses are going to start opening up in the next two, four, six weeks. So this isn't an 18 month rent deferral program or anything, as it was, I think pointed out in the in the staff report as a potential way forward.'",
        "'speaker_3': 'So to me, I think we can I think we can I think we can craft something. I don't want the council being involved in having to make every single decision on this. I think that's getting us too deep.'",
        "'speaker_3': 'And I also want to be careful that our criteria is not us deciding who is important or who makes enough money. I think, you know, business communities and business ecosystems are made up of a lot of different sized businesses and they all have important places within that.'",
        "'speaker_3': 'And I don't want to I just government has never shown itself to be really good picture of winners and losers in these things. And so I think we should find the find the problem we're trying to solve, which is help people through this time when they are currently being asked to pay for rent, that for something that'",
        "'speaker_3': 'they can't use and then figure out a way to to support them coming out of that and then hopefully collecting a little bit of the money because there is rent, there is there is wear and tear on that building over the time that that that we should be collecting.'",
        "'speaker_3': 'So those are those are my thoughts. I don't know. I'll look forward to hearing other people have.'",
        "'speaker_4': 'But.'",
        "'speaker_1': 'Councilmember Odie, who moved me.'",
        "'speaker_4': 'Thank you. So I took your assignment. Thank you. Thank you. And heard my colleague. I agree with the vice mayor. I mean, when you if you're shut down, I think we should be more lenient for, you know, any type of abatement in those those situations.'",
        "'speaker_4': 'I mean, that that's just a fact. But if you're, you know, get up and running on July 1st and you request, you know, a nine month rate rent abatement or an 18 month rent abatement, you know, I'm not sure if that meets meets those values.'",
        "'speaker_4': 'I like the idea of Avella. You know, let's start with another three months. People could ask for up to three months. And I also think that, you know, we can extend these payments out. There was the suggestion was the total deferred rent is due in 18 months.'",
        "'speaker_4': 'But if you have a ten year lease, you know, why not let someone spread out those payments over the last ten years of that lease or whatever turns out to be nine and a half years? Um, there's one other item, and I forgot what it was.'",
        "'speaker_4': 'Oh, I mean, I still think having a cap, like, if we, if, if this number gets to be 300,000 and maybe this, it gets, the council gets pulled back in and says, you know, we're we already spent 300,000.'",
        "'speaker_4': 'Do you still want us to pursue this? Because, again, I'm really leery about the blank check and really leery about the threatening letters. I'm really leery about, you know, the parade of supporters coming to council. Um, so I just want to make sure that we're fair to everybody, but to the vice mayor suggestion.'",
        "'speaker_4': 'Yeah. I mean, let's be as leaning as we can when. When they're shut down. Thank you.'",
        "'speaker_1': 'Council every day. So, yeah.'",
        "'speaker_4': 'I'm here to speak in favor of going beyond three months, largely because if you watched, for example, 60 Minutes this past Sunday, you had the chairman of the Fed talk about recovery, probably not really happening until the end of 2021.'",
        "'speaker_4': 'And even if we shelter in place, begins to lighten up soon, if not and within three months, I think everything that you hear about in the business sections of newspapers or or if you watch CNBC, everything you hear about is that demand is still going to be tepid.'",
        "'speaker_4': 'So my sense is that that maybe it's not 18 months, but I don't think it's three months. So I think we need to go a little beyond that. Thank you, Count.'",
        "'speaker_1': 'Counselor every day. So you understood that that's an additional three months to the six months we've already mentioned the three months we've already provided.'",
        "'speaker_0': 'Yeah. No, I mean an.'",
        "'speaker_4': 'Yeah, no, I understand that.'",
        "'speaker_1': 'Is there any reason you wouldn't think that we could go with the additional three months now and revisit it if we're not seeing businesses open out there? And I watch 60 Minutes the other night, too, and that Jerome Powell, the chair of the Fed, is very eloquent and he said we're going to um economy will recover when'",
        "'speaker_1': 'we get a hold of will we get coronavirus under control. And I think he was speaking to nationwide. I mean, we are the most populous state. But I'd say that here in the Bay Area, we we got ahead of a lot of things.'",
        "'speaker_1': 'And I think our recovery is going to come back sooner than some places. But again, to the point Nanette made in the beginning, the advice given was don't make long term decisions for short term problems. Right now, we don't quite know the magnitude and duration, but I think we could come up with a reasonable figure now and'",
        "'speaker_1': 'then certainly come back and revisit it. My thought, I hear that.'",
        "'speaker_0': 'Sounds like.'",
        "'speaker_1': 'Nodding heads and I think misspeak kind of. Were you going to add something and then. Councilmember No. Okay. Um, we ready to make a motion in some direction? Councilmember Vella. Oh, you're muted, Councilmember Vela. You're muted.'",
        "'speaker_0': 'I did want some clarity from my colleagues in terms of if they had a suggestion for an overall cap, because I do think that we need to have stuff come back to us that exceeds a certain amount. And then the other thing was, I think while some businesses were were closed in that, like, for instance, you can'",
        "'speaker_0': 'operate a tasting room, you could. There's other portions of the business where you could still bottle. You have product that's not necessarily spoiling. So I think, you know, again, I like the aspect of this bacardi's point of looking at the resiliency and looking at what that different businesses took to try to to get out during during the'",
        "'speaker_0': 'closure, because I think that that speaks to trade it to an attempt to get some recovery. I am wary of or I did have a question of if a business owner has multiple properties that they're renting and and a combined set of employees, the total number of employees that we're requiring that a business owner have.'",
        "'speaker_0': 'How we came up with that number. In order to get the qualify for the relief.'",
        "'speaker_1': 'They wanted to see at least 30 employees, Mr. Conner.'",
        "'speaker_0': 'So it was just looking at what other other landlords were doing. That's where we came up with that number. But I would say that we have I don't think we have too many tenants that have multiple. I mean, we have a couple of tenants that have a couple of buildings, but we don't have tenants spread across multiple'",
        "'speaker_0': 'properties very much. I mean, that's a that would be an unusual and for an example, I would say like Astra has Building 360 and 397, but there are very few tenants that have more than one property. Okay. I mean, I would be inclined to to lower it to 25 since that's what we did for our grant to'",
        "'speaker_0': 'see 25 employees. So we're looking for a grant. We did more than 25. I understand that. I understand that. But because our grants were up to 25, why not lower it to say people with more than 25 that way?'",
        "'speaker_0': 'There is not this section of businesses with five people that aren't are aren't qualifying, that are tenants and.'",
        "'speaker_1': 'And can I just make a clarifying or asking clarifying question? So right now we're only talking about businesses that are tenants where the city is the landlord. The grant program up until now has been for small businesses. So I it's not that I mean, I guess I guess I'll make the point.'",
        "'speaker_1': 'There was a fund founded to point small businesses to apply. Okay. So Councilmember Vallas agreeing that there is that delta that we're leaving people out.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'All right. And Councilmember Vela, did you have or Councilmember Odie, because you both raised this, do you have a, um, a cap, an idea of what cap and the cap is, the amount of how much rent the city is giving up?'",
        "'speaker_1': 'Is is the cap you're looking at? Did you have an idea of what that would you know, what would would trigger you wanted to have the the program or have a report that brought back.'",
        "'speaker_4': 'I'm worried about. Councilmember Odie, I'm sorry. I'm worried about the amount that might be abated versus, you know, the amount that might be deferred. Um, so, I mean, when we did the subcommittee we talked about 300,000. Mhm. I mean it'd be good to get a report back and I think like Ms..'",
        "'speaker_1': 'Mercado's nodding her head so that might be that she's in agreement with. That's a reasonable figure.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'And Councilmember, I don't know, I think you said this, Mayor. Um, you know, if this, if we need to do more in three months, we can do more.'",
        "'speaker_1': 'Right.'",
        "'speaker_4': 'So, I mean, I totally agree with that. I'm not saying I don't I'm not trying to be miserly or anything, but, you know, I don't want to give this huge blank check and then find out maybe it was not necessary.'",
        "'speaker_4': 'But if we need to give it and every three months we come back and we need to give it, okay, that's a different story.'",
        "'speaker_1': 'We can do that. That sounds good.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'Are there any groups that are under 25 that might might qualify for this? Any. Any you know, there's like a mom and pop and there are a couple of mom and pop shops out there. I don't know.'",
        "'speaker_0': 'Um, well, so we do. I mean, there's, we have the Park Street sellers. Uh, yeah. And we have like the.'",
        "'speaker_1': 'Oh, yes, yes. Just Alameda point.'",
        "'speaker_0': 'And you're right. Just Alameda, right. If you have to have those, those types of businesses. We also have, um, you know, probably, probably many of the tenants, um, like Pacific Pinball. They probably don't have that many employees, employer employees.'",
        "'speaker_0': 'Um, so, I mean, I think it, uh, I think they're, I think in over, over 25, it's, it's a smaller group. I think you're going to hit your sales rounds, rounds, Astros. You will hit I mean, I don't know about Rockwall, she said 81, but I think a lot of those might be part time employees.'",
        "'speaker_0': 'As Councilmember Vela said, I think the antique fair might have a lot of part time employees. I mean, I don't think that they might hit that 25 threshold. So, um, I, I think the 25 is, it's, it's, it's a reach for many of our tenants.'",
        "'speaker_4': 'So because I would like maybe the 25 is just for forgiveness, but, or a conversion, but I'd like to see as many people eligible as possible, even if they were, you know, ten employees or five employees.'",
        "'speaker_0': 'So the other thing I just want I mean, I want to be clear about what we're proposing, because remember, remember a lot of our research, not very many landlords are offering rent abatements. So this is sort of I mean, in fact, I, I had read that practically no one is offering rent abatement.'",
        "'speaker_0': 'So I think we're being very, you know, patterning our program, patterning our program after the federal PGP, where we're setting the pace by saying we're going to loan you this money and potentially you will be forgiven. And so I think I just want to make sure we're clear.'",
        "'speaker_0': 'We were over 25 are only 25 were offering abatement. Just straight out the gate.'",
        "'speaker_1': 'Can you clarify that, please? Well, I. Well, I do think that that's that's a good point that we, um. Just because we can because we're the landlords doesn't mean we should do something that other landlords aren't doing. And it's.'",
        "'speaker_1': 'And it isn't because we're being cheap. It just might be that we're being prudent, that we want to be in a position to be able to do the things with that revenue that, that the, um, that the our made a point, um, you know, the revenues are paying for because remember that, that the revenues made there are'",
        "'speaker_1': 'used out there. But I think we can help people through some hard times. Um, but I think we should be more judicious with the criteria about who actually gets their rent abated along the federal program. Paying at the back end of your lease.'",
        "'speaker_1': 'I can see that things are going to get better for most, but we've got to apply these criteria. Um, and I just think that there's a lot of things we'd like to do, but already we're seeing less revenue and that's going to start, meaning we're unable to do some of the things we need to do to keep'",
        "'speaker_1': 'these areas viable places for people to come when the customers can come back. So I'd like to see us craft something that really relies heavily on deferral. You know, we can lengthen the amount of time, but abatement under really specialized circumstances.'",
        "'speaker_1': 'Anybody want to try and craft a motion?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Vice Mayor, not slate.'",
        "'speaker_3': 'I know I don't want to craft a motion because I'm not sure I'm I'm so I'm definitely on that team abatement. You know, I appreciate Mr. McConaghy comment. I think just because everybody is not doing the right thing doesn't mean we shouldn't do the right thing.'",
        "'speaker_3': 'And I think we spend a lot of time talking about tenant landlord relationships. And I think this is one where we're where we need to show leadership and even use that leadership to encourage others to do so. My question is, we have the 90 day deferral as it is.'",
        "'speaker_3': 'So if we were to say let's say I keep hearing about three months, that's how how does how does the the the 90 day deferral and the loan conversion, does that become a six month loan conversion program? And how did how did the two things we have 90 days and deferral and then we're adding another 90 days'",
        "'speaker_3': 'essentially in loan conversion are those two separate things so they still have to pay the 90 days that was deferred under the original agreement. And then this is a new. Set what the proposal is.'",
        "'speaker_1': 'Can you clarify that, Mr. McKenna? I. When you're unmuted. Yes.'",
        "'speaker_0': 'Yes. So. Okay. I would say I'm not sure if I'm clarifying or if I'm giving you my opinion, but I would say that the all of it gets mixed in together. And so if after six months, we you know, the tenant has proven that they're I mean, that they've overcome, I would say, and and met some of'",
        "'speaker_0': 'the benchmarks that you've set up like employment. And I think that we would potentially offer a 50% abatement and that they would just be stuck. They would be not stuck. They wouldn't be subject to the original deferral program that we put together.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. Thank you for that clarification. And and I'm going to call did you finish your comments, Vice Mayor?'",
        "'speaker_3': 'Well, I had some comments when I saw the city manager's hand go up.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'I wasn't going to let him. I thought that was related to the questions.'",
        "'speaker_1': 'I think he might want to talk about it. And I just want to say something and maybe this is just semantics. I would say we're all here to do the right thing. And so we may not agree with each other, but a difference of opinion does not mean that someone is supporting a position that is the wrong'",
        "'speaker_1': 'thing. It is nice to be more generous. I would say, you know, there's a lot of considerations, but it's, you know, we're all right. We're all trying to do the right thing in these difficult times.'",
        "'speaker_3': 'And I would never say that I didn't suggest otherwise.'",
        "'speaker_1': 'I said it might be a matter of semantics and sometimes it's a matter of perception. City Manager.'",
        "'speaker_3': 'Yes. Mayor Ashcraft and City Council. I would agree with what Nat ended up saying at the end, and that is that I would see the 3 minutes I've envisioned that the three months would be combined with the first three months.'",
        "'speaker_4': 'Or.'",
        "'speaker_3': 'The other action that you requested, where if they didn't do three months from April through June, that they could add another month at some point. But if you you added this three months for the loan, that could be wrapped into a loan that we would probably try to wrap all six months into a loan, or else it'",
        "'speaker_3': 'would make it unfeasible for for the tenant to be able to to manage that loan at that point.'",
        "'speaker_1': 'And that's my kind of. And your.'",
        "'speaker_0': 'Comments. I really did like the vice mayor said about her, that making the program and the length of time the building was unusable or that they were not open plus one month. I thought that was pretty clever. And then I do like the three.'",
        "'speaker_0': 'I like having three months or $300,000 being the cap and having the council say whichever is greater or whichever is lower. I mean, I think that gives us some guidelines that we can work with in administering a program.'",
        "'speaker_0': 'So those are just my two comments.'",
        "'speaker_1': 'Okay. How does that sound, counsel? So. So we've got the.'",
        "'speaker_3': 'I'm sorry. I believe I had the floor.'",
        "'speaker_1': 'Sorry. I was looking away, taking notes. That's okay. Yes.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'So thank you, Councilmember Odie, for directing my attention. Council vice mayor.'",
        "'speaker_3': 'It's down there.'",
        "'speaker_1': 'Not on the. The.'",
        "'speaker_3': 'I. Worried about $300,000. Our total rent is $1,000,000 a month. We already if we were to go with plus one month we're looking at four months and whatnot and half if half of that is abated. We're going to hit $300,000 with like two companies or three companies possibly depending on which ones we do it.'",
        "'speaker_3': 'So I just want to I just want to make sure that we don't set a cap that has us has staff coming back. And the other thing is, I want to be. Whatever. However, we move forward tonight, I want to be sure that we are careful, that we are not.'",
        "'speaker_3': 'I don't want to approve seven businesses because they were the first seven in the door. And then it turns out they hit the cap and now we're coming back and asking for more. So figuring out how we're going to have that cap conversation before people are told they have received this, I think is going to be an'",
        "'speaker_3': 'important part of this. But like I said, I as I'm further on the abatement side of this, I'll let my other colleagues decide how they like to move forward.'",
        "'speaker_1': 'And I would just ask the clarifying question. So when it comes to the application period, I mean, you're you're not contemplating first come, first serve, I would imagine I would think you're having an application period. And once all those applications are in, then the hard part comes comes that you need to look at everything and who meets'",
        "'speaker_1': 'the criteria. And I'm sure there's some sort of sequencing or, you know, ordering who's scoring highest or what have you. And then you'll know, I guess, how quickly you'd come to the cap. Is that is that a fair assessment of when you make.'",
        "'speaker_0': 'Yeah. Yeah. So I was thinking that and I wasn't thinking $300,000 total for the program. I was thinking as a tenant, I got that and there's very few tenants who pay $50,000 a month. That's I mean, you could get a long period, you could get a lot of room per tenant there.'",
        "'speaker_0': 'But I also think that it's not first come, first serve. I think each of these agreements will have to be negotiated. And there's a lot of paperwork that we're going to ask these tenants to provide us to make their case.'",
        "'speaker_0': 'And if they can't make their case, then they're I mean, we could offer them probably a more deferral, two months more deferral, but not necessarily abatement. I think they have to prove up because as you guys all just said, that, you know, this is money that we're going to we're going to be using for development and to'",
        "'speaker_0': 'dig ourselves out of having this dilapidated property. So I think, um, I think we would be looking at these applications pretty closely and with a lot of scrutiny.'",
        "'speaker_1': 'Thank you for the clarification. I'm an economist, Jodie. I say use your double take, but I mean, I did get that. I mean, we read these lease leases, those are high monthly rent. So that's what I mean about it.'",
        "'speaker_1': 'It is lovely to to be generous, but it has its cost. Councilmember Brody.'",
        "'speaker_4': 'Thank you, Madam Mayor. 300,000 person per tenant. I mean, that is basically a blank check for almost every tenant. I mean, I just go down the list, you know, 27,000, 30,000, 38, 2013, 12 nine two, two, three, two, five, four three.'",
        "'speaker_4': 'I mean, those are just the the least the monthly leases. So I don't know.'",
        "'speaker_1': 'Would you. Councilman Brody, may I ask, would you have a capped amount for those paying rent within a certain category? Because I, I can see your point that this would be too generous for those. And I, when we were on the subcommittee and probably has been provided to the rest of the council and this kind of gave'",
        "'speaker_1': 'us that list of the rent, the monthly rent payments. But what would you think of having like a small, medium and large cap somewhere? I want to see what we can do without. I think the principle you're you're advancing is a is a good sound one.'",
        "'speaker_1': 'But is there a way that we can give staff direction without being so much in the weeds, you know, the parameters?'",
        "'speaker_4': 'So here's kind of what I would like to think based on my colleague's comments. If you are shut down and locked out. I mean, we said it. We should abate your rent. For the first three months or whatever until you're when you're locked out for the second three months, we should be as generous as we can with'",
        "'speaker_4': 'deferrals and this loan conversion. And then when staff reaches 300,000 in proposed abatements, then they come back to us.'",
        "'speaker_1': 'In proposed abatements statement tenant.'",
        "'speaker_4': 'Not deferrals abatements.'",
        "'speaker_1': 'No abatements but that. But even for a smaller tenant you would spend it cumulatively.'",
        "'speaker_4': 'Cumulatively in total total.'",
        "'speaker_1': 'Cumulative well which would give tenants paying a lower rent more months to have it. But the city manager has his hands up. He's going to clear this all up so we can move forward. Aren't you.'",
        "'speaker_4': 'Know.'",
        "'speaker_3': 'I'm not sure about that. I was just I was clarifying that I think Councilmember Audi was saying 300,000 among all the tenants is where he's talking about.'",
        "'speaker_4': 'So statements, though, not deferrals on abatements.'",
        "'speaker_3': 'Right. I think I think there's a little bit of a split on council. Again, I'll just recommend that we take your comments and we come back with two or three choices in June. And then I think we can synthesize it and be able to bring it back and you can have a good program moving forward.'",
        "'speaker_1': 'Okay. Let's hear from Councilmember Vella.'",
        "'speaker_0': 'So I would want to know what this means to the capital improvement projects that we have planned out at Alameda Point on our other properties. Because, again, I think that there there's a cost to this. And while I think that, you know, we need to I also think there's very few businesses that have truly been locked out'",
        "'speaker_0': 'to a point of being able to undo and unable to do absolutely anything. I think that there was certainly a period of time that there may have been a stall and they'd have to reconfigure how they're operating. And there are some businesses that that business completely probably dried up for them.'",
        "'speaker_0': 'But I don't know that that necessarily means that they were or were locked out. And I think so. I want to be conscientious of that. And I want to go back to what the budget analysis is and what gets delayed, because I also don't want to be in a position where and I've been at meetings where we've'",
        "'speaker_0': 'had our tenants come forward and register different complaints about infrastructure out there where, you know, where were then causing more harm to other.'",
        "'speaker_4': 'Businesses out there because.'",
        "'speaker_0': 'We're not investing in certain infrastructure things as a result of giving these abatements, especially if the business is not going to be able to be sustainable in the long term. And we're just delaying the inevitable.'",
        "'speaker_1': 'Good points and I do think we probably have a couple of businesses. I'm just thinking of our, um, some brewpubs that, that, that don't produce the product that they could be selling and rely on people coming in. But you're right that, that is probably more the in the minority because even the winery that was mentioned, they're still'",
        "'speaker_1': 'selling their wine, they still have their membership. And, you know, you go out and pick up your bottles of wine per month. Um, but so, uh, councilmember decide it just quickly.'",
        "'speaker_4': 'I think one way to get at the issue of not being a blank check for everybody, all those, you know, 20, $20,000 a month rent one way to not get it be a blank check to to a lot of tenants out of Alameda point or whatever properties that we own is again goes back to the question of'",
        "'speaker_4': 'having benchmarks for example jobs howsoever will be defined it certainly if we create a threshold that that that will deal with that another benchmark going back again is that the notion of catalyst and when I read the staff report by Catalyst, I think we're talking about basically for the most part, foot traffic generating or or a type'",
        "'speaker_4': 'of business that has positive collateral effects with regard to businesses immediately surrounding it. So I think that will be one way to kind of account for, you know, an attempt to not be a blank check for everybody, as Councilmember Odie is rightly, rightly concerned about.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_1': 'So Council, shall we take the city manager's suggestion and submit our comments to staff for them to return in June? Or does someone feel that we're ready to actually craft a motion and move forward?'",
        "'speaker_4': 'I couldn't wait to June.'",
        "'speaker_1': 'Um, I, I, um. I think we can certainly wait till June. I want to make sure that we're helping folks who need help and not keeping them waiting too long. And we also don't want to defer too many things to June because that will come back to haunt us in its own way.'",
        "'speaker_1': 'Councilmember Odie, your thoughts?'",
        "'speaker_4': 'I was going to make a motion. Not a completely solve the problem motion, but one to give staff the authority to. I think this was requested early that for the three month abatement or three month deferral, it could be any three months.'",
        "'speaker_4': 'So let them have that flexibility and then also give staff the discretion to give an additional three months deferral per tenant that would be converted into a promissory note loan type arrangement. And then they could come back and, you know, further discussion on potential abatement, because I think there were some good points here that were made.'",
        "'speaker_4': 'But, you know, it's going to be tough for me to, like, say goodbye to money. So that would be kind of my suggestion.'",
        "'speaker_1': 'Okay. So to give it authority to the staff to let is take any three months off as the deferral of the the original.'",
        "'speaker_4': 'April, May, June. Right. Mm. Some may want to play with that.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'So then, for instance, if you paid April, May, June, you can get an automatic July, August, September deferral. Right. Mm. Right. Okay. Everyone should have the opportunity for those three months and then give them the discretion to defer and convert into a, uh, a promissory note up to an additional three months.'",
        "'speaker_4': 'And then that, that should at least keep people, you know, less worried that from now until, what, the end of September, right?'",
        "'speaker_1': 'Yeah. Um, and, you know, I, I, I like, I think that has a lot of merit because, again, with more time, we get a clearer picture of where, where the reopening is going, where the economy's going. Our our revenues and our, our losses.'",
        "'speaker_1': 'And, uh, so, I, I, I think I, I like that. Um.'",
        "'speaker_4': 'And then we can, I can. I'm sorry. And I mean to cut you off.'",
        "'speaker_1': 'And then I think it was the other way around. Sorry.'",
        "'speaker_4': 'You can continue the discussion on abatement, although I am inclined to do as John mentioned, you know, if you if your doors are closed, you know, I'm super sympathetic to that. Without having it like a cap.'",
        "'speaker_1': 'I'm okay. I see the vice mayor his hand up. Yes.'",
        "'speaker_3': 'Does your motion include staff coming back in June with the crew? With the proposed criteria for discussion, for for the the potential, what we're calling it conversion to grant for 50%.'",
        "'speaker_4': 'June or July. You know, whenever they feel they can, they can do that.'",
        "'speaker_3': 'Yeah. Okay. I would be happy to second that motion then. Okay. And I'm just going to say, I think the one thing everybody needs is some certainty so that, you know, some folks are going to need to know if they have certainty of at least if we perform certain metrics, we can do that.'",
        "'speaker_3': 'So with the understanding that staff is doing an incredible, incredible amount of work and an incredible job doing that work. You know, the sooner the better with no date.'",
        "'speaker_1': 'Okay. And I'm so when and you want this to come back to us in June or give us a few months to play out.'",
        "'speaker_3': 'Would be June or July.'",
        "'speaker_1': 'I mean, I think I saw Miss Potter and Mr. Levitt, I guess in order of hierarchy city manager.'",
        "'speaker_3': 'First I was just asking before you vote, could you actually restate the motion so that I understand it exactly what what the motion is?'",
        "'speaker_1': 'Sure.'",
        "'speaker_4': 'Ed, can la read it?'",
        "'speaker_0': 'Well, I think.'",
        "'speaker_2': 'I can try to read it. I think it was you were giving staff three months deferral for any three months that they could do the staff recommendation of any three months. And then you were giving additional three months deferral with the tenants, with the promissory note involved, and then bringing back the abatement issue.'",
        "'speaker_2': 'And then the clarification was the criteria for the conversion to 50 cent 50% grant and then it would be in June or July and it would be better.'",
        "'speaker_4': 'Or 100%, you know. I'm not that far off the table for me either, because it's like I said, I think if they're if they've been locked down and locked out, you know, I think.'",
        "'speaker_0': 'I think.'",
        "'speaker_1': 'I think Councilman, morality, if we're bringing it back for discussion that we don't have to narrow the parameters of the percentages are because we're bringing it back. Okay. So we've had a motion. Do we have a second?'",
        "'speaker_3': 'I seconded it.'",
        "'speaker_1': 'Oh, you did already? Um, you're too late to send it, Mr. Love it now. Yes, Mr. Low. You have to unmute the.'",
        "'speaker_3': 'I just had one more question. So. So it. I'm still not clear. Does the motion include abatement plus three abatement for while they're closed down? Plus three. Plus three. Is that what it includes? Because that's the way it sounds to me.'",
        "'speaker_1': 'Not high. Well, you clarify. Maker of the motion. I don't think we're getting to abatement at this. Okay.'",
        "'speaker_3': 'So no abatement.'",
        "'speaker_1': 'Well, let's hear from Mr. Odie.'",
        "'speaker_4': 'Well, I thought we'd defer that, but it was okay.'",
        "'speaker_1': 'That was my understanding.'",
        "'speaker_4': 'The April, May, June deferral Part A is to give those that may not want April, May, June, the option to take those and any other three months and just leave it open because leave it open. And then that we would authorize you on a case by case basis to grant additional deferrals of up to another three months'",
        "'speaker_4': ', that people ask them that those were converted to the promissory note. And then we would have the discussion on abatement or or a 50% conversion into grants. You know, when you thought it was appropriate in June or July.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'Okay. Okay. Miss Mercado. You're muted, this kind of. Yes.'",
        "'speaker_0': 'So I just have a clarifying question. Or like I do, we have some leeway and flexibility and the repayment terms. Because, remember, you had mentioned before that it could go over the remainder term of the lease. However, because one of the issues that you will hear, you probably have heard is that, you know, we are deferring these'",
        "'speaker_0': 'three months, but then they have to pay that 1/12 of it over a well over a 12 month period of time. So do you want to give us some flexibility in negotiating the repayment terms?'",
        "'speaker_4': 'I'm totally I mean, not as my colleagues, I'm totally open to, you know, having a promissory note go out to the end of the lease.'",
        "'speaker_0': 'Well.'",
        "'speaker_1': 'And if I could add, I think this is where these solutions can be individualized based on a particular businesses need and circumstances. And I think that staff is in the best position to know what those might be and to carry on those negotiations.'",
        "'speaker_1': 'So I would certainly support giving them the flexibility to do that. I think they understand the spirit in which we're proceeding. Vice Mayor Knox White.'",
        "'speaker_3': 'So I would agree with that. I just want to be careful that we're not also using you know, again, we're not picking companies that we think are good companies as opposed to using their accounting, etc., and existing rent.'",
        "'speaker_3': 'Right. I even think the catalyst issue is very more nebulous and than we would like it to be.'",
        "'speaker_4': 'That's why you say end of the lease, because.'",
        "'speaker_3': 'You know. I agree. I like end of the losers. Yeah.'",
        "'speaker_1': 'Okay. If there are no further clarifying questions, we have a motion. We have a second. We have a roll call. Vote, please.'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Not quite. Yes. Odie.'",
        "'speaker_0': 'Yes. Yes.'",
        "'speaker_2': 'Mayor. As the Ashcroft. Yes. Carries by five eyes.'",
        "'speaker_0': 'Hey.'",
        "'speaker_1': 'It's for counsel. And you know what, people? It is 10:00. Goodness gracious. We we haven't gotten too far into our agenda. But let's take a quick ten minute break. Is there a slow ten minute break? Vice Mayor? Not quite.'",
        "'speaker_3': 'Thank thank you. I appreciate the break. I did want to say, given that we have a lot of people looking and we have a lot going on, I'm wondering if we wanted to make a motion did to hear the rest of the agenda so that people know that they're not going to be sticking around for another 90'",
        "'speaker_3': 'minutes only to find out their agenda is not coming up. I, I personally would be willing to commit to that, but.'",
        "'speaker_1': 'I would be a little more judicious about that because it's 10:00 and I would say I would be supportive of a motion that certainly any item for which we have public speakers we will hear. Um, and I think there are some things on the regular agenda that need to move forward.'",
        "'speaker_1': 'Um, I think like the BIA votes, but I'm not sure that we'll get all the way down to the end of the agenda because I think we still have to take a a motion as we get closer to 11:00.'",
        "'speaker_1': 'But certainly we're going to finish this special meeting and then launch into the regular meeting.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Okay. Okay. So ten minute break. It's. What time is it? It's 1002. Okay. It's ten or two. We are starting up at 1015. I know that's a little bit longer, but just give you time to get into place.'",
        "'speaker_1': 'Okay. See you at 1015. Thanks, everybody. And you know, before you you just remind me, Laura, which are we going to hear first on this next when the commercial or the. I guess council can decide what they want to do.'",
        "'speaker_2': 'Yeah, I think the staff is going to give the presentation in two parts. So I think they'll they'll address.'",
        "'speaker_3': 'Oh yes. Oh I can I can answer that. Monama. This is Eric. I can answer that. Ma'am. Can you hear me?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Can you.'",
        "'speaker_3': 'Hear me?'",
        "'speaker_1': 'Yeah, I can hear you. Yes.'",
        "'speaker_3': 'There you go. Can you hear me? Yes. Okay. So I can answer that.'",
        "'speaker_1': 'You hear.'",
        "'speaker_4': 'Us? Yeah, we've. I couldn't for a second, so I guess.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'So I've asked staff to the guy who's going to give the presentation is going to do first the commercial and then that. And then after you're done with that part, then Councilman Brody can recuse himself and Councilmember De Soto.'",
        "'speaker_3': 'And then. And then he'll do the residential.'",
        "'speaker_1': 'Okay. That sounds great. Okay. We're ready to go live. Okay. Yes, Jim.'",
        "'speaker_4': 'And then.'",
        "'speaker_0': 'We.'",
        "'speaker_4': 'We we have to be out of the picture during the public comment, too. Right.'",
        "'speaker_1': 'Um.'",
        "'speaker_4': 'I knew yourself.'",
        "'speaker_1': 'Mr. City attorney. Even even. And Matt and yourself even admit. Yes.'",
        "'speaker_4': 'Speaker, are you there?'",
        "'speaker_0': 'Yes. All right.'",
        "'speaker_3': 'I see, cause there's no way to segregate public comments. Clearly, my recommendation will be that the two councilmembers step off the dais or the camera for the entirety of the public comment period.'",
        "'speaker_1': 'You can do that.'",
        "'speaker_4': 'Okay. Thank you. I see.'",
        "'speaker_1': 'All right. Hey, wake up, Drew. I know. Come on, people. Okay. And we, um. And before we get started, I just want to say we don't need a long winded staff report. We've read our materials, the public had access to them.'",
        "'speaker_1': 'So give us the cliff notes. Give us the high points. It's 1020. Okay, let's do this thing.'",
        "'speaker_4': 'Good evening, Mr. Mayor. This is Scott. Looks from city engineer and members of the City Council. First, can you all hear me?'",
        "'speaker_1': 'Yes. In fact, I'm just going to let the public know. Thank you for indulging the council. We needed to take a little break there. And so with that, we are now moving into item camp to D. And I'm going to ask the city clerk, Ms..'",
        "'speaker_1': 'Weisinger, if she would introduce that item for us.'",
        "'speaker_2': 'Recommendation to endorse implementation of Temporary Street Reconfigurations to provide space for social distancing in response to the COVID 19 emergency.'",
        "'speaker_1': 'Thank you. And so, Mr. Wickstrom, our city engineer, is on the line. So does that mean you are presenting this item or is it a joint venture or how are you doing this?'",
        "'speaker_4': 'I am going to lead the presentation and both Andrew and Rochelle are available. Should there be questions that come up?'",
        "'speaker_1': 'Great. That sounds good. Okay, Mr..'",
        "'speaker_0': 'Wikstrm.'"
    ],
    "Temporary Street Reconfigurations for Social Distancing.": [
        "'speaker_4': 'Thank you. And I would like to thank, obviously, Rochelle and Andrew for helping to basically write the staff report, which is very complete and thorough. So in the interest of time, as the mayor suggested, I will be relatively brief in my comments.'",
        "'speaker_4': 'I'm going to start out with a presentation on the Commercial Street component so that all members of the council can be present and then we can break off later. The Commercial Street's component was really initiated by Davos through a letter that they had sent to the city, requesting support from city staff to help out their local businesses'",
        "'speaker_4': 'during this COVID 19 pandemic. It's something that clearly, as we read the start of their letter, we are very much in support of their goals and their aims. Really, what they look to do is to expand the areas that are available to pedestrians and the patrons to help out the local businesses.'",
        "'speaker_4': 'It's also an attempt to promote the social distancing that's required in our commercial areas now and for several months that we expect into the future. It's also a way to provide a potential for outdoor dining opportunities for businesses as they come back online and have limited seating indoors.'",
        "'speaker_4': 'And lastly, to provide some curbside pickup. So I'm going to touch on these items three, three items. First, curbside pickup, and we'll talk a little bit about how we can do some outside outdoor dining. That, by the biggest piece, is really the potential for some lane reductions on both Park Street and Webster.'",
        "'speaker_4': 'Now, initially when this came forward, it was proposed by Dava. And at the time the staff report was written, WADA was not 100% sure if they wanted to support, but they have since come come on board and are also supportive and requesting a similar kind of treatment for Webster Street as well.'",
        "'speaker_4': 'So starting with the curbside pickup, it's really an attempt to pursue parking spaces or set aside parking spaces for quick pickup for whether you're getting to go food or whether you're doing curbside retail. And it's a really pretty simple thing for us to do.'",
        "'speaker_4': 'It's really a matter of almost changing out parking meter signage at select locations, allowing, for example, say, a ten minute parking so that someone can go or just loading, unloading only. We can certainly work with the business associations to kind of spot where the most opportune locations for those specific curbside pick ups would be.'",
        "'speaker_4': 'It's also easy and inexpensive to implement and really we're talking about changing out some signage on the parking meters. There are a couple of cons in the sense that we might be losing a little bit of parking meter revenue.'",
        "'speaker_4': 'I don't know. That's necessarily going to be a significant sum of money, but it is certainly something to be considered. And then lastly, you know, there's as with anytime you talk about parking in a downtown environment, there is a need to have some degree of enforcement to make sure that people don't abuse these short term timelines.'",
        "'speaker_4': 'So that's a relatively easy thing that can be accommodated quickly. Second thing I want to kind of jump to and talk about our parklets. It's the idea of enhancing the outdoor space to use for dining or potentially waiting to get into to restaurants or other retail areas.'",
        "'speaker_4': 'And the idea is really is to take over existing parking stalls and convert them to places where people can wait or congregate as they're waiting to get into a into a restaurant or a building or potentially even have dining outdoors.'",
        "'speaker_4': 'The advantage of using the parking space for these kind of dining opportunities is it maintains the sidewalk clear. One of the challenges, if we try to do a sidewalk dining program is that if you someone eating at the dinner table, the ability for someone to pass by that is really constraining, particularly if you have people come in'",
        "'speaker_4': 'different directions and it's really difficult to maintain that six foot distance. So if we're able to take the diners and put them out into the parking area, or if there's a you know, if you're waiting to get into a retail establishment at some later stage of of opening, that can also be done a little further out.'",
        "'speaker_4': 'So there's an advantage for that. Now, the city does have parklet guidelines that date back to 2013 and the city has participated on a. Couple of different occasions in a national event called Parking Day, where you basically convert a parking stall into a dining facility for a day.'",
        "'speaker_4': 'And most recently, last September, West Cafe on Webster Street did that as well. But what that shows, I think, is that these these kind of dining options can be done. They can be implemented. They can actually be done relatively inexpensively.'",
        "'speaker_4': 'One of the key things that we are always mindful and considerate of as we do these is we have to maintain accessibility in whatever we do. So most of time when you step off the curb, there's a six inch drop.'",
        "'speaker_4': 'So any of these parklets would have to have some sort of a built up platform to raise it up to the same elevation as the sidewalk. We've shown through that part of the process that there are relatively easy and inexpensive ways for businesses to do that.'",
        "'speaker_4': 'I think another thing that that has been requested both by Vidarbha and staff certainly supports is, you know, there may be multiple businesses that request these things and there may be multiple like overlapping uses of some of these Parklets and staff would certainly be supportive of a district wide encroachment permit such that, for example, applying for a'",
        "'speaker_4': 'permit for all the park, street and lava could apply for a permit for all of Webster Street. And we could use that to simplify the administrative process. And then while still being able to review each of the specific applications on a case by case basis to to see how they function and make sure they meet the accessibility'",
        "'speaker_4': 'requirements and anything else we need to do. So that's the second piece, and I think that's something that's because we already have a parklet policy adopted. It's just a matter of implementing that and rolling that out in a little larger and quicker fashion.'",
        "'speaker_4': 'I think that's the next big piece really is the idea of Hart and Webster Street Lane reductions. And the idea here is that we want to go from a roadway with four lanes of travel to a roadway with two lanes of travel.'",
        "'speaker_4': 'The idea that we take what is now the outside lane, the quick lane, exclusive parking and we convert that into a parking area. And what it allows is we can basically convert more, if not all of the existing parking into curbside or outdoor dining facilities that are out there waiting facilities.'",
        "'speaker_4': 'I will pause for a second and we'll see if this works here. On on on the zoom, Laura, can you see if you can pull up the first slide? I think sometimes a picture is worth a thousand words and see if this works here.'",
        "'speaker_4': 'It's.'",
        "'speaker_2': 'We're making that happen now.'",
        "'speaker_4': 'Cool. There it is. Okay.'",
        "'speaker_1': 'It is so and so.'",
        "'speaker_4': 'I'll just be brief about this slide, but this is a nice way to illustrate kind of what we're talking about where right now this is example on Webster, it's very similar kind of thing that would be applied over on Park Street.'",
        "'speaker_4': 'There are now four lanes on Webster and we take just the inside two lanes, the blue lanes here, and that would be retained for travel. And then what is now parking, which is the orange would be converted into an expanded sidewalk area, whether it's outdoor dining or other kind of uses.'",
        "'speaker_4': 'And then lastly, what was the outside lane that would become a parking parking stalls? And so maintaining obviously areas for a bus drop off. And we worked with the business associations to find out where the best pick up and drop off locations.'",
        "'speaker_4': 'But this is a nice, quick cluster of example of how it could be done. So and so this is good for the slide line. If you go back to what the regulation is saying, we will certainly work with both AC Transit and the fire district to make sure that they're satisfied for language.'",
        "'speaker_4': 'I think that if you look carefully in the reminder, show the temple and we would certainly need to have Olympic lanes to satisfy satisfy the fire requirements. You know, the other thing I'll add to the idea of a lane reduction is as part of the Park Street Signal Improvement Project that was just accepted by council a little'",
        "'speaker_4': 'while back, we did traffic counts on Park Street and similarly we did traffic counts on Webster Street in the past two years. And on both of those streets, the amount of traffic that we have is conducive to a lane reduction using that old data before the pandemic came through.'",
        "'speaker_4': 'And as everyone, it's clearly known that the traffic volumes are certainly lower now than they were last year at this time. So not only do we think because of the reduced traffic in the short term, because of the COVID 19, we also have data from last year that would suggest that doing this lane reduction is possible, is'",
        "'speaker_4': 'feasible with the traffic volumes that we have had. And we'd certainly expect to see in the near in the short term. Details. Obviously, there's a lot of details to make this thing work correctly. And we are kind of at this early stage here to kind of proposed the idea to council and really seek your support and recommendation'",
        "'speaker_4': 'to see if we should go forward and really kind of flesh out the details, developing those fast forwarding platforms, basically reshaping roads to accommodate this, making sure we can accommodate right and left turn movements at each of the intersections and even considerations about if we're moving the parking out to the street, what are we going to do'",
        "'speaker_4': 'about paying for parking? In terms of parking meters? Do we have adequate turnover for those parking sources? A fair amount of work that still needs to be done. But we are we're kind of bringing this forward to council to seek your input about us furthering this program going forward.'",
        "'speaker_4': 'I will note also for this program that if we take of it in terms of a relatively rapid deployment, this is the kind of program that we can get out in the order of a month or two. And it's certainly something that could help the businesses as they come back online and certainly could be in place through'",
        "'speaker_4': 'the duration of the summer all the way through, say, the end of October or even into early November, at which time we could reassess the program as we go into the winter months and potentially then look at if it is successful and supported by both the business and the community, potentially look at what next steps might be'",
        "'speaker_4': 'to make it more of a permanent kind of installation as well. So those those are the highlights for the commercial items. Yeah so really seeking direction from the council to move forward largely consistent with outlined in the report and we if given that direction we will certainly be working closely with both both business associations downtown the association'",
        "'speaker_4': 'and the business association. So with that short staff report unavailable for any question.'",
        "'speaker_1': 'That was sweetened to the point. Thank you, Mr. Wickstrom. Um, I suspect we have public speakers on this item, but before we get started with our public speakers, any clarifying questions for Mr. Wikstrm? Okay. And, madam, quick, do we have public speakers?'",
        "'speaker_2': 'Oh, I'm.'",
        "'speaker_1': 'Sorry. Councilmember Odie. Yes, sir.'",
        "'speaker_4': 'Now we have to step away. Right.'",
        "'speaker_1': 'Um, we are discussing the commercial streets, and that's Park Street and Webster Street. And are we going to finish that discussion and then go into the residential streets, which is where you would recuse yourself? Mr. Chan, the city attorney?'",
        "'speaker_4': 'Yes. With the exception that I.'",
        "'speaker_3': 'Advised a councilmember step away during public.'",
        "'speaker_4': 'Comment, because it's too difficult to determine which which portion it is for.'",
        "'speaker_1': 'I see what you're saying. Okay. Yes, I would.'",
        "'speaker_2': 'Yeah. If I could get to I think members of the public might have comments on the residential portion and would want to hear the presentation first as well. So we're probably going to call them.'",
        "'speaker_1': 'Oh, so you.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Okay. So we'll wait to hear public comment until we've heard both staff reports. So at this point, we're going to ask, well, so then we'll just excuse our two colleagues who have conflicts because they live on streets that are being contemplated in this so street discussion.'",
        "'speaker_1': 'And we will keep them away both for this next staff report and the public public comment period. Right. Okay. All right. So you can go tune in to your favorite TV show or something. Yes. Okay. Thank you for the clarification.'",
        "'speaker_1': 'Okay. So then we will move on to the. And I don't think there were any clarifying questions on Mr. Exchange Report. So then who are Mr. Wikstrm? Are you also presenting on the streets?'",
        "'speaker_4': 'Yes, I am.'",
        "'speaker_1': 'All right. The floor is yours.'",
        "'speaker_4': 'Okay. Thank you again. The mayor and members of the council again present in the second half of this presentation about the residential component of the low streets. This is a program that was launched on April 29th as a pilot program, really looking at two streets.'",
        "'speaker_4': 'We started at Pacific Avenue, running from Oak Street to Grand Street and Rosales from central to Fern Side. Initially, we started out with a relatively limited number of barricades that effectively closed the streets to through traffic and allowed local residents to go into those streets to get to their houses and also any deliveries or services that needed'",
        "'speaker_4': 'to be done there. So the streets were initially selected with help from the Transportation Planning Department, really looking at the notion that they are bicycle boulevards. In our existing bike masterplan. We also looked at them, you know, geographically being on the east end of the side of the city, because we are recognizing that there is the James'",
        "'speaker_4': 'Park Open Space Trail and also the cat ramp trails along shoreline to get a little bit of geographic diversity about where these streets would be. Now, the intention and the goal for these is to really provide additional space for residents who, due to shelter in place requirements, are not doing their normal activities, spend a lot more time'",
        "'speaker_4': 'in their house and sometimes feeling cooped up. Want to get out and get a little bit of exercise, get a bit of fresh air. Yet there is the challenge then of potential for social distancing when there's multiple people on the sidewalks.'",
        "'speaker_4': 'So the goal was really to kind of create a space for these activities to occur and allow pedestrians and bikes increased use of the streets. And really the rationale or the way of doing that is to close the streets to through traffic.'",
        "'speaker_4': 'As I said when I started, this has been out since April 29th. We have had a part of the city web page that's been open with a survey that has generated a fair number of responses during during that time.'",
        "'speaker_4': 'And as of I think it was yesterday, there were 467 survey responses, and the vast majority of people, 75%, are in favor and are in support of these these slow streets as they have been deployed. There's the smaller communities that are 20% that are not in favor.'",
        "'speaker_4': 'And the concerns ranged from people not wearing masks or people walking out in the street and just a concern for some safety around that. That's one component. The other piece I want to kind of bring forward is a piece about traffic counts.'",
        "'speaker_4': 'Now, we did a informal survey. It's not super detailed, but we did do that for a one hour period on Thursday afternoon, several weeks apart. The first was in April 24th, just before the pilot program went into place.'",
        "'speaker_4': 'And then we repeated that survey again last week on Thursday. And on Pacific Avenue, if you combine both the pedestrians and the bikes, there was a 130% increase in the number of kids in bikes during that one hour period.'",
        "'speaker_4': 'At the same point, there was a 50% decrease in automobiles. So you can make a statement that the the the closures just through traffic are having their intended effects. Similarly on resales had bikes increased by 54% and the autos actually decreased by 77%.'",
        "'speaker_4': 'So, you know, in both cases there's been I'll say it's met its intended use. I will kind of kind of move a step. And I think many of you may know that I've had some my personally I city engineer have had some reservations about the program and it really relates around the idea that objectively having fewer cars'",
        "'speaker_4': 'on the road creates a safer situation, but it doesn't necessarily create a safe situation. And I'll do it by way of comparison to a couple other programs that the city does and how a couple other cities throughout the country are implementing this program.'",
        "'speaker_4': 'You know, first of all, where we do like a block party that occasionally residents will apply for it and hold during the summertime, streets are fully closed to traffic such that there's no vehicles going up and down and so that pedestrians can roam around the street safely and not have to think about or even consider the idea'",
        "'speaker_4': 'that there's potentially going to be a car on the road. And if we also look to how some other cities like New York has implemented their what they call their Open Streets program, they basically have it open or physically closed to vehicular traffic from 8 a.m. to 8 p.m., subject to.'",
        "'speaker_4': 'NYPD staffing. And in all the photos that I've seen, there's always a uniformed police officer at one of the barricades to physically, if a delivery or emergency vehicle has to occur or come through to it to allow that vehicle to pass.'",
        "'speaker_4': 'San Francisco made some waves recently. They've closed off the great highway. They closed off JFK in Golden Gate Park and also at Twin, I think it's Twin Peaks Boulevard going up to the top hill. The advantage that San Francisco has in those particular cases is there are no residents that live or front directly on those streets and'",
        "'speaker_4': 'take access, are easier to do, physically closes off and there's alternate pathways for them. Now that's in comparison to, I think, what our neighboring city, Oakland, has done. And we are largely following the Oakland model of closing the streets to through traffic.'",
        "'speaker_4': 'And while it does again provide an improvement in safety, it does not fully, if you will, provide a complete and safe environment for the public is one of the considerations I have about how far and how fast we might want to go and how long we might run this program here.'",
        "'speaker_4': 'So a couple other things to keep in mind is barricades tend to wander when left on their own, I should say. It's actually residents tend to move these things around to their to their liking, to in their probably their opinion, more properly and fully close the road.'",
        "'speaker_4': 'And it does take a fair amount of staff time and effort to, on a regular basis, reset them to the proper locations. And should we expand this program further? Right now, that work has been doing in-house. But if we expand the program further, it would probably be warranted for us to hire an outside vendor to kind of'",
        "'speaker_4': 'be in the position to kind of reset those barricades on a regular basis. That is exactly what the queen is doing as well, to have an outside vendor that's coming through and having those things through. So that's kind of the brief version of the staff report.'",
        "'speaker_4': 'I think the question before the council is whether you endorse the program, whether you feel comfortable that we would extend this program through the shelter in place as kind of outlined in the staff report. And I think what it may lead to at some point is a a longer term discussion potentially about if this is really supported'",
        "'speaker_4': 'by the public and there's a desire to expand this program beyond the shelter in place orders, would it be appropriate to incorporate this into the active transportation program as a mechanism that we might look at for a more permanent or more durable type solution?'",
        "'speaker_4': 'I suggest the active transportation program largely because, you know, as I said about the Pacific, the number of vehicles going down and the number of vehicles going down, those are both the both those counts are taken after the quote or after the shelter in place orders went in.'",
        "'speaker_4': 'So what that really represents is a diversion of traffic off of those streets, onto adjoining streets. And to do that, if we want to make this more permanent, it really rightly should be done as a more community based conversation through and including the Transportation Commission and I think the Active Transportation Functions Program be an appropriate venue for'",
        "'speaker_4': 'that. So with that, I'm available for any questions.'",
        "'speaker_1': 'Thank you, Mr. Wickstrom, and good job of giving that brief. And thank you to the staff. I know we have Andrew Thomas and Rochelle Wheeler who have worked hard on these programs. So thank you both. So any clarifying questions before we go to our public comment?'",
        "'speaker_1': 'Vice mayor next week.'",
        "'speaker_3': 'I have just a couple and I will start with my my thanks to staff for not only putting together a really great program and presentation, but doing it very quickly. I know that they they worked really hard to get it here tonight.'",
        "'speaker_3': 'Looking at the map that's in the staff report, it looks like the current program is does not have signs that every is at every intersection is the goal to put signage at every intersection or is the are we doing that?'",
        "'speaker_3': 'As we move forward, I know that we started with fewer and there have been more and more, which is great.'",
        "'speaker_4': 'Sure, I'll I'll answer that briefly. We started off when we put the program into place, we had the ability within our maintenance department to do I think it was nine installations and we installed seven them on the first day.'",
        "'speaker_4': 'We then then created basically a work order for staff or for the maintenance department to create additional road close to through traffic and additional pedestrian warning signs. We at this point have 20 total installations available, and I believe we have I think 14 of them installed right now are deployed right now.'",
        "'speaker_4': 'The rest of them are being held back to see if we would move forward to phase two. We are going to be in a position to deploy those by late this week or early next week. Part of it comes down to just the capacity to create the signage and to then get them set out there.'",
        "'speaker_4': 'The intention was not to do every single intersection, but the intention was to to really get to the primary intersections. And if the program would go on further, we could get staff back some of those in with the lesser traveled or lower volume cross streets.'",
        "'speaker_1': 'And is that off?'",
        "'speaker_3': 'You know, that speaking more muted.'",
        "'speaker_1': 'Oh, okay. Yeah. Never a good.'",
        "'speaker_3': 'Thing. No. Okay. So it during the pilot. Well, it's been up. Have we had a chance to determine whether we feel it is safer with or without signage and whether there whether we think having signage at the intersection is safer?'",
        "'speaker_3': 'I know. I know. We're not going to say it is safe.'",
        "'speaker_4': 'So what are the early some of the early survey results? And a lot of the initial feedback we got when we started, when we first deployed on April 29th, was at that point, we did not have enough sufficient science to do some of the intermediate cross streets.'",
        "'speaker_4': 'And there was a fair amount of complaints that people would be coming down with, say, sales. They would come down on Santa Clara and make a right turn or make a left turn. And what we've done is we believe it was deployed on the 11th of May.'",
        "'speaker_4': 'We deployed additional barricades and additional signage to start blocking off or closing off to through traffic of those streets as well. So it's now on Santa Clara, also on point of Vista and then of Park. We added both Chestnut and Willow to or just out one or two little that was already closed off.'",
        "'speaker_4': 'We could add additional signage, but that is what we're somewhat limited by is, you know, the MSI is ability to our maintenance departments, ability to create signage and to the extent of, you know, we could go out and do a whole bunch of signage, but we're not really 100% sure about how long this program is going to'",
        "'speaker_4': 'last and how much effort we're going to put into it. So, yes, more signage does make it safer, but there is there are some limits that we're kind of as we're feeling our way through this this pilot program about how far we want to go in, also keeping in conjunction how long this program may be in effect'",
        "'speaker_4': 'as well.'",
        "'speaker_3': 'Thank you. That's all.'",
        "'speaker_1': 'Okay. Councilmember Vella, did you have your hand up for a clarifying question or you were just. Yes, Councilmember Vella.'",
        "'speaker_0': 'I do know that it was noted in the staff report about the barricades and the issues with the barricades. And I guess following up on some of the breaking news questions, I'm just wondering, I know that there's a resource issue.'",
        "'speaker_0': 'I also know that there's a statement about the people moving them. But I am a little worried because on on some of those through streets, there have been issues. Have we had any reports of near-misses or anything like that or other traffic safety issues that have happened since we implemented this?'",
        "'speaker_4': 'I have not heard anything directly. And I might ask Rachelle, who I think probably looked at some of the survey that a little more closely. If I if if you if you've heard anything.'",
        "'speaker_1': 'Wheeler have. Yes.'",
        "'speaker_0': 'Good evening, Mayor and council members. Rochelle Wheeler, Senior Transportation Coordinator. So in some of the survey responses, people have said that there are cars that are coming speeding down the road and there's there's obviously like worry about that.'",
        "'speaker_0': 'I can't recall that there are people who said that they were almost hit and we're not aware of any reported collision happened on this closed streets during Q during this program.'",
        "'speaker_1': 'Okay. Anything further? Um. Okay. And I take it we have some public speakers on this item, Madam Clerk?'",
        "'speaker_2': 'Yes, I. I have public comment to read in the record, and we also have a number of attendees. And so but I'm afraid the public speakers are going to take us past 11 and we would need for council members to do the 11:00 vote.'",
        "'speaker_2': 'So I am thinking maybe we want to pause and ask council members Otis and Jason Song to come back and take care of the 11:00 vote before we get into the public speakers, if that's okay with everybody.'",
        "'speaker_1': 'I think we have an address. Okay. Can you. Can you do that?'",
        "'speaker_2': 'Yes. We're getting councilmember disorganized. Have texted Councilmember Odie.'",
        "'speaker_1': 'Okay. Perfect.'",
        "'speaker_2': 'Getting him to come back.'",
        "'speaker_0': 'So.'",
        "'speaker_1': 'Okay. And so we are. But will get them back. Hi.'",
        "'speaker_2': 'There we go. We need.'",
        "'speaker_0': 'It.'",
        "'speaker_2': 'Jason.'",
        "'speaker_1': 'We need. Yeah, we need to vote to go past 11:00. And so that's where we needed a majority of four to do so.'",
        "'speaker_2': 'So the remaining items, if you if the whole entire consent calendar. And then, of course, we have a six, a, B and C on the regular agenda and 9aa referral.'",
        "'speaker_1': 'And I will just say that I, um. I definitely. Want to get us to the the regular items. I think A, B and C are very important and I don't think six and six B are going to be very long.'",
        "'speaker_1': 'I think we have a little more time on this one. But council, it's almost 11, so we agree to either hear certain items or go until a certain time. And I know we're going to try to move things along as as expeditiously as possible.'",
        "'speaker_1': 'So. Yeah. And, you know, if I had to make a time estimate of how much longer on this one. Oh, I'm not sure. Councilmember Rudy, what were you going to move?'",
        "'speaker_4': 'Well, I was going to move if we hear the remaining items. And not to put a time limit on it, but. I mean, I don't know how many speakers we have on any of them.'",
        "'speaker_1': 'Well, I would imagine we have a number on this. When I add that's a suggestion and I do take all your suggestions seriously, I would like to suggest that we finish up this item, then move to the regular agenda, including the consent calendar and item six, A, B and C.'",
        "'speaker_1': 'Price may not quite. I'm not hearing you.'",
        "'speaker_3': 'Sorry. I forgot the push button again. I was going to I was going to second Councilmember Ortiz recommendation. I would just say the only the consent counter and a, B and C, I think if we just. My guess is looking at the referral, this is a very quick, not long discussion.'",
        "'speaker_3': 'So I would be inclined to just finish it all off with a commitment from myself to keep it short.'",
        "'speaker_1': 'I am not willing to go past midnight. That's just me. I don't think.'",
        "'speaker_0': 'A question.'",
        "'speaker_1': 'There is a fair to the public. If we could make a motion that we. To the balance of this agenda and finish by midnight. I would go for that because I think it kind of keeps us on our toes.'",
        "'speaker_1': 'And I'm going to ask for brief staff reports on everything. Coming forward.'",
        "'speaker_4': 'Or do we have a motion in the second or third?'",
        "'speaker_3': 'That would be my goal.'",
        "'speaker_1': 'Councilmember de SAG, we haven't heard from you.'",
        "'speaker_4': 'I'm fine with doing the agenda and finishing up until 12, largely because I think, you know, there are several there are issues about this years, several years ago. And and I think it's a good point that, you know, is the public served up by us making decisions at 1215.'",
        "'speaker_1': 'And keeping them out past midnight.'",
        "'speaker_0': 'To. Yeah.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'So I'm not.'",
        "'speaker_4': 'Out there at home.'",
        "'speaker_1': 'But they're not they're not fast asleep or maybe we put him to sleep. Okay.'",
        "'speaker_4': 'And Eric and.'",
        "'speaker_1': 'I would say it sounds like you've got support from two council members to get this done by midnight.'",
        "'speaker_4': 'But when that.'",
        "'speaker_1': 'Happens on the.'",
        "'speaker_4': 'Right, you know, if we're in the middle of the referral and we only need five more minutes, I don't mind going over, but I'll, I'll do my best to talk briefly.'",
        "'speaker_1': 'Okay. I won't support a motion unless we end at midnight. We're ending at midnight.'",
        "'speaker_4': 'Sure. And fair.'",
        "'speaker_1': 'Here. What's the motion?'",
        "'speaker_4': 'Let's cut our time from 9 minutes to 3 minutes then.'",
        "'speaker_1': 'Hmm. I think on this particular item, we need more than 3 minutes.'",
        "'speaker_3': 'I would like. As long as there's a commitment to finish six C, I am fine to say midnight. But if it's midnight and we're done with 60, my expectation is we're going to finish 60. We asked the council, we asked the respondents and the staff to make sure that they made this the agenda.'",
        "'speaker_3': 'We pushed them really hard. That's my biggest issue.'",
        "'speaker_1': 'And maybe we put 60 next on the item, although I have a commitment from staff that six and we are going to go quickly. Councilmember Bell, I see your hand up.'",
        "'speaker_0': 'So my referral was just going to come up. It's been in Council Communications which got cut off at a previous meeting and it is timely. So I don't want to just keep pushing it forward. It's. It should be fairly short.'",
        "'speaker_1': 'To get a motion that we end by midnight.'",
        "'speaker_4': 'Well, I move items, talk quickly. I finish by midnight. Anything we don't finish, we continue to tomorrow. 7:00. Continuation meeting.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'It's not that.'",
        "'speaker_1': 'Okay. Surrounding by midnight or sooner. Okay. So we have a motion by Councilmember o.T. Second, by the vice mayor mean we have a roll call vote, please.'",
        "'speaker_2': 'Yes. And I will just clarify. That means if you're still in part of your continue, if you're still discussing, say, item six or six or one of those items, you would still stop the discussion at midnight and then that would continue to tomorrow night.'",
        "'speaker_2': 'Right. Just to clarify that, that's what the motion is. Yes. Okay. Thank you.'",
        "'speaker_4': 'Vote or vote to overrule.'",
        "'speaker_3': 'Okay.'",
        "'speaker_2': 'Okay. And then so Councilmember de SAG. Yes. Not quite.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Yes. At mayor as Ashcraft.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'That carries by five eyes.'",
        "'speaker_1': 'Okay. Thank you, gentlemen. We'll excuse you again.'",
        "'speaker_0': 'Oh, yeah.'",
        "'speaker_1': 'Sorry we had to bring you back. Okay, finish second. We'll start with our public comment. Let's skip Mr. De Sack one minute there. All right.'",
        "'speaker_2': 'Okay. So. Okay. For the attendees who are on the Zoom call, if you could please raise your hand now if you would like to speak on this item. Okay. And also, in addition, there's members of Dabbagh who are in the on the attendee as attendees, and they said they could answer any questions.'",
        "'speaker_2': 'If you get to the portion of the business district and have questions for them, they wanted you to know that. So it looks like we have only one who wants to speak on Zoom, but then I have six comments to read, so that is a total of seven and does reduce the time to 2 minutes.'",
        "'speaker_1': 'Okay, let's take our person who's live first and then 2 minutes to each comment.'",
        "'speaker_4': 'And the first speaker is Robert Del Rosario.'",
        "'speaker_1': 'Oh, hello, Mr. Del Rosario. Oh, Mr. Del Rosario. Yeah. And I welcome.'",
        "'speaker_4': 'Good evening, everyone. Robert Salazar, director of Service Development and Planning. We also submitted a letter.'",
        "'speaker_1': 'From AC Transit. Perhaps?'",
        "'speaker_4': 'Yes, from each other. That is correct. We did submit a letter to the city council commenting on this item. So that doesn't need to be read in the record since I'm going.'",
        "'speaker_3': 'To provide the same.'",
        "'speaker_4': 'Talking points. So AC Charter does acknowledge that there is a strong tie between strong commercial districts and strong public transit and vice versa. We therefore support the city's proposal for commercial slow streets that promote social distancing and economic development as businesses begin to open in this environment.'",
        "'speaker_4': 'As you're probably aware, Avicenna does still operate service during these times. We're carrying the most vulnerable in our communities and those that have no other transportation options to make their essential trips, whether it's for work, health care or groceries.'",
        "'speaker_4': 'With that said, we hope that the city treats all forms of alternate transportation modes equitably through the Slow Streets projects, proper street streetscape treatments for Haiti. Transit busses are measured, in my opinion, by three goals. One is safety.'",
        "'speaker_4': 'Two is accessibility. And three is operational performance, which is essentially the speed and reliability of the bus and the schedules. So we had to coordinate with the city staff to monitor operational performance and introduce any mitigations as we need to or even reopen travel.'",
        "'speaker_4': 'And should trains have been negatively impacted or delayed by these projects on Western Park for ensuring safety and accessibility? We're requesting that the city pay particular attention to the treatment of bus stops under the project. The bus that's become a potential point of conflict between busses pulling to the curb and either pedestrians and cyclists entering exiting the'",
        "'speaker_4': 'proposed expanded mobility zones on a given block, depending on what the uses of those mobility zones will be. So therefore, our HS2 request installation of temporary bus walls or boarding islands to avoid a potential conflict, to maintain safe transit access for riders while providing a safe path of travel for cyclists, pedestrians and other users.'",
        "'speaker_4': 'This treatment also helps keep the busses moving so that they're not ducking in to traffic to serve riders, which is particularly important in the single lane. If I could just wrap up residential streets, we don't want to have them close down fixed route and we also want to maintain paratransit access.'",
        "'speaker_4': 'So I thank you for allowing me time to speak and I'm happy to further coordinate with the city on this effort.'",
        "'speaker_2': 'Yeah. You're muted in there. Okay.'",
        "'speaker_1': 'Sorry. Thank you, Mrs. Reisinger. And. And thank you, Mr. Del Rosario. And that's going to our written comments. Okay.'",
        "'speaker_2': 'The next one is from Ingrid Baumann from Alameda. I've been an Alameda resident for 15 years, living on Broadway, and for 15 years I have only lived on two major and problematic thoroughfares of Alameda. I have would have very much preferred living on a quiet street where kids play basketball and can ride their bikes safely.'",
        "'speaker_2': 'I'm a pedestrian. I ride a bike and take public transit whenever possible. Through many well-crafted plans, I've seen Alameda rooms become much safer than when I first moved to Alameda. These improvements done by the Transportation Commission and advocacy groups need to be fully acknowledge and appreciated regarding the Slow Streets and Commercial Street Plan.'",
        "'speaker_2': 'However, I have some concerns. I came upon this plan as a friend, sent it to me to sign the petition in favor of slow streets. I would not have heard of it otherwise. I have since tried to read over the plan and feel quite overwhelmed at trying to make sense of it.'",
        "'speaker_2': 'It seems that the implementation of the plan will be largely up to the evaluation of the plan itself and the response from the community. But through which channels? Who do we expect will chime in on this? Right now, our community is coping with an unprecedented situation.'",
        "'speaker_2': 'Families are working from homes while homeschooling children. Many people are taking a risk every time they go to work. Many people have lost their jobs. No one is left untouched. Let's face it right now, the people who can educate themselves about community initiatives read about it at length and chime in at city meetings, are the only people'",
        "'speaker_2': 'who have the luxury to do so at this time. It is a luxury to be able to focus on large, sweeping plan to reshape almeida's urban fabric and come to the table to share enthusiasm or concern. It's unlikely that anyone who recently lost a job or income has to homeschool children or care for sick family members will'",
        "'speaker_2': 'have any bandwidth left to speak at council meetings in that sense, because this moment makes being an entire community input challenging. The input is likely to be lopsided. The program is trying to accomplish some ambitious and remarkable goals.'",
        "'speaker_2': 'Making access to our local businesses easier during social distancing is a fantastic goal and we should all support it. Trying to make our streets safer is an urgency for Alameda. Increasing use of public transit is essential to reducing our carbon footprint.'",
        "'speaker_2': 'What the. And she had many further comments. The next one is Cindy Johnson. I support Slow Streets and hope you do too. Despite the pilot being limited in a number of ways, I've been grateful for the program and know that expanding it will make it better.'",
        "'speaker_2': 'When I was young, our neighborhood streets were slow streets in the sense that cars drove slowly, expecting kids to be playing there. We spent hours in the streets biking, rollerskating, skateboarding, playing dodgeball, even pogo sticking. We didn't have scheduled activities and our parents didn't spend hours driving us around to get to them.'",
        "'speaker_2': 'I didn't think it was special then, but now I know it was. The Slow Street pilot program has been a sliver of flashback in that sense. Occurs to me that even post-pandemic, we could benefit greatly from dramatically slowing cars down on all neighborhood streets and treating our streets more as shared assets for people of all ages, not'",
        "'speaker_2': 'just for the exclusive use of cars. Regarding commercial district, my heart goes out to the local merchants that are under tremendous strain right now. I'm eager to support them with my business and hope we can implement strategies that allow them to open without endangering the health of customers and staff.'",
        "'speaker_2': 'I live about ten blocks from Webster and have been there a few times recently on my bike to pick up food and felt cramped on the sidewalk by other customers waiting. It wasn't that it was crowded, but with others walking by, especially in small clusters or with dogs, the distance can easily get eaten up.'",
        "'speaker_2': 'So I am encouraged that there are initiatives afoot to create more space for people by claiming road space. Taking a lane from car traffic and moving parking out is one good option. I would feel more comfortable shopping in an establishment if I can stay in front of the store while I wait while also maintaining six feet of'",
        "'speaker_2': 'distance from others. If it is a safe, comfortable and inviting space, I may even want to stay a while and dine when that's possible, but that would require significantly more outdoor space and more street charm. The European model of pedestrian street and large court outdoor dining areas in front of restaurants may be worth considering.'",
        "'speaker_2': 'The natural temptation will be to make it easy for people to drive cars and pick up purchases. But a drive through district. She also intentional comment.'",
        "'speaker_1': 'Thank you. Okay.'",
        "'speaker_2': 'Next, Pat Potter. Wow. Who would have thought six months ago that you all would have an opportunity to turn Park and Webster streets into world class spaces? With your vision, Alameda will be ranked up there with the best European pedestrian plazas.'",
        "'speaker_2': 'We just have to make people our priority. Visualize this. There is a beautiful plaza between Central and Alameda Avenue with seating for dining stalls, for shopping and art exhibits. This plaza becomes a musical and outdoor movie venue as well.'",
        "'speaker_2': 'Once COVID 19 is controlled, walking and biking is encouraged when coming downtown and the parking garage is a place to park. If you are not able to ride or walk, the sidewalks on Webster Street are expanded and the business owned parking lot such as US Banks and Mountain Mike's our reason for parking for anyone who can't walk'",
        "'speaker_2': 'or ride a bike. But biking and walking is always prioritized along the street to create the best shopping and dining experience. To really make our business communities fun, relaxing and inspiring places, we have to envision them as places where we can stroll, shop and dine, not the places they are now, where people rush in and out of'",
        "'speaker_2': 'the area in their cars. We want people to see Park and Webster as places they can bring the family on a summer afternoon or see friends and enjoy. Our wonderful business community has to offer. And next is Denise Trapani.'",
        "'speaker_1': 'It.'",
        "'speaker_2': 'Yes. Start by thanking staff for all the work they've done so far on the Slow Streets program and thank you staff and council for your science and fact based leadership. I've never been prouder to be an Alameda and the existing slow streets though a bit out of the way for me have been wonderful.'",
        "'speaker_2': 'I'm fortunate enough to still be working from home, but the uncertainty that I and so many others are facing is difficult. Having the opportunity to safely go for a walk in the evenings down Pacific has been sanity saving, I remarked.'",
        "'speaker_2': 'I'm reminded of my youth when we were expected to go play in the street until dinner and it wasn't a death wish. It's so wonderful to see parents teaching their kids to ride bikes or children chalking up the streets for hopscotch and foursquare.'",
        "'speaker_2': 'It seems like everything might be okay. I want to ask you to please not only approve staff's recommendation to expand the Slow Streets project, but also consider adding pieces reminding folks who should be prioritized on the streets. Some drivers may still be surprised to see people outside of cars on the streets.'",
        "'speaker_2': 'I'm also very grateful for DARPA's support for reconfiguring Park Street to better support shoppers and diners. With today's further loosening of restrictions allowing for retail curbside pickup, I would like us to consider reconfiguring our street space and our business districts to allow for safe, separated bike infrastructure on both Park and Webster in order to facilitate car access'",
        "'speaker_2': 'to these business corridors. I believe this should be a priority over personal parking while there's a parking lot one block from Webster Street. We don't we still don't have any way for people to bike safely on Park or Webster.'",
        "'speaker_2': 'There are many recent and local studies that prove that decreasing car infrastructure and supporting biking and walking is good for business. Please, if you're going to do the work and reconfigure our streets, please don't continue to allow for on street parking while not doing anything to provide a safe place to bike.'",
        "'speaker_2': 'Thank you again for your thoughtful consent.'",
        "'speaker_1': 'Thank you. Next.'",
        "'speaker_0': 'Lara.'",
        "'speaker_2': 'Yes. Olaf, Scotland. Sorry. Olaf Fallon, who's an Alameda resident. I recently saw an article about Berkeley closing some streets to allow restaurants to use sidewalk space or lanes for outdoor seating. This will allow many to serve the same number of patrons at once as they did before the pandemic struck.'",
        "'speaker_2': 'As I'm sure you know, the restaurant business is very episodic. There are busy times a day and quiet or dead times of day. When we get to the point where anything other than takeout is safe, barriers and testing requirements that limit a restaurant to half or less of its normal capacity will cut their revenue in half or'",
        "'speaker_2': 'less. The business will not spread out significantly. As a result, many restaurants will be unable to cover their expenses and will be forced to close permanently. Most restaurants operate on the very edge of profitability. In addition, allowing outdoor dining will simply be safer.'",
        "'speaker_2': 'Sunlight decimates viruses and destroys them. The large volume of space and air any shed virus spread into it will reduce the amount of individual. An individual comes into contact with end points of concentration, such as air conditioning units will be removed from the system.'",
        "'speaker_2': 'Similarly, most shops are small, intentionally to minimize rent and expenses. With few people in stores, revenues will be drastically reduced. Surely we can make this happen for our fine city. My wife and I moved to Alameda over 20 years ago for the sense of community we feel here and the local restaurants and shops are an enormous part'",
        "'speaker_2': 'of that. Please do everything in your power to help the city find creative ways to allow our restaurants and stores to open without endangering the health of our loved ones. Closing streets and lanes would be an excellent start.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'And next, the last one. Unless I think you just make sure. Oh. Okay. Yes. Last one is driven straight lo alameda resident. Temporary street reconfigurations involve reusing traffic lanes and parking spaces. The following is regarding the section Commercial Streets, Park and Webster.'",
        "'speaker_2': 'There is a proposal later tonight to remove 23 parking spaces that Central Avenue businesses and neighborhoods needs. Without those Central Avenue parking spaces, the existing parking spaces on Webster Street near Central Avenue become more necessary for the neighborhood.'",
        "'speaker_2': 'That is one of the reasons why it is extremely difficult for Webster Street businesses to in mass easily convert parking spaces to restaurant use to provide space for social distancing. Park Street, Oakland's Jack Glennon Square, and San Francisco's Market Street have parking structures.'",
        "'speaker_2': 'Webster Street does not. Individual businesses. Businesses should have permission during a limited COVID 19 emergency time frame to implement some street side expansion. But the city needs a plan for a Webster Street parking structure solution. Remember, outdoor temperature, fog, rain, wind and street lighting are factors that a normal indoor restaurant does not normally need to consider for'",
        "'speaker_2': 'its restaurant service. Such weather factors extremely limit the number of hours they can actually be used. For example, 6 hours successfully for outdoor dining. Most streets are designated for 24 hour vehicle use, and in particular, their use is for emergency evacuation, which is the daily basic public safety need for most of us in Alameda.'",
        "'speaker_2': 'Separately, I dislike the city's partial closing of First Avenue without advance public discussion. And that's the last speaker.'",
        "'speaker_1': 'All right. Thank you. And there are no further public speakers with their hands up, correct?'",
        "'speaker_2': 'Correct.'",
        "'speaker_1': 'Okay. So with that, I will close public comment and I see. Miss Wheeler, shall we? There you have your hand up. I do.'",
        "'speaker_0': 'Yeah, I wanted to just if I could just amend a comment I made earlier in response to Councilmember Miller's question about near misses. So I was I was looking at the data again on that. We've gotten through the survey in the service request.'",
        "'speaker_0': 'And there there there was a recent report on Pacific at Schiller of someone who said that there that their child had almost been hit by a speeding car, their child on a bike. And and that is one of the intersections without a barricade.'",
        "'speaker_0': 'And so they were requesting the barricade there.'",
        "'speaker_1': 'Uh, thank you for amending. That's your comment. I appreciate that. All right. So, um, let's see. We've got two, three councilmembers. And so the, um, the items before us, we've. We've heard and the recommendations. So let's see, we should discuss the, um, the residential streets because that's the, the items that our colleagues were excused from.'",
        "'speaker_1': 'And so let's get that done, and then we will bring them back in because that time keeps marching on. So who wants to lead that discussion? Vice Mayor Next slide. How about you?'",
        "'speaker_4': 'Sure.'",
        "'speaker_3': 'Yes. Um, the video seem to make that clear. Thank you very much. I want to I want to thank again thank staff for all of the incredible work. I want to give my my strong appreciation for the network map that was that is included in the the packet.'",
        "'speaker_3': 'It shows some thought about developing this program into something that can really sustain what I would say is help to sustain and support that that part of this discussion, the business part of this discussion later that we will be having.'",
        "'speaker_3': 'You know, I appreciate the kind of how we have piloted this, that we've learned a lot of things. And, um, and I appreciate the acknowledgment, although I think it was said is it possibly is a point of concern, but that actually these slower streets are safer.'",
        "'speaker_3': 'They may not be 100% safe, but they are safer than what we have. And this morning, as as we on the council know, we had yet another pedestrian hit at a properly designed intersection at Constitution and Buena Vista.'",
        "'speaker_3': 'We know that the streets we have right now are not overly hospitable to people walking and biking. And so I'm excited to see this program when we're trying to encourage people to get out and exercise and actually keep their distance from each other, expanding and finding ways to reuse our public space adequately.'",
        "'speaker_3': 'For for me, I want to you know, I think there needs to be signage at every intersection. Well, I heard that we don't have it all right now and that we have to take some time to to create this.'",
        "'speaker_3': 'I think that should be a priority as as a as a part of this program, is to just continue to to roll that out. Because we did hear that where they've looked at it, signage is better than no signage and barricades, etc..'",
        "'speaker_3': 'I'd like to make the clarification and it's one I've made it to council meetings already. I don't see this as a shelter in place program. This is a social distancing program. We're rolling it out. There's a shelter in place because we have the time to do that.'",
        "'speaker_3': 'And and we can spend some time thinking. But this is you know, we are going to be sheltering in place at least through the end of this year. They're not sheltering in place. Sorry, socially distancing. And part of the socially distancing is going to be don't travel too much, you know, keep your distance, etc..'",
        "'speaker_3': 'And so the the staff report talks about, you know, we don't know if this will be around for a couple of months. We know that this program is going to be needed in around through at least the end of 2020 and probably very possibly into 2021.'",
        "'speaker_3': 'The good thing about the kind of the temporary way in which we're doing this is if that is a gloomy projection and things clear up or easier, we can always we can always take it down or decide what how to move forward earlier as necessary.'",
        "'speaker_3': 'Other than that, I, I just like I said, I think it's I think we have a great network. I would like to see it move forward as fast as possible. Most of my other comments are about the the second part of this conversation.'",
        "'speaker_3': 'So that was it. Thank you. Thank you.'",
        "'speaker_1': 'To Staff Council member Vella. How about you? Admit that.'",
        "'speaker_0': 'Yeah, I think, you know, I echo a lot of both mayors comment. I think we need to add more signage. I think we need to add more barricades, especially where we know we have near-misses potentially that have occurred.'",
        "'speaker_0': 'I think we need to stay on top of that and make this a state of design as possible. I also worry just because I think their normal methods of getting information out, like people at the coffee shop and things like that are limited right now that unless we have the whole street blocked off, like all of our'",
        "'speaker_0': 'sales, all of specific, then people just don't know about it. And they're, they're learning about it after the factories they drive through or as they pass by. So I just think the signage is absolutely critical and we need to do better on that and also do better on the barricades, especially for streets that we know people use'",
        "'speaker_0': 'as a cut through to pass pass through those areas. I notice on, for instance, on beer sales, there's there was almost like nothing there right around Addison school and that that makes me very nervous just because that's a place that draws a lot of kind of foot in bike traffic going through.'",
        "'speaker_0': 'So I just wanted to, to try to make this a safer design as possible. I do think we're going to be doing this for quite some time. It's not just about social distancing. It's about the fact that we also have a lot more people that are going to be working from home or doing remote learning for adults'",
        "'speaker_0': 'for the fall police to the end of the year. And they need places to go and be active and to do it in a way that is not going to overcrowd certain areas. So it's both of these factors together that I think we need to take into account.'",
        "'speaker_0': 'And I think we should just plan on having there at least through the end of 2020, if not longer.'",
        "'speaker_1': 'So I would say that I am very fond of this program. I, I regret that it brought up very fast in residents for not notified in advance until they saw the barricades going up. And I got a few emails that were people who were upset when I emailed back and said, I hope you understand that at this'",
        "'speaker_1': 'point in time our staff is stretched very thin and so some things didn't get done. I got really nice responses back. Now we understand this is a good program, but I do think for a number of ways, you know, this was brought about by an unfortunate incident, the COVID 19 pandemic.'",
        "'speaker_1': 'But as I have said often since we learned about all this new, new normal, there's always silver linings to every cloud. And and for me and for my husband, we try to get out every evening before it gets dark and take a walk on the weekends with active writer bikes around.'",
        "'speaker_1': 'And I'm seeing people out and people waving and chatting from a distance with people, even people they don't know. And I think this is this is part of what makes community. I do think that the way to go about it, though, is to expand it with time, but under the auspices of the transportation the active transportation plan'",
        "'speaker_1': ', because then we have the ability to get that community input, which is which is important, because.'",
        "'speaker_0': 'That's.'",
        "'speaker_1': 'Just to say that, you know, you divert traffic from one street and it heads to another. But I also know just anecdotally from the walking, try to do a, you know, a walk to the west end of the city on one Friday night to pick up dinner in the east and the other.'",
        "'speaker_1': 'And it's really fun because you talk to people in their yards. And so we were walking back from Webster Street one night, a couple of Friday night, to go down Haight Street and set to talk to some people.'",
        "'speaker_1': 'And and somebody recognized me even behind my mask as the mayor. How do we get our street history to be one of the slow streets? And I said, well, you could ask the mayor, you know, email me at my at city hall.'",
        "'speaker_1': 'And so I will say and I said, you know, if if your neighbors really feel this way, have them email. And I promise I talked to our city engineer on the phone earlier and I said, I've got a bunch of emails to forward you.'",
        "'speaker_1': 'I am hearing from the street neighbors, eighth Avenue, maybe.'",
        "'speaker_0': 'Your street.'",
        "'speaker_1': 'Whatever it is that they're interested, too. So people, you know, residents like that, you slow things down. It's just it's healthy, it's good. But we want to do it properly. So as long as this shelter in place and we still are sheltering in place, even though we've opened up to early stage two and we've opened up curbside'",
        "'speaker_1': 'retail manufacturing, we still the public health officer says you stay at home as much as you can and just go out for those essential activities. But exercise is one of them and it's healthy. So we'll be doing this for a while.'",
        "'speaker_1': 'But then that also gives our Transportation Commission and whoever I will be overseeing this the time to work this into the active transportation plan. And then I think we all have to be cognizant as councilmembers to that. We are spreading staff very thin.'",
        "'speaker_1': 'So if we want to get these things done and done in permanent fashion, then I'll have to figure out a way to to manage that time. Um, so I would say, um. I think I've heard a lot of kind of.'",
        "'speaker_1': 'And the other thing I'll just throw in is that I have heard on a couple of occasions now from Ellen Corbitt, who is ah, she's at the U.S. Regional Parks District Board member whose district includes Alameda County Beach and Crab Cove.'",
        "'speaker_1': 'She has asked all the mayors of Alameda County to please do things, and I love it. At the mayor's conference last week, she held up Oakland and Alameda as examples of please close some of your public streets where you can to give people more space to spread out and recreate, walk and ride their bikes to take the'",
        "'speaker_1': 'pressure off our district parks the beach, because in some areas of the county and other counties, they've actually had to close these big regional parks, district parks, because people were just coming out in huge numbers and not doing things safely.'",
        "'speaker_1': 'That has not been the case in Alameda, but we are kind of bursting at the seams. So I'm glad we're looking at expanding this. I always want to see geographical equity. And I, I think this is an important program to move forward.'",
        "'speaker_1': 'So to move this forward, we need a unanimous vote. So, um. Who wants to craft that motion? Vice mayor.'",
        "'speaker_3': 'So I'm assuming a good dove. Councilmember Vella was raising her hand like.'",
        "'speaker_1': 'I couldn't tell either. Councilman Rivera, did you want to make the motion like she did?'",
        "'speaker_0': 'No, I didn't.'",
        "'speaker_1': 'I can read that live. Read one's elbow. Yes. Okay. No.'",
        "'speaker_3': 'All right. I so I would like to move that. We endorse the temporary street reconfiguration to prevent space for social distancing in response to COVID 19 emergency with with clarification that this is during social distancing and not just shelter in place and with endorsement of moving forward with the in the in the spirit of of Mr. Corbett's'",
        "'speaker_3': 'request of expanding this program on a temporary basis as we work through the active transportation program to identify how to address it on a more permanent basis in the future.'",
        "'speaker_1': 'Okay. Um, and do I have a second? Michelle Ellis.'",
        "'speaker_0': 'I can.'",
        "'speaker_1': 'We have a second? May we have a roll call? Vote, please.'",
        "'speaker_2': 'Council member Our Vice Mayor. Not quite. I remember Bella.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Mayor. As the Ashcroft.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Let's bring those colleagues back in and talk about the commercial streets portion of this.'",
        "'speaker_2': 'We're getting them now. Thank you.'",
        "'speaker_1': 'Thank you. Welcome back, gentlemen. Okay. Now we are going to discuss the covered commercial streets has kind of a dark side sound to it, but they this, you know, opening up the the commercial streets Park Street, Webster Street.'",
        "'speaker_1': 'We had a nice staff report by the city engineer, a council discussion motion. It's almost 1130. Who wants to start? Councilmember Odie.'",
        "'speaker_4': 'I'll go fast, hopefully in fewer than four and a half minutes year for half of it. I think we got to go big on this for a number of reasons. One, other places are going to do this. I saw where Berkeley is thinking of doing this over at Oakland, maybe doing this in other cities.'",
        "'speaker_4': 'And our residents that are going to want to go out to eat are going to have that ability, are going to go. And if we don't give them the opportunity to do that safely here, they will go somewhere else.'",
        "'speaker_4': 'So I think just for that share equal a level playing field for our residents and our shop owners that we need to do this. I tweeted something last week. I thought, you know, every Friday and Saturday night we need to close park from Winter Vista down to San Jose and close Webster from Bonita Vista down to central'",
        "'speaker_4': 'and parking lots across the city where we have restaurants like South Shore and Alameda Landing and others. So I mean, that's my go big and go bold. And then thankfully, I was recused from the last discussion. And what popped up in my Facebook feed while I was checking the Internet was that the California ABC Alcohol Beverage and'",
        "'speaker_4': 'Control just released an update regulation that would allow restaurants and bars to serve customers on sidewalks, parking lots and street. So this is something that's going to happen. And I don't want Alameda to miss out on it. I don't want our restaurants to miss out and I don't want our residents to miss out and I don't want'",
        "'speaker_4': 'our shopkeepers to miss out on it. The only concern I have with only shutting down two lanes is I don't know anyone who's ever eaten with exhaust next to you, but it's not a very pleasant thing to do.'",
        "'speaker_4': 'And we're going to need a lot of space for people to walk and be distant from each other. So I say go big. Thank you.'",
        "'speaker_1': 'Okay. Councilmember de thug a great.'",
        "'speaker_4': 'You know. Can you hear me? Hopefully you.'",
        "'speaker_1': 'Can. Yeah.'",
        "'speaker_4': 'Judging by the emails we are receiving, this is something that residents are incredibly enthusiastic about. So I think definitely we should get behind this. They'll definitely help out many of our businesses in our commercial areas. The one thing that I would certainly encourage when it comes to Park Street is I do like the idea of closing off'",
        "'speaker_4': 'of the side streets like the portion of Alameda Avenue between Oak and Park Street, but also north of north of Santa Clara Avenue. We might want to take a look at closing off a portion of Everett Street between a portion of Webb.'",
        "'speaker_4': 'Yeah. A portion of Webb Avenue between Everett Street and Park Street. So that's something to think about. But this certainly, you know, it will certainly rejuvenate our commercial areas, making them what sociologists call a third space, a place where people come together and in times like this, obviously in a socially distant, safe manner, obviously.'",
        "'speaker_4': 'This is something that I think not just businesses, but residents will look forward to.'",
        "'speaker_1': 'Mike, thank you. Thank you. Casimir Vella.'",
        "'speaker_0': 'So, you know, one thing that I would like to add and somewhere along the lines of what Councilman Brody said, is that we have several street fairs scheduled typically during the summer on both Park and Webster Street. And obviously with the new guidelines, events aren't going to happen.'",
        "'speaker_0': 'But I would love to see some form of a special event street closure opportunity like that, where we close off sections of Park in Webster to all vehicle traffic for several days. But we allow for outdoor dining in in those spaces and it might be something that we could do potentially in in July and August.'",
        "'speaker_0': 'I think that there is a few different opportunities for that. I would love to see the area opened up and made available for outdoor dining again for foot traffic, foot traffic and biking. I would add that if that's the case, I do want to make sure that we have we think about bike parking and bike crawls and'",
        "'speaker_0': 'things like that that are going to be safe and clean for folks and ways to do that. I think this is these are these are things that we just need to think about now. And the other thing that I would like to add is, you know, if on Webster, we can't have the same types of closures that'",
        "'speaker_0': 'we can get on park, that we think about using those outdoor parking lots that exist off of off of Webster to allow for businesses to utilize those spaces. And I think that we need to do that because losing 50% of their tables, which is what they would have to do in order to comply with the distancing inside'",
        "'speaker_0': ', is just not going to cut it. And I would just want to thank staff for their work on this. Thanks.'",
        "'speaker_1': 'Yeah. Thank you. Okay. Vice Mayor?'",
        "'speaker_3': 'Yeah. Most of my comments would mirror what I said earlier, so I will adopt everything my three colleagues have said before me and just say that I don't think that, you know, I appreciate how fast this has come.'",
        "'speaker_3': 'The reopening is happening now. And so, you know, let's get as much of it done as fast as possible and not spend too much time trying to iterate our way into this with the with the obvious caveat that I'm not saying do it tomorrow, but let's let's not be cautious, let's go big and be glad we did'",
        "'speaker_3': 'it and supported our businesses when they needed it at the immediate open.'",
        "'speaker_1': 'Have and so thank you thank you to staff. Good job in a short period of time. Thanks to all my colleagues for their comments and the public for all the emails you've sent us. I'm really enthusiastic about what was presented in the staff report and I endorse it all.'",
        "'speaker_1': 'I, I would be hesitant about closing Park and Webster completely on Friday and Saturday nights, simply because those are both bus routes. And I want to be mindful and respectful of people who do need to rely on public transportation and maybe getting to and from their jobs, even in the evenings and even on weekend evenings.'",
        "'speaker_1': 'And we all know what a hard hit public transit has taken lately. I don't think these are mutually exclusive concepts. I think that we will work with our transit partners and see what can be done. But, you know, yes, they do do a, um, a rerouting on when we have the street fairs in the summer, but that's'",
        "'speaker_1': 'usually for just two days during a set period of time. But when I was listening to, I think it was Councilmember Vella talking about closing off streets for outdoor dining, maybe for July and August. I was thinking there is a restaurant month which oh, that's probably at the wrong time of the year, but we could declare a'",
        "'speaker_1': 'restaurant month whenever we wanted to. I think it's traditionally done after the holidays, which is kind of a slow period and to just get people out to restaurants. But, you know, this might be a way to highlight Alameda restaurants and come, you know, dine outdoors at your your favorite restaurant.'",
        "'speaker_1': 'And I think there's lots of potential. And I know our business districts associations are listening. So I would say that we, we move this forward as that, uh, uh, we've move this forward to, to become a permanent, permanent feature.'",
        "'speaker_1': 'I, I'm really excited about the, um, the features that Mr. Wickstrom presented to us. And I really like the fact that the traffic data and I think there might have even been some webcam footage that showed we don't need all those traffic lanes on Park Street.'",
        "'speaker_1': 'And when you've got wide open lanes, people are driving faster, which is kind of happening now in parts of the city. So, um, who wants to make a motion? Councilmember. Vice mayor? Not quite.'",
        "'speaker_3': 'Sorry. I didn't think I would have to be the one making the motion here.'",
        "'speaker_1': 'I get it.'",
        "'speaker_3': 'No, I didn't, actually. Yes.'",
        "'speaker_1': 'I did.'",
        "'speaker_3': 'I paused, but nobody else raised their hand. I would be happy to to move approval of endorsing the plan with direction to staff, to look for opportunities for closing streets, whether they be Park or Webster, in order to support our our business districts.'",
        "'speaker_1': 'I have a motion. I have a second. Any council comment session? All right, Mr. Councilmember Odie.'",
        "'speaker_4': 'Just quickly, I mean, I understand that concerns about busses and everything and, you know, that's why I was proposing just an evening closing and then there'll still be cross streets. You know, my concern about, you know, you're still have three lanes.'",
        "'speaker_4': 'There are four lanes on Park in Webster. And I don't know if that just those extra park parking spot areas is really enough for people to social distance and enough for all of our restaurants have space to have the table that they need to recover.'",
        "'speaker_4': 'And, you know, and then if the areas are smaller, you know, then you get into issues of lottery and who, you know, the park in front of me is closed. So, I mean, am I allowed to go down the street or, you know, just because it's the park in front of me is open, am I prohibited?'",
        "'speaker_4': 'So, you know, all that things need to be taken care of. But, you know, I see this work in Canada, Montreal and Quebec because they're copying Vilnius. I think in I've never been there, but Berkeley is copying that.'",
        "'speaker_4': 'So again, our neighbors are going to be doing this and they're going to be taking away our dollars that could be going into our merchants pockets. So.'",
        "'speaker_3': 'So the motion allows staff to explore, I guess. Get that. Okay.'",
        "'speaker_1': 'Any further comments seeing then maybe we have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de i, i, i.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'I may or as the Ashcraft. I. That carries by five eyes.'",
        "'speaker_1': 'Nice. Thanks, everybody. Okay with that, we are adjourning the special city council meeting and we are moving to. Oh, Madam Clair, this iPad is going to be the under. I'm back. Okay.'",
        "'speaker_2': 'Already addressed the gender changes and the proclamations are information only. So I think we can just go straight to all communications unless there's anything else.'",
        "'speaker_1': 'I think that's brilliant. Let's do that.'",
        "'speaker_2': 'And we do have one speaker that has submitted a public comment, and then I will ask any attendees to raise their hand if they have a public comment on their oral communications.'",
        "'speaker_1': 'Okay. So we're I know we're an item for of the regular agenda now. Okay, let's have a oral communication.'",
        "'speaker_2': 'Okay. There are no one's raising their hands. So I will read the one comment that we have from Robert Pon Alameda. They are ASHCROFT members of the City Council of Alameda. I am requesting the City of Alameda studying House Resolution 908.'",
        "'speaker_2': 'Grace Meng, D-N.Y., can condemning all forms of anti-Asian sentiment as related to COVID 19 and consider supporting it. We support the health care professionals on the front lines battling the COVID 19 pandemic, while Asian Pacific Islanders and foreign medical graduates represent greater than 5% of the U.S. workforce.'",
        "'speaker_2': 'They are very well represented as doctors greater than 19% and nurses greater than 8%, with Filipino Pinay representing nearly 20% of our friends in California, according to a 2017 U.S. Department of HHS HRC report. Sex Race and Ethnic Diversity of U.S. Health Occupations 2010 to 2015.'"
    ],
    "Park Street Business Improvement Area Annual Assessment Report and Levy.": [
        "'speaker_2': 'Public adoption of resolution confirming the Park Street Business Improvement Area Annual Assessment Report for fiscal year 2020 and 2021 and leaving an annual assessment on the Park Street.'",
        "'speaker_1': 'Okay. So the recommendations that we have for the public hearing and adopt a resolution confirming the CPA report for fiscal year 2021 and levying an annual assessment on the CPA. Do we have any public speakers on this item?'",
        "'speaker_2': 'Oh, wait. We need to ask the attendees. Do any attendees want to raise their hand and speak on this item? Okay. None.'",
        "'speaker_1': 'Okay. We have no, um, no speakers, and so I'm closing public comment. So, um, do I have a motion? Do you want to. Okay, I have a seconds. I have. Over the counter of today's efforts, we have a motion by the vice mayor, a second by councilmember designee.'",
        "'speaker_1': 'We have a roll call vote, please.'",
        "'speaker_2': 'Councilmembers. Hi. Hi. Hi, Bella. I may or as he Ashcroft I. That carries by five eyes.'",
        "'speaker_1': 'Thank you. Okay, now we move to item six. Be mayor. I'm sorry for this one. Yeah. Yes. Councilmember De is recusing himself. Okay, let's give him a moment.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Okay. These as a room? Yeah.'"
    ],
    "Resolution on Webster Street Business Improvement Area Assessment for Fiscal Year 2020-21.": [
        "'speaker_2': '60 is public hearing to consider adoption resolution confirming the Webster Street Business Improvement Area Assessment Report for fiscal year 2020 2021 and leaving an annual assessment for the Webster Street BIA.'",
        "'speaker_1': 'No, thank you. And it's no secrets, correct?'",
        "'speaker_2': 'Correct. No speakers.'",
        "'speaker_1': 'Okay. And you called for public speakers in the meeting?'",
        "'speaker_2': 'Yes. No one's raised their hand. We're good.'",
        "'speaker_1': 'Okay. So we're close. Have a comment. This is essentially the same item, except that it refers to approval. We have sheep and I have a motion from Councilmember Vela, the second from Councilmember Ody. Any discussion saying then maybe we have a roll call vote, please.'",
        "'speaker_2': 'Vice Mayor Knox White. Hi, Councilmember Odie. Hi, Bella. All right. Mayor, as the Ashcroft.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'That carries by four eyes one absent and will run and get Councilmember de SAG back.'",
        "'speaker_1': 'Please. Okay.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'And as for bringing back Councilmember De. So let's tip item six. See, please.'"
    ],
    "Selection of Developer and Negotiation Agreement for West Midway Project at Alameda Point.": [
        "'speaker_2': 'Recommendation to select the Brookfield Properties Cattell team to develop the West Midway Project at Alamein, appoint an authorized city manager to negotiate an exclusive negotiation agreement with the team, consistent with the form in the DNA included in the request for qualifications.'",
        "'speaker_1': 'All right. And who is.'",
        "'speaker_0': 'The retail giant? Michelle Giles is going to do a brief staff report.'",
        "'speaker_1': 'All right. Hi there, Michelle. Hello. When you're ready. She's muted and she's muted. Ms.. Ms.. Giles.'",
        "'speaker_0': 'I don't see my who you are.'",
        "'speaker_1': 'I don't see you on camera.'",
        "'speaker_0': 'Yeah. I don't either. I can't. It's hard to admit when I don't see myself.'",
        "'speaker_1': 'Are you on a laptop or an iPad? A laptop should be down in the lower left corner. But you know what?'",
        "'speaker_3': 'I can hear.'",
        "'speaker_0': 'You. Just hear me. Okay.'",
        "'speaker_1': 'Here you are. There you are.'",
        "'speaker_0': 'Hi. Hi. Okay. So quick. I'm right there. The city council directed staff to do a three week request for qualification for the development of West Midway. And that and that was for the three development teams that had responded previously.'",
        "'speaker_0': 'And we're still interested in being involved in the development. On March 9th, SAP issued an updated RFQ, and on March 30th, staff received two developer statements of qualifications, one from a partnership.'",
        "'speaker_4': 'At Personal Properties in September.'",
        "'speaker_0': 'And another five for equity investment. A city selection panel review to the two. As of Tuesday, April 9th, we did an interview with each developer on.'",
        "'speaker_4': 'WebEx.'",
        "'speaker_0': 'And tonight recommending the team of Brookfield to tell us about the development process. By the way, project and for the following reasons they were selected. First, they demonstrated that they spent a significant amount of time evaluating and planning the land uses and basing concepts that would meet both the goals of the Reshape and the West Midway Project'",
        "'speaker_0': '. And they engaged a significant amount of time with the collaborating partners in discussions. They also demonstrated a well informed grasp of challenges and issues that were.'",
        "'speaker_4': 'That could they.'",
        "'speaker_0': 'Could face and possibly came up with mitigations that were that could possibly.'",
        "'speaker_4': 'Address them. And three, the.'",
        "'speaker_0': 'Focus of the team showed significant dedication to moving the.'",
        "'speaker_4': 'Project forward.'",
        "'speaker_0': 'By committing to use each internal equity to.'",
        "'speaker_4': 'Fund the backbone infrastructure.'",
        "'speaker_0': 'So with that, staff recommends that the City Council select the Capello team to develop the rest of the.'",
        "'speaker_4': 'Project and direct the.'",
        "'speaker_0': 'City manager.'",
        "'speaker_4': 'To negotiate.'",
        "'speaker_0': 'An exclusive negotiation agreement with the development team. I'm happy to answer the questions. And we also, I think, still have representatives.'",
        "'speaker_4': 'From.'",
        "'speaker_0': 'Brookfield. We do what.'",
        "'speaker_1': 'We do.'",
        "'speaker_0': 'Available to.'",
        "'speaker_1': 'Do. Thank you, Miss Giles. Nicely done. I see the three gentlemen before us. Mr. McCoy. Mr. Roskam in. Mr. Rhoden, I would give you like a minute. I mean, I'd love to give you even longer, but I bet you'd like a vote on this tonight.'",
        "'speaker_1': 'And your chances of getting that are greatly increased by the brevity of your comments. Who wants to go first? Don't wait too long to tell me. Mr. McCoy, is that you? You've been muted.'",
        "'speaker_4': 'Yeah, I'm glad. I would just like to say thank.'",
        "'speaker_3': 'You very much for getting us.'",
        "'speaker_4': 'To this point and then pass over to Josh and Sean. And just one more thing. You know, our team is very.'",
        "'speaker_3': 'Excited about this project. We have put a lot of work into the RFQ and.'",
        "'speaker_4': 'It's just an.'",
        "'speaker_3': 'And you guys want it done and we want to get it done for the city. So if Josh.'",
        "'speaker_4': 'Or Sean wants anything, yes, I would. This is Josh Rodin.'",
        "'speaker_1': 'Mr. Rodin. Hi.'",
        "'speaker_4': 'Yes, I'd second that. And Mr..'",
        "'speaker_1': 'Brookfield.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'As you all know, we've been at the podium a number of times and we're very pleased to be recommended and look forward to the opportunity with working with the Reshape team and the city. And we have two very good team members here and more than that with all of our other partners and consultants involved.'",
        "'speaker_4': 'So I think we've got an A-plus team to be able to move forward.'",
        "'speaker_1': 'Thank you, Mr. Roskam. And how about you?'",
        "'speaker_4': 'Well, I would just like to to reiterate those previous comments that we were very excited to be here were and we've always loved this project. We've always loved 2.2. We've really enjoyed a 20 plus year working relationship with the city of Alameda and looking forward to the opportunity here.'",
        "'speaker_4': 'We think it's very exciting. So thank you for your consideration and perhaps recommendations for answering questions.'",
        "'speaker_1': 'Thank you. Stand by. In case counsel has any questions. Counsel would like to lead this discussion. Councilman Brody.'",
        "'speaker_4': 'Do we have public speakers?'",
        "'speaker_1': 'Oh, good question. Thank you. Do we have public speakers?'",
        "'speaker_2': 'We have one written public comment. And if any one who's an attendee would raise their hand now, we could know. No one has raised their hand. Okay, we can. I'll wait.'",
        "'speaker_4': 'Can I do that?'",
        "'speaker_0': 'Then let's set.'",
        "'speaker_1': 'Duet Council member.'",
        "'speaker_4': 'Eddie, you should lead the discussion, but I'll do it.'",
        "'speaker_1': 'Yes, yes. Hold. Hold that file. Yes. That's why I took her speed reading.'",
        "'speaker_2': 'He Gold Ware Pot Lorry from Mid-Penn Housing Corp. Madam Mayor, members of the City Council on behalf of Housing, I would like to voice my strong support for staff's recommendation and the selection of the Brookfield Properties Catalyst Development Team.'",
        "'speaker_2': 'Staff provided Mid-Penn meeting, building features and Operation Dignity with the opportunity to review the proposals. Although Alameda Point Collaborative recused itself from reviewing the proposals due to conflict of interest, the remaining collaborating partners provided feedback and ensured that the selected team has the capacity to complete the needed infrastructure work.'",
        "'speaker_2': 'We were impressed by the thoughtfulness of the Brookfield Cattell proposal and we look forward to working with them to revise our vision of rebuilding the existing supportive housing and creating a vibrant new community. Alameda Point Thank you for taking this important action that is the critical next step to move, reshape forward as quickly as possible.'",
        "'speaker_2': 'The only the.'",
        "'speaker_1': 'You are. All right. Now, we have no further public comment with that. I'm closing to have a comment. And Miss Councilmember Odie, back to you.'",
        "'speaker_4': 'Thank you, Madam Mayor. I'll be really brings. But I don't want the public to know that even though we may not talk a lot about this, we've all given a lot of thought to this. I mean, we had four developers come as finalists that staff could not recommend a while back, and I couldn't even pick between them'",
        "'speaker_4': '. And we had a subcommittee and, you know, the two people that we did want to move forward fell through. But two of the other finalists, you know, are the two that are still here today. So they've gone through this not once, but twice.'",
        "'speaker_4': 'So I appreciate that they hung in with us. And I'm glad that we not.'",
        "'speaker_0': 'Only.'",
        "'speaker_4': 'Didn't have to choose between them, but now that we're going to get the best of both worlds and that they're going to be joining forces. And between their equity and their experience and their know how. I think we're going to have a really great project and I'm proud to move.'",
        "'speaker_4': 'A recommendation of the staff report selecting Brookfield Properties Catalyst team developed the West mid-May project at Alameda Point, an authorized city manager negotiating DNA with the team consistent with the form of the included in the request for qualifications.'",
        "'speaker_1': 'Let's have a second and then some discussions, then seconded by Councilmember Ortiz, seconded by Councilmember Vela. Councilmember de. So give your hand that.'",
        "'speaker_4': 'It's just a quick comment. I just want to say through the RFQ process, I appreciated how certain concepts that Councilmember Odie and myself had raised were included in that. Councilmember O'Day, for example, raised the notion of that the developer will build in financial and market flexibility into the project, and that's in the RFQ.'",
        "'speaker_4': 'And then I had raised the notion of wanting to see how the developer, what kind of plans that they have with regard to achieving social justice goals. So as we move forward and the specific plans, I look forward to seeing how those are fleshed out.'",
        "'speaker_1': 'Thank you. Thank you. Vice Mayor, anything from you? Briefly.'",
        "'speaker_3': 'I will just say that I am excited to see this moving forward to Councilmember Otis Point because of all the thought, you know, just making sure it's clear, you know, there are lots of reasons we want to see this moving forward.'",
        "'speaker_3': 'The RESHAPE program that this will support, I think is another one. Also, one of the two folks that we're moving forward has had by far the best tagline of the entire RFQ process here. So do we know your dirt?'",
        "'speaker_3': 'I have never forgotten that. And you know what? Marketing wins, I guess.'",
        "'speaker_1': 'And and for me, I am just so pleased to see this move forward. This the reshape neighborhood has been such an important, integral part of what we do so well in Alameda. We when the Navy base closed, we didn't say that we would pay money to have homeless individuals not in our backyard.'",
        "'speaker_1': 'We said, nope, we'll we'll provide housing. Now, all these years, it's been not that most ideal housing, but yet roofs overhead. And we've sheltered many families and individuals in need and we continue to do so. But I'm very I'm very pleased to to support this.'",
        "'speaker_1': 'And I think all of your comments just really capture the important work that we.'",
        "'speaker_0': 'Are.'",
        "'speaker_1': 'Moving forward with now. And as I have said, more than once, this COVID 19 crisis has only highlighted our state, the Bay Area's dire need for more housing. So let's get moving on this as quickly as possible. So we've had a motion, we've had a second move.'",
        "'speaker_1': 'We have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de SAG. Yes, not quite. I. I. I may or as the Ashcroft. I that carries by five eyes.'",
        "'speaker_1': 'Lovely.'",
        "'speaker_3': 'Thank you, Michelle and Debbie.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Thank you. Well, that is.'",
        "'speaker_1': 'Good work. And and thank you to the team. Congratulations. We very much look forward to seeing this project move forward. And thank you to the team, Ms.. Giles and Ms.. Potter. Ms.. Butler is there to our good job.'",
        "'speaker_1': 'And going through all these applications and this subcommittee to council member already counts them every day. So. Good work, everyone. We're staying up for, don't you think?'",
        "'speaker_0': 'And that sort of thing?'",
        "'speaker_1': 'Of course. Okay. We'll keep moving forward because we got a little more time. And so we move from six siege to city and city manager communications or get rid of the consent calendar.'",
        "'speaker_0': '39 889.'",
        "'speaker_4': 'I think there's a deadline on that.'",
        "'speaker_1': 'There's a deadline on. Okay. City manager, do you have communications? But you need to meet yourself.'",
        "'speaker_3': 'I don't have any critical communications for tonight. All I was going to talk about was the pandemic and just some warning or some potentially critical, I mean, advice to the residents as far as keeping social distancing and being safe.'"
    ],
    "Letter to Alameda County on Protecting Essential Workers during COVID-19.": [
        "'speaker_1': 'Okay. So then we come to a counselor referral nine if we can do it in 3 minutes. Considered dynamite.'",
        "'speaker_2': 'Best Consulting is sending a letter to Alameda County requesting assistance and protecting essential workers, especially grocery store and retail drugstore employees during the COVID 19 pandemic.'",
        "'speaker_1': 'Okay. That's serious. Councilmember Vela.'",
        "'speaker_0': 'Yes. So Council. City Council in Emeryville has already sent a letter. No masks are required for under the public. Face coverings are required. My hope is that we can actually have it so that the big box retailers will start providing it.'",
        "'speaker_0': 'They have an ease. It's easier for them to obtain some of their simple PPE, whereas the workers are busy working. And so I just hope that we can support this recommendation to the county. I know some of the Board of Supervisors will be supporting it as well.'",
        "'speaker_1': 'Okay. I mean, there are safeguards in place, but I think more can be done. And and I think this is a well-stated letter. I think the city manager might have if we'd given him a minute, here to talk about the testing facility we're working on bringing to the city soon.'",
        "'speaker_1': 'And it would provide the opportunity for essential workers, which are which include our grocery clerks and and the people at the restaurants who are doing the, you know, the takeout and delivery and meeting the public. So we're going to do our part now, limited, too.'",
        "'speaker_1': 'Okay. So, Councilmember Vallabh, would you like to add any any clarifying questions, discussion from the council? Councilmember Vela, would you like to make a motion?'",
        "'speaker_0': 'I just move that we authorize the city manager to send a letter on city letterhead with whoever whatever councilmembers want to sign on to supportive of this.'",
        "'speaker_1': 'Okay. Do you have a second?'",
        "'speaker_0': 'We've just changed the language.'",
        "'speaker_1': 'It's been moved by Councilmember Vela, seconded by Councilmember Ody. Do we have any discussion? Since then, we have had any public comment.'",
        "'speaker_2': 'No public comment on this item.'",
        "'speaker_1': 'Okay, maybe we have a roll call vote, please.'",
        "'speaker_2': 'Councilor, decide. Yeah, right. Next light.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Odie. Hi, Vella. I may or as the Ashcroft.'",
        "'speaker_1': 'I think.'",
        "'speaker_2': 'Carries by five eyes.'",
        "'speaker_1': 'Great. Okay. I'm going to leave one minute at the end because we're going to adjourn in someone's memory tonight. But we're now on to item ten. We could do council communications really quickly. Who wants to start? That's it?'",
        "'speaker_1': 'No. For you, counselor. Everybody. Anybody? Councilmember de SAC. Okay. Hearing then. So council we. I'm asking that we adjourn our meeting tonight in memory of a very recent member member of our Commission on Persons with Disabilities. His name was Anto.'"
    ]
}