{
    "Chuck Corica Golf Complex Annual Report by Greenway Golf.": [
        "'speaker_3': 'Here we go. 2014, some highlights.'",
        "'speaker_4': 'You might want to raise your might.'",
        "'speaker_3': 'Yeah. Some highlights. If you've been out to the par three, you'll notice a much different par three than what was there before, which was just a dead fat, flat piece of. You know, turf with nine flags sticking in various intervals.'",
        "'speaker_3': 'And now we have a golf course that's really, really spectacular. We imported a lot of dirt and and created some elevation and change and irrigation and drainage, brand new irrigation and drainage. And we've we have two big retention ponds on the on the on the on the myth.'",
        "'speaker_3': 'And we've already tested it. We had some heavy rains in December and the drains beautifully. On the par three i when it first opened, I thought that it would be slammed and I was mistaken. Oh, we're starting to see some some good activity out there.'",
        "'speaker_3': 'You'll see that average monthly round in 2014 was close to 1900 rounds. And that's by a, you know, nearly 900 rounds on. More per month than any month in the last any year in the last five years. And the revenue per round is up considerably and it continues that way on Sunday.'",
        "'speaker_3': 'My daughter and her boyfriend were here and I said, when you go out and play the mission called me, said, Dad, I can't get slammed. So that's good anyway.'",
        "'speaker_4': 'Does it help to know the right. Excuse me? Doesn't it help to know the right people to get on? What's your daughter? Couldn't get on.'",
        "'speaker_3': 'It? No, she couldn't get on. No. Anyway, other improvements at we did a complete renovation of the driving range and it's it's much improved and much more esthetically pleasing. You know, they had that old synthetic turf grass. It was tearing up at the edges and what have you.'",
        "'speaker_3': 'And now we've replaced it with new irrigation, drainage and, you know, natural grass. And then at the back end of the driving range, we and we imported quite a bit of dirt and created a nice, really nice grass area.'",
        "'speaker_3': 'And we have a range membership back there for people that are a little more serious about about their game and hitting balls off of of real turf. The South course project. You've been out to the golf course. You'll see that there's a lot of activity out there.'",
        "'speaker_3': 'We started to see we started in. When did we start? Last spring. Last fall? Believe in September. And it's moving rather slowly because the key to the project is the importation of the. Of the topsoil in the dirt.'",
        "'speaker_3': 'Because as you all know, this is a landfill. And in order to get proper drainage and and natural features on a golf course, we were elevating the entire site between three and and eight feet. And so we're basically going to be building a brand new golf course.'",
        "'speaker_3': 'And when I. I know a little bit about golf architecture and design, and I truly believe it's going to be one of the top. I tell people top 50 public courses in America. Certainly it's going to be a top 100 course in America.'",
        "'speaker_3': 'Public course, it's phenomenal. General course conditions. There were some we have some issues because of the drought. High salts, fairways and greens. And some people were complaining, at course, caused a turf thinning and and bare spots on the golf course.'",
        "'speaker_3': 'Then in December, we got a significant amount of rain and it flushed the salt. And I would say since then, conditions are much improved on the on the north course. One of the things that we have learned the the slews that are out there.'",
        "'speaker_3': 'Previously, they have been used as, you know, as drainage and as being filled with reclaimed water and what have you to act as a water hazard. And we we've learned and discovered from dealing with the Regional Water Quality Control Board that that is illegal, and it's really meant only for stormwater runoff.'",
        "'speaker_3': 'So we're not allowed to augment those slews in any way. And so you might have some complaints about the ponds and the slews that were they were they were dry and they were, you know, they had an odor.'",
        "'speaker_3': 'Hopefully, that's not going to be a problem anymore. We're anticipating some heavy rains as coming winter, so that will solve that problem. Um. I already mentioned the storm in 2014. 13 inches of rain and we lost a lot of trees.'",
        "'speaker_3': 'And so we were busy with that. Greenway Golf. We believe that we're in the entertainment business and we have a program called Fun Starts Now, and we try and do things that, you know, make the game fun. And so periodically on the driving range, we'll have we have music, we'll have, you know, shaved ice truck for kids'",
        "'speaker_3': '. We have skill challenge games. We we're just constantly trying to do things to, you know, to encourage people to come out and to have a good time. This is a recap of 2014. North Core 62,000. Round South course 34,000 rounds.'",
        "'speaker_3': 'That was a partial year because we were close from September through December of last year and then the Miss had 13,000 rounds. That was also a partial year because we were closed from January two to May when it opened last year.'",
        "'speaker_3': 'Total revenue was three point almost 3.4 million. I mentioned earlier the conditions on the north course were not up to par what we wanted and we had some bare spots. And what we did, we have a special machine that we imported from Australia was called an over planer and so we took some sod off of the south'",
        "'speaker_3': 'course when we closed. We took some Kikuyu sod and we basically over planted into the fairways on the north course. And it's I was out there this afternoon and it's really amazing how successful it's been on the fairways are much improved out there.'",
        "'speaker_3': 'And again the greens are much better because of the you know able to were able to flush the salts due to some some rain rainfall. Again, the course improvements, the the South course, basically, it's really going to be a brand new golf course.'",
        "'speaker_3': 'You're not going to recognize the first hole is starts with the first hole, which is going to be a combination of the old first hole and the second hole. And it's going to be a long dogleg right par five and we're going to reverse ten and 18.'",
        "'speaker_3': 'So the 10th tee in the first tee will be side by side. And and and right the old south course. You may remember, if you're coming up 18 and your politician are your second shot you could hit people on the 10th tee was kind of dangerous so we reversals holes and by doing that we're able to to'",
        "'speaker_3': 'to do some things at the 11th hole for example is going to now be about a 235 or 240 yard par three. So it's going to be a much improved golf course. Reece Jones is our architect. We're working with my partner.'",
        "'speaker_3': 'Mark Logan is an Australian and we're we're building a golf course, designing a golf course. It has an influence from Melbourne. That's the what we call the sand belt influence and design is going to play very fast and firm, big landscapes, big fairways, beautiful bunkering.'",
        "'speaker_3': 'And of course, Reece Jones is a world renowned architect. And and we're working very closely with him and he's very excited about the project. He'll be out here next month on August 13th. These are some projections for this coming year because of the construction and all that.'",
        "'speaker_3': 'You remember that we were at 3.4 million last year. In this year, going to be 2.7. We're doing a good job at controlling expenses. One of the things was actually in the San Francisco Chronicle tomorrow I think we're going to be featured, but Ron Korczak doing a big article on our company and we went, It's going to'",
        "'speaker_3': 'be on the drought. But I think he's he started interviewing us and he was really intrigued and he came out to the to the golf course with with a photographer. And to give you an example, we spent $550,000 last year on water, and this year we're going to spend about 50,000.'",
        "'speaker_3': 'So, you know, we're doing a really good job of of controlling our expenses in water consumption. We're we just released today a facilities survey. So if you're on our email list, you will have seen the survey net that this went out today and the par three in the range we we got some summer leagues we got music'",
        "'speaker_3': 'as I mentioned earlier, player development programs. We've got free golf schools for for juniors on Saturday mornings. We're doing we're doing a lot in the way of player development. One of the things we like to do when we get a little closer to opening and if all goes well, we plan on opening the South course probably in'",
        "'speaker_3': 'the fall of next year. And one of the things we want to do is, is look at the branding and, you know, refresh the whole image out there. And we will do some things to the clubhouse, to, you know, stonework and on the facade and some other things and create them a much nicer image than what currently'",
        "'speaker_3': 'exists. This is another exciting thing. I was just out today and laid it out with Mike winking. Footgolf has become very popular. It's basically you can integrate soccer, foot golf into nine holes. You're going to 18 hole soccer course in nine holes.'",
        "'speaker_3': 'And you can actually once you've you've determined how it's flowing, you can actually integrate the soccer players and the golfers in the same nine holes. It's pretty it's pretty interesting. It's very successful around the country.'",
        "'speaker_4': 'Yes. And when I read about that and saw the pictures, my only question was. And that doesn't harm the turf.'",
        "'speaker_3': 'No, no, no. They're not wearing cleats. And and you can see that the cup is in the same relative proportion, size wise to a golf ball and a golf cup. And it's really I haven't played it, so I can't speak from experience, but I know a lot of courses are are have introduced it very successfully.'",
        "'speaker_3': 'And and, you know, it's for people that, you know, quite honestly don't play golf. And up in Sacramento at Hagan Oaks, 70% of the people they come out and play foot golf at SAC and Hagan Oaks have never, ever been on a golf course before.'",
        "'speaker_3': 'Kind of interesting. So we'll reach out to local soccer clubs and and soccer coaches and what have you and try and really promote this. I mean, this year will probably be very slow, but hopefully next year we can really get it going.'",
        "'speaker_5': 'Member I actually have played that. I actually have played golf.'",
        "'speaker_3': 'Oh, you have at.'",
        "'speaker_5': 'The Hanging.'",
        "'speaker_6': 'Oaks in Sacramento and it's a.'",
        "'speaker_3': 'Blast. It's really.'",
        "'speaker_5': 'Fun. Yeah.'",
        "'speaker_3': 'It's I think it's become immensely successful at a lot of golf courses around the country. And like I said, it can it can add it, you know, incremental up to 10,000 rounds. And you charge, you know, I mean, we haven't figured out what we're going to charge yet.'",
        "'speaker_3': 'But I mean, you know, we probably commiserate to a nine hole rate. It's a good group.'",
        "'speaker_5': 'Activity with a cart and some.'",
        "'speaker_6': 'Refreshments.'",
        "'speaker_3': 'And I'm remiss for not reaching out to each of you individually to maybe see if we can, you know, meet and have a cup of coffee or lunch. I know that. Councilmember Ashcraft. We have that. You're the only one.'",
        "'speaker_3': 'I believe that we you know that I've met personally. And I look forward to meeting you all because I'm looking forward to a long and prosperous relationship with the city of Alameda.'",
        "'speaker_0': 'Thank you. Counsel comments, questions number Ashcroft.'",
        "'speaker_4': 'Well, I just want to say that a very impressive report, very impressive what you're doing. When I went out to see the new MIFF when they opened it. I mean, I couldn't believe my eyes. And so I expect nothing less spectacular than the South course and probably twice as spectacular.'",
        "'speaker_4': 'Twice as many halls. Right.'",
        "'speaker_3': 'So we continue to raise the bar and I think it's really going to pay off in the long run. And I think it's going to be fantastic. I really do. I'm really excited about it so well.'",
        "'speaker_4': 'And I commend you for all your resourceful, imaginative ideas about how to bring even more people out to the the course. Thanks for all you're doing.'",
        "'speaker_3': 'You're welcome. Any other questions or remember Daisuke?'",
        "'speaker_6': 'Just a quick comment. I just want to say thank you very much for turning around the Korea golf complex. I mean, this is clearly one of those local assets that we can leverage to bring even more persons from outside of the community to help bolster our local economy.'",
        "'speaker_6': 'So in that regard, not just a recreational tool, but I think it's a key driver in our economic development. Thank you.'",
        "'speaker_3': 'You're welcome. You're welcome.'",
        "'speaker_0': 'Okay. So I'd like to add I've been participating in the Gulf Commission meetings and Mr. Logan just attended our most recent one. So I have been able to meet him and we are making progress there. At the last Commission meeting, the Commission unanimously voted to support gyms, coffee shops, conceptual design and and it works very closely with'",
        "'speaker_0': 'what you're doing out there. Mr. Logan and Tom were there, right, speaking about it. So it really looks good and we're making progress out there. So thank you very much.'",
        "'speaker_3': 'Amy has been great in helping us kind of broker the relationship. And I think we've got a good understanding with with Tom. And I think it's he's going to make some really nice improvements that are going to be in on par with what we're doing out there.'",
        "'speaker_3': 'So this will be great.'",
        "'speaker_0': 'So thank you very much.'",
        "'speaker_3': 'You're welcome. Thank you.'",
        "'speaker_0': 'Three B.'",
        "'speaker_2': 'Alameda Museum. 2015 Annual Report.'"
    ],
    "Draft Policy for Police Body Cameras.": [
        "'speaker_0': 'We have Chief O'Leary here.'",
        "'speaker_3': 'Madam Mayor, council members. Paul Larry, chief of police. I brought up with me my escort for the evening as make sure he's the vice president of sales at Taser International. And I brought him because the last time I was before you, when we talked about the purchase of the cameras, some of you had some technical questions about'",
        "'speaker_3': 'the data security and storage. And I thought just in the event that there were any unanswered questions, it would be nice to have a representative from Taser here. You all saw the staff report that that I wrote. It was very brief and intentionally so.'",
        "'speaker_3': 'It was really just to introduce the policy, because we had discussed many of the issues with the cameras relative to the purchase of the cameras. As I mentioned in the staff report, we did do some research before drafting our policy.'",
        "'speaker_3': 'We looked at the ACP, the International Association of Chiefs of Police. They had a model policy that they put out. The Police Executive Research Forum had also set forth some recommendations that we took a look at. And then from our own area, we looked at the Fremont and the San Leandro Police Department policies, and the combination of'",
        "'speaker_3': 'all of those things led us to the draft that I put before you tonight. And I'm here to answer any questions or just any concerns you might have.'",
        "'speaker_0': 'So before we do that, can staff clarify what our role is in regards to this policy? I can try to do that. So the policy, the internal operational policies of the police department are the jurisdiction of the chief of police.'",
        "'speaker_1': 'The City Council.'",
        "'speaker_0': 'Has the ability to provide comments to the Chief of Police. He's asked.'",
        "'speaker_1': 'And solicited those.'",
        "'speaker_7': 'Comments, but it is really.'",
        "'speaker_0': 'The chief of.'",
        "'speaker_1': 'Police.'",
        "'speaker_7': 'Who has to.'",
        "'speaker_0': 'Adopt the.'",
        "'speaker_1': 'Policy. So he is here before you to get your input.'",
        "'speaker_0': 'So we will not be voting, accept or approve. We just get feedback. So I wanted to clarify that so that the public understands what our role is. Ultimately, what this policy is is up to the police department. All right, Councilor comments.'",
        "'speaker_3': 'And a mayor.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_3': 'I appreciate, chief, for Larry's answering questions, particularly on the access. The public access to is the record, the electronic record that is gathered by the body cam. And my understanding in the responses and I like the city attorney also to affirm this, is that the access to that by the public will comply with all state and federal'",
        "'speaker_3': 'laws that are in place just as it does for any other. Records request, the Alameda Police Department, is that correct? Yes.'",
        "'speaker_0': 'That is correct. Vice Mayor Matter.'",
        "'speaker_3': 'SC And it goes through the same channels as any other records requests to the police department? Yes. And then the second is more of a comment that I'd like you to consider is in the section on request for deletion for accidental recording.'",
        "'speaker_3': 'In. In certain. And certain regulations that deal with electronic records. Particularly in the Code of federal relations. At the federal level, there is a and a an assumption that you use a validated system, and that validated system does not preclude deletions.'",
        "'speaker_3': 'You can have deletions there mistakes. I mean, you can have mistakes, but they're preserved. And you do preserve the record as it's gathered and you delete it when the regular regulatory requirement says that you can dispense with with the document.'",
        "'speaker_3': 'My preference is that. Whether it's an accidental recording or not, it stays there until the document is deleted by its natural expert, its mandated expiration date by law, so that we don't get into an issue of someone accident deleting something that should not have been deleted.'",
        "'speaker_3': 'By a second mistake. Okay. You know, I just I struggle with that one a little bit. I on one level, I don't have any problem with what you're suggesting and keeping it until it hits its natural donation point.'",
        "'speaker_3': 'On the other hand, and I know this from. Talking to some other police officers and other agencies that literally sometimes is they've actually accidentally recorded a conversation that's prohibited in another section of the policy. I might have a conversation with one of you in the hallway and have my camera on.'",
        "'speaker_3': 'And if I if I accidentally record that, I would like to be able to say, you know, that was a mistake and delete it. As opposed to having that be out there for 90 days or six months or three years.'",
        "'speaker_3': 'And then I've also had officers tell me I left it and I was in the restroom, I was in the locker room changing. And I don't think we want that footage out there any longer than it needs to be.'",
        "'speaker_3': 'So that's that's kind of what I struggle with when I'm processing that. And I hope you understand. I do, yeah.'",
        "'speaker_4': 'And England, too. Just to follow up on the vice mayor's comments is I understand. The deletion. Can you remind me what section it is zero 57 for? Okay. It's for five over 7.4. Right. Okay. It's not. So the employee still doesn't get to make the decision of whether or not the accidental recording is deleted.'",
        "'speaker_4': 'That goes to this services division commander who reviews the file and either approves or denies the request. So. Is. I mean, does that not at least begin to address the. It could be accidentally deleted twice or.'",
        "'speaker_3': 'Well, to me, it's not an independent party or a disinterested party looking at it. Basically what we're looking at is two layers of review. If if if we leave the policy the way that it's written right now, the officer would request in writing that the recording be deleted and list the reason why the division commander would take'",
        "'speaker_3': 'a look at that. And if they approved it, it would go up to my second in command, a captain who would make the ultimate decision as to whether or not that that footage should be deleted. And I'm guess I'm looking at this just like I'm looking at all of the records.'",
        "'speaker_3': 'Do you ever destroy records that were mistakes? Probably not. Do you ever destroy? I guess the voice recording would probably be the nearest comparable to this. But if you made a mistake on a on a paper record or there was a mistake, an entry in a report that was written either on the computer or by hand, you'",
        "'speaker_3': 'don't destroy that original, you know? So what would happen if a mistake was made in a report and it was during the review process? The report's not final, so it's just like a draft. So a supervisor can return the report now electronically back.'",
        "'speaker_3': 'Back in the old days, when we when we handwrote them, you'd return it to the officer and say, you know, for a punctuation error or a grammar error or a factual error, you know, somebody you got a name wrong or location wrong.'",
        "'speaker_3': 'You need to you need to change that. Once the report becomes final and it's over at our shop, we call it frozen. That's it, then. Now, now you can only clean up a mistake by a supplemental report. So that can that same rule be?'",
        "'speaker_3': 'I guess you could say this applies. That's it. It won't be final until there's a review of it saying that it's this is the final record and we're going to send it to the store to to the server.'",
        "'speaker_3': 'Right. I mean, the difference is you can't modify the video. The video is what it is. A report that has an error can be corrected. The video is always whatever you've captured, you've captured. So you can't you can't really go back and modify it.'",
        "'speaker_3': 'You can't go you wouldn't want us to be able to modify the video, right? It would defeat the purpose. So either the video is allowed to exist, mistake or not, or or we go through this three layered process of getting reviews and final approval to delete a recording that two people removed from the recording agree is unnecessary'",
        "'speaker_3': '. A locker room scene, a private conversation, things of that nature. I personally as the chief, I'm comfortable with that, with the because I've got to two layers of review removed from the actual recording. And I'm you know, I'm hoping that that you're all comfortable with that, too.'",
        "'speaker_3': 'I'm willing I'm willing to take a look at it. I'm just saying that that was the thought process that we I, I understand. That's my comment.'",
        "'speaker_0': 'Amber Ashcraft, thank.'",
        "'speaker_4': 'You and thank you for the information you've provided us with Chief Hilary. And I also e-mailed you earlier with some questions. So I want to raise two items that I think I actually raised before when you came to us for the authorization to purchase this equipment.'",
        "'speaker_4': 'And the first one is on from page one of the draft policy. And it is has to do this would be Section four or 50.4 system administrator responsibilities. And the fourth responsibility listed is policy and procedure review and evaluation.'",
        "'speaker_4': 'And you will recall not too long ago, we in the last administration, we approved the purchase and use of license plate readers, but the Council also requested that the policy be reviewed and evaluated just to see, you know, first year out, what could we do better?'",
        "'speaker_4': 'And I mean, I think every year there should be a review. So what I would like to see added to the language in this section, that policy and procedure review and evaluation take place no less than once every calendar year.'",
        "'speaker_4': 'And I think it's just the sort of thing again, council doesn't vote on this, but it's the sort of thing that on an annual basis you would come back before the council and just give us an overview of, you know, what your experience has been.'",
        "'speaker_4': 'So I'd appreciate your consideration of that. And then my second concern and again, I raised this before and it's something that the ACLU, the American Civil Liberties Union in their white paper, had talked about and the Fremont Police Department policy that you provided us also, I thought articulated it very well.'",
        "'speaker_4': 'And what this is, is in situations where you could have a victim of rape or domestic abuse or some other sensitive crime who doesn't want to be recorded. And, you know, this person has already been victimized. We don't want to to further that.'",
        "'speaker_4': 'And so my my concern was, you know, do officers could they have some sort of discretion? And I'm just reading the the language. So I feel like two things. The city attorney doesn't like us using our phones at the desk, but this is really just reading.'",
        "'speaker_4': 'The Fremont policy says that officers may cease recording when encountering or interviewing a victim who is in a vulnerable position or who asked not to be video recorded. And and there's also other language in that same section of the Fremont policy and procedure for their body worn cameras that talks about sometimes you have someone who is a'",
        "'speaker_4': 'witness who's giving you information, who doesn't necessarily want to be seen on camera cooperating with the police and giving information. And if there wasn't that option to say, hey, I'll talk to you, but not if you're recording me, then you might not have that information to help you solve a crime.'",
        "'speaker_4': 'So what could you what could you tell us about that?'",
        "'speaker_3': 'So, first of all, I'm completely comfortable with adding the exact language in the Fremont policy regarding encountering or interviewing a victim who's in a vulnerable position. That's that's honestly, to me, that's an easy one. We've given the officers in in our policy a lot of discretion to record or to not record.'",
        "'speaker_3': 'And what what we were trying to avoid was to do to list so many specific incidents that it just became too much for them in that, you know, as their the sort of the dynamics of, you know, when you show up for a case and you've got people talking to you and different that they would, you know'",
        "'speaker_3': ', I'm recording you but I'm not recording you and. We put it, we thought we might put them. Make it too confusing for them. Too much for them to have to process. But but to me, this is I mean, this is an easy one.'",
        "'speaker_3': 'And I'm confident that they would see that anyway and and exercise their discretion to not record it or to maybe just do an audio recording versus a video recording, which we still have the ability to do. So, yeah, I'll tell you right now that when we go back, I'll I'll add that to the policy.'",
        "'speaker_4': 'I appreciate that. Sure.'",
        "'speaker_3': 'I'm sorry.'",
        "'speaker_4': 'What was the other one was for? For a witness who might be hesitant to. Let's see.'",
        "'speaker_3': 'Yeah, same. Same issue. We. We actually, I think, uh, and forgive me for not having the whole thing memorized yet, but we have in for 50.8 prohibited use. We have conversation. I'm sorry. Encounters with undercover officers or confidential informants.'",
        "'speaker_3': 'Not every not every witness is a confidential informant.'",
        "'speaker_4': 'That was my point. That that I thought it was just a little bit broader, that if you have I mean, I don't know that we have so much of a problem here, but in a neighboring jurisdiction, there's a big problem with getting people to cooperate with the police.'",
        "'speaker_4': 'And I don't think it's because they're all wearing body worn cameras. But we we don't want to do anything that would make someone hesitant to come for. I don't think we do it right. No, no, you do your job.'",
        "'speaker_4': 'But no.'",
        "'speaker_3': 'We absolutely don't.'",
        "'speaker_4': 'So I just you know, those were the two. And again, I thought the Fremont policy, which I know you referred to and attached for us to to look at to it, I thought it it laid it out quite succinctly in in that same section that talks about victims in vulnerable position.'",
        "'speaker_3': 'Sure. Yeah. Those are happening to me. Yeah. Those are easy ones to add.'",
        "'speaker_4': 'I appreciate your consideration. Thank you.'",
        "'speaker_3': 'Sure.'",
        "'speaker_0': 'Hey Member de sa.'",
        "'speaker_6': 'Thank you. Thank you, Chief. Hilary, thank you very much. Appreciate all the information that you shared. I think the comment I really have to make is simply that, you know, with Black Lives Matter as a backdrop, to me, it seems fitting that a middle of the road city like Alameda is adopting one of the key agenda items'",
        "'speaker_6': 'of Black Lives Matter. On having local law enforcement wear body cameras. So on behalf of our residents. We, the city council, have made a significant commitment of $425,000 in this. And I hope our community is proud of us having done so.'",
        "'speaker_5': 'Yeah. I saw someone come in. The chief are putting this policy together. I mean, I think I mentioned this when we had the discussion over the expenditure that, you know, policymakers are struggling with how to craft an effective policy, one that really respects the civil rights of our citizens, you know, but at the same time, you know'",
        "'speaker_5': ', does not interfere unduly and is overly prescriptive to officers doing their job. And I think you were able to find on that right balance. And I appreciate it.'",
        "'speaker_3': 'Thank you. Thank you. I appreciate that.'",
        "'speaker_0': 'All right. So, first of all, I also want to commend you for bringing this forward. And my recollection is that we unanimously voted for the body cameras and looked forward to you bringing back your draft policy. And and for the audience and for people that don't know, there has been, in addition to the agenda item, the staff'",
        "'speaker_0': 'submittal where it has the policies of San Leandro as well as what was the other one, Fremont. Fremont. So that members of the community, you can go back and you can look at this now and you can see what other communities are doing and then compare it with ours.'",
        "'speaker_0': 'You can always communicate with the chief with your suggestions. There will be in the future, changes to the policy. It will always. The goal is to have it be responsive to our community's needs. And I and I do want to commend you for bringing this forward, adding the additional documents to help educate our community.'",
        "'speaker_0': 'I want to follow up in regards to if there were a California request under the California Public Records Act or the video for a recording, how would that be treated?'",
        "'speaker_3': 'Um, I would. My general my general not exclusive, but general thought is going to be that I'm going to deny those requests as exempt under disclosure because they're investigative records. And as I mentioned to all of you in the email that I sent you, I attached a recent opinion from May of this year from the California Second'",
        "'speaker_3': 'Circuit Court of Appeals. It was a lawsuit that had to do with license plate reader records, not body camera. But the issues are the same. And the court in that case found that that those records were all investigative in nature and therefore exempt from disclosure under the act.'",
        "'speaker_3': 'And that's that's where my position comes from and that's where it's going to stay until that changes. Having said that, I acknowledge in the end, my policy does allow for me to release videos to the media of my discretion if I feel that, you know, it's worthy to do so, where the where the information would be more'",
        "'speaker_3': 'beneficial for the public to know than to keep to myself. And so I. I don't intend to always say no. But what I what I want to protect the public from is this sort of voyeuristic element that enters into this, where someone sees the police enter their neighbor's home for God knows what kind of a call.'",
        "'speaker_3': 'And then they think, Well, I would like to see what happened inside that house. So I'm going to make a Public Records Act request because we're paying for those cameras and those police officers. And I have a right to see what happened in their home.'",
        "'speaker_3': 'I'm going to respectfully disagree and say that that's a that's a police investigation and it's not for you. On the other hand, if there's an incident, God forbid, where somebody you know, where. We're looking at a potential civil unrest because of an incident that happened.'",
        "'speaker_3': 'And the release of that video, as we saw in Boston recently, quells that concern. Then I'll be the first person at the front steps of the police department giving out that video to the media.'",
        "'speaker_0': 'So thank you. And I think it's important to acknowledge I have found every time I ask you a question that you come back with a reasonable explanation. And I would encourage anyone from the community that has questions to feel free to ask Chief O'Leary for for his reasoning in creating this policy.'",
        "'speaker_0': 'And then I wanted to add also on page 28 of the additional documents that were attached is where you'll find that case, the ACLU case is attached or the community as part of this agenda item to review so everyone can review that themselves.'",
        "'speaker_0': 'So thank you for providing that. Also, if you could explain activation when when the cameras would be activated that that part of the policy.'",
        "'speaker_3': 'Okay. So one of the things that we did not want to do when we wrote the policy was put the officers in a position where basically if they forgot or because of the circumstances didn't activate the camera, that they were now going to be subject to some sort of discipline because they didn't hit the button as they'",
        "'speaker_3': 'got into a middle of a fight or or worse. What we've done is we've told them. That there are many incidents and we identify them in the policy where they should or where we want them to. But we're not making it mandatory.'",
        "'speaker_3': 'And again, I want to give them discretion to turn these things on. Some some incidents can start out very, very calm, not confrontational and not anything that an officer would think worthy of recording and then on a dime can can turn into something that does need to be recorded.'",
        "'speaker_3': 'So in saying that, I'll remind you that the cameras that we're buying have a 32nd buffer so that it can't the camera's constantly recording whether the officer turns it on or not. But it can go back 30 seconds.'",
        "'speaker_3': 'So if the officer suddenly is in a situation where they say, Oh, I need to record this, they can hit the button and it goes back 30 seconds. And I think that's going to alleviate a lot of that a lot of the problems that we would have if we didn't have that feature in the camera.'",
        "'speaker_3': 'And that was one of the reasons why we went with the Taser camera was because of that feature. You know, and I want to just throw this out here since we're talking about it. And and for the public, there's going to be a time period here when when we when I distribute these cameras to the officers, we'",
        "'speaker_3': 'have them. They're sitting in boxes over at the police department. But I promise you, I wouldn't put them out until we had this discussion. These are these are new pieces of equipment for them. And I don't have my full belt on, but we're talking about ammunition, handguns, pepper spray, handcuffs, radio flashlight.'",
        "'speaker_3': 'There's a lot of stuff on the belt. It's going to take them some time. They're going to have to go through some training. It's going to take them some time to get used to the fact, just like you can remember, when we all had to remember to put our seatbelts on.'",
        "'speaker_3': 'It takes a little while. Once it was required to remember. Get in the car. Open the door. Put your seatbelt on. Right. This is going to happen with police officers. We've seen this in other jurisdictions. They're going to especially in the beginning, it's not going to come to them second nature.'",
        "'speaker_3': 'It's going to take some time to develop the muscle memory of I've got to record this. We also know this because we've had audio recorders for nine years, and when we first got them, we found that people were missing things.'",
        "'speaker_3': 'Now. They record them all the time, but it's on a different location on their belt. So I just would ask for a little patience and understanding from the public and from all of you that, you know, there could be some times early on where doesn't it doesn't go on because they're just frankly not used to having them'",
        "'speaker_0': '. Any other questions? Comments. Thank you very much.'",
        "'speaker_3': 'Thank you. Should it?'",
        "'speaker_2': 'Six be received a report from the Public Utilities Board on Alameda Municipal Power's five year Strategic Plan, Capital Improvements and Financial Status.'",
        "'speaker_1': 'Or. I pushed her.'",
        "'speaker_7': 'Good evening. I'm Madeleine Dean, and I'm a commissioner on the Public Utility Board and also currently serving as president. And what we'd like to do is really bring you up to date on some of the things going on with the public utility board, some of our projections for the future.'",
        "'speaker_7': 'Starting with some current issues. A big one for us is distributed generation and this is something a few of you have already asked us questions about rooftop solar, how we're handling it, what's going on with it. So we thought we'd give you just a little bit of update of where we're heading in the future.'",
        "'speaker_7': 'We still don't have direct answers on some of these, but we have some main issues. One is rooftop solar, and that's something that right now we have rebates on. We also have a NIMH program where people are get in net energy metering funds.'",
        "'speaker_7': 'And as we look at that, the mandated portion of it is going to expire soon, not before the end of the year probably, but we need to have a policy in place going forward. We also are looking at the fact that we may need to treat residential customers different than we do commercial customers in that area and'",
        "'speaker_7': 'also our municipal customers. So that's another thing that we have to develop policy around and it's going to take some time and some working with the community. We've already started some of those conversations, but it's going to be ongoing for a while.'",
        "'speaker_7': 'Community Solar is something we're interested in. As all of you know, we have rec funds that we receive for selling off some of our renewable credits and also selling off for a period of time some of our renewable energy, those funds we can use in different ways, but it needs to be really applied to energy efficiency or'",
        "'speaker_7': 'renewable power in some way. One of the things we're looking at is the potential of community solar, whether it be a standalone project, a partnership with a business, one of the developers, a partnership with the schools, whatever that might be in the future, we don't know yet.'",
        "'speaker_7': 'We're still looking into what other communities are doing with it, what are the potentials, what are some of the pitfalls and hazards of doing it and trying to figure out where we want to go with that? The net energy meter in the NEM, as I mentioned, that's something that is a true of at the end of a'"
    ],
    "Report on AMP's Strategic Plan, Capital Improvements and Financial Status.": [
        "'speaker_7': 'cycle or end of the year where money is refunded to customers. The feed in tariff is a method that's been used in a number of areas and this is one that as the energy is fed into the grid, if you want to think big term as as it's fed in from a customer who has an excess, that's'",
        "'speaker_7': 'where it is kind of justified. And there is credit given and funds applied to it. And as we look at all of these, there is different things that we need to think about. One is in the future, we're not going to have the luxury that we have right now of having rec dollars.'",
        "'speaker_7': 'So we have to come up with a plan that is going to return the funds to us that we need in order to maintain all our lines, everything not just provide sort of a backup when somebody has solar energy and it's a foggy day and we need to provide that energy, somebody still has to cover the equipment'",
        "'speaker_7': 'and everything else. So these are things we're thinking about.'",
        "'speaker_4': 'Yes, Mr.. I if I could just ask you two. I did go to that wonderful town hall that the amp put on a few weeks ago, but could you just for those who might not have been there, tell us what the rec is referring to, the renewable energy credits.'",
        "'speaker_7': 'Okay. One of the things I think we're very proud of is we've always been a very green, very renewable, energy focused organization. And as we started with the state mandates around renewable energy and the 33% that we need to get to by 2020, we were way ahead in terms of the environmental mandates, both on our renewables and'",
        "'speaker_7': 'overall. We have some large hydro, which California doesn't recognize, but it also reduces carbon. So when we look at that, we were able to take. Under the cap and trade regulations. There were so many recs that were allotted to us and we were able to use some of those and sell them to others for use for them'",
        "'speaker_7': 'to come up to their incremental allotments that they had to come up to. So we took advantage of the fact that previous boards were very smart. We had nearly 80% renewable. Of that, we were close to 60% and which was California eligible.'",
        "'speaker_7': 'So our board determined that we would not go under 40%, that we would. In some way create a commodity out of what we had in the. Space in between. And so we were able to sell that to others.'",
        "'speaker_7': 'One was water district bought from us so that they could be compliant. Palo Alto wanted to be 100% green, so they brought bought from us, you know, for a short period of time until they have other resources. So those are the kinds of things that, you know, when we talk about recs and renewables, the dollars that came'",
        "'speaker_7': 'in from those sales are restricted funds and they're restricted to be used for energy efficiency or for other renewable sources. The board created policy to restrict them to that. So we made a commitment to the community when we said we were going to do it.'",
        "'speaker_7': 'The policy is in place. So right now we have money to do things. Our other part of the policy is we will not spend it till we actually have it. So even though they're so the money doesn't come in because it's a multi-year.'",
        "'speaker_7': 'Process that we've sold them for a two year period. And so the money doesn't come in all at the beginning, so we're not allocating it until we actually have it. Does that help?'",
        "'speaker_4': 'Very much so. Thank you for that. Excellent. Okay. Thank you. She's very knowledgeable, as you can tell.'",
        "'speaker_0': 'A member, Odie.'",
        "'speaker_5': 'Thank you, Ben. Just a quick question. Talking to continue the discussion about the recs, I think you made a comment that, you know that we're going to lose some of that funding. Can you kind of explain, you know, why that's going to come about?'",
        "'speaker_7': 'Okay. As the money comes in, it comes in over a period of time. And so we will not allocate it till we actually have it. And once we allocate it, there's a period before it's actually spent. So we do have money accumulating now.'",
        "'speaker_7': 'So some of the things that we have allocated it to and spent it on are some of the streetlight projects that's taken a big chunk of it. We've also put in the EV Chargers at AMP. We have two that are being put in now that will have the higher level of charging.'",
        "'speaker_7': 'Those we will charge a fee for. But the whole infrastructure, putting them in a manner that funds some of the electric cars we've purchased for amps use so that we're converting some of our fleet to electric so that we can add to the energy efficiency and.'",
        "'speaker_7': 'Me. Is there something I missed? Oh. Part of our Army project moving to our army, our interactive meters. Part of that project has been the pilot part has been funded out of that money, I think. Okay.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Thank you for asking the questions. I think it's important for us to make sure that you know what we're doing with the money.'",
        "'speaker_5': 'And the community gets to hear it as well.'",
        "'speaker_7': 'The other thing we're looking at is how we can accommodate some of the L.A., the unified school districts projects in terms. We've supported them in terms of energy efficiency, doing audits, encouraging light replacement, some of those kinds of things.'",
        "'speaker_7': 'But we're also looking at are there other ways we can help them with community solar or something else? Is there some way we can partner? So that that is something that's still on the table. Other current issues. The next underground utility district reconstruction area needs to be identified.'",
        "'speaker_7': 'And as you know, that's come to you with the process of how we're doing that. In December, we expect to have a report back and some recommendations that would be ready to start playing into process next year. But even though it starts in the beginning of the year, that process has a lot of community interaction, a lot'",
        "'speaker_7': 'of touch with the community, so it doesn't get shovel ready for quite a few months into the year. So there will be a lot on that next year. Moving forward to city related expenses and transfers of money. This is something that I wanted to put together on one sheet, and I think it's important that we consistently remind'",
        "'speaker_7': 'not just you, but everybody in the community that as an enterprise department, we constantly return to the city. And as you will notice here, it's a pretty sizable chunk that our general fund transfer is 2.8 million. Our pilot for 2016 is estimated to be 1.5.'",
        "'speaker_7': 'The city cost allocation is what is allocated to us for each our services accounting, you know, all of those types of backroom processes that have to go on in any business.'",
        "'speaker_5': 'Legal.'",
        "'speaker_7': 'Legal is actually a city direct cost. So you have a line all to your own.'",
        "'speaker_4': 'You're not back room.'",
        "'speaker_7': 'We're in a back room. You've got a line all by yourself there. So that's about 136,000 rent and warehouse space is 189.8. And then we have one that has been new this last year and moving into this year.'",
        "'speaker_7': 'And that's when we took over the streetlights and not only providing the energy to them, but the maintenance of them. So you can see for 2015, we were at 380,000 and we're bumping up to 450. That's as are replacing more as we're doing more work on and we're maintaining a larger fleet of lights, if you want to'",
        "'speaker_7': 'call it that. So that number is bumped up a little bit and then garage fees and sewer is 96,900. So in transfers and the costs that we pay to the city, that's almost $6 million. And if you think about that in terms of percent of your general fund, that's probably getting close to 9% right in that area'",
        "'speaker_7': '. So it's a good chunk of it. The other way to look at this and I think this is important for the community is that on top of that, when we look at the. Addition of dollars that we put into the community's pockets by having rates that are 15 to 20% lower than PGE and EAS or other utilities'",
        "'speaker_7': '. We are putting that money back into the local economy and also we're putting in sponsorship money for a lot of schools to activities, parades, festivals, whatever. So if you look at it all together, we've calculated that it's about $10 million.'",
        "'speaker_7': 'It's going back into the local economy. So that's a sizable chunk. Yes.'",
        "'speaker_4': 'And when you mentioned the the rates that are 10 to 15% lower than other jurisdictions, I think that's also helped us in selling Alameda to new businesses to to locate here. So it's it comes back to the city in many different ways.'",
        "'speaker_7': 'That's a good point to make. It can be used as a developmental tool for new business. Any other questions on that one? One other thing, just to note that in addition to this, in fiscal year 2016, we're repaying the $2.2 million loan that we had received earlier on.'",
        "'speaker_7': 'And so that is being repaid. So you'll notice that that that will also be included. Now the cost of doing business because our businesses energy, most of our costs are energy. And one of the things for us that's always a challenge is predicting what our energy is going to be.'",
        "'speaker_7': 'And when you look out, as you can see, our perform goes out to 2034 here, trying to calculate where we will be and using a lot of different statistics and things. The red line going across the top shows our load, how much energy we need and how it's going.'",
        "'speaker_7': 'We're expecting it to grow over the next 1518 years. If you look at that little gridded area up in the corner, just to point out, that's the only area that isn't covered right now by the contracts that we have.'",
        "'speaker_7': 'Very energy. So that's the area that we buy essentially with term purchases, short term purchases starting at the very bottom. I'm going to work you up from the bottom of this chart at the very bottom, the black line that.'",
        "'speaker_7': 'Actually is the bottom of the graph is the combined turbines number one into. Those are the two that are out in that area. That's kind of between cardinal point in the back of Rosenbloom. There's two of them out there.'",
        "'speaker_7': 'They belong to in CPA, the Northern California Power Agency, which we are a member of. So we co-own them with the other members of the group. Those are only used a few times a year. They're mainly if the power peaks very high and they need to turn them on for a short time.'",
        "'speaker_7': 'Other than that, they're turned on to make sure they continue to work. But because they use natural gas, they are not running. All the time. They're not considered renewables. These are just essentially for those peaks when additional power is needed to be fed into the grid.'",
        "'speaker_7': 'And another little side note, the Northern California Power Agency is the one who schedules our power. So on a essentially minute to minute basis, they schedule what our needs are and work with our local dispatchers to keep that in sync so that we don't have brownouts or lose power completely or have too much power going into the'",
        "'speaker_7': 'system. Right above that. The blue area is from Calaveras Hydro. So that large amount is hydro and you see that pretty flat all the way across. That's a pretty consistent resource for us. So we don't have to worry about it going up and down and fading out.'",
        "'speaker_7': 'We do have a little bit of a drop off in drought years, but not a lot. You know, even our worst case scenarios when, you know, we plan three scenarios, we plan best case, worst case and a medium one.'",
        "'speaker_7': 'Middle of the road. And now, right now, we're looking between the middle of the road and the drought scenario. And that's what we're working on. And so that's staying pretty constant. We also have Western, which is hydro. And above that there is a small area of it's great ego.'",
        "'speaker_7': 'I drew. And then we have the geothermal. Then we have landfill gases. And we have wind at the very top. If you notice, the wind in the landfill are dropping off. I think if I do that. Yeah. Okay.'",
        "'speaker_7': 'Now, the reason for that is, is that particularly in the landfill, the gases in any set landfill only lasts so long. There's no way of really at this point beefing up. Now, who knows what the future is going to bring?'",
        "'speaker_7': 'So what it means is creating another landfill situation. And so that's something that we look for, is where else can we buy into another contract on the landfill? The wind is the turbines, the windmills, basically. There's a lot of older equipment out there and that has a certain life to it and it fades off.'",
        "'speaker_7': 'So as you can see, there's purchases that we have to make in the future that were covered for quite a period of time with pretty stable resources, and we use other contracts in between and all the time we're looking for other renewables that we can purchase or other opportunities, and particularly with the Northern California Power Agency, those'",
        "'speaker_7': 'come up on a pretty regular basis where we can partner on different things. And one of the things like the geothermal was tapering off, but now they've pumped more recycled water into it. And so you can keep it going longer.'",
        "'speaker_7': 'Any questions on that? So a lot of information.'",
        "'speaker_6': 'So when I look at this chart, is this telling me that the white area is basically a gap between what our what our estimated or projected demand for load a demand for energy relative to the. Sources of energy that's available.'",
        "'speaker_6': 'So.'",
        "'speaker_7': 'Right. Usually our contracts run out or depending upon what it is, a lot of our contracts are ten year contracts. Some go out further. So what it's showing you is that within the next four years, we have to purchase similar, more long term contracts.'",
        "'speaker_6': 'Mm hmm.'",
        "'speaker_7': 'To fill that in. And so it's kind of a rolling process. We have a department that's constantly looking at that. They're looking to see what there is available on the market and then in CPA is helping us to be aware of what our opportunities for projects.'",
        "'speaker_7': 'So that's one of the things that we get into with funding issues when we have to get involved in a project and we either have to be involved in part of a bond issue or come up with funds if we have them.'",
        "'speaker_7': 'So those are things. Knowing that probably getting out past, you know, 20, 20 and beyond, we're going to be involved in some more big projects at some point.'",
        "'speaker_6': 'Okay. So I guess the key thing then is that this is. Point in time picture of our projected demand relative to our already in place sources of energy. Correct. So that while there is significant white gaps, white areas in the far right side.'",
        "'speaker_6': 'That's not to say that the far white area will continue to be as white as that, because in the coming years we will. Look for different sources of of energy, particularly to replace the the landfill gas and the wind.'",
        "'speaker_6': 'Okay.'",
        "'speaker_7': 'Right. If you want to think about it's a rolling pitch here that everything keeps moving across and as it moves across, that gap moves along with it. So we'll always have a small gap and a bigger one at the end as you go further and further out.'",
        "'speaker_0': 'And can you clarify again the top left of the chart, the red grid? What does that.'",
        "'speaker_7': 'That red grid is is essentially energy that we've purchased off the market.'",
        "'speaker_0': 'All right. So it's.'",
        "'speaker_7': 'Market price. So it's term purchases are very short purchases.'",
        "'speaker_0': 'Okay. So that's something I think that could be included as part of the key in the future. So when you're looking at this. That's Erica nose at the bottom.'",
        "'speaker_1': 'No, she said, just.'",
        "'speaker_7': 'To have it as a caption. If we use.'",
        "'speaker_0': 'This, you know, at the bottom.'",
        "'speaker_7': 'Legend and legend on the bottom.'",
        "'speaker_6': 'In other words.'",
        "'speaker_4': 'Be sure to speak into the microphone so we can capture what you're saying.'",
        "'speaker_6': 'I'll fill in real quickly, because I'm sure that big white gap is creating some problems. I can see that we we do what we call an integrated resource plan, which we're about to introduce to the to the board, probably in October of this year.'",
        "'speaker_6': 'And what that does is that projects out how to fill that that white gap. And we already know at this point pretty much what we have to do. And we're already in negotiations with with others that will supply mostly renewables, because keep in mind, we want to continue to add renewables.'",
        "'speaker_6': 'That little hatch market that you're asking about, yeah, that's market stuff. And we always go into the market a little bit because you're never quite sure where that load line is really going to be. So you don't want to over purchase, so you want to be able to buy on the market to kind of bounce you off'",
        "'speaker_0': '. But in the future.'",
        "'speaker_1': 'And when we buy and so.'",
        "'speaker_0': 'Stiger and I don't think he understood what my comment was. I want to clarify real quick on the legend at the bottom of this chart. You don't have a description for that, so we don't added in the future.'",
        "'speaker_0': 'Yes. Appreciate it. Thank you. All right. Now in regards to The Gap.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'There has been quite a bit of interest, if you will, in adding solar to homes here and here in our town. And also, for instance, when they're built to add solar, could that not fill some of this gap?'",
        "'speaker_0': 'I mean, why can we not look at solar generated here in our town?'",
        "'speaker_7': 'We can we can look at solar generated here in our town. What we can't rely on is that distributed generation on rooftops is going to be adequately maintained at a particular volume. You know, we're a particular amount of energy.'",
        "'speaker_7': 'People's energy use goes up and down their rooftop production alters with the climate changes. So cloudy, stormy weather does not produce solar energy in the evenings and nights when it's dark. We don't have solar energy production until we get to a point where we have reasonable storage for that energy, which right now it's not cost effective for'",
        "'speaker_7': 'us. We can't use it to fill that gap per say. What it contributes to filling some of is the little tiny bit of grid area that we'll always have. It may fill some of that at some times. Our major problem is that with solar, the production is mainly peaking midday and late afternoon.'",
        "'speaker_7': 'I mean, in Alameda, our production is those hours are high usage. There is some high usage mid-day but not like other areas because we don't have the industrial use that other cities in the area have. So we don't have a really high load midday.'",
        "'speaker_7': 'It goes up a little bit, but our peak goes up in the evening. So particularly during the winter, our peak is, you know, 5 to 10 p.m.. In that range. And so that's a time where solar is not going to fill it.'",
        "'speaker_7': 'And when you look at the top of the line, that's the peak we're talking about, you know, those top areas. So it does help. But we can't count on it to fill in all that white space. So the other thing with solar is that in order to fill a chunk of it right now, you notice solar doesn't'",
        "'speaker_7': 'even show up on there. And even though, you know, we have solar around town, you see it on the rooftops, it's not a high enough percent to really show up in. What's being fed back into the lines or into the grid is a very small percentage of what's being generated.'",
        "'speaker_7': 'And when we look at that white area, that's what we have to fill is with what's going into the grid, not what's being generated. So if I put solar on my rooftop and I use it all in my house.'",
        "'speaker_7': 'And nothing goes back in. So for the general chart like this, it doesn't even show up.'",
        "'speaker_0': 'But in regards to the what's necessary, your red line. If we had more homes with solar, could we not see that red line coming down in the future as opposed to actually escalating regards to how we could if we.'",
        "'speaker_7': 'Weren't capturing the usage with when we move to the interactive higher level meters, we'll be able to capture more of the information about what would really be available. You know, right now we can't, so we don't know how much that would really bring it up.'",
        "'speaker_0': 'So this the red line, those based upon. Can you tell me what that red line is based on?'",
        "'speaker_7': 'It's based upon the amount of power that we have to purchase and have available for people to use. Even if we were to have a huge influx of solar. We would still have to have a peak that's fairly close to this to account for the peak usage during the times when solar is not available.'",
        "'speaker_0': 'However. So this line goes out to 2034. So if during that time there is a better way to either have more efficient solar panels or better storage of the energy that's created, then we could see a downshift of this red line next.'",
        "'speaker_7': 'What we could see is if there were storage, it would still show up as the red line as it is, it's going up, but the energy would be fed in from that storage as opposed to purchasing it from someplace else.'",
        "'speaker_7': 'So when we're paying them to the customer for what they don't use, we're paying the feed in tariff. How that works out is whatever the calculation is, if we're buying back energy from them, if we had storage, we'd be able to add it.'",
        "'speaker_0': 'Or if they're. Creating your own energy that they're using. So then there would be less demand on the grid.'",
        "'speaker_7': 'If they were totally off the grid and providing all their own power and did not need any backup.'",
        "'speaker_0': 'Power or a significant amount.'",
        "'speaker_7': 'Is what you can't predict is how many days a month, what days of the week where they're going to produce enough solar for their needs. So, I mean, there's a lot of variables and I'm kind of oversimplifying it, but there are a lot of variables, and I think that solar is something we would really like to be'",
        "'speaker_7': 'involved in. One thing to also consider is the state of California right now is not counting rooftop solar as part of our renewable energy that we're mandated to have. So it will not count in our percentages for California.'",
        "'speaker_0': 'Okay. And who makes that decision that.'",
        "'speaker_7': 'Ah, that's a legislator parents.'",
        "'speaker_0': 'That's, that's not right. Maybe that's something that can really change. Maybe that's something that could be considered.'",
        "'speaker_7': 'But that, that's something that we've asked about. Currently, their legislation is being looked at and I was just up in Sacramento along with some of our staff when about two weeks ago, I guess. And that was one of the issues.'",
        "'speaker_7': 'And our general manager also has been involved in meetings trying to create amendments to the proposals as they stand now. But their concern is that distributed generation on rooftop is not something that we capture all the information about.'",
        "'speaker_7': 'We don't know how much they're using. We don't know where it's being used. So we can't capture energy efficiency numbers on it. We can't actually capture the total amount that's being used. And so therefore we can't count any of the rooftop solar as part of our renewable portfolio according to the state, although it is renewable energy.'",
        "'speaker_0': 'And then I want to add real quick is that this gap is based upon then current technology, current usage, and over the next 20 years we may and this is why your job is so hard, honestly, why it's so difficult.'",
        "'speaker_0': 'Try to anticipate what technology will be available then. So we may or may not actually have that gap at that time future that.'",
        "'speaker_7': 'That's correct. And going forward it just may get pushed out further. So as we add, contracts will fill in and the white space will be pushed out. They'll probably always be white space. Some place is you always have to renew contracts or buy new ones.'",
        "'speaker_0': 'And as we have improvements in efficiency usage from technology and then whatever alternative energy sources. In the next 20 years, there will be changes.'",
        "'speaker_7': 'This feature is changing all the time, so if we take a snapshot two months from now, it's going to look a little bit different again. So it really is a snapshot in time, if that helps.'",
        "'speaker_6': 'But it's a good conservative snapshot in time, making no no projections as to what kind of efficiency will be generated in 10 to 15 years. So I think it's a.'",
        "'speaker_7': 'Right we know that there probably will be storage of some sort. We don't know what a cost effective. We know that there's a lot of work going on with interactions with the electric vehicles, conveying energy back into the system off ours, storing it and then putting it back in.'",
        "'speaker_7': 'So there's a lot that could be done right now because we don't have it in hand. We can't project it into this. If that helps.'",
        "'speaker_0': 'No, I remember Nebraska.'",
        "'speaker_4': 'And I'll just hearken back to the great workshop that was town hall that was presented. And I think the the PowerPoint presentation from that is up on the AMP website, is that correct?'",
        "'speaker_7': 'Yes, it is.'",
        "'speaker_4': 'And but one of the themes that did keep coming up and I will say there we have really smart residents in Alameda and they stay up with the latest changes in technology. And there is, as the mayor indicated, a lot of interest in adding solar.'",
        "'speaker_4': 'But the there will be improvements in the technology and exactly what you said there is, you know, capturing the amount of generation, storing that generation. And I know there was some talk about some battery storage that is being developed maybe by Elon Musk of Tesla.'",
        "'speaker_4': 'And so what I think the five of us up here can do while we're in office is to make sure that when we have these new building projects coming online, new businesses coming into our city, that they are they're being built.'",
        "'speaker_4': 'New buildings are being built in an energy efficient manner that we give, you know, every opportunity for people to use less energy. I know that cuts down your revenues. But in the in the in the long run, in the greater scheme of things, we want to be as energy efficient as possible.'",
        "'speaker_4': 'So it does start with making good decisions before shovels ever get to the ground. But I'm really excited that we're working with such a progressive municipal utility, so thank you for all your good work.'",
        "'speaker_7': 'Hey, lots more information for you. I know you have a long evening already, but I want to share a little bit about the cost factor that goes with this, because that's another important side of the picture. And if you look at the next chart that we have up here, you'll notice that the two things that grow consistently'",
        "'speaker_7': 'all the way across are on the bottom, the power costs and the transmission costs. Those we have projections are that they're going to continue to go up. We know that the power will continue to increase in price. We know that the transmission costs, with all of the various regulatory agencies, the new lines that are switching lines that'",
        "'speaker_7': 'are expected in the future in order to bring in more renewables to the Bay Area from outer areas are going to cost money and those things we're going to have to pay a portion of and we don't have a choice in that is we have to use the transmission lines.'",
        "'speaker_7': 'So those are going to be sort of a steady uphill. If you notice, most of the others are pretty flat as we go on up our debt service, our contribution to the city are labor costs are staying. They go up just very slightly as we go across.'",
        "'speaker_7': 'You know, it's a very slight increase with the raises and things that go on on a regular basis, keeping our size of our workforce pretty consistent. The material and services also go up slightly, but where you'll see a bump and I think this is important to note for you is in 2017, 2018, you'll notice that the capital'",
        "'speaker_7': 'and equipment costs go up tremendously, at least in reference to the other capital and equipment cost areas. The reason for that is, is that we are putting in the new infrastructure, the advanced metering infrastructure is being put in.'",
        "'speaker_7': 'We have a pilot going on now. We hope to have it pretty much across Alameda. That is very costly to put in. And it's not only putting in the infrastructure on the metering side of it, it's also putting in all of the electronics on the other side so that we can use the data.'",
        "'speaker_7': 'So that is a big investment for us. And some of that money we can use from our rec and our renewable funds. So we can use a little bit from that. But there is part of that that we may have to finance along with.'",
        "'speaker_7': 'We're looking at the infrastructure for all of the new development going on in Alameda that when we look at those infrastructure costs, that's a big chunk, particularly as we get into 2017 and 18. We've put it on here.'",
        "'speaker_7': 'That doesn't mean it's budgeted for. So we still have to figure out how to budget for it and how we're going to cover those costs because they're not going to be recovered with our normal fees. And you know, that just can't be recovered in that short a time period.'",
        "'speaker_7': 'And one of the things that I kind of mentioned on that, I think it's important to be on your minds. Is this on ours as you look at infrastructure, money, dollars that are collected from developers? Normally we do a 60 40% split with a developer.'",
        "'speaker_7': 'That's kind of our normal standard. When we put in infrastructure to a new development, we split the cost as the infrastructure is going in at at the point. There is some money coming from developer. And one of the things we'll need to know in the future is what percent of that, what's going to be the percent split'",
        "'speaker_7': 'of what money we can expect to get back and how much we need to finance. So that's just kind of putting that out there to think about for the future.'",
        "'speaker_0': 'Every day.'",
        "'speaker_6': 'A just a question on the capital equipment bump up that you're looking at in 2017 and 2018, particularly what you referenced is there have other municipal electric entities adopted something similar to that that we can look at as as a model to to to duplicate if not improve on.'",
        "'speaker_7': 'There are a number of who have already started to put the that type of metering in Santa Clara. I think. Do they have the largest.'",
        "'speaker_6': 'Okay.'",
        "'speaker_4': 'And perhaps Mr. Steiger would like to come up so that people watching at home are missing this. And there will be a video, too. So.'",
        "'speaker_6': 'Yeah. Santa Clara has started. They're the largest municipal in northern California that's doing that. Smut is completely operable. And where I was previous to here in Southern California, Glendale has been operable since 2011 and is actually far ahead with technology.'",
        "'speaker_6': 'So the good news is that because we waited a little bit, technology has advanced and costs have come down. So. Yes, and also we. We don't really necessarily want to be the first one so that we can learn from the lessons of others.'",
        "'speaker_6': 'And we are not the first one know.'",
        "'speaker_7': 'And that's that's been a part of our board consideration. And we don't want to be the first mover, we usually are the second mover and use everybody else's mistakes so we don't make them. The other thing moving into the next slide goes into that.'",
        "'speaker_7': 'Oh yeah. Oh I'm sorry. Question on the.'",
        "'speaker_4': 'Question, I was just I'm noting that you said there's usually a 6040 split when you're working with a developer on putting in new infrastructure. Did I understand you correctly to say that you don't know what that split will be yet for the new development at Alameda Point?'",
        "'speaker_7': 'That's correct. We know you know, we know engineers have worked at the cost and we have the costs numbers.'",
        "'speaker_4': 'Oh, yeah. But, but.'",
        "'speaker_7': 'The actual splits of how the infrastructure funds that are being collected, how those are going to be split and what it's going to do to our usual, you know, and we understand that at times that has to change when we're trying to support something, but you can't fund it.'",
        "'speaker_4': 'And yeah. So what, what needs to happen before you have your answer?'",
        "'speaker_7': 'I think it's a factor of the planning that's going on with the point development that they need to figure out. Because as the infrastructure goes in, it's going into areas that we're sharing the space with other utilities.'",
        "'speaker_4': 'Right.'",
        "'speaker_7': 'So they have to figure out what that split is. And okay, you know, so that for us, it's unknown right now because we're going to be voting, you know, early next year to try and put our budgets together and decide what kinds of money we need and whether we need to use bond money or what we need'",
        "'speaker_7': 'to do. It's going to be urgent, you know, by the end of the year. We have some real firm numbers to work with. So that's just one thing. You know, we talked about concerns that's on our concern list.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'Okay. Are there other things that are going into the infrastructure besides the advanced metering? And just a little aside to the advanced metering? That's the only way we can do time of use pricing is to have those meters in place.'",
        "'speaker_7': 'And time of use pricing is probably the most fair, efficient way of pricing energy because you're paying for what it cost at that particular time. And so that way high users during peak periods pay more if you switch.'",
        "'speaker_7': 'You used to use it during a low period. You pay less.'",
        "'speaker_4': 'And doesn't that system also allow feedback to users so they can see, you know, you're you're using an awful lot of energy at this particular time of the day or on this particular usage.'",
        "'speaker_7': 'Exactly.'",
        "'speaker_4': 'There's the smart part. Right.'",
        "'speaker_7': 'The other thing it does is that it allows us to see problems in the system faster. So I mean, all the way around, there's there's a benefit from it. We're also upgrading the automated distribution system, which is our system.'",
        "'speaker_7': 'And that was our what we used to call dispatch. But it's the staff that we have 24 seven that are involved in the distribution system. And the reliability tied to the Coast Guard island will be finished by the end of 2016.'",
        "'speaker_7': 'So we're currently doing that, the underground utility district. Those are funds that are already set aside for that. But it does come under capital, and we're hoping that by the end of next year we will have some actual work underway.'",
        "'speaker_7': 'And the relay replacement genny substation is already something that we're starting on. The mobile technology is what I was talking in the back end of. What we need for those meters is that this system, in order to gather the information, process it and make it usable, the electric vehicle charging stations and the electric vehicle purchases go into'",
        "'speaker_7': 'that. And then our street light program continuing the LED conversions until we have all led. You know, which is still we're working on it. Any questions in that area? Hey, the other area that we want to just make you aware of, you received a bound version of our strategic plan, and I don't know if you had time'",
        "'speaker_7': 'to look at it. What I want to do is very quickly, I'm just going to do a high level sort of blueprint of how it's put together so that you know what to look for in it. One of the things with this plan, it was a very inclusive plan process.'",
        "'speaker_7': 'It took place over a period of time, working with frontline staff, working with experts in various areas, working with our management staff. It was a very. Internal process on one hand, but using an external consultant who brought in all kinds of other information.'",
        "'speaker_7': 'Also getting information from all of our stakeholders. So really looking at who uses the services, what are they looking for? What do they need to have back from us? Those types of things. And as we looked at all of that, we came up with the fact that we must achieve excellence and we have to have a plan'",
        "'speaker_7': 'that's based on forward looking priorities. So we're always looking way out into the future. So we came up with key result areas. And I have to say our staff did a fantastic job in working on this and really coming up with very definitive things for us that we could work with that they could be accountable for.'",
        "'speaker_7': 'So we have goals that are measured. They're owned. We actually, in the plan have an individual named as the owner of each one. So there's somebody who is held accountable and there's a schedule. It tells you what quarter, that there's either milestones to be reached that kick off or an end date for it.'",
        "'speaker_7': 'And the initiatives are the define tactics over time. So as we look at these, these are the key result areas, customer programs and experience the workforce system. Resiliency, technology, energy resources. Financial and organizational stability. So on the next page it shows you how we break them out.'",
        "'speaker_7': 'So looking at the customer program and experience area under that, you'll notice that there are a list of goals that are highlighted in yellow, and each of those goals underneath them has the various initiatives. And going across you'll see right next to the goal there's a measure, overall measure for it.'",
        "'speaker_7': 'The next box has the responsible individual. So as a single individual, whether they're a department head or a lead on a project, and then you'll notice we go out about not quite two years, but about two years to show status.'",
        "'speaker_7': 'So when do we expect them to be kicked off if they're not already going? And then when are they completed? Some of the tactics will be just kick off. Tactics have it started. Some will be finished. Tactics. You know what we're doing at the end.'",
        "'speaker_7': 'Some will be monitoring after it's done. So you'll see those all lined up all the way across. That means workforce also has the same thing. System resiliency. This is one that I just want to point out to you that the bottom go there, 3.4 is complete.'",
        "'speaker_7': 'The infrastructure for LME 2.0 and that's what I was alluding to. It's on our goals. We certainly want to see it happen. We need to be able to budget for it. That happened on schedule. Each of these has the same type of thing.'",
        "'speaker_7': 'So you'll notice on the bottom of this one, the last one has to do with cybersecurity. So that's a whole area that we have very specific goals in and that's an area that hopefully you are. Very aware of and and you want to make sure that we do meet certain standards.'",
        "'speaker_4': 'Yes, I did have a question of that about that. The fact that it is the last school on the list doesn't doesn't is not a reflection of its importance to the system, because I think that is it's something that, you know, not just our city but our nation needs to needs to address is cybersecurity threat to our'",
        "'speaker_4': 'various utilities.'",
        "'speaker_7': 'It has absolutely no relationship to the priority. They're all equally as important. You know, they are not listed in any particular order.'",
        "'speaker_6': 'Yeah. And as it is, I mean, you've got two things that are. Initiatives that are going to be delivered, I guess, in the fourth quarter or fourth quarter of of of this fiscal year 2015. Oh, you got some things that are coming up on that.'",
        "'speaker_6': 'Oh.'",
        "'speaker_7': 'So you'll notice that they really are spread out. Some of them are going way out into the future, some are closer and we're looking towards end dates on them. So. If you want to look in terms of importance, is what are we doing right away?'",
        "'speaker_7': 'It's probably, you know, the way to look at it.'",
        "'speaker_0': 'So on that chart, though, when you look at your cyber security, you do have two things I just want to reiterate, but number day, I was saying so cyber security is a high priority. You do have two things coming up this year.'",
        "'speaker_7': 'Okay. What we already have in place in cyber security is we have a cybersecurity consultant who's working with us who is doing periodic audits of our system. And so we get real time information and works with us immediately if there's any kind of a problem.'",
        "'speaker_7': 'We also have our policies in place that are consistent with the policies required by our regulatory agencies. So this is over and above that. What else are we doing? Okay.'",
        "'speaker_6': 'I have a quick question and I don't need a quantitative answer, but going back to the air load, the projected demand sheet, that's the red line over the is the Coast Guard boats and also the the marriage ships.'",
        "'speaker_6': 'Does that have a significant effect on the red line or is it just is it marginal?'",
        "'speaker_7': 'Yes, they are. Some of our bigger customers. Yeah. You know, when we look at commercial customers, they are some of our biggest commercial customers. So when we look at the the fleet boats that are out there, those take a huge load.'",
        "'speaker_7': 'And then also Coast Guard base does, too.'",
        "'speaker_6': 'So and to be sure, I'm not saying we don't want them as customers. I'm just saying if you adjusted the red line to account for that with the red lines suddenly be a little the new orange is.'",
        "'speaker_7': 'I don't know what percent.'",
        "'speaker_1': 'You know.'",
        "'speaker_6': 'I don't know. I don't need a quantitative. It's just something that crossed my mind.'",
        "'speaker_7': 'I just know if we look at our bigger customers, they're up there.'",
        "'speaker_6': 'Yeah. Yeah, they represent two of our very largest customers. Yeah. And so, yes, it's. It's a fairly substantial percentage. It's. It's less than ten, but more than five. Okay. Okay. And I have to be careful in terms of what we actually exactly say in public.'",
        "'speaker_6': 'But but it would make a difference. It's it's it's good solid load for us. So we like to have it there. Yeah. Okay. Thank you.'",
        "'speaker_7': 'One of the things too, when you're dealing with loads like that, if we have predictable solid load and you can, that's easy to plan for and also helps us in the planning for the rest of it.'",
        "'speaker_6': 'Well, there's a good story behind that, too, because in the late 1980s, the Navy had asked the city of Alameda Bureau of Electricity to make significant investments, which they which we did. And then now with the expectation that we know we're going to need to have contracts to have a ready source of energy supply.'",
        "'speaker_6': 'Well well, you know what happened? We entered into those contracts. We have the base closed.'",
        "'speaker_7': 'Yeah, we lost a big chunk of our load, and now we're growing it back. Yeah, essentially.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'Yeah. Okay. Energy resources. This is some of what we've talked about before. This goes into how we're handling all the things and looking into the storage and the electric vehicles and the generation, the local generation and all of those things are assigned to specific individuals who will be coming back to us with reports and plans and things'",
        "'speaker_7': 'over the next two years. And then financial and organizational stability. This is a big item for us. You know, we have to plan to have the cash on hand. And because of having to always pay for the power on a regular basis, large amounts of money, we always have to have a certain number of days cash on'",
        "'speaker_7': 'hand. And that's why part of our policy is that we have 145 days of cash on hand, and it's mainly to pay the power bill and keep things running because we can't just turn off the lights and go home.'",
        "'speaker_7': 'The other thing we're looking at is a cash neutral budget goals 6.4. We have been for the last several years relying on some of our reserve funds, not large amounts, but we have been taking small amounts out of reserves.'",
        "'speaker_7': 'We want to be cash neutral so that we're not taking it out of reserves where we can use the rec reserves or things like that or the underground utility reserves. We use those, but not take it out of the regular reserves at this point.'",
        "'speaker_7': 'When we look at some of the capital improvements, we will have to take some funds out of there. So that will be a separate addition to our budget to do that. But we want to really keep our budget cash neutral at this point.'",
        "'speaker_7': 'Any questions on that? Okay. Any questions in general?'",
        "'speaker_6': 'Well, I'd just like to comment that I found at so many levels this discussion was so fabulous in terms of like, you know, discussing the supply or the demand. And also, you know, you discussing the game plan that you have, the different goals and strategies and initiatives and the timetables.'",
        "'speaker_6': 'I meant it. It sounds like, you know, you've got a roadmap ahead of and I think because you touch every single one of Alameda residents and businesses, I think they should feel confident that we're we're moving ahead in a conservative, thoughtful manner.'",
        "'speaker_7': 'I want to assure you that we have a great general manager, very effective people on our board, and that we have great employees right now and we have some new ones that are up and coming. We're training people, so we're trying to make this a very sustainable organization far into the future.'",
        "'speaker_7': 'And I'd just like to thank the mayor and the city council for the time to present this and also invite you to any of our workshops you'd like to come to in the spring. We do have a budget workshop and we usually do some planning later in the year.'",
        "'speaker_7': 'So we'd love to have any participation, anything you'd like to participate in, come and work with us in the workshops. And you know, we can share the most current information with you.'",
        "'speaker_4': 'And just remind us. Mr. Eaton when I was at the town hall meeting, you did. I think there are others that are that will be taking place on these different topics. Do we have any dates for those yet?'",
        "'speaker_4': 'It's okay because if.'",
        "'speaker_7': 'There are dates and I can't quote them.'",
        "'speaker_4': 'Then well, even when you know, or maybe Mr. Staggered, as we can always we can always help get the word out.'",
        "'speaker_6': 'We have two more town hall meetings, one in September, and I believe September 21st. I think it's close.'",
        "'speaker_4': 'Plus.'",
        "'speaker_6': 'Or minus. And then another one in November. The one in September will focus more on the community solar initiative. And then the one in November will be kind of a a summary plus looking at integrating rates.'",
        "'speaker_0': 'And, you know, will those be in the library also anticipate.'",
        "'speaker_6': 'At the current time? That's our plan. Yes.'",
        "'speaker_0': 'Right. And I do want to add that member Desai and myself were able to attend that meeting also. And there was huge community participation. This is, as we all know, an issue that our meetings are interested in. So I look forward to attending those meetings and your continued efforts to balance all of this.'",
        "'speaker_0': 'And this was an amazing presentation. Thank you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_4': 'Thanks. I met.'",
        "'speaker_6': 'You.'",
        "'speaker_0': 'All right, next item six SI.'"
    ],
    "Annual Report of Alameda Recreation and Parks Department.": [
        "'speaker_2': 'Presentation of Alameda Recreation and Parks Department Fiscal Year 20 1415 Annual Report.'",
        "'speaker_5': 'Thank you. I'm Patrick Cressy, the interim rec service manager for the city of Alameda. Mayor Spencer. City council members. City manager members in the audience. I'm happy and excited to present the City Council the annual report for the Recreation and Parks Department for 2014 and 15 oh.'",
        "'speaker_3': 'Oh. All right, now I need.'",
        "'speaker_5': 'Okay, here we go. And first of all, I want to point out some of the highlights of the year. First, we were able to add one full time rec services specialist back to the LAPD team, paid out of the rec fund and that person services the team and our special interest classes and is doing a fabulous job'",
        "'speaker_5': 'so far. We're also staying very current with all the new trends in recreation. We have more opportunities for healthy outdoor activities like kayaking, canoeing, paddleboarding and sailing. And in our summer programs all of them are pretty well attended and well utilized.'",
        "'speaker_5': 'It was my pleasure this year to work with local resident Patti Harding to present the first ever skate tournament in honor of her son, Clay Harding. In addition, through her efforts and others efforts, volunteers and donations to Skate View Park receive a much needed attention and upgrades to make the park even better than before, which included painting'",
        "'speaker_5': 'a barbecue area, site, work and grading. And if you haven't seen the beautiful mural mural that's out there, I would recommend that you do so. We'd also continue to develop and work with young people and expanding their voice.'",
        "'speaker_5': 'Our Alameda Youth Committee with our new recreation service specialists, have expanded opportunities for volunteering in the community, as well as giving youth a voice in Alameda. I'd also like to point out some of our community partnerships that that obviously make our department work and go.'",
        "'speaker_5': 'There's been several this past year, the Alimony Community Fund helped to replace kitchen appliances in two recreation centers. This year, the Elks Lodge 1015, committed to provide funding for the free summer baseball program for the next five years.'",
        "'speaker_5': 'The Friends of the Park Foundation have continually helped sponsor over the years, especially the Teen Haunted House and the Starlight movies in the park. And I'll plug that. Our next Starlight movie is next Friday, July 24th, showing the Lego Movie at the multi-purpose field.'",
        "'speaker_5': 'In addition, this year, they also donated $20,000 to help renovate the Longfellow Playground, which included the first rubberized accessible safety playground surface. This was match funding for with a company called Game Time and on July 25th. Also next week is the grand reopening that will take place to celebrate the new playground and the and to mark the'",
        "'speaker_5': '25th anniversary of the American Disabilities Act at starting at ten. So please come out and enjoy. I also want to note the Rotary Club also helps sponsor annually the spring egg scramble. Our other division mastic well mass and continues to be fantastic.'",
        "'speaker_5': 'Their annual membership drive is currently underway and they've offered just like the trends in younger recreation, we've also offered more outdoor activities like paddling down the Russian River walks and hikes for an active senior. And this summer they also added something that is been very successful down at Lincoln Park on Wednesday evenings, they have Pickleball, which is'",
        "'speaker_5': 'one of the fastest growing sports in the United States. So if you haven't ever had a chance, go out there. There's a lot of seniors out there on Wednesday evenings on the court. And it's pickleball is a kind of a a scaled down tennis ping pong game.'",
        "'speaker_5': 'And they play the doubles. And let's see, they've also partnered with the Army, the Family Services, to offer senior management the excuse me, they partner job for seniors with senior connections, which provide access for senior case management services this year.'",
        "'speaker_5': 'And as always, the driving force behind Mastic is the many volunteers and the countless hours to make fantastic mastec a great destination and a wonderful asset to the city in our Parks division this past year it's been very challenging.'",
        "'speaker_5': 'For over half the year, the maintenance staff was down to four people due to varying reasons, but still managed to have great, clean, safe parks. They also had to deal with the statewide drought and reduce water usage by 30%, but they also were very busy enjoying improvements as well.'",
        "'speaker_5': 'They managed to put in new pathway lights at Marina Cove Park. They replaced the awning, the outdoor picnic area at Lincoln Park. They refurbished the concrete stairs at Washington Park, also at the Al DeWitt Club. New carpet was placed in the main room and the hallways.'",
        "'speaker_5': 'And with the help of the Latter Day Saints volunteers, we were able to get in a new paint job and landscape work on the outside at the club. In addition, we installed micro filament recycling containers at all the fishing spots to help prevent fishing lines from going into the bay and being harmful to wildlife.'",
        "'speaker_5': 'And I know they don't get the recognition that other parts of our division get. But I applaud the maintenance division for maintaining all the parks in a safe, clean manner and and everyone can continue to use them. The amount of use that a lot of our facilities get is is sometimes overwhelming.'",
        "'speaker_5': 'And there are always the first ones out there are doing the best they can. Seven days a week. As always, if there's anything that comes up, please don't hesitate to call us. We're always we want feedback and we want to make sure the parts are always safe and well maintained.'",
        "'speaker_5': 'As you can see in our this is a basic overview of all our programs mass senior center division, the recreation service division, and then the park maintenance vision. This is our goals. As you can see there. You know, we have a lot of very busy and a lot of programs that we that we maintain.'",
        "'speaker_5': 'And I think not only do we offer opportunities for recreation, but we provide so much more benefits to help all our meetings, whether that's to socialize, get healthy, provide transportation, to bring people together and have fun. Of course, that's what recreation is all about.'",
        "'speaker_5': 'In our over 31,000 people are served serviced annually by the Recreation and Parks Department. We have a lot of drop in activities that service those who are very young and those who are very old. We have the replay program, which serves people from six months old up to three years old.'",
        "'speaker_5': 'We have our five parks and playgrounds sites that I think the Council for keeping. It's one of the things that I think makes our unique, that we still offer free parks and playground programs throughout the city. And it's it's definitely well received.'",
        "'speaker_5': 'And I think I get so much positive feedback from people that thank us every day for having those parks open and having the ability to have their children come down and just play. Also at the teen center, same thing.'",
        "'speaker_5': 'A lot of a lot of positive there from of the five as well. And then and we have open gym at the Army to point every Sunday for volleyball and basketball so please come out take take these opportunities to enjoy and participate in some recreation on the island.'",
        "'speaker_5': 'The staff includes 22 full time staff, over 270. Part time seasonal workers and volunteers are a big part of the AARP family. We have 321 volunteers doing over about 2220 600 hours of service. We could not provide these services without the help of volunteers.'",
        "'speaker_5': 'As you can see on the budget, our budget is a little bit over $8.4 million. Over half of the budget is the REC Fund, and the REC Fund is created through the user fees for programs and facility uses.'",
        "'speaker_5': 'And most importantly, I have to point out in this next slide that looking at the five year comparison that LAPD is excited to point out that we have gone from a net deficit to a net profit this year.'",
        "'speaker_5': 'So we're very happy about that. And in addition, I think the person sitting over here deserves most of the credit. But since 2014, Aapd has received $6.5 million in grant funds. And and truly, you know, and I say that, but Amy does deserve the credit on this because she's done a lot on the grants.'",
        "'speaker_5': 'But we wouldn't be moving forward and doing all the things we did without all her efforts on on these grants. In fact, she's going to talk a little bit about one of her grants right now. We're talking about the any open space part.'",
        "'speaker_1': 'Amy. So just briefly, as has been mentioned and was put out to the press for Jeanne Sweeney, Open Space Park, we recently received a $2 million grant. It is still pending. The National Park Service has final stamp of approval, which is anticipated soon.'",
        "'speaker_1': 'And but it was recommended by the Land and Water Conservation Fund. They recommended ten projects throughout the state. Ours was the largest and $2 million. The other projects ranged from about 350,000 to about $1,000,000. So ours was significantly larger.'",
        "'speaker_4': 'And what percentage of the total grant output was ours? It was significant that because all together they they distributed like $6 million in grants and we got 2 million. Correct.'",
        "'speaker_1': 'And that 2 million was was we were able to apply for the grant because it requires a 50% match due to the 2 million from the Del Monte, the Tim Lewis Communities Developers Agreement. We're already in progress with Sweeney on Park on the trail design for the Cross.'",
        "'speaker_1': 'Only two trails were in progress for design on that and we'll go out for an RFQ soon for the design of the whole park. So it's starting to move. I continue to get the question when is it going to open?'",
        "'speaker_1': 'And it will be opening in phases. The trail will open for much sooner, much sooner than than we thought a year ago. So that's my SAT answer. But I expect phases to start opening in 2017 with the trail first and then and then the portion from from from this land and water conservation grant, which is the most'",
        "'speaker_1': 'funds in this eastern side of the park. It's exciting. Okay, Pat.'",
        "'speaker_5': 'All right. So as stated earlier, with the annual report that was given from the Greenway Golf Course, I just wanted to point out that we do manage and oversee the contract of Greenway in the city through the Rec department, Harrison Center, which is the recreation center at Lincoln Park in Alameda.'",
        "'speaker_5': 'We were able to, through CIP funds, replace the floors in the center as well as new blinds that were installed in the craft room. We refurbished the kitchen with new appliances and new countertops and a fresh coat of paint.'",
        "'speaker_5': 'This year, we're going to be doing the entire interior of Harrison Center, as well as doing some upgrades on the patio with a new barbecue and survey. So things are happening definitely down at Lincoln Park, Longfellow, as I already mentioned.'",
        "'speaker_5': 'We did have a playground remodel. It's going to be part of our annual playground remodel. So this is the first one. And then we're hoping to do now every year. And as I said, it's the first rubberized, accessible playground surface.'",
        "'speaker_5': 'It was funded through the California tire derived product grant and matching funds from game time. And the Friends of the Park Foundation and Snell Boat Launch Facility also received a $300,000 grant through the State Department of Voting and Waterways, and that is specifically to design a new renovation of the facility that includes replacing and renovating the existing'",
        "'speaker_5': 'docks, new restrooms, a fish cleaning station, repaving the parking lot, putting new lighting in and signage. So we're really excited to get that and we'll be bringing that forward as we're moving forward on that with the new designer.'",
        "'speaker_5': 'Chrissy Park has been working in project process right now to secure construction and anticipate to be completed by the end of 2016. Chrissy Park will be funded through Measure WW funds and we're really excited to get a new rec center down at a park that really needs it, has lots of great other attributes about it.'",
        "'speaker_5': 'But one thing that's not so good is the building, so we're very happy to finally get that to going. Estuary Park. For most people, I don't know if everyone knows Raspberry Park is is the area located where a coast where Coast Guard housing is off Singleton in Alameda and it's going to be the first lighted synthetic multi-use'",
        "'speaker_5': 'field that'll have a separate baseball soccer field dedicated for the mentally and physically challenged youth and adults. It'll also include a dog park, playgrounds, open space and a basketball court. The process was a little bit slowed down due to the soil and mud issues with putting in light standards.'",
        "'speaker_5': 'But now we're ramping back up and we're hoping to begin construction by 2016. So that's another first in Alameda, and I think it'll be a benefit to many of the sports associations. And I mean, the first phase is going to be funded.'",
        "'speaker_5': 'Full is almost closed. It's almost fully funded through grants, donations and development impact fees. And as you'll I'll point out later, user fees will help to pay for the maintenance of the park. We're estimating that the user fees will be able to offset the need for the maintenance staff to be down there, the internal pool renovation.'",
        "'speaker_5': 'Unfortunately, the internal pool is closed the summer, but fortunately it's closed because it's an event renovated. LAPD provided $750,000 at a one time payment to a unified school district as part of a three party agreement. And the final pool design was vetted through the community use groups, the school district and LAPD and is scheduled to reopen by'",
        "'speaker_5': 'the summer and by next summer, 2016. So as you can see, lots of great things happening in Alameda Summer. Oh, sorry.'",
        "'speaker_0': 'In regards to the dog park, do you anticipate that that will be in addition to the current one over by the ferry over there? Or is that going to be.'",
        "'speaker_5': 'I would say no.'",
        "'speaker_1': 'No. Once that dog park is constructed, constructed, which is phase two of that project, we would close the dog park by the ferry. It's lacking in utilities and and amenities. So.'",
        "'speaker_0': 'And do you anticipate having one for large dogs? One for small dogs? It will.'",
        "'speaker_1': 'Have both.'",
        "'speaker_0': 'Help. Thank you.'",
        "'speaker_5': 'So some of the things that were challenges for us, this as we look forward to the end of this year and looking forward to next year is again securing funding for the deferred and ongoing maintenance of existing facilities and fields, as we all know.'",
        "'speaker_5': 'You know, a lot of our facilities and fields are are aging. And then, as always, we're going to have to continue to deal with the statewide drought and water restrictions. Hopefully, we'll have a rainy winter this coming year, but we will continue to plan ahead.'",
        "'speaker_5': 'And it's also one of the other challenges is to balance the, you know, the the balance between increasing affordable user fees. Because, as you know, as I said earlier, half of our budget comes from user fees and with also the increase in the state minimum wage.'",
        "'speaker_5': 'And what's something that has come up that which is a great thing for Alameda with all the new development and new industry and businesses, it has created an interest in or has created a challenge with local job competition.'",
        "'speaker_5': 'You know, young people have a lot more opportunities on the island than they did previously. So that's going to be a challenge for us. But as always, I think is working for LAPD is is is the best choice.'",
        "'speaker_5': 'And we'll continue, you know, with Amy's lead to look for new grants and opportunities to finish some of the CHP projects and identify ongoing ways to maintain the new fields and facilities. Because that obviously is something you always had to plan for, is it's great to build it, but you've got to maintain.'",
        "'speaker_5': 'How are you going to keep it up? Let's see. Again, here's a map of Alameda and it does show all the different facilities that we have throughout the island. I don't think people realize that when they see that, they're always impressed.'",
        "'speaker_5': 'I always get the fortunate of talking with new people that moved to Alameda and then they always bring out the map and they go, Wow, you guys have a lot. And I said, Yeah, we have a lot. And, and, and the best thing is that it's within walking distance pretty much anywhere on the island.'",
        "'speaker_5': 'And that's the best thing about neighborhood parks in Alameda. I always think it's it's one of the most unique systems in the Bay Area or that I've ever come across as a professional. Let's see. We do have a lot of facilities.'",
        "'speaker_5': 'We have 40 picnic areas, a lot of softball fields, a lot of tennis courts. Just shows you the the immense amount of structural things that we have to deal with, as well as our maintenance staff has to deal with, as well as the opportunity to program and do lots of different things.'",
        "'speaker_5': 'You know, I think people don't realize all the benefits they have just right in their backyard. And last but not least, July. I think that was it. July is park and rec month and I am an honored and got to give an empty water bottle because truly LAPD is the place to be.'",
        "'speaker_5': 'So thank you. Do you have any question? You.'",
        "'speaker_0': 'Council members. Any questions? I have a question in regards to the skate park. Or a suggestion. I have heard a request that we have lights out there and I've brought it up before with different entities. And I just want to again say if there's any way to get it lighted, that is something that's used by all ages'",
        "'speaker_0': ', especially teenagers, young adults, and we already have security out there. So if there's a way to get it lit, I think that would be another way to complement. We already have.'",
        "'speaker_5': 'Thank you. I think, you know, that's something we can look into, especially as the base gets developed and more infrastructure gets put out there. I think it'll be one of the things that we can examine.'",
        "'speaker_0': 'Thank you. All right. Thank you very much for the presentation. All right. Next seven. City Manager Communications.'",
        "'speaker_1': 'The only thing I have to offer is that this is the last of the special meetings. And our next meeting will be next Tuesday, which will be our last meeting before our break in August.'"
    ]
}