{
    "Gas Service Agreement with PG&E at Alameda Point.": [
        "'speaker_1': 'Five e is a recommendation to authorize the city manager to execute a maintenance service operations and maintenance agreements with PGE.'",
        "'speaker_2': 'Good evening, mayor. Council members jennifer. Director of base for use. We had this on concern. We did find out from pge today that they held a meeting with their safety and enforcement division of the CPSC yesterday. And that commission.'",
        "'speaker_5': 'Or that.'",
        "'speaker_2': 'Division of the commission had a couple of minor tweaks to exhibit E of this agreement that really wouldn't affect the body of the agreement. But the Exhibit E, which is the annual costs for services, and they've asked that they would like to make some tweaks regarding reporting and risk management.'",
        "'speaker_2': 'We think conceptually these make sense. These are about doing additional reporting.'",
        "'speaker_5': 'And.'",
        "'speaker_2': 'Taking some additional steps for safety purposes that we think.'",
        "'speaker_5': 'Are a good idea conceptually.'",
        "'speaker_2': 'But they were not able in time for this meeting to provide us with the exact details of these changes. So we would just like to ask that you approve this tonight, but that you authorize the city manager to finalize these tweaks through negotiation or through the final details as part of that exhibit.'",
        "'speaker_2': 'We don't think they're substantial. Substantial. We think at the most they would increase the budget by about $10,000. So the total budget.'",
        "'speaker_5': 'For this agreement.'",
        "'speaker_2': 'Is about 100,000. So no more than an additional 10,000. So we'd ask for your direction tonight to move forward with this, but to authorize the city manager to make these final tweaks to Exhibit E? I'm happy to answer any questions.'",
        "'speaker_2': 'And I'm here and Jacob Penick is here, too, and he's helped us on on this agreement.'",
        "'speaker_0': 'All right. Thank you, counsel. Any questions? Do we have a motion? But remember matter S.E..'",
        "'speaker_6': 'I move that we authorize up to $10,000 over. Would that be enough? Yes. Over the budget and approve this agreement with Piccini.'",
        "'speaker_0': 'I'll second all those in favor. I motion carries unanimously. Thank you. The now around five k.'",
        "'speaker_1': 'We have a sticker on this item, which is why it was pulled. And it is a recommendation to approve a 36 month services agreement between the City of Alameda and Housing Authority for 1.15 million to administer. Rent Review, rent stabilization and limitations on eviction ordinance.'"
    ],
    "Services Agreement for Rent Review and Stabilization Ordinance Administration.": [
        "'speaker_0': 'Alan Teague.'",
        "'speaker_5': 'Mayor. City Council members. I'm Alan Teague. You're probably going to see me a lot tonight. I've read through the agreement and I also read through the feed study, which is the basis for this agreement. The 1.1. If you look at the three years where the budgets, it's 1.1, 1.0, 1.4.'",
        "'speaker_5': 'But in the fee study on page 18, it says there'll be a significant reduction in hourly billable hours next year, 4000 hours less, which is about $250,000. The budget doesn't reflect that. So my question is how will this savings be granted to the city of Alameda with this agreement?'",
        "'speaker_5': 'So it doesn't look like there's a way to get that money back. So please figure out a way to fix it so that when they do less hours, we don't have to pay for it. And when that 1.11.2 budget, we don't have to pay.'",
        "'speaker_0': 'Thank you, city manager. We would like to respond to that.'",
        "'speaker_4': 'So how the agreement works now and it's similar to the phase agreement is it's on a reimbursement basis and then the fee schedule is calculated from the previous year. So you will if there's we have savings of 250,000, it will be reflected in the new fee schedule the following year.'",
        "'speaker_0': 'All right. Thank you. And this I just want to clarify this is this money would be paid for out of the general fund if currently how? How will this money be paid?'",
        "'speaker_4': 'It is currently paid out of the general fund by council direction. And what is on the agenda later on tonight is to have the fee study be charged to buy a unit for each of the units.'",
        "'speaker_0': 'And if that fails, then it would be paid for by as well. We're committing to this not knowing if that's going to pass, right?'",
        "'speaker_4': 'That's correct.'",
        "'speaker_0': 'Of what we.'",
        "'speaker_4': 'Have committed to do, the rent stabilization ordinance and the implementation of it, regardless of the funding and the council direction will be we'll hear later on tonight.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Ever matter of approval of this? We have to do this.'",
        "'speaker_0': 'All those in favor. I motion carries unanimously. Thank you. So now we're on our regular agenda items. Okay.'",
        "'speaker_1': '6 a.m. introduction of ordinance, approving a lease and authorizing the city manager to execute documents necessary to implement the terms of a lease with sale drone a Delaware corporation for a five year lease with two five year extension options and a right of first negotiation for the purchase of Building 12 located at 1050 Westheimer Avenue at Alameda'",
        "'speaker_1': 'Point.'",
        "'speaker_9': 'Good evening, mayor and city council members I'm Nanette Mercado in the community development and based we use department. This is sale drone is a tenant that's been operating out of building 12 for since 2016th February 2016. It came to us as part of the America's Cup.'"
    ],
    "Budget Approval and Workforce Changes for FY 2017-18 and 2018-19; Pension and OPEB Funding Policy and Trust Deposit.": [
        "'speaker_4': 'I'm going to go through the presentation with the city clerk's assistance. We also have the finance director here to answer any questions and then all the department heads. But quickly, just to go through where we are after our May 17th workshop.'",
        "'speaker_4': 'So what came across both in the workshop and the priority goal setting is the vision for the council and the staff is to have a strong fiscal stewardship. We want to be transparent and fiscally accountable and it goes back all the way to, I mean, most recently 2016 with our quality of life.'",
        "'speaker_0': 'Close the door, please.'",
        "'speaker_4': 'Our Quality of life survey that talked about our work, that talked about our perspectives and our priorities. And we had a really high confidence level of our residents who said quality of life in our neighborhoods is their top priority, having a safe, well maintained community and fiscal sustainability.'",
        "'speaker_4': 'We also recently did a Alameda budget challenge, and it was just unveiled when we had our May 17 goal setting. And since then and since this was actually printed, we have almost 1200 users. And last time we did this budget challenge, several years ago, we had 400 threefold increase.'",
        "'speaker_4': 'We also had we have 8800 budget priorities shared. So not only did these individuals three times more than last time go into the budget challenge, but they completed the whole challenge. And their priorities, their popular choices were very reflective of what this says.'",
        "'speaker_4': 'But 2 to 1, they said they want the long term budget shortfall to be addressed. And that's what the council directed in the May 17th. Let's look at our unfunded liability. And everything else up there. They really was a high priority for our residents.'",
        "'speaker_4': 'So on May 17th, what we did is and it was unusual for this council to basically looked at a what I call a raw budget, a baseline budget which reflected what the budget was last year. And it did not include what is typically done at a staff level, and that is to say yes or no to a'",
        "'speaker_4': 'number of department requests. It did actually already go through one cycle internally. And so you saw probably one third of what was actually requested. And the tough discussions and the tough decisions were brought to the May 17th budget workshop.'",
        "'speaker_4': 'At the same time, just probably weeks before the May 17th study session, we got more information from an outside expert on the CalPERS unfunded liability and also OPEB, which is other post-employment benefits. And they have changed their assumptions, as we talked about.'",
        "'speaker_4': 'And it was a bit shocking. And so we shared that with counsel as a way to go back to our original goal of we want to be transparent into the future. It doesn't impact us in the next two years, but it does dramatically impact us in year three and beyond.'",
        "'speaker_4': 'So we receive council direction and then we developed and I don't mean me it was the finance department really turned around based on council direction, this budget workshop with all the department heads. And staff and assistant city manager and especially finance staff in I think it was five working days in order to publish it for today's meeting'",
        "'speaker_4': '. What we did is we the proposed budget maintains our $24 million balance, which if you look at the percent and it's a percent of expenditures. It is 24% of expenditures, but that's before we take out what we are proposing tonight, which is to spend 50% of the funds above 25% reserved towards addressing our pension liability.'",
        "'speaker_4': 'And so when we and that comes out of as an expenditure plus the 6 million that was previously allocated by the Council. So if you take those out of the equation, we're still at 27% expenditures. So this to your budget has is structurally balanced in 1718 and it has basically what we call internally as a very small'",
        "'speaker_4': 'almost budget dust of 500,000 in. Deficit in the first year based on and we're confident that because we always budget conservatively, we will not have to take that out of our reserve. Next year at 1718, at the end of the year, we will again look at 50% and take that money out and put it towards addressing our'",
        "'speaker_4': 'unfunded liability. So our next step after this is to come back. Probably at the end of the summer. So CalPERS at the end of the summer is formalizing their assumptions. And when we have those formalized in writing from CalPERS, we want to bring back our CalPERS and our pension and OPEB experts to talk about options for the'",
        "'speaker_4': 'council. But tonight is just the budget part of it. So this is the list of what we brought on May 17th. It was initially our workforce changes. Based on council direction, we took out approximately half of the positions.'",
        "'speaker_4': 'The first position, the community development and combination building inspector we felt was needed during this period of economic uptick in development and in order to provide the service that we need on building permits and inspections. So this is a two year limited term position.'",
        "'speaker_4': 'And we will reevaluate it at the end of the two years to see how what the economy is and what our workforce is. But that's also to not commit long term pension obligations, adding that to our unfunded liability.'",
        "'speaker_4': 'The Recreation and Parks Maintenance Supervisor and Maintenance Worker two are two positions that are a result of new parkland getting developed that we talked about before the net because there were retirements and a lowering of it is about $44,000.'",
        "'speaker_4': 'The Information technology system analyst we have on here. And what the community said, too, was to make sure that we improve our technology to be more efficient. And that is up there as a funded position. And the public works maintenance for person impacts the general fund net of $34,000.'",
        "'speaker_4': 'Next. We are. So this is what we talked about at the council and how we we reduce this was next is that we reduce the general fund obligation for fire. We decided to fund the two most important and most expensive vehicles, which is a fire engine and also an ambulance for public safety reasons.'",
        "'speaker_4': 'We took off the difference with a command vehicle that will be funded at a later date. Again, these were the capital program fundings and we reduced public works maintenance building from the general fund with that initial request was for 2 million, 1 million a year, and we cut that in half.'",
        "'speaker_4': 'This was above and beyond their existing maintenance program, also sidewalk maintenance. We took that out of gas tax, which is an eligible source of funding for sidewalk maintenance. And we also reduced that to from it used to be 500,000 a year and it was reduced to 250,000 a year for a total of 500,000.'",
        "'speaker_4': 'And the most important and what was what both the council said was their top priority and the community said 2 to 1 was their top priority was to fund our pension and OPEB obligations. And so what we did is a result of all of those reductions allowed us to use 50% of our one time funds that are'",
        "'speaker_4': 'over our 25% reserve, which turns out to be 5.1 million. To put that into a trust initially and then come back probably in September to talk about how we specifically used that money and then what fund potentially in CalPERS or or parse or leave it in the trust.'",
        "'speaker_4': 'And so the request tonight is to do these four things. One is to approve the operating and capital budgets for 1718 and fiscal year 1819. And do also the capital improvement program, which is the CIP that has all of the lists of projects in in it that has been in the public review for the last three weeks'",
        "'speaker_4': '. Also adopt the workforce changes. I also want to say in addition to the workforce changes, there were a number of workforce changes that are still doing classification analysis right now. And so that will be coming back. Any changes will be coming back to council on an as needed basis.'",
        "'speaker_4': 'And then also too, we have a proposed pension rate stabilization program and post other post-employment benefits funding policy. And that funding policy says what you mentioned last time, which was to spend 50% of the balance of the funds each year above the 25% reserve in order to prefund our pension obligations.'",
        "'speaker_4': 'And then finally to deposit the six, a little over 6 million that was allocated by this council previously. Plus. Tonight's 5.1 million for a total of 11.143 into our paths. Post-employment Benefits Trust. So it's a 115 trust. It is flexible for the council to do.'",
        "'speaker_4': 'Once that those funds get in there and if our consultant says it might be more cost effective to do, spend it in a different way, then this does not obligate the council and they have that flexibility. But we want to make sure that we do it now.'",
        "'speaker_4': 'And so the summary is we appreciate the Council's very detailed and thorough look at the budget on May 17th and I know it was a difficult conversation, but in some respects it was. Appreciative to be able to share what staff normally goes through behind the scenes.'",
        "'speaker_4': 'So not only the council, but the public can see what each decision is and what rolls up into this final budget. And the department heads are here and the finance director is here to answer any questions.'",
        "'speaker_0': 'We have any public speakers.'",
        "'speaker_1': 'We have none.'",
        "'speaker_0': 'That we have any clarifying questions from counsel? Any questions from counsel? I had a couple a vice mayor.'",
        "'speaker_3': 'At the you know, at the budget workshop meeting. There was a lot of concern expressed and some of it was expressed by other elected officials as well, relative to OPEB costs and also ongoing expenses. I just wanted to know why wanted clarity.'",
        "'speaker_3': 'My understanding is we have some employee groups that are paying a portion of their health care premiums. Is that correct? And currently and currently the council doesn't pay or the any. No elected officials pay a portion of our health care premium.'",
        "'speaker_2': 'Okay. That was my question.'",
        "'speaker_0': 'Okay. I had another question. I thought you said 61 for the homeless, and yet the prior meeting it was 125,000.'",
        "'speaker_4': 'Yes. The other half comes from a grant that the Alameda. The Chief. Was contributing to this.'",
        "'speaker_0': 'So it's going to be the same total.'",
        "'speaker_4': 'It's a yes. It's 120.'",
        "'speaker_0': 'Okay. And then in regards to the Union Pacific remnant parcels or any of those, are we setting aside any money to purchase those?'",
        "'speaker_2': 'Earth.'",
        "'speaker_0': 'There's 800000 to 3 million between. That's to connect the bike path. That was on. That was one of the prior.'",
        "'speaker_2': 'So this Alayne under finance director this was included on one of the proposed ask or potential asks, but it is not in the current budget.'",
        "'speaker_0': 'Okay. And can you explain what were those remnant parcels? What would they be used for?'",
        "'speaker_2': 'I believe those parcels are around genes when you park and for the use, I would have to think Tilden way. Mm hmm.'",
        "'speaker_9': 'Since Sweeney Park and Tilden Way.'",
        "'speaker_0': 'I think we're going to hear from a recreation parks director. The reason we kept you here. This.'",
        "'speaker_2': 'Good evening, Mayor and Council. Amy Aldridge, Recreation Parks Director. Yes. Genes. When you open space park is. It is a total of 27 acres. 3.5, four or five of those acres are still owned by Union Pacific. So in order to complete the full build out would require and the access to the south from the neighbors would require'",
        "'speaker_2': 'purchasing of those parcels.'",
        "'speaker_0': 'So do we have other moneys to purchase these? On the prior presentation I had had 800000 to 3 million to purchase those parcels. We have other moneys available or we are not going to have any moneys available to purchase.'",
        "'speaker_4': 'Those parcels.'",
        "'speaker_2': 'There's for the Sweeney Park portion. We will be looking for grants as well, but we don't have any other currently identified funds.'",
        "'speaker_0': 'Thank you. So does staff have. So in regards to those parcels, do you have an idea of how we're going to pay? Are we not going to have a connection then? Is that what's happening?'",
        "'speaker_4': 'Well, it's a it's a policy question. The council could decide about the 50% for pensions. Liability. We can go after grants, we can bring this back on. We have an appraisal that we've submitted. When we can come back mid cycle and or mid-year or at any time that we need when we have that money.'",
        "'speaker_4': 'That aside. The same thing goes for the license plate readers at the Bridges. They are not included in this budget. But the expectation is, is as soon as there are cost savings in the police department's budget that will cover that cost, we can bring it back to council.'",
        "'speaker_4': 'The same for when we have more detail about the these two parcels. I mean, this group of four.'",
        "'speaker_0': 'So the. Okay. So do you have a list of the things that actually other than what you shared, I don't recall you sharing that. We actually we're not going to be funding these. The license plate reader, for instance, did you have that?'",
        "'speaker_0': 'So I.'",
        "'speaker_4': 'Think that.'",
        "'speaker_0': 'You go to the page of the presentation that shows that.'",
        "'speaker_1': 'Is this the right one?'",
        "'speaker_4': 'So it. Actually. It. Yeah, it was the truth. Two things. It was actually a revised one. But this. But the technology upgrade. Have this list. The other revised items are what we ended up funding and the ones that the two that we took out were the police license plate readers.'",
        "'speaker_0': 'So there's not a there's not a page as the presentation that shows the things that were removed, I think.'",
        "'speaker_1': 'I think I opened the wrong.'",
        "'speaker_4': 'Yeah, but that's it's not.'",
        "'speaker_0': 'Is that correct. It was not in the presentation.'",
        "'speaker_2': 'No, I wasn't.'",
        "'speaker_0': 'So you want to speak to that?'",
        "'speaker_7': 'Just briefly, I on.'",
        "'speaker_5': 'May 17th, when when I stood before you, I don't believe it was ever all.'",
        "'speaker_7': 'The way in. I think what we discussed that night was whether or not it was going to go in or not. I don't think it was ever initially considered. And it was more of a would you like us to insert it now or set it off?'",
        "'speaker_7': 'So I think that's the reason why it didn't show up on on the current slide.'",
        "'speaker_0': 'So is there a plan to be able to purchase those.'",
        "'speaker_5': 'As soon as as the city manager was just saying, as soon as we realize some savings in the police department budget.'",
        "'speaker_6': 'Which will probably, probably be in the fall.'",
        "'speaker_7': 'Then I would probably come back to you.'",
        "'speaker_6': 'In September or October.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Okay. I'm sorry. Savings from.'",
        "'speaker_5': 'Salary. Savings. Correct.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_8': 'I you I had a couple quick questions. So on. Page B, one of Exhibit two. That's another big fund's budget summary. So just walk me through this, just to be clear. So we have the in the general fund 001 long term obligations OPEB 3 million and then for smoothing 3.043.'",
        "'speaker_8': 'So that's the 6 million we're moving into the. Into the past. Yes, past fun. And then we have the 3.46 economic uncertainty. I mean, we still have that. What? So that's something that. It's been one of exhibit two.'",
        "'speaker_8': 'It's the first it's the first page in the All Funds tab if you have the binder. So that's something that we still have. Leftover from previous years. That's not in our reserves, but it's 3.4 million in case of a downturn.'",
        "'speaker_8': 'Right.'",
        "'speaker_2': 'Yes.'",
        "'speaker_8': 'And then if you flip over to page B5. So line 810, which is in the trust fund. So the 6.077 million, that's our OPEB trust at the beginning of the year. And then you remember two years ago when the budget was adopted, how much was in that?'",
        "'speaker_8': 'Was it? Was it 500,000 or.'",
        "'speaker_2': 'Much in which.'",
        "'speaker_8': 'The OPEB trust. It was at zero.'",
        "'speaker_9': 'I think it was 300,000.'",
        "'speaker_8': '300,000. Okay. And so then the. So is the 6.1 or 6.0 for $3 million transfer, is that included here? Or the fact that this grows from 6 million to 12 million is just contributions? I just want to make sure that's clear.'",
        "'speaker_2': 'So the 6,000,043 were shown as a reserve when council set it aside in this particular budget in 1718. We actually shown it as an appropriation so that those funds could.'",
        "'speaker_3': 'Be wired over to either a trust or CalPERS, depending on the allocation.'",
        "'speaker_9': 'That would be proposed.'",
        "'speaker_8': 'I guess what I'm trying to figure out is how and I'm happy that the OPM trust fund, which was at 300,002 years ago, 6 million now. Rose to. 7 million at the end of a projected 7 million and then 11 million at the end of 18.'",
        "'speaker_2': 'So if you remember, upon the approval of.'",
        "'speaker_3': 'Safety contracts, one of.'",
        "'speaker_2': 'The provisions was that in January of 2016, the city was to deposit five and a quarter million dollars in $250,000 every year after. So to date, the city contributions are about five and a half million dollars, and plus employee contributions go in bi weekly.'",
        "'speaker_2': 'So that alone so far amounted to.'",
        "'speaker_9': 'About 7 million.'",
        "'speaker_2': 'So an additional $3 million that's designated for OPEB will be deposited and that will grow to whatever the contributions are plus estimated interest rate.'",
        "'speaker_8': 'But I guess the question is then estimated 1718 between the Pars trust and the OPEB trust, what do we expect to have in that in the combined balance? Because it was kind of hard to find that on here.'",
        "'speaker_2': 'So for OPEB specifically.'",
        "'speaker_3': 'It's just an additional $30 million that will be contributed.'",
        "'speaker_2': 'Plus whatever the normal.'",
        "'speaker_3': 'Contributions that are required by the contract.'",
        "'speaker_2': 'So if it's currently 7 million.'",
        "'speaker_3': 'Then we will.'",
        "'speaker_9': 'Deposit.'",
        "'speaker_3': 'An additional three. And then, of course.'",
        "'speaker_2': '$250,000.'",
        "'speaker_3': 'Every year as well.'",
        "'speaker_8': 'So but the three is from the six that we held back last year. That right.'",
        "'speaker_2': 'In 2015. Right. Was set aside.'",
        "'speaker_8': 'So then we're going to have 11.3 set aside for OPEB.'",
        "'speaker_2': 'No, the 11 of the $11 million that's going to be set.'",
        "'speaker_3': 'Aside this year, it's a combination.'",
        "'speaker_2': 'Of both OPEB and pension.'",
        "'speaker_8': 'I guess what I'm trying to figure out is on page b518 ten OPEB Trust Projected Ending Balance 1718 11.373 million. You know what? Where does that come from?'",
        "'speaker_2': 'Can you tell me where you're looking at on.'",
        "'speaker_8': 'Page B5, which is the all funds budget summary? And exhibit two.'",
        "'speaker_2': 'Is the fund balances on.'",
        "'speaker_8': 'Balance. Eight, ten, eight, ten under OPEB Trust Fund. Sorry to get so granular on this, but that's fine. I mean, this is the crux of the budget. So.'",
        "'speaker_2': 'Okay. So.'",
        "'speaker_8': 'You need my reading glasses?'",
        "'speaker_2': 'No, that's okay. The so the $7.2 million as of.'",
        "'speaker_3': '1617 is the projected ending number.'",
        "'speaker_2': 'So we expect additional contributions.'",
        "'speaker_8': 'Online that I got during the.'",
        "'speaker_9': 'Year. Okay.'",
        "'speaker_8': 'Well, thank you. When it goes from 7.2 to 11.373.'",
        "'speaker_2': 'Yes.'",
        "'speaker_8': 'What? So that delta is made up of the 4 million or 3 million contribution from the 6 million. The 1.2 or whatever it is from our obligation. Right. So then that brings us to 11 points three. And then where on this do we account for the other 3 million for the other part of the parse?'",
        "'speaker_2': 'So that's going to be actually in the internal service fund, which is going.'",
        "'speaker_3': 'To be under Fund seven.'",
        "'speaker_2': 'Hold on a second. It's one of the 700 funds.'",
        "'speaker_3': 'And the only reason is because.'",
        "'speaker_2': 'For accounting purposes, I see it now, it it cannot be accounted for in the trust, unfortunately.'",
        "'speaker_8': 'Okay. So that's post-employment city.'",
        "'speaker_2': 'Yes, post-employment city. And it has a contribution of 4.4.'",
        "'speaker_8': 'So it's is 2.3 projected. So at the end of 18, this is kind of the point I was trying to make, but I couldn't find that number. Thank you. So we'll have 2.3 plus 11.37.'",
        "'speaker_2': 'Okay. I apologize. Correction. 721. That's the fun number. If you look under internal service funds, it's the largest.'",
        "'speaker_8': '9.1.'",
        "'speaker_2': '721.'",
        "'speaker_8': 'So we'll have 9.1. I stand corrected plus 11.3. So we'll have over 20 point almost $20.4 million in these two funds that two and a half years ago, when we did the budget, we had barely 3000 or 300,000.'",
        "'speaker_2': 'Correct.'",
        "'speaker_8': 'Okay. And I think that's something to celebrate that we're actually being fiscally conservative and that we've been able to put away $20 million for these long term liabilities in the last two years and to whom is warmer. And do you, Miss Adair, and you, Madam City Manager.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'So can you clarify out of the reserves how many, how many what's the dollar amount that we're going to be transferring into these OPEB and pension funds?'",
        "'speaker_2': '$11,143,000. That's what's currently budgeted for that 11 million.'",
        "'speaker_0': 'How much?'",
        "'speaker_2': '11 million. $143,000. That does not.'",
        "'speaker_3': 'Include our contractual obligation of.'",
        "'speaker_2': '$250,000.'",
        "'speaker_0': 'Okay. But this is 11 million from the reserves. That's being spent from the reserves.'",
        "'speaker_2': '6,043,000 is from the reserves that was previously previously authorized by the Council in 2015, and $5.1 million.'",
        "'speaker_3': 'Was based on the workshop that.'",
        "'speaker_2': 'We just had in May and which is equivalent to 50% of the surplus above 25% available balance and general fund.'",
        "'speaker_0': 'Thank you. Any other questions from Council.'",
        "'speaker_6': 'On that.'",
        "'speaker_0': 'Matter, S.E.?'",
        "'speaker_6': 'I like the idea of doing a mid-term look to see how we're tracking, because I and I also appreciate that we our projections are very conservative. And I'd like to remind people that four years ago, when the projections were made, we were projected for this last year have a.'",
        "'speaker_6': 'Deficit and not a not a general fund balance at all, but a deficit of $800,000. And we have a fund balance of $23 million. So I think there's the combination of conservative projection. And good management is how we're going to fund some of those items that.'",
        "'speaker_6': 'Are are needed, but unfunded.'",
        "'speaker_0': 'And member Ashcroft. And I just want to commend thank staff for turning this around so quickly since our budget workshop, which was less than a month ago. And I also agree that I think we are on the road to good discipline in keeping the fact that we have these long term liabilities in front of us, front and'",
        "'speaker_0': 'center at all times. And being able to work in a practical manner. I appreciate, for instance, Miss Wooldridge, who's really a genius when it comes to getting grant money. So I have complete confidence in your ability, but to, you know, yeah, we'd like to buy those, those remnant parcels from Union Pacific.'",
        "'speaker_0': 'We don't have an appraisal yet, but with the combination of grant funding, then we'll come back in midyear, take another look, see what we can do. But rather than just saying, here's our wish list and you know, I want this and I want that, we've got to be really judicious with opening the purse strings.'",
        "'speaker_0': 'But I'm I'm I'm pleased with this. I remember.'",
        "'speaker_6': 'Matter of fact, I just had one more request here that I forgot to bring up because. Write it down on paper. Is we had we have a contract with public safety that requires that it has a contribution into the OPEB fund.'",
        "'speaker_6': 'And there was a and I couldn't could not find it. And I was going to ask the city clerk for but I didn't I didn't make the request. Is there was a projection of the effect of the city's contributions and the employee contributions over time?'",
        "'speaker_6': 'To lower the OPEB liability. And I think it would be worth when we have the discussion with the PERS discussion to look and see. Lining up without those contributions versus with them where we are without the 6 million contribution and the 5.1 million contribution where we are.'",
        "'speaker_6': 'Because I think we need a graphic or I need a graphic actually, and I think the public would benefit from a graphic as well. That shows the difference between had we not. Put that in the contract versus. Oh, because.'",
        "'speaker_6': 'City manager Russo projected it all out and convinced me that this was a good deal and to others. But I think we need to see how is that actuals are tracking against the projection. I would like to see that the season needs to be adjusted or we have to take a different tack.'",
        "'speaker_6': 'The same thing with our contribution, even though this is the second contribution. In this budget. It would be worth seeing how it would have been if it didn't do it and then practice in the future. It would actually.'",
        "'speaker_6': 'Because there is quite a bit of wiggle room when you're talking about. A $31 billion delta between what was projected in 2013 to what's actual. That's a big, big. Space when you talk about the difference between. Actually.'",
        "'speaker_4': 'The other thing, we've had some initial analysis from our CalPERS. Our financial expert and. They are showing. It depends on how much you put in, but also how long amortization period is. And then for each one of those options, it says basically how much the city would save in our CalPERS contributions every year and the shorter the'",
        "'speaker_4': 'distance or the the more we save. But you look at the long term, we save more for the longer term. So it's it's a tough decision for the council and for staff to sort of figure out which is the best option.'",
        "'speaker_4': 'But we'll bring all those options.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'We're.'",
        "'speaker_8': 'I don't need to say anything. Thank you.'",
        "'speaker_0': 'So I would have liked to have seen some money allocated for the gene screening, open space park parcels. I think that that's important to make those connections. I think we know that's going to be coming along and I am happy to see that we're going to be bringing back some of our library, our cuts that have been'",
        "'speaker_0': 'cut in the past. I think that our community will greatly benefit from having greater access to the library. I disagree with funding so much from well, I did not vote for the public safety contract. I think that that contract is not sustainable fiscally.'",
        "'speaker_0': 'And I think that at this point we are. Until we address that issue long term, we have a serious problem and we can which council is doing is setting aside half of the excess reserves to address the pension issues.'",
        "'speaker_0': 'But I think that's as long as we until we do greater work on the contract, which won't be until 2022 or something. I forget what it was. It was a six year contract. I think that this is given the priority of addressing the pensions and the public safety contracts that we will have these unfortunately, we will have'",
        "'speaker_0': 'this issue of not being able to do as much for the other things that are important to our community, such as our parks. So do we have a motion about. Okay, did you. You did once we.'",
        "'speaker_2': 'There's a couple of things.'",
        "'speaker_3': 'I think, you know, I would like an update as to once we do have the estimates for the parcels to hear back in terms of what that looks like. The cost that we could be looking at. And also a progress report in terms of if there are grants out there.'",
        "'speaker_3': 'I know Amy's working on it. But I think that it doesn't seem like it's quite ripe yet since we don't know what the actual costs are going to be. I would also like to say that I think there's a lot of things, you know, in a lot of ways we ask departments to kind of bypass putting in'",
        "'speaker_3': 'certain asks. Right now, we're being we're trying to be as fiscally conservative as possible to prepare for the future. But I also think that as elected officials, when we look at what the asks are of the employees that we have who are providing all of the services that people value in our city, whether it be the libraries'",
        "'speaker_3': ', the parks, public safety, that if we're going to ask employees to make contributions to health care premiums and to their post-employment benefits into their pension or a portion of their pension that we at least think about what we're doing is elected officials relative to the benefits that we take.'",
        "'speaker_3': 'And currently, I think we are we do not have to pay even a penny of our premium. And so it's something that, you know, as we look at future budgets, I would like to see what that could be.'",
        "'speaker_3': 'And I think it's an important statement to make and it's something that we can do. So. It's something I would like to look into. At least.'",
        "'speaker_0': 'Though, if we're going to be looking at that, then I'd like to look at our pay. Because if you look at our pay, I think we are I'm not sure if we have any employees that are lower paid than the council.'",
        "'speaker_0': 'And my understanding is that we are all paid at the rates that were established in the charter back in like the seventies and because it did not include any cost of living increases. It's been frozen for years. So if we're going to bring back our you know, but but a vice mayor suggested looking at the health care'",
        "'speaker_0': 'costs, then I would also want to look at our pay and see and and see where we are in regards to some of these employees. Because, honestly, I think some of the employees are significantly paid more than us.'",
        "'speaker_0': 'So it's very different scale, very different. Member Ashcraft, thank you. Maybe we need a better union to represent. Yeah, maybe we do. That's a good point. I would just like to say, you know, as in life, you play the hand you're dealt.'",
        "'speaker_0': 'I mean, if we were starting from scratch, we might might do things differently. But right now, I think we have put together a very responsible, responsive budget that we're not waiting until we renegotiate contracts because a previous city manager put in place some mechanisms to start paying down these person OPEB liabilities.'",
        "'speaker_0': 'I think it would be shortsighted and even irresponsible if this of this Council not to move forward with the allocation. And it wasn't my idea. I heard it from the city manager of Concord, and it just sounded so smart that the Council adopted this policy of at least 50% of their budget surplus goes to pay this down'",
        "'speaker_0': '. We are not alone. Alameda. I mean, we're unique in so many ways, but not when it comes to the state of our budget. So, you know, good for us for for taking a strong stand and getting started. We're not going to undo this overnight, but I think we're making some very smart progress toward it, and I anticipate'",
        "'speaker_0': 'that we will continue to do so.'",
        "'speaker_6': 'But to make a motion to adopt the resolution approving and adopting the civil operating capital budget for 17, 18 and 1819 and approving adopting the successor agency to the improvement committee. Budget for the same dates.'",
        "'speaker_0': 'ASecond do you want to. So there's like four different things here. I think he's just going to do this. Forget my first paragraph. All right. So we have a motion and a second. All those in favor. All right, I'll take the second one.'",
        "'speaker_0': 'Oh, sorry. Okay, so I'm going to post those for motion carries for two one. We won't do the second one. So I would like to move. Adoption of resolution approving workforce changes in the Recreation and Parks Department, Public Works Department, Community Development Department and Information Technology Department.'",
        "'speaker_0': 'All those in favor I motion curious unanimously.'",
        "'speaker_5': 'Conclude the third one.'",
        "'speaker_0': 'Yes.'",
        "'speaker_8': 'I'd like to move to amend the Pension Rate Stabilization Program and other post-employment benefits funding policy.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'All those did he finishes since.'",
        "'speaker_2': 'He it's just.'",
        "'speaker_0': 'All those in favor I suppose motion carries 4 to 1 base. Mary, you're next. Now, if you'd like can. See the most recs that.'",
        "'speaker_3': 'The city manager or I'll make a motion to direct the city manager designee to deposit 6,043,000 of committed general fund fund balance plus amounts authorized by the Council in current and future budgets into the public agencies. Retirement Services, PA's Post-employment Benefits Trust to use for pre-funding of pension and other post-employment benefit obligations.'",
        "'speaker_0': 'Second all those in favor by those I oppose or motion passes 4 to 1. So it's my understanding that so the city manager communications we go back to that did you have any you.'",
        "'speaker_1': 'Can adjourn this meeting and.'",
        "'speaker_0': 'We okay so I'll now adjourn this special joint meeting of the city council and successor agency to this Community Improvement Commission as a CIC. And now we will resume our prior regular meeting. Thank you. Thank you. So then I can go back to the City Manager Communications.'"
    ],
    "Mayors Nominations for Appointment to Various Boards and Commissions.": [
        "'speaker_0': 'And it's because I'm only nominating it'll come back where council have the opportunity to them but we're not voting tonight so for that so for the nominations there's only there's three of the different boards and committees that we've been able to interview for it to date.'",
        "'speaker_0': 'Public Utilities Board are being nominating the reappointment of the incumbent and McCormick. Grant Review Advisory Committee. There are two seats open. I'll be reappointing the incumbent, Christopher Griffiths, as a tenant position and the housing provider of being nominating Sarah Murray.'",
        "'speaker_0': 'And then for a social service human relations board, there's one seat and, um, of the nominating Claudia medina. Those are the three. Maybe those are the three. I'm sorry.'",
        "'speaker_5': 'Okay.'",
        "'speaker_8': 'And on page four of.'",
        "'speaker_0': 'I don't think we have done the interviews on that one yet. Those we haven't.'",
        "'speaker_2': 'Finished interviews on.'",
        "'speaker_0': 'So, no, there's a lot of there's a lot of these that so and I do want to share that we always have a lot of people apply, and it's a tough decision. And those are my nominations. And now I will adjourn the meeting at 1242.'",
        "'speaker_0': 'But is it now? It must be Wednesday, June 7th. Thank you and good night, everyone.'",
        "'speaker_6': 'Thank you.'"
    ]
}