{
    "First Quarter Financial Report for FY 2014-15. ": [
        "'speaker_3': 'Good evening. Excuse me. Good evening. This evening I'm presenting to you the first quarter of fiscal year 1415 financial report for both the city and the successor agency. And you have had the report for a while because this was carried over from a previous meeting.'",
        "'speaker_3': 'So I want to just briefly review some information with you that's background so that you have an understanding of how these reports come to be and when you will see them because they happen every three or four months.'",
        "'speaker_3': 'Oh, I know.'",
        "'speaker_2': 'Yeah, yeah.'",
        "'speaker_3': 'Yeah. If you can do it, be better. I don't push and talk well. So the financial reports are presented quarterly to the city council and the successor agency of the Community Improvement Commission. The first three quarters are unaudited.'",
        "'speaker_3': 'That means simply that no independent auditor has looked at the numbers. It's simply our own internal review, what we see as being correct. The fourth quarter has some review by independent auditors, but it's not the final audit numbers.'",
        "'speaker_3': 'So we get the report ready. We get all the documents ready. The auditor is looking at all of our numbers. And so we kind of have an idea about what they think about how we're reporting things. So we include any big items that they found if if there are any.'",
        "'speaker_3': 'Fortunately, we haven't had any big ones lately. The fourth quarter has a look at where we think we're going to end up for the year. Are three components to each report the general fund, revenue and expenditures, capital projects and the summary of all funds.'",
        "'speaker_3': 'So the revenue and expenditures are a comparison to budget and a comparison to the same quarter of the prior year that and we presented in a graph form as well as statistical data just so that you have a way of looking at it and two different aspects.'",
        "'speaker_3': 'The summary of all funds provides you with year to date results. Those will not be the final fund balances. They are the fund balances as of the end of that quarter. So in the first quarter, the property taxes are still our largest item and we receive them only twice a year in December and in June.'",
        "'speaker_3': 'So our first quarter report is really not a good indicator of that revenue stream because of the timing. This is typical. That's how the county tax collector pays us. And so we know that ahead of time. And we just know that we really don't expect it until either late December or early January.'",
        "'speaker_3': 'Expenditures this year. In the first quarter, the spending rate is at a rate slower than prior years, but within the budget constraints. So it's slower but still under budget. Next slide. I've reproduced here the the schedule that appeared in the attachment to the report.'",
        "'speaker_3': 'And the first you will note that the first quarter revenues are within expected results. The property taxes are received in late December or early January and then again in May and May or June. Sales tax revenues are one payment behind in this particular quarter, but the collections are higher than prior year.'",
        "'speaker_3': 'We have to do a little bit of analysis to compare how many payments we've gotten from the state and how do those payments compare with one another. Utility users, tax collections are slower than expected. And I must tell you that utility tax users tax revenues are dropping.'",
        "'speaker_3': 'And we are concerned about that. We are. We have unique services who are doing analyzes of which vendors are paying how much and for what. And so we know that in future years, we will not be able to count on as much of this revenue as we do currently.'",
        "'speaker_3': 'We believe that we need to stay in tune with what the federal legislation and state legislation are, how they are impacting this revenue source for us. The franchise tax collections are on target, and that line is a combination of many different kinds of franchise taxes.'",
        "'speaker_3': 'The transfer tax appears to be ahead of schedule, but it includes approximately $250,000 in one time payments for sale of large buildings. So a building that is sold for over $2 million will produce $200,000 of revenue. For us, though, we've looked at how many of those buildings that are large value are being sold and taken that into'",
        "'speaker_3': 'account when we look at this and do the analysis. So it's on schedule because of that, those big one time payments. The transient occupancy tax is ahead of schedule as local hotels and motels are experiencing higher occupancy rates.'",
        "'speaker_3': 'This is we have not been able to determine that it's rate dependent so much as it is occupancy dependent. So more people paying the same rate gets us more money. Business licenses are renewed each July, yielding almost all of the revenue in the first quarter of the fiscal year.'",
        "'speaker_3': 'That's just the cycle that it takes. And so we know each year when we look at it that we expect to see by the end of the first quarter close to 100% of what we estimated for the revenues, departmental revenue.'",
        "'speaker_4': 'May I just hop in here and say that I want to actually do a shout out to the Finance Department because our increase in the business license, taxes and fees is due largely in part to some really concerted, very concerted effort on the part of staff to go after the collections and stay on it.'",
        "'speaker_4': 'So whereas something like a transient occupancy tax, we're glad that people are coming and staying in Alameda and we've built more hotels. But this was really the work of staff and I just want to commend you for it because it's a big increase from one year to the next.'",
        "'speaker_3': 'I will pass that along. Departmental revenues. Are those revenues unique to each operating department and they are on target. Interest in rental income is behind expectations, but we know that it catches up in the second quarter. It's just a timing issue.'",
        "'speaker_3': 'The cost allocation is those charges to other funds for services provided by the general fund operating departments, and it is on target. Transfers and other fees are administrative costs transferred in from assessment districts or other special revenue funds.'",
        "'speaker_3': 'So is all of the administrative services provide service to those special assessment districts? They are charged a fee and that's counted as a transfer in and that's on target. But the next slide, please. General fund expenditures. We are on target for the general fund expenditures.'",
        "'speaker_3': 'The General Government, City Council, city manager, city clerk, city attorney are spending at a slower rate in the first quarter. Administrative services, finance and human services are spending at a slower rate as well. Police spending is slower than anticipated as vacancies create the savings.'",
        "'speaker_3': 'I are spending is slower in the first quarter but is on path to be at budget in the next quarter. Recreation and parks is slower than anticipated but will be close to budget in the next quarter. And public works is slower than anticipated due to vacancies creating savings and the transfers out support other functions and are on'",
        "'speaker_3': 'target. That's the transfers out to the library, the recreation fund, those kinds of things. Debt service funds. Capital maintenance projects are under budget. This is typical in that first quarter of the year because we're just getting started with some of those projects.'",
        "'speaker_3': 'And so they're in the planning phase, which is the lesser expenditure. His projects don't follow an even expenditure path as projects are in different phases at different times. The Fund Balance summary shows that the subtotal by each fund group, which have similar characteristics, and the internal service fund group is represented by working capital, not the fund balance'",
        "'speaker_3': ', and that is the usable portion of the available fund balance. The successor agency has unique reporting requirements. These were imposed by the law which closed redevelopment agencies. Total debt is included. The total of outstanding debt is included in each fund and is therefore it creates a negative fund balance.'",
        "'speaker_3': 'I don't want you to think that we're spending money or that we're creating something that is untoward. It is what the state expects us to do. Revenues are tax increments and are received in December or January and May or June, just like other property taxes.'",
        "'speaker_3': 'So in total that's we are in a good position at the end of the first quarter and I know that there have been questions asked and I will try to help answer any questions that you might have this evening.'",
        "'speaker_0': 'We have any speakers on this item? No speakers. Right. So council members. Questions, comments.'",
        "'speaker_2': 'And Ambra.'",
        "'speaker_4': 'Oh, I was just going to recommend that we accept the report if there were no word limits.'",
        "'speaker_0': 'Is to remember de.'",
        "'speaker_5': 'Great. I just want to make a comment on the general fund expenditure slide. You'll notice that that at the top there's a reference to 25% complete. And just basically what that really refers to is three months out of 12 months is 25%, three divided by 12 because 25%.'",
        "'speaker_5': 'So when you look at this slide and you look at the percentage of the budget on all of the cost centers, whether it's police or recreation and parks or whether it's public works, what the finance director means by coming in slow is that we are spending less than 25%.'",
        "'speaker_5': 'Right. So there is so that's actually good news. That's not to say, you know, in a subsequent fiscal month, our fiscal quarters, that we're going to stick to 25%. But in general, each quarter, you should each quarter should represent 25% of your budget.'",
        "'speaker_5': 'Yes. On the expenditure side, because 25 plus 25 plus 25 plus 25 equals 100%. So what you see here is good work on the part of city staff, the city finance department and the city manager's office as well as everyone else, and doing their best to hold the line.'",
        "'speaker_5': 'The thing that really caught myself eyes on the revenue side is the transient occupancy. Granted. Overall, the transient occupancy is roughly $270,000, or roughly 18% of our overall revenue side of the budget. But compared to the previous year, it grew by 50% from roughly $180000 to $269000 now.'",
        "'speaker_5': 'And that's a great it's really good news because it means somehow people are finding Alameda to stay here. I suspect what's really happening is that as the economy is getting better, particularly in the Harbor Bay Isle area, more and more people are staying at the at the motels hotels, but they're resulting in this increase, this bump up'",
        "'speaker_5': 'in the transient occupancy tax. So that to me, that was the thing that really caught my eye, as did the sales tax. And actually in a later agenda item, we dug in deeper into the sales tax item. So I'll hold withhold my discussion there.'",
        "'speaker_5': 'But again, when you look at where that what part of Alameda is driving the sales tax number of $737,000 for this quarter and for quarter four for the first quarter. What's driving it is the area of the Harbor Bay Isle area, the commercial area, our Bay Parkway.'",
        "'speaker_5': 'Exactly. That kind of tells you something about the type of sales tax that's occurring, i.e. business of business and what kinds of, you know, policy implications that has.'",
        "'speaker_2': 'Right.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'And I do have a question on the staff report. It referred to sales taxes are significantly higher than for the same period partially and due to continued recovery of the economy, but also a one time favorable adjustment of $313,000.'",
        "'speaker_0': 'Can what was that adjustment so frequently?'",
        "'speaker_3': 'And this is one of the reasons why we hire a consultant deal to review the raw data from the Franchise Tax Board. And what they look at is not just who's what we're getting paid, but are we getting paid by all the people we should be getting tax money from.'",
        "'speaker_3': 'And when they find a company located in Alameda making sales but reporting those sales at a location outside of Alameda. And this happens when companies move. It's not intentional. It just happens. They approach Franchise Tax Board who contacts the payor and they get an adjustment made.'",
        "'speaker_3': 'The payor gets a new tax number that's by this location and they report the sales accurately. Well, when that happens, they determine what date it started and then give us an adjustment. So we get those we get some money practically every quarter.'",
        "'speaker_3': 'But this time it was a particularly large amount.'",
        "'speaker_0': 'Thank you very much. I appreciate that. Right now, do we have a motion?'",
        "'speaker_4': 'Okay. I would be happy to recommend that we accept the first quarter financial report for the period ending September 30, 2014.'",
        "'speaker_0': 'All those in favor. I oppose extensions. Motion carries unanimously. Thank you and no other agenda items. Comments. I will adjourn the S.A. CIC special meeting for this evening and now we will open our regular city council meeting. Roll call.'",
        "'speaker_1': 'Council Member States. I'm here as the guest. Here. Here. Here. Mayor Spencer. Here. I present.'"
    ],
    "Quarterly Sales Tax Report for April-June 2014. (Continued)": [
        "'speaker_1': 'Six A recommendation to accept the quarterly sales tax report for the period ending September 30th, 2014, collected during the period April 1st, 2014 through June 30th, 2014.'",
        "'speaker_3': 'Good evening once more. This is another report. Excuse me. All of a sudden, my ear just went. Hmm. This is another report that was carried over from a previous meeting. Well, we report to you on a quarterly basis the sales tax revenues.'",
        "'speaker_3': 'Now. The. It is our fourth largest revenue source and it is important that there is attention given to the various elements and various impacts upon sales tax revenues. We should also be aware of the lag sales occurring in the one quarter are not our revenues received in the next quarter.'",
        "'speaker_3': 'So when we talk about this, we're talking if we're talking revenues there, they come later than the actual sales and we need to be aware of that as we talk about it. Most. There we have hired HDL companies to receive confidential data from the Franchise Tax Board and to provide HDL provides various analyzes to the city.'",
        "'speaker_3': 'These analyzes include the year over year change by major industry group historical trends over time by major industry group historical trend for the city as a whole. Historic trends by geographic areas and the geographic areas I just want to footnote were originally chosen by the City Council and we keep adding as we see new shopping areas, new'",
        "'speaker_3': 'areas developing. So we may want to revisit those at some point and decide if those are really things that we want to track. The surplus gap comparison. This really shows you how much sales tax dollars alameda alameda and spend in alameda versus what gets spent in other cities.'",
        "'speaker_3': 'It's referred to as the leakage report. It also has county wide comparisons, statewide comparisons and a general economic analysis of the nation, the state and our local east bay. This is a one of the analysis that we receive is called the 13 quarter trend.'",
        "'speaker_3': 'And it shows that over the 13 quarters since the most recent 13 quarters, we are trending up and that's good news. But it also tells us that when there is an economic downturn, this is a very sensitive and very volatile piece of revenue and we need to pay attention when that starts to happen.'",
        "'speaker_3': 'This. The next slide tells us about the per capita sales. This is the sales tax revenue per pop, per piece of population per person in the city of Alameda. And we still have the lowest sales tax revenue per capita as other major cities in our county.'",
        "'speaker_3': 'And we recently changed the county, the cities that we were looking at in order to be more comparative with those that we felt had similar population sizes as well as similar shopping, not just our neighbors geographically. So we are now looking at Oakland while they have.'",
        "'speaker_3': 'You know, bigger population. It still is interesting to look at. Per capita what they are generating and sales tax revenue. And as you can see, Alameda is still at the very bottom.'",
        "'speaker_0': 'So I'm going to ask a clarifying question. In the past, have you included Piedmont?'",
        "'speaker_3': 'No. This is one of the first times that we've included. Did we include people I can't know?'",
        "'speaker_1': 'Piedmont is not included. We have.'",
        "'speaker_0': 'Not now. I said in the past, that was my question.'",
        "'speaker_3': 'We haven't in the past looked at Piedmont, but we have started getting some of that data so we can start including Piedmont as a comparison if we wish to. But it's not. Wasn't high on our list of comparatives.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Madam Chair. May I make a comment? Actually, the two cities that we're looking at revising is Albany and Richmond, and the cities that we're thinking about supplanting it with is. Um. Um.'",
        "'speaker_3': 'Elsa Prieto.'",
        "'speaker_1': 'No, not. No. Sorry. Walnut Creek. Yeah.'",
        "'speaker_3': 'And Pleasanton.'",
        "'speaker_1': 'And Pleasanton. So comparable sized cities. Comparable. More comparable median income. Because Albany is much smaller than than we are. I mean, yeah, substantially smaller. And Richmond's demographic is much different than ours.'",
        "'speaker_0': 'Okay, so we can have a discussion on that. Right now, I just want to leave it to our clarifying questions. Thank you.'",
        "'speaker_3': 'So just to reiterate that the quarterly sales tax is a lagging indicator, but it's worth tracking because it is one of our four largest revenues. And we can as you look at the written report, you see that there are geographic reports and industry reports and some other charts that are included.'",
        "'speaker_3': 'So we can alter those to some extent. We do have a limit on the quantity of items that we can report, but we can alter them. So I wanted to point that out to you this evening so that if you choose to look want to look at different comparisons, we can start that process.'",
        "'speaker_3': 'And that concludes my presentation. I'd be happy to answer any questions that you might have.'",
        "'speaker_0': 'And we have no speakers. Correct. All right. Member Ashcroft, did you want to start or.'",
        "'speaker_4': 'Thank you, Ms.. Boyer, for all the presentations you're going to do for us this evening. So I you and I'm looking at the staff report now on page two. The and again, there is a lag in the actual collection of these.'",
        "'speaker_4': 'The reporting follows the the actual collections. So the South Shore Center, I was surprised to see a drop of 2% over the past year because it seems like so many businesses have been added. But is this just a matter of not having the most up to date information?'",
        "'speaker_3': 'So remember that these are the sales that took place in the period ending September.'",
        "'speaker_4': 'No other way from April to June.'",
        "'speaker_3': 'April to June.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'So is that really a high sales season?'",
        "'speaker_4': 'It's not the holiday shopping season. Exactly.'",
        "'speaker_3': 'Or back to school are back. Those are the two real high points at a retail establishment that's mostly what you have at South Shore is retail rather than anything else.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'Generally, I see this as very positive. I realize that it is not only cyclical, it's dependent on the economy. And when consumers are feeling more confident, they are more confident about spending. And there is also. It's in this report.'",
        "'speaker_4': 'I believe the the fact that brick and mortar stores now have competition from the e-commerce. And yet there is a mechanism by which, yes, we are recovering.'",
        "'speaker_3': 'We share in what's called the county pool. So what when a a. When there is an online sale and there is no brick and mortar presence in our in our city, the sales tax accrues to the county pool, and that's shared among all of the cities in Alameda County.'",
        "'speaker_3': 'So we get a share of that pool and that is increasing over time.'",
        "'speaker_4': 'And then thank you. Which which is important for us to capture that. And then with regard to now, I'm on exhibit one and there's the per capita sales tax surplus gap comparison that you referred to. And I did also note the footnote at the bottom of this graph, the last sentence that says this The information is provided'",
        "'speaker_4': 'only as a starting point in identifying potential sources of sales tax loss and should not automatically be interpreted as an expansion or levering leveraging opportunity without more detailed analysis and assessment. And the the one example that just comes to mind, because it's been discussed in the community is somewhere on this table, I do believe, is the fact'",
        "'speaker_4': 'that we lagged in the gas station sales of gasoline in the city. And so we've recently added a gas station as you come in from the tube. And even though I certainly remember many discussions by this body previously, it apparently didn't get out to the whole community because mostly I'm hearing complaints from people about why are we'",
        "'speaker_4': 'looking at a gas station as we come out of the tube? And I think there's two answers to that. One of them is Sean Roskam in of Catullus promises me that that screaming from landscaping and possibly a fence even is going to help to obscure that view a little and make it a little more palatable as you'",
        "'speaker_4': 'come through the tube. But on the other hand, that's what sales tax generation looks like. We just did a couple of weeks ago the ribbon cutting at the new Safeway out at Marina Village, which is quite lovely. And already I understand we're not seeing it in this report, but that the sales tax numbers from Target that's been'",
        "'speaker_4': 'up and running now for more than a year and some of the other retailers, I'm sure that Safeway is going to do a great business because it's the first grocery store that far out on the island. But this this comes with, you know, it is development.'",
        "'speaker_4': 'We've heard some negative things said about development, but this is part of what development looks like.'",
        "'speaker_3': 'To comments one grocery stores don't generate a great deal of sales tax. Most of what they sell is not taxable. It it it's hard to tell you exactly what percentage because each store varies by what they have to offer sales tax on gasoline because the price is dropping where that's going down.'",
        "'speaker_3': 'So it's very cyclical right now and not something that is going to really boost our sales tax revenues over the next three or four quarters, I would say.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I smell.'",
        "'speaker_6': 'A question. Thank you for the report. And stepping us through. It is good to have the allies to help guide. But I wanted to go back to the $313,000 that was recovered a basically to the positive of Alameda.'",
        "'speaker_6': 'Is that going to to stay because that business is here and now reporting here so will will get their sales tax not necessarily that number will get their sales tax. Or is that sales tax spread over a number of years and are in arrears?'",
        "'speaker_3': 'I'm not sure of the answer because I will have to do some research and give you an answer later.'",
        "'speaker_6': 'Because if I look at the total quarter. Um, and I don't know how that how that figure balances, but if that figure, if that $313,000 is part of the $460,000 from Harbor Bay Parkway, is that correct? On this is page two.'",
        "'speaker_3': 'Yeah, I'm not I'm not certain.'",
        "'speaker_6': 'But to see how that. Yes. To see how that. If that's a one time or.'",
        "'speaker_3': 'Is it.'",
        "'speaker_6': 'Ongoing or is it a we expected to see some of that continue out to. If you could clarify that in the next quarterly.'",
        "'speaker_3': 'Yeah, I can clarify it. And then I can tell you that typically when they find an error, they give us all of they go back as far as the beginning of the year. They give us that money and then make sure that it stays corrected from that point on.'",
        "'speaker_3': 'And how much are we going to get? I don't know at this point.'",
        "'speaker_6': 'Not going to look all the time when we were on the other end of that. Yes. Where a significant amount of money went the other way.'",
        "'speaker_2': 'That's true.'",
        "'speaker_6': 'So I think if we can make sure that we flagged that in the next report. Yes. See where it lies. That's all I have. Thank you.'",
        "'speaker_0': 'Member de SAC.'",
        "'speaker_5': 'Right. Well, thank you very much. Thank you very much. Uh, interim finance director Ms.. Borja. Really appreciate the presentation. You know, I think from the big picture of things, the reason why we sales tax is important certainly is it's one of the revenue sources by which we finance the quality of life that we all hope to have'",
        "'speaker_5': 'here in Alameda. So it's important. And unlike a number of other revenue centers, the sales tax is one which you can more or less plan around in terms of how you design and strategize with regard to your built environment, but also plan with regards to, you know, what kind of business attraction, business retention this is expansion strategies'",
        "'speaker_5': '. So there is there is a lot of wiggle room when it comes to sales tax generation. So for that reason, it's a right place of focus. When I look at the sales tax bar chart that you had where you have like is this as an industry and in general consumer goods and then restaurants and hotels.'",
        "'speaker_5': 'The bar chart where you had kind of the dash colors versus the solid colors. What's really interesting is when you look at business and industry, it's great to see that it went from $500,000 in sales taxes to a roughly slightly over $600,000.'",
        "'speaker_5': 'But, you know, to staff's credit, we all understand that when it comes to business sales taxes, that, you know, it is highly volatile. More sales taxes, as it is, is a volatile revenue source business as as business. The business sales tax is that much more volatile business can leave or they can maybe change their their place from'",
        "'speaker_5': 'which they conduct the sales. So so I think rightfully, city staff is recognizing that while our sales taxes in general have increased, what has been driving that is perhaps a business to business sales tax. So on the expenditure side, just because we have sales taxes go up by what, 200,000, $300,000 on the on the revenue side, on'",
        "'speaker_5': 'the expenditure side, I know that staff isn't going to bake into cake 200 to $300000 more in expenses. So so I think, you know, staff is certainly on the ball there. I think there's a lot of opportunities that I think we as City of Alameda further contemplate how to utilize our economic development manager, Darrell Doan.'",
        "'speaker_5': 'There's a lot of places that I think we should be excited about. So. So it is true. We're an island. And by virtue of being an island, our sales tax per per capita numbers are going to be lower than many other places.'",
        "'speaker_5': 'But there are places where where we can mobilize. I mean, just by bringing right speed, for example, if we have right speed, make sure that when they sell a truck, make sure that we that the sales tax comes to us.'",
        "'speaker_5': 'And it's and as we plan Alameda point, maybe we should look for the you know make sure to prioritize those kind of businesses. And I'm sure that city staff is as is Jennifer Ott. And as we make our early discussions with prospective and developer Alameda Partners, I'm sure they'll keep that in mind as well.'",
        "'speaker_5': 'But, you know, there are strategies that we can do also that are on a smaller scale when it comes to sales tax retention. You know, we've we have a lot of vacant spaces in Alameda and with with some of those vacant spaces, perhaps we can, you know, have Darrell Doan and city manager staff think about, you know'",
        "'speaker_5': ', what kind of pop up strategies that we might employ, pop up retail and do that. In a intentional manner. And finally, one of the things that we need to also do is, you know, figure out ways to get, you know, residents to make sure that that they spend here and in town, you know, and when they can'",
        "'speaker_5': ', you know, maybe, you know, the special dress or the special suit, you know, maybe they'll go to San Francisco or Walnut Creek for that. But perhaps for a lot of a lot of other items, you know, that they're purchasing elsewhere, they'll do so here.'",
        "'speaker_5': 'One final point on on grocery stores, because grocery stores are an important part of a shopping center for obvious reasons. And while they are not a sales tax generating generally, maybe 30% of their sales is is taxable. Grocery stores are important in that they drive foot traffic.'",
        "'speaker_5': 'They drive customers to come. And that's why when you look at all the different shopping centers that we have, practically everyone has an anchor. Anchor store is anchored by by the grocery store. So so it is an important part of an overall economic development strategy, even if even if they're not as high tech generating as a target'",
        "'speaker_5': '. But final point, it's great to have target here. We need that kind of sales tax. But we also need to think and I think we're on we're moving in that direction. We think about, you know, things like the business to business sales taxes.'",
        "'speaker_5': 'We need to think about small scale pop up strategies. So I look at this as data that is a beginning point for a wide range of strategies, and that means a lot of exciting times with our Darrell Dunn.'",
        "'speaker_3': 'And we do include him when HDL comes to review the quarterly information, Darrell and his staff are included in those discussions and they have an opportunity to ask lots of questions and to secure more data. So it's an ongoing process.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_8': 'Just a couple quick questions. Again, thank you for the report. And, you know, doing all the reports today, it's a lot of work to generate this information and gather at all. So on the the geographic area, you know, where would somebody at home or someone like me sitting up here find the sales tax revenue for target Alameda'",
        "'speaker_8': 'landing. Is that is that so link or I'm sorry all other areas.'",
        "'speaker_3': 'It's in all other areas currently but we have added Alameda landing and you'll see that in the next report.'",
        "'speaker_8': 'And then even if you take out the 85,000 year over year for for Target, you know, we still had some good increases. What's going on with like north of Lincoln and Webster? Do you know that was one that actually had a deal?'",
        "'speaker_3': 'I don't know. I would have to do some research on that. Generally, when we get this data, it's accumulated from other data. And so you have to really dig through the. All of the information in order to pin the exact where the changes occurring and why.'",
        "'speaker_8': 'And then on the I guess it was exhibit one, the the graph. It's per capita. So that's the total per capita. So a place like San Leandro, which has a higher tax rate, you know, would by virtue of that, have a higher per capita.'",
        "'speaker_3': 'If they have a higher sales tax rate. Right.'",
        "'speaker_8': 'So it might be helpful in the future, you know, kind of compare what the sales with the sales rates on the yeah.'",
        "'speaker_3': 'If if they have a general sales tax rate, they may have a sales tax rate that is to support a specific bond issue and therefore should not be reported in this. But I can check and make sure.'",
        "'speaker_8': 'Yes. Just so you know, we're comparing apples to apples. Yeah.'",
        "'speaker_6': 'So cars.'",
        "'speaker_8': 'Cause they do sell cars.'",
        "'speaker_4': 'Customers have a higher tax rate.'",
        "'speaker_6': 'So and I think that's an important point because when the car dealerships left Alameda ten years ago, it was a precipitous drop.'",
        "'speaker_8': 'Yeah, you can see it on the the green line or whatever.'",
        "'speaker_6': 'There you go. Yeah. Thank you.'",
        "'speaker_0': 'Member de SAC. Oh, I.'",
        "'speaker_5': 'Just wanted to quickly say to that. My understanding is Peet's Coffee is interested in Webster Street. Did I read that correctly?'",
        "'speaker_7': 'Yes, you did.'",
        "'speaker_5': 'Well, that is exciting news. I just was, especially for it. Sales tax generation and foot traffic generation activity. Thank you.'",
        "'speaker_7': 'We've been working on them for about 18 to 24 months. Great.'",
        "'speaker_5': 'Awesome, wonderful. Thank you.'",
        "'speaker_4': 'Clarification question.'",
        "'speaker_0': 'Member Ashcroft.'",
        "'speaker_4': 'Thank you. I'm wondering if staff could just clarify. Councilmember O.D. asked where we would find the target sales tax numbers. And I think the answer is, even when those reporting periods come up, we won't. And I don't think we'll see.'",
        "'speaker_4': 'CVS and some others could bring that to.'",
        "'speaker_3': 'Us in order to get access to the Franchise Tax Board data, we have to treat it as confidential information. It is not even resident on our computers, so that's why we hire HTL. They we give them permission to get our data.'",
        "'speaker_3': 'We do not have nor can we release any information about specific taxpayers. That's what we have to agree to in order to get the detailed information. We can tell you in general, big categories like service sectors, or we can tell you by geographic areas.'",
        "'speaker_3': 'But and if we have something that's Alameda landing, you know, all the stores that are there, you have to make some assumptions.'",
        "'speaker_8': 'Know that was the question. Are we going to be able to identify Alameda landing in the future?'",
        "'speaker_3': 'Yes, we we have already asked for that, right?'",
        "'speaker_8': 'Yes, you have. Thank you.'",
        "'speaker_0': 'And I appreciate the report. Thank. Thank you. So in regards to sales tax, I know there are many elements that do shop on our historical districts and our historical districts and sales taxes, sales tax. So you can also continue to shop and Park Street, Webster Street.'",
        "'speaker_0': 'Of course, we have South Shore. And for me, in regards to whether we have another gas station, we have gas stations on Webster already. We do have other gas stations. And I will encourage people to shop all of our districts to our historical districts.'",
        "'speaker_0': 'And so personally, I am concerned about the building of more retail. Retail provides low paying jobs. And as we saw earlier today, many people are concerned about low paying jobs. That would be nice to have and to attract and some there were quite a few people that referred to car sales and maybe that's not going to be'",
        "'speaker_0': 'coming back. However, I think entertainment quite often is more of a win win in regards to our meetings are very supportive of, from what I have seen, entertainment, restaurants, things like that that are of other ways of bringing in sales tax revenue.'",
        "'speaker_0': 'So thank you very much. Yes, sir. We'll have a motion.'",
        "'speaker_6': 'Please move that we accept the quarterly sales tax report I second.'"
    ],
    "Treasury Report for the Third Quarter of 2014.": [
        "'speaker_0': 'Okay. All those in favor I oppose abstentions. Motion carries unanimously. All right, next item.'",
        "'speaker_1': 'Recommendation to accept the Treasury report for the quarter ending September 30th, 2014. Don't go.'",
        "'speaker_4': 'Away.'",
        "'speaker_2': 'Sorry, but.'",
        "'speaker_3': 'Our office also manages the investment portfolio for the city in conjunction with the advice and consent of the elected city treasurer Kevin Kennedy. State law prescribes the requirements that we must that must be applied should a local agency governing body choose to invest unneeded cash and receive reports on those investments.'",
        "'speaker_3': 'Since the inception of this law, Alameda city councils have chosen to implement these requirements. The elected treasurer, Mr. Kevin Kennedy, chairs the Investment Advisory Commission Committee, which oversees the portfolio portfolio as managed by two investment advisors, Chandler Asset Management and Public Financial Management, Inc..'",
        "'speaker_3': 'These two firms report their management activities on a monthly basis as required by state law. The Investment Advisory Committee reports quarterly on the results as stipulated in the law. The compliance with the investment policy and the cash coverage for the ensuing six months.'",
        "'speaker_3': 'While the state law states that the report will be made within 30 days of the quarter, close Alameda Sunshine Ordinance precludes presentation until the second month after the quarter end.'",
        "'speaker_4': 'Could you just explain why that is? I read it about six times and I can't figure it out.'",
        "'speaker_3': 'So quarter end September 30th, we don't get the data until, well, almost to the middle of September. And then by then, the 27 days prior to a meeting date has already elapsed. So we can't get it in until.'",
        "'speaker_3': 'End of October, beginning of November.'",
        "'speaker_4': 'Help me understand the 27 days I thought.'",
        "'speaker_1': 'When staff reports are due first within hours.'",
        "'speaker_3': 'So it takes it's 12 days to be publishing. But then it's.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'More time.'",
        "'speaker_6': 'So. So it's not just the Sunshine Ordinance. It's the time that's required to prepare to comply with sunshine. Or is that correct?'",
        "'speaker_7': 'Yeah. The the new sunshine ordinance merely added to the existing procedure. The existing procedure has always been 15 days before it was you had 15 days you published three days before was 18. Now it's 27.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'I'm so out of it. Pardon me. Part of it is because every report, as you'll see as a review from the city attorney's office, the finance office, as well as the city manager's office. So a department prepares a report.'",
        "'speaker_7': 'It's got to be checked by three other people, three other departments before it actually gets published.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'We have.'",
        "'speaker_1': 'Your privacy.'",
        "'speaker_3': 'You're literally trying to find a way to make it work and it it just doesn't work. Calendars and we count it and it just isn't going to make it. Well.'",
        "'speaker_7': 'If I may.'",
        "'speaker_3': 'Yes.'",
        "'speaker_7': 'It does. It actually, I'm going to take issue with that. It does work. It's what it takes to make sure everything is being checked properly. Yes. It's the price we pay for having a longer system and triple checks.'",
        "'speaker_7': 'And that's part of why this city has very few problems in terms of giant mistakes being made, in terms of what's in a staff report.'",
        "'speaker_0': 'That these continue.'",
        "'speaker_3': 'Almeida's statement of investment policy was last updated in February of 2014. The first principle therein is the is safety of the portfolio. The second is liquidity, quick access to cash and finally yield. That is what the investment earns.'",
        "'speaker_3': 'But all of these principles must also comply with the limitations listed in state law regarding the type of instrument, the credit quality and the length of the investment. All of these limitations are intended to preclude the use of public investments in risky investments over long periods of time.'",
        "'speaker_3': 'The city's statement of Investment Policy is located on the city's website in the finance department with a special button in the lower right hand corner. This report before you this evening contained. As contents are determined by state law as well in the staff report, a short summary of the of the portfolio is displayed.'",
        "'speaker_3': 'The investment types are listed for most liquid to least liquid. Cash we can get right away, cash that we would have to sell an investment in order to get the money. Market value is provided by the investment advisers and reflects the market on the final day of the quarter being reported.'",
        "'speaker_3': 'It is compared to cost or book value for review purposes only. A negative number indicates that the market value is less than the book value. The average duration is the average age of the investments. 146 days divided by 365 days equals 1.22 years.'",
        "'speaker_3': 'The limit by state law is five years or 1825 days. To measure the performance of the portfolio. The U.S. Treasury bill rate is used as a comparison. In this case, the report that you have before you the portfolio performed about 0.03% better than better than the Treasury rate.'",
        "'speaker_3': 'The exhibit contains the detailed investments by Instrument. The advisory firms report on credit quality and the return for their individual portions of the portfolio. We divide the portfolio into short term and long term. Public financial management manages the 1 to 3 year terms and the Chandler asset managers the 3 to 5 year terms.'",
        "'speaker_3': 'So they they have different instruments and they look at different pieces of the market and try to make sure that their portion returns better than the U.S. Treasury bill rate. So in this first quarter investment report. You will see that there is a big number, but a lot of that number is restricted in its use.'",
        "'speaker_3': 'It's not available for unrestricted uses of the general fund. The majority of this is debt service or other special revenue funds. Those funds are run. Are those funds not totally restricted? Are in the general fund and the internal service funds.'",
        "'speaker_3': 'Cash is managed on a daily basis with the goal of making certain that six months needs payroll accounts payable debt service will be met. Historically, Alameda has had two investment advisory firms. And both firms must comply with the investment policy, which includes the types of investment, the credit quality and duration as stipulated in state law.'",
        "'speaker_3': 'The policy also prohibits investments in companies which receive more than 51% of gross revenues from cigarets alcohol or gambling products. This chart is taken right from the report. And it it basically shows you. Where our money is invested and what the market value was.'",
        "'speaker_3': 'And the -237 says that the market value was less than the book value. Investments with bond trustees or those funds required to be held by the trustee by the bond covenants. The duration of one indicates that they are very liquid.'",
        "'speaker_3': 'The trustees are keeping them liquid in order to be able to meet any demands that we don't otherwise fund. The local agency investment fund is managed by the State Treasurer's office. The maximum investment that we are allowed to make in that pool is $50 million.'",
        "'speaker_3': 'Between these funds and cash on deposit, the six month cash needs are met. The certificates of deposit are a safe instrument for holding small amounts required to be maintained for a variety of purposes. The remainder are instruments managed by PFM, Public Financial Management and K.M. Chandler Asset Management.'",
        "'speaker_3': 'This quick thumbnail gives the reader a quick view of the elements of the portfolio how the book and market values compare the duration and the average yield. And that ends my report.'",
        "'speaker_0': 'Any public figures?'",
        "'speaker_1': 'No. Speaker.'",
        "'speaker_0': 'All right. Of counsel comments. Brody.'",
        "'speaker_8': 'I have a couple of quick questions again. Thank you for the report. Can you go back a little bit and talk about the investment policy? And I think you mentioned we don't invest in cigaret alcohol or gambling. So is that a counsel discretion or.'",
        "'speaker_3': 'Yes. So the investment policy is actually a document that comes before you each year and should be coming before you soon.'",
        "'speaker_6': 'Okay.'",
        "'speaker_3': 'And it is reviewed by Mr. Kennedy and I and the staff. And we look at any new laws that have been passed. Anything new that. Ella Fournier dead advisory commission is recommending or the Treasurers Association is recommending be included in those investment policies.'",
        "'speaker_3': 'We then look at those and bring a revised policy before the Council. One of the issues was several years ago that we were asked to create that restriction rather than making it. You cannot invest in any company that does that.'",
        "'speaker_3': 'It's just if they get 51% of their gross revenues from one of those products. So it's just those three. Issues that we try to restrict.'",
        "'speaker_8': 'Oh, but if we thought there should be more than the council because a couple of things you know, stuck out to me on that on that report on page six were actually investing in Walmart Global Notes. And that kind of disturbs me.'",
        "'speaker_8': 'You know, you look at the investment policy and it says, you know, we shouldn't be. I was at sea. Investments which serve only to enrich a few to the detriment of the people, will be strictly avoided. And I would hardly classify Wal-Mart as one that, you know, benefits small businesses, benefits workers, benefits working families.'",
        "'speaker_8': 'And, you know, I know Peralta went through this a while back. We have Chevron, you know, and Occidental Petroleum in there. And, you know, we're investing in fossil fuels. At the same time, we're all trying to sit up here and figure out how we're going to fight global warming yet, you know, we're we're helping fund them.'",
        "'speaker_8': 'So, you know, you're in the state. You know, the state doesn't invest money in gunmakers that actually produce and sell the guns that are banned here in California. So I'm hoping that, you know, has as we get to look at this bar, you know, we'll kind of be a little more socially responsible with, you know, where we'",
        "'speaker_8': 'invest our money.'",
        "'speaker_7': 'And before you answer that, that that really is an issue for the council. It's that's a pure policy question. The job for the investment people is to balance off safety of the investment versus return. If there are things you don't want to participate in.'",
        "'speaker_7': 'It is absolutely the council's right as an expression of the democratic process. But staff is not going to bring those forward as ideas. So, for example, there's a political question, and I'm not by the way, I don't happen to disagree with you on this question, but it is a political question to say Wal-Mart doesn't benefit working families'",
        "'speaker_7': ', may not benefit the working families who work at Wal-Mart particularly, but many working families get low cost goods via Wal-Mart. That's a policy question. It's a value judgment. It's not appropriate for staff to intrude into those types of judgments.'",
        "'speaker_7': 'I don't think we want staff going down that road. So I would just suggest when the investment policy comes forward, that counsel bring up exactly those kinds of issues, which is appropriate in the council's role, but not in the staff's role.'",
        "'speaker_8': 'Yeah, I get that. But I didn't see, you know, cigarets alcohol and gambling in the investment policy is being restricted. So I was just kind of curious on how that how that came about.'",
        "'speaker_3': 'It came about as a policy action by the council, by the council many, many years ago.'",
        "'speaker_8': 'Well, I'll save that for another meeting then.'",
        "'speaker_0': 'Member de SAC.'",
        "'speaker_5': 'Well, thank you. I think it my take on this quarterly report, which is important, is always to take a look at, you know, how do I do my own? 401k And when I do my own 401k, maybe I'm not following the typical rules, but I'm always looking for security and safety to me over returns.'",
        "'speaker_5': 'So I'm always looking for things that granted, you know, will have really low volatility because even if it means I'm going to get, you know, small returns. To me, it's safety and security that that matters the most. And when I look at the instruments now tonight and as it has always been the case, your office, in conjunction'",
        "'speaker_5': 'with the city treasurer, from what I can tell, has always followed that. I mean, you look at the abundance of federal type of instruments, whether it's Fannie Mae or or Freddie Mac. I mean, or frankly, all the U.S. Treasury notes.'",
        "'speaker_5': 'I mean, you've got so much invested in cash. I meant. For the most part, I can't I can't remember if the U.S. if the buck was broken when we had a historic downturn. I can't remember. But it was a big issue.'",
        "'speaker_5': 'And and by that, what we mean is it's a safe holding. And and we are, for the most part, I think, investing very. So with safety in mind. So the take home, I think, is to make sure that we don't ever do what happened to Orange County in the mid 1990s when we start playing around with money'",
        "'speaker_5': 'and making, you know, an unwise and I know, you know, for all my years that I've been here, we've never been down that insight. But I think it's always worth when when this report comes up, it's always worth saying that over and over again so that we never do go down that path.'",
        "'speaker_3': 'I'll I'll the state laws that I referred to this evening or as a result of what happened in Orange County.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_5': 'I will say, though, it is interesting to see who we are invested in when it comes to like long term instruments for the nonfederal agencies like Berkshire Hathaway. We've got a few things with Berkshire Hathaway, i.e. Warren Buffett.'",
        "'speaker_5': 'So it's it's it's interesting. Thank you. Thank you very much.'",
        "'speaker_0': 'There.'",
        "'speaker_6': 'Just a question on the book value versus market value is, is there a alert limit or an alert point? That were were tracking to see how close that should be. That's right. You mentioned the $237,000 under. And is that something that you track to or the Treasurer tracks to make sure that it.'",
        "'speaker_3': 'Doesn't grow enormous.'",
        "'speaker_6': 'Yes. Yes.'",
        "'speaker_3': 'The asset, the portfolio managers track that to make sure that they're within reason and there isn't an exact number. But if the market starts to drop, they're going to start liquidating.'",
        "'speaker_6': 'Can we get a little statement in that, at least in a conclusion, statement in the next report that says where our trend is that we're within the expected limits or we're going to recommend some action or take some action.'",
        "'speaker_3': 'I can discuss that with the investment advisers and try to include so it won't be in the next report.'",
        "'speaker_6': 'But if there's something if there's something that can be to address that, whenever it's feasible to put in, I think it would be helpful. Thank you.'",
        "'speaker_0': 'Remember ASHCROFT?'",
        "'speaker_4': 'No, I was just because I agree with the vice mayor. That would be interesting information for us to have it. At what point was the determined determination made to liquidate?'",
        "'speaker_0': 'Yeah. Thank you. And I'd like to add that as part of our quarterly investment report, it does provide that our city treasurer, Kevin Kennedy, reviewed the City of Almeida's Treasury report for the quarter ending September 30th, 2014, and found that it complies with the investment policy established by his office.'",
        "'speaker_0': 'So thank you. And do we have a motion to make?'",
        "'speaker_2': 'I'm level.'",
        "'speaker_4': 'Oh you move all second.'",
        "'speaker_8': 'I'm acceptance of the Treasurer report for the quarter ending September 3rd, 2014.'",
        "'speaker_4': 'A second.'"
    ],
    "Report on Sale of Successor Agency 2014 Bonds.": [
        "'speaker_0': 'All those in favor. I oppose abstentions. Motion carries unanimously. Thank you. And our next item is 60.'",
        "'speaker_1': 'Recommendation to accept report on sale, a successor agency to the Community Improvement Commission of the City of Alameda, 2014. Bon.'",
        "'speaker_4': 'If this woman off her feet.'",
        "'speaker_3': 'This is a really good news report, and I'm glad that I get to end with this really good news report. We recently did a refinancing of the 2003 CIC tax allocation bonds, and as a result of that refunding, the City of Alameda General Fund will receive an additional $381,000 per year over the next each year through 2003'",
        "'speaker_3': '. Now, that is a $9 million worth of savings over the life of the bonds. So the interest rates coming down, the timing of what we did, the teamwork of the underwriters and the financial advisor and the Bond Council of pulling things together in a way that got things timed just right, made it a wonderful deal for us'",
        "'speaker_3': '. And the underwriters worked very hard, as you can read. And in the report one of the series was oversubscribed substantially and that is just very rare in today's market. So I want to personally thank the team for doing such a great job and it's wonderful that we are able to bring that money back to the general fund'",
        "'speaker_7': '. And if I may, we're reaping the benefits of our bonds upgrades from last year.'",
        "'speaker_3': 'That's true.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_5': 'And an American it. Our bond upgrades. The quality of our bond upgrades are a function of the quality of our city and the stability and the economic growth. And they have a community that we have. So to the extent that we continue moving forward.'",
        "'speaker_5': 'Obviously that's where we lead.'",
        "'speaker_3': 'That serves as a foundation.'",
        "'speaker_4': 'Well, may I just add to that? Yes. That and and I would also, because we are member de soccer and I were on that council that staff has worked diligently to chip away at our our deficit. And that was recognized by the market that rewarded us with an upgrade in our our investment in our credit rating.'",
        "'speaker_4': 'And so that is benefiting us as well. Thank you so much.'",
        "'speaker_0': 'Do we have any public speakers on this item? All right. Any other comments by members or questions member?'",
        "'speaker_8': 'I'll just be real quick. I want to kind of second what Councilmember De Sorkin and Councilmember Ashcraft said. You know, congrats to staff. Nice job, finance staff, city manager and the council that came before us for putting us in this position.'",
        "'speaker_6': 'If I could have the interim finance director repeat how many years that this is through, this is not one time revenue.'",
        "'speaker_3': 'No, it is not. It it's 2033. Excellent. And that's an average amount. Some years it will be higher. Some years a little bit lower, depending on what the debt service is in the new bond issue.'",
        "'speaker_6': 'So that's a healthy chunk. It's a thanks to all who had a part in that.'",
        "'speaker_0': 'Member.'",
        "'speaker_4': 'Ashcroft I was going to ask a question. It's probably in the weeds. Ms.. Boyer But on Exhibit one, which is the postal pricing summary letter, and this is on page three, and it's talking about credit ratings and just before that table where it compares the strengths with the weaknesses.'",
        "'speaker_4': 'So it says the 2014 refunding is considered a credit positive as it reduces the city's debt service of tax allocation bonds. Below is a table summarizing the primary strengths and weaknesses highlighted in the credit rating report. And I understand what they're calling our strengths, that we are in a strong taxing area and central location within the San'",
        "'speaker_4': 'Francisco Bay Area economy. Strong semiannual coverage on the 2014 bonds and limited ability to issue additional debt. Can you help me understand the two bullet points in the Weaknesses column there?'",
        "'speaker_3': 'I hope so.'",
        "'speaker_4': 'I mean, I know you can. So.'",
        "'speaker_3': 'Every every parcel gets an assessment. Each of those.'",
        "'speaker_4': 'So so we just start out and tell those who are listening and maybe not following along that the first.'",
        "'speaker_3': 'The first.'",
        "'speaker_4': 'Point.'",
        "'speaker_3': 'Yeah, the first weakness is moderate taxpayer concentration with significant outstanding assessment appeals. So every every parcel is assessed, every owner can appeal an assessment each year. And we have a. Somewhat moderate concentration. It's not a little bit and it's not a whole lot, but it's more than they would like to see of people parcels within the CIC'",
        "'speaker_3': 'districts. Being appealed. Well that's a result of the economy here and now we're coming out of that. In fact, we believe that we will have all of those settled in the next two year cycle. The second bullet is refunding indenture provisions that do not require the agency to set aside full annual debt service on the 2014 bonds'",
        "'speaker_3': 'in the first half of every bond year. This is a function of the. Redevelopment changes that the state made and what the state we have to file what are called ROPS and I'm sorry but I'm not going up the the obligation payments.'",
        "'speaker_3': 'So we have to file with the Department of Finance a six month request for more money. They have to approve it. They send it to the county. The county pays us for just that six months. And what the under what the right underwriting are the credit agencies would like to see is they would like to see see'",
        "'speaker_3': 'you getting the whole year's debt service in the first six months and d0f will not approve or has not so far approved that. I understand that there may be some changes coming and we don't know if that's going to be included or not, but that's what that weakness refers to.'",
        "'speaker_4': 'All right. You are a wealth of knowledge. Thank you so much.'",
        "'speaker_2': 'I swear.'",
        "'speaker_6': 'I'm just going to make a motion to accept this fine report. Good news.'",
        "'speaker_0': 'All those in favor. I oppose abstentions. Motion carries unanimously. Thank you very much. And now we can proceed to item number seven.'"
    ],
    "Proposed Ordinance on Grocery Store Retention Period. ": [
        "'speaker_1': 'Council Referrals is considered directing staff to create a proposed ordinance relative to a transitional retention period upon change of ownership, control or operation of a grocery.'",
        "'speaker_0': 'And I'm going to hand this off to member ODIASE. It's his referral.'",
        "'speaker_8': 'Thank you, Madam Mayor. As the as the referral says, requests of the city council direct the appropriate, I guess it should now say city manager because I wrote this before I was schooled on the proper way to write a referral to return and to draft to return to the City Council proposed ordinance relative to a transitional retention'",
        "'speaker_8': 'period upon change of ownership, control or operation of grocery stores. And I attached as a reference the grocery worker retention ordinance that the City of Los Angeles adopted. So just to kind of go over the highlights of of what the ordinance does, you know, new owners of large grocery stores are required to hire previous employees, excluding managers'",
        "'speaker_8': 'for at least 90 days after the store re-opens, the previous owner prepares a list of non managerial employees with at least six months employment and the new owner is to hire from that list during the 90 day transition period.'",
        "'speaker_8': 'The new owners to only discharge the hired employees for cause during the transition period. The new owner is to pay a written evaluation of each employees performance at the end of the transition period, and the new owner is to consider offering continued employment if the employee's performance is satisfactory.'",
        "'speaker_8': 'This ordinance is to protect the workers that work at grocery stores. As City of Los Angeles passes in 2005, it went through considerable amount of litigation until the California Supreme Court in Cal Owners Association versus City of L.A. 52 Cal fourth 177, now upheld the city's rights to temporarily preserve the status quo during transition of of grocery'",
        "'speaker_8': 'store ownership. And, you know, here in Alameda, you know, we do have one store, you know, that I think is in imminent risk of of possible closure. And that's the Lucky's over on the West End with the new Safeway now.'",
        "'speaker_8': 'This bill is being considered. You know, it may be considered at the state level, but, you know, my fear is that, you know, any state legislation would not be implemented in time to protect the workers over at Lucky's.'",
        "'speaker_8': 'And, you know, we wouldn't be going on a limb doing the only city that does this. San Francisco has this Santa monica gardenia. Other cities have other similar ordinances protecting other classes of workers. San Jose Airport, Oakland hospitality workers, Emeryville Hotel workers, Berkeley Marina workers.'",
        "'speaker_8': 'And then the state actually has a janitorial worker retention law in the labor code. You know, the mayor today, you know, referred to Cesar Chavez. We heard from the the recycling workers. You know, it's kind of apropos of that.'",
        "'speaker_8': 'I didn't know they were going to do that presentation. But, you know, that we also, you know, look out in Alameda for, you know, our grocery workers. So I'm hoping this is something we could we could consider. I think there's a first reading and then, you know, if my colleagues like it, then it'll go to a second'",
        "'speaker_8': 'reading. But I I'll close after after public comment if there's any public comment.'",
        "'speaker_0': 'You do have one speaker. But before we do, we have clarifying questions as Mr. Otis presented this or we. Then I'm going to go ahead and call our speaker, my Canterbury. And thank you for being so patient.'",
        "'speaker_7': 'While you were moving at breakneck speed earlier, my Canterbury Alameda resident president of the Planning Board and representative for the Lucky Workers down at Marina Village. I was going through some papers because I was interviewed by the San Francisco Chronicle about the takeover of Safeway by Cerberus.'",
        "'speaker_7': 'So I went back and I was looking at my files. And in 2006, when Cerberus bought the old Albertson's from Boise, they bought the stores in Northern California prior to Save Mart, taking those stores over, rebranding them as Lucky's.'",
        "'speaker_7': 'It closed. They announced the closure of 46 stores in one day. It was not a good day for grocery workers then and things have not gotten much better in the industry since then. There's an awful lot of consolidation.'",
        "'speaker_7': 'You don't know who's going to be your boss from day to day. It's very unsettling for families. Just like families and recycling, there's real workers and real families behind those jobs. Same thing in the grocery industry. So Councilman Otis referral is a modest proposal.'",
        "'speaker_7': 'It adopts what L.A. and Santa monica and Gardena already have and retains the jobs in the grocery stores when a new owner comes in for 90 days, doesn't require the employer to keep everybody. It's a very, very modest proposal.'",
        "'speaker_7': 'As far as the Lucky's is concerned specifically, I would hope that that company would step up their game, remodel that store and compete with Safeway in asking those guys for the last seven years to do that. I haven't done so.'",
        "'speaker_7': 'I'm not sure they're going to until we really face a crisis with that membership. So your assistance on this would be greatly appreciated and it would really help out Alameda residents and workers.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Q. Member Ashcraft.'",
        "'speaker_4': 'Thank you. I thank Councilmember Ody for bringing this before us. What I wrote in my notes is that I certainly don't object to the principle that grocery workers or any workers, for that matter, should not lose jobs, their jobs, when a change in ownership occurs.'",
        "'speaker_4': 'But rather than just considering adopting Ella's ordinance outside and outside outright, I would I could support asking our city attorney's office to analyze and then advise on the implications for Alameda. And that's the sort of direction I could support, because although it's been described as a modest proposal, I would say that it is pretty detailed and I'm'",
        "'speaker_4': 'so, I'm sure appropriately so, coming from the city of Los Angeles, having gone all the way up to the state Supreme Court. I know there's a back story to these clauses, and they are perhaps, as Councilmember Ody indicated, based on state law, some provisions already in the Labor code.'",
        "'speaker_4': 'But I think that I would like to know and again, it to me it reads like a collective bargaining agreement and there is nothing wrong with a collective bargaining agreement. It's just that the collective aspect of it is missing here because we're just handed this document.'",
        "'speaker_4': 'So I, I, again, I support the principle that workers should not lose their jobs just because a new change of ownership comes in. On the other hand, I would want an analyst to analysis to look at are there other comparable methods that could be used to protect workers rights, severance packages, or some other sort of guarantee?'",
        "'speaker_4': 'Because the when you get down into the enforcement section one 81.05, this is very detailed about hiring and reinstatement rights and front or back pay for each day during which violations continues before our city enacts. That is an ordinance.'",
        "'speaker_4': 'I just want to hear from our city attorney's office what the implications are. I think, in fairness, we should probably hear from the business community as well. I would hope that we have good, reputable businesses who also want to see working families be able to support themselves and their family members.'",
        "'speaker_4': 'So and also, I would just note that I think there is some redundancy. I think a couple of sections got listed twice at the bottom portion of this. This ordinance anyway. Those are. Those are the the concerns that I have.'",
        "'speaker_4': 'But I'm I'm generally supportive, again, with the principle. Thank you.'",
        "'speaker_0': 'Thank you. Any member decide.'",
        "'speaker_5': 'Sir, thank you very much. Madam Mayor, I think this is a very interesting item, which I think I certainly would love to support. It's not the type of thing that we generally deal with on city council, but I think you really have to look at the issue.'",
        "'speaker_5': 'And then if you if you take the time to realize, to think about it, this is an issue that we actually deal with. It is within the purview of city council, particularly even when we frame it as a grocery store related issue in terms of law and in terms of of court cases.'",
        "'speaker_5': 'Certainly, there is a special place that grocery stores play have when it comes to the land use, especially, particularly with regard to grocery stores that are that anchor certain shopping centers and that are foot traffic generating. There's a lot of.'",
        "'speaker_6': 'Law.'",
        "'speaker_5': 'Built around that and there's a lot of case of court cases built around that. And so this is a right area for cities, for city councils to get engaged in on in terms of going beyond land and grocery stores and land use implications.'",
        "'speaker_5': 'You know, basically what I'm getting at is, you know, when Walmart opens up, there's a lot of discussion regarding, you know, how it might impact existing grocery stores. And so based upon those discussions, there's a lot of court cases with regard to to how those impacts are treated now.'",
        "'speaker_5': 'But what Councilmember Odie is bringing up has to do with labor relations. And insofar as the city of Los Angeles, this ordinance has been vetted by court cases up to the Supreme Court, California Supreme Court. I believe that, you know, to the extent that that that it's framed similar to what LA's ordinance is, it seems to be'",
        "'speaker_5': ', you know, certainly reasonable that that that city council should should be supportive of something that that seems to be accepted. And when it comes to, you know, helping out working families, we don't normally get engaged in.'",
        "'speaker_1': 'These operational levels.'",
        "'speaker_5': 'But I but I don't see why not. I think the earlier discussion that raised by the residents, by the workers at ECI certainly raises issues that maybe this city council we we might contemplate, you know, going outside of our of our of of of our what we usually do.'",
        "'speaker_5': 'I mean, it shouldn't be just left to the cities of Berkeley or city of Oakland or San Francisco or Santa monica to deal with living, wage type of issues, worker rights or, you know, I think middle of the road, medium sized cities like Alameda have something to say about these kinds of issues.'",
        "'speaker_5': 'But back on to the point that Councilmember Ody has raised. I look forward to this discussion.'",
        "'speaker_6': 'I guess I don't want to repeat what people have said. I think it's important for us, particularly because we live in a very expensive part of the country to protect. Workers from bakeries of large corporation. Moves. And I think the grocery businesses we're going to see something firsthand in Alameda, as it was pointed out with the lucky'",
        "'speaker_6': 'at Marina Village. I'm the only of. Additions that I would have to this referral is to include the city attorney in the in the direction to. Craft the, uh, the draft ordinance for discussion. And I look forward to when we have that discussion.'",
        "'speaker_0': 'So thank you. And my comments go to I I'd like to know specifically which other cities have what ordinances. If it's Santa monica, Gardena and Los Angeles, which was hear and see the differences between those ordinances, when I looked up the California State Supreme Court, which was California Grocers Grocers Association versus the city of Los Angeles.'",
        "'speaker_0': 'It's my understanding that that turned on providing safe food to the community and that you had trained employees who were able to do their job. And the concern was that we had to continue to provide safe food. And I appreciate the comments that were here.'",
        "'speaker_0': 'When you the attachment from Los Angeles, it specifically provides that the city has an interest in ensuring the welfare of the residents of these communities through the maintenance of health and safety standards in grocery establishments that experienced grocery workers with knowledge of proper sanitation procedures, health regulations and understanding of the clientele and communities they serve are instrumental'",
        "'speaker_0': 'in furthering that interest and that transition and retention period upon change of ownership, control or operation of grocery stores ensures the stabilization of the workforce, which results in preservation of health and safety standards. So my understanding of this case was that the intent was truly to protect the health and safety of the community, as we are all'",
        "'speaker_0': 'dependent upon grocery stores for food and that, and then we are dependent upon that. This court held experienced employees to provide that food to the community. So I personally and I was in some there were some mention of other cities that have other ordinances, and I'm not familiar with those.'",
        "'speaker_0': 'But so if this is framed as a health and safety issue, then I would think that all of us would be in support of that. Not to speak for anyone else. And that is what different differentiates it from other types of businesses.'",
        "'speaker_0': 'I would also like to know and agreement with member Ashcraft. I'd like to know now this speaks to 15,000 square feet that it pertains to businesses, grocery stores that are at least 15,000 square feet. And I'm not sure which I'd like to know and the staff report what stores it would actually apply to specifically in Alameda.'",
        "'speaker_0': 'And in that case, the Los Angeles case, as far as I know, is the one that was tested and went to the California Supreme Court. So I. It's important to me that we try to honor what was already tested so that we don't find ourself in litigation because this was this did go through litigation.'",
        "'speaker_0': 'So but the other city but Los Angeles did the other cities that were referenced, I don't know if they modeled after Los Angeles, but that and if they are, my guess would be they have not gone up to the Supreme Court.'",
        "'speaker_0': 'So. But I would like to see the differences in those if it's available. But as it applies to and then I would agree with the speaker. Lucky is in Marina Village. I personally do shop there, as do I think many people in the area.'",
        "'speaker_0': 'And given now that we have safe way to protect this store, I would agree that lot of lucky could consider remodeling the store, visiting the store to keep the store going. Ideally, I think that the we know we now have two safe ways to add a different store, a large grocery store I would support and I would'",
        "'speaker_0': 'encourage Lucky to come and visit our store and we'd be happy to walk around and show you our concerns, express your concerns because it is a viable business in our community. And then in regards to staff's time, I think it's fair to say we have given this stuff many new items to be looking at.'",
        "'speaker_0': 'And what is the priority of this? If there's a way and I and I don't know. You know, I don't know how much time this is going to take, but I know you have a lot on your plate and we have priorities.'",
        "'speaker_0': 'For instance, the budget development traffic. There's been quite a few referrals lately.'",
        "'speaker_7': 'I appreciate that. I'll confer with the city attorney, but I believe we can bring this is the first meeting of February. We should be able to bring something back in April for this. And that will be plenty of time for us to do the necessary research and still make the agenda.'",
        "'speaker_7': 'Appreciate I appreciate the consideration of the council that there are a number of items that are on our plate. And with the the budget beginning to loom large for us on staff and it's a two year budget, so it doesn't happen all the time.'",
        "'speaker_7': 'It is a limited staff. So I think I think, you know, certainly, April, we can bring this back.'",
        "'speaker_0': 'And my bet, my recollection is in regards to the budget process, that it will be a lengthy process. So I appreciate staff being agreed agreeable to taking this on. Do we have a motion?'",
        "'speaker_6': 'I'd like to move. Council member Otis referral. Um, with the specification to direct the city manager and the city attorney to work together to draft this ordinance, including delivering a report that talks about the impacts that specifies the impact of stores in alameda.'",
        "'speaker_6': 'That would. Fall under such an ordinance that analyzes the differences between ordinances that are out there and Los Angeles being the test case and to be in consideration for what may be specific to Alameda.'",
        "'speaker_8': 'Second, that motion.'",
        "'speaker_1': 'And.'",
        "'speaker_0': 'At this point it was you refer over you like to make any other comments.'",
        "'speaker_8': 'You know, when I when I was an attorney, you know, and the judge was ruling in your favor, you kind of shut up and didn't say anything. So I think I'm going to heed to that. But I will say in my closing, you know, was that one of the goals it would accomplish was ensure standards of service'",
        "'speaker_8': ', compliance with health and safety standards that they remain in place when stores change hands. And, you know, I think important here is this law would apply equally to unionized and non-unionized work workplaces. So if a Trader Joe's closed and they met the threshold of the size, you know, then somebody else who bought that store would also now'",
        "'speaker_8': 'they wouldn't be forced to collectively bargain. You know, but the employees that work there and I think that was kind of the key on which the the case turned, because I believe that the the Grocers Association was was making the argument that it was force collective bargaining and that was the critical thing that kept the ordinance alive'",
        "'speaker_8': '. So I want to thank my colleagues for supporting this.'",
        "'speaker_0': 'Any other comments?'",
        "'speaker_4': 'And so just for clarification, and I think we've crafted something that I can support. We are going to have both the city attorney and the city manager do an analysis of this as it would apply to Alameda.'",
        "'speaker_8': 'I would assume that that happens on all ordinances. No. Oh yeah. Turning.'",
        "'speaker_7': 'Yeah, it does. Although on as it does I mean different items.'",
        "'speaker_6': 'But it was classified in the motion. So it's good answers. Yes.'",
        "'speaker_8': 'Call the question.'",
        "'speaker_2': 'All those in.'",
        "'speaker_0': 'Favor. I oppose the abstentions. Motion carries unanimously. And thank you, everybody, for bringing this to us.'",
        "'speaker_8': 'Thank you, Madam Mayor.'",
        "'speaker_0': 'Our next item is Council Communications. Council members may address any matter not on the agenda, including reporting on conferences, meetings member Ashcroft.'"
    ]
}