{
    "Resolution on Taxable Tax Allocation Refunding Bonds for the Former Community Improvement Commission.": [
        "'speaker_1': 'Of taxable tax allocation. Refunding bonds to refund bonds of the former Community Improvement Commission of the City of Alameda in approving related documents and actions.'",
        "'speaker_0': 'Thank you. I. Do we have a presentation? Yes. Otter.'",
        "'speaker_1': 'Good evening. I'm Debbie Potter, the city's community development director. Tonight, staff is requesting that the successor agency authorize the issuance and sale of tax allocation refunding bonds of the former Community Improvement Commission. These bonds will refund tax allocation bonds that were sold in May of 2011, just prior to the dissolution of redevelopment agencies.'",
        "'speaker_1': 'The original bonds were sold to raise funds necessary to acquire the Island Motel and convert the former motel into permanent affordable housing, now known as Park Alameda. The bonds were sold in a high in a high interest rate environment due to the uncertain climate around redevelopment.'",
        "'speaker_1': 'State legislation governing former redevelopment agencies has strict requirements about when you can issue new bonds. New bonds can only be issued if there is a savings to the taxing entities over the life of the bonds due to the original bonds high interest rate.'",
        "'speaker_1': 'There will be substantial savings to the taxing entities over the next 24 years, ranging from 4.1 to $4.6 million. Annual savings could range from 165 to $200000, depending on final bond pricing. The city is a taxing entity and would realize an annual savings of 50 to $60000.'",
        "'speaker_1': 'This savings would come as additional redevelopment property tax trust fund moneys to the general fund. If the successor agency authorizes the issuance and sale of the bonds, staff will then seek approval from the oversight board. Following Oversight Board approval, we will then submit the request to issue bonds to the State Department of Finance.'",
        "'speaker_1': 'Once we have secured the office, approval, staff will prepare the official statement and other documents required for the sale of the bonds. The official statement and related documents will be presented to the successor agency prior to the issuing of the bonds.'",
        "'speaker_1': 'Tonight's action authorizes staff to begin the process of issuing and selling refunding bonds to provide savings to the taxing entities over the life of the bonds. I, as well as our team, is available this evening if there are any questions.'",
        "'speaker_1': 'That concludes my staff report.'",
        "'speaker_0': 'Thank you. Any questions? Answer. Do we have a do we have any speakers on this item? Any speakers? None. All right. Do we have a motion move?'",
        "'speaker_2': 'Approval of sales bonds.'",
        "'speaker_0': 'I second all those in favor.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'My motion carries unanimously. Thank you. Thank you. I will now adjourn the S.A. CIC special meeting and. And open the regular city council meeting. Roll call.'",
        "'speaker_1': 'Roll calls. Been noted.'",
        "'speaker_0': 'Five present. Thank you. Agenda changes. I have a question. How many speakers do we have, if any, on items? Nine, eight and nine. The.'"
    ],
    "Proclamation for St. Joseph Notre Dame Mens Cross Country Champion Cooper Teare Day.": [
        "'speaker_0': 'sport of cross country. Now, therefore, be it resolved, I Treasurer Spencer, Mayor of the City of Alameda, hereby proclaim February seven, 2017 as Cooper Tier Day in the city of Alameda. And we wish him continued athletic success and.'",
        "'speaker_0': 'Thank you. And if you'd like you and your coach, anyone else out there could make a few comments. We'd love to know what year you are in school and what are your plans. And you might want to raise the microphone because you're tall.'",
        "'speaker_5': 'I'm a senior and I've committed to run cross-country and track at University of Oregon next year.'",
        "'speaker_3': 'Oh, that's a running school. Yeah. Congratulations.'",
        "'speaker_0': 'While they're coming up for for a photo op, I'll just say that my kids both ran cross-country in high school and I. All those races you mentioned really awesome. Where you placed and. I live in an area near Saint Joe's, so I see your team running.'",
        "'speaker_1': 'By him.'",
        "'speaker_0': 'All the time. So congratulations. Well, then takes a lot of discipline.'",
        "'speaker_5': 'Yeah. Thank you.'",
        "'speaker_3': 'You in.'",
        "'speaker_2': 'Madame Mayor, I'd like to make sure we recognize Coach Tony Fong, who's brought us from the Saint Joe's family, a number of cross-country and track champions over the years. Thank you, Coach Fong. I just want to say I've been coaching so long.'",
        "'speaker_2': 'In fact, Frank's son Peter actually ran cross-country for Saint Joe's and that so many of the kids have come through this program. And all the kids is has been a part of the Saint Joe's community. Cooper wouldn't be where he.'",
        "'speaker_6': 'Is now without that support of not only Saint Charles, our athletic director, the parents.'",
        "'speaker_2': 'Coach, coach Alex Mason. And I just want to say, when you see those kids running up and down the streets, they are using a crosswalk, right? They're not walking across. I just want to make.'",
        "'speaker_0': 'Sure I'm not going to read anyone out.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'Just kids.'",
        "'speaker_6': 'Just so you.'",
        "'speaker_2': 'Know. Cooper has one more season and he's accomplished.'",
        "'speaker_6': 'A lot at St Joe's, but he's got some lofty goals.'",
        "'speaker_2': 'This year. He wants to break the four minute mile mark. He wants to break 14 minutes, four or five K and of course, repeat as state champion in track this year. So lofty goals, but he's working hard. We want to come back here again for another proclamation, folks.'",
        "'speaker_0': 'Thank you. Got to be three then.'",
        "'speaker_7': 'That hit it last year, I think.'",
        "'speaker_0': 'Thank you. All right. Next, it'll be for all communications, not an agenda. And I wanted to share that before I call the speakers to the podium, I want to explain that the State Brown Act and our City Sunshine Ordinance prohibit the City Council from engaging in a discussion with speakers who raise issues and concerns at this point'"
    ],
    "Review and Update of Outdoor Lighting Regulations to Reduce Light Pollution.": [
        "'speaker_10': 'Another cross from another 20 homes. And I hope you will pass some laws that will protect the home owners. According to Ringo Lew, who sells a lot of real estate out there and owns quite a bit. It's cost us about 10% of the value of our homes.'",
        "'speaker_10': 'Now, if I stole 10% of the value of your home, I bet you you'd be screaming your head off at me. So will you please take under consideration? Now I pass one around and collect the signatures, and I think you all receive copies.'",
        "'speaker_10': 'Now. And going around, I had people say, Oh, what about the street lights? And I had one of our. Fellow residents complain about. The people that make the hoods for stoves had lights bouncing off their building at night.'",
        "'speaker_10': 'I went out there, I got to talk to somebody. I got a call today. Come out and take a look. I think you'll like what we've done. And there is no light bouncing off of that building. They put in soft hair filters to warm up the tone of the lighting, but they shaded it so it didn't go'",
        "'speaker_10': 'on to the building. And this can be done with the street lights as they change them so that they don't shine into our homes. But please get some ordinance in place so we don't have an uphill battle with the F saying, well, we complied with the law.'",
        "'speaker_10': 'Well, we were let down by our city permit people who should have questioned some of the things they were doing. And that's all I got to say tonight. But get off your duffs and get it done.'",
        "'speaker_0': 'Gary Thompson.'",
        "'speaker_3': 'Mayor City Council. That's going to be tough to follow. I'm Jim's neighbor. Live about four houses down. And for the last four years, we really have been in a struggle with V.F. over these lighting issues. And I want to tell everyone here that I'm not any developer.'",
        "'speaker_3': 'I spent 40 years as a contractor, so I know about development and I appreciate it. What we really have here and I've thought about this seriously, I've had many, many meetings with V.F. and with Joe Ernst and the people out there.'",
        "'speaker_3': 'And the core root of this issue is that our current building codes in Alameda just do not adequately address the situation where you're putting in a commercial development that a such a residential area. And to their I would say to their credit, through much negotiation and a lot of pain and agony and a lot of talking, they'",
        "'speaker_3': 'have done a lot to try to mitigate some of these problems. And most of it revolves around the direct broadcast of light. Most of which can be fixed through directional shielding. It's a it's a developed science as to how to take care of these things.'",
        "'speaker_3': 'Many cities already have ordinances in their building codes that take care of this. And I don't think that developers should go out and deliberately try to cause trouble or hurt people. They build their development according to the building codes and as approved by the cities, and there are commissions.'",
        "'speaker_3': 'So it would be more fair to the developers to have this upfront in advance in the planning stage. I know that V.F. has spent a lot of money, as has George, trying to mitigate some of these issues that they've had to go back and do to try to satisfy us.'",
        "'speaker_3': 'And so if if I guess the my plea to you would be to at least look into this. Look into the audiences at other cities have there is a lot of information out on on this. Light pollution and light trespass.'",
        "'speaker_3': 'Now, it's very difficult for a single homeowner to take on somebody like Vanity Fair. There are $15 billion a year international corporation. So for us to go after these guys legally is tough. I've looked into this. The only avenue that we have for redress to them is through the nuisance laws.'",
        "'speaker_3': 'And I don't have the resources, quite frankly, personally, to take on Vanity Fair when this could all be very easily put to bed through some very common sense, simple building codes regarding this broadcast of light. So that's my plea, and I'd ask you to please consider doing so.'",
        "'speaker_0': 'Thank you. That. And if anyone else wanted to speak on this item, please submit your slip up there.'",
        "'speaker_1': 'And good evening, Mr. Spencer, Vice Mayor Mary, Malia Vella and City Council members. I'm here tonight in support of my neighbors, of two kinds of neighbors. Some of them are human. They're sitting right there and some of them are more difficult to get here.'",
        "'speaker_1': 'And I'm going to share pictures of them for you so you can get an idea who they are. I support doing anything you can do on behalf of the folks that live across from Vanity Fair in terms of light pollution.'",
        "'speaker_1': 'Would they be here if it weren't disrupting their sleep and their rest and their ability to get up and work? What would it take for us as a city to stand up to Vanity Fair? Gary's right there, multibillion dollar corporation.'",
        "'speaker_1': 'They have you been there? I know you have, Mayor Spencer. They light up their parking garage. Parking garage where cars are parked at night. So I stand in complete support with my neighbors and ask you to please, please pass regulations and work with the planning codes and department.'",
        "'speaker_1': 'Some of you know me because I have also stood with my human neighbors because of development on Harbor Bay, specifically the hotel at 2350 Harbor Bay Parkway, and then a another development on five acres near the ferry. And we've temporarily halted that development.'",
        "'speaker_1': 'Those motivated by the impact on my human neighbors as motivated by the impact on other neighbors. And I'll share who they are. If I can, I pass this to.'",
        "'speaker_0': 'The city council members, actually put them up on the screen. So the lights up we have a table.'",
        "'speaker_1': 'And something I Xerox some pictures I took last year. I was instrumental with all of our neighbors in halting that development because I wanted to defend open space on the bay. And sometimes people thanked me for that. Sometimes people attacked me for that.'",
        "'speaker_1': 'What are you doing? This is income for a city. These are jobs. And so I would. Go and volunteer. I volunteered. Was part of the lease turn. You know endangered species protection on Alameda point. And then I was also I went to Forum's Cindy Margolis, the executive director of the Golden Gate, Audubon Society, lives in Alameda, you'",
        "'speaker_1': 'know, LA or Philly. Right. Founding leader of fire, friends of the Alameda Wildlife Reserve. And so when I drive out to that parcel and go, we got to do this, we got to stop this hotel from a human neighbors.'",
        "'speaker_1': 'I would drive to that tree. That's a picture of a tree. It's behind the Safeway at Harbor Bay. Those are herons and snowy egrets. And I was taught that they came here to nest. And so I'd go there and say, who am I doing this for?'",
        "'speaker_1': 'Right. I know I'm doing it for humans. I'm doing it for for me and for these birds. And they fly there and they build their nests. What would discourage them from doing that? Light pollution, guys. Other cities across the nation have paved the way in in reducing light pollution.'",
        "'speaker_0': 'By the way, the little.'",
        "'speaker_1': 'Guy down there, I'm going to take three more seconds on one of my trips. He fell out of that tree. I called the Philly and I said, what do I do, Laura? You know, he's he's he's he can't fly.'",
        "'speaker_1': 'And she talked me through 2 hours of putting that snowy egret in a cardboard box and taking him to the Lindsay Wildlife Emergency room. Essentially, I'm asking you to do the same for my human neighbors and the wildlife that roost in that tree in flies, including the least terns who are an endangered species.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_0': 'Thank you. And I also want to share that we did receive a petition signed by approximately 200 people requesting that we move forward, the council move forward and approve considering directing staff to review and update outdoor lighting regulations, also referred to as night sky or dark skies to reduce light pollution.'",
        "'speaker_0': 'Um. Any Council comments? Yes. Um. Member matter.'",
        "'speaker_2': 'I think this. Referral was described here as a companion, or at least related to the Memex. Referral that we're going to be that we've approved approved directing staff to. To explore and to put also on the workshop on the 17th for prioritization in that it talks about the interface between commercial and.'",
        "'speaker_2': 'Residential on one hand. And then I think we have an a an environmental policy document from 2008, the local area action plan that has to do with climate protection. And that's one that I've started rereading because I'm not sure we've done any follow up on.'",
        "'speaker_2': 'I'd like to see how this intersects or or relates to that document as well, the policies that are laid out in that document.'",
        "'speaker_0': 'And the other council comments. Member Ashcroft, just for clarification. The last time I talked to an officer of the homeowner's association that's across from V.F.. He emphasized that this was not a homeowner's association policy. And I believe that's still correct.'",
        "'speaker_0': 'I mean, we haven't heard anything stated otherwise that, you know, wanting to reduce the light from VF because I've also understood that VFR outdoors has made considerable modifications and that there is that balance between. Lighting your property. Being respectful of your neighbors.'",
        "'speaker_0': 'But also maintaining safety of your property. But I also. Concur with the vice mayor that we have a priority setting workshop coming up. Sorry. For two years it's hard to get that habit. This is a matter that I concur with council member matter that we have a priority workshop coming up a week from February.'",
        "'speaker_5': '7th.'",
        "'speaker_0': 'February 17th. And so, I mean, maybe it's all one in the same, but we're going to figure out what our overarching goals and objectives are and how to get to them. So. At this point, I'm actually requesting the referral process be honored in regards to voting because I'm requesting support from council to submit this.'",
        "'speaker_0': 'And then it would be something that we would discuss along with all the other referrals that are outstanding at the Priority Setting Workshop for Motion.'",
        "'speaker_3': 'I wonder.'",
        "'speaker_4': 'Vice-Chair Can I just question through the chair? If Council Member MODERATOR could expand upon the point that he was making about how this overlaps with the zoning referral, is it to look at the suggestions within this referral in that context and address it, address them together or.'",
        "'speaker_2': 'No, I didn't say overlap. I said it's related. Related and it is related because the same issue that was the one example here. It was is an example of commercial. Right. But in residential and I know we talked about this in the context of other aspects of commercial and residential in that discussion around zoning.'",
        "'speaker_2': 'Mm hmm. I also think and I'm actually supportive of having this. This goes through the referral process, direct staff to come back and tell us what what is needed because it has that connection. It also has, I believe, a connection to our our local area climate climate plan that was passed in 2008.'",
        "'speaker_2': 'So I think I think it has merit and it will go into the queue with the others when when we decide where, where, when and how. But I think we have to address it.'",
        "'speaker_0': 'And Brody. All right.'",
        "'speaker_3': 'I guess I have a question maybe of staff. So the referral says consider directing staff to review and update outdoor lighting regulations. Do we have outdoor lighting regulations? I mean.'",
        "'speaker_0': 'I did work with our city attorney on this item. And I am not sure what regulations we currently have. And that continues. That's the beginning of it, right? The review should include reviewing other cities regulations, light pollution, impacts on the environment, nearby residents, human health, wildlife and flight paths.'",
        "'speaker_0': 'Addressing parking lots and similar parking structures. And it continues. And it's my understanding. Whatever we have is very. Insufficient.'",
        "'speaker_1': 'Again. I'm sorry, Mayor. I didn't double check. And it's been a while since I've thought about this one, so I really can't offer a lot of information on this. But I do believe these issues do get addressed during the planning process.'",
        "'speaker_1': 'But it's very likely that we could you know, they aren't as strong as.'",
        "'speaker_9': 'You are requesting in this referral.'",
        "'speaker_0': 'And understanding.'",
        "'speaker_5': 'And I'm not sure about the specific regulations, but I have seen conditions of approval for projects on near the it's a pretty standard condition of approval of our projects, but it doesn't that doesn't keep it consistent and set standards.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Does that. I guess my question was, we're going to review an update if we don't have them. And it's like we're starting from scratch, it sounds like. And.'",
        "'speaker_0': 'My understanding is that there is something about that. It's just more of a. Cursory review and not necessarily all these the breadth of all these issues that actually have become concerns within our community, which is why it needs to be looked at and reviewed.'",
        "'speaker_3': 'And I guess the issue brought up by Councilmember Ashcraft that the homeowners association hasn't contacted us and said this is a priority, this and I was actually on that homeowner's association. I lived in that neighborhood. I know it's been 20 years.'",
        "'speaker_3': 'I don't remember what they said, but we had a stack of disclosures that we had to sign that's you know, a lot of it was on airport noise and that we live in an airport, blah, blah, blah. But I distinctly remember, you know, them telling me that, you know, people are going to be able to build in'",
        "'speaker_3': 'the commercial arc and that commercial zoned area. And, you know, you're signing that, you know about this and you can't really complain about it. So I wonder if this is a huge hammer that we're using to, you know, kill a mosquito.'",
        "'speaker_3': 'And if if the focus should be on the outdoor and the issues that are VFR, outdoor, if they're still there. So, you know, then I guess I'm these are my thoughts. So I mean, I'm just wondering if we're going to ask staff to bite off a huge effort and start something from scratch or that we don't have'",
        "'speaker_3': 'granted. There may be guidelines out there when, you know, the homeowners association, which I think should be the where, you know, if it was really an issue with all the homeowners, I'm wondering why they're not here and why they haven't passed a resolution.'",
        "'speaker_3': 'And, you know, one thing I am concerned about. You know. There seems to be a correlation between the amount of light and lack thereof and the amount of crime. So, I mean, we do have reasons why we would want to keep parking garages lit.'",
        "'speaker_3': 'So no. Not a it's not a slam on anyone. But, you know, women do get raped in dark parking garages. So, I mean, is that I think we still have an interest in making sure that, you know, we keep people safe.'",
        "'speaker_3': 'Throughout the city. So, I mean, I guess I'm kind of trying to. Balance the two competing interests here.'",
        "'speaker_0': 'So yes. Member Ashcraft. Thank you, Mary Spencer. So I, I can see the point that Councilmember Ody is making. On the other hand, I'm actually going to reverse course a little bit when it comes to VFF outdoors. I, I take some exception because I know how hard and how long and how many things they've done to address'",
        "'speaker_0': 'the situation. And I've also taken a walk. It's a lovely neighborhood, by the way, Panama, I think it is right across in a nice lagoon, a park, pretty little lagoon. And I would say they really have reduced that.'",
        "'speaker_0': 'However, when we're talking about regulations, we're talking city wide. And I do think that, first of all, it sounds like there maybe isn't some sort of a guideline. You know, technologies have changed and some of these new streetlights that have gone in, they have a lot of power, which is a good thing, you know, to illuminate the'",
        "'speaker_0': 'streets. It's you don't want to be walking down a dark street and tripping or, you know, running into somebody dangerous. But at the same time, there are different kinds of lights. There's the warm returns, there's the colder turns, the cooler tones.'",
        "'speaker_0': 'And I think it would behoove us to take a look at that, not I would not do this if I thought that it was directed personally. And, you know, I don't like to hear attacks on what are we're really fortunate to have VFR outdoors here in Alameda there.'",
        "'speaker_0': 'I mean, you wonder how we pay for paving our streets and keeping our libraries open. It's from businesses. We've got some great businesses that are here. The North Face Jansport, I could go on but anyway, so if, if we were to direct staff to look into some sort of a lighting regulation.'",
        "'speaker_0': 'And again, when we come to our priority setting workshop that it'll find its place in the. Q I could support that, but, but not if it were personally directed at a particular business. And I appreciate those comments and my referral does not reference the hearings.'",
        "'speaker_0': 'So appreciate I just wanted to clarify that. I think it's important to share that. I agree. Vice Mayor, you want to comment?'",
        "'speaker_4': 'Yeah, I think, you know, it seems as though we have, you know, having followed the council meetings over the past few years, knowing that there has been a citywide concern about the new types of lighting and also recognizing the fact that we we do want to be as green as possible and we want to I think whenever'",
        "'speaker_4': 'we have developments planned or things coming up, we want everybody, both the residents as well as anybody coming in to build or build in a commercial or mixed use area to actually know what their options are. And I think to the extent that we can provide some some form of guideline citywide for all of the projects that'",
        "'speaker_4': 'are coming in, and to make them green and to make them in line with some of the other policies that that we've already passed and that we're focusing on. I think that this is an opportunity to do that and to also make sure that everybody is on the same page in terms of what to expect.'",
        "'speaker_4': 'And we can have an input process for that.'",
        "'speaker_0': 'Thank you. And and Brody, then vice or member matter.'",
        "'speaker_3': 'So first, Frank, I mean, hearing the member. Thank you, Madam Mayor, at the hearing, the back and forth, I mean, I think I can support something too, if in a one. It's in line with the comments of my colleagues, too, that it does focus on, because I do think this is an issue that consumer matter S.E. brought'",
        "'speaker_3': 'up that does focus on the borders between commercial and residents. But I also would like to make sure that, you know, there's a consideration of public safety in anything that goes forward. So, I mean, with those three things, I'd be happy to support it.'",
        "'speaker_0': 'Member matter.'",
        "'speaker_2': 'And I think also that we need to consider that site is going to be designed and built and it is going to have mixed use. There's planned commercial that surrounds its border and there's the residential components of it.'",
        "'speaker_2': 'It is also facing the wildlife refuge and there are many articles about the effects of the of light pollution on the migratory patterns of at least tern, the pelicans and any other species that might be out there. And I think even if we don't have an it sounds like we may not have strong or maybe no consideration'",
        "'speaker_2': 'of these factors in our current guidelines and regulations, whatever the gamut might be, we're not going to be starting from scratch. There are other cities that have gone through this, and we I think we can take the benefit of what other people have done.'",
        "'speaker_2': 'So I'm ready to make a motion to give the direction as per the referral. With the examples that are included only as illustrations.'",
        "'speaker_0': 'And, and I'm willing to second with the comment that this is probably a topic where we should shed more light on it. Sorry, I got it right. All right. So we have a motion in a second, although any other comments member?'",
        "'speaker_0': 'I mean.'",
        "'speaker_3': 'The comments that I added, I mean, are those acceptable as well?'",
        "'speaker_0': 'Well, these were just so.'",
        "'speaker_3': 'Keeping in mind public safety.'",
        "'speaker_2': 'And keeping in mind public.'",
        "'speaker_3': 'Housing on the borders between.'",
        "'speaker_2': 'Our the safety, the mixed use, and then the considerations for.'",
        "'speaker_3': 'Safety even more than mixed use. I mean, we're commercial and residential.'",
        "'speaker_0': 'And I do have in the report specifically says nearby residences. That's just one of the examples though and I did appreciate your comment member mattresses comments in regards to that these are just illustrations is not intended to be the entire list.'",
        "'speaker_0': 'Mm hmm. Yep. So we have a motion and a second. All those in favor by motion carries unanimously. Thank you very much. And. We take a break now and keep. We're going to keep going. All right. Nine be my next referral.'",
        "'speaker_0': 'Consider this one is.'",
        "'speaker_1': 'To provide our immigrant and refugee support services and programs with nominal or minimal expenditures. Mayor Spencer and Vice Mayor Avila.'"
    ],
    "Outreach Efforts for Immigrant and Refugee Support Services and Programs.": [
        "'speaker_0': 'All right, so this referral is something. So I was able to attend the US mayor's conference recently in D.C.. During that time, I was able to hear from the mayor of Seattle and he shared things that they are doing in their city to.'",
        "'speaker_0': 'Assist immigrant and refugees. Immigrants and refugees. And and trying to do it utilizing volunteers within their community or people that want to volunteer and provide services to assist. Whether it's including. Counseling, psychological counseling, things like that, but also legal services for immigrants and refugees that have legal issues.'",
        "'speaker_0': 'And in a conversation with our vice mayor, as we were speaking, I said my number one takeaway from the conference was, in fact, that I think our city, because of the people we have here and we've heard it all all night, I'm going to say we have people that like to volunteer.'",
        "'speaker_0': 'And I think within our community. And then we also we have people that are immigrants and refugees. So if we can connect the dots and provide those services, to me, that was the number one takeaway from the mayor's conference for me.'",
        "'speaker_0': 'I was able to share it with our vice mayor and then she said, and I'm going to pass it to her.'",
        "'speaker_4': 'So I was in Seattle the weekend of the Women's March for my niece's first birthday, and we participated in the march. And I connected with some activists from Seattle and folks who worked for one of the council members office in Seattle.'",
        "'speaker_4': 'And they shared with me that they were doing a program to basically facilitate volunteers, volunteer assistance, attorneys coming in, working with the school districts to provide different services. And so essentially, I heard about the same program that the mayor had heard about, and it was serendipitous that we both heard about it independently, but we came with the'",
        "'speaker_4': 'same takeaways, which is that, you know, our city had just become a sanctuary city. We want to make sure that this is and, you know, that we are actually doing things to support our children, our families. We have a number of families in Alameda who and faith based organizations who are supporting refugees and refugee families.'",
        "'speaker_4': 'My partner went to school with a number of refugee children who had been taken in by Alameda families and, you know, really going and using, partnering with our schools to educate our our schoolchildren about what's going on. Give them context, allow them to know what resources are available oftentimes.'",
        "'speaker_4': 'That's a great audience that we can engage with. Our students are very thoughtful. They've been very active and activated by everything that's been going on. And, you know, I feel that it's a good opportunity to also empower them with information and knowledge about what their rights are, the rights of their classmates, friends, families, neighbors, that sort of'",
        "'speaker_4': 'thing. I do want to share that today. Actually, the Alameda County Board of Supervisors has approved $750,000 to go towards immigrant and refugee defense of immigrant and refugee populations, which will be administered through our social services agency. And that's going to go with an additional $750,000 that was given from an anonymous donor.'",
        "'speaker_4': 'So it's altogether 1.5 million that's going to be going towards immigrant and refugee defense. And a lot of that having spoken with some of our supervisors who are very excited about this. And is is the education and training aspect of it.'",
        "'speaker_4': 'And so if you look at the referral that Mayor Spencer and I put forward, we really want to facilitate this. And so many, so many members of our community have contacted both of us to say, I'm an attorney, I'm an immigration attorney.'",
        "'speaker_4': 'I have these specialized skills. How can I help people? How can I let them know what their rights are or provide services? In law school, I participated in a number of legal clinics that were free naturalization clinics where we were doing one on ones, giving just kind of cursory pro-bono guidance and counseling as to timelines, fees, costs'",
        "'speaker_4': ', what type of paperwork was involved, what kind of documentation was involved. And so to the extent that the city can act as that facilitator and really do that to bring our community together and to offer these services, I've also heard from a number of business owners, nonprofit executives, who are saying we want to make sure that our'",
        "'speaker_4': 'staff is educated as to what they should do if they're under different events and how we can help our staff who might have concerns whether they be about clients or fellow employees. And so one statistic that I do want to put out there is 439,000 residents of Alameda County are immigrants or refugees.'",
        "'speaker_4': 'That's approximately 30% of our residents countywide. A number of those do live here in the city of Alameda. And I think that this is a step for us to take to actually connect them with those services that are readily available in the community to help facilitate that.'",
        "'speaker_4': 'To help. In ensure the fact that we are in fact giving them an opportunity, an opportunity for clear pathways and to actually activate and make sure that they are using all of the laws and resources that are available to them and at that.'",
        "'speaker_0': 'And I do want to add so I appreciate the vice mayor joining me in this referral. And so thank you, member Ashcraft. Thank you, Mayor Spencer and Vice Mayor Vella. So I'm not sure in the referral, the piece about what the school district does is a little clear, a little less clear to me how we would implement'",
        "'speaker_0': '. Although I will hasten to add that the Mayor and I sit on the liaison committee between the city and the school district, but I did a little digging around myself today, and I see our library director, Jane Sasaki, there in the back of the the the chambers, because the Alameda County Bar Association has long had a program'",
        "'speaker_0': 'called Lawyers in the Library. And you may or may not know that our main library is one of those locations. The first Wednesday of the month, the lawyers who are volunteering pro-bono come and they all have different expertize and you go in the order of a lottery.'",
        "'speaker_0': 'But Jane tells me, just like he tells me, that everybody manages to be seen. And in fact, the library has now added another evening, which is lawyers in the library at the West End Library branch on the third Monday night of the month.'",
        "'speaker_0': 'And I appreciated her saying it's a little less private because they don't have the individual conference rooms that the main library does. But staff and we have great library staff has created a semi-private corner for those meetings because confidentiality is always important when you're dealing with a lawyer.'",
        "'speaker_0': 'So what Mr. Sakai mentioned, and I thought it was a lovely offer and I think it dovetails with what the mayor and vice mayor have said, is if you can arrange for a pro-bono lawyer with immigration and refugee rights expertize, we could offer library lawyers in the library on another night, Monday or Tuesday at the main library'",
        "'speaker_0': '. I would leave the details to the folks who are who are doing this. But like the vice mayor, we actually attended the same law school but few years apart. But Santa Clara Law has has a very good legal clinic and I volunteered for another one when I was practicing in San Francisco.'",
        "'speaker_0': 'And it's just it's really a very satisfying, fulfilling work to help people understand their rights. So, yes, I know my community enough to know we have really dedicated, smart, talented people. And so if there is a way that we can connect them and the library, which we're also proud of and I love knowing that it's also at'",
        "'speaker_0': 'the West End branch is willing to step in. I think we're we're off to a good start. Thank you. And Birdie, did.'",
        "'speaker_3': 'You want me doing concerts?'",
        "'speaker_0': 'So we, you know.'",
        "'speaker_3': 'Should we wait.'",
        "'speaker_0': 'Till we do have public comments?'",
        "'speaker_3': 'I'll hold my comments till the.'",
        "'speaker_0': 'All right. So I'm going to go ahead and call the public at this point. Anna Rossi. Polly Lim. Fred Engel and then Michael Yoshi.'",
        "'speaker_1': 'Mayor. City Council people. Staff. My name is Anna Rossi. I am the chair of the Alameda Deanery. Welcome the stranger refugee group. We've been in existence for about one year now, and I got to go sideways for a second and say I also graduated from Santa Clara Law School.'",
        "'speaker_1': 'I have a reunion. We can. We can. First of all, on behalf of the Refugee Project and our group, we want to thank you very much for having this conversation. We've been struggling for a year to bring the refugees to the front, to the forefront of Alameda so people would understand how much assistance we can give to'",
        "'speaker_1': 'them and how much help we need. We started off thinking, this is easy. We can transition a family and I could do it by myself. And reality is, it's a really hard thing to do. Our group consist of volunteers from the four Catholic churches in Alameda.'",
        "'speaker_1': 'And we have about 80 volunteers, not all at once. They go up and down. We have a core group of 2020, but we have 80 people who have offered to help at various times. Our current family has been here since the summer of 2016.'",
        "'speaker_1': 'There are young father and even younger mother and an 18 month old baby. The father assisted the US government in translating in Afghanistan. He spoke fairly good English. His wife came, not speaking a word of English. They knew one person in Alameda before they knew us.'",
        "'speaker_1': 'Now. The husband has a full time job 40 hours a week. He just got his driver's license, which was really exciting. The wife has learned some English, and she can she can talk to all of us. And they're starting to make a home in Alameda.'",
        "'speaker_1': 'In what was originally a very strange community to them. It wasn't the hills of Afghanistan. Our current family is on the cusp of really being self sufficient. Which means that our next task will be to look for yet another family.'",
        "'speaker_1': 'When we started this project and have a company, this family. Through their transition to a home in Alameda. We've all shared in this wonderful journey not not just the family. We've learned so much and we've grown so much from it.'",
        "'speaker_1': 'But what has been the hardest for all of us? What has caused us nights of not sleeping. Nights of crying. Nights of laughing. Out of hysteria. Is housing. We had a very difficult time in this wonderful community. And Alameda is a wonderful community.'",
        "'speaker_1': 'Finding somebody who would rent a house to a refugee. I personally said I will guarantee one year rent. And they said, we don't rent to refugees. Now, I know that's illegal. I'm an employment lawyer, but you're not going to sue every landlord in Alameda.'",
        "'speaker_1': 'So we've. A few more seconds. But we've decided that what we need to do is have a breakaway group to start up a transition, a transitional housing research project for refugees and immigrants. And it will be multi denominational and non-denominational throughout the island of Alameda.'",
        "'speaker_1': 'We've had a first meeting of four people and we're planning on growing that shortly. But what would be really helpful to us is to have the support of the city of Alameda. And I read your a little blurb that said you wanted to support without having a lot of money.'",
        "'speaker_1': 'And I understand that. And one thing that we figured you could do for us, you could do for the refugees and you could do for the immigrants is designate one house when you're doing low cost housing, one house for refugees and one house for immigrants wouldn't cost you a penny more than whatever you rented out for it'",
        "'speaker_1': 'to low cost housing. And it would give recognition to the refugees and recognition to the immigrants. It would be a way for the city of Alameda. To show the county, the world, the United States. That you're really, truly willing to support these people.'",
        "'speaker_1': 'They're people just like us. And they've come to this country looking for something that I sure hope we can give them. It would truly represent the city of Alameda support of refugees and immigrants situation. And we ask you to consider that.'",
        "'speaker_1': 'And we thank you very much for raising this issue tonight.'",
        "'speaker_0': 'Thank you. Holly.'",
        "'speaker_4': 'Good evening. My name is Holly, Ronnie Lim, and I am a board member of Filipino Advocates for Justice and a resident of Alameda. And as a Filipina immigrant, I encourage the city council to adopt efforts that will provide services to immigrant and refugee residents and students.'",
        "'speaker_4': 'The last time I was here, I spoke to you about adopting a sanctuary city policy and the importance for a community to offer safety and support to its immigrants and refugees as a way to create thriving individuals who can engage and contribute to their communities.'",
        "'speaker_4': 'I am proof of how safety and support can do this. I am also an educator teaching ethnic studies at Laney College. Last night I taught how stereotypes like the Yellow Peril stereotype deemed Asian-Americans as a threat and how this imagined threat has caused implications like the wrongful internment of Japanese-Americans.'",
        "'speaker_4': 'We are at a critical time where the present measures are passed, and we have the choice to learn from our country's mistakes and make the right decisions for our community. For me, that means offering resources to our community, like Seattle's Family Unity Project counseling and peer support for our immigrant and youth.'",
        "'speaker_4': 'Sorry, but our immigrant and refugee youth. Clear avenues for the public to support. Site for the public to report. Incidents of bias, hate speech and violence. And the formation of a city supported group that can support these programs.'",
        "'speaker_4': 'I know these programs are needed because research proves it. I once worked for Human Impact Partners, a public health nonprofit organization which released a study in 2012 about the health impacts of deportation on the children of undocumented immigrants.'",
        "'speaker_4': 'At the time of its release, an estimated 4.5 million children nationwide who are U.S. citizens by birth live in families where one or more of their parents are undocumented. Nearly 30% of undocumented parents reported that their children were afraid, either all of the time or most of the time.'",
        "'speaker_4': 'Nearly half reported that their children had been anxious, and almost three fourths of undocumented parents reported that each child had shown symptoms of post-traumatic stress disorder. We can all agree that we want a safe and healthy place for all of our residents.'",
        "'speaker_4': 'I encourage the City Council to not only consider efforts but to adopt and implement an immigrant and refugee support programs and services rooted in community needs and input. Thank you.'",
        "'speaker_0': 'Thank you, Fred. Michael and then Alan Prior. And if anyone else wants to speak on this item, please submit your slip.'",
        "'speaker_3': 'Mary Spencer, vice mayor and council members. Thank you for your time. My name's Fred Pringle and I'm here representing Philippino Advocates for Justice. We work with young people and their families in the Filipino community here in Alameda and we.'",
        "'speaker_6': 'Are.'",
        "'speaker_3': 'Hearing from a lot of them that there is a lot of unrest and worry from our community members with the current political context in this country, specifically executive orders and other policies that are coming down and don't know what it means for them and their future in this city and in this country.'",
        "'speaker_3': 'And so we wanted to take the time to thank you, Mayor Spencer, Vice Mayor Vella, for making this referral and to the council members for and staff for seriously considering the needs of our immigrant community here in Alameda and the supports that they need that can be facilitated by the city as a group that particularly works with'",
        "'speaker_3': 'young people here in Alameda, we understand the role of young people in immigrant families. They often have to take on the load of translator and as sort of bridges for adults in their families to the larger world. And so the focus on the referral and the Seattle model on schools and outreach to young people we think is'",
        "'speaker_3': 'particularly powerful and hopeful. And we think that it's a really strategic way of focusing your outreach efforts to support as many people as possible, as quickly as possible. And so thank you again for your commitment to all of the people of the city, including immigrants, refugees and everyone else affected by the recent developments at the national level'",
        "'speaker_0': '. Thank you. Michael Yoshi, then Alan Prior.'",
        "'speaker_6': 'I put my trying to put my alarm. Watch out here. Okay, I'm out. Madam Mayor and City Council members Michael Yoshi from Buena Vista Methodist Church. I'm the pastor there. You may have known that we have a refugee ministry that we are engaged in, and we're accompanying a Central American family currently and as part of the East'",
        "'speaker_6': 'Bay Interfaith Immigrant Coalition that is also participating with a number of other current Haitians in the East Bay and. We also I wear another hat and that is I chair the Advocacy and Justice Committee for our conference in the our church belongs to the largest denominational conference.'",
        "'speaker_6': 'So Northern California Nevada is our conference. We have this committee that under that has an immigration task force as well. And so we're very tuned in to what's going on with immigration issues around us today. In fact, we'll be having a consultation on February 20th in Berkeley with our immigration task force.'",
        "'speaker_6': 'You're invited to come, if you'd like to, will be networking with attorneys and with community organizers around what they're doing around immigration concerns at this time. Our new bishop Bishop Maneuver Carcano, who just came to us this past year, is also our national chair for our immigration task force for the United Methodist Church.'",
        "'speaker_6': 'We have 60 sanctuary congregations across the country. We have a large network of congregations working on immigration issues. And so what I offer to you today in first of all, thanking you for Mayor Spencer and for Vice Mayor Avila for bringing this forward.'",
        "'speaker_6': 'As you talk about wanting to network with different groups, including faith communities, we offer the resources that we have and some of the experiences and expertize that we have on this issue. And we look forward to having meetings with you to consult, talk about best way so we can work together as a whole community.'",
        "'speaker_6': 'I really think the idea of working with the schools is a great idea because I think children and youth are being impacted in ways that I think, as some of the other speakers have talked about, are not always recognizable for them.'",
        "'speaker_6': 'But post-traumatic stress is definitely happening among families. We see this taking place in particularly around children and young people who really are assimilating feelings about the larger climate that's going on today. So with that, you know, I just want to lend my support to the proposals that you have before you.'",
        "'speaker_6': 'I also echo my concerns about housing, given that we're concerned about that as well. And if there's ways that we can collaborate on working on transitional housing for refugees, we really would be interested in working with you on that.'",
        "'speaker_6': 'So thank you very much.'",
        "'speaker_0': 'Thank you. Alan Fryer and then Sister Pat Nagle.'",
        "'speaker_2': 'Thank you, Mayor and council people.'",
        "'speaker_6': 'I just want.'",
        "'speaker_2': 'To applaud you for what you're doing here. This is great. I'm. Took public speaking with gym back there, but he got all the.'",
        "'speaker_6': 'Smarts out of it. I mean, I was just.'",
        "'speaker_2': 'Blown away with the number of people that were at the march, the gathering that we did at the.'",
        "'speaker_0': 'Islamic Center.'",
        "'speaker_2': 'Yeah. And, you know, and the stories that I hear, you know, from teachers about students that are, you know, afraid when they get to school, you know, Monday morning, because they don't know what's going to happen with their family and where they're going to be living.'",
        "'speaker_2': 'And. And I also want to share a friend of my wife called this weekend and she's an immigrant and it doesn't quite documented. And she had some really bad pains in her gut. And she was afraid to go to Highland because she might be turned in.'",
        "'speaker_2': 'And my wife called one of the council people, and she got her in touch with a super advisor in the county. And they assured her and she went to Highland and everything was fine and they didn't turn her in and she came home.'",
        "'speaker_2': 'So, you know, this we've got a really good community here and it really is inclusive of everybody. Thank you.'",
        "'speaker_0': 'Thank you. Sister Pat. They don't. She's our last speaker on this item.'",
        "'speaker_10': 'Mayor Spencer, council members, staff and and everybody here still. Well, I can't tell you how heartened I am by this effort. I am deeply moved and I really appreciate your commitment. This is the way that we can change the world.'",
        "'speaker_10': 'We come together around what we have in common. We can change the little place where we are now. We can really strengthen our relationships with each other. And that will affect the larger system. It'll affect the world beyond.'",
        "'speaker_10': 'So I am very heartened by this. I want to speak, though, as you know, in support of the efforts to address the housing issue here. We cannot say that we welcome refugees and immigrants if we don't help to provide housing.'",
        "'speaker_10': 'I had one very difficult time finding housing for the family that we have worked with. And so I encourage you to think outside of the box and to find ways to bring us all together property owners, landlords, realtors, citizens, renters, owners to talk about this issue, to Facebook, and to create a response.'",
        "'speaker_10': 'We all share. Every single one of us. The right to safe, secure housing. So thanks again. And you can count on my efforts to collaborate with you in whatever way.'",
        "'speaker_0': 'Thank you. And she's our last speaker, council member. Do you want to go.'",
        "'speaker_2': 'Next or go next? Yeah, you can go first.'",
        "'speaker_0': 'Remember matter arresting.'",
        "'speaker_2': 'I think you've laid a nice outline of a plan that we can adopt. Here in Alameda. And I'm hoping to get a recommendation from the Social Service Human Relations Board as as a body so that we can understand in the context of what resources we have and what resources have been offered, how this plan or elements of'",
        "'speaker_2': 'this plan can be implemented. So I'm willing to support this to get the ball rolling and. If we can do.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Member Odie. Thank you, Madam Mayor. I want to thank my colleagues for bringing forth this referral. When we did the Sanctuary City Resolution a few weeks ago, one of the arguments I remember making was that if we're going to have a saying that everyone belongs here, then we should actually have policies like the sanctuary city that reflect'",
        "'speaker_3': 'that saying. And this is kind of the next step. If we're going to have a sanctuary, we're going to be designated as a sanctuary city and say that our immigrants and refugees are welcome here and we're not going to turn anyone in and we're not going to discriminate.'",
        "'speaker_3': 'Then we need to take that next step and back up that resolution with services. So I think this referral does a really good job of starting that process. Now, every day in my job, I do this type of work.'",
        "'speaker_3': 'You know, people call in with issues. They're more than just refugees and immigrants. But everyone in Alameda and Oakland and San Leandro and you know, we do have the Blue Book, The Eden, you know, two, one, one. But that's not enough.'",
        "'speaker_3': 'I mean, we have to rely on, you know, all sorts of different resources, like the referral talks about our schools, our folks, like the Filipino advocates for justice and counselors and social workers and attorneys. And that that's one area where I think, you know, our city could do a lot better job of is connecting our residents with'",
        "'speaker_3': 'services so like a council member matter. So you know I look forward to seeing what shrub comes comes up with and you know, I know that we're hiring a new city attorney or assistant city attorney. And I think that individual is going to be focused on constituent type services problems, issues.'",
        "'speaker_3': 'So I think that's a very good start. Not all ideas. Great ideas come from me. So I know other people have great ideas and I don't want to steal the vice mayor's thunder. But when her and I were talking about some of the things the city could do as far as assisting our tenants, she came up with'",
        "'speaker_3': 'an idea that, you know, we really hear from a lot of tenants and a lot of residents that, you know, they their housing problem is is really symptomatic of larger problems, you know, that have festered or gone, you know, unchecked or, you know, it really even looked at.'",
        "'speaker_3': 'So the idea that the vice mayor came up with was that, you know, we actually have as part of our housing program, you know, a social worker or a case manager or somebody that could, you know, do intake and say, you know, this person, yes, they have a housing issue.'",
        "'speaker_3': 'Yes, they have an issue with their landlord. But, you know, they're also not receiving the health coverage that they need or they need other services or maybe they do need help paying their rent and they can connect with Catholic Charities or other social services that help paying the rent.'",
        "'speaker_3': 'So I think, you know, not only do I think this is a great referral, you know, I think we should even do more than just as the thing says, minimal and nominal expenditures. I think we have a responsibility to connect our residents in need and in trouble, whether they're immigrants, refugees or not, with different social services and'",
        "'speaker_3': 'different services that they may they may be eligible for. And I will say before I close that, you know, Yusef Law School does also produce some really good people. And I went there because of their social justice commitment, and I'm glad that I did.'",
        "'speaker_3': 'With that, I'd like to move approval on the referral ticket.'",
        "'speaker_0': 'And I'd like to add that I recently attended the first Latino Hispanic roundtable. That's part of our we started it through our Alameda Unified School District, I can't say. And they have offered to provide translators, which is another issue translators.'",
        "'speaker_0': 'And I also reached out to Dr. Sean McFetridge, the superintendent of the school district, and he does also support the referral. So I reached out to him before I submitted it because a lot of it does include working with the school district and its member, Ashcraft Church.'",
        "'speaker_0': 'We already have our liaison committee with the school district, so that that would be a natural way to work, work on these issues. We have a motion and a second. All those in favor I motion carries unanimously. Thank you, everyone.'",
        "'speaker_0': 'Council communications.'",
        "'speaker_4': 'Vice mayor. I think this is the point in time that I let everybody know that I attended the League of Cities. New council members boot camp and training in Sacramento a few weeks ago. It was very informative, met with a lot of other elected officials from the area.'",
        "'speaker_4': 'I also attended the League of Cities Dinner for the East Bay a couple of weeks ago.'",
        "'speaker_0': 'Along with a few along along with all the women on the.'",
        "'speaker_4': 'Women on the council. And again, I think this is these are the types of opportunities that also help us to connect with our our fellow elected officials to hear what they're doing in their communities. And then I attended the Airport Noise Forum as well, that same the same week as the League of Cities Training.'",
        "'speaker_4': 'There was at that committee, we voted to move forward with a proposal from the subcommittee addressing the noise issues at the airport, having to do with the gen implementation for those of us who aren't as familiar with all of the terminology.'",
        "'speaker_4': 'It's basically the new flight patterns that have been put in place since 2014, 2015, that have caused an increase in noise complaints from our constituents here. Both the mayor and I are the liaisons to the airport noise forum.'",
        "'speaker_4': 'We also had a meeting today and a briefing with the folks from the Noise Forum to help us learn all of the terminology, among other things. And I also attended the LED abatement meeting with the county JPA. And on that board, we've been talking about the different ordinances in place in all of our cities.'",
        "'speaker_4': 'And in specific regards to the report that came out recently about the lead levels mainly in Oakland, but also countywide and what we can do to work together. With regards to our ordinances.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_3': 'Thank you, Madam Mayor. Quick report out. I attended the Starboy Stalk meeting, as I always do, and there was really nothing of critical import for Alameda. But we did sign off or at least do our part in signing off on the landfill out in Livermore.'",
        "'speaker_3': 'And I was honored to attend with many of my colleagues the Kona's Barbecue and love with a big basket of Cuban. You've been bought some stuff that I bought that was made in Cuba, so that was kind of cool and I was really honored to participate also with a number of my colleagues at the Islamic Center.'",
        "'speaker_3': 'And and then we actually marched around the block, which was kind of.'",
        "'speaker_4': 'Fun, past my childhood.'",
        "'speaker_3': 'Home.'",
        "'speaker_0': 'Remember Ashcroft. And I was going to say that I also took part in the gathering at the in front of the Islamic center. It was a Sunday afternoon. Nice weather and it was really sweet. I heard the count was something like 400.'",
        "'speaker_0': 'But as we were approaching, I brought my husband. I think it's the first march he's ever attended because we're very different people. But as we were approaching, we saw families coming, pulling children in wagons and on bicycles and tricycles and people with their dogs and just all generations.'",
        "'speaker_0': 'And yeah, it was lovely. And the folks, the imam and the and these very gracious ladies from the Islamic center served refreshments and were just so pleased and so gracious to have us there. And I told other other folks who were there that it made me proud of my city to just see that spontaneous, because I think'",
        "'speaker_0': 'it was just organized online the day before and folks just came and made their signs and that was great. Then a week ago today, early in the morning, 5 a.m., a number of us gathered to help with a countywide homeless count.'",
        "'speaker_0': 'The mayor was there and city manager was there. Debbie Potter, head of our Community Development Department, Jim Fran's Social Services Department, and some residents, just some Alameda residents. We all we went first to the West Oakland Youth Center at five in the morning and then we got our census tract maps we all asked to be assigned in'",
        "'speaker_0': 'Alameda because we want to understand the homelessness situation in our own city and the city manager and I partnered upon because we are also asked to respect confidentiality. We can't really tell you how many and where we saw them, but just let it be known that homelessness exists in our city.'",
        "'speaker_0': 'And and as the city manager and I observed, sometimes hiding in plain sight. So it's sobering, but it just it speaks to the fact that we are part of this, the Bay Area and this situation exists everywhere. And we're not immune.'",
        "'speaker_0': 'We're a wonderful city, but we're not immune and we're going to work together and find solutions. But the first step in that and oh, another Alameda resident was Sarah Otis, daughter of my colleague, who is a staff aide to our county supervisor, Wilma Chan.'",
        "'speaker_0': 'But the first step and these are numbers that go to head at the federal level where I hope they will still be counted in any way. And then that's the first step in knowing what the situation looks like and then to start addressing it.'",
        "'speaker_0': 'So but anyway, kudos to everybody for getting up at the crack of dawn. Embarrassing. So I already shared, of course, my highlight from the U.S. mayor's conference. And of course, I joined vice mayor at the Airport Noise Workshop.'",
        "'speaker_0': 'And I want to thank the Port of Oakland for hosting us and as an extremely informative meeting. And then I also had the opportunity to meet, along with staff, the new president of the College of Alameda that I want to share with the public.'",
        "'speaker_0': 'Jim Karas, he's been he's been there for approximately three years, and he will now be leading the college. And I and I'm actually really looking forward to it. For those of you that are familiar with our college, we seem to have had quite a few turnovers of presidents lately, and I'm really hoping that he stays and that'",
        "'speaker_0': 'we are better able to serve the needs of our community members that attend the local community college. I think that's very important. And I also had the opportunity, along with, and I believe, member Ashcraft, to attend last night's meeting that I also thought was extremely informative.'",
        "'speaker_0': 'That being said, I will now adjourned the meeting. Thank you. And it's 9:45.'",
        "'speaker_3': 'P.m..'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_4': 'I just wanted to say I just wanted to recognize Brett Webb, who actually organized the Islamic Center event that we had and stand in solidarity along with his partner, Amanda Cooper, who's not here. So thank you so much for taking the initiative.'",
        "'speaker_4': 'And it was really great to see the outpouring of everybody there.'",
        "'speaker_0': 'That being said, good evening.'",
        "'speaker_2': 'Turning the.'",
        "'speaker_3': 'Point left.'",
        "'speaker_2': 'For Bret.'",
        "'speaker_3': 'There's.'"
    ]
}