{
    "Mayor's Appointments to Housing Authority and Economic Development Panels.": [
        "'speaker_0': 'Thank you very much, everyone, so quickly, because this is just the announcement in your request vote at the next meeting before the Housing Authority Board of Commissioners. I am pleased to nominate Ms.. Christina mann. I miss my name is the Director of the Housing and Community Development Department for the City of Oakland.'",
        "'speaker_0': 'She has a master's in city planning from UC Berkeley and a Bachelors in Urban Studies from UC San Diego. She spent. Extremely well qualified. And then for the two nominees for the mayor's economic development advisory panel, where we have representatives from different sectors of our economy.'",
        "'speaker_0': 'And there were a couple of openings to fill. I would like to nominate Yvonne Jennings, who is the dean of Career and Workforce Education at the College of Alameda. And I would also like to nominate Dan Paretsky with Blue Rise Ventures, and that is the entity that owns Marina Village Business Park, which is getting quite a few'",
        "'speaker_0': 'exciting tenants in the biotech field, R&D. And these are my two recommendations. So thank you very much for allowing me to put those nominations forward at this time. Okay. And then we will move on to item number three, which is proclamations, special orders of the day and announcements.'",
        "'speaker_0': 'And I do have a proclamation to read and. And I will start now. This has to do with October being lesbian, gay, bisexual, transgender and queer questioning man. Whereas, for 15 years, the month of October has been dedicated to the celebration of the important role lesbian, gay, bisexual, transgender and queer questioning individuals have played in creating social'"
    ],
    "Smart City Master Plan Needs Assessment and Recommendations. [Continued]": [
        "'speaker_1': 'A Yes. It's a recommendation to review, comment and provide direction on preliminary needs, assessment and recommendations for development of Smart City Master Plan. And we do have staff and consultants here and they will be giving a presentation. We are promoting them now.'",
        "'speaker_0': 'All right. I see our I.T. director, Carolyn Hogg, is here, and I know there's some consultants joining her.'",
        "'speaker_3': 'Hello? Hello. Hello. Are we ready? Good evening, Madam Mayor. Vice Mayor. Council members. I'm Carolyn, Director of Information Technology. Here to present the draft Alameda Smart City Master Plan and recommendations along with David Hoon and Monique Furman, our consultants from AI Terrace.'",
        "'speaker_3': 'This draft was developed in partnership with multiple departments and many community members and stakeholders. Next slide, please. Recognizing that there's a ten minute time frame for presentations. We're going to do a deeper dove into three or four of the more critical topic areas, but we will be available for questions from the Needs Assessment Recommendations memo.'",
        "'speaker_3': 'We're bringing this draft plan to you tonight as the city recognizes there's many opportunities to improve the digital experience or lack of digital inclusion in our city that we are now keenly aware of as we continue to live through the pandemic with much funding available for broadband infrastructure, the timing seems right to develop a plan.'",
        "'speaker_3': 'A smart city can be a vague concept, and each city may have different smart city plans. But this plan lays out the foundational pieces that we are considering considering with smart cities work that enable future decision making about policies and practices in a variety of areas, and on how to use data and technology to improve our community'",
        "'speaker_3': 'members lives. Next slide, please. So these are the objectives I identified from the stakeholder meetings that we held, and it also ties to a number of things that Council has expressed interest in recently. I'm going to focus on the equitable internet objective, which was a council referral in addressing equity, priority populations and local business community needs.'",
        "'speaker_3': 'So right now, a good example of the city's digital divide is out at Alameda Point, which is considered a dark area for Internet fiber, but where a large equity priority community population resides. It's also an essential area for emergency response and the location of the future veterans hospital.'",
        "'speaker_3': 'Because of the Stark area, the city's gym and club. They don't have wi fi in those buildings because it doesn't have fiber to those locations. And we costed it out with the local telecommunication carrier. It would cost the city $230,000 in construction costs alone just to bring fiber to the one building at the gym to offer free'",
        "'speaker_3': 'public Wi-Fi. The city would basically be investing city funds in a private companies fiber network rather than being used for public investments in city owned core fiber network. And David, our consultant, is going to go into further detail.'",
        "'speaker_3': 'Dale, on the core fiber ring, but this is one of the reasons why we were considering looking into some of the ARPA funding and the concept of equitable Internet isn't just tied to physical infrastructure, as you can see in the report, to offer free, affordable wi fi.'",
        "'speaker_3': 'But it's also the soft infrastructure, such as possibly establishing service learning programs in partnership with our educational institutions and other training programs for ongoing community technology training needs so that we don't repeat the unpreparedness that the city institutions did experience when we were thrown into the distance learning and remote work and telemedicine.'",
        "'speaker_3': 'I do want to point out, though, that with the equity priority community members right now, they typically rely on more temporary and somewhat unreliable technology, such as using things like hotspots. And that's connected through cellular service and with sporadic cellular service here on the island.'",
        "'speaker_3': 'That solution can be disadvantageous in certain locations compared to connecting to the Internet through fiber for distance learning and remote work and telemedicine. David's going to discuss the initial fiber runs throughout the city. That does include Webster Street to City Hall, West to Santa Clara Park Street, Broadway to the golf course with a potential link to San'",
        "'speaker_3': 'Leandro Lit San Leandro Fiber Network for Smart Traffic Corridor. Next slide, please. So to date the existing conditions have been evaluated, which helped us draft this needs assessment with at least 11 stakeholder organizations participating. This helped us get a very good, broad range of input from community members that represent their interest groups.'",
        "'speaker_3': 'Next slide, please. So these are the the stakeholders that we did meet with and for the business groups we met with the Chamber of Commerce, West, Alameda Business Association, downtown Alameda Business Association, College of Alameda, Alameda Unified School District.'",
        "'speaker_3': 'And for the Equity Priority Community Member Stakeholder Meetings, we met with Alameda Educational Foundation Paratransit, Alameda Family Services, Alameda Senior Center through Rec and Park and Alameda Point Collaborative and Alameda Housing Authority. So the city also presented this draft to Chamber of Commerce on September 1st.'",
        "'speaker_3': 'And by working with these focus groups, we feel we have a really good representation of our community in this plan. As I mentioned last week in Alameda Economic Forecast town hall meeting, which I was thrilled to hear. Alameda City will shine in the wake of the pandemic by focusing on telecommuting and lots of green shoots that community'",
        "'speaker_3': 'development is championing, which is has direct ties to this plan. But so noting that investments made in broadband has a direct tie to economic vitality. There was a recent Purdue University study that estimated that every dollar invested in broadband brings back $4 in economic benefits to that location.'",
        "'speaker_3': 'So next slide, please. So David is going to take this presentation over now and then hand it back to me at the end. Thank you.'",
        "'speaker_2': 'Thanks, Karen. So my colleague Monique and I well we think over the recommendations that are in the report and I slightly. So we'll start with what is a smart city since the term is generally very broad. As Carolyn mentioned, there's lots of different definitions for it.'",
        "'speaker_2': 'But we like the way that the National League of Cities described describes a smart city as one that has developed some technological infrastructure that enables it to collect, aggregate and analyze real time data, and has made a concerted effort to use that data to improve the lives of its residents.'",
        "'speaker_2': 'Next slide, please. So so in that context, with a number of recommendations that are summarized in this table, for each recommendation, we have an associated timeframe as well as a high level cost estimate for each year. Not that in the time frame for some of the recommendations, it's a range.'",
        "'speaker_2': 'And that's because we expect these improvements to be implemented in phases over time, just due to the scale and cost that would be that would make it unlikely to happen all at once. Next slide, please. So we'll start with recommendation number one, which is to build out the city's communications network.'",
        "'speaker_2': 'And we really see this as the foundation and the core of all smart city initiatives, primarily because it is a required and key element to support other smart city initiatives that are built upon it. For Alameda, we envision the communications network to be primarily fiber optic with some wireless connections, and we envision that it'll connect most, if'",
        "'speaker_2': 'not all, city facilities and systems, and that the network will be resilient and redundant so that if there's a break somewhere in the network, there are redundant paths to keep the system up and running. Next slide, please. So we've developed this map that shows a proposed layout for the Connections Network.'",
        "'speaker_2': 'And we can go into more detail on this during Q&A if needed. Next slide, please. So recommendation number two is to develop public Wi-Fi. And we really see this as a way to enhance Internet availability and decrease the digital divide in Alameda.'",
        "'speaker_2': 'There's also an element of supporting economic development by attracting business and commerce to key business districts. Proposed Wi-Fi locations will be centered around public gathering places such as public service facilities, parks, commercial and business district areas. Next slide, please.'",
        "'speaker_2': 'So this map shows the proposed locations for the way high deployment locations are shown with the orange wireless symbol. And Pink Zones represents the commercial areas along Park Street and Webster Street. So at this point, I'm going to turn over the presentation to Monique, who will go over the rest of the recommendations.'",
        "'speaker_3': 'All right. You can advance to the next time. So I'll quickly go over the remaining ones as they're all basically supported by recommendation number one, which is the fiber communications network. But recommendation number three is to deploy citywide emergency vehicle preemption, which is technology that provides emergency vehicles priority during an emergency.'",
        "'speaker_3': 'I mean, it just means it aims to enhance public safety by reducing response times and therefore enhancing the service that public safety is able to provide. Next slide, please. Recommendation for is to deploy transit signal priority a similar technology to emergency vehicle preemption which provides priority to transport transit busses to be able.'",
        "'speaker_0': 'Yeah this transformation is firming of the ten minute limit for a staff presentation has been exceeded. But this report has been a long time coming. So let me see if I can get a motion from my city council colleagues here to add a little more time.'",
        "'speaker_0': 'It does take four votes. Can you give me a sense of how many more minutes you think you need?'",
        "'speaker_3': 'I would say maybe three. I will go as fast as possible.'",
        "'speaker_0': 'All right. Council Motion Councilmember Knox Way.'",
        "'speaker_2': 'I'll make a motion to extend the presentation time by 5 minutes.'",
        "'speaker_0': 'All right. And that was vice mayor. Okay. A motion by Councilmember Knox White to extend by 5 minutes, seconded by Vice Mayor Vella. And any discussion thing. Then we have a roll call vote, please.'",
        "'speaker_1': 'Rotation. Yes, sir. Spencer, I knocked. Not quite.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vella. You were on your muted tie. Mayor Ashcroft, I. That carries by five eyes.'",
        "'speaker_0': 'Okay, so take it away quickly. Thank you. That's from me.'",
        "'speaker_3': 'Thank you. As I was saying, the TSP actually provides priority to busses, which helps to enhance bus service, making it more reliable, and obviously incentivizing transit to expand service on the island. Next slide, please. So this map actually shows where we already have TSP, which is in the green corridor on Webster, and we're proposing to expand it'",
        "'speaker_3': 'out to some of the other main corridors on the island, which do have some traffic from AC transit busses. Next slide, please. Our recommendation number five is to partner with ISPs. As you probably already know, the city is already partnering with Internet service providers to enhance existing Internet service opportunities and increase broadband availability on the island.'",
        "'speaker_3': 'So the city can further partner with ISPs to focus on lowering Internet costs for residents and mitigating predatory pricing. Next slide, please. Recommendation number six is to develop a dog once an installation and a dog once policy and installation standards.'",
        "'speaker_3': 'And this is this is a a bit of a plan to make sure that we're. Proactively building out planned infrastructure when we're already doing other improvements in the same areas. And the city has actually already begun making moves to implement this policy within public works.'",
        "'speaker_3': 'Next slide, please. Recommendation number seven is to implement centralized transportation management, and this recommendation includes the deployment of a centralized management system, which enables the city to remotely operated signal assets and provides key information for dealing with transportation issues in Alameda.'",
        "'speaker_3': 'The system has the capability to ultimately reduce person hours needed for maintenance and enables the city to fully utilize the technology that's already in place at their signals. Next slide, please. Recommendation number eight is to interconnect the EOC and city facilities, and interconnection of these facilities is an important element of the Smart City concept in that it'",
        "'speaker_3': 'provides centralized locations for management of city business and assets. And this is especially important in the case of an emergency when the EOC would be activated. Next slide, please. Recommendation number nine is to implement transportation, data analytics and the implementation of analytics is another opportunity for the city to utilize their existing assets to collect transportation network data'",
        "'speaker_3': '. Better understanding how multimodal traffic utilizes the city's transportation network will help to inform decisions for future improvements. This data collection would, of course, abide by the city's data privacy policies. Next slide, please. And the final recommendation is to deploy traffic, a traffic monitoring camera network.'",
        "'speaker_3': 'And this centers on the deployment of a network of closed circuit television or CCTV located at commercial areas and Key Island access points. And these cameras would be used for improved incident management and emergency response and would not be placed in residential areas.'",
        "'speaker_3': 'The management of this CCTV system would also closely abide by the city's data privacy policies. And with that, I will turn it over or actually go to the next slide, please. And this this one shows a map of where we're proposing for these CCTV to actually be placed.'",
        "'speaker_3': 'You'll notice that they're at key points where there are chunks in the transportation network that can affect things like emergency response time or even traffic incidents and cause backups in two neighboring cities and on to the island. Next slide, please.'",
        "'speaker_3': 'With that, I'll turn it back over to Carolyn. All right. Thank you. So just quickly, this project is estimated at $6 million to build out that fiber network needed to begin to implement the top ten recommendations. Broadband has been identified as being eligible to use some of the city's ARPA funding, which must be spent by the end'",
        "'speaker_3': 'of calendar year 2026. And some other potential funding that we're looking into is the Federal Infrastructure Bill and the National Telecommunications and Information Administration opportunities. But we want to leverage those resources and look for those funding opportunities. So with this week, our next steps are to finalize these recommendations, complete the plan, and come back to council for'",
        "'speaker_3': 'approval. As you can see, these foundational pieces do present some ties to a number of things that Council has expressed interest in, as well as many community benefits. So as always, before proceeding with any purchase, we will come back to council with the actual cost.'",
        "'speaker_3': 'So this concludes our presentation and we are here to answer any questions. Thank you.'",
        "'speaker_0': 'Well done, all of you. That was a lot of information to put into less than 15 minutes. So thank you for that network. I'm assuming we have public comment on this, correct?'",
        "'speaker_1': 'We do. We have one speaker.'",
        "'speaker_0': 'Okay. But before we go to our speaker, do I have any clarifying questions from the council? And I see Councilmember Knox White's hand knocks White's hand at. So calling you first, please.'",
        "'speaker_2': 'Thank you, sir. I just have one single question, which is I'm Park and Webster Street. The city has already spent about 1000000 to 1000000 and a half dollars each for transit signal priority. And I'm curious how this plan which proposes to implement that, implement that at about the same cost, I think.'",
        "'speaker_2': 'How is that how is that addressing those two corridors? Are we are we just talking about transit signal priorities, often the kind of the outer areas of the city where we don't have very many traffic lights.'",
        "'speaker_3': 'David, did you want to address the transit? Signal.'",
        "'speaker_2': 'Question I can I can take care of that. Yeah. So the city currently does have a transitional priority on Webster Street, and I believe that was implemented as part of an AC transit project to improve the line 51 corridor that runs through Alameda.'",
        "'speaker_2': 'And as part of this plan, we've identified other corridors within Alameda, uh, where there's a concentration of AC transit lines that was shown in the map earlier. And what this plan intends, the intention is to fill those gaps.'",
        "'speaker_2': 'So along these other corridors, such as Park Street and Santa Clara and other streets where we have AC transit lines to also provide transit priority for those corners as well.'",
        "'speaker_0': 'But I believe Councilman Alex fight was if I heard the question correctly by saying that we've already spent around $1,000,000 on TSP on Park and Webster, have we not implemented any capital single priority on Park Street yet? We miss, Furman said.'",
        "'speaker_3': 'We have, and I think what David is mentioning is that we're proposing to expand the TSB on the on the island to provide the busses with priority to better enhance their service. So there are other lines that also go around around the island.'",
        "'speaker_3': 'And so we're talking about adding it on Santa Clara and Otis and out to Alameda Point just to improve that service.'",
        "'speaker_0': 'Councilmember Knox, I did that answer your question.'",
        "'speaker_2': 'It did, yes. So it's better. But I guess I just want to clarify. So we're not actually proposing to do TSP on Park Street because we already have a smart corridor in existence there. Okay. Thank you.'",
        "'speaker_0': 'I see. Nodding head for Ms. from it. So that's affirmative. Okay. Thank you. And counsel for her is Spencer. You had your hand up? Yes.'",
        "'speaker_4': 'Thank you, Mayor. In the staff report early on, it speaks to that 230,000 construction cost invest in a private companies fiber network. Do we know a private company that is would that be determined in the future?'",
        "'speaker_3': 'That was a quote we recently received from Comcast.'",
        "'speaker_0': 'Thank you. And Councilmember de SAG.'",
        "'speaker_2': 'Yes. On the part of the Internet service provider, are we basically saying that once we have the infrastructure, we're going to look for a partner who is going to be the Internet service provider so that partner could then potentially compete against other ISPs.'",
        "'speaker_2': 'Is that what we're getting at? Like, for example, are are we going to be competing against Comcast? The Sonics are are AT&T is of the world. How does that going to work? Is it going to require like subscribers and all that kind of stuff?'",
        "'speaker_3': 'So I'll start. And then maybe David, you can finish. But the city does not want to be the ISP provider, but we do want to look into opportunities to partner with ISP providers on the city's fiber network to offer free Wi-Fi to our residents.'",
        "'speaker_3': 'David, do you have some other examples how other cities.'",
        "'speaker_4': 'Have done this?'",
        "'speaker_2': 'Yeah. Yeah. And to clarify there, it is not the intention of the plan for the city to be an Internet service provider and to compete with other ISPs. I think the intent here is in terms of partnering. What a lot of city, other cities have done is as as the city of Alameda builds out its communications infrastructure'",
        "'speaker_2': '. There are opportunities to share that resource with other partners. Private companies being one of them in terms of lease agreements or share use agreements. So that incentivizes other private companies to expand their network in Alameda.'",
        "'speaker_0': 'Elsewhere. Spencer, did that answer your question.'",
        "'speaker_2': 'And answer my question.'",
        "'speaker_0': 'Oh, I'm so sorry. It was Kalahari Desert, but then I saw cows over her. Spencer's hand go up and council were not quite so back to you. Councilmember Deicide did that?'",
        "'speaker_2': 'Yeah, I think I think that more or less answers my question, that we're not we ourselves are not getting into the Internet business, meaning, for example, there will not be a tony de saag at free Alameda wi fi dot.'",
        "'speaker_2': 'Gov or whatever. So so we're not doing that, but we will have someone else. We will provide the infrastructure and we will have someone else do that. And, and, and I guess but but it's going to be free though.'",
        "'speaker_2': 'They're going to that someone else is going to be providing a service for free to to a consumer. And I guess at some point I just like to understand a little bit better now, not tonight. You know how that works business wise, because at the end of the day, there's still costs involved.'",
        "'speaker_2': 'So, you know, it's great that our our goal is to be to provide free Internet to those. So don't get me wrong, that's great. But I just want to make sure that I understand, you know, how the whoever is selected as the ISP, how they're going to carry that cost and provide free service.'",
        "'speaker_2': 'So. But later. Thank you.'",
        "'speaker_0': 'Okay. Thank you. Councilmember Hirsch, Spencer, then Councilmember Knox.'",
        "'speaker_4': 'Thank you, Mayor. So I want to get back to the 230,000 for Comcast. So is it the city's position that Comcast cannot pay for their own infrastructure that is on the city to do that?'",
        "'speaker_3': 'So the city approached Comcast to see what it would cost to bring fiber out to the gym out at Alameda Point. And they gave us a quote in order to dig the trench, lay the fiber down because there is no existing fiber location out in at that point.'",
        "'speaker_3': 'In Alameda point, it would cost the city $230,000 for those construction costs.'",
        "'speaker_0': 'Okay. That's all for you, then, Councilwoman Knox.'",
        "'speaker_2': 'Thank you. So I just. I just. I'm sorry. I should have asked this the first time around, but my understanding is that, as the firm mentioned. The main the main strategy is to build out a network. And then a lot of these other things like the transfer traffic, sorry, transits, the TSP crane is not working well, but'",
        "'speaker_2': 'this evening etc. would be used off of that. But that that's the first step and we could actually come back and talk about which are the which of these steps we want to implement later at a different time.'",
        "'speaker_2': 'Right. So tonight we're not making that decision, basically. I guess the question I have is, is what you're looking for is kind of agreement to move forward with this vision and strategy, which is to start moving forward with a backbone infrastructure.'",
        "'speaker_2': 'And then those other projects would come in separately after we had that, that the the broadband backbone ring that had been proposed.'",
        "'speaker_3': 'Exactly. The broadband background backbone is the key to having the other top ten priorities and recommendations move forward.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. So I have a question on page. Well, starting, I guess, on page two, three of the staff report is that the the plan with the so the top ten draft recommendations with the timeframe and some are short term, medium term, long term.'",
        "'speaker_0': 'And so my question has to do with on number four, the enhancing Internet availability in public places to decrease the digital divide deployed. That's part of deploying public wireless networks and also internet emergency operations center and city facilities.'",
        "'speaker_0': 'Well, specifically empower i.t. Management of cyber security citywide. And both of those are in the mid-term 3 to 8 years to deploy. So for equity purposes, I'm wondering if although I heard what you just said, his talk about we've got to get the infrastructure out there.'",
        "'speaker_0': 'But I would love to see the enhanced internet availability to decrease the digital divide moved up. And then as far as cybersecurity, I think that should be at the top of just about any list because we are all aware of cities and agencies and utilities that have been hit by ransomware attacks and ended up spending lots of'",
        "'speaker_0': 'their funds to get data back or to get systems unlocked. So can someone just give me an idea of how it might be possible to accelerate that or not at all?'",
        "'speaker_3': 'David, do you want to handle the cybersecurity part? I will let you know that because we are still planning out what the priorities are. We have been meeting with our with existing telecommunication carriers. We met with a fellow cellular vendor the other day and also fiber.'",
        "'speaker_3': 'Well, we met with Verizon and Comcast and they are aware of our smart city initiatives. And in order to get more equitable Internet to the equity priority communities, Verizon is sending an engineer out to those weak areas with cell service to see if they can boost up their cellular signals.'",
        "'speaker_3': 'And that could be a really good stopgap for an immediate need. And as far as with Comcast, they've offered to come in and work with the city to maybe in the equity priority community locations to increase that. They have a program called lift zones that can increase their gig speed free for the first three years.'",
        "'speaker_3': 'So those are opportunities we're taking advantage of right now. But we do need to work in the cybersecurity features in a newly built out fiber corps that. David, do you want to talk a little bit about that with the newer technologies available?'",
        "'speaker_0': 'And Mr. Hearn, before you start, I should just disclose that I think it was yesterday, Vice Mayor Vela and I joined our I.T. director, Ms.. Haug, and Comcast's government relations representative for our area, Chen Maxey, for a discussion of some of the equity issues.'",
        "'speaker_0': 'So so, Mr. Yoon, what can you tell us.'",
        "'speaker_2': 'If I understand your question correctly, Mayor? I think it was in terms of moving the timeline for the public Wi-Fi. This is really in the time frame.'",
        "'speaker_0': 'Public Wi-Fi. But I think what Carolyn addressed, that it was more. Is there any way we can accelerate the cybersecurity provisions?'",
        "'speaker_2': 'Oh, yeah, absolutely. I think, you know, Caroline mentioned that, and I fully agree with her that as the city builds out this network, I think as the first starting point, we have to have cybersecurity built in as part of that network as we build it out.'",
        "'speaker_2': 'And, you know, as we talked about, you know, we envisioned this to be done in phases. So we would identify, you know, a first phase to build out. And as we build out that kind of that core, we would definitely have cybersecurity, you know, implemented as part of that because I think it would not be wise otherwise'",
        "'speaker_0': '. Thank you. And by the way, apologies. I slipped and referred to Ms.. Hug by her first name, which we do not do in council meetings, but sorry. So thank you for that information. Councilor, her response, which is I see your hand go up.'",
        "'speaker_0': 'No. Okay. Any further clarifying questions, council? Or should we go to our public comment? I'm not seeing any more hands. Madam Kirk, let's have our public speakers, please.'",
        "'speaker_1': 'Jake Garfinkle.'",
        "'speaker_0': 'Good evening. Speaker Garfinkle.'",
        "'speaker_2': 'Good evening. There is a lot of a lot of material presented in relationship to the internet services. We talked about why we talked about wireless. I think we talked about putting in fiber. You know, I lived in Harbor Bay Island, 3000 homes here, had fiber here initially.'",
        "'speaker_2': 'And then the city of Alameda came along and pulled all that fiber. And then I think they went out of business or the Internet service I think went out of business. So I am I'm a little bit reluctant to go through that again.'",
        "'speaker_2': 'Also, I have some considerations about the ability to provide adequate cyber security. You know, the federal government couldn't protect that their their employees website. I don't remember what it's called. It puts a big burden on the city to be responsible for cybersecurity.'",
        "'speaker_2': 'Also, we're looking at having an increased staff to maintain the services, which means more budget. And even worse than that, it means more pension costs. So I would rather see the city spend the money on fixing the roads and doing things like that and let the commercial area take care of the providing the Internet services.'",
        "'speaker_2': '$250,000 is fairly trivial if you're talking about this whole picture, the 250,000, I think you said was four. Comcast to put in the service. So anyway, I think that this should be very carefully evaluated and we shouldn't be in too much of a rush to be a player in the Internet arena.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Speaker Garfinkel and our next speaker, please.'",
        "'speaker_1': 'We don't have any more speakers. That was.'",
        "'speaker_0': 'All right. With that, I will close public comment on item six.'",
        "'speaker_2': 'A.'",
        "'speaker_0': 'And just remind everyone that what we are doing there is to review, comment and provide direction on this preliminary needs, assessment and recommendations for development of a smart city master plan. Who have what we heard from Vice Mayor Vella, did you want to add anything?'",
        "'speaker_3': 'Just think staff for their work on this. I think that, you know, there's a lot of moving pieces and parts to this. I think that this allows for a number of different options for the city, taking into account the different priorities that the council has expressed, really addressing the equity issues, the cybersecurity.'",
        "'speaker_3': 'I think that the phasing makes sense. This is all part of our gig ones policy as well. We do have a lot of you know, I'll need a point in in some of our areas where there is there is going to be a lot of work coming up soon.'",
        "'speaker_3': 'So I think it's really important that we we take the steps of putting these policies in place so that they're there when the time comes. It's already happening. But, you know, I think that we've had a lot of robust discussion around this item for a few years now.'",
        "'speaker_3': 'I think this is the first item that I met with Miss Hagen when I first came on board the council over four years ago. So I do want to put it out there. This this conversation has been in the works for quite some time, and it's gone through several different renditions and directives from council.'",
        "'speaker_3': 'So I just really appreciate the work and the thoughtfulness. I also understand that that the costs and the quotes that we're getting, that 250,000 is for one portion of all of the work that we would need to have done.'",
        "'speaker_3': 'So while a quarter of $1,000,000 might seem trivial for for one, when, you know, in terms of a cost for a city of our size, when we start looking at all of the places that that that type of trenching and work would need to happen in order for us to have equitable access, it really does add up'",
        "'speaker_3': 'quite quickly. So that that's all for me.'",
        "'speaker_0': 'Thank you. Other speakers, I have a question for the city manager. So, Mr. Levitt, in the this report and Ms.. Haag alluded to it, there is a suggestion that $6 million of our defense could be allocated toward the total estimated cost, which is between 4.5 to $6.7 million.'",
        "'speaker_0': 'Now the ARPA funds come into tranches and we've received our first tranche, which I think is around 14 million. At some point, the Council will need to make some final decisions on expenditure of ARPA funds. When do you anticipate bringing that back to us?'",
        "'speaker_2': 'Think and Mr. Bolton can also reject. But I think it was in November. Was it the November meeting or was it the first or the second meeting in November? We're looking at December where we're going to be ready for the first meeting in December.'",
        "'speaker_0': 'That this is in city manager Jerry Bowden. A first meeting in December, you said okay. Correct. All right. Thank you. Other thoughts? Councilmember Hirsch Spencer.'",
        "'speaker_4': 'Thank you, Mayor. So I brought a referral back in July 2017 trying to get council support to have free public wi fi throughout our city to eliminate or reduce the digital divide. That was over four years ago. Instead, I think council gave some direction to do this smart city $6 million plan.'",
        "'speaker_4': 'My concern is still the same thing. How do we get internet? And you know, the school district's been successful at doing this. They actually did hotspots. And I'm you know, but not all of us have kids in school.'",
        "'speaker_4': 'So we have many people that have been left behind during this pandemic and are still being left behind. My priority is closing that digital divide as quickly as possible. So I want to know how quickly can you do it?'",
        "'speaker_4': 'How much money do you need? And honestly, I'm disappointed that it has. Here we are four years later, and we still can't do what the school district has done.'",
        "'speaker_0': 'And I did serve some of this. How aggressive and want to address that. And also I do believe in the staff report. There was an explanation of the limitations of hot spots and they they're good up to a point.'",
        "'speaker_0': 'Does someone want to just address that?'",
        "'speaker_2': 'I'll just. If I could. Mayor.'",
        "'speaker_0': 'Yes, please. Assistant City Manager.'",
        "'speaker_2': 'Sir, the ARPA funding discussion that we've been having with council does include $50,000 for a hotspot program that would be launched by the library. So that could be a really near term implementation of the hotspot program. And then as Director Haug mentioned in her presentation, the the fiber network really allows us to build our own local system'",
        "'speaker_2': 'that would support greater WiFi access for people across the community. So I think that we're we have some near-term options and then we have kind of a a longer term plan to really enhance our local capabilities and take away that unstable hotspot network issue that could arise in different parts of the community.'",
        "'speaker_0': 'Yeah, that that was actually what I was alluding to. I think Ms.. Hoggett came up yesterday when we were in the discussion with the Comcast representative that we can. Do you want to just amplify?'",
        "'speaker_3': 'Well, actually, it came up in our meeting that we had with Verizon because the hotspots are cellular based. And so there are locations in our city that don't have good cellular signal. In my apartment complex, I cannot use my cell phone.'",
        "'speaker_3': 'I have to use wi fi calling. But because of that conversation that we had with Verizon, they are going to be sending out an engineer in certain locations of the city to see where those weak cellular services are so that they could boost up their signal in there in in those locations.'",
        "'speaker_3': 'So that's a really good first step to augment what the library can do if those check out hotspots are, you know, provided in those locations.'",
        "'speaker_0': 'Thank you, counselor. Spencer Thank.'",
        "'speaker_4': 'You. So I was recently at the League of Cities conference and there they shared that people or companies are using for the self-service, the street lights, that they that there's a way to use them to support this. But and in regards to which show your service, I agree.'",
        "'speaker_4': 'It's across the city and different homes and whatnot. But I do. But I also think that there's a way, for instance, when you bring up Verizon or Comcast, whichever one that we can be for. My focus is cellular, I think is actually fine.'",
        "'speaker_4': 'Many of us use cellular in our homes. I use cellular. That's what I have. And I think honestly, that's much more I personally at this point when I look at this plan, it is way more than I think I am ready to support and others may support it.'",
        "'speaker_4': 'But at the end I continue to think that our city has fallen short on providing the Wi-Fi throughout our city to help everyone. I think that is your digital divide, and I know when you bring up Verizon, there is a way to call them to come out and try to help out.'",
        "'speaker_4': 'And that's I think that's a better use of our money. But I am very concerned that here it is four years since my referral and we still haven't. You know, I, I, you know, I want to thank the assistant city manager for his comment regarding the library hot spots.'",
        "'speaker_4': 'I think that that should be funded and that should be a priority. I think getting Verizon out there and any anyone anywhere to help connect our phones, cellular service, I think that's the priority. But for ARPA monies, I would like to know how much money do we need to get the wi fi now to everyone across the'",
        "'speaker_4': 'city where we have those gaps? That's my priority that I think is appropriate use of ARPA money. I don't think the entire Smart City plan is appropriate for ARPA and if there's other moneys, then we can look at that city moneys.'",
        "'speaker_4': 'I think that's a bigger conversation. But for me, the ARPA monies are supposed to be COVID related somehow to help people through the pandemic. So yes, I think the wi fi is very appropriate for that use. The bigger, you know, getting this busses and whatnot, all these other things that you all have come back with.'",
        "'speaker_4': 'I think that's way beyond really ARPA. And for me, we have people that need money for housing, right? We know that we have possibly, you know, helping immediate needs of people is really what I think ARPA money is supposed to go for.'",
        "'speaker_4': 'So I am interested in hearing from you all in regards to other pockets of funding for this, but I really want to focus on closing that internet divide sooner rather than later and trying to I mean, honestly, I think four years is embarrassing.'",
        "'speaker_4': 'I just think it's embarrassing that we still haven't dealt with that more. But I'm very happy to have it coming through the library. Thank you.'",
        "'speaker_0': 'Thank you. And I was just. Was there anything else you wanted to add? Councilmember De Soto? Councilor Knox. Wait, before I do some wrap up comments. Councilmember. I guess I haven't heard from him, so if you want to go first, I'll take you now or.'",
        "'speaker_2': 'The way I see it is that the availability of ARPA money from Washington, D.C. really makes this an opportunity that we must not miss. We have the we will have the funds to lay the infrastructure that closes the digital divide, improves our transit flow, as well as provides free internet through second party ISP providers.'",
        "'speaker_2': 'Whether this is, you know, COVID related or not, I don't know. But all I know is that is that we do seem to have the money to do things, to do these ten priorities that are enumerated here that we didn't have, we either didn't have before, or by virtue of all the other things that we have to'",
        "'speaker_2': 'prioritize. Just just couldn't crack the list of things. But but now the offer money is here. I think what it boils down to, though, is making sure that the the range of costs that we're estimating. It holds true the 4 to $6 million.'",
        "'speaker_2': 'Also, I think we do need to make sure that we we understand the business aspect, especially of a free Internet, because if we're going to say that in laying down this infrastructure, that we're going to provide free Internet to Alameda residents, we we need to make sure that we need to understand the business model and all of'",
        "'speaker_2': 'its potential pressure points where where that might fail. You know, we learned some hard lessons and from what happened with Alameda Municipal Power when we had our cable, internet telephone service. And one of the hard lessons that that I see that we learned here is that previously we were the the Internet provider, we were the system.'",
        "'speaker_2': 'So we had staff we had staff people who were, you know, doing staffing up, providing the Internet service provider. And then and they were staffed at a certain level which private sector competitors like Comcast could continuously underbid by providing continuous under in a lower prices.'",
        "'speaker_2': 'If you if you went with them and I think that really made it very difficult. But but we learned the lesson because we ourselves, as I'm hearing, are not going to be the Internet service provider. We are simply laying the foundation, the infrastructure that then we will find an Internet service provider.'",
        "'speaker_2': 'And they're going to they're going to carry the risk with regard to, you know, supposedly providing the free Internet service to our residents. But, you know, there's there's also a cost associated for that private sector provider. So I think we need to make sure to nail down the the business model of that.'",
        "'speaker_2': 'But but, you know, I think we can wait on that later. I think for now, I'm fine with priorities that put together largely because, like I said, this is a rare opportunity where our ARPA funds from Washington, D.C. are are being made available.'",
        "'speaker_2': 'And I think we should move forward. I think many times I hear residents saying, you know, we need to improve our Internet here and in Alameda as well as our cell phone service, obviously. And if this can help, particularly in regard to the ladder, all the better.'",
        "'speaker_2': 'So I'm supportive of of of staff's recommendation. And I like.'",
        "'speaker_0': 'Thank you. Councilmember Desai, Councilmember Knox White.'",
        "'speaker_2': 'Thank you very much. Yeah, I'm still a little bit of a jump on my comments. I think in general, I am I am supportive of the concept of moving forward and knowing that we have until 2026, I think, some more discussion.'",
        "'speaker_2': 'It's just clear from the public comment and the council comments that there's still a lack of real understanding of what what is being proposed. And I think for me, I think it's great to talk about wi fi. I'm not familiar with a lot of free citywide or district wide public wi fi programs that are working exceedingly well'",
        "'speaker_2': 'tends to be very spotty. It seems to have a lot of problems. I'd like to have more information before I was going to buy into a program. The concept of providing that because I love the concept, but I know that there are some issues.'",
        "'speaker_2': 'I also know that a lot of the Smart Cities grants that came out, programs that were funded through the DOT when this was the US Dot Smart City program was announced, really overpromised and under-delivered. And I'm just a little concerned about jumping because we have money available into a quick decision on that.'",
        "'speaker_2': 'I will mostly limit my comments to the transportation stuff. I think that is a place where we are way over promising that there are benefits to the transportation operations. Beyond the staffing side of things, I have no doubt that there aren't some maybe staff savings in not having to go visit a traffic light and what not.'",
        "'speaker_2': 'But the problem that we have a transportation is people getting on and off the island. When the bridges go up or when there's so much traffic people can't get through. We spent millions of dollars on two smart corridor projects on both of our major transit corridors.'",
        "'speaker_2': 'And to my knowledge, we have not saved any time without either of those programs. I know that there continues to be. Oh, but if we only do the next step in Oakland or whatnot, that those things will happen.'",
        "'speaker_2': 'But I'm a little concerned that we're now talking about, you know, putting transit signal priorities at intersections, some of which we are currently talking about removing traffic signals altogether to put in roundabouts that. And so I'm just a little worried that some of our transportation as our transportation priorities and our goals and the outcomes that we have'",
        "'speaker_2': 'set for the city are not necessarily being met in the transportation section of this of this. And I'd like to be able to have more opportunity to have that discussion a little bit further before I'm ready to say, Yeah, this is the plan to me.'",
        "'speaker_2': 'What I hear is we need to start with the idea of implementing some form of background loop. I'd like to know a little bit more about San Leandro has experience with that because I know that they were one of the first cities to do that.'",
        "'speaker_2': 'And I think that providing that information and how it is being used and what impacts it really is having, I think would be really helpful to me as a as somebody who was going to be asked to identify funds to Councilmember de SACS point in my mind there's a lot of cyber infrastructure funding that is coming through'",
        "'speaker_2': 'both the state and the federal side, as far as I understand. And I would much rather be using that funding to fund a smart city type of of a program that then our COVID relief funds, when we already have a list two or three times longer than the total cost of programs, we have one project that we'",
        "'speaker_2': 'if we all if we move forward with it could fund it could take up two thirds of its costs. That gets the homeless response and whatnot. So for me, I, you know, I'm not ready to say this is this is the strategy that because I'm not 100% clear on what the strategy is.'",
        "'speaker_2': 'And I would like some more information really about cities that have done this, because I think that to me, the the AMP experience, they can't experience with Internet while a very different type of Internet was also a very good example of why smart cities need to be careful getting high technology solutions early on because they change very'",
        "'speaker_2': 'quickly. And what we found out with AT&T was that, oh, wait, it turns out that VoIP, you have to add another 25 million, that things were changing so quickly we couldn't even get up to full build out of the original baseline system before we had to go back and start re redoing the, the existing system.'",
        "'speaker_2': 'And so I'd like to have have more conversations, I guess as a council about what were, what were, what we're doing with this, this overall proposal. Before I'm ready to say, you know, all ten of these ideas are the ideas.'",
        "'speaker_2': 'I definitely am a big believer that broadband is a future that this city needs to prepare for. And I think that the ring is probably one of those first steps that we really need to take. I just think it would help both the community and our council kind of identify how to move forward with that, but also'",
        "'speaker_2': 'how to think about that. The ten items that get built off of that later. And now we're going to have those conversations because we haven't really had those conversations as a council at this point in time. So those are my comments.'",
        "'speaker_2': 'But I do I do want to acknowledge a lot of stuff. Time has gone into this. It's a lot of really good, solid work. I appreciate it. Ms.. Haag I met with the school district two summers ago with the school district and common networks as we were trying to figure out the hotspot issue.'",
        "'speaker_2': 'It's a very complex issue. And my only concern, even when I hear that Comcast will, you know, allow us to help pay them to do something and they'll give us three years of low cost or upgraded speed Internet.'",
        "'speaker_2': 'That's the the problem is when we when we when we put all our eggs in the basket of the private sector, they always limit the benefits. And after three years, everybody's painful price. And we're right back where we started.'",
        "'speaker_2': 'So just wanting to think through some of those concerns and how we can make sure that we're building something that that continues into the future a little bit more softly rather than with a known expiration date. Thank you.'",
        "'speaker_0': 'Okay. And then part of what we're supposed to be doing is to provide direction. So I think I heard some direction from you. Councilmember Knox. Right. And do you think I wanted to ask you, do you think that the transportation related aspect of this should be referred back to the Transportation Commission with some items for them to'",
        "'speaker_0': 'look at?'",
        "'speaker_2': 'You know, I'm not sure we're at that. I mean, I'm going to acknowledge that this is an issue that is not related to smart cities. But I am finding that we are having a lot of transportation related conversations in which the conversations are not actually working on the goals that we've set for cities, but are working on'",
        "'speaker_2': 'operational issues that don't necessarily align with them. And I'm not sure how to have that conversation yet. So at this point in time, I would rather come back here for some guidance before it goes to the Transportation Commission, because I think that if it goes to Transportation Commission, the question they're going to be asking, the question they're'",
        "'speaker_2': 'going to answer may not be the question that council is looking to have prioritized.'",
        "'speaker_0': 'Okay. Thank you. Council vice mayor of L.A..'",
        "'speaker_3': 'Madam Mayor, I think you know. Perhaps we could remove the portion of the direction relative to the transportation corridors, if that's what I'm hearing my colleagues suggest. I think that that's fine to have a broader conversation about what our goals are and what perhaps get some reports back about the efficacy of what we have done and kind'",
        "'speaker_3': 'of where things stand. Because I we hear about project by project and then time passes. But I think it would be helpful to have a more kind of broader update in terms of where we are for various transportation related plans.'",
        "'speaker_3': 'But that's not agenda tonight. So I don't want to necessarily get to that. But perhaps the direction is just to have staff come back relative and to incorporate this ask relative to a broader update and where it might fall.'",
        "'speaker_3': 'And with that, I'm fine with that. I do have a question because I think what's difficult is and I've heard this from my colleagues and at least what what I would like to see is I would like to see the city really exploring the different options available, whether those are private, publicly funded, perhaps joint efforts to really'",
        "'speaker_3': 'make sure that we have the infrastructure. We can't have the conversation about wi fi, and wi fi doesn't exist without infrastructure. And so it's not like you get Internet and it just comes out of thin air. Yes. There are cities that that can you can plug into different things, but they often have the underground infrastructure that allows'",
        "'speaker_3': 'that to occur. And I you know, I do think that there are costs associated with that. I think where the money comes from is a separate. There could be other grants. Yes. But I think if we don't have a policy in place, it's going to be very difficult for staff to go after funding or to really understand'",
        "'speaker_3': 'what the direction is from council. So I just I would like to hear more from my colleagues about kind of where they would like to see us go if they want to have the options about having the city really try to go out and partner in terms of the infrastructure and what that would look like.'",
        "'speaker_3': 'You know, I think that we really need to achieve something like that so that staff, whether it's the ARPA funds or not and I understand the ARPA funds have been spent six times over, but I just want to make sure that we we give some clear instruction to staff or at least we get to some consensus as'",
        "'speaker_3': 'a council. And I understand there's been various renditions of councils that have had this conversation. So I just like to understand where my colleagues are a little more relative to how we want to address the infrastructure side of things, or if we don't really want to leave it completely up to the private sector.'",
        "'speaker_0': 'Thank you. Cause her. Spencer, I think I saw your hand up.'",
        "'speaker_4': 'Thank you, Mayor. So I'd like to know. So I appreciate we have the library hot spots, and I don't know if staff thinks that we need more to support that or if that's sufficient. But I would like to break this down into parts.'",
        "'speaker_4': 'And and obviously, I don't want to tie up the hotspots or fi whatever we think we can most immediately do to support the cellphone use across the island. I think I think that's what it is. But to the, I guess, assistant city manager, is that all you need was the 50,000.'",
        "'speaker_4': 'Do you need more to meet that need? Thanks.'",
        "'speaker_0': 'Sure. Assistant City Manager. Go ahead.'",
        "'speaker_2': 'Thank you. Yeah, we have what we need through the ARPA discussions. We will be back in December. That's the plan to to get some authorization, formal authorization to spend that money and move forward. In the meantime, the the programs that the council has been discussing around housing and and the hotspots are being vetted and fleshed out.'",
        "'speaker_2': 'So we know exactly how much money we'll need related to specific housing projects to this technology project. So we'll have those numbers in the ARPA discussion. $50,000 seemed completely adequate for the time frame over. We're looking at that program and we'll have more information for you in December.'",
        "'speaker_0': 'Okay. Councilor Herr Spencer? Yes.'",
        "'speaker_4': 'Thank you. So, Assistant City Manager. Thank you. I really appreciate that answer. I'm looking forward to those discussions coming back in December. Then in regards to the rest of this, I think I agree with member Knox White of spending more time on this and coming up with spend.'",
        "'speaker_4': 'I guess I'm going to summarize, is spending more time on these different things, figuring out how we want to do it. But I'm not I don't think I'm ready to proceed with committing $6 million. And I definitely don't see ARPA as the appropriate use of as $6 million of it for this.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Okay. Kalahari Desert. Yes.'",
        "'speaker_2': 'Well, just quickly, the way that I envision tonight was that, you know, we have our city staff putting together a ten or so recommendations, which they have taken the time to also cast out. And they have brought these recommendations to us with regard to, you know, putting together the some of which would result in a smart city'",
        "'speaker_2': ', which for some might improve transit, for others that might bridge the digital divide. And for even more, it might lead to a low cost free Internet. But but I think for me, the the the take away that I was envisioning was then for us as a council member, each of us to to raise the issues or questions'",
        "'speaker_2': 'that we have or then staff to come back. So, for example, I focused on the I needed to better understand the business model of how the ISP thing would work. Councilwoman Knox Light focused especially on the transit part so that that's kind of how envision this they provide us an envelope of recommendations.'",
        "'speaker_2': 'We then followed up with some questions for certain areas. Councilmember Herrera Spencer raised some questions regarding the digital divide and then for the staff to come back and that might result in some things falling off, that might result in so whatever.'",
        "'speaker_2': 'But at least, you know, they provided a starting point for us to have a conversation and to get our smart city going. And the fact that the that, you know, ARPA funds from Washington, D.C. are available great, you know, to cover that six or to $6 million but but yeah as as others have said, maybe it's not'",
        "'speaker_2': 'opera funds in the future and maybe there are other moneys from from from Washington, D.C., that can also, you know, help us establish this this smart city. But regardless, though, I think we have to start that conversation and staff has to hear from us what are our concerns and where where we want them to kind of focus'",
        "'speaker_2': 'is sharpen this smart city proposal. That's how I saw tonight going out.'",
        "'speaker_0': 'Thank you, councilor. Everyday. So again, I would say I I'm landing in your court. There are two. I want to first thank staff for all the time and effort and the consultants for putting this plan together. With regard to the use of ARPA funds, we can debate what the correct amount might be.'",
        "'speaker_0': 'No one project that we're talking about, including are addressing homelessness, and preventing homelessness is going to be completely funded by ARPA funds. Fortunately, the state of California has a healthy budget surplus and has allocated even more money to addressing homelessness.'",
        "'speaker_0': 'So we're going to be cobbling together federal funds, state funds, money from the county. But with regard to the appropriateness of ARPA for this particular plan. I know that Assistant City Manager Jerry Bowden, we've been in some of the same webinars together and he's probably been in even more on the use of expenditure of ARPA.'",
        "'speaker_0': 'Funds are strict criteria. Where I do see the relationship to addressing the impacts of COVID is that the way people work has changed dramatically. And I think most of the council was at the Chambers Economic Forecast presentation last Friday where the economists who spoke to us talked about how we're not going to bounce back next year or'",
        "'speaker_0': 'the year after. It's going to take a couple, few years for California to come back to people going, to offices, working, you know, the way they used to. They are working from home. They are continuing to. And so we need that kind of infrastructure to support that.'",
        "'speaker_0': 'And then the staff report also mentioned telemedicine. You know, that is the way that a lot of people were getting the advice they needed, consulting with their doctors, having appointments during COVID and before. But it's going to continue for a variety of reasons.'",
        "'speaker_0': 'It can be a really efficient way to to receive those services. I mean, even in the discussion we had at our last meeting about the provision of mental health services for some of our emergency response calls, some of that is going to take place via telemedicine.'",
        "'speaker_0': 'And so we definitely want to make sure that we have the infrastructure in place. The the questions that I have do have to do with the additional staffing that will be needed. That was noted in the in the report.'",
        "'speaker_0': 'And so I would want to know an estimate of how much and where and where those funds will come from. Because the one thing I think we all know about ARPA funds is they're intended to be for one time expenditures.'",
        "'speaker_0': 'They could be to set up a project for infrastructure or what have you, but they are not ongoing sources of revenue. So I'm sure that's been considered. I'd like to hear more about that. I concur with the the concerns council member Knox quite raised about wanting to know more about where these kinds of programs have been used'",
        "'speaker_0': 'successfully. I will also say that I think there's a lot of relationship of this plan to our climate action and resiliency plan, because to the extent that we can get traffic moving more smoothly, more efficiently, not having cars sitting idling at stop signals at stoplights, just waiting for the light to change when there's no cross traffic.'",
        "'speaker_0': 'But to have smart signals that actually helps reduce greenhouse gas emissions until that time when we're all driving EVs, which isn't going to happen overnight. So I think there's a lot of relationship to council priorities. Should we get more information?'",
        "'speaker_0': 'I think we should, but I think that we need to move forward with getting infrastructure in place. The, you know, the big ones while we're doing our development out at Alameda Point, for instance, to support the residents out there, the businesses expanding business community, the different uses being made at Alameda Point.'",
        "'speaker_0': 'I think that's important and I don't think we ever want to underestimate our need for cybersecurity. And I will hasten to add that cities are not alone in providing for cybersecurity. There is and I know this Hogwood tell us this is National Cybersecurity Month, but there's a very important federal agency, possibly the newest federal agency, the Cybersecurity'",
        "'speaker_0': 'and Infrastructure Security Agency, that works closely with cities, with city governments, and very closely with the National League of Cities and U.S. Conference of Mayors. So I would ask directly ask that staff come back with answers to the questions that we have raised, but with an eye toward getting that infrastructure in place, that the dig first kinds'",
        "'speaker_0': 'of objective dig once objectives. I think those need to be addressed sooner rather than later. Okay. So anything anybody else want to add and I want to again thank all of our staff and the consultants for all the time and this very informative report, and we look forward to hearing back.'",
        "'speaker_0': 'All right. Thank you, everyone. With that, I am going to close. Item six.'",
        "'speaker_2': 'A.'",
        "'speaker_0': 'And we will then return to the regular agenda and we have a very fun positive item to start out with, which is not that the last one wasn't. It was great. But this is 7 a.m. clear. Could you introduce this item for us, please?'",
        "'speaker_1': 'Adoption of resolutions appointing Catherine Byler and reappointing Lisa Hall and Jennifer Rohloff as members of the Commission on Persons with Disabilities.'"
    ],
    "Appointments and Reappointments to the Commission on Persons with Disabilities.": [
        "'speaker_0': 'Thank you so much. And so if I can get my iPad to cooperate, I can even go to that next item. Okay. So first, we do have a resolution. We could do them all three at once. Is that correct?'",
        "'speaker_0': 'Third, yes, we can. And I bet Kazmir Herrera Spencer is going to move this item along.'",
        "'speaker_4': 'Are you correct, Mayor? Yes, I'd like to move the item along.'",
        "'speaker_0': 'So we've got a motion from Councilmember Harry Spencer. We've got a second from.'",
        "'speaker_3': 'Second Mayor.'",
        "'speaker_0': 'Vella and any comments, questions before we take that roll of it. I will add that when we interviewed her, I know that Ms. Bieler prefers to be called Katie Beeler. She said that Catherine makes you think her mother was upset with her.'",
        "'speaker_0': 'So we don't want that. So I think we have is do we have our yes nominees? Let's bring them on.'",
        "'speaker_1': 'And if you want to take the vote while they're coming in.'",
        "'speaker_0': 'Oh, we could do that. Absolutely. So may we have that roll call vote, please?'",
        "'speaker_1': 'Councilmember Jason.'",
        "'speaker_3': 'He's yes. Yes. PEREIRA Spencer.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'KNOX Right.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Well.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Mayor of the Ash Carter. High net carries by five eyes.'",
        "'speaker_0': 'Thank you. Yay! Great news. Okay. And I see I've got two of our three on screen. Hi, everybody. And just. Did you hear from this hall, Madam Clerk? There she is. I see her first name. I'm assuming. All right.'",
        "'speaker_0': 'Hello. All right. Well, welcome, everyone. I am really excited to present our newest nominees to the Commission on Persons with Disabilities. Well, I should say two of the three are returning members. They were interested in serving another term, and they have served very, very well.'",
        "'speaker_0': 'And they're hardworking members. And that is Lisa Hall and Jennifer Roloff. And we welcome and new member Katie Bieler. And so if I could actually, Ms. Peeler, start with you. And just if you all would just take like a minute to tell us a little bit about your interest in serving on this very important commission.'",
        "'speaker_0': 'We would love to hear from you. Welcome.'",
        "'speaker_3': 'Thank you. Good evening, everyone. My name is Katie Peeler, as the mayor pointed out. I am honored for this opportunity to give back to the city I've called home for almost eight years now. And first I wanted to say thank you to the mayor and Sarah Henry for being so generous with your time and for nominating me'",
        "'speaker_3': 'to this position. I also want to thank the City Council for considering my nomination today and joining me to serve on the Commission. I, as an introduction to myself, I am proud to be a product manager working for a nonprofit in the area, developing software for social good.'",
        "'speaker_3': 'My team creates products to make printed reading materials more accessible for people with reading disabilities, like dyslexia, low vision and blindness. And I'm really passionate about the equitable access.'",
        "'speaker_2': 'To.'",
        "'speaker_3': 'Information and building inclusive environments where all people feel welcomed and respected. And I really can't wait to start working with my fellow commissioners in making sure our Olympians.'",
        "'speaker_1': 'With disabilities have equal access.'",
        "'speaker_3': 'To programs and services and support integration and participation in all activities. So thank you. I'm really excited. I can't wait to get started.'",
        "'speaker_0': 'Thank you. Likewise. And Lisa Harvey, we go to you next. Ms.. Hall.'",
        "'speaker_4': 'Hi. Thank you. Mayor Ashcraft, City Council Commission members. I'm grateful and honored to serve as a commissioner again for the disabled community of Alameda. I look forward to working with the other wonderful commissioners who give so much of themselves.'",
        "'speaker_4': 'Many years ago, my mother became disabled and our life changed forever. Forever. Years later, then I also became disabled myself. Helping the disabled seniors is in my heart, whether it's physical or mental. 46% of all seniors will become disabled in their lifetime.'",
        "'speaker_4': 'And 40% of the disabled community will become homeless.'",
        "'speaker_3': 'These are hard numbers.'",
        "'speaker_4': 'Medical housing and food insecurities are some of those challenges. I will continue to stand up for the rights of the disabled community and to promote awareness for making the disability vote count along with accessibility for all. Thank you.'",
        "'speaker_0': 'Thank you so much. General, last May we go to your next welcome.'",
        "'speaker_3': 'Absolutely. Good evening, Mayor. Council staff, thank you so much for your trust in.'",
        "'speaker_4': 'Reappointing me to this commission.'",
        "'speaker_3': 'Your vote of confidence moving forward. I'm really excited to continue on with this commission and its members. It's been a fantastic experience for me, a learning experience as a older sister of a brother born with disabilities. I have a lifetime of advocacy and I had actually shared with the mayor when I was at Mastic School.'",
        "'speaker_3': 'In elementary school, I was volunteering in Neil Tam special ed classes, and my parents always wanted me to just have an acute awareness of.'",
        "'speaker_2': 'Those with special needs and those.'",
        "'speaker_3': 'Might not that might not look and think like everyone else. So that has continued throughout my life from various engagements, boards, working with Special Olympics. And I just feel like it's an extremely important time in our community and society to keep.'",
        "'speaker_4': 'Leaning in with, you know, the growing mental health crisis. With the city's.'",
        "'speaker_3': 'Growing so fast around us, it's important that those with disabilities have advocacy and a voice. And I'm really happy to represent the commission. We a part of this commission and.'",
        "'speaker_0': 'Thank you as well and thank you to all three of you. Council Wouldn't you agree that we're really fortunate to have such committed individuals? And I also want to send a shout out to our public information officer, Sierra Henry, who staffs this commission.'",
        "'speaker_0': 'Yes. And does so really well. So all of you bring so much dedication and energy to this commission. And thank you so much for all the great work and well-needed work you're going to do. Have a great evening.'",
        "'speaker_0': 'Yes. Oh, yes.'",
        "'speaker_3': 'I think they do.'",
        "'speaker_0': 'They give you you think I've never done this before? Take it away.'",
        "'speaker_1': 'I figure if you'll all raise your right hand. Do you solemnly swear to uphold the Constitution of the United States and the Constitution of the state of California, and that you will all and faithfully discharge the duties upon which you're about to enter?'",
        "'speaker_2': 'I do. I do.'",
        "'speaker_1': 'Congratulations. Thank you.'",
        "'speaker_0': 'Now you're official. All right. Thank you, everyone. Thank you so much.'",
        "'speaker_4': 'For your counsel. Thank you, Mayor.'",
        "'speaker_0': 'Take care, everybody.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'We I've said this more than once. We have just had amazing response to announcements of openings on our boards and commissions, and we're just the better for it. So thank you. Okay. Was anyone else's eyes cheering up during those comments?'",
        "'speaker_0': 'Mine were. So, Madam Clerk, will you introduce the next item, please?'"
    ],
    "Approval of The Road Home: A 5 Year Plan to Address Homelessness in Alameda.": [
        "'speaker_1': 'Recommendation to approve the road home. A five year plan to prevent and respond to homelessness in Alameda.'",
        "'speaker_0': 'Thank you. That's item seven B. Yes. Okay. And you want to tell us who will be presenting?'",
        "'speaker_1': 'Yes. We have Amanda squared here.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'The Shirkey and then the consultant who I believe will give the PowerPoint here for us.'",
        "'speaker_0': 'To man. Amanda's are better than one, right? They're both pretty amazing.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'Good evening, Mayor and city council members. My name is Amanda Gursky. I'm a development manager with the Community Development Department, and I've been managing the Homelessness Strategic Plan. In January, we brought on Homebase, a nationally recognized expert on homelessness, to assist us with the plan, and we kicked off work in earnest.'",
        "'speaker_3': 'In April, we brought a series of preliminary goals and strategies before you for review and feedback. And over the last six months, we've incorporated your feedback together with findings from our broader community engagement and assessment of existing programs in Alameda to create the plan that is before you tonight for consideration.'",
        "'speaker_3': 'So with that, I'd like to introduce Amanda Wagman, Director of Strategy and Evaluation at Home Base, to talk more about the plan.'",
        "'speaker_1': 'Thank you, Amanda, for your introduction. And good evening, Madam Mayor and city council members, just on behalf of home base. Our team has been so honored to support your community in the development of this five year strategic plan to prevent and respond to homelessness in Alameda.'",
        "'speaker_1': 'When we last came to the city council in April, we were in the middle of a synthesis and recommendations phase of our work and shared some early drafts of our goals and strategies. And since then we have completed the analysis of the challenges and needs in the city and developed a complete roadmap of goals, strategies and action'",
        "'speaker_1': 'steps that are going to support the community in preventing and responding to homelessness. We've circulated iterative drafts of the plan to a wide variety of stakeholders, including the Social Services Human Relations Board, who recommended at their September meeting that the council approve the Road Home Plan.'",
        "'speaker_1': 'And we also heard some important feedback from the Shrub at that meeting, which will highlight during our review of the goals and the strategies in just a moment. This feedback will also be incorporated into regular work plans, which will guide implementation of the strategic plan.'",
        "'speaker_1': 'This slide outlines the table of contents. The plan starts with an executive summary of key takeaways from the plan and then moves in to an introduction that sets some context on the planning process, the current homeless system and data about homelessness.'",
        "'speaker_1': 'The Challenges and needs section synthesizes that information by identifying gaps in the system, and our roadmap lays out those goals and strategies to address the gaps. And then we conclude with a number of appendices, including an implementation plan that gives some more detail, a glossary of key terms, a snapshot of available programs and housing, and a crosswalk'",
        "'speaker_1': 'of the plan's strategies that shows how it aligns to the actions in the county's strategic plan. Update. The data shows us that homelessness is on the rise in the city and across the Bay Area, with a 13% increase in unsheltered homelessness from 2017 to 2019.'",
        "'speaker_1': 'I'll just note we don't have 2021 point in time count data due to due to the pandemic. But the county does plan to do a count this January, so we'll have updated information next year. While homelessness is on an upward trend, what this also tells us is that with coordination and implementation of the strategies in the plan'",
        "'speaker_1': ', the scale of homelessness in the city is small enough that we can have an impact and much more data is included in the data finding section of this plan. But we won't have time to get into it tonight.'",
        "'speaker_1': 'The seven items that are listed here represent the main challenges and related needs that emerge throughout the planning process. And these became evident from research and data and community engagement in which we identified needs related to increasing affordable housing, providing flexible resources, low barrier shelter, enhancing supportive services, expanding data collection, leveraging funding and improving communication, coordination and'",
        "'speaker_1': 'transparency. And these challenges and needs have helped shape and inform the goals that you'll see in the roadmap. The three overarching goals.'",
        "'speaker_0': 'Is to see for just a minute, we lost.'",
        "'speaker_3': 'You. But, you know, I'm so sorry to hear that you're back.'",
        "'speaker_2': 'Great.'",
        "'speaker_1': 'The three overarching goals represent the roadmap to the city to prevent and respond to homelessness. And we highlight securing housing as the first goal, as it's proven to be the best way to end homelessness. Goals two and three are critical for having a robust front door that is coordinated and sustainable, and we look at each goal more'",
        "'speaker_1': 'specifically next, unpacking the strategies that support them and the challenges and needs that the goals are meant to address. In in the plan itself, you'll find some additional detail under each strategy that has specific action steps that support implementation and metrics to help quantify progress over time.'",
        "'speaker_1': 'So goal one is to secure a housing a future for all our mutants. And this goal includes three strategies that are meant to address challenges and needs related to affordable housing and coordination. First, for strategy 1.1 regarding assessing and using land for housing implementation involves identifying the private and public land that is available for acquisition, rehabilitation and'",
        "'speaker_1': 'new construction of permanent housing. With Strategy 1.2. The aim is to look at existing city policies and consider changes to streamlined, affordable housing development and strategy. 1.3 will involve partnering with neighboring cities and the county to secure sites for short and long term housing and to align with housing first practices.'",
        "'speaker_1': 'Goal two is to increase access to homeless emergency response services, which relates to the need for flexible resources, low barrier shelter and coordination. Strategy 2.1 emphasizes the targeting of funding to help prevent and resolve a housing crisis before someone is it is evicted or needs shelter.'",
        "'speaker_1': 'Strategy 2.2 promotes an evidence based low barrier approach to temporary housing solutions. And I'll note here that the Shrub provided feedback on the importance of providing temporary housing during winter months, especially here. And Strategy 2.3 involves expanding outreach and supportive services to unsheltered households.'",
        "'speaker_1': 'And this includes clarifying roles and methods for engaging with the unhoused community and promote promoting things like diverse street outreach teams. And Goal three is finally to mobilize the citywide response to homelessness. And this goal addresses a number of challenges and needs, including supportive services, data collection, funding and communication with strategy 3.1, we found that the community'",
        "'speaker_1': 'is eager to learn more about what's being done to address homelessness and how they can get involved in local initiatives. Strategy 3.2 focuses on a number of related efforts, including ensuring participation and coordinated entry and data collection, centering racial equity and the voices of people with lived experience in homeless services, design and strengthening coordination among providers.'",
        "'speaker_1': 'And many of our stakeholders, including the Shrub, really noted here the need for better data about subpopulations, including folks like families with children and particularly young children. This will allow for better targeting of specialized services and strengthened partnerships with organizations and programs that serve them like Headstart and more broadly.'",
        "'speaker_1': 'Under this strategy, the Shrub also noted their role in the implementation of the plan, including providing input on how to prioritize action steps and timelines. And the Shrub also noted the importance of prioritizing additional staff to implement this plan as a part of the homeless response system infrastructure.'",
        "'speaker_1': 'And with strategy 3.3, we know that none of this is going to work unless there are supportive services while people are on the street, in shelter and in housing. And the the shrub noted in their feedback the importance of the commitment to wraparound services and case management.'",
        "'speaker_1': 'Finally, we wanted to highlight the call to action that we included in the plan. We just reviewed a really robust list of goals and strategies, and there's a lot of important work to be done. But as this call to action notes, the scale of the problem in Alameda makes these schools realistic, achievable and necessary, and gives the'",
        "'speaker_1': 'city a roadmap to preventing and ending homelessness. So with that, we welcome any questions about the road home. And thank you so much for your time this evening.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Forman, for that presentation and Ms.. Kirkby as well. And Madam Kirk, I'm assuming we have some public speakers on this item.'",
        "'speaker_1': 'We do. We have a couple.'",
        "'speaker_0': 'All right. Well, before we get to our public speakers, let's hear clarifying questions about the report from Council and Councilmember de SAC. I see your hand up.'",
        "'speaker_2': 'Great. Thank you. If the. Consultant or as a staff person can talk a little bit more about the what's called the Housing First approach, because my reading of the staff report and the accompanying report is that. That contrasts starkly with, I think, what's called the continuum of care model.'",
        "'speaker_2': 'Sophie kind of talk about that because what I saw was, for example, you referenced case management from what I saw in the report and the Housing First approach. We're talking volunteer case, voluntary case management. So whereas in the continuum of care approach, it seems as though.'",
        "'speaker_2': 'The housing that you receive is linked with required participation in some kind of service or or reaching out, working with a case manager 2 to 2 to go to services. But I think in the Housing First model, that that requirement, I mean, if you're is not there any longer, so we can have a discussion about that.'",
        "'speaker_0': 'Thank you. Good questions. Did someone want to touch on the different terminology and what it refers to? Because Councilmember Desai is correct, it can be confusing and sometimes even seems contradictory. Ms.. Warman, you were nodding your head. You want to take that?'",
        "'speaker_1': 'Yes, I'm happy to. Madam Mayor, so just a couple of key terms to be aware of. And thank you so much for your your comment and highlighting the Housing First approach, because it is definitely underscored in a number of the goals and strategies.'",
        "'speaker_1': 'Housing First is a an approach that is promoted by by the Department of Housing and Urban Development at the federal level, as well as by experts nationally and locally as a best practice approach to how we deliver housing and services to people experiencing homelessness.'",
        "'speaker_1': 'The idea, as you noted, is about reducing barriers to entry into programs, as well as reducing all of the restrictions and things that might force people out of those programs. So by reducing the restrictions or the programmatic requirements, it enables folks to get into housing more quickly and to be provided the case management and other supports that'",
        "'speaker_1': 'allow them to maintain their housing stability over time. I want to clarify what we mean by continuum of care. It's a little confusing because there are a few different definitions that are used as part of this field. The continuum of care, most broadly speaking, refers to all of the housing and services that are available to address the'",
        "'speaker_1': 'needs of people experiencing homelessness. It's also a term of art used by HUD to refer to the continuum of care.'",
        "'speaker_0': 'Or This is where you cut out momentarily. Ms.. Orman. I'm Yuki. At least for me. Did you.'",
        "'speaker_1': 'Stop here? Yeah, she said.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_3': 'I'm sorry.'",
        "'speaker_0': 'Did anybody else get the message that your Internet connection is unstable? Okay, maybe we need to go back to that Smart Cities item. Miss Wurman, you were starting to say what the continuum of care means all the services, housing and services available to people.'",
        "'speaker_0': 'If you could just go back and pick it up from there.'",
        "'speaker_1': 'Yeah, absolutely. And I apologize. That word technical challenge.'",
        "'speaker_4': 'Not your fault.'",
        "'speaker_1': 'So the continuum of care refers to a number of different things. It can refer to the continuum of housing and services that's available in a community to address the needs of people experiencing homelessness. It also is a term used by HUD to refer to the decision making body at a continuum of care level, usually a county level'",
        "'speaker_1': '. So you might hear about the S.O.S. Board as a part of the work that everyone home does at the county level. And it's also a funding stream. The S.O.S. program is a funding stream, the continuum of care. So it means a bunch of different things.'",
        "'speaker_1': 'But I it doesn't it isn't meant to be in contrast to housing first. Rather, the continuum of care is the overall approach the community is taking to address homelessness. And the housing first approach is, is how you're delivering services within that continuum.'",
        "'speaker_1': 'So I know it's a lot of complicated terms of art, but I just wanted to create that distinction that it's there. It's not your choosing one or the other. You can very much deliver housing first. Programing within a social setting.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'He was out with an offer you see every day oc other clarifying questions council. I've got a couple cats over here. Spencer, did you have some questions? No. Okay. So when and again, thank you for all the work that went into this report.'",
        "'speaker_0': 'And it's just such an important topic when we talk about the numbers in around 300 people. I, I wonder, do you think that that number is even higher since we haven't been able to do a point in time count.'",
        "'speaker_4': 'For.'",
        "'speaker_0': 'What, two years now? And and we know just that people have been impacted by COVID and losing work and housing instability. So. That, you know, do we think it might even be higher? And I guess I would hasten to say probably the number doesn't matter.'",
        "'speaker_0': 'The point is we've got a problem and we need to start addressing it. But any thoughts about. The numbers.'",
        "'speaker_1': 'Yeah. The beat. There is definitely an upward trend that we're seeing across communities. So I can think I can speak generally that that's something we're seeing. I will say that there you know, there have been a lot of steps taken during the pandemic to work on eviction prevention and a lot of resources coming down from the state'",
        "'speaker_1': '. So we remain optimistic that that's going to help address some of the emerging needs from the pandemic period. But we really won't know until next year's point in time. Count that kind of comparative number. There is some additional analysis done in the plan that looks at other data, like from the Homeless Management Information System or HMAS.'",
        "'speaker_1': 'That's the county level data system that looks at individuals with ties to the city of Alameda and those numbers are higher. I think the 2019 number was 736 people, but that might be folks that are throughout the county that have some tie back to the city of Alameda.'",
        "'speaker_1': 'So it's a slightly different way of looking at the population, but that gives you some additional context on what the numbers might really look like.'",
        "'speaker_0': 'Thank you. In addition to realizing that we haven't been able to do a point in time count for a little while now, I think just anecdotally, we have seen encampments appear in areas of the city where we certainly hadn't before the pandemic.'",
        "'speaker_0': 'But the. Thank you for that. And then let's see I. Okay. And the at the end of this item, I will ask the city clerk if she's able to put up on the screen this website for people to to go to to apply for emergency housing assistance.'",
        "'speaker_0': 'Because I think most of us know that the state's housing eviction moratorium ended last Friday or last Thursday, September the 30th, but that's at the end of this. So. Any other clarifying questions or shall we go? Councilmember Harry Spencer.'",
        "'speaker_4': 'Thank you, Mayor. So we received a supplemental report from staff from Lois Butler and I would ask that be added to the agenda item if possible, because it has a lot of the data that I had asked for at the prior meeting.'",
        "'speaker_4': 'So I appreciate staff providing that. One of the things that comes up on this data is to safe parking that says we have capacity for 25 cars per day and serve 11 vehicles on an average day, approximately 21, and duplicated individuals per quarter since there's 25 car spots available per day.'",
        "'speaker_4': 'I'm wondering, do staff think that and that 11 are being served? The staff think that we have more than 11 in our city that could use those extra spaces or that we really don't have that.'",
        "'speaker_0': 'Miss Butler, did you want to address that?'",
        "'speaker_3': 'Yes, it's about community development.'",
        "'speaker_4': 'Yes, we do have more than 11 cars within the city and we are actively going.'",
        "'speaker_3': 'Out and letting people know that they can park at the safe parking location. In fact, we moved some folks from.'",
        "'speaker_2': 'Internal.'",
        "'speaker_4': 'Boat ramp over and also.'",
        "'speaker_2': 'I believe that.'",
        "'speaker_3': 'Some were recently moved over. So it might be higher than that because the data that I used was a little bit older than last week.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Offer you counsel over here, Spencer. Okay. All righty. Councilwoman Dayton. Still muted on one level.'",
        "'speaker_2': 'Thanks. So I just want to try to clarify one question. So the question, if I can clarify it, is so if we adopt the Housing First paradigm, if you will, would that mean that we would not require case management as a condition of housing, that it would be voluntary case management so a person with certain ailments wouldn't'",
        "'speaker_2': 'be required? Because that's what I read on page 34 of 69. So that's my question.'",
        "'speaker_0': 'And this woman.'",
        "'speaker_1': 'Thank you for your question. So the the recommendation and the plans the recommendations related to Housing First are about how to reduce barriers. So I would think think you're not wrong use paradigm or philosophy or approach. Like it's about how to how to make the the housing and programs that you have as low barrier as possible is'",
        "'speaker_1': 'you don't want to create scenarios where folks are cycling in and out of programs, but rather you want to create, create the space for folks to get into programs and then to be offered case management and other services that support them and maintaining that housing stability.'",
        "'speaker_1': 'So, no, it's it's not about having those requirements and restrictions. But at the same time, Housing First isn't saying that you just put put people into housing and let them be. It's about creating those robust supports and structures through the design of the program that helped ensure the success of program participants.'",
        "'speaker_1': 'So there's it's it's definitely more nuanced than just, you know, not requiring services, but it's about how to have trauma informed care and motivational interviewing and other best practice approaches that can be coupled with housing first to help get people the help that they need while not creating restrictions that might cause people to fall back out of'",
        "'speaker_1': 'those programs.'",
        "'speaker_0': 'Thank you. Okay. I'm not seeing any more. Hands up. So, Madam Clerk, why don't we go to our public speakers? How many do we have?'",
        "'speaker_1': 'We have six now. So, Priscilla, 3 minutes. But if anybody else raised their hand or got a two, the first one is Doug Biggs.'",
        "'speaker_0': 'Okay. And you'll keep an eye on that. All right. Welcome, Speaker Biggs. I see that hand of Speaker Biggs. What do you think? Yes. There you go.'",
        "'speaker_2': 'Good. I've I've adopted the council member. Disagree to button philosophy here, so that must be helpful. I very quickly want to. My name is Doug Biggs. I'm the executive director of Alameda Point Collaborative. I wanted to just add on very briefly about this whole Housing First policy.'",
        "'speaker_2': 'It is a requirement of HUD that all permanent supportive housing programs provide a housing first access to their programs in order to access HUD funding. So all permanent supportive housing programs throughout the country, including here in Alameda and Alameda Point Collaborative, our housing first projects.'",
        "'speaker_2': 'We like to say that case management services are voluntary for the client, but not for the employee. They do very aggressive outreach and engagement in order to get people to participate in services which they do. Regarding the plan.'",
        "'speaker_2': 'I want to thank staff at home base for their really inclusive, thoughtful process, that of all stakeholders, including those with lived experience of homelessness and others in implementing the strategic plan. I would hope that the Council take note of the need to serve homeless from throughout Alameda by providing services throughout Alameda, not just locating them all in'",
        "'speaker_2': 'one location, and also ensuring, as the one of the goals stated, that programs implemented are adequately and sustainably funded and that they have clear metrics to be able to access, access or assess success. One of the things we heard over and over again in the stakeholder meetings is people want to know what's being accomplished and how well'",
        "'speaker_2': 'it's working. Well, we're investing our local money. Lastly, I'd ask the Council to take note of the goal to streamline the development of housing. And I would encourage this counter to develop strategies to reduce the time and money the city and providers are forced to expend and the inevitable opposition that comes to any homeless services in the'",
        "'speaker_2': 'city. We don't have to look far to see that opposition to homeless services can increase the cost of projects by millions of dollars and delay their implementation by years, all while our unhoused neighbors are forced to live in unbearable conditions.'",
        "'speaker_2': 'Effective due diligence is good stalling tactics to deny services to homeless art. I ask the Council to include in the Strategic Plan Development Policy development of policies that limit the ability of those opposing serving homeless in Alameda from stopping or delaying the implementation of these important services.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Council Speaker Biggs, our next take your place. Then. Welcome speaker mix.'",
        "'speaker_2': 'Hello, Madam Mayor and members of the Council. Thank you for the opportunity to speak. I'm an Alameda resident. I'm also an architect involved in the creation of multifamily housing for all income levels in projects all across the Bay Area.'",
        "'speaker_2': 'The goal of the program, as mentioned tonight to secure a housing future for all Adam Alameda was definitely admirable and I think the strategy to access and use available public and private land for housing also makes a lot of sense for us.'",
        "'speaker_2': 'But the locations of the properties that are currently being considered for this program do not portray a city wide program. Not even close. Of ten potential properties that are being considered for the program, only one is east of Webster Street.'",
        "'speaker_2': 'Feels kind of like redlining. I provided a written comment for the meeting record with Google Earth Link showing the locations of all known properties under consideration. I would encourage the Council and the public to take a look at the map for themselves instead of using all of almeida's land to address this problem.'",
        "'speaker_2': 'The map makes it very clear that Almeida's homeless population will be housed West Webster. This leaves the majority of Almeida's neighborhoods unaffected by this program while putting an extreme concentration of homeless facilities west of Webster in spite of suitable land available elsewhere across the island.'",
        "'speaker_2': 'I would encourage the Council to more equally distribute the locations for shelters and services across all of Alameda. Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Marilyn Rothman.'",
        "'speaker_0': 'Good evening, Speaker Rothman.'",
        "'speaker_4': 'Hello. I wanted to bring up the. The idea that is that one of the first items that the Road Home Plan should focus on is the Fire Department Family Services Project to ensure its success. You know, I'd like to see some connectivity with that, and I don't know how that would work.'",
        "'speaker_4': 'Since we're trying to get this pilot.'",
        "'speaker_3': 'Program going, it would seem like it would fit in here. And should we focus on? I'm also wondering, I.'",
        "'speaker_4': 'Don't know who would be in charge of this, but who who would address those 100 plus people who only have large space shelter.'",
        "'speaker_3': 'During winter months.'",
        "'speaker_4': 'Who didn't have it last year because of COVID and probably won't have it this year because of COVID. And I don't know whether this is the the agency that would deal with that or it needs to be assigned to somebody or what.'",
        "'speaker_4': 'Anyway, thanks for letting me speak.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'We now got one more hand raised so the time will change down to 2 minutes for the remaining speakers. Right. And the next one is Maryland. All one.'",
        "'speaker_0': 'Good evening, Speaker. Alvin. You just need to unmute.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'There you go. Good evening. I wanted to say that I have worked as a professional in affordable and supportive housing for over 30 years, and I support the city's recognition of the need to take action to address homelessness in Alameda.'",
        "'speaker_4': 'The road to home states that the city will purchase land and.'",
        "'speaker_2': 'Properties to serve the homeless.'",
        "'speaker_4': 'Population. As a resident of the West End. I have seen that to date. The properties addressing homelessness are concentrated in the West End. Going forward, I ask that a mechanism be established.'",
        "'speaker_2': 'Around the decision making process.'",
        "'speaker_4': 'For land and property purchases and that policy be formulated that defines criteria used.'",
        "'speaker_2': 'For choosing the location locations.'",
        "'speaker_4': 'Of these properties.'",
        "'speaker_2': 'Furthermore, I request.'",
        "'speaker_4': 'That these properties be distributed throughout the island and that the community involvement and transparency.'",
        "'speaker_2': 'Be the basis for these decisions. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker, Harman Reed. Good evening, Speaker Reed.'",
        "'speaker_3': 'Good evening and good evening, Madam Mayor and city council members. I appreciate this.'",
        "'speaker_0': 'Opportunity to make a brief.'",
        "'speaker_4': 'Comment related to the.'",
        "'speaker_3': 'Report. I see two major concerns that should be thoroughly addressed and reviewed.'",
        "'speaker_4': 'One is the fact that, according to the most recent unhoused count and survey, the number one self-reported cause.'",
        "'speaker_3': 'Of a person's homelessness was the loss of a job at 26%. Obtaining and retaining employment through skilled job training.'",
        "'speaker_4': 'Programs should be a top.'",
        "'speaker_3': 'Priority, in my opinion. I'd like to see a substantial increase in support for higher paid workers.'",
        "'speaker_4': 'We need to support programs that pay a living wage well above the minimum wage.'",
        "'speaker_3': 'We expect these community members to regain their independence and dignity. This information should be included in any future reports. The second concern I see in the report is related to the availability of showers. From my understanding.'",
        "'speaker_4': 'And from other reports that I have seen, the program available.'",
        "'speaker_3': 'At Christ Episcopal Church is only open on Sundays. Can this please be increased to daily showers? Also, can you please clarify if the showers at the Village of Love are available to the unhoused on a daily or weekly basis?'",
        "'speaker_4': 'It would be good to also focus on a data driven approach and continuing.'",
        "'speaker_3': 'To address these concerns. And thank you for your consideration.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_3': 'Mark Foley.'",
        "'speaker_0': 'Good evening, Speaker Boling.'",
        "'speaker_2': 'Hey there. Yeah, I just wanted to thank staff for this plan. I wanted to mention, with the housing on my process that we're going through, we have a great opportunity to identify sites for new housing at the same time.'",
        "'speaker_2': 'So I think there's some overlap there. And I think if we want to hit, are we if we want this new housing to count for our affirmative affirmatively fair furthering, fair housing goals that we have to hit in our housing element.'",
        "'speaker_2': 'We need to look at project sites more than just in the west of Alameda. And I think on the whole, though, this plan looks pretty good. It solicited input from all the right folks. So I want to thank staff for that.'",
        "'speaker_2': 'I think it's vital that we speed up production of needed homes in Alameda, including affordable housing. And I think we need to do whatever we can to remove roadblocks and stream new light or new housing, especially housing like this.'",
        "'speaker_2': 'And I'm just going to leave my comments at that. Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Our last speaker is Janine Anderson.'",
        "'speaker_0': 'Good evening, Speaker Anderson.'",
        "'speaker_3': 'Good evening. I just wanted to second Doug Biggs. We really need to streamline the process for building or renovating properties for these projects. I also strongly agree with Ben. I now live on the East End and I think that for this to be an equitable undertaking, the East End needs to participate in serving our unhoused neighbors.'",
        "'speaker_3': 'Especially given the conversations I've been witness to about these neighbors and the frequency of interactions I have seen between our between unhoused people and our police officers once I was off. Thank you.'",
        "'speaker_0': 'Thank you. Okay. And you said madam. Correct? I was our last.'",
        "'speaker_1': 'Speaker and we just had one more person.'",
        "'speaker_0': 'Okay, then.'",
        "'speaker_1': 'Alexia Roach.'",
        "'speaker_0': 'Good evening, speaker approach.'",
        "'speaker_3': 'Good evening, everyone. Thank you. I promise I'll be brief. I just want to second what a lot of folks said, and I am grateful for all of the work that was put behind this. I think it's really important to have this sort of access, be barrier free and acknowledge the realities of what folks have been facing and'",
        "'speaker_3': 'are going to continue to face, especially with what's happening in the East Bay right now with the homelessness crisis. I also appreciate that the plan takes into account having people with actual lived experience being part of the planning.'",
        "'speaker_3': 'I think that's very important that they are part of the decisions that are going to be impacting their lives. So thank you everyone for your hard work. And I second a lot of what the prior speakers said.'",
        "'speaker_0': 'Thank you. And you always have 2 minutes to speak. You don't have to rush of network any further speakers.'",
        "'speaker_1': 'That does.'",
        "'speaker_0': 'Okay. So with that, I will close public comment on item seven B and yeah, let's have a discussion, a really important topic. And you know, maybe I'll ask clarification from staff just for a couple of things or staffer or consultant that were brought up.'",
        "'speaker_0': 'The someone was concerned that last year and possibly this year we didn't offer shelter during the winter months because of COVID. My understanding that we did, we just did it in a different manner. Can someone speak to that?'",
        "'speaker_4': 'I can speak to that.'",
        "'speaker_0': 'Miss Butler. Thank you.'",
        "'speaker_3': 'So last year, we reduced the number significantly of.'",
        "'speaker_2': 'The people that we sheltered.'",
        "'speaker_4': 'Because.'",
        "'speaker_2': 'Of COVID.'",
        "'speaker_3': 'We could not house the 90 that we normally house, and we only housed seven. Continuously.'",
        "'speaker_0': 'Did we not, though, have hotel and motel rooms for people rather than in Christ Episcopal Church?'",
        "'speaker_4': 'Correct. We have seven, seven hotels.'",
        "'speaker_3': 'The price is extremely different.'",
        "'speaker_0': 'Okay. All right. Thank you. Okay. Okay. Council comments.'",
        "'speaker_4': 'Feedback.'",
        "'speaker_0': 'Well, Ali. Okay, you go. Cause we're not quite. I prefer you to go.'",
        "'speaker_2': 'So I guess I have a quick question that that will lead into my really one singular comment. But I'll start off by saying I think it's a fabulous report and I really appreciate all the staff work that went into it.'",
        "'speaker_2': 'We have had we've received a number of letters about already developed site lists for action. 1.1.8 says that we should collaborate with building planning, building transportation for identify sites for a lot of the services that are needed. Has a list been developed or are we talking about I know there was the list for the ARPA response that'",
        "'speaker_2': 'was put together, but I'm just curious, has 1.1.8 been completed?'",
        "'speaker_0': 'Would like to take that. And Isabella, go ahead. Yes.'",
        "'speaker_3': 'This has not been developed.'",
        "'speaker_2': 'Great. Thank you. That was that was my that was my assumption as well. But I know that there have been lists and maps and things like that to the point that that a number of speakers have made. I think it would be really incumbent on us if we were to approve and move this this plan forward to'",
        "'speaker_2': 'add to 1.1.8, something that says that we want staff to identify ways in which to ensure there is some form of equitable. I don't want to say, you know, distribution of services provided across the island to our unhoused population and resident so that we're not assuming everybody is going to go out to the very end of the'",
        "'speaker_2': 'Alameda point. And we know that we have some land use constraints in some parts of our island because of about because we just have vacant land on the West End thanks to the Naval Air Station leaving or whatever else.'",
        "'speaker_2': 'And so we could do as a part of this list, have some list of some strategies and whatnot that could be implemented in order to make available sites across the island and Bay Farm as well for these. Beyond that, I just wanted to we we came up with the concept and we gave kind of direction last July'",
        "'speaker_2': 'to come up with a to come up with a strategic plan for homelessness. The work kicked off in January, which was phenomenally fast, especially given everything that's been going on. And here we are in October with a really well-written, well-developed plan that I really feel, you know, sets, you know, is yet another plan that that that now'",
        "'speaker_2': 'shows how we can do these things really well in the city by coming to council and checking in on goals and whatnot. So you're sure, you know, the community is kind of following along and the council's given input and whatever else.'",
        "'speaker_2': 'And I just think this really achieved what I was hoping for it when when I had my initial discussion with staff back at the beginning of the year. And I just want to give everybody great props and thanks.'",
        "'speaker_2': 'I really appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. I would like to go. Next case over here, Spencer.'",
        "'speaker_4': 'Thank you, Mayor. So I was not on council, and this decision was made back in July. And I appreciate member Knox. Right, sharing that history. I would like to know who chose or how the members were chosen that participated in the process.'",
        "'speaker_4': 'There is there was a lengthy list of people that were participants.'",
        "'speaker_0': 'I'd like to take that.'",
        "'speaker_3': 'I can take that. We had a kind of a tiered or a sort of multi-level process for community outreach. It included everything from a steering committee to focus groups, individual interviews, a number. A number of those were identified by staff, the steering committee, focus group participants.'",
        "'speaker_3': 'But then we also wanted to have a broader opportunity for the community in general to participate. So we had a survey that had over a thousand responses, as well as two community meetings.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'The community meetings were virtual, right? Yeah. I remember participating in the first. Somebody started to add something. Or was that you cast over her, Spencer?'",
        "'speaker_4': 'Well, I was trying to continue, but, you.'",
        "'speaker_0': 'Know, I was trying to call. And whoever was speaking, I just didn't. Didn't see who it was. It was you.'",
        "'speaker_4': 'Thank you, Mayor. So then my my next question goes to within the staff report, there are some in the correspondence that lists addresses of sites. And one of them is this four, three, four Central Surfside Apartments. And it's this is that property that the city owns.'",
        "'speaker_0': 'I miss Butler. You take that?'",
        "'speaker_4': 'I would. I think. Miss Maxwell, take that one.'",
        "'speaker_3': 'Miss that. That's a castle that we made a.'",
        "'speaker_2': 'Loan on through through our hip.'",
        "'speaker_3': 'Funds for security.'",
        "'speaker_2': 'CDBG, so that we just assisted that owner with a loan. We do not own it. That was in connection with the renovation.'",
        "'speaker_4': 'Okay. So what's the status of that property? Who lives there or is that connected to the city other than alone? Why is the city loaning that money?'",
        "'speaker_0': 'Ms.. Maxwell Just so the public will know. When I tell people who you are, oh, I guess everyone to do that when you first speak.'",
        "'speaker_3': 'Thank you for reminding me.'",
        "'speaker_2': 'I appreciate that. I'm Lisa maxwell, the community development director.'",
        "'speaker_3': 'Yes, we made that one to that fund.'",
        "'speaker_2': 'And that was just an opportunity for him to provide an improved housing stock and to offer some affordable units as well.'",
        "'speaker_4': 'So how many affordable units are there and how many units total?'",
        "'speaker_2': 'I do.'",
        "'speaker_3': 'Not remember how many.'",
        "'speaker_2': 'Affordable units they are. I believe there is approximately 50 units in the parcel, though it's not a large it's not a large apartment complex.'",
        "'speaker_4': 'Are there people living there right now?'",
        "'speaker_3': 'Yes, there are.'",
        "'speaker_2': 'And the units will be remodeled and people will potentially have to move that way. They will all be provided opportunities for housing during the remodel, and then they will get an improved unit following that process.'",
        "'speaker_4': 'Okay so that is that building them sounds like not available for unhoused that it is separate from this proposal.'",
        "'speaker_2': 'Yes. My understanding that was more for an affordable project for various income levels. So I think that's a little different product. Amanda, can you.'",
        "'speaker_3': 'Speak a little.'",
        "'speaker_2': 'Bit to the inclusion in this particular report of that project?'",
        "'speaker_0': 'And that was which. Amanda.'",
        "'speaker_3': 'Oh.'",
        "'speaker_2': 'Here she is. She knows.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'So that project was not kind of on our radar when we first began this process. But we do talk about the importance of securing housing future for all our students. And we know that really any affordable housing can help to keep people housed and prevent homelessness, which is a key part of this plan.'",
        "'speaker_3': 'I don't know. Amanda Wurman If you would add to that.'",
        "'speaker_1': 'Yeah. Thanks. Thanks for the strategy. 1.1 is where we talk about assessing and using available public and private land for housing. We didn't take the step of coming up with a list, but rather recommended action steps related to doing that analysis.'",
        "'speaker_1': 'So we talk about collaborating with planning, building and transportation. And I'll also just highlight we have an action step around assessing housing sites, proximity to amenities, which might relate back to some of our earlier comments about just thinking about where properties might might lay in the future.'",
        "'speaker_0': 'Yes. Continue.'",
        "'speaker_4': 'Thank you, Mayor. So, okay, so we did receive correspondence with addresses, right. And we had a speaker that spoke to that. And that's what I want to get clarification. That sounds like this apartment building is private property and has people living in it right now and is not really part of.'",
        "'speaker_4': 'And I'm going to add that is not really part of right now where a vacant parcel or building that we could put unhoused in.'",
        "'speaker_2': 'That's my understanding, although it could also be used for very low or low, low income folks. So there's that opportunity accessed to assist people who may be on the verge of becoming homeless. Because as part of this program, as well as to prevent some of the homelessness from occurring.'",
        "'speaker_4': 'Right. Okay. So thank you. So I get that. So I just want to try to be clear to the public, though, what we're talking about, because somehow there are there are lists that are being presented and you all got the correspondence attached to the agenda.'",
        "'speaker_4': 'And I think it's important to be clear to the public in regards to these these lists, what is really part of this program and what's housing that already has people in it. So that's why I was asking for clarification of that.'",
        "'speaker_4': 'I want to move on. When I look at this report, there is quite a bit of data in regards to the Alameda unhoused population, and I think that that was very helpful to look at that. And so I appreciate that work.'",
        "'speaker_4': 'However, when we get down to the goals, I'm actually not sure how many of these goals, if any, are particular to Alameda and how many and what is actually something that would apply to any city that hires this company to do this work.'",
        "'speaker_4': 'Because the, for instance, goal one secure housing future for all Alabamians. My guess would be that that could be, you know, to for whatever city and state and that net goal to increase access to homeless emergency response services to meet these goals.'",
        "'speaker_4': 'I'd like to spend more time, actually. But what do they mean for Alameda and and our plan? I look at this report and I think it's very helpful for the background so we know who is unhoused and we can try to figure out how to help them get housing where the more specific needs are.'",
        "'speaker_4': 'But I think that the actual goals here I'd like to spend more time on and really figure out. But I mean, honestly, the first goal is secure housing future for all immigrants. I think we all support that. But I think as I as a council member, I need more help of what does that really look like and'",
        "'speaker_4': 'how it's going to apply. And so these are I think maybe this is supposed to be a just a very general plan. But if we're being asked to actually prioritize and I want it more specific and I probably want it more specific from staff, what is the ask specifically that's coming to us?'",
        "'speaker_4': 'Because what I don't want to do is say, you know, I am very concerned about providing housing for those that need it as well as services. And we did have speakers and spoke specifically about help with jobs and that shows up in the data.'",
        "'speaker_4': 'So those are things that come from the data. And then I would like a more specific response from our city of how are going to meet the specific needs of our meetings that need housing and not so broad.'",
        "'speaker_4': 'So I think that's important for us to know what the real ask is from staff at this point. I'm happy to agree that the data part and I think that that honestly, that's something I've been asking for for a long time.'",
        "'speaker_4': 'So I really appreciate that work. But then now what are we going to do with that data? And what is the real ask that I'm concerned about is supporting this the goals here that are just, I think, very, very vague.'",
        "'speaker_4': 'And what is the real ask the council? Do we want to purchase, for instance, the bottle parcel? Do we want the marina? And things like that I think is where we can weigh in and make decisions to move forward.'",
        "'speaker_4': 'And that's where it's hard for me to support this. The goals other than we're using it very, very broad and not narrowing it down to this is what we're going to be doing. So I would like help from staff in regards to what is what are we really at being asked to approve?'",
        "'speaker_0': 'Good questions council member Herrera Spencer. This Maxwell do you want to touch on that? Because I know you've been doing some work on a lot of things and also Ms.. Butler, I mean, all of you. But why don't you help us understand how have this all the work you've been doing and considerations council has been hearing about'",
        "'speaker_0': 'how it all fits?'",
        "'speaker_2': 'Certainly I can kick off and then if Ms.. Cutler wants to supplement my response, I know she's knee.'",
        "'speaker_3': 'Deep in this as well.'",
        "'speaker_2': 'As I am.'",
        "'speaker_3': 'So we have certainly.'",
        "'speaker_2': 'Been.'",
        "'speaker_3': 'Exploring very.'",
        "'speaker_2': 'Specific projects council under her answer, and we will be coming to you with those in the near future. You know, we have various ideas.'",
        "'speaker_3': 'For Explore and we're.'",
        "'speaker_2': 'Exploring an opportunity for scattered sites.'",
        "'speaker_3': 'Emergency transitional.'",
        "'speaker_2': 'Housing. We're exploring, as you know, the battle parcel. And we've taken another look just today at the Marina Village. And we had another potential opportunity presented to that which we're sort of in the.'",
        "'speaker_3': 'Early stages of. But all of these are on.'",
        "'speaker_2': 'Our radar, and we have to sort of vet the potential of each of these. As you know, we've got the homekey money and the application process is opened up. So we're doing our best to gear up for that, which we hope to submit sometime in the late November, January phase.'",
        "'speaker_2': 'We have to interview our RFP.'",
        "'speaker_3': 'Response providers.'",
        "'speaker_2': 'To select a provider and look at what can we you need a partner.'",
        "'speaker_3': 'To do those projects.'",
        "'speaker_2': 'And so folks have offered various projects that they're interested in. So we're now speaking to them to try to identify a partner with the project if they're willing to to do with the city. So all of that is moving.'",
        "'speaker_3': 'Rapidly forward, and.'",
        "'speaker_2': 'We'll be coming to you soon for further information. But I really appreciate your interest in having more detail. And as soon as we can offer you very substantial details about our particular project, we'll be there to do so.'",
        "'speaker_2': 'But as Marissa mentioned, there's a lot of moving parts right now and we're exploring.'",
        "'speaker_3': 'Lots.'",
        "'speaker_2': 'Of opportunities that are looking pretty interesting.'",
        "'speaker_0': 'Let's see if Ms.. Butler wants to add to that and then I'll get back to Councilmember Herr Spencer. Ms.. Butler.'",
        "'speaker_4': 'I just wanted to point out on page.'",
        "'speaker_3': 'Starting on page 42 of 69, there are specific.'",
        "'speaker_4': 'Action steps and they go with the strategies. They are generalized and that generalization full. Well, we'll be more specific.'",
        "'speaker_3': 'When we come to you, as Ms..'",
        "'speaker_4': 'Maxwell indicated. Okay. So I appreciate that.'",
        "'speaker_0': 'Yes. Back to you, Councilor Spencer. Thank you.'",
        "'speaker_4': 'Sir. We have a housing authority and I have a concern and I've expressed this before, is the city now is creating its own housing department.'",
        "'speaker_3': 'No, we're certainly not intending to do that. The money that is available from this.'",
        "'speaker_2': 'The state hope the the.'",
        "'speaker_3': 'Home care money.'",
        "'speaker_2': 'Is available to us as a city.'",
        "'speaker_3': 'So we're just looking.'",
        "'speaker_2': 'At opportunities that are presenting themselves to us. And there's comparable counting money that's presented to cities as well. So we're certainly not intending to take the place of the housing authority. We just are having opportunities like ARPA. Right now, there's a rare opportunity to attempt to do some some really great stuff and create some affordable homeless housing'",
        "'speaker_2': '. So we're just trying to capitalize on those.'",
        "'speaker_4': 'Okay. So I want to speak to that because the housing authority used to be part of the city. It really is still part of the city. The mayor nominated for the oversight, in my understanding, is that the housing authority was separated from the city to actually make it more efficient and help the housing authority to be able'",
        "'speaker_4': 'to apply for grants and streamline the process and then end up with more moneys being available for the cause, if you will. And I when I look at this report, I would like to see more working with the Housing Authority.'",
        "'speaker_4': 'I really think I do support the Housing Authority. I have concerns of staff at duplicating a housing department. And I and in other cities, the housing authority is within the city. So they would not I don't I don't think they'd be having a conversation like this.'",
        "'speaker_4': 'And I think that we need to try to reduce that barrier and increase the conversation with our housing authority to ensure that the majority so that as much money as possible is actually going to the cause and not creating more staff in this city hall as opposed to the housing authority that actually provides the same services.'",
        "'speaker_4': 'But I feel like it's starting to happen here, and my preference would be to really work with the housing authority and find out the best use of these. They're very limited funds. So I do have concerns about us duplicating their work and not really working with them.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Other comments? Council members. Council Vice Mayor Vela and just a mute.'",
        "'speaker_3': 'I want to thank staff for their work on this. I think that that's really the objective here is to have, you know, a kind of a broad goals by which we can direct staff to to kind of follow while they explore different solutions to the problems and understanding that oftentimes with issues like housing, it's not going to'",
        "'speaker_3': 'be a one size fits all approach, that there's going to be much more detailed exploration and that they will come back to us once they've been able to see what's feasible relative to the funds that are available relative to the parcels that are available.'",
        "'speaker_3': 'I do. I want to echo Councilmember Knox White. Knox White's concerns about making sure that we have equitable access to housing and distribution throughout the city regardless of where things, you know, where we might have kind of conveniently located development going on.'",
        "'speaker_3': 'I think we need to and I think our staff is trying to to look outside of that to point and make sure. But I think that we have an opportunity with arena discussion, with the other conversations that we're having to really make a concerted effort to this.'",
        "'speaker_3': 'And so I want to make sure that we do that. I think the goals are spot on, and I think that the specifics in terms of where staff is going to be focusing their energy, in terms of exploring the possibilities, I think that that list as outlined, really captures a lot of the council directive that has previously'",
        "'speaker_3': 'been given. So I want to move support of this plan with the comments that have been made by several of us now about making sure that our plan is inclusive and really looking throughout the island. And I want to encourage all of us to really remember that this is the priority that we've set as a council.'",
        "'speaker_3': 'And when we are looking at projects and different things coming before us to really make sure that we keep that lens and that focus on equity, on making sure that housing for all and is our priority and making sure that we are putting housing first when when we're reviewing these different projects and plans.'",
        "'speaker_0': 'Thank you, Vice Mayor. And a couple of us would still like to make comments, but Councilmember Knox White, you got your hand up.'",
        "'speaker_2': 'Simply in a second so we can discuss.'",
        "'speaker_0': 'All right. Thank you for that second and we will continue to discuss. Okay. Councilor well, Councilor Bridges, like, I think you were starting to put your hand up when vice mayor validated some of the concerns that I'll go back to Councilmember Herrera Spencer and before I speak.'",
        "'speaker_0': 'Go ahead. Councilmember de SAG.'",
        "'speaker_2': 'Well, great. Well, thank you. So these are my comments. You know, as a council member, as projects, specific projects arise, I will definitely be supportive of those projects. For example, I think whether the $15 million or so in ARPA money is for purchasing the marina village in as a homeless facility in the northern waterfront, or whether the'",
        "'speaker_2': '$15 million in ARPA funds is used for developing a homeless site facility on what's called the Bottle Bottle Project, a bottle parcel near Safeway at Alameda Landing. And I'll I'll definitely continue to be supportive of these specific projects, much in the way that I have been supportive of of homeless projects since 1995, when I first served on'",
        "'speaker_2': 'what was called the Alameda Reuse and Redevelopment Authority. But I just don't feel like I have enough information with regard to the overarching across the board policies that are being implemented, particularly. I mean, my understanding of the way that the current way that homeless this is combated and maybe and maybe Housing First is superior to the current'",
        "'speaker_2': 'we I don't know. But my understanding is that the current way is that for those homeless individuals who are suffering from mental health issues or addiction issues, that progress towards achieving relief from from from their issues is is a.'",
        "'speaker_2': 'And part of their continued housing for those individuals who need jobs. Progress towards job training. Job counseling is is a critical part of that or it's a requirement towards fault for keeping the housing and that the case manager in this in the current system is an essential role and helping the homeless individual kind of maneuver through the'",
        "'speaker_2': 'different types of services that that that she or he needs to access. I'm sorry, but I'm I hear what what staff is saying or what our what our consultant is saying. But I'm looking at the report and the report itself, especially on page 34 of 69, is saying, you know, these things are voluntary.'",
        "'speaker_2': 'And and, you know, and. The requirement of services is kind of being interpreted as a barrier. And to me, okay, I get I get that maybe it's a barrier because I mean, maybe some people don't want services under the current situation.'",
        "'speaker_2': 'So, so maybe if they don't want services and they don't get housed, I think that's the fundamental argument of Housing First. But I kind of still think people need to be required to get services. And and my reading of of of of the of the report of the actions and priorities and goals is, is to kind of'",
        "'speaker_2': 'change that. And maybe maybe Housing First is. Mate, mate, maybe maybe it is far superior to to the previous system. And obviously, you know, all you need to do is, you know, drive through many parts of if not Alameda, then then many parts of of the East Bay to see that we have a homeless crisis even within'",
        "'speaker_2': 'the current paradigm. I get it. I get it. But I it's hard for me not I mean, maybe I'm literal. I'm taking the literal reading of page 34 of 69. I'm reading that too literally. But, but I just to me, services has to be a requirement of of of accessing and staying and housing.'",
        "'speaker_2': 'And so I hear what Steph is saying or a consultant is saying, but that's not what I'm necessarily reading. So I'll, you know, I won't support this, I won't oppose this. But but as projects come come before me, I'm certainly sure that I will support the projects as I have done in the past.'",
        "'speaker_2': 'But in terms of the overarching policy that we have before us, I just feel that there is still a lot of outstanding questions in terms of how we can actually require people accessing services as a condition of, of, of emergency homeless housing.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Thank you, Councilor Brody, said Councilmember Herr Spencer. I think I saw your hand up.'",
        "'speaker_4': 'Yeah. Thank you, Mayor. I'm just going to quickly say that we also had a speaker that spoke about partnering with Army to Family Services, more in the fire department and what that's going to look like. Savvy. I think that these goals are way too broad and don't really are not particular to Alameda.'",
        "'speaker_4': 'I would have liked to see more specific work with Alameda and our housing authority. I will not be supporting this because I think we're also going to be duplicating the housing authority and staff. And I don't think that's appropriate.'",
        "'speaker_4': 'And I but I do appreciate the data. I thought that part was very good of the report. The rest of it, I don't think Alameda thinks.'",
        "'speaker_0': 'So all the last. I have had the honor and privilege for the last year of chairing the League of California Cities Statewide Policy Committee on Housing, Community and Economic Development. During this year, I've also been the president of the.'",
        "'speaker_0': 'There's conference that's a group of the 14 mayors in Alameda County, our city managers and staff.'",
        "'speaker_1': 'And you froze for just again. Okay.'",
        "'speaker_0': 'I got that.'",
        "'speaker_1': 'I'm getting it to a.'",
        "'speaker_0': 'Stable Internet connection. Okay. Anyway, Alameda County Mayors Conference. I'm part of the The Mayor's Homelessness Working Group and that's chaired by Berkeley Mayor Jesse out again. What I will tell you as far as thinking that policies are cookie cutter could apply anywhere.'",
        "'speaker_0': 'We have a statewide housing crisis. We have hundreds of thousands of homeless individuals in this state. California, the fifth largest economy in the world. And yet we have residents sleeping in creek beds. Railroad rights of way under freeway overpasses along our streets, you name it.'",
        "'speaker_0': 'What we need is solution, not more talk. I've also had the privilege of a of a hearing from cities around the state that are doing some really innovative things to start eating away and solving this crisis. And that's what it takes, one project at a time.'",
        "'speaker_0': 'I've also had the privilege of accompanying staff on a couple of field trips, while I think I organized the first one and they came with me and then I tagged along on the second. So we have seen actual successes.'",
        "'speaker_0': 'We have seen what it looks like when you put people into supportive housing. It doesn't take a lot of money to put it up. There's various ways of doing it, but it comes with wraparound services. And when the people are there and when they have the job counselors, the mental health counselors, the substance abuse counselors, the counseling'",
        "'speaker_0': 'for their children and assistance with finding jobs and getting coaching for the interviews, magic starts to occur. But you need to give people a chance. What we don't need is to talk this to death. We need to take action.'",
        "'speaker_0': 'At some point, you've got to stop talking and actually take action. And I think we're really close to doing that. I completely agree with the motion the second that was made. I also would ask, and I think it was raised by in some of the comments, metrics, measurables, that's really important.'",
        "'speaker_0': 'We talked about that a lot in the Mayor's Conference Working Group. How do we know what's working, what needs to be tweaked? And I think and again, we are working with subject matter experts. I know from Ms.. Maxwell that staff is in the process of interviewing some really innovative, exciting service providers who have had successes in other'",
        "'speaker_0': 'areas where they have been, you know, provided the resources for this support for these kinds of supporting supportive housing. But let's get metrics incorporated so we know what we've accomplished, what might be changed, how far we've come. I completely agree that we and we've asked staff and I and I do believe that they're working on it, that'",
        "'speaker_0': 'we need to find ways to reduce these barriers brought by, I'll say, NIMBYs, who find every different way of opposing the kinds of supportive housing that addresses the kinds of needs we've been talking about. I give you the example of the wellness center.'",
        "'speaker_0': 'And so we do need to find a way to minimize the number of objections of roadblocks and barriers that are thrown up. And I think I know the time is now to do this. I also commend the the consultants for including people with lived experience in this conversation.'",
        "'speaker_0': 'It was a suggestion I made after the first meeting. I participated in that first one, and I thank you so much for bringing this report to us. I'm fully ready to support it. So we are going to take the vote.'",
        "'speaker_0': 'And then I do want just that minute to to make the announcement. Or, Madam Clerk, if you have a way of putting up on the screen.'",
        "'speaker_1': 'We did. Sarah Henry forwarded it. I was ready to go.'",
        "'speaker_0': 'You know what? I sometimes say this Henry is the other half of my brain, because I was getting ready to say if Miss Henry could provide that, because I was actually looking at the press release that she had done.'",
        "'speaker_0': 'So perfect because we're not quite. I saw your hand go up.'",
        "'speaker_2': 'Thank you. Just ahead of the vote, I just wanted to expand my my support for this beyond the fact that it was just good work. You know, for me, this is a strategic plan. It's not supposed to be telling us what we're doing, where it's supposed to be the guiding principle.'",
        "'speaker_2': 'And I appreciate this butler pointing out I counted on there are 51 specific actions in here, all of which are the actions that will be taken to lead us to the outcomes that we want. And I also just wanted.'",
        "'speaker_2': 'Again, not for my colleagues, but for the 39 people who are watching. Housing First is not a new thing. It's an old thing. It actually went away during the Reagan administration and other times when they wanted to start making people have to do things in order to get housing.'",
        "'speaker_2': 'And what they learned was that until you have housing, you cannot be ready to go through drug treatment, mental health treatment, job training, etc.. And over and over and over again, the studies that have been done around this have found that you have to have a housing first program in order to get people to take those.'",
        "'speaker_2': 'And so I don't I take this very enthusiastically supporting the Housing First policy that is embedded here. It is also the direction of our county that we are already following, etc.. But, you know, my comment, and I'm sure most of my colleagues comments when they were interviewed by staff on this was like, I want a plan that'",
        "'speaker_2': 'that actually does something that gets us to success and it starts to starts to do that work. And yeah, I believe this is the plan and I look forward to support it. Thank you.'",
        "'speaker_0': 'All right. Thank you, madam. Quick, may we have a roll call? Vote, please.'",
        "'speaker_1': 'Celebrity soccer.'",
        "'speaker_2': 'EPSTEIN Sorry you couldn't find her.'",
        "'speaker_4': 'SPENCER No.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'I may or as he Ashcraft. Absolutely.'",
        "'speaker_1': 'I carry my three eyes. What? No one abstention.'",
        "'speaker_0': 'And we can show that they make you feel like. Yes, yes. So I just want members of the public I don't want anyone to experience housing insecurity or, God forbid, homelessness. So you can call two, one, one. You can also go online to this website w w w that ac dc housing security dot org and was there'",
        "'speaker_0': 'not also an 888 number are two and one. I'll do it.'",
        "'speaker_1': 'I don't. I don't know if anybody here knows. I don't have Sarah. I've. I've got.'",
        "'speaker_0': 'It. But is it. Is it. Can you actually.'",
        "'speaker_3': 'When will be fine.'",
        "'speaker_0': 'Too. And when will be fine. Okay. Anybody who's watching take a photo with your with your cell phone and just keep that handy. Yes. And just keep that handy for for your reference and go there today. You can download the information or two and one will help walk you through.'",
        "'speaker_0': 'You are eligible. You may be eligible. Don't second guess. But for 12 months of back rent and three months of forward rent paid for in full, it goes to your landlords. This is a program that helps landlords. It also will pay for unpaid utility bills.'",
        "'speaker_0': 'And Treasury Secretary Janet Yellen is so serious and concerned about the fact that these funds just aren't getting out the door and getting spent fast enough that self attestation is all you need for some of the documentation about loss of income and employment history and that sort of thing.'",
        "'speaker_0': 'But please call two, one, one or visit AC dash housing secure dawg and do it now. Thank you, Madam Clark, for sharing that with us. Counsel We are going to take a brief break because we've been at this almost 3 hours, which violates my Zoom rule.'",
        "'speaker_0': 'So it's 943. Let's be back at 955. Staff consultants, thank you so much for providing presenting this wonderful, truly life saving, life changing information. And we look forward to next steps. Thanks, everybody. We'll see you at 955. Okay.'",
        "'speaker_0': 'Okay. I'm counting noses. Who do we have? Who do we have? Lara.'",
        "'speaker_1': 'Well, let me see if I can get Councilmember De Soto. I know he's in there. Hold on.'",
        "'speaker_0': 'Oh, yes. Okay. Okay. And. I think and I think down there we have council member knocks, weights and.'",
        "'speaker_1': 'All right.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'And we've got city manager, assistant city manager, city attorney. I think we're good to go. What do you think we are?'",
        "'speaker_1': 'I think.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'All right. Ready?'",
        "'speaker_2': 'Yes. Okay.'",
        "'speaker_0': 'Welcome back, everyone. We're back from our recess and we are going to go right into item seven. See, Madam Clerk, if I could ask you to introduce that item first, please.'",
        "'speaker_1': 'Adoption of Unqualified Urgency Ordinance Continuing the suspension during the local emergency due to COVID 19 pandemic of certain provisions of the City Sunshine Ordinance to the extent inconsistent with Assembly Bill number 361, an executive order number 1521 of the Governor of the State of California, arising from the state of emergency caused by the COVID 19 pandemic and'"
    ],
    "Urgency Ordinance and Findings to Continue Teleconference Meetings during COVID-19 Emergency.": [
        "'speaker_1': 'recommendation of findings to allow city meetings to be conducted via teleconference. And I will continue on to briefly introduce this item, if that's okay with. So basically, the city has been conducting these remote meetings with under a executive order of the governor that suspended some of the provisions of the Brown Act.'",
        "'speaker_1': 'And so specifically, we didn't have to disclose the locations and open them to the public of anybody participating remotely. And so the assembly passed a bill and the governor in September approved it. And it puts new provisions into place that require the city council to make findings every 30 days that continue to allow us to suspend those'",
        "'speaker_1': 'Brown Act provisions. So this report is before each night, along with at the beginning of the pandemic, you adopted an emergency ordinance suspending some of the Sunshine Orders regulations, and that is before you again as well, so that meetings continue in the same fashion.'",
        "'speaker_0': 'Okay. And any clarifying questions from the council? And do we have public speakers?'",
        "'speaker_1': 'One speaker, Jay Garfinkel.'",
        "'speaker_0': 'Okay. All right. Welcome, Speaker Garfinkel.'",
        "'speaker_2': 'That evening. I would appreciate it if somebody would explain what is meant by an unqualified ordinance versus a regular ordinance. It appears that we're doing this in order to comply with some state law or regulation. If you recall, when we were dealing with Article 26 of Measure eight, we said that even though there is a there's a'",
        "'speaker_2': 'disagreement, that we will go along with the idea that whatever the state says we have to do, we don't have to necessarily get rid of Article 26. My concern is that this is a backdoor way of continuing to call a state of emergency in Alameda, which we clearly no longer have.'",
        "'speaker_2': 'I would point out that in the charter section three, dash 11, it says that no ordinance shall be passed within five days of when it's introduced. This is the first introduction, I believe, of this, except when it's for immediate preservation of peace, help or safety for an ordinance enacted in the event of great emergency or necessity.'",
        "'speaker_2': 'Yes, the pandemic has is continuing, but we are no longer in a state of emergency. There is absolutely nothing that the city council would have to do on an emergent basis to respond to the COVID 19 situation. If an emergency arises, you can declare an emergency at that time.'",
        "'speaker_2': 'I just don't see any reason to continue the state of emergency. What it does really, in effect, say, get out of jail free card for the city council so that when it pleases you, you can ignore some of the regular rules.'",
        "'speaker_2': 'And I think that's somewhat disingenuous. I would also point out that the usual parliamentary procedure is that when a motion is made, the wording of the motion is entirely spelled out. It's totally inappropriate to say, Yeah, we're going to do what it says above the whereas is disappear once you pass the motion.'",
        "'speaker_2': 'So you can't say we're going to do whatever the whereas has said we're going to do. So I think that whole lot has to be rewarded. Thank you.'",
        "'speaker_0': 'Thank you. Do we have any more public speakers than we did?'",
        "'speaker_1': 'We have four more. The next one, Beth Kenny.'",
        "'speaker_0': 'Good evening, Speaker Kenny.'",
        "'speaker_3': 'Good evening, Mayor and City Council. I am asking tonight that you support this measure. I've had the pleasure of serving on the Commission on Disability for the past seven years, and if the meetings are not to.'",
        "'speaker_4': 'Be accessible remotely any more, I'll be forced to resign as a person with an autoimmune.'",
        "'speaker_3': 'Disease who having three doses of the vaccine already, I still don't have any immunity to COVID. I also have a four year old who cannot get a vaccine yet, so.'",
        "'speaker_2': 'The emergency.'",
        "'speaker_3': 'Is not behind us. This needs to happen.'",
        "'speaker_4': 'This needs to make it accessible. This is making these positions accessible to all. So I ask that you support and make these meetings accessible for both members and the public. Thank you.'",
        "'speaker_0': 'Thank you, speaker kenny. Our next speaker.'",
        "'speaker_1': 'We now have seven speakers at the time, one or two, 2 minutes, and the next speaker is Janice Anderson.'",
        "'speaker_0': 'Good evening, Speaker Anderson.'",
        "'speaker_4': 'Grieving.'",
        "'speaker_1': 'I just want to.'",
        "'speaker_3': 'Echo what you just said. I mean, I don't have children, but I do interact with them. And none of the children that I know are vaccinated. My brother is immunocompromised. He's the only contact I had during the pandemic for the first six months.'",
        "'speaker_3': 'So I. I can't go sit in a room with a bunch of people I don't know are vaccinated at these meetings. And I just think for accessibility reasons for, you know, immunocompromised, disabled people, I think that we need to continue this in a Zoom format.'",
        "'speaker_3': 'And contrary to popular belief, this pandemic is not over. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Savannah chair.'",
        "'speaker_0': 'Good evening, speaker. Chair.'",
        "'speaker_3': 'Hi. Thanks for having me tonight. I just want to echo what both refugees just said and also just maybe mention that if it could just be on council's mind, I guess as we if we ever exit the pandemic situation that we think about this accessibility issue in general with public engagement, it's really, really helpful for folks with'",
        "'speaker_3': 'many barriers to be able to access these meetings online and from the comfort of their home. And if there's a mobility challenge or just straight up just getting to the building to go to the meeting can be really challenging for some folks.'",
        "'speaker_3': 'So just hoping that that can be considered as we move ahead. But I really do appreciate the you know. Urgency of keeping it keeping it online now, because there are many people who are not vaccinated is out there.'",
        "'speaker_3': 'So so in order to create that community protection, this is really important to continue to support. Zoom Meeting Access for folks.'",
        "'speaker_0': 'Thank you. Q Our next speaker.'",
        "'speaker_1': 'Zach Bowling.'",
        "'speaker_0': 'Good evening. Speaker Bowling.'",
        "'speaker_2': 'Either Council. Yeah, I supported AB 316 through the legislature. I called in at every one of the meetings to get this passed all the way from the Assembly through the Senate. And it's one of the bills I supported.'",
        "'speaker_2': 'I also supported AB 339 that unfortunately got neutered a little bit in that it only now affects the 15 largest cities, but it also emphasizes the importance for remote access to government meetings to make them more accessible. We had an open government item that I asked one of our commissioners to refer, and that ended up developing into'",
        "'speaker_2': 'a letter that was sent to council urging the importance of remote access to meetings from complete accessibility of government stance of why it's important that more people can now attend meetings that otherwise couldn't, and that that goes more with just working individuals, but also people that are immunocompromised.'",
        "'speaker_2': 'So this is an issue that I care about a lot. I think it opens up government to more people than people that can just come and attend. And I would be very supportive of a measure that would add the language for continuing meetings forward to our Sunshine Ordinance and making it a core part of our open government'",
        "'speaker_2': 'stance in Alameda to to make sure that our government meetings are accessible to more people remotely as we go forward. And I will end my comments there. Thank you much.'",
        "'speaker_0': 'Thank you. Our next.'",
        "'speaker_3': 'Speaker.'",
        "'speaker_1': 'Alexia Rocha.'",
        "'speaker_0': 'Good evening, Speaker Rocha.'",
        "'speaker_3': 'Hi, Nick. And I definitely second what our speakers have been saying and I support that accessibility, especially through these Zoom meetings. I hear that the first speaker doesn't think we're in a state of emergency. I know very many people who feel very much are still operating in the state of emergency.'",
        "'speaker_3': 'And I think we need to think about everyone. And earlier on this call, I was encouraged to hear folks talking about the equity and access for all in different areas. And I think this is a way to support that.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you. Speaker Roach our next speaker.'",
        "'speaker_1': 'Deborah mendoza.'",
        "'speaker_0': 'Good evening. Speaker Mendoza. There you are. Hello.'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Good evening. And I would also like to give public comment that I support the continuation of remote meetings not only now, but forever. And yeah, for anybody who has ever gone to a city council meeting in person attending by remotely is is just so much more manageable, convenient, let alone.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Regardless of the situation, more.'",
        "'speaker_3': 'People can be involved, engage, and let's just keep it going. Thanks.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Kenny, has raised our hand again, so we'll see if it's somebody else using the same line. Okay. I cannot speak again. All.'",
        "'speaker_0': 'All right. Who do we have?'",
        "'speaker_1': 'Looks like it might have been an error. So we'll go ahead and go on to the next one.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'Laura Katrina.'",
        "'speaker_0': 'Good evening. Speaker Katrina.'",
        "'speaker_3': 'Good evening, Mayor and City Council. I wanted to voice my support for continuing to host city council meetings online and zoom in the future. I echo what's been said around the accessibility piece, and it's it's critical that if we want to create more involvement and engagement with the city in our processes, that we make these accessible instead'",
        "'speaker_3': 'of in-person exclusive meetings. So thank you so much for. Making that happen.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Melody Montgomery.'",
        "'speaker_0': 'Good evening, Speaker Montgomery.'",
        "'speaker_4': 'Good evening. Hello to the council. Seems like we're the same.'",
        "'speaker_2': 'Group.'",
        "'speaker_4': 'Meeting all the time. I would like to also get behind the staging with the remote type of access for meetings even into the future. I know that personally I have like chronic bronchitis and so out there is still scary for me.'",
        "'speaker_4': 'Some people say that the pandemic the pandemic is over, but it's not over for me.'",
        "'speaker_2': 'I still don't feel comfortable in large groups of people. I would not feel comfortable coming to city council in that little tight, cramped room with hardly any air like we did for so.'",
        "'speaker_4': 'Many years.'",
        "'speaker_2': 'Before on instances. And still, I.'",
        "'speaker_3': 'Just would.'",
        "'speaker_2': 'Really support.'",
        "'speaker_4': 'And like you to support the.'",
        "'speaker_2': 'Continued access to all of our meetings through and.'",
        "'speaker_4': 'Through, through Zoom or whatever, whatever digital access you have. But I think that it's.'",
        "'speaker_2': 'Important not just for me, but for other people that maybe don't have transportation, can't.'",
        "'speaker_4': 'Get there, have other physical disabilities.'",
        "'speaker_2': 'That keep them from sitting in a room three or four or 5 hours waiting for an item to come up.'",
        "'speaker_4': 'And so thank you for listening.'",
        "'speaker_2': 'And I'm okay.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'And this is our final speaker. It's Carmen Reid.'",
        "'speaker_0': 'Good evening, Speaker Reid.'",
        "'speaker_3': 'Good evening again and thank you for allowing me to speak. I wholeheartedly agree that two meetings are a great way for the public to engage and to access meetings. And I think that this is definitely, you know, here for the long haul and they should continue.'",
        "'speaker_3': 'Now, I'm also wondering, and I'm not sure if he or if the urgency ordinance is required to continue with the Zoom meetings. So I'm hoping that the Council can please clarify that it doesn't seem like you have to have one to have the other.'",
        "'speaker_3': 'So. So. Thank you.'",
        "'speaker_0': 'Thank you. Okay. With that, we have no further speakers. Correct, madam? Sporadic. Okay. With that, I will close public comment on item seven. See?'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Council discussion are ready for a vote. Councilmember Herrera Spencer.'",
        "'speaker_4': 'Mayor. So I'd like to know how this or declaration or ordinance and codified ordinance differs from the declaration of the existence of local emergency that we do. You know, I think it's like every other month or something like that under government code section 8630.'",
        "'speaker_4': 'See if this has any impact on that.'",
        "'speaker_0': 'Madam Clerk, did you want to address that or. Mr. SIM City Attorney.'",
        "'speaker_1': 'I see that the city attorney I needed. But yeah, the first thing that the a the bills that was just passed pertains to a different section of the government code that is known to refer to as the Brown Act.'",
        "'speaker_1': 'And the other resolution passed every 60 days under the different government code section. So this has to every 30 days has to be and the findings have to be made by the City Council. And then the other one is separate.'",
        "'speaker_1': 'It has to return on a 60 day basis. So they are two completely separate things. And I guess the attorney could weigh in on the ordinance if he wants to.'",
        "'speaker_0': 'City Attorney Benson, may we hear from you?'",
        "'speaker_2': 'Sure. Thank you, Madam Mayor and council members. The council adopted an urgency ordinance at the beginning of the pandemic, suspending certain provisions of the Sunshine Ordinance. And this ordinance simply continues that with respect to AB 361, the reason that ordinance was previously adopted by the Council and the reason we brought forward this ordinance to you is that'",
        "'speaker_2': 'one could interpret the Sunshine Ordinance to require that a place of the meeting be City Hall and that attendees by remote meetings would have to provide that place of meeting for members of the public. That would have been the law prior to the pandemic.'",
        "'speaker_2': 'And in the interest of consistency with state law and in the excessive caution to reduce the potential for sunshine complaints, we brought that ordinance to you in the beginning of the pandemic, and we do recommend you adopt this ordinance tonight.'",
        "'speaker_0': 'Thank you. Counsel rehearse.'",
        "'speaker_4': 'Spencer Thank you. I want to follow up because I have voted no on this 8638630c subset of S.C. ordinance. And it's come to us and I want to make sure that by voting advice support this one that's in front of us today that that's not conflicting with the other votes that we've taken.'",
        "'speaker_4': 'On the other issue, it's very similar.'",
        "'speaker_0': 'Mr. Chan.'",
        "'speaker_2': 'Councilmember So this ordinance is similar, but it is also different in the findings that the council has to make is that, one, there is a state of emergency declared by the governor, not by a local agency. So I think that is different than the previous vote that you made, which declares a local emergency.'",
        "'speaker_2': 'The second finding that you would have to make essentially here is that public health officials continue to recommend social distancing and other pandemic related activities, and that in-person meetings would be a hindrance to the public health emergency that's been declared by the governor.'",
        "'speaker_2': 'So while they are similar, I do see that there are nuanced differences. And of course, how you vote is certainly the council members perspective.'",
        "'speaker_4': 'Thank you. I appreciate that explanation. So then my next question or concern goes to I think we've talked about having a hybrid moving forward at some point where we would have allowed people to come in. And I and there are some people I know that want to be able to come and have concerns doing this zoom and'",
        "'speaker_4': 'have issues and don't feel that it's as accessible during the remote as they like to do it in person. And I was wondering if and I thought we were trying to come up with a way to do a hybrid where people could come, but they could also still continue to do it.'",
        "'speaker_4': 'And via Zoom.'",
        "'speaker_1': 'Matt. American? Yeah.'",
        "'speaker_0': 'I was going to say the city clerk or the city manager, but. Madam Clerk, why don't you take that? Sure.'",
        "'speaker_1': 'So the provisions that are outlined in this Assembly bill pertain to the members so that all of the bodies, the city council and board and commission members. So this action tonight is specifically to allow you all to continue remote without having to disclose your location and allow members of the public in.'",
        "'speaker_1': 'If it's a remote location, it does not pertain to the members of the public. However, if we continue meeting this same fashion, the city hall will remain closed and the public will have to participate by calling in or participating on Zoom.'",
        "'speaker_4': 'Okay. So do we have any idea of when we think we're going to allow the members of the public to come and speak in person?'",
        "'speaker_0': 'A city manager. Mr. Levitt, do you want to speak to that or I mean, this way? I figure if you had a response, please, right ahead.'",
        "'speaker_2': 'Mr. Levitt. I think that's why a singer would be better, because she's been the one definitely coordinating it. We were looking and she can correct me, but we were looking at the we would have the hybrid once the council started me in person.'",
        "'speaker_2': 'But I want to give this white singer the chance to clarify if if I'm wrong in that.'",
        "'speaker_1': 'Correct. That was exactly what we were looking at was once the council resumes in-person meetings, then we would implement a different type of system.'",
        "'speaker_4': 'Okay. So we recently had a swearing in of police officers at the library, and that was inside. And there were many members, many of us here were there in person and members of the public as well. And so I know that the city is, in fact starting to do in-person events, socially distanced.'",
        "'speaker_4': 'And I would like its I mean I would like the city to come back with a plan of when we will be able to meet in person, socially distanced and honor the COVID protocols. But I, but I am concerned that there are people, I think, that do want to that I would like us to come up with'",
        "'speaker_4': 'a hybrid so that people that are unable, if this is possible, legally, so that members of commissioners, council members who have concerns, if you will, and then open open it up and go to more in-person meetings so to facilitate the public's input.'",
        "'speaker_4': 'And I would like to hear more from members of the public, but I have heard from some that they really have difficulty doing this zoom process and accessing. And as we spoke about the digital divide, not everyone has the ability to sign in and be on here as much as many of us do.'",
        "'speaker_4': 'And they have they have like I personally come to city hall to do this because I would be losing the Internet from my home. I simply don't have that ability where I live to to be online and not lose reception.'",
        "'speaker_4': 'So I know that is a real phenomenon that happens to people here in Alameda. Thank you.'",
        "'speaker_0': 'Thank you. I'm vice mayor of L.A..'",
        "'speaker_3': 'I want to speak to the fact that the state of emergency, the pandemic has not is is not over. I think that there is a marked difference between an outdoor event or a brief event, that versus an hours, hour, many hours long council meetings wherein you would be in close proximity or Border Commission meeting.'",
        "'speaker_3': 'Because this decision is not just about the council, it's about our boards and commissions. And I don't think that our volunteers should have to put their health and safety at risk or their families in order to serve. I think we ask a tremendous amount of those who serve on our boards and commissions.'",
        "'speaker_3': 'One need only look at the minutes of the meetings or view them to see how long some of these meetings can last. And I think, you know, basically forcing folks to have to disclose their home address or, you know, explain why they're not there in person when they're serving on a board or commission as a volunteer.'",
        "'speaker_3': 'I think that that's irresponsible of us. And I think, frankly, when we talk about equity and inclusion and everything else, it goes completely against that. We've heard from members of our boards and commissions, people who are already serving about how not doing this would impact their ability to continue to volunteer.'",
        "'speaker_3': 'I think we need to take that into account. You know, I know that we would all like the pandemic to be over tomorrow. I certainly would. I would like to be able to see family members and friends. I you know, I I'm speaking as somebody who has two children who even when the FDA approves the vaccine for'",
        "'speaker_3': 'elementary school children, they're still not going to be able to get vaccinated because they're younger than than five years old. I think we all have, you know, multigenerational families, family members and other members of our household who might not have the same robust health that we do.'",
        "'speaker_3': 'We need to take all of these things into account. And I would hope that we govern in a compassionate way. And I see this as allowing us to do that and allowing us to be very inclusionary with the members, with our constituents who are volunteering to serve on our boards and commissions.'",
        "'speaker_3': 'And so that's why I'll be supporting this tonight. I think that this you know, this will need to get reauthorized. There will be other opportunities. Of course, we will be reassessing. I just think that this allows us to address the fact that we are coming up into the same period of time that we saw a huge spike'",
        "'speaker_3': 'last year. The biggest spike in terms of COVID related cases came around Halloween. That was the start of kind of a long period where folks were getting infected. We've seen a number of breakthrough cases. I know we all know this.'",
        "'speaker_3': 'I just don't want people being afraid to step up and serve because we're forcing them to disclose personal information like their home address or things like that in order to serve remotely. So I just, I, I very much support this.'",
        "'speaker_3': 'I know that we'll continue to look at this issue and reevaluate as conditions change.'",
        "'speaker_0': 'Did I hear a motion in the making?'",
        "'speaker_3': 'That's in motion.'",
        "'speaker_0': 'All right. I thought I might have. Elsewhere. We're not quite.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'I was reading your hand. I thought that might be what it was. All right, we have a motion. We have a second. Do we have any further discussion? SINGH Councilmember Harris Spencer, thank you.'",
        "'speaker_4': 'So when this comes back and I'll I'll support it now, but I, I do want to figure out if we're going to be doing this. You know, we are not going to go back to in-person meetings at all for anyone that does want prefers up or if we're going to do this indefinitely, because at some point we'",
        "'speaker_4': 'have been talking about a hybrid. And I think that that might be at least I'd like to consider a hybrid model. And definitely not saying that anyone from any commission has to show up in person, but trying to figure out legally how we could do a hybrid model at some point.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. We've had a motion. We've had a second. May we have a roll call vote, please.'",
        "'speaker_1': 'And so I'm pretty shocked.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Sir. Spencer, I knocked. Hi, Ella.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Mayor Ashcroft.'",
        "'speaker_0': 'Yes. Carries by five. Thank you. All right, we move on to item seven D. Madam Kirk, would you introduce this item?'"
    ],
    "Resolution to Revise Fees for Fire Department Services and Permits.": [
        "'speaker_1': 'It is a public hearing to consider adoption of resolution amending Master P Resolution 121912 Revised fees for fire department services and permits.'",
        "'speaker_0': 'Thank you. And who is presenting this one? Mr. Levitt. I know, but help me out. Who is.'",
        "'speaker_3': 'Presenting? Okay.'",
        "'speaker_1': 'I'm sorry. We're promoting the interim fire chief right now.'",
        "'speaker_3': 'Sorry.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Remember the fight?'",
        "'speaker_0': 'Got it. Okay. Okay. Ready when you are. Hello. Interim chief is on Beck. You're still there.'",
        "'speaker_2': 'Good morning or good. Good evening, Madam Mayor. And Council rookies on Beck Interim Fire Chief. So I don't know that there's a presentation to be had here. I'm here to answer questions, but I can certainly fill in for anything that you or any questions that you have and you have a report in front of you.'",
        "'speaker_2': 'There's previous history with this. As you all know, it was in front of you in July and it got you know, it got extended to this evening.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Listen, my answer or what can I answer for you?'",
        "'speaker_0': 'Sure. Counsel, do we have any I should ask Madam Kirk, do we have public speakers on this item?'",
        "'speaker_1': 'Do you not?'",
        "'speaker_0': 'All right, then. I'm closing.'",
        "'speaker_1': 'Come on, just raise your hand.'",
        "'speaker_0': 'I'm not closing. Public comment. Let's hear a public comment and then come back to council questions and discussions, if we could. So let's go ahead and hear from our public speaker.'",
        "'speaker_1': 'We have two now, Beth Kenny.'",
        "'speaker_0': 'All right. Good evening, Speaker Kenny.'",
        "'speaker_3': 'How do you think? I am hoping to.'",
        "'speaker_4': 'Learn a little bit more about these fees.'",
        "'speaker_3': 'I am concerned about whether they will be.'",
        "'speaker_4': 'Applied to people who.'",
        "'speaker_3': 'Are getting services through the alternative response team that will be based out of the fire department and because that will be a real barrier to service.'",
        "'speaker_4': 'So I just want to make sure that.'",
        "'speaker_2': 'These fees are.'",
        "'speaker_4': 'Not being applied.'",
        "'speaker_0': 'Oh. Speaker Kenny, you cut out there. Madam Clerk, is she. Are they still with us?'",
        "'speaker_1': 'Yeah. I'm not sure. We could go to the next speaker and ring.'",
        "'speaker_0': 'Let's try that.'",
        "'speaker_1': 'Speaker, can you back? Okay.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'The next speaker is Jennifer Rakowski.'",
        "'speaker_0': 'Good evening, Speaker Rakowski. Hi.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Counsel.'",
        "'speaker_4': 'I would like to echo what best was starting to say as we transition more services over to the fire.'",
        "'speaker_2': 'Department.'",
        "'speaker_4': 'And we reimagine the mission.'",
        "'speaker_3': 'Of the fire department.'",
        "'speaker_4': 'I think we need to keep in mind these and the impact of the fees.'",
        "'speaker_3': 'On our most vulnerable members of our community.'",
        "'speaker_4': 'I urge you also to look with a racial equity lens and to some of the comments about city fees that the racial equity task forces highlighted. And even as these reports highlight, there's a lack of transparency about how much of the fees are recovered he needs to pay.'",
        "'speaker_4': 'I've heard reports from members of the community where they initially attempted reimbursement through their health care provider and if they rejected a out of service payment. So whether it's hardship provisions, increased transparency and looking at fees as it relates to the expanded mission of the fire department, I think there is.'",
        "'speaker_2': 'A.'",
        "'speaker_4': 'Whiff that the resolution.'",
        "'speaker_3': 'Is silent on.'",
        "'speaker_4': 'That the council should take up. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'We'll try Speaker Kenney again and see if she can speak.'",
        "'speaker_0': 'Yeah, I think we've been having Internet issues. There you are. Hi.'",
        "'speaker_3': 'Hi. Thank you. Sorry, I'm not sure where I got cut off, but basically I was just saying I want to.'",
        "'speaker_2': 'Make sure that these fees.'",
        "'speaker_3': 'Don't apply to the alternative response model that's going to be based out of the fire department. And I do think that we need to look at these fees and how, as Speaker Koski was saying.'",
        "'speaker_4': 'They are collected.'",
        "'speaker_3': 'What portion are actually getting passed.'",
        "'speaker_4': 'On to individuals and is there.'",
        "'speaker_2': 'Income based.'",
        "'speaker_3': 'Considerations?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Deborah mendoza.'",
        "'speaker_0': 'Good evening, Speaker Mendoza.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_4': 'I also want to.'",
        "'speaker_3': 'Share my concerns when I when I.'",
        "'speaker_4': 'Heard that.'",
        "'speaker_3': 'There potentially could be a fee to those who receive services. I'm just very opposed to that.'",
        "'speaker_0': 'When I worked.'",
        "'speaker_3': 'With victims of crime, a lot of times I've seen situations where victims are charged for an ambulance that was brought dispatched for their for their own care. And we don't need that at all.'",
        "'speaker_0': 'And especially when.'",
        "'speaker_3': 'We consider the people that are going to be.'",
        "'speaker_4': 'Receiving these services most likely are marginalized, our.'",
        "'speaker_3': 'Most vulnerable members of our community. Right now, this whole state of California has just eliminated fees for, you know, juveniles.'",
        "'speaker_0': 'Who are facing the criminal.'",
        "'speaker_3': 'Justice system. We do not need to have a share of this. Costs go.'",
        "'speaker_0': 'To the people who are.'",
        "'speaker_3': 'Receiving these services, especially with this with this national model, do not do not fit the bill to the people who will be receiving services. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Melody Montgomery.'",
        "'speaker_0': 'Good evening, Speaker Montgomery. Good evening again.'",
        "'speaker_4': 'I was going to say a lot of things, but Deborah and Jennifer pretty much said everything that I wanted to say. So I'm just going to let other people speak and ask you two to keep in mind what they said about.'",
        "'speaker_2': 'Our most vulnerable.'",
        "'speaker_4': 'Being.'",
        "'speaker_2': 'Charged in their most vulnerable moment. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Our final speaker is savannah chair.'",
        "'speaker_0': 'Good evening, speaker. Chair.'",
        "'speaker_3': 'Hi. I think it's also already been said, like I think Melanie brought up. I was just going to support the comments that that that then Jennifer made. And I just wonder if this is a little bit of a piece of the pilot program that may have gone overlooked.'",
        "'speaker_3': 'I mean, because it's a pilot and it's new, it may not have been considered. So just to put this out there that, you know, it won't make a lot of sense to ask someone in crisis to pay a fee for a program that was designed to help that person in crisis.'",
        "'speaker_3': 'So it's difficult, I think, just to I want to point out that the public may not understand and I didn't understand this until I looked into it a bit more, that the kind of paramedic aspect of fire service is different than like the firefighting.'",
        "'speaker_3': 'And so if you get like an ambulance transport or you have like a a first responder, like an EMT, you know, I don't know, help you with something like a medical situation that, you know, that is different than them coming in, like putting out a fire in your kitchen or something so that some of the fees may'",
        "'speaker_3': 'be attached to that. And that, I think was maybe confusing to the public and could be further confusing for people utilizing the services of the Mental Health Alternative Response Program. So yeah, I just echo what everyone said and hopefully we're not going to be charging people for that service.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_0': 'Thank you. Further speakers, Madam Clerk.'",
        "'speaker_1': 'There are none.'",
        "'speaker_0': 'Okay. With that, I'm going to close public comment on item 70 and we'll take it back to council. Councilor comments, questions councilor for her.'",
        "'speaker_4': 'SPENCER Thank you, Mayor. So I'd like to ask. All right. Acting Chief.'",
        "'speaker_0': 'Interim, maybe.'",
        "'speaker_4': 'I'm sorry. My apologies.'",
        "'speaker_0': 'I get it wrong all that time.'",
        "'speaker_4': 'The public comments in regards to the ambulance, how that works, and any other of the comments that you like to respond to.'",
        "'speaker_2': 'Well, first, I think it'd be appropriate to state that this doesn't relate to the Crisis Mobile Response Unit. We're not recommending fees for that service. This is a new pilot program. And this these these fees are not related to that.'",
        "'speaker_2': 'These are existing fees that we're asking for just a an adjustment to the fee structure. And these are for fire prevention services. So when our fire prevention officers go out and do inspections of new buildings and, you know, systems that are being installed to ensure that they're done properly, and they're also for our ambulance transport program.'",
        "'speaker_2': 'And these both already have fees attached to them. So these are essentially adjustments to the fees.'",
        "'speaker_0': 'Go ahead, Councilor Spencer.'",
        "'speaker_4': 'So on the attachment, I think it's like a seven page attachment. It has multiple columns is the adopted fee. The current fee and then the initial fee. Can you explain your different columns here? Where is the current emergency adjusted fee?'",
        "'speaker_2': 'Sure. So I'm sorry. I can. But I just want to make sure that we're in the same in the same place in the document. So you're. Are you referring to the. The the part where we're talking about the fee change over time through year one, two, three and four.'",
        "'speaker_2': 'Is that what you're talking about?'",
        "'speaker_4': 'I was actually looking at the resolution.'",
        "'speaker_2': 'Oh, okay.'",
        "'speaker_4': 'On there, it states that staff is recommended that the percentage of the cost recovery be increased from 48 to 57% and the fully burdened hourly rate be increased from 150 to 180. But then on the exhibit A, it has multiple columns, adopted fee, initial fee, minimum, and I don't think it has the current amount.'",
        "'speaker_4': 'But do you have something that shows that the current amount is then what the request is?'",
        "'speaker_2': 'Sure. I actually there's in the council report. There is. There are a couple of charts. So let me go back to probably the back up for just a minute and go give you a little background on this. So we, as you know, and I think you've seen it in the report, we've had a study conducted.'",
        "'speaker_2': 'We did that in 2000, late 2018. It was completed January of 2009, and it was forwarded and provided to council in March of 2019. And at that time, the study recommended that we enact a four year plan to raise the fees in our fire prevention office, fees for the various services that we provide from the current rate'",
        "'speaker_2': 'at that time in 2019 two over a four year period, so that we could go from the 28% recovery of our cost to potentially 57% over four years. So in 2018 19 budget year, the contractor estimated that we were collecting about 28% of the cost or recovering approximately 28% of the cost to provide this service.'",
        "'speaker_2': 'And the recommendation was to raise that over time, over four years to 57%, which still makes us one of the lowest cost recoveries in the county among the municipal or municipal fire departments. So the first step was in an act was enacted in 2019, in that budget year.'",
        "'speaker_2': 'And we went from the 28% that we were recovering of our costs to 48%. That was the recommendation it was in. It was enacted. And so currently we're at 48%. The second year or the second year of the proposed four year plan was due to be last year, July of 2020.'",
        "'speaker_2': 'And it was decided by the staff recommended that and and it was and the city manager agreed that we would not enact the the next step, which would have been to raise it from 48% cost recovery to 57% cost recovery.'",
        "'speaker_2': 'So now the next step would be 57% cost recovery from 48. So I know that's a little confusing, but our fees were the lowest in the county effectively. And so they recommended that over time we'd move them or into the middle.'",
        "'speaker_2': 'So we were at 28%. They moved up to 48%. The recommendation now is to move it to 57% of our cost. So that's the cost recovery. So it's still there is still some cost to the city for providing these services.'",
        "'speaker_2': 'But the recommendation is to. To charge the customer more in this case. These are typically the contractors that we provide services to to inspect other projects, including their new buildings, their fire protection systems, their plans that they put forth to be approved before they build.'",
        "'speaker_2': 'So related to fire the fire components of the built. So that's what we're recommending.'",
        "'speaker_4': 'And I appreciate that. And this is we swore in firefighters to do this to do these inspections.'",
        "'speaker_2': 'We do. We use both suppression personnel on on shift that some of those or those crew members go out and they do inspections during their their daily routine. But we also have specialists that work in our fire prevention office.'",
        "'speaker_2': 'And those folks do the more technical inspections, new buildings, the first suppression systems that are being designed into the buildings, including the the the the plans.'",
        "'speaker_4': 'Thank you. And my recollection, I'll ask I'm not sure who this question goes to, but my recollection was when this came just before there was discussion about using non sworn firefighters for some of these inspections and saving money for the city as well as the consumer.'",
        "'speaker_4': 'Can anyone answer the other cities use non sworn firefighters to do any of these inspections?'",
        "'speaker_2': 'Well, I can certainly answer that. So it was a recommended by council and the fire department actually looked into the prospect of doing that. We attempted to hire civilian inspectors over the last number of years, and I think we had an outreach.'",
        "'speaker_2': 'It was at least four different times, and we were unable to get qualified civilian inspectors. And I could you know, I could give you my opinion as to why that occurred. But the end result was we just were unable to coax civilian inspectors to come in, you know, to the fire department for these for these jobs.'",
        "'speaker_2': 'As far as other departments, other departments in the area do I know used some civilian inspectors when we were attempting to. Hire civilian inspectors. Several years ago, we when we were having difficulty, we talked to some of the other fire departments because, you know, they had used them and they said that they were having trouble also.'",
        "'speaker_2': 'And again, it was just a matter of the availability of folks that are trained to do this kind of work that are in civilian life. So we just we struck out, I think it was four different outreaches that we did.'",
        "'speaker_4': 'Thank you. And a lot of these charges go to businesses for the inspections. Do we have an idea of how our businesses are faring, if this would be a good time to charge them more for the inspections? Because and again, I'm not sure who should be answering this, but it's my recollection that because of COVID, the city'",
        "'speaker_4': 'has actually been out there trying to support our businesses and keeping them afloat. So I'm I'm not sure what feedback we've received, if any. If you've reached out to the business communities to see if they think they are in a position to pay these higher inspection costs or if they're not.'",
        "'speaker_4': 'As we've heard many speakers say, we're still in a pandemic and that they're really not there yet.'",
        "'speaker_0': 'Thank you. I'm going to refer that question, Councilmember Spencer, to the city manager, because he was certainly at the chambers presentation this last Friday about economic recovery in general and then specific to Alameda. And he and I would also add assistant city manager Jerry Bowden to the extent he wants to chime in there in pretty close touch'",
        "'speaker_0': 'with our business community, I guess we don't have anyone still from community development, but this is the city manager and assistant city manager. Mr. Levitt.'",
        "'speaker_2': 'For sure. Thank you, Mayor. As he I have to I want to say that, yes, that that's been a consideration. And so the fee that is being presented tonight was actually a fee that was increase. That was initially to go in in the summer of 2020.'",
        "'speaker_2': 'We actually at that time recommended deferring that fee for a year because of the pandemic. So we are bringing it back. But we would recognize if you decide not to increase, it is still below what the cost of the services we were to.'",
        "'speaker_2': 'Even though we'd be a year and delayed on the schedule, we were starting to try to to do the schedules. So even with this fee going in place, it would still be one year behind where where the initial schedule was on the initial study.'",
        "'speaker_2': 'But if you wanted to defer one more year, I'm open to that discussion to.'",
        "'speaker_4': 'So I appreciate that answer. But that wasn't I think really my question was I haven't heard from Robert today, for instance, or other business communities the Chamber had. Is your outreach to them specifically that they support this at this time, or would they?'",
        "'speaker_4': 'Are they letting city know or, you know, what is that about? Is the outreach been where where are they on this issue?'",
        "'speaker_2': 'We haven't done it. I don't believe the fire department's done specific outreach to those to the business community. This was on the agenda in the summer and it's been back. I think that they are they are facing stresses.'",
        "'speaker_2': 'I think you're correct. And we tried to look at that, but we also tried to lower the fact that we had deferred it for a year. And so so we brought it forward for consideration, but also with the option that you could defer one more year.'",
        "'speaker_4': 'Thank you. And then also in regards to the ambulance fees, we have had comments during prior when we were talking about, for instance, the policing issue and subcommittees of we had some people call in and speak to the victims.'",
        "'speaker_4': 'Someone from the public call over a victim issue and then an ambulance comes and then the victim actually receives the bill for the ambulance and they may or may not have insurance that covers that. So but how does the city handle that situation?'",
        "'speaker_2': 'Sit down.'",
        "'speaker_0': 'Mr. Levitt or our interim chief, Sabet.'",
        "'speaker_2': 'Because I would ask the interim chief to answer that because those bills go through the fire department. Sure, I can answer that. So first of all, I want to make sure I understand the question so we respond on an incident and someone is Bill that is a victim as opposed and perhaps they didn't call us, but so'",
        "'speaker_2': 'far, I understand that correctly. First of all, when the fire department responds, as, you know, the fire department provides a. A first responder service. That's our fire engine. We also have an ambulance that we provide a transport service.'",
        "'speaker_2': 'So that's an additional service. Most folks understand that they pay taxes to support police and fire services. The fire department provides us first responder services as part of those costs. Our ambulance is an additional service that is atypical.'",
        "'speaker_2': 'It's not traditional for the fire departments to provide, but the fire department, the city of our midst provided it for. I think it's 37 years now and I think it's an excellent service and we're very proud of it.'",
        "'speaker_2': 'So when we respond, if we can potentially transport someone and that's where we charge them an ambulance transport fee. Now, currently, the fire department transports more than 4000 people a year, and we certainly don't recover the cost of providing all of that service.'",
        "'speaker_2': 'But at the end, when we I guess maybe to get to the point, I would suggest that the when someone is billed, if there's an issue with the building, we're always very mindful of a person's ability to pay.'",
        "'speaker_2': 'We have, you know, obviously sometimes folks ask for hardships and we are currently working on a policy and it's actually going to be coming forward to you probably in about two months with the new fire chief. But we're internally working on that right now to update our hardship policy.'",
        "'speaker_2': 'But we always look at that and we take that into consideration. You know, a person's ability to pay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'And, Mr. Levitt, you wanted to say something, please.'",
        "'speaker_2': 'If I could just add that the ambulance fee is consistent with Alameda County. They set the fee cap, and we we keep our fees consistent with Alameda County. What Alameda County sets. If I'm correct. Right on that. Yes.'",
        "'speaker_0': 'But is this a matter of what percentage for going after collecting?'",
        "'speaker_2': 'Well, again, I as city manager said the county establishes the the fees that the providers can charge. So in the case of the US and the other fire departments, I can't speak for the private provider, but I do.'",
        "'speaker_2': 'I have close connections with the the other fire departments. And, you know, the fire departments are charged. We we charge with the county will allow us to charge and we we don't capture our costs by any means to provide the service.'",
        "'speaker_0': 'Okay. Councilmember Harry Spencer.'",
        "'speaker_4': 'So I am concerned as we had speakers today, and I know you are too in regards to figuring out this hardship, how we address the issue of the people that cannot afford to pay or cannot afford to pay as much as this bill is.'",
        "'speaker_4': 'So I look forward to having that policy come back. Thanks.'",
        "'speaker_2': 'Absolutely. And it is in the works. If I could just add one thing. You know, we do have a lot of our patients that we transport in Alameda are Medicare patients. So that's a large number of our are transport patients.'",
        "'speaker_2': 'And although there's a maximum amount that the county will allow us to charge those patients because their Medicare patients are under the Medicare rules. So they you know, they're not charged that same rate. It's just that's what Medicare requires.'",
        "'speaker_0': 'Okay. Councilmember Harry Spencer. And actually, in one minute, I'm going to need to make a motion because it's almost 11:00. But do you have something you really brief or should I?'",
        "'speaker_4': 'Well, just real quick. So the Medicare maybe you want to answer it later. The Medicare patients, do they still have to pay something out of pocket? I don't know what the policy is. Things.'",
        "'speaker_2': 'Typically, no.'",
        "'speaker_0': 'Okay, Counsel, we have 10 minutes before it's 11:00. 11 minutes before it's 11:00. And so we have to make a decision about how much farther after 11:00 we will continue this meeting. We will finish this item because we're on it.'",
        "'speaker_0': 'But whether we take anything else, whether we decide to end at a specific time, takes a motion and it must be passed this for council members. So and if not, we just end as soon as this item is over.'",
        "'speaker_0': 'Anybody want to make a motion? Well, even Howard wants to make a motion. I take it to mean that when this item is over, well, that counts over a day. So, fanclub, cars were designed. That did other news.'",
        "'speaker_2': 'Hi. Yes, I'll move that. We continue until 12 a.m. and that we just continue as we move along and wherever we land at 12 a.m. is wherever we land.'",
        "'speaker_0': 'Is there a second to that motion? I am not saying a second. So that motion dies for lack of a second. Is there any other emotion? I am not seeing any hands up. So I will say that we are going to finish seven D and call it a night.'",
        "'speaker_0': 'Okay. All right. So where were we? Counsel for her. Spencer.'",
        "'speaker_4': 'Well, I'd like to make a motion that we actually not adjust the fees at this time that we leave the masses.'",
        "'speaker_0': 'Is there something to that motion? Vice mayor of L.A..'",
        "'speaker_3': 'I'll go ahead and second that.'",
        "'speaker_0': 'All right, let's have a discussion. Councilwoman, an expert. I think I saw your hand going up.'",
        "'speaker_2': 'I was simply going to make a motion, sir. Okay.'",
        "'speaker_0': 'All right. Well, any discussion or should we just take a vote? I will I will go ahead and say that I will support this motion. I, I was at that luncheon last week and we heard from the economist of this recovery is not a matter of flipping a switch on and off.'",
        "'speaker_0': 'Our businesses are recovering slowly. People's incomes are recovering slowly. There's a lot of economic uncertainty. I don't think this is the right time to take this action. Okay. Vice mayor of L.A.. So your hand up and then you.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_3': 'Yeah. I think our fees I know our fees are low relative to the rest of the county, but I think timing is really important. I'm just concerned that we're putting a lot of money out there in terms of housing, keeping people housed and helping our small businesses, helping helping them stay open.'",
        "'speaker_3': 'So I just want to be thoughtful about the timing of this and understanding that, yes, our fees do need to increase. I would like to have staff certainly come back with this at the appropriate time. I think especially looking at when we see indicators that that, you know, the we're through the pandemic, for one, or that that'",
        "'speaker_3': 'we see economic recovery happening. And I understand that there are cost implications. I'm not saying that we waive the fees. I just think that we.'",
        "'speaker_2': 'Should.'",
        "'speaker_3': 'Should hold off on increasing for right now.'",
        "'speaker_0': 'I agree. I don't think we should burden our small businesses any more than they already are. I'm Counselor Kalahari Desert. I think I saw your hand up.'",
        "'speaker_2': 'Yeah. Great. When the matter came before council in March 5th, 2019, I didn't support the matter in a range of votes that were raised. So actually, to be consistent with the March 5th, 2019, I'll be voting no. Okay.'",
        "'speaker_0': 'All right, Mr. Leavitt, you got your hand up. Go ahead and unmute.'",
        "'speaker_2': 'So I definitely understand the emotion regarding the inspection fees. I understand and appreciate that on the ambulance fees. And because some of those are tied to federal funding where such as many Medicare, what they pay, I would ask that you at least defer that I am and let us go research that further and bring that the ambulance'",
        "'speaker_2': 'fee, maybe segregate the two and have us bring that one back. Because Alameda County as a whole is is for the most part raising those fees. And we would be below the rest of the county at that point.'",
        "'speaker_0': 'So I would certainly welcome you to bring that item back. Mr. Levitt, in the the staff report, it simply says that on July 14th, 2021, the Amity County Emergency Medical Services Agency notified the city that the county had authorized an increase subject to city council approval of the city's user fee for ambulance transport services.'",
        "'speaker_0': 'I didn't see anything about a loss of federal funds, so by all means, when this item comes back, I know the Council would appreciate having all the information we need to make an informed decision. Anything further counts. Alex White.'",
        "'speaker_2': 'Can I ask a quick clarification? I believe the loss of federal funds is through the lack of collecting the full fee because we can collect them. So it's not other funds, it's just since we wouldn't be increasing the fee, we wouldn't be making that differential on Medi-Cal or Medicare.'",
        "'speaker_2': 'Right. As far as Medicare markup. Correct. Okay. Thank you.'",
        "'speaker_0': 'Vice mayor of L.A..'",
        "'speaker_3': 'I'm just curious how long it'll take the city manager to review that. I'm fine bifurcating this. You know, if I'm the second or I guess the the the amendment would need to go through the maker of the motion.'",
        "'speaker_3': 'But perhaps we can we can bifurcate the vote so that on the on the ambulance fees we can give we can just give further direction to staff to come back with that information.'",
        "'speaker_0': 'Okay. So we're not approving anything tonight, but we're giving direction, okay.'",
        "'speaker_3': 'To come to come back with the information. I mean, if there's if we can get the full reimbursement, that's fine. I just I would want more information before making a decision about the increase.'",
        "'speaker_0': 'Over a course over her. Spencer, you're the maker of the motion.'",
        "'speaker_4': 'So. So I appreciate that. In fact. So this is coming to us to increase the rate. But if we're not going to do that at this time, I'm not sure that we actually need a motion to keep it as is.'",
        "'speaker_4': 'And then staff will come back at any time in regards to addressing this issue or I don't know, in regards to the Medicare, if we can have it increased for that purpose at this time so that we receive that as much as we can from that for the city.'",
        "'speaker_4': 'But then in regards to people that don't have Medicare and that they would then have to pay more themselves for those patients, what do you what is the proposal on that or was that all look like?'",
        "'speaker_0': 'Well, and I'll just chime in that I'm concerned. I appreciate the oral information we're being given. So it wasn't if it's in the staff report or somewhere and I missed it, please pointed out to me. But I, I think my feeling would be the better course is to bring it back.'",
        "'speaker_0': 'But Vice Mayor, you were you were proposing a kind of a compromise.'",
        "'speaker_3': 'Yeah, I think, you know, I. I think if we can bifurcate the vote, vote down because I don't want this the fees to come back necessarily on the inspections. Right. So I if we could separate that out. And then on the on the second part for the fees relative to the ambulance, just not take any action tonight'",
        "'speaker_3': '. But that way we would allow staff, for instance, if they have the information, they could get it available for the next meeting. We could perhaps continue that conversation if time is of the essence, maybe not to the next meeting, but to the meeting after it, rather than vote it down and then have to have somebody from the'",
        "'speaker_3': 'majority of the council.'",
        "'speaker_4': 'And happy to accept that.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Okay. So do you want to restate the motion just so we make sure the clerk has it and all of us are following along? Vice Mayor, if you could just restate the motion as you amended it, because I think the motion is amendable.'",
        "'speaker_3': 'So we would be that motion would be to not increase the fees for building inspections at this time, but that would be the first motion. The second motion, and perhaps the clerk or the city attorney.'",
        "'speaker_0': 'Is why interruption? I think it's inspections and plan reviews. Both.'",
        "'speaker_3': 'Yes, yes.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'And then and perhaps, you know, and this is where I think some clarity from either the city attorney or the city clerk would be welcome. But to either continue the remainder, the the fees on the ambulance to a future meeting or to just give direction to staff at this time for more information.'",
        "'speaker_3': 'And to have that come back to us.'",
        "'speaker_0': 'I think is either. Excuse me, I see. Mr. Levitt. Go ahead. Mr. Levitt.'",
        "'speaker_2': 'I think the first motion if you just do the first motion, then we can bring the motion back. I don't even believe we need to continue it. You could just not have a motion on the ambulances currently and then we can bring that action back.'",
        "'speaker_2': 'That's all it. And that's consistent with what I was requesting.'",
        "'speaker_3': 'Okay. I'm fine with that, if that's fine for the original maker of the motion.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Okay. So motion to to not increase the permit and fair review and inspection fees. Okay. Is it, Madam Clerk, that's okay with you?'",
        "'speaker_1': 'Yes, definitely. That's perfect.'",
        "'speaker_0': 'Okay. So we had a motion by Councilmember Harry Spencer. It's been seconded by Vice Mayor Vella. Any further discussion council seeing then maybe we have a roll call cover.'",
        "'speaker_1': 'Please remember Jason.'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'Harris. Spencer. I knocked. Right. Hi, Lola. So as the Ashcroft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Met Kerry supporter one.'",
        "'speaker_0': 'All right. Thank you very much. All right. Thank you, everybody. Thank you, Chief Sun back and firefighter Hern. I'm sorry. I don't know your your rank. Thank you very much. He's with. Is he?'",
        "'speaker_2': 'He is our fire marshal. So he's he's a division chief. But to.'",
        "'speaker_3': 'Visit you.'",
        "'speaker_2': 'Will someone provide clarification to the department for what you'd like us to bring back? That's all I ask, because so we can bring it back in the future.'",
        "'speaker_0': 'Because City Manager.'",
        "'speaker_2': 'Clare right now.'",
        "'speaker_0': 'City manager will be in touch. Thank you, everyone. Thank you, everyone on this item. Okay, so then let's see. We can, Madam Clerk, we can just. You help us out the.'",
        "'speaker_4': 'Anything there.'",
        "'speaker_1': 'I think you've reached your 11:00 stop time and you've completed the item, so I think you can simply go to adjournment.'",
        "'speaker_0': 'Okay. So what I am going to do, though, to adjourn. Sorry. And just reaching for there. I had it. I did want to adjourn this evening's meeting in memory of a well known long time Alameda resident Ashley Jones, who passed away on September 25th of this year, just last month at the age of 90.'"
    ]
}