{
    "Proclamation for John McCahan. ": [
        "'speaker_0': 'And. Whereas, John spent more than 20 years with the Red Cross Task Force and is currently the Red Cross liaison to the City of Alameda Disaster Council. We just did a meeting together recently. And. WHEREAS, John proudly served as an assistant fire chief in the Alameda County of Emergency Services Fire Department.'",
        "'speaker_0': 'And. Whereas, John chaired a family and business disaster preparedness campaign in Alameda called Together We Prepared, which reached 20,000 individuals and. Whereas John was co-chair of Alameda is holiday toy program for 20 years ensuring that every child in Alameda, regardless of their family's circumstances, received a toy.'",
        "'speaker_0': 'And. Whereas, John served as a commissioner on the Alameda Municipal Power Public Utilities Board for eight years. And. Whereas, John served on the Northern California Power Agency and CPA Legislative and Regulatory Committee. And. Whereas, John spent over six years as a co-chair of the Alameda Housing Authority Board of Directors, I just want to say this is not'",
        "'speaker_0': 'in the script, but it is so heartwarming to see someone who has given back so much. That's like another lifetime, really, that you spent as a as a community volunteer. And I'm just looking around the room and there's lots of representatives from organizations that you've.'",
        "'speaker_0': 'Yes, I see you that you've you've worked with. So now therefore be resolved that I Marilyn, as the Ashcraft mayor of the city of Alameda, do hereby recognize John McCann's many years of dedication and service and thank him for sharing his time and talents with the city of Alameda.'",
        "'speaker_0': 'Thank you, John. Perhaps you'd like to say a few words. Well, that, John, say a few words and I'll present his proclamation. Yeah.'",
        "'speaker_4': 'Just a just a couple of words. Yeah. Well, first of all, I brought Karen up with me because that's the.'",
        "'speaker_2': 'Support system that allows me to do.'",
        "'speaker_4': 'All of this.'",
        "'speaker_2': 'And it came from Red Cross about my last night there. Who as well? I'll meet you upstairs.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'Well, that's important because that the ability for that to happen.'",
        "'speaker_4': 'The thing that cut through all of my volunteer work, both with the Red.'",
        "'speaker_2': 'Cross and different.'",
        "'speaker_4': 'Elements of the city, is.'",
        "'speaker_2': 'The amazing amount of talent that I've come across. And professionals within the city, within the Red Cross. The Jim Francis of the world.'",
        "'speaker_4': 'I mean, the level of professionalism, the level of Laura. Laura. Laura and I go back as far as we can go. I mean.'",
        "'speaker_2': 'But if you take a look at the how.'",
        "'speaker_4': 'Smart these folks are.'",
        "'speaker_2': 'And how dedicated.'",
        "'speaker_4': 'They are, you know, on delivering. On promise. Yeah. Delivering a better life for the citizens of the city of Alameda. Making Alameda safer for one at all. Yeah. That's why I have a passion for doing what I do.'",
        "'speaker_4': 'So I.'",
        "'speaker_2': 'Thank you for providing me the opportunity and the city and the platform.'",
        "'speaker_4': 'To do what I've been doing.'",
        "'speaker_0': 'Thank you. You did it well. Thank you.'",
        "'speaker_7': 'Thank you so much.'",
        "'speaker_0': 'Thank you for everything.'",
        "'speaker_7': 'You're working group. Thank you.'",
        "'speaker_0': 'Took our different microphones. Our our next proclamation is O and we have a recipient. Do I have Michael Chinaski, naturalist for the East Bay Regional Park District based at Crab Cove. Oh, hi, stranger. Nice to see you, naturalist.'",
        "'speaker_0': 'So this is. And you're going to receive this proclamation, and I'll see you on Saturday. So whereas a coastal cleanup day recognizes that we need to protect Alameda is ecological health and beauty. And. Whereas, Alameda INS take great pride in our city's natural beauty and support a clean, safe environment now and in the future.'"
    ],
    "Public Power Week 2019 Proclamation.": [
        "'speaker_0': 'Whereas for more than 132 years, Alameda Municipal Power or AMP has been a valuable community asset that contributes substantially to the well-being of Alameda residents through environmental stewardship, customer programs and services, economic development and safety awareness. And. Whereas, the residents of the City of Alameda highly value local control of community services and have chosen to operate a'",
        "'speaker_0': 'community owned, locally controlled, not for profit electric utility. As consumers and owners of the electric utility residents have a direct say in utility operations and policies. And. Whereas, AB provides homes, businesses and local governments, government agencies with reliable, efficient, cost effective and clean energy and its local operation and workforce continue to make our community a better place'",
        "'speaker_0': 'in which to live and work. And. Whereas, AMP is a dependable and trustworthy institution whose lower rates translate into significant savings for all Americans while directly contributing to the city of Alameda. Economic Vitality and quality of life with annual transfers of more than $5 million.'",
        "'speaker_0': 'Now, therefore, be it resolved, that AMP will continue to work to bring lower cost, safe, reliable and clean energy to our homes and businesses as it has since 1887. And be it further resolved that our community joins hands with more than 2000 other public power systems in the United States, in this celebration of public power and recognition'",
        "'speaker_0': 'that Alameda municipal power is good for consumers, businesses, the city of Alameda and our nation. Be it further resolved that I marylynn as he Ashcraft, mayor of the city of Alameda, do hereby proclaim the week of October 6th through 12th 2019 as public power week 2019 in the City of Alameda and honor Alameda Municipal Power for its'",
        "'speaker_0': 'contributions to our city. And as I'm reading that, you're right, we're a little ahead of time. It's next month. But as I believe our investor is and McCormick couldn't be here in October, so we juggle things around. So why don't you tell us a little about AB and yourself.'",
        "'speaker_0': 'By the way, she's a member of the Public Utilities Board. She's an engineer. She's really smart. Take it away.'",
        "'speaker_3': 'And I think that says it all. Marilyn, thank you. And know Mary Ashcraft, council members and staff, thank you very much for the proclamation tonight. And I'm Anne McCormick, president of the Public Utilities Board. I've had the pleasure of serving on the PBE for many years, and we look forward to Public Power Week.'",
        "'speaker_3': 'It's an opportunity that we have to continue to educate the public on the value of a municipal owned utility. We always have work to do explaining how that's benefited us historically. Being the oldest municipal utility west of the Mississippi, 132 years old, and having invested very early in renewable and carbon free resources that are serving as well'",
        "'speaker_3': 'now our current value rates are 20 to 25% below PGE and our power will be 100% carbon free by the beginning of 2020. We have best in class efficiency rebate programs and electric car programs, but probably more importantly, our future value, the value of maintaining our commitment to local control, the work.'",
        "'speaker_8': 'That we have.'",
        "'speaker_3': 'To do in conjunction with the city on our Climate Action Plan, we've we've made tremendous strides on our carbon free portfolio. It's allowed us to hit all of our goals for the city. But the heavy work is yet to be done decarbonizing our buildings and our transportation sector, and that's going to take resources and.'",
        "'speaker_8': 'Contributions beyond AMP.'",
        "'speaker_3': 'In coordination with the city, and we look forward to that challenge. It's a value we bring to Alameda and one of the very special things about living here. So thank you.'",
        "'speaker_0': 'Thank you so much. I think. Okay. So now we come to oral communications and this is a time where speakers can address the council on any item that is not on the agenda. Do we have any speakers?'",
        "'speaker_1': 'We have four speak.'",
        "'speaker_0': 'We have four speakers. Okay. So then you get 3 minutes and the city clerk will call your name and just come on up to the podium. Be sure to begin to the microphone. Okay.'"
    ],
    "Letter of Support for the Restore Our Parks and Public Lands Act.": [
        "'speaker_0': 'And I was just going to say that. So I'm part of the U.S. Conference of Mayors. And we are you know, we get notified of important legislation all the time. But it is true that our legislative agenda covers our parks in our city and in our state.'",
        "'speaker_0': 'But I just feel I don't know if the rest of you feel this way, that California is really under attack from the current administration, including our national parks and wildlife refuges and whatnot. So I thought it was particularly important that we sign on for this one.'",
        "'speaker_0': 'But I did just want to make sure that as as the city manager said, if it was a little bit in the gray zone and I thought you would all support it, but I wanted to give you the chance to expand our.'",
        "'speaker_3': 'Portfolio.'",
        "'speaker_0': 'If you.'",
        "'speaker_2': 'Will. And I appreciate it. And I think it's something really important to stand up for. But as I would like to move approval with direction that when the legend agenda is brought back next year, that we give the mayor a little bit more leeway to exercise judgment on something that's in, you know, in the penumbra of the'",
        "'speaker_2': 'legislative agenda, so to speak.'",
        "'speaker_0': 'I appreciate that we have a motion to have a second second and any discussion and the roll call vote.'",
        "'speaker_1': 'Councilman Jason Knox light i. I. I. Mayor is the guy that carries on.'",
        "'speaker_0': 'All right. Thank you. And then we have item five h. I little challenge with the alphabet there. Um, so this is, if you want to read it, the.'",
        "'speaker_1': 'Final passage of ordinance amending the ordinance code by adding Section one, Dash 8.1 concerning hearing procedures, hearing officer's decisions, and administrative regulations, repealing in their entirety Article 14, currently suspended in Article 15 of Chapter six concerning rent review of rent increases applicable to all rental units and rent stabilization applicable to certain rental units, and limitations on eviction'",
        "'speaker_1': 'and the payment of relocation assistance applicable to all rental units. And repealing Ordinance 2030 246 and codified and adding a restated Article 15 to Chapter six concerning rent control, limitations on evictions and providing relocation payments to displaced tenants, including Section eight.'",
        "'speaker_0': 'Thank you. So this is the second reading of this ordinance that was passed by majority vote last time. Any comments before we take our vote? Yes. Councilmember Desai, thank you.'"
    ],
    "Ordinance Amending the Alameda Municipal Code Regarding Rent Control, Evictions and Relocation Payments.": [
        "'speaker_6': 'I pulled this item in order to remain consistent with my previous opposition to this, largely because I feel that the changes that were adopted in conjunction with a series of other changes are incredibly burdensome to especially the smaller mom and pop landlords.'",
        "'speaker_6': 'When alternatives exist, I believe, to not only assist renters in crisis, especially when it comes to excessive rent increases, but also alternatives that also support the smaller mom and pop landlords. I will continue to oppose this. Thank you.'",
        "'speaker_0': 'Thank you. To have a motion to for final passage of this ordinance and everything else that was read.'",
        "'speaker_2': 'So moved.'",
        "'speaker_0': 'Has been moved by Councilmember Otis, seconded by Councilmember Vela and Madam Clerk.'",
        "'speaker_1': 'Councilmember de san.'",
        "'speaker_6': 'Nope.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_9': 'Yet.'",
        "'speaker_1': 'Odie.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Bella.'",
        "'speaker_1': 'Yes, Mayor. As yet?'",
        "'speaker_0': 'Yes. The motion passes. Four, two, one. Thank you. Okay, that is the end of the consent calendar. We move on to regular agenda item six a.'",
        "'speaker_1': 'Public hearing to consider an appeal filed by Brian Temper of the May 28th and July 22nd. Planning Board decisions for a 172 room, hotel and restaurant at 2900 Harbor Bay Parkway and adoption related resolution.'",
        "'speaker_0': 'Thank you. And we have plenty director Andrew Thomas, who's going to address us. Good evening.'",
        "'speaker_10': 'Good evening. Mayor Ashcroft, Vice Mayor Knox White, members of the council, Andrew Thomas, planning director. I'll introduce this item for you tonight. This is an appeal of a planning board decision to approve the final. Colors and materials and landscape details for a hotel at Harbor Bay.'",
        "'speaker_10': 'The appellants. Let me just introduce this by saying the our zoning code establishes the planning board as the body responsible for making final decisions on design review and these sorts of issues. The zoning code allows for an appeal process.'",
        "'speaker_10': 'The purpose of the appeal is to determine whether the planning board essentially made a mistake, whether they made a decision that was inconsistent with the purposes of the zoning code. As you know from the staff, court staff is recommending that you uphold their decision tonight.'",
        "'speaker_10': 'This has been a process that has been a long one and the planning board has been very careful in this process. The the community planning process began in late 2018 with a series of neighborhood meetings where the property owner and hotel proponent met with different groups at Harbor Bay.'",
        "'speaker_10': 'I should just for anyone who's tuning in at the last minute, this is a new hotel proposed immediately adjacent to the Harbor Bay Ferry terminal on Harbor Bay Parkway. It's in the Harbor Bay Business Park. This land is zoned for commercial uses and hotels are permitted by.'"
    ],
    "Appeal of Planning Board Decisions for Hotel and Restaurant at 2900 Harbor Bay Parkway.": [
        "'speaker_10': 'Right. So really, the city's discretion here is simply the design of the building. The planning board had a study session in October of 2018 to just to review the overall design of the building, the size, its compliance with the zoning code to make sure it met all of our zoning requirements.'",
        "'speaker_10': 'And then two months later, they had another public hearing and approved the project in December of 2018. That decision was then appealed by the neighbors of the project. The City Council held a hearing on February 5th, considered the appeal, considered the Planning Board's decision, and upheld the Planning Board's decision.'",
        "'speaker_10': 'That decision that the Planning Board made to approve the project had two remaining items that the Planning Board had asked the applicant to do, which one was to come back with final architectural design elements for the building. So the scale, size, height was all approved, but they wanted to get more details and an articulation on the building'",
        "'speaker_10': '. So they asked the applicant to come back with that. They also wanted more detail and some fine tuning to the landscape plan. The City Council, at your hearing after upholding the planning board, said, Yeah, we absolutely agree. Planning Board, you should keep working on those two items.'",
        "'speaker_10': 'And we would also like you to take one last look at the setback of the building from the water and consider pushing it back ten or 15 feet. You didn't tell them to do it. You asked them to just consider whether that was a good idea or not.'",
        "'speaker_10': 'Two days later, the Bay Conservation and Development Commission, a board of Directors Board of Commissioners, held a public hearing to discuss this very same project and determined that it was completely consistent with their guidelines, standards and rules, and that it met their set back requirements and provided an appropriate set back to the water from Bccdc perspective.'",
        "'speaker_10': 'We then followed that up with two neighborhood meetings. Then on May 28th, the planning board held another public hearing, and at that meeting they considered the staff recommendation, which at that point was to not move the building back any further.'",
        "'speaker_10': 'We did not feel that we should push the building closer, push it back away from the water, because we felt the distance from the water was appropriate. And equally important, we felt that to push it back towards the neighbors would simply make the building appear even taller.'",
        "'speaker_10': 'So and there was at the neighborhood meetings on February 16th and May 11th that we had had prior to May 28th, there was no no support and no requests from the neighbors to pull the building back towards them.'",
        "'speaker_10': 'So we made that recommendation at May 28th. The planning board did not get any public speakers asking that the building get pushed back towards the neighborhood and they approved. The building setback. That decision was then appealed. And that's the one of the decisions you're considering tonight.'",
        "'speaker_10': 'But they did not approve the final designs and the final landscape at that at that meeting. We then had two more community meetings. And then on July 22nd, the planning board reaffirmed and re-approved the project setback and the final architectural details and lighting.'",
        "'speaker_10': 'So this is a project that the planning board has worked very hard on. And as I said earlier, we feel they they made the right decision. The appellant makes three arguments. One is there weren't enough community meetings. The planning board is required to have notice public hearings.'",
        "'speaker_10': 'They held those public hearings there. They completely fulfilled the requirements of the zoning code in terms of public meetings. All of the extra neighborhood meetings I just talked about were extra meetings. So there is no requirement for any more meetings.'",
        "'speaker_10': 'The other two issues related to the appeal are about the setback of the building. What this slide shows you is a couple of things. The the orange area shown is the footprint of the building in December. And if you look very closely, you'll see there's a there's another footprint sort of superimposed on the orange.'",
        "'speaker_10': 'You can see that is the final footprint. It was approved by the planning board. So you can see if you look very closely, the building got ever so slightly longer. It got a little narrower in places on the width, but the basic set back never changed.'",
        "'speaker_10': 'The reason the the configuration changed slightly is we were working with the applicant and the planning board was working on the applicant and the neighbors were working with the opinion to get more articulation into the design. So the design sort of you got some more ins and outs, more reveals the overall design of the building improved over'",
        "'speaker_10': 'this period. The actual square footage remained basically the same. The actual location of the building remained the same. We didn't move it back, as I said earlier. The another thing that has not changed is this relationship of the set back to to the waterfront.'",
        "'speaker_10': 'So we didn't move the building back. The thing that I'll just point out here is the requirement is that the project be set 35 feet back from the water, from the park edge. And there's actually a little red line on that drawing.'",
        "'speaker_10': 'You probably can't see it, but that's 35 feet back. The restaurant, which is shown on the left, is right on that red line, 35 feet. The pool and the pool deck, which you see just to the left of the hotel there, that is the pool that sits in front of the hotel between the hotel and the restaurant'",
        "'speaker_10': 'that sits right on the line. And you can see the little red line. The hotel is just pushed back, but it varies from 4 to 5 feet back from that red line, just as a little bit of a patio area.'",
        "'speaker_10': 'You can see in the inset that patio, these are people there's a drawing showing people sitting in chairs in front of the hotel. You can see behind them that building, that's the restaurant. It's just a little bit further and the pool is right behind them.'",
        "'speaker_10': 'So that line there, sitting on the 35 foot line, the hotel is just a few feet back. So throughout this project, the staff report and the staff described has been describing the project set back from the 35 foot line.'",
        "'speaker_10': 'That relationship of restaurant and pool and hotel has not changed from this entire period from December through July 22nd. As I said at the beginning, we're recommending that you uphold the planning board's decision. We don't believe that the planning board made any mistakes.'",
        "'speaker_10': 'This has been a site that has been difficult. Every single project that we have tried to move forward on this site has been appealed. This is the second appeal for the UN on this particular project. I think the we believe the planning board worked very hard.'",
        "'speaker_10': 'We think they interpreted and implemented your zoning code and development regulations appropriately on this site. I know they tried to make everybody happy at the end of the day. We still have some residents who are unhappy with the final design.'",
        "'speaker_10': 'I'm sure you'll hear from them tonight. But from staff's perspective, the planning board did their job and they did it well. So with that, I'm available to answer any questions. I know the project applicant would also like a couple of minutes.'",
        "'speaker_0': 'Okay. Well, I am going to see first if any councilmembers have any clarifying questions of Mr. Thomas on the staff report.'",
        "'speaker_2': 'Councilmember Ody Yes, I do. Thank you for that presentation. I just have a procedural question. So there were two decisions, but there's one appeal and then it was amended via email even. I mean, there's that this is I mean, that doesn't seem like that's a proper procedure.'",
        "'speaker_10': 'Well, here we are. These hearings are de novo. So you are able, as the council, to consider and make any changes you want related to the project. You're not limited to just the issues raised by the appellant. So what happened was we they had their they submitted their appeal after the first decision then, but the planning board'",
        "'speaker_10': 'wasn't even done yet. So then we basically had a conversation with them like, well, do you want to wait till the planning board finishes and then have one appeal hearing, or do we have to have two more, you know?'",
        "'speaker_10': 'So we decided to sort of consolidate. But under the regulations and the zoning code, they can continue to raise questions and issues. And even tonight, issues can come up in this hearing that you can address or decide. So we didn't hold it at a sort of a strict line like, oh, I can't say anything more.'",
        "'speaker_10': 'You have to stop here.'",
        "'speaker_2': 'Well, that wasn't my question. The question was the appeal was made on the first.'",
        "'speaker_10': 'The first.'",
        "'speaker_2': 'Decision. And it seems to me there should have been an appeal made on the second decision as well in order for us to consider it, because there's really no appeal of that decision. I mean, there's no official petition.'",
        "'speaker_2': 'There's no fee filed.'",
        "'speaker_10': 'They that's that's true. I mean, we could take that approach. I'm just not sure that it would make a difference if we could said, okay, well, this is appeal on May 28th, and if you overturn that decision, then the project does have to go back to the planning board because that was a decision where they set the'",
        "'speaker_10': 'building footprint.'",
        "'speaker_0': 'So I'm going to call a time out and ask to hear from our city attorney. Mr. SHINN.'",
        "'speaker_5': 'Councilmember Odie, it's my understanding that after the initial appeal, staff had a conversation with the appellant, and the appellant and staff reached an amicable resolution, which is to continue the appeal and collectively appeal at once. Given that courts generally review notices of appeals with a lot of latitude, my recommendation is that the council hears this appeal in'",
        "'speaker_5': 'its entirety.'",
        "'speaker_0': 'Thank you, Mr. Shinn. Do we have any further clarifying questions of Mr. Thomas before we go to our public speakers and the applicant, Councilmember Desai.'",
        "'speaker_6': 'And I kind of submitted this earlier. So has the applicant officially gone through the process of combining the three parcels?'",
        "'speaker_10': 'It's a condition of approval on the project. So no, they haven't merged the property yet, but they need to do it before they can do a pull up building permit.'",
        "'speaker_6': 'The building permits. Okay. Thank you.'",
        "'speaker_0': 'Okay. Any further clarifying questions? Mr. Knox White Vice Mayor Lanier. Okay. So with that, I'm sure we have the applicant addresses first council or last after the public speakers.'",
        "'speaker_2': 'Because they usually have a we have a process laid out in our rules, don't we, on this? No, I think you do.'",
        "'speaker_5': 'The particular council member, I don't believe you have a written process laid out, but my recommendation is to give the appellant the last word.'",
        "'speaker_0': 'The last word. Okay, we will do that. So then the city clerk, how many speakers clubs do we have?'",
        "'speaker_1': 'We have six, including the appellant.'",
        "'speaker_0': 'Okay. So with six.'",
        "'speaker_1': 'I mean, the applicant. The applicant. Yeah. So the applicant is one and I think there's. A couple of people. I think speaking from the parents side.'",
        "'speaker_0': 'I'm sorry, did you say applicant or a parent should have the last word?'",
        "'speaker_5': 'I generally recommend giving the appellant the last word because they are appealing and they should have the final say after they heard.'",
        "'speaker_0': 'All the comments. I think that's fine. Okay, so shall we bookended and have the day here that the applicant wanted to speak or am I just hearing in a mumble.'",
        "'speaker_1': 'Okay. Wants to speak and then the appellant. Yes.'",
        "'speaker_3': 'Okay. Or both.'",
        "'speaker_0': 'I'm running this meeting. Here's what we're going to do. I. And altogether miss. Why I. That's six. Okay. So you've all got 3 minutes. Don't feel like you have to take them, but you've got him and the clerk will call your names.'",
        "'speaker_0': 'Be ready to come on up. It'll just keep things moving faster. But let's start with Mr. Leach and then and end with Mr. the gentleman who's the appellant jury. So.'",
        "'speaker_1': 'Okay, so we have Robert Leach and Singh and Michael McDonough is the first three.'",
        "'speaker_3': 'All right, come on up.'",
        "'speaker_4': 'Hi. Robert Leach. I'm the applicant. And despite my eternal optimism with the city of Alameda, I have to say that we haven't convinced everybody in the city yet that this is a great project. But I can say that we've had a strong turnout at all the different hearings and invited people to go.'",
        "'speaker_4': 'Tonight, I asked my fifth grade teacher she could stay home, my third grade best friend. He could stay home. A lot of the folks, because this is an appeal and not a a vote of action. Long story short is we started the project with the idea of trying to build the nicest hotel ever built in Alameda.'",
        "'speaker_4': 'We've complied with every rule and regulation that was presented to us in terms of height and setback and air and everything else. Any rule, we asked for no variances to build this project. We basically wanted to stay within the code because I had witnessed over the last couple of years the turmoil that creates when you ask for'",
        "'speaker_4': 'variances with BCP, DC and the city. So we stayed away from any variances. We designed the project to be 100% compliant with city rules and regulations. We went. There was an appeal filed or issue taken up with BCP DC.'",
        "'speaker_4': 'We were called to back DC. They voted 90 no in favor of the project that we were 100% compliant. It's a very nice hotel. I like to say it's the nicest hotel ever built in Alameda. I also like to say that it's the first Union Hotel built in Alameda.'",
        "'speaker_4': 'It's the first union operated hotel with staff. And if you want to know the difference between a union operated hotel, our housekeepers make 2850 an hour. That's not just jumping over the $15 measurement that people are trying to get to these days.'",
        "'speaker_4': 'It's pole vaulting over the $15 measurement. So we're building a great hotel. It contributes about $1,000,000 a year to the city in terms of total tax. We've listened to everybody in the neighborhood. I've attended every meeting they had.'",
        "'speaker_4': 'In addition to the meetings that were scheduled by the planning staff. I attended people's homes. I went to their houses, their businesses, wherever they wanted to talk. I went and met with them. We took every good idea that we could from those meetings and incorporated into the project.'",
        "'speaker_4': 'I met a planning commissioner out at the site and walked the site and looked at plants and where they were and where they were insufficient and tried to do everything we could. So at this point, I think we've we've satisfied everything we can do in terms of regulatory requirements, rebuilding a very, very nice hotel.'",
        "'speaker_4': 'It has tremendous benefit to the city in terms of employment and revenue. And it's just frankly, it's just the nicest hotel that's ever been built or attempted in Alameda. We also decided to go with modular, which allows us to minimize any type of dust and dirt, and we can build it quicker and faster and easier.'",
        "'speaker_4': 'So with less impact on the neighbors. But on I appreciate your consideration on this for the many times I appear before you and thank you very much.'",
        "'speaker_0': 'Take care. Thank you. Our next speaker. And did we just get another speaker added to this item? Okay. So you're still 3 minutes, folks. Okay.'",
        "'speaker_1': 'Ed Singh, Michael McDonough and Pat Lambourne.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'Thank you very much. My name is Ed Singh speaking on behalf of the Freeport Away and as the appellant, we'd like to request 10 minutes to make our case.'",
        "'speaker_0': 'Is that a whatever? Is it? Is it? So our rules.'",
        "'speaker_4': 'Are rules and so give it.'",
        "'speaker_0': 'No, I.'",
        "'speaker_2': 'We did pass rules of procedure that when we have these type of appeals that we give 10 minutes to, I believe it's each side.'",
        "'speaker_0': 'Well that that is well and good if that's what the rule. And I know I was on that subcommittee with you. The only part that is throwing me for a loop is I thought that we had saved the appellant for last.'",
        "'speaker_0': 'But you're saying that you were the you're speaking on behalf of the.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Okay. So Mr.. I'm sorry, I'm.'",
        "'speaker_4': 'Saying.'",
        "'speaker_0': 'No, no, no. You're Ms.. You're Mr. Singh. But Mr..'",
        "'speaker_4': 'Trumper.'",
        "'speaker_0': 'Temper. Yes. He's not here.'",
        "'speaker_4': 'He is here he was. Make comments. The, the appeal was filed on behalf of by Brian. But they have.'",
        "'speaker_0': 'I mean.'",
        "'speaker_4': 'Actually, you're right ma'am.'",
        "'speaker_5': 'I would say the ten mineral that applies to one appellant not for each exactly.'",
        "'speaker_4': 'But we understand.'",
        "'speaker_0': 'You said okay.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_8': 'Okay. I don't want to go to the end.'",
        "'speaker_0': 'And and you don't want to wait until you've heard the other speakers because you're welcome to speak now or. Sure I can. Yeah. Because if you if you heard what the city attorney said earlier, Eugene, we generally give the appellant the last word, which is why we had the other listed.'",
        "'speaker_0': 'Appellant I'm sorry, I keep going blank on this, but. Right. Okay, great. Yeah. Thank you. All right. We'll see you in a bit and we'll reset your time. So, Michael McDonough, your next and then I'm after Mr. McDonough is Pat Lamborn.'",
        "'speaker_0': 'Pat Lambert. Okay. Hello.'",
        "'speaker_4': 'Good evening. Mayor Ashcraft, Vice Mayor Knox, Wyatt and the rest of the council and staff. I'm Michael McDonough, president of the board of the Chamber of Commerce here in Alameda. So I'm here just to reiterate what we've said in the past about our support for this project.'",
        "'speaker_4': 'This is an important project for a number of reasons, not to mention the jobs that they will be creating with a much higher than minimum wage. And also for the city coffers, which the the developer just mentioned would be close to $1,000,000 a year, which I think is a very important number for our budget, for the city's'",
        "'speaker_4': 'budget moving forward. But also from the business community standpoint, that area out there has one hotel and a lot of people fly into Alameda for business meetings in Alameda in that area and have to stay in Oakland. This is important for a lot of the visitors and family of the business people out there and they've been clamoring'",
        "'speaker_4': 'for this hotel. I think we're going to have another one pretty soon out there, it seems. But there's not enough hotel space in Alameda and certainly not in the Harbor Bay area. And so we as the the as representative of the Chamber of Commerce here in Alameda, we support this and believe it's a very important project for'",
        "'speaker_4': 'Alameda and would urge you to uphold the Planning Board's decision.'",
        "'speaker_0': 'Thank you, Mr. McDonald. Ms.. Lambourne, you're up. Andrew is going to speak for you. Come on up.'",
        "'speaker_3': 'Okay. Good evening. My name is Pat Lambourn. I've been at almost every single meeting we talked about, so I'm not going to steal the appellants thunder. I would say that if you look at the May 28 minutes, it definitely says that they approved the 35 foot setback.'",
        "'speaker_3': 'And I think part of what the community wants to know is do you stand by what we say in public meetings and the votes taken? So the issue I wanted to address and I'm really thrilled to hear you can address it tonight, is the parking at at this at this development.'",
        "'speaker_3': 'Thank you for sharing the photo. This is a this is actually a picture of the completely empty parking lot at VFR outdoors. They've moved and gone to Denver. There's hundreds of empty parking spaces now at 2701 and 2801 Harvard Parkway.'",
        "'speaker_3': 'So I'm asking that you reduce the parking spaces and you have the power to do that. You just heard that. So originally this was 172 room hotel restaurant that adds up. That added up to 275 parking spaces, five story hotel, 275 parking spaces.'",
        "'speaker_3': 'In all the community meetings, we said it's over. Parked in the exhibit for the December 10th Planning Board meeting, the consultant said to the study said it was over parked there were going to be at least 100 vacant parking spaces, which they said would be made available to three parkers.'",
        "'speaker_3': 'No one's ever proof that that's actually going to come to fruition. So I'm asking you to reduce it by 50 go from 275 parking spaces -50. You could do that. The plans and staff reports have all been decided throughout this process about parking.'",
        "'speaker_3': 'No one's presented to you. Do you know how? Any parking spaces is the final account here? I don't. And I read through all this stuff. I watched the video at one point in the May 28th minutes and I can enter them into public record, if you like.'",
        "'speaker_3': 'Planning board member Ellen Teague pointed out a dissonance between the staff report and the actual plans they were looking at indicate that night this didn't sail through our planning board folks. At May 28, three planning board members voted no.'",
        "'speaker_3': 'Why? Because the plans were so dissonant with what the developer said and the information before them. So you have the power tonight. We could be looking at hundreds of vacant parking spaces at VFR door. Maybe you're going to tell us you've got it that someone's moving in and filling them.'",
        "'speaker_3': 'I don't know that. I looked it up. I couldn't find it. So how many parking spaces should there be on this lot? If you reduce them, you can do something for the neighbors that appealed this. You can add landscaping between the parking lot, the hotel and their houses.'",
        "'speaker_3': 'You can do something for the rest of us that use the Bay Trail and that which is the Shoreline Park. You could replace the parking spaces with vegetation. Right. If you go with a 35 foot setback, it's not very much.'",
        "'speaker_3': 'Right. How can you mitigate that? You have the power. Thank you very much. That's what I'm.'",
        "'speaker_0': 'Asking. Thank you. Nice speaker is Donna Fletcher.'",
        "'speaker_1': 'Then it's Ed and Brian. Ed singing.'",
        "'speaker_0': 'All right, so right now, we're going to have Mr. Trimper go after Ms.. Fletcher. Yeah. Is this on this particular item? Okay. Yes. Just thinking ahead. Good. Good evening.'",
        "'speaker_3': 'Good evening. Mayor Ashcraft, members of the council and city staff. I'm here tonight to speak in support of Mr. Trampers appeal that the Council uphold the 35 foot hotel setback we believe was approved on May 28. The effort by the neighbors to improve the design of the Marriott Residence Hotel has been a long and winding road.'",
        "'speaker_3': 'To quote the Beatles, in retrospect, the community and the developer probably had different expectations of what they could accomplish. I know that for the community, we really wanted a hotel that fit into the established residential neighborhood and took its cues and design from that.'",
        "'speaker_3': 'And we figured that if it was a marriott residence in that it would look residential. And if it was an inn, maybe it would appear to be like a seaside resort in Alameda. But once the planning board approved the building footprint, the footprint, the number of rooms and the five stories, really all of the significant design decisions'",
        "'speaker_3': 'were made. And what we really had to work with was the facade, colors and materials and design details. We did the best we could with that, and we found the developer to be cooperative and patient and collaborative as well as the city staff.'",
        "'speaker_3': 'So we appreciated that opportunity. Perhaps this is a cautionary tale for other projects that get approved without having the final design approved because it really does limit the process coming to a harmonious conclusion. We now find ourselves at the end of the process and the neighbors are making just one last request, and that is to please to'",
        "'speaker_3': 'please uphold the 35 foot setback. Thank you.'",
        "'speaker_0': 'Thank you. And so now, Mr. Trimper. Followed by Mr. Singh. It.'",
        "'speaker_4': 'Hi, my name is Brian Trump or council members. Mayor And I'm going to be living, I guess my card, my yard's going to be behind this building. Well, wait, I don't know that. I don't know exactly where this building is going to be, because if you look at that, that was the original spot where the building was'",
        "'speaker_4': '. They had little markers to chair.'",
        "'speaker_0': 'Sorry to interrupt you, but everyone wants to hear you.'",
        "'speaker_4': 'Oh, I'm sorry. I don't know if I'm going to be behind the building there. As you look, as you see if you can see the plants on the right hand side there of my right, that's where my fences and that's where the building was supposed to end to the right of that fence.'",
        "'speaker_4': 'My house would be view if you could go to the next slide, please. But I can do it now. It's here. That's where the sticks are that indicate the end of the property. However, since then, since that time, they've said, Oh no, we needed to add a little more of the footprint because we now have changed the'",
        "'speaker_4': 'configuration and there's some new bars which go to the next one to there. So I was the first one to sign the appeal for this project I signed as the president of Freeport Homeowners Association. And it looks like to me that the solution to this problem was to extend this building in front of my backyard.'",
        "'speaker_4': 'Now, these things are obviously not exact. I don't I'm not that good at PowerPoint and things like that. But they're about that's a little I can't think of the word in English, but it's a little quick, you know, it's a little sideways of a picture.'",
        "'speaker_4': 'But if you go to the next slide, if you look at their own planning board, it still shows it as to the right of my house. Because if you look at where it says it's kind of like a painted in, it's the trees that are above it, sort of on the right hand side, you have four circles'",
        "'speaker_4': 'and then you have like a cloud. You see it says Harbor Bay Park, way up there. There's a cloud just above the three fort. So the far right, there's four trees and then there's a cloud that's the existing trees.'",
        "'speaker_4': 'And in the larger map that that we have, it shows where the actual trunks are. And I can count, I can look at those trunks and I can see and I can look at this map. And it this shows the building to the right of my house.'",
        "'speaker_4': 'So it doesn't show it just a little over from my house. It doesn't show it quite a bit over from my house. The problem is, I don't know if it's in front of my house. I don't think the city knows if it's in front of my house.'",
        "'speaker_4': 'I don't know if the the planning board knows where it is exactly on this map. I think that take me out of the equation. I think the city needs to know exactly where this building's footprint is. I don't think the city, the planning board staff or the developer know where the footprint of this building is.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Trump or Mr. Singh.'",
        "'speaker_1': 'So even being in council, the city attorney and I have kind of convinced him the rules of order would require to be suspended to give 10 minutes of time, because there wasn't an appeal process outlined in that. Perhaps the council was remembering when you did a prior appeal and talked about it because it wasn't adopted as part'",
        "'speaker_1': 'of the.'",
        "'speaker_0': 'Okay. I am. I think we should follow whatever the rules are that exist, but I am open to suggestion from my colleagues. And bear with us for just a minute, Mr. Singh, while we figure this out. Um. Uh, Vice Mayor, colleagues, what do you think?'",
        "'speaker_0': 'But let's not take up.'",
        "'speaker_6': 'I think my opinion is. Councilmember Desai My opinion is that 10 minutes ago, the expectation or more than 10 minutes ago, the expectation was that the individual was going to give a ten minute presentation. And I don't see why we should relax from that, that expectation.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Vella.'",
        "'speaker_8': 'But I'd be willing to suspend the rules. This one's for. But just for 10 minutes. Not for an excess of that.'",
        "'speaker_0': 'Councilmember O.D. Vice Mayor. Vice Mayor, are you okay with that?'",
        "'speaker_9': 'Yeah, I'm okay with that. I think everybody might be remembering what's in the Sunshine Ordinance about appeals, but I haven't had a chance to look.'",
        "'speaker_0': 'That could be that could be. Next time we do this, we'll have those rules in front of us. So we're not playing a guessing game. So with that, Mr. Singh, you have a maximum of 10 minutes.'",
        "'speaker_4': 'Okay. Thank you very much.'",
        "'speaker_0': 'Oh, sorry, sorry. We have to vote. Okay, so a motion to suspend the rules to allow 10 minutes for this. Appellant So moved moved by the council approval a second by Councilmember Odie. We're going to take a voice vote.'",
        "'speaker_1': 'Councilmember Mirza Yes, not quite. Yeah. Oti Yes, yes, yes. Step five race.'",
        "'speaker_0': 'Proceed, please.'",
        "'speaker_3': 'It's right there.'",
        "'speaker_4': 'Uh, this one right here.'",
        "'speaker_10': 'Uh, that's the pointer.'",
        "'speaker_4': 'Okay, you got it. Thank you very much. Appreciate your granting the time for this appeal. On next slide.'",
        "'speaker_1': 'You can advance that there with the error. Oh.'",
        "'speaker_4': 'Yeah. Okay. Here you go. Okay. Tonight, we're going to focus on the setback of the hotel. The purpose of this appeal is not to stop the hotel. It's not to delay the hotel. It's a matter of a process that we've been following all along and what's been purported to be the hotel setback, what was approved by the'",
        "'speaker_4': 'planning board, and then what suddenly appeared two months later after the approval is different from what was approved at the planning board. So, number one, uphold the hotel setback of 35 feet. And number two, I want to ensure that information used in the Planning for Planning Board design refused for this project and for future projects is complete'",
        "'speaker_4': ', accurate, consistent and transparent. Next slide, please.'",
        "'speaker_0': 'Is it easier for you to have staff advance? Could we. Could someone do that for him then, please? You can do that. Okay.'",
        "'speaker_4': 'Okay. So we'll focus we'll focus on the left side of this slide. As stated previously, the hotel setback was approved at a may 28 planning board meeting. The hotel setback is 35 feet from the base property line. As stated in that meeting and 75 feet from a high water line as set by Bccdc.'",
        "'speaker_4': 'So measuring against my metrics is a complete, accurate, consistent, transparent, that data that was used. Yes. And I will explain why in a few minutes. However, two months later, the hotel setback was, I don't want to say revised but maybe restated at the July 22nd planning board meeting as being 40 feet from the bay side property line'",
        "'speaker_4': ', whereas the pool setback is 35 feet. So I would argue, you know, is this revision info complete, accurate, consistent, transparent? I would say no to all these for the reasons that I will explain to you in a second.'",
        "'speaker_4': 'Next slide, please. Let's go. Oh. Okay. I'll do.'",
        "'speaker_0': 'It. Oh, no, no. We got it.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_4': 'Okay. Well, we'll go to in February a state of previously by Andrew. The hotel setback was one of several topics in February bccdc meeting. Next slide, please. Okay. And this was a slide that was used I don't know if it was by B, C, D, C or the applicant, but this is the proposed project site.'",
        "'speaker_4': 'This is the adjacent McGuire Hester building. This is Stacy went back and at that meeting they talked about the project setback at 75 feet from the high water line or 35 feet from the property line, which is right here at the edge of the Bay Trail right there.'",
        "'speaker_4': 'And this is consistent with the information used for the design of McGuire. Hester and Stacy went back and actually they the regulatory director said in this image, you can see how the buildings are in alignment and how the setback requirements of the third settlement agreement create a uniform consistency where each development within this area is handled in'",
        "'speaker_4': 'the same manner. So Bccdc agreed to the 35 foot setback. There are numerous discussions with the community by the developer and the city focusing on the hotel setback. There was no discussion of pool and a separate hotel set.'",
        "'speaker_4': 'Public comments were received on a 35 foot hotel setback, not a pool setback, but a hotel set by the 35 foot hotel. Setback was consistent with Bccdc. Coordination and the alignment with the adjacent buildings. There was absolutely no discussion of pool setback.'",
        "'speaker_4': 'Next slide, please. Sorry. Okay. The pre-meeting notes for the May 28th Planning Board where the setback was approved contains no mention of the pool versus hotel setback. It does say the planning board approved the excuse me, the planning board approved the hotel with a 35 foot setback in December of 2018, which provides a setback of approximately 75'",
        "'speaker_4': 'feet to the water's edge. Hotel setback, not pool. Moving the building further back would not significantly improve the quality of the Bay Trail experience. The Bccdc staff and the Board of Commissioners reviewed the hotel proposal and determined that the setback of 35 feet was appropriate.'",
        "'speaker_4': 'This is in the pre-meeting information provided by staff for May 28. Next slide, please. Okay. So you can see that this is a slide that was used by city staff at the May 28th meeting to show, demonstrate, hotel setback.'",
        "'speaker_4': 'This is the line. It goes from the waterline to the hotel, not to the pool. Next slide, please. And the minute there was a very brief mention by the city of a pool versus hotel setback, this was after the public comment period.'",
        "'speaker_4': 'So no public comments could be made on that difference that that was noted at that time. And number two, I don't think anybody heard it. I did not hear and I was sitting in the second row right here.'",
        "'speaker_4': 'So next slide, please. The motion to approve the set back was approved. As stated board member Teague Booth approval of the 35 foot setback. Board member Rothenberg seconded the motion. The motion passed 7 to 0. The meeting minutes say 35 foot hotel setback was approved.'",
        "'speaker_4': 'No mention of pool setback. But then two months after the setback approval, the city restated the hotel setback as 40 feet. I think they probably realized that they misspoke at the May 28th meeting. Next slide, please. So there is no written documentation of the pool versus hotel building setback provided to the planning board or the public until'",
        "'speaker_4': 'the July 22nd planning board meeting. I have to say that this is not quite right. There is a mention of it in fine print at the bottom of the project plans. Now I'm going to tell you that the project plans that are provided to the planning board are the full size plans are a scale one and two'",
        "'speaker_4': 'cost 30 feet. The half size plans, I believe they're half size that he's holding. Right there would be about one inch equals 60 feet. So reading looking at the difference between the pool setback in the building setback would be very different.'",
        "'speaker_4': 'A difficult reading. A table at the bottom of the plans would be extremely difficult. And as I say, it's impossible to discern. So the pool versus hotel setback has never been explained in full and public forum. It's documented in writing that it's 35 feet.'",
        "'speaker_4': 'And the pool setback versus the hotel setback has never been open for comment in public forum. Next slide, please. So we based on the fact that the 35 foot hotel setback was discussed and coordinated with the public public comments received and it was approved by the planning board.'",
        "'speaker_4': 'We ask that you uphold the 35 foot hotel setback. And I just want to say that I don't want to impugn anyone developer, city staff, the planning board. But this is just a number of issues. And I think Patricia raised some of them, too, of inconsistencies in information that a developer brings before the planning board.'",
        "'speaker_4': 'Sometimes you can handle it through planning board resolutions. I understand that these are complex projects that take, you know, months to work through. But if the quality of the data that goes to the city and goes to the planning board meets the criteria that I mentioned earlier in my presentation.'",
        "'speaker_4': 'It would. It would not necessitate having to go back to the planning board again and again and again. And I know that there are many projects coming up on the horizon at the planning board that will be just as complex.'",
        "'speaker_4': 'And I urge you to work with the planning board in ensuring that the quality of the data is improved. So again, we request that you uphold the 35 hotel. Might seem trivial, but it's not.'",
        "'speaker_0': 'Thank you, Mr. Singh. I'm going to ask the planning director, Andrew Thomas, to help the council understand some of what we just heard.'",
        "'speaker_10': 'I just want to clarify just two or three quick points and then I'm available to answer any questions. I'm looking at the plans from December 10th. These are the half size set that Mr. Singh mentioned. Then there was the plans that were approved on May 28th and then there were the plans that were approved on July 22nd'",
        "'speaker_10': '. Every single set of those plans had what we call a site plan with a table that says has a bunch of information and says setbacks. And every one of those plans has this description of the setbacks. And it says the exact same thing on all three sets of plans, setbacks front in parentheses against from Shoreline Park.'",
        "'speaker_10': 'And then it says the hotel, 35 feet excuse me, restaurant 35 feet, hotel 40 feet. That has not changed. It has not changed in a single set of plans. It's been consistent the entire way. The site plan has been consistent the entire throughout the entire process.'",
        "'speaker_10': 'So how it was described in staff reports, how it was described by somebody like me standing at a podium, I think there was a situation where we were thinking about the project. Does it respect the 35 foot setback requirement?'",
        "'speaker_10': 'Remember the 30 when they say uphold the 35 of the project, upholds the 35 because it doesn't encroach. No part of this project can encroach and be closer than 35. Things can be pushed further back, but they can't come closer.'",
        "'speaker_10': 'So the restaurant is right on the line. The pool is right on the line, and the hotel has always been five feet further back. So it is not a requirement that everything be right on the line. It's a requirement that everything be no closer than the 35 foot line.'",
        "'speaker_10': 'And I think essentially, if I understand what the appellants are asking, they're asking you to take the hotel and move it five feet closer to the park. This, from staff's perspective, is would not be a good move. The neighbors who are 200 to 300 feet away are not going to notice a five foot difference from 300 feet'",
        "'speaker_10': '. The people on the Bay Trail who are only 35 feet to 40 feet away, they will definitely notice it. For us at staff, it's a little bit strange because at the last appeal, the neighbors and the appellants were telling you to push it back towards the neighborhood.'",
        "'speaker_10': 'Now they're telling you, bring it closer to the Bay Trail. So we think the planning board did the right thing. We think the information they had was accurate and they made the right decision. One last thing. In terms of Mr. Trampers concern about that, we didn't know where it was.'",
        "'speaker_10': 'There have been steaks posted. We had steaks posted the actual footprint of the building. Myself and two other staff members went out there personally with the plans after the last couple of meetings and with hundred foot tape measures and measured it ourselves to make sure that we were confident that those steaks were in the right place.'",
        "'speaker_10': 'So we're pretty sure that the planning board and the staff are know where the building is on the site. I'm available to answering.'",
        "'speaker_0': 'Thank you. Any questions for Mr. Thomas, Vice Mayor? Not quite any questions. When you're not on mute.'",
        "'speaker_9': 'During the mute button. No.'",
        "'speaker_0': 'You. Okay. Um. Okay. So then we're going to go into council discussion of this item. Who wants to lead? Councilmember de Saag.'",
        "'speaker_6': 'Well, thank you very much. The matter that's before us can be deliberated by council member on what's called a de novo basis, which means that we are not limited to the information in our packets when making our decision.'",
        "'speaker_6': 'So I'm going to definitely take advantage of that. And my decision is still going to be the same that I held back in winter when council members deliberated over this matter. And the long and the short of it is I do believe that the city council and the planning board missed an opportunity to exercise the leverage that'",
        "'speaker_6': 'it had to get the developer to work more substantively with the nearby residents, not just the residents of the Freeport Homeowners Association, but Harvey, generally. And the leverage that I'm speaking of comes down to this is that at the December 2018 planning board meeting, one of the planning board members correctly indicated that that this project, in order'",
        "'speaker_6': 'to satisfy development standards, i.e. the amount of supportable square footage that it had contemplated both in December, in the December meeting and subsequently in the and the City Council meeting in February, in order to satisfy the amount of square footage contemplated at those meetings, it had to come back in, not it had to be built on not'",
        "'speaker_6': 'just the parcel on which it is proposed. The main parcel being 74, dash 1362, dash 49, dash eight. But it had to be combined with two other parcels because when combining the three parcels together, then, you know, you do the math.'",
        "'speaker_6': 'The bigger the, the amount of parcels and acreage and square footage, therefore the amount, the the increased amount of of allowable building. Square footage. So my argument then was simply this that at the December 2018 meeting and subsequently at the city council meeting at that time, the developer had not combined those parcels.'",
        "'speaker_6': 'So the City Council and the planning board ought to have and granted, 2020 is always you know, hindsight is always 2020. And this is what I argue back then at the time, the city council ought to have exercised their leverage and said, okay, I see you want to build this much square footage.'",
        "'speaker_6': 'And in order to, to, to to achieve that amount of square footage, you have to combine basically three different parcels. Now, council and planning board should have said, well, when you look at the three different parcels, one of those parcels definitely you could never build on because as I've posted on at some websites, including blogging, Bayport, one'",
        "'speaker_6': 'of those parcels that is just a sliver it has, it's mainly underwater and the green part is basically green area. It's, you know, just grass and and the other part is sidewalk. So that sliver of parcel should never have been included in the other two parcels.'",
        "'speaker_6': 'The other two parcels. Okay. The person could make a case that that those should be allowed. My point is simply this, is that those parcels were not combined. So it was at that point that the planning board and the council could have exercised its leverage and said, you know what, the residents are concerned about the massing, the'",
        "'speaker_6': 'building height. And so this is a way for us to to substantively discuss this with the project proponent. Now, the other reason why I also think that that the issue of the three parcels was critical was because the governing authority regarding this parcel development, this parcel is the Harbor Bay Business Park Development Agreement that was in place'",
        "'speaker_6': 'at that time. And when you look back at the ordinance that was in place at that time, so in March 1988, the city council had adopted an ordinance that said that, you know, if you're going to and this gets to my land boards issue, why my landlord's issue won't fly.'",
        "'speaker_6': 'If you're going to develop on a parcel, then the parking impacts have to be limited to that parcel except under certain conditions. And. This is what was adopted in March 1988. Well, when you look at the parking plan, a lot of the parking is not on the parcel.'",
        "'speaker_6': 'It is actually to the the parcel closest to the Maguire Hester. That's another parcel. And it doesn't satisfy another condition under under the March 1988 ordinance that says, well, you know, parking on other parcels than, than, than the parcel on which the development can occur under certain conditions.'",
        "'speaker_6': 'It didn't satisfy that condition. So I felt that at the time that the city council and the planning board could have exercised its its leverage by getting the developer, working with the developer to perhaps reduce the massing, reduce the building height.'",
        "'speaker_6': 'Because at the end of the day, I don't think you have to be just a Harper Bay residents or or a Freeport Homeowner's Association resident. I think at the end of the day, when you walk down the path near the hotel, it doesn't matter if the Bill Hotel is five feet this way or five feet that way'",
        "'speaker_6': '. It's still going to be this large project that amounts to a monstrosity. And we had the opportunity to, I believe, exercise the leverage that we had to kind of work with the developer to take to substantively take into consideration the residents concerns.'",
        "'speaker_6': 'And it had all to do with the fact that at the time that the project was submitted, that the parcels were not combined. And the fact of the matter is, is to this day, the three.'",
        "'speaker_3': 'Parcels are still.'",
        "'speaker_6': 'Not combined. So I say to the council members, exercise your leverage now. And because the the governing authority that was in place in March 1988 says that that if you're going to build that, that you have to have the parking on this on the on the parcel on which the impact is occurring.'",
        "'speaker_6': 'And if you're going to have parking on outside of that parcel on another parcel, then it has to satisfy certain conditions. It does not satisfy the March 1988 conditions. So I would really encourage us to revisit this. So I would remain from the same point that I raised back in February of this year.'",
        "'speaker_0': 'Thank you. Councilmember de so Councilman Brody.'",
        "'speaker_2': 'Thank you. Andrew, can I just check in with you on a few things? So can you remind me how many parking places we have here?'",
        "'speaker_10': 'It was two originally to 75, now to two. It was in December. It was 275. And it's now 260. The planning board reduced it by 15 spaces to get more landscaping in the council.'",
        "'speaker_2': 'Didn't we reduce.'",
        "'speaker_10': 'No, no, no. What? You. What? When it came to you to 75 with the conditions for the ferry parking and what you asked them to look at, possibly moving the building back 15 feet, which would have eliminated a row of parking.'",
        "'speaker_2': 'Because what I thought we did discuss, I remember the vice mayor bringing up something about parking and the ferry. So how many how many spots do we have for the ferry?'",
        "'speaker_10': 'We have approx. I mean, our guests at 275 based on the traffic studies and all, was that we would have on most days have an extra 100 that could be leased out on a daily basis to ferry riders.'",
        "'speaker_10': 'Now, you know, as as we acknowledged then, like if it's a monday after a big event at the hotel that morning, there may be fewer spaces on midweek. There might be more than 100 spaces for ferry riders. So we set up that requirement that they have that sort of the the computer app and the ability for the'",
        "'speaker_10': 'ferry riders to sort of check in early to see how many spaces were available.'",
        "'speaker_2': 'So how many I mean, how many spaces does a hotel really need? Well, under the.'",
        "'speaker_10': 'Zoning code, the 275 is actually meets the zoning code.'",
        "'speaker_2': 'Right. But is how many does it really need? I mean.'",
        "'speaker_10': 'We think that it really needs a probably about 175. It's a 172 rooms. So, you know, it's it's probably closer to 107. I mean.'",
        "'speaker_2': '100 and.'",
        "'speaker_10': '770. So we could I mean, if it's full, you're going to have at least 117. That's what our thought. But, you know, look, this is an inexact science. We've been studying this with all these hotels. What we're seeing is demand for parking at hotels, going down with Uber and Lyft.'",
        "'speaker_10': 'And this is also very close to the hotel, to the.'",
        "'speaker_2': 'Airport. I mean, that was kind of my point with the shuttle and with Ubers. And, you know, I just wonder if that role I think it's either 30 or 32. And one of the maps that 30 to 1 said 30, you know, that whole row of parking along the street, you know, I wonder if if the place'",
        "'speaker_2': 'could could survive without that road parking. I mean, we passed a climate action plan, one of our goals. To get cars off the road. And one of our goals was or our guiding policies was to not let parking dictate.'",
        "'speaker_4': 'Our, our, our.'",
        "'speaker_2': 'Our plans and our planning. So.'",
        "'speaker_10': 'So it was at 275 originally that met the code. The planning board reduced it by ten to get in more landscaping or 15 to get into more landscaping. It's within your power to reduce it further.'",
        "'speaker_2': 'Okay, maybe you can check and see if the applicant is open to that if more than one council member is interested. So, I mean, that would be the the only issue that, you know, I would have based on the reasons I explained to Mr. Thomas right now that, you know, we are trying to reduce our our carbon'",
        "'speaker_2': 'footprint. We are trying to reduce the number of cars. We are trying to implement our climate action plan. And, you know, walk the walk and talk the talk. So I'd be open to that. I didn't hear anything in any of the presentations that convinced me that the setback was wrong or that anything was done untoward.'",
        "'speaker_2': 'Regarding the setback, I didn't think I didn't see anything about the colors. I don't think I didn't hear anything about landscaping material. So I'm inclined to deny the appeal. But I'd be open to a discussion on parking if if the rest of my colleagues were and you know that $1 million in total.'",
        "'speaker_2': 'Am I the colleague to the left? To me, I mean, that's one of his big priorities is to try to improve our total revenue. So I think this is a good step in that direction.'",
        "'speaker_0': 'Councilmember Vela. Sure. So the vice mayor, I'm going to go to you next, please.'",
        "'speaker_9': 'I'll be quick. And Andrew, I thank you for for your presentation from my perspective. We gave the planning board direction, and that direction didn't include any discussion and consideration of removing more parking to move the building to the building to move back from the water.'",
        "'speaker_9': 'And it's my understanding that the planning board meetings and whatnot that the neighbors really asked for. Not to me. In fact, they put currently up to about 35 or 40 feet as to whether or not, you know, going to get there.'",
        "'speaker_9': 'I do want to acknowledge that that it appears some people have been confused about this a lot like they've done. Like everybody is very clear tonight. And in the discussion of the confusion around my life, I haven't heard anybody actually make the case for why 40 versus 35 is compelling, but I think that we should send it'",
        "'speaker_9': 'back to the planning board. I guess just can't remember which question about parking. I wouldn't want to hold this up, but I would want to see if we can maybe include some sort of condition that those spaces that are not being used for the hotel at this point in time, I think if we're getting rid of it'",
        "'speaker_9': 'again, if we were to get rid of the spaces, we would want to provide some benefit so that we don't have to consider screening. I think that that's something that we can also address through making sure that future part of it might be able to use it as well.'",
        "'speaker_9': 'So instead of eliminating the spaces, I'm not sure what the tradeoff is, just not having them which which is a terrible thing at this point. It's about through that conversation and the state community planning board and federal direction to keep the spaces for the ferry.'",
        "'speaker_9': 'And I wouldn't want to I wouldn't want to push this project out for.'",
        "'speaker_0': 'The general public. Thank you both, Mayor. You ready to go now? Okay. Councilman Vella.'",
        "'speaker_8': 'I think, you know, part of how the evolution came relative to the parking aspect was to try to also accommodate some of the the neighbors in the area who had also had concerns about ferry parking spilling over into the neighborhood.'",
        "'speaker_8': 'And I think, you know, certainly hopefully that the we'll see that it's over parked. But I think that if that happens, we can the plan can be dynamic maybe you know, to account to the vice mayor's point. Maybe it's that there's certain spaces that get dealt with later on or it gets dealt with in phases and so'",
        "'speaker_8': 'it can become landscaping. But I don't think that it's necessarily something that we need to hold up approval for. I think it can. I think sending it back to the planning board over that issue at this point doesn't really make sense.'",
        "'speaker_8': 'And I think that that can be something that we can perhaps work out. You know, with the with the developer looking at the different usage of the site, I also think that we have seen a significant uptick in the usage of the ferry terminal.'",
        "'speaker_8': 'And I know that that you know, it's one thing we just had our groundbreaking actually for Seaplane Lagoon. And I think one of the things that we can be very proud of here is that there are a number of comedians who are using public transport to get to and from work, and especially as they leave the city'",
        "'speaker_8': '. And so obviously we're still working on the the in Alameda connectors with the ferry terminal. And I think that that's coming along. But until then, I think we do have a need for those spots. And I think in terms of of the issue of the setback, I haven't heard an argument as to why we would bring this'",
        "'speaker_8': 'back to the planning board. At this point, I think at this point, I'm not inclined to follow my colleagues, the vice mayor and Councilmember Odie.'",
        "'speaker_0': 'Thank you, Councilmember Vella. Okay. So I spent six years on the planning board obviously before this project came up, and this particular project has had a lot of coverage. It's been back and back to the planning board several times.'",
        "'speaker_0': 'It has had a lot of interaction with neighbors. And I, I do believe all your neighbors that you you've made the Harbor Bay residents. You've made it a better project. Your input has certainly helped. I don't think everyone speaks with one voice.'",
        "'speaker_0': 'I know we heard it said that the neighbors just wanted a hotel that fit into the neighborhood to thoughts came to mind. Some residents didn't want a hotel there at all. And then I would just remind people that that neighborhood where this hotel is slated to go is a business park.'",
        "'speaker_0': 'And this is a business park that has not had enough hotel space. So what I do know from six years on the planning board and going into seven years on the city council is that you're never going to please all the people.'",
        "'speaker_0': 'So at the end of the day, we look at, is this good for the city, are we being fair to the neighbors? And as was brought up, our neighbors in this area have been very vocal and concerned about traffic to the ferry terminal at Harbor Bay.'",
        "'speaker_0': 'And I am also proud that Alameda Ferry Riders, we are the highest per capita riders of the ferry in all the wider system, which is a reason that we're one of the reasons we're getting our third ferry terminal in our city.'",
        "'speaker_0': 'We're an island and water transit makes perfect sense. I also know that in 2020 from the Harbor Bay Ferry terminal, instead of ferries every hour during the commute time, they will be coming every 30 minutes and there will be larger boats that take up to 300 riders.'",
        "'speaker_0': 'And yes, you can bring your bicycle and get there on your bicycle. But I also know, because I've worked with a lot of young families, Alameda attracts young families wanting to raise their kids here. It is a race to get children dropped off at the preschool.'",
        "'speaker_0': 'Children dropped off at school and our elementary schools. There's a time you cannot drop your children off earlier than a certain time. And yet the ferry, when it leaves, you've got a very narrow window there. So this is my segway to saying I do believe we have the the ability as a council tonight to designate and that'",
        "'speaker_0': 'of those part. I'm not here to suggest that we take away parking spaces, but I would very much like a certain number of those spaces that are beyond the number of rooms that the hotel actually dedicated to ferry riders.'",
        "'speaker_0': 'Is there a way to do that?'",
        "'speaker_10': 'Mr. Thomas I think we basically have what you're looking for in the original conditions of approval. Essentially, every morning ferry riders will be able to go on their phone and see how many spaces are available to them.'",
        "'speaker_0': 'Okay, well, it's.'",
        "'speaker_10': 'In the applicant's best interest to make them.'",
        "'speaker_0': 'Available. Is there a way that we make sure that there's never a time when there is no parking space available?'",
        "'speaker_10': 'I mean, the idea here is if the hotel is filled and they and all the hotel patrons hosting call, now, we don't see that as a scenario. I will say, talking to the applicant, because you had Councilmember Ody had asked me about this and I checked with the applicant.'",
        "'speaker_10': 'His concern about reducing the parking tonight is he's really concerned about the restaurant and he sees an opportunity to actually fill every space right in the evening with the restaurant, the hotels and the ferry riders. I'm concerned about changing it without the ferry riders here.'",
        "'speaker_10': 'We made a lot of promises to ferry riders over this area.'",
        "'speaker_0': 'Okay. So fair enough. But you're working on. I love the idea of the app. Okay. And as far as a missed opportunity to work with the neighbors, I think a lot of work has been done with the neighbors going out and actually meeting in their neighborhoods, in their homes.'",
        "'speaker_0': 'And at some point, this is a disincentive to developers to do projects in Alameda, which might be part of the motivation of some I don't know. But what I do know is that our city and our growing business community and we have a very vibrant biomedical health sciences, green tech industry, pretty exciting things coming our way in'",
        "'speaker_0': 'the near future. When these businesses have more visitors and overnight guests than our hotels can accommodate, they send their guests over to San Francisco or to Oakland. And with those guests go the money them they might spend in our city and the top tier, the transient occupancy tax on every hotel room.'",
        "'speaker_0': 'And yes, we're going to get around to increasing that one of these days. Mr. Desai But it's so so I don't want that to happen. And I want to be able to serve our business community. We need our businesses, we need our residents.'",
        "'speaker_0': 'We need to achieve a jobs housing balance. So for that reason, I am ready to say it's time to move forward on this and to entertain a motion to deny the appeal that we are considering tonight. Is there a motion or any further discussion?'",
        "'speaker_0': 'So I have a motion by Vice Mayor Knox White. Have a second. Second seconded by Councilmember Vela. Any further discussion? Let's vote, roll call. Vote.'",
        "'speaker_1': 'Councilmember Desai I.'",
        "'speaker_6': 'Am against the motion. Is that right?'",
        "'speaker_0': 'You help me out.'",
        "'speaker_2': 'To deny the appeal.'",
        "'speaker_0': 'As the motion is to deny the appeal.'",
        "'speaker_3': 'So it's no right.'",
        "'speaker_1': 'No, no, no. I think again some of.'",
        "'speaker_0': 'The negative.'",
        "'speaker_1': 'Councilmember not quite.'",
        "'speaker_9': 'High.'",
        "'speaker_1': 'Odie. Yes, fella. Yes mayor has the Ashcraft.'",
        "'speaker_0': 'Yes the the motion to deny the appeal carries 4 to 1. All right. Thank you, everyone. And with that, I'm going to call a break and that's I'll be back here in 10 minutes. Well rounded at 915. We're going to start.'",
        "'speaker_0': 'Thank you, everyone. Thank you. Audience and speakers. One minute morning. Yeah, it's 914. I'm swallowing my Luna bar there, so I didn't talk with my mouth. But okay, now it's 915. True to our word, we are back for the council meeting and we move on to item six.'",
        "'speaker_0': 'Be Madam Clerk.'",
        "'speaker_1': 'Recommendation to approve the Transportation Commission's recommendation design concept for a two way bikeway for the Clement Avenue Safety Improvement Project and crossover me to trail between Grand Street and Broadway.'",
        "'speaker_0': 'And oh look it's one of.'",
        "'speaker_4': 'Those bad pennies.'",
        "'speaker_10': 'Just keeps coming back.'",
        "'speaker_0': 'Nowhere else to go I.'",
        "'speaker_4': 'Got nothing else better.'",
        "'speaker_10': 'To do. No, this is an exciting project. We call this the Clement Avenue Safety Improvement Project. I think you have I've been told 17 speakers, so I heard 18. I'm going to run through these slides very quickly and then be make myself available to answer any questions.'",
        "'speaker_10': 'Gale Payne, who is the project manager, is here today. She's really done all the heavy lifting on this on this project. And we have also an excellent consultant team from CDB Smith who have been instrumental helping us and of course are very capable.'"
    ],
    "Design Concept for Clement Avenue Bikeway and Cross Alameda Trail.": [
        "'speaker_10': 'Public Works Department has been another very important partner in this project and.'",
        "'speaker_0': 'Maybe the city engineer to his.'",
        "'speaker_10': 'City.'",
        "'speaker_0': 'NJ Well of course. Thank you, Scott. Take it away.'",
        "'speaker_10': 'Yes. Okay. So we are here to get your approval of what we believe is the preferred design concept. If you, um, we are recommending this preferred design concept. The Transportation Commission also recommended it. If you are, what we want you to do tonight is make a decision about this preferred design concept.'",
        "'speaker_10': 'What that will do is then kick off the next level of design. We then we get going with very specific essentially 30% construction drawings. So we don't want to be changing our mind after tonight as to what we're drawing.'",
        "'speaker_10': 'This is a probably about a $6 million project. When it's all said and done, we have about $5 million for construction. So the city has been investing at the front end on the design aspect of it and we've been very efficient so far, so we'd like to keep that going.'",
        "'speaker_10': 'This is a design for Clement Avenue from Grand to Broadway. This is a portion of our Cross Alameda Trail that was planned by this has been really a plan for 20 years. But you and the city of Alameda are now actually constructing the cross Alameda Trail.'",
        "'speaker_10': 'You're making great progress. The portion at Alameda Point, this trail goes from the seaplane lagoon all the way across to the Miller Sweeney Bridge. I mean, it's quite an accomplishment. This idea first came up when the Alameda Beltline closed down over 20, 25 years ago.'",
        "'speaker_10': 'And it's actually happening. So essentially by the middle of next year, you will be able to ride your bike in a protected to a bike lane from out from the seaplane lagoon at Alameda Point all the way across West Alameda through Constitution through Jean Sweeney Park.'",
        "'speaker_10': 'The Jean Sweeney Park piece is done, as you know, and we will that will get you all the way to Sherman, then the Del Monte Project, which we hope will be moving forward in short order. We hope they're doing a little segment between Sherman and Entrance Road.'",
        "'speaker_10': 'There's a piece that's already done. They're behind Marina Village. And now what we're talking about is this next big chunk grand Broadway. It's all on the Clement Avenue, right of way. We would love to start construction on this piece in late 2020, early 2021.'",
        "'speaker_10': 'Existing conditions, you know about Clement? It's a it has substandard sidewalks. It has no bicycle facilities at all, even though it is part of our cross Alameda Trail. Although you can't see the railroad tracks, they're there. They just we just put a nice little patch over the top of them.'",
        "'speaker_10': 'But that's not going to last for long. So we want to get those tracks out of there to create really a solid road for the future. We have speeding on this street and safety issues. We've had we have about 68 collisions over the last five years for severe but of those for severe accidents, three, you know, collisions'",
        "'speaker_10': 'with pedestrians and bicyclists, three were PEDs or bicyclists. Pedestrians and bicyclists. So the pedestrians and bicyclists are are the ones who are really taking the brunt of the safety issues out here. It is a truck route and we have to keep it a truck route, but it's about 1 to 2% of the overall vehicles on the street'",
        "'speaker_10': '. And as you know, this area is changing. It was historically our industrial warehouse, maritime industrial area. It's changing. We've got changing uses in the northern waterfront is the Alameda landing excuse me, Alameda. A project, hopefully someday. The Boat Works project, the Penn Shell Pennzoil site, the Mulberry Neighborhood, which has built 52 homes right on the new cycle'",
        "'speaker_10': 'track Cross Army Trail. We are just approved the Park Street Hotel. We see that coming in for building permits in the near future. And then we have the school district has a warehouse. So this area is changing. We're going to see not only we can see the cross along the a trail coming through here with more bicyclists'",
        "'speaker_10': 'and pedestrians as we build those other sections. But they're going to be more people and more parks along this area. Every single one of these projects has public parks. So we see a lot more activity, not just along the stretch, but a lot more families and and kids on bikes in the vicinity going to the waterfront parks'",
        "'speaker_10': '. Our goal is, of course, reduce speeding, increase safety, particularly as we start seeing more and more children riding bikes in this area. Obviously, one across. We want to complete this cross Alameda Trail since we're making such great progress.'",
        "'speaker_10': 'Of course, one of the things we want to make it safe and we want to really encourage people for climate action reasons and all sorts of other good reasons, traffic reduction to increase bicycling and walking as people that we want people to feel safe on this road if they are riding their bikes.'",
        "'speaker_10': 'I've talked about the access to waterfront. Of course we have also we need to maintain truck access. It is a truck route and we have, to the extent possible, minimized parking lots. And we've been thinking about public parking on the street as as a factor and a consideration.'",
        "'speaker_10': 'So what we did is we sort of looked at four different options and we kept these four options alive all through the process, just so that the public, through our task force and our community meetings, could consider the options.'",
        "'speaker_10': 'And the Transportation Commission, of course, there is what we call the do nothing option, which is these existing conditions you are familiar with. We then did a sort of a traditional bike lane option where we just striping lanes.'",
        "'speaker_10': 'So these have six foot bike lanes, seven foot parking lanes and 211 foot travel lanes. Then we have what we call the two way protected bikeway. So this is a two way projected bikeway on the north side of the street where we have fewer driveways.'",
        "'speaker_10': 'And then on the right hand side of the street you have parking along the two way. Bikeway is protected with parking on the outside of the bikeway. And then you have the on streets parking against the sidewalk on the south side.'",
        "'speaker_10': 'Once again, two lane to 11 foot truck lanes or travel lanes that are basically an Alameda truck. Truck routes are 11 foot travel lanes. We also looked at then a what we call the hybrid option since we have protected to a bike lane coming all the way from Alameda Point, all the way through Jean Sweeney Park, all'",
        "'speaker_10': 'the way behind Del Monte and behind Marina Square, we thought, well, there might be a hybrid where we continue the two way protected bike lane for half of the length to walnut. And then we do this sort of transition people from a two way bike way to more traditional bike lanes at walnut and then continue the bike'",
        "'speaker_10': 'lanes for the second half, the eastern half. But this requires a transition at at Walnut Street where we move people out of the two way and into bike lanes. It's important to realize there's there's a lot of commonality.'",
        "'speaker_10': 'This really comes down to how we treat the bikes and the bike access and bike safety. All three options short of the do nothing, have the same basic sidewalk street tree improvements we've got to fix them for to make them adequate.'",
        "'speaker_10': 'So the basic curb, gutter, sidewalk work is the same. And those three options we have to increase intersection safety daylighting stop signs, crosswalks, bulb outs, signal timing, same and all 311 foot travel lanes the same in all three obviously improve the on street parking for disabled parking loading zones.'",
        "'speaker_10': 'That has to happen in all three removing the railroad tracks, all three undergrounding utilities the extent we can and working with our developed partners. That's the same in all three. So it really comes down to how we handle the bike facilities lane versus to a cycle track or the hybrid option.'",
        "'speaker_10': 'Um, we staff throughout this entire process with the technical advisory committee that we had with the sort of interest groups and then with the Transportation Commission took a very consistent approach throughout. We've recommended from day one that we think the two way bike way is the safest for bicyclists and therefore this is the one that we're recommending'",
        "'speaker_10': '. It provides physical protection from trucks and cars, not just a straight lane, but literally physical protection with parked cars and bollards. Besides continuity with the cross Alameda Trail, as I described. So trying to minimize that, not at times where we have to tell bicyclists, hey, move from one facility to a different facility, especially if you're dealing with'",
        "'speaker_10': 'kids and, you know, trying to keep as consistent as possible. So we like that. It also provides the best protection at the Park Street intersection, which is a busy intersection for bicyclists to be crossing. And we also believe because the although the lanes are similar in all four scenarios, by removing those park car lanes and the apparent'",
        "'speaker_10': 'width of the street looks narrower, which will help with the the speeding parking has been a big issue. We wanted to just be really honest about this. We we've had these numbers for everyone so they could see our recommended one removes the most amount of parking.'",
        "'speaker_10': 'But let me just quickly so you understand how the parking works. You've got about 300 spaces out there today. Even if you do the do nothing approach with the daylighting policies, we're going to lose about ten for daylighting.'",
        "'speaker_10': 'So even in the do nothing, we removed ten approximately ten spaces just for intersection safety. If we do the bike lanes option, we remove ten for daylighting and then we remove another 55 to deal with our sidewalk widening and fixing the sidewalks.'",
        "'speaker_10': 'So then if you look at the two way, what the recommended to a bike approach that we're recommending, we remove the ten for daylighting the 55 for sidewalks and then when we need to lose another 20 approximately along the corridor for the bikeway.'",
        "'speaker_10': 'Um, obviously if we do the hybrid, it's just a slightly different math ten for the daylighting, 55 for the sidewalk, and instead of 20 for the bikeway, we only need to pull out ten for the bikeway. Obviously occupancy rates will vary as we build the new projects in this area, but if you just took today's occupancies, you'",
        "'speaker_10': 'know, obviously occupancy goes highest with our recommended option up to about 90%, but still it would be at 90%, not over over 100% in terms of occupancy. So we are recommending the two way bikeway, as I said, Gail Payne, Thaddeus from CDB Smith has been Wozniak has been fantastic, our consultant team and of course Scott Wickstrom, our'",
        "'speaker_10': 'city engineer. And so our recommendation is for you to identify the two way bikeway as the preferred alignment. And what if you do follow, if you do make this recommendation tonight or choose any of them tonight, and that's what we'll we will proceed with that alternative into design drawings.'",
        "'speaker_10': 'I am available to answer any questions.'",
        "'speaker_0': 'Thank you, Mr. Thomas. Do we have any clarifying questions from council members before we get to our 18 public speakers? Okay. Vice Mayor, keep looking at the ceiling. Okay. Okay. So then our city clerk will read several names when you hear your name.'",
        "'speaker_0': 'Get ready to move to the aisle so we keep things moving.'",
        "'speaker_1': 'Okay. And the speakers will get 2 minutes because there's over seven.'",
        "'speaker_0': 'Thank you. Yes.'",
        "'speaker_1': 'James Johnston, Pat Potter, Bonnie Lehman, Doug Letterman and Susie Hofstetter.'",
        "'speaker_0': 'Evening. Hello. Hi.'",
        "'speaker_4': 'Uh, my name is James, and.'",
        "'speaker_6': 'I live near South Shore Center, and I'm in favor.'",
        "'speaker_4': 'Of option two, which is for the 100%.'",
        "'speaker_6': 'Protected bikeways all the way. I moved here about three years ago. Shoreline Drive has always had a two way bike lane to me.'",
        "'speaker_4': 'And I love riding on it.'",
        "'speaker_6': 'I was actually surprised to learn it was new.'",
        "'speaker_5': 'And.'",
        "'speaker_4': 'Controversial not so long ago, and it used to be.'",
        "'speaker_6': 'Called the Shoreline Expressway, which doesn't really sound like a nice place to be as a bicyclist or pedestrian.'",
        "'speaker_4': 'So I've enjoyed the most riding.'",
        "'speaker_6': 'On protected bike lanes. I feel they're the safest and the friendliest option.'",
        "'speaker_2': 'Two problems with option one.'",
        "'speaker_6': 'For example, is a door zone.'",
        "'speaker_4': 'We mentioned there are some trucks and car doors may throw you in front of a truck.'",
        "'speaker_6': 'I've ridden in these normal bike lanes before and it's nearly happened to me. I've just been lucky so far. And so to avoid that, I might have to ride in the street a bit.'",
        "'speaker_4': 'Some drivers and police.'",
        "'speaker_6': 'Don't think you have a right to ride in the street. They're wrong. But you're on a bicycle. You have to deal with them. Sometimes you might. Okay, so maybe option one has wider bike lanes. The next problem.'",
        "'speaker_4': 'Is people will treat it as a parking spot.'",
        "'speaker_6': 'And then I would have to go completely into traffic to get around somebody parked in the bike lane. So option two is the only one that avoids these door zones, illegal parking and these other intrusions.'",
        "'speaker_5': 'So, you know, one question I would.'",
        "'speaker_6': 'Ask is, like, if you had a young child, which of these options would you feel them safest to be on? And I believe that would be option one. And even if you don't ride, you still benefit from less cars on the road, lower greenhouse gases.'",
        "'speaker_6': 'You know, the friendlier. We make it for bicyclists. Other people can benefit, too. Even if you don't ride. And also, I'd like to add that, you know, streets are for everybody.'",
        "'speaker_4': 'They're not for.'",
        "'speaker_6': 'People that just spend thousands of dollars on a car. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'It's just Pat Potters and Bonnie Bonnie waving women. Yeah.'",
        "'speaker_3': 'Hi. Pat Potter, bike walk, alameda and the transportation chair for CASA's Transportation Commission. I am in favor of the city's proposal of option two. I think that that's what's most exciting to me about this, is envisioning what this street's going to look like when those developments come in.'",
        "'speaker_3': 'There's going to be children. There's going to be parks. It's not going to be this industrial freeway that that is so dangerous. Now that you've had, you can see how many accidents you've had. And four of them have involved bicycles and pedestrians.'",
        "'speaker_3': 'So a protected bikeway helps you so much as far as keeping people safe, keeping kids. One of the things that kids do, and this has happened a couple of times I've heard just recently, is they don't really think so much.'",
        "'speaker_3': 'So they're going down the bike lane and they want to pass somebody and they don't look. So out they go. There was a girl on Grand. It would school that got hit. There was a friend of mine who was driving and knew the two, the mother and the child who were on their bicycles.'",
        "'speaker_3': 'And the child decided, Oh, I'm going to pass Mom. Fortunately, she was paying attention and braked. So anyway, I do hope you'll vote for option two. I think it's an excellent opportunity for us to have safety and help the environment.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_0': 'Thank you. This woman.'",
        "'speaker_3': 'Creating Council members. My name is Bonnie Wayman. I'm also a member of Bike Walk Alameda and I run easy street cycling and I teach kids safe biking around town. Independent. Safe biking. Two paths point the bike lanes alone.'",
        "'speaker_3': 'Don't. Don't work the way we want them to. The girl that was hit on ground was just in the bike lane and a person in the parked car pulled out and hit her. One of the issues with the with the bike lanes is that like the first gentleman mentioned, people people use it as a loading zone and'",
        "'speaker_3': 'it's in for kids to have to go around. The Uber drivers and the moving trucks and the delivery trucks and the garbage trucks and the Lyft drivers and the people who just don't want to look for a spot.'",
        "'speaker_3': 'It's not it's not safe for people to do that. I wanted to mention that during camp I had a group of kids and we did the four way stop on Oak, and we did a short turn on to Clement, and a woman came behind us and I found out for my assistant in the back.'",
        "'speaker_3': 'She was screaming profanities at the kids. She passed out that way too close of a range at way high speed. And that doesn't happen on a protected bike lane. That shouldn't happen to a group of kids who are stopping at stop signs and saying single file.'",
        "'speaker_3': 'And my last point is that this this the protected bike way would be a path that would connect the east end kids to academy of alameda, to koa to near to asti. There's a whole bunch of schools that the kids there would be using this path to get across a lot more charter schools now that we need'",
        "'speaker_3': 'to keep in mind that kids are biking, too. And lastly, every kid riding a bike to school is one less parent driving in a car on the road, taking their kid in traffic. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Doug Letterman then Susie have center and Suzanne Dion diers.'",
        "'speaker_4': 'Thank you, Mayor Ashcraft, Vice Mayor White and council members. I am a resident of the Mulberry Development at the corner of Clement and Willow. I am actually also a newcomer to Almeida. Happy to be here. I've been here about a month with my wife and my three year old daughter.'",
        "'speaker_4': 'We moved from Oakland. In Oakland. We were effectively a zero car family, and we tried to give that a shot here in Alameda. My wife tried taking the bus to work. The headways were too long for it to be very usable for her.'",
        "'speaker_4': 'I tried taking my bike with my daughter behind me on our commute and the street conditions. We thought they were a little too dangerous to do that at this time. So reluctantly we became a two car family. And I know that one of the stated policies of Alameda is to decrease the number of single driver trips that'",
        "'speaker_4': 'cars are making. It was actually discussed during the development plans for our our home. But a lot of the policies in the city seem at cross-purposes to that. For example, our developer was required to to build two parking spaces for each unit.'",
        "'speaker_4': 'The conditions on Clement are very dangerous, we think, to be biking on them currently. In fact, in our first week living in our place, we saw pedestrian the aftermath of pedestrian hit by a car on clement and oak.'",
        "'speaker_4': 'So I just want to say I'm fully in support of staff's recommended option. I think it's great. It's perfect. In the public comment phase, I wished for two bike lanes protected by parking on either side of the street.'",
        "'speaker_4': 'But as you said earlier, not everyone can be happy with everything. And I think this is certainly the perfect be the enemy of the good. And I hope that one day we can all bike safely to work and I can get rid of my car.'",
        "'speaker_4': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you.'",
        "'speaker_1': 'That's Susie. Have better than Suzanne, dear. Sun shone through.'",
        "'speaker_3': 'Good evening, Mayor and council members. It's great to be here. My name is Susie Hofstetter. I'm staff with Vicki Spay on the advocacy team and I'm a resident of Alameda. I actually live on Broadway barely a block off of this project.'",
        "'speaker_3': 'So I'm very excited. I'm here to ask you to support option two with all my heart and soul. I'm just very excited about this project. I want to thank staff, especially Gayle Payne, who has done a huge amount of work on the outreach process.'",
        "'speaker_3': 'She has been talking to everyone and has done an excellent job getting a really broad range of input, which I believe is reflected in option to my partner. And I live, as I said, on Broadway and we like to bike to the Alameda Point area and in other places in Alameda.'",
        "'speaker_3': 'And we're just so excited about the new we park trail. But getting to it is a really big challenge. And you know, often people say like, take this other street or that other street and Pacific, which is supposed to be this.'",
        "'speaker_3': 'That we go to has a bunch of really challenging side street crossings, and I know that staff are going to be looking at that soon, but I guess that's just to say that there is no other street, this is it.'",
        "'speaker_3': 'And we're really looking forward to a continuous trail facility that's just to a protected the whole way across the island. I can't just praise this project enough. I'm so excited and selfishly, it's like my home project, so it couldn't happen fast enough.'",
        "'speaker_3': 'And this, as others have said, this design is the one that will serve the most users, kids, older riders, people of all abilities. So that's what we're going for here. This is what will increase the mode share of bicycles in this community.'",
        "'speaker_3': 'So thank you for your support for option two.'",
        "'speaker_0': 'Thank you. Okay. Our next maybe four.'",
        "'speaker_1': 'Speakers in tears shone through Jim's trailer. Strelow Nila Miller or no? Sorry.'",
        "'speaker_3': 'Good evening. I'm Suzanne Diers and although I'm pro bicyclist, I'm actually against this particular project as I feel it's not safe for the cyclists nor the vehicles. The trucks on this route for cyclists, for one with a dedicated route, they're the car.'",
        "'speaker_3': 'The cycles are going both ways. With the new projects coming in, there's going to be a number of driveways across this path. Drivers are not expecting to see cyclists cross their path from either direction. If you think about the truck route aspect, a number of properties along this route are light industrial, including the property my family owns'",
        "'speaker_3': 'at the corner of Lafayette and Clemens. We have two boat related businesses at that property and they are regularly bringing boats onto and off of the property. When you have a boat, the California law says the width of the boat with the trailer is eight and a half feet.'",
        "'speaker_3': 'If you add ten inches four mirrors on either side, that's close to ten feet wide. That means the.'",
        "'speaker_1': '11.'",
        "'speaker_3': 'Foot lane that for one direction of the vehicle would allow for this width, six about six inches on either side of the vehicle to get past parked cars and oncoming traffic.'",
        "'speaker_1': 'Without hitting anyone.'",
        "'speaker_3': 'For a vehicle, pulling a trailer with a boat. That's not talking about even a wide load boat. So for those reasons, the safety of the cyclists, safety of the vehicles, I think this is inappropriate for Clement. It should be routed to a different street.'",
        "'speaker_0': 'Thank you, Mr. Dias.'",
        "'speaker_1': 'Our next speaker, Sean throw Jim Strelow, Zac Caplan, Nila Miller.'",
        "'speaker_4': 'Good evening, Mayor. Council members, my name is Sean Throw. I am the owner of the boatyard, the Grand Marina. I am the only boatyard left in the island, thanks to the city. To a certain extent. But anyhow, my boatyard does rely on large vessels coming down the street.'",
        "'speaker_4': 'And your proposal under a double track will inhibit that. I talked to many of my drivers who come in to and bring a fair amount of boats to us, which is a fair amount of my income. Without that, they will go to another city, to the other boatyards that still exist in the Bay Area.'",
        "'speaker_4': 'I don't think we want to lose the only boatyard we have. I need the business. The other interesting thing I see when I look at their slides that they showed you today, they're showing you the old Alameda development, old Alameda Marina, the buildings there, they have never drawn their drawings with the new project that you're putting in'",
        "'speaker_4': '. You've approved that new project, has a beautiful waterfront walkway, bicycle way. Now, if you have a child, where are you going? To bring your child along clement and sea buildings. Are you going to go across over to the nice, beautiful boats, big wide area?'",
        "'speaker_4': 'I know from my boat yard on weekends, children and bicyclists and runners and dog walkers come through my boatyard all the time on the weekend. They try to sometimes come through during the week. It's not the most safe thing in the world because I have a huge operation going on with very expensive equipment that don't stop on'",
        "'speaker_4': 'a dime. So a kid run in front of my machinery is not a good thing, but they do that, so we have to watch out for that. So they're going to do that anyhow. On the weekend, they're going to go over to the old Svenson property.'",
        "'speaker_4': 'They're going to ride there. They're not going to use this. Double track. If you put the double track in, you can't take it out. My suggestion, if you want the money, which I know you do, to fix that road, do selection, whatever it is to separate lanes.'",
        "'speaker_0': 'Thank you. Our next figure, Mr. Australia.'",
        "'speaker_4': 'Thank you. I have ridden my bike along combat for over 50 years without incident in its current state. I it's what I recommended four years ago. So I'm very happy as it is right now. You claim this is a safety project.'",
        "'speaker_4': 'And however, my biggest concern is the East section between Park Street and Everett, because along that section is Ted and Joe's Tow Triple A emergency service at Ulsan Plumbing. Those three businesses are all within the same block and they probably do 20 to 30 entrances and exits along their way every day.'",
        "'speaker_4': 'Yeah. So therefore they don't have to.'",
        "'speaker_10': 'Look at.'",
        "'speaker_4': 'Just one direction. They're now going to have to look at two directions. So I think you're actually creating a safety hazard in front of all those three different businesses. The Cross Alameda Trail Project has the large Pennzoil properties still on its way.'",
        "'speaker_4': 'Five years ago I was told that that property would be sold in five years, so that's still a roadblock in this whole project. As a taxpayer, I'm concerned about how much money is spent on duplicative projects. The official city bike route is west of Park Street along Pacific Avenue.'",
        "'speaker_4': 'Just three blocks away? Yeah, two blocks away is the San Francisco Bay Trail. The official Bay Trail straight on the map has been for the last ten years, Buena Vista Avenue or Bay Trail. Dawg, take a look. It's been there for ten years.'",
        "'speaker_4': 'They have Buena Vista as the official route. So how many different ways do we have to have going across the city? I just like disorganize government projects that spend my taxpayer money similar to the $1 billion of the Transbay terminal facility for an express train to L.A. that I'll probably never see in my lifetime.'",
        "'speaker_4': 'Oh, similar to that $1 billion that I'll never see again. That has been wasted. Excuse me. Spent billions better coordinate our governments and how we spend our money. Taxpayers money. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Zach Kaplan. Nila Miller. Rich CUSUMANO.'",
        "'speaker_4': 'Hello. My name's Zach Kaplan, and I've been using bicycles as my primary transportation since 1990. And I'm all for widening the sidewalks and getting rid of the railroad tracks and planning street trees. I am entirely against option two of the bi directional bike lane, primarily for safety reasons.'",
        "'speaker_4': 'I find that well, for one thing, in the United States for over ten or 15 years, traffic is on roadways just kept to the right. And this is putting some cyclists facing oncoming traffic, which is not the way drivers have been trained to expect faster moving cyclists to be.'",
        "'speaker_4': 'When people are pulling out driveways and cross streets, they're looking for slow moving pedestrians, but not a cyclist that might be doing 20 miles an hour. So this is going to greatly increase opportunities for collisions between motor vehicles and cycles.'",
        "'speaker_4': 'And most collisions between motor vehicles and cyclists happen at intersections. Not not mid-block. Rear rear enders are a relatively small percentage of collisions and which appears to be what the bi directional bike lane is addressing. And it's not addressing at all the issue of intersections.'",
        "'speaker_4': 'It's actually going to make it worse, and I think that's a liability for the city by putting this in because it's putting cyclists in dangerous position. Also, there are convenience reasons I happen to live on Schiller's Street, which intersects with Clement, and I would have to cross two lanes of traffic to make a right turn to use'",
        "'speaker_4': 'that. When I use Clement as my primary way of getting the Park Street Bridge, get off Alameda, come back from the Park Street Bridge. I would have to somehow get over to the left like a pedestrian. I couldn't do it the way I do now, which is I gradually merge.'",
        "'speaker_4': 'I look at my rearview mirror, gradually merge. Mercia left like a hood of our driving motor vehicle.'",
        "'speaker_0': 'So thank you, Mr. Capp.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Miller, Rich CUSUMANO and David Burton.'",
        "'speaker_3': 'Hello. Hi, I am Neil Miller and I want to encourage the council to vote on option two. Yes, for a two way protected bike lane on Clements between grand all the way to Broadway. I honestly don't really ride my bike anymore.'",
        "'speaker_3': 'I used to ride a bike as a daily mode of transport when I was in college in Brooklyn. I used to ride through ice and snow. And I mean, now, after a few close calls, particularly with a truck, I got a sense of my mortality and I'm a little more nervous of a driver and or bike rider'",
        "'speaker_3': '. And I think particularly on Clement being a trucker, it needs protection for children for all kinds of beginner riders. And if in my travels in places in Europe where there are there's extensive bicycle infrastructure, people feel so safe there that they hardly wear helmets because it's so rare to have an accident.'",
        "'speaker_3': 'So I think that we would endeavor to have that kind of safety here in Alameda. So thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Rich Simoneaux, David Burton and Morgan Belanger. Hello.'",
        "'speaker_4': 'Hello. My name is Rich CUSUMANO, and I came to voice my strong support for the double sided, protected bike path on the cross Alameda Trail. There are many great reasons to improve it from economic to sustainable. But however, my primary concern is safety.'",
        "'speaker_4': 'And I believe option number two to be the safest option. A little over a year ago, I was biking down Clement with my 22 month old son in the back of my bicycle. We were struck by a car who fled the scene and we were riding where a bike lane like option one would be.'",
        "'speaker_4': 'I thank God every day that my son was well protected by his seat and his helmet. And then I took the brunt of of the damage. I had a broken tibia, fibula, a ruptured disc in my back, and my wife was on a bicycle behind us.'",
        "'speaker_4': 'She saw the whole thing. And, you know, seeing your family suddenly get thrown like rag dolls is traumatizing, to say the least. At the end of the day, I hope no other family has to go through anything like that.'",
        "'speaker_4': 'And I believe that this type of incident could have been avoided had we been in a protected bike lane away from speeding traffic. I have yet to return to biking, but I was biking regularly and I would like to return to biking for my commute and know that there's a safer option to do so.'",
        "'speaker_4': 'And I would really like to also know that when my son is older, he has a safer option to bike across the island. Whether that's to a school, whether that's to a football game or inclement weather, that's, you know, anywhere.'",
        "'speaker_4': 'So I guess I'll just I'll just close up by saying, please approve option number two.'",
        "'speaker_0': 'And while we have you at the podium, I wondered if you might be in the audience. And your wife is here, too. No, no. But I remember it was an awful incident and it happened either on Mother's Day or Father's Day.'",
        "'speaker_0': 'It was Mother's Day. It was Mother's Day. And I remember thinking, what an awful experience. And like you said, thank God your child was protected and not hurt, but was so happy to see you here and that you've healed.'",
        "'speaker_0': 'And maybe assuming this project gets approved, he moves forward. Maybe you'll come and help us with the ribbon cutting. So but thank you so much for speaking to us and I'm glad to see you up and up and about.'",
        "'speaker_0': 'Thank you. Take care. Okay.'",
        "'speaker_1': 'David Burton, Morgan, Bellinger and then Linda dares you.'",
        "'speaker_4': 'Madam Chair, members of the Council, David Burton, a dedicated owner of Zero Cars, one bike and many well-worn pairs of shoes. I hope this will be an easy vote for all of you. I appreciate the great details provided by the other speakers outlining my option two is the clear choice.'",
        "'speaker_4': 'Just look to the cities goals as stated in the presentation, and it's clear that IP option to is the best way to achieve the stated goals. It's imperative that we go for the highest standard if we're to provide safe, convenient, complete routes around the island, which gives all living good alternative to driving.'",
        "'speaker_4': 'Not everyone will be a cyclist, but let's make it possible for as many as as many to do so as we can all Alameda is benefit when more of us get out of our cars. Building a first class cross Alameda Trail is critical to the future of the city.'",
        "'speaker_4': 'When complete, the trail will connect Alameda with both their main shopping streets. It will connect us to the ferry and to BART, and it will make it safer for kids to bike to schools on the west end of the island.'",
        "'speaker_4': 'A complete cycling infrastructure is critical to reaching our goals for carbon emission reductions by reducing transportation emissions, which are our largest source of emissions, said. You just reaffirmed his commitment to reducing greenhouse gases. Don't betray that commitment now.'",
        "'speaker_4': 'So I just encourage you to adopt option two as recommended by the staff. And let's keep moving forward in the effort to build a high quality, complete cycling network here now. Thanks.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Green. Our next speaker.'",
        "'speaker_1': 'Morgan Bellinger's and Linda dear, then Robin. Olivia Kraft.'",
        "'speaker_4': 'Madame Mayor, Vice Mayor, members of the council. Thank you for walking the walk. My name is Morgan Belanger. I'm an Alameda resident. My three year old bicycle commute buddy helped me speak last time, but she had a prior obligation to join us tonight.'",
        "'speaker_4': 'I'm not speaking tonight for myself. I'm a privileged white male, an experienced cyclist capable of taking the lane. Instead, I'm speaking on behalf of the kids and inexperienced cyclists I see riding every day in unprotected bike lanes on our way to preschool.'",
        "'speaker_4': 'I know some of them had homework or couldn't be here this late. I'd like to share a story about a recent experience I had in the unprotected bike lane on Santa Clara near Webster on September 11th. Just after 8ami was riding westbound when I encountered a stopped minivan completely blocking the bike lane.'",
        "'speaker_4': 'The driver walked out of her house 30 seconds later. In that time, three men. Middle schoolers rode around the minivan and had to merge with the morning commute traffic to do so. The driver said she was just getting her bag.'",
        "'speaker_4': '30 seconds. Now, how do we discourage that behavior? Her car wasn't there long enough for one of our many to find us to give her a ticket. And license plate cameras are just silly, right? No. The inexpensive, reasonable way is to simply make it physically impossible for drivers to block bike lanes in the city with their cars'",
        "'speaker_4': '. We've already made tremendous strides in bicycle infrastructure, but the tricky thing about adding bike lanes like the one on shoreline is you don't ever really know how many lives you will save or you have already saved. Please vote for option to the two way protected bike lane.'",
        "'speaker_4': 'It's a terrific fit for this street with its limited estuary side driveways. It will help us eliminate free vehicle storage on a street that's fundamentally inequitable use of public space and it will save lives. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Linda. Dear Robin. Olivia Craft.'",
        "'speaker_3': 'Good evening. My name is Linda Diers and I have been a resident here in the city of Alameda since 1971. To help you do the math, that's the last 48 years. And yes, I successfully rode my bicycle to school to and from for many years on our existing infrastructure.'",
        "'speaker_3': 'I just want to start by saying that I am not against a bicycle path. I'm very much for it, but I am against a bicycle path. I'll comment straight. I urge you to take the opportunity now, as County Council member de Sykes said earlier about the hotel project, take the opportunity now to reroute the bicycle lane as'",
        "'speaker_3': 'our fellow Alameda. And over here from the from Grande Street Marina said let's move it closer to the water where it's a much more desirable and pretty place to to ride. But I do want to say that Clements Street is not wide enough to handle the increase in traffic, that it will occur over the next several years'",
        "'speaker_3': '. And let's be frank, there will be an increase in increasing traffic. Just because we have bicycle lanes doesn't mean that people will trade in their cars completely to take their bicycle. Alameda has several large building projects going on that are all being evaluated in isolation.'",
        "'speaker_3': 'We heard about the hotel project tonight. There's another 1200 units going on at South Shore, not to mention all of the construction that's going to happen on Clement Street. This will only increase traffic on Clements Street to make it a larger thoroughfare than it already is and a bigger truck Lane Park Street still will be heavily trafficked'",
        "'speaker_3': 'as it is today, and more and more people will use come street. Shoreline is dangerous now with a bike lane, busses are always straddling the line. So are vehicles hauling things. There are so many near-misses every day along Shoreline, and there was one this morning that I witnessed.'",
        "'speaker_3': 'Shoreline also is not very pretty. So we have the opportunity to out here. Please, let's take it.'",
        "'speaker_0': 'Here is.'",
        "'speaker_1': 'Robin, Olivia Kraft, Lorna, Sheena and Denise Trapani.'",
        "'speaker_4': 'Hello, my name is Robin Oliva Craft. Thanks for listening to us tonight. I want to speak in favor of the two lane to a bike lane. I experience the the wonders and safety of protected bike lane in downtown Oakland.'",
        "'speaker_4': 'A couple of years ago I lived right near the.'",
        "'speaker_5': 'New bike lane there.'",
        "'speaker_4': 'And it was a night and day difference. Biking to work every day. I bike on Clements Street every morning to go to the ferry, and this morning I also had a close call where somebody went. There was a large truck parked next to the sidewalk.'",
        "'speaker_4': 'I had to go around them. He almost doored me and the person who was passing me on the left went into oncoming traffic, kind of all in this same moment. So I, I strongly and in favor of bike lane on on Clements Street.'",
        "'speaker_4': 'People are already doing crazy things on that street. We should slow it down. We should make bicyclists feel safe on on that thoroughfare. And I have taken the taken Buena Vista, the official, I guess, bike trail. And that is as scary, if not scarier than the inclement.'",
        "'speaker_4': 'There's just a lot more traffic there. So Clement feels like a great a great spot to me to have this to a bike lane. And I'm super excited to be writing on really nice bike lanes all the way to the ferry every morning.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. I'm Ms.. Yes, Mr. Skinner.'",
        "'speaker_3': 'Good evening. I would like my name is Lorna Massena. I would like to start with thanking the.'",
        "'speaker_8': 'City Council and the.'",
        "'speaker_3': 'Mayor for acting properly and protecting the elderly and disabled. And I'll give you a let you know the good news that my father is.'",
        "'speaker_8': 'The case has been dismissed. So thank you very much.'",
        "'speaker_3': 'And speaking for the bike, it was a total surprise. I heard my fellow moms speaking about the bike lanes and I'm an avid bike rider and so.'",
        "'speaker_8': 'Is my son.'",
        "'speaker_3': 'He's turning 12 tomorrow and he couldn't be more excited to hear about the plan. Number two, as proposed by the city of Alameda. I like.'",
        "'speaker_8': 'The safety.'",
        "'speaker_3': 'Of the bike riding that we have on the shoreline. I can just send my son down and say go to school and he goes there by himself. I cannot say that for any other places in Alameda. And though we love the new Sweeney Park.'",
        "'speaker_3': 'It's gorgeous. And it would be so nice. It would be a dream come true for my son and I to be able to come all the way to Broadway and be protected. And that protection that allows bikers, especially small children, to ride safely.'",
        "'speaker_3': 'And making it impossible for the trucks and the cars to cross the line is very, very important. So if we want to increase safety for our children, and I think it's especially for our children, who we have so many schools and so many youngsters in Alameda that we should encourage to vote for the option number two.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'The last speaker is Rick Stewart.'",
        "'speaker_3': 'Thank you. Honorable mayor, vice mayor and council members. In preparation for speaking to you tonight, I wanted to understand what people's objections were to implementing the safest design. And on that portion, that's going to be a really critical component for the Cross Alameda Trail.'",
        "'speaker_3': 'So I actually read through all the publicly available comments that are linked to the staff report, and I can say we certainly have an engaged citizenry with a very opinionated citizenry. But after reading through all the comments and looking at all the objections, I was able to bucket them into three main area.'",
        "'speaker_3': 'One, there was concern for lost parking. Two, there was concern that drivers are going to have to slow down, check for and yield to people on bikes when they cross through the intersections and the driveways. And then three, there was concern by vehicular cyclists about being expected now to ride in a cycle track instead of the car'",
        "'speaker_3': 'travel lanes. And if you're not familiar with what a Hegelian cyclist is, it's somebody who, like me and a lot of other speakers tonight who are very comfortable riding their bicycle in car traffic. But unlike vehicular cyclists, we're advocating for safety for people who are not yet riding bicycles and who are not comfortable taking the travel lane'",
        "'speaker_3': '. So we're not advocating for the status quo, even though we're comfortable in it. We're advocating to get more people on bikes. So I was going to address each of the buckets, these three buckets of objections in turn. But then I read something that a very wise person wrote today in reference to the gun control issue.'",
        "'speaker_3': 'And this person said that you start with a clear goal and then you judge the worth and success of specific tactics to address that goal according to it. So instead of providing counterpoints to the three major buckets of objections, I'm simply going to ask you to stay focused on the goal, which is safety.'",
        "'speaker_0': 'Thank you, Mr. Venue. And that was our like one more speaker. Sorry, sorry, sorry. No.'",
        "'speaker_4': 'And it's Rick Stewart, property owner and Clement. We are super excited about all the improvements happening to the street. It's been a long time coming. We're very thankful for that. We're not in favor of the two way cycle track.'",
        "'speaker_5': 'Primarily for.'",
        "'speaker_4': 'Safety for riders at the intersections. I'm talking about.'",
        "'speaker_5': 'The drivers coming out of the new Marina.'",
        "'speaker_4': 'Project. Of course, Oak Park Street, specifically 10,000 cars a day. I agree that children are really at most risk here. Are they really going to know the controls at each of these intersections more? More importantly, are the drivers going to know these controls?'",
        "'speaker_4': 'There's going to be no right turn on red. That should be followed all the time. Maybe it won't. I can see large trucks turning right on to Clement from the Park Street Bridge entrance, not seeing a rider coming from the right at speed.'",
        "'speaker_4': 'And I think there's a potential for liability here. We're in favor of traditional bike lanes. Thank you.'",
        "'speaker_0': 'Thank you. And that was our last speaker. Okay. So thank you to all the speakers who came out and help inform us. And by the way, I like what somebody said. I think, Mr. Pannier, about an engaged citizenry.'",
        "'speaker_0': 'We do indeed have an engaged citizenry. And you you help us with your comments and I applaud you for all being here at this hour to inform us. So I would like to lead I'm going to look to my left because I've been looking to my right all night.'",
        "'speaker_0': 'But you don't have to lead unless you'd like to. I'm happy to. Councilmember Vela, mother of a new young child who I'm sure will be on the back of a bicycle before long.'",
        "'speaker_8': 'For the front or front?'",
        "'speaker_0': 'Yes, for riding you.'",
        "'speaker_8': 'So so thank you for all of our speakers coming out. I, I guess I should start by saying I spent most of my college years. I didn't have a car. I cycled everywhere. This was in Wellesley, Massachusetts, in Boston, Massachusetts, and and then in London.'",
        "'speaker_8': 'And I actually was hit by a car when I was in London. And you know how. And yet I've gone back to London and I still ride a bike when I'm there. And part of the reason is, in the past, I don't want to date myself here, but in the in over the decade since I was in'",
        "'speaker_8': 'school there, the city has evolved spectacularly as it comes to bikes. And the reason that they've evolved is because of the growing population in their urban center, trying to make it more accessible to all levels of income in terms of their commute and really recognizing what adding different cycle options can really do to the population in terms'",
        "'speaker_8': 'of getting people interacting, stopping. You want bike and pedestrian traffic. That means that you're going to have more foot traffic. It means that people are going to interact more. It means they're going to spend more time in their local community.'",
        "'speaker_8': 'And especially when you can't get public transit connectors, you know, subsidized enough really to expand to meet everyone you really need to allow for and protect cyclists as well as pedestrians, because it's how people can do that first and last mile.'",
        "'speaker_8': 'And here in Alameda, where we're a smaller geographic with a smaller geographic expanse, having a crosstown trail is is really important in terms of addressing some of the traffic issues that get raised, because a lot of times we can't really control the off island traffic.'",
        "'speaker_8': 'We don't have any control over the, you know, timing of the stoplights in Oakland or some of the regional connectors where we might have to we might be having a voice, a little bit of a voice, but we don't have the final say in those decisions here in town.'",
        "'speaker_8': 'What we've noticed and councilmember motorists used to always say this, you know, to monitor the traffic when schools in session across town and then monitor the traffic when schools on break and it's very different. The traffic flows and patterns are very different and there is a substantial need to allow our schoolchildren to bike to and from school'",
        "'speaker_8': 'in a very safe way. And part of that reason is because some of our crosstown traffic and the reason and our mayor mentioned this on the last agenda item is because you have parents like myself where we have to bring our children day care before we leave the island or we have to eventually I'll be dropping my'",
        "'speaker_8': 'son off at school before I had out of town. And eventually I'd like to get to a point where he can just ride on his own to school. I used to commute to school on my own, either on bike or by foot, and I think that that's something that we want to preserve and we need to preserve'",
        "'speaker_8': 'it as we have, you know, more different types of vehicles on the road. In terms of the. So I'll cut to the chase. I'm very much in support of option two. I think it's the safest thing and I think that safety needs to be paramount.'",
        "'speaker_8': 'And in terms of the decision that we make and I think the argument that it's unsafe for cyclists because people aren't looking both ways, part of the reason that there's different types of striping and painting is to signal and to indicate to folks to look in both directions and to identify that there is a cycle track there'",
        "'speaker_8': 'and to be to be cognizant and careful. I think the other problem is, is that, you know, we have speed limits in town that get blown all the time by by cars. I was you know, there was a mention about taking some of these alternate routes.'",
        "'speaker_8': 'Yes, there's alternate routes. But that's because we don't have.'",
        "'speaker_3': 'A.'",
        "'speaker_8': 'Full cross town trail that's protected as soon as we have that. All of those other options hopefully will fold into and recognize that the cross town. Trail, which should be the safest option. And that's really what we should be focused on.'",
        "'speaker_8': 'And I think that, you know, there was a time where we didn't have a lot of different other types of traffic markers. That's evolved over time, right? I mean, a certain point we had dirt roads with no signs and no stop signs and things like that.'",
        "'speaker_8': 'And, you know, people had to learn to kind of learn the new signals and adapt to them and respond to them. And I want to start training that behavior that when you get to an intersection, regardless of if you have a stop sign or, you know, a button that you press, that you that people need to stop'",
        "'speaker_8': 'and or go drive through the intersection with with care. As a as a mom who's out, I also think that this you know, I've noticed I take a walk at least once a day with my son and I'm pushing the stroller.'",
        "'speaker_8': 'And there's a number of children who still ride their bikes on the sidewalks on some of our streets. And that's because it is so dangerous. I see cars flying down Central Avenue. I live off of Central. And, you know, whenever I'm pushing the stroller and there's a kid coming down on the sidewalk, you know, and I just'",
        "'speaker_8': 'sit there and going, you know, if we had that crosstown trail, if we had that protected bike lane and that access, there would be room for the car. Yes, the car can still drive. They should be driving the speed limit, though, a safe spot for the child to ride his or her bicycle and then also a safe'",
        "'speaker_8': 'place for for the pedestrian for me to push my my son in the stroller and not worry about traffic coming in every which direction and whether it's on two wheels or, you know, or somebody a kid on a scooter or something like that.'",
        "'speaker_8': 'So I think that, you know, ironically, one of the first meetings that I came to was about our vision zero goals in terms of making sure that we were protecting everybody who's, you know, we want to eliminate those sort of risks.'",
        "'speaker_8': 'And as I left that meeting two blocks from here, I was on Oak and Buena Vista, and I got hit by a woman who was texting and driving and blew through a stop sign. And that's supposed to be one of our bike routes.'",
        "'speaker_8': 'And there was actually a cyclist who was would have almost been hit except for she fell into the bushes at the corner. And, you know, I think those are the types of situations that we want to avoid. And it worries me that we're trying to push people on these side streets where there's even less clear vision, less'",
        "'speaker_8': 'daylighting. It's very worrisome. And I don't think that's what we should be doing. And I think we need that crosstown trail. We need to make it as safe as possible. So I'm looking forward to supporting option two.'",
        "'speaker_0': 'Thank you. Vice Mayor Knox White, how about you going next? Hello. He's got a little delay. Yeah. It's an app.'",
        "'speaker_9': 'When you turn on.'",
        "'speaker_0': 'It's that. Is that difference in the time zone from here to Santa Barbara?'",
        "'speaker_3': 'Right. So I was waiting.'",
        "'speaker_9': 'For the city video to catch up. I got. Oh, thank you very much. Still enjoy. I think a lot of our speakers really understand the need for us to start creating usable space for the entire community of not just folks like myself who feel very comfortable away.'",
        "'speaker_9': 'I think traffic, you know, unfortunately, too often I think they can get it by Christmas cards. And really what we're talking about is helping people get around the city the way they want to get it right now. I think that's probably good option to which a good solid option.'",
        "'speaker_9': 'I can commit to our opening both telling folks that if we find an issue with delivering both and so we can talk about that parking on whatever else that would be needed to accommodate that at a future time.'",
        "'speaker_9': 'But, you know, this really doesn't have to be any one moment to a person then either. And I really appreciate the outreach that I'm prepared to do for the future plans.'",
        "'speaker_0': 'Thank you. Councilmember Dysart.'",
        "'speaker_6': 'Oh, yes. Some questions.'",
        "'speaker_3': 'For.'",
        "'speaker_0': 'Mr. Thomas.'",
        "'speaker_6': 'Yes. Currently the design of Clement, is it correct that on the north side of Clement, so the tool option too has a two way bike lane and then some parking and then road.'",
        "'speaker_10': 'That's right.'",
        "'speaker_6': 'Okay. So if we remove the parking from Grand Oak, who do we know off on the north side? Do we know off the top of our head how many parking? So if.'",
        "'speaker_10': 'You from Grand Oak, if you removed all the parking that we.'",
        "'speaker_6': 'Have on the north side.'",
        "'speaker_10': 'And just on the north side, it would be.'",
        "'speaker_6': '100.'",
        "'speaker_10': 'Okay. Estimates about 100.'",
        "'speaker_6': 'Okay. Yeah. The reason why I'm inquiring because I am I'm struck by the concern raised by the by speakers, I believe the deers, sister, sisters about the, the closeness of the boats that are that would be driving down.'",
        "'speaker_6': 'And if if there's a concern about boats, I suspect there will also be a concern about trucks. So the question then is can we free up capacity or space so that yeah, I would throw that out there that that may be that would be a way to.'",
        "'speaker_10': 'It's it's certainly something that the council could consider removing the on street parking it's a it's a rather big.'",
        "'speaker_6': 'Most of the thing currently on the north side is Paul industrial in a lot of the part a lot of the parking is on the parcel.'",
        "'speaker_10': 'You know that's that's true in the current situation. That's right and there you have that whole stretch by the US is that the Navy facility where there's just no parking at all. Yeah. Part of driveways are limited on the north side.'",
        "'speaker_10': 'So it's, that's why we put the cycle track on the north side. Did you want to miss pain?'",
        "'speaker_3': 'Good evening. And a mayor and city council. Gail Payne, Senior Transportation Coordinator. We did that same analysis back in 2015 because we had the same question by the Transportation Commission and what it showed is the parking occupancy exceeded 100% in that area.'",
        "'speaker_3': 'So that's that's what it would cause is just an excess demand in parking.'",
        "'speaker_6': 'But it would still free up.'",
        "'speaker_3': 'Space right.'",
        "'speaker_6': 'To see concerned like like the deer sisters are about moving boats or or if you're concerned about trucks. The other the other thing to think about is when you think about the the other parts of the bicycle, whether coming from Alameda point I mean it's completely protected over there.'",
        "'speaker_6': 'It's going through Jean Sweeney. It's completely protected. I mean, so we might as well go big and make, you know, the north side completely protected to bye bye by not allowing parking on the north side of of Clement Avenue.'",
        "'speaker_6': 'Well, I mean, I'm just Dana. Yeah. Just trying to figure out how to accommodate the concerns raised by two thoughts.'",
        "'speaker_10': 'One is the parking lane provides a lot of that protection. I mean, that's that is that is a row of parked cars providing protection for the two way bike lane. Number two is, you know, 11 foot travel lane is a standard width of a lane in a truck route.'",
        "'speaker_10': 'So every UPS truck, every major truck, I mean, that is what is a very standard lane when two of those trucks are coming to each other. Close. And it's I mean, there's going to have to be some slowing that goes down.'",
        "'speaker_10': 'It comes about so that the trucks pass. But there isn't an issue of I mean, that's that's a very standard lane width for trucks.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'I guess the other thing is I think there's a bit of an elegance there, though. If you have the north side of Clment just dedicated to to the to two lane option, to bike lane option without the busyness of of the other cars parked right next to it.'",
        "'speaker_6': 'And I think that might deal with the issues raised by some about people making traveling westbound on Clement and then making a right turn. I don't know it's it's something you know, it's something to think about. Some residents have raised some concerns.'",
        "'speaker_6': 'And so let's kind of think outside of the box and try to, you know, juggle all the balls.'",
        "'speaker_0': 'Thank you, Councilmember Desai, Councilman Brody.'",
        "'speaker_2': 'Thank you, Madam Mayor. Thank you, everyone who came out. And thank you, Andrew, for your work on this. And thank you, Gail. Also, I think I said this last meeting because we had a bike discussion, but my first venture into public service, I was 16.'",
        "'speaker_2': 'I was on the Bicycle Safety Council in Finley Park, Illinois. So to me, the most important thing for me is safety. So and and I don't think there's any question that design number two is the safest. I just want to add a couple of things.'",
        "'speaker_2': 'I do think that, you know, this is not the end of our bicycle infrastructure. There was a comment made by somebody that, you know, we don't have the bicycle infrastructure they have in Europe. That's right. But, you know, we're we're not going to stop it.'",
        "'speaker_2': 'Well, in an ideal world, we wouldn't stop at Central and Otis and Shoreline and Clement, you know, every every four lane road, I think, is a candidate for a road diet and a candidate for protecting bike lanes. You know, in an ideal world, you know, we would have, you know, these these spaces at the corners where people'",
        "'speaker_2': 'could see and not crash and not be blind, blinded, and we would have bike lanes. I mean, that that's an ideal city. And somebody mentioned it and I think I've said it before, and the vice mayor said it before these streets were not built just for cars.'",
        "'speaker_2': 'In fact, bikes came before cars. So cars do not have a 250 year history of being on our streets. They have probably the least history of anybody that that shares our streets. So I think we have to be cognizant of that.'",
        "'speaker_2': 'You know, anything that helps slow traffic down, you know, is a good thing for me. I don't I don't look at that as a negative. I look at that as a positive. And we have to make sure that, you know, not only our you know, I think our our newcomer, James mentioned, you know, young children.'",
        "'speaker_2': 'You know, my daughter turns 30 tomorrow. Not that well, young to me, I guess. But, you know, I worry about her, too. You know, I worry about, you know, people like Denise, even though she's an expert, you know, I worry about everyone who's on a bike that, you know, there's going to be going to be safety concerns'",
        "'speaker_2': '. So this is the safest thing to me. And, you know, I don't want to get preachy from up here because there's always that temptation. But we got to be able to learn how to share the road with people.'",
        "'speaker_2': 'So a lot of these concerns about, you know, this this business or that business, you know, has too many cars, you know, by Park Street or whatever. I mean, they got to learn how to how to share the road.'",
        "'speaker_2': 'Truckers have to learn how to share the road. People that pull by boats on their trailer have to learn how to share the road cards have to have to learn how to share the road. Bicyclists, you know, they do a good job, but, you know, they need to learn how to share the road also.'",
        "'speaker_2': 'So let's all just kind of be respectful of each other when we're commuting, when we're driving, when we're taking our bikes, when we're walking and anything that gets gets us to safety and, you know, vision zero I'm all in favor of.'",
        "'speaker_2': 'And nice shout out for Wellesley there. That's Sarah, Sarah's alma mater.'",
        "'speaker_0': 'Thank you. And happy birthday to Sarah. If it's Sarah. So thank you, everyone, for for being here, for all your good input on whatever side of this issue you came down on. Once again, the Council is called upon to balance some competing interests.'",
        "'speaker_0': 'And I do understand and hearing from the business owners along Clement that you're concerned with your businesses, that's one concern we balance. I think there's ways to address that short of just not doing a cycle track on Clement and making it part of the cross Alameda Trail.'",
        "'speaker_0': 'Um, and what I also see is that it's a, this is an exciting time to be in Alameda as every year I see increased bicycle pedestrian facilities throughout our city and I see more people using them, including families with young children, people commuting to work, people getting their groceries, dropping kids off at school and preschool.'",
        "'speaker_0': 'We want to make the the streets safe for them. We don't want any more accidents like Mr. CUSUMANO survived. And so this is one way to do it. And I think Councilmember Vella said as much that people can learn new habits.'",
        "'speaker_0': 'I grew up in the city and yes, I rode to school. I rode everywhere. My parents worked. And that's how I got around. It was the population was probably a little bit bigger because the Naval Air Station was in full swing in those days.'",
        "'speaker_0': 'But times changed. People did not own two cars and didn't drive everywhere. So now I still ride my bike. But I very much appreciate when I get to ride on streets where there are bike lanes or better still, dedicated cycle tracks.'",
        "'speaker_0': 'And I heard it mentioned that we do all these new developments and we consider them in isolation. I want to correct that misinformation. Not true. And let's just for a minute talk about the 1200 residences planned for Castro Center.'",
        "'speaker_0': 'Okay. You might have gone to a presentation. You might have seen a story in the newspaper. To the best of my knowledge, those plans haven't even been submitted to the city. So there is there is a gap between what you read in the newspaper and what actually comes to the city and goes through a long planning process'",
        "'speaker_0': '. But if and when that development comes to the city, just like every other residential development that comes to the city for consideration, it will be considered in conjunction with all the existing developments. We know where new units are going in, and that's all that all goes into the environmental study, the impact, the traffic impact of new residences'",
        "'speaker_0': ', new residents. We and we know that not everyone is going to be a bike rider, but we know that every year more and more people, and especially some of our newer, younger residents, are opting to have no car or one car or do most of their travel by bicycle.'",
        "'speaker_0': 'And as one of our speakers said, even if you don't ride a bicycle, you benefit from those who do, because that's one less vehicle on the road that's cleaner air. And if you are the bicyclist, I don't have to tell you all of the benefits.'",
        "'speaker_0': 'And I want to see more kids riding to school because it will help cut down on our traffic during school hours. It's good for kids to get that exercise. It helps them develop independence. But I think as elected leaders, we have an obligation to make sure that our residents are traveling around the city in as much safety'",
        "'speaker_0': 'as we can provide to them. And I will be quick to say, we all do need to slow down in town and observe the the speed limit. So I am very excited about this project. I commend staff for doing a great job and it's gone through many hearings, lots of public comment and I am ready to support'",
        "'speaker_0': 'this. The, the Transportation Commission's recommended design concept for a two way bikeway on Clement Avenue. And if anyone would like to be the first to to make a motion, I would be happy to entertain it.'",
        "'speaker_2': 'I'll do that.'",
        "'speaker_0': 'Okay. Yeah. Vice Mayor Knox, is that you? Yes, sir. I prefer to get a motion.'",
        "'speaker_9': 'I would like to just. I beat him to clarify one thing, please. That your staff is opposed to their lane with the 7-Eleven feet, the Golden Gate Bridge lane and all the rest of the lanes on that bridge are ten feet there.'",
        "'speaker_9': 'There is no concern to me is not a 25 mile an hour street that has not been built for Trump. So it's not a machine that can get left out that somehow there might be a truck concern here.'",
        "'speaker_9': 'We have literally built our building a common street that has built a freeway standard for trucks. With that, I would like to improve on the option to our recommendation from the transportation hub.'",
        "'speaker_0': 'I will happily have you second the motion. Your colleague, Councilmember Odie made the motion and thank you for the clarification on the lanes. And so we have a motion is second we'll have discussion.'",
        "'speaker_6': 'Councilmember Desai I'd like to make an amendment to it that we that we go big and that we not do that. We disallow parking on the north side of Clement Avenue from Grant Street to Oak Street in an effort to free up capacity to deal with concerns raised by some of the businesses and some of the residents'",
        "'speaker_6': 'about having enough with.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Are you making a substitute motion? Yeah. Do I have a second? Hearing, then that motion fails for lack of a second. Okay, any further discussion? Councilmember Vela? Councilmember Vela, then Vice Mayor Knox White. Sorry, I didn't see your hand up.'",
        "'speaker_8': 'I think that I think that the vice mayor made this point earlier, which is as the ne you know, if there is a need that develops, we can always look at potentially removing parking and it might not be in that whole stretch, it might be in certain sections of it or where needed.'",
        "'speaker_8': 'And I think, you know, I think if that comes up, I don't know if staff needs additional direction along that line, but I would be supportive of and I think this is still developing in terms of that aspect of it.'",
        "'speaker_8': 'What we're approving tonight is going with the option that would allow that. The the track itself, it doesn't have to do with the specifics as to parking.'",
        "'speaker_0': 'Does staff want someone from step one to affirm that.'",
        "'speaker_10': 'Will be what the motion is set forth? We will continue the design process. Right? We will be coming back to you for the ultimate construction contract. That would be that would be an opportunity for you to yank out the parking at that time.'",
        "'speaker_10': 'Or we could build it or you could build it and then at some future date decide, hey, we really want to pull out parking. I mean, it's that would not be hard to do later if you wanted to.'",
        "'speaker_0': 'Okay. And vice mayor, not quite sure.'",
        "'speaker_9': 'So just by voting yes on the motion tonight with the idea that we should come back and discuss the design of this project when we have a contract moving forward, my my my idea was that if after we implement that identified, we can make those changes.'",
        "'speaker_9': 'Right. But I do want to just kind of move by why why I would not support removing more parking for main with this is a safety project so we know that the number one thing we can do to maintain the flow of traffic down to the travel that our speed limit and the one thing that we can'",
        "'speaker_9': 'do to actually have that is narrow lane. So the idea that we remove the parking, turn away from the vehicle and drive down, come in 40 miles an hour, is actually counterintuitive, but in the project it will be a much more expensive project to maintain speed.'",
        "'speaker_9': 'It will remove all that parking vehicle, the infrastructure, and keep it going in order to continue to maintain the speed.'",
        "'speaker_0': 'Thank you. Okay. Councilmember Desai, then councilmember like.'",
        "'speaker_6': 'You in my final 6 minutes. I do want to say that this is a very exciting project. I mean, the idea that we're going to link from one end of one end of Alameda to the other in a unified bike project.'",
        "'speaker_6': 'I think what would make it more exciting, though, is if we took the time to remove some of the parking on the north side of Clement Avenue. And I hear what Vice Mayor Knox White is saying, that engineering wise, that maybe there are some issues there regarding speeding.'",
        "'speaker_6': 'But, you know, I think that comment, I think saying among the traffic planners is that it's not just about engineering, it's also about enforcement. I mean, if we know that that we have a problem there, then even even with adopting the engineering that you have, you're still going to have fast moving cars.'",
        "'speaker_6': 'Are you going to tell me that there aren't fast moving cars on Shoreline Drive as as skinny and tight as that is? Come on. So we're missing an opportunity, again, similar to what I said earlier during the discussion about the hotel, we are once again missing an opportunity to work with residents when there are some solutions, easy'",
        "'speaker_6': 'solutions in front of us. At the end of the day, if we remove the parking on the north side of a claimant, it's no skin off the back of anyone. I mean, certainly there might be some businesses on the north end, you know, such as the military depot that might be concerned.'",
        "'speaker_6': 'But by and large. Five years from now, seven years from now, when the development occurs, you're not going to be able to remove those cars in an effort to deal with any safety issues that they arise that might arise at that time.'",
        "'speaker_6': 'Let's deal with it now. You've got this rare opportunity. You've got this rare opportunity to make this elegant, protected bike path, two way bike path that stretches from the seaplane lagoon all the way down to Park Street and even beyond that.'",
        "'speaker_6': 'So I would really encourage us to really pursue that. I think if we don't do it, I think it's a missed opportunity. I think. I think this project is a great project, something that that aluminum can get around.'",
        "'speaker_6': 'But I think we can all get around. But I think we can even make it better. And so I'll just leave my comments on that.'",
        "'speaker_0': 'Thank you. Before I go to Councilman Brody, you raised the shoreline cycle track and traffic on Shoreline Drive. And in fact, if you were to ask the police department, they would tell you that the average speed has reduced significantly on Shoreline Drive since the cycle track went in, as have the number of vehicle collisions.'",
        "'speaker_0': 'Councilmember Ody.'",
        "'speaker_2': 'So in my last 6 minutes, I'm joking. I saw the ground out there.'",
        "'speaker_0': 'Slowly, Mike.'",
        "'speaker_2': 'I'm not going to use all of it. I mean, I think there's some merit to the idea of reducing parking because, you know, you reduce parking. You kind of encourage people not to drive as much. But, you know, as the vice mayor said, if we're building a freeway standard lane anyway of 11 feet, then, you know, I'",
        "'speaker_2': 'would not be in favor of reducing parking to add wider lanes. But if you know, that comes up later, you know, it's an interesting idea. The only thing I want to make sure and I think the vice mayor kind of touched on it, you know, I don't really want a repeat of central with this where we're going'",
        "'speaker_2': 'on and on and on and rehashing and rehashing and design, you know, and it just doesn't get done. So I want to make sure that that's part of the motion that this gets done and we're not coming back for every little thing.'",
        "'speaker_2': 'So I don't know if, you know, I was the maker of the motion. I'd be happy to amend it. But I know what we need to say in there. But or maybe we just have to say it needs to get done.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'We don't need to be debating this in five years.'",
        "'speaker_0': 'And just because I hate to mislead the public, we Central Avenue is getting done. It's just a little more complicated because of the state highway bridge. But I see Payne nodding earnestly. That's another report for another time. But Mr. Thomas.'",
        "'speaker_10': 'I hear as the motion, I think they're so emotional floor is they move forward with the design as drawn with the 11 foot lanes keeping keeping the parking in. I'm as a planner. I got excited also about, you know, let's go big.'",
        "'speaker_10': 'But if it means if the intent is to stray 15 foot travel lanes, that's that's because we got rid of parking that is counter to what staff has been recommending. So that's why I think and to go move this project forward and keep it moving, it is very helpful for the Council to give us very clear direction'",
        "'speaker_10': '. This is what we want so that we will just tell our designers, draw that up and let's keep moving fast. And we don't have to keep second guessing ourselves as to what our design is.'",
        "'speaker_0': 'Councilmember So be.'",
        "'speaker_6': 'Clear, the lanes can still be 11 feet wide or 12 feet wide. All. All what we're doing is just putting a little more cushion between the north side and the and the north lane. There's still 11 feet. It's just now there's more cushion by virtue of not being a lane dedicated to parked cars.'",
        "'speaker_3': 'It's.'",
        "'speaker_0': 'Thank you. Okay. Thank you. So we have a motion. We have a second. We're going to do a voice vote.'",
        "'speaker_6': 'Councilmember decides I'm going to support this project because I think the larger objective, you know, I think this is good for Alameda, the details of the parking. I think we'll have to leave that for another day night flight.'",
        "'speaker_1': 'I only I.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'As I.'",
        "'speaker_0': 'All right. That motion passes unanimously. Thank you, everybody, for coming out. Remember, we just go, yay! And then we move on to the next item. But thank you all. Good job. You can go high five in the hall.'",
        "'speaker_0': 'We are moving on to remember my goal is to get us home the same night we started. And so with that, we move on to item number seven, City Manager, Communications.'"
    ],
    "Town Hall Event and Subcommittee on Gun Violence.": [
        "'speaker_1': 'Consider addressing gun violence by sanctioning a town hall event on October 14th and creating a subcommittee to organize the event and create policy options for council discussion. This item was placed on the agenda at the request of Vice Mayor Knox White and Councilmember Odie.'",
        "'speaker_0': 'Okay, so which of you wants to take the lead? Okay.'",
        "'speaker_2': 'I could start.'",
        "'speaker_0': 'Okay. Councilmember Odie.'",
        "'speaker_4': 'I'm sorry. Public comment. I thought that was nice.'",
        "'speaker_0': 'So I'm so sorry. Had you not turned into speaker slip.'",
        "'speaker_1': 'You want to speak on the side of what they discussed?'",
        "'speaker_0': 'So did you want to speak on an item? Not on the agenda or on this one?'",
        "'speaker_4': 'This one.'",
        "'speaker_0': 'Okay, so we will have the item introduced and then we will have an opportunity for speakers. The item I called before, as we always give an opportunity for people who want to talk about something that's not on the agenda.'",
        "'speaker_0': 'And we didn't have any speakers on that. Okay. So we're in good shape. All right. So Councilmember.'",
        "'speaker_2': 'Odie. Oh, good. Thank you. So I think all of us recognize that gun violence is a public health epidemic. And to that end, the vice mayor and I are hosting a town hall. And so far we have a representative, we have our assembly member, Mr. Bonta, our state senator Nancy Skinner, and our district attorney, Nancy O'Malley speaking'",
        "'speaker_2': '. You know, we're still working on other speakers, but our our goal out of this is to have a conversation on how we can best address this issue of gun violence, because it seems like every week somebody dies, somebody dies because somebody has an assault weapon.'",
        "'speaker_2': 'And if we say our thoughts are with you, that's not going to solve the problem. If we continue to just say platitudes, that's not going to solve the problem. And people are asking for action. And what the goal of this town hall would be to identify what specific actions we could do as individual citizens, what specific actions'",
        "'speaker_2': 'we could do as as a city, because there are some restrictions, but there are things we can consider. And then ultimately out of this would be, you know, maybe a laundry list of items that could be presented to the council that we could discuss and decide if we wanted to take any action on any of them.'",
        "'speaker_2': 'Like I said, there's a lot of state preemption, but there are there are things we could also do at the state and local level, like sponsor bills and make it make sure that, you know, maybe we give direction.'",
        "'speaker_2': 'I'm not saying we do this tonight, but one of the options could be, you know, we decide our federal lobbyist sponsors a bill in Washington or in Sacramento. So, you know, we'd like to have the city's blessing and, you know, be able to, you know, well, everyone's invited anyway, but, you know, agenda is it and allow staff'",
        "'speaker_2': 'to spend some time working on it and making sure it's very productive. But you know, what I hear from everybody that I talked to is that enough of the inaction? So we're going to take action. We'd like support.'",
        "'speaker_2': 'And I think this is a topic that's very timely. And I will kick it over to the vice mayor to add anything that he wants to add.'",
        "'speaker_0': 'Vice Mayor Knox, why did you want to add anything? No, I think.'",
        "'speaker_9': 'It was a fabulous summation.'",
        "'speaker_0': 'Thank you. Any questions from council before we hear from our public speaker? Okay. And we have one public speaker in Salem, Gordon Terrace, please.'",
        "'speaker_4': 'Hi. I'm Gordon Terrace.'",
        "'speaker_0': 'So if I could get you to speak right into the microphone, everyone will be able to hear you, including those who are watching on television.'",
        "'speaker_4': 'Okay. I'm Gordon Terrace. I'm a citizen here at Alameda. I was also a four year all-American rifle shooter in the NCAA ways and a candidate of the 84 Olympics. I would like to volunteer to help you in any way we can.'",
        "'speaker_4': 'Shooting is an Olympic sport. There are men, women, coed, individual team and Paralympic options. It's also an NCAA sport. Shooting provides scholarships and about 30 colleges and universities around the country. It is a coed sport and some teams are women.'",
        "'speaker_4': 'All me. As I said, I'm a I'm already a product of an NCAA program. It's a sport of mental discipline and fine motor skill. It's also a sport where men and women compete equally and where accommodations are built in to enable handicapped people to be equally.'",
        "'speaker_4': 'It is not a sport that selects primarily on physical power. Is a sport available for people who don't have access to other sports? As the coach of the local junior rifle team. My goal is to provide opportunities for youth in their prep years to prepare for college scholarships and Olympic opportunities.'",
        "'speaker_4': 'Our current state laws hinder our ability to provide that service. So I would like to participate to make sure unanticipated consequences of our actions don't hinder opportunities for people to also have their own opportunities. So that's why I want to volunteer to help.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Okay, let's open this up to council discussion. Councilmember Vella, would you like to start?'",
        "'speaker_8': 'Yeah. So I think that unfortunately, the issue of gun violence has been a fairly timely and relevant kind of ongoing for the for the past few years due to the number of mass shootings that we've had and in in this country.'",
        "'speaker_8': 'I do also I guess my my question is, um, we have had some town halls. In fact, I think the Mayor and I both participated in one, um.'",
        "'speaker_0': 'The Episcopal Church.'",
        "'speaker_3': 'Here.'",
        "'speaker_8': 'And so I am kind of cognizant of, or a little wary of kind of reinventing the wheel. And I do know that we've also sponsored or not sponsored, but supported a number of different bills that have been carried, I think, both federally and statewide.'",
        "'speaker_8': 'So I guess my question is, um, you know, kind of getting out and you talked about this a little perhaps having some, you know, coming back with some suggestions or something like that. There was a there has been kind of a very involved conversation with community leaders, and I would hate to kind of throw that out and'",
        "'speaker_8': 'start all over again. So I guess my question is, what's the context of this meeting? I think the issue of addressing gun violence is fairly broad. And you mentioned that there's going to be a number of different, you know, elected officials from various levels.'",
        "'speaker_8': 'So obviously, there's a limit to what the city can do. So I guess my question and I think also when we had the town hall that we participated in, there was a long like a long laundry list of kind of the regulations that we currently have in Alameda.'",
        "'speaker_8': 'And so I guess I'm just wondering what the the goal for this meeting is as it relates specifically to the city and then who from staff would have to be involved if we're sanctioning it, if if that's the request.'",
        "'speaker_0': 'And then if I could just. I didn't mean to cut you off. Do you think so? Um, I do know, because I've been signing a lot of letters lately, and. And I think the council is aware to that.'",
        "'speaker_0': 'Well, starting with the, you know, there was that cluster of three mass shootings all at once. And Gilroy, California was one of them. And I think El Paso, Texas and Ohio. Dayton, Dayton, Ohio. And so the U.S. Conference of Mayors, of which I am a member, it's the mayors of medium and large cities where Medium City sent'",
        "'speaker_0': 'out a letter or asked for mayors around the country to sign on to a letter urging. This was during the the summer break some. A recess of the Congress, but asking Mitch McConnell to call the Senate back into session to take up gun safety legislation.'",
        "'speaker_0': 'And so today, 281 of us mayors have signed on. And to date, Senator McConnell has refused to take any action. But one thing I often tell people is that we do live in California, which has some of the most progressive gun safety legislation in the country.'",
        "'speaker_0': 'We really are a model to other other states. And and we've got a great attorney general in Sacramento who's taking on the administration in DC on a regular basis. But we do have a legislative agenda that the council approves.'",
        "'speaker_0': 'And I just want you to know that just this legislative session we have authored support letters to committee chairs, Senate Assembly and Senate floor alerts, and authored support letters to the governor on 11 state gun control reform bills.'",
        "'speaker_0': 'And I'm going to go over them really quickly. AB 12 extends the duration of an issued gun violence restraining order from one year to a period of 1 to 5 years. Abby, 61, allows an employer or coworker or an employee or teacher in a post-secondary school to file a petition requesting a gun violence restraining order.'",
        "'speaker_0': 'ab1 64 prohibits an individual subject to an out of state restraining order injunction from possessing, receiving, purchasing or attempting to do all of that of a firearm in California. If the out of state order is equivalent in its prohibitions, AB 339 requires law enforcement agencies to develop and adopt policies and standards regarding the use of gun violence'",
        "'speaker_0': '. Restraining Orders. AB 340 Identifies Best Practices, New Strategies and recommendations for reporting requirements of gun violence reduction. Pilot programs in Alameda County is one of the participating counties. AB 879 requires the sale of firearm precursor parts to be conducted through a licensed firearms precursor part vendor.'",
        "'speaker_0': 'AB 1297 requires requires rather than authorizes a city or county licensing authority issuing a concealed firearm license to charge an applicant a sufficient licensed processing fee and deletes the current $100 fee. AB 1493 authorizes an individual who's the subject of a gun violence restraining order to petition to the court voluntarily relinquishing his or her.'",
        "'speaker_3': 'Firearms.'",
        "'speaker_0': 'Rights. Believe it or not, that doesn't exist. Currently, AB 1669 applies the same gun show regulations that apply to firearms dealers, to ammunition vendors. SB 61 prohibits a person from applying to purchase more than one firearm of any kind within any 30 day period, and specifically prohibits the application to purchase more than one long gun within a'",
        "'speaker_0': '30 day period unless the person has a valid hunting license. And beginning January one, 2021, prohibits the sale of a semiotic semiautomatic rifle to persons under the age of 21. S.R. 61 urges the United States Congress to enact an assault weapons ban following recent mass shootings.'",
        "'speaker_0': 'The city also supports federal gun control legislation, including H.R. 11, 12 and S 42, which would provide stronger background checks for gun purchases. As Councilmember Odie noted, cities are limited in what we can do. And by the way, i.'",
        "'speaker_0': 'R Assembly member Rob Bonta is the author, coauthor of I think a couple of the pieces of legislation I just read. I'm also concerned with duplicating staff efforts. We are sending our staff in a lot of different directions to staff various events.'",
        "'speaker_0': 'I'm wondering if there might be a way to possibly fold the idea use. First of all, I would certainly not say that we have just been issuing platitudes. I think what we are doing is encouraging stronger legislation, even at the state level and certainly at the federal level, because we can have the most progressive gun laws in'",
        "'speaker_0': 'the state of California. And as with the Gilroy shooting, that individual purchased his gun legally in the state of Nevada and brought it into California. So we need to also lobby for stronger federal action. We, of course, are blessed with some of the most progressive federal representatives in in Sacramento, in Washington, D.C., but nonetheless, coming up.'",
        "'speaker_0': 'In November is the United Against Hate campaign that is Bay Area wide, probably beyond the Bay Area. Actually, the week of November 17 to 22 community members are encouraged to participate in events, to raise awareness, to spark actions, to stop hate bird inclusion.'",
        "'speaker_0': 'Gun violence is among the topics that would be considered, and some of the innovative ideas are sponsoring a movie viewing. And there's there's a whole list of potential movies and book clubs. There's there are some books that are very, you know, innovative, inspiring to to read and kind of unite readers around these topics.'",
        "'speaker_0': 'And I'm wondering if there might be room to perhaps get council member Odie and Vice Mayor Knox White. Do you want to perhaps fold what you're trying to do into this united against hate campaign? And then I do also want to hear from Councilmember de SAC and Councilmember Vela.'",
        "'speaker_8': 'Yeah. And I had the question about, I guess, who from staff are they looking okay, work on this. And then also there was significant work done by Christ Episcopal Church members of the congregation. I think Sarah and Eleanor and Galen and Galen, there was another faith leader that worked on it.'",
        "'speaker_8': 'And so there was a lot of work done by them also to kind of review the status of kind of where we are from at the state level, where we are at the federal level. And then what Alameda specifically has done and Police Chief Ray Larry also participated in that panel and also did a significant amount of'",
        "'speaker_8': 'work and research in terms of kind of outlining all of the things that that we've done throughout in time as a city. And so I think part of it and if if the goal is to kind of maybe take all of that work that was done and kind of share it to let people know, hey, this is'",
        "'speaker_8': 'what Alameda has on the books currently in terms of our legislation and our ordinances, so that people aren't kind of just throwing ideas out there without necessarily understanding the foundation and framework for what exists. And I don't want to I also think that it's important and this was important work that was done, and I want to highlight'",
        "'speaker_8': 'this. It was done by a very, very active and involved group of women. And I, I don't think that this was an intentional thing of kind of just ignoring the work that was done. But I think oftentimes this work gets done and then sometimes we lose the fact that it happened just because time has passed, but it'",
        "'speaker_8': 'doesn't mean that it doesn't exist or that it wasn't done. So I just want to make sure that we recognize it and find a way to fold that in if we do move forward. And I like the idea of combining events to.'",
        "'speaker_0': 'Okay, I can't find.'",
        "'speaker_2': 'A lot to unpack there. I think I was accused of ignoring work that was done because it was done by women. So that was a little offense. I was a little offended by that.'",
        "'speaker_0': 'Okay. Why don't we just stick to the topic at hand?'",
        "'speaker_2': 'No. Well, I mean I mean, I will say I mean, as far as the staff, I mean, we have no I mean, I don't want to speak for you, John. You could jump in. I mean, I don't think we have any problem building on the work that someone else has done.'",
        "'speaker_2': 'And the whole idea of what the city can do and can't do. I mean, that's where we would involve the city attorney's office. And then, you know, there might be some publicity assistance, you know, with social media and, you know, fliers or whatever and, you know, maybe a little noticed thing.'",
        "'speaker_2': 'I mean, it wasn't we didn't intend on this to be a full blown staff thing. And, you know, I listen to that. And I got to ask, what affected that letter that you sent to Senator McConnell? Have nothing.'",
        "'speaker_2': 'And that's what people are sick of. People are sick of writing letters and getting nothing done. They want us to do something. And this is our opportunity to do something. Now, we don't exactly know what that is, but I can tell you, sitting around and reading a book and having a book club, it's not going to stop'",
        "'speaker_2': 'people. We there was a comment made that we had the strictest gun laws are the best gun laws in in the state or in the country. But then Gilroy still happened. And that work that all those people did a year ago, it's just sat on the shelf.'",
        "'speaker_2': 'Nothing has been done at the city level to promote it. Nothing has been done to publicize it. People on social media don't even know it's out there. And this is something this is a public health crisis and we need to act on it and we need to do something as a city.'",
        "'speaker_2': 'And then I heard a comment that we had the best gun laws, but then there was 12 rattled off. So if we had the best gun laws, there wouldn't have been 12. Really good idea. Years that came out of this year's legislative session.'",
        "'speaker_2': 'So there still is an opportunity for us to work on solving this crisis and solving this problem. And I appreciate the offer of assistance from the gentleman who spoke. But, you know, reading books and writing letters that go nowhere are not going to stop people from getting killed.'",
        "'speaker_2': 'I mean, to be brutally honest with you, it's going to take people doing something and they're looking at us, their leaders, to do something and to sit up here and, you know, have the idea kind of dismissed. You know, I think it's offensive to all those people that are out there looking looking at us, looking at us'",
        "'speaker_2': ', their leaders, to stop the talk, stop the thoughts, stop the letters, stop the prayers and actually get something done.'",
        "'speaker_0': 'So I just want to interject a thought here that no one was accusing you. I'm quite sure, of ignoring ideas put forth by women that women do do a lot of good work. But amazingly, as far as as far as Mitch McConnell and Councilmember O'Day, you've been around politics as long as I have.'",
        "'speaker_0': 'And you worked at the state level. I think we both know that it's going to take a change in in Washington, some some election changes and some time excuse me, still talking, still have the floor. Sometimes the key among those 281 mayors were Republican mayors and sometimes Republicans.'",
        "'speaker_0': 'Listen to Republicans. I mean, I'm from California, but nonetheless, I wanted in I knew my council wanted us to be counted in that letter. I was not suggesting that we just sit around and read books, but I am unclear on the concept of what you're proposing.'",
        "'speaker_0': 'You're saying that just talking isn't going to make a difference, but I think a town hall involves talking. And as far as the laws in California, it's hard to measure a negative. But I do believe that our laws have made a difference, and I think we could both agree that even good laws can be improved upon and'",
        "'speaker_0': 'can be supplemented. And I think this is one of those areas that we don't need to pit one another against each other. I think we want to work collectively toward a solution. But I, I am just I'm mindful of staff time.'",
        "'speaker_0': 'I'm wondering if we could, you know, merge events because I think the United Against Hate campaign that's been around a few years is a worthy one. But with that, I see that Councilmember Desai hasn't been heard from yet.'",
        "'speaker_6': 'Well, thank you. It seems as though, you know, two sets of council members are extremely energized, and rightfully so, by the subject matter of dealing with gun violence. You know, I think within the purview of the Brown Act, I think there's room for for the different council member sets of council members to pursue the issues in.'",
        "'speaker_6': 'I mean, perhaps once one set of council members might deal with gun use intervention, you know, design policies and local policy and strategies regarding gun use intervention. And, you know, we we hear so much nowadays about, quote unquote, red flag.'",
        "'speaker_6': 'I don't know if that's the right word. Another set of issues that, you know, a councilman set of another set of council members might be interested in a set of policies regarding gun violence prevention, which has that hold dear, has a whole other set of and I think within the world of the Brown Act, I think it'",
        "'speaker_6': 'could be accommodated or not. You know, we'll have the city attorney tell us one way or another. So I think, you know, keep those those options open. You know, there's a lot of different sector by which you can approach this.'",
        "'speaker_6': 'Um.'",
        "'speaker_0': 'So Councilmember Villa.'",
        "'speaker_8': 'I guess my might ask is how is this different from the town hall or how is it going to incorporate how is it going to incorporate the work that was done? Because we did do an accounting of kind of the steps that the city itself has taken.'",
        "'speaker_8': 'And I think that's why I'm asking what's the what's the question that's being asked? We can have a town hall, we can have a meeting at any time. And and what we found, I think, at the meeting that we had was there was a lot of Q&A that happened.'",
        "'speaker_8': 'And it wasn't just one meeting. There were follow up meetings that occurred that both the mayor and I attended and that I believe Police Chief Hillery also attended. And so I think that, you know, if it's looping in additional people, I mean, that was a packed room.'",
        "'speaker_8': 'It was a huge crowd that came out over.'",
        "'speaker_0': '100 on like a monday night competing with Monday night football.'",
        "'speaker_8': 'Right. So I think, you know, if it if it's to build off of of that or if it's I think, you know, if you're talking. About, you know, having a forum where people can come and talk to their state legislators to say, what's the state of California doing?'",
        "'speaker_8': 'I heard you mentioned that. I think I'm just trying to understand what the what the goal here is. You're saying it's it's to not just talk about it. But I also understand that there is a limit to what the city can do.'",
        "'speaker_8': 'And I think we tried to do kind of an accounting of what we have done and if there was any emerging legislation that was local legislation that we could work on. But I also think to Councilmember Desai's point, there's nothing stopping us from working on these things and bringing back the ideas to say, look, here's the actual'",
        "'speaker_8': 'initiative, like here's the referral with the initiative attach that we're asking the city to consider. And I'm just kind of wondering about staff time as a whole. So I mean, I'm totally open to, to having us consider implementation of an ordinance if there's some sort of ordinance that suggested or recommended.'",
        "'speaker_8': 'But I also think that adding another event and with short notice, I'm just worried about the the the impact to staff and what what then gets kind of put on the wayside for us to to do that.'",
        "'speaker_2': 'Okay. Well, I think John and I, we're going to do most of the heavy lifting, as we've done already. And we did actually have a discussion with the police chief and the city attorney about this, you know, very brief, you know, but I think the police chief was supportive of this idea, the idea to gather our representatives'",
        "'speaker_2': ', you know, at the local level who are doing good work in our district attorney and our representatives at the state level who are doing good work, and our assembly member and our senator. And I would I will speak for John, but I think we I will speak for myself.'",
        "'speaker_2': 'I'm more than happy to build on what's already been done and not have to reinvent the wheel, because I don't want to start over from scratch because I don't think we have time to start over from scratch. But, you know, I think the city's role should be limited to making sure that, you know, having the city.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Yeah. Having the city attorney, you know, make sure that, you know, whatever we're doing, you know, it's legally allowed because, for instance, there are things we just can't do. And then a little publicity help from our Arpaio as far as getting the word out, you know, which I don't I don't think it's that much work.'",
        "'speaker_2': 'I mean, we could take care of, you know, setting up the speakers, you know, organizing the logistics. Well, we haven't figured that out yet. Maybe there might be some assistance with staff, might be able to use a public building if if if it was sanctioned.'",
        "'speaker_2': 'So I'm just I'm just a little bit stunned at the resistance. I just really am. I mean.'",
        "'speaker_0': 'So and I want to hear from the vice mayor, but I'd like to start with the end in mind. What what is it that you're hoping to accomplish?'",
        "'speaker_2': 'Well, I think it'd be an action plan that we could implement as a city, and that if I mean it, it could include legislation that we could pass. It could include legislation that or an action plan that we could sponsor.'",
        "'speaker_2': 'It could include ways to motivate citizens to take you know, to have their voice heard. Because, I mean, granted, this has been done, but it's been a year and nothing's been done. So, I mean, I granted there was a lot of legwork done already, but, you know, there's not a lot of organization and energizing.'",
        "'speaker_2': 'And, you know, I'm happy to be the one, you know, spearheading that. But I don't think staff has to be the one doing that. But, you know, there are some supports that, you know, we were hoping to get.'",
        "'speaker_2': 'And, you know, I honestly we were also hoping on getting a blessing that this council would agree that, you know, gun violence is a public health crisis. So and by not by choosing to not get involved, you know, it it just kind of perpetuates the inaction, in my view.'",
        "'speaker_0': 'Councilmember Vela And then let's hear from the vice mayor.'",
        "'speaker_8': 'I don't think that we're choosing to not get involved. I think that we've actually taken a very active stance in terms of supporting different legislation, in terms of our legislative, in terms of what we've actually directed our lobbyists to look out for and to and to bring forward so that we can actually actively support.'",
        "'speaker_8': 'I also think that, you know, some of the things that stemmed from this, where there was student action that occurred that was pretty substantial. Um, I think we can all remember that there was a student action that, that gathered outside of the, the.'",
        "'speaker_3': 'Um.'",
        "'speaker_8': 'The state of the city event last year.'",
        "'speaker_2': 'A year ago.'",
        "'speaker_8': 'Yeah. Yeah. And, and I think that there has been continued action. I just want to make sure that we're folding in the various groups that have been working on this continuously. And I think sometimes and part of the.'",
        "'speaker_8': 'Conversation that did occur were different things that individuals could do and actions that they could take as individual citizens. And so sometimes it's not that it has to be officially sanctioned, like they're going to go they have to act through us.'",
        "'speaker_8': 'There have been things going on. And I think that it you know, I think that there are groups out there that are that have taken what we what was discussed and have done something with it. So I don't want to discount that.'",
        "'speaker_8': 'I think, you know, if you're asking us to to make some sort of declaration, then then, you know, put that before the council so that we can vote on it. But I think that I guess I'm just unclear in terms of what the the outcome that we're looking for based off of what was attached to the referral'",
        "'speaker_0': '. Let's hear from the vice mayor who's coauthor of this council referral. Are you there, Councilman? I'm vice mayor and that's my leg.'",
        "'speaker_9': 'The reason I keep shutting the operative I'm trying to go to unmuted. Hi.'",
        "'speaker_0': 'High technology.'",
        "'speaker_9': 'So I. I think I guess I will answer that question, but I like the opportunity to kind of make my comment that from the very beginning it was been a very interesting conversation. And I mean, I think, you know, it'd be from my perspective and from everybody and correct me if it is disturbing that you and I'",
        "'speaker_9': 'started talking about what we wanted to do in working on something, and we really wanted to make sure that we weren't getting so far ahead of this, that it's something we were stepping out and trying to be the only two people working on this issue.'",
        "'speaker_9': 'And so we wanted to kind of come back in and knowing that we were going to have to ask for some help in Washington, whatever else. So we were going to ask the council if they had something with great idea, let them do that so that we can start a more regular conversation at the council.'",
        "'speaker_9': 'I know for myself, you know, with.'",
        "'speaker_7': 'September 9th and we didn't get to talk about what was going on.'",
        "'speaker_9': 'And I can't remember the last time the city got put off the body and has addressed this issue in terms of the role of the city. And so but not all of it could have happened out there. And I think that there's lots of room or a lot of room to do, lots of work, lot there.'",
        "'speaker_9': 'And that I you know, I agree that there is a place for, you know, to get paid moving through red that we need to talk about understanding that we need to go motivated advocates around the community taking whatever role.'",
        "'speaker_9': 'But I do think that at this point in time, in terms of the issues of action, we haven't had that conversation. And I think we have to what I think we would have done all is to sit down and have a conversation, you know, with people who are energized around this draft and to talk about what are'",
        "'speaker_9': 'the actions that city can take. So not so much to start another convention where we're doing really great and in the case of action. But I don't think there's value in combining DC because I don't think the United States is looking to help the problem to make change in Alameda specifically.'",
        "'speaker_9': 'I'm sure they'd be very supportive of it. So I offer my point by point of view. I think.'",
        "'speaker_0': 'The realism is times.'",
        "'speaker_1': 'It says it's still time.'",
        "'speaker_2': 'I'm stunned. That's interesting.'",
        "'speaker_1': 'Oh, well, he's not talking, so she stopped it. But okay, you and I, should we hang up and try? We can hang up.'",
        "'speaker_0': 'And. Vice Mayor, can you hear us? The mystery.'",
        "'speaker_1': 'Which we just will hang up and try back to see if we can get a signal.'",
        "'speaker_7': 'It wasn't my fault.'",
        "'speaker_9': 'I can't hear you guys.'",
        "'speaker_0': 'Or hear us, but we couldn't hear you. Okay. Okay. If you. You were where I stopped typing. You were saying you don't see the value of combining the two events.'",
        "'speaker_9': 'You got to give value combining to the value of there being able to go back and downgrade. Yeah. Yeah. I mean, you are you are engaged in that and as an individual person. And, you know, I don't see that that that needs to happen in my mind to be something that the citizens doing remain engaged city and'",
        "'speaker_9': 'the council thinks they can't. And I think that they're definitely going to continue the population.'",
        "'speaker_0': 'Real quickly, I just want to address the that this council has never addressed gun violence. I know we did a moment of silence after the Gilroy shooting and I said, you know, yet another shooting.'",
        "'speaker_9': 'I didn't say that. And if I could just finish my comment.'",
        "'speaker_0': 'Oh, I'm sorry. I didn't know that yet.'",
        "'speaker_2': 'He's got the floor.'",
        "'speaker_0': 'Yeah, no, I didn't. I thought it was. Please.'",
        "'speaker_9': 'I just I didn't I didn't say the council had not done anything about it, not to my knowledge. You know, they hate campaign and hate that we've adopted in the city's campaign about gun violence, but we're not going to vote on that forward.'",
        "'speaker_9': 'How we want to do that. And I think, Councilmember, I mean, I just really thought this town hall as any place we could be, a place where people can bring their thoughts and ideas and happy to engage anybody who's done anything at all and then come back with some ideas, with our ideas.'",
        "'speaker_9': 'But also, obviously, an individual council member can bring their ideas as well. And we can have a big conversation at the council about what might make sense and how we might move forward.'",
        "'speaker_0': 'Yes. Uh huh. That was it. Okay.'",
        "'speaker_3': 'Um.'",
        "'speaker_0': 'So, um, anybody want to I whatever is done, i, i, i do think there's value in checking in. It sounds like neither Councilmember Oti or Vice Mayor Knox White perhaps attended the the town hall at the Episcopal Church because it seemed to cover a lot of the the the topics.'",
        "'speaker_0': 'But that's not to say you couldn't do the same thing again or, you know, updated to 2019. But okay. So what do we what do we think council?'",
        "'speaker_2': 'I mean, there's no reason to do rework. So I mean, I'm happy to connect with anybody as we finalize the logistics that wants to participate or invite anyone who's done work to give their perspective or provide research or whatever.'",
        "'speaker_2': 'I mean, it's not to reinvent the wheel.'",
        "'speaker_0': 'I think you find them valuable resources.'",
        "'speaker_2': 'I well, I, you know, I reached out to resources that I thought were valuable that are on the ground doing this. You know, the police chief, the district attorney, the assembly member, the senator. And if there's more I mean, this is not something that I don't think I can solve.'",
        "'speaker_2': 'So I'm happy to hear a variety of opinions and get a lot of input. And.'",
        "'speaker_9': 'You know, of like there are.'",
        "'speaker_0': 'People vice mayor here, but.'",
        "'speaker_9': 'We did get the names of and make sure that.'",
        "'speaker_0': 'Yeah, their voices continued.'",
        "'speaker_2': 'Into the program. Sure. The Giffords Law Center, you know, we're reaching out to them to see if they could provide some assistance, you know, so the city attorney doesn't have to do all the research. And a lot of this is done already.'",
        "'speaker_2': 'So but there's you know, there seems to be a gap in communication between a lot of people and what was done a year ago. And as the vice mayor said, you know, between anything that's been done here except for moments of silence and with all due respect, those don't solve the problem.'",
        "'speaker_8': 'We also. Councilmember Villa in the microphone. To our legislative priorities in terms of we did also talk about that and that was agenda where we said specifically that we wanted to support legislation around gun control, gun regulation and addressing gun violence.'",
        "'speaker_8': 'So there has been action from that. I mean, a large part of it was that essentially there wasn't much we could do as a city. There's been a lot of regulations that that were discussed that have happened at the local level.'",
        "'speaker_8': 'But it becomes an enforcement issue and a feasibility issue and an efficacy issue. So I think if if the goal is to not just engage in platitudes, I also don't want to have something come back to us that's going to result in not being effective.'",
        "'speaker_8': 'I'm out of time.'",
        "'speaker_0': 'So I council member decided. I see your hint. I did not know. Okay. I'm free to use my time.'",
        "'speaker_3': 'You're trying to has it?'",
        "'speaker_2': 'I mean, that's why you want to have this discussion. So there can be a level set on expectations and people can understand because you asked to come in person on the street or on social media, and they they don't have any idea what what we're allowed to do, what we're not allowed to do.'",
        "'speaker_2': 'And there's just a lot of angst out there.'",
        "'speaker_0': 'Councilmember Desai has found his voice.'",
        "'speaker_6': 'So I think I think residents, especially mothers and fathers, would want their city hall to be actively engaged. I think there's a lot of specific things that we can do as a city hall that throw out a policy discussions that are happening at the federal and state level.'",
        "'speaker_6': 'But our city of Alameda specific, while I won't get into that, I think, you know, those kind of discussions are worth having. I mean, there's big five really have to sell.'",
        "'speaker_0': 'Weapons.'",
        "'speaker_6': 'And near the counter there. When you go down to South Shore and Big Five, I don't know. So I think I think the residents want us to have specific conversations. And I know the Episcopal Church, I think that was one of the issues that the Episcopal Church and it would be nice to see, you know, some kind'",
        "'speaker_6': 'of resolution of that. But so I think let's have it because the residents want us to.'",
        "'speaker_2': 'Have it, that emotion.'",
        "'speaker_0': 'And this is yours. And I would just add that the topic of the big five did come up, and what they're selling are hunting rifles. They don't sell automatic or semiautomatic weapons. If you know, someone wanted to launch that campaign to get them to stop selling hunting rifles, I guess we just have to ask, does that that's'",
        "'speaker_2': '. Not agenda is today's okay. We're not talking about specific specific items or retailers or whatever.'",
        "'speaker_0': 'So you're right. So that was something that came up at the town hall.'",
        "'speaker_2': 'Right. Mm hmm. I knew.'",
        "'speaker_0': 'I knew that.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'So it wasn't.'",
        "'speaker_2': 'They want us to. Well, I'd like to move approval of the. Of the referral.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_9': 'Michael. I like to think it, but it doesn't have a certain type.'",
        "'speaker_2': 'I thought i heard it did y.'",
        "'speaker_8': 'October 14th. That was my other question. Why people? Why indigenous peoples?'",
        "'speaker_2': 'Because that's the only that I could get the the three elected officials together at the same time.'",
        "'speaker_6': 'Well, you know, let me just.'",
        "'speaker_0': 'Councilmember Desai.'",
        "'speaker_6': 'Councilmember Jim Modi is asking, along with vice mayor, they're asking a very direct request for us to basically give our blessings or endorse the upcoming October 14th. To me. Okay, let's do that. On that thing, I think if other council members are interested in pursuing their slice of this issue, you know, let's let's let's also move forward'",
        "'speaker_6': 'on that. But for now. Yeah.'",
        "'speaker_2': 'That's.'",
        "'speaker_6': 'I, I got to support it.'",
        "'speaker_2': 'I think we all have a responsibility to our constituents to address this issue.'",
        "'speaker_0': 'I'm going to just call on the city manager.'",
        "'speaker_5': 'I'm just going to add one logistics issue. Just based on this level of discussion, I'm guessing that there could be more than two council members at this town hall. If that's true, then we will need to address that as a regular meeting.'",
        "'speaker_2': 'I would hope so. I would hope there's more than two.'",
        "'speaker_5': 'So we'd have to jeopardize it that way as a council meeting.'",
        "'speaker_9': 'If we make a city, if we make it a city meeting. That is true.'",
        "'speaker_5': 'If it's approved tonight.'",
        "'speaker_0': 'Even if it's not. Yeah. If you're talking about an item that could come back to the council.'",
        "'speaker_2': 'Yeah, we've done that before.'",
        "'speaker_5': 'Yeah, I just want to. I just want to bring up that logistics. Just everyone.'",
        "'speaker_2': 'Aware. I think I mentioned that in my opening.'",
        "'speaker_0': 'And what about staff time, Mr. Leavitt?'",
        "'speaker_5': 'Um. I'm getting a sense all you're looking for that you two are going to be organizing it and all you're looking for is more like communications. Is that what I'm hearing?'",
        "'speaker_2': 'Outreach. And then, you know, well, if we could use a city location, that would be great. And then, you know, any legal support on. But like I said, the Giffords center has done a lot of this work already.'",
        "'speaker_2': 'So.'",
        "'speaker_5': 'So the legal support would be more the city attorney's legal office. We could probably do some work on it.'",
        "'speaker_0': 'I just ask everyone to be sure to speak right into your microphone so the audience can hear. Mr. CHEN.'",
        "'speaker_5': 'Yes. If the Council does provide the direction tonight, we are prepared to provide high level analysis for the whole council. We are probably going to have to look at it on a high level because there's so much going on and provide more of an overview than specifics.'",
        "'speaker_0': 'And you should thank you.'",
        "'speaker_9': 'That would be perfect. Thank you.'",
        "'speaker_0': 'And Councilmember Daza, I.'",
        "'speaker_6': 'Guess my one request, as you pursue this and as staff assist you, is what are the specific things that City Hall can do to deal with prevent, you know, the type of things that happened in Gilroy, etc.? El Paso and Dayton.'",
        "'speaker_6': 'I mean, if there are things that we can do, I mean, I know that that that would be my subject, too. Well.'",
        "'speaker_2': 'I mean, that's the question we want to answer through this. So I think that's. I can commit to that.'",
        "'speaker_0': 'Hmm. Okay. Um, so and I the the caveat I would request, I think has been stated before is that you do touch base. I mean, you talking to the police chief, he was certainly on that panel. You can talk to your colleague, Councilmember Vela.'",
        "'speaker_0': 'She was on the panel. Well, not.'",
        "'speaker_2': 'Really, no, because it's a Brown act.'",
        "'speaker_3': 'You know.'",
        "'speaker_0': 'So consult with the police chief. But anyway, and and I can. We've started getting done that once already.'",
        "'speaker_2': 'Yeah. Or give Eric names or even. And we can get them from you. From him.'",
        "'speaker_0': 'Okay. All right. So there has been a motion to support this this council referral to hold that a town hall event as described, and it's been seconded all in favor of approving this council referral. Have a voice vote.'",
        "'speaker_0': 'Any more discussion.'",
        "'speaker_3': 'On.'",
        "'speaker_0': 'You know, accounts of every day side?'",
        "'speaker_6': 'One thing I would suggest is to obtain the lessons learned from the discussions via the Episcopal Church, because if there's some policy implications there that make sure to make sure that your guys obtained the lessons learned from the Episcopal Church process.'",
        "'speaker_2': 'So I hate doing rework if it's already been done, if anyone doesn't know that.'",
        "'speaker_0': 'So. Okay. And Madam Clerk, you were saying something. Are you ready to do the voices? Okay.'",
        "'speaker_1': 'Councilmember Desai should not slight fire. Odie.'",
        "'speaker_2': 'Would you say? Oh, yeah, sure. Yes.'",
        "'speaker_1': 'Bella.'",
        "'speaker_8': 'Yes.'",
        "'speaker_1': 'Mayor as the Ashcraft?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. By five.'",
        "'speaker_0': 'Okay. All right. That motion passes. Thank you. Okay. We go on to item number ten. Council, Communications, Council and Communications. Let's start with let's start with the vice mayor up there while we've got him on the line. Any council communications.'"
    ]
}