{
    "Study on Traffic Relief for Island Drive. ": [
        "'speaker_0': 'And can you let me know on this then? Is the staff have a presentation or do we.'",
        "'speaker_1': 'Go to the council.'",
        "'speaker_0': 'Pass it on to Ms.. Councilmember Odie.'",
        "'speaker_6': 'Thank you, Madam Mayor. I'll try to get through this quickly, because. No, we still have a big agenda, but. I spent a lot of time on Harbor Bay. I lived there for 14 years, commuted on Island Drive most of those year.'",
        "'speaker_6': 'So I mean, this is not an academic issue for me. This is something real. And the folks that live out there, you know, it's real to them, too. And as I knocked on doors most, most all the Bay Farm, I was able to knock on.'",
        "'speaker_6': 'You know, there were a couple of recurring themes that people were telling me, and one which I already knew about was was the traffic on Island Drive. So no matter, you know, how many houses we build, whether we build zero or whatever on the rest of the main island, we still have a problem with traffic on Island'",
        "'speaker_6': 'Drive. So my referral is to direct staff to conduct a study. And people have told me there's a few things that they thought might help alleviate some of the traffic extending the turn lane, the left hand turn lane from island drive onto Robert Davey Drive, renegotiate the Bay Bridge.'",
        "'speaker_6': 'I'm sorry, the Bay Farm Bridge. Hours of operation understanding that might take an act of Congress, but.'",
        "'speaker_2': 'Or.'",
        "'speaker_3': 'God.'",
        "'speaker_6': 'Will know that, you know, and I think one of the most critical ones is, you know, working with are having a partnership with a UCD to work on the school start times. From the way I understand it, you know Lincoln starts before Earhart so folks go off a farm island dropped their kids off at Earhart come back'",
        "'speaker_6': 'I'm sorry, at Lincoln. Come back. Drop them off at Earhart or Bay Farm and then go back off the island to work or go back home. So now that's a lot of single occupancy trips or even, you know, carpool trips for four children that that we may be able to reduce, if not eliminate.'",
        "'speaker_6': 'So and then the last item is checking signal synchronization from Island for Inside Otis to Broadway. So this is a critical issue. I'm the only person on the council that has actually lived on Bay Farm. And, you know, the issues of folks that live on Bay Farm are still important to me, even though I don't live there'",
        "'speaker_6': 'anymore.'",
        "'speaker_0': 'Member.'",
        "'speaker_3': 'Ashcroft Thank you, Mayor Spencer. I, if I understand correctly, from having reviewed the rest of the materials today and about council referrals, the Council can vote to proceed as directed in the council referral. And and I'm fully supportive of this and would make that motion.'",
        "'speaker_3': 'The one slight amendment I would suggest is the wording is to request that city council direct appropriate city staff to conduct a study to determine if some or all of the following suggestions would provide relief for traffic on Island Drive.'",
        "'speaker_3': 'I would like to include or other remedies in in addition to these. So this is I think this is a good list, but it's possible that if staff appropriate staffer to study these possibilities, they might come up with yet another idea or two for alleviating the traffic.'",
        "'speaker_2': 'Just for formality. Can I just remind you it's the appropriate language in that sentences to direct the city manager so we stay away from council directing staff.'",
        "'speaker_3': 'That is a very good point. I was just reading, but you're right. Okay.'",
        "'speaker_0': 'And I appreciate that. Thank you.'",
        "'speaker_6': 'And I'm fine with that. That friendly amendment. And I think it says some or all, you know, by no means are those an exhaustive list of what caused this traffic out there. So. Okay. If there's others, I'd be happy to find a way.'",
        "'speaker_3': 'And I know the city clerk is getting. That would make me sound more eloquent than I sound. And so with that amendment, I would move.'",
        "'speaker_0': 'I'd appreciate if we could have an opportunity to speak before you at this point, if there's any other council members that would like to speak on this or.'",
        "'speaker_3': 'I was just trying to move the things along.'",
        "'speaker_4': 'I agree with the what the vice mayor's I mean, Councilmember Ashcroft's suggestion to to broaden the list and incorporate also the wording from the city manager, assistant city manager that we're directing the city manager. I'm. Dr. study. A personal.'",
        "'speaker_0': 'Emotion.'",
        "'speaker_3': 'So a move.'",
        "'speaker_0': 'And do we have a second?'",
        "'speaker_6': 'I guess I'll second it.'",
        "'speaker_0': 'So at this point in the event I'll speak and I can Steph clarify. So my, my understanding is that when there's an issue that someone has an issue in regards to traffic, nothing concerning that, that they can make a request to public works and the public works then.'",
        "'speaker_0': 'As to what I've heard is their cue, and then it makes it through the process and that they would initiate these items based upon their research and analysis.'",
        "'speaker_2': 'And in general, that would be the case, especially for the next one or two. One, it's a really local issue. This particular one is pretty broad because we're talking about a bridge and discussing potentially with the school district to change the bell tower.'",
        "'speaker_2': 'So I think this one in my mind is definitely appropriate for the council to have a discussion. Because it's much broader than, you know, one corner or one intersection.'",
        "'speaker_0': 'And in regards to the U.S. part of this, in the past, we have had joint meetings between the city and the district where we discussed, I would think, issues like this that it would go to that joint committee.'",
        "'speaker_0': 'Before as part of the process. And that's something that I would think that it's appropriate that that part of this referral go through that committee. Having been on the school board for six years, I'm familiar with that part of a process and and I would and this does say work with the wood.'",
        "'speaker_0': 'So again, I'm going to ask Steph.'",
        "'speaker_2': 'When we when we get to that point. Absolutely. I think that's the appropriate body.'",
        "'speaker_0': 'Okay. So. Would it be possible then to amend the motion so that through the joint? Meaning.'",
        "'speaker_3': 'So having made the motion, I, I think I favor keeping the language broad rather than narrow because work with a USD to change the start time. I think it encompasses a lot of things. It could encompass a subcommittee.'",
        "'speaker_3': 'I don't think it it eliminates that. But on the other hand, if it was as simple as making a phone call or two and we didn't have to wait for the subcommittee to be formulated, convene, meet and that sort of thing, we may might get resolution sooner rather than later.'",
        "'speaker_3': 'And I think that's all in the public good. But then again, it doesn't eliminate the possibility of a subcommittee. I'm just trying to be broad rather than narrow.'",
        "'speaker_0': 'So with all due respect to that common, having served on the school board for six years, I do not anticipate us requesting the school change their start time to be a phone call. I would be. I really believe that in all deference to the school district, it is appropriate to use the process that I've been part of'",
        "'speaker_0': 'for I think I don't know how long we've done that, but it's a long time. So I would. I think it's appropriate to go through that system, that process.'",
        "'speaker_1': 'May I suggest some language? How about work with the USDA and with the subcommittee as appropriate? So you have you have the opportunity to do both. Would that work?'",
        "'speaker_3': 'Now, that was work.'",
        "'speaker_0': 'Yes, I think that's appropriate. They have their word. And I'd like to work for the board.'",
        "'speaker_6': 'And I don't know. It may require negotiations with the labor union. So I mean, I don't I'm fine with the the correction, but, you know, I prefer not to be so prescriptive on on how staff should operate because I don't know the you know, what it's all going to entail.'",
        "'speaker_0': 'So can and also in regards to the referral process, it was my understanding that the referral comes to us and then we we agree then that it goes on the agenda for another discussion, that it would come back to us as.'",
        "'speaker_2': 'Yes, we would have to come back.'",
        "'speaker_4': 'I, I think I. We have to figure out the.'",
        "'speaker_2': 'Timing on each of these referrals, but I think at the earliest would be in two meetings. Just given our publication deadlines and we would come back with a proposal that essentially lays out the scope. And you know what it would take, how long it would.'",
        "'speaker_4': 'Take and potentially.'",
        "'speaker_2': 'How much it would cost.'",
        "'speaker_0': 'Okay. Because this so so if you could clarify this statement in regards to changing the start time, it says work with a USD to change start time for Lincoln Middle School to 810. So that suggests that we are agreeing to change in America.'",
        "'speaker_0': 'Yes. Thank you.'",
        "'speaker_4': 'Please. And I think the the notion of keeping this broad, it was important. And these as examples, because that's these are all anecdotal suggestions. They're not based in any kind of traffic engineering or any kind of studying. And we don't know if belt time changes are going to affect.'",
        "'speaker_4': 'They may make it worse. So I think those are examples to explore and that's why staff is going to look at it and give us an evaluation of what they think. And then I think we're a long way from calling, so.'",
        "'speaker_0': 'Okay. So then I would so I appreciate that. In which case I would strike the time, but work with a USD to change, start time to allow a better flow of traffic as opposed to being specific as to a set time.'",
        "'speaker_0': 'Because I anticipate when they're hearing from us that we want to change their start time to 810, that that is actually I think that is specific. I do not think that is broad. I'm sorry.'",
        "'speaker_4': 'But again, these are examples and they're anecdotal. So I think this is the referral process puts it it gives the council majority. An opportunity to direct the city manager to expend staff time to search these out and to apply.'",
        "'speaker_3': 'And.'",
        "'speaker_4': 'And to apply a solution if one can be had.'",
        "'speaker_0': 'So but my suggestion is, would council be willing to strike that start time?'",
        "'speaker_3': 'So I would like to the chair if I could ask Mr. Councilmember Ody, since this is his Council referral, why and the reason you have the 810 time in there was was what?'",
        "'speaker_6': 'Because that, that would make it start earlier than then the elementary schools.'",
        "'speaker_3': 'To start earlier than elementary school. So there was some rest.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_6': 'Later than the elementary schools it's turned out now it's START.'",
        "'speaker_0': 'Elementary starts at 820, Lincoln starts at eight. So currently that that solution actually does not resolve the issue. If you have to get there at 810 and do your drop off and get back to the elementary at 820.'",
        "'speaker_2': 'Well, I mean.'",
        "'speaker_6': 'I think we can get into the nits and that's of it.'",
        "'speaker_0': 'You know, that's why it.'",
        "'speaker_6': 'Comes back to us. This is just a broad policy level discussion that these may be ideas that work. They may be ideas that don't provide relief. But let's get some, you know, information on what does and what doesn't.'",
        "'speaker_6': 'So I I'd prefer not to be so overly prescriptive and just set policy levels at the council level from a high level and not micromanage every activity that that the count that that the staff is supposed to do.'",
        "'speaker_0': 'So would you be willing to strike the 810?'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Thank you. That we have.'",
        "'speaker_3': 'So it would just read then to work with us to change the start time for Lincoln Middle School to allow a better flow of traffic. Is that correct?'",
        "'speaker_0': 'I would like to keep abroad and because I think that's contrary to the intent there.'",
        "'speaker_3': 'And I thought this was one of the easier ones. So anything else?'",
        "'speaker_5': 'Thank you, Madam Chair. The I support this. I think it's based upon contacts that council member Odie had with residents, so it reflects a concern. My my the one concern that I have, though, is, you know, as a city council, we are a body that has to juggle a lot of balls and deal with competing concerns.'",
        "'speaker_5': 'You know, to. But in front of the queue checking signal signalization for Ireland for insight Otis to Broadway. Wouldn't it be fair to all of the residents of Alameda say check signal synchronization for all roads in Alameda? I recognize that.'",
        "'speaker_5': 'You know, this is. Particular current concerns raised by residents that you met. So so now you're doing your responsibility as a council person. I recognize that. But I think part of my responsibility as a council person is also to say if we're going to do X synchronization and we're going to put this in front of everything else'",
        "'speaker_5': '. You know, it's. To me, it's. There are other parts of town that might have the same issues. So the fourth bullet point I think is a general enough matter that that does raise concerns. I will support it nonetheless.'",
        "'speaker_5': 'But at the point in time that it is brought back to the city council, it's altogether possible. It raised the same concerns. I think the concerns with regard to Lincoln Middle School and the traffic flow there, I think the circumstances are so particular to their that warrant.'",
        "'speaker_5': 'Okay. We can deal with that because the issues there are particular. The Bay from Breeze Island to I mean, I think there's only one Bayfront Bridge in town. Right. But but on the fourth point, though, that I'll just have to it's possible that also that applies to the first point.'",
        "'speaker_5': 'I mean Mike we checked left turn lanes throughout. So it's nice support this but as this comes back to us first and fourth.'",
        "'speaker_0': 'So I have another comment on something like this. Would it be appropriate to ask someone from public works to come and speak with us about how they would normally addresses and then their Q and action? Because I really don't want to micromanage public works.'",
        "'speaker_0': 'And I appreciate your comments that we have people from across our communities that have concerns with traffic and lights and why would we prioritize this area over other interests within our community? But they come and speak with us.'",
        "'speaker_0': 'Would that be part of the process?'",
        "'speaker_2': 'We could certainly agenda's that because I'm pretty.'",
        "'speaker_0': 'Sure none of us are intending to bump any other areas through this motion.'",
        "'speaker_3': 'Question there. S So two things that I didn't really understand, that we were pushing this to the front of the queue. I understood that when staff is able to come back with a report, they will. And I would think that as part of that report, Public Works could weigh in on exactly the question the mayor raised.'",
        "'speaker_3': 'I mean, I think, you know, to the extent that there are other problematic intersections, we do tend to hear from our citizens. But, you know, certainly this this process is alive and well. And, you know, we all live in different areas of town.'",
        "'speaker_3': 'So, you know, this again, we don't want to micromanage staff. And just because we're hearing this council shrill tonight doesn't mean you go back and put it ahead of everything staff is working on. We look to staff through the city manager to tell us when this can be fit in.'",
        "'speaker_3': 'But I think we've all heard those concerns. And if you've, you know, tried to get back and forth over that bridge during school or commute time, you know, it's it's a challenging situation. So I don't think anyone's denying it's a problem.'",
        "'speaker_3': 'And we'll try to get to all of our problems as expeditiously as we can. Be ready to.'",
        "'speaker_0': 'Vote of emotion in the second. All those in favor. I oppose. Motion passes unanimously. Thank you. And I appreciate you bringing that to our attention. Next item three Be.'"
    ],
    "Feasibility Study for a Wetland Mitigation Bank at Alameda Point.": [
        "'speaker_1': 'Considered directing staff to conduct a consultant study to determine the feasibility for a wetland mitigation bank at Alameda Point. This item was placed on the agenda at the request of Councilmember Odie.'",
        "'speaker_0': 'Member OTI.'",
        "'speaker_6': 'Thank you, Madam Mayor. So now switching over to the other side of the island. We talked about this in the earlier session of today's meeting or last night's meeting when we talked about South32 and the Northwest Territories. I mean, there's there's two spaces on on the base where there's wetlands, natural wetlands, as well as.'",
        "'speaker_6': 'Seasonal wetlands over there by the marina area, which is kind of to the to the west of the seaplane lagoon and using wetlands mitigation bank as a possible tool to to generate revenue for the city and generate revenue for Alameda Point.'",
        "'speaker_6': 'Some estimates say these credits could be worth up to $500,000 an acre and we could have up to 50 acres if the maximum available are the maximum number of acreages available for wetlands mitigation. And that could pay for a lot of what we want to do.'",
        "'speaker_6': 'I mean, we have a community vision that that includes a park in the Northwest Territories. You know, we've we've heard at least during there in the fall about how much that park is going to cost. Whether or not it's going to go to the East Bay Regional Park District at no cost or whether we're going to be'",
        "'speaker_6': 'able to get any money from them out of it. And then the measure. WW money that needs to be paid to maintain it. So I think this is not an opportunity that we can explore more in depth and see if if this can generate funds needed to create the park line and create the wetlands that we want'",
        "'speaker_6': 'out there. I also understand the VA is going to have to buy some credits because they do need to do some mitigation. So, you know, we have a unique opportunity where, you know, we can exchange wetlands mitigation credits with with the VA right there on that spot.'",
        "'speaker_6': 'So I think it's something that it's worth looking into. And the referral is to have staff look into the feasibility of creating a wetlands mitigation bank.'",
        "'speaker_0': 'And we do have two speakers on this item. We're going to go ahead and proceed with our speakers, Richard Banger and then Irene Dieter.'",
        "'speaker_4': 'Thank you, Madam Mayor. Excuse me. And elsewhere. Moroney. Wetlands at the top of the agenda. It's good. There are at least four things that are known about this, and one that's not one. One thing that's known is that wetland mitigation banks are highly regulated entity use for mitigating loss of wetlands.'",
        "'speaker_4': 'They're also from an environmental standpoint. They are they produce a better outcome than if, say, 12 developers in this watershed had to go chase down three or four acres by it and turn it into wetland to mitigate their project.'",
        "'speaker_4': 'In the case of Wetland Mitigation Bank, that that mitigation money is all aggregated at one site and so you actually produce a better environmental income outcome. But in our case, we're not really concerned about helping developers in the in the watershed.'",
        "'speaker_4': 'We're interested in accomplishing a goal. And by creating wetland mitigation bank, essentially we offer a business deal. We're not going to sell them land, but we would sell them a credit. That they could buy to mitigate for their project could even be a Caltrans project that has to impact wetlands somewhere.'",
        "'speaker_4': 'Second thing that we know is that Alameda Point is surrounded by water and in some cases has water in it. Another thing that we know is that the area encompassed by Alameda point used to be wetland. The last thing that we know is that the areas that Councilmember Odie referenced and the Northwest Territories and the west side'",
        "'speaker_4': 'of the Sea Point Lagoon are under our approved infrastructure plan, will not be protected from sea level rise. However, when those areas become inundated, just because they have water in them doesn't make them wetlands, makes them land that is wet and has about the same environmental value as a flooded basement.'",
        "'speaker_4': 'So now the one thing that we don't know for certain is if a wetland mitigation bank is a good idea for Alameda Point. We just don't know that. And I would like to offer for discussion at least a a preliminary step before we hire a consultant to provide a report on forming a wetland mitigation bank.'",
        "'speaker_4': 'And that would be that we contact our own California Department of Fish and Wildlife, which is one of the regulatory agencies that oversees wetland mitigation banks in California, and ask them to come down and just have a walk through like a lot of people with expertize in a certain field.'",
        "'speaker_4': 'You can pretty much walk a site and, you know, whether it's a candidate or not. So perhaps we could get some free advice before we take the next step of spending money.'",
        "'speaker_0': 'Thank you, Irene.'",
        "'speaker_1': 'I mayor and council.'",
        "'speaker_7': 'I'm here to support Councilman Otis referral. I know that the.'",
        "'speaker_1': 'On the city books on the plan everyone. All the boards and commissions and the former city council passed a plan to actually have wetlands.'",
        "'speaker_7': 'Out at Alameda Point.'",
        "'speaker_1': 'The only thing.'",
        "'speaker_7': 'That was lacking was a plan to move forward to achieve that goal, and we were assured that that would happen in due course.'",
        "'speaker_1': 'And I think this is a perfect.'",
        "'speaker_7': 'Opportunity to move forward in that regard.'",
        "'speaker_1': 'Because obtaining.'",
        "'speaker_7': 'Information can never hurt. So I don't see any.'",
        "'speaker_1': 'Harm in trying to gain information. And we may think that something is out.'",
        "'speaker_7': 'Of reach when in reality it's right at our fingertips. So I would encourage you to support this referral. So at least we can make decisions based on real information as opposed to what we think can or cannot go forward with.'",
        "'speaker_1': 'So please do the right thing and.'",
        "'speaker_0': 'Support this referral. Thank you. Thank you. You may proceed to make.'",
        "'speaker_6': 'A couple of quick comments. Yes. And there's also a portion of the of the referral talking about consultants to estimate the cost of removing the concrete over by the west side of Seaplane Lagoon. So that was one of the things I didn't cover earlier.'",
        "'speaker_6': 'I want to thank Richard and Irene for supporting this and speaking on this. And thank you also for staying late last night and staying late on the sixth and not getting a chance to to speak. So I'm glad to see you up and around, Irene, and and thank you for coming out and talking about this.'",
        "'speaker_6': 'You know, if if Richard's idea of, you know, an interim step of having somebody come would be helpful. You know, I'm all for that. You know, we're moving on on site A, you know, we're moving maybe not so fast on site B, and I'd like to see us get moving on the wetlands portion in the park portion'",
        "'speaker_6': 'of the of Alameda Point as well.'",
        "'speaker_0': 'So would you like to amend your referral to include this intermediate step?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'I met a married. Yes. That we just clarify and say an appropriate agency so we don't restricted to just that one body because it may be another body that we would like to talk to.'",
        "'speaker_0': 'Thank you. So with those amendments, are there any comments from council members? At this point.'",
        "'speaker_4': 'I'd like to. To move with the amendment if it's in order.'",
        "'speaker_6': 'I don't need to make every motion. I'll second.'",
        "'speaker_0': 'So we have a motion that by vice mayor and a second by member. Brody. And then any discussion. Yes.'",
        "'speaker_3': 'I'll just add that I think it is a good idea. I believe I heard Vice Mayor Madras, he discussed this on the campaign trail, too. And I know I've heard I do appreciate Richard Baron, Irene Deeter keeping us informed about these ideas.'",
        "'speaker_3': 'It sounds very intriguing. I also heard Mr. Banger say it might not be right for Alameda, and while gaining information never hurts, it does cost money when you're using consultants and as we know, it doesn't grow on trees.'",
        "'speaker_3': 'So I would favor the just the the cautious route of let's have whatever appropriate state agency come out, take a look, get the information and then go from there in an incremental process. But I think that's what the amended language encompasses.'",
        "'speaker_0': 'So let me confirm member Odie. That's my understanding also that we would hear back and then pending upon what that person says, then we would review the next step or staff would review the next step. But. You're not at work yet.'",
        "'speaker_6': 'That's fine.'",
        "'speaker_0': 'All right. So we have a motion. Second of all, those in favor. I oppose their motion passes unanimously. Thank you. Next item is three C.'"
    ],
    "Flashing Pedestrian Crosswalk Signs at Maitland Drive and Mecartney Road.": [
        "'speaker_1': 'Consider directing staff to install flashing pedestrian crosswalk signals at two locations, Maitland Drive in McCartney Road and McCartney Road and Belmont Place. This item was placed on the agenda at the request of Councilmember Odie.'",
        "'speaker_0': 'You may proceed.'",
        "'speaker_6': 'Thank you, Madam Mayor. So again, take into consideration some of the comments earlier. I'll go through the referral and then maybe entertain some some changes to it. But another thing I heard from from folks living out on Bay Farm and Harper Bay was pedestrian safety.'",
        "'speaker_6': 'And there's two intersections in particular that they identified as being particularly dangerous and particularly busy. One is Maitland Drive and McCartney Road, and the other is. I'm sorry. It should be Maitland Drive and Island Drive. I think I made a mistake on that.'",
        "'speaker_6': 'And McCartney Road and Belmont Place. And the referral is to direct public works to install flashing pedestrian crosswalk signs similar to what we did on Otis after we had a tragic pedestrian death there. And since I've made this referral, I've been asked to also ask about Broadway and San Jose.'",
        "'speaker_6': 'So given the discussion we had earlier, you know, I'm amenable to changing this and maybe getting a report back on, you know, as the mayor said, what the priority areas are as far as crosswalks and and flashing crosswalks.'",
        "'speaker_6': 'But, you know, these are two that, you know, somebody said in one of the communication that they're medium priority. But the folks at Harper Bay, you know, they're kind of getting tired of being medium priority. They would like to have a little bit more attention.'",
        "'speaker_6': 'And, you know, I hope that through this process, we could give that to them.'",
        "'speaker_0': 'So just a moment in response to your comment. I really appreciate that. So now follow up. Yes. Member Ashcroft.'",
        "'speaker_3': 'Sure. The one amendment I would make is rather than. Well, and again, we demand the language, because rather than having city council direct a city department, we'll go through the city manager. But to implement that particular remedy, I think I would want to hear from a department like Public Works as to whether the flashing pedestrian crosswalk signs'",
        "'speaker_3': 'really are the best the best remedy. Because if I'm picturing the what is that down at the corner, at the far edge of the shopping center that we're talking? Because that's that's a big wide interface. Yes, it.'",
        "'speaker_6': 'Is. You know, maybe that's the best remedy that that.'",
        "'speaker_3': 'Well, and my point yeah. My point is just that probably as council members and laypersons, you know, I mean we all have some special here and other but it's we're not as well equipped to decide what something needs to be done.'",
        "'speaker_3': 'I agree to address the issue of pedestrian safety. This might be one thing to consider, but there's probably a whole toolbox that public works. And I know the Transportation Commission looks at these things to the police department as well.'",
        "'speaker_6': 'I'm amenable to, you know, modifying it or, you know, coming back with a different referral if if my colleagues would prefer. But, you know.'",
        "'speaker_2': 'If I can make a station manager. And this, I think goes towards what comments have been made so far, I'd recommend if we. How do I put this? Demote this from a council referral to putting it into the public works queue as three individual intersections and will go to work, as Councilmember Ashcraft said.'",
        "'speaker_2': 'There are many tools in the toolbox that they would have to study it and recommend the best one and or bring it back in and you can see how that works. Juxtaposed to the one guarding the bridge as the bridge.'",
        "'speaker_2': 'And because those are very two different scales of request, I would just add one more thing. Normally an individual or a group of neighbors would make a request and it would go into the queue and we would follow up and do the studies and public outreach.'",
        "'speaker_6': 'And there's a process which we'll talk.'",
        "'speaker_2': 'About when we come back. But we also view this body, each of you, as elected.'",
        "'speaker_6': 'Representatives.'",
        "'speaker_2': 'From the people. And when you bring these. Our assumption is that you're representative of more than one neighbor. So I understand, you know, and that's part of the balancing.'",
        "'speaker_6': 'Act of why some things, of.'",
        "'speaker_2': 'Course, referral or when it goes to the Q. So if we can take these and I can insert them into the Q. As.'",
        "'speaker_4': 'As if.'",
        "'speaker_2': 'Any neighbor lets in a quest, we'll bring them back to you and you can see.'",
        "'speaker_4': 'The difference in the.'",
        "'speaker_6': 'Procedures. I'm fine with demoting it. The neighbors that I spoke to basically said they had no response. But I know we have a new team at Public Works, so this was before the new team got in place.'",
        "'speaker_3': 'Member Ashcraft And I would also remark that I'm not sure how widely known this public works system is. So maybe just by holding this public meeting and discussing it will help increase public awareness because I, I think, you know, it's one of those things that some people know about, but maybe not widely across the island.'",
        "'speaker_3': 'So we can we can always do a better job of spreading the word. But with that, I would be happy to live approval of the motion as the Council referral as amended.'",
        "'speaker_5': 'I just have a question for staff before we have a second. Do we still have the TTC in place, the Transfer Transportation Committee, I mean, which goes through requests like for stop signs and things like that. We end and one of the controversies over that in the past was the use of state warrants, etc. Is that.'",
        "'speaker_1': 'Still in place, that.'",
        "'speaker_2': 'Process staff? Does that work? And we work with the immediate neighbors and public notice for the process. And if there's an appeal from any one neighbor, then it gets elevated to the Transportation Commission for a public hearing. Their decision is appealed by anyone which has happened in the recent past.'",
        "'speaker_2': 'It comes to this body.'",
        "'speaker_5': 'Okay. Okay. Well, perhaps one of the issues then is and this is a side note is to, you know, improve the way in which we let our residents aware of that process. So.'",
        "'speaker_0': 'So and so we have a motion, a second. And I'd like to comment that when we get to the the other items that we were going to be discussing at our special meeting, I did have a suggestion in regards to having an open house that we will be talking about allowing our department to improve that communication.'",
        "'speaker_0': 'So we will be discussing that at that point. So we have a motion and a second all those in favor I oppose and motion passes unanimously. Thank you very much. And I really appreciate staff's assistance in helping us through that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Next item. As 3-D and 3-D.'"
    ],
    "Collaboration with East Bay Regional Park District on Crab Cove Acquisition and Expansion.": [
        "'speaker_1': 'He insisted directing staff to collaborate with the East Bay Regional Park District on acquisition and expansion of Crab Cove. This item was placed on the agenda at the request of Vice Mayor Matt, R-S.C..'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_4': 'Thank you, Madam Mayor, and thank you to all of you who have turned up now for three meetings, three very long meetings, and it's truly appreciated. My counsel referral is entitled A Collaboration between the City Alameda and East Bay Regional Parks District, and its intent is to establish a good working relationship between the East Bay Regional Parks'",
        "'speaker_4': 'and the city of Alameda, particularly in light of some history and in light of what goes forward from here, not the least of $6.5 million of WW money that needs to be spent at a park or parklands at Alameda Point.'",
        "'speaker_4': 'And to put a closure on the expansion of Crab Cove, which the city electorate overwhelmingly supported in the 2008 election for Measure WW and my referral s that this body directs the city manager to meet with the General Manager of the East Bay Regional Parks District and following that meeting, prepare a work plan for the steps that'",
        "'speaker_4': 'the city can take to support. East Bay, regional parks, land acquisition and expansion of Crab Cove. And those steps will include but not be limited to those needed to settling any remaining issues. And I understand that there are none related to litigation, which is a good thing to petition the GSA to cease eminent domain activities or efforts'",
        "'speaker_4': '. And that was on the Mackay Avenue Strip and to establish a City Council, East Bay Regional Parks District Board Liaison Committee, patterned after the Liaison Committee that once upon a time we had with the school district. We had with the AC Transit Board and to use that to help establish a good working relationship between this park district'",
        "'speaker_4': 'and the city of Alameda. And I think there's some key deliverables that I mentioned that are not feasible with timelines. I understand that. And the idea is to get the the the meeting between the city manager and the general manager of the district to happen as soon as possible so that we can kick this off and and'",
        "'speaker_4': 'establish interests in order to accomplish the rest.'",
        "'speaker_0': 'All right. And we do have five speakers on this item. Unless you have clarifying questions, I'd like to call our speakers. CNN. The first speaker will be Richard Banker, then Irene Dieter and then Karen Lucas.'",
        "'speaker_4': 'Thank you, Madam Mayor and council member Matt Rossi for bringing this forward. There are certainly more than 3 minutes that any one person could speak on this issue. Briefly on the Crab Cove issue, I highly encourage you to draft a letter to the GSA to not only cease the eminent domain proceedings, but to accept the last offer'",
        "'speaker_4': 'of the park district for that land. And. They had a bona fide offer and. I could go on and on. But let's move on to Alameda Point. At the south eastern part of Albania point there's an area that is variously referred to as Triangle Park or Enterprise Park.'",
        "'speaker_4': 'It's about 22 acres. It was it was a park when the Navy left. It still looks like a park. The only upkeep there has been a contract with the soccer club, but for the most part, it's fallen into disrepair.'",
        "'speaker_4': 'The the base reuse plan specifically referred to that as a regional park. Back then it was referred to as Inner Harbor Park. But that. It's too confusing and was abandoned as a name, but nevertheless it was to be a regional park and it's now zoned open space.'",
        "'speaker_4': 'There's nothing else planned for that area. It should be a park. It was a park. It looks like a park. It has a bay trail next to it has a beach. There's a boat launch right adjacent to it.'",
        "'speaker_4': 'City is currently has an application, a grant application to resurface the whole parking lot, completely redo the inside out boat ramp. It would be a marvelous area to have as a park. But here's one thing that hasn't been considered.'",
        "'speaker_4': 'It's not just the money that the Park District has. They also have money for operations. And there's a bond measure, a tax bond measure that funds operations that actually still has money in it right now, that they that is being used gradually drawn down just to pay for the periodic maintenance of the Bay Trail.'",
        "'speaker_4': 'But that measure, Measure C is going to be renewed next year. If that park was in the hands of the Park District, well, maybe that line item would have a bigger number on it next time. Because as good as our own recreation park department is, they do not have access to a funding stream from two counties.'",
        "'speaker_4': 'So that's one thing. No matter how well our rec and park director writes a grant, it's not likely to come with ongoing operations money. So that would be another benefit to working closely and bringing this park on line.'",
        "'speaker_0': 'Thank you, Irene.'",
        "'speaker_1': 'Hello again.'",
        "'speaker_7': 'I am here to support the vice mayor's referral. I think it sends the right message to all the parties involved. First of all, it sends the right message to your constituents. Then to the Park District.'",
        "'speaker_1': 'Then to our legislators. And lastly, and most importantly.'",
        "'speaker_7': 'To the GSA. Also.'",
        "'speaker_1': 'I think that.'",
        "'speaker_7': 'This this liaison committee can work to achieve some goals that will be best for all of Alameda Point and Crab Cove.'",
        "'speaker_1': 'But we need to take an assertive role in getting legislative help.'",
        "'speaker_7': 'And it will be up to a liaison committee to find out exactly what kind of help the Park District needs. Also, a liaison committee can also ask the Park District on help for setting up a wetlands mitigation bank because because they've also done that and it will help us pursue park land opportunities out at Alameda Point, just'",
        "'speaker_7': 'as Richard Banger just said. So I don't think it would hurt at all. More information again. Won't hurt. And this one, there's no cost involved. It's just time and energy. And I cannot see a single downside into this proposal.'",
        "'speaker_7': 'So I encourage you all to pass this referral. Thank you. This, Lucas. Good evening. My name is Karen Lucas and I am a member of the Friends of Crown Beach, the group that gathered over 6000 signatures in support of the Crab Cove expansion.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor, for putting this item on the agenda. Hopefully our city can now work in harmony with the East Bay Regional Park District. We know that Alameda is strongly supported and we also know that the Park District has funds available for the development of the Neptune Point parcel adjacent to Crab Cove.'",
        "'speaker_7': 'However, the city manager has shown a strong bias against the Park District and should be recused from any participation in meetings with the district. And here are some examples of the bias that he has shown publicly. On July 15 last year during a council meeting, he used the words Neptune Pointe nonsense.'",
        "'speaker_7': 'Here's another example. After the Park District filed their lawsuit against the city to reverse the residential zoning at Neptune Pointe, in an interview with the San Francisco Chronicle Chronicle, the city manager called the Park District arrogant and out of control.'",
        "'speaker_7': 'Another example later in the Alameda Sun, he called the park district's lawsuit. Against the city to accomplish the park expansion. Expansion. It called it irresponsible and an arrogant disregard for tax dollars. I request that you appoint a person less biased to negotiate with the Park District.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speakers, Gretchen Lebow and Susan Gallimore in that order. Thank you.'",
        "'speaker_2': 'Mayor and council. I can't tell.'",
        "'speaker_7': 'You what a.'",
        "'speaker_0': 'Positive.'",
        "'speaker_2': 'Effort this.'",
        "'speaker_0': 'Is to bring.'",
        "'speaker_2': 'Forward a resolution to Crab Cove. I was in charge of the petition campaign and it was easiest job I ever had in my life because everybody wanted to see Crab Cove become part of Crown Beach. So I am here to support the resolution that Vice Mayor Morrissey brought forward and move it along.'",
        "'speaker_2': 'It's the right thing to do.'",
        "'speaker_0': 'You.'",
        "'speaker_8': 'Thank you. This is Susan Gallimore. I actually live right there at Crab Cove. And believe me, it's like the delight of my life living on a park like that. And I support the collaboration. Of course, I also would encourage you to consider Karen Lucas's comments.'",
        "'speaker_8': 'My my comment might be a little too in the weeds. I actually didn't come to speak on this issue, but since I live there, I thought I'd throw it in. We had the the parks gave us a map of how they would be reconfiguring it if if we went in that direction.'",
        "'speaker_8': 'And I gather that that's still the direction that they would go in. And the other thing that we also became very aware of, and those of us who live there know this already, is that Mackay's not a city street.'",
        "'speaker_8': 'It's there's another term for it. And I can't for the life of me think of it right now, but it's not maintained by the city. And. Right. What's the.'",
        "'speaker_0': 'Tube easement? Isn't it an easement thing.'",
        "'speaker_8': 'Yeah. And we discovered and I know because I live there, there's no sort of regular storm drainage and that kind of thing there. So it would be really great. I don't know if it remains an easement, but we really great if when we go into this process with them, they can also think about perhaps making it less'",
        "'speaker_8': 'muddy there during the winter. Thank you.'",
        "'speaker_0': 'Thank you. At this point, we have no other public comments on this item. So I would actually like to go back to Vice Mayor, is your referral. Did you have any comments?'",
        "'speaker_4': 'First of all, I want to thank everybody for continuing to care about this. There was a huge effort and I think the 6000 signatures gathered very quickly showed that they the people of Alameda, are very interested in making sure that this happens and it validates what happened in the election of 2008, where this project was part of'",
        "'speaker_4': 'the campaign for w w a I think with regard to the comments made about who represents the city and how the city is represented in the communications and the relationship with the East Bay Regional Park going forward. I think the liaison committee where the elected board met two elected board members and two elected council members is a'",
        "'speaker_4': 'good model for for managing that for or setting the tone, for setting the cooperation. And I have expectations that our management basically follows direction and represents the city well in a and a conciliatory, in a productive manner going forward.'",
        "'speaker_4': 'And. I, I think it's important that we show that this is a critical issue to this city because it they're not there's not more parkland that's available. There's few opportunities in spite of what we've heard. And we have to make the most of it.'",
        "'speaker_4': 'And we have a sister agency that, uh, we, we need to, to work well with because they have a stake in Alameda and we have a stake in Alameda. So I think that the liaison committee would be at least the council members would be up to managing that.'",
        "'speaker_4': 'And I think our city manager would be up to managing.'",
        "'speaker_0': 'Member comments. I'll start with member Odie.'",
        "'speaker_6': 'Thank you. Also, I want to thank the the vice mayor for bringing this referral. I think it's is time we turn the page on this. You know, by passing this referral, we'll turn the page here on the council and we'll turn the page with the city manager.'",
        "'speaker_6': 'And, you know, hopefully the community can get on board and also turn the page. Gretchen, I remember you're the one that got me to sign right there out in front of trader joe's. So. Hopefully I was an easy one to get signed.'",
        "'speaker_6': 'I do want to suggest, you know, maybe a couple friendly changes if the vice mayor is open to them. We have a lobbyist in Washington, don't we? Possibly engaging our lobbyists to help assist in this matter. I think.'",
        "'speaker_6': 'It'd be nice if we had some assistance from our federal representatives, our Congress members office. I can speak for the Assembly office and tell you that we would be willing to lend whatever help our office could could lend.'",
        "'speaker_6': 'And I spoke to our state senator's office, and they said once the lawsuit was resolved, they would be willing to assist in any way possible also. So I think if we can, you know, ask our state legislators and especially our federal, because this really is an issue that needs to be resolved with our our our federal government'",
        "'speaker_6': '. Now, I think we need to get on this posthaste.'",
        "'speaker_4': 'And I think we do appreciate the support that Attorney General Kamala Harris gave to this this project and this effort. And I think all help is welcome. So I would accept that as a mission which broader to get the support and.'",
        "'speaker_4': 'And. Efforts on the other levels of government that are needed to clear the path to make this happen.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_3': 'Thank you, Madam Mayor. I have a different take on this, this request. I have no problem working in harmony with our fellow agencies in the area. This agency, however, sued this city, and I do appreciate that we have a mostly new council.'",
        "'speaker_3': 'Only Councilmember Desai and I lived through the litigation in the closed sessions on the on the litigation. And what I can tell you now is, yes, the case was recently settled. So recent I put in my notes that the ink hardly seems to have dried on the settlement agreement.'",
        "'speaker_3': 'But that lawsuit caused this city in legal fees. Six figures, somewhere in the hundreds of thousands of dollars. That's money that comes out of our general fund. General fund that supports things like parks in Alameda. And we tried and I will give credit to Assemblymember Bond, his office, for stepping in and trying to help with the settlement'",
        "'speaker_3': '. But even those good offices, I mean.'",
        "'speaker_2': 'It might have.'",
        "'speaker_0': 'Moved the ball.'",
        "'speaker_3': 'A little farther down the field, but it was a long, costly litigation. And and the Park District was paying legal fees to I know they're their law firm, a good law firm. They used an expensive law firm they use.'",
        "'speaker_3': 'So as far as supporting the the park district's land acquisition of out there at Crab Cove, I think the city has done its part. The city council, the last city council voted to approve the ordinance. It was a great community, grassroots effort.'",
        "'speaker_3': 'It was very impressive. We we saw that the you know, this is what the people wanted, that open space zoning, that open space zoning, you know, might need a variance, but that's for the Park District to deal with when they acquire the land.'",
        "'speaker_3': 'But we have downs on the property to open space, putting ourselves at risk of a lawsuit by the developer that had the option to purchase at the time. He has since withdrawn that, but at some point the Park District is going to have to pay something or convince the federal government to give them the land.'",
        "'speaker_3': 'But I will remind the council and everyone listening, this was never the city's land. We got sued for land we didn't own. We did the we approved the ordinance. It is now the open space. That's what the Park District asked us to do.'",
        "'speaker_3': 'And I also don't think that it's the city's role to tell the federal government how to proceed with regard to its own property. GSA and the East Bay Regional Parks District are both capable of fighting their own battles.'",
        "'speaker_3': 'The East Bay Regional Parks District. What it does best is parks in across this county and Contra Costa County. We are very fortunate to have the East Bay Regional Parks District as the steward of some wonderful land. They do happen to be, I believe, still the largest park district in the country.'",
        "'speaker_3': 'And they didn't get to be that way by being neophytes. They they know how to fight their battles. I think that as far as establishing a good working relationship with the city in the park district. I have no objection to that.'",
        "'speaker_3': 'But that road runs two ways, and I haven't seen any overtures or indication on the part of the Park District to reach out to the city of Alameda. And I do appreciate Mr. Banger its reference to the the park out at Alameda point and I've I've gone out and seen that and there are a number of opportunities'",
        "'speaker_3': 'for the city to work with the park district in the future in Alameda Point and on the main island. But right now, for me, the memory of that litigation, what it cost, the intransigence and the refusal to settle for the longest time really bothers me.'",
        "'speaker_3': 'So what I would like to see is what sort of reciprocal agreement, perhaps, or overture the vice mayor, who, by the way, I hold in the highest regard. We go back a long ways. And I talked to him about this ahead of time because I didn't want to blindside him.'",
        "'speaker_3': 'But I just feel that at this point there is too much that the city I mean, we've we've done I think we've done our part at some point. Bottom line, East Bay Regional Parks District needs to find a way to acquire that land from from the federal government who owns it.'",
        "'speaker_3': 'We can't keep doing their work for them. And so I cannot support this council referral.'",
        "'speaker_0': 'Amber Desai.'",
        "'speaker_5': 'Thank you. I just want to begin by, uh, referring to the land area that resident Richard Bangert referred to. That is on Alameda Point near Internal High School. I'm referring to that because in the mid 1990s, 1995, 1996.'",
        "'speaker_5': 'We, the city of Alameda, particularly the neighbors in that area, including myself, were incredibly concerned about a project that the East Bay Regional Parks was contemplating for that area. But in a short while, by 1996, 1997, you know, we had we came out with a great agreement with the East Bay Regional Parks at the time.'",
        "'speaker_5': 'And it became, in my mind, a model of how we can air out our concerns and join together and move forward. I think, you know, the situation that we had with Crab Cove certainly didn't reflect how we had worked in the mid 1990s.'",
        "'speaker_5': 'And so I see I see nothing wrong and a lot good. And the proposal that's being put before us and. Now. Through whatever mechanism, whether it's the liaison committee that's contemplated here or whether it's through the city manager meeting, the general manager that's also contemplated here.'",
        "'speaker_5': 'I'm sure we will be able to iron out any details, pro or con, that gets us back onto a positive working relationship. I do think that it is the role of the. Residents of city out of Alameda as well as their representatives I us to let others including state level persons as well as federal level persons the'",
        "'speaker_5': 'sentiments of the community. And so I think this is. I'm fine with this. I'm. As a referral matter.'",
        "'speaker_0': 'So I appreciate the referral. I appreciate the comments from the members of the Council as well as the members of our public. In regards to some. Sensitive issues that were raised this evening. And Mr. Russo, our city manager, is not here this evening.'",
        "'speaker_0': 'However, he is our city manager and. He is part of our team and we are working with him moving forward. I was elected to represent all our maidens and we are working together and I appreciate the comments that were raised and at this point moving forward.'",
        "'speaker_0': 'Given that also in regards to member Ashcroft's comments, there was a caveat that I want to add that the prior council did rezone the property to housing, which then, in my opinion, led to the litigation that opened the door.'",
        "'speaker_0': 'And so however moving and I appreciate that, but it's my turn to speak. So thank you. At this point. We all want what is best for our community, including the East Bay region as a whole. And East Bay Parks is part of that.'",
        "'speaker_0': 'And I personally have had conversations with representatives of East Bay Parks. I've also attended meetings with Sierra Club and we all appreciate the park and we will be working together in regards to this referral. And also I've spoken with state and federal representatives and we there was during litigation, I'm an attorney.'",
        "'speaker_0': 'We all know during litigation there are conversations that occur and positions that are taken and then we move forward and that's where we are now. And I would actually suggest that we invite East Bay Parks to an upcoming council meeting and they could update us on the status of their project and then we could add as appropriate'",
        "'speaker_0': ', we could meet with them in some of these items in regards to litigation. We have council that I think is actually part of this conversation. But at that point, after we. Or should we invite them? I would like to invite these sparks, let them give them the opportunity to update the project.'",
        "'speaker_0': 'And then at that point, the staff and council recognizing that this is post litigation, take appropriate steps. And and and I truly do appreciate the the item being brought, the referral being brought forward by Vice Mayor and I too am a friend of Crown Beach.'",
        "'speaker_0': 'I am one of those people that did collect signatures to support our beach. And so that's my suggestion.'",
        "'speaker_6': 'If I'd like to go into motion, I like to make a motion to approve the council referral as we've amended it. Include outreach to others. Federal lobbyists. State.'",
        "'speaker_0': 'And the referral, as I understand, is to direct our current city manager to initiate this conversation. So could you read the. I'm sorry. Whomever is making the motion, isn't it? Who's making the motion?'",
        "'speaker_6': 'I was going to.'",
        "'speaker_0': 'So could you read it entirely then? Okay.'",
        "'speaker_6': 'Read the entire entire referral.'",
        "'speaker_0': 'The motion.'",
        "'speaker_6': 'Your motion a move adoption of the Council referral from the Vice Mayor to increase collaboration between the City of Alameda and the East Bay Regional Park District, including the amendments adding federal and state elected officials who enlist for help.'",
        "'speaker_0': 'Which. So this includes the part about we requested the city council direct the city manager to meet with the general manager of East Bay Regional Park.'",
        "'speaker_2': 'And correct as well.'",
        "'speaker_0': 'Is that what you're.'",
        "'speaker_6': 'I don't think we have to read the whole thing. So.'",
        "'speaker_0': 'But there were suggestions as written.'",
        "'speaker_6': 'All right. Thank you.'",
        "'speaker_0': 'Do we have a second?'",
        "'speaker_6': 'I don't make motions here.'",
        "'speaker_0': 'We have a second.'",
        "'speaker_4': 'I'm going to second it with a note that the last line that talks about a February 2015 is adjusted by staff so that we can meet the notice requirements and the preparation time. If you could give us a time when that might be.'",
        "'speaker_4': 'Now if you can't. Well. You could inform us at some point.'",
        "'speaker_2': 'Sure. And I certainly can't do it now. So I'd like to recommend a path for updating you. I don't want to assume that we won't.'",
        "'speaker_4': 'Have seven council.'",
        "'speaker_2': 'Referrals every meeting. But in order to get a timely update, I think what we do is we'll get the referrals that passed tonight and will bring back updates on on when to expect reports to come back to the Council.'",
        "'speaker_2': 'At the City Manager Communication. So we can do it quickly.'",
        "'speaker_0': 'So now we have a.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Motion and a second. Now we can have discussion before I call the vote. Any comments before Parliament?'",
        "'speaker_4': 'I just want to make one comment. Yes. This is a chance to to lead this effort, because if it if it is not led, it's going to languish. And I think because that part of of our park system, even though it's not under control, is so important and future parks depend on it.'",
        "'speaker_4': 'I think we have to lead. That's number one. And this is not a new method and it's very effective. The the liaison committee where this the manager of both operate organizations of. And I'll go back to the school district council liaison committee was the city manager to members of council, the school superintendent two members of the school'"
    ],
    "Transit/Traffic Strategic Plan and Implementation Tool. (Councilmember Daysog)": [
        "'speaker_4': 'board. And that group was initiated at a time when the city and the school district are fighting each other and communicating via their posted letters from here to there and back over Bayport. And I don't know if people remember that there was a big fight over over that.'",
        "'speaker_4': 'And the liaison committee and the fact that the manager and the superintendent got together in the same room helped lead the path to resolve the conflict between the school district and and the city. And it became a very good working relationship that lasted several, several years and accomplished things like making sure that the schools maintained a much'",
        "'speaker_4': 'lower rate from AMP than the institutional rates, etc.. So this is not it's not an untried approach. I think it works and I think it will give us a lot of benefit.'",
        "'speaker_0': 'So if I I'd like to question in regards to the motion, ah, or what could we amend it to strike the part about directing city manager and work with the liaison committee?'",
        "'speaker_4': 'No, I think it's very important in order to cement the relationship, the lead leaders of the two administrations, the the operations, I believe, have to have a relationship that's cordial.'",
        "'speaker_0': 'All right. So did you want to make some more comments? I'm sorry.'",
        "'speaker_6': 'No, I mean, I would agree with the vice mayor and not change the motion. I just think at some at some point, I know there's a lot of scars. You know, that happened while we weren't on this council.'",
        "'speaker_6': 'But, you know, sometimes you have to be the bigger person. And that's why I'm glad that we're we're going to move forward with this.'",
        "'speaker_0': 'So I will not be able to support this motion. We in regards to not that we the if we don't need it will go to languish. I personally think I do stand by my suggestion to invite East Bay Parks to come to our meeting and do a public meeting.'",
        "'speaker_0': 'I am very concerned about after being in litigation with another party, to essentially go into another back door meeting, which I don't support. I think it's very important that we be public and have and or work with council the steps that I suggested.'",
        "'speaker_0': 'And in regards to Liaison Committee, at this point, we don't have that committee. And being the bigger person, I do support that, which is why I would think it's appropriate for us to invite East Bay Parks and put extend the olive branch in that manner.'",
        "'speaker_0': 'Time will now call for the votes and the comments by council. All those in favor.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Opposed no.'",
        "'speaker_0': 'Oppose for the reasons I stated. Thank you. And next item will be three E.'",
        "'speaker_1': 'Instead of directing staff to create a comprehensive transit traffic study, strategic plan and implementation tool. This item was placed on the agenda at the request of Councilmember Dave.'",
        "'speaker_5': 'Well, thank you very much. Thank you, Madam Mayor. I think the way to begin is to kind of get a handle as to what is it that we're facing and why why we're here in the big picture things.'",
        "'speaker_5': 'You know, the thing that we have to really think about is our tube has limited capacity. When we do our studies, we look at capacity for the most part, using what's called the theoretical capacity of 4007, which means that hours travel through the tube, it assumes a 55 mile per hour rate.'",
        "'speaker_5': 'It assumes no what's called weaving going in and out. And until there's 4000, seven cars at a level of service through the tube won't be degraded. But there's really another metric that that even the city of Alameda recognizes, and it's a metric with a tube capacity that has to do is a use by the Alameda Transportation Commission'",
        "'speaker_5': '. And it their view of the capacity of their realistic capacity how many cars can actually travel through the tube and during morning peak commute hours, it's not 4007, it's 2900. So we are very close to capacity right now in realistic terms.'",
        "'speaker_5': 'In fact, you know, the general theme is you want to get out of town when you're going to work by 730 because the traffic through the tube gets pretty full. But nonetheless, for the purposes of many of the general plan and many of the ER processes, we use the theoretical capacity of 4007.'",
        "'speaker_5': 'So that's really, you know, the backdrop as to what we have to deal with, try to handle as we contemplate the number of projects. In the west end of town, as well as along the northern waterfront. And indeed, you know, there have been a number of traffic and transit reports.'",
        "'speaker_5': 'Let's not pretend that. Let's not pretend that we're inventing fire or let's not pretend that were discovered the wheel. There's a lot of information there. But when I look at a lot of the reports and I recognize that members of staff as well as the public, oftentimes when they look at these reports, they see what to them'",
        "'speaker_5': 'are the solutions in the tdps. For many of the projects, the teams will identify certain solutions like shuttles or car share or bicycling. But when you look at just identifying and talking about why, why this is an important shuttle, important and important transit alternative important is identifying all those are that's that's really that's just a start.'",
        "'speaker_5': 'I think you have to go beyond identifying, for example, shuttle as a as a possibility and you have to begin to talk about the ways in which you're going to implement the various things. Next. And the reason why we're here then is because we need to begin implementing implementing traffic and transit solutions from the new projects.'",
        "'speaker_5': 'But also because we're here when you look at. There was a citywide team that was put together in February 2012. But if you read the citywide PDMP, it specifically says that because of a limited budget that the analysis was concerned primarily with persons who currently work in Alameda.'",
        "'speaker_5': 'In other words, for the most part, as does the analysis of that citywide transit strategy. EDM was for people who come to Alameda. What we need to do is certainly we need to build on that by making sure that we get the right information in terms of the new residents who will live here and how we can'",
        "'speaker_5': 'best put together a team for them that is focused not just on identifying transit solutions, but talking about ways in which we're going to actually implement. So the purpose of what I'm. Requesting counsel to consider the purpose of this is to begin to implement strategies that have clear, relevant and achievable goals.'",
        "'speaker_5': 'And let me just talk about one thing. When you look at, for example, the reveals Emery, go round all the street shuttle route that has a what's called a ten minute headway during peak commute hours. And it's important to look at this because in reading that statement, there's three points that come out.'",
        "'speaker_5': 'It's the it's the shuttle. So that's pretty clear. You can see it, touch it, feel it kind of a solution. And it's also. It's also the merry go round. And that's important because there is a certain branding that comes with the fact that it's a shuttle that is there that you can see.'",
        "'speaker_5': 'Is the way things are being contemplated now is, you know, all the different shuttles. There's a marina, village shuttle, possibly the Alameda landing shuttle, maybe even the Alameda Point shuttle. We need to now begin to think about how we unify these so that in the minds of the residents, not only the future residents at Alameda Point or'",
        "'speaker_5': 'the or northern waterfront, but also in historic Alameda, in our minds that there is a unified in the case of shuttles. One thing that people can point to on the sea level touch basis. And in terms of relevance.'",
        "'speaker_5': 'I put in here, for example, a ten minute headways of of the emery go round and the ten minute headway I put in there, because that tells you how often that the shuttle, at least in the case of Emeryville, how often the shuttle is going to be available.'",
        "'speaker_5': 'It's these kinds of details. When I look at the teams that are missing, it's not enough to just say shuttles, but you also have to say shuttles that have a certain headway. How often is going to come? So the purpose of this is to begin the discussion so that we can have our city and our city staff'",
        "'speaker_5': 'move forward on implementing, building off of the the hard work that have already been done on a lot of stuff. And so again. What the purpose is, is to. Take a look at that. The what's that have been done?'",
        "'speaker_5': 'So the prior work is all about what we should be doing with regard to transit and traffic planning. You know, while we should be doing shuttles, we should be doing bikes, we should be doing car shares. But now in implementing things, we we are now looking at how we do things.'",
        "'speaker_5': 'And to me, that implies a whole set of different steps and also, you know, costs and expectations. So it. Let me talk about what is a possible this isn't an ironclad end product result. But at the end of this work I envision three items, for example, and this is just a possible scenario and let me just read'",
        "'speaker_5': 'it. So scenario one is if Alameda implements its own shuttle system with a ten minute headway during peak commute hours, the end product report will indicate what are the traffic congestion benefits? And contrast that with what are the upfront and ongoing costs for implementation, for implementing a shuttle strategy in which it's a city owned shuttle.'",
        "'speaker_5': 'Now. You might still want a shuttle strategy, but maybe you want something else. You don't want to outright city on shuttle. You want something, a partnership with AC Transit. All the same things we begin to. And or maybe you want a shuttle that is completely run by developers.'",
        "'speaker_5': 'The point, though, is that as council, in conjunction with the public, we begin to see the gradations of how we go about implementing and all the different costs associated with the different shades of strategies that we might think about.'",
        "'speaker_5': 'So I think we're at a key point now where we need to as a city, as a city council, I think we need to lead the discussions with regard to implementation and and identify what roles that we can play and how we can bring together the different teams that are coming down the pike.'",
        "'speaker_5': 'I don't think for tonight we need to be so prescriptive, but I think we could begin the process of having staff to the extent that if council so desire is having staff work with council members and work with public and further pursuing the question of, well, what does?'",
        "'speaker_5': 'In a fully implemented comprehensive travel, transit and traffic strategy look like to you and then staff and reports back to council members. So let me close by point. Is there something. If you go to the last slide. Now.'",
        "'speaker_5': 'There we go. Now, this last slide done up. Don't worry, you can't. Yates, it's very difficult to read. But basically what this last slide is, is it's the costs and revenues for the Amerigo round. So it gave you an order of magnitude what it takes to run the merry go round.'",
        "'speaker_5': 'If the annual operating budget is roughly on the expenditure side of almost $3 million. So the point though, is, is to get to this level of detail where, you know, we can say, what does $3 million buy us, particularly with regard to how we have to deal with the congestion issues that I spoke about in the very'",
        "'speaker_5': 'beginning. So for example, let me end by saying maybe. We can't afford. The Amerigo, the $3 million Amerigo round that comes around every 10 minutes. Maybe we want something less. Maybe we want to rely on just AC transit.'",
        "'speaker_5': 'And ac transit comes. Can guarantee headways of every 20 minutes. It's seeing what are the cost of that and what are the benefits of that. And that's where we're at now. And that's what I hope to do through an implementation strategy.'",
        "'speaker_5': 'Thank you. And Amir.'",
        "'speaker_0': 'Thank you. Member Ashcraft.'",
        "'speaker_3': 'That was an impressive dissertation. Councilmember de SAC I having gone through our packet for today and our next item after the council referrals has to do with the Sunshine Ordinance and council referrals and all those things. And reading back on resolutions of past councils, I think this might go a little beyond the scope of a council referral'",
        "'speaker_3': 'just in so far as it was described as a brief description of the subject to be printed on the agenda sufficient to inform the City Council and public of the nature of the Council referral. And of course, I don't think you're asking us to take dispositive action because I don't think we could find and I'm just reading'",
        "'speaker_3': 'from this reference, too, to what a council referral should contain in this earlier resolution. But if the Council feels that sufficient notice to the Council in public has been provided by the published agenda and sufficient information has been received by the Council.'",
        "'speaker_3': 'But what I got from reading through your material and I appreciate the work you always put into these things, is that I think that what we might want to consider recommending, directing the city manager to consider is that this be the topic of a special city council meeting slash workshop rather than just coming back to the council'",
        "'speaker_3': 'as an agenda item sometime. Because I think I think that's.'",
        "'speaker_2': 'A great idea.'",
        "'speaker_3': 'I mean it to me, it just jumped off the page as this is the framework for and I mean, you think about the items that we've been discussing lately before this council and traffic, traffic, trac traffic and transit options and all it all comes together.'",
        "'speaker_3': 'But I, I mean, we will be here till three in the morning if we try to put this on just, you know, as an agenda item. So anyway, that's, that's something that I would strongly urge just to consider.'",
        "'speaker_4': 'Better than.'",
        "'speaker_0': 'Vice.'",
        "'speaker_4': 'Mayor. I think the workshop idea for this particular topic and the direction that you're laying out here is is relevant to all the discussions we've had about development. Over the past few years and what we're going to have going forward.'",
        "'speaker_4': 'I'd also like to see if this council is interested in making that workshop or workshop with our Transportation Commission, because part of the job of commissions is to take some direction from the council and. Get into the details.'",
        "'speaker_4': 'And you've you've listed in your example here a sample schematic that. Could easily be populated by work sessions with the Transportation Commission to deliver back here so that.'",
        "'speaker_5': 'So maybe the motion should read consider directing staff.'",
        "'speaker_4': 'City man to.'",
        "'speaker_5': 'Consider directing the city manager to facilitate a workshop with regards to comprehensive transit traffic, strategic planning and.'",
        "'speaker_4': 'With the goal of a comprehensive because I'd like to not just consider it, but I think you want to establish that as a goal, right? A deliverable. Yes. Let's if you don't mind putting that in there, we can drive it to that.'",
        "'speaker_5': 'Yes. And.'",
        "'speaker_3': 'And that was still the joint meeting with.'",
        "'speaker_2': 'Variety.'",
        "'speaker_6': 'It may be multiple workshops. Yeah. I mean it may be that and and if we do do multiple ones, you know, I'd like to see one out on a farm, you know, where the folks where folks in on Bay Farm could have some input.'",
        "'speaker_6': 'I think this is a great idea. Councilmember Does his suggestion that the council lead this discussion and you know, ultimately we are the ones accountable. Know if I know planning does a lot of work planning board planning staff.'",
        "'speaker_6': 'But if these things don't work or if they're perceived there don't work or they're perceived that they're not there, we're the ones are going to be held accountable. So I think we should have some say and some oversight responsibility in there.'",
        "'speaker_6': 'And, you know, some of the things I was going to ask you for, I think you showed in your presentation, but having a review of existing transportation goals, reviewing the city's transportation plans, the general plan, the bike plan, the TCP, which is the traffic capacity management procedures, long range transit plan, west Alameda Shuttle plan, citywide team.'",
        "'speaker_6': 'You know, look at what these goals. Look at these goals and you know which ones that are not being met and about our current goals, what additional planning can we do to ensure that these goals are met? And then, as you mentioned in here, proposed a course of action.'",
        "'speaker_6': 'I like the idea of having, you know, a tiered structure. You know, this is the gold standard example. You know, if you want to take X number of cars off the road and X number of people off the road, it's going to cost you this much money.'",
        "'speaker_6': 'Are we willing to to do that? You know, and then the silver standard in the bronze standard and such. So.'",
        "'speaker_5': 'You know, and on that note, let me give an example. When you look at I know you couldn't see the fine details of the migra around, but this past year, for whatever reason, actually, it's clear the city of Emeryville or in $400,000 into the Emery go around, that's going to cover 2015 and 2016.'",
        "'speaker_5': 'But the reason why they did it, though, is because every go round seeks to expand its services. So it's not like they're filling in, you know, some kind of poor operation, but they actually want to expand services. And in order to do that, they had to get some kind of infusion from the city of Emeryville.'",
        "'speaker_5': 'But I mentioned that in an effort to illustrate that, you know, there are some are some hard decisions that we might have to make if, in Councilmember Otis terms, that we want to do the gold standard because, you know, the developers, through their EDM contributions and the residents through their fees that they're going to pay, might, you'",
        "'speaker_5': 'know, only get to X with regard to revenues to pay for the gold standard. But we really need is X plus Y the how do you make up that delta? But the point, though, of this these kind of workshops is to lay it out the gold to use Obama's meta you know Obamacare what's the gold, what's the'",
        "'speaker_5': 'silver, what's the bronze?'",
        "'speaker_3': 'You didn't watch the State of the Union last night. I know where you were.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'So do you. Do you have a motion?'",
        "'speaker_5': 'I will make a motion and make sure to correct me. I will move.'",
        "'speaker_4': 'To.'",
        "'speaker_5': 'Direct the city manager to facilitate a workshop in conjunction with other relevant legislative bodies, which could include the planning board, not just the Transportation Commission with regard to a comprehensive transit traffic, but plan an implementation tool. And there was a predicate there, though, that with the goal with the goal of actually doing in doing so.'",
        "'speaker_4': 'Correct. I'll second that. Yes.'",
        "'speaker_0': 'And I'd like to amend it to add the city of Alameda. When you say comprehensive, you you're meaning citywide. Is that correct? So if we could comprehensive.'",
        "'speaker_4': '4502945.'",
        "'speaker_0': 'Or the city of Alameda.'",
        "'speaker_5': 'Yes, yes. Yes, I accept that. But I will be upfront though that the impacts are stemming mostly and the projects are mostly in the northern waterfront.'",
        "'speaker_2': 'Where.'",
        "'speaker_3': 'Most of the new construction is.'",
        "'speaker_5': 'So or or Alameda point.'",
        "'speaker_0': 'But so I, I didn't want I'm not intended. I thought that was what you had meant citywide when you said comprehensive city. I mean, that's up to you anyway.'",
        "'speaker_5': 'It's fine.'",
        "'speaker_0': 'Citywide. All right. So with that amendment, we have a motion. Did we have a second to second? Any comments by council? And actually, I'd like to ask if there's any comments by staff.'",
        "'speaker_2': 'I think. We can certainly do this. I think we can try to schedule a joint meeting. I'm not. I'm not sure me turn to the city clerk how we would do.'",
        "'speaker_6': 'A three way.'",
        "'speaker_4': 'In terms of having.'",
        "'speaker_2': 'A formal joint meeting with the Council Transportation Commission. And the planning board in terms of.'",
        "'speaker_4': 'The.'",
        "'speaker_2': 'Audio visual requirements and seating. So we can think about that. But just so you know, there is a Joint Planning Board Transportation Commission meeting in February. So I think we could probably make sense to schedule. This workshop for some time in March.'",
        "'speaker_2': 'But why don't.'",
        "'speaker_4': 'We discuss.'",
        "'speaker_2': 'Formally how we would handle if it's a formal joint meeting of three bodies, or if we can.'",
        "'speaker_4': 'Find a way to just have it be a council.'",
        "'speaker_2': 'Public workshop and invite.'",
        "'speaker_0': 'You. Legally you can do three bodies. You just have.'",
        "'speaker_2': 'To notice that it's really more logistically how you're going to manage it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Member Ashcroft Well, and I think that it wasn't necessarily a hard and fast three body workshop. I think we can leave it to the city manager working with staff and the different department heads to see who's most appropriately involved.'",
        "'speaker_3': 'And we'll leave the logistics to you after that. But we're not we're not specifying. It must be three bodies.'",
        "'speaker_0': 'And assistant city manager liz warmer down.'",
        "'speaker_1': 'Thank you. I would just comment that three bodies would be an extremely difficult conversation to have. And I think I appreciate that ability to have that conversation to determine who would be the appropriate bodies. I think the other piece to I know that Ms..'",
        "'speaker_1': 'Odd has been contemplating this referral in general, and she's also working on some thoughts. And I think she was planning on coming back in, I think, in the beginning of March on some additional thoughts. So I just wanted to plant that seed that that she's also thinking about it in addition to what you all are directing here'",
        "'speaker_1': 'about having a workshop.'",
        "'speaker_0': 'Great. Thank you.'",
        "'speaker_4': 'Vice Mayor. And just having heard that and heard the original presentation, the comment from Councilman Brody is that the city council is going to maintain the lead in this because. Where the buck stops. So I think that might help.'",
        "'speaker_4': 'The logistics of the meeting.'",
        "'speaker_0': 'See no other comments. I'm going to call the question all of us in favor. I oppose hearing none. Motion passes unanimously. Thank you. Moving on.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you.'"
    ],
    "Preparing a Sustainable General Fund Budget. (Councilmember Matarrese)": [
        "'speaker_1': 'Three F Instead of directing staff to initiate steps in preparing a structurally sustainable general fund budget, this item was put on the agenda at the request of Vice Mayor Nutter.'",
        "'speaker_4': 'I thank you. And this is meant to be fairly simple, and it requests that the city council directs the city manager to take specific steps in preparing a structurally sustainable general fund budget and a. My intent on this is to actually establish principles for us to make a judgment on the budget, not necessarily to.'",
        "'speaker_4': 'Direct the city manager steps. And what I'm looking for is this council to establish working principles where we have defined one time revenues. That it's clear that their one time revenues by definition and they are not incorporated as general fund revenues.'",
        "'speaker_4': 'And that we have the opportunity to look at a general fund that's constructed without advances, loans or other transfers from funds outside the general fund. And we look at a way to further define that the reserve that fund balance is not included in the general fund revenue line.'",
        "'speaker_4': 'And. The reason is, is operations I think of have to do with operational income and. I think with these principles we can evaluate the budget that comes to us. And I'd also like us to afford this. This the ability to consult and obtain advice from parties separate from dysfunction.'",
        "'speaker_4': 'That is, the city treasurer and the city auditor, not the city treasurer. The city auditor is a treasure, but is the treasurer and all that and spell check audit. But I didn't. And that we apply these principles to our upcoming general fund.'",
        "'speaker_4': 'I also put this out there with an understanding that the city is already taking steps in these directions and it's much appreciated. The staff has the same thing in mind, but because we get so many people attending our budget sessions, at least in my experience in the past, I think it is very important to make sure that'",
        "'speaker_4': 'people are aware that when we talk about free bus passes or free park services, nothing is free. It it comes from a line item in a budget. And in order to sustain that, we have to live within our means.'",
        "'speaker_4': 'And our means doesn't include dependance on one time funding. And. I think because we have recovery fever, it's not recovery for everybody. I think we have very large unfunded liability. As the speaker who spoke at the at the opening of the meeting referenced that we still have a lot of work to do on that.'",
        "'speaker_4': 'And again, that's the the. Genesis of this referral and this one, unlike my other referrals, is open to. I'm perfectly open to hearing how people want to amend it. I have no. No set. That desire to see any one of these stay in tact other than keeping the principles that we live within our means.'",
        "'speaker_3': 'Member Ashcraft Well, if I could just suggest what would be helpful to me would be to hear from staff, specifically Ms. Warmer Dam, because she takes such an active role in the budget and really understands all the intricacies of it.'",
        "'speaker_3': 'And I think so to help us understand this, this Council referral better and the implications of it.'",
        "'speaker_0': 'Before we do that, I'd like to ask you have other council member comments. All right.'",
        "'speaker_2': 'Arthur.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'Thank you, Madam Mayor. So I in fact, today I just sat in a presentation about Prop eight adjustments, and it talked about our property taxes and and how we see out in the economy that it's doing so well.'",
        "'speaker_1': 'And yet there are some adjustments because of reassessments that are are going to impact our property taxes. We'll see improvements in the future and probably next year and the year after. But this year, it's not as great as we, you know, we had all hoped.'",
        "'speaker_1': 'As we all know, the public sector lags the private sector. And it's that's just a fact. So I do appreciate I mean, I think the I think where you're headed with this vice mayor is the dependency on one time funding.'",
        "'speaker_1': 'And I totally recognize that. And we that is how we budget. We do not we don't budget when we know we have one time money and we're forecasting for the future, we take that one time money out and then we forecast based on what is sustainable and not that one time money.'",
        "'speaker_1': 'So and I think that that addresses your first bullet. I would like to ask, though, because I don't have the benefit of the finance director here tonight to discuss these in particular as we move forward through the budget process.'",
        "'speaker_1': 'In the very beginning, our very first kickoff meeting, we'll talk about assumptions and we can address this very specifically to make sure that that we're addressing your your concerns. But as we develop the budget, we absolutely are not considering one time money as our source of revenue.'",
        "'speaker_1': 'And then the other thing I just would like to say is I haven't been in contact with the city treasurer or auditor. I'm hoping that you have and they're okay with participating in this. So.'",
        "'speaker_0': 'I think we can invite them. I don't personally.'",
        "'speaker_4': 'Participate.'",
        "'speaker_1': 'In the past. Okay. Yeah. And we have a good relationship with them, so I'm sure that's not going to be that won't be an issue.'",
        "'speaker_0': 'Any other member, council member disagree.'",
        "'speaker_5': 'Oh, well, thank you. Let me address this in several ways, in two ways. First, let me talk about my interactions with this and previous city managers. And then second, let me talk about. You know how I see the matter before us.'",
        "'speaker_5': 'As a council member, the way that I've always interacted with the city manager is, you know, we I go there and I sit down and, you know, I talk with we have regularly scheduled meetings. I think it was back in October, for example, in a Thursday meeting with city manager Russo.'",
        "'speaker_5': 'Liz Warm Adam was there as well. And, and and finance director Julian Boyer was there as well. We were talking about the fact that, you know, we were anticipating he was talking about that we were anticipating more revenues, that our reserves looked quite healthy.'",
        "'speaker_5': 'But it was city manager Russo who took the initiative to point out that. But don't get too excited because a lot of this is also one time reserves a one time, one time upside hits. So, you know, don't don't be making these long term plans as if, you know, you're going to always have X amount of dollars'",
        "'speaker_5': '. And, you know, during the course of the conversation, we further talked about, you know, the nature of one time reserves and how, you know, we treat that from one budget to one budget planning to another budget planning. So I.'",
        "'speaker_5': 'And it's a type of conversation that I've had with previous city managers. Jim Flint, Rest in peace. This is city manager, acting city manager at the time. Rob Wonder when I first began. So. For the most part, you know, I've seen city managers and also Debbie Greta city managers who really are on top of their game when'",
        "'speaker_5': 'it comes to dealing with these issues. But by the same token. Now. Now to the second point. A lot of times when the information is put into, you know, pages 200 page budget document or the supporting reports that go to the you know, a lot of times it looks very opaque for persons who and it doesn't mean'",
        "'speaker_5': 'that you have to have gone to city planning school or or have been a council member for a long time. I mean, it's just opaque. And what I think that what council member, Matt Oreskes, vice mayor of address, is getting at, is making sure that that we're clear on certain key areas when it comes to tracking budget'",
        "'speaker_5': 'items, whether we're whether we're clear on one time reserves and revenues or we're clear on advance loans. But in my mind, these specific areas around which I believe Vice Mayor Matarese wants us to be clear when we interact with the public.'",
        "'speaker_5': 'I think these three specific items fall under kind of the general notion of what our best practices. So it's altogether possible that, you know, the conversation that we might want to have are, you know, what are the best practices when it comes to any kinds of financial items and in among any kind of financial items, perhaps these'",
        "'speaker_5': 'three items, Race to the Top. So it's probably a larger conversation that we as a city council might have to understand, you know, what are the best practices when it comes to one time revenues? As you know, it's true that while you ought not to make permanent plans around one time revenues, it's also true that from one'",
        "'speaker_5': 'year to the next, you have these one time revenues that bump up. They might bump up from different sources. You know, some property got sold and suddenly you get a lot of transfer tax. Or maybe the state makes this decision regarding paying back the city, some sales tax that that had accidentally given to another city, which I'",
        "'speaker_5': 'did, which did happen, by the way.'",
        "'speaker_4': 'Went the other way, though.'",
        "'speaker_5': 'It went the other way.'",
        "'speaker_4': 'To somebody else.'",
        "'speaker_5': 'Exactly. It was a company called Van Star that moved out to, I think, Livermore area. But anyways, these kinds of revenue one time hits happened in different ways. So. You know, it's. It's getting a handle on how to treat it.'",
        "'speaker_5': 'And I think that's where the best practices notion comes in place. I think it's fine to have principles and hard and fast policies, but. You know, based upon my experience and working with the different city managers, I trust that I can give them the leeway.'",
        "'speaker_5': 'So long as we're clear as to what constitutes best practices, I trust that we can give them the leeway to make decisions. I mean, in the big picture of things, I think the fact that we had after Sony's the fact that we had a big one time hit a one time revenue jump, that was actually good news'",
        "'speaker_5': 'because it meant that we could then begin to kind of. Stash it away towards dealing with like the OPEB unfunded liabilities to start up the trust fund for that. And you know, I've seen the city manager make some alterations to previous employee negotiating bargaining agreements.'",
        "'speaker_5': 'You know, getting the police and fire to pay more towards their their retirement. So. With this city manager and with previous city managers, you know, I'm confident that they can do the job and that where we are. So I wouldn't want to.'",
        "'speaker_5': 'And cut them into, you know, specifying, you know, in our budget this is how you're going to do things. Rather, I think if we give them the leeway and so they're clear as to what we think are best practices.'",
        "'speaker_5': 'And when we go through the budget session, we just simply have to ask, you know, to what extent have you followed the best practices that we had in mind? And I think and in part, if we if we're not if we don't agree with the city manager at that point in time or the finance director at that'",
        "'speaker_5': 'point in time, you know, we spell out our differences.'",
        "'speaker_0': 'So and the other member.'",
        "'speaker_3': 'I think going first a.'",
        "'speaker_0': 'Lot, you.'",
        "'speaker_2': 'Hear it.'",
        "'speaker_6': 'I'll be brief. So I want to echo that. My thoughts are very similar to Councilmember de songs and Councilmember training. They said, if your colleague has said it already and don't repeat, so I'm not going to you. But I'm just a little concerned that, you know, we're setting policy without understanding the consequences of it.'",
        "'speaker_6': 'If we set a policy that, you know, certain revenues or or certain budget items should not be included, then are we setting a policy now that sets us up for potential service cuts? And I don't know if that's if that's something we want to do at this point.'",
        "'speaker_6': 'You know, I do agree that I think we do need to follow best practices. But I think the proper time to talk about that and think about that is when we get closer to the budget. At that am I my quick, quick thoughts on.'",
        "'speaker_0': 'I'm going to let member vice mayor respond first.'",
        "'speaker_4': 'And I just wanted to respond to those two sets of comments because I used the word principle on purpose rather than policy. And I prefaced my remarks because this is not so well written, because the preparation of the budget, according to our charter, belongs to the city manager.'",
        "'speaker_4': 'So we're not I my intention is not to direct the steps, but I think Ms.. Vollmer damn. Helped me out here saying that these are talking points. And if I would, I would really want to see out of here and and to get a motion passed that says that, first of all, we define all of these things'",
        "'speaker_4': '. So we have a clear definition of of what a one time and I know you have something like that. What a one time revenue is. And we're reminded of it as we're going through our budget process that we understand and and it's highlighted in explaining the budget to us, because you mentioned that the the text on the'",
        "'speaker_4': 'paper is opaque. It's more than that. It could be gibberish, you know, if it's late at night, which doesn't always happen. Right. But advances loans and other transfers have a habit. And I have experienced some city manager, some good city managers.'",
        "'speaker_4': 'They have a habit of drifting off the high radar and they they drift down someplace. And by the time your eyes get down there, you don't see them. And that's why I think it's a good talking point to highlight those, so that we can either decide we we want to approve that that approach or send that approach'",
        "'speaker_4': 'back for adjustment. And the last is and this goes back directly to the graphic from the the midterm report, the projected our general fund reserves going to zero in fiscal year 2018. I don't know if that's still the case.'",
        "'speaker_4': 'But that graphic was put together with a lot of thought, and it's going to be adjusted, I'm sure, given the runs that we have. But we have to keep our eye on that ball because and I think it's important to remind the public of that, because that's in a public document.'",
        "'speaker_4': 'It hasn't been revised yet. It needs to be pointed out. And I think if we follow those and have those pointed out during our budget discussion and we give that direction to the manager, then I'll be satisfied that the intent of this council referral to accomplish.'",
        "'speaker_1': 'I think we're fine with that is momentum.'",
        "'speaker_0': 'I remember Ashcroft.'",
        "'speaker_3': 'Oh, I think that because the vice mayor was referring to something that had been said by staff before that was appropriate. I didn't mind at all.'",
        "'speaker_0': 'That you had wanted to.'",
        "'speaker_3': 'Speak. I did, but I'm always happy to. You know, more information is better than less. But thank you. I. I'm grappling with this because I feel that. We are following these principles. I think they're good principles to be aware of.'",
        "'speaker_3': 'At the same time, we. We have recently had some one time revenue and I think the previous council dealt with it very responsibly. We we had a divided into separate pots and some immediate needs. We were able to take off the list, as I recall, some public works, you know, repairs that needed to be done.'",
        "'speaker_3': 'And and and we also set aside to start paying down, not start, but to continue paying down our OPEB liability. We took part of that way. I think that we need flexibility when we're dealing with the budget. I would like to see all of these ideas discussed when we start hearing the budget talks coming up by doing'",
        "'speaker_3': 'a council referral and singling out these particular principles, three principles seems to elevate them to a certain level that maybe they should share with other principles of good budget practice. And I, I, I do understand in, in vice mayor matters.'",
        "'speaker_3': 'He has certainly served in different administrations. Different administrations change. And but I think we've learned a lot from the past. I think that we, or at least those of us and I believe our new colleagues are all very mindful of what we face in our budget, the deficit and what we need to the debts we need to'",
        "'speaker_3': 'pay down. And so I think that I. I've been very satisfied with the work and the reports that have come out of the finance department. I miss terribly our former finance director, Fred Marsh. But I think our interim Jo-Anne Boyer is doing a good job too.'",
        "'speaker_3': 'But they have, I think, managed to breakdown the budget into clear, understandable language. And so I'm I'm just not sure that this needs to be a direction to the city manager at this time, but yet these principles can be considered along with others when we come to our budget talks.'",
        "'speaker_0': 'In November day.'",
        "'speaker_5': 'So thank you. You know, I think maybe this is the crux of the issue as I see it. And I'm not saying that this is a crux for anyone else. For me, the crux of the issue is that.'",
        "'speaker_5': 'We have we have known for the longest time since the 1990s. Particularly starting in 2000, that our budget is structurally. Impaired, so to speak. We have known that in the late 1990s. We knew that with the base closure and the impending impacts that were coming down, that the impacts were large and they were going to always be'",
        "'speaker_5': 'there. But the revenue with which we are going to deal with the incremental impacts weren't adequate. Likewise in the 2000. With the increase in our outstanding liabilities. OPEB as well as CalPERS, that we can see that we had not just the ongoing liabilities, but we also had to do the, you know, as as former Councilmember Doug Haan'",
        "'speaker_5': 'used to say in the out years. So and that our revenue stream coming in relative not just on an annual basis but on a cumulative basis relative to our our current and ongoing and unfunded liabilities. It was inadequate that it it it at that so that there was a structural problem with regard to our budget.'",
        "'speaker_5': 'We've known that. By necessity. It is the city managers ask whether it's in Flint, Rob Wonder or. Or Debbie Carita or. John Russo. By necessity, it is their task to juggle a lot of balls, to chip away at our long term obligations while trying to maintain current services as as well as possible.'",
        "'speaker_5': 'And as a result, sometimes that they will take a look at the general fund reserves, perhaps dip into it to pay to help pay for ongoing operations. Or other times maybe they will take some make some cuts and then put that savings into the general fund reserve.'",
        "'speaker_5': 'Or by necessity, they will deal with one time revenues and deal to sometimes perhaps deal with ongoing needs. All the information is always out there. It's the responsibility of the council members on behalf of the residents to ask the tough questions that if we didn't solve, you know, the structural deficit, our budget.'",
        "'speaker_5': 'Are we moving in the right direction or it's not resolving it? And the question is always, do you trust staff? Ultimately, that's what it comes down to. You trust staff that they're working in the interest of solving these outstanding issues.'",
        "'speaker_5': 'In the city manager and previous city managers. I know that we've always worked our level best. So to me, that's the crux of the matter is I'm not I don't think we have to prescribe to a tee what it is that the city manager has to do.'",
        "'speaker_5': 'So long as we're clear as to what our best practices are as well as what are our expectations. And we transmit our are and communicate that with the city manager as well as the residents.'",
        "'speaker_0': 'So I'd like to speak to the side of I was just at a conference member OTI was also there for training for new mayors and council members and when it got to the fiscal issue for the state of California, they discussed Alameda County City's unfunded OPEB liability, which is in regards to as a percent of our general'",
        "'speaker_0': 'fund. And they had a chart that showed that the range from all the cities in the county of Alameda. And this goes to why this is very significant. And the range was 7% to 140% of this unfunded liability as a percent of the general fund as of June 2013.'",
        "'speaker_0': 'And Albany was at 7% and Alameda was at 140%. We had the highest percentage in regards to our general fund. And being the mayor of this city, when this chart was flashed in front of a room full of new members and mayors, all of a sudden everyone was looking at me.'",
        "'speaker_0': 'So we all recognized statewide that this is an important issue. So I truly do appreciate why the vice mayor's bringing this referral. And in regards to these other comments, and I and I also support and this is. I want to look at this language because.'",
        "'speaker_0': 'We have each of us do have a responsibility of due diligence to ask questions when the budget is presented. I have had meetings with staff in regards to the budget process and we will be having ample public meetings, workshops to include the public in this discussion.'",
        "'speaker_0': 'And the first part of it is, you know, request city council, direct city manager to take specific steps in preparing a structurally sustainable general fund budget for the upcoming fiscal year 2015 2017 cycle. And I actually have concerns in regards to that language.'",
        "'speaker_0': 'This is a long term process. We all know we are not going to be able to address this issue in this two year cycle that is here. And what I am actually looking for is a long term plan in regards to how we are going to chip away and and address this issue.'",
        "'speaker_0': 'And and these points are good principles that I'm sure we all out of context would say, yes, we fully support. However, without the information of our finance director and I also agree in regards to our city treasurer, our city auditor, having their input.'",
        "'speaker_0': 'I it's my understanding this is what the process will be, that we will have the opportunity, we will discuss assumptions, we will have input. And this is why. And so now City Manager Warming Dam, could you clarify what will be happening with the budget process?'",
        "'speaker_1': 'Certainly. So we are looking at kicking off the budget process. I'm sorry, I don't have the actual date in my head. Do you remember me? Okay. Was it March coming? I think we're coming to council in the beginning of March and we'll be the very first meeting will be a kick off meeting, and I'll be talking about'",
        "'speaker_1': 'assumptions, sort of some of the the the the actual schedule. And that would be the time that we would talk about this. And if I may, I think I also do appreciate the flexibility from the other council members.'",
        "'speaker_1': 'I also appreciate the fiscal your concern. The vice mayor is concerned with the fiscal health. And I think I'd like to suggest maybe some some language that might help, which would be requests that the city manager, the city council direct the city manager, prepare the general fund budget for the upcoming two year cycle and ensure that the'",
        "'speaker_1': 'following principles are defined and critically evaluated during the budget process. And I think that's kind of what you're looking at to make sure that we really these are important I have gone to. Right. So you just want us to make sure that these are very important principles.'",
        "'speaker_1': 'We should be following them. We may not be able to follow them for particular reason, like we were in a recession and we couldn't follow them and we had to use our rainy day fund. So we needed that flexibility.'",
        "'speaker_1': 'But I think what your what the vice mayor is asking is that we critically evaluate these pieces and we included in the budget process. I think we are totally okay pursuing that and again, defining. Exactly. Exactly. Because you're right.'",
        "'speaker_1': 'Advances, loans and transfers from other funds. That has a whole set of definitions that I think are really important because some of these things you are ongoing, you get them every year and you would include them as your revenue.'",
        "'speaker_1': 'Some things are not there one time and you would not include them. So I think we do want to define them and we can do that in in our in the process.'",
        "'speaker_0': 'So so and that is something that I actually I'm confident staff would do without our direction. And I truly do. And if if there is ever a definition that we don't think staff has adequately defined, then I'm confident that we can always remind, you know, and ask the question and then it comes back to us.'",
        "'speaker_0': 'So I'll go back to Vice Mayor, if you'd like to frame a referral that you think is appropriate.'",
        "'speaker_3': 'May I make a comment motion?'",
        "'speaker_0': 'Oh, yes, yes.'",
        "'speaker_3': 'So I just want to say I've really enjoyed watching and listening to this discussion. I think it's been a really nice example of interaction among all the council and staff, and we have created something that I think I'm prepared to actually support where I didn't think I would, because I think this former dam really honed in on'",
        "'speaker_3': 'the concerns on both sides of this issue and just made it better. I also appreciate the affirmation of the respect for staff, their input, their expertize and their abilities. I think too often people don't realize how much is done by staff before the five of us ever get up here to do our deliberating.'",
        "'speaker_3': 'So I think that's really nice to have that affirmation in public. I mean, with this, I'll turn the floor back over.'",
        "'speaker_4': 'And I like the language. I really appreciate help in having. It's obvious that you listened what I was saying to what my colleagues were saying, and I think that that makes this useful. So if the city clerk can read back the motion, that would be the motion I would make because it captured what my intention was.'",
        "'speaker_1': 'It would be the city council directed the city manager to prepare the general fund budget and ensure the items listed would be defined and critically evaluated.'",
        "'speaker_4': 'And those are those three points. And I would make that motion and also make a comment that. Even though it I specified fiscal year 20 1517 cycle it was so that would start right now and I do understand that we have a long way to go, but I think it's important that we do this ahead of the'",
        "'speaker_4': 'discussion so it doesn't get swallowed in.'",
        "'speaker_0': 'And I think we all agree with you. We have a motion. Is there a second member? Yes.'",
        "'speaker_6': 'Is the last paragraph still in the motion?'",
        "'speaker_4': 'Okay. No.'",
        "'speaker_6': 'I'm sorry. Can I hear it one more time, please?'",
        "'speaker_1': 'Direct. The City Council would direct the city manager to prepare the General Fund budget and ensure the three items listed would be defined and critically evaluate.'",
        "'speaker_6': 'The three items are one. One time revenues, advance loans and reserves.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'We have emotion. Is there a second?'",
        "'speaker_5': 'Um.'",
        "'speaker_3': 'Okay. Our second.'",
        "'speaker_0': 'And then at this point, the last paragraph was stricken. That was.'",
        "'speaker_4': 'Yes, because I think the assumption is that the Treasurer and the auditor are already involved.'",
        "'speaker_5': 'Remember what hesitation I exhibited moments ago was? Because I think going into this, I saw this discussion as being framed as something addressing the structural deficit, the nature of the structural deficit of the general of our of our budget, which we all know is there.'",
        "'speaker_5': 'But my sense then is that we've kind of moved away from from indicating that that this will indeed actually solve the structural general fund budget, a promise which I would say that was probably beyond the scope to begin with.'",
        "'speaker_5': 'So to go to the extent that that interpretation of what I guess is correct, and I'm supportive of this, I'm supportive of the literal wording of how it is now.'",
        "'speaker_3': 'QUESTION So are you the that.'",
        "'speaker_4': 'Is.'",
        "'speaker_5': 'Because I think this is important. What I'm trying to say is this is that if we follow the little wording of of the motion, there is no implied predicate of dot, dot, dot. Therefore, we are on the path of solving the structural deficit is that's a promise which I think we can't make.'",
        "'speaker_5': 'But I think the motion, as it stated now in and of itself, has value to the public. It is valuable to specify these three items.'",
        "'speaker_3': 'And my question to you is going to be, were you having trouble with the wording in preparing a structurally sustainable budget?'",
        "'speaker_5': 'No, because I didn't hear that word in the way that you read out.'",
        "'speaker_3': 'We did take that out. That's okay. Okay, then.'",
        "'speaker_5': 'Yeah. So that's fine. Yeah, I'm fine with the literal wording.'",
        "'speaker_4': 'That's why I appreciate this word.'",
        "'speaker_0': 'So I actually would like to go back member day to give comment regarding the three the three principles.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_0': 'So it's my understanding that we're not saying that these are things. These would be assumptions we would be considering along with other assumptions.'",
        "'speaker_1': 'That's right. We're going to define them and evaluate them.'",
        "'speaker_0': 'So this is intentionally broad. And I personally. I expect this is something that staff would have done without the referral. I don't think the referral is necessary to do this. I do expect that we will be working with staff.'",
        "'speaker_0': 'We will have the opportunity to do all of this. However, I will support the motion, but I do think it's redundant. So I'll call the question. All those in favor. I, I opposed.'",
        "'speaker_6': 'Abstain.'",
        "'speaker_5': 'On.'",
        "'speaker_0': 'So forth. Four in favor. One abstention. Thank you. And our next item. Three G can.'"
    ],
    "Re-establishment of the Economic Development Commission.": [
        "'speaker_1': 'Consider directing staff to reestablish the Economic Development Commission. This item was placed on the agenda at the request of Vice Mayor Madam.'",
        "'speaker_4': 'Okay. I'm having technical difficulties.'",
        "'speaker_3': 'What to do?'",
        "'speaker_4': 'I got checkerboards instead of my referral. Thank you for paper.'",
        "'speaker_2': 'Oh.'",
        "'speaker_4': 'Oh, thank you. This is better.'",
        "'speaker_3': 'Anyway. Been there. Done that.'",
        "'speaker_4': 'Given. The. Allen made a point to say, as a creator of jobs, given that we are still largely a bedroom community, dependent largely on residential property taxes for revenue, and given that I had a good experience and I think Council Member de Song and I started off at the same place on the Economic Development Commission that delivered'",
        "'speaker_4': 'a strategic plan to the city that had some successful outcomes, and particularly on Park Street. And given the future of. I would like this council to consider reestablishing the Economic Development Commission, and this would be in order to have a body that recommends policies and plans to the City Council for bringing businesses to Alameda and replacing jobs'",
        "'speaker_4': '. When the Navy left Alameda Point. This body could work with current businesses and business associations to attract and retain businesses in Alameda. And could work and coordinate with regional efforts to grow the local economy and to increase almeida's commercial tax base of.'",
        "'speaker_4': 'Thus relieving some of the pressure off of residential tax base and perform economic development activities at the direction of the city council. These can be very specific activities and I was further intrigued with the agenda items from the last two meetings with Right Spirit, Right Speed that came to town.'",
        "'speaker_4': 'They actually make something. And they're renting a building that they have a lease with option to buy. And it's a cutting edge business and a green business. And I'm curious, because they chose to come here without the essentials that have been described in many reports of things that need to attract a business like that.'",
        "'speaker_4': 'And I'd like to know why and how we can repeat that. And I'd also like to know how VF Outdoor it chose Alameda. And how Penumbra before them chose Alameda. Again, absent of some of those things that have been said to be absolutely necessary to bring these well-paid technical jobs to Alameda.'",
        "'speaker_4': 'And in the past, that was part of the function of of the Economic Development Commission. And I don't know if council member de SAC had the experience, but I certainly did as the chair to accompany the then mayor, Ralph Pizarro, on calls to prospective businesses to bring to Alameda and other members of the commission had that opportunity'",
        "'speaker_4': 'and other members of the council had that opportunity. And there was a concerted effort. Following a strategic plan that the Economic Development Commission prepared and presented the Council for adoption. So I think the time is right for this and I hope my colleagues will support it.'",
        "'speaker_0': 'So I'd like to go to staff next week to share to share the history of this committee. Is that the.'",
        "'speaker_4': 'Commission?'",
        "'speaker_0': 'The commission. Would you like to?'",
        "'speaker_1': 'Madam Mayor, I'm sorry. I didn't recognize the. The question that you had asked me when I was going to provide you with was just this a little bit of background that this item did come on October 1st, 2013, back to the Council?'",
        "'speaker_1': 'It wasn't that long ago, and there was a whole set of discussions at that time about why the Commission it was recommended that the commission go away and and what should go in its place. And I'm not sure that this council, because it was not included in the package week and that's part of the referral process.'",
        "'speaker_1': 'Right. But to go so that you all are aware of what actually was presented to take its place and I think that the council should have an opportunity to discuss that because it wasn't that we would just eliminate the EDC, it was that something else, a more nimble process, take its place.'",
        "'speaker_1': 'And I think it would be helpful for the Council to have the benefit of that conversation with with economic development manager Dale Doan, who's, you know, who's more recent, who's just been with us now nine months and has really done a lot of legwork in on economic development in general as well as Debbie Porter.'",
        "'speaker_1': 'So I think it would probably be better to have that come back and we can talk about it. And I know the vice LG member Ashcraft also had met with staff member Doan.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_3': 'Thank you. I did. And I also was I looked up the. The agenda item. I mean, that the previous council voted on this. A lot has happened since the Economic Development Commission was created. And I believe Mr. Matter City and Vice Mayor was one of the founders.'",
        "'speaker_3': 'I served on that commission too briefly before I went to the planning board. But as the staff report mentions, the the role of the Economic Development Commission was greatly reduced after we lost redevelopment money because that took away a lot of projects in the pipeline.'",
        "'speaker_3': 'Fortunately, some of them, like the theater, did get completed. But the the projects that the Economic Development Commission, their big projects were things like the Bayside Shopping Center, the historic Alameda Theater Cineplex and parking structure, Alameda Landing. And but by the time this council got around to eliminating voting to eliminate that particular commission in January of 2012'",
        "'speaker_3': ', the EDC had decided as a body to reduce its meetings to six times a year because they just weren't doing that much. There weren't that many projects coming to them. And in 2013, two of the four meetings by the time we got to October had already been canceled due to the limited number of agenda items.'",
        "'speaker_3': 'I even remember that a little bit when I was on the EDC and then in place of the EDC, because remember whenever we have a Border Commission, we have to have a staff member, staff it and a deputy city attorney attend the meetings and in the case of the Economic Development Department and Darrell Doan is our manager'",
        "'speaker_3': ', there are 2.5 full time employees, including him. And so then to take them off of the work that they do, going out and recruiting and attracting businesses to prepare staff reports and staff meetings, I would question is, you know, maybe not the best use of their time, but what was brought up in their place, what was created'",
        "'speaker_3': 'in their place, and we've seen some good results in recent days. Recent years is the use of ad hoc committees and task forces. And we remember the Fiscal Sustainability Committee was one of them. And then more recently last year, I guess now it was 2013, the America's Cup Ad Hoc Committee.'",
        "'speaker_3': 'And in that case, it was chaired by a highly respected and effective CEO of a local company with committee members from the maritime community in Alameda who brought their expertize and personal connections to this project and also created was a Mayor's Economic Development Advisory Panel composed of high level Alameda Businesses and Business Association executives.'",
        "'speaker_3': 'This is a seven member panel. So it the and I guess maybe this is one that needs to still needs to be staff because we have a we have a new mayor. But the idea and I think this former damn used the term being nimble was important because they could draw from different specialties and had, whether it'",
        "'speaker_3': 'was life sciences, specialty beverages or the maritime industries. And there's examples of local executives who helped the city in those capacities. For example, at at Saint George Spirits, we have Lance Winters, the master distiller who helped bring Faction Brewing Brewery to Alameda.'",
        "'speaker_3': 'And by attracting some of this talent, we have been able to leverage that because these folks in business know others and that is how we got right speed to the table. And so what and I I'm mindful of the concern that we continue to attract attract and retain business in Alameda point though I continue to believe based'",
        "'speaker_3': 'on the evidence we've heard from the businesses out there, that our biggest challenge is not so much attracting businesses. It's keeping the ones we have with the failing infrastructure. We heard last night and we heard last month about phone lines, electricity, water, sewage failures.'",
        "'speaker_3': 'It's hard to keep businesses. I understand that we've got some really exciting tenants out there now, and I think I'd like the council. I would like to see us find a way to kind of introduce some of these great, exciting tenants that I'm always surprised.'",
        "'speaker_3': 'I've seen lists, but I just think, you know, a little more information would really excite you. However, what I'm also hearing from meeting with a number of them is. Hey, you know, we came out here, it was kind of the Wild West.'",
        "'speaker_3': 'We were up for an adventure. That was 12 years ago. We can't keep doing this. It's costing us money. We've got to. As much as we love Alameda and we see the potential, we can't wait forever with Penumbra.'",
        "'speaker_3': 'I know the CEO. I've been there on a number of occasions and I will tell you, their employees wish they had more amenities. That CEO, because he's a big fan of a burrito place on Lincoln Avenue near Paisanos.'",
        "'speaker_3': 'Don't worry, they're staying. They're not leaving. But he's enticed him to open a burrito place out at Panera, well, adjacent to Penumbra. So his people have a place to go for their lunch because they know this is a busy company and they don't have time to go off, you know, to the main island.'",
        "'speaker_3': 'I will say just about the penumbra lunch room. The only place you've seen more microwave ovens is maybe at a Best Buy because they have so many employees and they can't, you know, leave very often to go for lunch.'",
        "'speaker_3': 'I've been to a food truck summit once a year. They'll do a food truck event for their employees. But no people out there. If there were more amenities, they would like more amenities. It's part of the reason the Harbor Bay Business Park still isn't fully occupied, so I'm mindful of staff time.'",
        "'speaker_3': 'Maybe this is another conversation to have, but I think the reasons that the EDC was discontinued are still valid and there are other things we might look at doing, sort of revitalizing a commission that was was terminated. If the economic development part of the general fund is in need of updating, we could look at that.'",
        "'speaker_3': 'But I, I am very hesitant about reestablishing this committee at this time. Thanks.'",
        "'speaker_2': 'Yes. If I may add two quick points. There is also a very practical reason for disbanding that one commission. Our city staff attend regular monthly meetings of various business organizations, and it turned out that they were meeting regularly with the same people that they would occasionally try to schedule for the EDC.'",
        "'speaker_2': 'They were seeing each other regularly anyway. So we're trying to make it more efficient. I think this if I could ask the vice mayor, these four points you have here A through D, I think the issue is wanting to know that these tasks are being performed.'",
        "'speaker_2': 'How is it being done? Who's doing it? And I think if we can have Mr. Doan bring a report back to the Council.'",
        "'speaker_4': 'To discuss this and.'",
        "'speaker_2': 'Some of these other issues that may satisfy what you're looking for. So if you might consider perhaps just tabling this referral for now until you hear that report.'",
        "'speaker_4': 'I think I'm open to that. I did hear a litany of of issues that I think the commission could work on. And I think the reasons of. For the commission, at least in the past when it was active and and it was truly accomplishing things where it was it had direction from the council to work on specific'",
        "'speaker_4': 'things that the downtown plan for parks. Park Street before that the blighted shopping center at the Fruitvale Bridge, which turned into Bridge Side Center, was not a redevelopment project. It was a a blight remediation project. And the commission has sufficient work.'",
        "'speaker_4': 'And the the deficiencies, both at the point and of the deficiencies at Harbor Bay were it's a matter of retaining businesses. Business retention was a big a big part of that commission back in the nineties and the early 2000, when we went from Silicone Island to something else.'",
        "'speaker_4': 'And it was kind of boom and bust time. And and I think that was the. Redevelopment was a small part of it that was trying to grapple with that, that recruitment and retention portion as well. So I'm willing to table this pending that information of.'",
        "'speaker_4': 'But I'd like to preserve the ability to bring it back with more justification. This is not enough for the council.'",
        "'speaker_0': 'One member already.'",
        "'speaker_6': 'If I just had a few comments. Actually, I'm not quite ready to dismiss this idea. I mean, I think it's it has a lot of merit. And I think if we were to vote today, I would probably say, let's go ahead and find ways where we can have a productive economic development commission.'",
        "'speaker_6': 'Staff can correct me if I'm wrong, but I thought. Right speed. Weren't they attracted by. Another tenant out there at Alameda Point. And then Councilmember Ashcraft talked about the the burrito place, you know, was attracted by another another tenant at Alameda Point to relocate.'",
        "'speaker_6': 'So I mean, that's kind of what I would envision the Economic Development Commission doing is business people in Alameda working to attract other businesses. And, you know, it's worked. So I know there were some issues with it in the past, but, you know, I'd like to see if we can kind of overcome those issues and reconstitute the'",
        "'speaker_6': 'commission. And, you know, I know this is a very diverse, you know, council. I think if you look at, you know, our backgrounds, our supporters, where we live, you know, we all probably know different people. Maybe between all of us.'",
        "'speaker_6': 'We probably, you know, know almost everybody in Alameda. But, you know, one thing that I think may be helpful also is that, you know, each council member probably knows a business person that they think would be an ideal person to help, you know, cheerlead for Alameda and attract businesses to Alameda.'",
        "'speaker_6': 'And if if we do reconstitute this commission, I would like to see, you know, each council member at least have, you know, an appointment. Maybe the mayor gets three or five or whatever it turns out to be. But, you know, so we can share some of the resources that we have.'",
        "'speaker_6': 'And, you know, I'd be inclined to support this vice mayor if he went forward with it today. But, you know, I'll defer to you if you want to if you want to continue it to another day.'",
        "'speaker_0': 'Sorry. Do you want to?'",
        "'speaker_3': 'Well, I was going to ask through the through the chair, if I could just ask Councilmember Otoo, your question.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Thank you. So what I heard you say about the ADC who were brought back could work as businesses, attracting other businesses. It's my understanding that that's what our Chamber of Commerce does. One of the functions that that they do and they're quite a broad based organization.'",
        "'speaker_6': 'And we. If many chambers of commerce, from what I understand, I still think, you know, I think it's a good idea.'",
        "'speaker_0': 'That we have one chamber of commerce, we have other companies.'",
        "'speaker_3': 'Businesses.'",
        "'speaker_2': 'Associations. Yes.'",
        "'speaker_6': 'I still think it's an idea worth considering. And you talked about redevelopment. The state actually did a replacement for redevelopment. Hopefully, we'll have a staff report on that soon. You know, I have our DS and and see if that can it can play a role in in some of these projects.'",
        "'speaker_6': 'But. I'm still supportive of your idea. Mr. Vice Mayor.'",
        "'speaker_0': 'Member Daisuke.'",
        "'speaker_5': 'Thank you. You know, for me, it's really a straightforward matter. A year and a half ago or so, we had established the Mayor's Economic Ad Hoc Economic Development Task Force. And on the night that we and his staff talked about it and established it.'",
        "'speaker_5': 'What excited me about that was. When I envisioned it, the names of the persons and the organizations that they represented. And the I mean, these were marquee organizations operating here in the city of Alameda. And what I envisioned was just what power, how powerful it would be to have a letter, I mean, from the mayor of Alameda'",
        "'speaker_5': 'and on the side of it indicating all the top flight businesses that are part of part of that task force. Because when it comes to attracting businesses to come to Alameda, I think that would be so. Impressive. The nature of the task force.'",
        "'speaker_5': 'To me, it's with actually the recent experience of Alameda in attracting businesses. For example, let's go back to write speed. Right. Speed was attracted to Alameda because they went to a conference in Healdsburg and at the conference in Healdsburg they met a person from Marconi last Google and that person they made Mr. Right interested in Alameda.'",
        "'speaker_5': 'So that is an indication of how networks personal contacts, the influence of such things. Even VF outdoors. I mean you know it was SRM making sure to do their due diligence in attracting the right businesses. That was a professional contact, to be sure.'",
        "'speaker_5': 'I mean, that's his job. But nonetheless, is is having the right people in the right networks. I kind of see the mayor's task force as as exactly that. I mean, if you can have on your letterhead someone that represents Wind River Intel, someone that represents Google slash McCartney, someone that represents the Oakland Raiders, I mean, these are'",
        "'speaker_5': 'national brand entities on your on your letterhead. That's powerful. And I think that's a model that we haven't built. I know Anne-Marie Gilmore was, you know, gung ho on that, and I think we need to continue that. So it's a model that I think we should continue.'",
        "'speaker_5': 'I hear what you're saying about the Economic Development Commission. But. I feel that we still need to give. That airs economic development as.'",
        "'speaker_0': 'And I'd like to I'd like to share. So I have the document that where this was the change occurred and and I really appreciate all of your comments but to share this, it said to create a mayor's economic development advisory panel composed of high level Alameda Business and Business Association executives.'",
        "'speaker_0': 'The purpose of the advisory panel would be to enhance the business climate of Alameda, business parks and commercial districts and support the growth of Alameda is identified commercial and industrial business clusters by providing both strategic policy and tactical business attraction and retention advice.'",
        "'speaker_0': 'The seven and it has a seven member panel would be appointed by the mayor to your terms and report to the City Council. In contrast to the EDC, the advisory panel would be a more flexible and informal structure with the city assessing this rich pool of experience and personal contacts by working with the advisors individually or in'",
        "'speaker_0': 'subgroups. And here it says that the advisory panel may officially convene once or twice per year, but it would be and there are differences in regards to an ad hoc committee and a commission in this, really. And that's something I, I support the I actually think this is progress.'",
        "'speaker_0': 'That's when this decision was made by the prior council. And I appreciate having the inside of the council members that were on the council when this decision was made. So and I'm not sure that other people knew that this conversation had or that this had been discussed.'",
        "'speaker_0': 'But I, I would agree with Member de Song in regards to this. And, and I don't know if we'd want to, you know, at this point what you would like to do. You'd want to have Mr. Doan come and speak with us about why this change was made.'",
        "'speaker_4': 'I, I think that we can all read why was change. I prefer a more formal and public process and I think a better plug in to the city. Um, I do think, though, that I don't want to. I want to table this for the moment.'",
        "'speaker_4': 'And come back with a I think, a more compelling argument. Because now I've heard the objections to it and. I don't think we need to take any more time at this point. We've had a we've had the issue heard.'",
        "'speaker_4': 'And I will come back with some additional information.'",
        "'speaker_0': 'And in regards to this, so it's my understanding that this is something that has been agreed upon. And we are we can move forward with this. Mayor's Economic Development Advisory Panel. It is my understanding, yes. That this is something that.'",
        "'speaker_2': 'Hurts.'",
        "'speaker_0': 'My heart. So I in regards to this issue, it is something that I am proceeding with. And I and I really do think, you know, I'm looking forward to this. I think this is a good step moving forward.'",
        "'speaker_4': 'Do I need to make a motion to table?'",
        "'speaker_0': 'All right. So next item, actually, our regular agenda item. So we just I understand is we just completed the items from the last meeting, except for if I'm sorry, five, eight, five, eight. Yes. Which is the designation of a voting delegate and alternate for the League of California Cities.'",
        "'speaker_0': 'And do we need a motion to address that now? Because I'd like to move that up. That was something that was on the agenda at the last meeting, and it's something we really do need to. This one gets appointed by this, I understand, is by discussion of the council.'",
        "'speaker_0': 'It's not by my appointment with a vote of approval. And I want to share the League of California Cities. I was provided with a document about what it is. East Bay Division. But while the meetings are held, monthly media announcements in locations are sent to the representative.'",
        "'speaker_0': 'The designation of voting delegate at annual conference requires council motion, which is why we're here. The mission is to expand and protect local control for cities through education and advocacy to enhance the quality of life for all Californians.'",
        "'speaker_0': 'And it's my understanding that the liaison had been council member TAM and the alternate had been council member de SAC. And at this point, as member TAM is no longer on our council, I would actually like to pass the comments to Member de SAC.'",
        "'speaker_0': 'So if he wanted to discuss any more about what it is and I personally, if you if you were interested would support this moving up and I don't know who else is interested in this, but if you could at least share what this is.'",
        "'speaker_5': 'Well. A-League. I was the city's representative also for the league to the league between in the years 2000, five, 2000. And I appreciated serving as alternate, which allowed me to attend meetings in Sacramento. The thing about the League of California Cities is that.'",
        "'speaker_5': 'As a group, the cities, through the various policymaking committees that they have actually influence major legislation. I'm a member of the Housing Community Development Subcommittee, and one of the things that that we really worked hard on was the massage parlor ordinance, because what many cities across California were concerned and that the state had basically taken over ways'",
        "'speaker_5': 'in which massage parlors are allowed to operate in locally. You would think that this should be a local decision, but this by state rule, they preempted that and this had been a concern over a number of years. But finally, when I started on the Policy Committee, members there had not only worked with state legislators, but they actually'",
        "'speaker_5': 'got the law changed so that the policymaking committees do have effect. So so being a member of a League of California Cities, I would certainly. I would like to.'",
        "'speaker_0': 'And you would like to continue as the liaison then as opposed to the alternative? Yes, you are. And I don't know.'",
        "'speaker_3': 'What else to say. I have a I was attending the East Bay League division meetings. Councilmember Tim and I and sometimes Councilmember de so great would come in those. Those are held at various you know, monthly meetings at various cities around the the East Bay.'",
        "'speaker_3': 'And I'd be happy to continue as that person representative of the East Bay League meetings.'",
        "'speaker_0': 'So I'm not sure what that is. If we could discuss this item first. I think that's a separate.'",
        "'speaker_3': 'Issue, not actually in what you were reading.'",
        "'speaker_0': 'But for this.'",
        "'speaker_3': 'But this is different.'",
        "'speaker_0': 'I think it is. I mean.'",
        "'speaker_3': 'Yeah, I'm sure it is. Because I wasn't. I would I would very much support. Councilmember de sag as being this the representative to a voting delegate for the league and this is on the state level. What I was saying is I just attend the more local ones.'",
        "'speaker_0': 'So we also need an alternate. My understanding for this one, we need a liaison and that would be member Dysart and then we need an alternate. Is anyone interested in being our alternate? That's something we need to decide tonight that we have to vote on.'",
        "'speaker_5': 'I just want to.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'Well, I got the. East Bay is. That's a different. Bigger cities.'",
        "'speaker_3': 'It's the League of California's Cities is bad division. But we we hear and we are informed of the pending legislation and we and various items and we, you know, go back to our cities a couple of times, Leon.'",
        "'speaker_3': 'And I would bring matters to the council, sometimes even to vote on or to get a letter from the city. But it is not the same as going to the statewide meetings and actually having a vote at the state league level.'",
        "'speaker_3': 'But no, it's the the more local version of the state league.'",
        "'speaker_0': 'I'm I'm sorry.'",
        "'speaker_1': 'That's the clarification. I think Linas served as both, so we kind of had one representative on the league. And I think the league is looking for an East Bay division representative and then the actual and and and they'll have a voting delegate for that one, too.'",
        "'speaker_1': 'And then the actual voting delegate for the actual conference itself is set. They give you a timeframe when they want you to take that motion and have you decide that person. But there is the overall arching decision of if you wanted to break it into two different representatives in the past, typically been one, you know, done both'",
        "'speaker_1': 'sides.'",
        "'speaker_0': 'So it's my understanding that we being asked to did you want to expand what I was told? Because I think that's contrary to what Steph told me. Oh.'",
        "'speaker_2': 'Right. So what you have to do here is is designate a voting delegate to represent the city of Alameda at their annual conference.'",
        "'speaker_1': 'That's in September, though. But with this.'",
        "'speaker_0': 'Well.'",
        "'speaker_5': 'So let's just make it straightforward then. And we'll iron out the East Bay matter when we can iron it out. But maybe. Or the voting delegate because that's what that's the question on the floor.'",
        "'speaker_0': 'That's what I want.'",
        "'speaker_4': 'To make a motion to.'",
        "'speaker_0': 'So.'",
        "'speaker_4': 'Nominate.'",
        "'speaker_0': 'So before so actually staff talk to me about needing something and it's my staff. So I want to make sure we're doing what we need to get done. And the East Bay, that I think is actually separate from how it was explained to me.'",
        "'speaker_0': 'If you could tell. Okay. So and we remember dates.'",
        "'speaker_2': 'As far as I'm aware we don't need to a council vote to.'",
        "'speaker_4': 'Have representative attend the East Bay meetings.'",
        "'speaker_0': 'Okay, so they're.'",
        "'speaker_2': 'Reading something different. Yeah. City clerk.'",
        "'speaker_1': 'Yeah. Well, the reason why this was brought up is the East Bay. The East Bay division actually got in touch asking who the voting delegate is. So they consider one in the same person. This is what I'm thinking.'",
        "'speaker_1': 'That's what I tried to explain earlier, and I'm sorry if I wasn't terribly clear, but they were looking for who the voting new voting delegate would be and to serve it, I think because.'",
        "'speaker_0': 'Because I do know that we have these dinner meetings, which I've been also there's a Mayors East Bay something also.'",
        "'speaker_1': 'Business Conference County.'",
        "'speaker_0': 'But there's dinner meetings that are like monthly that that I'm invited to is that there is one that I think council has to vote on. It's my understanding and that's.'",
        "'speaker_1': 'According to that email. It's the East Bay division of the league, not the state. And the next meeting is the 29th. Right. But they're looking who specifically who the voting delegate was because the voting delegate had left. And I mean, that's why I'm trying to read it.'",
        "'speaker_0': 'And that's for the annual conference.'",
        "'speaker_1': 'So I think that's why I'm saying I think it was always one in the same person. I don't think it has ever broken into two people.'",
        "'speaker_0': 'I'm sorry that sometimes.'",
        "'speaker_3': 'Well, Lina Councilmember Tamara. I would attend together. I think the reason they may want to know who the voting delegate is now, even though the conference isn't until May or until September, is that there are often these emails that we get about pending legislation and they may just want to, you know, I mean, very understandably keep us'",
        "'speaker_3': 'up to date on what the issues are, because all through the year, they do a very good job of keeping in touch with the council. So, yes, I guess. Well, what.'",
        "'speaker_5': 'If we did this? What I again, I'm more than happy to serve as the voting delegate. What and if we do that, what if we continue the practice? The way the way in which you had worked with Lina will be the way in which we and you and I work together.'",
        "'speaker_3': 'And I would add that.'",
        "'speaker_0': 'I'm going to want a role in the East Bay Park and the East Bay issue.'",
        "'speaker_3': 'We can work that out, but I think that.'",
        "'speaker_0': 'We should actually keep it separate. I wanted.'",
        "'speaker_3': 'Clarification.'",
        "'speaker_1': 'And then if they're going to have to wait, should we.'",
        "'speaker_3': 'Bring this back?'",
        "'speaker_0': 'So, you know, we need to decide this. And it's my understanding we need to vote for this voting delegate for the League of California Cities. And the way it was presented to me was we had a liaison and an alternate.'",
        "'speaker_1': 'Okay, so can I read me the exact email and maybe it'll help? They were they're going to be having an election of executive committee members at the January 29th East Bay Division meeting. So in order to be, I think, on the executive committee, you would have to be a voting delegate.'",
        "'speaker_1': 'And and so that's why they needed the information so that in case the city's voting delegate ends up on an executive committee.'",
        "'speaker_0': 'A. Okay.'",
        "'speaker_5': 'So I guess the question is, is the executive committee of the East Bay Cities separate from being a member to the east to the East Bay, bigger cities.'",
        "'speaker_0': 'Because. All right. So is this the one that goes to the meetings that are held monthly then? So at this point, I would I would like to make a motion to nominate Member de SAC as the liaison. The member Ashcraft as the alternate.'",
        "'speaker_0': 'Any comments? All those in favor.'",
        "'speaker_5': 'I and I will make sure to maintain the release the way that you had worked with.'",
        "'speaker_3': 'Yeah, yeah, yeah.'",
        "'speaker_0': 'Thank you. Now.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'And we'll. We'll do better in the future on that. I'm sure we're learning. Yeah. All right.'",
        "'speaker_5': 'Thank you, Madam Chair.'"
    ],
    "City Council Rules and Procedures and City Hall Open House.": [
        "'speaker_0': 'Now, we have for a which is actually I'm coming from the school board here in the past. On the school board, when we welcome new members, we would have a workshop where we would talk about our vision, our mission protocol, the just really an open workshop, welcoming the members and then including myself and then allowing us to'",
        "'speaker_0': 'discuss and and the staff would help guide us along with the sitting members so that then we can work together. And so I requested this be put on here. And when you read this, it says Discuss City Council rules and procedures for city council meetings and the possibility of holding a future City Hall open house.'",
        "'speaker_0': 'And I added that because when I was seated, I was invited to two days of meetings where heads, department heads would come from all of our departments. And then it's my understanding that they did the same thing with both together Vice Mayor and member Odie and my but, but what I think would have happened on the school'",
        "'speaker_0': 'board as we would have had a public meeting and brought in the department heads because the information that was shared with me is the majority, if not all, was not confidential. It is actually just information about really what they do, the number of employees they have, what their budget is.'",
        "'speaker_0': 'And I found it very informative. And so personally after that I came up with this term of coining it, the City Hall Open House, but and I have subsequently spoken with staff about this and a suggestion was that in the future as a school board meetings, we highlight a school every meeting and they get to come and'",
        "'speaker_0': 'talk briefly as in very briefly, I would think at most 10 minutes, something like that, to highlight their department. And the suggestion, my understanding from staff meeting with the department heads was that we would highlight a department that this would also dovetail into the budget where they would have an opportunity which which we will be working towards'",
        "'speaker_0': 'being very transparent on our budget and then also looking at having but I'm going to call a physical open house either at the library or at Mastec where we would set up tables and have our department heads there and information about each department and members of the public could come and talk to these people because some of'",
        "'speaker_0': 'us have no idea about what happens in this building or wherever else our department has actually function. And I found that very informative and I wanted to bring this matter here also. Yes.'",
        "'speaker_3': 'Member ASHCROFT And this actually isn't a comment on that. But I did want to just note that according to the Sunshine Law, which we're going to discuss tonight, too, if the city council goes past 11:00, three meetings in a row, we must then add extra city council meetings for the rest of the year.'",
        "'speaker_3': 'And I don't know about you, but that proposal doesn't attract me. So we're okay now because it's just 925, but we may want to think about economy of. Time, words, etc.. And of course, we all will come to emotion at some point as to whether to continue.'",
        "'speaker_3': 'So thank you for allowing me that comment.'",
        "'speaker_0': 'And and what staff did to support my request. As they tried to come up with all different resolutions and ordinances and then the Brown Act of things that support the workings of our council meetings. And so we could this is actually very open.'",
        "'speaker_0': 'Now, we do have some speaker slips. We have one. We have we have one. So I would like to start with that. That's all right. Council. Thank you. And our one is Susan Gallimore. Oh. Right. And you?'",
        "'speaker_3': 'Well, one less. Okay.'",
        "'speaker_0': 'Okay. So if there is something anyone from the public would like to add. Otherwise. I'd like to continue with. For me, the next item I wanted to discuss was actually agenda making, and I'm not sure where that fell under here, but on the school board, one thing that another thing we do.'",
        "'speaker_2': 'Point of order. Yes.'",
        "'speaker_6': 'We finished the discussion on the open house. Or is that.'",
        "'speaker_0': 'So I don't know if we want to. I don't really want I don't think we have to vote on that. I. Yes, yes, yes. Yes. Member Ashcroft.'",
        "'speaker_3': 'Well, one of my concerns that I wrote in my notes is I understand the council referral process. I understand it even better after we heard a number of them tonight. But I don't understand why this particular item didn't come to us as a council referral because we were just hearing about it.'",
        "'speaker_3': 'Now I have nothing in front of me to to refer to. And worse yet, the public doesn't know what we're talking about or any background to this either. So that's at least an item I'd like to reserve to discuss whether, since we're all members of the City Council, that if we want to have something considered, we should'",
        "'speaker_3': 'at least have to go through the council referral process. But I know Vice Mayor matters. You want to speak on the Open House proposal?'",
        "'speaker_4': 'I actually have a similar concern. Is that. We don't have any detail on. On that and are we going to discuss detail and refer it on? That was my question.'",
        "'speaker_0': 'So so.'",
        "'speaker_4': 'Okay. Because because one of the concerns I have is are our agendas with the lists, the work sent out. Our full. And I would hope that any open house or any show until you have an appropriate time. And that would probably mean a workshop or a meeting that.'",
        "'speaker_0': 'Separate. So. Did you want me to respond?'",
        "'speaker_4': 'Well, ask my I.'",
        "'speaker_3': 'The rest of the council. Yeah.'",
        "'speaker_4': 'What? And are we again? Is our end to make a recommendation on this tonight is to ask staff to do something because. In order for staff to do something, they have to have council direction. Right.'",
        "'speaker_0': 'So at this point, I. My intent is to just allow us to have an open discussion about if there are things here or other people have ideas of how we would be working together. Yes.'",
        "'speaker_3': 'And again, because I have recently reread our Sunshine Ordinance, I'm just concerned that I don't dispute that these are very interesting topics to raise. But I feel that we're doing this without the public having the benefit of, well, the public and the council having the benefit of any context.'",
        "'speaker_3': 'And I, I just I've never encountered something quite like this.'",
        "'speaker_0': 'So I could tell you why I'm bringing this up.'",
        "'speaker_3': 'In the spirit of hearing from our colleagues. Maybe.'",
        "'speaker_6': 'Thank you, Madam Mayor. I guess I have a few concerns. Also a new one on the open house. You know, I think as an idea, it's not a bad idea, but. We just gave staff a lot of work today.'",
        "'speaker_6': 'I think we gave staff a lot of work yesterday. And you know why I think it may be a good idea to think about? You know, I'm not quite sure I want to give them more work tonight on this because knowing our staff that if we ask them to do something, they're going to give it 110% and'",
        "'speaker_6': 'do the best job they can and be amazing at it. And to do that, I think, is going to take a tremendous amount of effort. And maybe this is something we table and and come back to maybe in the summertime.'",
        "'speaker_6': 'But, you know, looking at the discussion points, you know, the first one says, you know, submission matters and it refers to a municipal code section order of business refers to the municipal code section rules of order, municipal code section, start time and length and Municipal Code Section Continuation of items Municipal Code Section, teleconferencing, government code, Brown Act'",
        "'speaker_6': '. So, I mean, if we're going to consider changing those in the public really doesn't have any notice on what those proposed changes are. And I think if we're going to be thinking about changing ordinances and, you know, talking about the Brown Act, I think we should provide some guidance to the public and what those proposed changes are'",
        "'speaker_6': ', because I don't know what they are. You know, I don't have an opportunity to hear, you know, staff's in-depth analysis of what the impacts are. And, you know, I, I believe, don't even have to have two readings of an ordinance change.'",
        "'speaker_6': 'So I'm just, you know, I'm just not quite sure of, you know, what the outcome of tonight's meeting really is intended to to result in.'",
        "'speaker_0': 'So I'd like to respond to that. In regards to how when I'm running the meeting, I think I think it's important that we review these so that we do know in regards to the referral form. But the processes now today we, we went through it, but it wasn't necessarily as clean as it could have been.'",
        "'speaker_0': 'But I've seen, you know, in regards to how we're going to do the meeting with the Brown Act, what exactly the protocol is. What I'm used to from the school board is that we call an agenda item. We have staff presentation.'",
        "'speaker_0': 'We have clarifying questions. We have public comment. We have our discussion and then we have our motion. Which is the way I've been running the meetings.'",
        "'speaker_6': 'Yes. I mean, with all due respect, Mayor, I mean, you you are the mayor now. You're not on the school board. We have our own procedures. You know, I took a look at the school board's procedures today, and they are a lot different, you know, than ours.'",
        "'speaker_6': 'You referenced the the comment about being able to explain your no vote. I mean, that's in the school board procedures. I actually saw it. But, you know, we don't have that in our procedures. So, you know what? You're you've been promoted.'",
        "'speaker_6': 'There's no offense to the members of the school board.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'Madam Mayor. My interpretation of what we're dealing with is it seems to me it's it is appropriately a regular agenda item. And it's appropriate. And it's this will be further to the extent that we don't have any specific actions that alter any of the ordinances here.'",
        "'speaker_5': 'I think what I interpretation of what you're seeking to do is have a conversation about the submittal of matters, not necessarily saying we're going to alter the ordinance tonight, we're going to talk about it and flesh out. We're going to then have a discussion about order of business, and then we're going to have a discussion about rule'",
        "'speaker_5': 'of order that we're not. Because I don't think it will be brown. Perhaps brown. I don't know. We're not going to. Take specific actions that will alter any of this. So I don't. My sense is that we are not precluded from having such discussions.'",
        "'speaker_5': 'Now on the idea of the future City Hall. Now, I'm fine with that. Oh, he's just city hall. Open house. I mean.'",
        "'speaker_2': 'I get tired there and.'",
        "'speaker_0': 'I'm happy to bring that back as a referral. But I am. I appreciate that. I think it is important to have this conversation. A member Ashcraft.'",
        "'speaker_3': 'I agree with you, Mayor Spencer, that it's important to have the conversation. My concern is I think a lot of members of the public might like to be in on this conversation. And I'm wondering that whether you would consider tabling this to just our very next meeting, I checked and the agenda is still right for our first'",
        "'speaker_3': 'meeting in February, and I think it would give time for a staff report to be generated with maybe a little more meat on those bones to really launch into a.'",
        "'speaker_1': 'Oh, I just got to.'",
        "'speaker_3': 'The pageant has to go to tomorrow. So this.'",
        "'speaker_7': 'Staffer work.'",
        "'speaker_3': 'But.'",
        "'speaker_0': 'But we do have a speaker. Would you guys be out? Would you feel worth every day?'",
        "'speaker_5': 'Madam, I just want to make sure to say in my interpretation of this is that this is. Properly. Described. In the very first sentence, the background the mayor is requesting to give the new council and members of the public an opportunity to discuss the existing practices and protocols for the conduct of city business.'",
        "'speaker_5': 'It's a straightforward description of what we're doing. We're going to discuss existing practices and protocols. And from that is all I. Ordnance. Things are subsequently referenced there. So that is the frame of reference for our discussion. The public be more involved in it.'",
        "'speaker_5': 'My sense is that the mayor put it on the Wednesday, January 21st because there wasn't going to be any substantive outcomes, much in the way that when we make decisions on Tuesday, there are subsequent substantive outcomes with regard to many of these.'",
        "'speaker_5': 'And. The fact that it was on tonight, I think it was duly noticed by little. Brown Sunshine Ordinance, though I don't think we're very. From. Anything.'",
        "'speaker_0': 'Thank you at this point.'",
        "'speaker_4': 'Go ahead for this. I'd like to hear the public speak.'",
        "'speaker_0': 'I'd like to call Carol Goldstein.'",
        "'speaker_2': 'Tony. I think you need a cup of coffee. You're speaking more slowly than I could. Anyway.'",
        "'speaker_5': 'Blue Danube coffee office hours now.'",
        "'speaker_2': 'With. With all this speculation about what the public thinks about this item, I thought you might like to hear from a member of the public sitting in the gallery about what we think. I know there's not very many of us here, but I actually got excited about seeing this on the agenda.'",
        "'speaker_2': 'I didn't reread the Sunshine Ordinance or the Brown Act, or I just saw the words Future Open House, and I thought, Hey, that sounds like something fun and cool. As I know that I was on the planning board in the 1990s, I was put there by Ralph Bazardo after I applied for the Historical Advisory Board because I'd'",
        "'speaker_2': 'been on the board of directors of the Alameda Museum for five years, and he said, Well, I'd really like to have you on the planning board. I didn't even know what the planning board did, but I said okay.'",
        "'speaker_2': 'And boy was a wonderful it not only, you know, opened my eyes to what goes on in the city and. I have been interested in those things ever since. And I think that what this item said to me is if more people knew what the various boards and commissions in the city did, then there would be more'",
        "'speaker_2': '. More participation from the general public when it came to putting your name on an application to get on a board, because a lot of these city council meetings, they just fill up with people when something affects them in their neighborhood and then they get all hot about it and they take sides and people start arguing back and'",
        "'speaker_2': 'forth. But if more people in the city all over in general got on these boards and commissions from time to time, they have a better global appreciation for the way city business affects them and their neighbors in the East and the West and Central Bay Farm South Shore.'",
        "'speaker_2': 'So I hope this does come to fruition in the near future, if it if nothing more than to make it. More apparent to somebody and to anybody who just looks on the city website and wants to know, well, how does the city function?'",
        "'speaker_2': 'What how can I get involved in what would be the easiest way for me to do that? So that's my $0.02. Thank you.'",
        "'speaker_0': 'Thank you. We have another speaker slip now, Elizabeth Tuckwell.'",
        "'speaker_2': 'Madam Mayor and council members. My name is Elizabeth Tuckwell, and I just want to approach this from a very folksy, down to earth point of view. I in terms of protocols and practices, I think one enormous benefit that this council could do is to impart a an appearance of fairness that was not always there.'",
        "'speaker_2': 'I mean, I'm not trying to I don't want to be negative about this. I want to be positive. We want to have an image of fairness. We just want that the appearance of fairness is very, very important when it comes to city government.'",
        "'speaker_2': 'And we did not have that at all times with the prior council. What do I mean? For example, the order of speakers, at least at times, the order of speakers, which is not the order in which we turned in our pieces of paper.'",
        "'speaker_2': 'I'm not saying it always should be, but in some cases that order was changed so that, for example, the developer's representative was given the, you know, the honor of speaking last, which is speaking as a lawyer, you know, a very preferable position to be in.'",
        "'speaker_2': 'And I'm not saying that's wrong, but, you know, I think this is a type of thing that should be addressed in a transparent way rather than sort of hitting us by surprise, which is the way this came out so often in the prior council.'",
        "'speaker_2': 'Another similar example is very important issues that affect people's daily lives, like whether they're going to be able to park anywhere, you know, within a mile of where they live, this type of thing, these issues being put on the calendar in a place where it was perfectly obvious they were going to be discussed between 11 and one'",
        "'speaker_2': ', something like that. It was perfectly obvious that was the upgrade opportunity for discussion the public had. Now there is something a little bit duplicitous about that, and I know that Councilman decided, at least in one case, try to remediate that somewhat, but that was shot down.'",
        "'speaker_2': 'So that that's my that type of thing, I think would be a very I think that would be very noticeable. I think the public would love it and I think it could be done very easily without changing any of the rules or, you know, any of the official protocols, basically by abiding by the spirit of the law'",
        "'speaker_2': 'as well as the letter of the law. I think that's what it comes down to. Thank you very much.'",
        "'speaker_0': 'Thank you. And so to me, this is actually more a workshop. I have the word discussed there. And I really appreciate the audience standing up and telling us how can we best serve you and make our meetings something that you do feel like you are participating and that we are being transparent and open and and I, I'",
        "'speaker_0': 'prefer having a separate than a regular meeting because that's the, that's the meeting where we're coming to discuss specific items. That's not what this is. This to me is we are not going on a retreat. If we could go on a retreat, that would be a similar event.'",
        "'speaker_0': 'To me, this is we are limited. We all need to be here because of our sunshine ordinance, the way we Alameda does business, we we do this in front of the public and I appreciate member de Sox comments and member Ashcroft's in regards to well.'",
        "'speaker_0': 'I did work with staff. We spent quite a bit of time writing this up so that the public would be aware of what we are here speaking about. And we actually do have quite a few members of our public here listening to us and that really the objective is to help us move forward.'",
        "'speaker_0': 'And I really do appreciate the public's comments in regards to being transparent, open, in regards to the slips being turned in. But we are doing is that they are being. I call the names out in the order that they are turned in.'",
        "'speaker_0': 'I'm not changing them. Staff is not changing them. And as people come and continue to submit slips, then I put them at the bottom of the pile. So then I call them last and we keep them separate per agenda item.'",
        "'speaker_0': 'And I and I think that this is great and we're going to have another speaker soon and that's not supposed to happen here. By the way, we are your city council. We are here to serve you. Richard Banger.'",
        "'speaker_4': 'Thank you. This is as good a time as any to bring up one of my pet peeves. There aren't many people in the audience. In the council chambers tonight that I'm sure there are quite a few watching at home.'",
        "'speaker_4': 'I probably watch more from at home and from in the council chambers. There's nothing more. Perturbing. Been watching. A council meeting. And someone who is an expert with a PowerPoint talking about it. And that camera is on. And I don't have a clue what they're talking about.'",
        "'speaker_4': 'They're talking about a map. They're talking about drawings. And so whoever's running the audio visual department are no breaks. You know, if if someone is here, if an expert is called back up, it happened recently, I think it was with the Del Monte Project.'",
        "'speaker_4': 'And the architect, I think, was called back up and he said this and that and this and that about. I had no idea what he was talking about because the camera was not showing what was up on the screen.'",
        "'speaker_4': 'You all saw it. People here saw it. But that camera was on and I saw his face. I don't want to see the guy talking. I can hear him talking. I want to see or see the presentation. So, you know, it doesn't happen a lot.'",
        "'speaker_4': 'But and the other thing, I don't know if it's.'",
        "'speaker_2': 'Mm.'",
        "'speaker_4': 'Excuse me if it's been resolved yet, but there's been an ongoing problem with audio visual feed and you know, somebody will be talking here and then, then they're talking and but you know, or there's no audio at all.'",
        "'speaker_4': 'And Mel, you may get it on your computer but can't get it on the TV. And that's not helping people. You know, they're going to go back to CNN. You know, they're not they're not going to continue watching the at the the council meeting.'",
        "'speaker_4': 'So anyway, tighten up the.'",
        "'speaker_1': 'Ave dept and happy to address a couple of those concerns. Thank you, Richard. Unfortunately, we've had the exact opposite complaint where people have said you've sat on the same slide, they're shown they haven't moved the slide. And now I'm not getting to see the person speak because you've shown one slide this whole time and I wanted to'",
        "'speaker_1': 'see the person speak. So we've tried to react, and so we've come up with the solution, which I'm about to put the buzzer off. Saber, stop this. And okay, so we've come up with the solution where we're trying to put a split screen that shows the slide and the person.'",
        "'speaker_1': 'And so we're working on solutions like that. In in addition, unfortunately, Harbor Bay recently had an issue with the we connect into two different three different systems the Web, AT&T and Comcast. And my understanding was Harbor Bay was having an issue and it wasn't happening on the island.'",
        "'speaker_1': 'So that's even where we're already transmitting within here to there, you know, out to them. And then even there, even within their transmission, there's being interruptions at different points. So unfortunately, we do have some dated Comcast equipment and I have told many, many people and we have called and drilled into Comcast as much as we can.'",
        "'speaker_1': 'And I have also told people, when you're having problems, call Comcast, Li call Comcast. So we have worked really hard to address the issues and I really appreciate the feedback and you're always welcome to contact me any time for any of it.'",
        "'speaker_1': 'And the sound issue on the Internet, even just tonight, I had somebody saying I couldn't hear it on my iPad, but that it was working fine on the computer. So then it becomes like, what is your iPad? Not refreshing.'",
        "'speaker_1': 'It just gets really technical. And so, you know, hopefully you can try a couple of different sources and I'm sorry that you might have to do that. But, you know, it's interesting the way these problems just bubble up and we keep trying to resolve them.'",
        "'speaker_3': 'But I hope you can all see why we love our city attorney, city clerk Laura Weisinger.'",
        "'speaker_2': 'As we turn.'",
        "'speaker_3': 'Now, we like our city attorney, too. She was, but she wasn't the one.'",
        "'speaker_2': 'That, you.'",
        "'speaker_4': 'Know, that America will ever do. I mean.'",
        "'speaker_0': 'Yes. Vice Mayor.'",
        "'speaker_4': 'A couple of comments at the. Oops, thank you. Okay. Time's up here. The previous speaker reminded me of a comment that I was to relate tonight, that last night at about 1:00. The video went dark.'",
        "'speaker_0': 'I heard that too.'",
        "'speaker_4': 'And interested party.'",
        "'speaker_1': 'To clarify.'",
        "'speaker_4': 'Which on public access Comcast.'",
        "'speaker_0': 'On Comcast.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'So it was still going on the computer here?'",
        "'speaker_4': 'No, they don't know. I think it ran.'",
        "'speaker_2': 'Out of coffee at that hour. Okay.'",
        "'speaker_4': 'No, she was awake.'",
        "'speaker_0': 'But I had heard that also that it went.'",
        "'speaker_4': 'It was black. And people want to know what the end was. Yes. But with regard to the agenda item tonight, there are a couple of things that I'd like to comment on and I'd like to reiterate. For the open house or for the presentations of departments.'",
        "'speaker_4': 'My preference is those happen outside of a regular council meeting because I think they have to be given their due. And and it's not just because our agendas are full. It's. They have to be given full focus if we want to make sure that people understand and get the full, full benefit of the presentations.'",
        "'speaker_4': 'And the second is in looking at all all of our rules and in the one, two, three, four or five exhibits that are that are resolution or ordinance based. One of the things that strikes me, and I think you've alluded to it a couple of times, is that.'",
        "'speaker_4': 'How are our rules of operation I think could benefit by an adoption of either in part or in in total of of Robert's Rules of Order. And that requires some it's not magic. You can't flip a switch because it's like 700 pages.'",
        "'speaker_4': 'But it it helps the public and it helps us keep order and. And not talk over each other and and to put some structure that the the general public can recognize. Because the advantage I see in Robert's Rules of Orders, even though people don't know it, chapter and verse, most people recognize it and who belong to a'",
        "'speaker_4': 'club, who belong to an organization or a board. It's. But if followed and if there's a kind of a parliamentary procedure that it helps guide us and we can always suspend the rules if needed, that's that's allowed. But I think we would benefit and I think I would offer a potential way to get there would be to'",
        "'speaker_4': 'establish a rules committee that would deliver a product of of council members to deliver a product to the council. Much like when we have a charter review committee, which is council members who come back with proposed charter review.'",
        "'speaker_4': 'And we did that 2008 days ago. I think you were still on the council or. No.'",
        "'speaker_5': 'It wasn't.'",
        "'speaker_4': '26, but we there was a charter review committee that delivered a.'",
        "'speaker_5': 'And there was a council member, Tim and.'",
        "'speaker_4': 'Gilmore. Yes, yes. So I think those are the things that I think a rules committee might be a vehicle that we can use to. Adopt either in part or in total Robert's order to help guide the function of the.'",
        "'speaker_4': 'So then it's not it's not arbitrary. I'm not say arbitrary, but it doesn't float with either the emotion or the or the issue at hand.'",
        "'speaker_0': 'And what I'm used to working with is actually a modified Robert's Rules of Order. And and I and I agree with you. I think it's actually very important. I've. It's my understanding, strictly with Robert's rules, you're supposed to do your motion immediately of someone second and then you continue, which is different from the way I've been doing'",
        "'speaker_0': 'it. However, I would support that. So I do think this gives us, as a council, an opportunity to have input with the public's input in regards to how we want our meetings to be. But but we want that the procedural aspects of it to look like.'",
        "'speaker_0': 'And I think it is very, very I support those reasons why committees do Robert's rules and I would support having and maybe I need to bring in a referral at this point and not I mean so I'm not sure what's how staff how we would proceed but if but I'm happy to do that in regards to allowing'",
        "'speaker_0': 'us to have that discussion.'",
        "'speaker_4': 'Right now, if I understand this agenda, that's an idea. And if people are interested, they can submit a referral and we could agenda it so that the public knows. And I would also like to have have some background information to fill out what the other possibilities are.'",
        "'speaker_0': 'And I'd like to toss this to the public that's here or any of you familiar with Barbara's rules. Who would you appreciate if we were more if you know the order that I've been doing it, which I've shared?'",
        "'speaker_0': 'Are you content? Do you like the way our meetings have been going and feel free to, you know, give us any guidance? That's what this is about. Step up here. And I mean, this is a workshop and I'm sorry we're not in the round.'",
        "'speaker_0': 'If you want to use the mic, you could and I can reach David. She just asked. Come on up here. We could.'",
        "'speaker_1': 'My name is Ann Richter.'",
        "'speaker_7': 'I love it. Can you want.'",
        "'speaker_4': 'You can pull back to your level.'",
        "'speaker_7': 'I just think if you aren't comfortable with it is for you to do just that.'",
        "'speaker_1': 'And I think.'",
        "'speaker_7': 'That helps public to.'",
        "'speaker_0': 'Well, in another example, I'll say real quickly, as I have been allowing people to clap, and I think that the audience has been very respectful of each other. I personally think the meetings have flowed well and. And that the school board, we did allow clapping.'",
        "'speaker_0': 'And so it is a change. It's something that I'm allowing and it's been respectful from what I can tell. I actually don't think it slows down the meetings. I think we've been able to go through a lot of speakers, but I'm not and now I'm not sitting out there like I used to and I'm sitting here.'",
        "'speaker_0': 'But I mean, that's what this is supposed to be a discussion. I think Frank.'",
        "'speaker_7': 'Has a point.'",
        "'speaker_0': 'That you should talk about doing Robert's rules. Okay. Thank you so much. Thank you. Did anyone else want to speak?'",
        "'speaker_7': 'I appreciate the friendliness, the way you run the meetings. And I remember Mayor Beverly Johnson did so to, you know, people feel welcome here. It's their city hall. They feel free to speak. They're not lectured on what they shouldn't be doing.'",
        "'speaker_7': 'You encourage us to speak. And if somebody is a few seconds over the limit, you don't harass anybody or lecture. And if people are enthusiastic, let them express that it's an explore and applaud. So I really appreciate it.'",
        "'speaker_7': 'I like the structure of Robert's Rules of Order, and it's something that the whole country is familiar with. So I think it's a very good suggestion. Thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_3': 'Yeah, go ahead. No, no. I was going to say, I think we should hear from the city attorney at this point.'",
        "'speaker_0': 'Did you want to speak next? And then we're going to have some more members of our public. This is exactly what I wanted.'",
        "'speaker_2': 'But if you want to finish.'",
        "'speaker_3': 'Well, and I'll just note that it's always wonderful to see members of the public. By my count, there are ten of them out there. So it's, you know. It's a very intense but small but interested group. But we do appreciate the ten of you.'",
        "'speaker_3': 'And I would like to hear from.'",
        "'speaker_0': 'The well, if I may, Manama, and I know it's a workshop.'",
        "'speaker_2': 'So you're going to encourage people to continue.'",
        "'speaker_0': 'To address you, but to try to bring a little bit of maybe some structure to what we're trying to accomplish. So we all can get out of here tonight before 11:00. I think what we what we were finding is and what we pulled together as a staff is a.'",
        "'speaker_2': 'Series of resolutions, ordinances, those kinds of things, which over time.'",
        "'speaker_0': 'The council and your predecessors sitting in these chairs have adopted as to how they were going to go forward and conduct business. And they're kind of scattered all over, which is why you see so many different ones.'",
        "'speaker_2': 'And then we have the Sunshine Ordinance.'",
        "'speaker_0': 'Our our resolution.'",
        "'speaker_2': 'One of these.'",
        "'speaker_0': 'Resolutions that you have in your packet does reference Robert's rules. It says, these are the kinds of things that we're going to do, and it specifies various things which we identified in each section. But the fallback is to use as a guide.'",
        "'speaker_0': 'Robert's Rules of Order. I think most people do that. And yes, Robert's Rules.'",
        "'speaker_2': 'Of Order, most people are.'",
        "'speaker_0': 'Familiar with. But if you've actually looked at the book, it is 700 pages and it is incredibly.'",
        "'speaker_7': 'Dense and.'",
        "'speaker_0': 'Arcane. But people have even taken to doing a.'",
        "'speaker_2': 'Condensed version and user friendly versions of Robert's Rules of Order. So, I mean, that's.'",
        "'speaker_0': 'Something that if council wants to identify a.'",
        "'speaker_2': 'Committee to go forward.'",
        "'speaker_0': 'And pull that all together, you could consider all those kinds.'",
        "'speaker_2': 'Of things.'",
        "'speaker_0': 'I think what we were trying to.'",
        "'speaker_2': 'Do is because with the new mayor and with.'",
        "'speaker_0': 'Some different ideas about how she wanted.'",
        "'speaker_2': 'To run the meetings.'",
        "'speaker_0': 'We wanted to come back and say, okay, you know, so we don't get trapped in wheel. Is that what we.'",
        "'speaker_2': 'Should be.'",
        "'speaker_0': 'Doing? Is that a violation of what our previously adopted resolutions have been? Are ordinances to pull it together, try to get some guidance as to where you wanted it to be had headed, which is why it says discussion.'",
        "'speaker_0': 'And then we could go forward.'",
        "'speaker_2': 'In under whatever and whatever system you would prefer. I mean, if you want.'",
        "'speaker_0': 'Staff to try to come back and consolidate something, we need guidance.'",
        "'speaker_2': 'From you on these areas and any.'",
        "'speaker_0': 'Others that you could think of where we can at least try to.'",
        "'speaker_2': 'Produce something to come.'",
        "'speaker_0': 'Back as a discussion item then that you can go through or or vice mayor matters matter. This idea of if you want to appoint a committee and have that committee go through that process. But I think that's what we were.'",
        "'speaker_2': 'Trying to.'",
        "'speaker_0': 'Help have happened.'",
        "'speaker_2': 'Here. And so the things that the kinds of things that we have are the order of business, because there have been.'",
        "'speaker_0': 'Some discussion about, well, how do we establish what the order of business is? There's a resolution that it actually it's a sunshine ordinance that adopts the the order of business that that can be changed ordinance.'",
        "'speaker_2': 'Ordinances can be changed with this council. It takes two readings.'",
        "'speaker_0': 'Resolutions can be changed by this council. It only takes one meeting and one vote. But you have to have the resolution and it has to be properly noticed.'",
        "'speaker_2': 'And all of those kinds of things. So that's what we're trying to figure out, how you want to proceed. And these were the kinds of things that.'",
        "'speaker_0': 'We heard a staff already that were sort of.'",
        "'speaker_2': 'Areas where we didn't.'",
        "'speaker_0': 'Know how council wanted to go start times for the meetings, regular meeting dates.'",
        "'speaker_2': 'Continuing meetings, teleconferencing. Those are the kinds of things that we've heard and we don't know if council.'",
        "'speaker_0': 'Wants to pursue.'",
        "'speaker_2': 'Them or.'",
        "'speaker_0': 'Not. And that's what we're trying to get some sense of tonight. And Braskem.'",
        "'speaker_3': 'Thank you. One of the things that I want us to keep in mind is that, first of all, there's a saying it's not so grammatically correct, but if it ain't broke, don't fix it. But what you know, what is the problem?'",
        "'speaker_3': 'Is there a problem? What is it that we're trying to fix? Well, I appreciate that. We have a new mayor. We're all members of the council. And as a body now, we'll be making decisions that we think are in the best interest of the the council, the city at large, as have previous administrations.'",
        "'speaker_3': 'And that's why reading through these resolutions and ordinances that are in this are the attachments to this agenda item or whatever this is, isn't the it was interesting to see the evolution that, you know, we did things as a council in a certain way, and then that was found to be not such a good way.'",
        "'speaker_3': 'One example is that we now have the opportunity for public speakers at the beginning of our agenda for on items, not on the agenda. And then we have another opportunity at the end of the meeting. If they couldn't finish all the speakers in the 15 minutes that were allotted, I would be hesitant to go into changing things'",
        "'speaker_3': 'like the order of business, the start time of meetings, because I think those are procedures that are working now. Well, they've been thought out by a number of councils. So I just think that and also I try to be mindful whenever we're asking something of staff of how much else we're throwing at them, if it's something that'",
        "'speaker_3': 'really needs to be done right away. Of course, you know, they're there to do what we asked them to do. But if something is working reasonably well, I think there's a good reason to continue with that. With regard to the rules of order and just looking at these five different attachments.'",
        "'speaker_3': 'One thing that I thought and maybe this is what a rules subcommittee would would tackle, is that I think they could benefit from consolidation, because right now, in order to get an answer to a question, you've got to look at a number.'",
        "'speaker_3': 'And that's a lot of work just for for staff to do. They do it, but I think that would help us all going forward. So I just would, you know, as far as the if we want to go one by one on these items, the I think we always have to be mindful of staff time when we're'",
        "'speaker_3': 'scheduling things like extra workshops for an open house for them to present. Bear in mind staff who are here, the ones who were here yesterday on the two Alameda point items that we heard, they get here between seven and eight in the morning.'",
        "'speaker_3': 'They left this building at 130 in the morning. And so just ask yourself, how much more do we want to ask of our people who are already doing very good work for us and still have them produce their you know, they're humans, they're not machines.'",
        "'speaker_3': 'And so I do like the idea. I really liked what I think Carol Gladstone said about the more people know about boards and commissions and opportunities, the more that we'll see people coming forward in applying. And I get really nice emails from people saying, I just moved here, I'm really excited, I'd like to get involved, how could'",
        "'speaker_3': 'I do this? And there's so many good things, not just in this building, but all across our city. But back to what I started out saying, let's try to be focused at what is it we're trying to accomplish.'",
        "'speaker_3': 'It shouldn't just be a wish list of, oh, gosh, this would be nice. What, you know, kind of a triage. What's the most important thing we need to accomplish? Are some things pretty good and could be made better and other things maybe another time when we have more time to tackle and approach it that way.'",
        "'speaker_0': 'Okay. And yes. Do you want to come?'",
        "'speaker_2': 'Yes. I think you'd have to have your head in the sand not to notice that people are about to meet us all. Something wrong with the prior council? We have Mayor, Mayor Trish Spencer and Vice Mayor Frank Matarese.'",
        "'speaker_2': 'Both of these individuals got over 50%, over 50% of the Alameda vote. Vice mayor matter. He had he had three people. He was. Both of them had incumbents that they were fighting. Both of them unseated incumbents. There's an enormous advantage to incumbency, but the incumbents were voted out in favor of these two.'",
        "'speaker_2': 'Now, what does this tell us? Not everyone was happy with the prior council. I certainly appreciate Councilmember Ashcraft pointing out that there's just very few of us here. And obviously the inference is that we don't count. But be that as it may, I've got my 3 minutes.'",
        "'speaker_2': 'So I think the important thing is to create an atmosphere where people feel welcome, where people feel that their ideas are welcome, which we did not feel under the present council or their prior council. Forgive me. I remember at one of the meetings, one of the former council members stated, I don't care what the people of Alameda'",
        "'speaker_2': 'want, I care what they need. I have what they need. Now, what does that tell us that this council member thinks she knows better than we do what is best for us? None of us thought so, but that's where she expressed that sitting right there on the dais.'",
        "'speaker_2': 'So that's the kind of attitude we don't like. Personally, just my own experience with lots and lots of committee memberships. I would not I would not do the committee on on Robert's Rules of Order. I think you're getting yourself into a quicksand situation where you just get dragged down and down and down.'",
        "'speaker_2': 'I would particularly in light of what the city attorney has informed us, that it's very easy to change most of the rules under which you work, either with one one meeting or two meetings course proper. You know, everything has to be done right.'",
        "'speaker_2': 'But basically it's a lot easier than I had thought. Tell you the truth, I thought maybe you have to get a vote of the citizens or something like that. And it sounds like it's quite simple to do so, but I think that the goal should be not to adhere to particularly not to Robert's Rules of Order.'",
        "'speaker_2': 'I mean, I, I can't tell you how many times I've been in a group that tried to. They want to do things right, Nathan. That's the way to do it. And I don't think that's the way to do it.'",
        "'speaker_2': 'I think it is, as the city attorney said, very arcane. I think it was written for another era. I think the important thing is hit the the main points, make people feel welcome. Make them feel that everything is fair, that that that you're giving serious consideration to what we say.'",
        "'speaker_2': 'In other words, if there's going to be a lot of public input, don't schedule the meeting so that, you know, the public input is not going to start until 11 and it won't end until 130 or two, which definitely was done in the prior council.'",
        "'speaker_2': 'And then the next meeting schedule a special meeting for 5:00, because that's when you want to get your vote and you want to make sure you got time for your vote before the new council gets sworn in, which is going to happen at seven.'",
        "'speaker_2': 'So, you know, when you do things like that and then you say, oh, we gave the public every opportunity. I mean, they could stay here till 5 a.m. and I think they had an opportunity for public comment. See, this is the kind of thing that that turns people off.'",
        "'speaker_2': 'So I think if we just look at the overall goals and frankly, I would just forget about Robert's Rules word, because I think once you get into that, you just get bogged down. And even if you have a committee to try to whittle it down the way the city attorney suggested, I think that would be the next'",
        "'speaker_2': 'best thing to do. If you insist on an Robert's rules or I do it that we it down, but I wouldn't get into it at all. Anyway, thank you very much.'",
        "'speaker_0': 'So I'd like to respond to her comments real quick. This is achieving my goal. I love having members of the public here come stand up and tell us what they think is working, not work, and how we can best serve your needs.'",
        "'speaker_0': 'This is exactly meeting. My wife wanted to have this discussion and I appreciate that we can follow up with referrals and whatnot and I can when we will have an opportunity to work with staff more closely. I also want to respect the time we were here until 130 last night.'",
        "'speaker_0': 'I did not attend for us. When I set this. I did not realize that we would have we didn't know that we would have other agenda items from last night that would take that would go first. This is actually beyond the time that I would have had us here.'",
        "'speaker_0': 'But so briefly as other members want to finish up and then we can resume in the future.'",
        "'speaker_6': 'Yeah, I'm just a tad bit concerned about, you know, the way this meeting has gone kind of down a rabbit hole and that it's turned into a, you know, session that criticizes the former council. And, you know, is I mean, the public obviously has a right to their opinion and a right to speak it.'",
        "'speaker_6': 'But, you know that the intention of this meeting was to, you know, sit there and bash the previous mayor and bash the previous council. Then, you know, you know, I think we're we're done because I don't think we need to hear that anymore.'",
        "'speaker_6': 'I mean, council member or Vice Mayor Matta Ricci put a referral on earlier today about moving forward on the the East Bay Regional Parks. And I think we need to move forward. You know, the election is over. I also won, by the way, and defeated incumbent.'",
        "'speaker_6': 'Just just for for clarification and to make sure the record knows that. And, you know, if you subtract the undervotes, then none of us except a lot of Hansberry got a majority of the vote. So, you know, you can spin anything and.'",
        "'speaker_6': 'Any way you want. But, you know, I don't have a problem with going through this and I don't have a problem with the mayor exercising her prerogative on how she wants to order the speakers and and run a medium.'",
        "'speaker_6': 'And that that's that's that's our prerogative. And if we want to discuss some middle of matters and order business and rules of order that that's another problem with that. But, you know, this is going to turn into, you know, a gripe session about, you know, the previous council.'",
        "'speaker_6': 'You know, I'd just as soon move to adjourn met.'",
        "'speaker_0': 'So I appreciate that. I'd actually like to be able to respond. I think that that unfortunately takes out of context what the intent was the intent of as a stated here, however, I am always welcome to public participation in our meetings and.'",
        "'speaker_0': 'This is a public meeting and this part. So so I appreciate that. But for me, this was very productive. And member Ashcraft.'",
        "'speaker_3': 'Thank you. If I could just take a moment to refer to the Sunshine Committee, a sunshine ordinance. I was reading it over this afternoon and then I had a phone call from my daughter. And this really is related.'",
        "'speaker_3': 'My daughter, who's 23 years old, is going to be on her way to London tomorrow. She's helping put on a workshop for she works for an NGO in Washington, D.C., that supports emerging democracies around the world. And her particular country of focus is Egypt.'",
        "'speaker_3': 'And because right now it is not safe for people who are trying to support democratic processes and parties in Egypt to meet in Egypt, they're meeting in London, but just getting arranging visas for all these people. And they have speakers coming in.'",
        "'speaker_3': 'Members of the Egypt of the British parliament are speaking and a number of different things. But to hear her tell about and she's she's done a number of these workshops in the last year. What these people are struggling with just because this is the first time that Egypt has had elected city councils and this particular workshop everybody'",
        "'speaker_3': 'is for city council members and for them. I mean, they really are risking their lives the jeopardy of their family investigation, she says. They always suspected at least one of their participants is actually from the government and is just, you know, keeping an eye on what's going on.'",
        "'speaker_3': 'And so I want to bring that back from Cairo and all the different provinces around Egypt and what they'll be doing in London over the next week. Back to the city of Alameda. And the purpose of the Sunshine Committee and the language that I found very powerful was that it is the city's duty to serve the public'",
        "'speaker_3': 'and to accommodate those who wish to obtain information about or participate in the process of making decisions. The right of the people to know what their government and those acting on behalf of their government are doing is fundamental to a democracy.'",
        "'speaker_3': 'And with very few exceptions, which this ordinance will clarify that right supersedes any other policy interest government officials may use to prevent public access to information. And it goes on to talk about, you know, assuring that all citizens have equal access to their government.'",
        "'speaker_3': 'But to me, that language is powerful. But it also reminds us that too often we take the benefits of a democratic society for granted. And I think we're doing a little bit of that tonight. I think we forget the purpose that we were elected here for.'",
        "'speaker_3': 'I think it is a noble undertaking all of us spend. We know how much time we spend preparing, reading, listening to our constituents. And I want to always make sure that this body serves our public. You, you in this room.'",
        "'speaker_3': 'And I do respect and appreciate all of you and everybody else, all 74,000 plus residents of this island that we do our best job in representing you. I do not think we're doing our best job when we let ourselves, as Councilmember Otis said, go down this dark hole of looking back, of attacking, of getting that last poke'",
        "'speaker_3': 'in. Everyone was elected. It's that's the democratic process. We can step forward and run for election without worry about repercussion to ourselves and our families. Once we hold this office, I think we have to conduct ourselves and in the manner that is expected of us, it's what our public would expect of us to put our best foot'",
        "'speaker_3': 'forward. And so I do think it's time to look forward that whether you won by the slimmest of margins or an overwhelming landslide, it doesn't matter. Once you're in office, you represent the people. And I think we all always just want to remind ourselves of the ideals that we represent, because from our founding fathers in Washington all'",
        "'speaker_3': 'the way down to Alameda, we're doing the people's business and we need to do it in the best way possible. Thank you.'",
        "'speaker_0': 'So. I don't think it was disrespectful to call this meeting. It was to discuss these items. And that was what occurred this evening. And member de SAC.'",
        "'speaker_5': 'I just want to say, I think the intent of the workshop is right on. I think it's about letting people understand the way in which government works. It's about opening the doors of City Hall even wider. And I think, you know, the intent and the effort is noble.'",
        "'speaker_5': 'And I think the substantive matters that are being examined are are are worthy of examination. And ultimately, we're not making any final decisions. We're having this workshop. We're gathering, you know, persons perspectives. And one thing I hadn't done was offer my perspectives.'",
        "'speaker_5': 'So for tonight, let me just say this. The views raised up here on the dais, I don't think there are any wrong views. And I do think, though, that, you know, having served on council, going on 13 years with four different mayors.'",
        "'speaker_5': 'Call me old school, but I'm kind of fine with the with the way in which we're operating. I'm fine with the middle of matters in an order of business is everything there. So but I think it's still a worthwhile to have, you know, works out like this because, you know, maybe if any one of the council members'",
        "'speaker_5': 'wants to pursue altering any one of these items that I read, maybe down the road, I'll change my mind. But for now, call me old school. I think I'm fine with how we do things.'",
        "'speaker_0': 'And the other member comments.'",
        "'speaker_6': 'And just one more. I'm sorry. Just to clarify, I never said that it was disrespectful to have this meeting and call this agenda. And I can agree with Councilmember de Song. You know, maybe there are better ways to do things, you know?'",
        "'speaker_6': 'I think we're doing fine as we are. As Councilmember Ashcraft said, if it ain't broke, don't fix it now. But, you know, we should feel free to bring suggestions. You know, I have no problem with that. And I have no problem with discussing those suggestions and having a public hearing and those suggestions.'",
        "'speaker_6': 'But, you know, for my mind, I think I think it's fine as we are. You know, I think we're doing fine. And I but I do think it was valuable to share this information. So we all you know, we're aware of some of these rules and procedures because I didn't know some of these rules and procedures until'",
        "'speaker_6': 'I read the agenda. So thank you for doing that.'",
        "'speaker_0': 'So I appreciate that. That's what we're trying to move forward. Sharing vice mayor.'",
        "'speaker_4': 'And the election is over. And I think, you know, we get what we get from the public. And I think our statements were focused on what the job at hand is, is is really important to move on with that.'",
        "'speaker_4': 'And it also sends a message to the public, we're here. We're here to work. And again, going back to my comments, I, I want to make sure that when we consider and we consider deliberately with a vote to have an open house, I think they're considerations of staff and their considerations of getting the focus.'",
        "'speaker_4': 'And secondly. I think if it's not fix, I mean, if it's not broken, don't try and fix it. But there's also something called continuous improvement and just listening in the last two nights on reconstructing the motion so that we can vote on it.'",
        "'speaker_4': 'The longer the time that passes, between the time the motion is made and the time the second occurs, it either gets better or it gets unintelligible. And I think there are certain certain aspects of a system like Robert's Rules of Order or some other system of order that gets the motion on the table.'",
        "'speaker_4': 'It gets a second, so then it can be discussed, and then we can check back and modify something that's real. And that's just the the practical application for my comment on establishing either some points of Robert's Rules of Order specifically, rather than reference in a book that 780 pages or whatever it is and some parts are arcane'",
        "'speaker_4': ', but some parts are very practical and. We have to walk the line between freedom of speech, freedom of expression and practical policy applications to people who have to run our city. So. I think this is important. And if we do get an accumulation or need a consolidation of these, I would advocate a rules committee because it frees'",
        "'speaker_4': 'staff up. There's less staff, but there is some expertize that's brought to the table because it's council members and in the past it's work with or charter review. So I just want to emphasize those points and thank you for the opportunity.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Amber Ashcraft to follow up on that. I think that I don't disagree with anything except that Robert's Rules of Order thing, but I, I do think we have a procedure for the way we are supposed to make motions.'",
        "'speaker_3': 'And second of all, there's I think we got in a little loosey goosey as we've gotten at some of that might just be something the city attorney can give us a little workshop on or even a a writing.'",
        "'speaker_3': 'I know when I was president of the planning board, I had I think maybe it was from the the it was probably the planning association, but they had a really nice guide and I always had a copy of the one that told you how to run it, you know, how to handle a motion.'",
        "'speaker_3': 'And it's, I mean, it's not intuitive. So I like my cheat sheets. But that said, I do think the consolidation would be a good thing, just going through all those attachments and to the point that the vice mayor raises about a rules subcommittee.'",
        "'speaker_3': 'We've worked together well and another little committee a few years back, and I would be happy if the vice mayor was interested in being on the Rules Committee to this point.'",
        "'speaker_0': 'And I'd like to keep up the discussion. That's what that was.'",
        "'speaker_3': 'But then in the last point I was going to make, though, is and again, looking over our last two agendas and as you can see, we had two bumps the three times. Apologies to those of you stalwarts who came back three times.'",
        "'speaker_3': 'I think we need to. I'm not sure how, but consider the number of council referrals that go on to an agenda. Maybe it's just because it's the beginning of a new administration and everybody had things they wanted to bring up.'",
        "'speaker_3': 'But if we have seven or eight every time and it's just going to get really long and then it is would be my preference that we are all able to do council referrals, to get agenda items, to get items on the agenda, but only through council referrals.'",
        "'speaker_3': 'And even though the mayor is the mayor, I, I think that it's more informative to the public and helpful to council members and staff to have those ideas come through a council referral.'",
        "'speaker_0': 'So it's my understanding that in regards to how this has been done in the past, the Mayor works with the city manager and Laura to submit items directly, which is my understanding of how it has worked in the past that the mayor did not submit referral slips.'",
        "'speaker_0': 'However, at this point I actually want to adjourn the meeting. This has gone on longer than I had intended, and we were here until 130, with all due respect. Yes. So at this point, with all due respect, if I that during the meeting and I appreciate everyone's input this evening, I.'",
        "'speaker_3': 'Think you need a motion to adjourn.'",
        "'speaker_0': 'Don't you think so? No.'",
        "'speaker_6': 'And we do have we have a quick counsel communications, which I think.'",
        "'speaker_0': 'Oh, yes. Okay. All right.'",
        "'speaker_6': 'Yes. You go first and then I'll go.'",
        "'speaker_0': 'So.'",
        "'speaker_6': 'Or either way, I don't know.'",
        "'speaker_0': 'Someone that wants. Yes. So this workshop we have Council Communications is part of the workshop.'",
        "'speaker_3': 'Excuse me. You know, earlier. No, I don't think you realize that. Assistant City Manager. This Wormer Damn was trying to get your attention. Mayor Spencer. She had wanted to make a remark earlier, and we. We passed over. I'm sure you would.'",
        "'speaker_2': 'Be.'",
        "'speaker_3': 'Willing to hear from her.'",
        "'speaker_1': 'Thank you. Councilmember is he Ashcraft? I just actually would like to clear an issue that that was raised tonight, and it's not a big deal. But I think that on behalf of myself and the city clerk regarding the agenda process, because we are the ones who put together the agenda.'",
        "'speaker_1': 'And there was a comment tonight about that. We put controversial items at the end of the agenda to limit the ability for the public to speak. And I just want you all to know and I want the public to know that we do not do that.'",
        "'speaker_1': 'As you saw last night, we had just two items. Basically, we had the bass and we had housing that took up all of 4 hours, almost 5 hours to get through that. So we try our best to get those items up front, but sometimes we have MIDI items and we go late and there's nothing that we can'",
        "'speaker_1': 'do about that. And I apologize to the public. Laura and I worked very hard to get those items up front so that people can talk about it, can be heard. We're not trying to limit public dialog at all, so I just want to clear that for your benefit.'",
        "'speaker_1': 'So you know that we work very hard and we're happy to work with the mayor to make sure that we continue to do that. But just felt like I wanted to clear the record so that you all knew that that's not something that we do.'",
        "'speaker_0': 'And I appreciate that. Thank you. And I did I did not recognize that you were making a wave or whatever. So please. So moving on. So I did not realize that there was council comments and I actually thought the workshop was all comments.'",
        "'speaker_0': 'So if there's any concern.'",
        "'speaker_1': 'About that, it for the continued item.'",
        "'speaker_0': 'Oh for the continued. Yeah. Okay. And we already had those.'",
        "'speaker_1': 'Yeah. But you can still, it's still on the agenda.'",
        "'speaker_0': 'All right. So, um, so I'm not sure what comments you'd like to make, however, and let me just remind everyone at this point, it is 1023. So if you could really be brief, I don't want to discourage people from coming to my meetings.'"
    ]
}