{
    "Work Acceptance for Cross Alameda Trail - Jean Sweeney Open Space Park Project.": [
        "'speaker_2': 'Is a recommendation to accept the work of McGuire and Hastert for cross me to trade Jean Sweeney Open Space Park.'",
        "'speaker_0': 'And I am sorry the speaker's public. Okay. So we pull items when the public wants someone a member of the public wants to speak on it. We have. Okay. So we have two speakers, Dorothy Freeman. So you come on up and then.'",
        "'speaker_0': 'And Joe. But it has ceded time to her, so she gets up to 6 minutes. And then behind her is Brian Maguire. And those are the two speakers on the side of.'",
        "'speaker_1': 'Good evening. I'm Dorothy Freeman, representing.'",
        "'speaker_6': 'The Jean Sweeney.'",
        "'speaker_1': 'Open Space Park Fund. We hope you enjoy this short video of the first section of the future. Four mile cross Alameda Bike Trail with the adjacent walking and jogging paths. Construction was managed by our REC, our recreation and Parks Manager Director Amy Aldridge and built by Alameda McGuire and Hester Construction Company.'",
        "'speaker_6': 'Due to administrative errors.'",
        "'speaker_1': 'Due to administrative errors, not our city's. This trail almost didn't happen. Mayor Spencer, Director Aldridge, Jim Sweeney and myself traveled to Los Angeles to appeal to the Caltrans Board of Commissioners to allow an extension.'",
        "'speaker_6': 'On the due date.'",
        "'speaker_0': 'For the grant.'",
        "'speaker_1': 'Needed for construction. The appeal of a successful and construction started last summer. It has taken the effort of many of us to get to this phase place today. First, of course, was Jane Sweeney's vision of the park. Then, many citizens who attended meetings to give their input into the details for the park helped complete the design along'",
        "'speaker_1': 'the way. Many city councils, including this one, have always supported the park and the trails. We thank.'",
        "'speaker_6': 'Many recreation.'",
        "'speaker_1': 'And park commissioners by Clark.'",
        "'speaker_0': 'Alameda for.'",
        "'speaker_1': 'Their input. Planning Board Commissioner Christopher Koster and place works for their design work and many who donated time and money to make the park special. And our Recreation and Parks Director Amy.'",
        "'speaker_6': 'Wooldridge.'",
        "'speaker_1': 'And her staff, who have often jumped hurdles and walked through minefields to make so many things happen during each step.'",
        "'speaker_6': 'Along the way.'",
        "'speaker_1': 'Recreation and Parks has been working since 2013.'",
        "'speaker_6': 'On this.'",
        "'speaker_0': 'Very large project. Finally, we would like to thank.'",
        "'speaker_6': 'McGuire.'",
        "'speaker_1': 'And.'",
        "'speaker_6': 'Hester for their work.'",
        "'speaker_1': 'In building this phase of the project.'",
        "'speaker_6': 'They have been a good neighbor.'",
        "'speaker_1': 'Also donating funds.'",
        "'speaker_6': 'To feed.'",
        "'speaker_1': 'The volunteers who came out last fall to clean up the south side of the park. A bit more patience is required by all those who just want to come out and use the new trails. We anticipate by late summer or early fall, after 20 years of anticipation, the park will finally be open.'",
        "'speaker_1': 'Open. The trails will be use the picnic grounds for families to enjoy. Outdoor gatherings will be fired up and the East playgrounds will be ready for young family members to enjoy. Board members Tim Sweeney, who for some reason didn't make it here tonight.'",
        "'speaker_1': 'Former council member Doug Hahn and myself applaud this first major step and anticipate the others to come. Thank you very much.'",
        "'speaker_0': 'Brian Maguire.'",
        "'speaker_5': 'I didn't realize I would. Dorothy was such an accomplished drone pilot. That's pretty impressive stuff.'",
        "'speaker_6': 'You're right.'",
        "'speaker_5': 'Why do you do freelance for the military or CIA or anything? It's pretty good. So I think the video speaks for itself. It's pretty exciting to see that this path is done. $3 million, I think, worth of active transportation grants or so.'",
        "'speaker_5': 'And what is a two thirds of a mile? Maybe, maybe a little more. And it's done. It's ready today, but we're not going to open it for another six months or so, probably. Which I think is unfortunate. I think it's nice that this is there's an agenda item on this.'",
        "'speaker_5': 'I was going to do a stirring up and non agenda, but this way you can give feedback if you're so inclined. It would be really nice to, at a minimum, open these gates and let people start using this path when there's not active construction going on.'",
        "'speaker_5': 'Like, you know, after four or 5 p.m. and on the weekends while there's, you know, lots of sunlight from now for the next few months. It would be a shame for us to miss out on basically an entire spring and summer season of long evenings and nice weather.'",
        "'speaker_5': 'So if there's any way you can give direction and explore the opportunity of opening the path as much as possible now so that people can start using it, people can start getting out of their cars, people can start walking their dogs, taking advantage of what's there now.'",
        "'speaker_5': 'I think a lot of people are chomping at the bit to get at this. So we hope that you would consider accelerating the opportunity to open the gate instead of waiting until construction was done. We think we understand the argument that has been made that there's active construction going on.'",
        "'speaker_5': 'But we think if this was 3600 feet of road for passenger vehicles, that was complete and ready to alleviate congestion on the island or access to amenities that there would not be any hesitation in getting this open immediately.'",
        "'speaker_5': 'And we don't think people walking and jogging and biking should be forced to essentially wait till the sun goes down at 5 p.m. in the fall and the night start getting cold. Days and nights start getting colder and sort of lose an entire, you know, season an entire year.'",
        "'speaker_5': 'While it might be a minor inconvenience for the construction efforts, but I think it's really not that big a deal to open the gate when they're not driving. It doesn't look like they're driving a lot of earthmovers back and forth and heavy equipment maybe during the day, maybe during construction, during the week.'",
        "'speaker_5': 'But I think there's a lot of time that this path could provide a lot of use to the community now, and we should start getting the benefits of it. Thank you.'",
        "'speaker_0': 'Thank you. That completes our speakers on this item council. Did you want to make any comments? We have vice mayor, is.'",
        "'speaker_7': 'There somebody from staff who could comment? On the speakers question.'",
        "'speaker_4': 'I'd be happy to comment. Amy Wooldridge, Recreation Parks Director. A few things. One is that which was indicated in the staff report and in Bryan alluded to, is that we have during the day we have have equipment that's actually going back and forth across the trail and it was not included in the bid that they needed to'",
        "'speaker_4': 'provide product protection and safety crossing and all that that you would have if you had a street in future phases. That will be part of the requirement as an existing condition that they'll have to get get equipment safely across the path wall and and while pedestrians and bicyclists and such are using it.'",
        "'speaker_4': 'The other issue is because we weren't we we started to anticipate and realize that we weren't going to be able to time them correctly. We have the remainder. We can't just we would require two things. So it's it's possible.'",
        "'speaker_4': 'But here's what we require require additional funding for temporary fencing along both sides of the trail, all the way along the trail, and to secure around the existing construction zone, because we would have theft issues which we already have with the gates up.'",
        "'speaker_4': 'We already have people coming in and partying and leaving beer bottles. You know, we've already had theft problems of different materials on site, so we would have to fence all of that off. In addition, we haven't finished cleaning the rest of the site.'",
        "'speaker_4': 'As Dorothy mentioned, we had about 80 volunteers come. It was fantastic. Do a big cleanup. There's more hypodermic needles out there. There's more trash out there. We now have piles of bay mud. That's not. You actually could see it on the video that needs to get off hold and we need to figure that out before we open'",
        "'speaker_4': 'the park. So there's a lot of logistical issues. It's actually not a safe place yet for kids to run around. There's things that they could find that are simply not safe and are safety hazard.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_6': 'Thank you. Director Wooldridge I also got a little envious looking at the the video. It's lovely. It's really impressive what has been accomplished thus far and congratulations to everyone involved. I do. I would be interested in at least if we could get an estimate of what that fencing would cost and what I would envision.'",
        "'speaker_6': 'I understand the when there's ongoing construction, I don't think the juxtaposition of bicycles and earthmovers is a good one, but they don't do the work on the weekend. And if there was a way that we could secure the the construction equipment, I will bet you that if we were to do another volunteer work day, you'd have a'",
        "'speaker_6': 'great turnout of people to help with the cleanup. And I think that one of the benefits of at least on the weekend, getting the use going would be those eyes on the street that, you know, more people out there doing positive, constructive things mean less opportunity for people doing nefarious things.'",
        "'speaker_6': 'So I know there's a lot of a lot of balls to juggle, but I would certainly appreciate if staff could just do a little looking into what it might be feasible. Maybe it's yes, maybe it's no, but maybe if we could give it a try.'",
        "'speaker_6': 'Appreciate it. Thank you.'",
        "'speaker_0': 'Did any of the cast members want to speak at this time? Ninette, I do want to follow up in regards to I want to thank Dorothy Freeman for the video. And I wanted to share when she spoke about going down to L.A., that that actually was pretty much against all odds.'",
        "'speaker_0': 'They really do not like to give extensions. And it really did take a huge effort. I do want to commend Amy Roberts and her preparation and the work and then the team that went down. Jim Sweeney, Joe Woodard and Dorothy Freeman.'",
        "'speaker_0': 'I did participate with this thing was organized. So when we went down, we had work to do and then we were in fact persuasive. So thank you very, very much, because you all may not know you go down to L.A. and then there's this big room and they really do have all these roles.'",
        "'speaker_0': 'They monitor projects for the entire state, and they're so afraid that if they give us a concession, then every project they're trying to push through with deadlines, they'll be asked to give concessions, too. So that really.'",
        "'speaker_1': 'Was a.'",
        "'speaker_0': 'Heavy lift. So thank you very much. Vice Mayor Actually, I.'",
        "'speaker_7': 'Do have a couple comments. One thing is, if in future instances we're looking at doing the bike lanes, if we could look at what the additional costs would be or at least consider it when we're looking at these bids to have the crossings or to have use and what it would take, whether it's the fencing or whatever'",
        "'speaker_7': 'else, if we could at least have that option in the beginning to look at. I know I would appreciate it. I don't know about the rest of the council, but at least it would put the numbers out there for people to consider.'",
        "'speaker_7': 'And I think to Councilmember Ashcroft's point, I think it's, you know, if there's an opportunity for folks to go out and volunteer again to do another clean up, if that's something that we could get in the works, I think we should definitely talk to Bike Walk Alameda because they probably have an interest in in expediting things as'",
        "'speaker_7': 'well.'",
        "'speaker_0': 'And I would also encourage you to reach out to the Jean Sweeney Foundation group that has been really leading this charge. And I'm confident so I would also be interested in both the issues that she raised. But I do appreciate Ms..'",
        "'speaker_0': 'Aldridge's comments that in the future phases she is planning to do that.'",
        "'speaker_3': 'So mavrodi like the move approval of the item. Second.'",
        "'speaker_0': 'Although I push and thank you unanimously I was five C. Five H.'",
        "'speaker_2': 'Recommendation to approve the implementing regulations governing a request for proposal process for allocating limited privilege to apply for a cannabis business permit and the request for proposals. If you have speakers on the speakers.'",
        "'speaker_6': 'So it would have been.'",
        "'speaker_0': 'Oh. Okay. Okay. Do we have a present? We probably don't. So we have eight speakers on this staff. Did you want to introduce the item.'",
        "'speaker_1': 'Getting the mayor and city council? I'm Bill's butler with the Community Development Department. At our last meeting, the city council asked staff to come back and refine the RFP. That we presented the request for proposal that we presented to have objective scoring to increase the size of the selection panel and consider changes to the selection panel and'",
        "'speaker_1': 'to further decide to find site control. And that's what we've done. If you have other questions.'",
        "'speaker_6': 'Yeah. Mayor Member Ashcroft, if I may. Yeah, I really I was just telling Ms.. Art that sometimes I have time to e-mail my questions ahead of time, but it's been kind of a busy week or two and I didn't in so really my question.'",
        "'speaker_6': 'But I understand we also have speakers, but my question is on exhibit three. That's the evaluation criteria.'",
        "'speaker_1': 'Mm hmm.'",
        "'speaker_6': 'And the so the question is, are the scores for each category and for those who maybe aren't following along, you know, statement of qualifications, verifiable, detailed description of persons and type of resources, including financial, committed to employment, etc..'",
        "'speaker_6': 'It's exhibit three are the scores for each category because these this is evaluation criteria made by a panel. Right. And you've selected you've described in the report. Good report, by the way, how the panel is who who is represented on the panel.'",
        "'speaker_6': 'So are the scores for each category, the average score of the members of the selection panel? Or does the panel collectively agree on each numerical score for each item?'",
        "'speaker_1': 'So the score is going to be the average score. Okay. And they're not going to collectively agree on the score. Right.'",
        "'speaker_6': 'So you just they submit their their list and your average amount, correct. Okay. That was all I had. Thank you. And by the way, beautiful necklace.'",
        "'speaker_1': 'Thank you, Brody.'",
        "'speaker_3': 'Thank you, madam. I had a quick question. So I had met with one of the folks that's interested in the lab, and they mentioned there's a July 1st deadline for the state regarding testing labs. And it looks like this proposal has.'",
        "'speaker_3': 'Announcement of selected proposals in letters issued on July nine. So can you kind of just fill us in on on how that might interplay with the state deadline?'",
        "'speaker_1': 'Well when we came to you on. RFP. We had asked because of the deadlines of the state that we not include testing labs in the RFP process. But what the council indicated is it want it to be fair and include them in in the process.'",
        "'speaker_1': 'So as a result of that, they're going to be delayed if they want to come into Alameda based on the process.'",
        "'speaker_3': 'Okay. Thanks for that clarification.'",
        "'speaker_6': 'Did you have one more question? Thank you. On the panel, you have one of the categories, Representative Health. And I notice that you have our director of the Mastic Senior Center, Jackie Krauss. So can you just explain that the health background or health connection there?'",
        "'speaker_1': 'Well, the city doesn't really have health individuals. And so she is covering that because she interacts with seniors on a daily basis and knows a lot about their concern.'",
        "'speaker_6': 'I thought that might be a thank you.'",
        "'speaker_0': 'All right. I'm going to go ahead and call the speakers at this time. Okay. And Rich Moskowitz, Chris Bailey, and then Brian Brownlee.'",
        "'speaker_3': 'Mayor council members. My name is Rich Moskowitz. I speak to you tonight on the eve of moving forward with this RFP process. And I want you to take a moment to start with why this process is of such importance to myself and the three members of the group I represent, Alameda Cannabis Times.'",
        "'speaker_3': 'We as a group hold the belief that in order to show respect for our neighbors who did not want cannabis here, that the businesses that the process yield are the best businesses for Alameda, that we ensure that not only are they successful, but they actually become a foundation of our community.'",
        "'speaker_3': 'They do not alter the fabric of our community, but they enhance the fabric of our community. And we honestly believe that only if these businesses initially that you choose that the panel chooses are successful in that way. Are we showing respect for that 30?'",
        "'speaker_3': '2% or so of people that we like to refer to in those numbers who were probably not in favor of this process. This being said, I'd like to also thank city staff for their accessibility and for all the work and progress made since last month in creating a more equitable RFP process.'",
        "'speaker_3': 'I have spent some time advocating for a citizen inclusion in the name of having deep background information available to the panel and players in this 50 plus year nontraditional business. And therefore, that information about those players has not been available.'",
        "'speaker_3': 'Tonight, I'm here to speak specifically about three points in the regulations in front of you. First point is that about the selection panel and the current makeup as it's progressed over the last month. The second aspect is one specific line in that about information gathering, and then the last point is about the upgraded oral part of the'",
        "'speaker_3': 'process. So currently we've moved the process from a three person selection panel to a six person selection panel, of which five members are voting members. Well, I think that's fantastic. I'm a little bit concerned that in section F, number one, the five voting members are spoken to about what department they come from.'",
        "'speaker_3': 'And in the terms of sports, there is one panelist from a city department to be to be named in the future. So it seems a little bit like a sports metaphor. We have these five people making decisions, but we are only speaking to four of them and one department to be named in the future seems a little'",
        "'speaker_3': 'bit odd, and that is section F number I. On the regulation in front of you, I also see really quickly that my lights on, I believe I was seated three extra minutes.'",
        "'speaker_0': 'I don't know.'",
        "'speaker_3': 'Think that was Chris Ballard. She's here in the audience and put that on the forms.'",
        "'speaker_0': 'Okay. Got it.'",
        "'speaker_3': 'Thank you. Thank you. So moving forward, I'd like to speak to a little bit about the background. It has been my benefit over the last three decades of my life to not only have been in charge of running several businesses, but also founding several businesses.'",
        "'speaker_3': 'Through that process, I have purchased millions of dollars of goods and services through the RFP process, and I fully understand the RFP process for business, if not government. So towards that end, I'd like to simply say that in business the processes are designed to get a 360 degree view.'",
        "'speaker_3': 'A people who will be providing services or goods to you and to make sure that those businesses and individuals are aligned with the organization's goals. Typically we shorthand this is due diligence. Now Section F, letter C specifically uses the line the panelist shall refrain from conducting outside research.'",
        "'speaker_3': 'And that greatly concerns me because the RFP process, the process of due diligence, is designed so that we can get the most information available. In my background, this has typically been that you put out a process, you whittle it down.'",
        "'speaker_3': 'At that point, you invite people in, in the case of sales, a dog and pony show, as we refer to them, you will sit down and at that point you reach out to your own personal networks, business and associates so that you can get.'",
        "'speaker_3': 'A true view of what is being told to you. So again, item F, number C, I'm a bit concerned that states that the panelists enact a challenge refrain from conducting any outside research. That does seem to me to be counter to the goal.'",
        "'speaker_3': 'Lastly, to move forward, the oral interview process is now as written in the regulation. It states that all the questions will be the same to all people, whereas I love that that is a base level of fairness from the beginning.'"
    ],
    "Implementing Regulations for Cannabis Business Permit RFP Process.": [
        "'speaker_3': 'Again, due diligence states that it's I find it very odd to say the least. And the reason why is in the oral part of the process, you really want to delve down to a level of granularity that will inform the panel members.'",
        "'speaker_3': 'And so to play this out, in the case of what's in front of us tonight, the panel might want to select to ask specific questions about somebodys background with their financing, specific questions about their abilities, that of businesses they've run in the past.'",
        "'speaker_3': 'Specific questions if they even know what's in their application or simply wrote a check to a third party to write the application. In this way, what we're doing is we're really digging down. So I would encourage you and see the time assured.'",
        "'speaker_3': 'I hope you allow me a few seconds extra for that process before, but I encourage you to a ask staff to name the fifth person in the voting from what department so we can understand. I certainly hope it would not be the chief of police back into the process as spoken to before.'",
        "'speaker_3': 'Secondly, I would ask that, is this a normal RFP process line that the city shall refrain from conducting outside research, or is it unique to cannabis RFP if it is standard boilerplate language that scares me for the city, if it's unique to the RFP for cannabis, I'd be very interested as to why.'",
        "'speaker_3': 'And lastly, I'd encourage you to open up the questioning to be not only the same questions for everybody, but allow the selected panel to delve in as they think is best. So I was able to do it in 6 minutes.'",
        "'speaker_3': 'Anyway, thank you very much.'",
        "'speaker_0': 'Thank you. Brian Bradley and the Bill Read.'",
        "'speaker_3': 'That evening. My name is Brian Bradley. I am the chief laboratory officer for Steep Hill, a cannabis testing laboratory. My wife and I recently moved to Alameda, but we lived in Alameda in the 1980s and 1990s. We bought our first house here.'",
        "'speaker_3': 'Our kids went to Otis Elementary School. My wife taught school at Saint Philip Neri. We consider ourselves. Longtime Alameda residents have just been separated for some period of time when we come back home. The reason we left was because my job left.'",
        "'speaker_3': 'And the reason we're coming back is because Steep Hill is looking at Alameda as the site for a new laboratory. I've never been a cannabis user in my life, but I believe that the attempts to ban cannabis, like the attempts to ban alcohol, caused more problems than it solved.'",
        "'speaker_3': 'Steep hill is primarily in the business to help regulate and make cannabis products safe for the end consumer. That's our sole job. We work with the state to set up regulations. We work with the state to help enforce the regulations.'",
        "'speaker_3': 'We would love to make our company a part of the Alameda community. We found a potential laboratory site in Marina Village. It's been empty for about 8 to 10 years. We want to recondition it and use it for our own.'",
        "'speaker_3': 'That takes some significant amount of time. And as you've already referenced, the state has deadlines set up for when they need operations to start. We want to comply with whatever RFP process that you put in place. We just find ourselves in a significant time constraint trying to be able to comply with the state and with the process'",
        "'speaker_3': 'that you want to put in place. So believe me, we would love to become part of your community. We expect to hire approximately 200 people in the first year of operation and probably a total of 400 by the time we're fully staffed.'",
        "'speaker_3': 'Right now, we have 10% of our employees as Alameda residents and another 41% as residents of the East Bay as a whole. We expect to be we currently have average salaries of about 85,000, but we hire people everywhere, from dishwashers to people with graduate degrees in law and science and elsewhere.'",
        "'speaker_3': 'So we would be a major contributor to the island's community, a major contributor to the economy. Our people use the entertainment, the food businesses, the business support businesses in the area as well. I think that we can make that contribution if you give us the chance.'",
        "'speaker_3': 'Our problem is time. And we hope that you can help us with that. Thank you.'",
        "'speaker_1': 'If you.'",
        "'speaker_0': 'Still read. And then Thomas Blank.'",
        "'speaker_3': 'Hi. I'm Phil Red. You're a local cannabis activist and I hope everyone has a fun and safe.'",
        "'speaker_4': 'For 20 celebration.'",
        "'speaker_3': 'This Friday. I ask everyone here who voted. Ask everyone who voted against access to cannabis to please recuse themselves from this process.'",
        "'speaker_9': 'Their views have not really.'",
        "'speaker_3': 'Evolved and there is nothing preventing them from trying to prevent or exploit the success of our industry. I see what happens when Trump lets people who want to dismantle an industry are the same people put in charge to regulate it.'",
        "'speaker_3': 'I would sleep a lot easier if only cannabis friendly people were participating in the guidelines from this point on. And of course, I would like to shine a spotlight on the most anti cannabis members on the board Marilyn Ashcraft and Frank Maher.'",
        "'speaker_3': 'Easy, that is all. Thank you very much. Goodnight.'",
        "'speaker_0': 'Thank you, Thomas Blanc. And then Suzanne Blanc.'",
        "'speaker_3': 'Hello. My name is Thomas Blanc. I'm a Ph.D..'",
        "'speaker_8': 'In analytical chemistry. I'm a Ph.D. and a little chemist. I work for Stepper Labs.'",
        "'speaker_3': 'I'm a grandfather of.'",
        "'speaker_8': 'Four, soon to be five. And I have two kids. And none of my kids smoke cannabis.'",
        "'speaker_3': 'Okay. That's their choice because they were raised to know that at a young age, it's not a good idea. It's like alcohol. It's not a good idea at a young age. And what I'd like to do is appeal to people here today.'",
        "'speaker_8': 'That another thing I see with young people and I worry for my kids is where are the jobs.'",
        "'speaker_3': 'Coming from? Where are the jobs that pay coming from in the East Bay? Where are they coming from? How are these people? How are these kids going to be able to grow up and stay here? This is a very.'",
        "'speaker_8': 'Dynamic and powerful industry.'",
        "'speaker_3': 'The labs are going to supply jobs that are getting close to six figures on average, and kids will be able to be employed in some of these areas.'",
        "'speaker_8': 'And if they get the right background, they're learn all kinds of skills that are.'",
        "'speaker_3': 'Almost forensics in nature. We deal with the safety of cannabis, heavy metals, pesticides. These are key areas which we think are absolutely necessary and it needs to go forward. We'd like to do it in Alameda. We live in Alameda since September.'",
        "'speaker_3': 'We love to stay here, too. We love the town. It's a very friendly for families town.'",
        "'speaker_8': 'And I like the quiet. The people are courteous. So I'd like to again.'",
        "'speaker_3': 'I'm going to back about Brian said is that we're getting pushed by the state we have to expand our capacity if we can't get this you know, expanded capacity in time for when the business flow comes in, we're going to have to rent another lab somewhere.'",
        "'speaker_8': 'Else. Okay. You know, this is.'",
        "'speaker_3': 'The way if we have capacity and business that we're getting, then we can't we can't do anything about it.'",
        "'speaker_8': 'We'll just have to expand and.'",
        "'speaker_3': 'Make another decision. This is the first choice. I love the community. Our are the jobs we're bringing are about safety.'",
        "'speaker_8': 'Safety of people, which in the future, heavy metals and pesticides. This is all going to impact our health care system. So I would say right now, a forward looking person would say, we've got to cut this out now.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Suzanne Lenk and then Kathy Bean at Warner. And Emily Richardson, if you want to speak on this item, please submit your slips now.'",
        "'speaker_1': 'Hello. My name is Suzanne Plank. I also work at Steep Hill Labs. I'm a lab technician. I'm also a registered nurse for 30 years. I think people should take time to find out the true medical benefits of cannabis.'",
        "'speaker_1': 'And at Steep Hill, we spend a lot of our time testing for pesticides and other things, microbes and things that might be harmful to patients. My main concern is patients and the state deadlines and we need to move fast.'",
        "'speaker_1': 'And we've been living here in Alameda for us since September. It's a beautiful place, a wonderful place to live and would love for our company to be able.'",
        "'speaker_3': 'To move.'",
        "'speaker_1': 'Here if possible. Thank you.'",
        "'speaker_0': 'Thank you, Emily Richardson.'",
        "'speaker_2': 'F.'",
        "'speaker_1': 'F. Thank you. I'm the cleanup for a steep hill, but I'm honored to be here with a colleague, but also a competitor. And it's very rare for colleagues and competitors from different in the same industry to to be here today.'",
        "'speaker_1': 'And Emily's going to speak right after me. But between Emily and Steep Hill, we represent CW Labs. We represent the two oldest and most prestigious labs, probably in the United States. And we both want to come to Alameda, but we want to come to Alameda.'",
        "'speaker_1': 'We identified space, this 40,000 square foot space that you all know that we're looking at, Emily's identified space that's empty and available and ready to go. We have to be up and testing on July 1st to protect public safety.'",
        "'speaker_1': 'We are mandated by the state to do that. So if we can't move as quickly as possible to get in here, you guys have made the decision to bring in cannabis businesses, if only CW and Steep Hill end up being the two labs that apply to you.'",
        "'speaker_1': 'We're here to just beg you to move as fast as you can, because, again, we represent public safety. We we don't represent foot traffic. We represent good jobs. And we want to be here and the spaces available. And it's and it's been empty for.'",
        "'speaker_1': 'In our case, ten years. I think in Emily's case, I'll let her address it. But please consider labs a little bit separately if you possibly can. Several other communities throughout the state have done this. They've carved labs out of the traditional RFP or decision process.'",
        "'speaker_1': 'If there's any way you can do that, you will be helping the state of California greatly. Thank you.'",
        "'speaker_0': 'Thank you. Now, Emily Richardson.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_7': 'I am a member or a resident of Alameda. I'm the vice president of CW Analytical. As Kathy said, we're here proudly shoulder to shoulder to really appeal for timeliness with laboratories. You know, as you've heard tonight, we're different or different from other cannabis businesses.'",
        "'speaker_7': 'We're not selling, we're not producing, we're not distributing or testing in our current location. We're bursting at the seams. So we want to hire more people. We need to bring in more equipment to meet the demand that the state requires.'",
        "'speaker_7': 'There's currently only 28 licensed laboratories in the state of California to serve the entire state. Steep Hill and CW are two of those 28. In order to really support the state and the public health and safety of consumers using these products.'",
        "'speaker_1': 'We need to we need to grow. We have a beautiful, beautiful space.'",
        "'speaker_7': 'That we literally talk and dream about every day on Bay Farm Island. And a landlord who's fully in support, who's a dentist, a longtime resident of Alameda, who wants us there, who's trying to wait for us as long as possible.'",
        "'speaker_7': 'As this process continues, I have no doubt in my mind that we will 100% fulfill any of the qualifications on the RFP. We're not worried about that at all. It's the timeline that's really concerning, and I'm really appealing to you to provide some sort.'",
        "'speaker_1': 'Of carve out, raise the cap.'",
        "'speaker_7': 'On labs. There is not the city is not going to be overrun with laboratories. There's only so much laboratory space you're allowing for for manufacturing facilities. I don't know why there shouldn't be a limit on labs. So, you know, it's not to get in there to reduce competition.'",
        "'speaker_7': 'We're all in support of that. Just please, if there's any way that we can speed along, the laboratory process.'",
        "'speaker_1': 'Would help.'",
        "'speaker_7': 'The state of California. We're in contact with the bureau every day. They're really concerned about capacity issues and we want to grow, bring on more staff, well-paying jobs, all that. So thank you so much for your time and thank you for your consideration.'",
        "'speaker_0': 'Thank you. So she's our last speaker. I'd like to ask staff if you could address the issue in regards to the process for labs, if you have any ideas of what we can do to try to accommodate.'",
        "'speaker_3': 'Hmm.'",
        "'speaker_1': 'Our ordinance doesn't require that we include them in the RFP process. It was just direction of council. So it gives you an alternative to say that they could just apply when our application is ready for for lab space.'",
        "'speaker_1': 'I do want to disclose, though, that I have had three laboratories contact me and you have slots for two.'",
        "'speaker_0': 'Okay. So if we wanted to increase the number of labs that.'",
        "'speaker_1': 'We would have to do that by ordinance. We would have to come back to you and we could do that fairly quickly within, I guess, a month and do that. We can do a first come, first serve as well.'",
        "'speaker_1': 'On the application. But I do know that we have three. Okay. Interested?'",
        "'speaker_0': 'Okay. I wanted to follow up in regards to these other questions and issues that were raised the the opening on in regards to who's participating from staff.'",
        "'speaker_1': 'The list of who's participating for staff is in the staff report. What we did not do is put it in the regulations. The reason we didn't put it in the regulations was because if a staff is decides to take another job, for example, we would have to come back to you and change that name.'",
        "'speaker_1': 'This way we would we would be able to get someone in a similar capacity to to serve on the the panel.'",
        "'speaker_0': 'And could you describe but from the staff report what the proposal is currently. But the plan is.'",
        "'speaker_1': 'Yes. So technical support to the panel. Lord Butler, myself. Real estate. Property management. That would be Nanette McConnell.'",
        "'speaker_6': 'By the way, if you want to follow along on people, it's pages four and five of the staff report.'",
        "'speaker_1': 'And finance. It would be the finance services manager, Edwin Catto, a planning person. The City Council asked for a planning person that would be Kathleen Livermore, and she she's a part timer. And then the other city department and related to cannabis is Liam Galan with Public Works.'",
        "'speaker_1': 'And I missed one for him is health. That would be Jackie Cross with Mastic. She's a manager in the senior center.'",
        "'speaker_0': 'Let me let me finish. And then I'm going to go to other councilmembers the first. Okay. So I want to just make sure that everyone that spoke on that issue understands. You can you can go to the staff report and you can see who at this point we are planning to go forward with ever, as Lois explained'",
        "'speaker_0': ', that we in regards to the RFP itself, it would not have or the ordinance itself, it does not include those names so that it does allow for change. If, if, you know, if if it works out that we need to do that in regards to the prohibition, to researching during the process, you want to speak to that'",
        "'speaker_1': '? I think the thought on that was that we didn't want the panelists to be biased by doing a lot of outside research, comparing one to another. And so we limited it to no research so that people could evaluate the proposals on their merit.'",
        "'speaker_0': 'And now if they if questions came up during the process between the of the panelists, is there an opportunity for them to, for instance, speak to you to say, we think we need more information on some issue and get that?'",
        "'speaker_0': 'Is there any. And the ability to do anything like that.'",
        "'speaker_1': 'Is not the way it's proposed.'",
        "'speaker_0': 'Okay. And then is that unique to cannabis, this ordinance, or is that the way we always do if we have to do a selection?'",
        "'speaker_1': 'It it we we do it different ways depending on on the situation. This is pretty unique in this case. It's actually a standard. We typically don't ask for additional outside research. We want the proposals to stand on their own merits.'",
        "'speaker_1': 'We want the proposals to be evaluated on the basis by which they are submitted. And we don't want panelists doing additional research because part of what we want to know is that people put their best foot forward, they did a complete application or they didn't, and they're going to be evaluated on that basis.'",
        "'speaker_1': 'And that is the way we conduct our request for proposals for all kinds of contractual services. That's correct.'",
        "'speaker_0': 'Okay. And then in regards to questions that goes to the same I assume the same answer if that we do, in fact, want to keep the same questions for all applicants.'",
        "'speaker_1': 'Yes. We do want to keep the same questions for all applicants. And just to clarify what I was saying, we normally do research on when we put out request for proposals. So this is unique. So we research who we put it out to.'",
        "'speaker_4': 'Okay. And also, madam, if I might, as far as answering questions, we can ask follow on questions, but we typically like to have the standard questions. Everybody gets the same question, but as the candidate answers the questions, if we have questions, we, you know, the panelists subsequently want to ask something, follow on.'",
        "'speaker_4': 'He will do that as a clarification. But we like to have standard questions so it's fair for everybody.'",
        "'speaker_0': 'Okay. So so then I do want to clarify that because that was not my understanding from reading it. Are you allowed to do follow up questions, calling them clarifying questions or some other kind of question? Now that we've.'",
        "'speaker_1': 'Set up the questions for the oral interview is that they are standard questions and there may be a clarification follow up, but there's not going to be extensive follow on questions. It's really intended to clarify. That was the intent of the staff and the committee's work.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. Then I want to also just express my opinion that I am I personally do not support having a cap on labs. I know that that is part of the ordinance I'm absolutely interested in at some point as soon as possible, honestly bringing it back.'",
        "'speaker_0': 'I do see it as a public health and safety issue as well as a job issue. And I would also appreciate if we could, working with council members, figure out a way to expedite the process for the labs.'",
        "'speaker_0': 'And I appreciate that we apparently have three. I think it's unfortunate that we do have a cap on that. I would hope that my colleagues would be interested in trying to figure out how to address that. And then I'm going to go to vice mayor.'",
        "'speaker_7': 'So a couple of follow up questions. Regarding the list of the staff participating. If the staff. There was no member of public safety listed, correct? Correct. Didn't hear one. And so if a staff member leaves, they wouldn't be replaced with somebody from public safety.'",
        "'speaker_1': 'Right? They would be replaced with someone in these categories.'",
        "'speaker_7': 'In the same categories. I just want to make that clear for the record, for anybody who had any questions out there. Our intent is not because it was there was a question about whether or not our intent was to kind of slide something in that wasn't listed in that.'",
        "'speaker_7': 'That is not the intent. With regards to the lab, is it? You know, if we did an RFP, is it possible to expedite it based off of what's provided without kind of rewriting everything? I mean, is there a way to kind of separate it out and do an RFP that would be on an, you know, in an'",
        "'speaker_7': 'expedited manner because of the time sensitivity? And I see John and.'",
        "'speaker_1': 'Debbie getting up went over. We were caucusing a little bit about this and we believe that there if there's an interest in expediting this, we could make a simple revision to the regulations where we talk about a master RFP process, and we could do this at a raise to carve out the lab and run a more streamlined'",
        "'speaker_1': 'or expedited process, if that's the desire. Or we could open it, shorten the timeframe, or we could sort of have a first come, first serve, submit your application, your operator's application. And we could evaluate the actual operator's application because this RFP is set up to award businesses with the privilege of applying for an operator's permit.'",
        "'speaker_1': 'So we could, for the labs, streamline that and go directly to an application for an operator's permit. Mm hmm. Is one option? Or we could do a streamlined RFP process.'",
        "'speaker_7': 'Okay. And my question or my concern relative to you moving to a first come first serve, is the notice involved in that? And whether or not we set ourselves up there to potential applicants here tonight, there's one that isn't, but there's one another one that you know of.'",
        "'speaker_7': 'Are we setting ourselves up to get sued, which would then slow down the process if we switch?'",
        "'speaker_1': 'Well, we're not legally obligated to use an RFP process to award a limited number of permits. It's something that I think the council felt was a fair and equitable process. But if we have the contact information for the the other lab, we can certainly outreach to them and then let them know that the process, if the process'",
        "'speaker_1': 'is changed this evening, we could certainly do that. We're also planning to placing an ad in the paper next week, letting folks know that the RFP is available and we can still move forward with with that kind of outreach.'",
        "'speaker_1': 'But we don't have a legal obligation to do this RFP process. I think it's what the Council felt was a fair and equitable way to award limited permits. A number of jurisdictions reserved their RFP process strictly for the dispensaries and didn't undertake an RFP process, even though they limited, for example, in San Leandro, they're capped at five'",
        "'speaker_1': 'manufacturers and they just do it first. It's kind of, you know, the process is just come in, fill out your your application and go through the process. Sometimes there's more interest in doing this process for the dispensaries. The council was interested in looking at all of the capped business categories, but I think people didn't anticipate maybe the'",
        "'speaker_1': 'length of time and then the July one start up and some of the other issues surrounding the labs. Okay.'",
        "'speaker_7': 'And I'll just add that I concur with the mayor regarding I think that there's a couple of things in the ordinance that are worth looking at later on, not not tonight, because I do not. My concern would just be delaying this overall process.'",
        "'speaker_7': 'So, you know, but I am interested in looking at potentially changing some of those numbers and looking at some other portions of it.'",
        "'speaker_0': 'I mean, just follow up. Does that mean in regards to not increasing the cap on the labs? Is that what that meant?'",
        "'speaker_7': 'Well, I I think my concern would be what we heard from staff is that if we increased the cap now, we would be delaying the process. That I would be interested in perhaps having that ordnance come back at a later date to increase the cap or remove it.'",
        "'speaker_0': 'Right.'",
        "'speaker_3': 'Just briefly. So just to follow up on the vice mayor's comment, so this other city department, are we keeping that other city department or are we actually going to say, for example, public works and that's where it is right now.'",
        "'speaker_1': 'It would stay public works. Our intent is to keep this list as it is.'",
        "'speaker_3': 'Okay. I mean, just to follow up on those points, I mean, the state has an interest and I think also everyone that lives here has an interest in having a safe supply of this product. So. I mean, I could go either way, depending on on where my colleagues are.'",
        "'speaker_3': 'But if we think we can either raise the cap or remove the cap on labs and do some type of first come, first serve, my concern was when it was just too that it'd be like the first one to the first floor permit counter and then they would be the ones that would get it when, you know'",
        "'speaker_3': ', maybe we would need a little bit more evaluation. So I mean, if it's possible to do it that way or if it's possible, I don't know if it's possible for them to get permits, even if we did accelerate the make one suggestion.'",
        "'speaker_3': 'So of course, John. So just to clarify, sorry, I want to start from the beginning. It is true that nothing in the ordinance requires us to use an RFP. What we've done or you have before, you are implementing regulations to implement a portion of the ordinance and that portion is the cap.'",
        "'speaker_3': 'So you've got in the ordinance language about a cap. Now you have to decide how you want to implement that cap, who gets in and who doesn't get in. And that's what the implementing regs are for. I see two options that are possible, both of which have been already announced.'",
        "'speaker_3': 'One is to raise the cap. The problem that I see with raising the cap is one it causes it may cause some delay. The other one that hasn't been stated is if you go to raise the cap, can't do it tonight because it's not been noticed.'",
        "'speaker_3': 'You'd have to do it at another meeting, you a first in a second, and then once you do that, you could raise the cap to three. But then suddenly you have four people now and then you have the same problem.'",
        "'speaker_0': 'So sure, we even need a cap for the second.'",
        "'speaker_3': 'I think so. Then the floor. So then the second alternative excuse me is to. Take the current implementing regulations, make an amendment to it so that the language that talks about having a single master IRP for all cannabis businesses.'",
        "'speaker_3': 'But instead take that and carve out perhaps testing laboratories to follow a different RFP process. And the only difference is it's on a more compressed schedule. So that's a possibility that you might want to consider.'",
        "'speaker_1': 'And, you know, I would just suggest that we add a schedule to the RFP for the laboratories to make that more compressed. We we take some time out of that. And so we don't have to redo an RFP.'",
        "'speaker_1': 'Just add a special schedule for the labs. Okay, I can sit down. If I could get a minute and come back up here and tell you where we can reduce the schedule. So I'll let Debbie talk while you have other questions, and I'll look at the schedule right now and try to get a recommendation to you.'",
        "'speaker_3': 'Okay. Because I think the rest of my question, John or Debbie, whoever wants to answer it, you know, even under a compressed RFP, would we have time to select people that are eligible for a permit, get them to apply for a permit, and have the permit approved in time for them to meet whatever state deadline they're doing'",
        "'speaker_1': '. So that's the concern that I have, because if you remember, the process under the ordinance is that there's an operator's permit as well as a land use permit. So I'm not sure that I mean, July one is not very far away.'",
        "'speaker_1': 'And I'm not sure that even with the compressed schedule for an RFP, you can get through the operator's permit and then the land use permit. It's a sequential process so that you may want to consider if the goal is really to meet that July deadline that you, whoever comes in with their completed operators, permit application.'",
        "'speaker_1': 'First we start processing. If someone comes in with a second completed application, if they come in if for any reason, we get them simultaneously. I mean, we can date, you know, we can date and time stamp. And if whoever is deemed complete first because we will, that's the first thing we'll do is to determine whether or not'",
        "'speaker_1': 'there's a completed application. So, I mean, Lois may take a hard look at the timeline and say, well, we can cut to three weeks, but I don't think. That plus the operator's permit, plus the land use permit and all the noticing that goes with that, you know, like a land use permit in front of a planning board'",
        "'speaker_1': 'that is without really looking at that deadline that just standing here, it that's going to be tight.'",
        "'speaker_3': 'So in your opinion, because we rely on your opinion or your recommendation, you know what, this is a priority. So for me to make sure we can have these folks that are actually ready to go up and running by July 1st.'",
        "'speaker_3': 'I mean, what is your suggestion as the best possible way to do that?'",
        "'speaker_1': 'And if you recall, back in December, staff's recommendation was that we well.'",
        "'speaker_3': 'That we didn't.'",
        "'speaker_1': 'Do so. So tell us what we need to do. I would say start feeling sorry.'",
        "'speaker_3': 'I thought I'm yeah, I would.'",
        "'speaker_1': 'Say that even on that given that where we were. Staff feels comfortable with a first come first serve with the labs on a you know demeanor the complete applications and and processing those.'",
        "'speaker_3': 'Okay. Thank you, Miss Potter.'",
        "'speaker_0': 'So I just found out, do you need a motion to do something like that or direction? What would you like that to look like?'",
        "'speaker_1': 'You were going to want to.'",
        "'speaker_6': 'I speak to mayor.'",
        "'speaker_1': 'Yeah. I think we are going to need an amendment to the implementing regs that are before you this evening to carve out the labs and then to to direct us to do something different.'",
        "'speaker_0': 'Is someone keeping track of all these amendments that you may be? That, right? Yes. Someone's doing that for us. Thank you. Member Ashcraft.'",
        "'speaker_6': 'Thank you. So I first want to disclose that I have actually visited Steep Hill in Berkeley and I met all the speakers and I believe I've met Emily too, somewhere along the way because you look very familiar. But I also at the time felt that we were really almost doing the reverse.'",
        "'speaker_6': 'We allowed two testing labs for manufacturing facilities, and yet every product has to be tested. And as we heard, there's a startling under capacity for labs. So I would want to do whatever we could to to expedite, which it sounds like.'",
        "'speaker_6': 'Mr. Potter, you're going to give us a suggestion for the best way to do that. I would be tempted to raise the number to at least for the same number of as we have, manufacturing facilities or lift the cap altogether.'",
        "'speaker_6': 'But everything is in balance or gets out of balance quickly because does that then inundate staff or is that something to be concerned with? So hold that thought or go ahead and answer it now. I've got a couple of other questions.'",
        "'speaker_1': 'So to lift the cap, we would have to come back to the council with an A with an ordinance amending the existing ordinance. So that is also a process that would take us beyond July 1st, most likely. So we could move forward with the two.'",
        "'speaker_1': 'And if there's a desire and more demand for labs, we could deal with that on a separate track.'",
        "'speaker_6': 'And if and if you were to move forward with the first two you have, could you still get them to be able to meet that July one state deadline?'",
        "'speaker_1': 'If we if we go directly to what we're talking about, a sort of a first come, first serve for your application for your operator's permit. And we just put aside the RFP process and really reserve that for the manufacturers, the nursery and the dispensaries.'",
        "'speaker_1': 'And then relative to staff time, if you recall, will be coming back to council with a fee study. This program is intended to be revenue neutral and we have the ability to hire additional resources to assist us with with this effort so that we could accommodate the council's desire, if there's a desire to allow more, you know'",
        "'speaker_1': ', more operators.'",
        "'speaker_6': 'I appreciate that. And I would certainly be in favor of that because I understand the dilemma the these operators are in. They want to put money into these sites that they've found to get them ready. And yet they don't want to do that until they really know they're going to be able to move forward with the operator's'",
        "'speaker_6': 'license. So I think it looks like a vote is coming up. But let me just ask a couple of clarifying questions I realized I missed. And this has to do with it's exhibit one, which is your and it's the the resolution.'",
        "'speaker_6': 'So on page six, it says, okay, it talks about once an award letter is issued, the awardee has 60 days from the date of the awarding letter to apply for a cannabis business permit. Failure to do so may lead to disqualification from further consideration and immediate revocation of the awarded award letter.'",
        "'speaker_6': 'So my question is, since the language says may lead to disqualification, under what circumstances would failure to apply for the permit in 60 days not lead to disqualification? Does that make it more limited?'",
        "'speaker_1': 'So the intent of this requirement is that we want to compel folks who who land a slot with one of these permits that they actually open the business and don't sit on their permit. So we want there may be extenuating circumstances, like you need a time extension because your tenant improvements aren't happening as quickly.'",
        "'speaker_1': 'So we might not revoke it in that instance. But if there's been no progress towards getting yourself open, that might be the basis on which we would revoke.'",
        "'speaker_6': 'And is this where the one time you would extend this one time deadline for good? Cause that's, I think, paragraph. Four of Section G says the awardee. Miss. Well, this is Ms.. Secure all the requisite approvals to begin commencement of operations.'",
        "'speaker_6': 'But the city manager or designee may extend this one year time deadline for good cause. Yes. Okay. All right. So I guess I'll work on a case by case basis at.'",
        "'speaker_1': 'Exactly. Okay.'",
        "'speaker_6': 'That's fine. Okay. Well, I'm a I would like to see what we can do to get more labs and get them in under the state deadline.'",
        "'speaker_0': 'Does that mean that you would be interested in removing the cap or.'",
        "'speaker_6': 'I would actually defer a little bit to staff because there's no point trying to do something quickly if we're going to inundate staff. But I would definitely say bump it up to four and I get you bump it up to four, you get five, but, you know, four labs going.'",
        "'speaker_6': 'I just I try to be mindful of it's the same staff doing lots of different things.'",
        "'speaker_0': 'I appreciate that. Okay. Member matter. Thank you.'",
        "'speaker_8': 'But I think the labs are probably the lowest risk of the three segments that are listed. Probably the most important. Because it's quality control. So I think anything we can do to allow. Them to meet that deadline. Is I'm open to and I do want to make sure they're qualified.'",
        "'speaker_8': 'And I think we lose some of that ability by deflating the RFP process. So that's a balance that I'd like for you to. Tell us how we're going to ensure that we get a real lab there. Present company excepted, but someone who who's capable of doing this and I think it's important that we spend the precious time'",
        "'speaker_8': ', we have it at council meetings to launch the program rather than to try and adjust the program, because I just don't see how it's going to happen. Of if we try and redo the ordinance and then get a lab license to have.'",
        "'speaker_8': 'So how are we going to make sure that we get a qualified laboratory to submit their permits?'",
        "'speaker_1': 'So the RFP process has to distinguish one lab from another or one business from another of the same type. And what the application process does, it further digs into the business, and it has in fact more questions and requirements.'",
        "'speaker_1': 'And so they have to go through our application process, which we will be providing you a final draft of soon. It's in its final stages, but that's a more rigorous process that.'",
        "'speaker_8': 'I am sorry to interrupt, but I understand that part. But when we have three interests, two.'",
        "'speaker_1': 'It would be first come, first serve.'",
        "'speaker_8': 'Okay. So that's the option you're talking about. Yes. Replacing. That for laboratories, making it first come, first served. And you go through.'",
        "'speaker_1': 'And whoever gets through the process first they get apply on the same exact date. But they may not get through. They may not get through the the process of the application process and the things that they need to do in a timely manner.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Okay, very good. So I would like a staff to look at parallel a parallel path of either increasing the number of labs or removing the cap entirely. To hear back on that issue. And then the other hand, you can implement this because I'm sure I'm going to have a motion.'",
        "'speaker_7': 'So I would like to make a motion to approve with an amendment where we would pull out the labs and do a first come, first serve process for those. And I agree with the mayor regarding having a parallel track to have the ordinance come back to us, because I don't want to stop the process.'",
        "'speaker_3': 'I'll second that. But if if it's possible to modify that because if if we do decide to move it up to four or take it away, and there is a third one that may be like minutes late or whatever, you know, would we still I think we should still should keep that in process because they may have'",
        "'speaker_3': 'to go through the permitting process and they may be able to be in the middle of it by the time we change.'",
        "'speaker_7': 'And that would still apply if it's first come, first serve. And that's the process that we have in place so long as we update the ordinance.'",
        "'speaker_3': 'Yeah. So we wouldn't like tell them. No, I'm sorry, you can't do anything. Okay, so I'll second that.'",
        "'speaker_1': 'So it's essentially a rolling application, right?'",
        "'speaker_0': 'Just a way to get it going.'",
        "'speaker_6': 'I think there's kind.'",
        "'speaker_1': 'Of.'",
        "'speaker_3': 'I don't have an idea yet of four or zero or four or no caps. Let's come back with that.'",
        "'speaker_0': 'And my preference is no cap on the labs.'",
        "'speaker_9': 'Member.'",
        "'speaker_0': 'Not member matter.'",
        "'speaker_8': 'Can I make sure the motion, if we could split that into two motions first? Yes. Do the first come, first serve and then second to the ordinance? Yes.'",
        "'speaker_7': 'That's not really my preference because we're still in the consent calendar.'",
        "'speaker_0': 'But but my actually my preference when it's 830, I'm happy to end it, you know.'",
        "'speaker_7': 'Okay, I'll I'll do it. But I just don't want this conversation to keep going because it seems great. Okay, fine. That's fine. I'll bifurcating.'",
        "'speaker_1': 'Fractions.'",
        "'speaker_6': 'Different question. Yes.'",
        "'speaker_0': 'So embarrass craft.'",
        "'speaker_6': 'Through the chair and vice mayor. Is it do you also include the streamlining of the the application approval that Mr. Potter was talking about?'",
        "'speaker_1': 'We just talked about first come first come.'",
        "'speaker_7': 'First that what we're voting on.'",
        "'speaker_6': 'Well, okay. But not to go through the whole RFP process.'",
        "'speaker_1': 'But two laboratories would be carved out of the.'",
        "'speaker_7': 'Layers of motion in a second.'",
        "'speaker_6': 'That's what I'm looking for. Okay. Okay. It's included, right.'",
        "'speaker_0': 'So everyone so we're just doing the first part, the first come, first serve now. Right. And Corbin has a crack at us the carbon. Okay although some favor I that part that motion passes unanimously and now the second part of the motion.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'To remove or to look at.'",
        "'speaker_7': 'To have staff come back directing staff to come back with the ordinance relative to the cap on the labs to either remove it or increase it. August 2nd in a parallel track.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_8': 'I know.'",
        "'speaker_0': 'Motion carries 4 to 1. Thank you.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. I think.'",
        "'speaker_1': 'That want to get through that and then the next the next part of that would.'",
        "'speaker_0': 'Be so I'm sorry.'",
        "'speaker_1': 'We're not done. The next part of that would be to approve the form of the RFP with the NOW. Thank you.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'Well, I actually need her to finish. I need you to finish your the entire motion so it's clear.'",
        "'speaker_1': 'Okay. It would be to carve out the laboratory from the process.'",
        "'speaker_0': 'Oof! That got you moved, right? Yep. Second, all of them favored by that motion carried unanimously. You guys need anything else on this issue? All right.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'That item. Thank you very much. So now we are on, I think, five. I think my.'"
    ],
    "Cooperative Agreement and Contract for the Central Avenue Safety Improvement Project.": [
        "'speaker_2': 'Recommendation to authorize the acting city manager to execute a cooperative agreement with the Department of Transportation, Caltrans, an amount not to exceed 284,000. For Caltrans to review and approve the project initiation document, which is required by Caltrans, determine the project scope, cost and schedule for the Central Avenue Safety Improvement Project and execute a contract with CDM Smith'",
        "'speaker_2': 'in the amount of 372,000, including contingency for engineering.'",
        "'speaker_0': 'All right, if you want to go first.'",
        "'speaker_1': 'Yes. Good evening, Madam Mayor. Members of the City Council. I'm Gayle Payne, project manager for the Central Avenue Safety Improvement Project. You want me to make a staff report or. On this item. The item before you is to prepare the project.'",
        "'speaker_0': 'Initiation document.'",
        "'speaker_1': 'For this order to 1.7 mile corridor. This is a Caltrans required document because half of the 1.7 mile corridor is a state route, state route 61. That's between Webster and Sherman. And we have we're requesting a staff recommendation to execute a cooperative agreement with Caltrans to review this PID document, the project initiation document.'",
        "'speaker_1': 'That's the required document for state highway system projects. And then also to execute a contract with CDM Smith to prepare this pit. And keep in mind that this required document will take about a year to prepare. And what it will do is we will be able to understand what are the alternatives that we will consider for Central'",
        "'speaker_1': 'Avenue at Webster. So we'll have that nailed down as all the ones that will be analyzed in the next phase. And we also will do a preliminary environmental review and analysis, as well as a traffic analysis on the entire corridor, as well as the different scenarios for Webster and Central.'",
        "'speaker_1': 'We are looking at ways to in innovative ways to streamline this project, especially with it. Environmental Review. Since this is a really complicated project because it's partly on state run.'",
        "'speaker_0': 'I'm sorry, I need the record to reflect that Vice Mayor Vela has stepped out of the room and the time that I need that marked on the minutes. Thank you.'",
        "'speaker_1': 'She is recusing herself from this item because she lives near the property.'",
        "'speaker_0': 'Okay, so we need to say that so we all know what's happening. Thank you. I appreciate it. So, remember, Vice Mayor Vella is recusing herself from this item and that's why she stepped away from the dias. Or that.'",
        "'speaker_0': 'We know that. Thank you. You may continue.'",
        "'speaker_1': 'In parallel, as we complete the project initiation document.'",
        "'speaker_0': 'We will be working with.'",
        "'speaker_1': 'Caltrans and the funding agency to streamline the project, especially when it pertains to that environmental documentation. That's the Sequoia and the NEPA that's required since these are federal funds for construction. And so we will in parallel, while we're working on the PID, we will be working on ways to streamline.'",
        "'speaker_1': 'This is a really complicated project. And so we do want to use best practices on how to move forward and in the most streamlined way possible. And I'm available for questions or comments. Thank you.'",
        "'speaker_0': 'Member matter.'",
        "'speaker_8': 'Just a quick clarifying question. Maybe I missed it, but the Caltrans work, will they approve the plan for Central and Webster? Is that part of their approval or part of their review?'",
        "'speaker_1': 'They will review the various scenarios we come up with in this PID phase. And so they will conceptually approve all this, all the scenarios that we will come up with to consider, and that will be considered and further analyzed in the next phase and then project analysis.'",
        "'speaker_8': 'But when they say when you say that they will review everything that they. Does that mean that they could say no, that that particular plan, one, two, three, three is not going to we're not going to approve that they could they eliminate.'",
        "'speaker_8': 'I guess I'm asking, can they eliminate a scenario?'",
        "'speaker_1': 'They could. Okay. It's it's hard to say at this point. They have been very amenable and it's been a while. I'm not I'm just saying.'",
        "'speaker_8': 'What the process. Yes. Them to remove a scenario from our list of possible.'",
        "'speaker_1': 'I would think that would be a possibility.'",
        "'speaker_8': 'Okay, thanks. That's all I need. Thank you.'",
        "'speaker_6': 'Member Ashcraft. So I was the one who pulled this from the consent calendar, although my question is actually somewhat similar to councilmember matter. So I do understand that a part of this is State Highway 61 and that's where Caltrans comes in.'",
        "'speaker_6': 'My question, I know that they the city, we have to get a conceptual approval by Caltrans before proceeding to further design, environmental review and construction. And my question is, what what further Caltrans approvals will be required? I mean, this is just the initial phase, but do will they need to sign off on further design and construction documents'",
        "'speaker_6': 'before they can be finalized? Right.'",
        "'speaker_1': 'Okay. Yes. And so in the next phase, there's the project approval and environmental documentation phase. They need to sign off on that. Then there's the next phase. The plan specification estimates, they sign off on that. And the construction, it's it's federal money, so they sign off on everything.'",
        "'speaker_6': 'So then just for clarification, for their work, we need to come up with $184,000. That's just for this the project initiation document phase. Can we anticipate similar numbers for the other phase? Yes. Okay. And just for the public, that might be, you know, having heart palpitations like I did when I saw these numbers.'",
        "'speaker_6': 'There's a whole lot more grant money out there that we were able to get. So it's but I just I wondered what we would be looking at, more approvals and more fees. Yes.'",
        "'speaker_1': 'And we will be looking at additional.'",
        "'speaker_6': 'Those are my questions. Thank you.'",
        "'speaker_0': 'And we do have two speakers on this item that I'd like to call at this time, Brian McGuire and then Denise Trapani, a.'",
        "'speaker_5': 'Good evening. I was a little surprised to see the recusal. I didn't realize. I thought it was only if there was, like, a financial interest of some kind. But, I mean, a 1.7 mile corridor could be a lot of people that live close to such a project.'",
        "'speaker_5': 'But Bike Walk is looking forward to this project moving forward. We are excited to work with staff and excited that we've got funding and we're ready to take the next steps. We do think that a couple of things as regards to the description, this council gave direction to look at safer alternatives for the Webster and Central intersection'",
        "'speaker_5': '. And we support that. We hope that we're not limited in when we consider our alternatives there. If the design for that intersection may lead us, especially towards the West, as we connect with different facilities towards the point to examine more than just the immediate vicinity, it might extend.'",
        "'speaker_5': 'And, you know, if we decide to do something like a protected bike lane on part of that section, it would make sense to reexamine from Webster to Payton School that maybe we could extend it and close that gap right wherever possible.'",
        "'speaker_5': 'So hopefully we we follow the follow the design where it goes and not just be focused at that corner. We do think it's a big enough project that maybe it would be worth exploring doing some of the other parts that are not Caltrans right of way sooner.'",
        "'speaker_5': 'We've waited a long time. We know this corridor's unsafe. There's a lot of schools that are on central west of Webster and a lot of students and families that use what we've identified as an unsafe configuration. So if there's any opportunity to start doing work on the segments west of Webster that we've got an approved design for'",
        "'speaker_5': ', and we can move forward and start construction on those before 2021 so that we can start delivering some amenities and some safety improvements sooner without dramatically increasing. Obviously the staff, staff costs and efficiencies we might gain, but we think it would be worth exploring.'",
        "'speaker_5': 'So we hope you can consider that. Thank you.'",
        "'speaker_0': 'Thank you. Any other speakers on this item? I'm sorry, Denise.'",
        "'speaker_1': 'Thank you. Thanks for giving me the time to speak tonight on this. I'm going to reiterate some of what Brian said. I first got involved with Bike Walk Alameda on the Central Project.'",
        "'speaker_0': 'Years ago when we.'",
        "'speaker_1': 'Were doing outreach for a community outreach. That's how I first heard about Bike Walk Alameda and I'm on the board, so it's been a long time coming. So we're very excited that this is finally happening and I may be mis misremembering some of this, but the whole project goes from internal all the way down around the corner'",
        "'speaker_1': 'to where it becomes main to Pacific. The Caltrans portion is really just Webster to Anthony all it's just the eastern portion of it. When I was looking through some of the documents for the scope of this project, what we're going to be doing with Caltrans or with the consultant, where it looks like we're doing like traffic counts'",
        "'speaker_1': 'again all the way back to. Pacific and fourth and eighth where we may not need to do them again. I don't know how much of that is. We're just treating it all like one project. But that's not really Caltrans jurisdiction.'",
        "'speaker_1': 'But that's not my my area of expertize. I just want to make sure that we're moving as fast as we can and we're not doing too much work. And if we did a bunch of traffic counts and we have approval.'",
        "'speaker_0': 'On designs for.'",
        "'speaker_7': 'Stuff.'",
        "'speaker_1': 'That's west of Webster. Yeah, let's move forward with that. Let's not do all the traffic.'",
        "'speaker_4': 'Counts and look at all the pedestrian crossings.'",
        "'speaker_1': 'If we've done all that, let's not do that. But that was included in the scope of work tonight for the consultant. So that's it. Thank you. Please move this forward so we can get some a safety corridor in Central.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Linda Astbury.'",
        "'speaker_1': 'Hello. Linda Asbury, executive director of the West Alameda Business Association. We really want to emphasize that West Alameda Business Association has to be at every point of this discussion, and it can't do anything that restricts any business on Webster and Central.'",
        "'speaker_1': 'And I think we've been terribly outspent, not terribly. We've been in a positive way, outspoken. And perhaps there's feelings that we haven't been heard and we can't repeat that we need to be at the table at all. Discussion and total transparency.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. All right. That completes our public comments on this item Council. Did you have any more questions or comments?'",
        "'speaker_3': 'I'm just going to I'm going to move approval of the item.'",
        "'speaker_6': 'Just quick clarifying question from whoever can tell me about the repeated traffic.'",
        "'speaker_0': 'And member matter as he seconded it. Sorry.'",
        "'speaker_6': 'Is it happening or is Ashcroft.'",
        "'speaker_0': 'And if you could repeat your question.'",
        "'speaker_6': 'I just asked Miss Payne to tell.'",
        "'speaker_1': 'Us about the traffic count. So as part of there are no new traffic counts. And what we'll be doing is we do know that since we've done the work on the concept, there have been more traffic counts down.'",
        "'speaker_1': 'So we will be compiling the latest and giving it to the consultant for this next phase. That's all.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'And then could you speak to the intersection of central maps through that process? But. But what's going to happen?'",
        "'speaker_1': 'Yes. So just as a reminder, you all we came to you to ask for approval for the concept of the entire 1.7 mile corridor. And in February 2016, you will approve the corridor the entire quarter. Except you asked us to come back with some alternatives for that Webster Central Avenue intersection.'",
        "'speaker_1': 'And so what we're now going to be doing with this pit phase is we're going to be coming back with with some of those alternate with those alternatives for that intersection. And we will not be resolving that. We will be just bringing it in the pit phase and showing what the alternatives.'",
        "'speaker_1': 'We will be considering all the scenarios and doing a preliminary environmental report analysis on that, preliminary traffic analysis on that. And then the next phase will be seeking your approval and working in this phase with. All different, the key stakeholders.'",
        "'speaker_1': 'So we we have one reason why we have bike walk, Alameda and Barber here is that we alerted them that this was on the agenda. And so we are working with all groups and they're the.'",
        "'speaker_0': 'The.'",
        "'speaker_1': 'Primary ones with these stakeholder meetings. We will also we'll have focus groups really with these primary stakeholders and also a workshop with the broader community to make sure it's transparent what we're doing with this, with these key stakeholders, and then bringing it to Transportation Commission and the City Council.'",
        "'speaker_1': 'So even though we know we're not going to be resolving the issue, we are going to be working through the issue to make sure that we have some solid scenarios to analyze.'",
        "'speaker_0': 'Great. Thank you very much. Any other questions? Comments. Do we have a.'",
        "'speaker_8': 'Comment.'",
        "'speaker_0': 'About address?'",
        "'speaker_8': 'I'd love to see the scenario that comes to us out of this bid process. Yeah. Waba and bike walk alameda standing hand in hand saying, there we go. Let's go. Hey, so.'",
        "'speaker_1': 'Everyone here has a goal here. That would be great.'",
        "'speaker_0': 'All right. And all those in favor carries unanimously with one recusal. All right, so now we're and if someone could love vice mayor knows that she can come back in. Now we're on five K and I don't.'",
        "'speaker_6': 'Know, I did and.'",
        "'speaker_0': 'Never ask.'",
        "'speaker_6': 'Yeah. This one is, um, the recommendation to accept the Public Art Commission's cultural arts funding recommendations. And I just pull this because I think they're pretty spectacular. And I wondered if whoever's project whose this was about there.'",
        "'speaker_1': 'It would be Amanda Gursky, who is a management analyst with our department. She does have a short presentation. It's about 5 minutes. If you would like her to give that presentation.'",
        "'speaker_3': 'I'd like to waive the presentation.'",
        "'speaker_6': 'I it may be written consent. It's almost nine, so maybe I'm sure it's a lovely presentation. Maybe another time. Can you just quickly list for us the however many awardees are are included in there.'",
        "'speaker_0': 'But I have a question. Does the present the presentation has the pictures of them proposals, right?'",
        "'speaker_1': 'That's correct.'",
        "'speaker_0': 'If you could just go back to show the.'",
        "'speaker_1': 'Audience.'",
        "'speaker_0': 'Okay, I went to the public art meeting and there are hardly any people there. Right.'",
        "'speaker_1': 'It's okay. All right. I'm going to skip through the process and go straight to the awardees. Yeah.'",
        "'speaker_0': 'Wonderful.'",
        "'speaker_6': 'The Academy Awards.'",
        "'speaker_1': 'That I'll be using.'",
        "'speaker_0': 'Are very much.'",
        "'speaker_1': 'So. The first awardee at the $35,000 level is Island City Waterways. This is a biennial event, so it's every other year produced by rhythmic cultural works. And it really combines.'",
        "'speaker_7': 'Theater, dance and music.'",
        "'speaker_1': 'To celebrate Alameda history in the natural landscape. So this year's event will focus on Crab Cove and it will have.'",
        "'speaker_7': 'Ten performances over.'",
        "'speaker_1': 'Two days, including two performances that are particularly for Alameda Unified School District school groups. So the event is really meant to provide audiences with the opportunity to experience a free, interactive public art event about the history of the land that they live on and an understanding of how it was shaped by the water that surrounds it.'",
        "'speaker_1': 'So this is going to be held over May 18th, 19th and 20th. At the $25,000 level is the Animate Dance.'",
        "'speaker_7': 'Festival.'",
        "'speaker_1': 'Brought to us by the West End Arts and Entertainment District. So this is going to be held in October of 2018 at Alameda Point. And this is really intended to be a celebration of dance in all its forms.'",
        "'speaker_1': 'It'll include everything from performances by professional dance troupes down to performances by local youth groups. They'll have tribal dance classes so people can try out different forms of dance, and then a central festival hub with a play area and food truck.'",
        "'speaker_1': 'So it's very much a community oriented dance festival.'",
        "'speaker_7': 'And finally.'",
        "'speaker_1': 'The American landscape from sacred and profane. So this is a choral concert that is going to focus on a variety of American folk styles and traditions. It's going to include music from a number of American composers such as Paul Kihara, Sean.'",
        "'speaker_7': 'Kirchner, Stacy Gibbs and Moses.'",
        "'speaker_1': 'Hogan. And this is.'",
        "'speaker_7': 'One of a series of three concerts they're going to be doing in the Bay Area. I would say all of.'",
        "'speaker_1': 'The money that's coming through the Alameda Public Art Fund will be for the the event that will be here in Alameda. It's also going to be accompanied by a visual arts show that will celebrate the diverse traditions, landscapes and points of view of American culture.'",
        "'speaker_1': 'And two of the four artists included in that show will be Alameda Artists. So this concert is scheduled for March of 2019.'",
        "'speaker_3': 'Move approval of the item.'",
        "'speaker_0': 'Second, and I wanted to follow up. I know some of the money was not distributed. And if you could explain the next part of the process what's happening. I also do want to thank our public art commissioners. And are all of the artists participated in the process?'",
        "'speaker_1': 'So we are.'",
        "'speaker_7': 'So there was there were two categories that we didn't award, and that was the 15,000 and the.'",
        "'speaker_1': '$5,000 award categories. And so that money remains in the Public Art Fund, and we're currently.'",
        "'speaker_7': 'In the process of developing a new RFP to rerelease that.'",
        "'speaker_1': 'Money. So we had a public art commission meeting on the fourth of this month, and the Public Art Commission asked.'",
        "'speaker_7': 'Us to.'",
        "'speaker_1': 'Take a survey of our arts.'",
        "'speaker_7': 'Community to find out the best way to rerelease.'",
        "'speaker_1': 'That money. Mainly questions about what increments should we release it.'",
        "'speaker_7': 'In, in.'",
        "'speaker_1': 'Terms of award levels. And then they.'",
        "'speaker_7': 'Also asked us to look a little bit about the at the process to see if there was a way.'",
        "'speaker_1': 'To refine our selection process so we could allow for a little more interactivity between the proposers and the selection panel.'",
        "'speaker_0': 'Thank you very much. All those in favor. My motion carries unanimously. Thank you.'"
    ],
    "Resolutions on Regional Measure 3, Proposition 69 and Senate Bill 1.": [
        "'speaker_2': 'I am adopting a resolution supporting regional measure three. The Bay Area Traffic Relief Plan and a resolution supporting Proposition 69 and opposing Senate Bill one repeal to protect local transportation improvements.'",
        "'speaker_0': 'And I pulled this item and as my understanding, Gayle is going to be ready to present. And I wanted to make sure that everyone is aware of our three and the costs, but then especially the proposed benefits to Alameda.'",
        "'speaker_0': 'I think it's important for us to share that. So everyone is aware. Go ahead. Ms.. Payne.'",
        "'speaker_1': 'Do me to just respond to your question.'",
        "'speaker_0': 'About if you could give a little background.'",
        "'speaker_1': 'About the regional measure through your OC support. Regional staff is recommending to support regional Measure three, and it's going to be on the ballot June 5th. It does require a simple majority to pass and. We what it does is it does increase the bridge tolls.'",
        "'speaker_1': 'And for the seven state owned bridges, that excludes the Golden Gate Bridge. And we in return will get more transportation moneys for the bridge corridors and their approaches.'",
        "'speaker_0': 'And for Alameda, the bridge.'",
        "'speaker_1': 'That's closest to us and has the most use is the Bay Bridge. And what's interesting is Alameda owns about over 20% of Alameda commuters commute to San Francisco. And however, that's about 7000 people commuting Alameda commuting to San Francisco.'",
        "'speaker_1': 'The majority of them do not drive alone. So will not pay. Do not pay the bridge. Tolls will not pay the additional bridge tolls. There's about 22% drive alone. So we'll pay those additional bridge tolls. The other 78% take part.'",
        "'speaker_1': 'Take ferry, take the transbay busses, carpool so they won't pay for those additional tolls. So it's actually more aluminums will benefit from the additional transit that will come from these additional revenues. For example, we to the our ferry operator will be able to double their ferry service.'",
        "'speaker_1': 'Transbay busses will get an additional revenues and the transbay terminal, the new one in san francisco will pay for those operating expenses. So it's just another stable source that will allow for these really big projects that Alameda just can't afford to do.'",
        "'speaker_1': 'Ourselves there'll be a study to look at bart alameda going from bart, going from the east bay to alameda to san francisco, an additional transbay tube. So these are the types of projects we as a community can't afford.'",
        "'speaker_1': 'However, it is very important for us to be connected to San Francisco, which is has world class jobs, culture, medical care. So it keeps us connected. We are growing as a region. We have aging infrastructure. We have a backlog of projects.'",
        "'speaker_1': 'That corridor, that Bay Bridge quarter, there's only been one Bay Bridge for the past decades. And yet the region keeps continue to grow. So that's that's why it's so important for Alameda. Another thing is the majority of the moneys in an arm three come or go to transit, about 75% will improve transit.'",
        "'speaker_1': 'That means there will be reduced greenhouse gas emissions and we are vulnerable to sea level rise. So that will also be an additional benefit that will see. And I. I think that's it. And I'm available for questions.'",
        "'speaker_0': 'Thank you. Counsel, any questions? We do have a speaker on this item. Harold got Steve.'",
        "'speaker_1': 'I Carol.'",
        "'speaker_9': 'Gladstone. Alameda Resident I just want to speak in opposition to regional measures. It's a regional measure. It would affect mostly people traveling across the bay, but it would benefit all the counties around it. I just want to call your attention.'",
        "'speaker_1': 'To an.'",
        "'speaker_9': 'Informed editorial written by Mark Saulnier. He's now, I believe, a congressman he used to be. The U.S. currently serves on the U.S. House Committee on Transportation and Infrastructure and previously served as.'",
        "'speaker_1': 'The chair of the California.'",
        "'speaker_9': 'Senate and Assembly Transportation Committee. And he recommends opposition. It was an editorial in the East Bay Times dated the 13th of April. As I just want to read a few of the things that he had in this article, he feels that we have challenges of traffic, affordable housing we must address.'",
        "'speaker_9': 'But regional Measure three is not the answer. The measure would permanently increase the price to travel the Bay Area state owned toll bridges from $5 to $8 by 2025 and from $6 to $9 on the Bay Bridge during commute hours.'",
        "'speaker_1': 'It demands that bridge commuters take.'",
        "'speaker_9': 'Hundreds of dollars out of their paychecks to fund a grab bag of transportation projects cobbled together by state lawmakers. And by 2025. Typical commuters would pay about $700 more each year. That's not total. That's more than they already pay.'",
        "'speaker_9': 'And then on top of that would be that $12 a gallon gas tax, but they would see little to no improvement in their commutes.'",
        "'speaker_1': 'He feels that.'",
        "'speaker_9': 'There are so many things promised by this bill, but absolutely none of them are completely guaranteed. So. Because it's spread over so many projects. Not a single one of them is promised that any defined point in the future.'",
        "'speaker_9': 'So whether we would ever see anything, any benefit for what we're paying into is kind of doubtful, especially since the last time a lot of money was handed to the MTC. They bought a building and they renovated it with using a lot of money that was supposed to go for transportation funds.'",
        "'speaker_9': 'This bill will set up a. Unelected board, $1,000,000 of it goes to set up an oversight board, which would not be controlled by the voters but would control the outcome of the funds that go toward this measure. And it also has a poison pill in it that enables unlimited increase in the amount of tolls in the future'",
        "'speaker_9': 'without voter oversight. So that's just the other view. Thank you.'",
        "'speaker_0': 'Thank you. I'd like to ask staff if is in regards to unlimited increases, is this anyone know what? The unlimited increases. There are other issues raised in that, but starting with the unlimited increases, I'm not aware of or in regards to guaranteed projects.'",
        "'speaker_0': 'Is there do we know that in fact, we're going to get these benefits?'",
        "'speaker_1': 'So there is the oversight board and there.'",
        "'speaker_0': 'And it's not elected.'",
        "'speaker_1': 'It's who chooses. I'm not sure if it's elected as. In regards to. I also read that article and it talks about the lack of performance measures and just the lack of oversight in general. And, and just the picking the projects from it seem to say not from a planning process and as part of been part of the'",
        "'speaker_1': 'process. And so it felt like it would there was more of a process that these projects were taken from the core capacity transit study, that there was a region wide analysis on what the needs are, especially for the Bay Area Bay Bridge corridor.'",
        "'speaker_1': 'And when you look at what some of the long or the short term and mid-term. Those are easier to quantify the exact benefits in that study. It is quantified. It is true that some of the long term benefits are more difficult to quantify, like Bart Alameda when you start talking about the second Trans Bay two because that's'",
        "'speaker_1': 'not fully analyzed at this point. So there is $50 million in there to analyze that second trans bay tube. However, because it's not defined, well defined yet, it's hard to know exactly what those benefits are. So I think that's some of the.'",
        "'speaker_1': 'The wide variation there.'",
        "'speaker_0': 'Okay. So I wanted to follow up so we know that it's going to go up a dollar a year until. You know, it's like three. Every year it goes up another dollar until it hits some point. It's then this language provides that it freezes their or does that then can go up indefinitely forever and it doesn't ever'",
        "'speaker_0': 'come back to the voters. And I'm going to just have to say this is just like the hospital tax that once we sign it, we're just pretty much stuck with it without ever having it come back to voters for review.'",
        "'speaker_0': 'Is this does anyone know? Like can can it keep going up?'",
        "'speaker_1': 'It's my understanding it's only $3.'",
        "'speaker_0': 'And then it freezes. There is no ability that's worth to go. Does do we know for sure is that in is there.'",
        "'speaker_7': 'The reason that we're.'",
        "'speaker_0': 'Having. I don't actually need to know more than I'd like this. Someone know for sure because that sounded like that was one of the issues raised. And that's the first that's important. I haven't seen the fine print of this.'",
        "'speaker_0': 'Vice Mayor, do you know.'",
        "'speaker_7': 'The reason that it's a regional measure three is that we've had previous regional measures that have increased the tolls a couple of different times. So my understanding, having gone to some of the meetings around this, is that essentially it raises it there's three proposed increases to the various tolls.'",
        "'speaker_7': 'The schedules are laid out there. If we wanted to increase the tolls again, we would have to do another measure because the tolls or the tolls. And so we always vote on on those increases in mayor.'",
        "'speaker_1': 'That's my understanding.'",
        "'speaker_0': 'I yes.'",
        "'speaker_6': 'Member Ashcraft, thank you. And I would also add that the as Ms.. Paine pointed out in the first part of her report, if you are in a carpool, then you go through the carpool lane. And one of the things we're trying to do in many different ways is to discourage single occupancy travel.'",
        "'speaker_6': 'And the higher pricing on the Bay Bridge during commute hours is akin to congestion pricing that cities like London and New York are doing. And so it is both a way of funding transit options to get people out of their cars, but also cleaning up our environment.'",
        "'speaker_6': 'And actually, we have made progress in the last years in reducing greenhouse gases, and this is a way to continue to do it. Alameda would specifically benefit in many ways, including more funding for our ferry system in water.'",
        "'speaker_6': 'Transit is a and and so are we ready for motion.'",
        "'speaker_0': 'So I wanted to make sure staff do know for certain that it just ends up for those three times the $1, $1, $1 or can well is there any ability to increase it beyond that without a vote of the people?'",
        "'speaker_1': 'That's my understanding. I have not ever heard that it would be beyond the $3. Right.'",
        "'speaker_3': 'Just quickly. It would require another vote of the people and also require another piece of enabling legislation to allow the people to vote on it and, you know, MTC to actually decide to put it on the ballot. So who knows what's going to happen by then, but I'm ready to move approval of this item.'",
        "'speaker_6': 'And just for clarification, that's the whole motion, the whole matter, which is also supporting Prop 69 in opposing.'",
        "'speaker_1': 'A Senate bill, one.'",
        "'speaker_3': 'Of the item.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Motion carries unanimously. Thank you. And I believe that completes our concert calendar. Yes. What? We're going to take a short break at this time. Thank you.'",
        "'speaker_3': 'Oh, that was.'",
        "'speaker_0': 'Then resume and I believe we're on six eight now.'",
        "'speaker_2': 'Adoption a resolution authorizing the use of 1.67 million of the Phase three allocation. Alameda County Measure A1 housing bond funds to support the Roseville Redevelopment Project is required for application to Alameda County Rental Housing Development Fund 700 block of Eagle seven.'"
    ],
    "Sanctuary City Contracting and Investment Ordinance Proposal. (Vice Mayor Vella)": [
        "'speaker_0': 'I can say we do not have any speakers for non agenda as a next item. Council referrals will tracker update is on here. Did you want to speak to that?'",
        "'speaker_1': '49.'",
        "'speaker_2': 'Instead of directing staff to return with the Sanctuary City Contracting Investment Ordinance, this item is placed on the agenda at the request of Vice Mayor Vella.'",
        "'speaker_7': 'So I brought this in part for well, for a couple of different reasons. One, I want to make sure that our sanctuary city ordinance is being followed. I think there was an intent by this council to do this sort of review and make sure that our policies are contracts.'",
        "'speaker_7': 'And what we do is in line with the values that we proclaimed. There were a couple of issues that are questions that have come up. One was, how does this impact our investment portfolio? This is about investments moving forward.'",
        "'speaker_7': 'So I wanted to be clear about that. This is about investments moving forward. And we have looked at divesting before and other things are it's in line, I believe, with our investment policy in terms of looking forward on on future investments.'",
        "'speaker_7': 'Other cities have moved similar ordinances forward. Berkeley was one of them. Richmond was another. It would be nice if the city of Alameda could could join those cities. And also in terms of how we're spending our money, the technology that we're using to make sure that everything is in line with what our our proclaimed and professed values'",
        "'speaker_7': 'are. This really has to do with extreme vetting or data mining technology. It has to do with data brokers. And we want to make sure that the that. All of the city resources that we have are being used and that they're being used in line with our sanctuary city ordinance.'",
        "'speaker_7': 'And also I think this provides that sort of public transparency and check where we can make sure that everything that we're doing has a process and that it's very clear and we're looking for certain things before we contract and agree to contract with different entities.'",
        "'speaker_7': 'I thought that would happen with Vigilant Solutions, you know, wouldn't have happened if we had had something like this in place where we had a process for doing this sort of review. And I think it also gives us an opportunity to review our contracts because people that we contract with, where we have these rolling contracts that the'",
        "'speaker_7': 'last couple of meetings we voted on different contracts with different data vendors, that that kind of roll on and on and on for for long periods of time if they change their policy. This gives us an opportunity to check.'",
        "'speaker_7': 'And it also schedules it in so that we're not having to reach back or look for it. It just starts building it in. And so staff know what to look for and vendors know that they're going to be in breach of our our ordinance if they don't disclose the information to us because it's part of what we're'",
        "'speaker_7': 'looking for. So that was the impetus for Bring It Forward. And I you know, I want to thank the folks from the Oakland the Oakland group that that is focused on making sure that we.'",
        "'speaker_1': 'Are.'",
        "'speaker_7': 'Adding to transparency as well as the ACLU. They've been very supportive of this. And I'm sure you all got a number of communications on this item.'",
        "'speaker_0': 'Any other comments from council before I call the public speakers? Okay. Samina Usman and Brian Offer and then Gerry Johansson.'",
        "'speaker_8': 'Good morning. Good evening. Good night. Good morning, Mayor.'",
        "'speaker_5': 'An honorable councilmembers. My name is Brian Hofer. I'm a member of Oakland Privacy.'",
        "'speaker_0': 'I'm sorry I called a first.'",
        "'speaker_5': 'My apologies.'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'I'm a member of Oakland Privacy and the Deportees Coalition that sent you a support letter earlier where a 19 member.'",
        "'speaker_5': 'Organization representing thousands of East Bay residents. I urge you to adopt.'",
        "'speaker_8': 'This ordinance tonight, if possible. For targeted communities, this is a matter of some urgency. And I want to thank and recognize Vice Mayor Vella for her leadership in carrying this legislation. There's only essentially two components, and so there's really two questions for you.'",
        "'speaker_8': 'Should you be subsidizing Trump's deportation machine by giving contracts to vendors like Vigilant? Should you be profiting from Trump's xenophobic policies by investing in those same companies? Obviously, the answer to both is no. The freedoms afforded to us by the Bill of Rights.'",
        "'speaker_5': 'Including the First Amendment.'",
        "'speaker_8': 'Also give vigilant the right to gather data and sell it to their customers. That's what newspapers do. So we need another mechanism to disincentivize these companies that care about maximizing profit. You're probably familiar with Edwin Black's book.'",
        "'speaker_5': 'IBM and the Holocaust.'",
        "'speaker_8': 'Without IBM, the number of people that would have died would be a fraction of what they were. But they knowingly, willfully helped Hitler automate the destruction of millions of people. And so that's what we're trying to move away from concerns about the administrative burden.'",
        "'speaker_8': 'You've done this before.'",
        "'speaker_5': 'Done this before. This is not a new concept.'",
        "'speaker_8': 'Wells Fargo Border Wall Contractor Prohibitions.'",
        "'speaker_5': 'Berkeley and Oakland have anti nuclear weapons ordinances.'",
        "'speaker_8': 'That have been in effect for over.'",
        "'speaker_5': '15 years. The number of contracts that would probably fall under this and come that.'",
        "'speaker_8': 'Alameda would be in the single digits with the declaration under the penalty of perjury and a misdemeanor penalty.'",
        "'speaker_5': 'The burden is really on the vendor, not on the staff. So we ask you to make a stand like you did tonight with the vigilant LPR proposal. Make sanctuary sanctuary status real by putting a little more behind. Just a word.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_0': 'The main.'",
        "'speaker_1': 'Hello. My name is Simone Osman. I'm the government relations coordinator for the Council on American-Islamic Relations. Our organization is a member of the Deport Ice Group or Coalition. You know, when Alameda joined the number of other cities who became a sanctuary city, I think communities breathed a sigh of relief because they recognized that, you know, we are'",
        "'speaker_1': 'joining together with other cities to to say that, no, we are going to be protecting our residents and making sure that, you know, people aren't going to be targeted based on their citizenship status. We are in documentation status now.'",
        "'speaker_1': 'We truly want to be a sanctuary city. We need to make sure that we have all our bases covered, that that that we aren't going to be partnering and engaging any in contracts with companies that are actively working on targeting communities, vulnerable communities that that are concerned about their data or their information that's being gathered that would'",
        "'speaker_1': 'be used against them. And one aspect of this ordinance that I found particularly interesting is the extreme vetting aspect. Now, the Muslim community is well aware that our administration has been targeting the Muslim community based on their national origin and based on their religion.'",
        "'speaker_1': 'And people are concerned about how their information via Twitter or Facebook, whatever, is going to be used against them. And we know that these companies are trying to focus on people, not only people who are coming into this country from other countries, but also people who may have, you know, certain visas or even green cards, people who'",
        "'speaker_1': 'are naturalized citizens. This data can be used against them. And this is not what Alameda is about. This is not what we want to be. And we want to make sure that our most vulnerable communities are going to be protected.'",
        "'speaker_1': 'And we truly are following the the, you know, the spirit of the sanctuary city ordinance. And we want to make sure that we support that by passing this ordinance. And so I truly I hope that the council will consider this and consider this tonight because.'",
        "'speaker_1': 'We have vulnerable communities that are on the line. So thank you.'",
        "'speaker_0': 'Thank you. Gary Hansen and then Mike Katz. If you want to speak on this item, please submit your slip.'",
        "'speaker_1': 'Good evening. Almost good morning. I'm Sherry Johannsen and I'm representing the Alameda progressives tonight. I'm sorry. There's not a whole army of me behind behind me in support of this ordinance. The Alameda progressives were proud to stand with this council in creating and being one of the first cities to create the sanctuary city.'",
        "'speaker_1': 'If you can recall, we sort of took our initiative to put hearts at schools and all over the community and where we don't see those hearts quite as often as we did a year ago. I want to make sure that you understand that that's the real.'",
        "'speaker_1': 'Reason that we support Sanctuary City. It's the heart of Alameda. It's the people. It's the children. It's the whole inclusiveness and diversity of our people. And the problem with saying you're a sanctuary city is you really have to stand up and be counted and say, yes, we are a sanctuary city.'",
        "'speaker_1': 'We are going to protect the people in this in this. Our neighborhood and the people that we live with every day and work with every day. And when we see things like the license plate readers and we see some incidences that have happened, we tend to think, well, maybe you guys are not as strong in your support'",
        "'speaker_1': 'of the sanctuary city. And I think I was at another event earlier today in Encino High School, and the gentleman that spoke said that it's not just our children now, but it's their babies. It's saying that we really stand for something and that we're going to protect everybody.'",
        "'speaker_1': 'So I hope that you will stand very strong with the sanctuary city and oppose ice. And following the money is a really important. And that's that's what this ordinance is about. Thank you.'",
        "'speaker_0': 'Thank you, Mike.'",
        "'speaker_3': 'Good evening, Honorable Mayor Spencer, members of the city council, members of staff and remaining members of the public. This is where the glory of elected office lies. Late night, last minute decisions on the city council. My name is Mike Councilor Colby.'",
        "'speaker_3': 'I'm also a member of Oakland Privacy. I encourage you to support the ordinance before you tonight. I think it was great when Alameda joined many other Bay Area cities in declaring themselves a sanctuary city. However, what I found with most of the sanctuary city resolutions or ordinances is they were great.'",
        "'speaker_3': 'They were a great expression of support for undocumented and vulnerable communities. However, this ordinance really is where the rubber meets the road. It's where the city takes that sanctuary, that expression of sanctuary and puts it puts their money where their mouth is.'",
        "'speaker_3': 'It's been said that the only thing necessary for evil to triumph over good is for good men to do nothing. This is getting away from that and actually doing something. It is. Stop feeding the data into the deportation machinery.'",
        "'speaker_3': 'And I look forward to your support for this debate and hopefully we'll see more of this around the Bay Area as well. Thank you very much.'",
        "'speaker_0': 'Thank you. And that completes our speakers.'",
        "'speaker_3': 'Okay. I'll go first. So just briefly, I believe in everything that the vice mayor said when she brought this. This is a power that we have as individuals and as a community that nobody is going to tell us there's federal supremacy over this.'",
        "'speaker_3': 'We can contract with whoever we want a contract with. I mean, we could do business with whoever we want to whoever we want to do business with. There's no threat that if we do this, that someone's going to say, oh, I'm going to cut your federal funding or something like that.'",
        "'speaker_3': 'So this is complete within our authority. So I don't know why we don't do it. These efforts have been successful in social justice and social change throughout history. I mean, we all you know, I hear about the great workers strike, you know, every week in my office and in I remember being in college during the vesting in'",
        "'speaker_3': 'South Africa. And, you know, those things may not have been done overnight, but they were ultimately successful. And, you know, just like the, you know, the famous saying, you know, the arc of history bends toward justice. You know, we need to just keep bending that arc and getting there.'",
        "'speaker_3': 'So, you know, I'm fully prepared to support this. And I appreciate the vice mayor for bringing it forward.'",
        "'speaker_5': 'Okay.'",
        "'speaker_8': 'Okay. I think this is the logical extension of what we did when we declared ourselves a sanctuary city. And I guess the. They ask on this is to have staff look at the attached ordnance. I see that it's it's been ranked.'",
        "'speaker_8': 'So we'll see it at the at the update at the workshop. Where it sits among all the others. All right.'",
        "'speaker_0': 'But they ask, is this ever approved tonight? That's what I was about.'",
        "'speaker_7': 'About my.'",
        "'speaker_9': 'My.'",
        "'speaker_8': 'It's not notice.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_1': 'Yeah. We we could not adopt it as a first reading tonight.'",
        "'speaker_0': 'There are some some where alluding to that. So I think it's.'",
        "'speaker_8': 'Say I was just reading off on.'",
        "'speaker_0': 'Oh I appreciate your I was going to raise the same thing.'",
        "'speaker_6': 'And Ashcroft I am not opposed to having staff look into this and all the various implications. But I also and and by the way, as an Arab-American, I am certainly I have heard Azman speak several times and am always impressed and am ever mindful of, you know, the risks that are out there to vulnerable immigrant populations.'",
        "'speaker_6': 'As the city council and the gentleman alluded to this, the work we do sometimes in the wee hours of the morning, we balance a lot of different interests. And I would be remiss to not mention that less than two weeks ago in Alameda, we had a very tragic incident where in the course of an armed robbery attempt'",
        "'speaker_6': ', a woman from one of our immigrant communities was shot and killed. Not even shot, actually, it was it wasn't Charlie, but killed. And those assailants are still being looked for. But I also am very impressed with the work that Mr. Hofer has done from Oakland Privacy.'",
        "'speaker_6': 'I've read the Davis ordinance that has to do with the regarding the use of surveillance technology in it establishing a penalty for violation thereof. And while it's not the same thing because this is a, you know, divestment sort of approach, I did appreciate it.'",
        "'speaker_6': 'And I don't know how much you had to do with the the first paragraph of that ordinance, but it's something I would like our staff to also take a look at, because this is this is what I found compelling.'",
        "'speaker_6': 'And it's where I talk about the balance that we always seek to find. Whereas the city council finds that any decision to use surveillance technology, again, little different than what we're doing tonight, that must be balanced with the need to investigate and prevent crimes, protect crime victims and society from those who commit crimes, protect civil rights and'",
        "'speaker_6': 'civil liberties, including privacy and free expression and the cost to the city. Those are all things that we consider. And I don't think they're they're mutually exclusive. And, you know, this might be a road map for us at some point and a little different topic, but I very much support staff looking into into this and coming back'",
        "'speaker_6': 'to us.'",
        "'speaker_0': 'So I would also want to hear from staff and the ramifications. And honestly, this has a lot of technical language in here that I think it's very important that I go through legal and actually come back and let us know what the impact would be.'",
        "'speaker_0': 'But this is really asking from our departments. But. This has a lot in here. And it's like every contract and and including one of them says that anyone we hire for construction or public works construction bids request for information include notice of the prohibition listed above.'",
        "'speaker_0': 'I'd like to know so. But this when you break it down what this really is asking and what we think the impact would be and the cost. And I agree with member Ashcraft. I, I, I was hoping that we would have heard something by now in regards to the cameras.'",
        "'speaker_0': 'The, our police chief had asked for the additional cameras for security. And I and and I thought I thought we were going to get something back by now. And I haven't heard anything on that. But I do think it is very important that we hear also from the chief and.'",
        "'speaker_0': 'But what impact this could have on that. And one of I'll say one of my jobs is, in fact, to do our best to protect the safety of every person, regardless of immigration status. And unfortunately, I do want to speak to this, because this is something that I think everyone needs to be aware of.'",
        "'speaker_0': 'We have had our chief come here and say that unfortunately, we've had like ten. We currently have ten vacancies, I believe. And his ask was to add cameras. And I wanted to make sure that everyone is really aware of of what is going on in our town from 2016 to 2017.'",
        "'speaker_6': 'Is ten days. I think we're getting off of.'",
        "'speaker_0': 'Other people out of things. But okay, so if you want to cut me off again, this happened all night. So let's go ahead. I'll call you. Want to make a motion?'",
        "'speaker_7': 'No, I it's I think it's just more of a point of order about this specific.'",
        "'speaker_0': 'Make your motion. I've been interrupted throughout the night. Go ahead.'",
        "'speaker_7': 'So I, you know, I. I do appreciate that we want to have legal review it and legal always reviews all of our ordinances. And, you know, but I also want to make sure that this does come back to council in a timely manner, because I do think it's important and I do think that it's urgent, as I'",
        "'speaker_7': 'noted, on the. Referral. And there are some dates in there for for the review to happen. And at this point, obviously, we're not going to make May 1st, which would then give us time to go through and do a review.'",
        "'speaker_7': 'But we do still have vigilant solution license plate readers and we have other contracts. I don't know what sort of legal system we have in terms of are we using Westlaw or LexisNexis, that sort of thing. And I think what I'm I think what this is trying to do is trying to just get a sense of what'",
        "'speaker_7': 'contracts do we have, who are we giving our our public taxpayer money to? And I think the first year is going to be hard.'",
        "'speaker_0': 'I'm sorry, did you want to make a motion? Because I got cut off when I tried to talk.'",
        "'speaker_7': 'It was a point of order because you were talking about something that was an.'",
        "'speaker_0': 'Genuine to talk.'",
        "'speaker_7': 'Though. I'm talking about something that's been agenda.'",
        "'speaker_0': 'This is agenda. I'm asking the question information. But I was trying to speak with goes to issues that relate to this.'",
        "'speaker_7': 'So I'm trying to ask staff and have a conversation with our acting city manager, because I think part of the concern that I've heard is the amount of time it's going to take to review this and and go through our contracts.'",
        "'speaker_7': 'And I think part of this is just establishing a protocol and a practice for the review and to have it be transparent. So. With that, I'm going to make a motion to have direct staff to look at adopting the sample ordinance for the Sanctuary City Contracting and Investment Ordinance.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'All those in favor I.'",
        "'speaker_6': 'To have staff look in, to.'",
        "'speaker_1': 'Look at.'",
        "'speaker_7': 'To look into this ordinance.'",
        "'speaker_0': 'Although, I suppose.'",
        "'speaker_8': 'I have a question and you reread your we state your motion.'",
        "'speaker_7': 'I said direct staff to look at adopting the sanctuary city contracting and investment ordinance. So have staff back to us. With us with it.'",
        "'speaker_8': 'With an analysis.'",
        "'speaker_7': 'Of the proposed ordinance.'",
        "'speaker_0': 'What should happen is they would go to the priority setting meeting where we would discuss it there. If it if we're treating it like our other referrals.'",
        "'speaker_6': 'It is that I mean that.'",
        "'speaker_7': 'It's a referral.'",
        "'speaker_0': 'That the.'",
        "'speaker_6': 'Motion.'",
        "'speaker_7': 'Motion is to have staff and will be analysis.'",
        "'speaker_1': 'And.'",
        "'speaker_8': 'Will discuss and.'",
        "'speaker_4': 'We can discuss it on the right.'",
        "'speaker_8': 'On the 18th. Right. Yeah.'",
        "'speaker_1': 'That's the that's the motion I'm in.'",
        "'speaker_8': 'I'm in.'",
        "'speaker_6': 'That's right. Yes.'",
        "'speaker_3': 'Sorry.'",
        "'speaker_0': 'It's late when I post. So for one, emotion carries. And where are we now?'",
        "'speaker_6': 'Council communications.'",
        "'speaker_0': 'Council communications.'",
        "'speaker_6': 'Mayor and. I want to apologize. I didn't mean to be cutting you off. I was trying to raise a point of order that I thought we were moving away from the topic of the council referral. That said, I did attend an amazing all day meeting of the Statewide Policy Committee.'"
    ]
}