{
    "Labor Negotiations with Various Employee Organizations.": [
        "'speaker_1': 'negotiator is this former dam employee organizations are IBEW, EU, a ACA and NCAA and under negotiation of salaries and terms of employment.'",
        "'speaker_0': 'Thank you. Now turn to closed. So we are going to resume our revised special meeting from 430 this afternoon. We had met in closed session. And do you want to report out now?'",
        "'speaker_1': 'There was conference with labor negotiators and counselor received a briefing. There was public employee appointment hiring and direction was given to staff. And the meeting was continued to Friday, December 18th at 8:30 a.m.. And there were two cases of anticipated litigation with the city acting as defendant, and in the first case, direction was given to staff, and'",
        "'speaker_1': 'in the second case, counsel was briefed on the item.'",
        "'speaker_0': 'And did you specify that we had a date that we were continuing to. Yes.'",
        "'speaker_1': 'I I'll repeat again December 18th at 8:30 a.m. for the hiring matter.'"
    ],
    "Budget Amendment for Other Post Employment Benefits Obligation.": [
        "'speaker_1': 'The recommendation to amend the General Fund fiscal year 20 1516 budget by appropriating 3 million from the General Fund committed fund balance to pay for the city's other post-employment benefits obligation as stated in the Safety Bargaining Group's Memorandum of Understanding.'",
        "'speaker_0': 'All right. So. Could you clarify I pull this out in the title says Recommendation to Amend General Fund Fiscal Year 20 1516 Budget By Appropriating $3 million. Could you clarify what $30 million is and what we're really being asked to do here?'",
        "'speaker_0': 'Sure.'",
        "'speaker_1': 'My name is Elaina Dyer and finance director. So what this particular item is is really an administrative item. So what happened back in April of 2015, council approved the safety for safety contracts, bargaining group contracts, and the OPEB section stipulated in those contracts that the city is required to deposit $5 million to the irrevocable trust OPEB trust'",
        "'speaker_1': '. We have $2 million already set aside and ready to go. However, we the $3 million that is part of general fund additional contribution is sitting in the general fund and we need to appropriated so that the payment can be made in January.'",
        "'speaker_1': 'As a clarification item, the Council did approve a commitment of $3 million in September, and that's not the same money that we were talking about prior to the council being superseded here in December of 2014. There was another commitment made for $3 million.'",
        "'speaker_1': 'Just happen to be the same dollar amount, and that's the dollar amount that was. To be used, actually, or at least assumed to be used back in April for the payment of $5 million. Madam Mayor, it was. It was set aside, but not appropriated.'",
        "'speaker_1': 'And this is just the authorization to appropriate the money.'",
        "'speaker_0': 'All right. In the 2 million, has that already been appropriated for this? That's correct. And this is then the 5 million that per the for am I use is to be made contributed by the city to an irrevocable OPEB trust by in January or by January 2016.'",
        "'speaker_0': 'Correct. All right. Any other.'",
        "'speaker_3': 'Question?'",
        "'speaker_0': 'Yes. I swear.'",
        "'speaker_3': 'When will these dollars be deposited into the interest bearing account?'",
        "'speaker_1': 'I'm in January, so we are waiting for an appropriation so that we are ready to go. I believe the contract just says January, but January 2016.'",
        "'speaker_3': 'So that's when they'll start accruing as soon as that deposit happens.'",
        "'speaker_0': 'That's correct. And the trust. Is this the five? I trust that this money will be deposited into.'",
        "'speaker_1': 'No, it's not the five. I is actually a different type of trust in which city merely just assists the bargaining groups to set up the trust. But there's no contributions going to that trust from the city. It's strictly employee contributions and those are really to supplement their retirement.'",
        "'speaker_1': 'And it has nothing really to do with OPEB. The members may choose to use portion of that money that they on their own contribute to use towards premium health premium. But that's not something that city's participating in.'",
        "'speaker_0': 'OC than the OPEB trust that this money will be going into. Is that all or solely city council contributions, or does that OPEB trust include both City Council contributions and member contributions?'",
        "'speaker_1': 'It's combined. So the contribution will be going into one account and it's going to be a pooled account and we'll be earning the interest on the total.'",
        "'speaker_0': 'And that's a current that's pulled account that's currently established.'",
        "'speaker_1': 'The city will be setting up an account specifically that for the safety and we'll use the word determined that it's actually is actually at the same time a stipulation within the the contracts. But it will not be commingled with moneys that been deposited for existing retirees.'",
        "'speaker_1': 'These are for the future retirees of the safety groups.'",
        "'speaker_0': 'But that trust has already been established and it currently has money from both employees as well as city donor contributions.'",
        "'speaker_1': 'It's the same trust. It will be tracked in a separate account. Within the same trust.'",
        "'speaker_0': 'So is there a way to have some sort of accounts within this account that's that do not co-mingle the city contributions and the employee contributions?'",
        "'speaker_1': 'Well, actually, the contributions for the purpose of the trust itself, as well as for tax purposes, are all considered to be city contributions. In essence, it almost makes it, as you would say, a charge to the employees. And it's not separated for that reason.'",
        "'speaker_0': 'Member. Ody.'",
        "'speaker_5': 'I like to move approval of the item.'",
        "'speaker_2': 'Our second.'",
        "'speaker_0': 'Were there any questions?'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'QUESTION Members, just to be.'",
        "'speaker_6': 'Sure. Now, the trust that we're talking about, as indicated in the staff report, this is about the April 2015 trust that we had a discussion which basically the former city manager, Russo's trust fund idea to help pay down the OPEB liability in the future by combining not only the employee's contributions through new payroll, but also helping finance'",
        "'speaker_6': 'that through the mechanism being discussed right now. That's what this is all about.'",
        "'speaker_1': 'Yes. And this is, as I mentioned, that's an administrative item for us to move the actual money to the trust. We need to have an appropriation to do so.'",
        "'speaker_6': 'Now, I raised that because back in April 2015, when this was raised, the concern that I made then and still have is I do think that the trust is undercapitalized. And I do think that the time is now to really think through how to well-capitalised the trust fund.'",
        "'speaker_6': 'Because the way it looks now, going back to the April 2015 discussion, it runs out of money by roughly the year 2034. But you begin to begin to see a decline in the amount in the trust fund, even as I think 2025 or 2026.'",
        "'speaker_6': 'Now, I know the counterargument is, well, you know, at some point in time, we will make sure to fix it. We just don't know. You know, you just never know that, you know, there might be some things that happen in the year 2022.'",
        "'speaker_6': 'I mean, you know, that's many years from now that precludes us, the city council or the Future City Council from from fixing it, the way in which we foresaw possibly right now. So so I still do have my concern about the undercapitalized nature of it.'",
        "'speaker_6': 'And sure, I could certainly vote for this, but then I think that would kind of water down my concern. My goal is ultimately to fix what I believe is the undercapitalized nature of this. And I do have some suggestions, but I'll I'll remain consistent with my vote of April 2015.'",
        "'speaker_0': 'I'm sorry. So I also opposed that contract. I think long term it does jeopardize the fiscal health of the city. I also will not be supporting this. So I'm going to call you on it.'",
        "'speaker_5': 'Just a couple of quick points. I mean, this is a contract that we signed with our bargaining unit is that we have to honor. So it seems like if we vote no on this, then we're we're violating the terms of that contract, which seems to me a violation of our fiduciary duties.'",
        "'speaker_5': 'And I also don't seem to understand the argument that if it's undercapitalized to begin with, that you improve that problem by not funding it by the amount you promised it, because then you're even undercapitalized even more. So it seems a little, you know, hypocritical in my mind that, you know, to say that I'm not going to vote'",
        "'speaker_5': 'for this because we're the big project or the big fund is undercapitalized and then miss out on a chance to actually put money in there, which we promise to do. It just seems a little bit odd to me, but it is what it is.'",
        "'speaker_0': 'So I'm happy to respond to that. I actually think that we need to come up with a serious solution and not something that's a partial solution, and that at this point, we are not there. And and so that's.'",
        "'speaker_0': 'So I appreciate your comment. At the same time, I cannot support the solution, which was that contract, and I didn't support it then. So I'm member Ashcraft.'",
        "'speaker_2': 'Thank you, Madam Mayor. So I look forward to future discussions and perhaps agenda items and hearing from our Mayor and Councilmember Desai as to how we can further enhance what we have started to do under the last administration.'",
        "'speaker_2': 'But I don't think any of us thought we were going to solve the problem of the underfunding of this liability overnight. I think $5 million is a decent start and we want to get that money into this account, which is also known as the lockbox.'",
        "'speaker_2': 'I think that it's not I mean, it's very strict purposes for which the funds can be used. So, you know, there's a lot that we can discuss, but I don't want that money just sitting out there, not in an interest bearing account.'",
        "'speaker_2': 'I want us to get started. So I hope we'll have a majority vote to go forward with that appropriation tonight.'",
        "'speaker_6': 'So just to be clear as to what my concern is, my concern is that you have members of public safety, police and fire who going forward are going to pay out a certain amount from their own paychecks towards basically self-funding or partially self-funding their their retirement.'",
        "'speaker_6': 'And combining that to start that off or putting in $5 million to capitalize this project over time is going to generate money through interest. But we already know through our discussions of April 20, 2015. We already know, though, that what we're starting off now, the formula that we're starting with now in terms of persons is contributions as'",
        "'speaker_6': 'well as the capitalization that we're providing is not enough. We already know that is going to run to zero in 2034. We already know that even by 2026 it begins to go slope downwards. So knowing what we know about it running out, to me, that tells me that we need to have a discussion about fully capitalizing it'",
        "'speaker_6': '. Right now, I've offered two ideas of, you know, securing the 1079 and 1081 retirement accounts, preserving, you know, what we would have paid to those folks putting it towards this. So that to me is the better course of action is to you to cement some kind of policy, knowing that we know that knowing that we already know'",
        "'speaker_6': 'that this is going to run out of money is at the end of the day, it's not fair, in my opinion. It's not fair to the public safety person who in 2016 or 2017 and years are paying out as opposed.'",
        "'speaker_6': 'It runs out of money and they retire. You know they're going to retire in 2031. That's not fair. So I think that's why we we need to take the time to ask this out.'",
        "'speaker_0': 'And I want to clarify that the vote for the MIS was was this council. It was April 29th, 2015. This council approved different avenues and that vote was 3 to 2. All right. I'm going to call the question all those in favor.'",
        "'speaker_5': 'I.'",
        "'speaker_0': 'As opposed.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'I love you. Thank you. The motion carries. Three, two, two. Thank you. The next one I pulled was by.'",
        "'speaker_1': 'Adoption of resolution of proving administrative correctness to better reflect current medical contribution rates, dental plan modifications to update language changes related to the Public Employee Pension Reform Act and to list specific uniform rates to the memorandum of understanding between the fire chiefs and the city for the period commencing November 1st and ending 2015 and ending December 18'",
        "'speaker_1': ', 2021. I don't believe that's the kind of idea.'",
        "'speaker_0': 'Regarding the trust.'"
    ],
    "Resolution to Amend the IAFF Supplemental Retirement and Health Plan and Trust Agreement to Include AFCA, APOA, and APMA Employees and Trustees.": [
        "'speaker_1': 'Supplemental retirement trust. Oh, a uniform resolution amending the International Association of Firefighters Supplemental, Retirement and Health Plan and Trust Agreement for IAF employees hired after June seven, 2011, to include the Fire Chiefs Association, the Police Officers Association, the Police Management Association and Employees hired after July.'",
        "'speaker_1': 'So June seven, 2011, provided in a memorandum of understanding between the city and the agents, the three different bargaining groups.'",
        "'speaker_0': 'And could you describe what you're asking here?'",
        "'speaker_1': 'Certainly. So about a year and a half ago, again, prior city council approved a supplemental retirement trust for International Affairs, International Association of Firefighters. And that was that particular trust only included that particular bargaining group with the approval of the contract in April of this year.'",
        "'speaker_1': 'The remaining three safety groups requested to have similar trust in discussions with the ATF and the other safety groups if they would be willing to participate within the same trust. And they said yes. So for that reason, because originally the trust was only set up for IGF group, we need to amended both the trust and the plan'",
        "'speaker_1': 'to include the remaining three. And with that particular agreement and the trust, the contributions are made strictly by the employees. And in essence, the city is just facilitating the ability for them to do so.'",
        "'speaker_0': 'So these are only contributions by employees? That's correct. No moneys from the city?'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'None. All right. Any other questions?'",
        "'speaker_3': 'Yes, Madam Mayor, just to clarify that the the the money that's gathered in this trust. Normally would have been paid by the city.'",
        "'speaker_1': 'No. This trust in particular is a retirement trust. Right. And it was in exchange for when we removed the spousal coverage for retirement health. And what the city said was, you're no longer going to get spousal coverage when you retire, but we will set up this trust for you so that you can put your own money in'",
        "'speaker_1': 'it to help cover the cost of your city pain. Exactly. In lieu of the city paying for spousal coverage. So it's not none of our money. It's the employee's money. And it's for employees who are hired after 2011, because when that that's when that provision went into the menu.'",
        "'speaker_3': 'And previously, that was a benefit that was funded by the city.'",
        "'speaker_1': 'Is that correct? That's right.'",
        "'speaker_0': 'Thank you. And this trust is separate, completely separate from the trust and five D.'",
        "'speaker_1': 'That's right. That's correct. This is a retirement trust. The other trust was an OPEB trust.'",
        "'speaker_0': 'All right. Any other questions? We have a motion. Some of all those in favor I. Motion carries unanimously. Thank you. Six.'"
    ],
    "Ordinance to Streamline Permitting for Second Units.": [
        "'speaker_1': 'A public hearing to consider introduction of ordinance amending Chapter 30 of the Alameda Municipal Code the zoning ordinance to streamline permitting for second units. The proposed amendments regarding second units are Statu Tory exempt from the California Environmental Quality Act guideline.'",
        "'speaker_4': 'Good evening. Go ahead, sir. Members of the council. My name is Sandra Thomas, city planner. I'm going to introduce this item and I'm going to turn it over to Mr. Allen Tai, who's your planning services manager and the expert on second units in Alameda.'",
        "'speaker_4': 'All second units go through his shop downstairs at the permit center. The item before you is a recommended amendment to the ordinance that governs second units in Alameda. The book is The Wrong Sequence. There you go. Thank you.'",
        "'speaker_4': 'So it's a first reading of a draft ordinance amendment. This started this conversation started just in September of this year. On the 14th, we took our annual report on the housing element to the planning board. That report was a very extensive report which went through all of the city's ordinances related to housing.'",
        "'speaker_4': 'It's something that's mandated by state law that we do it. Our our housing element actually ups the requirement and says that there's a whole number of ordinances we have to we should be looking at to make sure that they're all working as we envisioned.'",
        "'speaker_4': 'So we went through and described every single ordinance density bonus, inclusionary many ordinances that the council is very familiar with and had already been improving over the last year. We also touched on the parking ordinance and the secondary unit ordinance and in that review of the secondary unit ordinance, we informed the public and the planning board that'",
        "'speaker_4': 'that ordinance is generating very few second units here in Alameda. And in fact, in the last five.'",
        "'speaker_6': 'Years we've basically created.'",
        "'speaker_4': 'About two secondary units, so less than one a year. And the planning board, knowing what is going on in this community and in terms of the housing shortage, the rent issues that the council struggling with, that the discussions about sort of the missing middle, you know, we're providing some very low and restricted units, but and we're finding'",
        "'speaker_4': 'some expensive market rate units. But what about those small units for seniors, for single person households, for people who make enough money so they don't qualify for the very low income but don't make enough money to pay for these very expensive new units that are getting built, that sort of missing middle and the planning board's attitude and'",
        "'speaker_4': 'the people, folks who came to the public workshops like yes second unit small little units, those are can fit that gap. We should be doing more than two in five years. So the planning board said, you know what, staff, we want you to put together a draft amendment to see what's wrong with our second unit because it's'",
        "'speaker_4': 'an important tool for the council and the community to be using and it doesn't seem to be working. So we came back on September 26 with some adjustments to the code which we think would we hope will generate more second units per year.'",
        "'speaker_4': 'Now, you know, we think maybe 10 to 15, maybe 15 in the first year and then sort of leveling out year to year nine, ten, if we're lucky. So it's not a huge amount of housing, but, you know, every little bit helps, especially in this small category.'",
        "'speaker_4': 'The planning board held a second hearing to refine the ordinance in November and said, you know what, send this up to council and see if this is something the council is interested in considering. So here we are. Just a little background.'",
        "'speaker_4': 'Housing element is your housing element policy. I know you all know this, but for the folks behind me, it sets the city's housing policies. And there's a whole string of policies that really talk about the need for not just affordable housing, but sort of these sort of special needs housing.'",
        "'speaker_4': 'Senior housing is something that's been a big priority in the community recently. These are, you know, sometimes called in-law units, granny units. So they sort of serve that kind of population. And, you know, once again, small they're the thing about these, they're rental by law and by our current code, they can't be sold.'",
        "'speaker_4': 'These are guaranteed rental units at a small size. You know, and you've been really working hard as a council to deal with the rent crisis, the housing crisis. And there's you've been trying to deal with that complicated situation.'",
        "'speaker_4': 'There's a toolbox available to you. You've been spending a lot of time discussing those issues around rent control, around supply. This is just one of those tools in the toolbox. It's not going to solve the housing issue by any means.'",
        "'speaker_4': 'It's just one of the tools available to you. The planning board and the staff just believe it's an opportunity for you, if you're interested, to make that tool a little bit more effective, to sort of improve our ability to provide for this sort of niche housing.'",
        "'speaker_4': 'So I'm going to now turn it over to Alan, who will take you through the specific changes and a little bit more detail on second units and Alameda. Good evening, Madam Mayor. Members of the Council, L.A. Planning Services Manager.'",
        "'speaker_4': 'As Andrew said, I am I am at the permit center. So I do know about the questions that we get at the counter and homeowners that have been coming asking about second units and they walk away when they realize they don't qualify.'",
        "'speaker_4': 'And when we talk about second units, we're not just talking about adding another unit to a single family property. It's a very specific category of units that's enabled under state law, and there are many names for it granny units, in-law units, companion units, accessory dwelling units.'",
        "'speaker_4': 'They're basically hidden in nature, out of sight, and that's sort of their intent. And they take advantage of surplus space that might be inside a basement or an attic of a home, or they can be in a backyard cottage tucked in the back.'",
        "'speaker_4': 'And so for those reasons, they're often regarded as a very good opportunity to accommodate an elderly person, a grandma who might have special needs. But we want her to live independently and yet close in close proximity of the family.'",
        "'speaker_4': 'They may also accommodate the adult child who's coming from college and just starting a career and can't afford housing in the same community. Also great housing opportunity for just to accommodate families who want to just grow in place.'",
        "'speaker_4': 'The second units are also seen as a sustainable way to add housing. It maximizes the use of existing infrastructure. You don't need new land and it really has a low impact on the neighborhood if if the parameters for the second unit are are here too.'",
        "'speaker_4': 'And as Andrew mentioned, they really provide this sort of gap housing for there, not affordable housing in the sense of capital, affordable meeting, the income thresholds. But it really fills the gap, you know, for families who don't who make more more than the threshold to qualify for true affordable housing, but yet can't afford the market rate homes'",
        "'speaker_4': 'that the larger developers are building. I'm going to talk a little bit about the state law, because this is important in terms of how we set up our ordinance. The state legislature has long recognized second units as a valuable form of housing and to deal with the housing crisis here in California.'",
        "'speaker_4': 'And the first variation of the ordinance dates back to 1982. But the current ordinance, the legislation excuse me, that's in effect, dates back to 2003 with the with AB 1866. And this legislation explicitly sets forth parameters for how cities adopt second units in the process that that it goes through.'",
        "'speaker_4': 'For example, it requires local cities in California to process second unit applications ministerial. What that means is you the cities can adopt their checklist of requirements if the application for a permit for a second unit meets all of the checklist requirements.'",
        "'speaker_4': 'You have to give them a building permit. So meaning no discretionary review. So what that means, again, is normally here in Alameda, if you add a unit or build a second, a detached structure, you have to go through design review.'",
        "'speaker_4': 'There's a public notification component of a ministerial process. There is no public notification. The state law sets forth that the requirements in these second units cannot be arbitrary, excessive or burdensome to the extent that you are generating no units.'",
        "'speaker_4': 'You also can't preclude units in specific single family or multifamily zone. So basically the state wants cities to make this happen. And most importantly, the 23 law establishes a statutory exemption under Sequoia. So basically it says that any city that's adopting ordinances to implement second unit law are exempt from having to do environmental impact analysis.'",
        "'speaker_4': 'And that's sort of the state's way of dealing with a lot of the not in my backyard opposition that they've seen since 1982. And look, as in many local communities that have been pushing back on second unit. So I'm going to talk a little bit about just the changes that staff is proposing to the second unit ordinance'",
        "'speaker_4': '. In summary, our approach is really a balanced approach. We want to first lower the. We want to first increase the opportunities where we're homeowners. Property owners in Alameda can apply for a second unit. But we also wanted to ensure that the regulations that we're changing or the regulations that would ensure that a second unit would would exist'",
        "'speaker_4': 'in harmony with the existing neighborhood are kept in place. And we're also trying to tweak some of the loopholes that are currently in the ordinance. And as Andrew mentioned earlier, we anticipate that changes in the ordinance could generate up to 15 units a year.'",
        "'speaker_4': 'And I'll explain a little bit on how we got to that number. This the summary table pretty much shows what changes staff are proposing and what the planning board has recommended. Currently, our ordinance sets a requirement that lots have to be 75,000 of 7500 square feet in size to be eligible for second unit.'",
        "'speaker_4': 'There are approximately 400 properties in Alameda that qualify right now under the current ordinance, and we've generated two applications in the past five years. Staff's proposing to lower that threshold to 4000 square feet. And 4000 square feet is essentially the the density that's allowed in Alameda under measure 82,000 square feet per lot.'",
        "'speaker_4': 'We think that's that's that's a good threshold to look at. We're also, as I mentioned, trying to fix some of the loopholes and that's where the second row comes into play. Currently, our earnings says that a second unit can have up to 600 square feet of habitable space.'",
        "'speaker_4': 'Well, storage areas are not storage rooms are not have little space. And I have seen plans that come in through the counter that show a one bedroom, a habitable area and three other storage rooms that really look like bedrooms.'",
        "'speaker_4': 'So. Well, this is a loophole that I can't after the staff report has been published. So I would like counsel direction to close that loophole, maybe with the second reading. One other example of how we would try to amend the ordinance and ensure the keeping of the existing neighborhood character is tying the second unit with the accessory'",
        "'speaker_4': 'building regulations in the sister building regulations are specifically written to ensure that the the attached structure matches the main house and that it's small. So currently the second unit ordinance allows second units to be up to two stories tall in the back yard.'",
        "'speaker_4': 'I mean, we've heard some concerns about, you know, these structures, you know, changing the character of the single family neighborhoods by tying it to sensory building regulations. We can bring that down to a single story. We're also proposing to modify the parking regulations.'",
        "'speaker_4': 'In the next slide, I'll get into some specifics about why we're doing that. But some of the other rules that are in place currently, such as, you know, no separate sale, the second unit will be kept in place.'",
        "'speaker_4': 'And we're also going to add the provision that you can't build a second unit and then post it on Airbnb to use as a short term rental. So again, our approach staff's approach is amend the ordinance amendments is really to to.'",
        "'speaker_4': 'Loosen up. Kind of the analogous of the spigot. Loosen up the spigot a little bit so we get a trickle of more, you know, the trickle of more units. But at the same time, not not to change all the parameters that would then.'",
        "'speaker_4': 'Affect the single family home character.'",
        "'speaker_0': 'Before you move on, can you clarify that last point about not being able to use it as a vacation rental? Is that because the purpose of this is to create more housing, not vacation?'",
        "'speaker_4': 'Yes. The intent of the ordinance is really to help Alameda families who may have an elderly that they want to have live independently and in close proximity or an adult child. It's not really to provide opportunities for somebody to make a quick buck.'",
        "'speaker_4': 'Thank you. That's really the staff.'",
        "'speaker_0': 'Member, Odie.'",
        "'speaker_5': 'So any second units that are in existence today, they could be used as vacation rentals through Airbnb?'",
        "'speaker_4': 'Yes. Okay. Because we that provision is not in the current ordinance.'",
        "'speaker_2': 'So Ashcroft and Mr. Taylor, you you said that you would explain to us the basis of your estimate that this proposed change could generate up to 15 units applied for in a year. You're still coming to that?'",
        "'speaker_4': 'Yes, I will get to that.'",
        "'speaker_0': 'All right. I'll wait. Number.'",
        "'speaker_6': 'So for the 707,500 threshold, which we want to change to 4000 square feet with a 7500 square feet threshold, there was roughly if I heard you write it, you say.'",
        "'speaker_4': '400, 400 eligible.'",
        "'speaker_6': 'Eligible lots. So how about for the 4000 square feet?'",
        "'speaker_4': '4000. There there would be 3900 3900. In addition.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'BRODY So going back to your can you go back a couple of slides to the. That one right there. So is our current ordinance in compliance with the state law?'",
        "'speaker_4': 'Yes. So we've met the letter of the law of the state law in providing a second unit ordinance. Is now. Do we deserve a passing grade? I would say no. I mean, essentially using the same analogy, if the state law requires you to have a spigot, we built the spigot, but we didn't necessarily turn it on or'",
        "'speaker_4': 'we did enough to have two drops, two units.'",
        "'speaker_5': 'So we're still in compliance today. I mean, we're not.'",
        "'speaker_0': 'We know we're.'",
        "'speaker_4': 'Not. We're. Right.'",
        "'speaker_5': 'Any state law. And then on the on this count, does this and count include the units at in Harbor Bay that have cars that prevent second units? No. Our plan is just to continue to exclude those or.'",
        "'speaker_4': 'Well, those those properties are in a planned development. And so I think even if we look at the topography of those neighborhoods and how those lots are situated, built, it's it's I would assume it'd be very difficult for those homes to get in the second unit unless they have to really carve out or create internal units.'",
        "'speaker_5': 'And are we talking about internal second units or external or both?'",
        "'speaker_4': 'Both. The ordinance allows both. And we propose to continue to allow both types of units.'",
        "'speaker_5': 'Okay. I may have more later, but.'",
        "'speaker_4': 'Remember in the Harvard bases in ours, I believe preclude second units.'",
        "'speaker_6': 'When you talk about internal second units, are we talking about situations where people raise their homes and then have the bottom home as a completely.'",
        "'speaker_4': 'Attached versus detached? Detached units are often in the basement or in an attic.'",
        "'speaker_6': 'That they raised they can raise.'",
        "'speaker_4': 'Okay. Mm hmm. But if somebody raises at home, it would be subject to design, review and all the design guidelines. And if it's an older home, a Victorian.'",
        "'speaker_6': 'But that would be considered a second unit within the meaning of of what we're deciding tonight.'",
        "'speaker_4': 'That potentially.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_5': 'All right.'",
        "'speaker_0': 'Another one. And then Brody.'",
        "'speaker_5': 'But if we do have an older Victorian home, there's I mean, what you're asking us to do is to allow an internal unit to be added to that home. So basically making that a multi-unit home.'",
        "'speaker_4': 'The current ordinance already allows that.'",
        "'speaker_5': 'It does? Mm hmm.'",
        "'speaker_4': 'Current ordinance. I mean, just to be clear.'",
        "'speaker_5': 'Well, under over 1700 feet.'",
        "'speaker_3': 'Yes.'",
        "'speaker_5': 'Now we're adding 3500 more possible older units on the main island, zero on Bay Farm that can be eligible to be subdivided. Right.'",
        "'speaker_4': 'Well, not subdivide it.'",
        "'speaker_5': 'Well, maybe we'll send a single family home into a multi-family home.'",
        "'speaker_4': 'Into a multi-unit.'",
        "'speaker_3': 'In a mayor.'",
        "'speaker_0': 'And vice mayor.'",
        "'speaker_3': 'I don't believe it's zero on Bay Farm. It's, it's there's the ones in.'",
        "'speaker_5': 'The Bay Farm portion. Yes. Old Harbor Observer.'",
        "'speaker_4': 'Suburb. Correct.'",
        "'speaker_2': 'That that was my comment to.'",
        "'speaker_0': 'You may continue. All right.'",
        "'speaker_4': 'Excellent, Andrew. So the previous slide or that summary table or basically all of the checklist requirements that somebody has to satisfy in order to obtain a second unit permit ministerial. But of all of those different standards, parking, as you may know, is really the number one key that we have over over development.'",
        "'speaker_4': 'And you've probably seen this with other projects where parking you can if you relax the parking enough, you can get more units. If you tighten the parking controls and make it very stiff, you you would basically eliminate that possibility.'",
        "'speaker_4': 'And I think the current ordinance as under scenario A over here on my left requires that a property with a second unit provide three parking spaces. So it's the two plus one, two parking spaces for the main dwelling, and you have to add one independent space for the second unit.'",
        "'speaker_4': 'Obviously very few Alameda properties can will have the space to accommodate that. And then if you look at the diagram too, it also is the scenario where it takes up or it adds the most paving to a lot.'",
        "'speaker_4': 'And you know, the homeowners would really have to make a choice even if even if they have the space to accommodate all of the spaces and the driveways, they are giving up a lot of yard space. The staff recommendation was really to relax that rule a little bit and just to say, hey, if you have a single'",
        "'speaker_4': 'family lot that currently has two parking spaces, you may accommodate a second unit by assigning one of those two spaces to the second unit. But the two parking spaces has to be independently accessible. The Planning Board concurred with staff on relaxing the parking rule, but they recognize that most Alameda properties simply just have a long driveway on'",
        "'speaker_4': 'the side. There's not a whole lot of space in the yard to create a whole parking area. And so they actually recommended that the ordinance be revised to allow two spaces, but that they can be in tandem. So.'",
        "'speaker_4': 'And the reason for the staff recommendation to not go with Tandem is this concern that, hey, you know what, if if I do rent my second unit out to a tenant, would I then have to knock on their door and move their car?'",
        "'speaker_4': 'And and there's this fear that that car might just end up on the street. So but that's kind of the explain the three scenarios. And and this is very key in terms of whether our second unit ordinance would be effective in generating units will literally come down to how we treat the parking.'",
        "'speaker_4': 'I mean, large size, you could set the lot size zero. But if, if, if the lot is not configured to meet the parking requirement, the second unit is really out of the equation.'",
        "'speaker_0': 'Before you move on. Actually, could you go back to the planning board or do you or is there any way to, you know, enforce that the parking that driveway would be used for the two, two cars, assuming at least two cars.'",
        "'speaker_0': 'Right. As opposed to having a car end up on the street.'",
        "'speaker_4': 'Yeah. That's that's that's not enforceable. Even currently when we review project plans and to verify for compliance with the parking ordinance, I mean, this is a behavior issue. We can only regulate it so far as that. The plans demonstrate they have the space to accommodate the parking, but there's no enforcement over whether somebody uses their garage for'",
        "'speaker_4': 'parking versus storage. That's really what it comes down to, a behavioral issue.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'So what does this all of these amendments mean? And because Almeida hasn't had a very successful track record and we really have no data. The city of Santa Cruz is really a good case study for us to look at.'",
        "'speaker_4': 'And and not only because its population size is very similar to Alameda and they're also dealing with similar housing issues as we are. I mean, I think I've read about only 7% of Santa Cruz residents can actually afford to live in Santa Cruz.'",
        "'speaker_4': 'And so they're also running into a huge housing crisis. But the Santa Cruz ordinance is also an award winning ordinance, second unit ordinance, because it's very bold and it really goes out of their way to incentivize second units.'",
        "'speaker_4': 'They make 18,000 of their lots eligible for second units. They have a minimum lot size of a requirement of 5000. But again, the large size is really contingent upon the local topography. They allow second units to have two stories.'",
        "'speaker_4': 'They allowed second units to be two bedrooms, while the Alameda current audience is one bedroom. They allow ten in parking spaces and they incentivize. Second units by waving permit fees for homeowners who choose to put a cap on their rent.'",
        "'speaker_4': 'And so this this is a way to ensure affordability.'",
        "'speaker_6': 'So it's a good idea.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'Yes, Vice.'",
        "'speaker_5': 'Mayor.'",
        "'speaker_3': 'I didn't read any anything that even approached that in our ordinance. Yet our driver here, at least in half, when you look at at the findings and the goals was to provide affordable housing and even gap housing. Is there a reason we didn't put any incentive to grant basically a value to the property owner in exchange for'",
        "'speaker_3': 'a a deed restricted similar to a developer affordable unit or even a gap housing unit.'",
        "'speaker_4': 'Yeah. That's certainly something that we can look at. But don't don't forget that with any sort of administration of a cap or a restriction, there has to be monitoring. And the administration of Santa Cruz has a program where they monitor and they have staff that does compliance reporting.'",
        "'speaker_4': 'And I think we need to be careful, too, because it also. Requiring a deed restriction. And Andrew reporting on homeowner of single units of a second unit. Maybe that one that they want to create for their grandma. But but with potential in the future as rent, rental or income generating property, it might be seen as a disincentive'",
        "'speaker_4': 'that it's adding another stipulation to all of the.'",
        "'speaker_3': 'Well, I think we can discuss that, but I wanted to raise that. It's not in here at this moment.'",
        "'speaker_4': 'It's not in there.'",
        "'speaker_3': 'Santa Cruz has it. And we actually do this with large developments when they're just bigger. Right. So we can.'",
        "'speaker_4': 'Discuss the number one center.'",
        "'speaker_3': 'I didn't read anything miss anything in here when I read it. Correct.'",
        "'speaker_0': 'You and Brody?'",
        "'speaker_5': 'I didn't see that. And they were there. But doesn't also doesn't Piedmont also have a similar types of, of, of registration requirements and certification number?'",
        "'speaker_2': 'Ashcraft So Mr. Ty, you've made some distinctions between what Santa Cruz does and what Alameda is perhaps currently equipped to do. But you did start out by saying that the Santa Cruz second unit ordinance is a good example for us.'",
        "'speaker_2': 'So what in particular should we take is as something to replicate?'",
        "'speaker_4': 'Well, I think what we take away from this is to recognize that this is the nationally recognized model ordinance. They're going all out to encourage second units. And at the end of the day, they generate an average of 17 units per year.'",
        "'speaker_4': 'So I know.'",
        "'speaker_3': 'Where we want to be.'",
        "'speaker_4': 'Sort of where we want to be. And you know, again, this is a program that's putting a lot of effort in promoting second units. They even hire architects to draw up prototype plans. And so when homeowners come in, they can point to a menu of second units that they want, point to that one, and they can get'",
        "'speaker_4': 'their permit. Staff isn't proposing that we're going that far. But, you know, even a program like Santa Cruz is generating 17 units a year.'",
        "'speaker_2': 'And I think you mentioned that there's some sort of an oversight board that oversees or assures compliance. Do you know possibly how that is funded in Santa Cruz?'",
        "'speaker_4': 'I think they have some outside funding source. I've read about it, too, but it it is. Staff intensive to have similar programs, a program where you administer. I mean, for us to do that, I think we have to bring in the housing authority to to monitor as part of the affordable health unit.'",
        "'speaker_2': 'Bringing them pretty severely now. But outside funding sources maybe.'",
        "'speaker_0': 'In.'",
        "'speaker_4': 'Piedmont there. I believe they're Rina. The regional housing needs allocation is less than 20 units. So to have them monitors, 22nd units might not be a big deal. But.'",
        "'speaker_0': 'Can you clarify the rent cap? Does that interpret to affordable housing?'",
        "'speaker_4': 'Yes. Specifically for Santa Cruz, it's tied to the incomes associated with low and very low income.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'So.'",
        "'speaker_2': 'Oh, and just last question. Is there a period of time that that rent cap is in place?'",
        "'speaker_4': 'No.'",
        "'speaker_2': 'So it could just be one year to get the permit fee waived and then it could go.'",
        "'speaker_4': 'Up right up until the unit is removed.'",
        "'speaker_0': 'As long as the unit is there.'",
        "'speaker_4': 'Then as long as.'",
        "'speaker_3': 'The unit.'",
        "'speaker_4': 'Is there, then.'",
        "'speaker_0': 'The indefinite.'",
        "'speaker_4': 'Rent cap applies.'",
        "'speaker_2': 'Okay, so.'",
        "'speaker_4': 'It's permanent as long as the unit exists.'",
        "'speaker_2': 'Okay. Okay. Got it. All right. Thank you.'",
        "'speaker_4': 'So next slide. So SAFF is recommending approval of these amendments as recommended by the planning board. But we also like the council to direct us to pilot really pilot the program for a year. Let's see what how many units we get and be able to identify the issues if there are any issues and then come back in'",
        "'speaker_4': 'a year with some results and a recommendation. Again, this is exactly analogous to a spigot. We are proposing to turn it, you know, a few degrees. And if if, you know, suddenly we're getting too many units, we can come back and adjust those requirements as needed.'",
        "'speaker_4': 'And staff will be monitoring the number of applications during this time. And the public will also have real time access through a via the city website on the number of second unit applications that come in. That concludes my presentation.'",
        "'speaker_0': 'Thank you. Member remember?'",
        "'speaker_6': 'Great. On the matter of piloting, what's the mechanism of that you envision? Do might we ever pass this ordinance with a sunset clause or at which point when it sunsets, then we re re-up it or not? Or do you have other kind of mechanisms in mind when it when it comes to piloting?'",
        "'speaker_4': 'Mm hmm. Yeah. I think Andrew mentioned earlier that our plan is to analyze the effects of the second, you know, ordinance as part of the annual housing element update. So that's something that we do every year. The council can direct staff to come back in a year with with a public hearing on an on another zoning text'",
        "'speaker_4': 'amendment to and that allows the council to open up the ordinance at that time.'",
        "'speaker_0': 'With a member.'",
        "'speaker_6': 'On the housing element matter. I saw within the annual report just within one of the boxes. I think it might have been table B, I can't remember one passing reference to second units. It was within the context of above moderate income.'",
        "'speaker_6': 'I don't think a table A or table C or any other ones had any references to it. So do we as a city obtain any benefits by having second units in the housing element? I mean, is it specifically prescribed as an and as in matter in and of itself, or is it prescribed if we do second units'",
        "'speaker_6': 'within the context of affordability?'",
        "'speaker_4': 'Right. So any unit generated in the city of Alameda will count towards the arena allocation. Okay. This the second unit ordinance as it's set up now, does not benefit the affordable criteria because they're not deed restricted. I should be affordable.'",
        "'speaker_4': 'Now, if we amend the ordinance to require that we restrict certain units, then we can count those towards the affordable.'",
        "'speaker_6': 'Last thing. I did see the reference to the city of Piedmont and I followed that up. Just looking at it the way that Piedmont looks like they do it is they have they incentivize people for a period of ten years.'",
        "'speaker_6': 'So it is something to be considered. I'm thinking about the relationship between affordable, narrowly defined and the second unit ordinance.'",
        "'speaker_0': 'And we do have six speakers. Nebraska.'",
        "'speaker_2': 'It's a very clarification question. So can you tell us what you based your estimate of the number of of applications per year on?'",
        "'speaker_4': 'Right. So basically. Right. Basically, we looked at Santa Cruz. I mean, they went all out and they still got six, 17 units. When you look at Alameda, is numbers 400 units, less than half of a percent are or is currently what we're getting now with the two units.'",
        "'speaker_4': 'And so if we made the number of eligible lots up to 3900. Half of 1% is about 3050. I mean, that's sort of the ballpark. 1% is about 30 units and half of that would be 15 units. And and that's also supplemented by, you know, we track just the number of customer inquiries at the permit center.'",
        "'speaker_4': 'And I would say annually we probably have about ten or 15 customers that come in asking about the second unit ordinance because they probably know a family member in the city who's gotten a second unit. And so they come in and so about on average, we get about 10 to 15 inquiries about second unit.'",
        "'speaker_4': 'So I think that's reflective of the actual demand here in the city.'",
        "'speaker_6': 'And one last question, at least for me, is this will this mostly occur in our one's own neighborhoods?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_4': 'And sort of the explanation for that is in the ATA and other multifamily zoning districts, you don't have the same restrictions that you have on second units. You can have a bigger second unit, you know? Right.'",
        "'speaker_0': 'Can you explain what the R-1.'",
        "'speaker_4': 'Is or what is the single family residence zoning district? They are two would be the two family residence zoning district.'",
        "'speaker_0': 'Thank you. And we have six. If you do want to speak on this item, please turn in your sleep and I'm going to start calling them. You'll have 3 minutes. Alvin Lough. Steve aced and then Doyle's a sailor.'",
        "'speaker_0': 'And. A pause, a few moments.'",
        "'speaker_4': 'Hi, everyone. My name is Alvin and good evening, everyone, and happy holiday. I am military support to second unit. The reason is I, you know, I'm a high tech person. I work in sales. And my wife in San Francisco and I took it.'",
        "'speaker_4': 'And one is about 11 and one is eight. And right now we are living very small unit and in the land is bigger. And we basically I live with my mom, too. My mom is helping me a lot.'",
        "'speaker_4': 'The reason you say we know what keenly you know about it, it's half is a lot. You go to I go to San Jose area to work and my wife's to San Francisco. So the profit actually take us like very long and lucky I got my mom and how me do you take care to keep okay and'",
        "'speaker_4': 'and they sample to care from the school back to home and cooking the food for my my to keep. The problem is I my my my wife and my mom always have arguing and I'm a the both of you guys need to know that, you know, it's a man I need to work very hard for support my'",
        "'speaker_4': 'my job and then I middle income me to support go to work it to make sure my boss happy okay I mean and work hard and make it longer. And I need to make sure my mom happy too, because you you're not cops.'",
        "'speaker_4': 'You are not even I know heavy and my way of you know when you had a nighttime you just say in a your mom say something I supposed to be doing that you know, cooking for the food and your mom saying is such that like, well, I need to cooking like this way and I have a my'",
        "'speaker_4': 'way to do it and kind of leave a high for me when I go home. Very tired in the work, you know, waiting for my boss. Give me all the job and go home and my, my, my, my way.'",
        "'speaker_4': 'Just arguing about, you know, different things. And I feel that easier for me to handle my case, I think is a better ATC is a better to have a different kitchen.'",
        "'speaker_2': 'Are you getting moved to the second unit?'",
        "'speaker_3': 'I will never be to the.'",
        "'speaker_4': 'Is I feel is like kind of like a hard time you know for for me is I to a thing about it and tonight you're always in the back saying oh well we might say something and then I mean my way I mean kind of the way my my have time meet me and just saying they they'",
        "'speaker_4': 'taught me about like that too so I pity support the second you only because to say to lady like to have their own way like take care of kids sometime have our own way to doing something so I kind of privacy for though too so and then like I my mom is only one son I have we'",
        "'speaker_4': 'have a very strong culture is as a son take care of the family especially the mom and dad so so I'm much more honest with you and I tried to pay for a lot for senior house for my mom, too, but it's a very difficult I think, you know, that is not enough senior housing for everyone, you'",
        "'speaker_4': 'know, in that area. And then like one thing, he's not only my mom take care of my family sometimes I feel is I need to take care of my mom, too, because they are older.'",
        "'speaker_3': 'So. Anyway. Yes.'",
        "'speaker_0': 'Thank you. Steve aced.'",
        "'speaker_5': 'I'm here to speak in favor of the amendment to the ordinance. I'm Doyle Siler. I'm with renewed hope and Madam Mayor and members of the City Council. I'm glad to see the attention given to the secondary units. Granny Flats won't solve our affordable housing crisis.'",
        "'speaker_5': 'We can use a variety of approaches, though, to show we want answers. We need to take seriously. First time buyers can't afford market rate cost. This barrier to owning a house. Crowds The rental market and unwillingness to meet Alameda needs has to be shown to our citizens.'",
        "'speaker_5': 'The law calls. Calls, secondary units. Granny flats. State law allows for families to live here intact. State law requires we meet affordable housing goals. You hold the keys to creating affordable housing. All in Alameda is watching what you will do to make this housing crisis come to a happy end.'",
        "'speaker_5': 'Thank you. From renewed hope.'",
        "'speaker_0': 'Steve asked. And then Dennis Owens and then Bill Smith. And our last speaker on the issue would be Jim Smallman. Let's you have a slip. Please turn it in. Go ahead, Steve. Hi.'",
        "'speaker_5': 'I wanted to point out that some of the slides that were shown tonight are slightly misleading. One of the units in the first picture wouldn't qualify for your ordinance. You've got. I believe the number and the count or number of units that we have in town in the R-1 zone was 3900.'",
        "'speaker_5': 'Is that right? And they're going to get 17 units per year out of that. We're set. Santa Cruz is 1800 units and they get 15. So they're going to do. Four times as well as Santa Cruz is the supposition here.'",
        "'speaker_5': 'My concern primarily, however, is that the. Presentation that's been given to us doesn't really give the owners in this zone adequate notice of what's going on and that we're. I am. Want to put something on the front of my house?'",
        "'speaker_5': 'I have to public notice it and send out all sorts of notices. And it's not happening with this and it's a bigger deal. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Mayor and city council. I'm Dennis Owens. I'm an architect. I'm also the chair of the Alameda Historic Advisory Board, and I'm in favor of this ordinance. I have a son, two stepchildren. I see their friends and they with the various problems they have.'",
        "'speaker_4': 'Finding adequate housing in Alameda and in Oakland. And I think this could be a step that would help alleviate some of the housing shortages that are in Alameda. I'm sharing the optimism that staff has that it could produce 15 or so units a year.'",
        "'speaker_4': 'I applaud the decision to consider them as accessory structures and also with the use of the tandem parking space by having them considered as accessory structures. And with the tandem parking space, I think you'll get a lot better designs than you would if you actually start to require fully accessible parking.'",
        "'speaker_3': 'With the parking.'",
        "'speaker_4': 'Apron and all the square footage of additional pavement that you would be placing on the site by having the the driveway, you know, serve as the primary parking area. You have a lot of better choices as an architect where to put the the secondary unit.'",
        "'speaker_3': 'To make it fit in well with the.'",
        "'speaker_4': 'Neighborhood. If you're forced to put the parking in as fully accessible parking, you're you become quite limited because that really drives where where the remaining location for the secondary units is going to be. I would suggest that a limit for a new structure be 700 square feet or 10% of the lot area, whichever is smaller.'",
        "'speaker_4': 'I think a 700.'",
        "'speaker_3': 'Square foot unit on a 4000 square foot lot might be a little.'",
        "'speaker_4': 'A little bit too large for most most neighborhoods. And, you know, I think that it will would be something that, you know, could be. Very well fitting in with the you know neighboring properties and in the city has good design guidelines and a good design review with staff and with various appeals that are allowed.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you. Bill Smith. And then Jim Smallman and I don't have any other speaker tips on this.'",
        "'speaker_5': 'Good evening, Madam Chair, members of the council and staff. I'm Bill Smith and I just want to thank the staff and the and the planning board and others for conducting the housing review this year and taking action on it.'",
        "'speaker_5': 'It's a small item, as we heard from Goyle, but we also heard from another speaker that this with the with the arguing women in the House, it's it's a way to save a marriage maybe, and lots of lots of other advantages to it as well.'",
        "'speaker_5': 'It's not a large number, so I don't think it would be huge problems with parking. It will definitely be an inconvenience for maybe one or two more cars on the streets every now and then. But it's going to be gradually increasing over time.'",
        "'speaker_5': 'So it's not not a big not a big issue, too, for people to adopt to. And I think we definitely we will see more and more of the younger people going without cars and looking for places to live without cars.'",
        "'speaker_5': 'So I don't see that being an issue. And certainly the Chairman Historical Advisory Board made a very good, strong case for allowing tandem parking in there. So I support that as well. I wanted to make one other unit in terms of I saw a number and in the correspondence people said they wanted to see affordable, affordable restrictions'",
        "'speaker_5': 'placed on these units as a long time affordable housing activist. I don't think the number of units we get out of this and we have a secondary units could afford. You can really justify paying for a large regulatory structure to monitor and enforce that.'",
        "'speaker_5': 'And I well in time made a good example of that when you talked about with the Santa Cruz and what they've done for that. I think we do it just under the regular housing, in the regular housing and do it under that rather than a separate.'",
        "'speaker_5': 'Separate would be fine. So let's focus on getting it done for all of the properties and and not to not take a look at break out this one separately for affordable housing restrictions. Thank you all. And I look forward to this passing.'",
        "'speaker_0': 'Thank you, Jim Smallman. He's our last speaker on this item.'",
        "'speaker_5': 'Thank you for having me. I'm representing the Alameda Architectural Preservation Society tonight, and surprisingly enough, people seem to be surprised that we were supporting in general this this proposal. We would support a program. We do support a program that would lead to affordable housing.'",
        "'speaker_5': 'And some people seem to be surprised by that. But I think it's an appropriate position for us to take on planning. Staff is advised, as you heard earlier, that the second unit ordinance that we have now has not worked well and and clearly it hasn't.'",
        "'speaker_5': 'And they supply one reason for it that it was limited to 7500 square foot lots. And that may contribute to it. But but those of us who have been involved in construction think that that another issue is the cost of a second unit.'",
        "'speaker_5': 'I mean, you you you put requirements in this ordinance for underground utilities. Obviously, you're building a separate building. So you've got a new foundation. You've got a roof structure that has to be built. You have four walls that have to be built.'",
        "'speaker_5': 'The architectural detailing has to match the house. And there's a lot of issues with that. I mean, I just restored a house by taking stucco off the outside of a Victorian built in 1890. Would I have had to put stucco on the auxiliary building to make it match what was not original?'",
        "'speaker_5': 'There's details and issues with some of this that I think need to be worked out. I think the real issue is that the second units as separate buildings are just too expensive. It's going to be very difficult to make that affordable housing.'",
        "'speaker_5': 'And so what's going to happen is they'll they'll doll them up, they'll make beautiful garden apartments and there'll be rented for $3,000 a month. And that's I don't think what you really want to accomplish with this. Our our approach, at least within the architecture that we represent, there's a ton of new foundations being put in, replacing the'",
        "'speaker_5': 'brick foundations. And now, I mean, it's done all over town. I've done two in the last six years. When you do the foundation work, a lot of what you have to have to have a second unit is already done.'",
        "'speaker_5': 'You don't have to do the exterior detail here. You're living within an existing envelope of the building. The the interior walls are are are minor costs compared to the to the rest of it. You get less cost for the electrical and so on.'",
        "'speaker_5': 'So that's a suggestion that that we make it's not so much that we oppose this ordinance, but the emphasis, even in the pictures, in the presentations made tonight, were separate buildings. And we would like to see dig outs or an adjustment where you have a ground floor unit.'",
        "'speaker_5': 'And I think that would solve a lot of the issues and make the resulting units more affordable. Thank you.'",
        "'speaker_0': 'Thank you. All right. He was our last speaker and also comments we'd like to start.'",
        "'speaker_5': 'Anywhere.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_3': 'Yes, I. I'd like to look at this. And in my way of thinking it. I think there's enough adjustment here that. It. It may need to have more detail, put in more planning board review. There is the primary issue that I'd like to do is if we're going to be granting a significant benefit or significant value to'",
        "'speaker_3': 'the property. I'd like to be able to get some some return, and that return would be to the goal that was stated to have affordable units. So I'd like to see some incentive, some here way that meets that goal.'",
        "'speaker_3': 'What that is. I'm not an expert in this. It's complicated. There's a cost of doing business, but that was mentioned. But I'd like to have some incentive written into this ordinance that says if you do this. Well, if you provide us with an affordable unit will allow you some some additional concession that is described in an ordinance'",
        "'speaker_3': 'for a second unit. And I'd also like to have the analysis of what it really costs to administer these, because if we looked at this as the the ten or 12 that we're likely to get as ten or 12 large developments, we still have to monitor them.'",
        "'speaker_3': 'We have to monitor Del Monte, we have to monitor Alameda Point, we have to monitor Clement everywhere, every one of these large developments that's building affordable units. We have to monitor at some point is going to become mechanized.'",
        "'speaker_3': 'So I dispute that it costs. Something that's horrendous, that's untenable until I see the data. The second question that I would like to see addressed is the distinction between or some description or or outlining of the difference between expanded family and putting something on the market as a rental unit, because those are two different things.'",
        "'speaker_3': 'The where you have an in-law unit, where it's a family member or returning child, there's those are different than us providing another rental unit. And I think that needs to be addressed a. I'd also like to see a definition in here of what a second unit is and make the distinction between a second unit within the envelope'",
        "'speaker_3': 'of a building and a second unit as an accessory building. Because it's not. It's not it's not clearly written, at least to my to my read on this. And the last there's a there say other terms that are qualified like the term on page three where it says short term rental.'",
        "'speaker_3': 'Well, what is a short term rental? Do we have a definition for that? And then lastly, I'd like to see some ordinance language. Or some attention and another vehicle. It doesn't belong here on legalizing accessory buildings, and that includes non-conforming buildings that are currently used for residential use.'",
        "'speaker_3': 'So those are my comments on this.'",
        "'speaker_0': 'All right. Before we continue, we have one more speaker slip. I'm sorry. Is that all right with council to go ahead and finish this one. Christopher Buckley.'",
        "'speaker_5': 'Christopher Buckley with the Alameda Architectural Preservation Society. I wanted to thank you very much for taking me out of order. I was trying to watch this on the webcast, and the webcast didn't show up until about 10 minutes ago.'",
        "'speaker_5': 'And I saw Dennis Owens addressing the council. I figured, oh, I better get here. So if you could have somebody, whoever's running the webcast to make sure this doesn't happen in the future would be good. So we sent you a letter.'",
        "'speaker_5': 'I believe you all have a copy of that, and I'd like to walk you through some of the points. And I hope this isn't too repetitive, since maybe this has already been talked about. We'd like to commend the city for trying to find creative ways of addressing the current housing issues.'",
        "'speaker_5': 'And this proposed amendment has potential to do that. But we think it's being rushed through without adequate analysis and could have unintended consequences and might not be very effective in achieving its purpose, one of its purposes to try to provide more affordable housing, which is mentioned repeatedly in the staff report and also in the ordinance preamble.'",
        "'speaker_5': 'So we're asking that the consideration of this ordinance amendment is deferred until adequate analysis is performed. And also we included in our letter three possible amendments that we would like to have considered. Our two main concerns are the reduction of the minimum of the lot size 7500 square feet to 4000.'",
        "'speaker_5': 'This would effectively convert the R-1 zone to a kind of mini duplex zone. And by our accounts, which we got from staff, maybe staff updated these counters. They didn't hear the staff report. But it looks like at least 3900 lots could be eligible for second units potentially over time.'",
        "'speaker_5': 'That would suggest thousands of additional units in the city with potential impacts on traffic, impervious, surface conversion and and other parameters. And we think that needs to be analyzed in conjunction with the other housing units that are in the pipeline.'",
        "'speaker_5': 'The second concern is allowing second units to be within accessory structures within required rear yard areas. And we're concerned that's going to lead to removal of landscaping and also conversion of pervious surfaces and impervious surfaces running low on time here.'",
        "'speaker_5': 'So I'm going to skip through some of this. There's two questions that we asked be pose the city attorney. First, item nine on page three of our letter concerning secret status. We question those exempt as statutory and categorical exemptions.'",
        "'speaker_5': 'We'd like to hear the city attorney affirm that those are appropriate and ten also affirming that Harbor Bay would be exempt from those because of their sex and ours. There's a there's perhaps another 4500 units in our bay that would be eligible.'",
        "'speaker_5': 'Can I recite our three amendments? Requested amendments. I'm running out of time.'",
        "'speaker_0': 'Quickly, if you could. Quickly.'",
        "'speaker_5': 'Our proposed suggested changes are one, require second units to be affordable in order to be buy. Right. Second, to require a use permit or other discretionary approval for. We're saying 7500 square feet or lots. So it could be a smaller threshold, but that would help address the impervious surface traffic impacts of the things on a case by'",
        "'speaker_5': 'case basis. And third, to require that second units be within the existing building envelope to qualify for buy. Right. Thank you.'",
        "'speaker_0': 'Thank you. I remember already.'",
        "'speaker_5': 'Thinking about him. Can I just ask two more questions of staff? So again, going back to the Harbor Bay Bay Firm, 94502 group. So how many are one units out or lots out there would be eligible that are not exempt either because because of their cars or their while.'",
        "'speaker_5': 'Our two obviously is not about.'",
        "'speaker_4': '4200.'",
        "'speaker_5': 'Or 200 on Bay Farm.'",
        "'speaker_4': 'On Harbor Bay.'",
        "'speaker_5': 'If we if we adopt the ordinance as you propose it, how many lots on Bay Farm are we talking about? Other 3900. How many would be eligible to be included in this second unit ordinance? Do we know that number?'",
        "'speaker_4': 'I don't have that right on top of my head. We can get that number. But I would say roughly around 200. It's it's the old the old Bay Farm Island.'",
        "'speaker_5': 'I think would be kind of small. So we're basically talking about, you know, 90, 95%.'",
        "'speaker_4': 'And within that area, not all of the lots are zoned. R one There are other lots with other stipulations and some lots already have multiple units on them. So the number of really truly eligible lots are actually a very few number.'",
        "'speaker_5': 'I guess my point is this is the bulk of this. Almost all of this is going to be on the main mainline. So that's correct. Impact. Mm hmm. Okay. And I thought I had a second question, but I don't think I did.'",
        "'speaker_5': 'I'm sorry. Remember? I don't know. Well, I'm still kind of.'",
        "'speaker_0': 'Going over.'",
        "'speaker_5': 'Comment, so you don't have to stand up for my comments. Thanks. I kind of echo a lot of what the vice mayor had to say that, well, I think this is a good idea in principle. I think it does need a little bit more work.'",
        "'speaker_5': 'I do kind of sympathize with the comments made by Mr. Smallman and Mr. Buckley and about the affordable housing. You know, Piedmont has a program we saw in the stat presentation. Santa Cruz has a program. We say this is something we want to use as a tool to address affordable housing, but we don't really do anything in'",
        "'speaker_5': 'the ordinance to actually guarantee that it's going to. So I hope that well, I would have prefer that this comes back to council with a little more meat to it, especially on the on the affordable housing. And, you know, the market is going to be what the market is.'",
        "'speaker_5': 'And if you build, you know, a very nice studio cottage in the back of your apartment or in the back of your lot, you are going to have increased value. I mean, not only will you have increased value of your property, you have the potential rental stream.'",
        "'speaker_5': 'So when you go out to sell it, you'll make more money. So, you know, we're giving a big benefit to homeowners without asking them to do what we think we're asking them to do, which is make these more affordable.'",
        "'speaker_5': 'So I'd like to see some more teeth and actually some more maybe some specific program. I am concerned. I mean, the staff have. We you say you want to have more of these. I mean, what's the number you think you want to have?'",
        "'speaker_5': 'I mean, is it 100?'",
        "'speaker_4': 'No, no. We think two in five years is not enough. We think you could we can do better. We are you know, we keep emphasizing this idea. We have to monitor this every year anyway. So, you know, if if there is a.'",
        "'speaker_4': 'So far, nobody has stepped forward and said that there's a magic number that's too much. But our feeling is we're going to we have to report every year how it's going. So we see a built in opportunity for the council to each year go, okay, you know what?'",
        "'speaker_4': 'That's feeling like too much or we've had issues and we can document it. What kinds of units have been approved in whether it was the parking that made a difference or the lot size the it gives you puts you in the opportunity to control this program every single year and adjust it.'",
        "'speaker_4': 'And what what Alan was talking about in response to Councilmember De Sykes question is, you could direct us, so to say, basically put this on the agenda in one year as a zoning amendment. We're not telling you to turn it down or up at that point, but we want the opportunity to make that adjustment.'",
        "'speaker_4': 'And staff at the staff report, when you come back in a year, tell us give us all the data. What happened in the last 12 months? How many did you prove? What kind, what you get? Do you have any ideas about what could be better?'",
        "'speaker_4': 'Check in with plenty more quickly, see what they think, and then put us in the position to make an adjustment.'",
        "'speaker_5': 'I guess my concern is if we open the floodgates and we all of a sudden have 100 applications in the first two months, then it may be something, you know, that we really haven't in. There's a lot of impacts to 100 new units being added on the main island.'",
        "'speaker_4': 'You can absolutely. I would agree with you. And I think if that's something, that's something you could definitely tell us. You could say, look, you know what? If in the first three months you get 100 applications, we want that hearing immediately.'",
        "'speaker_5': 'Yes. So I'd like, you know, see in in a revised ordinance, you know, that we have some some cap that if it reaches that number, you come back to us and say it's this is what's going on, because, you know, we all know the impacts.'",
        "'speaker_5': 'And I really don't like the idea of just giving carte blanche, you know, all the way down to 4000 in the proposal in the a piece that the used permanent other discretionary planning permit for second units on lots than 7500.'",
        "'speaker_5': 'So is there a way we can that's what we have my I think my colleagues agree that you know this 4 to 7000 7500 window that maybe we add a little more scrutiny to that because what I am concerned about is that we start breaking up these old historic homes and now they all suddenly become multi-unit homes'",
        "'speaker_5': '. And, you know, that happens at a faster pace than anybody. Yeah.'",
        "'speaker_4': 'Just just to clarify for the public and for the council, the APS suggestion about discretionary review for anything less than 7500. That's what's on the books today. So that's that's okay. That's that's that's got the spigot closed tight today.'",
        "'speaker_4': 'That's why we are suggesting now. But if you're thinking we need we've went too far down, let us know.'",
        "'speaker_5': 'Well, especially on the parking, because you know that that picture you showed I kind of agree with I don't members one of our colleagues or somebody on staff you know on the far right, if you have ten in parking and you're the one that's.'",
        "'speaker_5': 'In front or in back, you know, you're going to be forced into the street. And I know that that's a big concern everywhere in Alameda. And I don't know if we can afford because we're basically going to say, well, we have a unit that we have two spaces and now we're adding a second unit.'",
        "'speaker_5': 'But, you know, we're taking we're basically taking the space away. And if we make a tandem, it seems like we're actually taking two spaces away because we should have three, right? If you put a second unit.'",
        "'speaker_4': 'That the three the diagram on the left is the current.'",
        "'speaker_5': 'Rules today. Right.'",
        "'speaker_4': 'So that's those are the requirements today if you want to build a second unit.'",
        "'speaker_5': 'So yeah, you're reducing parking not only to two, but I think in reality it's going to be closer to one because if you block that that front car in, you know, in practice, people are just going to if the driveway is full, you're either going out of courtesy of your neighbor, you know, or your landlord, you know'",
        "'speaker_5': ', not park in the driveway and then. You know, I think some more consideration should be given to the apps there. Their third proposal, which was to require units of less than 7500 to have their additional units inside the main building.'",
        "'speaker_5': 'You know, consider that we're losing. What do they call it here? They called it impervious surfaces and vegetation removal. You know, I think if we add more asphalt and and structure to these smaller units, you know, I'm not sure that that's something I think that needs a little bit more analysis and a little bit more community input'",
        "'speaker_5': 'on. So I hope that you can go back and take this. If my colleagues agree that go back and, you know, amend this ordinance and and consider those three items or four items.'",
        "'speaker_4': 'If staff and make a clarifying comment on the reason why we're proposing to tie the second unit ordinance with this Ussery building regulations. Again, we recognize that a lot of single family lots have an existing accessory building right now.'",
        "'speaker_4': 'The ordinance prevents you from using that building as a second unit. And so the goal to tie the two is to encourage the reuse of existing buildings for a second unit so that you don't have to pave over more yard or build new structures.'",
        "'speaker_4': 'So I just want to.'",
        "'speaker_5': 'Clarify that.'",
        "'speaker_0': 'Member.'",
        "'speaker_2': 'Clarifying question while we have you, Mr. Ty. There's been some reference to concern with losing impervious surfaces from adding parking, but is there not some percentage of.'",
        "'speaker_4': 'Yes. So the current ordinance stipulates that when you add a second unit, all of the entire lot area that's not covered with either building footprint or driveway space cannot be 60% of the lot. So that's going to stay in place.'",
        "'speaker_4': 'And so, again, owners who are property owners who want a second unit are going to have to meet that entire checklist if they want the unit buy. Right.'",
        "'speaker_5': 'But if it's 100% covered today and it drops down to 60, then we're still losing.'",
        "'speaker_4': 'No, no, no. They would have to comply that we're not changing the coverage requirement and we're not proposing to change that. And in fact, somebody who has a single family home and is not even proposing second unit, they can cover more of that lot today.'",
        "'speaker_4': 'So if you want to do a second unit, we're actually providing an additional restriction on how much you can pave over because of this whole parking question. So. You know, but once again, yeah, the spigot it analogy it's really we're looking for the council.'",
        "'speaker_4': 'Tell us, you know, what information you need to move forward and how much or how little you want to open the spigot. Understanding that can also put you in the position to monitor it very closely and schedule an adjustment at whatever point you think is necessary.'",
        "'speaker_4': 'There's one more important fact that I forgot to include in my presentation. Apologize is that the term trend in Alameda is in the last five years we've lost about 23 units, the investors in older Victorians in purchasing them.'",
        "'speaker_4': 'And these are Victorians that were previously converted to multi-unit. They're converting them back to single family homes. And so, um, you know, we've generated two single second units in the last five years, but at the same period we've lost 23 units through the restoration of these Victorians.'",
        "'speaker_4': 'So and that's been a trend. I mean, we see more customers at the counter asking to remove units and restoring Victorians and we are getting inquiries for second units.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_2': 'Thank you. You can sit down. Thank you, Mayor Spencer. So we heard Andrew Thomas start this presentation and we read it in the staff report that tells us that this proposed ordinance would give us another tool in our tool kit, the tool kit that council can use to address the rental housing shortage.'",
        "'speaker_2': 'And I suspect I speak for all of my colleagues when I say we've all been grappling with this for weeks and having lots and lots of meetings to look at all different sides of this issue. So our rental housing shortage certainly is a need for more affordable, but it's a need for more market rate units, too.'",
        "'speaker_2': 'And any additional rental units will help alleviate the stress on the system. Right now that we have a 2.7% vacancy rate, which is very low currently, I don't see the need to differentiate in this ordinance between a family member living in that second unit or an unrelated renter, because I think both types of units have value.'",
        "'speaker_2': 'Alvin, the speaker that we had, I thought, illustrated very, very sweetly the the benefit of having your mother there. But you need to keep your wife happy, too, I'll hasten to say that. But but I'm a mom, too.'",
        "'speaker_2': 'And I want my son to think like you when when I'm older. But so there's that value. And I have friends who have grandma living in a second unit on the property. And it's lovely for the children to go across the yard and spend time with her.'",
        "'speaker_2': 'And it's probably lovely for her to go have some peace and quiet too. On the other hand, we have renters who who need places to live. I do think I think the vice mayor mentioned it in it's in the Santa Cruz ordinance that we could incentivize if you wanted to do that cap on rents and make it'",
        "'speaker_2': 'affordable, we should be able to come up with an incentive to do that. And again, I would let the market guide this. As Mr. Smallman said, there's a cost to adding second units. So that's one of the reasons I don't see the floodgates opening because I think that, you know, you don't go into this sort of thing'",
        "'speaker_2': 'lightly. But on the other hand, you might have a carriage house, a garage or whatever that could be converted. I also don't see the need to limit second units to only dig outs or ground floor units. And we heard some concern expressed on this council with what that might do to our historic Victorians, turning them into apartments'",
        "'speaker_2': '. I think it's an option if somebody wants to do that, have the second unit in their basement, on their premises. But if they have the space and wanted to do it separately, I'm sure there's value for that too.'",
        "'speaker_2': 'I was taken with Mr. Owens, Dennis Owen's suggestion that perhaps a 700 square foot minimum allowable unit size is too big for some properties. I would have a hard time saying you couldn't do this on a 4000 square foot lot because that is what what we allow 2000 square feet for a dwelling unit.'",
        "'speaker_2': 'But I think there's value to considering that 700 square feet or 10%, which ever is is the lesser amount. And I. As far as the argument that when you sell this property to which you've paid money but added value to your property, you will benefit from a higher selling price.'",
        "'speaker_2': 'The city will too, because we get that transfer tax so the city will have have benefit. But I think at the end of the day, this is going to be a valuable asset. Maybe not huge. I suspect we'll we'll start slowly.'",
        "'speaker_2': 'But I very much support the idea of doing the pilot for one year and we can have a trigger point if we were to get more than so many applications in a given months, quarter of a year, what have you, that could trigger a review.'",
        "'speaker_2': 'But what I would like to see is, if at all possible for this council tonight to work out some amendments we'd like to see to this ordinance so that. Well, let me just check with city attorney before I go too far out on that limb.'",
        "'speaker_2': 'If we were to add some modifications to the proposed ordinance, would it still qualify as a second reading or does that start over? No.'",
        "'speaker_0': 'No, really. Only some minor modifications can be done between first and second reading. So depending on what exactly you're talking about modifying. My guess is it probably would have to start over with the first reading.'",
        "'speaker_2': 'Okay. And so I would just say that. Again, we're looking for solutions for ways to address a problem that is significant as far as this rental housing crisis. So whatever we can do to not keep delaying, availing ourselves of those tools.'",
        "'speaker_2': 'I think we should do so. Those are my views. Thank you.'",
        "'speaker_0': 'Member de Days.'",
        "'speaker_6': 'Well, thank you very much. What interests me the most is seeing a stronger and clearer connection with affordable housing narrowly understood affordable housing, particularly for low income and moderate income households. A variety of places have mechanisms to incentivize that when it comes to the second units.'",
        "'speaker_6': 'You saw that tonight in the case of us, a city of Santa Cruz which waived fees to the extent that people make a commitment to make the housing affordable. I think you also heard it indirectly tonight in the case of the city of Piedmont, which had wave, I believe, parking requirements to some extent in exchange for a'",
        "'speaker_6': 'ten year commitment to affordable housing. I think it's important for the city hall to make the clear connection with any kind of housing project or development and and affordability, because I think for far too long we've been kind of assuming that, well, if you build it, you know, they will come.'",
        "'speaker_6': 'Meaning if you increase the supply of housing, that somehow, you know, through the wonders of the way that the market works, the demand, especially from the lower income and moderate income households, will be satisfied. You know, the fact of the matter is trickle down didn't work in the 1980s with Reagan and trickle down housing policy isn't working'",
        "'speaker_6': 'now. So I do believe that we have to have a clearer connection in this case or in other matters. For example, if we're going to deal with dealing with the housing project contiguous to the El Monte project, we need to make a clear connection between the project and its social obligations.'",
        "'speaker_6': 'If nothing else, especially now as we are amidst this crisis going on now for 14 months. I think that's a signal that we need to send with this with this second unit project, let that people know that that we're going to alter our our rules with regard to second units, but also let people know that the benefits'",
        "'speaker_6': 'of this will accrue to partly to moderate income and low income households. And that is the intended purpose. I would also say that, you know, if you're going to do that, incentivize senior housing as well, because clearly from the BP report that was provided several meetings ago, you know, senior housing, you know, because of their constrained income'",
        "'speaker_6': ', they're really at risk here. So I do think that we need to send it back to city staff to to look at ways to making the connection with affordable housing clearer and stronger. One other item I, I do need to get a little bit more information on is the having the second unit.'",
        "'speaker_6': 'Built below instances where we're raising a house so that we can build some kind of second unit, separate unit underneath. And I need to raise that because in the mid 1990s there was a real big outcry here in the city of Alameda about what was then referred to as infill housing, largely on the grounds of its effects'",
        "'speaker_6': ', as some had thought on the character of neighborhoods. Meaning you have a certain character of a house that's, you know, maybe just one stories tall, but then suddenly, you know, when it's two stories tall, it might have lost that character.'",
        "'speaker_6': 'And in the context of the R-1 neighborhood, that's something that we need to think about. So in closing, my thoughts about this subject is I do think we ought to send it back to the planning board or city staff for further consideration on the connection between housing affordability and and the second unit.'",
        "'speaker_6': 'I like the idea of piloting this for a while to see how it goes. And and my concern is, you know, I do want to have the concern about the second unit and within the main house evaluated more.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_0': 'And member Ashcroft.'",
        "'speaker_2': 'Thank you. I forgot to. I was trying to be succinct, but I did want to comment on parking. I think some good observations were made with both between the staff recommendations of independent spaces, the planning board recommendations of the two tandem spaces.'",
        "'speaker_2': 'I. I would come down in favor of staff's recommendation for the two independent spaces, because I feel that that gives there less likelihood of that scenario of someone just being so frustrated that, Oh, you're parked behind me and now I'm going to park in the street.'",
        "'speaker_2': 'So from there it's still up there. From the drawing above, you could see that both automobiles could get out independently. So that would be my recommendation. And we also do know that statistically smaller households and seniors and folks with lower incomes don't tend to drive as many vehicles.'",
        "'speaker_2': 'So I'm comfortable with the two independent spaces. Thank you, Mayor.'",
        "'speaker_0': 'You're welcome. All right. So I agree with many of the comments that we heard this evening from the public as well as council members in regards to. Dennis Owens. I think he made a good comment in regards to 700 square feet for the second unit or 10% of the parcel, whichever is smaller.'",
        "'speaker_0': 'The parking that Member Ashcraft just spoke to. I. I. I support the current, which is three spaces. However, I would be agreeable to going to the to independent. And I see. That that would be something I would be willing to compromise on in order to incentivize the units and make them more actually make it easier to do'",
        "'speaker_0': 'units for family members or affordable housing as opposed to market rate. And to me, supporting a family member, whether it's an adult child or someone who's older, they probably would not be paying market rent so that you're not having someone make whatever that number that is.'",
        "'speaker_0': 'And I'm just going to say 3000 a month or whatever it is, I don't know. But market rate, if someone is actually receiving income of market rate, then I think that they should have to have as little impact as possible on the neighbors, whereas if someone is accommodating their family or doing affordable, offering more affordable units, then'",
        "'speaker_0': 'I'm willing to have more impact on the neighborhood, which would then, I think, be this staff's recommendation of the two independent spaces. I'm very concerned about the two tandem spaces because I really think in reality you're going to have one car park there and at least one, if not to or even three cars parked on the street'",
        "'speaker_0': '. And I do receive complaints. Regarding a shortage of parking. And I really think it's throughout the city, not just one area. So and I see that as a real concern for other people in the neighborhood. Another the other issues that were raised by a piece or the legal opinions on the questions, nine and ten, if you could'",
        "'speaker_0': ', that could be addressed when this comes back. I would prefer that this come back to council as opposed to the planning board because I think it would be able to expedite it then. And I think I agree with member Ashcraft of the goal.'",
        "'speaker_0': 'Sounds like all of us are agreeable to that, having it come back to council to try to expedite this. I like some of these changes. Now, staff was going from minimum size 7500 to 4000. I see that as a big jump and and I would prefer loosing in that some for market rate but not that much.'",
        "'speaker_0': 'I think if you're going to get to the 4000 that again that that's tied to your affordable or your family members and I would think maybe 5000 or even 5500 if it's going to be a market rate unit.'",
        "'speaker_0': 'Okay. The one story I support having it be the one story that was in the staff recommendation. The minimum distance to the main house. Changing that from 20 feet to six feet. Could someone explain why that's being suggested?'",
        "'speaker_0': 'All right. The minimum distance from main house currently is 20 feet and it's been the stats recommending.'",
        "'speaker_4': 'So really the 20 foot setback that's required between the main house and the second unit really is difficult to accommodate because you also have a front setback of 20 feet. You have the main house, another 20 feet in between the two houses and then a rear setback of 20 feet.'",
        "'speaker_4': 'Not many properties in Alameda can meet that. So and again, the second the accessory building regulations stipulate six feet and that's in alignment with the fire and safety codes.'",
        "'speaker_0': 'Okay. So I would I'm agreeable to that. My question then is or I have a question with surrounding neighbors received notice of this proposal. And I would think that they should if it's if if it is a if if we're loosening the requirements, if they're following under the current requirements, then that's fine.'",
        "'speaker_0': 'However, you currently do it, if we're making it easier to do it, then I would want notice to the neighbors to be able to really share how they think it's going to impact them.'",
        "'speaker_4': 'So I think the council needs to decide which checklists. So basically under state law, the checklist is what allows you to have something by right. Ministerial process means no neighbor notification. Now, under the current ordinance, the requirements that we have now, if you meet them, you qualify for the ministerial process.'",
        "'speaker_4': 'If you don't meet them, you can apply for a use permit and that has a notification. And so I think the Council can decide what parameters qualify for the by rate checklist.'",
        "'speaker_0': 'And so for me, if we're going to be reducing the number of spaces required for parking. From the 3 to 2. I would like the neighbors to be able to weigh in on that, because there are some neighborhoods that there is no parking right now.'",
        "'speaker_0': 'And I think that someone needs to be able to take that into consideration.'",
        "'speaker_4': 'So that would be just that would be no change to the current ordinance.'",
        "'speaker_0': 'Yeah. In regards to that issue. Regards to that issue. And now Piedmont has four or five different forms where you check different boxes depending upon. And and that makes sense to me because then it tells you clearly where you're falling and what the requirement is.'",
        "'speaker_0': 'So I think more work needs to be done to make it easier and clear for the applicant. So I like the way Piedmont does it. I also appreciate the way Santa Cruz does in regards to incentivizing for the low and very low income.'",
        "'speaker_0': 'And I do support the proposition of offering more units for low and very low income. But with that then, is greater impact on the neighborhood. So then I think the trade is that the neighbors should have an opportunity to share if they if they have concerns.'",
        "'speaker_0': 'And then the deed restriction, if we're if of the city's offering these concessions to allow the affordable or house housing for a family member, then I think that there should be a deed restriction in perpetuity as opposed to just ten years.'",
        "'speaker_0': 'If they want to come back and change it to a market rate unit, then I think that then they should have to go back and figure out additional parking or whatever, the nuances that work when we're making concessions to encourage affordable housing.'",
        "'speaker_0': 'And that's what it should be affordable or family member, but not market rate. When we if the homeowner then decides they want to switch it to a market rate. And I think that they should have to. Add the additional parking or whatever the concession is that we're offering.'",
        "'speaker_2': 'Can I just ask you, Mary Spencer? So did I understand you to say that you were recommending a deed restriction in perpetuity for a family member living? No.'",
        "'speaker_0': 'Not for a family member or affordable. Okay. I mean, I actually. So I'm not sure. Well, and if I was lumping those together.'",
        "'speaker_2': 'So here's why. As opposed to market rate. Okay. So here's why I would have concern with the into perpetuity for a family member. That means that rents with the land and even if the unit is the house with the second unit is sold, it would require the subsequent buyer to get a family member or.'",
        "'speaker_0': 'Affordable housing then or affordable housing as opposed to market.'",
        "'speaker_2': 'We should probably hear from the city attorney.'",
        "'speaker_0': 'Just for a clarification, you can't limit it to family members. It's not legal or affordable. Affordable. You can limit it, but you can't limit it. So a family member, though, would not be my my guess is that they would not be paying market rate and then it would fall under affordable.'",
        "'speaker_0': 'Is that is there a way to do that so that your family member read it and you just can't limit it to a family member? So if we can get member, we.'",
        "'speaker_5': 'Incentivize family members and then like eliminate those incentives when the family doesn't live there.'",
        "'speaker_4': 'I think you've given us a lot of very good ideas. I am sensing that we, Alan and I know where you want to go with this. We have to do some analysis. We have to look at the monitoring issues, the costs.'",
        "'speaker_4': 'We have to figure out a way to create incentives to get affordable guaranteed. But, you know, we also have to.'",
        "'speaker_2': 'Stay within the law.'",
        "'speaker_4': 'Yeah, within. Exactly. And there's just a number of of associated issues. We just need to I think we need to analyze. We have to prepare a report bring back to you. I think we're going to come pretty close.'",
        "'speaker_4': 'I guess what I'm curious about is first, how's the counsel? Want to handle the process?'",
        "'speaker_0': 'And then I'd like. Well, I.'",
        "'speaker_1': 'Would I'd like one clarification. I think I'm hearing the council say that they're okay with potentially having some affordable and some market rate. But just that if you have the market rate, you have to meet some higher threshold.'",
        "'speaker_1': 'Okay. So I just want to make sure everybody's okay.'",
        "'speaker_2': 'And did that make.'",
        "'speaker_0': 'Sense to you?'",
        "'speaker_2': 'That was what I wanted to ask you, too. So on your parking and the neighbors weighing in on parking, is that only if it's for a market rate unit? Because do you really do we really want to subject affordable housing to being turned down by the neighbors?'",
        "'speaker_2': 'Maybe that was what you said, that you so have a different standard. Okay. What did you say?'",
        "'speaker_0': 'I don't think I said that. Even Mary, I appreciate the. Thank you. But I do want to have that discussion in regards to when do we have notice to the neighbors? Because if we're making but I'm going to say are significant changes to the current regulations and then we would end up with an impact on the neighbors'",
        "'speaker_0': '. That's I think we have to discuss what notice when would the neighbors have notice? Just vice mayor.'",
        "'speaker_3': 'And I'm hearing in the aggregate. Enough. Changes to what what is presented tonight to say that we're going to have another ordinance come back for a first reading, right. As and it's going to include the given. It's going to include issues of incentivizing affordability, because that's one of our major goals.'",
        "'speaker_3': 'It's going to have examination of the parking and when that's noticed and when it's not. And I sense a preference for the independent spaces versus attendant tandem spaces. And then there were a a number of other suggestions of modeling the Piedmont format that is used for the checklist.'",
        "'speaker_3': 'And then the question of what is buy right versus what is buy use permits, right? I think those are the big issues that I've heard.'",
        "'speaker_2': 'And I think everybody's comments.'",
        "'speaker_3': 'And then there's a number of individual comments that.'",
        "'speaker_1': 'We have no consensus on.'",
        "'speaker_3': 'Yes. And those, I think are staff report ones where you have to come back and say why you chose not to put it in or and why you chose to incorporate it. And then we're going to have this discussion again.'",
        "'speaker_3': 'And I think I heard that come back to council, not back to the planning board.'",
        "'speaker_0': 'All of us agreed to that. And that's considered.'",
        "'speaker_2': 'Expedited for the reasons you stated.'",
        "'speaker_0': 'Yes, we.'",
        "'speaker_5': 'Need a motion.'",
        "'speaker_0': 'And one area that I don't think any of us discussed was private use of second unit as a vacation rental. And and I support and I support that because of the impact on the neighborhood again. And I don't think it goes to our goal of adding housing, permanent housing, and so did it.'",
        "'speaker_0': 'Did anyone have a concern with that?'",
        "'speaker_2': 'No, I think we we heard and think maybe it was the vice mayor in the beginning said that or somebody said you might want to define what that vacation rental means, you know, for so many days, short term rent.'",
        "'speaker_2': 'However, we are defining a short term rental. Yes.'",
        "'speaker_5': 'I mean, my only problem with that is where, you know, these other second units that we've already approved do not have that restriction. And, you know, if we're going to come back with a second I'm sorry, an Airbnb or short term rental regulation, you know?'",
        "'speaker_5': 'You know, maybe we can do that. You know, temporarily. You know, and then have it superseded by some mail.'",
        "'speaker_3': 'Well.'",
        "'speaker_2': 'I remember Ashcroft, what I was going to say to that is when we got the the report on the rentals, the the state of the rental housing market in Alameda, I do remember that there is at this point, a fairly small percentage of units that are being used for Airbnb.'",
        "'speaker_2': 'So I'm satisfied with moving forward with that restriction in this ordinance. And if we see it becoming a problem in the rest of Alameda and of course those aren't second units, people often just rent their home out or a room in their house or something.'",
        "'speaker_2': 'If we see that becoming a problem, we can deal with that. I don't think it needs to hold us back from moving forward on this one now.'",
        "'speaker_0': 'And I think you may want to keep your current or just, you know, maybe we could have different models if you did the current with all that, then you can keep using it because it currently doesn't have that restriction.'",
        "'speaker_0': 'If you satisfy everything, it's only if you want to then take advantage of these fewer restrictions that you would fall under. I. I see another category of market rate that then is restricted in regards to not being able to be used as a vacation rental.'",
        "'speaker_0': 'And then another category that would be for affordable and family members.'",
        "'speaker_6': 'Yeah, well, my viewpoint on vacation rentals is that the nature of this ordinance in its preliminary language is to address the partially addressed the lack of permanent housing or families and other in specific categories persons of very low or low income households.'",
        "'speaker_6': 'Or even so, it's to provide a new stream of permanent, affordable housing in terms of vacation rentals. Down the path, you know, five years down the road, ten years down the road, I don't know, maybe the baby that might maybe that might that issue might arise for.'",
        "'speaker_6': 'Or any new stock of housing that comes out of this. But I think for now, that's an issue that's down the road with regard to people right now who provide vacation rentals within Alameda, who are following the rules and doing that, they're doing that.'",
        "'speaker_6': 'And I think the message ought to be that this isn't taking away their right to do what they're doing right now, although we will be discussing that further, more down the future. But nonetheless, this is a needed ordinance because we need a different stream of permanent housing stock that addresses specifically and strongly various needs within our stream'",
        "'speaker_6': 'of demand in the city of Alameda.'",
        "'speaker_0': 'Ashcroft.'",
        "'speaker_2': 'What we're saying is, would you like a motion.'",
        "'speaker_0': 'That would you like a motion or do you think you have sufficient direction? You know.'",
        "'speaker_1': 'I think we have direction.'",
        "'speaker_2': 'Okay, good.'",
        "'speaker_0': 'All right. All right. Thank you, sir. We're going to take a short recess now.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Did you. Did you fetch them?'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Are they fetched?'",
        "'speaker_3': 'Right.'",
        "'speaker_0': 'I think it's. Are you ready? Mm hmm. All right, we're going to resume. Finish up your comments, please. Thank you. All right. So we are now going to resume. We're on item six beers and boy.'",
        "'speaker_1': 'Recommendations have proved an exclusive negotiating agreement between the city of Alameda and a consortium of four developers made up of Mid-Penn Housing. Alameda Point Collaborative Building Futures with Women and Children and Operation Dignity for Planning and Development of a 13.2 acre parcel in the Main Street neighborhood area at the at Alameda Point, bounded by West Midway Avenue'"
    ],
    "Exclusive Negotiating Agreement for Supportive Housing Development at Alameda Point.": [
        "'speaker_1': ', Ryan Avenue, West Tower Avenue and Main Street to enable pre-development activities for designing and constructing new supportive housing facilities for the existing supported housing provider.'",
        "'speaker_7': 'Could he be mayor? Councilmembers Jennifer Short Chief Operating Officer All made a point and that was a longer title than maybe it should have been. I'm sorry.'",
        "'speaker_4': 'About that, but.'",
        "'speaker_0': 'I know it's very clear.'",
        "'speaker_7': 'Okay. Well, good. Laura, do you mind if.'",
        "'speaker_2': 'My staff report?'",
        "'speaker_1': 'Actually.'",
        "'speaker_7': 'We've got a couple of. I'm just going to do a quick introduction before I'm going to come back at the end and talk a little bit about the NRA. Before I do that, I really like I'm a two point collaborative and mid-penn housing to provide a little presentation for you.'",
        "'speaker_7': 'But before I do that, I just want to frame the history. We are here tonight to recommend that the council approve an exclusive negotiating agreement with Mid-point Housing, a nonprofit housing developer that is working with and representing three of the existing supportive housing providers that our current tenants at Alameda Point and the home to about 500 residents'",
        "'speaker_7': 'at the base. Before I turn that over to turn over to Doug Biggs, Executive Director, Robin Point Collaborative. I just want to give a little bit of history here on how to understand why we're doing this and what the background is.'",
        "'speaker_7': 'As part of the Base Closure and Realignment Act, federal law, the city or the Navy, the United States Navy is required to go through a process of surplus in their property and allowing property to be used for homeless accommodations.'",
        "'speaker_7': 'And there were three organizations, actually a long story, but at the end of the day, there was there are three organizations that ended up taking advantage of that homeless accommodation and have become tenants at the base there, occupy the orange, whatever color you want to call it, on the screen.'",
        "'speaker_7': 'But the orange, about 34 acres that they occupy using existing, you know, existing or former Navy housing for two to provide housing for the formerly homeless. It's about 200 housing units. And in 1996, we actually entered into a 59 year lease with them for those 34 acres, answers about 47, I guess maybe 45 years left on that'",
        "'speaker_7': 'lease. So a very long term lease to use those 34 acres. And for many years it's probably been about five years now. City staff and the council, too, in different in different ways, has been discussing with the 11 point collaborative building futures women and children in Operation Dignity.'",
        "'speaker_7': 'Dignity, the idea of consolidating building new facilities because existing the current facilities they use are deteriorated. They're rundown their former housing from the Navy that really aren't built to any current codes and things. And so we've been talking for a long time with them about the idea of creating new facilities that would be on a consolidated footprint'",
        "'speaker_7': 'that would be designed around providing services for their residents. And so that's what we've been engaging in. And what I'm going to do is turn it over to Doug Briggs to come up and talk to you a little bit about their vision for what those new facilities would be like.'",
        "'speaker_7': 'And then I'll come back up and get into the details of some of the INA and what we're asking you specifically to do tonight. Thank you.'",
        "'speaker_5': 'Do the high tech thing for me. Push the button. Good evening, Madam Mayor. Members of the City Council. My name is Doug Biggs. I'm executive director of the Alameda Point Collaborative. We want to start off by waking you up a little bit.'",
        "'speaker_5': 'We've put together a short video that talks a little bit about why we're doing this, what we've done so far. And as I've learned in my 15 year, 11 years now of being at the Alameda Point Collaborative, it's always best if I be quiet and let the residents speak for themselves because they have an amazing story to'",
        "'speaker_5': 'tell.'",
        "'speaker_7': 'So Alameda Point is the name that we use for the formal naval air station is about 2000 acres. It was a Navy station that was played a very prominent role in World War Two, but ultimately was no longer needed as a Navy base and was closed in 1987.'",
        "'speaker_7': 'The base that the city controls from 900 acres. And we have divided that into some areas and subdistricts because it's such a big piece of property. And one of those is the Main Street neighborhood, which was traditionally a residential neighborhood as part of the Navy base.'",
        "'speaker_7': 'And we are working now on a very extensive planning process called the specific plan to really put into place. What's the vision for this neighborhood? We're working closely with collaborative, collaboratively futures, Operation Dignity to come up with a vision for that Main Street neighborhood.'",
        "'speaker_5': 'The Alameda Point Collaborative was created in 1999 as a regional attempt to help end homelessness. Our mission and our philosophy is to use all the resources we can to create a community where formerly homeless families can thrive and gain self-sufficiency.'",
        "'speaker_5': 'We have over 500 residents living out here, including almost 300 children and youth, 18 and under. You know, I like to tell people that we built a pretty amazing community with really horrible housing.'",
        "'speaker_1': 'Some of the challenges is the the litter and the dilapidated apartments. They are an eyesore. You know, they make the place really look like a dying ghetto, you know, dangerous to kids, ride around in their bikes. They're curious.'",
        "'speaker_1': 'They going in and they're hazardous. The walls just cave in, you know?'",
        "'speaker_5': 'And we could do so much more with accessible housing, energy efficient housing, housing that built to create a neighborhood and housing that that's close to services. We're very fortunate that there are three organizations working out here. We each have a particular focus and expertize.'",
        "'speaker_5': 'There was no place for homeless veterans to go in Alameda County. I was actually the first to start any kind of program, and for the first several years we did it with one veteran helping another veteran. It was kind of our philosophy at the time.'",
        "'speaker_5': 'We're like the Alamo. We're the last group standing that's going to fight for everything that the homeless or low income families get out here. About a year or so ago, they started having some issues that caused me to not be able to work, went into the hospital and found myself homeless when I got out and thinks Operation'",
        "'speaker_5': 'Dignity. I was able to find my way back again. That allowed me to to see a brighter future for.'",
        "'speaker_1': 'Building futures of women and children. Is a 27.'",
        "'speaker_0': 'Year old agency whose mission is to end homelessness and domestic violence and the lives of the women and children.'",
        "'speaker_1': 'We serve. And I think what's exciting about this new vision is really thinking about how do we integrate the three agencies? How do we share services or share facilities? Gives us a real.'",
        "'speaker_0': 'Opportunity to leverage.'",
        "'speaker_1': 'What we have and one agency with two other agencies.'",
        "'speaker_3': 'Prior to coming to our MITA. I was stationed in.'",
        "'speaker_5': 'Berkeley in transitional.'",
        "'speaker_3': 'Housing for two years and prior to that.'",
        "'speaker_5': 'I was a couple of years on the street living in abandoned buildings and storefronts and.'",
        "'speaker_3': 'You know, full time work. And we met.'",
        "'speaker_1': 'Before here and we were in a couple of small family shelters.'",
        "'speaker_3': 'And so we were really glad to get somewhere stable.'",
        "'speaker_1': 'But I think what's important is that our voices are heard. I've been a resident at ABC for four years. The group I worked with, our headline was Cohesive Neighborhoods Built Around Community, Open Spaces, Faithful Safety, you know, for our children and ourselves.'",
        "'speaker_1': 'Somebody walking the grounds, possibly more at night than during the day. Our lighting situation makes you look so right here we're.'",
        "'speaker_0': 'Talking about because we have a lot of people have illnesses, terminally ill and also older generation talking about keeping them in a little in their area, away from everybody. So you guys got peace, the kids.'",
        "'speaker_3': 'And then you get around. Like we said, the motto is, let us take care of everyone.'",
        "'speaker_4': 'So everyone is going to get some care. If you have a beautiful community you like, more like people who walk around it rather than drive it. So you feel more comfortable walking in.'",
        "'speaker_5': 'To feel safer. Resident involvement is very important to APC. It's a core value of our mission. We have residents that serve on our board of directors. We have residents that are on staff. We were really fortunate to find a partner like Mid-Penn.'",
        "'speaker_3': 'Husted along those.'",
        "'speaker_5': 'By Mockingbird. One of the things that really impressed me is the level of engagement they're going to do with the residents.'",
        "'speaker_1': 'We test our residents with coming up with how they would compose an ideal neighborhood. So they needed to lay down the streets and configure some buildings and talk to us about where they wanted to put amenities. And then Penn's mission is to not only build housing, but to build communities where families can really thrive.'",
        "'speaker_1': 'And there's so much opportunity here to be able to build housing that is going to be here for the long term, that's high quality, that has amenities that the residents need, that can really help them move forward.'",
        "'speaker_7': 'Our plan is to really take that input and those thoughts in an integrated into the larger plan for the neighborhood and then ultimately get that vision approved by the city council so that we can move towards implementing and constructing facilities.'",
        "'speaker_5': 'We have a really unique opportunity to design the new housing design and the community with input from the residents that will live there and hear what's important to them and hear what needs they have to so that we're able to design a community that really probably going to be one of the most effective housing programs in ending'",
        "'speaker_5': 'homelessness that exists. Yes, I know that. So we've dubbed our project rebuilding existing supportive housing at Alameda Point Reshape. We're talking not just about reshaping the physical environment of the buildings that are out there, but reshaping the lives of the residents that we serve by providing them more accessible housing, providing them with safer housing and communities and'",
        "'speaker_5': 'more secure housing, but providing them with more services and better access to services in the way that we locate the housing. We've already talked a lot about. The existing conditions. But we are spread out over 34 acres for four families and individuals that have significant disabilities.'",
        "'speaker_5': 'It's hard to get around. Safety is an issue out there because we're surrounded by blighted, empty, abandoned buildings. And the housing we occupy is a challenge. Every year it's getting more and more expensive to maintain, and the infrastructure in general out there is getting more and more challenging.'",
        "'speaker_5': 'Just this last weekend, our community without was without power for most of of of Sunday morning. And when you're serving people who have chronic disabilities and sometimes require special equipment, that could be a concern. So beginning is, as Jennifer mentioned, four or five probably even longer than that.'",
        "'speaker_5': 'We begin and we've been envisioning this idea of rebuilding our community on a more consolidated footprint that would better serve the needs of our residents. And last year, we really got serious about it and went through a very competitive process and ended up hiring mid-penn housing to assist with the the financial feasibility, the design aspects, everything to'",
        "'speaker_5': 'lead us up to the actual rebuilding of the housing. And so I want to introduce to you Nevada Merriman, who is the project manager working with us, and she's going to take you through a little bit more of mid-penn capacity in this and then talk about kind of why we're here tonight and what the next steps are'",
        "'speaker_5': 'in this.'",
        "'speaker_1': 'Thank you, Doug. And good evening, Madam Mayor. Members of the City Council. Oh, just advance one, please. Okay. So just a little bit about Mid-Penn housing. We are coming up on our 45th year of providing affordable housing. We work in 11 counties, so we have very deep experience in Northern California.'",
        "'speaker_1': 'And in addition to working in the 11th counties, we have a deep presence in Alameda County. Okay. You saw our video with resident engagement process. We weren't sure if we were going to be able to show it also.'",
        "'speaker_1': 'I think I'll just go over this very quickly in the interest of time. But resident engagement to us is really one of our top priorities in crafting the process that we have with Doug so far. And we've been grateful to city staff for allowing.'",
        "'speaker_1': 'They really took a pause in the middle of their Mainstreet planning process in order to let us do what we thought was the right kind of outreach and the right amount of outreach. And so we spent our summer and we conducted many meetings with both our residents and also the staff for all three organizations.'",
        "'speaker_1': 'And so we were grateful for allowing that time to really obtain this feedback that we think is so important.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'So in creating the preferred alternative, we held two large meetings over the summer and we also held a staff workshop. As we know, the people who work there every day have a lot of ideas about what they'd like to see in terms of improvements.'",
        "'speaker_1': 'We received hundreds of comments and were able to also at each meeting there were at least 100 members who signed in. So we know that more people were there. But in terms of head of households who were willing to sign in, that's the kind of turnout that we received.'",
        "'speaker_1': 'In addition to that type of outreach, we've conducted many meetings with the city in their specific plan consulting team cultivate in urban planning partners. We expect that relationship to continue well into the new year as they. Kind of infused the mood.'",
        "'speaker_1': 'The. What am I looking for? Um, we have a little bit of momentum and so we know that's going to continue into 2016. In addition to that, we had to do a lot of analysis to give Operation Dignity Element a point in building futures, some ideas about what is really going to be feasible from a development perspective'",
        "'speaker_1': '. And the location that we selected is the combination of all of those. And I'd like to just spend a little time on the next slide, which is the preferred alternative that we submitted to Jennifer and her team. And this shows all of the existing housing we built on a much smaller footprint and is really the result of'",
        "'speaker_1': 'those different stakeholders coming together. And we do not yet have the feedback from the rest of Alameda, but we expect that in 2016. That's some of the additional feedback that we will obtain as we move through the Main Street process.'",
        "'speaker_1': 'So this is really our starting point and is it was really selected in with a few components in mind the basic design principles in terms of having access to shared amenity space, including many of Alameda Point Collaborative Business Enterprise endeavors and their Plowshares Nursery.'",
        "'speaker_1': 'The other major driver really has to do with tax credit financing, which is one of the major ways that we are able to fund affordable housing. And in order to qualify for most of those programs, we need to not only achieve a certain density, but also be located close by to amenities, important amenities like high performing transit'",
        "'speaker_1': ', the public school and park amenities that are built out. And so this particular corner has all of those components so that we can get the maximum scoring that we would need in order to compete in the region with other projects.'",
        "'speaker_1': 'Though some of our next steps are that we really would like to apply for additional financing from the county that's available. That's a big step for us. But we think that based on the work that we've been doing over the last year where we are, we are ready to make that ask of the county and they have'",
        "'speaker_1': 'this opportunity with their housing trust fund. We also expect to be further engaged with Jennifer and her staff around analyzing this preferred alternative and working through some of the economics of how this deal will come together. So a little bit on the trust fund.'",
        "'speaker_1': 'It's just an incredible opportunity. The county has been a strong supporter to date of all of these projects. And so when we presented the concept over the summertime, they were very supportive. And I mean, it's my opinion that one of the reasons that they're very supportive is that it's seen as a preservation of all their existing efforts'",
        "'speaker_1': 'to date, that we would be looking to rebuild the housing and in many ways the county not only in the in their loans many years ago, but in their annual operating funds, are a very strong stakeholder and strong partner for these organizations.'",
        "'speaker_1': 'This particular funding is really important because it's a rare opportunity that we see county funding that can be used for this early pre-development at this early pre-development phase. It could be used unsecured. This is this type of money would allow us to continue to do the design work needed to really keep pace with the city's process and'",
        "'speaker_1': 'continue to invest in and leave the door open for us to really do the design work needed to move forward. And in addition to doing that, we are signaling to the county that we are ready, that within a few years time we expect to see that we will be in a position to start rebuilding and we would'",
        "'speaker_1': 'like to apply for additional funds from the county in the future. So this is probably this is the first time we'd like to apply the application is due this Friday and we are signaling to them that they will probably see us again as more opportunities come up.'",
        "'speaker_1': 'And one of the exciting things is that Alameda County as a whole is looking to increase the amount of their housing trust fund, the way that it's funded from the general fund. And that's an opportunity that could potentially turn into a great source for this project.'",
        "'speaker_0': 'So can you clarify, you are planning to apply by Friday, assuming this gets approved today? Correct.'",
        "'speaker_5': 'Just before we turn it back over to Jennifer, I just wanted to add that. Clearly the application is a trigger for us coming before you in requesting the intake tonight. But I on the other side of it, I do want to say that should we not get funding this round?'",
        "'speaker_5': 'That's not going to stop our work. We've already invested over $100,000 in cash into doing the analysis, not to mention an inordinate amount of staff time. And there are other funding operatives that are going to come up. But clearly the DNA was the threshold we needed to have in order to move forward on this application.'",
        "'speaker_2': 'Amber Ashcraft So just a couple of questions, which well, you can probably any of you could probably address them. So Mr. Biggs, you referred to you've spent $100,000 today. Was that a grant from a particular agency?'",
        "'speaker_5': 'We've actually if we count all the funding that we've spent, it's probably been over $300,000. We've gotten several grants in the past from Corporation for Supportive Housing. I'm a little bit scared to mention it, but we also got funding initially from Southern Cal.'",
        "'speaker_5': 'That's how long we've been working on this.'",
        "'speaker_2': 'How about the Metropolitan Transit Commission?'",
        "'speaker_5': 'Yeah. And then we partnered with with the city on the Main Street Project, the most recent hundred thousand dollars. And this is why you you work with a development partner like Mid-Penn is money. They're investing because they believe this project is really meaningful and needs to move forward.'",
        "'speaker_0': 'And I want to share with counsel. We do not have any public speakers on this item.'",
        "'speaker_2': 'Right. So and I was going to say, I did attend one of the workshops that Mid-Penn put on, and it was some of what you saw in the video. It was pretty impressive, all the different groups that are housed there.'",
        "'speaker_2': 'And then there was the separate teen room and children's room tables where they were putting their ideas in. Very skillfully administered the boomerang funds that were from the County Affordable Housing Trust Fund. Does that refer to former redevelopment funds or is that something else?'",
        "'speaker_2': 'It does. Okay, everybody, Debbie Potters nodding. That must be correct. Okay, good. Thank you.'",
        "'speaker_7': 'I just quickly want to go through what the kind of the logistics of tonight of what we're actually asking you to prove tonight is an exclusive negotiating agreement between the city of Alameda and these four entities, including Mid-Penn Housing Going Island, Collaborative Building, Futures of Women and Children and Operation Dignity.'",
        "'speaker_7': 'And the reason we think it's a good idea from the city's perspective, obviously helping our existing residents build new facilities, but it also by putting this the development on this yellow site here, you're consolidating the footprint. It makes it very difficult.'",
        "'speaker_7': 'The Main Street neighborhood we are in the midst, as was mentioned, in a Main Street neighborhood planning process. It's very difficult to plan this neighborhood with the 34 acres the way it is here to create a cohesive neighborhood that and to be able to build marker a development that helps pay for the infrastructure and other things with'",
        "'speaker_7': 'that spread out here. Obviously, you've heard the reasons why they're interested in consolidating. I want you to hear from the city's perspective, too, that by consolidating on a particular site. We're going to be able to develop a more cohesive neighborhood overall.'",
        "'speaker_7': 'And we really can't without them moving forward with their design and planning. It's very difficult for us to move forward with the overall planning of the neighborhoods. So we have these two planning processes are really inextricably related, sort of how allow them to move forward with it, getting these funds hopefully and move forward their plan and we're'",
        "'speaker_7': 'able to move forward our planning which will be part of a very public process in 2016 that we'll be kicking off now that they've completed their resident outreach and hopefully get these funds will be able to really kick off with some momentum in 2016 into the term of the INA is really because we understand and recognize that'",
        "'speaker_7': 'we haven't done finished our public planning process. We wanted to kind of put in here the terms essentially of the seniors until the council adopts the mainstream neighborhood plan. And so it may be at that point that the the site changes or, you know, how we need to kind of give the council a chance to hear the'",
        "'speaker_7': 'mainstream planning process. We kind of recognize that we don't want this innate to continue past that moment. And then just in case for whatever reason is kind of unforeseen, what if we don't ever get that major neighborhood plan process?'",
        "'speaker_7': 'We do have a 12 month kind of deadline as just to kind of have a moment that stops this process in case we need to the deliverables are really to start to sit down with is an implementation term sheet and it would be the city and mid-penn and all the all of the collaborating partners sitting down to'",
        "'speaker_7': 'create a roadmap or an implementation term sheet of how are we going to implement this complicated arrangement? And we'd sit down and negotiate that implementation term sheet that we would bring to the Council for approval. It would not be a transaction.'",
        "'speaker_7': 'It would not be a disposition development agreement at that point, but it could include terms that might go into an ultimate DDA, but it would be that first, really detailed step of trying to create a road map for how we're going to get from A to B in terms of implementing this project.'",
        "'speaker_7': 'The city would be agreeing their responsibilities would be to agree to negotiate with regard to C to the site exclusively with these entities. From the developer standpoint, they would be preparing a draft development plans of really getting in, using these funds to really delve into the details of their preferred alternative and their plan, a business plan which'",
        "'speaker_7': 'is important to us because it's really, as you heard it is, you know, like a lot of affordable housing and without redevelopment. It's very complicated to figure out the financing. So how do we all work together to figure out how to finance this, especially as part of the larger Main Street neighborhood plan and then schedule?'",
        "'speaker_7': 'And so we'd be they'd be responsible and we'd be obviously working very closely with them and cooperating with them on those responsibilities. And so those are the key aspects of the INA. I'm happy to answer any questions and I think we're all here to answer any questions you may have.'",
        "'speaker_0': 'Can you clarify? Does this require three or four votes to pass? Three, three? All right. I remember days ago.'",
        "'speaker_6': 'Thank you. Thank you, Ms.. Just a question. So we're looking at the ten acre quasi rectangular area, which is yellow to some maybe light orange to others. Now, on that site, there are some buildings which might have some problems or I don't know.'",
        "'speaker_6': 'So does the is there enough flexibility through the in a process that as Mid-Penn and their and the Alameda Point Collaborative they're reviewing you know the pros and cons of that site. Are there enough options should they so choose for them to move elsewhere, perhaps areas contiguous to the light orange area?'",
        "'speaker_6': 'That's not to say I want them to move elsewhere, but it's just to say that, you know, I remember the commissaries there and, you know, there's other you know, things can happen, as they always do when it comes to redeveloping sites at Alameda Point.'",
        "'speaker_6': 'How would that work?'",
        "'speaker_7': 'Yeah, I think that's a great question. I mean, I think we, you know, on our end, we're going to be really kicking off, of course, closely with a mainstreet, every planning process that has to get input from the rest of the community so that could influence things.'",
        "'speaker_7': 'They're also going to be engaging in due diligence and pre-development that might result in them finding something out about the site that makes them change their mind or want to tweak the boundaries. And so we absolutely can look at that.'",
        "'speaker_7': 'I think our responsibility is to negotiate exclusively with them on this particular site. But it doesn't say that we can't not exclusively talk to them about other sites within the mainstream neighborhood. And we we've talked with them about that.'",
        "'speaker_7': 'They're open to that. We understand that this isn't limit our possibilities. I think we all we've it's not that we just drew that yellow boundary, you know, randomly. There has been a lot of thought put into that particular site, but we still are just starting this planning process.'",
        "'speaker_7': 'So we we definitely are all open to the fact that we might find something to that planning process that leads us to a different location.'",
        "'speaker_6': 'I think I'm bit basically raising that, speaking as one of five to let people know that, you know, if I'm fortunate things happen that, you know, if you have to go to plan B, then let's all jump onto plan B, but hopefully plan will work.'",
        "'speaker_6': 'So let's all get behind that as well. The other question I have is and this is an important question, I recognize that we've moved down this process, but there was an entity who was interested in the commissary site.'",
        "'speaker_6': 'If we can speak to what y you know, who you are going with is the better alternative. I'm sure the other person had, you know, was enthusiastic about the ideas that he wanted to do with the commissary site, but.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_7': 'Yeah. I mean, and I think in general and I'll speak specifically to your question, but in general, we get a lot of interest in, I mean, a point in a lot of buildings. And then we typically, you know, ask questions and things and we don't there isn't always we you know, there are reasons we don't always move'",
        "'speaker_7': 'forward with a particular prospective tenant. In this particular case, we felt that what we've been talking we've been talking about the collaborative and the collaborating partners for a long time, and that this site, because of the tax credit kind of scoring that you heard, you know, because it's close to Main Street where the infrastructure is close to'",
        "'speaker_7': 'site where you have some of the transit. We felt it was more important in terms of some of those public policy, other public policy goals to move forward with this proposal. That doesn't mean we are still talking to that other, you know, that is interested in doing some kind of entertainment, other uses that we can look at'",
        "'speaker_7': 'other buildings for them and explore those options.'",
        "'speaker_6': 'Wonderful. I just want to end by just quickly saying, you know, this is a relationship that we've had with the Alameda Point Collaborative going on. 22 years since 1993 and 1994. So it's not just a legal relationship, but it's a relationship that I think has made Alameda that much of a greater city.'",
        "'speaker_6': 'We had some rough patches in the first go years if you were around in 94, 95. But I think out of that, you know, base conversion is certainly achieving. I think it's for meaning by including as as we have done, the Alameda Point Collaborative and to see, you know, the families who are going through the transition.'",
        "'speaker_6': 'I think it makes everyone proud here in down member.'",
        "'speaker_5': 'Just a couple quick clarifying questions so. They have 200 units right now in the mainstream neighborhood, right? Mm hmm. And so we're not really adding housing units. We're actually replacing the already. And then I think you said this, but just to be sure, if for some reason we can't come up with a mainstream plan because the community'",
        "'speaker_5': 'can't agree on whatever, we could still. Take this apart and develop these these 200 units and this project separately. Correct.'",
        "'speaker_7': 'Well, first of all, the DNA would terminate after 12 months if we weren't able to come to some agreement. And then we'd have to look at how the project was financed. But we could we and in fact, part of the direction for when you the council give direction when it entered into the consultant agreement for the mainstream'",
        "'speaker_7': 'neighborhood was to look at how what's the kind of minimal amount of development that we might need to support the replacement of these housing units. And we were absolutely doing that. So for some reason, the Main Street neighborhood planning process fell apart.'",
        "'speaker_7': 'We could still, before the council, get direction to move forward with that proposal. How could we then, you know, create a plan and a, you know, an entitlement for how much ever development we would need to help support this project.'",
        "'speaker_7': 'And so we could kind of we could try I'm sure we can come up with a way to kind of carve that out and try to find a feasible way to move it forward. I will say that I can't tell you now that there is a feasible way because we it's this is a complicated it's expensive.'",
        "'speaker_7': 'But we could absolutely figure out a way to try to make that happen.'",
        "'speaker_5': 'Because my concern is that for some reason, this community cannot come to a consensus on on what they want the Main Street neighborhood to be. I, you know, these these 200 units housing some of our most vulnerable populations.'",
        "'speaker_5': 'So it's important to me that we keep that process going, even if we have to make it independent of the Main Street neighborhood. And so, you know, anything I could add is not going to be nearly as eloquent or powerful as that video.'",
        "'speaker_7': 'So I will say that our zoning requires that there is a mean a neighbor, a or one or more specific plan that has to be done. So we'd have to turn whatever plan they were preparing into that plan to meet our zoning and then try to figure out a way to do it.'",
        "'speaker_7': 'And I think we could figure out a way to entitlement a title that and come up with a package.'",
        "'speaker_5': 'Hopefully that won't happen. But right in the worst case scenario, I'd like to keep this this ball moving.'",
        "'speaker_7': 'Yeah, absolutely.'",
        "'speaker_0': 'And Ashcraft.'",
        "'speaker_2': 'Thank you. I also wanted to commend whoever put that lovely video together. I think that that's the sort of thing, you know, I'm the eternal optimist. So I think that going forward and going out into the community to help sell this plan and its importance, I hope you show that video every single time.'",
        "'speaker_2': 'But it really does give all of us an idea of the kind of work that's being done out there, but also the deplorable condition of the buildings that are out there because not many in the community necessarily find their way all the way out.'",
        "'speaker_2': 'And among those 34 acres, Mr. Biggs took me on a walk. A few years ago, we walked for 3 hours, going through just about the entire premises. So I am excited about the prospect of working with Mid Peninsula housing.'",
        "'speaker_2': 'If you read at the end of the INA that's attached to the staff report, there's biographies of the various executives who are part of this development team and they come with very, very good backgrounds for what they're doing.'",
        "'speaker_2': 'And I, I think that it is important to move forward on this. There's so many advantages to consolidating that 34 acre dispersed space into a more cohesive 13 acre site. And we've heard from the residents who don't feel safe out there at night.'",
        "'speaker_2': 'It's so spread out, the lighting's not good. You know that if you're ever at an event at the old club at night, you're practically doing a flashlight to get back to your car. And so and it's expensive to maintain older buildings.'",
        "'speaker_2': 'And so I think that it's time to move forward with this, and I look forward to supporting this when it comes to a vote. Thank you.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_3': 'Yes. I think that what's on the table tonight? Puts us at no risk and actually keeps this project, which is much needed given the state of housing there in the realm that it can be delivered. And we have to do this.'",
        "'speaker_3': 'There's an there's a clear term that's been described in the staff report, which puts the city in a good time to get this done in a timely fashion. The deliverables are quite clear. It's a term sheet and it's meshed with the main street planning process.'",
        "'speaker_3': 'I think they have to go in parallel. So I, I, I'm fully supportive of that. The case that the consolidation is necessary, especially around transportation and the schools, is is a no brainer. And the responsibilities as outlined it from the developer standpoint, from the city standpoint, are quite clear.'",
        "'speaker_3': 'So I'm ready to move forward on this. I think it's at no risk to the city to make this an exclusive negotiated agreement, and we need to get this passed.'",
        "'speaker_0': 'Remember De Saag.'",
        "'speaker_6': 'Just a quick question. So when we're talking about thinking this up with a larger Main Street neighborhood, is the one is one of the underlying reasons because we might use some financial mechanism generated there to help pay for the this project.'",
        "'speaker_6': 'If so, I'm I would be fine with that. I just want to make that clear.'",
        "'speaker_7': 'Yeah, it's actually two things. One is that our zoning, we created these districts, the Subdistricts for the 900 acres because it was so big. One of them was in a mainstream neighborhood. And because it's a housing neighborhood, we knew we actually added a layer of requirement, which was you can't develop here without a specific plan, because we'",
        "'speaker_7': 'really want very prescriptive rules and regulations about how this place, this neighborhood is going to look and feel like like we did for the town center. And so we are now we got funding from the region to implement that extra kind of layer of rules and regulations.'",
        "'speaker_7': 'So they actually, in order to develop their plan, need those rules and that framework in order to move forward. Now, there might be creative ways if the event that we can't come to some agreement about the whole neighborhood, I hope that doesn't happen.'",
        "'speaker_7': 'But if we couldn't, then there are ways that we could be creative within the zoning to get them move in on their project individually by doing kind of a plan just for them. But I think our hope is that this neighborhood gets planned cohesively together and that that framework that set in place with the specific plan.'",
        "'speaker_7': 'So that's one reason is they actually need the zone, they need the detailed zoning to be able to move forward with their plan. And so as they plan their buildings and their site, we then can have that inform our framework.'",
        "'speaker_7': 'And then if there's concerns that come up with the community about that framework, then we can go back to them and say, Hey, we need to tweak your plan a little bit to be responsive to our our community's concerns about this issue, whatever that may be.'",
        "'speaker_7': 'And so these two efforts can kind of inform each other. The other, you're right, is that there could be we need to see their financial we're going to kind of kick this off a little bit more. That's why we need the performa.'",
        "'speaker_7': 'We need to see their financials usually with projects like this that for these populations and I'm tell me if I get this wrong Nevada is that there's pretty significant subsidies that are required, public subsidies that are required. And so how we finance there's also that land needs infrastructure, $1,000,000 an acre of infrastructure.'",
        "'speaker_7': 'And so we're expecting that we're going to at least have to put on the table and discuss the possibility that some of the market rate development may have to help subsidize the infrastructure for this project. But and remember, they're giving up a long term lease on 34 acres for for land they want to own on 13 acres'",
        "'speaker_7': '. So they are foregoing, you know, a leasehold, a very long term leasehold. And so all of that has to be part of the negotiation with them is to figure out a way to make this mutually beneficial for everybody to try it.'",
        "'speaker_7': 'And so I do expect that there's going to be discussions, maybe some hard discussions about how to how to get all this financed. And part of that may be the market rate development in this project, but I don't know yet because we haven't done.'",
        "'speaker_4': 'All that.'",
        "'speaker_6': 'Understood. In which case it it might behoove us to kind of have a check in with the ninth Street neighborhood process, because given the housing context that we're in now, I mean, there are conceivably some ideas that some might have with regard to that specific area relative to the general housing crisis and how that might or might'",
        "'speaker_6': 'not address it. And so.'",
        "'speaker_3': 'It's.'",
        "'speaker_6': 'Maybe it may be better to have that conversation sooner rather than later.'",
        "'speaker_7': 'We absolutely agree. And we've been kind of pausing to let them kind of catch up. And now we're I think 2016, we're really with this DNA. Hopefully with the funding they get, we're going to really kick off that process and have a much more public presence with regard to the Main Street Neighborhood Plan.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'So I think it might be about six months ago I was able to take a tour out of the point with Doug Biggs, and there are quite a few different representatives out there. And I just have one question for Mr. Biggs.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'And I saw the video. I really appreciate the video. I think it was well done. And my question to Mr. Biggs, who has been I I'm going to say. A lifetime serving these families and I think doing an amazing job.'",
        "'speaker_0': 'And I do agree with your statement that this is an opportunity. So at this point, my question to you, is this what you want? Is this what you want?'",
        "'speaker_5': 'Thank you. That's an excellent question. And it's total surprise to me. I have to say, you know what's really wonderful about this? This is what the residents want. This is not my. Dictate. This is not my dream. This is their dream.'",
        "'speaker_5': 'This is their wants. This is their way to get security and safety and to build a healthy community for their families. So it's you know, the best part of this is it's not about what I want. It's what they want.'",
        "'speaker_5': 'And we can achieve it with your support tonight. Thank you.'",
        "'speaker_0': 'Well, you're the executive director. That's why I'm.'",
        "'speaker_5': 'Asking. I'm the typist on the grants. Really? Except this time, I mean, really, it. It's their voice.'",
        "'speaker_0': 'You're being very humble, and I appreciate that. So given all of their needs, everything that's expressed to you, I see this as an opportunity. And this is. This is. But. But your proposal. Your. I plan to fully support this then, based upon your expertize and recommendation.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Truly. Okay. I'm not finished yet. All right, then. I also want to share that recently I was able to attend College of Alameda and there was a class there where we have two students in our audience today that were there.'",
        "'speaker_0': 'And the issue that they were sharing with the community was about homelessness. And I think that they raised some really good points. And my recollection is, remember, I was there, vice mayor was there, Mr. Otis daughter Sarah was there.'",
        "'speaker_5': 'Not representing me, though.'",
        "'speaker_0': 'But but you're in our audience today. You did not post slips to speak. Would either of you like to say anything?'",
        "'speaker_3': 'Hi. My name is Skyler. Right.'",
        "'speaker_4': 'And I'd just like to say that as someone who was born into a family that was homeless and was homeless here locally over in San Francisco, that just having the opportunity to build the lives back up.'",
        "'speaker_6': 'And just have a place for.'",
        "'speaker_4': 'These people, really, because that's what they are people and they need a place.'",
        "'speaker_6': 'To call home. And it's just so.'",
        "'speaker_3': 'Wonderful that we've got the opportunity to make that really happen here.'",
        "'speaker_0': 'Thank you. And I really do appreciate your class setting this subject, inviting the community to participate. To hear you. To have you be in our audience. And then to have you speak. And I want to make sure you understand.'",
        "'speaker_0': 'We do welcome you to our meetings. You do have a voice to be heard. Thank you. And I so I do plan to support this. Right, Vice Mayor.'",
        "'speaker_3': 'And it was. It's. At the presentations that this group did. There were a number of points that were covered in our goals that were. Pointed out in that presentation on things we should be doing. So I think it's a validation from a sector of the population that generally doesn't come to city council meetings.'",
        "'speaker_3': 'It's much appreciated. I'd like to make a motion to approve the recommendation as stated in the staff report, to enter into an in a of between the city of Alameda Mid-Penn Housing Alameda Point Collaborative Building Futures for Women and Children and Operation Dignity for the Planning and development of 13.2 acres, as defined in the staff report.'",
        "'speaker_2': 'Taken and embraced. Before we vote, I just wanted to just tag on to your comments, because the mayor did very nicely describe the session on homelessness. This was a critical thinking class at the College of Alameda, and they did a presentation last week and there were four different areas.'",
        "'speaker_2': 'Food deserts was one of them mentoring young people. And I have an idea see me afterwards and rape culture and then the homelessness issue and these presentations that these young people gave were very polished and professional and they had visual aids and they had interactive activities for us to partake in.'",
        "'speaker_2': 'And it was very impressive. So thank you so much for coming out tonight and being here.'",
        "'speaker_0': 'Thank you. That being said, all those in favor. Motion carries unanimously. Thank you. Item six, see?'",
        "'speaker_1': 'Recommendation to accept the five year pipeline report for affordable housing.'",
        "'speaker_0': 'Good evening, mayor, council staff members and other members of the community. Thank you. My name is Victoria Johnson. I'm the director of housing community development for the Alameda Housing Authority. I'm making up just a presentation report. No action is is requested.'",
        "'speaker_0': 'And it is a good news report. The presentation is the affordable housing development pipeline. This is a projection of the number of units and the location of the units that are likely to come online in within the next five years.'",
        "'speaker_0': 'Many of these projects are already under development or pre-development, and some of the projects are in the preliminary stages.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'Yes. We're good. Okay. Thank you. All right. So just for some points to think about, we agree that the goal of the housing authority in its role is serving as the city's primary agent of housing development. For Affordable in the affordable market is to expand housing choice at many different income levels.'",
        "'speaker_0': 'And, of course, the city's inclusionary ordinance supports that goal. We focus as a housing authority on low income households, which is households that earn less than 50% of median income. And we also know as each year passes that we we really need to serve a diverse population and diverse with respect to physical needs, social needs, economic needs'",
        "'speaker_0': '. And I want to really emphasize the need for geographic dispersion. In years past, in decades past, there's been a lot of affordable housing development. This is not so much true in Alameda, but certainly in larger cities. That development has been geographically concentrated and that is not a good idea for many reasons, the least of which I want'",
        "'speaker_0': 'to make reference to a United States Supreme Court decision from June 2015. So very recent, which found in State of Texas case that the governmental agency was liable for violating the Fair Housing Act, or I should say could be liable under the Fair Housing Act for claims against the government agency, even if there was no intent to'",
        "'speaker_0': 'discriminate. But if there was an effect of discrimination so simplified, if all of the affordable housing in any particular jurisdiction is in one neighborhood or in one census tract or in one side of town, someone could bring a claim of a violation of the Fair Housing Act.'",
        "'speaker_0': 'So and for that reason and many other reasons, we seek to distribute housing throughout the city. Some other points just to think about, which is that right now we have quite a good, healthy pipeline. We have if everything gets built over 200 for sale homes and 400 for rent units that will either be newly constructed or renovated'",
        "'speaker_0': 'and calling the previous item. I really want to emphasize that preservation and restoration is important part of the overall strategy. Older units that are lost are. It can happen. It happens in a lot of older cities in particular.'",
        "'speaker_0': 'So preserving older units is really in many ways just as good as building a new unit. We're preventing the loss of that unit. And so each of those contribute, whether we're building new, renovating or preserving, we're contributing to the overall goal.'",
        "'speaker_0': 'There's some smaller projects that are in our pipeline here in the city. They're not included in all. I'm going to kind of quickly run through the 15 projects that are underway, but the smaller projects are important. Even, for example, the discussion about potentially bringing on a handful of of accessory dwelling units each year, every little bit counts'",
        "'speaker_0': '. And lastly, our inclusionary housing housing ordinance in the city of Alameda is very effective and it has been for a long time. Many cities don't have that tool. So I really appreciate working here that I have that tool.'",
        "'speaker_0': 'So then through the map and you have a presentation that describes each of these projects in greater detail, starting at the east end of the island, the housing authority owns land on Eagle Avenue. We have received planning board approval and we're moving forward to apply for funding for 22 units.'",
        "'speaker_0': 'The Boat where its boat works project has yet to receive its entitlements, but it is underway and will include affordable units per the inclusionary ordinance requirements. Similarly, 2100 Clement will have inclusionary units that will has entitlements. And I'm I don't want to necessarily repeat what you have in your report, but perhaps for the public who doesn't have'",
        "'speaker_0': 'the report in front of them, I can list the number of units. So the Clment, for example, will include seven affordable units. The Del Monte building, as you know, has approvals in place. And that will include both affordable moderate priced units that will be developed by Tim Lewis.'",
        "'speaker_0': 'Communities and the Housing Authority will help to develop 31 affordable rental units, which will be senior units. Maureen assures a linear project there will be 16 for sale affordable units to the north of Del Monte. The Tim Lewis company is planning to develop.'",
        "'speaker_0': 'They have just started the really early conversations about that project, but that could potentially include up to 40 affordable units or more. And moving westward. I've highlighted here is three existing housing authority projects, all of which are aging, and in particular the Roseville Project needs to be redeveloped.'",
        "'speaker_0': 'It has some serious structural decay issues and we're going to be we the housing authority will be working on that. I don't think it will need council approval, but we will of course, be working with the building department to get approvals for that.'",
        "'speaker_0': 'And the the combined number of units in those properties is, is almost, let's see, 40, 80 and 50, 130 and the Parrot Village in particular, there's a lot of vacant land there. We could potentially add some units at that site.'",
        "'speaker_0': 'So we'll be looking at that. Continuing. We have the China Clipper project. That's a small building. It's only 26 units owned by the Housing Authority, but it is also aging and needs to be renovated. And then all the way west to Alameda Alameda landing and the the edge the east edge if you will of Alameda Point the'",
        "'speaker_0': 'Stargell Commons project. I'm happy to report if anybody doesn't already know, we closed financing last week. There are 32 affordable rentals being developed there. Alameda Landing has 16, the current phase 60 and affordable homeownership opportunities and the master developer Catullus has entitlements to develop several hundred more homes.'",
        "'speaker_0': 'I don't know the exact number north of Mitchell. There's a 40 acre parcel, I believe. And then the last here is the North Housing, which the housing authority will receive in the coming year. 13 acres of of Navy owned land to develop affordable units.'",
        "'speaker_0': 'And last but not least, the city really least, but most in terms of number of the city project has 200 affordable units and adding those all together. It's a really significant number of units in a city for their size.'",
        "'speaker_0': 'Owever, having said that, the demand is great. And even if we build 600. Demand will always exceed our our ability to supply. But we do the best we can do. So be glad to answer any questions. Amber Ashcroft.'",
        "'speaker_2': 'Thank you. Amber Spencer. Johnson. Thank you for the report and for the the nice presentation of the visuals. When I was reading the staff report about upcoming projects in number nine is North housing and it is described as so it's former Coast Guard housing and it's and it's adjacent to Estuary Park.'",
        "'speaker_2': 'Correct. So there'll be a nice park there. But it says the approval requires the development of a 90 unit permanent supportive housing project for formerly homeless individuals and families and may include housing for veterans. So my question was, how does this proposed housing at the former Worth housing former Coast Guard housing site coordinate with the work that'",
        "'speaker_2': 'we just heard that Alameda point collaborative and building features was women and children is doing.'",
        "'speaker_0': 'There's a memorandum of understanding that was executed by the Housing Authority, the city and the providers, Building Futures and Alameda Point Collaborative are signatories to the demo. You and the Navy has approved and HUD has already approved that the memo use specifies the the use the 90 units should be supportive housing.'",
        "'speaker_0': 'It does provide an opportunity and this this may come to pass or it may not be necessary for some of the families who now live in the collaborative units to move into the 90 units if they are developed first.'",
        "'speaker_0': 'So it remains to be seen what will be developed first. So it is one possibility that some of the existing households, if north housing is developed first, could move over, which would make it easier to develop the 200 new units because there'd be fewer relocation problems if the 90 units are developed later, that would not.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'In other questions. Comments. Thank you very much. Okay. Thank you. Next item, a6d.'"
    ],
    "Ordinance to Create the City of Alameda Disaster Council.": [
        "'speaker_1': 'Introduction of ordinance amending the Alameda Municipal Code by adding Section 2.24 to Article two of Chapter two related to emergency organizations to create the City of Alameda Disaster Council, as required by state law to obtain legal recognition as an official emergency organization.'",
        "'speaker_0': 'Hello. My name is Captain Sharon Oliver. I'm the disaster preparedness coordinator. Pardon? My voice decided to leave me right before I came. I'm the disaster preparedness coordinator for the City of Alameda and emergency manager. So what I'm hearing tonight is we're requesting that you adopt an ordinance to reinstate the city of Alameda Disaster Council.'",
        "'speaker_0': 'I do have a point of clarification as that went through, as the ordinance went through the process. There was a name change that did not get corrected prior to giving it to you. You should have a version with a line through that calls it the disaster council as opposed to the disaster commission.'",
        "'speaker_0': 'It couldn't be called a commission. There's other rules that go along with commission. So staff worked very hard to have it accurate for you to this evening and there was still a minor error. So do you all have your packet?'",
        "'speaker_0': 'Correct. So I'd just like to give you a little context for why we bring this and how the city of Alameda fits into a bigger. A bigger picture with the state and how we operate when it comes to emergencies and disasters.'",
        "'speaker_0': 'So the state of California works in what's called the standard emergency management system. That's seems for sure. That is how we respond to and organize ourselves in disasters. It's where our mutual aid agreements live and are played out.'",
        "'speaker_0': 'There's methods for requesting assistance and giving assistance to other cities through those mutual aid agreements. We operate in a chain of command type environment where if we need help, we go to our operational area, which is the county of Alameda.'",
        "'speaker_0': 'They have their emergency operations center in Dublin, California. So we we do many of these things to be a team and work together. But we also do these things to meet requirements from FEMA. FEMA has, as the years have gone on, gotten to the point where they're not willing to continue to spend taxpayer dollars if the communities'",
        "'speaker_0': 'aren't doing their part to be prepared. So when we bring these things before you, part of it is so that we're eligible for full reimbursement for disasters. They will always come and help us. But at the end of a disaster, they're going to audit us.'",
        "'speaker_0': 'And if we don't have certain things in place and we're not doing our part to be a prepared and resilient city, they will ask us for some money back. I believe it's at about 6% now. If everything's not in place and I'm not going to go through all those things tonight for the time constraint, but when it'",
        "'speaker_0': 'costs sometimes billions of dollars to help a community recover, 6% of that can be quite financially devastating to a city if they're not, you know, doing what they need to do. So we are doing what we need to do, I can assure you.'",
        "'speaker_0': 'Part of the things we need to do are have an operational plan. We have an emergency management plan in place. That's one of the things we have to do. We are currently working on a revision of the emergency mitigation plan.'",
        "'speaker_0': 'That's to mitigate hazards prior to, you know, identifying and mitigating those hazards. So we're in the process of doing that, that plan right now, and you'll see that in the coming months to be adopted. We're also responsible to train our staff, and we're responsible to collaborate with the community and train the community to the best of our'",
        "'speaker_0': 'ability. Those are things that are required for FEMA to give us the reimbursement and not ask for any of it back. We don't want them to ask for any of it back. So this ordinance is getting reinstated. And I want to just kind of let you know that the reason we're bringing it back is because it by'",
        "'speaker_0': 'accident got deleted. It was an oversight, the last council task staff with looking at boards and commissions and getting rid of some of the bureaucracy and red tape, I believe. And that's great because everybody wants to streamline as much as possible.'",
        "'speaker_0': 'The problem was in that streamlining, they got rid of the disaster council. So it just a brief history on the disaster council. If you're old enough and I'm not sure any of us are, I'm not going to admit to it.'",
        "'speaker_0': 'They used to call this civil defense. The term civil defense came out, I believe, around World War Two. Don't hold me to that. It was a way for communities to protect themselves and to rally their citizenry and their government to protect themselves in the event of war.'",
        "'speaker_0': 'That became disaster preparedness. That's what that term turned into. Some communities still use the term civil defense. The county of Hawaii uses the term civil defense in their preparedness efforts. The city of Alameda established a disaster council in 1947.'",
        "'speaker_0': 'They formally adopted that in 1951. That was to align with where the state was going in those preparedness efforts. That ordinance was revised in 1972, and you can see this ordinance was very old. And so when they went to clean things up, it looked a little musty and dusty.'",
        "'speaker_0': 'With that being said, it was still completely in effect. So in 2011 was when they with when the action got taken to clean up and that ordinance got removed. So what are the responsibilities of the disaster council? And when I when I talk to you about this, this is all about being standardized in the state of California'",
        "'speaker_0': '. We can be really proud as Californians that the National Incident Management System was modeled after California's efforts in the way we work together. So we've been doing this a long time and we're good at it. And the. Government modeled after us.'",
        "'speaker_0': 'So that is the Council's responsible for planning efforts. So I mentioned the emergency management plan or sometimes called the operation plan. That council guides that planning. We have one in place. It's bones are good. But if you were really to sit and read it, you'd see that it's getting outdated.'",
        "'speaker_0': 'It mentions things like the alert and warning system, which we've taken down. It does not address alerting to the community through Nirsal, which is now what we have in place. So there's some things that have just changed. It mentions things like VHS tapes and, you know, technologies that are quite old.'",
        "'speaker_0': 'The bones of it are very good. And we need to drill down and we are in the process of doing that. But the disaster council would review those plans and then bring them to you for adoption. The council would review any mutual aid agreements.'",
        "'speaker_0': 'We currently have a signed agreement from 1950 that is current to be part of the mutual aid agreement. So we're not out of compliance with that at all. But if there was major changes, it would get reviewed by the council.'",
        "'speaker_0': 'It directs the emergency organization, which is essentially that council. And those who are assigned to work in our emergency operations center coordinate efforts between agencies such as Red Cross. Also I have here Coast Guard, Marines, things like that, other response agencies.'",
        "'speaker_0': 'It's a place for all those agencies to come together, to work together in our planning and our response efforts. It allows the city to recall city employees as disaster service workers. This is the ordinance that allows us legally to have them come back in.'",
        "'speaker_0': 'It allows us to command the use of citizens and pressed into service by police and fire personnel in a disaster. And they're covered as disaster service workers. It also allows us to organize and coordinate the use of our affiliated volunteers.'",
        "'speaker_0': 'And when I say affiliated, it's they're they're known to us. So Alameda Search is one of the programs that the fire department oversees. And it has grown to be a robust organization that is integral to our response matrix.'",
        "'speaker_0': 'Those are affiliated volunteers. So they're people that are known to us. There are citizens, they've had training and they have chosen to be available if they can, to assist. So that's some of the things they do. So the new ordinance, since we lost the old ones, we took the opportunity to rewrite the new one.'",
        "'speaker_0': 'And part of why we we why we rewrote it was because it helped us align with what we already do day to day in the operation of our city and our emergency operations center. So the city has it.'",
        "'speaker_0': 'And stop. If I go off track, please. The city. The Council has assigned the city manager to run daily operations. So in this ordinance, you might notice that the city manager is called the director of the ordinance. The city manager is also the director of the Emergency Operations Center.'",
        "'speaker_0': 'So it aligns with the way we do business. I also might add that, you know, although we took our ordinance away accidentally, we are not the only city that did that. Other cities went through the same conflict and felt that it was old and got rid of it only to find they needed to reinstitute it.'",
        "'speaker_0': 'The city of Berkeley had a similar issue. I was speaking with my counterpart about the challenge and they rewrote their ordinance as well in place with the city manager as the director of the disaster council. So who.'",
        "'speaker_3': 'Who are.'",
        "'speaker_0': 'Who are members on this council? Our membership are people who have a strong background in response and planning. So it's upper management of the police department, the fire department, the public works department, AMP. And I call those four agencies our response agencies.'",
        "'speaker_0': 'Those are the groups that of city employees who come out when there's something going wrong. We all have daily activities, but we show up amp when we have storms and fires are down. They come out in the middle of the night to repair and restore power.'",
        "'speaker_0': 'Public Works comes out at any time of the day or night to fix a broken sewer mains and and you know interact with you say might if we have a water main breaks and if we had a disaster they would be working side by side with police and fire and the EOC staff to put our city back'",
        "'speaker_0': 'on its feet and restore services. So I call those our response agencies. They're used to working in the mutual aid system. They have mutual aid agreements in place. They understand planning and response because that's what they do. And then we bring in our partner agencies that also our response partners.'",
        "'speaker_0': 'That's the Red Cross, Coast Guard, Marine, East Bay mud, which is our water service, PGE And just to name a few, Alameda Hospitals sat on the board before because they're an integral part of our response and a partner in serving our citizens in that way.'",
        "'speaker_0': 'So those are generally the people that we have on this council, and they are professionals in their field understanding, mutual aid agreements, planning and that process. So it's a high level council. Anything that goes through them, you might have read the ordinance comes to you for approval.'",
        "'speaker_0': 'So never are you out of the loop on what this council is doing. It always comes to you for approval. Some things are going to come to you soon for approval. We're going to update as soon as we get this ordinance back in place.'",
        "'speaker_0': 'We've been working on it, but we'll work even more diligently because there'll be a team in place to update our emergency operation plan, which is critical. The Public Works Department is working on debris removal, so there's a lot of us already working to drill down and update these plans.'",
        "'speaker_0': 'So that's pretty much how that works. I wanted to touch, though, on our emergency operations center and how that's organized because this ordinance does will get us in an alignment with the way we operate already. So the city manager is the director of the Emergency Operations Center and makes decisions in conjunction with the police chief and the'",
        "'speaker_0': 'fire chief because they are a little bit more of an expert in response and can guide the city manager. But it's a team effort. The people who are assigned in that in those positions are predominantly department management and just below management.'",
        "'speaker_0': 'We're a small city, so we have really two full teams that can respond to the emergency operations center. Now, the council plays an important role. Your role, however, is not in the actual EOC. Your role is to make policy decisions.'",
        "'speaker_0': 'Appropriate funds be the face of the city in speaking to the public. You work closely with the PIO, the public information officer, to disseminate critical information to our citizens about what we're doing and what we. Would like them to do and to provide services.'",
        "'speaker_0': 'You also work closely with the city attorney to make sure that we don't step outside any legal guidelines with disaster response. The other thing that this ordinance talks about is declaring a disaster. Now, the city manager in our emergency operation plan is capable of declaring a disaster, as are you capable of declaring a disaster.'",
        "'speaker_0': 'The city manager is required to come back and will come back. I know you will, because you live in town. And so when we when the city manager and the staff decide that we need to declare a disaster, we would like to do that early.'",
        "'speaker_0': 'And then it comes to you for ratification. I want to clarify. She's our interim. We're in the hiring a long term, and I'm not sure where that person would be living. So this should not be based on having a city manager that lives here.'",
        "'speaker_0': 'I'm sorry. It's not. But all all employees come back as disaster service workers and all people assigned to the EOC would get messaged and would be required to come back apologize. So it aligns with how we do business in the emergency operations center.'",
        "'speaker_0': 'You will be kept abreast of everything that's going on, an integral part of decision making at the highest level. So I don't want you to feel as though this somehow goes around your authority. Everything comes through you. So with that being said.'",
        "'speaker_0': 'I would open it up to any questions or comments. I understand we don't have speakers on this one either. All right. Questions. First, we're.'",
        "'speaker_3': 'Just in the membership of the.'",
        "'speaker_5': 'Of the.'",
        "'speaker_3': 'Emergency operations team and the disaster council would consider including the Water Emergency Transit Authority because they'll have their EOC at the new building on the point. And is there any consideration and that's peripheral to the ordinance because the ordinance doesn't specify it.'",
        "'speaker_3': 'But as you get to those type of issues, once this is approved, will you be asking guidance?'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_3': 'Or when you started putting the implementation steps in place? Because I can see that also the mayor, Ed, has resources that will be very valuable during the disaster, and I'm hoping that comes back. I think in my read of this, it allows that, yes, flexibility and adaptability depending on what ends up at that end of the island'",
        "'speaker_3': 'as well. So I'm just hoping you consider that, I think, to get this in place sooner rather than later. Allows us to start the implementation process and we can adjust this if the implementation process demands it.'",
        "'speaker_0': 'Yeah, absolutely. You know, we're always doing outreach to all the. You know, partner agencies. So transportation, I, you know, I gave you a short list. AC Transit is also one of our partner agencies, so and we're in agreement with them to assist us in many cases.'",
        "'speaker_0': 'For example, if we had an active shooter event at a school, they're, you know, able to come in and help us move students and things like that. So we partner with a lot of agencies. That was a very short list and on certain topics we definitely want to have input from various groups.'",
        "'speaker_0': 'I've been working just to let you know, I should preface this so the city is responsible for a disaster from the start to the end. So even though we get assistance, we're responsible for all of it. So we're responsible for sheltering and feeding any of our displaced citizens and pets.'",
        "'speaker_0': 'And pets and at risks that risk community as well. So we've been in conversation with the animal shelter and bringing in interested citizens to talk about what sheltering pets is going to look like and how we might do that.'",
        "'speaker_0': 'I've been talking to Carey Parker on the Commission for Disabilities about the you know, how how are we going to plan and what does that look like? They're the experts in disabilities. So we need to involve all the community input to really effectively plan.'",
        "'speaker_0': 'So the council's a high level group to move these plans through. But the public outreach and the input is important at all times in my office is my door is always open. I work closely with people who come through cert and those are the people who are tend to be compassionately interested in assisting us with planning efforts'",
        "'speaker_0': 'around the pet's disabilities. I've had people interested in helping to provide training in more languages than just English. So really to be a resilient community, you need input from everybody. So I've actively reached out. We have a resiliency committee in place right now.'",
        "'speaker_0': 'Mr. Biggs is one of the members on that to help us address some of those issues with our at risk population and the communities that we serve. That group has supported much of our planning and in fact we identified it, identified that we needed to reinstate the disaster council one to be in in line with the state'",
        "'speaker_0': 'of California, in the way the whole of the process works. And to also affect the the, the things that we need, such as being able to call our employees as disaster service workers and things like that. Before we continue, it's almost 1030 and we're going to need a motion to consider our remaining items.'",
        "'speaker_0': 'Six E, which is the workers comp for disaster workers and six F Alameda Theater marquee. And we need four votes to approve that. We have a motion.'",
        "'speaker_3': 'That moved.'",
        "'speaker_0': 'Second.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'All those in favor I. Motion passes unanimously. All right. So thank you on that. Now, bringing back member Ashcroft.'",
        "'speaker_2': 'Was there a question about the unanimous per your.'",
        "'speaker_0': 'Everybody.'",
        "'speaker_2': 'Nonverbal group. I'm thank you for your report Captain Oliver. And I'm mindful of the fact that your voice is leaving you as you speak. Just a quick question. You mentioned the search program, which I've been meaning to take part in.'",
        "'speaker_2': 'Can you tell us if you know when the next training will take place?'",
        "'speaker_0': 'We don't have the schedule just yet, but we're very close to producing that. We give the class four times a year that it's a course, contains seven modules and it's 21 hours of training, and we usually give two in the early part of the year, take the summer off because we don't always fill the class and then'",
        "'speaker_0': 'give to later in the fall. So we will we should have that out by the approximately the first or second week of January. For the public. They always ask us about that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'No. I'm a.'",
        "'speaker_0': 'Member.'",
        "'speaker_6': 'Thank you very much. Thank you very much, Captain, all of you, for your presentation and much appreciated. I think we have a difference of opinion, though. It seems to me that the city charter imbues the mayor and the council with certain powers when it comes to emergency situations.'",
        "'speaker_6': 'What we're talking about here in the Emergency Disaster Council isn't just a planning body, but it's a it's a body to take action during the course of some kind of a. We don't want it to ever happen to some kind of emergency.'",
        "'speaker_6': 'It seems to me, though, then, that the mayor and the vice mayor, at least two members of city council, ought to be part of the of the of the people who make up decisions, because at the end of the day, we're a democracy.'",
        "'speaker_6': 'And then the people who are elected to be the voice of the people are the council members. We don't disagree with the fact that the expertize lies with you and the city manager and your understanding and how all the processes work and the relationships with the emergency people from from beyond Alameda.'",
        "'speaker_6': 'That's that's not questioned. That's not you know, no one challenges that. But I would say, though, that that if we're going to live up to the meaning of the very first definition of of what it means to be the mayor of Alameda under Article six, Section six, dash one, that there has to be a role for the'",
        "'speaker_6': 'mayor. And it is it asked the council. He didn't ask me to make this raise, this issue. The issue, actually, that I raised way back in the EOC meeting, I think any council member or any mayor would would exercise enough judgment to recognize that they have to defer to in the in the in the moment of a'",
        "'speaker_6': 'of an emergency. They have to defer to the experts, to the people who are saving lives. So we understand that for sure. But I do believe that there are that that the council, through the mayor, has to be involved in the disaster disaster council itself.'",
        "'speaker_6': 'I don't I don't think it's I think that's there's no for me, there's no other way to interpret Section six, dash one.'",
        "'speaker_0': 'I do know that there's Section six. That's one of the charter. And as I understand it, you could take the city council could take control of the city at any time. And that's you're right. There is always the possibility that.'",
        "'speaker_0': 'The the people who work for the city would for some reason not come to work for the city. And you would you must take control of the city. That would be something you would have to do as citizens in council.'",
        "'speaker_0': 'However, we don't generally do business quite that way, and it's not to leave you out at all. I'm I'm excited that you're that you have an interest in preparing and planning that you would want to be on the council.'",
        "'speaker_0': 'The ordinance ordinance that went away by accident had the mayor as the director of the council. It can be either or. But because we do business generally where the city manager is given the day to day operations and emergency management, this alliance's.'",
        "'speaker_0': 'With that being said, the last time that council was in place and this isn't referring to you, you're very involved. Council. We never had the mayor attend any meetings. And we went through a few mayors while the council was in place and she was on back who was at the time captains on Beck was the disaster preparedness'",
        "'speaker_0': 'coordinator, and he ran the meetings. So with everything coming through the council. That's neither here nor there. But it was really more to align this ordinance with the way we operate generally and the way it's presented in the emergency operation.'",
        "'speaker_6': 'I think what I'm getting at, though, is in the moment of an emergency hire emergency, when decisions have to be made in terms of, you know, how you are going to make recommendations to deploy staff. I mean, let's say there's a even forbid something happens at the Port of Oakland, at the airport, and then at the same'",
        "'speaker_6': 'time, something happens at the at the tube on the west end of town. Certain decisions have to be made in terms of how to deploy certain limited resources. And you guys have the expertize to make the recommendation. But I think for it to be legitimate, there has to be some involvement by a representative from the city as'",
        "'speaker_6': 'elected. That's my only point.'",
        "'speaker_3': 'When it comes to disaster.'",
        "'speaker_0': 'I'd like to speak, but the rest of you, you've already had an opportunity to. I'd like to how?'",
        "'speaker_2': 'I want to respond to what Councilmember De Saag said, but I'll be happy to take my turn at that after you speak.'",
        "'speaker_0': 'And then also on the speak. That's why I wanted to speak to this, because you just shared that under the prior. Counsel if. Actually the term commission is what's been being stricken and term council count added. Was it ever referred to as a commission?'",
        "'speaker_0': 'It has always been council, yes. Okay. So. Okay. And then under the prior council document. That document is not included here. So we don't have anything we can't compare. Right. But I see as the red line version that actually just substitutes the word council for commission throughout the document that I don't have the document that you're referring'",
        "'speaker_0': 'to what it used to look like. And I think that needed to be included so that we could compare whatever especially substantive changes that are being proposed. And we don't have that information in front of us. Can. So I don't know what else is being changed.'",
        "'speaker_0': 'And it sounded like this was just an error, that it was removed and it's being brought back. But in fact, it sounds like it's being brought back with what I would call substantial changes that are not being disclosed here.'",
        "'speaker_0': 'I understand your question there. I guess the term substantial changes is one I don't know. I you know, it's maybe subjective. The change was to add the city manager is the director and the assistant city manager as the vice chair in my position as the assistant to the vice chair so we could continue to hold meetings.'",
        "'speaker_0': 'The State requested we add at least two times a year. The rest of it came out of a template from the state and it is. Almost word for word. As I remember it, what it was before. So the only change was to align it with the way we do business and what the emergency operation plan matrix for'",
        "'speaker_0': 'the emergency organization says. Okay. So I. So I would have preferred and just any time staff bring something that's coming back with changes, we need to see the original document so that we know what's being changed and the public has also has that right then to see it.'",
        "'speaker_0': 'In regards to the proposed change. I think when this issue came before us in regards to the EOC, I think that there was discussion at that time raised by member de SAC and. And the chief, there was discussion.'",
        "'speaker_0': 'I did not have the opportunity to review the tape. I don't think it was discussed in the minutes from what I could tell. But I think we did have a discussion back then that the mayor and I actually think council would be somehow included in the EOC, and that went to why we needed a larger EOC accommodate'",
        "'speaker_0': 'everyone. So I didn't have a chance to review the actual tape on that. But then we do have the charter and the charter language. And this is your. The proposal is silent, completely silent as to the languages in the charter.'",
        "'speaker_0': 'And I think that that has to be addressed, whether or not you're proposing to not. But, you know, somehow and I think there should be a legal opinion or discussion about how does this respect the charter, because we cannot change the charter.'",
        "'speaker_0': 'We as a council can't change the charter. And the charter is fair. In regards to there is a statement that the mayor takes command of police and fire departments and governs the city by proclamation whenever council determines that public danger or emergency requires such action.'",
        "'speaker_0': 'And that is not even addressed here. And I feel like that needs to be addressed because you have two documents that I think actually conflict with each other. And I don't think it is appropriate if we have an emergency, if we have a disaster, we really do need to have planned in advance who is doing what?'",
        "'speaker_0': 'What is the role of the mayor? What is the role of the city manager? If the city manager is acting as this director? And so I don't think it is appropriate to be silent. I think it is something that needs to be addressed and we need to have council weigh in.'",
        "'speaker_0': 'What is the charter provide? How does that align with what's being proposed today? So I'm not comfortable without having that issue addressed here. And then another comment is it does speak to that. The city manager, I believe, would be making the says as be appointed by the director, which then it would be the city manager under this'",
        "'speaker_0': 'with the advice and consent of city council. And I think maybe that would be nominated by the director, if that's what that is, and then confirmed by council. But it doesn't it's not real clear even what council's role is there if it comes back to council then for confirmation or what that is.'",
        "'speaker_0': 'So I, I think that that also needs to be clear how we are, how people are being appointed to be on this commission. And then in regards to the cert when it's offered, I think it'd be nice to come up with a time.'",
        "'speaker_0': 'I would also like to participate. I know Member Ashcroft has already said that when I've looked in the past, it's offered on Tuesdays, which we are never available for, and it's like four or five Tuesdays in a row is my recollection of Saturday.'",
        "'speaker_0': 'So I know we do we weeknight series twice in the year and on weekends or twice in the year. Okay, so I'd like us to be able to look at a date other than a Tuesday for it.'",
        "'speaker_2': 'I think we heard two, two weeknights and two Saturdays or two weekends.'",
        "'speaker_0': 'Right in and having it not be so we weekends. Well, I'd like to schedule something other than to see if we could roll around our instructors. So, yeah, it's not perfect and trying to accommodate counsel so those of us that are interested could participate in this training also.'",
        "'speaker_0': 'All right. Member Ashcraft.'",
        "'speaker_2': 'Thank you. I am happy to have the city attorney take a look at reconciling the language between the charter and the language of this ordinance that we are clarifying. However, I think that in a disaster, in an emergency and you just stop and think about in this country, in our state, in the world, some of the things'",
        "'speaker_2': 'that have happened recently really require our first priority has to be the safety of our citizens. I want to put that safety into the hands of trained professionals who have done this for years, who know how to respond in an emergency.'",
        "'speaker_2': 'And I am happy to take my cue and my direction from them. I think we would be doing a disservice to our citizens to say that somehow an elected mayor and council should be the ones to be giving public safety direction on how to act.'",
        "'speaker_2': 'We don't have the training. I think it takes a certain temperament also to be cool and calm in any situation, and that's what you do when you know for a living you run into burning buildings and you, you know, follow the sound of gunfire.'",
        "'speaker_2': 'We I don't think any of us has that kind of training. So if we need some clarification, I understand, you know, the city charter. But again, first and foremost, the reason we're doing this is to keep our citizens safe.'",
        "'speaker_2': 'And I think that we place that responsibility in the most capable hands.'",
        "'speaker_6': 'And I don't disagree with that. Like I said, you guys are the experts, but. Now, part of our democracy involves elected officials. And it's and it's explicit here in our charter. I think the mayor or whomever else is part of if.'",
        "'speaker_6': 'If she or he is part of the disaster council would exercise incredible discretion. And in Austin, an understanding, you know who does what. At the end of the day, yes, you run into the buildings when there's fires or heaven forbid, you know, for the police when there is violence going on.'",
        "'speaker_6': 'You guys are there. We understand that. But I think there is a role for the or a mayor in in in an emergency situation so that the experts who are making the decisions or executing the decisions understand that they've got the complete backing of of the public.'",
        "'speaker_6': 'And in emergency situation, you know, you can't obviously gather all council members to suddenly have a meeting. So that's why we have at least one person on council, and that would be the mayor. And I think that was the understanding as to why in the previous rendition of the disaster council, the mayor was involved.'",
        "'speaker_6': 'So let's not pretend like the mayor was never involved.'",
        "'speaker_0': 'Now, I don't mean to pretend that.'",
        "'speaker_6': 'In fact, I think I attended a disaster council meeting on behalf of Mayor Afzal when I was the vice mayor.'",
        "'speaker_3': 'You may have.'",
        "'speaker_0': 'I would like to point out that the emergency management plan has been adopted by the council. So that's part of why the alignment was going forward, is to get our documents in alignment. You know, the the topics you're bringing up, you know, other cities have language that's similar to what we're proposing and have emergency management plans with'",
        "'speaker_0': 'there are councils doing what I explained to you was the role that is a standard operating procedure for all the cities that I know of within the state because we work under Sams and we work in a particular way with requesting.'",
        "'speaker_0': 'But we're a charter city. And the fact is, is that this has been handled differently in the past in this city, and that was not brought to our attention before this was raised, you know, during this conversation. Vice Mayor.'",
        "'speaker_3': 'Yes, I think that's a substantive change that needs to be taken back and incorporated in this with the and my preference is that. We reconcile the this ordinance, including the language that's in the charter. And I think the charter does separate operations from policy as as a document.'",
        "'speaker_3': 'And I'd like this to go back to include that separation as part of the lead into what I consider as a good template for operational purposes. And bring it back for another first reading.'",
        "'speaker_0': 'My brother. Did you want to speak?'",
        "'speaker_5': 'Yeah, I. I'm trying to compare the two, and, you know, I don't see any conflict between the two. The charter says discussing the mayor changing a word. He or she may take command of the police and fire departments and govern the city by proclamation whenever the council determines that public danger or emergency requires some action.'",
        "'speaker_5': 'There's nothing in in this ordinance that takes away that authority.'",
        "'speaker_3': 'Or silence.'",
        "'speaker_5': 'The mayor to. Continue to do that, continue to call the council together and create a proclamation that allows her, in this case, to take over the police and fire departments. And we also put in a check in to 24 six that if the director of emergency services actually declares our proclaims a existence of a local emergency and'",
        "'speaker_5': 'or issue such a proclamation, if we're not in session that the Council has the authority to ratify the proclamation within seven days. So we do retain the authority. I'm just worried that if we have a situation like an active shooter situation where you have to mobilize, like in San Bernardino a few weeks back when the whole city'",
        "'speaker_5': 'was basically shut down, that we need to have somebody do this quickly. You know, that's not to say that, you know, once the mayor is able to arrive at the situation and or the council is able to be called together in any LC or whatever, you know, that we can't, you know, assist in that direction.'",
        "'speaker_5': 'But, you know, I think we need to be able to have emergency response as quick as possible in some of these emergencies. And we're not really taking anything away. It's just allowing the city staff that's in charge of and leads emergencies to allow to handle them right away without waiting.'",
        "'speaker_5': 'You know, and I do look at the main priority or duties of this commission is to develop emergency and mutual aid plans and agreements and ordinances and resolutions, rules, regulations, so on and so forth to implement these plans.'",
        "'speaker_5': 'So, you know, we're not turning over no control of the city, you know, to some rogue elected body. You know, we still retain authority over it. And I don't see where these two these two that the Section 6.1 of the charter is in conflict with this ordinance.'",
        "'speaker_3': 'Vice Mayor And I don't dispute that this provides the framework for doing that. In fact, in the example that you gave on the San Bernardino, there's active a just ordinary police operations are going to be expanded when when the full event is known.'",
        "'speaker_3': 'And I think that's not incompatible with what's here and what's listed in the charter as far as the declaration of an emergency and. Basically having the city council and the mayor take control per the charter in the event of a citywide disaster.'",
        "'speaker_3': 'I'm just asking that. We take the language that's in the charter and. Basically embedded. As in the appropriate section of this ordinance to make sure that that hierarchy is understood. I think that's the genesis of what Councilmember de SA brought up is that that hierarchy is proscribed in the charter and until that charters change we have to'",
        "'speaker_3': 'recognize it as the front end of the declaration of a citywide disaster.'",
        "'speaker_0': 'Well, I want to see what it used to be, because we have a we have a history of doing this. When Alpizar was mayor, he went to these meetings. There was a way it was it occurred. I'd like to see what that document provided.'",
        "'speaker_0': 'And I'd like this to be handled like we do all the time when we're making revisions. You red line, we see the old one. We see the new proposals very clear what the changes are. And I think that that needs to happen just like it normally does happen.'",
        "'speaker_0': 'I think that that should have been disclosed today. I think it's very important we have that. I think it is substantive. Who is leading this council that is substantive?'",
        "'speaker_6': 'Well, let me make sure to say, I believe that the past practice of including the mayors in the disaster council was to respect a Section six, dash one. But that being said, I think the disaster council itself, the way that it unveiled because of its, for the most part, planning nature.'",
        "'speaker_6': 'Many mayors didn't attend the meetings simply because, well, we're not subject matter experts for the most part, unless you're, you know, the former mayor of Fremont, who is a former police chief. So I think in that situation that the issue is just simply attending the meetings and and, you know, recognizing that we are, in a way, the'",
        "'speaker_6': 'fire department and and the police force are are. Quasi martial arts. So we would be the civilian body and somehow we have to reflect that. That's all I'm saying, is that they that they were the mayor was involved in the disaster council before.'",
        "'speaker_6': 'And I don't see any reason why the mayor ought not to be involved today if she or he so decides to attend the planning related meetings. Fine. But at the point in time when there is an emergency, I do see the mayor as the rallying point.'",
        "'speaker_6': 'First for the experts to come together for them, for the citizens and general to say, okay, well, that's the mayor. That's why we elected she or he to bring us to. Rally around, so to speak, during some times, obviously, that a mayor isn't going to run into a.'",
        "'speaker_6': 'Building on fire. Or, heaven forbid, if there's a violent situation, we understand that. It's not that. It's. It's. No, I think I said formidable.'",
        "'speaker_1': 'Yes. Thank you, Madam Mayor. So I just want to make a couple of clarifications. I think one of the reasons why the ordinance was not included in here is because it's not an act of ordinance. That ordinance is no longer in effect.'",
        "'speaker_1': 'But that's the reason, I think, why Captain Oliver did not include it. So we will bring it back. But that is kind of the reason why it was not we're not redlining a current ordinance. The ordinance doesn't exist right now.'",
        "'speaker_1': 'So this is a brand new ordinance, but we will bring it back. I think the other piece to remember is, you know, I think there's some discussion about, you know, back when, you know, Mayor Bizarro was here, that was a long time ago.'",
        "'speaker_1': 'We have very different standards now, as Captain Oliver said with Sims. That's a structure. That's a very technical structure. This is a technical group, the city manager. It's not not going to be me. It's going to be your director of emergency services.'",
        "'speaker_1': 'That's who needs to be directing the in coordination with the with the police and fire folks and public works. And, you know, I work with those people. The city manager will be working with those people every single day.'",
        "'speaker_1': 'And so that's part of the reason why that the city manager needs to be the director. The director has that relationship. It's a longstanding relationship. It's a stable relationship. It doesn't come and go with the elections. That's why that director needs to be the city manager.'",
        "'speaker_1': 'So I would argue that I mean, I understand that the you know, the mayor and the council obviously need to have absolute oversight of what the director does and what the council does. But that council is a day to day.'",
        "'speaker_1': 'It's a technical advisory group. They're meeting with PGE. They're meeting meeting with, you know, ECB mud with WETA. We have relationships with those folks. We work with them all the time. And so I think that's the reason that's sort of the argument of why I think we need to keep this at the at the city manager level'",
        "'speaker_1': '. However, we will bring it back. We're happy to do that and I think we're happy to embed. I don't think that would be an issue with the state to embed the charter language in, you know, just the very check.'",
        "'speaker_1': 'Yeah, I don't think that would be an issue. So it's very clear that, you know, we have this language in our charter and that the council and the mayor have this authority. But I do believe that the director needs to be the city manager who has those relationships, who are working with those organizations by day to day'",
        "'speaker_1': 'basis.'",
        "'speaker_0': 'I think we need a legal determination on that issue. Well, actually, it looks like, okay, we do have to respect this charter. We cannot as a council change the charter or the intent.'",
        "'speaker_6': 'Well, let me give you one example where there was an emergency situation and, you know, no one talks about this. But, you know, actually, Mayor Spencer did a pretty good job when we had the ruckus here in city hall several weeks ago.'",
        "'speaker_6': 'You know, she you know, a lot of people, people clamoring, yelling. And then when people when bodies were thrown around, you know, she stood out there and, you know, people respected her for that, for standing up and saying, okay, this is how we're going to go forth with the meeting.'",
        "'speaker_6': 'And things calmed down in a way that one could argue that that was a quasi emergency situation into which she stepped. And to me, that that just indicates that the natural leader is the mayor of Alameda, recognizing that the day to day functions are subject to the city manager.'",
        "'speaker_6': 'And in times of emergency, the fire department heads and the police heads. So?'",
        "'speaker_0': 'So, yeah. Do you mind if I comment on that? Excuse me. Sorry for my voice. That's why you're. You're an integral part of what we do in the emergency operations. And are you. Are you. Are you seeing the public?'",
        "'speaker_0': 'You are calming their concerns. You are the policy makers. You play an integral role. An integral role? Well, we're leaving to the professionals in the emergency operations center is the management of the boots on the ground, things that are happening in real time.'",
        "'speaker_0': 'So that that's the piece that we do. The piece that you do is calm the citizens, make decisions properly, funds, make sure that everything the city needs, they get that your citizens needs are addressed. That's that that is your role and is your role in the emergency operations center.'",
        "'speaker_0': 'The emergency operations center are not the people who are doing the response. They're managing the overall welfare of the and supporting what's going on in the field, getting their arms around what's happening through our. Response agencies, public works and police fire.'",
        "'speaker_0': 'Input from the citizens that we get in taking that all into account. Getting our collective arms around it and through stems in our mutual aid agreements, through the operational area in the chain of command, which is very strict the way we do it.'",
        "'speaker_0': 'We get resources to assist us. So this isn't to take away your authority or your ability to command the city in any way. You could take command at any time. That's what I'm clear about. The Charter City Council can take command at any time.'",
        "'speaker_0': 'This is an operational level where you put the people who have the most training and background and experience into manage the incident and everything comes through.'",
        "'speaker_3': 'You and Mr. Mayor, I think that's that's at the root of it. You mentioned what the operational side is, and I think having. This ordinance was entitled organization and creating. The Disaster Council has to have that context included in this ordinance, and I think that's what we're looking for.'",
        "'speaker_3': 'And I don't count what happened on the fourth is as particularly relevant to this. I think if we go back to when the plane crashed here in the seventies, there's an interest in video. That's I don't remember where I saw it, but it it featured the emergency response that happened with footage.'",
        "'speaker_3': 'And I think it was Mayor Lacroix. Yeah. That was prominently featured there. And it had it. He wasn't out there pulling the fire hoses and keeping people back, but he was there on the site and the council had some action.'",
        "'speaker_3': 'And I, I think that's what the charter intended. And the true operation and those operational decisions are not the council's and they're not the council's. This isn't day to day. So that's not what we're asking for. I think we're asking is to provide the context of that section of the charter.'",
        "'speaker_3': 'Two. What happens operationally when you implement this disaster council and start doing the day to day tech technical work that's needed to execute when it happens?'",
        "'speaker_0': 'I appreciate that. And where I was at 11:00, in which case we need a motion to continue beyond 11:00 on the.'",
        "'speaker_2': 'Back end.'",
        "'speaker_0': 'Of those in favor. I. I. I. Motion carries unanimously. Thank you. Member Ashcroft.'",
        "'speaker_2': 'Thank you. So I will certainly look forward to clarification language as far as taking control of the situation. I would want that to be the entire council's vote as opposed to just the mayor. And I think it's it's all well and good to look back to an incident that happened in the seventies.'",
        "'speaker_2': 'But in some ways it's quaint. I really do think that I mean, without sounding like an alarmist. The the magnitude of emergency situations that a community can face are they've risen to such a level. I mean, I do remember the term civil defense and I do remember the drills in school when we got under our desks and'",
        "'speaker_2': ', you know, covered the back of your neck and that was going to help you withstand nuclear attack or whatever it was. But we live in a different world and so on, and we all have sufficient egos that we ran for office.'",
        "'speaker_2': 'I get that. But part of our duty is to make sure that we're making good, solid decisions. And I agree with the vice mayor. The operational part is something that we as a council don't have expertize in. We can certainly as a body together direct certain policy.'",
        "'speaker_2': 'But I'm I would be very concerned if if there was very much of a departure from what you've presented to us tonight. But we'll look forward to this coming back to us with some.'",
        "'speaker_0': 'Kind of motions or.'",
        "'speaker_2': 'Just direction.'",
        "'speaker_0': 'Remember what it is you want at anything?'",
        "'speaker_5': 'Yeah, I think they're compatible. So I guess we'll come back with advise language. And then, you know, I kind of agree with the vice mayor. I mean, a fire flood, a storm epidemic. You know, as you know, however, the mayor performed during that or war or threat of war, you know, that paired two things doesn't that was'",
        "'speaker_5': 'really not a right. That was an arrest of two people.'",
        "'speaker_4': 'So I.'",
        "'speaker_6': 'I just like to end this my, my, my comments by just saying that, you know, I've always tell Chief Larry and Chief DeLong of Chief Long sorry that, you know, whatever your professional judgment is, I'll go with that, because at the end of the day, you guys are the people who are dealing with lives, people's lives, lost'",
        "'speaker_6': 'limbs. And I respect that. But. What you're getting from us is pushback. And my hope is that, you know, you take a look at it, but, you know, whatever your recommendations are. City managers, the police chiefs, the fire chiefs, and yours as the emergency person.'",
        "'speaker_6': 'You know, I'll certainly respect that. But I just wanted to make sure to say, hey, there is this 6.10, I understand.'",
        "'speaker_0': 'And I and I believe that that will all get handled. What I want to say to you, as I appreciate that you take the responsibility of planning a preparedness so, so much to heart, it is very important to have everybody see the value of it.'",
        "'speaker_0': 'We won't be prepared if we don't all work together as a community and bring in all the comments and and decisions that are made. It's it's imperative because, you know, me standing here with my person, personal background and experience can't can't make a judgment for, you know, different ethnic backgrounds and disabilities and the people who love pets'",
        "'speaker_0': 'and all the all the things that we are now required to address. It takes everybody with a commitment to making our city resilient and able to withstand anything that comes along. And the goal is to be able to stand right back up and go on with our lives.'",
        "'speaker_0': 'That's our goal. And it takes everybody working towards that to make it happen. And just one more comment. We have a resolution that comes right behind this ordinance. It was the resolution for the disaster service worker, which has got to be part of the ordinance.'",
        "'speaker_0': 'So we probably don't need to go on with that.'",
        "'speaker_2': 'That's good, because your voice is going to give out. I know.'",
        "'speaker_0': 'And I know you would vote for that. Second, sorry. So we'll defer. It's all like kind of one part. I appreciate that. Thank you very much. Thank you.'",
        "'speaker_2': 'Very much.'",
        "'speaker_0': 'In which case, then we're going to move on to six Askew.'",
        "'speaker_1': 'Update on council referral regarding Alameda Theater Marquee Lighting. That'll be Miss Potter.'"
    ]
}