{
    "Purchase and Sale Agreement for Vacant Parcel at 2350 Fifth Street.": [
        "'speaker_1': 'Great. We have item to D merit as the Ashcraft. Would you prefer a staff report or do you have some questions and comments you'd like to raise?'",
        "'speaker_0': 'Um, actually, whichever way you'd like to proceed. I have, um. I have spoken to Mr. Potter about this. Yeah. Um. Um, do you want me to the case?'",
        "'speaker_1': 'Sure. Sure. If you. If you want to read. That would be great. If you want to raise your issues. And then I, Steph Potter, can come up and address the any issues that come up.'",
        "'speaker_0': 'Okay. Thank you. So, um, my concern with this transaction is that I do understand that this is, um, we're making this decision and when you have the successor agency to the, um, the former redevelopment agency, both from the commission and so the recently amended from that doesn't apply.'",
        "'speaker_0': 'Um, there's an exception, but I still am concerned with the fact that in our city, in the Bay Area, in the state, we have a housing crisis. And I feel that we need to be working as hard as we can to of our Board of Housing.'",
        "'speaker_0': 'Um, I am actually Councilmember Abella and I will be in Sacramento on Friday for our Statewide Policy Committee on Housing, Community and Economic Development to really help identify the housing and homelessness is among their top four priorities to focus on this year.'",
        "'speaker_0': 'So I've talked with, um, my partner and my concerns are that if we get some of this, um, it's well within our right then um, is intending to build townhomes. I understand it. We'll hear more on the staff report.'",
        "'speaker_0': 'The city will get revenue of $300,000 to come back to the general fund and we can all go home. But I would like to see if this council might be able to come up with, um, maybe some more creative resolution that recognizes and addresses the need to add more affordable housing, either in this project or perhaps elsewhere'",
        "'speaker_0': 'on the island to save the point, if we don't just do a straight transaction pandering to the general fund to do whatever with um, but perhaps and I haven't had a chance to interact with any other colleagues to know how everyone else feels.'",
        "'speaker_0': 'And I'm sure we should support them. And my concern is they just can't in good conscience say, Yeah, let's just do this and make sure that the tax and agency, which is we all want the taxpayer to be paying our money.'",
        "'speaker_0': 'But I want to see because if we're if the plans were subject to the plans that you've given them, apart from me and, you know, one of the things you offered to other agencies, how did you go through that doesn't apply here.'",
        "'speaker_0': 'But I still think that the spirit of that was a good one to keep in mind. So those are my concerns. Thank you.'",
        "'speaker_1': 'Thank you. It sounded like there was an interest in hearing some feedback here, but I know that there might be some questions to my right. Do you have questions? Member Odie or would you?'",
        "'speaker_3': 'Maybe I'll wait to Ms.. Potter makes her brief presentation, then add my comments or questions.'",
        "'speaker_6': 'Thanks. Thank you very much. I'm Debbie Potter. I'm the city's community development director. And the mayor has, I think, done a good job of characterizing that item before you this evening. This is a remnant parcel. It is about 4.8 acres.'",
        "'speaker_6': 'And actually the developable footprint of the parcels, even smaller. It's more like two thirds of an acre just because of its irregular shape. It is a remnant piece. It was a redevelopment agency owned under state law. When redevelopment agencies were dissolved in 2012, we had a mandate.'",
        "'speaker_6': 'Successor agencies have a very narrow mandate, and that mandate is to pay for enforceable obligations that are listed on the recognized obligation payment schedule. Another item you just approved this evening and to dispose of. Property that was previously owned by the redevelopment agency.'",
        "'speaker_6': 'When we dispose of property, we do it consistent with a long range property management plan. That long range property management plan, like everything else that is done by a successor agency, must be approved by the state of California.'",
        "'speaker_6': 'The State Department of Finance is the agency that oversees all of the successor agency related activities. We have an approved long range property management plan that was approved in 2015 by D, o, f. And our disposition strategy for this piece of property is to put it on the open market.'",
        "'speaker_6': 'And we have a mandate under state law to sell it as quickly as possible for as much money as we can get, as quickly as we can. And then the way the proceeds work from the land sales, from successor agency property is that they are dispersed among all the taxing entities on a pro-rata share based on the'",
        "'speaker_6': 'share of property taxes for all the taxing entities. So the city gets as a taxing entity, we receive about 30% of any land sale proceeds we have. And that and I believe the Surplus Lands Act was also talked about.'",
        "'speaker_6': 'That's a new law that went into effect January 1st and the law explicitly provides that land to be disposed of by the successor agency. Successor agencies have until December 31st of 2020 to enter into legally binding sales agreements.'",
        "'speaker_6': 'And if you enter into your legally binding sales agreement before December 31st, 2020, and you dispose of the property by December 31st of 2022, then the Surplus Lands Act does not apply to the successor agency. And I believe that was intentional on the part of the state legislature because there is a maybe you could call it a'",
        "'speaker_6': 'competing state mandate to dispose of surplus property in a different manner that property owned by successor agencies. So what's before the council this evening is a purchase and sale agreement by Brand, a development company to purchase the property for $1,000,000.'",
        "'speaker_6': 'The 300,000 that would come to the city is the 30% of the million dollars to build residential a residential project. And on two thirds of an acre at this time, I believe Brown is thinking that they could get 20 to 22 units on that on that that property.'",
        "'speaker_6': 'The property is not served by any backbone infrastructure. So the developer has to have the expertize to bring the backbone infrastructure to the property. As you know, the city of Alameda has an inclusionary housing ordinance, so we have a 15% inclusionary requirement for all residential development in excess of nine units.'",
        "'speaker_6': 'And this project would require an exemption from the measure, a requirement so it would have to provide apply for a density bonus ordinance. And if you apply for a density bonus ordinance, you were then obligated to provide more affordable units above the mandated 15%.'",
        "'speaker_6': 'So if this project goes forward, if the project secures its residential entitlements, there will be an affordable component to the project and it will be a minimum of 15%. And then depending on the purchasers application, there will you know, that the additional could range from, you know, 1% more if you provide another very low income, you know'",
        "'speaker_6': ', 1% more, very low to several percentage more affordable units if you do more moderate income units. So that's a kind of a high level overview of how this would work if a residential project were to move forward and then the land sale proceeds as a taxing entity.'",
        "'speaker_6': 'The land sale proceeds do go into the city's general fund. Those proceeds are are there for the council to make a policy decision about how it might want to expend those land sale proceeds.'",
        "'speaker_1': 'Okay. Thank you. Councilmember Design.'",
        "'speaker_7': 'Quick question. Thank you very much for your presentation. A quick question is, does the housing overlay that was adopted in 2012, I believe, is this included within that or is it outside of it?'",
        "'speaker_6': 'No, this is not there's not an MF overlay on this piece of property. This piece of property, because it was a remnant parcel as part of the Bay Port Alameda Landing project. It actually doesn't have any underlying zoning.'",
        "'speaker_6': 'And that's why we would the prospective purchaser would go through the entitlement process. And part of what would happen with the entitlement process is there would be a zoning amendment and that zoning amendment. Make its way to city council for its final approval.'",
        "'speaker_6': 'I'm with the successor agency tonight. A successor agency would be acting in your proprietary capacity as the property owner. And then later any zoning amendment would come before the city council and with its regulatory hat on. But I think that staff, as well as the prospective purchaser, is going to think, okay, if there is a willingness to'",
        "'speaker_6': 'sell for the for the project, describe that ultimately that entitlement process will then will then happen.'",
        "'speaker_7': 'So one more quick question if it's okay. So you you used a phrase, an exception from Measure A, the I, I mean, outside of the multifamily overlay, which was adopted and so which has been in practical effect. I'm not aware of some kind of exception that well.'",
        "'speaker_6': 'The city has had its density.'",
        "'speaker_7': 'The density bonus rates.'",
        "'speaker_6': 'Which is why they would go for a concession waiver and then they in exchange for that concession or waiver, they then are obligated to do more affordable housing. So that's the the trade off for the exchange.'",
        "'speaker_7': 'Okay.'",
        "'speaker_6': 'Public benefit.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember City.'",
        "'speaker_3': 'Thank you. Thank you, Miss Potter, for the presentation. Just as a first comment, I agree with everything the mayor said. I had the same concerns. I think we had this discussion, I don't know, six or eight months ago and there was an office building proposed and a lot of us said we'd rather have housing.'",
        "'speaker_3': 'So it's not zoned.'",
        "'speaker_6': 'You a.'",
        "'speaker_3': 'Thank you, but. So I guess my one question is, if it's not zoned anything now, I mean, could they look at this and say a year from now we don't think we can put housing on there and then change it?'",
        "'speaker_6': 'Well, the purchase and sale agreement specifies a residential use.'",
        "'speaker_3': 'Okay. And then trying to do the math, I can do 15% of 20, but I can't do 1% to some other numbers. So, I mean, what are we looking at realistically? Is it three? Is it five? I mean.'",
        "'speaker_6': 'Affordable housing at 15%, a 20 unit project would have a 3% inclusionary. A 22 unit project would have a 3.3. And I believe we round down if it's less than point five and round up if it's more than point five and at 25%, at 25%, inclusionary for example, would be five units on a 20 unit project and'",
        "'speaker_6': 'six units on a 22 unit project. So we're talking because it's a very small project. It's a very small lot. It's 27, just under 28,000 square feet, the lot itself. So it's the difference of, you know, maybe two or three units.'",
        "'speaker_6': 'Okay. That's the range between 15 and 25%.'",
        "'speaker_3': 'Okay. And I just want to echo the mayor's point also. I mean, I appreciate you bringing us a residential project. And even though this is exempt from surplus lands, I think our guiding policy should be the guiding policy behind the surplus lands, which is to provide more affordable housing wherever we can.'",
        "'speaker_3': 'So I'm just going to use my time to say that.'",
        "'speaker_1': 'Okay. Any further questions? We have no speakers. Um, I think you answered the question. I suppose you came and asked us to support an office building a year ago, right? Well, it was. I think it was January 2nd of last year.'",
        "'speaker_1': 'Yes, it was. Right. So a long time ago. And we and we asked that that deal obviously fell apart because we actually said that we would prefer to be housing, but approve that. So here we are back again moving this forward.'",
        "'speaker_1': 'Is there a way for us to use this money that's coming into the city as a part of it? I certainly support Councilmember Ody and mayor is Ashcroft's interest in providing more affordable housing and would there be a way for us to at least consider as part of a cycle or whatever else, you know, how we could'",
        "'speaker_1': 'use these funds, as I think the mayor said at Alameda Point or something like that in support of providing further homes. Is there a way in this process? I since we're acting as the successor commission committee, I'm not sure if we can actually.'",
        "'speaker_1': 'I guess I'm looking at the city attorney, but let me look at you first. Is there a way for us to kind of enact some guidance that doesn't necessarily today commit something? So, um, a mr. Vice Mayor, I believe the Council can give brief direction that the proceeds ought to be considered for affordable housing, but the details'",
        "'speaker_1': 'should be left for an agenda as future meeting. Okay. And and to the comments about affordable housing, did anybody talk with the housing authority or because the city saw the guidance as achieving the highest price possible? No, that wasn't a part of that conversation.'",
        "'speaker_6': 'The housing authority as an entity could have offered to purchase the property when it was listed for sale. It was you know, we we retained our commercial broker to list the property and to then, you know, review and analyze offers.'",
        "'speaker_6': 'The housing authority did did not indicate an interest in the property. That's not to say if a project goes forward, they may not have an interest in working on the the affordable component of if it's for, say, the units, if it's a for sale project product, they may be interested potentially in purchasing those and renting them or'",
        "'speaker_6': 'that kind of, you know, they're we've done that's what that's a model that was used for the Mulberry, right. Where the housing authority purchased those affordable units.'",
        "'speaker_1': 'Okay. But I guess my question was, do you know if we proactively talked to them about the fact that this was going to market for their consideration?'",
        "'speaker_6': 'A broker did walk in. And I'm just going to ask. So, Andrew, I don't. And actually we are so fortunate to have the director of development for the Housing Authority here. Kathleen, did you guys look at that at this parcel?'",
        "'speaker_0': 'I personally did not get it okay for the last year. I didn't hear what the response said.'",
        "'speaker_1': 'The response from the Housing Authority staff was that they do not know. They do not remember looking at the property.'",
        "'speaker_0': 'Okay. Okay. When you're done, I'd like to have a look.'",
        "'speaker_1': 'Please feel free. I'm done.'",
        "'speaker_0': 'Yeah. Okay. Um, so what? I'm wondering. I understand that there are representative from Brianna and all the things just down to the city. To me, some town council might actually to some direction to staff. But what is the, um, the thing that they would rather be willing to do a higher percentage of affordable units and there's some'",
        "'speaker_0': 'way that could happen. And out in Alameda Point, there are also projects that could probably some assistance. So some maybe that's as specific as we can get without making the city attorney nervous on what to do with the property.'",
        "'speaker_0': 'And those are the kinds of things about the city council.'",
        "'speaker_1': 'With Councilmember Abella.'",
        "'speaker_4': 'Madame Mayor, just to try to understand what you're asking, you're asking either that we advise that or give direction that we would like the proceeds to perhaps be spent on affordable housing in some way or in the alternative to have staff go back and negotiate that in in lieu of the proceeds, there be additional affordable housing included'",
        "'speaker_4': 'in this proposed project.'",
        "'speaker_0': 'I don't know what it is in lieu of the trophy that is bringing her to do the project. And, you know, maybe it would involve a different purchase price. I'm not negotiating this one, but I could put more affordable units there because again, harkening back to what Councilmember Owens, thank you for being my friend, but it is'",
        "'speaker_0': 'the spirit of Mr. Platforms. After I would like to see if keep in mind and so there are cities and towns in the rebellion and I sit on the same housing policies. We know that around the state, the city that is still open to affordable housing developers, which just make the process of it more affordable to build'",
        "'speaker_0': 'because of the high cost of land in California. But again, I do understand that this is an it may be land in our city, but it's not a from the property of the maybe there is an opportunity to keep on the land that I haven't really consider what exactly I want to see for what I think that'",
        "'speaker_0': 'I don't want to see that are going to go from the land transaction to go back in time. So I can I can entertain a lot of creative solutions that we are at the moment, but I would like to accomplish, which is more affordable housing and whether that's for sale or for something, I can decide.'",
        "'speaker_1': 'Okay. Councilmember de SAC.'",
        "'speaker_7': 'Yeah. Thank you. Two strands of thought. The first my first strand of thought is the mayor seems enthusiastic about this parcel for good reason, because there are so few, you know, parcels that we can actually that are available that we own.'",
        "'speaker_7': 'We own it. Right.'",
        "'speaker_6': 'That's our agency. We are. This is.'",
        "'speaker_0': 'A success.'",
        "'speaker_6': 'Just to clarify, one thing is that the successor agency cannot donate this land that's outside of the legal constraints under which successor agencies have to share property.'",
        "'speaker_7': 'So I think the enthusiasm that the mayor is expressing, along with the support of Councilmember Ody. So my first strand of thought is just to take the time to maybe create a subcommittee where they can put their ideas to work with staff and to see where where things can align with what Brian Branagh is seeking or not'",
        "'speaker_7': '. Maybe one in line, but but I think maybe we should take the time to vet those ideas that either Councilmember Odie or or Mayor Ashcraft has about this parcel site. I don't see any reason to rush. I'm granted I know that there is the December 2020 timeline that you said.'",
        "'speaker_7': 'So that's the first round of thought that that would be my druthers. The second strand of thought is. I thought that the density bonus only kicks in within the context of the housing overlay. So that's what I thought.'",
        "'speaker_7': 'So. So I do have some concerns about not being consistent with Measure A, our 1973 charter. But I think realistically that's an issue that's down the line that ought not to hold up any kind of decisions that we make tonight.'",
        "'speaker_7': 'But I do want to at least put that out there. So those are my two thoughts.'",
        "'speaker_3': 'Councilmember Odie, thank you. I guess my comment and the on the proceeds, I mean, we could just say when will we actually get them? Because I think it's a 15 month escrow and it probably will take 15 months.'",
        "'speaker_3': 'Right. So that staff comes back to us when we get that, doesn't spend it until we have a hearing on and what we want to do with it. That way we're not earmarking it today, but at least we're saying don't spend it.'",
        "'speaker_3': 'So and I do wonder if there's more because like three really isn't enough for me. So, I mean, I know it's kind of fuzzy, but.'",
        "'speaker_6': 'Right. Well, part of the challenge is that it's a very it's 28,000 square. It's a very small parcel. So it's not it's not as if you can do, you know, 40, 50 units on that on that parcel.'",
        "'speaker_3': 'Right. But we could have five or eight or something. I mean, it's just.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_3': 'I mean if it's 25%, that could be five.'",
        "'speaker_6': 'That's correct. And yes. And if it's a 22 unit, it could be six. That's. That's right. Versus the three. So those are the trade offs. Is it is it I guess some of the trade offs may be is it more sort of more effective if the project goes forward as as sort of a market rate project with'",
        "'speaker_6': 'a 15% inclusionary plus whatever additional inclusionary is a function of the density bonus. And then the earmarked dollars can go to something like Reshape or another project that may need a little bit of a catalyst to move forward.'",
        "'speaker_6': 'And that's a 100%, 267 unit project. So. Or do you want to spend that time looking at exacting, you know, three or four more units? I mean, that I guess that's that's one way of looking at it potentially.'",
        "'speaker_0': 'Well, I have a chance to speak whenever possible.'",
        "'speaker_1': 'But. Yeah, go ahead.'",
        "'speaker_3': 'I'm not done with. Sorry. I mean, I can say I am done with my.'",
        "'speaker_1': 'Thank you. Okay, Mayor, as you Ashcraft.'",
        "'speaker_3': 'For now.'",
        "'speaker_0': 'I'm sorry. They want to.'",
        "'speaker_1': 'Know you didn't.'",
        "'speaker_0': 'Want to figure out the size of the property. It is 35,730 square feet. It would have been if the property fell onto the strip of land with an exception of size. But that was because of what I've seen so far 45000 to 56000 square feet, even a small amount, you know, a couple dozen housing units is bearing'",
        "'speaker_0': 'in mind. One thing is, if we're really well positioned to make a decision on the sale tonight, if it might make sense to have a subcommittee, I know you're over on the part of the staff of what some of the possibilities are to preserve the baby in the sale, something on and on.'",
        "'speaker_0': 'And come back to you with for any decision on how that money is to be spent. Maybe that's going to need to be fine. But I wonder whether we wouldn't mind a little more information on which to base an informed decision before home?'",
        "'speaker_0': 'That would be an enormous overlay because I think there's a range of possible options, both on an infinite number of.'",
        "'speaker_1': 'Okay. Thank you, Councilmember Vella.'",
        "'speaker_4': 'I was just going to ask what a delay in this would mean. And in terms of the timeline, we have a housing shortage I'm all for. I would like to get as much affordable housing as possible, and I think that that's been an articulated goal of this council.'",
        "'speaker_4': 'I'm also, I guess, wondering what you know, is it possible to delay this? And if we do what? At what cost? So does it does it delay the project? Does it delay us getting these units? Does it delay us getting those three affordable units?'",
        "'speaker_4': 'Can you speak on that at all?'",
        "'speaker_6': 'Yes, it would be a delay because. The way the purchase and sale agreement is set up. It's a 90 day due diligence period. So, I mean, one way to approach this, if the Council is interested in moving forward, you will know within three months whether or not the brand elects to move forward with the entitlement process.'",
        "'speaker_6': 'So there's the possibility of moving forward knowing that. And I also should say that Lisa Howard, who's the VP of development from Brianna, is here tonight and she had an opportunity to chat with her. Can you just raise your hand?'",
        "'speaker_6': 'And she has indicated that they are open to explore. You know, they're willing to evaluate and look at, you know, a range of proposals. They always evaluate properties for both for sale and for rental and then make their decision.'",
        "'speaker_6': 'They're leaning towards for sale on the at this property. Mm hmm. But they have a 90 day due diligence period. At the end of 90 days, they'll know whether they're electing to go forward. So there's an opportunity potentially to come back in 90 days based on discussions with, you know, to include looking at the affordable housing issue'",
        "'speaker_6': 'as part of the due diligence period. And and then come back before, you know, whether or not they elect to move forward is one way of going. The other way is to just indicate that the council is not prepared to go forward this evening and, you know, not go forward.'",
        "'speaker_4': 'Can we hear also from our city attorney?'",
        "'speaker_1': 'So the due diligence period that the community development director is correct, the developer has a 90 day period to engage in due diligence. But if the city does not, so if the council approves the agreement tonight, it will be at the developer's.'",
        "'speaker_3': 'Discretion.'",
        "'speaker_1': 'Discretion to proceed or not proceed at that time, at the end of the 90 day period.'",
        "'speaker_6': 'However, if the Council gave direction to revise the purchase and sale agreement and Brianna was.'",
        "'speaker_5': 'Agreeable or agreeable. Sure.'",
        "'speaker_6': 'That we could do. Yeah.'",
        "'speaker_1': 'Sure. The Council could direct that we modify so that the diligence period is a 90 day cancelation for both sides and instead of just the developer. Yeah. I guess my question would be. Sorry. Our city manager is a good one.'",
        "'speaker_1': 'I was just going to say, if the developer. That sounds like something that would meet everybody's needs. If the developer was amenable to that. I don't know if there.'",
        "'speaker_4': 'Hey there. Excuse me. I'm Lisa Villa with Brianna Land. I am not. I am, fortunately.'",
        "'speaker_5': 'Would have to have that.'",
        "'speaker_4': 'Run by our owners. So I'm not able to say that. I will say during that 90 day due diligence, we do a pretty in-depth due diligence. So not just looking at, you know, we're going to look at all the utilities, which there are none.'",
        "'speaker_4': 'So I have to figure out how we're getting them. We look at, you know, the environmental everything down to architecture and land planning. And at that point, we really are deciding what, you know, what level of affordability. So whether it's moderate, very low, low, and we're weighing the options in terms of how many units for each of'",
        "'speaker_4': 'those really fits best in the project. Same with density level of density type of project. So townhome versus, you know, apartments, all of.'",
        "'speaker_5': 'That sort of thing.'",
        "'speaker_4': 'So during that 90 days, we are really dialed in and focused and we're also happy to meet with any council members, planners, all of that. During that time, we'd probably be hoping to do at least a pre-application with the city's planning department during that time as well.'",
        "'speaker_1': 'Thank you. So my comments really quick and then you know where you're from. The last time we talked about this property, I think that there is this myth in our in our community that you just say, oh, let's build some housing.'",
        "'speaker_1': 'And somebody comes in and says, we'll build housing and it gets built. We've gone around for a year now on West Midway for some of the most important affordable housing. I think, you know, projects we have and we can't seem to figure out how to make that happen.'",
        "'speaker_1': 'So I'm a little nervous if we have somebody who seems to know what they're doing and is interested in moving forward and can build, you know, and albeit 3 to 5 to six units, I think with with some sort of encouragement, although I know we can't like try to make commitments tonight, you know, with the encouragement to'",
        "'speaker_1': ', to get those affordable numbers up as high. I think personally I would be ready to move forward on this. I if we were for me, if it was a much bigger project or we could, you know, we were talking about the ability to build 100 units or something like that.'",
        "'speaker_1': 'I think I would be more willing to to hold back. I feel like, you know, we already have a housing authority that's trying to find money for the north housing projects that we can't find. And I'm not clear on how we're going to get from a market based affordable and affordable units that are built by the market'",
        "'speaker_1': '. How are we going to get from something that's more subsidized without funding that we're then going to be competing against possibly two other if not three other major projects in the city? And so I worry that we're I'm very on board with with Mayor Ashcraft and Councilmember Otis, you know, interest in trying to do this.'",
        "'speaker_1': 'But I worry that that if we delay again, we're just putting off something that's I don't see what the way forward is.'",
        "'speaker_6': 'So if I might just. Okay. And to Councilmember Vela's point, it is true that this project could happen most likely much more quickly than an affordable housing project because of the, you know, many different funds that you need to cobble together and the rounds that you need to be part of.'",
        "'speaker_6': 'And the whole idea, I think, is valid about competing against ourselves in our jurisdiction for multiple affordable housing projects. And I think that the scale of this is an important piece, the scale and the constraints that we have as the successor agency in terms of how we dispose of property.'",
        "'speaker_6': 'And we have a very sort of narrow path forward for disposing of property as the successor agency that perhaps it's not the most ideal site because you don't it just is not going to yield a lot of units.'",
        "'speaker_6': 'I, I believe Councilmember ody.'",
        "'speaker_3': 'I guess I was going to suggest something that kind of melded the two ideas together. I don't know if this is even possible, but, you know, if they could get their due diligence done in 60 days but not start it for 30 days and not pay their deposit for 30 days, then maybe we can use that 30'",
        "'speaker_3': 'days to do what the mayor was talking about in her comments. I don't know, just an idea that way doesn't delay it, but I don't know.'",
        "'speaker_1': 'I mean, look looked at the city manager. I said I'd.'",
        "'speaker_8': 'Recommend the council go one or two directions. Either you just delay this decision probably for 30 days to 60. Yeah, maybe 60 days. That's fine to either February or March. And then we can explore the different ideas have come up or two.'",
        "'speaker_8': 'You could go with the idea that Debby approve approached and that is you approve the project or you approve the agreement. And then with the intent that you'll set aside the money for affordable housing, whether it be for another project or.'",
        "'speaker_8': 'Or you could use it to incentivize them to do more units, and that could be done later on in the negotiation. I would recommend you do one of those two options.'",
        "'speaker_1': 'I agree. Councilmember de.'",
        "'speaker_7': 'SAC. Since the options were laid out as such, I would encourage delaying the project and in the intervening days allow a subcommittee headed perhaps by the mayor and council member Ody to vet different approaches and getting the professional responses to their ideas from staff or from the developer.'",
        "'speaker_7': 'And if it doesn't work, then, then, then I think those council members are rational enough to say, okay, we, we had some great ideas and maybe they don't work, but maybe they do work. Some of the ideas that they have do work, but they require some kind of tradeoffs, which then they will have to mull among themselves'",
        "'speaker_7': 'and report back to the city council. So, for example, maybe the trade offs is instead of that $300,000 that we're supposed to get, maybe we're getting something less than that as a result of of wanting a different scenario than was being contemplated here.'",
        "'speaker_7': 'But at least by having that delay and having a committee subcommittee in place, it allows this process to be council driven. And let me make sure to say, though, that if we are to delay that we would have to work within the context of the players who we have right now.'",
        "'speaker_7': 'In other words, we're not going to delay and open up an RFP process or an RFP process because that's not going to work. With regards to the December 2020 timeline, I suspect, but if we're going to delay, you know, it's possible that we can work.'",
        "'speaker_7': 'And, you know, at the end of the day, it seems to me the the project would be that much more better and everyone will be so much more enthused about it. If if we had, you know, you know, obviously, the mayor, as he Ashcraft, along with Councilmember Melia, they've been very involved in housing issues.'",
        "'speaker_7': 'And we see many other mayors across the East Bay in the San Francisco Bay area taking taking critical responses to the crisis that we have now. And maybe this is an opportunity for our mayor to showcase an interesting project that she's pursuing.'",
        "'speaker_7': 'So I think we should just go ahead and delay and work it out. You know, the old saying, measure twice, cut once. So it's. So that would be my encouragement to delay for 30 days at the end point of which we will have a report back from the subcommittee working with staff and and and the the party'",
        "'speaker_7': 'who's interested in in the property and and we'll make a decision in 30 days. But between now and the 30 days we will have, they will all the party interested party will have vetted the issues and concerns and and see what is reasonable.'",
        "'speaker_7': 'And so that.'",
        "'speaker_1': 'Is that a motion.'",
        "'speaker_7': 'That's a motion.'",
        "'speaker_3': 'Can I go in to hear the mayor's thoughts on that before I.'",
        "'speaker_1': 'Want to say then we can if somebody would like to speak on the motion, we can discuss the motion or else it dies for lack of a second.'",
        "'speaker_0': 'I'll. Okay.'",
        "'speaker_1': 'Councilmember Vela.'",
        "'speaker_4': 'So I. I just I think that we also have a lot of people who are unhoused right now and we have a lot of people facing housing insecurity right now. And I would hate for us to delay in order to, you know, delay on this project, which potentially could mean 22 units, potentially means three affordable units of'",
        "'speaker_4': 'of housing. And I would I think all of us have a finite amount of time so to staff. And I think that there is a bigger conversation that perhaps we need to have looking at the list of all of our properties that are potentially at play for some of these, you know, in terms of addressing a council'",
        "'speaker_4': 'perspective or process that we want to have to get more affordable housing and to kind of address the the impact of the Surplus Lands Act and and also any other parcels that we have that could potentially be used to get affordable housing.'",
        "'speaker_4': 'I just I want to be cautious of kind of over politicking. And on this small parcel where there is a finite number of units essentially that really can feasibly be built without having like a ten storey tower of you want two units next to each other or something like that.'",
        "'speaker_4': 'That's an exaggeration. It's not going to happen. But but essentially, I and I also want to acknowledge the fact that getting $300,000 is not going to even account for us constructing one affordable housing unit. We all know that the cost of affordable housing in terms of building it, even if the land is free, is much higher than'",
        "'speaker_4': 'that, especially when we have to do all of the utilities and everything else. So I if we are going to have a subcommittee, I would almost rather have it be about the broader issue in the broader conversation or even having another staff report coming back about.'",
        "'speaker_4': 'And I know staff is working on it, the impact of the surplus housing land and then doing an inventory of the parcels that we do have and what we can do to add to our affordable housing stock. So that would be my inclination would be to go with the city managers.'",
        "'speaker_4': 'I think it was a second option, but but having a more robust conversation, looking forward at these other parcels that we have because there have been other parcels that we sold in previous years that now looking back and looking at the conversations that are happening both at the state and local level and could have potentially been developed'",
        "'speaker_4': 'into affordable housing projects. And now that opportunity has passed. So I don't want to lose those opportunities, but I'm kind of a little worried about potentially to the vice mayor's point undermining this specific project when we could get these units.'",
        "'speaker_4': 'I know it's not a lot. I know it's I know even six units of affordable housing isn't a lot and isn't going to solve our problems. But if it means that we could actually get those units sooner rather than later, I think that that makes a difference.'",
        "'speaker_1': 'Okay. Yeah, hold on. I just want to ask the city attorney one question in terms of direction that we were to give to staff would if we were to move forward with not the motion, but the other motion to move forward.'",
        "'speaker_1': 'This could we also appoint a subcommittee to work with the developer during the 90 days to outline kind of to to kind of help shape that? Or would that be getting into the design review side of things, which is in a part of this body?'",
        "'speaker_1': 'It would be unclear to me what the subcommittee would be doing in those 90 days if the council approves this project and the project essentially goes forward with the developer doing due diligence and the city has no real further diligence to do so, it's not clear that what that committee subcommittee where they will be coming back for'",
        "'speaker_1': 'zoning, that we will not be required to approve. And so therefore part of the due diligence might be understanding whether or not they what the city is looking for in terms of the use of the project, so that when they come back for the zoning, they at least know that there's been two members of the council they've'",
        "'speaker_1': 'worked with to kind of ensure that it meets what I hear, at least a good majority of the voices here saying they'd like to see our project because the zoning decision is a quasi judicial decision. I would advise the Council to not act outside of its regular process of having the full council hear the process, judicial action'",
        "'speaker_1': 'in front of the council with public comment. That's good. Thank you. Okay. Mayor Mary's Ashcraft.'",
        "'speaker_0': 'Okay. I like Tony's proposal, and I think I can also address Councilmember Bell. Continue on, but then have people to. I don't think that a 30 day delay is going to be that significant in the grand scheme of things.'",
        "'speaker_0': 'But I think it does give us time to look at the various options, which could also be looking at the process to get more affordable housing. But I think it's a reasonable approach to take at this time because I don't think I hear the majority of us saying, Yeah, we want it just fine.'",
        "'speaker_0': 'I'll just say Go for it and we'll figure out what to do with the 300,000. I think we can look at all of the things that were raised tonight and do it in 30 days and work with that.'",
        "'speaker_0': 'And also, as far as the voting has presented, I think they can get the residential zoning. So I don't feel they were holding that over their head. At the end of the day, I do think a 30 day hiatus in which time a subcommittee I'd be happy to be a part of, works diligently with staff, with the'",
        "'speaker_0': 'developers and comes back to the council.'",
        "'speaker_1': 'Okay, thank you. I Councilmember Odie had some comments. I'm just going to your time. Got just hit zero. So you were perfectly timed. Um, Councilman Brody, I.'",
        "'speaker_3': 'Think she can have a minute of mine or two. I still have, what, 7 minutes? And since she said everything I was going to say, I should get take half of her time. So this is a three vote or four vote.'",
        "'speaker_6': 'Three three vote, the successor agency and not the city. Interesting.'",
        "'speaker_3': 'And then the so that the proposed delay, if we adopt this motion is 60 days 38. What what are we talking here?'",
        "'speaker_6': 'Say it's going if.'",
        "'speaker_8': 'I could recommend 60 days.'",
        "'speaker_6': 'Because yeah the stop just for staff to do it staff report in on times is a minimum of 60 days.'",
        "'speaker_3': 'I mean I really want more than three. But.'",
        "'speaker_6': 'We hear you and I just ran. A representative is here this evening, too. All right.'",
        "'speaker_1': 'I'm just through the chair. Please. I'm sorry. No, no. You were speaking.'",
        "'speaker_3': 'Here I am thinking and speaking at the same time, which is always dangerous. But, you know, I don't know if I want to wait two months.'",
        "'speaker_1': 'Can I ask you a question? Sure of you. So so I guess my question is, I'm not it's unclear to me what we are going to beyond the let's get together and talk generally try to figure out how to get more.'",
        "'speaker_1': 'It is unclear to me what the path to more affordable housing is short of going to the housing authority and saying, hey, will you help us find money to to take on this project at a time when they're trying to take on multiple other projects to fund?'",
        "'speaker_1': 'So that if I thought there was a path there, I'd be very excited about this. But delaying 60 or possibly more. But let's go with 60 days. It's unclear to me what's going to come out of those those that discussion.'",
        "'speaker_1': 'And it would make me.'",
        "'speaker_0': 'The happiest audience and the only developer.'",
        "'speaker_1': 'I understand that.'",
        "'speaker_3': 'I mean, some I mean, to me, I would say more clarity on, you know, how many units are going to be and how many are going to be affordable. But, I mean, are we willing to kill this if it's just 20 in three?'",
        "'speaker_3': 'I mean, that's the question. And if we're not, then.'",
        "'speaker_1': 'Councilmember Daza.'",
        "'speaker_7': 'Just quickly to me, I think I really don't think a 60 day delay is required. I think the reason why I think 30 days is required is because out of the conversation, what I'm really looking for is mayor as he Ashcraft and council member Ody to sit down, talk with staff and talk with Branagh to figure out'",
        "'speaker_7': ', okay, this is my idea rather than three, I want six affordable units. What is required to make that happen? Do we have the resources? What would be the trade offs? I don't. You know, I think if within the 30 days, I think council members and staff could come back with they don't have to have a specific contract'",
        "'speaker_7': ', but they can come back with some kind of plan that says, okay, we.'",
        "'speaker_6': 'Get it completely agree that staff could have that conversation with the subcommittee. But at the end of those 30 days, we have to produce a staff report and get on the OIC to come back to council, and that is at least another 30 days, if not more, because the staff report has to be written.'",
        "'speaker_6': 'And then we have an internal process to get before you again.'",
        "'speaker_8': 'Get it put in perspective. I think the February 18th agenda reports are due. Are that this week, Laura. Yeah. So they're already due for a February 18th, which is 30 days out. Right.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'So I'm sorry. And then council member Odie.'",
        "'speaker_4': 'Well.'",
        "'speaker_1': 'Council member Odie.'",
        "'speaker_3': 'Okay. So if we do that, just hypothetically, we go through this exercise and then they say there's no way we can feasibly do more than our 15% or for whatever it turns out to be, you know, then are we prepared to say we're going to walk?'",
        "'speaker_3': 'I mean, that's the thing. If we're not prepared to say we're going to walk, then. I don't understand the point of delaying.'",
        "'speaker_1': 'Right. Councilmember Bello.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_3': 'I'm not prepared to walk from this if I can't get more than three. I want more than three, but I will take three.'",
        "'speaker_9': 'Yeah, I.'",
        "'speaker_4': 'I think my that's that's my concern. And then we're adding potentially not just the delay, but adding additional costs or whatever, if they have to if we have to redo anything in order to get there. I. I think again, what I would like to see is I think that this whole council needs to review kind of the'",
        "'speaker_4': 'impact of the Surplus Lands Act. This whole council needs to see what lands there is, and perhaps that's where we have the broader discussion about how we go about getting more affordable housing. I think it's been stated very clearly stated goal of this council to get more affordable housing.'",
        "'speaker_4': 'And I don't know that this is the parcel where and this is the project where a 60 day delay is going to help us really chip away at that goal in a meaningful way. And I do think that it's a council conversation that needs to be had.'",
        "'speaker_4': 'Talking about the impact, looking at all of the parcels and seeing if there is perhaps another opportunity that we could partner with somebody. Maybe it's not the housing authority, maybe it's somebody else to get additional affordable housing units.'",
        "'speaker_4': 'But I would like us to spend our resources in that capacity as well as staff's resources, because I think that that will allow us to get more of the solution that we're trying to to find.'",
        "'speaker_1': 'Okay? Yeah. So I would agree. But we have a motion and a second on the table. I have to admit with it's not Robert's rules. It's do we do we do substitute motions? Yes. So the council has to.'",
        "'speaker_1': 'Currently, there are no substitute motions on on the table. So the council could call the question on the main motion, no hearing, no subsidy motions. I will call a vote on the main question. Roll call. Yes.'",
        "'speaker_7': 'I think the motion actually specifies 30 days, but out of deference to what the city manager said. 60 days. Okay.'",
        "'speaker_1': 'And is that okay with you, Madam Chair?'",
        "'speaker_0': 'It is.'",
        "'speaker_1': 'Okay. So roll call votes.'",
        "'speaker_2': 'Councilmember De Sang. Oh.'",
        "'speaker_3': 'No.'",
        "'speaker_4': 'No.'",
        "'speaker_2': 'Not Slate. No Mayor as the.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'That fails 2 to 3.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Councilmember I make my guess not. It's not a substitute because there's nothing pending but approve the item. But with the idea that Councilmember Vela raised to have this other subcommittee created to talk about an overall affordable housing plan.'",
        "'speaker_3': 'And, you know, I prefer the mayor and her, to be honest, since they're on the League of Cities, but I don't really care who's on it because I trust any one of you guys to come up with a, um, effective report.'",
        "'speaker_1': 'Okay. Would your motion include direction to look to use the proceeds?'",
        "'speaker_3': 'Well, I'd prefer just not to bring the the distribution of the proceeds back to the council when we get them and then decide then I mean, I don't really know if we can decide now how to spend money we don't have.'",
        "'speaker_4': 'I know, but that would your motion would be to basically have staff, bring the identify the proceeds and bring it back to council at that point.'",
        "'speaker_3': 'Right. And not. Yeah. Sure. Yes. Yes.'",
        "'speaker_0': 'Yes. You could.'",
        "'speaker_3': 'Have 2 minutes of mine.'",
        "'speaker_2': 'Vote because you're.'",
        "'speaker_6': 'Suspending her.'",
        "'speaker_3': 'I move to get the mayor more time.'",
        "'speaker_4': 'Can I second that motion?'",
        "'speaker_1': 'That's Councilmember Vela's second motion. The motion made by Councilmember o.T.'",
        "'speaker_3': 'I like the move to give the mayor another 3 minutes. Okay.'",
        "'speaker_2': 'And Councilmember Desai, we're doing.'",
        "'speaker_5': 'A vote.'",
        "'speaker_2': 'Roll call vote.'",
        "'speaker_7': 'Yes, yes, yes. So I support more minutes.'",
        "'speaker_2': 'Yes, yes. Yes. There is a.'",
        "'speaker_0': 'Lot going on. 15 minutes.'",
        "'speaker_2': 'Okay. Carries my bye bye.'",
        "'speaker_0': 'Well, that's what I'm thinking of. But it would make me feel sad about. But we didn't indicate case. We intend to use the policy to go back into the general or attitude toward achieving this kind of removal. Remove unstated or low areas.'",
        "'speaker_0': 'So I think we have the spirit of policy that's included. I can support it.'",
        "'speaker_1': 'Okay. And I'm just going to confirm, I believe that was a part of Councilmember Otis motion.'",
        "'speaker_3': 'If we could be that specific, I'm happy to agree to those changes. Yeah.'",
        "'speaker_0': 'Okay. Thanks.'",
        "'speaker_1': 'Yeah. Yes, sir. I believe you already did.'",
        "'speaker_4': 'Okay. Okay.'",
        "'speaker_1': 'So it's a part of that. Okay, then assuming that we. We all know what we're voting on. Yeah, sorry. It was. It was a little sausage making here in below the phone can be difficult.'",
        "'speaker_7': 'So are we still going to have a subcommittee that's going to talk about the more global issues of what to do with them?'",
        "'speaker_4': 'That was pretty good.'",
        "'speaker_7': 'Mm hmm. Well, I mean, it's not too distantly removed from what I originally said, so I think I can support that, but I could support it. But I just want to make sure it also emphasized now because, you know, I am still concerned about the measure at issue.'",
        "'speaker_7': 'So I'll leave it at that.'",
        "'speaker_1': 'And just for the folks in the audience, that's a state dinner city bonus. We have no say. If they do it, we have no right to deny it as long as they make the case. Okay, just fair. So I'm going to call unless you want clarification.'",
        "'speaker_3': 'Then we'll just defer to the mayor to appoint a subcommittee. Yes. Okay.'",
        "'speaker_4': 'Although I would be happy to serve on it with the mayor.'",
        "'speaker_0': 'Um, and I would be happy to have you back. Wondering if you think I'm going to the subcommittee.'",
        "'speaker_3': 'Well, I. You have. It's your prerogative when you choose to do so. Yeah.'",
        "'speaker_1': 'Just report back who it is.'",
        "'speaker_0': 'I need to be back in a way that I get what you want to do with my.'",
        "'speaker_4': 'Doing.'",
        "'speaker_1': 'So, Madam Mayor, because that item is not really agenda is, I think, giving this indication of uh. Right. But I think that the mayor could announce that when the mayor returns. Yeah.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. All right. With that, we have a motion and a second on the floor. A roll call vote, please.'",
        "'speaker_2': 'They said nice. Yes. Yes, that's right. Yes. Is he Ashcraft? Yes. That carries with my body.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Okay. Thank you. With that item, I will adjourn the meeting of the successor committee and move on to tonight's regular city council meeting. Roll call, please.'",
        "'speaker_2': 'Been noted. Five present.'"
    ],
    "Proclamation for Janet Magleby Day.": [
        "'speaker_1': 'Okay. Thank you very much. Do we have any agenda changes? Hearing none. We will read our first proclamation.'",
        "'speaker_2': 'Proclamation declaring January 21st, 2020 as gentlemen copy day in the city of Alameda.'",
        "'speaker_1': 'Excellent. Thank you. Be my first proclamation. Welcome.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Whereas, as executive director of the Downtown Alameda Business Association for the last three years, Janet Mcgilvray provided inspired leadership, promoted downtown Alameda, built business relationships, and vigorously advocated on behalf of local businesses. And. Whereas, Janet oversaw the addition of Park Street Land into the downtown historic district, strengthening the connection between the waterfront in the Northern'",
        "'speaker_1': 'Link and Gateway District. And. Whereas, Janet also guided the successful vote of commercial property owners to increase the landscape and lighting assessment enhancing maintenance of the downtown district. A long sought important goal. And. Whereas, Janet originated and implemented the Clean, Green and Safe Fund, which raises thousands of dollars from street events to improve the appearance of our'",
        "'speaker_1': 'downtown. And. Whereas, Janet was also introduced new and widely successful fundraising events, including the Whiskey Store and the Hot Cocoa Crawl. And. WHEREAS, Janet worked diligently with the Alameda Police Department, the Public Works Department, the Community Development Department to advocate for local merchants and.'",
        "'speaker_1': 'Whereas Janet strengthened relationships with other local businesses, organizations, nonprofits and community groups. And. Whereas, Janet gain the trust and confidence of nearly every member of the association and the community through her passion, energy, hard work, dedication and sincerity.'",
        "'speaker_1': 'Now, therefore, be it resolved that I Marilyn as he Ashcraft in the form of John Knox Way, mayor of the city of Alameda, do hereby proclaim January 21st, 2020 as Janet Miguel day in the city of Alameda and urge all residents to join me and the mayor in thanking her for her distinguished service to Alameda business community'",
        "'speaker_1': 'and for making Alameda a better place to live, work and play.'",
        "'speaker_5': 'I would. I would love to. Madame Mayor, Vice Mayor Knox, White council members and the rest of the city staff that's in this room. My name is Janet Mckelvie, as you know, and I am the former executive director of the downtown Alameda Business Association.'",
        "'speaker_5': 'And my heart really is full of gratitude as I reflect on the time I serve this association alongside its talented staff, dedicated board, hardworking member merchants, city officials, city staff, community leaders and district supporters. I have been showered with support, guidance, encouragement that will influence me throughout my next adventure.'",
        "'speaker_5': 'I am inspired by the member business owners who have committed both heart and soul to their customers, their staff, and our downtown district. And I'm honored with the recognition that I have received this day by the City Council, and it will hold a special place in my memory of my time working with each of you.'",
        "'speaker_5': 'Building on the success and accomplishments we enjoyed today, I have no doubt that the next few years will be quite exciting. You're going to want to be part of it, and if you aren't already involved, I urge you to become so.'",
        "'speaker_5': 'I can attest you will be gratified many times over. My husband, Mitch, who's here with me tonight, has served as the association's number one volunteer during my tenure. And for that, I am eternally grateful to him. Mitch and I are longtime Alameda residents, and we look forward to greeting you as we continue to dine, shop and support'",
        "'speaker_5': 'downtown activities and events. This certainly is a very special place to live and work. Thank you all. And go niners.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_9': 'I would love to have all of you come up for a picture.'",
        "'speaker_5': 'I'm glad it's still the 24.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'Yeah. Uh.'",
        "'speaker_1': 'Amazing.'",
        "'speaker_0': 'All right. Let me look.'",
        "'speaker_1': 'Yeah. All right.'",
        "'speaker_0': 'We.'",
        "'speaker_1': 'It's.'",
        "'speaker_0': 'Thank you all. Thank you.'",
        "'speaker_1': 'The. Okay. Do we have any when do we have one speaker?'",
        "'speaker_2': 'Maria Gallo.'",
        "'speaker_5': 'Good evening, counsel. I'm back. And the top again is front side traffic calming? So good news and bad news or good news and more work, really. The good news is that the speed feedback sign that was broken in November, fixed in early December, broke about a week later, is now fixed as of the end of last week'",
        "'speaker_5': '. So we now have two speed feedback signs. One is going in each direction on for inside on the half mile stretch between Tilden, the Fruitvale Bridge and the High and High Street. More good news is that work is continuing for the rapid repeat flashing beacon at Cambridge and for inside.'",
        "'speaker_5': 'This is the intersection where our neighborhood really would have preferred a four way stop. But city staff has basically told us that the outline and the guidelines for a four way stop is not working for them right now.'"
    ],
    "Lease Agreement with Alameda Unified School District for a City Aquatic Center.": [
        "'speaker_5': 'We had our first community meeting last week, about 50 plus people in attendance, which was great. We have two more community meetings coming up on January 29th and February 12th at 6:00 at the club by excuse me and at those will at the next one on January 28th will actually be looking at potential conceptual designs and then'",
        "'speaker_5': 'narrowing down on a on a final conceptual plan at the last one, other basic terms of the lease. The district receives up to 735 hours of use annually for their regular season practices and games for their aquatics programs like swimming, water polo, diving, and any other future aquatics programs.'",
        "'speaker_5': 'It's that is at no cost and at a prioritized use. So that gets the highest priority use for those 735 hours. It's in addition, there is also they get priority and no cost for post-season play. So if one of their teams makes it into the finals and that that is also considered prioritized at no cost and then'",
        "'speaker_5': 'one is a USD school district hosted tournament per team per season also gets use of the facility. Any additional uses outside of that need to be. All of it needs to be scheduled would need to be scheduled to the city.'",
        "'speaker_5': 'But any uses outside of that would be an it would be charged per our regular fee schedule and allocated. Our regular LAPD allocation policy. The uses I just described are limited to the competition pool. So far, the design is envisioned to have one competition pool with at least ten lanes and one recreation pool with several lanes, plus'",
        "'speaker_5': 'what we call fun water recreational components. So the school districts priority use is limited to the pool, competition pool. If there are available lanes, then if their practices only need for five or six of the ten one night, then we can also program those additional lanes for lap swim or other community use like the Gators and other'",
        "'speaker_5': 'youth organizations. It's also important to note the city would retain all revenue from programs including concession sales, which will help for our cost recovery. And then the last point is, is DSA Division of State Architecture. All school construction is under DSA purview rather than going through, for example, the city's permit center and state code.'",
        "'speaker_5': 'So this aquatic center would not be built under DSA. There is an exemption under DSA that a recreational facility, a city facility built on a school district property for the public purposes is exempt from from DSA. The lease agreement also includes language that if either entity were to request and require changes to the facility that trigger DSA'",
        "'speaker_5': ', that entity would be responsible to pay for those costs. If DSA changes are rules in the future, then it would be renegotiated that time when more is known about the factors at play. I do want to note that currently the the City Aquatic Center construction operations is not funded.'",
        "'speaker_5': 'The city will be considering funding options. This could include an infrastructure bond. It could include a large capital donation campaign and other potential options. So that concludes my report and I'm open to any questions.'",
        "'speaker_1': 'Thank you very much. Welcome, counsel. Questions. Looking like none. All right. Are there any speakers on this? No, we have no speakers. Um, so we will move into, uh, council communications. No, no. Sorry. I mean, comment, though. Comments.'",
        "'speaker_1': 'They both start with CRT. Come on. I didn't mean the agenda. I mean council. Council comments? Yes. So are there any kind of looks like Councilmember de SAC would like to start us off?'",
        "'speaker_7': 'Well, thank you. Let me just briefly say quickly say as a member of the Alameda Unified School District Dash, Alameda City Council Joint Committee. I'm proud to have seen this come through and then to pass it on to our subcommittee of Mayor Ashcraft and Vice Mayor Knox White and who have brought us to this point now of'",
        "'speaker_7': 'moving this forward. I think this is something that would be very, very exciting for the city of Alameda. I think from the outset, we all thought of it as, you know, modernizing the swimming pool, making sure that it meets the needs of the swimming community.'",
        "'speaker_7': 'But I think it's more than that. I think this is really going to be not to overuse the word, another jewel in the assets that that the city of Alameda retains in conjunction with its partners. So I certainly look forward to supporting this and staff's recommendation.'",
        "'speaker_1': 'Thank you, Councilman Brody.'",
        "'speaker_3': 'Sure. I want to thank everyone who worked to put this together. I think this is a good deal for the city. The one thing I would just suggest as we move forward and, you know, if there are any issues that still need to be resolved, is that we all remember that even though we're two different legal entities'",
        "'speaker_3': 'were two different governments, we all work for the same people. So let's try to remember that going forward as as we try to implement this and figure out a way to pay for it and and operate it.'",
        "'speaker_1': 'Thank you. There were any comments? No Councilmember or Mayor Ashcraft, any comments?'",
        "'speaker_0': 'I was just going to say thank you to Director Aldridge and also the City Center for the training thought that was involved and utilizing all of this. But it did take a fair amount of communicating that. That's how you come to a decision and hearing from all sides and hearing their concerns.'",
        "'speaker_0': 'And I think that there's a lot to be excited about going forward, but we need to get started because we need to get that pool up and ready for the season or two that can be in and separate from the new aquatic center.'",
        "'speaker_0': 'But I'm very pleased that subcommittee was able to come up with the compromises that it did. And so hopefully this council 3000, we move forward. Thank you.'",
        "'speaker_1': 'Thank you. I will just quickly chime in with my thanks for both city staff and school district staff, as well as the school board members, Harris and Williams, who worked very diligently. We had a couple of meetings here at the end.'",
        "'speaker_1': 'I would say that every meeting started with us all remaining, her not remaining, but acknowledging that we know we work for the same people and whatnot. And I think some of the language in here actually we decided to leave it a little flexible and vague based on the fact that that we expected that not only can we'",
        "'speaker_1': ', but others in the future will be able to work together as as we have around these issues. And that sometimes having having some of that flexibility will be easier and better for us moving forward. So I really appreciate all the work.'",
        "'speaker_1': 'It was a lot of work. I know that behalf of Dr. Aldridge and and Shahrukh Khan especially, but the rest of the staff. So thank you very much. It doesn't sound like we have any any issues of this.'",
        "'speaker_1': 'Would somebody like to make a motion to approve.'",
        "'speaker_7': 'The staff's recommendation?'",
        "'speaker_1': 'Second, we have a motion to approve by Councilmember Desai and a second by Councilmember Vela. Any comments? See? None. Roll call vote.'",
        "'speaker_2': 'Please remember Jason.'",
        "'speaker_7': 'Enthusiastic.'",
        "'speaker_6': 'Yes, Odie.'",
        "'speaker_3': 'He has to get enthusiastic.'",
        "'speaker_2': 'Yes, Knox.'",
        "'speaker_1': 'Quite very excited. Yes.'",
        "'speaker_2': 'Here is the.'",
        "'speaker_0': 'Unanimous. Cynthia.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_1': 'And on the list of people who have been here, I just want to thank Dr. Parker for his his voice and just say, I'm really happy to see you here tonight after our conversation. So thank you. Great. So there we go.'"
    ]
}