{
    "Proclamation for LGBTQ Pride Month.": [
        "'speaker_3': 'Right. And those of you that would like to stand at the podium while I read this proclamation, I'm more than welcome to.'",
        "'speaker_1': 'Come on up to this.'",
        "'speaker_3': 'Let's do it.'",
        "'speaker_1': 'Like you said. Come down.'",
        "'speaker_3': 'All right. Ready? Proclamation. Whereas Alameda has a long, proud history of recognizing the contributions of lesbian, gay, bisexual, transgender and queer questioning community members. And. Whereas, all, Alameda has worked together to fight bullying and harassment and teach respect for everyone, regardless of gender, age, sexual orientation, ethnicity, faith, or any differences perceived or real.'",
        "'speaker_3': 'And. WHEREAS, the Alameda Unified School District has established the LGB GQ roundtable to ensure safer schools for all students, faculty and staff. And. WHEREAS, Each year, the City of Alameda Social Services Human Relations Board co-sponsors Alameda Annual Harvey Milk Day Celebration and Alameda 4th of July Parade, Gay Pride Float.'",
        "'speaker_3': 'And. Whereas Allen meetings are proud to live in a historic time where the President has declared his support for marriage equality and the end of Don't Ask, Don't Tell enabling gay and lesbian Alameda INS to openly serve in the military.'",
        "'speaker_3': 'And. Whereas, same sex marriage has been legalized in 36 states, including California. Yeah, you can indulge a little bit. Yeah, the District of Columbia and in 17 countries around the world. And. Whereas, LGBTQ residents contribute to our rich community culture as homeowners, taxpayers, business owners and service providers, and through participation in city government, the arts, religious institutions'",
        "'speaker_3': 'and community organizations. And. Whereas, The City of Alameda believes that all community members deserve equal treatment under the law now, therefore, be it resolved that I, Treasurer Spencer, Mayor of the City of Alameda, do hereby proclaim the month of June 2015 as LGBTQ Pride Month in the City of Alameda and in appreciation of the diverse contributions of'",
        "'speaker_3': 'LGBTQ members of the community and the unwavering quest for equal rights. FISHER Spencer, Mayor.'",
        "'speaker_6': 'Thank you. And each of you may introduce yourselves.'",
        "'speaker_3': 'And if you want to say anything, I'm going to come on down and hand this off to someone.'",
        "'speaker_1': 'Donna Dowdle.'",
        "'speaker_7': 'Dos Santos. Since it's been legal, we got married on 12 1314 at 1516.'",
        "'speaker_2': 'Congratulates Yes.'",
        "'speaker_0': 'Is that the strength in numbers? Yeah.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_1': 'There you go.'",
        "'speaker_4': 'Henry Very well. Been a resident here in Alameda for about 11 years now. And this is such.'",
        "'speaker_1': 'A great community. It is very welcoming. It's very affirming.'",
        "'speaker_4': 'And not only the proclamation from the mayor in terms of Pride Month, but also the proclamation that was provided for Harvey Milk Day by the school district. In addition, the Social Services Human Relations Board, of which I've been a part for the past.'",
        "'speaker_1': 'Seven years or so.'",
        "'speaker_4': 'And also the LGBTQ roundtable, being a member of that group has contributed to my own ability to promote awareness and education, equity.'",
        "'speaker_1': 'Equality for the LGBTQ community.'",
        "'speaker_4': 'Here in Alameda. And so, again, a wonderful place to live. And thank you to the mayor and to all of our council members for your support of tonight's proclamation. Thank you.'",
        "'speaker_1': 'Only they're.'",
        "'speaker_3': 'Ready.'",
        "'speaker_1': 'This is it. I understand. I do not want to be like this. Thank you, gentlemen. I hear.'",
        "'speaker_3': 'Feel free to text us by letting us know the score we have. All right. I said that doesn't. Okay. That's our proclamation, right? Our communications, not agenda.'",
        "'speaker_5': 'We have the speaker.'",
        "'speaker_3': 'And now can do it. That?'",
        "'speaker_1': 'Yeah. Okay.'",
        "'speaker_7': 'I'm sorry. I came here unprepared. So I only found out about this meeting a few minutes ago. My name is Candi DeWitt and I am founder, co-founder of Mother Voices of Mothers Project and United for a Path to Hope.'",
        "'speaker_7': 'And I come here tonight because I am in favor of AB 1421 laws law which will help our most severely and persistently mentally ill. I am a mother of a young son that became ill with the debilitating illness of severe schizophrenia at the young age of 18.'",
        "'speaker_7': 'No matter what we did, we could not get the sustained help he needed given our current mental health system. The reason for this is our son, along with many others, was unable to understand that he was ill and needed help.'",
        "'speaker_7': 'This condition is a part of the illness. It's part of the same brain that is broken, that is unable to understand that delusions are not real, and that the paranoia that you feel is not true. It affects approximately 50% of people with severe mental illness, schizophrenia or bipolar illness.'",
        "'speaker_7': 'And doctors refer to this condition as honest nausea. Currently, our system is made up of 100% of voluntary programs. Those who are unable to understand their ill will not seek help, and they will not participate in voluntary programs.'",
        "'speaker_7': 'And so we continue to have our revolving doors of psychiatric emergency hospital stays, which do nothing and costs the county a lot of money and put the public at risk of suicide, jail and sometimes harms to others. I imagine that many of you know our family's story.'",
        "'speaker_7': 'And it's a tragedy. For our family and for another family. And nothing we ever expected in our lifetime. We must have something different in our system. We must have a different tool in the toolbox. And we must give families the ability to help their loved ones.'",
        "'speaker_7': 'I do not feel any joy in revealing our son's suffering or our family's pain. But the story must be told. It's a story of thousands. Violence and untreated mental illness are realities. Violence happens when a right to treatment is denied and when inadequate, inadequate treatment is provided.'",
        "'speaker_7': 'This is a public safety issue. It's a human rights issue. And most of all, it's a moral issue. And I urge you to support AB 1421 Moore's Law. We note with Supervisor Miley today for a couple of hours, it will go before our Board of Supervisors in the late summer to early fall.'",
        "'speaker_7': 'I believe we have to. I believe we have two supervisors endorsements. We need three. And we need your leadership. We need change.'",
        "'speaker_3': 'Thank you. Next is consent calendar.'",
        "'speaker_1': 'Well. Oh.'",
        "'speaker_0': 'Was it.'",
        "'speaker_1': 'Communication?'",
        "'speaker_0': 'That one was pulled.'",
        "'speaker_3': 'So as far as I know, we don't have any other speakers.'",
        "'speaker_1': 'But I.'",
        "'speaker_3': 'Guess at this point we don't have any other speakers. Correct.'",
        "'speaker_4': 'Okay.'"
    ],
    "Letter of Endorsement for AB 1421 (Laura's Law).": [
        "'speaker_5': 'Recommendation to approve sending a letter to the Alameda County Board of Supervisors endorsing Implementation of Assembly Bill 1421. Laura's Law. We have a speaker on this.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Doug Fix.'",
        "'speaker_1': 'Good evening, Madam Mayor. Members of the City Council. My name is Doug Biggs. I'm here tonight as president of the Social Service Human Relations Board. The Social Service Human Relations Board did meet and consider an endorsement of implementing Laura's Law in Alameda County.'",
        "'speaker_1': 'And we we did choose to support that. And we're requesting that the city council also endorse implementing Laura's Law in a pilot phase here in Alameda County. As Mr. Wet pointed out, there's a great need for this law here.'",
        "'speaker_1': 'The police at this time have a really blunt instrument to use in 5150, which are mandatory holdings up to 72 hours. I checked before I came here in the last seven days. There's been over two dozen 5150s in Alameda alone.'",
        "'speaker_1': 'A lot of those are repeat fliers, frequent fliers. I every day, not every day, but every week I witness, you know, the impacts of 51, 50 out where I work. And I could tell you that sometimes those folks that are taking in get back to Alameda before the police do.'",
        "'speaker_1': 'The police that took them up there, 5150 is not a treatment option. It's an imprisonment option. Laura's Law provides for assisted outpatient treatment, which is a process that allows courts to compel individuals with mental illness and a past history of arrest or violence to stay in treatment as a condition for living in the community.'",
        "'speaker_1': 'Assisted outpatient treatment is a proven evidence based treatment by SAMHSA, the Substance Abuse Mental Health Services Administration of the federal government. Laura's Law was passed in California, but it's left to the local counties to implement it in counties where it has been implemented, both in California and other states, because 42 other states have shown leadership on this'",
        "'speaker_1': 'and have already implemented it and are seeing results in California, hospitalization in counties where it was, it was implemented, hospitalization was reduced by 46%, incarceration reduced by 65%. In New York, where it's also been implemented, reducing physical harm to others was reduced by 47%.'",
        "'speaker_1': 'This is treatment we're talking about. This is an outpatient treatment where where the person can still have some connection with their community. It's not imprisonment. It's a proven practice. It's in our best interest as a community that has to deal with 5150 on a constant basis to find not an imprisonment solution, but a treatment solution.'",
        "'speaker_1': 'And this is what it is. I do hope you move forward tonight and endorse implementation of Laura's Law in Alameda County and that you urge the Board of Supervisors to act on that as soon as possible. Thank you very much.'",
        "'speaker_3': 'Thank you. Do you have any other speakers on this item? And Brody.'",
        "'speaker_1': 'Thank you. I have a question. The staff who are the supervisors in favor and who seem to be against? We know that.'",
        "'speaker_7': 'Supervisor Chan is in favor and permits to it.'",
        "'speaker_1': 'Supervisor Smiley answers in favor. Thank you.'",
        "'speaker_3': 'Any discussions? Well. Rushkoff Yeah.'",
        "'speaker_0': 'I pulled this from the consent calendar because I read the the staff report and then I emailed Miss Wooldridge because she'd written the staff report and I had a number of questions among them, you know, why if this piece of legislation that was implemented in was enacted in 2000 to have only ten or maybe 12 of 58'",
        "'speaker_0': 'California counties chosen to enact it. And I would have liked a little more information about. Numbers and what results have actually been seen. So I did reach out to some staff from the County Board of Supervisors. And what I learned and this is what concerns me, first of all, there is no dispute that there is a need'",
        "'speaker_0': 'for more mental illness. And to Mr. Witt, I knew your father in law well, and it was a very sad situation that I don't think any of us can really imagine unless we've experienced it yourself. But if you're a parent, you can only imagine the pain that you would feel for your child in a situation like that'",
        "'speaker_0': ', as well as anyone harmed by your child. And but I wanted to know, why was the board of Supervisors not not passing this? Because it came before them two years ago. And what I was told is that this was a very controversial measure from the start among the mental health provider community, even among the families.'",
        "'speaker_0': 'But it's not unusual for a a difficult situation to not have, you know, 100% buy in. But the what the board of Supervisors asked to have done when this issue came before them two years ago, was for there to be a study group.'",
        "'speaker_0': 'So it was chaired by the behavioral health care services of the county, and they came up late last year with this report re-envisioning engagement AB 1421 Stakeholder Planning Response and Implementation Plan. And what the 11 different points that are, are or suggestions that are made do is the summary is that it focuses on increasing capacity across the'",
        "'speaker_0': 'system and expanding programs with a sharp focus on creating intentional linkages for consumers and families with these who need these services and community supports. This was presented to the supervisors earlier this year. It was pulled from the agenda by one of the supervisors and it hasn't come back before them.'",
        "'speaker_0': 'And at the very least, I and I was told that this implementation doesn't have a chance of passing at the Board of Supervisors. I don't pretend to get into those weeds, but what I would at least like the council to consider and you know, maybe if this were to come back that we could somehow supplement it with'",
        "'speaker_0': '. I just would like the council to know what the Board of Supervisors has actually seen as a way to supplement this implementation, because at some point this may get back before the the supervisors and I was told that what Alameda County among these 11 steps that are recommended is envisioning doing is more akin to what the city'",
        "'speaker_0': 'of San Francisco is doing. They have a community conservatorship. And there's also the mental health court and the judge there, I'm told, Judge Brosnahan, has said that we can do what needs to be done through the mental health courts.'",
        "'speaker_0': 'So at least I think we should be endorsing all possible avenues because we you know, we certainly have these kinds of cases in our community, as does the rest of the county. But anyway, I. I want to see something done.'",
        "'speaker_0': 'I want to see it done effectively using the resources in the most efficient manner. So I think we should also encourage the the supervisors to consider this stakeholder report that they ordered that was done over the course of, I think, four or five months.'",
        "'speaker_0': 'And it was a facilitated process involving mental health providers, family members, the representatives of the sheriff's department and the public defender, family members, service providers, as well as consumers, the actual people who are in need of these services.'",
        "'speaker_0': 'So if there was a way that we could somehow amend this recommendation to consider both implementing AB 1421 and or this stakeholder planning response and implement implementation plan, I could certainly support that.'",
        "'speaker_3': 'The other council members comments or motion.'",
        "'speaker_1': 'In America?'",
        "'speaker_3': 'Yes, Vice Mayor.'",
        "'speaker_2': 'I think the gist of our letter is that the laws on the books and we'd like it to be implemented. We're not telling them how to implement it. I think they've already started that process. And this is our urging them to.'",
        "'speaker_2': 'They basically follow the state law and we have examples of this in our community. And I want to make the motion that. Support or approve the recommendation to send the letter on behalf of the city endorsing. AB 1421.'",
        "'speaker_0': 'And just for clarity, the law actually leaves it to each county to decide whether to implement. And that's why, you know, only a handful of counties.'",
        "'speaker_3': 'Have a motion.'",
        "'speaker_1': 'I'll second that motion.'",
        "'speaker_3': 'Any other discussion?'",
        "'speaker_4': 'Yes. I'd like to offer a quick comment. In reviewing the information that's presented to us. It looks like there is a number of credible leaders in this, particularly on this matter, who want to see action done. It seems, though, I think the necessity of the law is well understood, like no other city other than Berkeley.'",
        "'speaker_4': 'I think we here in Alameda feel special desire to see, at least speaking for myself, feel special desire to see this implemented sooner rather than later. And I have to believe that the process has been place where a variety of issues and a variety and a number of stakeholders have been involved.'",
        "'speaker_4': 'Can we involve even more stakeholders to get even greater consensus? That's possible, but I think we're at a point now where we're we're ready for action. We don't want to see something that happened, not just to the Cougar family in Berkeley, but also to the dimwit family whose family we hold in high esteem.'",
        "'speaker_4': 'With the contributions, especially of former council member Abdi Witt, father in law and of misty wit, as well as father of Mr. Wit and grandfather. Young Mr.. So I'm ready to vote and moving this forward.'",
        "'speaker_3': 'I'd like to speak real quick, if that's all right. Could you clarify, was this passed by the people in 2002 that.'",
        "'speaker_0': 'I think was passed by the legislature?'",
        "'speaker_3': 'In 2002.'",
        "'speaker_1': 'That.'",
        "'speaker_7': 'Was passed by the California state legislature in.'",
        "'speaker_3': '2002. Thank you very much. All right. So I'd like to speak to that 2002. We are now in 2015. It's my understanding Alameda County has one of the highest, if not the highest rate of 5150s. The current system.'",
        "'speaker_3': 'Based upon that, at least in Alameda County not working. We need to step up. We got to try something different. And and this is a I'm ready. I plan to support this. I think it's extremely unfortunate. And I would actually say wrong that counties have not stepped up.'",
        "'speaker_3': 'I think this actually should have been not opt in, but mandatory. When you are failing society, action must be taken. You can change it if it if it's not working. But you got to try something. We can tell you what's happening now is not working.'",
        "'speaker_3': 'So I plan to support this.'",
        "'speaker_0': 'And Mayor, I'm actually going to join you in supporting it with the caveat that it might not pass the supervisors. And then I hope that at least the the other implementation plan will and you know, like so many things, it's not simple and it's not black and white, because what was explained to me is that even though'",
        "'speaker_0': 'this is involuntary, the once the person is brought in, they can't be made to stay in the treatment. They can't be made to take their medications. And so this other one is not no one was saying, oh, this law is, you know, wrong headed.'",
        "'speaker_0': 'They're just saying, let's look at the processes we already have in place and strengthen them. But this is at the supervisors level. I mean, I don't it's not a bad thing to support, but it may come down to.'",
        "'speaker_3': 'I requested to be put on the agenda. I understood the imperative that we step up. I think it's imperative that this go that our supervisors step up. 13 years is too long. Any other comment? All those in favor I motion passes unanimously.'",
        "'speaker_3': 'Thank you. Next agenda item. Six eight.'",
        "'speaker_5': 'Prsentation on the City of Alameda Homeless survey by the Social Service Human Relations Board.'",
        "'speaker_1': 'This point is the point. This. And we solve all the problems.'",
        "'speaker_0': 'Yeah, that's the magic moment.'",
        "'speaker_1': 'You want to push a button to?'",
        "'speaker_5': 'I know, I.'",
        "'speaker_0': 'And you're now. Time for an update on the score.'",
        "'speaker_1': 'Yeah. Anybody have the score? Who's watching?'",
        "'speaker_0': 'Do you want to score and still up 5442 at halftime. I just kind of that came to me.'",
        "'speaker_1': 'For those of you that don't know.'",
        "'speaker_3': 'The Warriors playoff game is going on as we're sitting here and say the score again. Member Ashcraft.'",
        "'speaker_0': 'What did they just say? 5442 at the half.'",
        "'speaker_3': 'Warriors are leading. Yes.'",
        "'speaker_0': 'And I'm clairvoyant city attorney that.'",
        "'speaker_1': 'Thought I could make it. Do folks have a personal screen?'",
        "'speaker_5': 'Yeah.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'And on the projector, I.'",
        "'speaker_1': 'To the fans on our screen. You don't know that.'",
        "'speaker_0': 'Is it too late to add that to the budget?'",
        "'speaker_5': 'No, I.'",
        "'speaker_1': 'Can't. But is this, like, keep coming down and if I go too long, I know. And. It's going to.'",
        "'speaker_3': 'So we're waiting for the projector to help us out.'",
        "'speaker_0': 'China is going to save us.'",
        "'speaker_3': 'Those of you that are watching us from home.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'It's happening.'",
        "'speaker_1': 'Yeah. Yeah. I'm trying to make this as fast as I can to get out.'",
        "'speaker_0': 'But you have to start, right?'",
        "'speaker_4': 'Well, if you have a printed format, I suppose you can put it there then. You borrow it?'",
        "'speaker_1': 'You want to do that? Oh, well.'",
        "'speaker_7': 'No. Well, I don't think I can protect acting at all and project from the table.'",
        "'speaker_1': 'Like no light.'",
        "'speaker_2': 'Coming out of the.'",
        "'speaker_1': 'Projector. Right.'",
        "'speaker_4': 'Oh, regardless. Okay.'",
        "'speaker_1': 'You have it in your screen to life.'",
        "'speaker_4': 'It is.'",
        "'speaker_1': 'Only used.'",
        "'speaker_0': 'But it means it is.'",
        "'speaker_3': 'On our screens. But if the audience can't see, it is correct.'",
        "'speaker_1': 'Something's coming up. Here we go. Up the.'",
        "'speaker_2': 'Oak area.'",
        "'speaker_3': 'Okay. All right. Please proceed, Mr. Biggs.'",
        "'speaker_1': 'That's the first time I've been cheered, and I don't think that was. Good evening. My name is Doug Biggs. I'm president of the Social Service Human Relations Board. And I'm delighted tonight to present results of a homeless survey that the board led the effort on.'",
        "'speaker_1': 'That was conducted on September 24th, 2014. And I guess I have to work this thing going, okay. So the goals of the count were to kind of begin understanding the breadth and diversity of homelessness in Alameda and to begin looking at gaps in services for the homeless in Alameda.'",
        "'speaker_1': 'And I really have to thank member Ashcraft who led the effort on really bringing this together to begin with. There was some question she had around the condition of homeless and the the breadth of homelessness in Alameda that prompted us to take a look at it.'",
        "'speaker_1': 'So the process was that we divided the city into six sectors and we developed and we actually put quite a bit of lot of thought into the interview questions we would ask. We started with a number of counties.'",
        "'speaker_1': 'In fact, every county in the country does a homeless count if they get HUD funding. And we started with that questionnaire and then narrowed it down because that questionnaire is, quite frankly, about 35 pages long and could take up to a half hour to complete.'",
        "'speaker_1': 'And we didn't have that skills expertize. Plus we only wanted information that was really useful to us. One of the very unique aspects of our program and also something we put a lot of thought into is we had backpacks to distribute to whoever we met.'",
        "'speaker_1': 'And I want to thank Jim, friend of city staff and who staff to the shrub of of helping to put that together the backpacks included some food included included some basic necessities such as toiletries, socks. It also included bus passes so people could get to appointments that included phone cards and it included resource books about services that'",
        "'speaker_1': 'would be available. So the the districts that were created or the or the sectors that were created spanned from Alameda point out to Bay Farm Island. And each sector had a team of volunteers that did counting in that area.'",
        "'speaker_1': 'The volunteers were made up of community members, Alameda Police Department, other staff, Alameda Police Department volunteers and policing elected officials. Again, we're very thrilled to have our Mayor Spencer join us for the Count and Councilmember Ashcraft also join us for the Count.'",
        "'speaker_1': 'And we had staff from the County of Alameda Housing Department who were getting ready to lead their own homeless count that came out to see what they could assist us with in helping us. And then each member of Shrub also took a role as a leader of one of the teams.'",
        "'speaker_1': 'So we met very early in the morning prior to going out. The idea was to get out there right at sunrise and we did a briefing of the volunteers. Each volunteer was was very clearly identified as a volunteer to assist with homeless information.'",
        "'speaker_1': 'We had the assistant, the Alameda Police Department, and I can't say this enough. Alameda is so extremely fortunate to have on its police force a woman like Elisa Ledbetter, who on her own leading up to this has put together an amazing number of resources to assist people with mental disabilities, the homeless that she encounters.'",
        "'speaker_1': 'The police in general were a wealth of information on where we should we should be looking protocols for contacting, to making sure that both we were safe and the people we were contacting were safe. They just did a wonderful job on this.'",
        "'speaker_1': 'Plus, they recruited a number of volunteers. So we we we divided up the teams and made sure everybody was filled up with coffee and gave last minute instructions to each of the teams as to where you would be going to go over their questionnaire real briefly and then head out.'",
        "'speaker_1': 'And again, this is Officer Ledbetter, who can't say enough about her. So the findings of the survey were that we identified the 17 people as being homeless. Of that number, eight were interviewed and an additional nine were observed but were not interviewed.'",
        "'speaker_1': 'This was this was an anecdotal study versus an empirical study. If you do the county count, they have a lot of algorithms that they throw into the fig data more realistic. This was really literally feet on the ground with our eyes in some cases.'",
        "'speaker_1': 'You know, it's a little intimidating to approach somebody and say, are you homeless and ask those questions? So we may not have captured all the data. We weren't really trying to we were just trying to get a little baseline, a little bit of an understanding of where we're at.'",
        "'speaker_1': 'And we found two very interesting things. Of the eight that were interviewed, five indicated they were chronically homeless. That is, that continuously homeless for a year or more or homeless more than four times over a three year period.'",
        "'speaker_1': 'Among this group, mental health issues seemed apparent. And just to give you an example, we had one gentleman who had been dropped off here by his brother from, I believe, Arizona, and he had no spatial recognition ability. He had no sense of direction.'",
        "'speaker_1': 'He had been to the food bank once. He had left the island of Alameda. He'd been to the food bank once, but had never been able to find it again. So he stayed where he was and really relied on other people to bring him things.'",
        "'speaker_1': 'The Alameda Food Bank was I'm sorry, another important issue that three of the eight indicated they are veterans. And we had very specific information to hand out to veterans to get them hooked up with the Veteran Homeless Initiative.'",
        "'speaker_1': 'The Alameda Food Bank was used by four of the eight individuals, and several also mentioned that they'd use hospital and emergency services repeated times. What I think is really important of the eight people that were interviewed for who listed Alameda as their last permanent address.'",
        "'speaker_1': 'So they were living here as residents before they became homeless. So the next steps in this is actually I'm go to number two to begin with is to bring back the homeless count for a follow up count. We want to repeat this.'",
        "'speaker_1': 'So the more often we repeat it, the more the better information we get. So we are planning on doing another count in late July or early August, and we hope that some folks will join us for that. We also want to convene an interdepartmental meeting of some of the city departments to talk about some of the needs'",
        "'speaker_1': 'and an impact on homelessness in the context of future development. There's things we do, whether it's Parkland development or whatnot, that can either encourage or support homeless or discourage and move them out. And there's discussion to be had on both sides.'",
        "'speaker_1': 'But I think we need to go into it with an understanding of what are the consequences on the homeless of whatever policy actions we take. And of course, the last was was to continue working with the police department to improve protocols around the provision of resources, housing brochure, encountering homeless.'",
        "'speaker_1': 'And I can report to you that as recently as this week, when the police went out to the Sweeny Parkland and to do a clearing action, they took with them the backpacks we had prepared. And of the five people that were left there, because they've been for the last month, they've been going out there saying, you've got'",
        "'speaker_1': 'to move on, you've got to move on. They've been supporting these people in their efforts to move. And again, Officer Leadbitter has been out there with her resources. Five people were left and each of those five got a backpack with with bus passes and the calling cards and foods and socks.'",
        "'speaker_1': 'So there's already a lot of initiative underway between social services and the police department and not you know, this isn't a punishment action. It's a resource action to help direct people in the in the direction of the right resources.'",
        "'speaker_1': 'And that's my report. And I'd be glad to entertain any questions you may have.'",
        "'speaker_0': 'Member Ashcraft First of all, thank you for that report and also for for all of your efforts. I agree with you that Officer Elisha Ledbetter is a rock star when it comes to this, but so are you. Because when I raised the question with you last more than a year ago, you right away said, okay, let's let's'",
        "'speaker_0': 'walk Webster Street and let's, you know, pick a time to do that. And we walked up one side and down the other and it was really touching to see we did encounter some individuals and very touching to see Mr. Biggs and how non-threatening and respectful and low key his manner of speaking and eliciting information.'",
        "'speaker_0': 'Not everybody wanted our help, but I also wanted to just add that that day that we went out was a day kind of like yesterday we had rain, remember rain, and it had rained overnight. And so things were a little damp.'",
        "'speaker_0': 'So even when we showed up to get organized for the count, I know we were told some people head indoors. They find in a shelter somewhere under a roof when it's raining. So the count might have been a little low as a result of that.'",
        "'speaker_0': 'And I'm glad that you mentioned the encampment that was recently cleared out at the the site of the Jean Sweeney Beltline Park Open Space Park that we're developing, because it isn't just I read the local online news sites, Michelle Allison site and someone made the comment that, oh, the police just tell the homeless to move along, not'",
        "'speaker_0': 'Alameda PD. They don't. They had, as Mr. Biggs indicated, the backpacks that are full of not only some supplies but resources. And they can get you to where you need to go if you need the food bank or you need, you know, medical care or you need some rapid rehousing.'",
        "'speaker_0': 'And there was also a comment on the story that Michelle Allison did on her site. And someone mentioned seeing a family at the pizza at Nob Hill Market. You can think of where that is and that they appeared to be homeless.'",
        "'speaker_0': 'They were heating their dinner in a microwave and wasn't a shame that, you know, but if the police had come, they probably would have shooed them away. And I emailed the police chief, O'Leary, and said, did you see that comment?'",
        "'speaker_0': 'Because trust me, he reads those, too. And he said he did. And no, no, no. If so, this is just for the public and anyone listening. If you see a situation that looks like a family or an individual in need of assistance, you can call the police department the non-emergency number, tell them what you're seeing, where you're'",
        "'speaker_0': 'seeing it, and they will send an officer out to assist. So I checked that with the police chief when I read that comment. But anyway, thank you for all the work you're doing. We look forward to the next steps in this process.'",
        "'speaker_1': 'Thank you. And if I could just add, and I think I do have to say this, I saw that same comment and also prior to the first count I comment about, well, there were people barbecuing down at Crab Cove that, look, homeless people have a right to barbecue in our parks.'",
        "'speaker_1': 'People have a right to go shopping in the shopping centers and purchase items and heat them up. They may not necessarily be hot, not all. They may look different for you. They may be homeless. And it's okay to ask if their services that they need.'",
        "'speaker_3': 'Uh, member, Odie.'",
        "'speaker_1': 'Thank you, Madam Chair. Thank you, Mr. Briggs. For. For all you do. You're one of the pillars of our community that, you know, take care of the people that are are least fortunate. And we really appreciate, you know, all of your hard work.'",
        "'speaker_1': 'I mean, I do I think I speak for the council. Just a couple of quick questions. So when we go back and we do this other count, are we doing kind of a census where, you know, we keep track?'",
        "'speaker_1': 'You know, is this someone we counted last time? You know, when we talk to that person, did they need services, you know, almost and almost like case management? I don't know if, you know, we have the resources to do that, but no.'",
        "'speaker_1': 'Are we doing that or are we are we able to tell in our next count? Are these folks that are new to alamy this homeless population or I mean, just things like that? I was just curious. We are going to attempt to see if there's there's any repeats from people we interviewed before.'",
        "'speaker_1': 'A number of the interviews, folks that we interviewed for last time I had notes on, in some cases I was able to because some of them already had case management in other jurisdictions that they were working with. So I was able to contact that case management.'",
        "'speaker_1': 'They're not able to share information with me. It's a one way, you know, hey, we met this person. Just want to make sure they're they're doing stuff. So we'll follow up if we do meet somebody that is a repeat from last year will definitely ask a question about what services they've they've are taking off since then.'",
        "'speaker_1': 'And you have the program where, you know, homeless veterans over at the collaborative government are. Were you able to help any of the if there was, what, three, three veterans Operation Dignity operates those those units? Our understanding is they were already tied in with services to some extent.'",
        "'speaker_1': 'And I know that since that time there's been a huge influx of vet services. So I want to follow up and see if they've they've been reached. Okay. And thanks again for everything you do. You're you're welcome.'",
        "'speaker_3': 'Everyday.'",
        "'speaker_4': 'Just two points. First point is thank you very much to Councilmember Marilyn as the Ashcraft for bringing this to the fore and also a thank you to Councilmember Ashcraft and Mayor Spencer for taking part. So we'll have to step up as well.'",
        "'speaker_4': 'Next time you have your count. And I mean that seriously, because this is an important and this leads me to the second point is that, you know, for the city of Alameda to be as proactive as we are, particularly you, the council members here, I think is a great reflection of how far we've come.'",
        "'speaker_4': 'Way back in 1994, you know, we were dealing with the homeless issue, but perhaps and in antagonistic ways. And out of that came. Amendment to the McKinney Act. And it really started here in Alameda. But, you know, through the collaborative homeless collaborative, Alameda Point Collaborative, you know, I think our community has done a sea change in terms'",
        "'speaker_4': 'of what its responsibility is with regard to those who are the most vulnerable. But we're not going to just build housing for those who can afford the highest market rate rents or for sale prices. But I think as staff and as council working with our community, we will also make sure to.'",
        "'speaker_4': 'Do what we can for those who are most vulnerable.'",
        "'speaker_1': 'I would be remiss also if I didn't say this was a this is a project of the entire shrub. Every member was very actively involved here in the morning state after work to help crunch the data. So this was this was a truly a whole commission effort.'",
        "'speaker_2': 'I swear I appreciate the diligence and particularly put in next steps after having the experience. There are a couple of things that I wanted perhaps to address to staff through through this board, if people are interested. And it's one thing to to live in a park.'",
        "'speaker_2': 'But we had the issue of the event abandoned the vacant buildings that are on the point that are attractive nuisances to young people. I'm afraid that they can be places where people who are leaving June 20 park might look for shelter and.'",
        "'speaker_2': 'I do not want to us to be reading that someone has died there. There's a fire there because of another encampment inside. And I'm hoping we can address removing those buildings. And at the same time, I think looking at the the means that we might have, not just in Alameda but through the county or state, is kind'",
        "'speaker_2': 'of a next step of where we put a roof over the heads of people who. What avail themselves to it and in a shortage of space that we have now, and how do we add to that to address it?'",
        "'speaker_2': 'Because I think in the next count, we'll probably see that the numbers are bigger. And that's just what I've observed over the last year. West side of Alameda.'",
        "'speaker_3': 'But it's my understanding that the point is on the parking lot and we'll be coming back. But we will be hearing from staff on that issue.'",
        "'speaker_1': 'I was just saying. Just go ahead.'",
        "'speaker_2': 'It's just to. Is there a way that we can accelerate? Is there a money in the Alameda Point budget to address what's an attractive nuisance but now that people are being moved out. Of in Sweeney Park. I mean, we there were five that were remaining, but there were others there.'",
        "'speaker_2': 'What are we going to do about that? And can we do it sooner than waiting until September when we talk about the parking lot?'",
        "'speaker_3': 'Right. So we do not meet during August. I was going to come back number.'",
        "'speaker_2': 'But the problem is now.'",
        "'speaker_7': 'I think at least for the buildings out at Alameda Point, part of that process is looking at sort of doing an inventory of that and making sure that we understand which buildings need to come down and then get a cost estimate to take them down and then sort of triage them to make sure, because we may not'",
        "'speaker_7': 'be able to afford to take them all down at once. So there is some planning that we need to do before we just sort of say, okay, yeah, we're going to do that. So we will absolutely do it as quickly as we can.'",
        "'speaker_0': 'Just a clarification, Mr. Madame. Is that part of the study that Public Works is doing? This is separate and apart and separate. Okay. Got it. And then just a question for Mr. Biggs. And we talked about this a couple of times about the need for rapid rehousing, but often using countywide or regional resources to maximize resources.'",
        "'speaker_0': 'I mean, I know we have we have a women's shelter in there, but do you can you just touch on that? So.'",
        "'speaker_1': 'Sure.'",
        "'speaker_0': 'So some of the resources.'",
        "'speaker_1': 'That as far as rapid rehousing goes, which is the whole idea of keeping people from becoming homeless first, the county, the boomerang fund. Which is the whole complex we all get into, but it's money that's coming back through the dissolution of redevelopment.'",
        "'speaker_1': 'They put a significant amount of funds from that. They could have gone into the general fund. They're putting it into rapid rehousing, building a future for women and children, which operates Midway Shelter is also the regional provider, including the City of Alameda for Rapid Rehousing Funds, and they also have some money, CDBG funds from the city for'",
        "'speaker_1': 'that as well. So they've really gone out of their way to make sure that Alameda serve through rapid rehousing. I will say, though, that the chronically homeless, the ones we're seeing out there, require the highest level. They need permanent supportive housing, which is what we operate out of at Alameda Point.'",
        "'speaker_1': 'But you know, the good side of it is if we can find some way to get seven, eight permanent supportive housing units, we have solved homelessness for all practical purposes in Alameda. You're always going to have people moving through.'",
        "'speaker_1': 'But for the chronically homeless, these guys who have been living in the wharves, under the wharves for the last five years. You could provide a permanent solution for them. Though we're close. We could be really close on that.'",
        "'speaker_3': 'So I'd like to share my experience going out that morning we left. My recollection is 6 a.m. or something like that. It was early. It was in the dark. When we met here, we teamed up. My partner and I were assigned an area, I think by South Shore, walking along the waterfront to Crab Cove.'",
        "'speaker_3': 'And we came we found only one person and the person we found actually by the time we we saw him, he was watching the sunrise and we spoke with him. And he was my recollection is he was a vet, but he had lived in this area previously.'",
        "'speaker_3': 'This is where he felt comfortable and he was very appreciative of the bag. He really did appreciate us giving him the bag. He was actually. You know, comfortable chatting with us. And I got the impression that that's actually where he feels comfortable, is there at Crab Cove, which, by the way, is where I feel comfortable, which if'",
        "'speaker_3': 'I chose that area, I run there in the morning and it's a beautiful place to live. However, of course, it's a serious issue. And, you know, reaching out to him, going out in these teams. I'm hoping, you know, it'd be great to have more community members join us whenever this data set.'",
        "'speaker_3': 'And we do team up in pairs. And it's it's actually a really good experience as someone that's out there trying to help our community members. Thank you to share that. Thank you.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_3': 'All right. So we just. This is the presentation. We don't vote on this. Yeah. The 6 p.m..'"
    ],
    "Collection of Delinquent Business License Taxes and Waste Management Accounts.": [
        "'speaker_5': 'Public hearing to consider collection of delinquent business license, taxes and delinquent integrated waste management accounts via the property tax bills.'",
        "'speaker_3': 'Do we have a presentation by staff?'",
        "'speaker_1': 'Yes, they do.'",
        "'speaker_8': 'Hello? Elena Dias, finance director.'",
        "'speaker_1': 'Um.'",
        "'speaker_8': 'I really don't have a actual presentation, so we're just going to go over real quickly on the staff report. So there are a couple of. Feels that the city were actually presenting today to levy with the county against the property.'",
        "'speaker_8': 'Properties within Alameda. So those are the business license tax. As you you're aware, any time a business owner does business in the city, according to the ordinance, they are supposed to pay a business license tax. In some cases, some of the business owners are delinquent in paying the business license tax.'",
        "'speaker_8': 'We do provide ample time to actually make the payment. Original notice of the renewals goes out to those business owners around May one for fiscal year 1415 went out in May of 2014. And the customers, our customers who are the business owners get a chance to actually make the payment and be on time by the end of'",
        "'speaker_8': 'July. So they have about three months to pay for the business license. Unfortunately, some of them do not and then those that are delinquent. We sent out three notices this year. We send them out one in March, one in April and one in May, letting them know that they are being delinquent and on top of that, informing'",
        "'speaker_8': 'them that there is going to be a public hearing last time we've had it set for today. And so today is the public hearing to clean those particular properties. The City Clerk may have already distributed you the updated updated listing for business license delinquent customers.'",
        "'speaker_8': 'And I do want to let you know that this is current as of today. All of the business owners that are on that list do have an opportunity to still pay the business license by the end of June, June 30th, specifically in order not to have a lean on their properties.'",
        "'speaker_8': 'The second one you will see is a. Waste management fees that. Actually is done through ac i ac i bills the customers within city of alameda and. They provide actually quite of an extended period of time to collect the fees, the fees that you actually see on the list right now.'",
        "'speaker_8': 'Those were sent to the city by ACI. And generally they are never less than 360 days being delinquent. So they are at least a year past being paid. That said, again, you have received an updated list of all of those delinquencies and those customers do get as well notices.'",
        "'speaker_8': 'Quite a few of them, actually. I believe it's for where they're being notified about delinquent outstanding counts and we request for them to clear their bill before it's actually been levied with their account, with their properties. That said, tonight we are asking you to approve the current list unless of course, somebody makes the payment and those will'",
        "'speaker_8': 'be removed from the list and approved. Correct. One is for the monarch clarified.'",
        "'speaker_3': 'Were speaking about two lists.'",
        "'speaker_8': 'Yes, there are two lists. One is for business license and one is for the Integrated Waste Management.'",
        "'speaker_1': 'Hmm.'",
        "'speaker_3': 'All right. Do we have any clarifying questions? We do have speakers. Member, Odie.'",
        "'speaker_1': 'Thank you, Madam Mayor. Just a couple quick questions. So the people on this list, did they get an actual notice saying today, June 11th, that 7:00 is the hearing?'",
        "'speaker_8': 'Yes, they do.'",
        "'speaker_1': 'Okay. And then is it been the past history of this council if someone does pay their delinquent business license that the late fees are waived?'",
        "'speaker_8': 'Well, this is a per ordinance. And per our masterpiece schedule, we are supposed to levy any penalties or interest. Now, this is not up to a department, I guess, to waive fees. I cannot tell you if previously these particular fees have been waived or not, but it would be up to council to actually if you do decide'",
        "'speaker_8': 'to do that, you can do that.'",
        "'speaker_7': 'I couldn't actually speak to that. If it's a first offense, we have waived the fees in the past, but if it's recurring, then we don't.'",
        "'speaker_3': 'The list does not delineate between any recurring and first offense. Far as I know.'",
        "'speaker_1': 'No, I was going to ask that question.'",
        "'speaker_7': 'I think that's just something that we do administratively.'",
        "'speaker_1': 'Mean. So do we know any of these that are on here?'",
        "'speaker_7': 'I guess those whether they're another recurring. I don't know. I don't know.'",
        "'speaker_8': 'Do you know? I can tell you that there are a few on the business license side that have been generally late in paying. I'm not sure if they were specifically delinquent.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_3': 'Member de SAC.'",
        "'speaker_4': 'Thank you, Madam Chair. If you can, can you just give us some background on the leg that matter of legacy.'",
        "'speaker_1': 'Programs.'",
        "'speaker_3': 'Public information.'",
        "'speaker_4': 'Yes. Yes, yes. The matter. Thank you. The matter of legacy partners. I mean, there is a substantial amount there. I mean, what's this? What's the story there?'",
        "'speaker_8': 'Well, they have rental properties and they have been previously late in making payments. Cannot tell you actually if they have been delinquent previously or not. But they have rental properties for which at this point in time, after last contacting them, they have not made the payments yet for their rental properties.'",
        "'speaker_4': 'I see. So on the very same topic, when it comes to the late charge, it seems as though the late charge on it seems to be if the amount due is 4000 and then there's a late charge of 3200 or a total outstanding fee of 7200, and then there's some processing charges, etc..'",
        "'speaker_4': 'So the 3200 late charge tacked on top of the $4,000 amount. It just seemed a little excessive. Now, let me just say, before anything, I have not been lobbied by anybody indirectly or directly about this. But just looking at this.'",
        "'speaker_4': 'My inclination is I want to hear more. Thank you.'",
        "'speaker_3': 'Okay. Clarify, in regards to legacy partners, is that a first offense or a recurring?'",
        "'speaker_8': 'I can find out that information if need be, but I don't have that in front of me right now.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Remember Ashcroft? And then I was just going to ask Mr. and by the way, thank you for your email. I didn't have a chance to get back to you and say thank you for your email earlier today, answering some questions that I had.'",
        "'speaker_0': 'But so how is the the late fee determined? Is that is that something that every city does a little differently? I know you've worked in some other cities or is there some formula.'",
        "'speaker_3': 'And can you clarify that in regards to the business license list or the way I'd like to actually treat these issues? Well, one is waste management, and that probably determines differently.'",
        "'speaker_0': 'You know, the only one I'm seeing with a late fee is the business license tax, but that doesn't mean it doesn't also exist for waste management.'",
        "'speaker_3': 'So if you could ask in regards to each list. Okay. This you're speaking to.'",
        "'speaker_8': 'So on a business license, that particular fee is actually in our master free schedule. And the way it's being calculated, it's 20% per month and up to 100%. So technically, if a business is delinquent anywhere from August, you're pretty much January and not paying it.'",
        "'speaker_8': 'You're out of 100% of the fee, the late charge.'",
        "'speaker_3': 'Imminently or per year, or.'",
        "'speaker_8': 'It cannot exceed 200% in a year.'",
        "'speaker_3': 'And a year. So per annum.'",
        "'speaker_0': 'But 20, 20% per month?'",
        "'speaker_8': 'Yes.'",
        "'speaker_4': 'Okay. So mathematically then Legacy Partners is ten months behind? No. Hundred is 80% of. Oh. Technically 20, 20 times.'",
        "'speaker_8': 'Yes. So it's 20% for each month starting August. Okay. And, um.'",
        "'speaker_3': 'And we do have two speakers. Okay. Any other clarifying questions? All right. I'm going to go ahead and call our speakers. And of course. Dennis Wong. And then to Peter Todd Whitman.'",
        "'speaker_4': 'Good evening. My name is Dennis Hwang and my family. Most of my family still resides here over 50 years. And they earn income property here in Alameda. And my parents have lived in the same address for over 50 years.'",
        "'speaker_4': 'I retired to Utah about ten years ago. And I don't know what that lady was speaking about, but all I know is my personal experience. I receive the notice on one of our properties for delinquent business license fees on the letters dated March the 31st.'",
        "'speaker_4': 'I live in Utah, so I probably received that about seven days later.'",
        "'speaker_2': 'And I quote.'",
        "'speaker_1': 'That if payment is not received on or before April 16th.'",
        "'speaker_4': 'Of 2015, the amount due plus additional late charges and collection fees.'",
        "'speaker_1': 'Will be sent to the.'",
        "'speaker_4': 'City Council for their review and approval for attachment of the amount due on the property.'",
        "'speaker_1': 'Tax.'",
        "'speaker_4': 'So I receive and again we've been paying diligently on a four plex way on business taxes for. 30 some odd years. Never received notice on this duplex. I did not know that duplexes within the purview of the business license.'",
        "'speaker_4': 'So I called the city clerk, the finance department and the legal department, and wrote letters. And some were helpful. Some were not. But I spent about two weeks of my life researching it. Came and spent it. Great afternoon with this listener and this smaller but I can't pronounce your name but Carol the delightful people explaining it.'",
        "'speaker_1': 'Researched back.'",
        "'speaker_4': 'On the legislation.'",
        "'speaker_1': 'Which was first wrote.'",
        "'speaker_4': 'I think section 834.'",
        "'speaker_1': 'Uh.'",
        "'speaker_4': 'July the 20th, in 1943. And at that time Council saw fit to levy business licenses. And the, the intent was to generate income. And at that time it defines business as is in calling or any any enterprise carried on for profit dispenser.'",
        "'speaker_4': 'At the last meeting we were discussing AT&T and astoundingly and I tried to answer, but I was stopped. You wanted to know whether or not that tower, AT&T, it were subject to business license. And I was going to give.'",
        "'speaker_1': 'You the answer.'",
        "'speaker_4': 'What astounds me was you had three counsel here. You had three attorneys sitting here. I talked to two of them. They didn't know the answer. And if you look subsequently over the years, they've added fortune tellers on telecom bowling alley.'",
        "'speaker_4': 'You're to have pure, clean legislation. Anything any enterprise carried on for profit. Why do you need to add all these subcategories? You don't need to do that. And I don't know if it's because you feel like you need to generate more legislation so that you're doing your job, but you have clean legislation.'",
        "'speaker_4': 'Leave it as it is. And quite frankly, I find it rather offensive that.'",
        "'speaker_3': 'You may continue like that.'",
        "'speaker_4': 'You're trying to scratch out $20 a unit, which I'm perfectly happy to pay. I just wasn't aware of a subject to it. And you don't know or we're not levying business taxes for AT&T and the Verizon's of the world.'",
        "'speaker_4': 'So you asked about the penalty. It's still $20 a unit. And that's been since 1986. In my my junior high school principal actually enacted that offensive $20 unit. I mean, I think if you went to people and actually told them $20 unit and they knew that it existed, they'd be happy to pay it.'",
        "'speaker_4': 'I'd be more than happy to pay it. It's the penalty that seems like you give me seven days to pay and then also you're asking for 100 800% penalty.'",
        "'speaker_3': 'So I'd like to ask you a clarifying, crushing real quick. When I look up, are you on here long? I'm on the list. I'm looking at it. Shows amount due just the late the the late charge of $160 and amount due zero.'",
        "'speaker_3': 'So did you pay?'",
        "'speaker_4': 'Right. So I researched I researched it. And again, you they what they did was they added they had this general language about anything carried out for profit. And then over the years they started added these specific businesses.'",
        "'speaker_0': 'To understand the Maersk question you were asking, did you pay off the late.'",
        "'speaker_3': 'Or the principal? Because on this chart.'",
        "'speaker_0': 'Did you pay the back?'",
        "'speaker_3': 'He's the only one that has a zero under the amount to call columns for.'",
        "'speaker_0': 'This a dare.'",
        "'speaker_4': 'Well, I can I can answer. So I came and I researched it and sure enough, it was it was an 86 that they added specific language on duplexes and they still exclude single family dwellings and I don't know why.'",
        "'speaker_4': 'Right. So I said, oh yeah, we the duplexes subject to the business license. And so I told Carol, I said, Hey, I want to pay this, but what do you suggest? You know, I'm going to ask counsel to weigh the fee.'",
        "'speaker_4': 'Now, first of all, I haven't had no problems with the thing. And ironically enough, I got my annual notice for Meals on Wheels. I'd be happy to pay the penalty to Meals on Wheels. It's it's the principle. And if you look at the history, we have it increase that business license since 1986.'",
        "'speaker_4': 'But the penalties over the years have been increasing. And I don't I can give you the detail the year in the legislation, but the penalty is now 100%. And what it seems like is from a layperson who has no notices that, hey, you know what we get, we want to penalize you.'",
        "'speaker_1': 'You probably was afraid of the microphone, say, oh.'",
        "'speaker_4': 'We want to penalize you. We don't want the $20. We want the penalty fees. Do you.'",
        "'speaker_1': 'See?'",
        "'speaker_3': 'Right. So man, clarify I at this point that let him finish if you could wind up and we can have so.'",
        "'speaker_4': 'In any of it you know I have some suggestions suggestions. Okay if you say, hey, the $20 it goes to, you know, here's your annual business license notice again, which I did not receive until the date that I indicated it.'",
        "'speaker_4': 'Here's this business license. And by the way, what's really helpful, this is new federal legislation on landlord tenant issues. This is new, particularly the local ones like I look every year, you know, you change the fire notices. You know, you have to put the notice.'",
        "'speaker_3': 'I'm happy to meet with you. Oh, you remember how it went?'",
        "'speaker_4': 'So, you know, something like that, so. Oh, wow. You know, I talked to all my my friends, you know, my high school buddies about this, and it's kind of it's kind of bang for the bang for the buck.'",
        "'speaker_4': 'And I don't I don't really none of my friends, we have nothing against the 20 hours. We actually think it should be increased. It's it's the penalty and the lack of notice.'",
        "'speaker_3': 'That's right. Did you have any other points you want to raise? So that's that's that's about it.'",
        "'speaker_1': 'Okay. I had one question, Mr. Wong. One question. So thank you, Madam Mayor. So I didn't quite follow your presentation, but are you asking us that we, we waive the late charge and not send that for for you you because you paid and not send that through the property tax attachment.'",
        "'speaker_1': 'Well yeah, I'm I'm.'",
        "'speaker_4': 'Glad to see you decision. You know, I came here today and I just right earlier this afternoon thought I was going to make the appeal, mostly to give notice and give you some feedback on what I think long time aluminum and some of us, you know, small dwelling unit landlords, are.'",
        "'speaker_1': 'They yes or no? I mean, are you asking that? Yeah. Yeah, I think that there's not. There was some sympathy on my part to do that. Okay. Yeah. 10 minutes ago.'",
        "'speaker_4': 'So that and then but I think more importantly, maybe some suggestions on how to take a look at this legislation.'",
        "'speaker_3': 'Also look at the policy. I appreciate that.'",
        "'speaker_1': 'Thank you. Okay. Thank you very much.'",
        "'speaker_3': 'Thank you. We have another speaker.'",
        "'speaker_0': 'I think I'd like to hear the clarification on this point while we're still on it, though, from this one, madame.'",
        "'speaker_7': 'So the point is that several years ago, under the previous finance director, Fred Marsh, there was a change in the fee because we were continually getting people not paying on time. And so the idea was to actually create a penalty for people not paying on time.'",
        "'speaker_7': 'I think the staff, the finance staff does a admirable job trying to reach out based on the the address that we have, based on the business license that people have submitted. So we try and we do our best to try and reach out to these individuals so that they can pay on time.'",
        "'speaker_7': 'But sometimes we don't have the correct address.'",
        "'speaker_3': 'Right. But I actually think that's more appropriate after we hear from our speakers. I'd like to continue with our speakers. Thank you, Mr. Raymond.'",
        "'speaker_1': 'Yes. Good evening. My name is Todd Wyman. I have been a resident here for about 15 years as a homeowner. And I'm also here to speak against, I guess, the penalties and back business fees for for a number of the reasons that have actually been cited by Mr. Fong.'",
        "'speaker_1': 'I, I received the notice on, I guess it was probably around the March 31st notice. That was actually the first notice I received full stop that a business license was required for the In Law Unit that I have behind my house.'",
        "'speaker_1': 'I received no there was no effort by the city to actually let me know that. As you know, as you need a business license for this, I did receive three letters threatening me with the problem with the additional fees and penalties, which again I had no knowledge of to begin with.'",
        "'speaker_1': 'I didn't know that to rent a piece of property behind my house. And incidentally, my house is two houses on one lot. Which is kind of to be honest, to send the penalty is kind of a cynical way to treat residents of Alameda to assume that we were I was or residents as a whole are trying to'",
        "'speaker_1': 'evade a fairly nominal tax or fee, if you will. I'm sorry. I had similar difficulty understanding the penalties. I actually had someone in the department explain it to me. I am still baffled by how it all. After that discussion, I was still baffled at how they arrived at the penalties.'",
        "'speaker_1': 'And I have a graduate degree in business that I mean, that's that's horrible. From what I can tell the city to simply a search of county records and blindly sent out notices to anyone that had anything other than a single family residence.'",
        "'speaker_1': 'This was a fishing expedition. I was actually one of the honest ones that said, Huh, I didn't know about this. I actually came down. I paid for the business license for this year. I even paid.'",
        "'speaker_4': 'The late fee for.'",
        "'speaker_1': 'This year. I simply refused to pay the back penalties or back fees because it doesn't make sense to.'",
        "'speaker_4': 'Me at all.'",
        "'speaker_3': 'Can you speak to the numbers when I'm looking at this with your name? It has amount due principal $14 and it has $64. Late charge adding all the way up to 156.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'Again, the total amount due at this point. Is that.'",
        "'speaker_1': 'Correct? The total amount that I received on the most recent letter, which was dated May 28th, was 154. And it goes through a bunch of different charges that don't up that add up to that.'",
        "'speaker_3': 'And the principal initially was $14. I was $14 then.'",
        "'speaker_1': 'You know, more than I do. All right. No one's explained that to someone on staff explaining that.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'The 14.'",
        "'speaker_3': 'Staff confirm. Are we starting with that? That's what it says on here. Amount due $14, but the total amount due now with the county fee, which I believe is after assessing late charges, is now $156. But initially, if this gentleman had paid $14 within the correct time, was that all that would have been?'",
        "'speaker_7': 'Do I miss him? So, Miss Adair, could you please. Give us some.'",
        "'speaker_0': 'I was going to ask Mr. Women, do you have those letters you're referring to in your file? And if so.'",
        "'speaker_1': 'Two of the three? I don't have the initial one.'",
        "'speaker_0': 'Can we look at them?'",
        "'speaker_1': 'Sure.'",
        "'speaker_3': 'You get to the car, give them to the clerk, and then she'll pass them. Thank you so much. Ms.. Adair.'",
        "'speaker_8': 'Okay. So for Mr. Women specifically, so the amount due was $14. With the late charges of 64 making total being 78, there's a additional $1 fee, which is a state fee. It's a state required fee added on to a business license.'",
        "'speaker_8': 'Our master office schedule also does have a fee for business license processing fee. It's an annual fee and it's flat amount, $25.'",
        "'speaker_3': 'And that's for the city.'",
        "'speaker_8': 'For the city. And that's. As I mentioned, it's part of the masterpiece schedule already.'",
        "'speaker_3': 'There's also it's not really $14. And if he'd paid on time, what would he have had to pay? 14 plus 25?'",
        "'speaker_1': 'Correct. I'm still confused. I think that doesn't get to the point of the mayor's question, the $14 or how is that composed? Because I heard this gentleman say he paid his his his bill.'",
        "'speaker_8': 'I would I don't have to back up for this particular business with me, so I would need to go and take a look. Okay. I apologize for that, but I can get you that information.'",
        "'speaker_3': 'I'm saying remember de sa.'",
        "'speaker_4': 'Thank you. Is it there for for your assistance? Much appreciate it. The question that I have is so this in this particular case, we're talking about a granny unit, as they call it. It's I believe it's a separate from the main house.'",
        "'speaker_4': 'Is that correct? It's on the same parcel, separate from the main house. But the parcel is owned, I suspect, by the resident who lives in the main house. That correct? Absolutely. And so the unit in the back is rented out.'",
        "'speaker_4': 'Now it has its separate completely right? Like it has its own kitchen and has its own bath and everything. So. So the rule regarding renting out single family homes doesn't apply.'",
        "'speaker_1': 'In this case.'",
        "'speaker_4': 'Is isn't that.'",
        "'speaker_7': 'A single.'",
        "'speaker_1': 'Family house?'",
        "'speaker_4': 'I mean, it's certainly not a duplex in the sense that like when you go down, I forgot that avenue. Yeah, there's all these duplexes that are attached to the same wall. So how does.'",
        "'speaker_8': 'The way what I can tell you is the way as part of the collection effort of the business license, because the Revenue Division, it's not just, you know, sending out a bill, but it's also making sure we do do a collection effort as well and making sure that the businesses comply with our current ordinances.'",
        "'speaker_8': 'So, in essence, compliance. So one of the ways we research or identify which businesses need to pay and if they are paying, is going through county records. So on a county record, on a parcel, they will identify, for example, that it's a owner, but it has two units on it.'",
        "'speaker_8': 'So and then once we'll look into that and identify that there's one owner, two units and send out letters. And I'm sure Mr.. When women can speak to that, but we identify that there's a unit that's been rented out as part of the I guess.'",
        "'speaker_1': 'I ask actually a question of how.'",
        "'speaker_0': 'They come in, use the microphone, because then we'll get it in the record.'",
        "'speaker_4': 'QUESTION Now, how is it.'",
        "'speaker_1': 'Determined that that unit is rented out? It's an in-law unit. It's been used as a guesthouse. It's been used as an office. There's an assumption that's made here that it's being rented out because it's two properties on one lot or two houses on one lot.'",
        "'speaker_0': 'And that was a question I had. Didn't we hear earlier that there's a license required for renting a duplex, but not a single family residence?'",
        "'speaker_7': 'And if I can help a little bit, I'm looking at the ordinance and it first, let's say we admit it's confusing.'",
        "'speaker_3': 'And I think it's also staff.'",
        "'speaker_1': 'Would.'",
        "'speaker_7': 'Would tell you that this ordinance, as has been pointed out, has been on the books for a long time and has been modified and revised many times over the years.'",
        "'speaker_3': 'And frankly.'",
        "'speaker_7': 'Could use.'",
        "'speaker_3': 'A nice dusting off and making it.'",
        "'speaker_7': 'Even more clear. However, on in in the definitions of hotel rooming house dwelling unit, there is.'",
        "'speaker_3': 'An exception.'",
        "'speaker_7': 'Where if you have a single family residence that you are renting. So the entire single family residence.'",
        "'speaker_3': 'You don't live.'",
        "'speaker_1': 'In, you live.'",
        "'speaker_7': 'Someplace else. It's a single family residence that is accepted. But everything else where there is any other unit.'",
        "'speaker_3': 'That you rent, rent.'",
        "'speaker_7': 'Lease or higher, you pay a.'",
        "'speaker_3': 'License fee of $5 for each room that's in.'",
        "'speaker_1': 'The building. And so what would happen in.'",
        "'speaker_3': 'A case like the mother in law type unit.'",
        "'speaker_7': 'Assuming it is rented, that the single family house.'",
        "'speaker_3': 'Would not qualify, but that is.'",
        "'speaker_1': 'Another.'",
        "'speaker_3': 'Unit on.'",
        "'speaker_7': 'That lot.'",
        "'speaker_3': 'And that one would qualify.'",
        "'speaker_7': 'To to.'",
        "'speaker_3': 'Be required to have a business license.'",
        "'speaker_7': 'That's what happens with duplexes.'",
        "'speaker_1': 'It's the two units.'",
        "'speaker_3': 'They both would be subject to a business license.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'And the reason.'",
        "'speaker_4': 'The reason why I'm even pursuing this is because it is my feeling, hey, you know, I rent out two rooms at my place. You know, there's a downstairs, and it's like, well, I'm just one guy, so my hotel just.'",
        "'speaker_4': 'It'd be empty. So. And I asked, do I have to pay a business license? And they asked, was it a single family house? Yes. Do you live in it? Yes. Well, then it no, you don't have to. So it's just kind of quirky that I don't have to pay a a business license of $20, but someone who'",
        "'speaker_4': ', for all intents and purposes, kind of meets the same attributes of the same owning the parcel, owning at least one unit and having a net. But having another unit, I don't know. If I had a C or I differ with Mr. Wong as if I had to alter it, I would say that I should pay a $20'",
        "'speaker_4': 'fee. I think all the people who are in some who are advertising on Craigslist, for example, should pay a $20 fee. But I think what we're hearing from Mr. Wong and from Mr. Wayman isn't so much the dollar amount, but just clarify what the rule is.'",
        "'speaker_4': 'And, and so that, you know, we get.'",
        "'speaker_1': 'Yeah, actually I do want to I do want to clarify. I mean, the dollar amount on an annualized basis, I mean, 20, 25 bucks. I mean, I've already I've already got my renewal notice, which I actually would like to pay before the July 31st deadline online because it's actually cheaper.'",
        "'speaker_1': 'You get a break if you do that. I'm not being allowed to right now because there is a balance. Do I don't have an issue paying 25 bucks a year if I'm renting it out, honestly, that's not a big deal.'",
        "'speaker_1': 'The issue that I have is I was not aware of it and the first notice I got of it tacked on a whole bunch of penalties that I didn't even I'm very willing to. Do the right thing and act in accordance with the with the requirement.'",
        "'speaker_1': 'But the first letter I receive is basically a stick. Saying You've screwed up. That's. That's it doesn't feel right.'",
        "'speaker_0': 'Thank you. May I ask you, Mr. Women? So how long? How long have you lived at that Central Avenue address?'",
        "'speaker_1': 'Since 2006.'",
        "'speaker_0': 'And then you've rented the back bungalow.'",
        "'speaker_1': 'It's been rented. It's been rented on and off. I was told, actually when I came here that I was actually being charged for fees due back to 2011. Which to me seems strange. It seems very arbitrary and capricious, to be honest.'",
        "'speaker_0': 'So this is in the past, you've paid these fees?'",
        "'speaker_1': 'No, no. I have never been aware of it.'",
        "'speaker_0': 'Under this this current billing cycle, you're being told that you're being paid. You're paying back to 2011.'",
        "'speaker_1': 'Yes. I have never. I have never received any notice that I was required to have any type of business license at all. So when we talked earlier about sort of first time offender, if you call me an offender, I guess that's that's perhaps what I am.'",
        "'speaker_1': 'But I had.'",
        "'speaker_0': 'No, it's offensive.'",
        "'speaker_1': 'I mean, I find that yeah, I find that maybe offensive. What I would ask. I think the city I think the city can do a better job letting folks know that this is required. And, you know, there are a number of different ways to do it.'",
        "'speaker_1': 'You can when multi-unit properties are sold, you can send a notice out to those folks. You can have it as a disclosure with real estate agents. If anyone who buys those properties, you can have an amp, put it a notice in once a year if you rent out a property, anyone who's got a property that has two'",
        "'speaker_1': 'different, you know, accounts on it, ahem, send that notice out. You can even. And this takes the carrot approach. You can run an ad in the journal and say you have to have one.'",
        "'speaker_4': 'And if you do, you have.'",
        "'speaker_1': 'A business license, you can go shop at Jetro on High Street because you have a business license. I would. I know a lot of people would love to be able to do that. So it's not all bad.'",
        "'speaker_4': 'It's just the.'",
        "'speaker_1': 'City I don't think has done enough to let folks know they need to do this.'",
        "'speaker_3': 'Thank you. And Vice Mayor.'",
        "'speaker_2': 'I have three points here in this.'",
        "'speaker_3': 'Gentlemen, you could have a seat at this point.'",
        "'speaker_2': 'Thank you for bringing this story.'",
        "'speaker_0': 'I'm in. Both of our speakers can sit right here.'",
        "'speaker_1': 'No, no.'",
        "'speaker_0': 'No. I want.'",
        "'speaker_1': 'To speak to.'",
        "'speaker_0': 'Him. Oh, Mr. Raymond. Yeah.'",
        "'speaker_1': 'Yes, it went well at my turn. Okay.'",
        "'speaker_3': 'So at this point, you could. Did you want to speak to the speaker? Is that what you're doing?'",
        "'speaker_2': 'All right.'",
        "'speaker_3': 'All right. All right. So you can have a seat until we call you back.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'I have two points. One is here in these two gentlemen, I'm inclined to ask that we waive their late fees. They've made due diligence efforts on very small amounts. I am not inclined to ask to waive the late fees on legacy partners.'",
        "'speaker_2': 'These are big companies. They know that they have to have a business license. This is not. Oh, we weren't aware. They owe us a lot of money. They have to do it. And the third point is we've got a Byzantine code there that really needs to be revamped.'",
        "'speaker_2': 'And I'd like to ask this council to direct staff. Start that process and give us a time on how long it's going to take to get there. I think the other point that goes along with that is the notification process and to come up, rather than us trying to cobble something together to ask staff to put together'",
        "'speaker_2': 'along with that revamping a notification process or disclosure process that lets people know who have to have business licenses that they need. But and the dates are right on their on. Once you have the business license, you know, when it's payable, due and payable.'",
        "'speaker_2': 'So Matthew.'",
        "'speaker_3': 'I may just quickly and I just want just for clarification and information, understand what vice mayor matter as he has has said.'",
        "'speaker_1': 'This is a tax, however.'",
        "'speaker_3': 'So while staff certainly can go through and try to update.'",
        "'speaker_7': 'This ordinance, which.'",
        "'speaker_3': 'Frankly probably would be very.'",
        "'speaker_1': 'Helpful, it will take a vote of the of the the voters of Alameda. It'll take a vote to change the business.'",
        "'speaker_2': 'When you bring back the weekend.'",
        "'speaker_7': 'I mean, it's just going to take a lot longer.'",
        "'speaker_1': 'I just heard that you've got.'",
        "'speaker_0': 'A problem in in the meantime, you know, you're winning. Think the public speaking part has ended, but the mayor can speak to that. But what I was going to say was I.'",
        "'speaker_1': 'Think I was just. I'm sorry.'",
        "'speaker_0': 'Oh, I'm sorry you were. And then I'd like to come back. So, yes, I've already been.'",
        "'speaker_1': 'Cut off.'",
        "'speaker_0': 'Once. I'm so patient. Yeah.'",
        "'speaker_3': 'All right, Vice, see where you stand. All right. Member.'",
        "'speaker_1': 'Thank you, Madam Mayor. I actually had a couple questions for Mr. Wayman, so I'm still confused. What? You know what this $14 is for? No. 14. The first time I heard about this, $14 was when the mayor said it.'",
        "'speaker_1': 'So. And you've paid something? I came in and I paid a sum, I think a check for somewhere in the neighborhood of 50 to $60 to get my license and the late fee as before, before the notice given on the first letter, which I don't I don't have.'",
        "'speaker_1': 'So then my understanding from staff is that they cannot tell us at this point what that $14 represents, what year or anything. Is that is that correct? I mean, this gentleman says he's paid. Well, first of all, you said that you don't rent that place.'",
        "'speaker_1': 'So, no, it's not that I said I didn't rent it like I do it. I'm that's I'm saying it hasn't necessarily been rented like full time. I was originally told these were fees going back to 2011 and it hasn't been rented the whole time.'",
        "'speaker_1': 'I guess that that's that's a little bit what concerns me is I don't know this $14. You know what what it I don't either and I would think and no disrespect to staff but I think if you're going to come and ask us to put something on somebody, you know, property tax assessment that, you know, if they'",
        "'speaker_1': 'come and appeal, that we would be able to have that information in front of us. So we know what you know, what we're actually doing. I mean, for what time periods. And, you know, we'd have the file and we could ask questions for future, you know, I I'd like to see that.'",
        "'speaker_1': 'So. Mr.. MCDANIEL Can you can you ask can you restate what you're asking this counsel to do related to your account? Yes, I'm asking I'm asking to to waive all of the penalties for whatever goes back to 2011.'",
        "'speaker_1': 'I've got my business license. Ah, the I've paid the business license fee I'm current for this year. I will renew in subsequent years when, when I've got the place rented and we'll continue to do that. I would just like to wipe out all the back stuff as a, as basically a first time offense since I was unaware'",
        "'speaker_1': '. And just to be clear, does your request include that $14 that's alleged is the amount? I suppose so, because I have no idea what that's for. I know I've paid my business license. I actually have the renewal form here, so I'm up to date on that already.'",
        "'speaker_1': 'No idea what that 14. I appreciate I appreciate that request.'",
        "'speaker_3': 'It shows that you owe $156.62. And that's my understanding. You're asking that that be waived.'",
        "'speaker_0': 'Let's make sure that he gets his letters back. I we were circling them around. Okay. Thank you.'",
        "'speaker_1': 'Is it time for talking or are we still doing your questions? Because I kind of wanted to follow up. May I.'",
        "'speaker_8': 'Clarify something, council members, just to let you know that what happens is the ordinance allows us to go back no more than three years, I believe, to collect any business license fees that haven't been paid. So what Mr. Women seen is that the if the business license hasn't been paid, then we can only go back three years'",
        "'speaker_8': 'and collect those. So should he. You know, as you mentioned here, has had it for several years. We cannot go back that far. We can only do so many years. And that's authorized by the ordinance.'",
        "'speaker_1': 'But all right. With the assumption that it was, in fact, rented during that period of time, well, we don't know because we don't know. So it could be. It could not be. I mean, that that's that was part of my point.'",
        "'speaker_1': 'I would like to know that information before we put a property tax assessment on your property taxes.'",
        "'speaker_4': 'I spoke to Mr. Raymond and.'",
        "'speaker_1': 'I'm actually retired. You're winning, so you might want to sit down. No, no, no. And that's just it. I think you're.'",
        "'speaker_4': 'Concerned that I'm trying to over argue the case. And I spoke to Mr. Raymond. I am a retired attorney. I have written California legislation. Okay. Thank you. And Mr. Raymond is very wise and we both are volunteering our services to help.'",
        "'speaker_3': 'We appreciate that. Okay. Thank you very.'",
        "'speaker_1': 'Much that we can with the.'",
        "'speaker_3': 'Client. Let us have our conversation. Thank you. Thank you. All right. Member Ashcraft.'",
        "'speaker_0': 'Yeah. So thank you, everyone, for your comments. I am troubled by a number of things. I, I do understand the concept of a penalty and a penalty in creasing as time goes by because it gives you an incentive to pay on time and and correct any arrearages.'",
        "'speaker_0': 'Quickly, I read two of those three letters that were sent, and I'm an attorney too, and I'm all for plain English and saying what needs to be said. And I, I think the letters could, could be more informative and not just the letters that are sent out.'",
        "'speaker_0': 'I think we I'm I'm a little unclear as to the whole process of how we put these lists together. But in this day and age, there should be a wide variety of ways that we reach out to our community and let them know if there is a fee or a, you know, a license or a tax or'",
        "'speaker_0': 'something they should be paying. And it's both print media, but it should be electronic media, too. We have a website and maybe it's on there, I'm not sure. But it should be easier for the the average citizen to and I think we have some above average citizens here.'",
        "'speaker_0': 'But be that as it may, anybody should be able to understand clearly and simply what is expected of them. And once that, you know, we have that process and that clarity in place, then I feel comfortable going forward and imposing penalties.'",
        "'speaker_0': 'But I do think this is something that we need to spend a little more time on. Because I just think that we're not we're not doing ourselves or our residents any favors when we're as unclear as this appears to be.'",
        "'speaker_0': 'And this is on the business license part.'",
        "'speaker_3': 'So there were no questions or comments in regards to the waste management lines. Is there any interest in having a motion to approve that and discuss it separately that way? That's what I would prefer.'",
        "'speaker_2': 'I'll make that motion move the approval of the lens on the Integrated Waste Management lens.'",
        "'speaker_3': 'Do we have a second?'",
        "'speaker_0': 'A second that any discussion? Well, and I'll also note that just in the time that our packet came out online and today, this afternoon, the original amount owed on the Integrated Waste Management fees was 13,167. It's down to 9800.'",
        "'speaker_0': 'So, you know, hopefully it keeps going down. But anyway.'",
        "'speaker_3': 'The variety and.'",
        "'speaker_1': 'Just one quick point. I mean, we've we've given notice to individuals on the waste management list, giving them notice at this hearing. And as far as I know, no one has come to appeal or dispute or try to clarify anything and with proper notice.'",
        "'speaker_1': 'So I'll be supportive of this motion.'",
        "'speaker_3': 'Can staff confirm member Otis comments in regards to We did not receive any challenges on this. We didn't. Thank you. All right, all those in favor. Why? That motion carries unanimously. Thank you. And now to the 2015 delinquent business license tax issue.'",
        "'speaker_1': 'And I'm here.'",
        "'speaker_3': 'A member already.'",
        "'speaker_1': 'Thank you, Madam Chair. So. I kind of want to echo what I think I've heard from my colleagues over on the other side of the the dais here. We had a list here of 17 different delinquent business license tax.'",
        "'speaker_1': '15 of them were given notice of this hearing, and 15 of them did not come and appeal or otherwise dispute. So I would be in favor of moving forward with those 15 and the two individuals that came. Mr. Wong apparently has paid and I would be in favor of waiving the late charge on that.'",
        "'speaker_1': 'And then on Mr. Women's matter, I do not believe I have enough information to. Assess him on this. And I would also move to grant his request for a waiver of his complete $156.62 as well.'",
        "'speaker_2': 'I'll second that motion member Ashcroft.'",
        "'speaker_0': 'And just a clarification point. It is in actually 17 individuals because the legacy partners has for 17 parcels. Parcels. Okay.'",
        "'speaker_3': 'All right. So concerns.'",
        "'speaker_0': 'That sounds reasonable.'",
        "'speaker_3': 'So I would prefer not including item parcels one through six. I'm concerned that the late charges greatly exceed it's actually more than 100%. You have an initial fee of $120, for instance, on number on parcel number one. And the total amount due today is 321.'",
        "'speaker_3': 'That is more than a 100% increase. So I have concerns about these additional late charges. So I would not support pursuing item the first six passes. I'm I agree with vice mayor in regards to legacy partners that we know that they no, I actually do not know that these one these other ones know the fact that these'",
        "'speaker_3': 'two came today, whereas in questions of notice, in fact, suggests that without confirmation that these other individuals are aware of this and having what appears to be sometimes as great as a 300% increase, I think that's very significant and I would not be able to support that.'",
        "'speaker_3': 'However, in regards to our source, what appears to be more of a business where we were confident that they would know what's going on as opposed to someone that appears to be an individual.'",
        "'speaker_0': 'So I as I understand it, the 100% cap is on the late charge. By the time you add processing and county fees, it may get up higher than that. But I. This is what the the fears that was set by ordinance.'",
        "'speaker_0': 'And so I don't think we're here properly to dispute that. And also, I would caution a little about assuming that Legacy Partners got noticed and others didn't.'",
        "'speaker_3': 'So that's so I'm saying I do not accept this as is I do not know that these people received these notices. And as far as I know, these are individuals within our community. When the bill starts at 120 and today we're asking for 321 or.'",
        "'speaker_3': 'And there's many examples of similar numbers on here. Without knowing that these individuals receive this. That's my concern is I do not know and I don't have that documented.'",
        "'speaker_0': 'But of course, you understand the legal definition of a notice being there.'",
        "'speaker_3': 'I actually don't appreciate your comment at this point. I understand you don't appear to be listening to what I'm saying, so I am not willing to support these. But I would consider egregious taxes on entities, on individuals that we cannot confirm that they actually received notice.'",
        "'speaker_3': 'And we have had that issue raised this evening that there may very well be issues in regards to receipt, unless it's in fact where we know, for instance, legacy partners, I'm confident that they received notice and understand what's occurring here.'",
        "'speaker_3': 'But I think that the amounts, the total is so egregious without any confirmation. And this ledger, I think, is insufficient. That's my position. Member de SAC.'",
        "'speaker_4': 'Thank you very much. You know, what I want to address my comments to is just kind of like this. And if curious way that we go about applying the business license tax fee on residential properties. I think during the housing discussions that we had earlier this spring, which will hopefully come back to us sooner rather than later'",
        "'speaker_4': '. One of the things I mentioned was this whole issue where I don't have to pay a business license fee and maybe there's state laws as to why we don't allow single family units to pay business license fee. But it seems to me that.'",
        "'speaker_4': 'Whatever argument there is for a gent. The gentlemen such as Mr. Wayman, you pay a business license fee for a granny flat should hold. While it might not be the same, I think the thrust should still hold. Or those who own a single family unit and live in it.'",
        "'speaker_4': 'And rent it out. So for example. In Alameda, there are 15,800 rental units and 15,800 of the 15,800. There are roughly 4100. Single family units. Now some of those 4100 are paying a business license fee because as the owner doesn't live in it, though.'",
        "'speaker_4': 'But a good number of them aren't. I would be the example. And. And so. You know, it's very difficult to estimate how much you can generate by the $20 a year. But, you know, if you kind of ballpark it low to high, I mean, you've got enough collection possibly there to run the whatever affordable housing program or'",
        "'speaker_4': 'whatever program we want to do to to help. The Rent Review Advisory Board, you've got enough revenue being generated there. So. So I like, uh, council member Vice Mayor Matt Orestes point about looking at this because I think this was really an opportunity.'",
        "'speaker_4': 'I don't want to say this is going to solve all the rent review advisory board type of issues. But, you know, there might be some money there to to help them expand in doing their task.'",
        "'speaker_3': 'So I also agree with that. Is there any other council members you want to weigh in on that? The suggestion. Thank you. All right. So we have a motion and the second. All those.'",
        "'speaker_7': 'May I make just a comment? Two things. I would just respectfully ask not to throw the baby out with the bathwater. If we had to verify every time somebody got a receipt, we'd have to do return receipt. There's no way we could do that.'",
        "'speaker_7': 'We cannot verify to make sure that everybody received these notices. We have 4000 businesses in this community with three notices that would be impossible to do. So we do make our best effort. I understand from time to time we probably don't get it right.'",
        "'speaker_7': 'And I think it's perfectly appropriate for people who come tonight to ask for a waiver for you to provide that. But I respectfully request that you don't do that as a policy. I think that just would be very detrimental.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'So I'll respond then that my position continues to be that when the penalties are so egregious that we have a serious issue and we did have that issue raised.'",
        "'speaker_0': 'And so we have a motion. And what was the motion? I wasn't.'",
        "'speaker_1': 'Clear. The motion was to attach the 15. 15 of the 17. Yes. And waive Mr. Wong's one and.'",
        "'speaker_0': 'Mr. Wei.'",
        "'speaker_1': 'Mr. Wong and Mr. Waymon per their request. With the understanding that this was a publicly noticed hearing.'",
        "'speaker_0': 'And it was seconded, right?'",
        "'speaker_3': 'Yes. Yes. And I will not be supporting this. Not because I agree. I agree. You should not have to pay us. But I have concerns in regards to these other individuals also. All those in favor.'",
        "'speaker_1': 'Hi.'",
        "'speaker_8': 'May I just clarify for Mr. Wayman? Are you waiving everything or just delay charges and fees?'",
        "'speaker_1': 'I think it was. The motion included everything. I believe that I can tell you the amount of get one giving 62.'",
        "'speaker_0': 'Yeah. Given all the confusion.'",
        "'speaker_1': 'Not being able to go.'",
        "'speaker_0': 'Back to 2011.'",
        "'speaker_1': 'I have clarity on what that $14 represented as far as a year.'",
        "'speaker_3': 'Thank you. Thank you, gentlemen. Six C.'",
        "'speaker_5': 'A recommendation to provide input to Adrian Associates on the qualifications of a city manager, the recruitment brochure and the selection process.'"
    ],
    "Input on City Manager Recruitment and Selection Process.": [
        "'speaker_7': 'Good evening, Mayor and City Council members. My name is Stephanie Geller, Brant Serra. I am your administrative services director. And first of all, would you like an update on the score? Yeah, it's 98 to 79 with 3 minutes left to play.'",
        "'speaker_1': 'Is that us?'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'Oh, so just had to get.'",
        "'speaker_0': 'That off sometimes. Those last 3 minutes. Those last.'",
        "'speaker_7': '3 minutes. But it's a 19 point game. So go warriors anyway. I know you all expected to see Paul Comer here tonight. He has a grievous and tragic family emergency that he had to attend to today. And we're all keeping him in our thoughts.'",
        "'speaker_7': 'Meanwhile, I'm here today to kind of go over some of the things that he shared with me. He very much wanted to discuss with you the recruitment process that he had envisioned for the city manager, recruitment for you all.'",
        "'speaker_7': 'And and also take some input regarding the attributes you would all like to see in your next city manager. Now, because he could not be here tonight, he would like to schedule individual meetings with all of you to take your individual input.'",
        "'speaker_7': 'But to.'",
        "'speaker_1': 'Council.'",
        "'speaker_2': 'Member de song.'",
        "'speaker_4': 'Point of order you might want to. When you ask us for attributes, give us, you know, indications as to what we are not technically allowed to legally allowed to say in terms of attributes.'",
        "'speaker_7': 'Well, certainly so. That is sexual harassment. Training, by the way, is scheduled for June 30th of this month.'",
        "'speaker_1': 'The same with women. Oh.'",
        "'speaker_7': 'And and your discrimination training and bias training. That is actually this month, coincidentally. But absolutely, we would like to to stay clear of any attributes that would steer towards any bias in race, sex, age, any protected classifications, including disabilities.'",
        "'speaker_7': 'And we're looking for specifically experience and focus education requirements, perhaps that sort of nature. And again. Mr. Camara would like to meet with all you all individually to discuss this, but this is your opportunity to to speak with one another.'",
        "'speaker_7': 'And so I wanted to make sure that you had that opportunity tonight. I would also. There is a recruitment process, timeline I did that was made available to you, I believe. If it's not, I can go over that with you.'",
        "'speaker_7': 'It's pretty basic. What he had envisioned was to discuss with all of you sort of your vision of what is what you would like to see in the brochure. The brochure is actually just a marketing tool. There's not a lot of words in it, but it's a it's a very targeted document.'",
        "'speaker_7': 'And the council input is needed to identify and highlight the most important operational, financial, strategic priorities for the position. And the most critical candidate attributes is what he had stated. He would also like to have a town meeting before the brochure is collected and and the h.R.'",
        "'speaker_7': 'Staff is going to assist him in that endeavor and we can schedule that. The last piece of the public outreach before the brochure is actually printed is a survey via SurveyMonkey and an example that was provided to you.'",
        "'speaker_7': 'And if you would like to make any comments or corrections on that, you can let me know or you can. I believe that there's there was a copy given to you and it's pretty basic. It's just basically discusses what a council, what a city manager's main priorities, what they want the priorities to be.'",
        "'speaker_7': 'And that is going to be posted on our website and until the actual recruitment closes. So it's not only going to be used for the development of the brochure, but it will stay open. The survey will stay open until the actual recruitment closes so that you can take a take a sort of a gander at what the'",
        "'speaker_7': 'what the public saying about what they want to see in their city manager. When you get to the selection process, after the brochure is printed and distributed for a certain period of time, their firm will then collect the data.'",
        "'speaker_7': 'And they were they'll go they will sort of make lots of recommendations on who they think are the top candidates. In addition, what we have done in the past and what we recommend is all the resumes that we receive will be put in a binder for you so you can see them all.'",
        "'speaker_7': 'Nothing is going to be held back from you. You're going to be able to see all of them. In the past there was a binder kept on the third floor, so any one of you could check it out and take a look and sort of make notes and and decide which candidates do you really want to see'",
        "'speaker_7': '. And then in closed session, you can discuss the top candidates and decide who you want to interview after you've put it into a long list. Then we would have panel interviews and that's with you, and that's a panels of your choosing.'",
        "'speaker_7': 'And it can be up to three different panels and those who can be community members, business leaders, any sort of nonprofit groups that you think would be vital to have in a in a. In a screening sort of process to really about the candidates.'",
        "'speaker_7': 'And so after that, the list gets smaller and you guys make your decision in closed session and hammered out.'",
        "'speaker_3': 'That's basically what members were. Do you have comments you'd like to share at this point? Well.'",
        "'speaker_0': 'What was that? What was the process you're looking for in terms of actually.'",
        "'speaker_7': 'We're just looking for input or feedback. If you'd like to discuss it today and give me some feedback today, that would be great. Normally I'd be Paul and he'd be talking to him, but I'm here now and you're welcome to talk to me about it.'",
        "'speaker_3': 'So I'm happy to start. Sure. I'm I appreciate that all the applications will be collected so that we can all review them and give feedback and then discuss it and decide who we're going to interview as a support that process.'",
        "'speaker_3': 'Personally, I will be looking forward to hopefully receiving some applications from current employees and Allen meetings. Thank you.'",
        "'speaker_2': 'Adama?'",
        "'speaker_3': 'Yes, Vice Mayor.'",
        "'speaker_2': 'I at the risk of. Well, I'll say this anyway. Is is Mr. Chmura going to be back? Does he have a second? Because if the situation goes longer than he anticipates, does he have someone who.'",
        "'speaker_7': 'If he's planning on coming back, he's going to be back in the Bay Area tonight, actually, today or tomorrow. He needed to be with family today.'",
        "'speaker_0': 'Thank you. Thank you for.'",
        "'speaker_2': 'Making sure that we have. Yes.'",
        "'speaker_7': 'Yes. No, he he he will be back tomorrow. And he he tried to call me a couple of times today, and I told him he needed, you know, just be with your family right now. Thank you. But he will be back tomorrow.'",
        "'speaker_3': 'In other comments, remember.'",
        "'speaker_1': 'Oh.'",
        "'speaker_0': 'I have to go that way. I won't cut you off.'",
        "'speaker_1': 'Oh, no, it was. It was a. It was on the consent calendar. I didn't have an opportunity to speak and the discussion was closed really fast. So. Thank you for. Thank you for. Thank you. So thank you for stepping in for Mr. Kummer.'",
        "'speaker_1': 'I appreciate that. I like the idea of the town hall meeting where we, the public, can have some input. I also like the process that we we did the last time we recruited where we had various panels and then we had a panel that the council was able to appoint, you know, one or two community members to'",
        "'speaker_1': 'that panel. So we had a wide range and, you know, and a diverse. Group of community members that can evaluate. And I think they all came up to a unanimous decision. So hopefully we'll have the same thing. I like the idea of having individual meetings with the council members so we can share some of our thoughts on'",
        "'speaker_1': 'where we want to move forward with the city. You know, I'm pretty open. I think I said this before, you know, whether we're you know, whether we get, you know, somebody that's experienced or whether we get somebody that's, you know, hungry and new, whether we get someone that's, you know, ready to take the next step.'",
        "'speaker_1': 'That may not be a city manager right now. So, you know, I hope that we do have a wide range of of applicants and experience. This is an exciting time for our city. So, you know, we're growing and, you know, we have a lot of opportunities and there are a lot of people out there that are, you'",
        "'speaker_1': 'know, ready to take that next step. So I would encourage them, you know, us to try to recruit them. You know, I'd like to see us, you know, if I had a preference. There's somebody that has knowledge and experience in the Bay Area.'",
        "'speaker_1': 'It doesn't have to be in Alameda, but at least the Bay Area as opposed to Southern California. But, you know, if there's a star down there that that's ready and that that understands our culture and, you know, understands our region, then that would be helpful as well.'",
        "'speaker_1': 'That's kind of all I really had add to add at this time. Mm hmm.'",
        "'speaker_3': 'And I apologize if earlier you didn't feel.'",
        "'speaker_1': 'Like it passed unanimously. So it's for everyone.'",
        "'speaker_0': 'Member Congress we'll try to make it up to you. The. I think that. Thank you very much. And I'm excited to get started with this process. One of the things that I've thought of and I'll refine my thoughts more before I meet with Mr. Chmura, but I'm looking for a city manager who can work with the Council'",
        "'speaker_0': 'of strong individuals, strong personalities, strong opinions. And I think that this is perhaps the most important decision this council will make, because we are at the brink of doing a lot of exciting things in Alameda, and we need someone who can run this city well now with an eye to the future.'",
        "'speaker_0': 'And and it's also important to me to have someone who will work equally with all members of the city council. And the while, I am certainly supportive of having various panels have an opportunity to meet and interview. The ultimate decision, I feel, has to rest with the city council because the city manager is one of our our'",
        "'speaker_0': 'direct reports. And I think that's a a responsibility that we don't see to others. So anyway, that's I think that's. A good start for the evening. And I do appreciate the vice mayor raising the question of Mr. Cameras.'",
        "'speaker_0': 'Eventual or coming up soon availability because I think we also made clear in the selection process that it was him not his partner, that we wanted for Alameda search member Daisuke.'",
        "'speaker_4': 'Thank you, Madam Mayor. I think I'm just going to say some thoughts in how you, you know, put that paper. I'll leave that to you. But there are several. I think everybody every council member in every city says that their city is unique and clearly every city is unique.'",
        "'speaker_4': 'But, you know, I think most of us share the same types of cost centers when it on the budget side. Most of us share, you know, the same thoughts on staffing ratios, etc.. But there are uniqueness to Alameda that I think many places can't point to.'",
        "'speaker_4': 'And I think it has to be part of the decision making process. For example, not the organizational structure with regard to Alameda Point, as well as the fact of Alameda Point as a large brownfield redevelopment area. That's a uniqueness that many cities don't have overall, not just the construction entitlement related issues, but also, you know, that the'",
        "'speaker_4': 'way in which that connects with federal laws, etc., and state laws. And another uniqueness is, is the city of Alameda is electric utility AMP. Many cities don't have their own electric utility. The what I'm getting at, though, is what I want to hear is how city managers or or assistant city managers are dealt with similar.'",
        "'speaker_4': 'For example, while many cities don't have a standalone utility company. Many cities might have their own wastewater or water treatment, whatever, as a standalone enterprise fund generate. So so same of this same type of issues of ratepayer issues of of of assets, stranded assets.'",
        "'speaker_4': 'The same type of questions arise in those scenarios that would also apply to experience with with electric company. So, so what I'm getting at is even though not every candidate is dealt with, might have dealt with base closure, look for kind of proxies that come close to it.'",
        "'speaker_4': 'So a proxy the base closure might be. You know, a large infill brownfield redevelopment project, a multi-year project. So so look and again that back to the the Enterprise Fund of of of amp look for you know what what kind of proxies my might shed some light in terms of someone's experience in handling that managing that.'",
        "'speaker_4': 'So I think that's the thing that that crosses my mind. So even though people might not have managed or been a part of the governing board of Electric Company. You know, figure out ways to the I we as a council and a community can kind of pass out where there might be some crossover relevant crossover experience.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Any other comments? So I appreciate staff attaching all these copies to what other cities have done and as well as Alameda. And so I'm expecting that we will be given a draft and all of us will be able to give feedback and and that of this team or of Avery will somehow be coordinating with all of us'",
        "'speaker_3': 'for feedback. And if you look at the one from Alameda, of course, it's stated at this point, but a lot of it is still very valid and done nicely, I think. Thank you for sharing it.'",
        "'speaker_7': 'Right. And I would like to roll ahead with the SurveyMonkey survey, and we can do that and then right away. So if that's good with you, I'm going to had an exciting.'",
        "'speaker_3': 'Moment with that.'",
        "'speaker_2': 'Any concerns you see with the question?'",
        "'speaker_3': 'So if you can come up with.'",
        "'speaker_7': 'Oh, no, you were given.'",
        "'speaker_1': 'The fact that were talking about those. Yes. Okay. Yeah, that's fine.'",
        "'speaker_7': 'Yes.'",
        "'speaker_1': 'I mean.'",
        "'speaker_7': 'Yes. As written, I'm sorry about that.'",
        "'speaker_1': 'Scientific, but it's not that scientific.'",
        "'speaker_7': 'It's not that scientific.'",
        "'speaker_3': 'But makes it unpredictable to add comments. Yes. So yes, which is fine is electronic. We can disseminate it into the community, can be aware that we will be using an electronic survey member Ashcraft.'",
        "'speaker_0': 'And what's the timeframe for when our one on one interviews with Mr. Cameron will.'",
        "'speaker_7': 'In the very near future because we want to move this along so we will probably contact you next week.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Thank you. Before July. Yes, thank you. All right. Any other comments on that item? Thank you. Thank you. Thank you very much. City Manager Communications.'",
        "'speaker_1': 'You're up. All right.'",
        "'speaker_7': 'You're a nun, madam. Thank you.'",
        "'speaker_3': 'All right. Thank you. Or communications? Not agenda. Thank you, counselor. Referrals? None. Wonderful council communications. At this point, council members can address on any matter, not on the agenda. And Brody.'",
        "'speaker_1': 'Thank you, madam. I have two quick ones. This morning I attended the Alameda County Waste Management Authority meeting of the Programs and Administration Committee. And I guess I would say nothing of note that impacts alameda was discussed and last Friday I had the honor to attend the Boys and Girls Club annual meeting and recognize Linda Callaway.'"
    ]
}