{
    "Proclamation Recognizing Public Power Week and Alameda Municipal Power's Service.": [
        "'speaker_1': 'Proclamation recognizing public power week October 4th through 10th, a weeklong celebration of Alameda Municipal Power's year round service to the city of Alameda.'",
        "'speaker_0': 'Mary Sutter will be accepting this from our. Public Utility Board. She's our president. You can come up to the podium and I will be reading this. Whereas we, the residents of the City of Alameda place a high value on local control of community services and therefore have chosen to operate a community owned, locally controlled, not for profit'",
        "'speaker_0': 'electric utility. And as consumers and owners of the electric utility have a direct say in utility operations and policies. And. WHEREAS, Alameda Municipal Power provides homes, businesses and local government agencies with very reliable, efficient, cost effective and green electricity and its local operation and workforce continue to make our community a better place in which to live and'",
        "'speaker_0': 'work. And. WHEREAS, Alameda Municipal Power is a valuable community asset that contributes substantially to the well-being of residents through energy efficiency, customer service, environmental protection, economic development, and safety awareness. And. Whereas, Alameda Municipal Power is a dependable and trustworthy institution whose lower rates translate into an annual savings of nearly $10 million each year for Alameda and while'",
        "'speaker_0': 'directly contributing to the city of Alameda, its economic well-being and quality of life with annual transfers of over $4 million. Now, therefore, be it resolved that Alameda Municipal Power will continue to work to bring lower cost, safe, reliable electricity to our communities, homes and businesses as it has since 1887, the year when the utility was created to'",
        "'speaker_0': 'serve Alameda and yet further resolved that our community joins hands with more than 2000 other public power systems in the United States in celebration of public power and recognition that Alameda Municipal Power is good for consumers, business, the community and our nation.'",
        "'speaker_0': 'Be it further resolved that I Treasurer Spencer, Mayor of the City of Alameda, do hereby proclaim the week of October 4th through the 10th as Public Power Week 2015 in order to honor Alameda Alameda Municipal Power for its contributions to the community and to make its customers, owners, policymakers, and employees more aware of its contributions to their'",
        "'speaker_0': 'well-being and how it makes their lives more powerful.'",
        "'speaker_3': 'Think I do want to say I am very.'",
        "'speaker_0': 'Pleased to be.'",
        "'speaker_3': 'Able to accept this on behalf of Almeida Municipal Power. I feel like it's a it's a fabulous organization and a very strong component of the city. Thank you very much.'",
        "'speaker_0': 'Thank you. All right, our next proclamation, see?'"
    ],
    "Proclamation for Walk and Roll to School Day.": [
        "'speaker_1': 'Proclamation declaring October 7th as walk and roll to school day.'",
        "'speaker_0': 'And the recipients of this are Dr. Clam. Nina Clam.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'On behalf of Otis, I want to thank you, Madam Mayor, and members of City Council. Yes, I'm Dr. Clem, principal of Otis Elementary School. And I brought with me a student who's an avid biker. She loves her bike as well as my walk and roll to school day volunteer coordinator Erin Crites Shirey.'",
        "'speaker_1': 'So we are very excited that tomorrow is Walk In, Roll International, Walk and Roll Day. And in Alameda we'll have 14 elementary and middle schools participating in this very exciting activity and events. I'm going to let Aaron describe to you what our day is going to be like.'",
        "'speaker_3': 'When we start.'",
        "'speaker_0': 'School. Thank you.'",
        "'speaker_3': 'Hello. So Otis has got a very, very.'",
        "'speaker_0': 'Active and vibrant walk in school walk enrolled in school, a program of which.'",
        "'speaker_1': 'Mayor Spencer has been a participant.'",
        "'speaker_0': 'Of. Tomorrow morning it starts out, everyone comes to school, they walk, they roll, they ride their bikes. You hop, skip, jump any which way to get to school and are high fived and given a big sticker upon getting to school.'",
        "'speaker_1': 'And then there's a dance party.'",
        "'speaker_0': 'The dance party has everybody dancing on is having a dance off. Dr. Clem and I are known for doing Running Man dance offs and it gets everyone rallied and celebrating. Fitness is fun. Then from.'",
        "'speaker_3': 'There, we come on over.'",
        "'speaker_0': 'With all of the grades in their class colors, this rainbow of colors of kids. And we are going to be doing an entire school with.'",
        "'speaker_1': 'A name, a dance.'",
        "'speaker_0': 'Celebration tomorrow, where the entire school is practicing the whip. And the focus of walking to school is to celebrate just the physical activity, active commuting, the community itself, the camaraderie among among the celebration of healthy fitness fun and Otis is program has been so much joy to enrich throughout the last few.'",
        "'speaker_4': 'Years of.'",
        "'speaker_1': 'Taking it.'",
        "'speaker_0': 'On. So is there anything else I need to add? You think.'",
        "'speaker_1': 'All week long and use.'",
        "'speaker_4': 'The microphone. So everybody. Sorry.'",
        "'speaker_1': 'All week long we have been celebrating healthy habits because walk and roll teaches our kids not only to be healthy and fit, but also to keep our environment healthy. And so we started out on Monday with assemblies from safe routes to school, about with rock study, juggling, about reducing, reusing, recycling and being and walking and rolling to'",
        "'speaker_1': 'school. And then actually on Friday we even have a BMX freestyle bike assembly on our yard to teach kids about how much fun it is to bike. So lots of activities all week long.'",
        "'speaker_0': 'Now I'll read the proclamation. Whereas the city of Alameda joins with the Alameda Unified School District, Alameda County Safe Routes to Schools Program and Bike Walk ALAMEDA In Promoting Wednesday, October 7th, 2015 as walking World School Day. Whereas Walk and Roll to School Day is celebrated as the day to encourage students to walk, bicycle, skate or scooter'",
        "'speaker_0': 'to school. And. Whereas, this day is an opportunity to promote physical activity, educate students about traffic safety, help parents, grandparents, friends and neighbors to spend more time with children, reduce automobile use and traffic hazards, and create a safer, healthier and more environmentally sustainable community.'",
        "'speaker_0': 'And. Whereas, Walking World to School Day gives everyone the chance to take an active part in an international event and walk with children from around the world. And. Whereas, by using the school maps and traffic safety tips provided by the Public Works Department, students will become smarter and healthier.'",
        "'speaker_0': 'Non-Motorized Travelers. Now, therefore, be it resolved that I, Treasurer Spencer, Mayor of the City of Alameda, do hereby proclaim Wednesday, October 7th as walk and roll to School Day 2015 and invite all Alameda residents, businesses, civic groups and other organizations to participate.'",
        "'speaker_5': 'Thank you. Thank you.'",
        "'speaker_0': 'Can. I wanted to add I want to emphasize the part about it being an international day. We do join communities around the world in celebrating this day. Thank you, member.'",
        "'speaker_6': 'Thank you, Madam Chair. I was invited to participate in Bay Farm Elementary or Bay Farm School's Walk and Roll Day tomorrow, so I'll be there. My kids have long gone from Bay Farm School, but it's an honor to participate in that and I hope my colleagues will participate in it as well.'",
        "'speaker_6': 'It's going to be an exciting day.'",
        "'speaker_0': 'As far as standing for pretty much all our and other leaders throughout the community. Member Echo.'",
        "'speaker_4': 'So I just want to say thank you all for being here. And it's a special treat to see Aaron Shirey because once upon a time she used to babysit for my twins there, too. They're 24 years old now, Erin, and now she's 23 little girls of her own.'",
        "'speaker_4': 'Now, you stayed young, but I just came back. Actually, a number of us in the council attended the League of California Cities annual conference in San Jose last week. And on Friday I attended a session on cities, building community, healthy communities all over the state.'",
        "'speaker_4': 'And I want to know that what you're doing is practically award winning and it's hopefully replicated all over the city. And and I would love to see it not just be a day. And I know I mean, if you've seen Erin, even when she was pushing a baby stroller, she was jogging behind it.'",
        "'speaker_4': 'I never did that. But but we really we will be a healthier community, will have less traffic impact if we could get more parents to let their kids walk role and ride to school. And yes, I will be out starting at lamb and then I'm racing across the yard to Wood Middle School after that.'",
        "'speaker_4': 'So I've got a24. But thank you so much for coming in presenting tonight.'",
        "'speaker_1': 'Thank you. Actually want to thank everybody because I know many of you are participating. There are a lot of VIPs coming to all of our schools. It is truly a community wide effort. And I just want to assure you, it's a yearlong effort all the time at our schools to keep keep healthy habits alive.'",
        "'speaker_0': 'Okay. Just a moment, please. Remember Daisy.'",
        "'speaker_7': 'Yes. Thank you very much for coming out tonight and passing along the word about tomorrow's important event. I take special pleasure all the time in taking part in the Payton schools walk and roll data school, the elementary school that I went to many years ago.'",
        "'speaker_7': 'And it's great to see so many kids taking that day to walk and ride their bikes.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'I'll be at Mylan this year, so. Good luck with your dancing.'",
        "'speaker_1': 'Make sure you all wear your tennis shoes.'",
        "'speaker_3': 'Yes. We'll get.'",
        "'speaker_1': 'You going. Thank you. Thank you.'",
        "'speaker_0': 'Very much. Oh, wait.'",
        "'speaker_1': 'Oh, yeah. Should I come back on this project? Oh, yeah.'",
        "'speaker_3': 'Yeah. Hmm.'",
        "'speaker_7': 'A.'",
        "'speaker_0': 'All right, next presentation.'"
    ],
    "Approval of Minutes for September 1, 2015 Meetings.": [
        "'speaker_0': 'All of them favor I. Motion carries unanimously 5.'",
        "'speaker_1': 'Minutes of the special regular city council meetings held on September 1st, 2015, and before the Council tonight. I have emailed all of you and we have expanded one of the motions from the September 1st meeting to get a little more of the detail.'",
        "'speaker_3': 'So that is before you incorporate.'",
        "'speaker_0': 'So do we have a motion?'",
        "'speaker_6': 'I'll move approval of item five as corrected.'",
        "'speaker_0': 'Second.'",
        "'speaker_4': 'So just a question. Okay. Okay. So the and so this is expanded language. So we just have a little more to go on. So just doing a little wordsmithing in the second line, which is the interim city manager stated that the it should probably be plural tasks should be included.'",
        "'speaker_4': 'Thank you. Right. Because we gave him more than one task.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'That was all for me.'",
        "'speaker_0': 'With that correction. Others in favor. I motion passes unanimously. Thank you. I see.'"
    ],
    "Rebid for Demolition and Clean-up of Vacant Apartments at Alameda Point.": [
        "'speaker_1': 'Recommendation to a word contract. Oh, that's my recommendation. To reject all bids and authorize a call for bid for the demolition and cleanup of vacant apartment buildings located at Orion Street, West Tower Avenue and Stardust Place at Alameda Point member Ashcraft.'",
        "'speaker_0': 'As you want.'",
        "'speaker_4': 'Thank you. Mr. Spencer? Yes. Hi, Miss Mercado. So, first, I want to thank staff for being so responsive to the city council, because these are indeed. And I wish my I had wouldn't do this because I can't put the staff report.'",
        "'speaker_4': 'But this is the. The demolition of the buildings that we were concerned with out of Alameda point. And I'm happy to see that we're going back to bid. I have just two questions. I'm all for this. I want us to move forward and approve this.'",
        "'speaker_4': 'But my first question, Mr. McConnell, is and maybe it's for Mr. Horn, too, because this is on the bids, if all the bids that were received the first time around, the four contractors who responded to our RFP were non-responsive in one way or another.'",
        "'speaker_4': 'What, if anything, will we do differently this time in issuing the RFP? So we avoid that outcome again.'",
        "'speaker_3': 'So the RFP. Oh, sorry. Hi, I'm Nanette Marcano and the Community Development Department. The the redraft of the of the bid package. It has much more specific language of what will disqualify you for from a bid. The bids came in kind of all over the map, and there were certain items that we wanted to disqualify an applicant'",
        "'speaker_3': 'for, but we wanted to make sure that it was something that it was very clear that they were going to be disqualified for. So we redrafted it. The city attorney's office went over it with a fine tooth comb.'",
        "'speaker_3': 'So we we feel pretty confident about this bid package.'",
        "'speaker_0': 'And I want to clarify, the RFP is request for proposal.'",
        "'speaker_4': 'Thank you. And so when it said in the staff report that the first bids received were non-responsive. Is that what this means? Non-responsive? Was it in one way or another? They didn't qualify.'",
        "'speaker_3': 'Okay. So we did the bidding at the Public Works Department. Thank you for Bob.'",
        "'speaker_4': 'Handling all of so. So by nonresponsive, you meant they didn't meet all the criteria. And this time you've set it out more.'",
        "'speaker_3': 'I mean, non-responsive. And in a sense that the lowest bidder, which is the one we would normally go with, we we were super sensitive because, as you know, we've demolished some of these buildings in the past. And we actually had some contract problems with with the award that we did in the past because of disposal costs not'",
        "'speaker_3': 'included in the bid. So when we went back and asked some follow up questions, some of the bidders wanted to revise their bids. And so as we moved along with the bidders, we thought, let's just wipe the slate clean and try this again and be very clear on what we're requiring from them.'",
        "'speaker_0': 'Now, I want to clarify, staff is recommending that we reject all the bids.'",
        "'speaker_3': 'Reject all bids. We're prepared to issue the new bid call for bids tomorrow.'",
        "'speaker_4': 'Right. No, I saw that. And I and I like I said, I appreciate that. I support it. So then my only other question is. So these sites, as we know, have had multiple break ins. They've had squatters. And now we are going to assuming the contract is successfully put out to bid and we get that perfect contractor'",
        "'speaker_4': 'to work with us that we're going to be opening up and removing asbestos and other kinds of, you know, lead and other hazardous materials. How will we secure these buildings to make sure that during the course of the demolition and the cleanup and the, you know, the completion of this project, they are not broken into.'",
        "'speaker_4': 'Again.'",
        "'speaker_3': 'All of these apartments have been fenced. And so as we move forward with the demolition, we will be removing the fencing so we won't remove until we're ready to hit to go to the different apartment. So we will take it down in phases so that there won't ever be a time when they're opened and people can move'",
        "'speaker_3': 'into them because we're going to it will be a very rapid demolition because we're not we're not taking apart the different the we're watering it and taking it all down at one time. There's no deconstruction.'",
        "'speaker_4': 'But are you saying it could happen in the course of a day? Because I'm I'm not thinking it happens that fast. I did read the the bid proposal. And I do understand all the the precautions about watering the site down.'",
        "'speaker_4': 'And if wind is over 20 miles an hour, you know, to to not do the work or what have you. But but I'm I mean, some of those buildings weren't fenced. It's true. But some of them were. And and there were still folks who got in.'",
        "'speaker_4': 'Are we doing higher fences, something different, more patrolling?'",
        "'speaker_3': 'Oh, we definitely do more patrolling right now. But we we've cleaned out the site a lot a lot of the debris at the request of the mayor, a lot of the debris has been removed. And if you've been around there lately, I mean, they're there buildings that need to be demolished, but it's not a lot of trash'",
        "'speaker_3': 'or any of that stuff. And it has not. Cumulated because we do more patrols around that area. And so what we will be doing is some temporary fencing in the interim as we're taking things down. But we will increase the patrols.'",
        "'speaker_4': 'Okay. That's my concern that I just don't want to make it that attractive nuisance for people to come in. And I mean, it's pretty clear that people were staying there and doing all kinds of activities. And I do understand I was through those buildings and there was all kinds of junk in them, but they still are four'",
        "'speaker_4': 'walls and in some cases, a roof and and could be.'",
        "'speaker_3': 'In many cases, roof.'",
        "'speaker_4': 'Yeah. Yeah. So. Okay. We will look forward to hearing progress.'",
        "'speaker_3': 'Definitely. And we will to I'll take it under advisement to be a little to to to have the security do extra patrolling in the area as we're doing the demolition project.'",
        "'speaker_4': 'Okay. That that is that is and that and with that, I would move approval of this item.'",
        "'speaker_2': 'Back in.'",
        "'speaker_0': 'November.'",
        "'speaker_6': 'I still had a couple of questions. So thank you, Madam Mayor, and thank you for the presentation. This was the item that we decided we were going to loan 75,000 from the general fund. So I guess a two part question.'",
        "'speaker_6': 'You know, one is we can't get that 575,000 number and one of these bids is almost double that. I mean, are we anticipating that we're going to spend $1,000,000 on this or.'",
        "'speaker_3': 'I'm I would say that we're anticipating that the bids will come back and close to the second and third tier, near half a million dollars.'",
        "'speaker_6': 'And then I think it says there's no general fund impact. But, you know, we've decided to do this alone. Are the financials at a point where we know if the Alameda Point Fund can cover this or. We don't know that yet.'",
        "'speaker_3': 'We don't know yet. We are waiting for the results of the audit to know what our fund balance was from the previous year.'",
        "'speaker_6': 'But technically, we may have a general fund impact if. We spend more than the amount that that we have in the fund. So it might be.'",
        "'speaker_3': 'We'll know when we award the contract, when we come to you to award the contract, how we're going to pay for it into that will be in that document. Okay. Thank you. You're welcome.'",
        "'speaker_0': 'The questions or comments? We have a motion in a second. All those in favor.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion carries unanimously. Thank you. Next Item six A.'",
        "'speaker_1': 'Presentation of Alameda Free Library Fiscal Year 20 1415 Annual Report.'"
    ],
    "SAFER Grant Acceptance and Fire Grants Fund Budget Amendment.": [
        "'speaker_1': 'Recommends you to accept the $2.2 million grant from these Staffing for Adequate Fire and Emergency Response Program to amend the Fire Grants Fund. But Budget for Fiscal Year 20 1516.'",
        "'speaker_2': 'Good evening, Madame Mayor. Council members. City staff. The Gong Fire Chief.'",
        "'speaker_0': 'Come with me, Chief.'",
        "'speaker_2': 'Good evening. I come with good news for you tonight. The fire department has once again applied for and been awarded a staffing for Adequate Fire and Emergency Response Grant, also known as the SAFER Grant. This current one is for $2.2 million.'",
        "'speaker_2': 'The Safer grant is administered and implemented by the Department of Homeland Security and the Federal Emergency Management Agency. The grants provide financial assistance to fire departments to help hire additional frontline firefighters or replace laid off firefighters or replace firefighters who have been lost through attrition.'",
        "'speaker_2': 'The fire department applied for safer grants in 2009 and 2011 and were granted those awards also both for $1.76 million. The grant will allow the fire department to hire six additional firefighters for two years. It covers all associated costs for salaries and benefits, including workers comp ers and OPEB costs.'",
        "'speaker_2': 'The only cost that it doesn't cover is unscheduled overtime uniforms and ambulance differentials. Fire Department's current authorized number of firefighters is 92. So our internal staffing analysis, we've concluded that we need 98 personnel to provide the service that we currently provide to the city.'",
        "'speaker_2': 'Adding these six additional firefighters will get us to that number of 98 that we need to do respond adequately in the city. On an annual basis using the C4 grant to hire these six additional firefighters. It'll save us approximately $500,000 annually in overtime cost.'",
        "'speaker_2': 'I recommend the Council accept this current save for grant. And amend the Fire Grants Fund budget for fiscal year 1516. The grant has no match required. It's a really good one. I completes my report. I'm open for questions.'",
        "'speaker_0': 'You. I swear.'",
        "'speaker_2': 'I think this is always good to get a grant. I'd like to have us approve the acceptance of this grant, but I also like us to prepare for when we don't receive it. I think we're getting used to.'",
        "'speaker_2': 'A level of service that has been provided by this grant. And I think we need to prepare ourselves at some point, not either receiving the full amount or six. Or any amount because there may be communities more needy than in this community.'",
        "'speaker_2': 'And I don't want to have that day come on us and be unprepared.'",
        "'speaker_0': 'Remember Ashcroft.'",
        "'speaker_4': 'Thank you, Chief. You mentioned the dollar cost and overtime savings, but what was it again?'",
        "'speaker_2': '$500,000 annually. Once, once the firefighters are trained and online.'",
        "'speaker_4': 'Right. Because they have to go through academy in there. That's correct. To bring them up to speed. I. I don't disagree with what the vice mayor said, and I but I also agree that this is a great opportunity to get this grant.'",
        "'speaker_4': 'We just heard an exciting presentation about the library and the vice mayor, and I know that it was a state grant that got us the the money. And in that case, we needed to come up with a local match, but we had that, too.'",
        "'speaker_4': 'So it's always great when you can leverage, in this case, federal dollars for our needs. And and I do know that we've had a lot of firefighters recently working a lot of overtime hours. And not only does this cost the city money in overtime costs, but there's a human cost, too.'",
        "'speaker_4': 'Because when you think of the hard, physical labor of fighting fires, it adds to all kinds of injuries. You have people out on medical disability and leave. They're away from the department. There's recovery time. So I think this is something that's important.'",
        "'speaker_4': 'And also, I think some of the community is aware that we actually had an engine company, one of our engine companies, doing a mutual aid assignment in helping fight the lake fires.'",
        "'speaker_2': 'Valley Fire Valley.'",
        "'speaker_4': 'For Guy Fires. And they were gone for.'",
        "'speaker_2': 'Just under 14 days.'",
        "'speaker_4': 'Yeah. So almost two weeks. And so, I mean, and that's the sort of thing that was one company that stayed there and they would get their 24 hours off from time to time, but it was pretty intense. So anyway, I like I read through this in the grant agreement and I'm prepared to support it.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Any other comments or questions? Have a question. First of all, congratulations on this. And I'm wondering, back in 2011, was that for two years also or when did that one expire?'",
        "'speaker_2': 'They are. They're all for two years. What we've found is we've been able to extend them by a few months each time, because what they're figured out on is is. At full cost of a firefighter or academy. During the five months that they're in the academy, they're only paid 40% of the normal cost of a firefighter.'",
        "'speaker_2': 'So at the end of the two years, we still have funds that we can apply and request to move forward.'",
        "'speaker_0': 'Okay. So did you apply in 2013 or 14 or can you not.'",
        "'speaker_2': 'Those those positions were filled then. So nine got us through a couple of years, then we got to 11. The problem with counting on the safer ground as councilmember matter, he pointed out, is that they expire. And then we're in a period where we're short people and we're waiting to see if we're going to get a grant'",
        "'speaker_2': 'or not. And then by that time, once we've found out whether we're getting it or not, we have that time where we still have to recruit and hire and train people. So we end up with these large gaps where we're backfilling with overtime and our overtime costs go very high.'",
        "'speaker_0': 'But it looks like the 2011 would have expired in 2013. Then you probably applied in 14, I'm not sure.'",
        "'speaker_3': 'Yeah. And were.'",
        "'speaker_0': 'You denied at.'",
        "'speaker_2': 'All? No, we've been waiting to hear. This one took us longer to hear.'",
        "'speaker_0': 'Okay. Okay. Well, thank you for clarifying that. Okay. So then Brody.'",
        "'speaker_6': 'Thinks about America to move recommendation or move the staff recommendation to accept 2,205,300 grant from for the staffing for adequate fire and Emergency Response SAFER program and to amend the Fire Grants Fund budget for fiscal year 20 1516.'",
        "'speaker_4': 'A second.'",
        "'speaker_0': 'Those. Oh, I'm sorry. I'm really sorry.'",
        "'speaker_7': 'Well, thank you. Thank you, Chief. Long for this report. You know, we're as you well know, you know, we're a city of 75,000 and growing slowly. And what that implies is that on the cost side and we always have a demand for services, whether as we had heard earlier, whether it's demand for services for library or as'",
        "'speaker_7': 'important demand for services for a fire. And those services, demand for services continue because the population is here. Unfortunately, on the revenue side of things, things aren't always readily available. And so, as you well know, and as our executive staff all knows and councils and past councils know, you know, we're always scrambling.'",
        "'speaker_7': 'So this is part of that scramble. And fortunately, we were you were able to secure another level of funding. And for that, I think you should definitely be thanked and this should be definitely supported. So I look forward to doing that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_2': 'I'd like to consider in the motion. Direction or some sort of return back to us to have the the present the plan of what we're going to do if we either cannot apply or do not receive a grant at the end of this grant.'",
        "'speaker_2': 'So that we avoid a situation where we don't know if something's going to be renewed. That's one scenario or that we don't get the grant renewed because again, I'd like to be prepared now. Rather than wait till that time is on us and have to scramble and maybe make a decision in haste.'",
        "'speaker_0': 'Do you want to modify the motion or do you want to bifurcate that issue and have a second motion on that?'",
        "'speaker_4': 'Could I just ask for some input from staff about how you might anticipate moving forward with the Vice Mayor's request?'",
        "'speaker_3': 'I think what we would do is I would ask Chief Long to take a look at their staffing. And you know what? What does it look like without those six bodies? What does that look like? What is the service level look like without those six bodies?'",
        "'speaker_3': 'I mean, I think that's what the vice mayor is asking for.'",
        "'speaker_2': 'And counter-balance asked.'",
        "'speaker_3': 'Right. And maybe if it's not six, maybe it's three or something like that.'",
        "'speaker_4': 'So my only concern is just reading through and maybe this isn't a problem, but reading through the attachment for the safer ward, I believe you have to show that you have approval of your of your city council. And I'm just wondering whether we wanted to do a cleaner motion and direction to staff.'",
        "'speaker_0': 'So my preference would be to separate the two issues. Okay. And go forward with your motion member already.'",
        "'speaker_6': 'Yeah. Thank you, Madam Mayor. I mean, I think we just did the budget that goes out to 17. These these grants expire in 18. So it seems to me maybe the more proper time to have this discussion is when we do the budget for 17, 18 and 18, 19.'",
        "'speaker_2': 'We're continually analyzing our numbers to to see, you know, where we are with this, what it would look like when we're at this 92 level. We've trying to maintain the level of service that we currently have. We are starting to incur a huge amount of overtime, specifically mandatory overtime, and our injuries are starting to increase.'",
        "'speaker_2': 'So yes, we'll come up with a staffing plan of what it looks like.'",
        "'speaker_0': 'So at this point, I'd like to proceed with a member of this motion and circle back.'",
        "'speaker_3': 'I just I'll make.'",
        "'speaker_7': 'One quick comment. And then when it comes to a sudden shortfall of funding, the fire department has made a really tough decision. I remember recently, I think you had to let go a certain number of people who were part of this program because the funding had ended.'",
        "'speaker_7': 'And I think there was a good number of people who, you know, they were here temporarily part time. I think it's like some kind of ambulance type of program.'",
        "'speaker_2': 'The bill assembly. Yeah.'",
        "'speaker_7': 'And, you know, that's under that that was under your purview. And so unfortunate. You know, it's unfortunate. But when you have to make those kind of hard decisions. You know, you pull the trigger. But by the same token, we will always need some level of staffing to to accommodate a city of 75,000 people.'",
        "'speaker_7': 'Whether that staffing is made up by actual new bodies or whether it's made up by the same people but working longer hours. You know, that's that's the situation we're in. On the revenue side, that's why we need to go after these kind of things.'",
        "'speaker_0': 'So we have emotion, memory. Can you repeat your emotion? Okay. Just to accept the recommendation I read.'",
        "'speaker_6': 'Right.'",
        "'speaker_0': 'Okay. So we have motion to accept the recommendation or recommendation to accept the grant and we have a second. So all those in favor. I. I so that part passed unanimously. Thank you. Thank you. All right. Now, did you want to make a motion.'",
        "'speaker_4': 'Or is it just direction to staff?'",
        "'speaker_6': 'This isn't even an agenda item. So I'm concerned about having this discussion at this point without, you know, notifying the community that we're going to be discussing staffing levels.'",
        "'speaker_4': 'Where we can direct staff to look into the the topic, can't we, and come back at another time?'",
        "'speaker_0': 'Actually, I don't think we're discussing staffing levels. Well, why don't you say what you think your discussion was?'",
        "'speaker_2': 'I think it's pretty simple. I don't want to wait until the we're in the midst of a budget and trying to slice and dice everything. I'd like to have us be prepared before that happens. This is two years we're talking about, and I'd like to know in advance what our strategies point.'",
        "'speaker_2': 'And if we get an extension, that's fine. But if not, I want to avoid some of the problems that resulted in some tough decisions. Part of them being tough decisions was they were made under that pressure. I'd like to have that.'",
        "'speaker_2': 'That analyzed. Absent the pressure.'",
        "'speaker_0': 'Amber Ashcroft.'",
        "'speaker_4': 'I don't disagree with any of that, but I would prefer to have it come back rather than make a motion now and vote on it. Something that we haven't had any report on. I'd love to hear a further discussion.'",
        "'speaker_4': 'And, you know, give staff and the fire chief and fire department an opportunity to assemble that information, come back to us with a report. But I am not prepared to vote on a motion, but I certainly would support direction to staff to that.'",
        "'speaker_0': 'And I think that's what I'm asking for.'",
        "'speaker_2': 'I'm not asking.'",
        "'speaker_0': 'For them to come.'",
        "'speaker_4': 'So we don't need a motion, is what you're saying just direction?'",
        "'speaker_0': 'Well, that's what I want to clarify. I definitely.'",
        "'speaker_3': 'Need consensus, but I need you to say yes or three of you to say no.'",
        "'speaker_7': 'Madam Mayor, if I. If I from my vantage point. If staff, whether the executive level staff or the department has staff are going to do. Are contemplating doing anything different. Then they would when it comes to losing funding.'",
        "'speaker_7': 'And then, you know, take the time to let us know. But if it's if your approach is basically, you know, you know, the situation that we we deal with. You know, we go through the budget process and and we allocate a certain amount of dollars for for our personnel.'",
        "'speaker_7': 'And if you have to meet those, if you can meet those personnel with new people, if you can get the existing people to work a lot more hours. Not the best of situations, but. Then I. I'm not quite sure why we have to have a discussion that is altogether some kind of new approach.'",
        "'speaker_7': 'And that what I would suggest is that. The vice mayor if he has specific. Ideas on how to deal with a staffing shortage that he worked with, with our executive level staff and then come back to us.'",
        "'speaker_0': 'So I would like to. If I swear.'",
        "'speaker_2': 'And I can't, I'm not the expert and we hire experts to do that. I just want to be prepared. And that's the direction I'm looking for, is instead of waiting until budget time and when other distractions are there, instead of waiting when the grant is either not receive and we have a gap that's it's that's why that's'",
        "'speaker_2': 'all I'm looking for is that we give direction. They have to come back to us.'",
        "'speaker_7': 'So I guess what I'm saying, though, is that if the direction is okay, let's say two weeks from now, the direction is in the event we lose staff, we lose. We don't get the safer grant renewed in two years.'",
        "'speaker_7': 'The direction is the people who were hired by the state for Grant. Unfortunately, are no longer hired. Well I suspect that would have been the approach anyways by staff. So I'm at wit's end to understand why we have to go through this special discussion on how to deal with this uncertainty when we kind of have a protocol'",
        "'speaker_7': 'in place on how to deal with, I don't know, maybe, maybe.'",
        "'speaker_0': 'I would agree. I would agree with member Ody and member de SOG that we do have a process and this grant is through the end of the it's through February 20th, 2018. So I would expect come maybe 2017 or something like that, that we would hear from staff and yourself if there's a change.'",
        "'speaker_0': 'But I don't I think it's premature at this point to prioritize that when we have especially. So I think it's we're it's too early and we have many other issues that need to be addressed sooner.'",
        "'speaker_4': 'Member Thank you. So I don't remember anyone saying prioritize and I certainly didn't mean to imply that it's it is something we are going to do though, a goal setting workshop at some point. But no, I just meant that it's something that staff can look into because I think we're verging on having a discussion of a non'",
        "'speaker_4': 'agenda item right now anyway. But I wasn't saying it needs to be a priority and come back. We've, we've got the grant. We should celebrate that this is good. It's and we know it's in place so it's not imminent.'",
        "'speaker_4': 'Before I get to the vice mayor's point, it's always good not to get complacent, but we've got time. And you certainly could put this down lower on your ever growing list of things to do. So I'm one for gathering more information rather than less, but at this.'",
        "'speaker_0': 'Point, I don't think there's a consensus to do that. So we can proceed to the next item. Thank you. Six. Thank you very much, Chief.'",
        "'speaker_6': 'Thank you, Chief.'",
        "'speaker_0': 'And congratulations. Six C.'",
        "'speaker_1': 'Introduction of Ordinance Amending the Alameda Municipal Code by amending various sections of articles eight Sunshine Ordinance and Chapter two administrations and adding new sections 20 dash 90 .3.4 and 20 Dash 91.18 concerning local standards to ensure public access to public meetings and public.'",
        "'speaker_3': 'Works.'"
    ],
    "Ordinance Amendment to Enhance Public Access to Public Meetings and Records.": [
        "'speaker_8': 'Good evening, Madam Mayor. Members of the Council, Michael Roush, appearing on behalf of the City Attorney's Office for the City of Alameda. And before you tonight are a number of proposed revisions to the city of alameda sunshine ordinance.'",
        "'speaker_2': 'Sir. Oh.'",
        "'speaker_8': 'Just by way of background, the this sunshine ordinance was first adopted by the City Council in 2012. It occurred after a year study and the involvement of numerous citizens and reticent residents throughout Alameda. It is codified in chapters 2.91 and 2.92 of the Alameda Municipal Code.'",
        "'speaker_8': 'As set forth in the ordinance. The the ordinance has a number of purposes. Generally it its intent is to demonstrate the City Council's commitment to an open, transparent and democratic city government. And also it ensures that residents have the time to access public information and opportunities to address both the elected and appointed officials.'",
        "'speaker_8': 'As part of the Sunshine Ordinance, there is an Open Government Commission which meets periodically. It was established by the ordinance to oversee and enforce the Sunshine Ordinance. And with respect to these particular amendments, the Commission reviewed these changes over a course of several different meetings, and we had lengthy discussions about the wisdom and the wording of the'",
        "'speaker_8': 'ordinances and the amendments. And those are before you this evening. Although there are a number of amendments to the ordinance, many of them are housekeeping rearranging where different sections of the ordinance now will be placed. But there are five major proposed revisions.'",
        "'speaker_8': 'Those having to do with the use of electronic communication devices at meetings. Whether or not policy body members should be able to present comments at meetings when those members are not present at the meeting. Well, another ordinance or another amendment dealing with public comments by members of policy bodies.'",
        "'speaker_8': 'Also concerning whether or what restrictions should be on opinions of public concerned expressed by public officials or public employees, and then also certain training requirements that the ordinance currently provides. The first item concerns the use of electronic communication devices at meetings.'",
        "'speaker_8': 'As currently proposed, the use of electronic communication devices such as iPads, cell phones, etc. would not be able to be used at any meeting for the purpose for any purpose other than accessing materials at a member's iPad or laptop.'",
        "'speaker_8': 'The idea being that there would be a concern on the part of the public that policy bodies are receiving or transmitting information that is not available either to the public or to other members of the policy body in question.'",
        "'speaker_8': 'And therefore, a a somewhat we would call a bright line rule saying that those the use of electronic communication devices, except for the limited purposes indicated is prohibited.'",
        "'speaker_0': 'Can you clarify what you mean by agenda materials there?'",
        "'speaker_8': 'Agenda materials would be those materials which would be contained on the member's iPad. So for example, you know, because we have issued iPads to the various policy body members, when you go there, you can get you you can look at the agenda materials in the backup information.'",
        "'speaker_8': 'And that would be the purpose for which you could use the your iPad access that information and that information only. The commission felt that that that was somewhat too limited and indicated that it felt that it would be appropriate to allow the use of electronic communication devices to access information on the Internet.'",
        "'speaker_8': 'Broader than just what would be on your iPad with respect to agenda materials staff as recommended. However, that it be more limited for the reason that I just mentioned, because of the concern that there might be the perception, if not the reality, that information would be transmitted to and from the policy body by persons who are not'",
        "'speaker_8': 'present, or that information would not be shared by the other members of the of the members a body. Another item has to do with whether or not a policy body member should be able to make comments at a meeting at which the the member is or not present.'",
        "'speaker_8': 'The concern has to do with the fact that those decisions that policy body members make, whether it's city council, a planning board or other such bodies, that those decisions should be made after hearing all the public information, all the public testimony and all the evidence.'",
        "'speaker_8': 'And if that policy member is not able to hear that information, then the question is, should written comments that the member provides ahead of time be submitted and be considered by the remainder of the of the Commission or the member of the policy body and the staff recommended?'",
        "'speaker_8': 'And the commission, the Open Government Commission agreed that that that should be prohibited, that those kind of comments should not be submitted if the member is not present at the meeting.'",
        "'speaker_0': 'Okay. Can you clarify if those comments are providing information as opposed to an opinion and a conclusion?'",
        "'speaker_8': 'I think the idea is a very fine distinction to try to make between information versus opinion or or a conclusion. I think the idea is that that the information, no matter no matter how it's characterized, it can be seen as perhaps being persuasive or more persuasive than other information.'",
        "'speaker_8': 'And that member would not have had the benefit of either hearing what the other members had to say about the item or what members of the public had to say about it. And therefore, it's premature to venture, whether it be an opinion or information without having the benefit of being present and being able to digest and respond'",
        "'speaker_8': 'to that information.'",
        "'speaker_6': 'Member Thank you. I guess my question is how would that be any different than any other member of the public? I mean, I can understand you may be influencing, but they're not there. They're not voting. I mean, that's the most influence that they could that's the highest level influence they could have is voting and standing next to'",
        "'speaker_6': 'their colleagues. But, you know, we're kind of saying just because you're on an A board and maybe you can't make the meeting, then you're not allowed to send in your opinion and you know, have something noted in the record.'",
        "'speaker_6': 'I mean. It seems a little restrictive to me, you know? I mean, how would that how is that different in your mind?'",
        "'speaker_8': 'It's clearly more restrictive. They currently exist. Again, the the concern that that had been expressed to to our office from different different departments and what the Open Government Commission considered was the fact that in order for in order for the that it seemed in not improper but it may seem not appropriate for a board member who did'",
        "'speaker_8': 'not have the benefit of hearing all the information to provide information to that particular body ahead of time. When that information or additional information may have come to light, that may change that person's opinion. And while it is true that the other commission members or the other policy body members may be able to say, well, that person'",
        "'speaker_8': 'may have changed his or her mind. If he or she would have heard all that. The concern would be that the opinion or the information expressed by that body member may get more weight than a member of the public would.'",
        "'speaker_8': 'Again, these are these are all policy decisions that are being set forth here in front of the council. And it's obviously up to you all to decide which of any of these amendments you feel would be appropriate to include.'",
        "'speaker_0': 'All right. So let me ask you. If a board member or policy or a member of this committee does have some information and will not be able to attend the meeting, and I'm going to say separate from an opinion, but just knows of something, for instance, a fact.'",
        "'speaker_0': 'Who do they share it with or nobody?'",
        "'speaker_8': 'Under under their proposal, they would not be able to share that with anyone. I mean, they could strike that. They could certainly share it with someone other than sharing it with the the body who is considering the matter.'",
        "'speaker_8': 'Certainly, they can have a conversation with, you know, a neighbor.'",
        "'speaker_0': 'And it would.'",
        "'speaker_8': 'But it would not be it would not become part of the public record upon which the decision would be presumably made.'",
        "'speaker_0': 'If I might add, I think what could happen, though, if there's a fact that's out there, that person could.'",
        "'speaker_3': 'Clearly call the staff member who is serving.'",
        "'speaker_0': 'The body.'",
        "'speaker_3': 'And allow let them know about a factual situation that might then that.'",
        "'speaker_0': 'Staff member could provide to the entire.'",
        "'speaker_3': 'Body. Okay.'",
        "'speaker_0': 'So I appreciate that member already.'",
        "'speaker_6': 'Thanks. But I. You know, again, how is that any different from that person giving a letter to Mr. Forman and saying, Mr. Forman, go to the planning board and read this on my behalf? I mean, I think it's kind of or submitted.'",
        "'speaker_0': 'Let me just add one thing there, and I'm sorry Mr. Ash was involved.'",
        "'speaker_3': 'In all of this. But number.'",
        "'speaker_0': 'One, you don't have proxies.'",
        "'speaker_3': 'So all of you who are.'",
        "'speaker_0': 'Sitting here on the dais do not have the ability to appoint a proxy to sit in.'",
        "'speaker_3': 'For you or to provide any information or whatever. It's very important that it be the individual people who are appointed.'",
        "'speaker_0': 'Who are the people who listen, debate and vote on whatever it is that.'",
        "'speaker_3': 'Comes before them.'",
        "'speaker_0': 'And you don't go from the dais to the.'",
        "'speaker_3': 'Podium and address the body. So you are I.'",
        "'speaker_0': 'Think the problem becomes and it is a policy decision, but the problem becomes you are really opening.'",
        "'speaker_3': 'The door for there being.'",
        "'speaker_0': 'Confusion about what your.'",
        "'speaker_3': 'Role is. And there is additional weight that's.'",
        "'speaker_0': 'Given to a member of the body.'",
        "'speaker_3': 'Who would be addressing their fellow their fellow members than just a member of the public. And so your obligation is really to be serving, as you all do, and you sit here and you listen and you debate.'",
        "'speaker_0': 'It's not like phoning it in, if you will. So I don't believe that was really the question. Thank you. Member de SOG.'",
        "'speaker_7': 'And my question. To me, this is an important question. So this. Cheat right here. Yes. Is specific you. Meeting. Right. Way in which information is or is not transmitted. Transmitted in meetings, which has a definition somewhere. But we'll all agree that.'",
        "'speaker_8': 'I agree with.'",
        "'speaker_7': 'That. Right. Thank you. That's all I needed to know.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_8': 'And in response to Councilmember Otis question, I mean, I suppose theoretically a member who is not going to be present could give his or her comments to a third party. And without indicating where the source of that information came from, that person could come to the podium and and read that information and and the rest of the'",
        "'speaker_8': 'can of the body would not know where it came from. So it could be transmitted that way. So, yes, I mean, that that certainly could happen. The the concept here is that. The information would not be specifically from the absent.'",
        "'speaker_8': 'Member of the board or commission or the council, and therefore it wouldn't carry quite the same. Input or wait.'",
        "'speaker_0': 'Member. Odie, I'm.'",
        "'speaker_6': 'Sorry. One more have we had? Is this a problem that we have? Or is this?'",
        "'speaker_0': 'I'm aware.'",
        "'speaker_3': 'That we had one such issue at.'",
        "'speaker_0': 'The planning.'",
        "'speaker_3': 'Board and the planning board member was told.'",
        "'speaker_0': 'They could not just submit.'",
        "'speaker_3': 'Comments and not show up. That's the only one I'm aware of. I'm not sure if there are any others that have come to light.'",
        "'speaker_6': 'Okay.'",
        "'speaker_8': 'Thank you. Yeah, it wasn't. And and we were asked about whether or not that was prohibited. And we had to advise the department at the time that no, there was no express prohibition. And from a policy standpoint, whether it was good or bad policy.'",
        "'speaker_8': 'So we approached it with the Open Government Commission, and the commission felt that it was better to exclude it. That's before you all tonight.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Oh, no, I'm trying to make the presentation.'",
        "'speaker_6': 'In the next slide.'",
        "'speaker_8': 'The next item has to do with public comments made by policy body members and the Sunshine Ordinance. Recognize, and I think we all agree that every member of a policy body retains his or her full constitutional rights to comment on governmental action.'",
        "'speaker_8': 'What this what this substantive change is, is that if the city council itself has taken a formal action, has adopted a policy or a position that is of some is of some substance, this recommendation is that an advisory body as a whole would be prohibited from taking formal action.'",
        "'speaker_8': 'That would contradict that. This the staff's feeling was that if the council has adopted a policy or has taken a position, that it is not appropriate for a an advisory body to take an action as a whole. That would contradict that.'",
        "'speaker_8': 'The commission, the Open Government Commission did not agree with that. So that's sort of an issue that's up in the air. Again, staff recommendation is that this body, the council, established that policy and that it it, you know, the wagons should be pulled in the same direction.'",
        "'speaker_8': 'And to have advisory bodies going a different direction doesn't show the kind of unity that we feel. The City Council would expect its advisory bodies to have.'",
        "'speaker_0': 'Member de SACS.'",
        "'speaker_7': 'So similar question as before. So this slide again is in the context of a public meeting.'",
        "'speaker_8': 'That correct? That is correct. That in other words, this this would prohibit X, Y, Z advisory body from taking it and adopting a resolution, adopting a motion or whatever that would be in contravention to a policy or a position that the City Council had adopted.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_0': 'Member Authority.'",
        "'speaker_6': 'Thank you. I guess another question is staff is again. Has this happened? Have we had instances where, you know, we have a planning board running amok or.'",
        "'speaker_4': 'Depends on if.'",
        "'speaker_8': 'There was.'",
        "'speaker_6': 'I mean, after.'",
        "'speaker_8': 'There was some context to this. And my recollection is it had to do with it involved, if I'm recalling correctly, the Park District property where the council had had taken you know, had taken the position in terms of what the disposition of that would be.'",
        "'speaker_8': 'And one of the advisory bodies felt that there may have been some other course of action that may be more appropriate and took action to write a letter, etc.. That was, if not directly in contravention to what the council had done, that Lee certainly raised the issue that they were in disagreement with it.'",
        "'speaker_8': 'And I think the thought was, at least on a staff level, that that was not something that should be done.'",
        "'speaker_6': 'That was before a decision was made.'",
        "'speaker_8': 'No. Well, it was it was after the council had taken action with respect to its position or policy, with respect to that matter.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_2': 'Is. I'm. The question I would have then is how can an advisory body do its work and advise the council if it's expected never to contradict foreign policy?'",
        "'speaker_8': 'I think there's a difference between the advisory body taking action to make recommendations to the city council saying we don't think this policy is good because and making those kinds of recommendations to the council as opposed to saying, we don't think this is a good policy and we're going to write a formal letter to, you know, whatever'",
        "'speaker_8': 'other agency might be out there saying that we don't agree with the city council. I think that's the difference that I'm that we're trying to draw here. It doesn't mean that they can't disagree with you. It's simply a matter of how that is communicated and to whom it is communicated.'",
        "'speaker_0': 'And if I can jump in here really quick, again, it's I'm I'm.'",
        "'speaker_3': 'Getting my recollection on this particular issue.'",
        "'speaker_0': 'And my.'",
        "'speaker_3': 'Recollection is that it was the.'",
        "'speaker_0': 'Park and Rec Board.'",
        "'speaker_8': 'I think I believe that's correct.'",
        "'speaker_3': 'And the city was in in litigation with the East Bay Regional Park District over Neptune Point. So any issues related to whatever was going to happen with Neptune Point that would have worked its way in the authority given to the Park and Rec Department.'",
        "'speaker_0': 'Had.'",
        "'speaker_3': 'Already been done, had come to the council, the council had made a decision. We were in litigation.'",
        "'speaker_0': 'And then the Park and Rec Board decided.'",
        "'speaker_3': 'To opine as to what the council should do differently.'",
        "'speaker_2': 'And I ask the question because the scenario that you described is the statement that's in the ordinance, and we can I'd like to discuss that during discussion, after hearing public comment, the statement that's in the ordinance. Prohibits any action.'",
        "'speaker_0': 'One seems broader than the other. Think it's what is.'",
        "'speaker_2': 'Including giving advice.'",
        "'speaker_8': 'And and perhaps that that language should be tailored. So it's more specific because the intent was not to curtail the ability of advisory committees to.'",
        "'speaker_2': 'I'm just making a comment. We'll discuss that one.'",
        "'speaker_8': 'Fair enough.'",
        "'speaker_6': 'One more question on that.'",
        "'speaker_0': 'I'm sorry. And we're already.'",
        "'speaker_6': 'So that that outside communication, was that or was that to the council or was that to some third party.'",
        "'speaker_3': 'Or. No, it was to the council. They wrote a letter to the council.'",
        "'speaker_8': 'Another area, again, gets gets into areas that certainly there are, you know, areas of of disagreement about things of this nature. The general principle, of course, is that public employees cannot be disciplined for expressing personal opinions about matters of public concern.'",
        "'speaker_8': 'And the ordinance recognizes that. The ordinance also recognizes that advisory board members should not be discouraged from expressing personal opinions about matters of public concern. What we have tried to do is to tighten up the the ordinance here to make it more clear that if a public employee or an advisory body member renders an opinion, that it'",
        "'speaker_8': 'reflects that it is the person's personal opinion and does not represent that of the city or the employees department or the members board. And because the ordinance I think is currently drafted, that was a little bit it wasn't written as clearly as it could have been.'",
        "'speaker_8': 'And so we have tried to tighten that language up with respect to those matters.'",
        "'speaker_0': 'Can you clarify, is this in the personnel handbook? I would think that it would be appropriate to be the personnel handbook somehow communicated to employees there. Is it there?'",
        "'speaker_8': 'I do not believe that it is expressed strongly in any kind of personnel handbook, etc.. There may be some general language in the city's personnel rules, or perhaps in an MRU, but I'm not aware that it is in any personnel handbook per se.'",
        "'speaker_0': 'Okay. In which case you're expecting personnel to read the Sunshine Ordinance to find out what they're allowed to do and that alone.'",
        "'speaker_1': 'I can chime in there. They are required to read it annually. Anybody that's in the city's conflict of interest code is.'",
        "'speaker_3': 'Required to read it annually, though.'",
        "'speaker_1': 'And as you do, and all the board and commission members do.'",
        "'speaker_3': 'So.'",
        "'speaker_8': 'Not every I mean, just by way of clarification, not every employee is required to read the Sunshine Ordinance, just those who filed the Form 700. They are certainly encouraged to read the Sunshine Ordinance. And again, these, as you know, as as attorneys well know the whole issue about what a public employee can be disciplined for with respect'",
        "'speaker_8': 'to making comments about public matters is a very, very gray issue. It's gone up and down to the Supreme Court many times. And, you know, what we have tried to do here is distill as best we can what the current state of the law is, recognizing that there are incredible nuances in terms of what an employee, a'",
        "'speaker_8': 'public employee at least, can and cannot be disciplined for. We've just tried to lay out in general terms what those parameters are.'",
        "'speaker_0': 'Member.'",
        "'speaker_6': 'Thank you. Another clarifying question. Thank you for your indulgence. So were public employees, advisory board members. These are different.'",
        "'speaker_8': 'Correct.'",
        "'speaker_6': 'So who would be an advisory board member?'",
        "'speaker_8': 'Any of them? Any of the the board members to which you appoint planning board members, civil service board, park and Recreation Transportation Committee, any of those. Any of those persons would be considered advisory boards.'",
        "'speaker_6': 'I mean, maybe this is rhetorical, but isn't the point of being on an advisory board to express your personal opinion on matters of personal public concern?'",
        "'speaker_8': 'Yes and no. And there isn't any difficulty with that. The the difficulty arises where the statements or the statements might be made and made in context, where it gets construed that that person is representing the city's position or the advisory board members position rather than the person or persons personal opinion.'",
        "'speaker_8': 'And again, it's it's a it's a fine line. And and and the line's not always bright. But what we have tried to do here is to make the line a little brighter so that advisory board members know what their rules and regulations are, recognizing that, you know, the council, certainly under the charter reserves the right to remove'",
        "'speaker_8': 'a an advisory board member or, you know, any any cause other than, you know, an unlawful cause.'",
        "'speaker_0': 'Member, De Saag.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'So when a person is part. Of an advisory board and comes to city council to talk on a subject that might be substantively different from the advisory board on which she or he serves. Is is that person still have to make some kind of declaration that this is my own personal opinion and not reflective of the advisory'",
        "'speaker_7': 'board that I am a part.'",
        "'speaker_8': 'That would be the ideal situation so that if a an advisory board member appears before you to express his or her opinion about a matter about which you are deliberating, that that person would identify doesn't necessarily have to identify him or herself as a member of the board.'",
        "'speaker_8': 'But if he or she does that, we would hope that that he or she would also say that I'm doing this as an individual, recognizing that, you know, you know, who's on the board. I mean, it's it's sort of a, you know, it's sort of a facade in that way.'",
        "'speaker_7': 'L All up question Some advisory boards are advisory to city council but are not necessarily made up of persons who were appointed by council. Is that does this slide cover that person as well?'",
        "'speaker_8': 'Yes, because a sunshine ordinance defines. Those. It uses a term policy board member rather than advisory board, but essentially it's broad enough that it would cover those situations where persons are appointed or serve on boards or committees that aren't necessarily appointed by the full council, but might be, for example, appointed by the mayor.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_8': 'And continuing with the the angels dancing on the heads of parents. This is this is a this is sort of a a take off or a akin to what we have just been discussing. And again, this was another section of the ordinance which in many ways duplicated this, the ordinance section that we just talked about.'",
        "'speaker_8': 'And again, the commission recommended that this section be deleted from the ordinance because it felt it was a somewhat duplicative. And B, that the employee, you know, to the extent that you want to provide rules about what employees should and should not do, it ought to appear elsewhere rather than the Sunshine Ordinance.'",
        "'speaker_8': 'That's certainly a valid recommendation. We were the snap was reluctant just to take it out of the ordinance. And so we put it into a section that is in a better place, as it were, within the was within the Sunshine Ordinance.'",
        "'speaker_8': 'But it is very much akin to what we've just discussed. And the last big ticket item here are the training requirements. As as the city clerk has indicated, the ordinance requires persons who file form 700 to declare under penalty of perjury annually that they have read the ordinance, and that those persons must also attend annual training on'",
        "'speaker_8': 'the ordinance. Because there typically are relatively few changes to the ordinance. In fact, these are the first ones that have been made and in three years now we are suggesting that the training occur every three years rather than annually.'",
        "'speaker_8': 'Persons would still be required to declare under penalty of perjury that they have read or reread the ordinance. We would have the we have a training video that we have on file and persons who are elected or who are appointed and are required to have this training would then be required to view that video in order to'",
        "'speaker_8': 'meet the requirement.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'And with that, that finishes my presentation. Our recommendation, of course, is that the the council introduce the ordinance with the staff to recommend the changes. And I'll be glad to answer any other questions that the Council may have.'",
        "'speaker_0': 'We do have two speakers. So if you have a clarifying question that matters.'",
        "'speaker_4': 'I do. Thank you, Mr. Roush, for the presentation. So I think I just have one question from the staff report and that's on page three where this is having to do with the use of electronic communication devices other than for the purpose of members accessing agenda materials, etc..'",
        "'speaker_4': 'And my question is, how would a provision regarding the expanded use of electronic devices or maybe narrowed use of electronic devices be monitored and enforced?'",
        "'speaker_8': 'It's basically an honor system. You know, I don't think that this counsel has any interest in having a electronic communication device. Police, police the activity. I think the idea is if the council establishes that as its policy, it's going to be presumed that that this council and all of the other policy bodies will honor that.'",
        "'speaker_8': 'If, you know, if someone doesn't, I suppose then someone felt that there was a problem. They would file a complaint with the Open Government Commission and it would be investigated. But I think as a you know, as a matter of course, it's an honor policy that that but I think the the public and the staff would expect'",
        "'speaker_8': 'that the the policy and body would would follow.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'And can you clarify in regard to that same topic? But we could or could not access. Would we be able to use a calculator?'",
        "'speaker_8': 'I would say the answer is no, because, again, a a calculator is an electronic communication device. And if I if reading the words, literally, the answer would be no.'",
        "'speaker_0': 'All right. And what about Google Maps? Would we be able to draw look up a map of the site that we're looking at? That's not an agenda item.'",
        "'speaker_8': 'If it were not included within your agenda materials, the answer would be no.'",
        "'speaker_0': 'All right. I appreciate that. And I'm going to call some speakers now, John Klein and then Paul Foreman. Thank you.'",
        "'speaker_2': 'Hi. My name's John Klein. First of all, I want to say I'm a consumer of public records and that your city clerk does a fantastic job of delivering them way ahead of time. It's sort of like I sent in a request to go have a cup of coffee and sit down.'",
        "'speaker_2': 'There it is. I mean, it's not quite that fast, but pretty close sometimes. But the city clerk's office is doing a great job. I wanted to address specifically. This is not within the items that you're thinking about.'",
        "'speaker_8': 'Tonight.'",
        "'speaker_2': 'But it's section 2.9, 3.2. It's the timeline for filing a complaint. The complaint must be filed. If you think there's been a violation of the Sunshine Ordinance, a claim that must be filed within 15 days. I'm not sure what the purpose of that is.'",
        "'speaker_2': 'And my question would be, if you filed a complaint within 20 days, do you reject it? And then what is the what is the recourse that the got the complaint and has is the recourse to the Brown Act.'",
        "'speaker_2': 'And then they must go to Superior Court to enforce a violation simply because it's run under your own rules. And that might suggest that your rules are infamous, impermissibly too restrictive. But a larger issue is I'm a fairly new in Alameda but I know of this that you have several sort of like what I call quirky little'",
        "'speaker_2': 'timelines. For instance, at the Rack, you must if you have a complaint on rent increase, it must be seven days. Well, again, what happens at the 10th day? Are you just out of luck? That doesn't seem quite right.'",
        "'speaker_2': 'Then you have seven days to appeal a rack recommendation. Okay. That could be a little longer. But the flip side to you can appeal it to the have city council, review it within seven days. That could be a little longer.'",
        "'speaker_2': 'The flip side of that, the council has no there is no timeline for the council to issue its ruling on whatever that appeal is. And so that's. That's a hole that needs to be in in that particular aspect.'",
        "'speaker_2': 'But I think that's it. So as far as I don't understand the need for the 15 day limit. Perhaps I'm sitting at home looking at a council meeting from a few months ago and I see something, you know, I see a Brown Act violation.'",
        "'speaker_2': 'It's it's too late. And that doesn't seem right. Doesn't seem that. But it seems to me that the only recourse at that point is to the Brown Act and to Superior Court. And that doesn't seem correct. Thank you very much.'",
        "'speaker_0': 'Thank you. Paul Foreman.'",
        "'speaker_2': 'Madam Mayor. Members of Council. The first part of my talk. Presentation is not going to be public comment. It's going to be representing the position of the Commission. I hope it will be treated in that manner, although I don't intend to to speak long.'",
        "'speaker_2': 'The second part will be my personal opinion, and I will let you know when I've crossed the Rubicon there or whatever. I think counsel has described the situation well. There are two points of disagreement between the commission and the staff.'",
        "'speaker_2': 'I hold up the quotation marks because one thing that I wonder is who is staff? I don't know who I'm arguing with. But the two items are the one involving the use of communication devices, which I'm going to speak to.'",
        "'speaker_2': 'And the other one involves the the a advisory board being able to take a position contrary to council in a public way, which I'm not going to speak to. Irene Deeter was to speak to that when we were dealing with it last month.'",
        "'speaker_2': 'But she can't be here today. But I think she has communicated her thoughts to some, if not all of you. Now, the Commission certainly agreed unanimously, I would say, with staff's provision to move this section from findings to its to a substantive art.'",
        "'speaker_2': 'And we also agreed that things like emails, texts, instant messaging during a meeting should not be allowed because it's a public meeting and all public comments should be available to the public. However, the Commission felt that the subsection in the findings and even the new subsection as drafted is too narrow and does not reflect today's technical technological'",
        "'speaker_2': 'reality that elected and appointed officials should be able to use their personal smartphones or iPads or laptops, assuming and they seek to access information relevant to the subject matter that under discussion, for example, an official may want to access electronically a portion of the city's municipal code or other data on a city website that is not on'",
        "'speaker_2': 'the agenda. You may want to view a Google Map satellite view of an area of the city that is proposed for development, even though such portion is such a portion is is not part of the agenda materials. He may want to review historical information relevant to the issue.'",
        "'speaker_2': 'You've been talking about some historical information here. So for that reason, we have drafted language that the use of electronic communication devices other than for purposes of a member's accessing agenda, materials that are on a members iPad or a laptop computer or accessing information available on the Internet shall be prohibited during meetings.'",
        "'speaker_2': 'So we are allowing you to access the Internet for informational purposes. Now, staff continues, as you know, to recommend their language, saying that if we our language is used, there will no longer be a bright line. And our position is the commission language is just as bright as that of the staff clearly stating what is or is'",
        "'speaker_2': 'not prohibited insofar as monitoring is concerned. There's lots of possible violations of the Sunshine Law, which are not very monitored for. I don't know what Councilman De Saag is looking at now. But that's just an example. I'm not trying to play it because you happen to have a laptop out there.'",
        "'speaker_2': 'But, you know. But there may be a discovery request.'",
        "'speaker_7': 'I'm looking at this unsigned ordinance.'",
        "'speaker_3': 'All right.'",
        "'speaker_2': 'But the point is that there might be a request for emails. There have been discovery requests made for emails. And we may discover in that that an email was sent during a meeting. And then that's how it would be, you know, reveal.'",
        "'speaker_2': 'So we would like you to consider the commission unanimous decision. Now, my personal view and how you can time me has changed since voting. Since voting for the broader language, allowing agenda and internet viewing. I would prefer the members use of their devices be allowed for any purpose other than sending and receiving communications.'",
        "'speaker_2': 'I think you should be able to use it for note taking drafting their statement of rationale for a vote, etc.. Also, I would redraft this section to remove any reference from devices to devices at all. The issue is not the devices but one of having private communications with others concerning city business during a public meeting.'",
        "'speaker_2': 'In this day and age, the use of a computer type device during a meeting does not create the impression that one has been using it for some nefarious purpose. I'm sure it never crossed anybody's mind that Tony is now communicating with Roland Colin during a meeting.'",
        "'speaker_2': 'I just.'",
        "'speaker_7': 'Don't. Which I'm not. Let's be clear about that. Okay.'",
        "'speaker_2': 'I keep picking on him, but that's because we know how honest Tony is and we would never think that. And in this day and age, just because you look at your iPhone, it's not assumed you're doing something nefarious.'",
        "'speaker_2': 'My own personal view is I would change Section eight to make it much shorter and much simpler. And it would say this, you know, here I should have given you this just because my. My language would be. In order to ensure that all communications to members presented in a public meeting are shared with the public.'",
        "'speaker_2': 'Members are prohibited from sending or receiving emails, text, instant messages during the meeting that pertain to the business thereof. Anything else you can do? Including emailing your wife that you're going to be late tonight. And that's my view of it.'",
        "'speaker_2': 'These are wonderful devices. If they're used correctly, they're going to help you in your decision making. And I don't want to limit that. One last thing. That is, we never we got these responses from staff, but they never discussed them with us.'",
        "'speaker_2': 'If Council sees fit and you want to send us back to the drawing board, only this time ask for a working session between the commission and whatever members of staff are involved in this and try to work out new language for you.'",
        "'speaker_2': 'I think that would be a good idea. So anyway, I think I can speak for the commission in saying we're perfectly willing to do that if you'd like us to. Thank you. Any questions? I'd be glad to answer.'",
        "'speaker_0': 'A memory.'",
        "'speaker_6': 'I tell a point of information management is your watch. How's your. What is your suggestion on how we go through these? I mean, one at a time or.'",
        "'speaker_0': 'I just want to clarify. So. Mr. Foreman is on the commission, so.'",
        "'speaker_6': 'I really understand.'",
        "'speaker_0': 'All right.'",
        "'speaker_6': 'And Irene.'",
        "'speaker_0': 'Called me. I appreciate that.'",
        "'speaker_6': 'I'm sorry. Okay. Just trying to move along.'",
        "'speaker_0': 'So I would suggest that we actually go through each item separately, have that discussion, decide each item. But our what our decision is and then move on to the next one.'",
        "'speaker_6': 'That's good.'",
        "'speaker_0': 'So that we can discuss each item.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'All right. So and can go through the presentation in regards to the issues that you wanna look at the ordinance itself.'",
        "'speaker_6': 'I mean, I was suggesting calling the staff report.'",
        "'speaker_0': 'All of the staff report. All right. So. First item on page six is use of electronic communication devices at meetings. That's what I believe is the first one on the list.'",
        "'speaker_2': 'Not Mayor?'",
        "'speaker_0': 'Yes, vice mayor.'",
        "'speaker_2': 'I think that distillation that we just heard is at the root of the problem. If there's private discussions that are going on that the public doesn't have knowledge of. I think that should be called out as being prohibited.'",
        "'speaker_2': 'As far as receiving and looking, searching for other information. I'm torn a little bit on that because the public should see the information that's been discussed before the meeting. That's the purpose of the notification and we should be making.'",
        "'speaker_2': 'The determination is based on what has been presented publicly for discussion. But on the other hand, if if we need more information, there's something on Google Maps that should be there that should not be entered into the discussion unless the public gets a chance to look at it as well.'",
        "'speaker_2': 'So I think the. What we should at least we should clarify the the prohibition of the. Nonpublic communications which amount to discussion with with the body members. And I'm I'm fine with leaving. Limited to. Accessing what has been.'",
        "'speaker_2': 'Put out in the public as materials for that meeting. If we need more, we can ask for it and have that noticed. And sent out member Ashcroft.'",
        "'speaker_0': 'And at this point, I'm just going to go around and then we can discuss after our positions. All right. Nebraska.'",
        "'speaker_4': 'Yeah. So I. I'm not comfortable, what with the expansion that I've heard discussed of the use of electronic communication devices in meetings for much the same reasons that the vice mayor just articulated. The. The public is entitled to know what we base our deliberations in our decision making process on.'",
        "'speaker_4': 'And if there is, you know, in the course of preparing for meetings and we're reading material and we feel that there is there's more information that's needed, there's a way to let staff know that and and to get that introduced into the public record.'",
        "'speaker_4': 'But I. I would not support the expansion to be able to pull up from the Internet right there at the meeting with no advance information to the public. The kind of information that is suggested in this handout that Mr. Foreman just gave us, and I certainly appreciate all the time and thought.'",
        "'speaker_3': 'That.'",
        "'speaker_4': 'Went into the comments. I probably would have been even more comfortable if there was something that, you know, showed all the names of the commission as this having come from them. But. And in any event, I just. The Brown Act still governs what we do.'",
        "'speaker_4': 'And I can't square this particular amendment or revision with the Brown. Thank you.'",
        "'speaker_0': 'And before calling them memory, it's my recollection that the commission did have a recommendation that was broader, that was brought, and that staff is contradicting at this point. In regards to your comment of having them approve that statement.'",
        "'speaker_0': 'And. You know what? Remember what their recommendation was? Does anyone? It wasn't here.'",
        "'speaker_6': 'It's on. It's on the staff report. The the taped one, not the PowerPoint on page two, I believe.'",
        "'speaker_0': 'What was it? Go ahead.'",
        "'speaker_6': 'I guess I can read it. The commission never felt that this subsection as drafted was too narrow and did not reflect today's technological reality that elected and appointed officials should be able to use their personal smartphones or iPads during a meeting to access information relevant to the subject matter than under discussion, but should not be allowed to'",
        "'speaker_6': 'use such devices to send or receive information to or from inappropriate sources such as third parties. Rick. Yeah. Yeah.'",
        "'speaker_0': 'So thank you. So that in my opinion, that was exactly what the Commission had said.'",
        "'speaker_6': 'Member Audie. Thank you, Madam Chair, I. You know, I'm more inclined to support, you know, the commission's recommendation. And, you know, perhaps Mr. Foreman's suggestions have some merit, too. I mean, the way that the the the staff said it, we have to turn them off.'",
        "'speaker_6': 'So we can't turn them off and still access our agenda on our iPad at the same time. So there's a direct contradiction there. And I do remember it was Mr. Foreman who said it or someone else. But, you know, if you have a family member that's, you know, having a problem, I'm not going to turn up my'",
        "'speaker_6': 'phone and not know that somebody's having an emergency. I do think it's inappropriate for, you know, for example, me to text, you know, council member Ashcraft and say, you know, can you believe so-and-so said that, you know, we need to do whatever, whatever.'",
        "'speaker_6': 'You know, that's inappropriate. And, you know, the the fictitious that did not happen conversation that Mr. De Saag was in.'",
        "'speaker_4': 'Unfortunately, we might want to put that. But that actually.'",
        "'speaker_6': 'Said those type of things, I think, yeah, we shouldn't be doing that. But you know, if we're having a discussion on the investment strategy and investment policy and the staff report says the investment policy is on the city's website and we have to look it up on the website.'",
        "'speaker_6': 'We should be allowed to do that. I mean, if we hear something in public comment and maybe we say, well, that person's clearly wrong, you know, we should be able to go to the Internet and look it up.'",
        "'speaker_6': 'Or if someone says, you know what? I remember there was one instance a while back what proposition? We required us to do something. You know, and we should be able to look that up and, you know, provide that information or say, you know, wait a minute.'",
        "'speaker_6': 'You know, The Chronicle says.'",
        "'speaker_2': 'Blah or.'",
        "'speaker_6': 'You know, amend the minutes from a year ago because, you know, the clerk's not going to pull up minutes from a year ago. We can pull it up really fast on our on our our iPads. But that's not something that's in a packet.'",
        "'speaker_2': 'I that's.'",
        "'speaker_3': 'Why.'",
        "'speaker_0': 'I heard him comment.'",
        "'speaker_4': 'After.'",
        "'speaker_6': 'I mean, so then I'm going to stop in the middle of before I'm trying to prepare my remarks and say, Laura, can you can you get these minutes from 2014? And when, you know, I could just look them up, get my point and, you know, write what I'm going to say.'",
        "'speaker_6': 'So, you know, I'm more inclined to lean towards what the commission recommended, but still with some restrictions that, you know, the five of us aren't allowed to text to each other or email to each other, or there may be an email that somebody wrote me that I want to refer to that, you know, maybe a public comment'",
        "'speaker_6': 'or triggered my memory and I forgot to write it down that I wanted to talk about it and I should be able to talk about it, you know, but I shouldn't be sending an email to Janet or the attorney or Ms..'",
        "'speaker_6': 'Ott or anybody else, you know, during during the meeting, you know, that I totally get. But. You know, we should be allowed to research some information, whether it's Google Maps or the municipal code or whatever else, historical information, those type of things.'",
        "'speaker_0': 'Amber Daisuke a.'",
        "'speaker_7': 'Great. Thank you. I guess my biggest concern is the inability to use calculators because Excel spreadsheet is a calculator in effect. And to me, this is important. I mean, way back in 2003, when we were an incredibly important discussions about refinancing bonds for at the time the Alameda Power and Telecoms Telecommunication Project.'",
        "'speaker_7': 'You know, in looking at the data that was before me, I just ran some quick numbers on the amount of customers that that were expected. And if you believed what was in the packet, you would have had to have believed that we were going to suddenly get a 61% increase in in subscribers over a short period of'",
        "'speaker_7': 'time. And I had I think those were calculations I made on XL then at the meeting. And to me, it's like that was struck at the core of whether for that specific matter, that struck at the core of whether or not it was indeed feasible.'",
        "'speaker_7': 'And you could only do that with, you know, some kind of tool. You could have done it before the meeting, for sure. But I can't recall if the meeting if the numbers were presented at the meeting. So I don't know.'",
        "'speaker_7': 'I can't recall. But it it's really hard for me to you. I mean, this not being able to use certain electronic devices. I think that's really I think the public wants us to be the best council members as possible and they want us to be armed with whatever tools that are necessary to make the best decisions possible'",
        "'speaker_7': '. And at the same time, there needs to be safeguards with regard to, you know, relaying information in ways that the public does not have access to. It's a fine balance, but at this point, I don't think that the balance has been struck yet.'",
        "'speaker_7': 'So.'",
        "'speaker_0': 'So I would agree with member Ody and member de Saag, and I think that everyone expects us to be able to use a calculator. I think it's a very extreme position to recommend that we are not allowed to use calculators.'",
        "'speaker_0': 'I and and also I personally use the laptop and I don't require print hard copies of most things. And in order to come and all of us any research we do at home, any notes we take on a tablet or anything to suggest that we can only look at our notes if we put them on a hard'",
        "'speaker_0': 'copy, we can look at them if we take notes on an iPad. Or to me, that's completely contrary to a prior report we had in regards to being green. I think we do want to be green. I think we are encouraging the use of this iPad.'",
        "'speaker_0': 'In fact, if the city is not going to allow us to do anything but review that, I'm not sure it's worth the city's money to even give us these. I think that the city does loan these to us to be able to access calculators.'",
        "'speaker_0': 'The emails that we receive, we don't have I don't ask staff to print out every email that would be voluminous on some issues to access. And, you know, without repeating everything, we're sorry and they succeed. Personally, I, I do support the.'",
        "'speaker_0': 'The Commission's recommendation. Except actually, I think I agree with having the focus. I would rather have just focused on the issue of communication between members. Actually, communication during the meetings that I don't think they should be used for communication with anyone else during a meeting.'",
        "'speaker_0': 'Actually, not as anyone else I would. In regards to texting, if you receive a text from a family member or something like that, I don't have a problem with that and I know many of us are here to when I am or whatever.'",
        "'speaker_0': 'You may very well have a family member that you need to communicate with. And I don't think that by serving on the council or any of our boards, you should have to not not have access to a family member or whatnot.'",
        "'speaker_0': 'But I do think that and I think we all agree it's inappropriate for us to communicate with each other or someone else, you know, to receive information in regards to an issue. So with that being said. Should we frame a motion on this?'",
        "'speaker_0': 'Someone want to make a motion? I have a quiver.'",
        "'speaker_4': 'So I heard a council member disagree. I thought you stated the issue very well. And I. I do think I agree with you. The public wants us to be well prepared and to use tools, but with some limitations.'",
        "'speaker_4': 'So I would be interested in hearing from you. I'm assuming if you threw that language out, you might have some ideas of some limitation language you might put in there. And by the way, I agree with the part.'",
        "'speaker_4': 'I was actually surprised about the calculator, the language I had.'",
        "'speaker_7': 'I don't have specific language, but what I was impressed with the final paragraph in Mr..'",
        "'speaker_3': 'Form Foreman.'",
        "'speaker_7': 'Foreman's letter, and I was impressed because to me it kind of, you know, it satisfies Occam's Razor. You know, the things that are the most parsimonious are probably the most or whatever are probably better.'",
        "'speaker_0': 'And I retrieved the members are prohibited from sending or receiving emails, texts, instant messages, etc. during the meeting that pertain to the business thereof.'",
        "'speaker_3': 'But I mean, yeah.'",
        "'speaker_6': 'But yeah we're going to receive stuff from people. Yeah. Yeah. Shouldn't be sending.'",
        "'speaker_0': 'Parts of consent.'",
        "'speaker_4': 'Across the.'",
        "'speaker_0': 'Ocean.'",
        "'speaker_4': 'Well, but to the mayor's point, though, you probably want the because you you made the reference to text messages for emergency purposes. And I still would like, though, to hear of the the city attorney to weigh in on what about accessing information or Mr. Rausch accessing information that the public doesn't have access to that we might be'",
        "'speaker_4': 'basing our decisions on.'",
        "'speaker_0': 'So, in fact, in regards to that, if we take notes at home and we bring them here in a hard copy, how does that differentiate from something that I'm retrieving on a computer as opposed to printing it out?'",
        "'speaker_8': 'I think that if there is a consensus on on this council that this language needs to be looked at a little more thoroughly, clarified somewhat. My recommendation would be, rather than have you all try to wordsmith it tonight.'",
        "'speaker_8': 'That will be here once you all have made comments on it. Let us take it back to the Open Government Commission with those comments in mind and bring you back something that that may be a little more workable from your point of view.'",
        "'speaker_8': 'You know, we were you know, we were working off what the you know, what the prior council had adopted. Staff was a little concerned about going further than what that council had done. If this council is comfortable with expanding it and clarifying the language, let us work with the Open Government Commission to see if we can come'",
        "'speaker_8': 'up with some language more acceptable rather than, you know, rather than try and come up with the precise language tonight. If that's the council's desire.'",
        "'speaker_0': 'So member body.'",
        "'speaker_6': 'Thank you. I mean, I'm okay with that. I think the commission, according to the staff report, you know, they had ideas. So I mean, they should be able to go back and put their ideas into some type of language.'",
        "'speaker_6': 'And, you know, my suggestion would be to kind of incorporate what Mr. Foreman had to say. You know.'",
        "'speaker_8': 'Certainly have heard some good suggestions tonight in terms of not making it quite so narrow and to allow the use of things like calculators, allowing family members, you know, to to communicate with you all. I think there's some some definite wordsmithing we can do that will accomplish what I'm hearing the council saying.'",
        "'speaker_8': 'But rather than spending time trying to do that tonight, let's work with the commission. Have you who've you've appointed to come back with that language and hopefully it would be your preference.'",
        "'speaker_6': 'Thank you. But hopefully it's not like a laundry list of things that you know can be done and can't be done because, you know, then we're expanding our ordinance and, you know, general statement of policy concept.'",
        "'speaker_8': 'We will keep it as succinct as possible. You know, not having, you know, A through Z. Yeah.'",
        "'speaker_2': 'Vice mayor and having heard the discussion or the comments of my colleagues and. Again revisiting the wording that hits the prohibition of. Nonpublic discussions of agenda items I think is the core list in all the things that are permissible.'",
        "'speaker_2': 'But I'm hearing that that's not what we want. But I would like to have the commission consider. Some language, its guiding language, not prohibitive language around. The balance between what the public would see as the presentation. It starts the discussion.'",
        "'speaker_2': 'But accommodates the need to go back and look for something that may not be included in the packet, such as previous meeting minutes, expanded maps, etc.. So those are the two points that I came away with, hearing what my colleagues said.'",
        "'speaker_0': 'Mine is actually much broader that we would be able to use them for anything we could do at home and just not have to print them out and then have access. I think that because again, people may feel comfortable printing stuff.'",
        "'speaker_0': 'The rest of us, I think, may not. But that that doesn't. Whether it's just on a computer or it's a hard copy, it's still the same.'",
        "'speaker_2': 'But I'd still like to have that that clarification that is part of open government.'",
        "'speaker_4': 'Right?'",
        "'speaker_2': 'When we have an agenda item, here are the materials that start the discussion. And everybody, the public as well as us sees that they prepare their own notes. But something to express what you just said. But in the context of we're starting from a common place of information that's been gathered by our staff to discuss this item'",
        "'speaker_0': '. But I think that's what we. So I'm not sure what that is different from what currently happens. We receive an agenda that has documents. Is that not the starting point that you're referring to or are you referring to something else?'",
        "'speaker_2': 'Well, I that's exactly what I'm talking about.'",
        "'speaker_0': 'And that's what I think.'",
        "'speaker_4': 'I think the vice mayor articulated it very well. And I would I.'",
        "'speaker_0': 'Would I appreciate that. I was asking him to clarify.'",
        "'speaker_2': 'That's what I.'",
        "'speaker_0': 'Meant. I actually wasn't asking you. Thank you.'",
        "'speaker_4': 'I wasn't waiting to be asked.'",
        "'speaker_0': 'And I understand that. All right. Let's move on to the next item. Policy body members submitting written comments were not present at the meeting. We wanted to speak to this.'",
        "'speaker_6': 'But we don't it. There's nothing on definition a meeting in policy body.'",
        "'speaker_0': 'Well, this was.'",
        "'speaker_6': 'I'm I'm not okay either.'",
        "'speaker_8': 'So that item, I think, was just more for information purposes than anything else we're not recommending. And the commission did not recommend any changes there. We included that because the Commission had a somewhat lengthy discussion about it and staff wanted to make sure you were aware of that discussion.'",
        "'speaker_8': 'But there really aren't any substantive changes relative to that. Item number two.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Okay. So before we move on though, is everyone agree in agreement with leaving that as is and I'm okay. All right. Thank you. And public comments by policy body members. Is that another item or is that the same?'",
        "'speaker_0': 'Actually, every. On mine.'",
        "'speaker_6': 'No, it's all right in that president meeting.'",
        "'speaker_0': 'I recommend there should be no prohibition where a staff is recommending a prohibition would be prohibited. Okay. So this is where the commission disagreed with the staff. Though the commission recommended that there should be no prohibition and staff recommended that there should be.'",
        "'speaker_3': 'Well.'",
        "'speaker_7': 'Yes. My opinion on this is that I like staff's recommendation and I like staff's recommendation because it's similar to. When Council is going to be part of a meeting. But they're like, they might be in another state. They have to go through this whole process of agenda raising themselves, making making themselves readily available so that the public'",
        "'speaker_7': 'can kind of know where, how and where that person is and how that person is going to get involved. This basically says, well, you don't have to have that process. You know, you can just phone it in basically.'",
        "'speaker_7': 'And you know what? You have to show up. If you want to be part of the meeting, you have to show up.'",
        "'speaker_0': 'I think that was the prior item. Yeah, that was. Okay. So know that this has to be reality and that was actually the one pertaining to whether or not you can send that take some formal action that contradicts counsel's adopted policy.'",
        "'speaker_0': 'Oh, so number three. Okay. Okay.'",
        "'speaker_4': 'So Tony was a member Dave I was referring to. Oh, I'm.'",
        "'speaker_7': 'On the staff report.'",
        "'speaker_0': 'Okay. I for flirtation.'",
        "'speaker_4': 'But you're in number three and I think we might have skated on to number four. So now I think.'",
        "'speaker_0': 'I'm actually following the presentation.'",
        "'speaker_7': 'Okay.'",
        "'speaker_0': 'That's how.'",
        "'speaker_4': 'We doing on.'",
        "'speaker_0': 'The presentation. There is an item that's policy body. So that was the one pertaining to whether or not someone that's not present. Good comment. And I think we all agree that that's okay to leave that that if you don't attend, you don't comment or.'",
        "'speaker_6': 'I'm a little concerned that people check their right to speak at the door when they become a member.'",
        "'speaker_0': 'But and I actually would agree with you on that. I don't have a problem allowing them to.'",
        "'speaker_6': 'You know, but the example in the staff report, you know, if you disqualify yourself because of financial conflict, well, you know, maybe you shouldn't be allowed to do that. So it's a little bit yeah, you know.'",
        "'speaker_2': 'I mean, to me, I don't know that we have a problem and if someone is not going to be able to vote, wants to express an opinion. That a constitutional right. And I think the risk of having them carry a little more weight than a public person.'",
        "'speaker_2': 'It is is not very great compared to the lack of someone's ability to say something.'",
        "'speaker_4': 'So clarify member.'",
        "'speaker_0': 'Ashcroft. Yes.'",
        "'speaker_4': 'So can one of the staff attorneys or the attorney remind us, is there a case law that that speaks to this?'",
        "'speaker_8': 'There really is not. It simply was. It's a policy issue as to whether or not. Aye, aye, aye, aye. Policy board member who is not present should be allowed to provide information to that persons policy board if he or she is not present.'",
        "'speaker_8': 'Now the way it is written is sort of notwithstanding that if the item concerns a person's personal residence or the person's business. Much like the rules are with respect to conflicts of interest, that person would still have the right at that point to provide information to that person's policy board.'",
        "'speaker_8': 'So there is an exception. It's not a you never can do it. It's simply if if the item involves the property next door to me and I can't be there to the meeting, I would still be able to provide comments to the, you know, to my to my board.'",
        "'speaker_8': 'But the general rule is that if you're out of town or on vacation or whatever, then you would not be able to submit comments to your board. There's no I'm not aware of any case law that says anything.'",
        "'speaker_8': 'This is strictly, you know, does this council think that's a good idea or a bad idea? And that's where it is.'",
        "'speaker_0': 'And would disagree.'",
        "'speaker_7': 'So my take on this is that is just being practical, is that as Woody Allen says, you know, half the battle is showing up. So if you show up, then you not only get the right to vote, but you get the right to express your opinion.'",
        "'speaker_7': 'You mean it's not fair that if you don't show up and it's a controversial item and you don't happen to show up, but you get to insert your opinion for the public for the public record, you don't have to vote on it.'",
        "'speaker_7': 'Oh, you know what? I sent in my. To me, that's not fair to me is, you know, you're appointed or elected officials or commission and you show up and you vote and you make your opinions. Me if you're not there to get.'",
        "'speaker_0': 'Any other comments.'",
        "'speaker_6': 'So I'm sorry. Just yeah, I kind of would think that it would be the flip side that, you know, if somebody has a financial conflict, you know, I don't really want to hear their opinion because I think they're conflicted out from from sharing it with their colleagues on the board or the council.'",
        "'speaker_6': 'But, you know, otherwise. It's kind of a free speech issue. I don't I don't again, I don't think you check your your speech rights at the door by joining a board or commission.'",
        "'speaker_0': 'Did you already speak on the item member Ashcroft?'",
        "'speaker_4': 'No, I don't think I, I, I, I think part of the problem I may be having is that we're mixing a couple of concepts into one provision. So board member with a disqualifying financial conflict of interest. Shouldn't be allowed to.'",
        "'speaker_4': 'I mean, a conflict is a conflict. But under any circumstances. But then this and this other question of whether a member of a body is physically unable to attend. Should they be able to submit comments that they feel strongly about, presumably in writing, I guess.'",
        "'speaker_4': 'I don't see the harm in that, but I'm not sure why we're why those two belong together.'",
        "'speaker_0': 'So.'",
        "'speaker_6': 'That's the that was the staff recommendation. So that's why I was commenting on it.'",
        "'speaker_0': 'So staff, I don't know if you want to respond to her comment, but I would agree that this member already and vice mayor I'd rather have it. I don't want to quash someone's First Amendment right to speak.'",
        "'speaker_8': 'The wasn't trying to mix the metaphor. I was simply trying to indicate that. In the situation where a person had a conflict of interest that would otherwise caused a person lead the diet and leave the room. But if that person had a personal I mean, if the exception under the APC would allow the person to come down'",
        "'speaker_8': 'off the dais and address the commission. And I was analogizing that if that were the situation where the board member were not present. But was in the same situation as if the person could address that body. If that had been a conflict of interest, then it would be okay to submit the information because the person's personal interests'",
        "'speaker_8': 'would be involved as opposed to not being involved at all. So it was it was perhaps not the best analogy, but that was the best I can come up with to try to indicate where that exception would apply.'",
        "'speaker_0': 'So if you want to work on that language and bring it back and I think separate the two comments so that if I for at least a majority of members, say that if assuming there's not a conflict of interest and the person just happens to not be able to attend the meeting, then they can in fact submit'",
        "'speaker_0': 'something their comments in writing to be considered.'",
        "'speaker_6': 'It's written today. They'll write. Well.'",
        "'speaker_8': 'Maybe I misunderstanding is. The that the language in there right now is simply create an exception as to when the person could. I think what we're looking for from the council is does the council feel that it is appropriate for a board member as a general principle to be able to submit comments, even if that board member'",
        "'speaker_8': 'can't attend? And if the answer is yes, then we can do away with this whole section. If the answer is no, then I think the language as proposed covers that.'",
        "'speaker_0': 'So I don't think the language is where it has too many negatives. I would propose that it be rewritten so that it's it's actually more of the positive that a member of a policy body, as you want to say, who is unable to attend, may submit written comments regarding and unless they're disqualified as opposed to the no'",
        "'speaker_0': 'member. I think that's what you're saying is if you're a member of a party, you can present your comments if you're going to be absent unless you are disqualified for some reason.'",
        "'speaker_4': 'Or are you asking whether the the ordinance needs to address it at all?'",
        "'speaker_8': 'Well. Well, what what I was trying to say and perhaps I didn't say it as artfully as I could, is that the way it's drafted? Is the general rule, is a board member who is not present, can't submit any comments.'",
        "'speaker_8': 'The exception to that would be is if the item before that board pertains to that person's personal financial. Interest, then that person could submit comments. Now we could take that out and just say you can't submit comments and the story.'",
        "'speaker_0': 'Or I think we're saying the opposite, that they can submit comments.'",
        "'speaker_8': 'And then we then we can just delete this whole section and we don't need to rewrite it. If the if the.'",
        "'speaker_0': 'Correct. All right.'",
        "'speaker_4': 'Better still.'",
        "'speaker_0': 'Okay. Is everyone good without them? All right. Very good. Okay. That's really clear.'",
        "'speaker_8': 'Yeah, I just. I mean.'",
        "'speaker_2': 'Yeah, that's.'",
        "'speaker_8': 'If it's okay, it's okay to submit the comments. That means this section can go away.'",
        "'speaker_0': 'Excellent. All right, moving on, then. Of course, the next. Okay. Next is the body. Public comment by members of the boss the body. So this, I think, was the letter that we were talking about earlier, that this is that paragraph, this provision.'",
        "'speaker_0': 'All right. So in regards to whether or not we think of public bodies should be able to weigh in on an issue. Anyone want to discuss that one? Madam Mayor? Yes, Vice Mayor.'",
        "'speaker_2': 'Given that the Council can. Remove any member of a board and given that staff can. During the deliberations of the of the advisory body provide them with the information of what is city policy. I think given those two, I, I, I think that the recommendation of the Open Government commit commission should stand.'",
        "'speaker_2': 'I don't think there should be a prohibition. And that's kind of the American way. If there's egregious problems at the council level and it's I think it's the duty of. Boards commission citizens to speak up. And we have a history, a recent history, civil rights history is based on those changes that were based on people by changing'",
        "'speaker_2': 'the status quo. So I don't think we have anything that approaches that here. But I think to put that prohibition here maybe doesn't belong in an open government policy. It might work the opposite.'",
        "'speaker_0': 'Remember Ashcroft?'",
        "'speaker_4': 'And just to refresh my recollection of the the letter and I know I was on that council, but the letter that the Recreation Parks Commission wrote said just sent to city council members, was it published? Was it sent to another governmental entity like the Park District?'",
        "'speaker_4': 'But what happened?'",
        "'speaker_3': 'Well, it was public. It was sent to the council. It was publicly available. And so the Park District would have received it. But I.'",
        "'speaker_0': 'Frankly don't remember at this point in time.'",
        "'speaker_3': 'Whether it was it was individually sent to the Park District as well, but they certainly would have had the ability to see it. And do you remember anything specific? It was not specifically sent to the Park District. It was was provided directly.'",
        "'speaker_4': 'Okay. Well, I mean, in in that case, and I, I will hasten to say that I am really reluctant to craft a code section or a provision that focuses on one instance that we can all recall that clearly.'",
        "'speaker_4': 'I mean, there in the case of litigation, when we're in litigation. Press litigation is going to be in closed session. So I mean, a commission, I, we wouldn't want things to be done that would be undermining our position in litigation.'",
        "'speaker_4': 'At the same time, in a city of any size and, you know, we're pretty good mid-sized city, there are going to be a variety of differing opinions. And so then to the point the vice mayor made about the council always has the prerogative of removing a board of commission member.'",
        "'speaker_4': 'My only question would be, is there language somewhere that is clear enough about when you do cross that line and get into the territory where you might be removed? Because we certainly wouldn't want to impose something. As drastic as removing someone from a commission without their having notice of what could get them into hot water.'",
        "'speaker_4': 'Did you see.'",
        "'speaker_2': 'Something? I don't. And I actually don't see why there should be a prohibition based on pretty much that same line as that. The situation that was described was a legitimate difference of opinion and a legitimate advice, in my opinion.'",
        "'speaker_2': 'And. I think this seems to be. And trying to squash that.'",
        "'speaker_0': 'I'm concerned.'",
        "'speaker_4': 'Mary Spencer, I'd love it if you would just let us to have a little bit of a discussion, a back and forth. I know you want to get to the people that we.'",
        "'speaker_0': 'Have and members that haven't said and I.'",
        "'speaker_4': 'Know and I and I think that they will do that.'",
        "'speaker_0': 'Lined up your comments.'",
        "'speaker_4': 'Absolutely so. So I'm vice mayor. See, I understand and I think I agree with you on that particular instance with the letter. Can you envision just in a broader sense, because if we're crafting a policy, it's going to apply to more than just one instance.'",
        "'speaker_4': 'Can you imagine an instance where we would even want to weigh in on this, or should this not even be a part of the mentioned ordinance?'",
        "'speaker_2': 'I don't think it should be a part of the Sunshine Ordinance. I think it's part of the handbook for new commissioners and what their duties are, what their responsibilities are. It's like the council has and and take it out.'",
        "'speaker_0': 'All right. I'm going to call on another member at this point.'",
        "'speaker_4': 'But I do think there's value to discussing things.'",
        "'speaker_6': 'Thank you, Madam Mayor. You know, I'm kind of. Seeing both both sides there. I think if a council sends a I mean, if a commission or board sends a letter to the council that says, we disagree with what you do, I don't think we should stop that.'",
        "'speaker_6': 'I mean, if they're sending a a letter to an outside organization that undermines, you know, our policy or undermines our, you know, position in litigation, you know, then I think that that's not appropriate. Do we think that we have that the remedy of removing them from that board or commission is sufficient?'",
        "'speaker_6': 'I mean, I guess that's something we'll have to decide, but. Yeah. That's kind of where I am on that because you know. How many staff shouldn't be advising? Bodies to send out, you know, say, for instance, that letter was sent to the Park District.'",
        "'speaker_6': 'You know, staff should stop that from happening. I mean, the council spoke, but, you know, someone disagreeing with us. And then, you know, I kind of wonder, you know, if we still have ultimate say over some of these these decisions that we make a policy and say the planning board decides to do something contrary to that policy'",
        "'speaker_6': '. You know, we still have the ability to reverse what the planning board did. So. Yeah. Everyone should just be reasonable. You know, when they're on a commission, they kind of know what their role is in there, you know?'",
        "'speaker_6': 'But maybe. Maybe that's why we have a bunch of regulations. I don't know.'",
        "'speaker_0': 'All right, member de Saag.'",
        "'speaker_7': 'Well, I think there is a possibility for or this kind of language. There is a possibility of of members of advisory boards that report the council sending information that can be construed. For. That can be construed as a certain position of the city, which is not.'",
        "'speaker_7': 'And I think. We need to be able to have language that sets ground rules. Ground rules can be, you know. Such members have to be clear that whether this is a personal opinion or what is the received, what is the what is the official position of the city?'",
        "'speaker_7': 'Because I look at this as kind of a sequential issue. Members of policy committees, legislative bodies, advisory committees are there to vet a range of issues and then submit to city council their recommendations. That's the next process. And a city council then makes makes a decision.'",
        "'speaker_7': 'And when the decision is made. Then Figure two speaking, the ship is going to move in a certain direction. So we can't have that direction undermined by contributions, further contributions that suggest that. The City Council's position is otherwise.'",
        "'speaker_7': 'So there needs to be some kind of language that guards against that possibility. People can continue to express their their their views on whatever. They just need to be clear that as to what is their personal view and what is the city official position.'",
        "'speaker_7': 'And they need to be clear as to whether or not they are using, you know, city official letterhead or not. I mean, you know, actually, that was another example. I mean, I don't think it was that bad. I mean, but I do believe the planning board several months ago sent a letter to Caltrans, which I thought kind'",
        "'speaker_7': 'of odd, but I believe it went from the planning board and I thought it was odd, but, you know, it happened. But, you know, the the injury that it caused, I don't it was it wasn't big or it didn't matter.'",
        "'speaker_7': 'But but it did kind of raise my eyebrows like, hmm, that's interesting. Why is the planning board getting directly in touch with with Caltrans? I believe that that had happened several months ago. So. But I do think that I do see the reasoning for why this is in place.'",
        "'speaker_7': 'So.'",
        "'speaker_4': 'May I just ask a question of Councilmember Desai? I just wanted to stay on what he talked about because the one thing and the vice mayor raised the specter of civil rights.'",
        "'speaker_0': 'Please let me continue.'",
        "'speaker_4': 'You know, I have right. I have a First Amendment right to. I just. Just let me finish this one side and you get the resolution for free.'",
        "'speaker_3': 'Well.'",
        "'speaker_0': 'If we hadn't have it.'",
        "'speaker_6': 'And we let.'",
        "'speaker_0': 'The mayor. So I think.'",
        "'speaker_4': 'And then will you let me get back to addressing councilmember design, because I do have a question.'",
        "'speaker_0': 'For each of us have a turn.'",
        "'speaker_4': 'And that was a yes.'",
        "'speaker_0': 'You would said, let's let each of us have a turn.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'Thank you. And I'll take mine after use.'",
        "'speaker_0': 'All right. So in regards to my comments on this item, I would agree with the vice mayor. I have concerns about limiting the free I would say the free speech and also the ability to do their job. The another body.'",
        "'speaker_0': 'So if they determined to send a letter, then I think there are other ways to come back. If you think it's inappropriate that are that are a better way to address this than to limit their speech. And I and I do agree that in regards to.'",
        "'speaker_0': 'Oh, this country works. It makes sense. And I personally do want to hear from other advisory boards if they have an opinion that goes to a decision that was made by council. As time passes, that decision may be changed by input from a board that would then demonstrate that we should reconsider.'",
        "'speaker_0': 'And I think that's how that decision, how decisions get reviewed as as time passes. And I think that may have actually happened in regards to this incident as time passed. So. Now. Now we have. I think we ought to.'",
        "'speaker_0': 'Maybe three different opinions. I'm not sure. Brody, would you like to weigh in more?'",
        "'speaker_4': 'Are you going to let me, though, address Tony? Council member Dysart, Mayor Spencer. I'm don't mind waiting till after Councilman Brody, but I'm hoping you're not trying to yell. I'm trying to.'",
        "'speaker_0': 'See where we are as a council on this issue. Because he was not clear.'",
        "'speaker_6': 'So when I heard what Councilmember De Sykes said, I think it was very convincing. So I'm kind of leaning more toward. Now that we don't want to restrict. Nobody from saying something inside but outside once the ship has sailed.'",
        "'speaker_6': 'You know, but. Someone wants to write a letter and say, you know, we disagree with you. You can't say you made a stupid decision. I think they should have the right to do that.'",
        "'speaker_0': 'And in this situation, it's my understanding it was a letter to council. All right. So Member Ashcraft, thank you.'",
        "'speaker_4': 'So actually. What when Councilmember Desai was speaking. One thing that occurs to me is that in general, I do believe you get in line behind what the city's official position is. I think in litigation it's especially sensitive. And in this case, even though the letter was written to the council, it sure did get out there in the'",
        "'speaker_4': 'public realm and in this day of Internet communications. Yes, sir. Opposing party. The Park District did get hold of it. So I'm. But then I would probably go on to ask. And what was the harm that befell the city as a result of that?'",
        "'speaker_4': 'Because the concern I also have and and I think the mayor was actually starting to say something about this, is that in the history of this country and in the history of civil rights, governments have made decisions that weren't always the correct decision.'",
        "'speaker_4': 'I'm not I'm not referring specifically to this park district one. But. But so how then do citizens have recourse in in actual real time? Because and in this case, by the way, it wasn't a matter of voicing an opinion as time passed after the fact.'",
        "'speaker_4': 'It was contemporaneous with the litigation going on. But I, I do think that there should be some.'",
        "'speaker_3': 'I think.'",
        "'speaker_4': 'Policy.'",
        "'speaker_7': 'That I think all I'm saying the test by which for me, the test by which in in this context speech is good speech or or not encouraged speech is simply. A NYC board member who writes a expresses opinion to council or some other entity on a subject matter ought to be clear as to where the Council's position'",
        "'speaker_7': 'is, and to be clear as to if the person is expressing a personal opinion on on the subject at all. But but what if they use things like letterheads? That's that is an expression of the city council. And so it's I think I think there there is a fine line because I believe the planning board's letter was'",
        "'speaker_7': 'done in letterhead. So I think I'm not discouraging people from expressing their individual personal opinions. I think this whole thing of making this into some kind of, you know, like I'm Joseph Stalin, you know, I'm not here to quash individuals personal liberties.'",
        "'speaker_7': 'I'm just saying that in order for our government to act effectively, you know, once a policy is set, you know, we ought not to encourage things that could potentially cause harm to that policy and therefore create whatever safeguards we can.'",
        "'speaker_7': 'And again, striking a balance between, you know, free speech and and the need for in all effective policy implementation.'",
        "'speaker_0': 'So this policy speaks to appointed policy bodies as opposed to individuals.'",
        "'speaker_6': 'And that's the nexus that, you know.'",
        "'speaker_7': 'We have a number for members.'",
        "'speaker_4': 'Well, in in the case of the letter, it was written as the body.'",
        "'speaker_3': 'Oh, well, in that case, then that's.'",
        "'speaker_7': 'The in that case then if that's an expression of the body as a.'",
        "'speaker_0': 'Whole. Right, that's the situation.'",
        "'speaker_7': 'Well then that's different than that. That ought not to be encouraged, because then that really is countermanded. The City Council's position individuals can express their personal opinions separately. But once the once the city council has made a decision.'",
        "'speaker_7': 'And. That's what.'",
        "'speaker_6': 'I think, unless they're complaining to the council. I mean, I think the body should be allowed to anyone should be able to complain to us and say we didn't like the.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_2': 'And I think the problem that I have with outside communication, like a letter from a board to another agency that is contradictory to city policy that's been voted on by the council. If they're representative representing that as city position, then that that should be prohibited.'",
        "'speaker_2': 'But short of that. And that and that to me is is is where the action of of the council to address the the makeup of that body comes into effect.'",
        "'speaker_7': 'I think the people.'",
        "'speaker_2': 'If they're if there is criticism and a I think the instances of that are are are. To me that not they're they're not him. Frequent enough or. Or have occurred to the point where we need to put that in an ordinance.'",
        "'speaker_0': 'By fair or I'm sorry, November day.'",
        "'speaker_7': 'To me, I think the simple test is whether it's an individual or the policy body as a whole, whether they're expressing and whether what they are expressing is conveyed as official city policy. That's all. If to the extent that they refer that they are or are not reflecting city policy, to the extent that they're clear, that's good'",
        "'speaker_7': 'enough.'",
        "'speaker_0': 'So as long as they state. Okay. So I appreciate that comment. So as long as they state what the city's policy is and what they're disagreeing with so that it's clear to the reader, like.'",
        "'speaker_7': 'I don't want someone to write, send a letter to Caltrans to suddenly say, you know, we are not for sustainable communities. We don't want a policy body that writes that because we are for sustainable.'",
        "'speaker_0': 'All right. So do we all agree with that? As long as they clarify what the city's position is and then what they're disagreeing with.'",
        "'speaker_4': 'That's fine. So that's clear.'",
        "'speaker_0': 'To the writer.'",
        "'speaker_6': 'Still sending out contradictory.'",
        "'speaker_4': 'I think.'",
        "'speaker_6': 'Letters to.'",
        "'speaker_4': 'This is this is one that's going to go back to the drafters. Yeah.'",
        "'speaker_7': 'I guess.'",
        "'speaker_4': 'Clarify for me.'",
        "'speaker_6': 'Hypothetically, you know, we decide some transportation issue and the Transportation Commission writes to the act and said, you know, we disagree with what the council said. We think we should still do X, Y and Z, that that's not appropriate.'",
        "'speaker_6': 'You know.'",
        "'speaker_2': 'And but.'",
        "'speaker_7': 'That falls within what.'",
        "'speaker_6': 'Yeah. But then them complaining to us and saying, you guys, I know I'm perfectly open to any criticism. I think we shouldn't stifle any criticism. But on letterhead like Councilmember de SAC said, you know that that's problematic.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_2': 'Of.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'So I think you.'",
        "'speaker_0': 'Want to.'",
        "'speaker_4': 'See. I am city manager. Wanted to.'",
        "'speaker_3': 'You know, I'm shaking my head that I agree. I think the internal dialog is fine. I think that external dialog is definitely problematic. And I think you gave a very good example of particularly in some sort of funding scenarios that would be really problematic.'",
        "'speaker_0': 'So then if it could come back to us for that clarification? I think so. Limited. But we're going to have to circle back and we can see then. But it would be that I'm understanding correctly that the letters that the policy body could send a letter to council with which the policy is that their concerns are with'",
        "'speaker_0': 'the policy as opposed to to a third party. If I can just add.'",
        "'speaker_3': 'Something in clarification. So.'",
        "'speaker_0': 'There's also an issue of what the authority of the advisory bodies.'",
        "'speaker_3': 'Are.'",
        "'speaker_0': 'And the advisory bodies are in the process. And I think Council Councilmember Desai talked about the sequential.'",
        "'speaker_3': 'Nature of it. It is not.'",
        "'speaker_0': 'Within the authority of advisory bodies.'",
        "'speaker_3': 'To critique the final decisions of the City Council.'",
        "'speaker_0': 'Which is the final policy.'",
        "'speaker_3': 'Maker that they are.'",
        "'speaker_0': 'Unless you ask them to. They are they are asked to get information.'",
        "'speaker_3': 'Upfront.'",
        "'speaker_0': 'And provide you with a recommendation which you then consider and you make a decision. Then it's not for the.'",
        "'speaker_3': 'Those.'",
        "'speaker_0': 'Those advisory bodies. They're not the policy bodies. You are the policy the advisory bodies to critique every decision.'",
        "'speaker_3': 'That you've made and send you.'",
        "'speaker_0': 'Publicly available. When they send you a letter to the.'",
        "'speaker_3': 'Council, it is public. So regardless of what agency they send it to, it is public.'",
        "'speaker_0': 'And so if you wanted to ask them to go back and take a look at it, as you've already done with the.'",
        "'speaker_3': 'Open Government Commission here.'",
        "'speaker_0': 'Tonight, go back and give us some more information and come back again. But then when you decide it's not for them to then re agendas it and say, well, we're not so sure that we thought they did it right.'",
        "'speaker_0': 'You've made the decision and if something else comes up, then they it works up. So it's an issue of what their authority.'",
        "'speaker_3': 'Is as well.'",
        "'speaker_0': 'And I.'",
        "'speaker_3': 'Clearly seen you.'",
        "'speaker_0': 'Struggling very mightily with not wanting to.'",
        "'speaker_3': 'Squelch free speech.'",
        "'speaker_0': 'And I think you're really onto it about the.'",
        "'speaker_3': 'Distinction between.'",
        "'speaker_0': 'Individuals and the body and what the body's.'",
        "'speaker_3': 'Role authority is and how confusing and.'",
        "'speaker_0': 'Undermining it can be if suddenly you've got every one of your advisory bodies.'",
        "'speaker_3': 'Issuing opinions.'",
        "'speaker_0': 'About.'",
        "'speaker_3': 'If they think you did the right thing or not.'",
        "'speaker_0': 'All right. So at this point, they have to come back with something based upon our comments. Thank you. And we're going to move on to the next. Is it opinions? Opinions of public concern. Is there an issue on that one?'",
        "'speaker_6': 'Brown.'",
        "'speaker_0': 'Okay. So the Commission recommended that that section be deleted in its entirety, but staff thinks that it should be included. If I can jump in.'",
        "'speaker_3': 'Here, I think this one really is very.'",
        "'speaker_0': 'Much tied in with what we've already.'",
        "'speaker_3': 'Discussed. If council is agreeable.'",
        "'speaker_0': 'And we can come back with language.'",
        "'speaker_3': 'For both of these unless you have some additional.'",
        "'speaker_4': 'Funds. So just one question member. ASHCROFT I'm struggling a bit with why. We would lump public employees and appointed officials in that I mean.'",
        "'speaker_3': 'It.'",
        "'speaker_4': 'In the same provision it just. Well. I understand we all are expected required to read and, you know, be conversant with the sunshine ordinance. But. Maybe it's not a big deal, but is it? I mean, separate paragraphs are they belong together?'",
        "'speaker_8': 'Well, for whatever reason, this section, which is now suggested in to 91 dash to 91.18, was in the 292 section. And for whatever reason, it kind of merged both the public employees and the public officials together. And so what we tried to do was was separate the two.'",
        "'speaker_8': 'So there would be different standards applicable to public employees as a versus versus public officials. And the commission felt that we were we were probably didn't need either. And our suggestion was, well, if we're going to keep it in, let's at least put it into a section which made more sense.'",
        "'speaker_8': 'So that's. It is somewhat redundant to what we have up in the the previous section two 9117. It's simply that 17 doesn't direct doesn't address public employees. It addresses only members of the policy body. So that's why it might be if if the council feels it's important to have anything in this ordinance about what public employees ought'",
        "'speaker_8': 'to be able to do or not do, then we need this. If the council feels we don't really need to address what public employees can and cannot do, then we probably can get rid of this section because the public official portion of this has really been subsumed in the prior section.'",
        "'speaker_8': 'Is that, if that makes sense?'",
        "'speaker_4': 'ASHCROFT Well, it just strikes me that a public employee would be possibly subject to discipline for doing something that they're not authorized to do. I'm just not sure. And I would hope and believe that that's addressed somewhere else in our.'",
        "'speaker_8': 'Well, I mean, there's certainly case law that attempts to define, you know, where that rule or where that line is in terms of what a public employee can do and can't do. It's it's not a bright line. And it's you know, you go all the way Supreme Court to decide, you know, whether or not a particular action'",
        "'speaker_8': 'or statement that was made by a public employee can or cannot be disciplined. Difficult to try to distill that into three sentences to be put into a sunshine or so. Maybe the better course of action is, as the Commission recommended, and that is do away with the public employee section and handle that as disciplinary matters elsewhere.'",
        "'speaker_4': 'I agree. I would.'",
        "'speaker_0': 'I think we all agree with that. Thank you.'",
        "'speaker_4': 'Dan. Thank you.'",
        "'speaker_0': 'Hey. There any other?'",
        "'speaker_6': 'Training.'",
        "'speaker_0': 'Okay. I'm on section ten oh actually two Dash 92.2 responsibilities and stuff. The only comment I had was on here when a member of the public submits a request for information to any employee.'",
        "'speaker_4': 'Could you tell us can were your.'",
        "'speaker_0': 'Yes. Well on I think it's 2-92.2.'",
        "'speaker_4': 'In the order in the ordinance.'",
        "'speaker_0': 'Yes. What's coming up here next is the training.'",
        "'speaker_4': 'Yeah, I didn't. I thought we were on the Stanford verdict to dash. Nine two, you say?'",
        "'speaker_0': 'I think if this is asking us when we when there's a public information request is sent to any employee or elected official that the employee or elected official shall respond to said requests within three business days. I actually don't think that that's what we do.'",
        "'speaker_0': 'I think if an employee or an elected official receives a public information request, that we then send it to the attorney who handles it. So I don't think that this is accurate. I don't think we would want any of us or an employee to respond within three days.'",
        "'speaker_0': 'The the subsection D of 2-92.2 though I would like clarification or have that reviewed.'",
        "'speaker_8': 'Yeah. I think I think the mayor makes a good point here that. When we looked at that subsection D of a 292.'",
        "'speaker_4': 'It's 2.29, 2.3, 92.2.'",
        "'speaker_8': 'The language that had been written had, you know, stated that any paid or elected agent of the city, which really made no sense at all. So we changed it around to any employee or elected official of the city.'",
        "'speaker_8': 'Then to have that person respond. But I think you're absolutely right that as a practical matter. You know, it usually is going to be responded by a city staff member, whether it's the city clerk or the city attorney's office.'",
        "'speaker_8': 'So I would suggest that that language be revised somewhat so that the response doesn't have to come from the elected official, but it would come from the city. A city staff member who's designated to respond to Public Records Act request.'",
        "'speaker_0': 'Our responsibility is to forward it to.'",
        "'speaker_4': 'The city attorney as well.'",
        "'speaker_0': 'So if that could clarify that.'",
        "'speaker_8': 'And we can we can we can revise that language to reflect the reality of the practice rather than this technical issue.'",
        "'speaker_4': 'So sort of a clarification. Yes. Permit the elected official references in those two places in subsection D.'",
        "'speaker_8': 'Right. We would we would take that out and put in there a more appropriate person to respond to Public Records Act requests within the three day period.'",
        "'speaker_0': 'But I still think it could say that. But if an employee or an elected official receives the request, yes, we forward it to someone else. Because I do get requests. Sure. Yeah, I have received. Yeah.'",
        "'speaker_8': 'Fair enough. It's the response, really, that is important. But the receipt. You get those all the time. Sure.'",
        "'speaker_0': 'Very good. Can here. Mm hmm. Any other points that House members want to clean up at this point?'",
        "'speaker_2': 'Vice Mayor Two more points, I think. I would ask that the Open Government Commission look at the timing that was brought up by one of the speakers as far as. Making sure that there's a reasonable amount of of days that are allowed.'",
        "'speaker_2': 'And then I was looking at some of the discussion at that commission meeting, and there were there is a requirement in to dash 93 six or a it's not on revision. It's it's in the actual the body of the bottom of the ordinance about an annual report.'",
        "'speaker_2': 'And the commission seemed to be kind of struggling about how to go, about gathering information to put into the report, what's their responsibility. And if they can come back to us with their thoughts being is that they are the the commission actually having to do the work and.'",
        "'speaker_2': 'What they might suggest to us that might look like, other than the very broad language that's in that reporting section right now, it almost implies like there's monitoring, constant monitoring of of violations. And it's not it's I think it's meant to be received violations.'",
        "'speaker_2': 'But I would like to have their thoughts on what that report mechanism might be.'",
        "'speaker_0': 'Any other member comments on this item?'",
        "'speaker_6': 'We decide what we're doing on the training.'",
        "'speaker_4': 'Last.'",
        "'speaker_0': 'Or is it the rate every 3 to 3 years? Does anyone disagree with that recommendation? Okay. I think we all agree, but that's all right. Yeah.'",
        "'speaker_6': 'And a little uncomfortable changing, you know, deadlines at some point, you know, if you sit on your rights, you kind of lose them. So I mean, we have to have a cut off that. 15 days. I mean, if you can't look at 2 minutes and 15 days.'",
        "'speaker_6': 'I mean, you got to do it. Same thing with the rent ordinance. You can't wait two months to file your complaint. You know, if it's that urgent, you got to take care of it. If. In the last full of deadlines.'",
        "'speaker_6': 'And if they're not met, you lose those rights. And that I mean, unfortunately, we have to draw a bright line somewhere and we do so.'",
        "'speaker_0': 'So in this document, is it the 15 days? Because I appreciate the comment from the speaker in regards to Iraq, but I think that that will be discussed, that you're discussing that policy. But the deadline that's in here is that the 15 days.'",
        "'speaker_0': 'Yeah. Did anyone want you want that expanded or. I'm sorry.'",
        "'speaker_2': 'I think I'd like to get the commission's view on it. I think it's a little tight for something like this, that Iraq is completely different. As far as the the urgency is go. I think this takes a little more study.'",
        "'speaker_2': 'So I'd be willing to look at a longer period, not an open ended period, but something a little more generous than two weeks. Mm hmm.'",
        "'speaker_0': 'All right, what about as a yes? Number 38?'",
        "'speaker_6': 'I mean, the that's the the commission, you know, that's kind of their role is to look at the ordnance. I have no problem with them looking at it, but I'm not going to give direction that I want it to be.'",
        "'speaker_6': 'It changed.'",
        "'speaker_0': 'Yeah. So I'm comfortable expanding that, giving them more, giving, you know, more time. Did you want to remember what they thought?'",
        "'speaker_7': 'No. Just a general comment, if we're ready for that.'",
        "'speaker_0': 'Well on this issue that the vice mayor did raise that number. Did you want to comment?'",
        "'speaker_4': 'Oh, I'd like to hear what the commission thinks about time to come within. Because after all, they are an advisory body to us, so probably we should.'",
        "'speaker_3': 'Try not to.'",
        "'speaker_4': 'Overly micromanage them.'",
        "'speaker_0': 'All right. So if that could be of no share with the advisory committee, then come back. That'd be great. Thank you. And now just general comments. Yeah, just general comments.'",
        "'speaker_7': 'Real quickly. You know, in my opinion, the Sunshine Ordinance, which was brought up first, I believe by then council member Eileen Itam, really is a game changer in Alameda when it comes to public meetings. And, you know, people just don't realize that.'",
        "'speaker_7': 'It used to be that we would get our information packets on the Thursday before the Tuesday meeting with the Friday city hall being closed and the weekend being what it is. So you really were scrambling on Monday. And you can imagine that now, you know, all the information packets come out, what, 11 days or 12 days before'",
        "'speaker_7': 'giving public ample time and council members ample time and staff member ample time. I think from the big picture of things, I think we need to keep in mind that that it is a game changer in terms of improving public dialog and input.'",
        "'speaker_7': 'I think the matters that we're dealing with tonight, I think they're important. But I think, you know, we. Struggling, as probably does the community and our appointed commissions, to strike the balance between, you know, the practical realities of running government with decisions and policies and making sure to strike that balance with get it continuing to get on'",
        "'speaker_7': 'an ongoing basis public input. So I think with the Sunshine Ordinance, you do see something where we it manifests that that struggle that we're were engaging in in trying to strike that proper balance. But I think, you know, stepping away from the details of tonight, I think we need to remind ourselves that, at least in my opinion'",
        "'speaker_7': ', this really is a game changer. And so it is worth going over the details that we have gone.'",
        "'speaker_0': 'I mean, the general comments on that item. All right. So before 1030, we need to have a motion to consider remaining items. And at this point, we have 60 on the wetlands with one speaker six E site B strategies, six F lease with KCI mini storage and six G lease with power engineering.'",
        "'speaker_0': 'And my question to staff is going to be which of these items do we need to address tonight?'",
        "'speaker_3': 'We absolutely need to do six F and six G. We would like to do six E and we could do 60 at the you know, we can move that one.'",
        "'speaker_0': 'That's the only one we have a public speaker on is 60. And that speaker's been here since it's now 1030. And that is actually, I think, someone that we asked to come back before.'",
        "'speaker_3': 'Well, it absolutely had to be heard.'",
        "'speaker_0': 'Yes, I appreciate that.'",
        "'speaker_2': 'You know, I wasn't going to to vote for this motion, but I want to talk about site B so I move that we continue after 1030.'",
        "'speaker_0': 'Up, but it's actually in motion to consider the remaining.'",
        "'speaker_2': 'That's right. Yes.'",
        "'speaker_0': 'To address all the remaining.'",
        "'speaker_2': 'I do it. But I'm going to do it.'",
        "'speaker_0': 'All right. Do you have a second to address all the items?'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_3': 'I. Oppose?'",
        "'speaker_0': 'No, no. So it needs four votes to pass. So if someone wants to make a motion with fewer items like get a pass.'",
        "'speaker_2': 'If we can continue the meeting to cover the items that were expressed by the city managers having to do.'",
        "'speaker_0': 'What must be done tonight, six F and six G.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_6': 'So I can.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_3': 'I, i.'",
        "'speaker_0': 'That motion passes. And I'm sorry, Mr. Bellinger. We will be doing wetlands in the future. Oh, that is musician. And now I'm going to take a break. We're going to take a recess. A short recess.'",
        "'speaker_1': 'Right. Your vote on that last one.'",
        "'speaker_0': 'Yeah. No, it was direction to staff to just come back with.'",
        "'speaker_3': 'Are you talking with unanimous?'",
        "'speaker_1': 'I want to know all.'",
        "'speaker_0': 'Of us who we are.'",
        "'speaker_1': 'Yes, I just was offering.'",
        "'speaker_3': 'Your items and.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. Yeah, it's okay. So recess.'",
        "'speaker_4': 'So where are we really not hearing this? Oh.'",
        "'speaker_3': 'You are actually.'",
        "'speaker_8': 'Native.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'Well.'",
        "'speaker_4': 'It's f Angie.'",
        "'speaker_1': 'Is.'",
        "'speaker_0': 'F into.'",
        "'speaker_2': 'Oh, she said she said E.'",
        "'speaker_4': 'Yeah. We have different understandings here, folks.'",
        "'speaker_2': 'You said E.'",
        "'speaker_1': 'Yeah, I think I think G he's thinking about.'",
        "'speaker_2': 'He said. He said the ones.'",
        "'speaker_1': 'They were confused.'",
        "'speaker_0': 'That was.'",
        "'speaker_3': 'That was.'",
        "'speaker_4': 'But you. But didn't you say you also would like me to be.'",
        "'speaker_0': 'Very hard to be done.'",
        "'speaker_3': 'F.'",
        "'speaker_4': 'Right. Because it releases microphones like.'",
        "'speaker_6': 'Well, if we get through F or 11, we could start.'",
        "'speaker_4': 'If we get. Okay, if we get through.'",
        "'speaker_0': 'Though we're on a recess, let's resume this conversation after.'",
        "'speaker_4': 'Okay.'",
        "'speaker_6': 'So let's let's.'",
        "'speaker_3': 'Make it short.'",
        "'speaker_7': 'Sorry. Jennifer Gray.'",
        "'speaker_4': 'I don't think.'",
        "'speaker_0': 'Now after the recess. And for those that are watching, it's 1037 on our clock here. We're going to start with 6f2.'"
    ],
    "Lease Approval for CSI Mini-Storage at Alameda Point.": [
        "'speaker_1': 'Introduction of ordinance, approving a lease and authorizing the city manager to execute the documents necessary to implement the terms of a three year lease with CCI mini storage or building. 338 608 and 6883c collectively located at 50 and 51 Western Avenue at Alameda Point.'",
        "'speaker_3': 'Good evening, mayor and city council members. I'm Ninette Mercado in the community development based fees department I'm in the storage provides so that containerized self-storage and warehouse rentals at Alameda point they've been the tenant there since 2005 and this is what we would consider a short term lease in the site B area for three years.'",
        "'speaker_3': 'And we hope that you would consider the renewal of this lease.'",
        "'speaker_0': 'Thank you. Any comments or questions? We don't have any speakers on the side of, correct? No. All right.'",
        "'speaker_2': 'I will.'",
        "'speaker_0': 'Vice Mayor Proval.'",
        "'speaker_2': 'And I do think it's when we discuss site B. I'd like to go back to the short term leases that are in there.'",
        "'speaker_4': 'That won't be tonight.'",
        "'speaker_2': 'It won't be.'",
        "'speaker_0': 'Tonight. So that's.'",
        "'speaker_3': 'It.'",
        "'speaker_4': 'And I would second.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'So we have a motion. And second, any other questions or comments? All those in favor. I oppose abstentions. Motion passes unanimously. Thank you.'"
    ],
    "Lease Agreement with Power Engineering Construction Company for Building 166 at Alameda Point.": [
        "'speaker_1': 'Six G Introduction of ordinance approving at least and authorizing the city manager to execute documents necessary to implement the terms of a ten year lease. Our engineering construction company for Building 166, located at 1501 Viking Street, Suite 200 point.'",
        "'speaker_3': 'Power Engineering has been a tenant at Alameda Point since 2005. We think that this is they've been a very good steward of our property, a very good tenant. They provide great jobs, union jobs. They do super creative projects around the Bay Area, including the reconstruction of the pier where the Exploratorium is.'",
        "'speaker_3': 'They've been a great resource to the city, providing technical expertize and reviewing and doing peer reviews of different engineering studies gratis. And they've just been really a pleasure to work with and a great tenant. And so we hope that you would reconsider the renewal of this lease in memory.'",
        "'speaker_4': 'Just a point of clarification, Miss Marcano. The only reason that they've been on a month to month lease since 2010 is, if you'll recall, that there was a time when we were entertaining the notion of, well, we were being considered by Lawrence Livermore Labs as an expansion area.'",
        "'speaker_4': 'And so that was a part of the area. But other than that, I mean, that's the only reason they're in month, month. And I would wholeheartedly support the introduction of this ordinance. And if I may, I'll move the approval at another.'",
        "'speaker_0': 'You can make your motion and then you can ask this question.'",
        "'speaker_3': 'Okay.'",
        "'speaker_7': 'So the question that I have is, whatever we do with site B, this is within it, right? So that so that they would. So we have to work site B around.'",
        "'speaker_3': 'I think the plan is that we would work around power engineering because they are such a great tenant, an asset to us. Initially we had talked about moving them to Building 167, which is in the Tidelands and the old Nelson Marine site.'",
        "'speaker_3': 'However, it just didn't pencil out for them to have to do all the upgrades in that building that they have already done in 166. So I think in concession for them upgrading Building 166, which you if you drive by, you'll see they completely repainted it.'",
        "'speaker_3': 'They've put new windows in that we would consider a carve out way.'",
        "'speaker_7': 'Let me ask this question then. But because they are part of site B and this was probably going to be all part of the site B discussion because they're part of site B in site B has them associated infrastructure costs as well as associated costs for the ferry terminal and the sports complex.'",
        "'speaker_7': 'Is the lease include covering their share of the cost?'",
        "'speaker_3': 'The lease would be subject to all of the fees that we are assessing to all of the end users out there. So the the CDF fee and eventually if we put an assessment district over the property, the tenant has to comply with them.'",
        "'speaker_3': 'Okay.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_0': 'Any other questions or comments?'",
        "'speaker_4': 'And I would just comment that I've been out to the building. It is a pretty amazing operation that's been out there and I don't think I specified, but I was moving that we approved the introduction of the ordinance approving lease and authorizing the city.'",
        "'speaker_4': 'Is that the right one? Yes. The city manager to execute documents necessary to implement the terms of a ten year lease with power engineering construction company for Building 166, located at 1501 Viking Street, Suite 200 in Alameda Point.'",
        "'speaker_0': 'Vice Mayor seconded that. All right. Any other questions? Comments. All those in favor. I. Motion carries unanimously. Thank you. Thank you. As seven as City Manager Communications. Did you have anything else you want to add at this time?'",
        "'speaker_3': 'No, not at this time.'",
        "'speaker_6': 'Point of order. Met a mayor?'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Can we do six now that it's only 1040, or are we in that book after 1030?'",
        "'speaker_0': 'And pursuant to the Sunshine Ordinance, my understanding we cannot add any more items.'",
        "'speaker_6': 'It's introducing more items after 1030 or after.'",
        "'speaker_3': 'You can't you aren't after what you voted on at 1030 was to take up any new items, new action.'",
        "'speaker_0': 'Items after.'",
        "'speaker_3': '1030. Okay, do that. And then at.'",
        "'speaker_0': '11:00, you can vote to go.'",
        "'speaker_3': 'Past 1120 minutes.'",
        "'speaker_6': 'Thanks for clarifying. I think I ask that almost every time.'",
        "'speaker_0': 'So we don't have any public speakers for non agenda. Council referrals. There aren't any. Ten Council Communications Member J soc.'"
    ],
    "Mayors Nominations to Two Boards.": [
        "'speaker_0': 'So moving on, then. Okay. Ten. A consideration.'",
        "'speaker_1': 'Consideration of his nomination to the Commission on Disability Issues and Housing Authority Board of Commissioners.'",
        "'speaker_0': 'And at this time, I'll be nominating for the Housing Authority Board of Commissioners, Kenji Tomah Oak. And that's the last item. I will now adjourn the city council meeting. Thank you. Oh, wait a minute. In. All right. Actually, before I adjourn, I wanted to remind everyone that tomorrow night we have a special meeting at 7 p.m. in'",
        "'speaker_0': 'regards to the general plan, and you can look that up. We'll be right back here. And we will be adjourning in the memory of Barbara Kerr from moment of silence, please. Thank you and good night.'"
    ]
}