{
    "Urgency Ordinance on Local Emergency and Curfew Due to Civil Unrest.": [
        "'speaker_1': 'Adoption of an urgency and kind of fide ordinance of the City Council of the City of Alameda, declaring the existence of a local emergency in response to civil unrest. Ratifying the city manager's decision to order curfew on June 1st and second 2020, ending at 5 a.m. on June 3rd.'",
        "'speaker_1': 'Provide direction extending, modifying or discontinuing the curfew and authorize staff to take further action to implement this declaration.'",
        "'speaker_0': 'Thank you. And so this item is being presented by let's see. Sorry, it's the city attorney, is that correct?'",
        "'speaker_2': 'It'll be me, Mayor. This is.'",
        "'speaker_0': 'Okay. Oh. Assistant City Manager Jerry Bowden.'",
        "'speaker_2': 'Yeah. Good evening, Mayor Ashcraft. Thank you very much. Members of council. Everyone can hear me. Okay?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Okay. Great. Perfect. So, my name is Jerry Bowden, assistant city manager and staff recommended recommendation tonight as as the mayor just mentioned, is related to civil unrest in Alameda County and locally since the tragic and unfortunate death of Mr. George Floyd in Minnesota on the 25th of May, as we've seen, in addition to the many lawful and'",
        "'speaker_2': 'peaceful protests, there have been events and gatherings that have turned violent, resulting in injuries, death and significant damage to and loss of property. Tonight's staff recommendation includes four parts. First, to address the unique local public safety and related demands and better position the city for the possibility of recuperating funds associated with our response.'",
        "'speaker_2': 'Staff is recommending that the City Council declare a local emergency related to civil unrest. This action does require a 4/5 vote and we sincerely hope that the need for this is short lived. Second, consistent with the city, charter staff is recommending that council ratify the city manager's decision to order a curfew from 8 p.m. to 5 a.m.'",
        "'speaker_2': 'on June 1st and second, ending at 5 a.m. tomorrow morning, June 3rd. And third staff is seeking Council's direction regarding extending, modifying or discontinuing the city of Alameda curfew. For context, I'll note that some communities are taking this decision to have a curfew day by day in the area, and others like neighboring San Leandro have a curfew'",
        "'speaker_2': 'in effect until the morning of June eight unless it's decided that it should be lifted earlier. And as you all know, the county has implemented a curfew from 8 p.m. to 5 a.m. until the morning of June 5th if the city's curfew is extended, if that is what council decides to do.'",
        "'speaker_2': 'We have seen correspondents today asking for a little more flexibility with respect to the allowed activities, including volunteers helping homeless individuals or elder elderly population in the community that needs that help. The request is that they are also exempt from the curfew or given flexibility and council may wish to consider that or provide staff with direction.'",
        "'speaker_2': 'And should that be the direction the council goes? The fourth and final part of this recommendation is to authorize staff to take further action necessary to implement the declaration related to civil unrest should that become necessary. And an example of that might be if there's a decision to not continue the curfew today and and ultimately in a'",
        "'speaker_2': 'few days it becomes necessary. Then staff would go ahead and do some take that action if if that was deemed necessary. So that concludes staff's very brief presentation on this topic, and we're available for any questions you may have.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Bowden. Council and anybody any other staff, some city attorney or city manager want to weigh in on what was just said. City Manager Eric Levitt.'",
        "'speaker_2': 'Fat man, mayor and City Council. I'll just add that this is a difficult issue because I think any time you restrict people's rights, it's a very serious issue you need to look at very carefully or even in doing it for the last two days.'",
        "'speaker_2': 'Yesterday and today, I took very seriously their discussions over the weekend and I felt that it shouldn't happen. But yesterday, especially with neighboring cities doing it, I felt that was the appropriate thing to do. So I would ask that anything we do that we we try to keep it as narrow as possible in a decision and not'",
        "'speaker_2': 'take it out too long.'",
        "'speaker_0': 'Thank you, Mr. Levitt. Council comments are city attorney. Mr. Shen, did you want to comment? Sorry.'",
        "'speaker_2': 'Not at all. Other than to say that I reviewed the legality of the city manager's declaration and find it to be fully compliant with all applicable laws. And I'm happy to answer any questions that the Council has.'",
        "'speaker_0': 'Thank you. Okay. I see Councilmember Desai with his hand up.'",
        "'speaker_2': 'Quick question. We had a nice email come in from a resident named Susan Rios who asks how many residents are working from home and can only shop after 8 p.m.? What should we do? Which what would what do we say to Mr. Rios and others who are like her?'",
        "'speaker_0': 'Well, staff can certainly respond, but my understanding is businesses are covered by this curfew as well. Is that correct, Mr. Shin?'",
        "'speaker_2': 'Yes, that is correct. And so I don't believe that stores would be open after. Okay. Okay. That's the answer, then.'",
        "'speaker_0': 'Yeah. And again, the curfew these two nights last night and tonight, 8 p.m. to 5 a.m.. So, um. Okay. Councilmember o.T.'",
        "'speaker_2': 'Thank you. I mean, I guess my question is just hypothetically, say hours expires at 5 a.m. tomorrow and we're still under the county. I mean, just the interplay of that and what happens or what happens tomorrow night if we don't have a curfew and the county has one?'",
        "'speaker_0': 'Okay. City. City attorney Mr. Kane, I know you emailed us about this, but do you want to share with the public?'",
        "'speaker_2': 'Sure. At this moment, unless the county order changes or a judicial decision is issued, altering that order, the county order purports to apply to all incorporated cities and unincorporated county areas. So as of this moment, our understanding is that that order would apply within the city of Alameda.'",
        "'speaker_2': 'And therefore, based on the text of that order as it exists today, it would apply. So an ATM curfew would still remain in effect even if the council discontinues our local curfew. And then if that happens, I mean, right now, our city manager is, you know, our emergency director, if I remember correctly, going to our emergency plan'",
        "'speaker_2': '. And, you know, our police department reports up to him. I mean, would that change at all if we didn't have a curfew and suddenly it was just the county one, which I don't want to get into legal argument here.'",
        "'speaker_2': 'I still think we have some sovereignty issues. But regardless, I mean, how would that work? I mean, what are we would we be forfeiting our city manager's authority and our police chief's authority? No. The city manager remains the director of emergency services.'",
        "'speaker_2': 'With respect to the enforcement of the county's order, any California peace officer could enforce it anywhere within the county. And so law enforcement decisions within cities are made by the police chief. And so the police chief would have discretion in how he wants to deploy his resources and undertake enforcement.'",
        "'speaker_2': 'I believe he may even be in the audience and may be able to answer further questions in this regard. And additionally, obviously, county sheriffs, to the extent that they are operating within the city of Alameda, for example, pursuant to mutual aid, they would also enforce that they would have the authority to enforce the county's order.'",
        "'speaker_0': 'And do we know is is the police chief on hand to answer any questions? I don't know that. But. Okay. Who else? Council. Is a merely a council member of the Surrey. My question is, and I don't think we're the only city grappling with the two questions raised by Councilmember Odie is if there are other cities that'",
        "'speaker_0': 'are challenging the authority of the county ordinance.'",
        "'speaker_2': 'Or.'",
        "'speaker_0': 'Where does that leave us? That's part one. And part two is. You know. But I understand the law that was was cited or the decision that was cited. But is I guess my concern is the overall enforcement of this and how we would go about actually enforcing a county ordinance.'",
        "'speaker_0': 'If if, if the word gets out that we don't continue our curfew and people are confused about what's going on. And, you know, like Magic Police Chief Porter Larry just appeared on the screen and have these magical powers.'",
        "'speaker_0': 'So, Chief, for Larry, if you'd like to meet you, unmute yourself and answer. If you're able to answer the question posed by Councilmember Vela about how does it how does enforcement of a county or two right now we are under both our city's order, but also the counties.'",
        "'speaker_0': 'And so if the this went on and the city didn't choose to extend until Friday morning, when the county order will be rescinded, if not sooner, how does enforcement work? Chief for Larry.'",
        "'speaker_2': 'Drew. Thank you for having me on. I. My understanding of the county order is that much like the health department order for the COVID crisis, that the more restrictive order would would rule the day. I was on the phone with the business leaders earlier, and I understand the inconveniences, but we also have a fairly significant public safety'",
        "'speaker_2': 'concern that's happening right now with not the peaceful protest, but with some of the looting and the burglaries that have been happening, including here in town. So my my stance would be that we would be operating I would be operating the police department under the county order.'",
        "'speaker_2': 'If the council did not extend the local order, I would I would intend to to follow the county order until its expiration, which I believe is June 5th.'",
        "'speaker_0': '5 a.m. just I think. Yeah. Okay, Counsel. Anyone else want to want to weigh in? So I have a question. I think it was discussed in the staff report that we could delegate to staff. I think the city manager, the police chief, probably conferring with the city attorney and I would include the assistant city manager as to'",
        "'speaker_0': 'this. Well, what the police chief said, I agree with if the county's order is continuing, the county's order is continuing. But if for some reason, the county says, you know, things are looking pretty good almost everywhere and rescinds the county order, we could still defer to staff to say, okay, what was the situation in Alameda last night'",
        "'speaker_0': '? And, you know, moving forward, what do we think is the best course of action? So is that is that a possible approach? I'm seeing the city attorney nodding. You want to weigh in, Mr. Chan?'",
        "'speaker_2': 'Sure, Mr. Mayor. The council could give direction tonight to authorize staff to take actions necessary to further the declaration of the local emergency. If the council chooses to do so and give direction for the staff to work together to implement it and to report back to the council, which I believe is consistent with what you've indicated.'",
        "'speaker_0': 'Councilmember Avella. I wanted to go back to my question about if there are cities within Alameda County don't or challenge the county order. Is that something that our staff is going to be following up on and the implications of that?'",
        "'speaker_0': 'The case law that was cited was, what, 40 years old or something like that?'",
        "'speaker_2': 'And so maybe I'll start and I'll turn it over to the chief. To the extent he has additional information, my understanding is that I'm not aware of any city that has that is preparing to file a legal challenge, though any moment could change.'",
        "'speaker_2': 'I understand that there are certain cities, certain elections, elected officials from certain cities have taken the position that does not apply or it may not apply to certain jurisdictions. And we are certainly following each of that closely. And the city attorney for the city of Alameda, for the county of Alameda have requested an additional conversation with the'",
        "'speaker_2': 'county council to have continuing dialog on this topic. And we've not received a confirmation that that conversation will happen. So we we at in your city attorney's office will continue to follow this on all fronts.'",
        "'speaker_0': 'And did I know if another councilmember wants to weigh in now, I would be interested in hearing from the chief. What you were hearing from the business community. But I see the vice mayor's hands went up as I was speaking.'",
        "'speaker_0': 'Do you want to go next to vice mayor?'",
        "'speaker_2': 'Sure. Thank you. So I think this is I think we're in an awkward position right now. I so I would like to thank the city manager and the police chief for making the decision you made yesterday. I believe on the information that we had at the time that this decision was made, it was probably the right decision'",
        "'speaker_2': '. I have struggled very mightily to figure out what I would do had the question come before. Should we do it again tonight? I think at 45 minutes before it's about to kick in, it's whether we decide it's not a curfew or not, I think is go communications.'",
        "'speaker_2': 'Why? It's problematic. But I'm not confident that I now that we know where things went yesterday and where things have been today. And, you know, with hindsight, whether or not we would have continued this. I am extremely uncomfortable with the county sheriff implementing something at a county level with very little input for such a long period.'",
        "'speaker_2': 'And I understand I'm going to guess that it goes through Friday morning, because there are some significant concerns around unrest on Thursday following the memorial service for Mr. Floyd in Minneapolis. If we were to move forward tonight, what I would like is some sort of reporting about any police action in Alameda related to the curfew tomorrow morning'",
        "'speaker_2': '. I'm not expecting any. But if there are any, I would like to I would like to have some sort of report back. I feel that this is a very significant act that we have taken on, and I want to treat it as as that.'",
        "'speaker_2': 'Similarly, I would be willing to support providing.'",
        "'speaker_0': 'Mr. Vice Mayor, I mean, forgive me, all of you. I quickly texted the city clerk to ask if we had public comment. And we do. And so before we get and this is I guess there are shortcomings to a virtual meeting, because if we were in chambers, she would be hissing or, you know, they'd be sending a'",
        "'speaker_0': 'note to me.'",
        "'speaker_2': 'So I will reserve my comments.'",
        "'speaker_0': 'Thank you, sir. Just hold your thoughts. But unless someone else has clarifying questions about the report, I would request that we hear from the public on public comments. Does anybody have any clarifying questions they wanted to put in first?'",
        "'speaker_0': 'Councilmember Vella And then if I know we're being asked to adopt the emergency declaration, there's the second question, which is about what we do with the curfew. Could we adopt the emergency declaration and not continue the curfew? And then what would that look like and how long would the emergency declaration be in effect?'",
        "'speaker_0': 'If you could just clarify that.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'That's. Yes, Mr. City attorney, please.'",
        "'speaker_2': 'Yes. If the council chooses to adopt the emergency declaration, it currently does not contain an end date. The council could either set an end date right now or allow staff to bring you back when staff recommends an end date.'",
        "'speaker_2': 'With respect to your second question, if you adopt the emergency declaration and direct staff to discontinue the curfew, it would just it would be discontinued. And then the council would have to make a decision on whether to allow staff to reinstitute a curfew in the future if facts warrants or to direct staff to not institute a curfew'",
        "'speaker_2': 'in all circumstances. Those are decisions that the council could make, either give staff the direction or give clear direction one way or the other.'",
        "'speaker_0': 'And our city manager, Eric Levitt.'",
        "'speaker_2': 'And I would recommend that at the longest period for a declaration of emergency for this particular event would be through June 16th would be the absolute longest I would do and I would but I'm not staying for the curfew.'",
        "'speaker_2': 'I'm just saying. For the declaration of emergency.'",
        "'speaker_0': 'Okay. And any particular reason why that particular date, Mr. LEVITT?'",
        "'speaker_2': 'Because that's the next city council meeting had it.'",
        "'speaker_0': 'All right, then. Okay. Without it, there's no further clarifying questions. Um, the let's. City Clerk, will you please introduce the public comments or call on the public speakers?'",
        "'speaker_1': 'Yes. So if anybody present via Zoom would like to comment on this item, which is the curfew matter, please raise your hand now. Okay. We have three people who wish to publicly address you. And then I had three comments to read.'",
        "'speaker_1': 'So everybody will still get 3 minutes.'",
        "'speaker_0': 'Perfect. All right, who's first ready?'",
        "'speaker_1': 'She will promote you and you can speak.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_2': 'Can you guys hear me?'",
        "'speaker_0': 'Yeah. Thank you. Hi. My name's Diana. I'm a registered nurse here in L.A.. Is it Mr. Singh or is it Diana?'",
        "'speaker_2': 'It's both of us. I'm with. I'm with him. Well.'",
        "'speaker_0': 'You got it. One person got it. Okay. I didn't want your need from me to be so distant. That sends its regards to you guys to arrive late.'",
        "'speaker_2': 'We're going to.'",
        "'speaker_0': 'Take.'",
        "'speaker_2': 'A look inside. I promise.'",
        "'speaker_0': 'Yeah, I guess we're 8:00, but. But I'm so sorry. Call. We are. I remember the surfers here in the Bay Area, and I'm very concerned about the mental health of our guardians, our police officers during all of this.'",
        "'speaker_0': 'And. And I have friends that have cuts that are partners and husbands. And, you know, it's really, really tough. But I'm just wondering what is being done to address the mental health with with these officers. And because in the here has actually we've recently featured in the area news we're launching a six week long series about as'",
        "'speaker_0': 'a police department last year which ran over six weeks and they brought that run the mindfulness and just know you know just.'",
        "'speaker_2': 'It really it really helped the officers it was like really, really simple easy stuff to do that helped them with their sleep to help them with their. I've been sober for 99.'",
        "'speaker_0': 'Please forgive me for the interruption. I think you might not have realized that this is specifically to communicate comments about the emergency declaration and issuing a curfew right now. However, I love what you're talking about. And if you could possibly hang on when we finish the special meeting, we are going to move into our regular meeting.'",
        "'speaker_0': 'And there is an item, oral communications for speakers who want to speak about an item not on the agenda. Okay. We'll get to that shortly. Can can you hold on? Yes.'",
        "'speaker_2': 'Thank you. Thank you. Apologies on.'",
        "'speaker_0': 'That. No worries. It's a little confusing when we're virtual like this, but thank you so much. All right. Um. Okay, Madam Clerk.'",
        "'speaker_1': 'Okay, now we have. Elizabeth Douglas.'",
        "'speaker_0': 'Hi there. Good evening, Miss Douglas. Thank you. In terms of the curfew, I just I don't know if you have enough data to make a decision on the curfew. It seems it seems like what I've heard so far, it says that there's nothing.'",
        "'speaker_2': 'No concern.'",
        "'speaker_0': 'From the protesters, but there are concerns about looting and burglaries. But I have no hard numbers to here. I don't know if it's correlated to. Two as a result of the protests that are going on. I just I really don't think that there's enough data.'",
        "'speaker_0': 'And I would be.'",
        "'speaker_2': 'Hesitant.'",
        "'speaker_0': 'To make any decisions or I implore you to be hesitant about making decisions without.'",
        "'speaker_2': 'Data to back it up.'",
        "'speaker_0': 'So I'm not in support of extending that curfew. Thank you, Mr. Douglas. Thank you. Our next speaker.'",
        "'speaker_1': 'Josh, he's being promoted now.'",
        "'speaker_0': 'Good evening. Oh, he's still muted. Mr. Ryan is.'",
        "'speaker_2': 'You know. Can you hear me now?'",
        "'speaker_0': 'Yes, yes, yes.'",
        "'speaker_2': 'Thank you very much. Thank you. Good evening. I'll just read a brief statement I prepared. I'd like to register my disapproval for extending or creating any curfew in Alameda. This measure is a failure of imagination and only supports those that would drive our communities apart.'",
        "'speaker_2': 'As a new homeowner now, I feel more of a threat to my young family by the powers this gives the police than in the promise of safety. Simply put, there is no basis of fact for any emergency in the city.'",
        "'speaker_2': 'Furthermore, curfews only create confrontation, not de-escalation. Other local and national police forces have used this crisis as an opportunity to brutalize protesters in feeble attempts to justify their outsized budgets. By adopting curfews, this city effectively endorses that brutalization.'",
        "'speaker_2': 'This measure is a direct attack on government and police accountability. We should be encouraging our neighbors to come together as a community and heal and be a model for what this town can be. Instead, this motion for mass panic and further drives the already loaded reputation of Alameda as a place where people of color are unwelcome.'",
        "'speaker_2': 'We can be better. We must be better. We should be. Instead of voting to defund and demilitarize the police department and find better means of preventing crime and keeping our community safe. Thanks very much. Have a good evening.'",
        "'speaker_0': 'Thank you. And our next speaker.'",
        "'speaker_1': 'I think that was it for Zoom speakers. And now I will read two comments and take. The first is from Linda Asbury, executive director of West Alameda Business Association. Representing the West telling me to Business Association, please consider the curfew for the city of Alameda to reflect the curfew of Alameda County through June 5th.'",
        "'speaker_1': 'If necessary, this can be rescinded at any time. Thank you for your consideration. And next we have. Rob's tenacity. Size Kony, size Kony. Hopefully I'm not pitching that too badly. Okay. Council members, not only should you not ratify the decision of the city manager to impose this tinpot faster curfew order, but it should be rescinded immediately.'",
        "'speaker_1': 'Moreover, you should take any available steps to lodge the city's dissent from the county's curfew. Your colleagues in the city of Santa Clara have already taken those steps. Beyond, no doubt, nothing that has happened on the island this week remotely justifies the extraordinary limitations on citizens freedom of speech and movement.'",
        "'speaker_1': 'Curfew orders do not keep us safer. They serve as a legal fig leaf. For the police to initiate violent confrontations with unarmed protesters. To impose this curfew is to ratify and stand with the actions of authoritarians like the president and to equate the brutal police violence we have seen all over the nation in the past week with'",
        "'speaker_1': 'the chanting and marching of protesters calling for an end to brutal police violence. A progressive city like Alameda should be making every effort to oppose police violence, raise up the voices of oppressed communities that are the most frequent victims of police violence, and demonstrate that our city rejects the quasi military weaponization of police forces nationwide and the'",
        "'speaker_1': 'turning of those weapons against poor, black and brown people. Please do your duty to stand with the George Floyd's of the world and against the Derek. Sherman's up to oppose the curfew. And then the last comment I think was by Josh and he already spoke.'",
        "'speaker_1': 'So I will not read his since he spoke instead.'",
        "'speaker_0': 'All right. Okay. And that was the extent of the public comments. Act. Madam Clerk, is that the extent of our public comments on item two?'",
        "'speaker_1': 'Yes, that's correct. No more.'",
        "'speaker_0': 'All right. With that, I've closed public comments and we will return to council discussion. Vice Mayor, I think I cut you off. Excuse me. When I realized we had public speakers said, Do you want to resume?'",
        "'speaker_2': 'Sure, I'd be happy to. Thank you very much. And I will also acknowledge my clock hasn't moved yet, but I will not use the full 9 minutes that I still have. So thank you. Yeah, I as I was saying, I appreciate knowing knowing what we know about what happened on Sunday.'",
        "'speaker_2': 'The reasoning behind making the declaration that we have today. I was going to ask the police chief if he would be comfortable talking a little bit about what happened with our local law enforcement resources on Sunday, the day before the curfew that helped to inform why why we decided to move forward.'",
        "'speaker_2': 'Is that something that would be. Appropriate to speak about it at the council meeting? Certainly. I guess I'll ask that through the city manager.'",
        "'speaker_0': 'Yes. Well, actually, you you ask. Oh, well and I'll sit through the chair, but, um. Yes, Chief. Hilary, can you, can you comment about what we knew on Sunday or, you know, leading up to this probably Friday, Saturday and Sunday?'",
        "'speaker_0': 'Because I don't think the decision was made just in one day. But tell us if you can for sure.'",
        "'speaker_2': 'Thank you for the opportunity. I mean, I'll tell you that we you know, we really didn't know if there was going to be any violence or any crime or looting in the city. We were obviously concerned about it.'",
        "'speaker_2': 'I received several emails, some phone calls and texts from concerned residents, from concerned business owners, from the business districts, specifically on Webster Street. And we had information that there was possibly going to be a plan to shoot the target at Alameda Landing, which fortunately did not occur and has not occurred yet.'",
        "'speaker_2': 'Sunday night into Monday morning, between around 9 p.m. in the evening and about four or 5 a.m. on Monday morning, we had about a dozen incidents of either straight up looting or smash window smash burglaries, which is highly unusual for the city of Alameda, has not been happening in anywhere near those numbers so far this year.'",
        "'speaker_2': 'So we did not make arrests in all those cases. So I don't know what the motivation was for all of them. We did arrest three people for breaking into the Walgreens at South Shore. Three adults and then four juveniles for attempting to break in with a window smashed into the CVS in Santa Clara.'",
        "'speaker_2': 'I don't have the final numbers in front of me, but I believe we were somewhere between 12 and 14 ish. Either burglaries or windows smashes the CVS at Harvard Bay, IL, the Bedford Express on Blanding, the AT&T store at Alameda Landing and several others.'",
        "'speaker_2': 'So we it was a super busy night. We had 25 officers on the street, which is double more than double what we normally have. And that's what we continue to do right now in order to keep the city safe and hopefully deter additional stuff.'",
        "'speaker_2': 'Last night was much better. I believe we had one or possibly two incidents overnight compared to what we had on Sunday night. It was much quieter. We had. It was nice to have more police officers than we needed last night, which was not the case in some of the surrounding jurisdictions.'",
        "'speaker_2': 'And it's my understanding, even today and tonight, Oakland and Fremont have been very active again. San Leandro and Hayward were hit probably the hardest on Sunday night. So there's been a lot going on. Great. Thank you. And could you also if you're if you're able just talk a little bit about mutual aid and what was available on'",
        "'speaker_2': 'Sunday? Sure. So typically what happens on mutual aid is that the city the city in need, which in this case was the city of Oakland, they know that they've got this unplanned event. And so they make a request through the Office of Emergency Services at Alameda County.'",
        "'speaker_2': 'Sheriff Ahearn, as the emergency services official for the county, is the person who makes the decision whether or not to authorize the deployment of mutual aid resources. The sheriff, based on the Oakland request, the number of reports of people that were going to be down there protesting and demonstrating, he ordered or granted the request and then outreach'",
        "'speaker_2': 'was made to all the various agencies within the county. Alameda being one of them on on Sunday night, Saturday night and Sunday night, I'm sorry, Friday night and Saturday night, we sent about a dozen officers, I think it was 12 on Friday night, 14 on Friday night and 12 on Saturday night.'",
        "'speaker_2': 'Sunday night. We were not there because we needed to be here because of everything that was going on in Alameda. We are not in Oakland. Glad to get back. We were going to send somebody to Oakland earlier today, but we we wound up not having to do that.'",
        "'speaker_2': 'So anyway, the mechanism is that the city in need, Oakland asks for the county's help. The county makes the assessment, authorizes the mutual aid. And then all of the individual jurisdictions, if they can provide, people do. And we did.'",
        "'speaker_2': 'Great. Thank you. And my understanding is on Sunday, not only did we not were we not able to on to Oakland, but we were not able to ask anybody for help when it seemed like we might need it as well, because everybody was basically staying home because this was so widespread.'",
        "'speaker_2': 'Is that correct? In general? In general, it was partially correct. I was I did ask for and request for some mutual aid. I called over to the EOC and I was able to get and briefly and it turned out we didn't need them for very long.'",
        "'speaker_2': 'But I did briefly have a squad from the Berkeley Police Department that arrived. I think they got here about 1030 or 11:00 in the evening. I don't think they were here for more than an hour. And then we were able to kind of get our arms wrapped around everything and they returned to Oakland.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'I guess for clarification, Chief, when you reached out to the EOC, would that be the Alameda County Emergency Operations Center?'",
        "'speaker_2': 'Actually, no mayor on that particular case. I had somebody inside the EOC and the city of Oakland.'",
        "'speaker_0': 'Oh. Oh, okay.'",
        "'speaker_2': 'So I went, okay. I just called somebody over there directly and said that we needed help fast. And they sent me they sent me the 12 officers. Okay. So thank you for all that. I just I wanted to kind of explain some of my while.'",
        "'speaker_2': 'I heard a lot of comments that I certainly understand and at a gut level agree with. Again, I think that, uh, curfews are extremely, um, there are a significant event and they're not something that we should take lightly.'",
        "'speaker_2': 'I really do. Again, my comments about why I support what happened yesterday is based on the fact that from what we saw Sunday, we were stretched. And not only where we were stretched, but all of our neighbors were not only stretched, but really hit very hard.'",
        "'speaker_2': 'And it was, I think, a rational and reasonable response as we move forward in considering this curfew. I would certainly agree with the city manager's recommendation that we declare the city the state of emergency through the 16th, and I would be more than happy to give some direction to the city manager that would allow him to declare'",
        "'speaker_2': 'a curfew on a day by day basis based on information that's coming up, knowing that there are probably a couple of dates in the next week in which we should at least be alert to the fact that that, you know, we may need to join our neighbors in setting a curfew just to to to keep our region'",
        "'speaker_2': 'a little safer. Again, as if if we do so, I will request that we get a report early in the morning of any action that is taken related to the curfew and that all discretion and be be used in reporting out of when that decision is going to be made.'",
        "'speaker_2': 'You know, my hope is that we don't have to do it. I would also hope that if this council does not extend the current curfew to match the county, that that be at least a signal that we're not looking to overly enforce the curfew of the county.'",
        "'speaker_2': 'I do not really believe that. I do not stand in support of that decision. I think it was made far too quickly with very little input. And I think we're going to you know, if our county sheriff is going to act like this, there needs to be a lot more input and verification before just announcing it.'",
        "'speaker_2': 'Thank you. Done.'",
        "'speaker_0': 'Okay. Next, Councilmember.'",
        "'speaker_2': 'Thank you, Madam Mayor. Thanks to the city staff that put this together. One suggestion I would have said murder instead of death of Mr. Floyd. But that that word is important. And I'd like to thank our chief for everything he's doing to keep us safe.'",
        "'speaker_2': 'You know, when I read about this, I was, like, super queasy. And it is the first thing that pops in my head is that 250 year old Benjamin Franklin quote that those who would give up essential liberty to purchase a little temporary safety deserve neither liberty nor safety.'",
        "'speaker_2': 'And watching the news yesterday, I think New York was under a curfew for the first time since 1943. New York City. And to show how things haven't changed, you know, that was when a white police officer murdered a African-American service member during World War Two.'",
        "'speaker_2': 'So these decisions are not things we take lightly and. I read the Supreme Court decision that came out over the weekend about Governor Newsome's limitation on churches. And there was a line in there that says our Constitution principally entrusts, quote, the safety and the health of the people, end quote, to the politically accountable officials of the states'",
        "'speaker_2': 'to guard and protect. And to me, you know, when it comes to public health, we don't have a public health department like Berkeley has or, you know, San Francisco as a county. We have ceded that authority to the county.'",
        "'speaker_2': 'So when they make orders on public health, then, you know, we've we've pretty much subjected ourselves in their jurisdiction, but on public safety. We have not on public safety. That jurisdiction remains with the five of us here today and through our manager come to form a government, the city manager and his direct reporting to the police chief'",
        "'speaker_2': 'and the police department. So I am extremely concerned about the sheriff exerting his authority over the city of Alameda. I believe we are a sovereign city. Um, my colleague, Mr. De SA brings up often that we are charter city and charter cities have certain rights.'",
        "'speaker_2': 'And to me one of those rights is that, you know, we are not going to be subjected to the county. So I am loathe to give up any decision making authority to the county sheriff. And, you know, we all know the reputation of the county sheriff.'",
        "'speaker_2': 'And this, taken in in isolation, you know, may be a great thing. But when you consider that the sheriff, with his history of heavy handedness and his treatment of people of color, is now asserting his authority. And the occupant of the White House is threatening to unleash the power of the American military on our citizens who are'",
        "'speaker_2': 'peacefully protesting. Then I can't consider it in its totality, and I think it's in isolation that's considered in its totality. So this is where I stand on this. I think we need to be in charge of our own destiny.'",
        "'speaker_2': 'And I completely trust our city manager. I completely trust our police chief. I do not trust anyone else. So I am comfortable giving them temporary authority to keep our our city safe. But if I my fear is if we decide we are going to let this die today or tomorrow morning at 5 a.m., then we we fall'",
        "'speaker_2': 'under the jurisdiction of the county. And I know this hasn't been litigated, but it's entirely possible it could be litigated tomorrow. And a judge could say, you know, cities, you have responsibility and the county can't control a sovereign city.'",
        "'speaker_2': 'And then where are we left? We're left with kind of a patchwork where these these perpetrators know who's going to be open and who's not going to be open. And the one advantage we have, and I hate to say this because it just but my my colleague from the NRA called me and they have the most porous'",
        "'speaker_2': 'borders, you know, around and they're just inundated. We don't have that. We only have five ways in and off. So I think I'd much rather trust our folks, our city manager, our city council, our police chief, our police department to enforce these things.'",
        "'speaker_2': 'So that's what I was saying. I can envision a situation where, you know, other cities have a curfew and the county, one is overrule four charter cities and then we're stuck, you know, having porous borders because we don't have the ability to control.'",
        "'speaker_2': 'And our city managers stuck with our direction saying we don't believe there's a city or a state of emergency and we don't believe and we're not giving the authority to extend a curfew. I'm a little uncomfortable with, you know, two weeks, but, you know, that's the consensus of my colleagues.'",
        "'speaker_2': 'I'm fine with that. I mean, it might be interesting to get back here in a week and have a special meeting, but I understand the request for two weeks. I understand the extension or the request to go out to Thursday, because historically, when we have had unarmed people of color murdered by white folks, whether they be law'",
        "'speaker_2': 'enforcement or not, law enforcement has said a lot of these things happen from non-law enforcement, the funeral and the memorials, our days of protest and unrest and the weekends are our days of protests and unrest. So I can understand the rationale for, you know, going out to Sunday morning.'",
        "'speaker_2': 'So I guess I say that I don't if I've given any direction, but I mean, I, I will agree with the staff recommendation. But, you know, this is a very short leash and I completely trust our local officials and I don't want to do anything that would see any control over Alameda.'",
        "'speaker_2': 'And I'm going to get very provincial, appropriate, whatever you say. But, you know, last night when I saw what the occupant of the White House did and I read the county thing, I went outside, I put my Alameda flag up because I'm in Alameda.'",
        "'speaker_2': 'And if anyone's going to be in charge of Alameda, it's all meetings. And I'm perfectly comfortable with Alameda as being in charge of Alameda. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Eddie Councilmember Vela. So I do know in a number of other cities are considering various curfews tonight. And some of those cities include cities that have spoken out about whether or not they believe the county has the jurisdiction over their individual city.'",
        "'speaker_0': 'Berkeley being one of them. I guess where I'm coming from on this is I think it's a very and I had this conversation with the city manager to very fast slide into what I feel are very kind of fascist type.'",
        "'speaker_0': 'Uh, scenarios, and I feel like it's been a conflation of a number of different things that have led us to where we are. So I actually I will stand by the city manager's decision to implement the curfew. But I also am very much opposed to curfews, and I'm going to get into that right now.'",
        "'speaker_0': 'So first, we've heard a lot about curfews, but we haven't really heard about why we think they're effective. What we know is and I and again, when I say there's a completion of a number of different issues that I think are lending itself.'",
        "'speaker_0': 'One of those is the shelter order. There are fewer people out. A lot of the places hit have been large shopping centers where there have been no one, no nobody, no customers, no employees at these sites for almost a couple of months now.'",
        "'speaker_0': 'So they're filled with inventory, but no one's there. They can't really operate. And all of the things that make those spaces safe, namely the people utilizing the space, are absent from it. The other thing is that the shopping centers are not anchored by things like grocery stores where like Alameda, where we have people coming in and out'",
        "'speaker_0': 'and still using these.'",
        "'speaker_2': 'Or other.'",
        "'speaker_0': 'Types of shopping malls. I know the Walmart was the exception to that as well as a couple of the targets that were hit. But I haven't really heard about how this curfew is going to make us safer. My concern is also that we have a number of exemptions under the curfews.'",
        "'speaker_0': 'One includes people going to and from work. And I, you know, in my day job, represent a lot of workers. Many of them are people of color. They're traveling to and from work. And they are terrified of being pulled over.'",
        "'speaker_0': 'And they're they're worried about what that interaction is going to be like. I think things are already heightened. We have high tensions because of what's going on throughout the country. And I'm just worried that having a curfew is going to give cause to pull people over, specifically people of color.'",
        "'speaker_0': 'And I'm not saying that that's necessarily happened here in Alameda, but I also know that the curfew itself gives the cause to pull people over for being out on the roads. And then people have to explain why they're there.'",
        "'speaker_0': 'And that gives me concern. The other thing is I think that we are lending to some of these rumors and fears. I heard from a number of business owners who were talking about they had heard chatter, they had heard rumors.'",
        "'speaker_0': 'I think it's definitely important to take steps to secure your business and to be safe. But I'm wondering how much this is actually lending itself to that fear that something could happen or will happen. I think that we need to move from a place of data.'",
        "'speaker_0': 'And I think curfew, certainly if we are going to impose a curfew, it needs to be a database. It can't just be that we heard a chatter. I want to see what probable what what real what actual information we have.'",
        "'speaker_0': 'I can understand a curfew. If we have credible evidence that there is going to be major violence or harm in many ways, I'm actually very frustrated that we're talking about taking extreme steps to protect property when a lot of the conversation should be about the sign that is behind my colleague Mr. Odey, which is that Black Lives'",
        "'speaker_0': 'Matter and that a lot of the unrest that's going on is the result of government, local government, governments like ours, the city of Alameda, failing to hold people accountable for police brutality, for actions that I think we should all be able to agree are not just and not from a place of what, you know, law enforcement should'",
        "'speaker_0': 'be doing. And our chief said that yesterday. So I think that, you know. I'm willing to support the declaration of emergency. I am not in support of further curfews or granting that authority. I think we need to give some more direction and guidance before I would be willing to do that.'",
        "'speaker_0': 'I again, I'm hearing about potential. What would be the trigger in order for the city manager to actually call for another curfew? I'd want to know what factors he would look at, certainly for me. And again, I would like to hear more information about how the curfew actually is going to be helpful in deterring crime.'",
        "'speaker_0': 'I think that, again, I haven't heard I've heard about reason, again, mainly based off of threats to property and merchandise. And while I don't condone vandalism or looting, my number one concern is the safety of human life and protecting human life.'",
        "'speaker_0': 'And so I would like to know how this curfew is is. Going to achieve the goals that are stated, which I fear would be to me protecting the safety of individuals that would be first and foremost. And then I would want to know also, for those of you who are concerned about merchandise and buildings, how the curfew'",
        "'speaker_0': 'is going to protect against that. And then finally, I would just say that I know that our city manager didn't take this decision lightly. And I very much appreciate the thought that he put into this. I personally do not want to be spending our forces of our police officers enforcing the sheriff's curfew order.'",
        "'speaker_0': 'And that's why I asked that question earlier about how are we going to go about enforcing it? Because if we're going to be going around giving citations to people, I'd like to know about that and I would like to know what that citation would involve and how much resources, how many of our resources are going to be'",
        "'speaker_0': 'spent doing that. Thank you. Thank you. Councilmember DeSantis, you want to weigh in?'",
        "'speaker_2': 'Well, sure. First of all, let me say thank you very much, you know, to all of us council members, the mayor, city manager and city attorney, chief of police, everyone who is here tonight, as well as the assistant city manager.'",
        "'speaker_2': 'I think we can all agree that these are historic times. To say nothing about COVID 19. But certainly, you know what's going on throughout our nation, start having started in Minneapolis and perhaps, you know, it's gotten steam. And as a result of things going on in Washington, D.C., and I think, you know, the looting and the mayhem'",
        "'speaker_2': 'that we saw occur in neighborhoods, cities like San Leandro indicate that we need to play it safe in these historic times. And so I think for that reason, I certainly support the the emergency declaration and the length that we're looking at the declaration until June 16, so or so.'",
        "'speaker_2': 'I also support the curfew. And my my take on it is that I think we have an opportunity to look at the curfew on a case by case basis on a day to day basis. So that would be my druthers.'",
        "'speaker_2': 'But as I walk up and down Webster Street, because, as you all know, I live close to Webster Street and I talk to business owners, many of whom themselves have single handedly beautified Webster Street, not just by one store's that they opened, not just by two stores that they opened, not just by three stores that they opened'",
        "'speaker_2': ', but by four beautiful stores that they opened. You know, shop owners on Webster Street certainly have concerns about what's going on. And they know that situations can be incredibly volatile so that something that happens, say, in San Leandro could, for whatever reason, spill over into the city of Alameda.'",
        "'speaker_2': 'And so for that reason, I think we do need to have the flexibility to have our public safety, whether it's the police or the fire, be able to respond on a moment's notice. And if it means one of the prophylactics that we would employ is a curfew, then then I think that has to be one of the'",
        "'speaker_2': 'arrows in the quiver, so to speak. It's tragic what had happened in Minneapolis. It's tragic that that has been going on for for generations and for centuries. But it certainly has been picking up steam for whatever reason since 2000.'",
        "'speaker_2': 'But I think, you know, we here in the city of Alameda, you know, we have the police force in place that can understand how to respond to these kind of situations and as culturally appropriate manner as possible. We've grown so much since the early 1990s and we all know what I'm talking about.'",
        "'speaker_2': 'And ah, but you know, the progress that we've made notwithstanding I think we owe it to the residents and we also owe it especially to the shop, small shopkeepers to be proactive by allowing us to have the curfew as as at least one of the areas in our quiver.'",
        "'speaker_2': 'So I certainly support that. I really wish everyone to be safe, not just in Alameda, but in San Leandro and in the city of Oakland. But I also want to say to the men and women who. Who serves in the police force and often the fire departments.'",
        "'speaker_2': 'I want them to be safe as well. So I think one of one way to achieve that in this very, very difficult time is by having a curfew as one of and done on a case by case basis.'",
        "'speaker_2': 'By the way, I'm not sure I want to have a six day curfew, 8 to 5. But I think I have full confidence that the police department, as well as the city manager's office, can, can on a moment's notice, pull a curfew.'",
        "'speaker_2': 'For the right reasons. I have faith that they would do so. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Desai. So I will go last. And I want to say that we balance a lot of competing interests always, and this is particularly true in this particular instance. So we're balancing personal liberties. On the other hand, I have zero interest in protecting looters.'",
        "'speaker_0': 'We are not talking about peaceful protests or even protests that get noisy and messy. I will support those. Every day of the week. But what we have seen in other cities and right next door in San Leandro is not only looting, but also gunfire being shot and not by not by police.'",
        "'speaker_0': 'And at some point, someone's going to get hurt. There have been some pretty outrageous burglaries at cannabis dispensaries in the area, and one of them involved an armed carjacking. I understand. And at some point, someone, some citizen is going to get hurt.'",
        "'speaker_0': 'And we also need to look at the the personal safety, certainly, of our residents and our businesses. And these are businesses I mean, we never prioritize, prioritize public safety or, you know, businesses and merchandise over personal safety. But what we're talking about is allowing our businesses to open up again.'",
        "'speaker_0': 'And so these are folks who are employers. These are small businesses. We're helping them with a community fund because some of them are close to going under. And we we want to make sure that this is a safe city for people who live here, for people who come to visit, for people who work here, who have their'",
        "'speaker_0': 'businesses here. And I did get some emails this morning asking me as well as mayor, are you going to. Are you following, you know, the president's directives about getting tough? And, you know, I can't even use the sort of language I would like to in public.'",
        "'speaker_0': 'But, no, I absolutely am not. And in fact, what I've told more than one person who inquired is that I, as a mayor, one of many mayors across this city, know how hard we have all been working, along with our governors, to keep our residents safe during the COVID crisis.'",
        "'speaker_0': 'And we have implored the federal government for help from our for our cities. We haven't gotten it. All we have gotten is trash talk from the the current occupant of the White House. So, no, that is that is not my motivation whatsoever.'",
        "'speaker_0': 'And so I don't want to conflate those incidents, you know, last night in Lafayette Park and using tear gas to disperse peaceful demonstrators so the president could have a photo opportunity in front of Saint John's Church. This is not what we're talking about.'",
        "'speaker_0': 'And I can assure you that our police department, our police chief and working with our city manager and city attorney, they did not take lightly the decision to impose a curfew. And certainly, you know, working within the structure that we find ourselves in, in Alameda County, this is not a decision that is taken lightly.'",
        "'speaker_0': 'I, too, would like to see it be as brief as possible, but I am willing to cede that authority to our city manager who is in charge in an emergency informed by our police chiefs, and they'll run it by the city attorney.'",
        "'speaker_0': 'The city attorney has already advised us that, well, maybe I won't go into it. The city attorney has advised us, come to think of it. But but we we followed the city attorney's advice as well. So I am I think the vice mayor summed it up pretty concisely the way I would.'",
        "'speaker_0': 'And I, I think I've heard more than one of my colleagues say this as well, that you would like to see a curfew declared maybe on a day to day basis. People have. I've made suggestions about what I think is very valid about some upcoming events that could lead to, again, protests, demonstrations, outpouring of emotion.'",
        "'speaker_0': 'Those are all protected by the First Amendment. Violence and looting is not. And so on. And I do believe that our city manager wants to weigh in, since we're all talking about what we'd like to give him authority to do so.'",
        "'speaker_0': 'And Councilmember, a councilmember would welcome to the council, the city manager, Mr. Levitt.'",
        "'speaker_2': 'So I appreciate all the comments. And I think I'm I think I'm out.'",
        "'speaker_0': 'No, you're good.'",
        "'speaker_2': 'Okay. I've heard all the comments. And and I do want to explain a couple of things, because the public comments came after my initial discussion and after the assistance they meijer's presentation. There were factors that were looked at some of the factors, and I want to just for public purpose, talk about them for the two days.'",
        "'speaker_2': 'One was I knew the councilmember was councilman was coming in two days, so I wasn't going to do it for more than two days because I wanted to give the council the opportunity. The second was the vandalism and damage that occurred on Sunday night and surrounding communities was a factor in the decision.'",
        "'speaker_2': 'And rumors of potential targets in Alameda coming Monday night was a factor also. And then when many of the cities around us started doing it, that became a factor also. Those were some of the factors that led to it.'",
        "'speaker_2': 'On Monday I was talked about, it was brought to me as an option. During the weekend I did not see those same factors during the weekend. That and that's why I waited till Monday. And even on Monday was a difficult decision because I agree with many of the council members when you talk about the liberties and that'",
        "'speaker_2': 'being the foundation of our country. And and so I think that this is a concerning issue when you look at all of that. So one option I do have the declaration of emergency in my in my view, is different than the the then the curfew and the declaration of emergency is because we may have to have more'",
        "'speaker_2': '. And I do see this happening probably over the next week or two where we'll have to have more public safety resources, either fire or police or a combination of the two. And the declaration of emergency allows us to document that if we were to get reimbursement from the federal government through the county.'",
        "'speaker_2': 'And so that's where I see that through the 16th. One option on the curfew, as are two options I would give, is either not provide me with the authority to do the curfew or provide authority through maybe the 10th.'",
        "'speaker_2': 'But if I am going to do more than one day or more than two days in a row, it has to come back for council action to go further than that. Those would be the two options I would recommend.'",
        "'speaker_0': 'So to just restate that, so separate the declaration of authority, declaration of emergency from issuing a curfew. And if you issue a curfew, it would not be for more than two days without going back to the Council for authority.'",
        "'speaker_2': 'That would be correct. That would be my recommendation. Or not give me authority for the curfew at all. Either of those.'",
        "'speaker_0': 'Okay. All right. I see the vice mayor had to say, oh, I think council member Ella had her hand up sooner. So. Councilmember Vela, vice mayor. Not quite in that order, please. Thank you. So really quick. I think, you know, I have a couple questions again, how well the curfew is that?'",
        "'speaker_0': 'Could you explain how that how having the curfew will make it safer in those events that the city manager listed? I think the answer to that would be helpful is, is that we think clearing off the streets will make it safer.'",
        "'speaker_0': 'And then for individuals who are traveling under the exemption, what do our police officers, what do they need to do to make sure that it's a safe encounter? Because there are people that have to go to and from work and our police chief, our police officers are just going to be pulling people over.'",
        "'speaker_0': 'I would like to put out there what people need to do to ensure that they're not going to get hassled or detained or anything or cited unnecessarily. The other thing the other thing that I want to put out there is, you know, I think these are this is a major decision to cede authority to three people who'",
        "'speaker_0': 'are unelected. And so, you know, I feel very strongly about that. My question is, could we have a special city council meeting in a week, for instance, to see about extending the declaration of emergency? So could we do it for a week and then have another special meeting in a week to decide if we need to have'",
        "'speaker_0': 'it extended a week? You know, it's interesting. I just. My thoughts. We have a council referral later this same meeting about special meetings and how much notice needs to be given. So, you know, maybe we'll have to weigh all that at the time.'",
        "'speaker_0': 'I'm not sure what the answer would be, but could we hear from Chief O'Leary as to Councilmember Vella's questions about how there's a curfew make us safer? And what sorts of advice would you give to someone who might be pulled over?'",
        "'speaker_0': 'And maybe just let's start with a threshold question of who who is likely to be pulled over in a curfew in Alameda.'",
        "'speaker_2': 'Okay. So I'll try to answer answer this on the fly as best as I can. I'm going to make a make a quick comparison. Just like a couple of months ago, the thought of a county health order and a shelter in place for a pandemic was kind of, you know, off the radar for all of us.'",
        "'speaker_2': 'And when we jumped into it, what happened was we found that we were we everything that we've done for the last couple of months has been uncharted territory. This is uncharted territory. I've been a police officer for 31 years.'",
        "'speaker_2': 'This is the first time this has happened. So we're so everybody is trying to still figure it out. Electeds, police departments, the sheriff's office, everybody. You had civil unrest before. We've never in my career gotten to this point.'",
        "'speaker_2': 'So the only you had a call earlier that asked about data, the how do we know it's successful? I guess my honest answer is the only the only data I can give you is that on Saturday and Sunday night, we had lots of activity on when the when the shelter or the curfew went into effect.'",
        "'speaker_2': 'Everything dropped. And it wasn't just here. San Leandro, Hayward, Fremont, every everybody that had problems, big problems the night before, they all reduced last night. Maybe it was a coincidence. I'm trying to be as honest with you as I can.'",
        "'speaker_2': 'I don't know. My my role as an unelected but appointed police chief is to try to take care of public safety in Alameda. That is both protecting people and property. I'm trying to do that. We are trying to do that the best we can.'",
        "'speaker_2': 'I think we've done a good job. I will continue to try to do that with or without a curfew. The the reassurances that I could give the council and the public are the same as I would for any other law enforcement interaction.'",
        "'speaker_2': 'We try all the time to do the right thing, the right way in practice, constitutionally sound policing. Not to profile. Not to violate people's civil rights. We have not written any tickets on since the curfew was issued. We have only written a couple of citations on the county health order.'",
        "'speaker_2': 'We are primarily trying to educate people and get them to just be in compliance with the order so that we can, in the case of COVID, stop the spread of the virus. In the case of the the curfew that the sheriff imposed is to try to keep the city safe.'",
        "'speaker_2': 'Having fewer cars and fewer people on the road helps us with our response times. There's fewer cars on the road. There's fewer obstructions we are able to get from point A to point B more quickly. Does it guarantee prevention of crime?'",
        "'speaker_2': 'Absolutely not. Nothing does. Boarding up a business doesn't. Having 50 police officers on the street doesn't guarantee that we will stop crime. So if the notion is, well, we stop crime by having a curfew, the answer is no, we won't.'",
        "'speaker_2': 'And do we have a shot at maybe reducing it or helping our chances of catching people who are who are committing crimes? Yes, I believe it does. But we are still in the first couple of days of this, and it's uncharted territory.'",
        "'speaker_0': 'Thank you to you for Larry. Okay. With that counsel, do we have a vice mayor? Yes. I'm so sorry. You were. You were next. Sorry. Sorry.'",
        "'speaker_2': 'That's okay. It's just procedural question. With an emergency urgency meeting. Is that a 24 hour notice? Is it possible for us to do it on any shorter? A I'm sorry, I'm looking at even, but of course you can't tell me.'",
        "'speaker_0': 'I'm the city attorney. Okay. Mr. said.'",
        "'speaker_2': 'Yes. So the under state law, there are two ways to do an emergency ordinance. You could do it with a 24 hour notice. And if there are severe enough emergencies, we could even do it with a one hour notice.'",
        "'speaker_2': 'If it's just totally necessary. We have to make the finding under both that there are serious public public health and safety concerns that require the Council to meet under those circumstances. But it's either 24 hours or one hour of absolutely necessary.'",
        "'speaker_2': 'Thank you very much. So I would be interested in considering whether we could put a couple of special meetings on the books for later this week, possibly for Thursday afternoon and Friday afternoon, just to have a space where people know we may be we can always cancel them, but that we would have the House in our reserve'",
        "'speaker_2': 'so that if it looks like things are, you know, a curfew is going to be needed, we can have, you know, I believe Thursday is probably the next likely place where if something was going to happen, where where a curfew was probably going to be necessary for the city to respond to.'",
        "'speaker_2': 'I know I know the county has declared this. I really don't you know, I'm not confident they have the authority to do that. I'm not I would prefer our council, actually our city, take that decision. And if there is a general feeling this is coming, I don't know why it would we wouldn't just put that on the'",
        "'speaker_2': 'put that on the books and cancel it. If it look if if if that feels comfortable in that way, we could have the conversation before that before the curfew is called. And I just I hear. Right. A couple of my colleagues having some some big concerns.'",
        "'speaker_2': 'And I do think we can just proactively solve those concerns.'",
        "'speaker_0': 'Um, masks the city attorney. I, I guess I don't understand. Or maybe I need the vice mayor to clarify if the county's order is in effect until 5 p.m. Friday morning. And if you believe that we are. Bound by that order.'",
        "'speaker_0': 'I do.'",
        "'speaker_2': 'Not.'",
        "'speaker_0': 'I'm sorry. I was asking the city attorney. And so, Mr. Shin, if if you believe that we are bound by the the county's order, what would be accomplished by a special meeting and what sir just explained what emergency we would be moving forward under.'",
        "'speaker_2': 'Right. And so so that relates to a recommendation I was going to make to the council, which is that the council could call an emergency meeting with 24 hours or one hour notice. At this moment, if the council wants to schedule a meeting, let's say, two days out based on certain emergencies.'",
        "'speaker_2': 'It would be helpful for staff to provide you with some emergency basis as to what imminent threat to health, safety and welfare that would justify the the calling of the meeting. The police chief could probably do that and you may want to call on him.'",
        "'speaker_2': 'Alternatively, you could just reserve time if you wish, so that at least you are available to the extent that staff believes that there's need for you to to to convene without actually calling for the emergency meeting. If you believe that there's not enough factual basis at this moment to call an emergency meeting within 48 hours.'",
        "'speaker_2': 'I hope that helps answer the question. Sure.'",
        "'speaker_0': 'So I. Yes, Vice Mayor.'",
        "'speaker_2': 'Sorry, this pertains to the question I was asking. So could we also continue the discussion of the curfew to a time certain two days from now?'",
        "'speaker_0': 'You see Mr. Sandia?'",
        "'speaker_2': 'Yes. My apologies, sir. Yes. You could continue this item to a time. Certain? Yes. Okay. Thank you.'",
        "'speaker_0': 'Okay. All right. So what's the. So, Councilmember Vela, you are out of time. I would need a motion for you to speak again. And I will just remind people that it's 830. So how much time do you think you need?'",
        "'speaker_0': '20 seconds. I had a question. Okay. Do I have a we'll give you a move.'",
        "'speaker_2': 'To give the city councilmember an extra minute.'",
        "'speaker_0': 'All right. And it's been seconded. All in favor, a roll call vote, please. People shouting, Madam Clerk.'",
        "'speaker_1': 'Councilmember Daza.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Knox Light.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Odie. Yes, Bella.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Mayor has the.'",
        "'speaker_0': 'Yes. Okay. Go ahead, Councilmember. Thank you, Madam Clerk. There were there was a question, I thought, by the vice mayor that if we don't agree with the assessment that the county has authority over us, what can we do about the curfew if we don't believe that the sheriff has jurisdiction?'",
        "'speaker_0': 'What, if anything, can we do? Okay. So for the city attorney, correct? Yes. Okay. Yes.'",
        "'speaker_2': 'Councilmember, if you're if your question is whether or not about whether the city could implement a curfew, I think you have complete discretion whether to continue, modify, extend or terminate the curfew. That's the city's curfew. I have I hope that the question that you're asking.'",
        "'speaker_0': 'You know, if we if we don't have a curfew and we disagree with the authority of Sheriff Ahern to implement a curfew, like if we're saying we don't want a curfew, and then the county has said, no, we have a curfew.'",
        "'speaker_0': 'What, if anything, can the council do? Do you want to challenge that authority?'",
        "'speaker_2': 'The council could. So I would suggest that we agenda this as soon as possible for the council to direct our office to take legal action.'",
        "'speaker_0': 'And then it's about a curfew that has to last until Friday morning or if it goes beyond that or what Councilmember Bell helped help me understand. If we do not vote to extend the curfew tonight, then, but we don't want to recognize the existing curfew for this week.'",
        "'speaker_0': 'Understanding that he could extend it. And so came city attorneys. And you were you were starting to say we would need to.'",
        "'speaker_2': 'Get the council to take a vote to direct a to convene. My recommendation will be in closed session to discuss the potential initiation of litigation, and we'd be happy to have that conversation with you.'",
        "'speaker_0': 'All right. I think I saw Councilmember Otis hand up.'",
        "'speaker_2': 'Thank you, Madam Mayor. I'd be interested in having that discussion. I appreciated the chief's response about constitutional policing. And through no fault of your own or any of your officers. There's still a fear among people of color doing day to day things that people that look like me can do without any any fear.'",
        "'speaker_2': 'So you know what? What can we tell that? I don't and I'm not expecting you to answer this. Maybe the city manager I mean, what can we tell? But people of color that live in town, you know what they can do?'",
        "'speaker_2': 'Well, what can we tell them to help with that fear that when they get pulled over, you know, something untoward is going to happen? Because like I said, it's not anything you had done or your officers have done, but it's just institutionalized in their in their brains.'",
        "'speaker_2': 'That's what I wanted here. I'm sorry, Councilmember. I understood you to say you did not need me to answer that question or you want me to. I mean, you could, but, you know, it doesn't matter. I don't I don't care who answers it.'",
        "'speaker_2': 'It's just something I'm struggling with and. I don't. I don't drive or walk. I don't run. But if I did, I wouldn't run with that fear. You know, so I think people's emotions are heightened now. And, you know, we're basically taking a day implementing a very strong law enforcement policy at a time when emotions and feelings are'",
        "'speaker_2': 'pretty highly wrought and tight. So how do we what do we tell people that are people of color that are driving to our city after 8:00? To help him, you know, navigate, pull over. Or, you know, a neighbor calling the cops on them.'",
        "'speaker_2': 'I'm just. I don't know. So I'll take a stab at this. And I think we're going to be coming around and talking about this more a little bit later in the meeting. I'll tell you what I told the people that were demonstrating in front of the police department yesterday afternoon, what I've told people in emails and other'",
        "'speaker_2': 'statements that I've made over the past week. We can all talk. Police chiefs. Elected officials. We cannot talk about things that are broken and wrong in this country. In this country, and and specifically with policing in the United States.'",
        "'speaker_2': 'And the history and the. The absolute valid concerns that people have about what happened to George Floyd and Breonna Taylor and to Eric Garner and to a number of people around the country. We've all seen those stories. That's real stuff.'",
        "'speaker_2': 'And I understand it and I get it. It doesn't matter what I say. It matters what we do. It's words and deeds. You all need a police department. Knock on wood has not been involved in a shooting in 15 years.'",
        "'speaker_2': 'We have 64,000 calls for service and about 3500 or 4000 arrests per year. We have about 30 uses of force per year on average. At 64,000 public interactions, it's very low, less than 1%. I can say whatever I want.'",
        "'speaker_2': 'I'm a white male police officer. Police chief. I'm asking people to consider the fact that despite things that have happened in the past, that this police department being run by me today. That you are safe in this community.'",
        "'speaker_2': 'We're going to talk about an incident later tonight where people might beg to differ. But all the facts aren't out yet, and I'm going to fix that. 30 uses of force per year on average for the last five or six years running without the stats in front of me.'",
        "'speaker_2': 'I'm pretty confident that's the right number. Less than 1%. Very few personal complaints. And not a shooting in 15 years. We're doing things right. We're doing something right. Are we perfect? No. Well, we make mistakes. Yes, we will.'",
        "'speaker_2': 'Absolutely. And it's my job. My job as the chief to own up to those when we do and to fix what's wrong. That's what I would tell people if they gave us the time when we stop them. If we stop somebody now in the middle of curfew, it's going to be please go home.'",
        "'speaker_2': 'It's not safe. Go home, be with your family. And as a and as a double bonus, help stop the spread of the COVID virus. That's what I would tell them.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'MORODER Thank you for that. And I guess I would say. To those of us who are not police officers. Stop calling the police. When? People of color are doing things that you get to enjoy freely, whether it's exercising, whether it's jogging, whether it's birdwatching, shopping.'",
        "'speaker_2': 'Having a picnic in the park. You know, it's just got to stop. And I wanted to see.'",
        "'speaker_0': 'Well said. Thank you, Councilmember Brody. Um, Counsel, do we want to. Call a special meeting to possibly bring litigation? Or do we want to give our city manager narrow directions, possibly following up on his own suggestions? We've we've heard it said this evening that Thursday, maybe even Friday might be pivotal days.'",
        "'speaker_0': 'And the county order extends until 5 p.m. this Friday morning. Do we want to initiate or have some limitation of if that curfew were extended beyond 5 a.m. on June 5th, then we might call a special meeting. What do we think counts on everybody?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'The city manager can hurt me if I'm wrong, but I thought that the curfew was for five days. But there was discretion to go to seven, right?'",
        "'speaker_0': 'I read in I read the order this morning and it said it was in effect until 5 a.m. June 5th, unless rescinded earlier, unless there has been an update today. But I, I went on the website this morning.'",
        "'speaker_0': 'Am I missing something?'",
        "'speaker_2': 'I thought there was a two day. I thought there was a two day. Maybe someone can help me on that.'",
        "'speaker_0': 'Okay. And I'm actually going to ask the city attorney or the city manager have it have information specifically about the order. And I'll get to you in just a minute. Vice Mayor. Mr. Levitt?'",
        "'speaker_2': 'LEVITT Let me look at that. I had the same understanding and understanding as the mayor that it ended on Friday. There are other cities that are through the eight, but let me double check if I can find anything more other on the county order.'",
        "'speaker_0': 'Maybe I should have asked. Assistant Manager. City. Assistant City Manager. Mr. Bowden, since this is your item. Yeah. Just put everybody on the staff on the spot.'",
        "'speaker_2': 'We have the version that was available publicly yesterday attached to the staff report. And the it the exact language of the order shall remain in effect until June 5th at 5 a.m., or unless rescinded earlier due to restoration of public order and safety.'",
        "'speaker_2': 'That's the that was the guiding language that we use to draft the staff report, and that's what's attached.'",
        "'speaker_0': 'I read that same language this morning. Vice Mayor, you had your hand up. Do you have a more current version or something? No.'",
        "'speaker_2': 'I was going to point out that the sheriff took the authority and used it. Whether it says it ends on the fifth or not on the fifth, he could say it goes to the 10th one.'",
        "'speaker_0': 'And precisely the distinction I was trying to make was, could we have something that said we would call a special meeting if there didn't appear, you know, without any indication of necessity, the county order was extended that. But again, I'm just going by what a couple of my colleagues have pointed out about events to be anticipated this'",
        "'speaker_0': 'week.'",
        "'speaker_2': 'So if I were to make a motion and I'll make it an offer, I will I will offer a couple of possible alternatives. But I would I would move that we declare this the state of emergency for the next two weeks.'",
        "'speaker_2': 'The state of emergency allows us to collect the funds that we need to if there are any costs that come up and does not give, I think undo. We already have a state of emergency in place that gives the city staff the authority to do a lot.'",
        "'speaker_2': 'So I think that's insane to me. That is mostly about about that. I would I would grant if it were me, I would grant our staff the ability to identify two days for curfews and if we were going to engage in more than two more days and I have two specific days and I'm thinking possibly could come'",
        "'speaker_2': 'up that there would be an emergency council meeting to discuss further, and that I would suggest that we'd prioritize enforcement of the counties. I don't want to get into a legal fight with the with the county in the middle of this, in the middle of this emergency.'",
        "'speaker_2': 'I think that that's just not a that's not where we are at this point in time, although I do think we need to kind of address this ongoing issue, given that this is coming up at some point in time in the future.'",
        "'speaker_2': 'But I would ask that we prioritize enforcement of the curfew unless the city has declared there's a curfew in our city, and that would be the way we would do it. And if people are acting badly, that doesn't mean we can't fight them if we're acting badly.'",
        "'speaker_2': 'But we would not pull people over because they're out after curfew.'",
        "'speaker_0': 'Mr. Knotts. Mr. Vice Mayor, may I ask you to tell us what the additional two days are would be that you referenced?'",
        "'speaker_2': 'Well, in my mind, it would be the memorial service on Thursday and then possible and then the the funeral in Houston on June 9th. I think those are the two most likely times. And then if they decide not to charge the officer, I mean, things are going to come up.'",
        "'speaker_2': 'So I think I have two ideas where I think it's probably likely that, you know, we could see. For me, this is about the stretched resources of our of our officers and the region's officers and keeping people safe and much.'",
        "'speaker_2': 'I think the chief was correct. At the end of the day, we are talking about you were never going to be able to prove it worked, but we're certainly going to prove it. Did you know, we should have done something?'",
        "'speaker_2': 'And, you know, I personally believe that our chief and the city manager will make or will take the series the decision very seriously. Thank you. Is not going to be made lightly.'",
        "'speaker_0': 'Thank you for your comments. I see the city manager is indicating he'd like to speak. Mr. Levitt, please.'",
        "'speaker_2': 'I just had a clarification. My clarification is if within your motion that it would be no more than two days cumulatively. Yes. Okay. Correct.'",
        "'speaker_0': 'Okay. Without getting special counsel permission. Right. Right. Okay. Got it. Okay. We have had a motion. Do we have a second? I think I see. I see misdirection. Okay, counselor. Everyday. Third question, then I'll go to you, Councilman Brody.'",
        "'speaker_2': 'So I guess I just need to understand the practical effect of this. So what does this mean? Does this mean that. Let's see. Our current curfew ends tomorrow morning at five. Right. Is that right?'",
        "'speaker_0': 'Friday morning at five.'",
        "'speaker_2': 'Friday morning at five. So does that mean that if we want to extend it for two more day.'",
        "'speaker_0': 'Hours in the city?'",
        "'speaker_2': 'Uh huh. So. So I guess I just need to know, what does the two day cumulative mean? What's the practical effect of that? If we can explain it not just to me, but to the residents.'",
        "'speaker_0': 'Yeah. Mr. Levitt, back to you.'",
        "'speaker_2': 'Well, the way I understand it, so just so I'm clear and it helps me to and just explain it, we understand it as our curfew ends tomorrow morning, Wednesday morning at 8 a.m. and at 5 a.m.. And so then if I were to let's say, just for example, to declare a Thursday and a Friday, let's say Thursday'",
        "'speaker_2': ', let's say let's even say the next two days, Wednesday and Thursday, which that's not my intent. I'm just using as an example, Wednesday and Thursday, 5 to 8 or 8 to 5 and then 8 to 5. Then I would not again have any more authority until it came back to council.'",
        "'speaker_2': 'Okay. That was Wednesday. And then it just wouldn't have any more authority. Just needed to have that spoken out loud. Thank you. I think it's a good idea.'",
        "'speaker_0': 'Okay. Councilor Brody.'",
        "'speaker_2': 'Thank you. Also get the motion, but. I think at least until Thursday. In the county on Friday morning when the county order expires. I would give the city manager discretion. And after that, I'd want to weigh in like.'",
        "'speaker_2': 'Whether it's Friday or Saturday to extend it over the weekend. You know, Monday.'",
        "'speaker_0': 'I'm sure you would give the city manager discretion to extend the curfew until.'",
        "'speaker_2': 'Until the county one is set to expire now. And then if we want to if he feels we need to go further, then we can meet on a Friday and have that discussion.'",
        "'speaker_0': 'I see. Okay.'",
        "'speaker_2': 'I mean, I guess so. I mean, what I worry about is that county shut down and that we're technically not shut down. And then, you know, it's open season on Alameda. Right. I mean, no.'",
        "'speaker_0': 'Way to be covered again. Mr.. I think you're out of time. And I believe Madam Kirk, you might have added the extra minute. Yes. Already.'",
        "'speaker_1': 'Dickie has already said that.'",
        "'speaker_0': 'Okay, um, let's see if we're getting close to wrapping it up as you've made the second call. That has already made the second. Okay. Any further discussion? Yes. Councilmember Vella. Quickly. Could it be could the motion be separated out?'",
        "'speaker_0': 'Because there's some parts of it that I would be willing to support, but I'm not willing to support granting additional authority for a curfew without counsel weighing in. I support Dee Dee prioritizing stops when we don't have a priority, when we don't have a curfew in alameda and I support the emergency declaration.'",
        "'speaker_0': 'The maker of the motion vice mayor.'",
        "'speaker_2': 'Happy to bifurcate that.'",
        "'speaker_1': 'And can I maybe even the city attorney can clarify better than me. But the urgency ordinance you are adopting both declares the emergency and has curfew language. So, you know, whatever curfew language you decide will be imposed in that ordinance.'",
        "'speaker_1': 'And so that will be one motion on that ordinance. Just to clarify and then any other direction on prioritization would be the separate motion. So just so everybody's clear, what's in the ordinance is being okay.'",
        "'speaker_0': 'Okay. All right. And then the separate about deprioritized enforcement. If the curfew goes more than. Now. Correct. That's. For now, prioritizing, prioritizing enforcement if it's only a curfew and there is no city curfew. Got it. Okay. All right.'",
        "'speaker_0': 'So, Councilmember Dessa.'",
        "'speaker_2': 'Just quickly, I think I understand the energy behind the position of the prioritizing a county curfew when it does not coincide with the city of Alamitos curfew. I think I understand the energy behind it. But I'm concerned, though, that that we as a city, we still have to coordinate with the county on a variety of things that'",
        "'speaker_2': 'are public safety related. And I don't I'm concerned that things are not as easy as they might seem. So my my encouragement would be to phrase it in the positive. But having said that, I understand I think I understand the energy behind, you know.'",
        "'speaker_0': 'Where that.'",
        "'speaker_2': 'Language is coming from. And I'll just leave it at that.'",
        "'speaker_0': 'Thank you. All right. So. And, Madam, quick, are you clear on the motion we're about to vote on?'",
        "'speaker_1': 'I believe the will take two votes. The first vote will be on the ordinance itself, and then the second vote will be on the direction item. So we'll have two votes.'",
        "'speaker_0': 'All right. Maybe we have a roll call vote, please. On the first I. Wait, wait. Um, I can't. I mean, city manager. Mr. Leavitt. Mr..'",
        "'speaker_2': 'Lemieux The first motion I understand the declaration of emergency. I don't I I'm not sure if it's to. To. I'm not sure if it's. No. Um. No curfew. Days to curfew a few days cumulatively. Or curfew days only through the end of the county order.'",
        "'speaker_2': 'I'm not sure which of the three that motion is that at this point.'",
        "'speaker_0': 'Mr. Vice Mayor, as make of the motion, you want to clarify.'",
        "'speaker_2': 'That that's too cumulative. To me, it's it's we are we're in Section four. We're ratifying the city manager's June 1st. Curfew order is ratified. The council extends the curfew until June 3rd, 5 a.m. five. That that's tonight. We would I guess here's my question, because I know that Councilmember Vela is concerned about the curfew language.'",
        "'speaker_2': 'That is the piece that she is would like to vote separately on. Is there a way for us to vote on the giving authority as a second to ordinance? And I guess that the question for the city city attorney.'",
        "'speaker_0': 'Mr. Shin. You're muted still, Mr. Sheen.'",
        "'speaker_2': 'My apologies. My suggestion to actually vote on the curfew language first. So that will be clear whether or not there are four votes for any amount of curfew and what it is. And then you take an overall vote on the ordinance.'",
        "'speaker_2': 'The ordinance is one ordinance, but take the vote on the curfew language first. If it doesn't garner four votes, then you take a vote on the ordinance and essentially just take out the curfew language if it's if they're not four votes to move forward.'",
        "'speaker_2': 'Sounds like the curfew is the one that will have a split of votes. So my suggestion that you whatever curfew direction you want to give you vote on that first, then you vote on the ordinance recognizing that you have four votes to do something about curfews.'",
        "'speaker_2': 'And if not, then you just strike it.'",
        "'speaker_0': 'Okay. So we've got to or we've got the curfew regulations. We have to ratify those, don't we?'",
        "'speaker_2': 'So I suggest you do all of that last. So I think the first vote might suggest that the first vote you take relates to the curfew language, and then you either find four votes to agree on curfew language or if not, then we'll know that there is no agreement on curfew language which must be struck from the'",
        "'speaker_2': 'ordinance. And then you vote on the rest.'",
        "'speaker_0': 'And when you say curfew language, are you referring to the language in the curfew regulations, which are exhibit one?'",
        "'speaker_2': 'No, no. Talking about curfews going forward. Choose to live day. Yeah.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Okay. So a suggestion would be that that that the motion that was made, whatever motion about going forward gets made, whether it's two days, two days cumulatively or no curfew, and see if you can achieve a four vote on something about curfews going forward.'",
        "'speaker_2': 'And if you're unable to then work a strike that's actually completely from the ordinance, because you if you could not achieve for both going forward on the curfew, then, you know, you can vote on the rest. Sounds like there is unanimity on the rest.'",
        "'speaker_0': 'All right. And so the city manager's had his hand up. Did you want to address this to.'",
        "'speaker_2': 'I think, though, what the two council members are asking for, is there a way to split split it where you could, let's say, not to the curfew, take the curfew out of the ordinance, vote on that, and then vote to amend the ordinance that way.'",
        "'speaker_2': 'Kashmir Valley could vote on the ordinance without the curfew language, and then they could have a second vote on adding the curfew language. I think that's what the question is, that I've heard both from Councilmember Bhalla and Vice Mayor.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_0': 'Hey, Council Vice Mayor, you're smiling. Did you.'",
        "'speaker_2': 'Say that? Wasn't my question, but it was a really good idea. Yes, that's what I would like to do.'",
        "'speaker_0': 'Okay. Um, okay.'",
        "'speaker_2': 'So. So my proposal would be to amend the amended motion to approve the the emergency declaration as written, allowing the current curfew to extend through 5 a.m. tomorrow. And then we will take a second to talk about whether or not we give additional to amend to amend the ordinance, to give additional authority for future curfews.'",
        "'speaker_0': 'If that.'",
        "'speaker_2': 'Information.'",
        "'speaker_0': 'Mr. Councilor BRODY.'",
        "'speaker_2': 'So then Section four, we'll just have a period at the end of city council. Right. No and extends the curfew order until June 3rd, 5 a.m.. So it extends it through tonight? Well, I think it's Section four is ratified with the saying the city manager's June 1st order is ratified.'",
        "'speaker_2': 'Okay. Put a period there that would that would suffice. Great. Perfect. Brilliant. Even better then. Okay.'",
        "'speaker_0': 'Okay. Okay. Was that a second, Mr. Rudy?'",
        "'speaker_2': 'Yes, ma'am.'",
        "'speaker_0': 'Okay. Maybe we have a roll call vote, please. Madam Clerk.'",
        "'speaker_1': 'Councilmember Desai. Okay. Not quite. I. I. I may or as the Ashcroft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'That carries by five eyes.'",
        "'speaker_2': 'Okay next I move that we that the city council amend the order. The ordinance we just passed to provide the city manager with the authority to institute two curfews. No more than two nights of curfew from 8 p.m. to 5 a.m..'",
        "'speaker_2': 'During the extent of the of the current state of emergency. All second.'",
        "'speaker_0': 'And is that consecutive or any two days?'",
        "'speaker_2': 'Any two days.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'Executive or.'",
        "'speaker_0': 'All right. So we've had a motion by the vice mayor who seconded that councilmember. They say, in fact, make us one riverside discussion. Councilmember Odie.'",
        "'speaker_2': 'Quickly can we add on there without. Unless there's further authorization from the council. Sure. Okay.'",
        "'speaker_0': 'Yeah. Uh. Uh. Okay. Yes, exactly. Yep. Okay.'",
        "'speaker_2': 'As the make of the motion, I accept.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'So. Okay. Okay. So the modified motion has been remade or remade as modified. Seconded a motion by the vice mayor, seconded by councilmember. Suddenly we have a roll call vote with.'",
        "'speaker_1': 'Councilmember de sag.'",
        "'speaker_2': 'Night.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Hi, Vella. No merit craft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'That carries 41.'",
        "'speaker_0': 'Okay. And then was there one more mission? Or have we taking care of it all? I believe we want to do it. Yeah. Okay. So who wants to make that motion? Castmember Vela. So my motion would be that where there is no city of Alameda curfew in place that our police enforce spend their resources prioritizing and enforcing'",
        "'speaker_0': 'non curfew related incidences and reports. Is that. I'm trying to get here second that motion. So I. I have a I have a technical question maybe for the city attorney. Is is that within the authority of the council to direct police enforcement activities?'",
        "'speaker_0': 'I just, you know, love tossing hard balls.'",
        "'speaker_2': 'So, yeah, I think so. Yeah. I think I.'",
        "'speaker_0': 'Can reword it. Um, well, let's hear from the city attorney. And what, you know, how this might work or not is. You know.'",
        "'speaker_2': 'I think if the council provides overall policy direction, then the police chief undertakes its enforcement duties consistent with its obligations under state and local law. So I think they have stated policy preference.'",
        "'speaker_0': 'Okay. Any. Any language modifications you want to make? Councilmember fellas. Okay. Could we. Could we hear that motion restated, please, madam, quick.'",
        "'speaker_1': 'So I have that. There. The police would not be involved in any curfew related incidents when the city is not under a curfew. That they said.'",
        "'speaker_2': 'I don't think that's you know, I don't think.'",
        "'speaker_0': 'Okay, wait, wait. Let's let's wait. Let's wait in here. Speak one at a time. I'll call on you if you want to raise your hand that you want to speak. And then I think let's hear from the city attorney first.'",
        "'speaker_2': 'So so I think the motion with it, the council's policy preference would be that the city prioritize its use of resources to enforce laws other than the county's curfew order, to the extent reasonable use of resources would allow for that, consistent with the police chief law enforcement discretion.'",
        "'speaker_0': 'Councilman Avila, as maker of the motion, sends out. Okay. All right. Do and and that a matter of ice monoxide would be a second, correct?'",
        "'speaker_2': 'Yes, that would be confirmation of my second.'",
        "'speaker_0': 'Great. Oh, you've signaled already. Okay. So I wasn't sure what we were voting on, but I'm glad you were. So let's have a roll call. This. Oh, this guy. Sorry, sorry, sorry. So, Councilmember Dave.'",
        "'speaker_2': 'I think the one change that I would suggest is unless there was a call for mutual aid where our our police are going to go outside of Alameda, because I think the literal interpretation of this is they can't join in mutual aid activity if we don't have I mean, that's my that's my literal interpretation of what what's'",
        "'speaker_2': 'before us. And that's get back to what I was getting at earlier when I mentioned that there might be some wrinkles to this that we're not really.'",
        "'speaker_0': 'Go ahead. Let's go back to the Make or the Motion Council regardless. In my opinion, if there was a call for mutual aid, they could still respond to a call for mutual aid. It's just that I would want them to prioritize non curfew related calls that we're getting here in Alameda.'",
        "'speaker_0': 'What I heard was that the reason for the curfew in the city of Alameda is that we have a concern about overstretching our resources. And to that end, I would want to make sure that our resources are spent on responding to other reports.'",
        "'speaker_0': 'So if there's a report of a 459 or something like that, I would want us to be responding to that, not just pulling people over for curfew related things in town. So just to clearly you wouldn't be referring to a request for mutual aid?'",
        "'speaker_0': 'No. Okay. Does that satisfy your inquiry? Councilmember Garza. Actually, whether it does or not. We need to vote people. Okay. And this one also takes a does it take for affirmative votes? It's a 3 to 4 policy.'",
        "'speaker_2': 'It's direction.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'It is the council expressing its policy preference.'",
        "'speaker_0': 'Okay. Okay. And Madam Mayor, you are not a man. I am the mayor. Madam City Clerk. You got the the the clarification from the maker of the motion. Yes. Correct. Yes. All right, then. May we have a roll call vote, please.'",
        "'speaker_1': 'Councilmember de SAG.'",
        "'speaker_2': 'Yeah. I'm satisfied to be delayed. Yes.'",
        "'speaker_1': 'Next time.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'O.D..'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Bella. I may or has as Ashcraft.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'That carries by five vice.'",
        "'speaker_0': 'All right, I want to motion.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_0': 'Oh, one motion. Yes.'",
        "'speaker_2': 'To schedule a special closed session to discuss legal issues regarding the sheriff's order.'",
        "'speaker_0': 'A second. Okay. A motion to schedule a special meeting. Okay. Okay. Closed session.'",
        "'speaker_2': 'The potential litigation.'",
        "'speaker_0': 'All right. Um, okay. And city attorney, I'm trying to read your expression. Do you want to? I'm not a mind reader. All right. Let's hear from the city attorney, then the vice mayor. City attorney.'",
        "'speaker_2': 'If the council wants to schedule a initiation of litigation, the council can certainly direct us to do so, though, given that as soon as we would be able to do it, it's probably tomorrow and the order expires on Friday.'",
        "'speaker_2': 'Timing wise, it's not clear to me when you'd like to have it. We certainly could do it as soon as tomorrow. If you would like. And so I think, you know, obviously, we want to understand when you're what your timing looks like and whether or not it's tomorrow or your next regular meeting or a special meeting next'",
        "'speaker_2': 'week. And I'm happy to you know, we're obviously happy to take your direction however you like to proceed.'",
        "'speaker_0': 'Councilmember Ody.'",
        "'speaker_2': 'I hope it's moot by next week, but. I don't know. I don't know what he's going to do. I don't know if we would be interested in joining or some other city challenges. Maybe we're not. I don't know.'",
        "'speaker_2': 'That's why we would have the meeting.'",
        "'speaker_0': 'If I might comment, I. These are certainly important, serious issues. I'm also trying to be mindful of the amount of work our city staff is juggling right now with all the things that are before us. And so this is not to diminish the significance of what you're suggesting.'",
        "'speaker_0': 'I just wonder if if it has to be as soon as tomorrow, that makes people jump through a lot of hoops to get to pull together some sort of preparation. But I'm wondering if you had a, you know, some sort of.'",
        "'speaker_2': 'A how about we do it on Thursday? Because I think. I think we could give a different direction based on different possible outcomes. On Thursday or not, I mean, I don't know. And now pre-judging what decision we're going to make.'",
        "'speaker_0': 'All right. We do need to keep moving, people. That's past 9:00. So I guess if you want to make a motion, I not I guess you have every right to make a motion. So let me.'",
        "'speaker_2': 'Get a motion in a second on this.'",
        "'speaker_0': 'I think I think it was modified, actually. Because yesterday. It's Thursday. It's not tomorrow.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Okay, second, I second the modification.'",
        "'speaker_2': 'I mean.'",
        "'speaker_0': 'A comment. Can somebody say.'",
        "'speaker_2': 'Well, thank you. I do have 2 minutes, though. Um, I will say this much, you know, with the looting and mayhem that are going on in places like, uh, San Leandro and Fremont, I think now is not the time to go after the sheriff's department.'",
        "'speaker_2': 'We need to work with them. Um, through the mutual aid approach. Um, and I think this goes counter to that. In fact, we might need the help through that process. So you pursuing litigation now, I think is, is not the right time.'",
        "'speaker_2': 'If there are concerns about the way in which the sheriff's departments operate. I think there are better times than that now to deal with those policy issues in as clean a manner as possible. But right now, we're in a whirlwind of sorts.'",
        "'speaker_2': 'And so we're just trying to hang on on behalf of our residents, in terms of keeping them safe and our small businesses and keeping them safe as well. So I don't support litigation against the sheriff's department.'",
        "'speaker_0': 'Um, and my, my preference would be to wait and see what happens in the, in the days that you've noted that some very significant events are going to take place. And then, you know, I have I have concern, too, with with blanket orders.'",
        "'speaker_0': 'But I was also very alarmed over the weekend, not quite knowing where this was all going to end. But I, I think this week might be a little too soon, especially given the fact that Thursday is a day that was out, is, I believe, said the memorial service.'",
        "'speaker_0': 'But we. Did anyone want to comment? Anyone else? One comment. Okay. Vice Mayor.'",
        "'speaker_2': 'I. Struggling. Sorry, I am unmuted. I am struggling on this. I am Thursdays. I mean, the problem is, is that right now the thing ends on Friday, 5 a.m. at 5 a.m. If we wanted to schedule something for Thursday because it got extended beyond Friday, I would be able be willing to do that with the idea that'",
        "'speaker_2': 'we would cancel it if it had not been if it had not been extended. I just I it feels a little odd. I agree with councilmember deciding if things are really going crazy on Thursday. I don't really want to be pulling our staff resources into a into a conversation at that time to talk about something that's going'",
        "'speaker_2': 'to end before we could do anything about it. And so I would be willing to support them if we could have that kind of qualifier that will move forward. If not. If so, if not, we can I would say let's see if there's a way for us to figure out how to schedule this conversation in closed session'",
        "'speaker_2': 'for potential litigation moving forward at our next session meeting, I would be supportive of having it in two weeks.'",
        "'speaker_0': 'Make sure of the motion, Mr. Cody.'",
        "'speaker_2': 'Real briefly. I mean, I think I hope it will be moot by then, but I'm willing to agree to scheduling it Thursday if the sheriffs order is extended. Because if it ever dies, then it's going to be moot, in my opinion.'",
        "'speaker_0': 'Okay. And if it's extended for any length of time, even 24 hours.'",
        "'speaker_2': 'Well, yeah, because that's what gives us an opportunity to do something on Friday. But personally, I think this is a constitutional issue and I feel like our our sovereignty is being infringed on. I could be wrong. But as a discussion, it would be good to have.'",
        "'speaker_2': 'So I'll call the question.'",
        "'speaker_0': 'Now you've got a motion on the floor. You need to call the question. And I. I believe it's been modified.'",
        "'speaker_2': 'So anything more?'",
        "'speaker_0': 'I mean. Okay. I mean, let's have a let's have a roll call. The Madam.'",
        "'speaker_2': 'Quick.'",
        "'speaker_1': 'Council member said. No, not quite.'",
        "'speaker_2': 'I just want to ask to clarify. It has to take the soccer ball. It has the modifier that if it is extended, is a part of the motion. Okay. And I.'",
        "'speaker_1': 'Odie.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vella. I may or as the Ashcroft.'",
        "'speaker_2': 'Oh.'",
        "'speaker_0': 'Well. Hi. Or we can just. Yeah, I, we can discuss it, but, um.'",
        "'speaker_1': 'This like Kerry scored to one.'",
        "'speaker_0': 'Okay. All right. Um. Thank you, everyone. So with that, we adjourn this special meeting of the city council, and we move into our regular meeting. Anybody want a quick break? Okay. Okay. We are. And apologies to the audience, but we are going to take a what time is it?'",
        "'speaker_0': 'It is 911. Okay, everyone, can we be back in our seats by nine 2020? Yeah. Okay. See you. Thank you. Thank you, everyone. Thank you to for Larry. We are now starting the regular city council meeting. And could we please have the roll call?'",
        "'speaker_0': 'Madam, quick.'",
        "'speaker_1': 'Roll call has been noted. Five present.'",
        "'speaker_0': 'Thank you. Do we have any agenda changes? Hearing. And then we're going to move to proclamations and special orders of the day. Well, there are two proclamations that are entered into the record. They won't be presented today because when we do our remote meetings, we try to condense things a little bit.'",
        "'speaker_0': 'And that is a proclamation declaring the month of June 2020 as Lesbian, Gay, Bisexual, Transgender and Queer Pride Month, and also a proclamation declaring the month of June 2020 as Elder Abuse Awareness Month. And there is, however, one exception I'm making, and we are presenting a proclamation on behalf of someone that I think everyone on this council'"
    ],
    "Amendment to the Community Development Block Grant Action Plan.": [
        "'speaker_0': 'All right. And this item is. Being presented by, I think. Is it misfits, Miss Potter together? Yes. So this is going to be and if Mr. Potter is going to start off at the presentation this evening. Thank you.'",
        "'speaker_0': 'Hands over to her. And and as she's coming up on camera, I hope I want to say that earlier this week. Now, maybe it was last week, man. I can't remember. It's only Tuesday. I sat in on the meeting, a monthly meeting of our Social Service Human Relations Board and got to hear Misfit's awesome presentation.'",
        "'speaker_0': 'So this is sort of like dja vu all over, over again to me, but it was I commend our Social Service, Human Relations Board and and misfits for Alda and Miss Potter for the awesome work they're doing as a very important topic of our day.'",
        "'speaker_0': 'So. Ladies, please. The floor is yours. Thank you, Madam Mayor. Members of the city council and staff families are fed up with the Housing Authority. And tonight I'm going to talk about the three programs that are proposed to help provide food and shelter to our needs most impacted by COVID 19.'",
        "'speaker_0': 'As you know, the city of Alameda receives community development block grant or CDBG funds from the United States Department of Housing and Urban Development, also known as HUD, and on April 2nd had announced that the city of Alameda would receive an allocation of $683,116 of CDBG funds from the Coronavirus Aid, Relief and Economic Security Act, also known'",
        "'speaker_0': 'as the CARES Act. South proposes to amend the current action plan to accept and allocate 100% of the CARES Act funds to public services that provide food and shelter to individuals and families who are vulnerable and in crisis as a result of the coronavirus.'",
        "'speaker_0': 'Specifically, we are proposing three programs. Emergency food distribution administered by the Army Food Bank in the amount of $50,000 COVID 19 emergency rent relief administered by building futures in the amount of $583,116 and emergency shelter administered by the Family Violence Law Center in the amount of $50,000.'",
        "'speaker_0': 'Please note that in two weeks I will be back to present the five year consolidated plan to you. At that time, we will recommend an additional $130,000 of CDBG funds from the upcoming fiscal year to be allocated to emergency rent relief as well.'",
        "'speaker_0': 'So at this time, staff has begun coordinating with city staff to ensure that the CDBG and we need a strong emergency rent relief program. Descriptions, messaging and advertising are consistent and that applicants will be directed to a single website to apply.'",
        "'speaker_0': 'While the proposed program administrator was evaluated for qualifications and capacity, staff recommends that Council authorize the city manager to enter into a second agreement in the event that demand is overwhelming and with the explicit purpose of getting funds to those who need them expeditiously after complying with CDC requirements.'",
        "'speaker_0': 'Pending council approval tonight, we will begin the work of engaging the service providers so that the programs can be launched as soon as possible. In summary, the recommendation before you this evening is to amend the current fiscal year 1920 action plan by adding the three proposed programs and authorize the city manager to negotiate and execute related documents'",
        "'speaker_0': '. In addition and in the interest of deploying resources as expeditiously as possible. Staff would also like to ask Council to authorize staff to appropriate funds in the current fiscal current 1920 fiscal year so that we can incur costs in the month of June and before the start of the next fiscal year.'",
        "'speaker_0': 'And that concludes that presentation. Thank you. I would like to just have money. Yes, please. We have our three proposed providers here this evening and they are all here. And the clerk method man, if there are questions of council members or the for our proposed providers.'",
        "'speaker_0': 'Okay. Thank you. And those would be the Building Futures and the Family Violence Law Center current. And the food bank. And the food bank. Yes. Okay. Okay. Any questions? That's our assistant city attorney, Lisa maxwell. Okay. Councilmember, I mean, Vice Mayor Knox has his hand up.'",
        "'speaker_2': 'I answer to both. Thank you.'",
        "'speaker_0': 'Good.'",
        "'speaker_2': 'Just just a quick question. In the in the determining if somebody meets the average minimum income for the housing grants. Is the what what is it? One assumes that in applying for this, they've already had an impact to their salary.'",
        "'speaker_2': 'But it's not clear whether the salary that's being used to determine whether they are above or under the hammer is from pre-COVID or after the impacts of COVID. Can we clarify what our intent is there? I just we're that we're clear.'",
        "'speaker_2': 'We're clear that you have to be up to date on your rent before March 1st. The question is, is your salary before March 1st also the I am I determined nurse post. You know that the. Sorry. You understand what I'm asking?'",
        "'speaker_0': 'Hopefully. Yes. For CDBG purposes. The income would be at the time of receiving the benefit. So it would be post-COVID. We would be looking at there pre-COVID to verify that there is a significant change or a substantial loss of income.'",
        "'speaker_2': 'Okay. Thank you very much.'",
        "'speaker_0': 'And I had a question, see if I can find it. So explain or maybe Miss Potter. So I, I heard you mentioned the community fund that we're starting, as is Alameda Strong. So how does how do these city city TB funds work with the funds that are being raised and allocated to the Alameda Strong Community Fund for'",
        "'speaker_0': 'Rent Relief. It is for anyone listening. We have a certain amount of monthly rent, one month's rent up to, I want to say 30 $500 that a person could be eligible for that rent money if they're shown to qualify as paid directly to the landlord.'",
        "'speaker_0': 'So this is also helping landlords, especially some of our smaller mom and pop landlords. But how does people just explain how are these parallel programs are all one or how does it work? Sure. I had a good conversation with both Louis Butler and Eric Thompson today, and the thinking is that rather than advertising two separate programs, let's'",
        "'speaker_0': 'have consistent messaging for a single program, have a single portal, have a single application, and then on the back end the processing. So for applicants who wouldn't necessarily qualify under the CDBG program, because the guidelines are a little bit stricter because they'd basically be referred to or paid by the Alameda Strong program, that ultimately for the applicant'",
        "'speaker_0': ', it's hopefully going to be seamless. So because the end goal is to make sure that the tenant gets arrested. Right. And but there wouldn't be there wouldn't be duplication. So you would get your one month of rent relief from either of the two sources.'",
        "'speaker_0': 'Exactly. And that was another motivation. Okay. That's good to know. And then if I think people probably saw this in the in the they sent the staff report, but this is something that came up at the Shrub, the Social Service Human Relations Board meeting last week.'",
        "'speaker_0': 'That and I think it might have been reported here in this forum before, but in the month of April, because I don't think we've seen the police department's statistics for the month of May yet, but for the month of April 2020, the number of domestic violence calls that the police department received had increased 41.5% over April of'",
        "'speaker_0': '2019. So April a year ago. And it is upsetting when you read in the in the the staff report that due to the shelter in place order and Judicial Council's order to release offenders from jail, sometimes someone who has been arrested for domestic violence is taken, booked and sent back to the same residence in the same night'",
        "'speaker_0': '. So that's where this emergency shelter program is so important because it provides funding for that battered spouse or partner or whomever to find a safe place to stay. So it's important program. Any said thank you very much great staff report and thank you for the input to Ms..'",
        "'speaker_0': 'Potter. Any further questions I should ask? Sorry. Ms.. Quick. Do we have any public speakers?'",
        "'speaker_1': 'So we just need to ask anybody participating on the zoom if they would like to speak on this community development block grant hearing to please raise their hand right now. And we have nobody raising their hand. So we're good and we don't have any other comment to read into the record.'",
        "'speaker_0': 'Okay. So with that, do I have a motion to approve this proposed amendment to fiscal year 2019 2020 CDBG Action Plan and authorize city manager to negotiate and execute related documents, agreements and modifications to implement the program described above.'",
        "'speaker_0': 'And I would also like to make sure the in the motion includes our request that the Council also appropriate these funds for the fiscal 1922 years so we can start spending money this month. Okay. All right. So do I have a motion to cover that?'",
        "'speaker_0': 'Is that you, Councilmember Odie?'",
        "'speaker_2': 'Yes, Madam Mayor. I will make that motion and just quickly comment. I appreciate your your words about the family violence center. I know you've been outspoken on this issue. And Councilmember Bell and I had a town hall on this issue.'",
        "'speaker_2': 'And I think it's one of the silent issues that people are facing in this crisis. So I'm glad that we're doing something about it. So I'll move approval of the item with the appropriation of the money in fiscal year 1920.'",
        "'speaker_2': 'I get that right, Miss Potter.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': '19 Dash 2019 Dash 20.'",
        "'speaker_0': 'Yet we're not retroactive. Sorry, it's getting late here. Vice Mayor Knox. Right.'",
        "'speaker_2': 'Seconds.'",
        "'speaker_0': 'Right. Any discussion? Hearing, then may we have a roll call vote with council members?'",
        "'speaker_1': 'Decide this next fight.'",
        "'speaker_2': 'With great appreciation for misfits in our Social Service Human Relations Board.'",
        "'speaker_1': 'I Odie.'",
        "'speaker_2': 'I of course.'",
        "'speaker_1': 'And I believe council members Vella is having a problem with her iPad, so she I think, is not able to vote at the present moment. So we. Well, I guess she's absent so. And then Mayor, as the Ashcraft.'",
        "'speaker_0': 'Say again, if I could cast her vote, I know she'd be right on board with me. But yes, thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. So that motion passes with four, four councilmembers present and one missing. Okay. All right. I'm sorry about that. Do we see anything we can do to assist? Anyway, thank you very much. Misfits and Miss Potter and Miss Maxwell.'",
        "'speaker_0': 'Thank you. Good work. There she is. Uh, Councilmember Vela, do you want to. You want to hear it's not too late for a roll call? You want to be on record? Yes. Yes, I was listening. I just was on a different device.'"
    ],
    "Charter Amendment Direction for Article 26 (Measure A).": [
        "'speaker_0': 'Sorry. And we were doing a roll call vote. Would you like to vote? I yes. It's unanimous. Right. Thank you, everybody. Thank you. I love I love a happy ending. Okay. With that, we move on to item six B.'",
        "'speaker_1': 'Recommendation to consider providing direction to city staff to draft charter amendment related to Article 26. Measure A.'",
        "'speaker_0': 'So on this one council, I would like you to consider a vote. So Councilmember Odie and I are authored with able assistance from Andrew Thomas, who's just joined us there on the screen. We authored this staff report, which I would like to present with Councilmember Otis assistance and input from Mr. Thomas.'",
        "'speaker_0': 'But as currently configured, the Council rules, which Council member Goldie and I drafted. But we're going to amend because we didn't anticipate this situation when we're actually presenting a staff report. It still counts against our allocated 9 minutes.'",
        "'speaker_0': 'Vice-Chair Next, may.'",
        "'speaker_2': 'I move that we do not count the minutes of the presentation as a part of the 9 minutes to the council.'",
        "'speaker_0': 'Thank you. We have a motion to have a second. Looks like Councilmember Desai seconded me. We have a role covered. Any discussions? Keep this moving on. Okay. Um. Any discussion? Okay, maybe we have a real cover, please.'",
        "'speaker_1': 'Council members de sang.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Hi, Bella.'",
        "'speaker_1': 'I mayor as the Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'That carries by five eyes.'",
        "'speaker_0': 'Thank you. All right. Thank you. And I'm I'm still going to try to keep this moving along, because I do I am aware of the hour because we've had a lot of important items to discuss. And this item is no less crucial than everything we've discussed tonight.'",
        "'speaker_0': 'But I'll I'll try to just be my, you know, put my neutral hat on to discuss this. But first of all, I want to thank Councilmember Odie. Um, we always enjoy working together and I think we came up with a pretty good end product and.'",
        "'speaker_0': 'I also want to thank the others in the community who gave us their input to help us come to the conclusion that you see in the staff report before you. And one of the things I said on a call, I think, with the representatives of the Citizens Task Force, Mr. Paul Foreman and Alameda Architectural Preservation Society, Mr.'",
        "'speaker_0': 'Chris Buckley, we had a nice zoom call with Andrew Thomas and Councilman Brody and myself. The two gentlemen is that I find that it is more beneficial to talk with people who don't think like me, and we can all sit around and have a great conversation and reinforce the beliefs that we already hold.'",
        "'speaker_0': 'And there's there's a there's a place for that. But when it comes to items that can be controversial, that can be viewed a lot of different ways, it really makes a lot of sense to reach out and hear from people on the other side.'",
        "'speaker_0': 'Andrew Thomas Our planning building and transportation director has a longstanding history, probably as long as he's worked in the city working on Measure A or housing related issues, housing and zoning related issues. I first work with them on the planning board many years ago and but we also reached out to a longstanding housing champion and and one'",
        "'speaker_0': 'of her colleagues for a Thomas and Mr. Doyle Saylor to get their perspective and it just think it informed it informed this this staff report. So as you know there is in our city charter a measure that came to be known as Measure eight, because that was its title back in 1973 as a ballot measure.'",
        "'speaker_0': 'And there's two parts to item two, to measure A in the in the charter, there's Article 26 and specifically Article 26, one says. And almost precisely that there should be no multi-family housing anywhere in the city of Alameda.'",
        "'speaker_0': 'And then there is 20 6-3 that goes into a little more detail about what density level would be would be allowed the amount of square feet per unit. And this this is another consideration. So the these are among the charter amendments that a subcommittee came forward and said perhaps the council should take a look at this.'",
        "'speaker_0': 'So at a recent council meeting, Councilmember Odie and I were tasked with with being this subcommittee. And after many hours of discussion, deliberation, talking with Andrew Thomas, with our city attorney, Mr. Shen, and some drafts and re drafts, we came up with the staff report before you and the recommendation that you see.'",
        "'speaker_0': 'But I want to pause here and ask my colleague and coauthor Councilmember Odie to to share your thoughts or share your presentation about.'",
        "'speaker_2': 'The housing crisis. Because I was going to talk about something complimentary if you wanted to talk about the housing crisis.'",
        "'speaker_0': 'So I will be happy to talk briefly about the housing crisis. Do you want to go first with your issue or.'",
        "'speaker_2': 'I can let you.'",
        "'speaker_0': 'Tend to get tired of hearing my voice. Okay. So, um. Housing is a crisis. We have a housing crisis throughout our state. In the Bay Area Council, Vella and I sit on a statewide policy task force for the League of California Cities.'",
        "'speaker_0': 'In fact, we have a meeting this, this Friday and man, you should see the agenda. Councilmember Vella Well, I think you got it today. Lots of even though the legislature is streamlining the legislation, it's going to consider this term because of the COVID crisis.'",
        "'speaker_0': 'Housing is considered such a priority and such a crisis that we have a number of housing related bills that are being considered by the legislature this term. So we know that the reason we have a housing crisis that extends from people having to commute long distances to go to work to on the other end of the spectrum'",
        "'speaker_0': ', being homeless, unsheltered, living under a freeway overpass in the bushes, even in California, the fifth largest economy in the world. It's it is a matter of supply and demand. And so this is now 20, 20, 47 years after Measure A was enacted by the voters in 1973, where there was a very different landscape and and different considerations'",
        "'speaker_0': 'and perhaps different values than we have today. So not only do this housing touch on so many different aspects, it it also has to do with our climate action plan. If people are having to commute from farther distances to and, you know, just generating more more fossil using more fossil fuel fuels and generating more greenhouse gases.'",
        "'speaker_0': 'But so there is there is definitely a housing crisis in our state. We say that the most effective way to address homelessness is not to let it begin in the first place. This council, I'm proud to say, has been very progressive in legislation we've enacted to protect renters, to keep people in their homes.'",
        "'speaker_0': 'We've I think we've done a fine job, but all of that is a drop in the bucket compared to the root cause of the problem, which is an imbalance in supply and demand. And so this is something that Measure A is attempting to address that, that the modifications that we're proposing are attempting to address.'",
        "'speaker_0': 'And now, Councilmember Ody, I'm going to turn the floor over to you.'",
        "'speaker_2': 'Thank you, Madam Mayor. And I appreciate you sharing that lens on on this. And I just want to say that a lot of the legwork was done well by Andrew Thomas, but also our colleagues, the vice mayor and Mr. Nieto, as they had put this on the list of potential items and basically quickly to the genesis and'",
        "'speaker_2': 'I'll talk on the other lens, but I quickly honed in on the the bifurcation because one of the concerns I had was that modifying. 26, dash three or reappearing 26, dash three without people being able to weigh in on what the replacement would look like.'",
        "'speaker_2': 'I don't think people had enough time to do that. And this bifurcated process, I think, gives us that time. I we did kind of mull around some amendments, but in order to make everybody happy and keep things simple and then not have it weighed down, I think we came to the conclusion to defer that discussion until the'",
        "'speaker_2': 'community planning session. So we we honed in on the repeal of 2631 and I believe 2632 is kind of kind of with that. But I want to just, you know, share a different lens. And I'm going to tell a couple of stories real briefly on this book that I was made aware of, the color of law, Richard'",
        "'speaker_2': 'Rothstein, her story, it talks about a builder in 1955 that wanted to build a affordable housing development for Ford workers down in the South Bay. And then when his intent to sell to both black and white people became known, the Santa Clara County Board of Supervisors rezone the site from residential to industrial.'",
        "'speaker_2': 'So then he went to Mountain View and found a second plot. Well, those officials said they would never grant him the necessary approvals. Then he found another a third spot near the Ford plant. And then when that is where local officials found that the the development would not be segregated, they adopted a new zoning law, increasing the'",
        "'speaker_2': 'minimum lot size from 6000 to 8000 square feet, making the project basically unfeasible for working class buyers. And then when he found a fourth site, the seller canceled the option upon learning that the project would be integrated. And then at that point, he gave up.'",
        "'speaker_2': 'So continuing on, there's another story similar in the South Bay. You know, I didn't know this. Apparently there was a trader mobile factory that relocated from Berkeley down to Milpitas. And then right after they did that, the plant manager announced a change in hiring policy that the company would accept only new workers who live in the vicinity'",
        "'speaker_2': '. And they were, because of reasons like I just went through, were almost exclusively white. And his rationale was black workers attempting to commute from the Oakland area were too likely to have car accidents from their long drives, leading to excessive absenteeism.'",
        "'speaker_2': 'So when that policy was put into place, the African-American workforce dropped from 6% to 6%. So the moral of the story and I'll just quote this because somebody else said something I can I'd rather just read what they say and then try to make it up.'",
        "'speaker_2': 'The Makita story illustrates the extraordinary creativity that government officials at all levels displayed when they were motivated to prevent the movement of African-Americans into white neighborhoods. It wasn't only the large scale federal programs of public housing and mortgage finance that created de jure segregation.'",
        "'speaker_2': 'Hundreds, if not thousands, of smaller acts of government contributed. Taken in isolation, we can easily dismiss such devices as aberrations. But when we consider them as a whole, we can see that they were part of a national system by which state and local government supplanted federal efforts to maintain the status of African-Americans as a lower caste with'",
        "'speaker_2': 'housing segregation, preserving the badges and incidents of slavery. So I think the lens I want to look at this through is we're all talking about institutional racism now. I was not here in 1973. I cannot judge the folks that put this on the ballot that voted for it.'",
        "'speaker_2': 'And I won't I can't say that they were racist. I can't even say they have racist intent and I never would. I know for a fact that those that support continuing measure A and don't want any changes in my mind in my conversation with them.'",
        "'speaker_2': 'I don't think they're racist either. But we can't ignore the result of this policy and hundreds of other policies like this that basically created this system of structural racism. And if we're going to start chipping away at it, which I think we need to do more than chip away at it, we need to just blow it up'",
        "'speaker_2': '. I think this is this is one of the things we can do. This is a start. So I hope that we can look at these potential changes to measure a from the lens of what we can do as a city council, what we can do as a community to start dismantling the systematic, the systemic racism that has'",
        "'speaker_2': 'been built into, whether it be our zoning codes or any other codes or our housing policy. And so that that was the lens I wanted to add. So I think between the mayor's lens and this lens and the hard work of Andrew Thomas, those in the community and Vice Mayor Knox White and Councilmember de Saag, I think'",
        "'speaker_2': 'we are ready to take the next step in in doing so. And I think the mayor, we're working with her and I always enjoyed doing some thank you.'",
        "'speaker_0': 'And as Councilmember O'Day and I said today, we had a quick phone call this afternoon that, you know, we could never have and. Dissipated. And I wish this weren't the backdrop, but the tragic events that unfolded in Minneapolis.'",
        "'speaker_0': 'But I am always inspired by the words of our former president Barack Obama. And I know I quoted from his his statement after the killing of George Floyd in Minneapolis, when he said that it falls on all of us, regardless of our race or station, to work together to create a new normal in which the legacy of'",
        "'speaker_0': 'bigotry and unequal treatment no longer affects, no longer infects our institutions or our hearts. And so I concur with my colleague, Councilmember Ody, that we're not attempting to assign bigoted motives to a previous electorate. But the the impact and outcome of that vote meant that nowhere in the city of Alameda could you build multi-family housing.'",
        "'speaker_0': 'And it still is a law on the books today. We will hear discussion, I'm sure, about the different work arounds, like the density bonus ordinance, but that also means that at the end of the day, the percentage of affordable housing that we require, a minimum of 15%, up to 25% at Alameda Point is reduced by by market'",
        "'speaker_0': 'rate housing because that's the bonus state law requires us to give to developers who build at a higher level of density because they can choose to follow the state law. So this, I think, is a time when each one of us needs to say, does this law have a place in 2020 in Alameda, California, that that is'",
        "'speaker_0': 'just as simple and basic a question that we are asking and saying needs to be answered. And as Councilmember Odie also alluded to, we do feel that there is a time and a place coming up in the next 18 months or so for a full and robust community process to look at what that looks like going forward'",
        "'speaker_0': 'with density greater than a duplex, which is currently all that's allowed. But now I think I would like to just ask Andrew Thomas, because he has been he is such an encyclopedia of knowledge, but also this conviction he has he has viewed this landscape through his very professional planning lens for decades.'",
        "'speaker_0': 'And Mr. Thomas, can you just give us your your view of of this item before us tonight? And thank you again for your help.'",
        "'speaker_2': 'Can you hear me?'",
        "'speaker_0': 'We sure can.'",
        "'speaker_2': 'Okay. Okay. Thank you. Thank you. Mayor Ashcraft and Councilman Brody and members of the council. I obviously staff fully supports this committee's recommendation. We think it is time for the voters of Alameda to to really be given the opportunity to answer this question.'",
        "'speaker_2': 'I mean, do you want your city charter to essentially say, we do not want to build any multi-family housing for people who might who cannot afford to live in single family housing? I mean, it is essentially saying if you can't afford multifamily housing, we don't want you in our community.'",
        "'speaker_2': 'And like you said, Mayor, we've found many ways to sort of skirt around it. Big projects through state density bonus can find ways around it. It's really the the Alameda property owner, the smaller property owners in Alameda who just because of the way the state law is structured, don't get that benefit.'",
        "'speaker_2': 'So from just given your the council's affordable housing goals, given your climate action goals, given your transportation goals, our analysis found that this statement in your charter saying there shall be no multi-family housing runs completely contrary to everything that you and the community is trying to accomplish.'",
        "'speaker_2': 'As you look forward and as you said, this is not about was a good idea in 1973. It's about is it a good idea in 2020, given the challenges that we're facing in 2020 and the challenges that Alameda is going to need to address going forward?'",
        "'speaker_2': 'So I'm available to answer any questions. I think this is a issue that has been discussed during my eight years here in Alameda. This issue gets discussed by at the planning board and with every single housing project that comes through the system.'",
        "'speaker_2': 'So I think there's been quite a lot of conversation on the planning boards over the years. Even the planning board that you were on Maryland years ago spent a lot of time and effort talking about this issue and debating what this community should do to try to address it.'",
        "'speaker_2': 'So I think from staff perspective, we think it's not too soon. We think, you know, we wish we had been doing this ten years ago, but, you know, it's never too late to try to fix a problem. So better now than ever.'",
        "'speaker_2': 'So we fully support this. The the subcommittee's recommendation. We're here to answer any questions.'",
        "'speaker_0': 'Thank you, Mr. Thomas and Councilor Brody. Yeah. Good.'",
        "'speaker_2': 'Mr. Thomas? Yes. Could you please describe what, at least for all of us, because, you know, we all don't know this stuff like you do. As the mayor said, the practical impacts for A, affordable housing and B, other other neighborhoods of repealing 26, that's one.'",
        "'speaker_2': 'Yes. And 20 6-1 is in your city charter. So that's the issue tonight. 20 6-1 the multifamily prohibition is also now embedded throughout the city zoning ordinance. So if you put this on the ballot to repeal this from your charter and if the Alameda voters agree to remove it from the city charter, then nothing, nothing changes from'",
        "'speaker_2': 'a practical perspective until this planning board and the city council start taking actions to amend the zoning code where necessary and in the locations appropriate to allow multifamily housing. From a practical perspective, what is happening today because of state density bonus?'",
        "'speaker_2': 'If you have a large piece of property in Alameda, you can use state law to get around, measure a through a waiver, and then you get a density bonus. And those are all the issues. And that's the way that big developers in Alameda are able to build multi-family housing, where if you have a parcel of 10,000 square'",
        "'speaker_2': 'feet or less in Alameda and you might be in a multifamily zoning district, you might be an Alameda property owner with a parcel that's 6000 square feet, 7000 square feet, fairly large. You could be a 5000 square foot lot.'",
        "'speaker_2': 'And if you want to do anything larger than a duplex, you can't do that in Alameda today. You and there's no way around it. The only way around it is to go to the voters for your project. So I think in a practical sense, the kinds of things that we would want to start looking at as a'",
        "'speaker_2': 'community if the voters choose to remove this from the from the charter, this statement about multi-family housing being prohibited, well, we would start doing is looking in our looking in our multifamily zoning districts, looking in those areas and allowing people who might have, let's say, a large Victorian as a senior citizen who's whose family has moved on'",
        "'speaker_2': '. We see this a lot, elderly Alameda who don't want to leave Alameda. They want to stay in their home and they would like to be able to create a second or third unit within their building so that they can create a unit that they can rent out.'",
        "'speaker_2': 'And those would be the kinds of zoning amendments that I could see us recommending to the Planning Board for consideration by the City Council. I think the other thing that we're going to see is we're going to see fewer density bonus projects going forward today in Alameda.'",
        "'speaker_2': 'If you if you are a buyer of a of a relatively large piece of property, over 10,000 square feet, and you want to develop housing on it. And it's on a site that we want housing developed wherever the city has said we want residential housing in these areas like the northern waterfront.'",
        "'speaker_2': 'Now, I made a point. You you are required. The only way to do multifamily housing today is to use the state density bonus process. So essentially every major project in Alameda up to this date has used the density bonus process as a way to get around the multifamily prohibition.'",
        "'speaker_2': 'So as a result, we've seen every single project get additional market rate units and the actual percentage of affordable units in the project go down as a result. So I think Measure eight has had this strange effect in Alameda over the last ten years where in an effort to get around the multifamily prohibition, developers are invoking state'",
        "'speaker_2': 'density bonus so that they can get the waiver from the multifamily prohibition. And then just by default, their projects are getting 20% larger because that comes with the density bonus process. So I think two things will happen. In summary, I think we'll start discussing zoning amendments for areas of Alameda where in the multifamily zoning districts and the'",
        "'speaker_2': 'mixed use districts, Park Street, Webster Street, where we might want to allow multi-family housing, where we currently prohibit it within the current density standards. And I think we will see a net just without doing anything. We'll start seeing fewer waiver density, bonus waiver requests.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'It's also finally in the last thing I'll say is it's going to make a big difference in terms of our every eight years we have to work with the state of California to certify our housing element. For 20 years, we were unable to get a housing element certified because of Missouri in 2012, after a rather Herculean effort'",
        "'speaker_2': 'by the Planning Board and City Council, we got our first housing element certified in 2012 and it was really trying to get the state to understand that we had ways to get around. Measure Hey, this is going to put sort of get Alameda out of the state doghouse in terms of housing policy and then the state legislature'",
        "'speaker_2': 'is moving further and further in that direction. Now they've just a new set of guidelines. If you are asking for state grant money, you get extra points if you are a pro housing city. And what that means is you don't have discriminatory or restrictive housing policies.'",
        "'speaker_2': 'You know, it's that's hard for us to do with Measure eight on the books to explain that. So I think it's I think it's going to help the city in the long run, not only meet our local requirements and our local goals, but also compete effectively for state funds, for affordable housing, for open space, for transportation money'",
        "'speaker_0': '. Thank you, Mr. Thomson. I was smiling when you were talking about getting extra grant money or the ability to get extra grant money, because it's one of the propositions that this committee that Councilmember Vela and I sit on, I'm actually the vice chair.'",
        "'speaker_0': 'We have long said to housing, to the legislators, don't give us some of these sticks. Give us some carrots if we're those communities trying to do the the right thing. I mean, I get that you're going to penalize those who don't.'",
        "'speaker_0': 'But anyway, we're getting a little far afield. So what we want to do right now is take any clarifying questions council has for Mr. Thomas or Mr. Odie and myself. And then I think we have some public speakers.'",
        "'speaker_0': 'So before we get to our public speakers, any clarifying questions? Council to move to our Councilmember Vela. How much time is needed for the Environmental Impact Review? Mr. Thomas.'",
        "'speaker_2': 'Do you know where the Environmental Impact Review would be required when you do your zoning amendments? That's the zoning amendments that change what you can do on individual pieces of property. So. And because the zoning is already in place that enforces measure A, the removal of Measure A from the charter does not change the environmental conditions.'",
        "'speaker_2': 'So as I said earlier, if the voters remove measure from the charter, it doesn't change anything in terms of what anybody can do on the property. The action that changes things that people can do will be the subsequent zoning amendments.'",
        "'speaker_2': 'And it's not like we're going to all of a sudden say multi-family housing is going to be allowed everywhere in the entire city. We will pick and choose the appropriate places. And it will be that those places and the proposal to allow multifamily in those zones such as Park Street and Webster Street and Alameda Point, that's what'",
        "'speaker_2': 'will be studied in the environmental review. A typical environmental review for something like that is 6 to 9 months.'",
        "'speaker_0': 'Thank you. Any further clarifying questions? So let's see. And then, um, uh. Let's see. Anybody any other councilmembers wanted to have any? I think they wanted to ask. Okay. Um. Madam Clerk, do we have some public speakers?'",
        "'speaker_1': 'I. Yes, we do. I have 15 comments to read into the record. And then if anybody who is on the zoom would like to make a public comment, if they could raise their hand now. It looks like we only have three on the zoom who would like to comment.'",
        "'speaker_1': 'So we will call those first and everybody. Since there's a total of 18, they'll get 2 minutes each. So it's over seven.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So public speakers.'",
        "'speaker_1': 'Oh, okay. So the first public speaker I'm sorry, I've got the name here. Um, is Grover Wyman Brown.'",
        "'speaker_0': 'Right. Hello, Mr. Women. Hi, women. Hi. Hi. Thanks for having me. Um, I'm a resident of Alameda and also the communications manager at East Bay Housing Organizations. And we're asking you to place of full repeal of Article 26 on the November ballot.'",
        "'speaker_0': 'Um, Councilmember Ody, you referenced talking to residents and not, and not believing that people who are opposed to this amendment have a racist bone in their body. But I just want to highlight Ibrahim Kendi's book and point that how you measure something as racist as if the policies or process has a racist impact.'",
        "'speaker_0': 'And we believe that Article 26 and the ban on multifamily housing does. I submitted an email to each of you going into greater detail about the history of that and the way in which anti-black racism was part of what was happening all across the nation to pull out our social safety.'",
        "'speaker_2': 'Nets from our.'",
        "'speaker_0': 'Communities. But in particular, we just want to look that up that this policy is important in creating racial equity and economic equity in our community. And also.'",
        "'speaker_2': 'That, as.'",
        "'speaker_0': 'Andrew was referencing, al-Qaeda is very behind in building very low and low income housing relative to its own rent allocation. And so we ask that you put this on the ballot so the voters can do the right thing.'",
        "'speaker_0': 'Thank you. Thank you. The next speaker, David Burton. Okay. Various. Welcome back, Mr. Burton.'",
        "'speaker_2': 'Thank you, sir. Good evening, Mr. Mayor. Ashcraft and members of the Council. My name is David Burt, now meter resident, 60,001. For seven years I served on the Alameda Planning Board through my planning board experience and being an architect involved in numerous projects in the city.'",
        "'speaker_2': 'I'm very familiar with Article 26 and its impact on residential development. I'm here to urge you to place on the file ballot amendments striking 20 6-1 and 20 6-3 from the charter. Be bold, simple and clear. There are three least three reasons for taking these actions.'",
        "'speaker_2': 'Number one, it's inappropriate to codify in a city charter something most appropriately placed in the zoning ordinance. Issues around residential densities grow and change as the city does. Cementing zoning in this charter was wrongheaded. Number two, Alameda in the state of california in the midst of a housing crisis that was decades in the making.'",
        "'speaker_2': 'Alameda must be part of the solution to this crisis. One of the most effective ways for our community to do this is to strike both articles from the charter and restore the city to the city and ability to adapt to changing times and circumstances with innovative and responsive zoning.'",
        "'speaker_2': 'Number three, our nation is in the midst of a tremendous turmoil, specifically around the issues of state violence against black citizens. This is part and parcel of a centuries long campaign of enslavement, intimidation and violence by the white community.'",
        "'speaker_2': 'Alameda has its own shameful history around this subject, including excluding black citizens from living in and owning property in our city through redlining covenants and city laws such as Article 26. Many of the present day supporters of Article 26 don't want to talk about how it is in part, an attempt to keep blacks and other nonwhite citizens'",
        "'speaker_2': 'from moving to Alameda. This is a terrible stain on our city's history. We must take this chance to strike out from the charter. These articles and ensure that we are a community where everyone belongs. Those opposing any change will claim that we can't proceed without extensive public engagement.'",
        "'speaker_2': 'I have been engaged in public discussions about this since 2007 13 years, and the discussion has been going on for many more years than that. Enough is enough. Amending the charter.'",
        "'speaker_1': 'That's your time. Your time has expired.'",
        "'speaker_0': 'Thank you, Mr. Burton. And our next speaker.'",
        "'speaker_1': 'Chris Buckley.'",
        "'speaker_0': 'Mr. Beckley, welcome.'",
        "'speaker_2': 'Christopher Buckley with the Alameda Architectural Preservation Society. I'm going to go over a couple of points in the in the letter that we sent you. We agree with the subcommittee recommendation that, quote, the council discussed delaying asking voters to consider Article 26, Dash three until 2022, unquote.'",
        "'speaker_2': 'We urge the council to support this delay. The subcommittee's deferral strategy is similar to what APS has been recommending, which is that any revision of Article 26 should be part of a larger, well analyzed planning process to determine what changes, if any, are needed to the city's development rules to meet our overall goals.'",
        "'speaker_2': 'The current General Plan, Revision and upcoming housing element update appear to be good vehicles for this process. As we previously stated, we would be open to possible modification of Article 20 6-3 as part of this larger planning process.'",
        "'speaker_2': 'We would also be inclined to not oppose a repeal of Article 20 6-1 as recommended by the subcommittee as part of this planning process. Finally, it's been suggested that the general plan review process will be well along and possibly complete by the November 2020 election.'",
        "'speaker_2': 'But this observation has the process backwards. A general plan revision and housing element update needs to occur before any ballot measure in order to help define the ballot measure content. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Brickley. And so do we have more in-person speakers, so to speak, or are we going now to a written statement?'",
        "'speaker_1': 'We are moving on to written. All of the zoom have commented and so I'll be reading for a while here. The first one is Delores Keeler and Floyd Brown, who are Alameda residents in regard to Article 26 six of the City Council's June 2nd meeting agenda, we are once again requesting that the Council defer any further consideration'",
        "'speaker_1': 'of repeal or modification of Article 26 until after the restrictions related to COVID 19 are reduced sufficiently to allow for in-person attendance at City Council meeting, so to ensure full public participation as concerned homeowners and long standing members of the Alameda Preservation Society.'",
        "'speaker_1': 'We also continue to request that any consideration of changes to measure a be deferred until it can be part of the city's comprehensive planning process referred to in the subcommittee's report. Next we have. You got it. Elizabeth Tuckwell, Alameda resident Please reschedule discussion of changes to measure a so that concerned citizens can address council in person.'",
        "'speaker_1': 'Measure. Measure is among the important elements that create the homey atmosphere of Alameda. The pandemic has actually heightened the importance of Measure eight and possible revisions to it. The overall concept of population density is being reconsidered at all levels nationwide, with the emphasis on social distancing.'",
        "'speaker_1': 'With the announcement of two options by the newly formed subcommittee, including the mayor and councilman. Each option deserves the full consideration that requires imperfect sharing of ideas. Since Governor Newsom has already started to ease the shelter in place, it seems likely that city council meetings might soon again be held at City Hall with social distancing in place'",
        "'speaker_1': '. As I'm sure you know, there has been a curfew imposed in the city of Alameda from 8 p.m. to 5 a.m., June 1st and second. There has also been a curfew imposed in Alameda County for the same hours, but not ending until June 5th.'",
        "'speaker_1': 'The city of Alameda is, of course, subject to a countywide curfew. Such major disruptions as coronavirus and curfews will undoubtedly limit the breadth and depth of discussion regarding the future of measure. M The robust discussion and broad based community input that should proceed any policy action by City Council regarding Measure A will not be possible under present'",
        "'speaker_1': 'circumstances. Thank you for your consideration. Next we have Karen Lithgow from Alameda. Our Architectural Preservation Society Apse agrees with the City Council's subcommittee recommendation that the Council discuss delaying asking voters to consider Article 2063 until 2022 and urges the Council to support this delay.'",
        "'speaker_1': 'As noted in the subcommittee report, such deferral will allow the council and the community to have the benefits of having complete community citywide planning and environmental review process to inform their decisions before crafting a ballot measure to amend or repeal Article 26 statutory.'",
        "'speaker_1': 'The report also notes that the question of Article 20 6-3 is complex. The report's community wide planning and environmental review process appears to refer to the general plan revision that is currently underway and the upcoming housing element update.'",
        "'speaker_1': 'The subcommittee's deferral strategy is similar to what AARP, the U.S. has been recommending. We continue to believe that any revision of Article 26 should be part of a larger, well analyzed planning process with ample opportunities for public participation of what changes, if any, are needed to the city's development rules to meet Almeida's overall goals and objectives.'",
        "'speaker_1': 'Therefore, we would open be open to considering modification of Article 26 three as part of this larger planning process. We would also be inclined to not oppose repeal of Article 20 6-1 if a recommendation for repeal as a result of the same planning process.'",
        "'speaker_1': 'Although the Subcommittee recommends that the repeal of Article 20 6-1 be placed on the November 2020 ballot, we continue to believe that asking the voters to consider repealing Article 20 6-1 this coming November is premature pending completion of the planning process.'",
        "'speaker_1': 'Thank you for your attention to this matter. Next we have Elizabeth Green, alameda, resident madam mayor and council members. I urge you to delay an election on a charter amendment to eliminate article 26 of the city charter. Since we are in the midst of a pandemic, the likes of which we have not seen in 100 years, civil'",
        "'speaker_1': 'unrest and the most serious economic downturn since the Great Depression. Now is not the time to tinker with the city charter. Article 26 formally measures to move forward with this effort. Oops. Sorry. Lastly, please do move forward with whoever will be seen as cold blooded attempt to sneak legislation through while the public's attention is understandably distracted as'",
        "'speaker_1': 'this proposed charter amendment could affect Almeida's housing stock for a generation or more. This is too significant an issue to move forward with out considered public attention and open public discussion at city council meeting, which citizens can attend to voice their opinions.'",
        "'speaker_1': 'Next, we have Maria Perales from Alameda. All of us in Alameda are very concerned about Mayor Ashcraft and councilman, a relentless effort in removing Measure eight Articles 26 one and 2663 from the City Charter. Measure eight stands as the only control we have to control Alameda Density and congestion problems.'",
        "'speaker_1': 'But Mayor Ashcraft, who served for six years in the planning department, along with current planning director Andrew Thomas, seemed to be addicted to development tax dollars and insists on adding more housing, more completely disregarding population density and its effect on our quality of life.'",
        "'speaker_1': 'And they do absolutely nothing for infrastructure in their lofty plans to remove the constraints they feel feel by measure a they continue to ignore the old bridges and tunnel with the City Council's 2012 new housing element that approved the construction of over 4500 new units, including multiple and affordable.'",
        "'speaker_1': 'They're effectively adding close to 15,000 new people to the island without addressing the obvious. Access and egress. It is not about public transit. It is about our safety. Is about traffic congestion and density. It's not about standard state mandates.'",
        "'speaker_1': 'It's the fact that out of the 36,000 zip codes in the United States, Alameda is 944501 is ranked in the top 1000. In regards to population density, what is the limit? Mayor Alameda is an island and we don't need more people.'",
        "'speaker_1': 'We need a council that cares about our safety, about our history, about our quality of life. Preserve alameda keep measure m. Next we have pat lamborn, alameda resident Dear Mayor Ashcroft, Vice Mayor Knox White and Councilmembers Odie Vela and De Saag.'",
        "'speaker_1': 'I am writing to ask that you not take action on revising Article 26 tomorrow night, June 2nd, 2020. The issues are complex and it is just not possible to have a truly dynamic meeting at this time due to both the shelter in place orders and other issues impacting participation.'",
        "'speaker_1': 'There is multi-family development underway in Alameda and our city has a housing element certified by the state as appropriate to meet our housing needs until 2023. That's the revision of Article 26 is not time sensitive. Article 26 is a complex issue which should be submitted to a comprehensive and transparent general plan revision process with robust public participation'",
        "'speaker_1': 'rather than rushed on the ballot in November 2020. We should also consider the impact of changes to the economy. I am disturbed by the thousands of square feet of empty office space not temporarily vacant, but permanently vacant in Alameda.'",
        "'speaker_1': 'We have to find balance once again, once we can evaluate the impact of this epidemic and the economic depression. If eliminating Article 26 contribute contributed to the destruction of older multi-family housing stock. The new developments would not be subject to rent control.'",
        "'speaker_1': 'You could be making matters worse. Certainly not welcome at a time like this in our country or community. Next we have Gretchen Labonte Alameda resident Tamara as mayor ashcroft and members of the alameda city council. I wish to weigh in on the issue concerning measure eight.'",
        "'speaker_1': 'If there ever was a time to pause and exercise patience, it is now. Don't we want the public citizens to be part of the discussion we see as part of our public duty to involve the members of our community?'",
        "'speaker_1': 'Let us be prudent, thoughtful and democratic. Let us wait until the virus and the rebellion outside our door has calmed down so we can engage in civic civil discussions. This matter is too important to rush it to conclusion.'",
        "'speaker_1': 'Next we have Steve ASID East members of the City Council. It is inappropriate to ask the citizens of Alameda to consider changes to the current development guidelines without presenting them with a thorough review and public discussion of the impact and consequences these changes will have on the existing character of our town, its traffic and the city's ability'",
        "'speaker_1': 'to provide its current level of public services, emergency response, city staffing, etc.. Consideration of these changes does not have to be completed immediately. Please postpone any decisions on these matters to a time when in-person attendance at council meetings is appropriate.'",
        "'speaker_1': 'Thank you. Next, we have Laura Thomas from Renewed Hope Housing Advocates. Dear Madame Mayor and esteemed Council members, the removal of Article 26 in its entirety from our city charter is long overdue. It may have protected the city's Victorian architecture heritage, architectural heritage, but it also blocked the city from allowing a sensible, flexible and diverse housing stock'",
        "'speaker_1': 'to be built to house the many different types of people who should have been able to call Alameda home all these years for the last 20 years. Renewed hope housing advocates have spoken against this restriction and its discriminatory effect.'",
        "'speaker_1': 'Both state and federal housing agencies have agreed with us. It's another one of those seemingly colorblind local laws that instead contributes to the work of institutionalized racism in housing in our community. We believe it is time to be done with it once and for all.'",
        "'speaker_1': 'Otherwise, calling Alameda a welcoming community or a place where Black Lives Matter is a rank hypocrisy. We believe Alameda INS are ready to acknowledge this reality. Condemn the historical injustice proposed by Article 26 and will support its removal.'",
        "'speaker_1': 'Please consider putting both Article 20 6-1 and 26 statutory before the voters this November. Next we have Anna Quintal regarding measure a our fear in this rushing to do this now is to stop the citizens of Alameda to properly voice their opinions on this landmark decision.'",
        "'speaker_1': 'We don't need to rush this, but it seems that you people of the staff and city council are doing this now because of COVID 19 and now all the rioting of cities being torn apart. So no one is paying attention to staff and city council.'",
        "'speaker_1': 'Well, we are and do not want changes to this measure. It seems you all want as many tricky, tacky box buildings in Alameda as you can. This is charming town and you are all making it ugly. Have you looked at the entrance to the base?'",
        "'speaker_1': 'I guess not. How much money from developers are you all getting to create this mess with many more houses that we don't need? You seem to forget we are an island and the water table is rising, as you tell us all.'",
        "'speaker_1': 'Then why, for God's sake? Well, why do you keep building? We have enough traffic for two cities and can't get out of town in a hurry if we had to. Why is it that Andrew Thomas's wife, who works?'",
        "'speaker_1': 'I don't think we read those type of comments. I am sorry. And then how much money from developers are you all getting anyway? Also, Vela and Oti should have been gone over the city manager fiasco. Why are they still on the council?'",
        "'speaker_1': 'And I guess since you live in a Victorian you don't really care what anybody builds. Maybe could have a vision. You should all go to Mira Island and see how beautiful it is there because someone took their time to have a plan preserving the history there.'",
        "'speaker_1': 'Unlike Alameda, please do not let any changes happen to measure it and also do not allow this to be on the ballot in November 2020. Too much rush. Next, we have Patsy Becker. Good evening, Mayor and council members.'",
        "'speaker_1': 'I am asking you to delay discussion and decision on Article 26 until the election of 2022. During this time of pandemic, the voters can't engage with others in public discourse, and this is too important an issue to exclude the public input.'",
        "'speaker_1': 'The city has met our state housing element quota until 2023, so there shouldn't be a rush to make such a permanent decision now in our city charter. Thank you. Next is Bridget Evans, Alameda Resident Mayor Ashcraft and City Council.'",
        "'speaker_1': 'Please postpone an election on a charter amendment to eliminate Article 26 of the City Charter until such time as a full and robust discussion about not only the future of Measure A, but about the future of our island can be openly conducted and a complete course of action can be agreed upon by a majority of residents and'",
        "'speaker_1': 'voters. This is the wrong time to be addressing this fragment of this issue. Due to the events of the past three months, we are all riding a roller coaster, sitting here, poised at the top of the hill, holding our breaths about to plunge downward.'",
        "'speaker_1': 'While much of the future is still murky. It is clear that both housing prices and rents are about to take a drastic tumble. Many people will have mortgages that are underwater. Others will not be able to repay back rent, even with the generous six months negotiating period passed by this council.'",
        "'speaker_1': 'Jobs will not be coming back sooner fully. Many people will be forced to leave the Bay Area, and the fate of the tens of thousands of new units under construction in East Bay is uncertain. Will they be completed?'",
        "'speaker_1': 'Will they sit empty? Many of the assumptions in January's an evaluation of city charter article measure by city staff either are not or will no longer be valid. The assumption that building large multi-unit buildings such as the beautiful stark properties shown in the evaluation with the per acre equivalents San Antonio Avenue, 68 units per acre will bring'",
        "'speaker_1': '. The public transportation that we need is wishful thinking at best. How many historic houses would have to be purchased and demolish their clear heart? Redwood beams consigned to landfills in order to construct a 68 unit apartment building. How high would it be?'",
        "'speaker_1': '50 feet. 80 feet looming over the surrounding neighborhood. How long would the neighbors have to live in the construction zone? Two years after all of that. Would the units be affordable? The evaluation states that the average price of a multifamily unit in Alameda in August 2019 was 742,000 or 30% less than that.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. The next comment. Yes.'",
        "'speaker_1': 'Let me get to it here. Okay. And the next one is Zack BOLLING. I'm strongly in favor of putting on the ballot a measure to remove Article 26 from the charter on the November ballot. Article 26 of the charter is in conflict with state law and regional housing objectives.'",
        "'speaker_1': 'It creates a mess for city staff to improve our general plan and how do we zone to meet our housing and density requirements? Given that conflict, almost none of the additional protections we have currently in place to protect historic homes existed when this amendment was added in 1970 273.'",
        "'speaker_1': 'But now historic homes are protected. So I believe this charter amendment has far outlasted its usefulness in 2020. We should stop binding city staff in the planning boards so that they can adapt within reasonable limits to come up with real solutions to this housing crisis.'",
        "'speaker_1': 'All housing policy, as a rule, should only exist in the Alameda Municipal Code and never in the charter. Next, Jonas Coughlin, an Alameda resident. Madam Mayor and council members. I'm a 20 year resident of Alameda and I am a homeowner.'",
        "'speaker_1': 'I support the council moving forward with asking staff to draft ballot measures to repeal Articles 2061 and 2063. Now is the time. Now is the time because so many of our neighbors have been hit hard with economic uncertainty, and this comes on top of an unprecedented housing crisis.'",
        "'speaker_1': 'Now is the time. Because we must eliminate racial injustice, and racial injustice cannot be remedied without creating more affordable housing. Now is the time, because there has been plenty of process and we can have plenty more public participation in the coming five months.'",
        "'speaker_1': 'Now is the time because the Council is not changing the charter tonight. The Council is merely moving the conversation along and opening the door to more public participation. There is nothing more democratic than finally bringing the issue to the voters.'",
        "'speaker_1': 'And now is the time. Because in November, progressive voters will come to the polls in unprecedented numbers, ready for change and ready to seek justice. So please do the compassionate, forward thinking and just think and move us closer to eliminating the blunt instrument of Article 26.'",
        "'speaker_1': 'Our architecture and the character of our community will be preserved and enhanced by our zoning laws, our boards and commissions, and our elected officials being held accountable by voters. Finally, COVID 19 is not a reason to postpone. COVID 19 is the reason to act now.'",
        "'speaker_1': 'Thank you. And then our final speaker is Jim Strelow, Alameda resident. What if you build it and no one comes? The city's policies tend to not be business friendly removing parking, taxing businesses for public transportation, narrowing lanes that can lead to more accidents and injuries.'",
        "'speaker_1': 'Getting rid of traffic. By the magic year 2035, etc. If the jobs are in Fremont, San Jose, Mountain View, etc., the businesses are not going to move to Alameda. Move the Tesla plan to Alameda. Not going to happen.'",
        "'speaker_1': 'Move Bank of America headquarters to Alameda. Not going to happen unless you make alameda business friendly when it comes to having housing closer to where businesses are locating treasure. Measure changing measure A in the long run is not going to achieve your desired end goal.'",
        "'speaker_1': 'And that is the final one. And at this time it is also 1052. So. Oh, okay. Council wants to before moving on, get into a quick vote about whether they want to consider six B, C, D and 9aa were on six.'",
        "'speaker_1': 'I mean, so CD nine.'",
        "'speaker_0': 'Okay. So council it is it's almost 11:00. I have a very strong feeling about ending a meeting the same night we began it, but I would entertain a motion to continue this meeting until and I think it also gives this incentive to move things along.'",
        "'speaker_0': 'And who wants to make a motion to hear the remaining items in council? Really, whether you guys.'",
        "'speaker_2': 'Like to make that motion, to hear the remaining items 60, 60 and 98.'",
        "'speaker_0': 'And finish before midnight this evening.'",
        "'speaker_2': 'Let's hope so.'",
        "'speaker_0': 'Well, you'd get my support if that were the case.'",
        "'speaker_2': 'I. I will talk as little as I can. Yes. Yes. I will second that with a commitment to get us out of here by midnight.'",
        "'speaker_0': 'Okay, so we will stop at 1155. Can we do that?'",
        "'speaker_2': 'Yeah. Let's.'",
        "'speaker_0': 'Okay. Okay. So we have a motion, if I'm understanding correctly, to hear the remaining items until and get that all done by 1155. Okay. It's been moved. It's been seconded. Maybe we have a real colloquy.'",
        "'speaker_1': 'Council member doesn't know next by. I Bodi?'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Vella. I may or as the Ashcroft. I that carries by five eyes.'",
        "'speaker_0': 'Thank you. Okay. And there are no no one else is waiting in the wings to speak. And we have no further public comment. Is that correct?'",
        "'speaker_1': 'Correct.'",
        "'speaker_0': 'Okay. All right, then I am going to close public comment and we will move to council deliberation. I just want to clarify for the audience that may have gotten confused by some of the comments. What was in this the staff report and what Councilmember Odie and I are proposing is not that we change the charter to remove'",
        "'speaker_0': 'anything but that it simply be put to the voters. And so I that's that's all we're saying. That's it's not it's not even within our power as a council. This would have to go to the voters. Okay. So, um, who wants to start?'",
        "'speaker_2': 'Well, I guess I can start.'",
        "'speaker_0': 'All right. Council member Desiree.'",
        "'speaker_2': 'Well, great. Well, thank you very much. Let me begin by saying to the residents, as well as to the and to my colleagues and and city staff, that above all, let's not kid each other, measure a especially 20 6-1 and 20 6-3.'",
        "'speaker_2': 'Measure A is urban planning by sledgehammer. It's not pretty. It's not city planning by the surgeon's scalpel. But when we look into the history of things, we see why Measure A came about. And we continue to see why the necessity of something like Measure A, as ugly as it might seem, uh, is still needed.'",
        "'speaker_2': 'We all know that Measure A came about because of an explosion in housing that was planned for what ultimately turned out to be horribly ill. That was one of the key impetuses for a measure for all the residents gathering together.'",
        "'speaker_2': 'Measure also came about because of a loss of a lot of charming Victorians to, quite frankly, very ugly, ticky tack apartments. It wasn't just a loss of charming Victorians, but it was the utter destruction of those Victorians. So Measure A was that urban planning tool that was basically a sledgehammer that the residents had put together in an'",
        "'speaker_2': 'effort to take control of their own built environment. And as we think about Measure A and why it's even needed today. Let's let let's let's talk about some things. Let's talk about, for example, diversity. Even with Measure A, the city of Alameda has become an incredible, diverse place, even more so than before Measure A was put into'",
        "'speaker_2': 'place. I came here to Alameda in 1974 and it's just not a Western phenomenon. But I just know that throughout all of Alameda, we are a heck of a lot more culturally diverse, racially diverse than ever before. And I think some data really we need to talk about.'",
        "'speaker_2': 'For example, in 1970, African-Americans were 2.6% of the city of Alameda. And then Measure eight came about in 1973. Right. In 1980, African-Americans were 4.2% of Alameda. In 1990, African-Americans were 6.7% of Alameda. In 2000. African-Americans were 6.2% of Alameda.'",
        "'speaker_2': 'There was a slight drop because of the closure of the base. In 2010, African-Americans were 6.4% of the city of Alameda. And in 2020, African-Americans are estimated to be 7.1% of Alameda. So the amount of African-Americans in all this time with measures that have been in place has increased by 200% over the past 50 years.'",
        "'speaker_2': 'While the city of Alameda over that same time has grown by 10.6%. Could we have more Latino Americans? Could we have more Asian-Americans? Could we have more African-Americans in Alameda? Sure. But let's put to rest the argument that Measure A somehow has stopped the increase of racial and ethnic minorities, particularly African-Americans.'",
        "'speaker_2': 'Truth be told, we have more African-Americans in the city of Alameda as a percentage of our population. Then our neighbor across the bay is city of San Francisco, where 6% of the population is African-American. So think about that.'",
        "'speaker_2': 'Even with Measure A, we have continued to become that great diversity that we are. And I will say that even with Measure A. Remember that we're still building apartments, even with Missouri. Granted, I will be the first one to agree that in building apartments in the measure, we have to do it in a manner that reminds us'",
        "'speaker_2': 'of a pretzel. But maybe that's the trade off to building an island like Alameda. And even with misery. After 20 years as our planning director had said, the state of California finally certified our housing element. So I would argue that.'",
        "'speaker_2': 'We should focus on keeping measure a both 20 6-1 and 20 6-3. In an effort to preserve our history. And to build wisely for the future. And I want to end by saying this. It's not a simple thing of just city council tonight putting 20 6-1 or two success story to the ballot this coming November.'",
        "'speaker_2': 'It's not as simple as that because especially 420 6-1. That was an effort by the people of Alameda. They went about and took the time and made the effort and did the fight to gather the signatures to put 20 6-1 onto the ballot at the people who had subsequently voted for.'",
        "'speaker_2': 'So I would say if you want to change 26 one or if you want to change 26, that's three. Then by all means, go out and gather the signatures. But I would say it is an abuse of power.'",
        "'speaker_2': 'For the city council. To then say, well, you know what, we're not going to require the residents to go out and gather signatures to make the to do the same level of effort that that residents did back in back in the days.'",
        "'speaker_2': 'We're just going to put it on. We know we're going to undo 2061 by putting it onto the onto the ballot. Now, I would say if you want a change, 26, dash one, go gather the signatures. So let me end by saying this.'",
        "'speaker_2': 'Even with Measure eight, the city of Alameda has become a stronger, more diverse place than ever before. And the data bears that out. Even with measuring, we are right now building apartments. So there's no reason to have to undo measure a and I will grant you that Measure A is is a sledgehammer when it comes to controlling'",
        "'speaker_2': 'our built environment. I think when you're on an island like Alameda with limited ingress and egress and inadequate street infrastructure, maybe you need a sledgehammer like something like Measure eight. I appreciate all the effort that, you know, we all did.'",
        "'speaker_2': 'And I think this is a very valuable discussion that the city of Alameda has to engage in. And I know that we have and we will continue to do so in a deliberate, thoughtful manner, representing various perspectives on the measure.'",
        "'speaker_2': 'So I just want to say thank you for letting me give you my perspective. Thanks.'",
        "'speaker_0': 'Thank you, Councilmember De said Councilmember Odie.'",
        "'speaker_2': 'I'll be quick, as I said a lot earlier. I mean, it's important to not impugn anyone's motives, you know, and try to keep a cool discourse. But there's two things that kind of disturb me about the last comment.'",
        "'speaker_2': 'One, it's pretty much impossible to circulate petitions now. I mean, we've heard that from people that want to circulate them on things we agree with or don't agree with. And, you know, preserving heritage is the battle cry of the Confederate flag people.'",
        "'speaker_2': 'So let's just be careful with their rhetoric. I mean, with COVID, you remember when we had this meeting as a concern the first time because of the short notice, because of the COVID and because of the special meeting.'",
        "'speaker_2': 'So we we made an endeavor to get this on a regular agenda with a regular notice and a full staff report. And I think we've done that. One other things that I've tried to do during this crisis is try to empathize with others.'",
        "'speaker_2': 'And I think it's helped. And I appreciate the meetings with Mr. Foreman and Mr. Buckley, and I hope to continue that. And the one thing I got from them is that there's not a lot of trust. So what this proposal does is it allows this council to build that trust.'",
        "'speaker_2': 'So if we could repeal 2063 tomorrow, we still have to go through a long planning process. So why don't we go through that planning process, establish the trust, come up with something we all agree with, and then we put that to the ballot.'",
        "'speaker_2': 'And in my ideal world, everyone loves it and then it passes. I do think, though, there's still time. This is just the the the meeting to ask the staff to bring back ballot language. So we're going to have that agenda item to discuss it and then we're going to also have the election.'",
        "'speaker_2': 'So if anyone has an issue with the policy of repealing 26 one, I'd like to hear those arguments because you still have time to make those. And I appreciate Mr. Thomas's comments about I think there's a fundamental unfairness where someone lives in a Victorian that maybe they purchased after 73 and someone lives in one next door that'",
        "'speaker_2': 'before 73 they put multiple units in there and that Alameda homeowner can either live in their unit and age in place or generate more revenue or rent it out to somebody else. And like somebody said, these are new units.'",
        "'speaker_2': 'So I don't know if they will be subject to rent control. And then I think our affordable housing percentage will actually increase if we don't have 26. That's one more thing I'd like to see before the election too.'",
        "'speaker_2': 'Also, health and gender trust is that we come up with some guidelines as staff goes forward with the with the planning process. I do want to make one last comment. I mean, when I worked for the assembly and we represented Oakland in Alameda and San Leandro, we were always told by people that, you know, stop linking race'",
        "'speaker_2': 'and poverty. So while I think this had a disparate racial impact, the the intent, I think, was to reduce economic diversity. And because of institutional racism, you know, that that does kind of correlate to race. But, you know, just to say that, you know, all different people have this race or that race, you know, are all poor'",
        "'speaker_2': '. I think I think misses the whole picture. What we're missing a lot of is economic diversity. And I think we lost that with with multifamily. And I think we lost that with with the rent crisis. So I have slowly come around to this this recommendation, and I hope that we can do this in a civil and a'",
        "'speaker_2': 'open and a fair way where we can engender trust and and we don't have divisions because we have way too many divisions right now in this country. And we don't this is a path this recommendation that our subcommittee come up with is a path to minimize those divisions and work together on a common solution that we all'",
        "'speaker_2': 'can be proud of. Thank you.'",
        "'speaker_1': 'King. Yeah, I. I don't know if anybody can hear me, but. Can you just dial it in?'",
        "'speaker_0': 'Welcome to Zoom. Enter your meeting ID followed by LB. Good. I have.'",
        "'speaker_2': 'Video.'",
        "'speaker_0': 'Okay. So.'",
        "'speaker_1': 'So put on the zoo. You could hear her. So people who are attending via the zoo can can could hear you. But unfortunately, the broadcast was completely down because I, I my fingers closed when I hit the timer, I hit and Colin's dead.'",
        "'speaker_1': 'I'm so sorry.'",
        "'speaker_0': 'So can I. Can I? Of course we. Anyway, your timer.'",
        "'speaker_1': 'I hadn't started the timer.'",
        "'speaker_0': 'Yeah, sorry. Oh, I didn't even notice that. Okay. Apologies, counselor. Novella. I was taking notes if you want me to come back. No, no. In many ways, this makes my point. I just. I want to know what the plan is for.'",
        "'speaker_0': 'For asking a meaningful community engagement where we can have these conversations. We've had a number of difficulties with technology. We have a number of residents for whom the digital divide is real. Information is not getting to them. They don't know.'",
        "'speaker_0': 'Madam Mayor, they didn't know about your town hall. I know that if you're on social media and you're following the city of Alameda Web page, you probably know about that. But for many of our community members, they have no idea that we're doing these things on Zoom on these other platforms.'",
        "'speaker_0': 'I don't think that 20 6-1 is controversial. I think that there's many people across the board on both sides of the issue that don't have a problem with 20 6-1. And I think that where a lot of work needs to be done is on 20 6-3.'",
        "'speaker_0': 'And I feel very strongly that whatever we do needs to be done above board in a manner that is engaging and welcoming and in a manner that we actually can get information out to people to let them know that this conversation is happening.'",
        "'speaker_0': 'So I've heard a lot of conversation about, you know, communities of color and doing all these things. You know, a lot of the people that are not do not know about our town halls, do not know about our meetings, do not know about our special meetings, our members of our community that are people of color.'",
        "'speaker_0': 'And we are not hearing their voices, whatever those voices are, however you feel about the substance of the issue. So it's really I think it's really simple to say we're going to have a process where we do this, this and this.'",
        "'speaker_0': 'I had asked the question about the timeline. You know, I do think that the environmental impact conversation needs to come up. I want to understand what challenges, legal or otherwise, could happen if we put a ballot at either of these, whether it's one or both on.'",
        "'speaker_0': 'I think those are decisions that we need to look at. If it's a city sponsored ballot initiative and we're getting legal challenges, I'd like to understand what the cost of defending it is, what the what the legal implications are, what the analysis is.'",
        "'speaker_0': 'And I also want to understand and make sure that whatever we're putting on there is going to stand up to at least superficial challenges. And that, you know, it's something that we at least tried to get coalition support on.'",
        "'speaker_0': 'And so that's where I'm coming from. I think having any sort of conversation about charter amendments at special meetings, especially when we had an opportunity to give more notice and especially when we had a robust conversation, I thought, and that we had, you know, your own statements out in there about making sure that we had a lot'",
        "'speaker_0': 'of transparency and that we set aside we would have a conversation on this if I thought that was going to be the conversation about setting aside meetings to have these robust discussions. And so I appreciate the work of two subcommittees, which is the four of you, but I'm the I'm the one council member that really didn't get'",
        "'speaker_0': 'to take part in the subcommittee or talk to anybody else. So it's nice that you all got to do that. But I also think that there's, you know, the short turnaround from the last four from that council meeting and again, where we had majority people voting.'",
        "'speaker_0': 'And if there was any lack of clarity about that vote, I would have hoped that somebody would have come back to us and gotten clarity or, you know, if if we were going to schedule a special meeting that we we got advance notice for that.'",
        "'speaker_0': 'So I think, you know, I'm I'm also not trusting about what this process is going to look like. I'd like to know what the plan is. When are the meetings going to take place? Who's going to be involved?'",
        "'speaker_0': 'I know that we involved certain groups. We didn't. And there's lots of different groups in Alameda. How are we reaching out to everybody? How are we informing voters about the process and the decisions? The fact that there is a lack of clarity of what council is even deciding tonight, all of that concerns me and I'd like to'",
        "'speaker_0': 'know what the process is, because I think when we change our charter. It's important. And right now we're in the middle of the pandemic. Everyone keeps talking about unprecedented times. I think most Americans would be set back on their heels if all of a sudden Congress decided to start contemplating DC statehood.'",
        "'speaker_0': 'In the midst of all this, we'd say, Yeah, we've been talking about this for a long time, but is now really the time and what's the process for actually considering it? That's an extreme example, but we're talking about changing our charter.'",
        "'speaker_0': 'You know, I'm a process person and I want to talk about what that process looks like in that timeline. Thank you. Thank you. Councilmember Vela, Vice Mayor Knox White. Are you ready?'",
        "'speaker_2': 'Yeah, sure. Um, thank you. And I would like to thank the subcommittee for their work. Um, the color of light. So I have read the books that I've read. I have. I've seen a lot of excerpts of it and whatever else.'",
        "'speaker_2': 'Thank you for bringing that. Councilmember Ody. You know, tonight I was very appreciative of the comments we received. I also, like our city planner Andrew Thomas, have been engaged in this conversation for about 18 years now and have formed a lot of relationships on both sides of this issue and heard from many of those people.'",
        "'speaker_2': 'Now, the same people 18 years later, sending us emails. You know, I know that it's it's it seems we shouldn't talk about things people don't want to talk about because of COVID. But in my day job, I am I have been spending the last two and a half months helping move unsheltered people from the streets into shelter'",
        "'speaker_2': '. This pandemic is not just it's a public health thing, a public health epidemic, but it is a public health epidemic that has a housing connection. And, you know, I just I can't I can't buy in to the idea that somehow everything is going to be fine for a while and we can just kick the can down the'",
        "'speaker_2': 'road. It's quite honestly, reading a number of the the letters that we've received say it does seem to suggest that we should just wait until housing is a problem again. Then we should start working on whether there's a solution.'",
        "'speaker_2': 'We have many of us on this council have been talking about how this specific issue is an issue that needs to be addressed and fixed for for many, many years. We have an opportunity to put it before what could possibly be one of the largest city voting blocks in Alameda history in November 2020.'",
        "'speaker_2': 'And I can't see anything that would be less anything more transparent than making sure that as many people as possible get to get to weigh in on this issue. We will be choosing presidents. We will be choosing city council members.'",
        "'speaker_2': 'We will be making many, many very important decisions in these in this election. I you know, I yes, as I believe it was Councilmember Odie mentioned, you know, the recommendation from the subcommittee is one of the four options that came forward with the original proposal.'",
        "'speaker_2': 'And, you know, actually listening to to him, you know, read from The Color of law this this evening, it struck me that one of the one of the highlights was about the density and the use of density to really impact housing and who could live in certain places.'",
        "'speaker_2': 'It should not it should not pass the Senate that if we only repealed 26.1 and not 26.3, we are leaving in place the piece of the law that was actually put in place in order to tighten the screws and make it even harder to build housing in Alameda, I would think that it probably is almost more important'",
        "'speaker_2': 'for us to repeal 26.3 to impact housing in Alameda than it would be for 26.1. You know, I think that I appreciate and have thought a lot and tried to find a way to get myself to kind of, you know, wait and plan, put a plan.'",
        "'speaker_2': 'But at the end of the day, I don't think any of us so well, I won't speak for anybody else. I'm not willing to support spot zoning in our in our charter. I don't want to have the voters having to change the zoning for the island every two years and quite honestly, an 18 month planning process that'",
        "'speaker_2': 'it basically says, well, here's the plan. Now we're just going to go over and remove 26.3 because there's a plan that anybody can change at any time, isn't going to isn't going to have moved the issue forward at all.'",
        "'speaker_2': 'I think that a better planning would be to join most cities in the Bay Area, most cities in the state, and remove the zoning, these kind of the zoning sledgehammer that Councilmember de SAC highlighted from our charter and then engage in the broad public planning process that cities across the state do.'",
        "'speaker_2': 'So tonight, I would like to see our council consider putting on the ballot to a full repeal of Article 26 items one, two and three.'",
        "'speaker_0': 'Thank you. Thank you. Council member Excuse me. Vice Mayor Knox White. Um, I want to just, um. I was looking for something in the charter handbook, but as a council handbook, we're going to consider. But let me just address all of you, and I think all of you have have added value to this discussion.'",
        "'speaker_0': 'What I would like to see is for, if not five votes to move forward and do something that I think is very important and. My preference is to move forward now with removing 20 6-1 because it's hard to imagine that we cannot have agreement with the premise that an outright ban on multi-family housing anywhere in the city'",
        "'speaker_0': 'of Alameda does not belong in the charter. I don't disagree with the finer grained arguments the vice mayor is making, but I'm also mindful of the points that Councilmember Vela is making about the need for a robust discussion.'",
        "'speaker_0': 'I don't know that it needs a robust discussion anymore than has been had for almost two decades. Well, probably longer. I've been working at this for two decades, but, um, you know, ever since 1973, do we really need to have an outright ban on multi-family housing pandemic or no pandemic?'",
        "'speaker_0': 'And I'm with the vice mayor. This pandemic has only pulled aside the curtain to see just how horrendous this situation is. We were tasked by the governor with thinning out the populations of our homeless shelters, and not homeless shelters are homeless encampments, so they would not become breeding grounds for COVID 19.'",
        "'speaker_0': 'But I want to address some things that my colleagues have said and in maybe circular fashion, because I have to make notes in my margin as they went along. Councilmember Desai We, um, you know, we perceive things that are said and I swallowed hard when you referenced an abuse of power.'",
        "'speaker_0': 'I don't believe that that's what anyone on this council is attempting to do by suggesting that a law needs to be taken to the voters to simply decide. Um, but if I thought about that a little longer, I might say it's a matter of perception and one person's abuse of power might be another's dereliction of duty.'",
        "'speaker_0': 'I take my role as the mayor of this city and as the vice chair of a statewide policy committee on Housing, Community and Economic Development very seriously. And I will do everything I can to let the voters, let the residents who live here, many of whom have been seriously impacted by the housing crisis, by the availability, by'",
        "'speaker_0': 'the affordability, by slipping through the cracks and slipping into sleeping in their car and even into homelessness. So I didn't run for office to just sit in a chair and pass feel good legislation. I ran for office to make a difference and we are finding ourselves at a very pivotal time in history.'",
        "'speaker_0': 'We could look at this and seize this moment in a lot of different ways. We could say, let's just wait till this all passes and then, you know, we'll take this up again. But I don't know, is is that the response we wanted to have to the travesty that happened in Minneapolis?'",
        "'speaker_0': 'Do we not all have the power to do something? The analogy about statehood for D.C. in the midst of a pandemic, I, I don't see it that way. Every time I walk by or see people in tents, living in the shadows and families, school children living with their families out of cars.'",
        "'speaker_0': 'We we can do better people. We can do so much better. And so what? And and the assertion that was made in some of the comments and of course, everyone is welcome to make their comments. And, you know, the argument that this just isn't the time to have this discussion because people just don't have a chance to'",
        "'speaker_0': 'come out and really share their views with us. These are pretty much the same comments we've heard year after year after year. But to say that this isn't time sensitive, I beg to differ. I think it is. I believe that housing is a human right.'",
        "'speaker_0': 'And I believe that what the voters did 47 years ago was misguided, whether intentionally or not it has had an impact on our city. And so what I would ask is not to let the perfect be the enemy of the good.'",
        "'speaker_0': 'If we want to consider modifications to both 20 6-1 and 20 6-3, I would ask that we bifurcate them and I I'm a that. And of more than a few political campaigns. And I do think that you need to make the message simple and straightforward.'",
        "'speaker_0': 'But I also think that people I mean, I and I'm out and about in the community, and this is a big deal to people. And but if it's not if everyone feels that this isn't the time, let this just wait.'",
        "'speaker_0': 'They can tell us that in November. But why would we not give them the opportunity to vote on whether there should be an outright citywide ban on multi-family housing in Alameda? Why would we not give them that opportunity?'",
        "'speaker_0': 'That the rest of it the you know how it should look, where it should go. I mean, I've talked to Andrew Thomas about I, I we will get to a point where we can have at least socially distanced outside walking tours and what have you.'",
        "'speaker_0': 'And there there's time in the next 18 months to, to do that discussion of what would it look like to, to take 26 statutory out of the charter altogether? I agree with that. But what would it be replaced with in zoning ordinances?'",
        "'speaker_0': 'And that is not an overnight process. Those of us who have been on the planning board know I mean, that's that's a process with lots of public input. But right now, I think we have a pivotal issue before us.'",
        "'speaker_0': 'Does 20 6-1 an outright ban on multi-family housing anywhere in the city that we represent? Does that belong in our city charter? The Constitution of our city? I think the answer is no. With that, I would like to hear a motion to go forward.'",
        "'speaker_0': 'And again, as I think Councilmember Odie pointed out, what we are presumably doing if we get four votes to do it, is directing staff to come back with us to us with potential ballot language. I would like to hear a proposal for a measure first looking at 20 6-1 and then whatever anyone else wants to wants to'",
        "'speaker_0': 'propose. Councilmember Odie.'",
        "'speaker_2': 'I will make that motion. But I do want to point out that I appreciated your your comments. And I don't particularly believe what some of the worst comments that were said about you in public comment are true. But if someone does believe them, the fact that you just gave that speech, I think should give them pause and'",
        "'speaker_2': 'and know that you are thoughtful and you can consider different ideas. And I just want to let you know. I appreciate that.'",
        "'speaker_0': 'Thank you for your kind words. Councilmember Etienne. I'll just repeat my mantra for serving in public office. Thick skinned. Sense of humor. Backbone. You need all three. Vice Mayor Knox White.'",
        "'speaker_2': 'I will. Second Councilmember Otis Motion.'",
        "'speaker_0': 'Thank you. Any discussion. All right. We've had emotion. We've had a second. We have a roll call. Vote.'",
        "'speaker_1': 'Councilmember desire. No, not quite.'",
        "'speaker_2': 'Hi. Yes.'",
        "'speaker_1': 'Vela.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Mayor, as the Ashcroft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That carries by for one.'",
        "'speaker_0': 'Thank you. Okay. Do we have a second motion?'",
        "'speaker_2': 'I will put one out there, but I'm going to just ask don't second it if we're not going to move forward. Okay. I will I will move that. We give staff direction to remove. I'm going to say actually articles 26.2 and Article 20 6s3, because there's no point in having Article 26 to if there is no.'",
        "'speaker_2': '26 three from the city charter.'",
        "'speaker_0': 'So do we want it seconded to have some discussion in a motion to be withdrawn or what. It's you're the maker of the motion.'",
        "'speaker_2': 'I'll remove the motion. That's right. I committed to trying to help get us out of here by 1155.'",
        "'speaker_0': 'All right, then. Well, then, if I'm hearing no further motions, what we have done is directed staff then to come back to us with ballot language on placing Article 20 6-1 before the people in November of 2020 2020.'",
        "'speaker_0': 'All right. Thank you all. Councilman Brody.'",
        "'speaker_2': 'Do we need 26 days to if we repeal 20 6-1? Because I thought too related to one, not two three but I could be like.'",
        "'speaker_0': 'I'm having brain freeze can remind me what 26 test two is.'",
        "'speaker_2': 'That was the exact replacement.'",
        "'speaker_0': 'Housing. Wait, wait, wait. Tony, I wait. Okay. I'm sorry. No, counselor, is Mr. Thomas. Oh, Mr. Thomas.'",
        "'speaker_2': 'I believe it exempted the housing authority from 20 6-1, but I could have it backwards. In instances of replacement housing.'",
        "'speaker_0': 'So I'll tell you what. We are directing staff. Are you there, Mr. Thomas?'",
        "'speaker_2': 'Yes, sir, I am. I am trying to earn. We could hear you. Sorry about that. Commuting problems. Well, I think you were about to say what I was about to say. When when staff comes back, we will we will advise the council on whether 20 6-2 should stay or not.'",
        "'speaker_2': 'Sitting here today without having a I think it should stay. If you're going to keep 20 6-3. But we will we will analyze that further. And when we come back to the language, give you better advice on that.'",
        "'speaker_0': 'You've given us plenty of great advice up until now. Thank you. Thank you. Thank you, colleagues. I appreciate the discussion. I appreciate your votes. Okay. Thank you all. Thank you. All right. We got to keep moving with all deliberate speed.'"
    ],
    "Direction to Staff on Charter Amendment Ballot Measure(s) and Election Dates.": [
        "'speaker_0': 'So, Madam Clerk, will you please introduce item 26 Dash? Where are we? I mean, 26 might be talking about it. It could be.'",
        "'speaker_1': 'Recommendation to consider providing direction to staff to prepare a charter amendment, ballot measures and potentially determine the election date when measures will be on the ballot. And I can quickly just tell you all that following up from your previous meetings, we, you know, kind of just wanted to bring back the items.'",
        "'speaker_1': 'So we've got up City Prosecutor Council Pay Section seven, dash three, and then Article 26 that you just addressed in the previous agenda item. And so basically the discussion tonight is if you want to proceed with any of these other measures and then if you wanted to start talking about which election you'd like to put them on'",
        "'speaker_1': ', and that is the next part of it. So the city attorney and I can answer any questions you have about this, but will in time sake, we'll just move on.'",
        "'speaker_0': 'Okay. And Vice Mayor, this is your in council day thugs, baby, right?'",
        "'speaker_2': 'Yeah, kind of, yeah.'",
        "'speaker_0': 'So, um. So if you want to. I'm sorry. I'm struggling with the frozen iPad, but if you want to just, uh, discuss, introduce this. Um.'",
        "'speaker_2': 'I mean, I, I think the city clerk did, just did a great job. Basically, we voted all these things down. I actually just had a question, uh, by two questions. One, is it.'",
        "'speaker_0': 'I'm sorry, we only give one.'",
        "'speaker_2': 'Is the council today able to put things on the 2022 ballot or would, would putting things on a future ballot, meaning that a new future council. So basically it's just punting.'",
        "'speaker_1': 'Right. I think it was just to tell you what the election date options were and and the timing involved with it. For example, the council page item, you know, if there's talk about putting it to November 22, then it would also change the implementation date because it would have to bump back further to when everybody who's on'",
        "'speaker_1': 'the council at that time terms expired and things like that. It was just trying to figure out timing issues and explain them and be ready to go.'",
        "'speaker_2': 'That's right. I just wanted to be I wanted to be clear for myself that the only election we can actually put things on is 2020. Yeah. Okay. Excellent. And then I guess the question for I'm going to assume the city attorney on 20 on section two, Dash 16 in the gender neutral language section, changing all references of'",
        "'speaker_2': 'his to his or her. I'm curious if we considered using they or their instead so that we can get away from the we could fully be gender it rather than just binary gender it.'",
        "'speaker_0': 'You're asking that of the city clerk?'",
        "'speaker_2': 'I know the city the city attorney whose hand is up. I think he's waiting to be called.'",
        "'speaker_0': 'I am so sorry. I'm looking over here. Yes, I'm city attorney. I'm sorry. I'm looking the wrong direction.'",
        "'speaker_2': 'Thank you, madam.'",
        "'speaker_0': 'Screen. I mean, really.'",
        "'speaker_2': 'Councilmember? Not quite. I want to answer your earlier questions as well, which is that technically the council could direct a measure be placed on a future election date, so any future council would have the right to withdraw it.'",
        "'speaker_2': 'So, you know, so you're not without authority to choose a future date, but it could be withdrawn by any future council. With respect to your question about, they will certainly be happy to take your direction. That's certainly not a problem.'",
        "'speaker_1': 'Yeah. And if I could jump in on that part to that, what is in the staff report is what is currently in the charter that's actually citing the current charter section language that isn't the proposal about what the language would be.'",
        "'speaker_1': 'I was actually just putting in the pertinent charter section as they exist now so everybody could see it very clearly. So, yes, that's all it was.'",
        "'speaker_0': 'Thank you. Okay. I saw. Oh, I saw Councilmember Velez hand up, but now I don't see Councilmember Vela. There she is. Okay, well, sorry about that. When I could see, I had an issue. Sorry. All right. So. So my.'",
        "'speaker_0': 'My question was, if if we. And we got the clarification from the city attorney that we could potentially put it on a future ballot like that, even though there will potentially be a new council. There will be a new council seated.'",
        "'speaker_0': 'My question is, would that then go back to the council? Will it be? Will there be like a hold for an agenda item for that future council to either confirm or to affirm or change and affirm, amend or decide to reverse the action?'",
        "'speaker_0': 'Good question. What's what's the answer? Um.'",
        "'speaker_2': 'City Attorney So there is no legal requirement that you offer that agenda item to the new council. If you direct it, staff will certainly do it. Or the new council can direct staff to bring it back, but it is not required by law.'",
        "'speaker_2': 'So let's hypothetically you choose to put, you know, item eight on some agenda in the future. We bring you back the resolution you adopted. It goes assuming you adopt in the future the language and all of the implementing regulations.'",
        "'speaker_2': 'But a future council could pull it back. You could at that time also direct us to bring it back to a future council for their affirm, if you would like. But it's not a legal requirement that we do so.'",
        "'speaker_0': 'Okay. And then my other question is, so if we could could we also say we're declining it at this time, but please bring it back to us. So please bring it back to the council, just like we would with the referral, the referral list or whatever, where we can ask for items to come back.'",
        "'speaker_0': 'Is that how we would do that?'",
        "'speaker_2': 'You could certainly do it that way, too. You could choose to not take action and direct us to bring it back. Know next February next year.'",
        "'speaker_0': 'Thank you. Um. Okay. Um. What? Um. What further discussion are there, Councilmember Brody?'",
        "'speaker_2': 'I had a question. Yeah. I'm wondering why 20 to the seven is here. Is that related to the council pay proposal or is that there for a different reason? And the same with 20 2-8.'",
        "'speaker_1': 'I can, I think, answer that one. So in under the cleanup language, generally those sections were ones I had kind of tickled that we basically don't bring back, you know, the per diem amounts because they're set by the state now and that doesn't come to council annually.'",
        "'speaker_1': 'And then the hours and 20 2-8 are not what the city hours have been. So it was just things that aren't really so they're just under the general cleanup section and that was just some items that, you know, don't match.'",
        "'speaker_0': 'Soccer.'",
        "'speaker_1': 'Practice. So that's all they were.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. So all right, so I'm hearing this discussion of dates. I, I would think that there are some items that we do want to bring in 2020, November of 2020. Councilmember Vela. Yeah. Madam Mayor, if we could bifurcate this, I think that there are some items that we could move that I would feel comfortable moving forward with'",
        "'speaker_0': '. I certainly would feel comfortable moving forward with the cleanup language. I think I'm going to have. The problem with my thing is that I have to close out of this to look at the agenda or the staff report to pull up the specific language.'",
        "'speaker_0': 'But I think if we could just go over what provisions and have the clerk read off what provisions and then vote on them, that might be helpful. We can do that. Is that okay with Mr. De Soto? Mr. KNOX.'",
        "'speaker_0': 'Right, yeah. Okay. Okay. Because we get it and we got to keep moving. Okay.'",
        "'speaker_2': 'About speakers.'",
        "'speaker_0': 'No speakers. Oh, sorry. Thank you. For the reminder matter, do we have any public speakers?'",
        "'speaker_1': 'We have no public comment that was submitted. And then if anybody on the zoom, I would raise our hand. Nobody on the zoom has raised their hands, so no public comment.'",
        "'speaker_0': 'Okay. So we can take this. Can we buy basically A, B, C, D, E and just read this whole provisions.'",
        "'speaker_1': 'Addressed address on the previous item so you don't even have to.'",
        "'speaker_0': 'Erase. Yes, yes, of course. Right, right, right. Yep. Okay, good. We just save ourselves sometimes. Okay, so let's just go down the list. Do you have a motion to adopt? Let's see. So Vice Mayor or Councilmember de Song.'",
        "'speaker_0': 'Since this was your subcommittee, do you want to make this motion to.'",
        "'speaker_2': 'Try.'",
        "'speaker_0': 'To adopt the clean up language or to move it forward to November 2020? Okay.'",
        "'speaker_2': 'I will I will move that. We ask staff to return with language for the for section a clean up language for the 2020th November 2020 ballot.'",
        "'speaker_0': 'Okay. For all the items listed and for.'",
        "'speaker_2': 'All the items listed.'",
        "'speaker_0': 'Yes. Thank you.'",
        "'speaker_2': 'And with the direction that we use, they in there.'",
        "'speaker_0': 'All right. Do I have a second? Second set? Okay. Mayor seconded by a councilmember to decide the session. Councilmember Vela, I just want to make sure that the. We just get rid of the sheets, hurt his her and move to the exam.'",
        "'speaker_0': 'Got it. Okay. Did you have something, Councilmember Odie?'",
        "'speaker_2': 'Yeah, I think I'm on the LGBTQ caucus at the League of Cities and they've had some minor language for gender neutral language. So hopefully our staff will look at that. And, you know, I have Hercules also if if anyone needs that for assistance.'",
        "'speaker_2': 'And it's good that we're doing this on during our Pride month.'",
        "'speaker_0': 'That's right. Okay, great. Great banner out front. So go by the city council. City Hall. Okay. It's been moved. It's been seconded. May I have a roll call vote?'",
        "'speaker_1': 'Councilmember de.'",
        "'speaker_2': 'Yeah, i.'",
        "'speaker_1': 'I. I, i. I may or as he Ashcraft.'",
        "'speaker_0': 'I that.'",
        "'speaker_1': 'Carries by.'",
        "'speaker_0': 'All right. The next item is city prosecutor who wants to make a motion on that one. Councilmember Vela That's key. Chief It's getting late. I need chocolate if there's any chocolate in the building, people. Um, Councilmember Brody.'",
        "'speaker_2': 'I'd like to make a motion to put these amendments on the ballot, but I believe there was a suggestion from one of our constituents, Mr. Solomon, Mr. Silent, that we add language about the discretion of the prosecutor. So I think that was a good suggestion.'",
        "'speaker_2': 'So with that suggestion, I would like to move approval of having staff bring back ballot language for second for the city prosecutor.'",
        "'speaker_0': 'And councilmember ody just for benefit of someone who might not have read that correspondence. Um, city Attorney Ken, could you just briefly describe that, summarize it for us.'",
        "'speaker_2': 'The comment indicates that the, the, the language that currently exists in the charter requires, which would purportedly require the city attorney to prosecute all local law violations. And this proposed language would add state law violations. And those comments are suggested that the phrase exercise of prosecutorial discretion should be included because that's required by federal and state constitutional'",
        "'speaker_2': 'law. And I agree with that comment wholeheartedly.'",
        "'speaker_0': 'Perfect. Thank you. So we've had a motion. Do we have a second signature? Are there if you raise your hand near your face, it's going to raise your hand. So it's been moved by, uh, Councilmember Ortiz, seconded by Vice Mayor.'",
        "'speaker_0': 'Next, when we end discussion. Councilmember Vela. It would be helpful to get a little clarity from our city attorney just for the public's benefit about what this change actually does, whether or not this would require additional funding for that position, since that's something that has come up even earlier in this meeting.'",
        "'speaker_0': 'So I think the additional whether or not it's going to cost additional funding and what this change actually will accomplish or do, one of the questions that some of the questions that I've gotten is around why, why? Why would a city attorney prosecute versus the district attorney?'",
        "'speaker_0': 'And she said.'",
        "'speaker_2': 'Yes. So happy to provide some background. The existing city charter either can be read as authorizing or requiring the city attorney to prosecute all local law violations. The proposed language would authorize the city attorney to prosecute state law violations.'",
        "'speaker_2': 'The Council authorized this office to engage in that activity with the consent of the district attorney earlier last year. And I believe the intent of the the ballot language were to to memorialize that authorization to the extent that that consent from the district attorney is withdrawn.'",
        "'speaker_2': 'And that is really the purpose of this change. We are not anticipating requesting additional staffing to undertake the work that we're already undertaking with the Council's authorization and the district attorney's consent. And so I hope that answers your question.'",
        "'speaker_0': 'Okay. Anything further? May we have a roll call vote, please.'",
        "'speaker_1': 'It's my birthday.'",
        "'speaker_0': 'Strike. Vice Mayor, did you have your hand up?'",
        "'speaker_2': 'Did we call public comment on this item?'",
        "'speaker_0': 'Oh, yes. It was going to be my my next question.'",
        "'speaker_1': 'Yeah, we called it for the whole item, but you're just breaking down.'",
        "'speaker_0': 'Okay, yeah, yeah.'",
        "'speaker_2': 'Okay. Okay. I just want to make sure we had I couldn't remember.'",
        "'speaker_0': 'Yeah, we had. We had. And if we could just a little bit of discussion. I do think this is one of the items that there's going to need to be a robust communication plan. But I do think that this is one of the items, the changes that there needs to be a robust communications plan with the community'",
        "'speaker_0': ', because I think a lot of people don't understand it. And I and I this is one of the issues that I think it's going to be harder to explain and engage the community around. Thank you. Okay. Anything further for our cover, please, Mr. Rhodes?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'I'm sorry, sir, but are we just descending today? Which ones we will put together, or is that for the next discussion?'",
        "'speaker_0': 'With the other returns for November.'",
        "'speaker_2': 'Oh, you we combine a few so we have but three measures. Or four measures or one measure.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'So is that separate, Madam Clerk, I.'",
        "'speaker_1': 'Think if you wanted to like combine, you know, like cleanup and council pay or, you know, clean up and city prosecutor, like if if you're talking about like doing some combinations like that. Yes. We would love to get that direction from you.'",
        "'speaker_2': 'All right. I'll get to the end then.'",
        "'speaker_0': 'Okay. And it's 1148, so let's see if we can move through this. Yeah. Okay. So we have had a motion. We have had a second. Is there any further discussion saying then let's have a roll call it.'",
        "'speaker_1': 'Councilmember de san.'",
        "'speaker_2': 'Guy.'",
        "'speaker_1': 'Next.'",
        "'speaker_2': 'Why i.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Vela. I a mayor is the Ashcraft.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'That carries by five eyes.'",
        "'speaker_0': 'All right. Thank you. The next item is council pay and an amendment to the council compensation proposal to set the maximum salary to 30% of the median Bay Area salary pursuant to Section 22,000 I. The increase would not be effective until January one, 2023.'",
        "'speaker_0': 'Okay. Members of the Council subcommittee. A subcommittee.'",
        "'speaker_2': 'If one of the recommendations we're making.'",
        "'speaker_0': 'Every day say, oh.'",
        "'speaker_2': 'Sorry about that is to have staff come back. I would want staff to come back to us with a discrete number, because by its very nature, this topic is always a form of a grenade. And so anything that we can do to lessen it I understand, you know, the reasoning behind the percentage here, but but we may'",
        "'speaker_2': 'also consider an alternative like discrete number. Also, one more point. Let me just quickly say, um, you know, there have been some concerns raised by residents in their emails about this about so in order to a life allay fears I don't know how to say it correctly speaking just for myself now.'",
        "'speaker_2': 'Okay. And I could only consider myself ever to be lucky enough to be in a position. But. But if. If I were. I would not, um, I would not benefit by this if I were a council member. So and I can only and I'm just speaking for myself and I won't, because I just want people to know'",
        "'speaker_2': 'that, um, that this, I believe the city council pay is out of whack with, with, with what similar sized cities in our East Bay region are getting. And I do believe that we earn it back the amount of work.'",
        "'speaker_2': 'But I want to engender some form of trust by just for myself. I think that if I ever get a chance, you know, that's subject to the people. I would not accept this. I would just go with the.'",
        "'speaker_2': 'Current rate. So.'",
        "'speaker_0': 'Okay. So do we have a motion to move this forward to, to staff to prepare ballot language?'",
        "'speaker_2': 'EA That's another discussion item. I mean, you know, you're going to have a nice man like that, all right. I, I think you're going to have a really loaded November 2020 item. I mean, you know. Well, you know what I said about, um, uh, I don't know.'",
        "'speaker_2': 'I don't know if you want to do that.'",
        "'speaker_0': 'So so the motion is the question is simply, is there a motion? If there's not a motion, that's an answer in itself. But we aren't going to have a discussion until we have a motion.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Councilmember Vale, were you just adjusting your screen or raising your hands? I was raising my hand. Unless the vice mayor is going to speak.'",
        "'speaker_2': 'I was simply going to make a motion that we put this I have this come back later in the summer to put on the ballot in 2022.'",
        "'speaker_0': 'And I would second that motion. All right. We had a motion by the vice mayor, a second by Councilmember Vela. Any discussion, hearing, then may we have a roll call vote, please?'",
        "'speaker_1': 'Councilmember Dysart.'",
        "'speaker_2': 'Yes, on the motion next by. Hi.'",
        "'speaker_1': 'Odie.'",
        "'speaker_2': 'I'm going to abstain because I still have issues with the whole idea of girls on the ballot whether.'",
        "'speaker_1': 'I may or as the Ashcroft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Okay. That carries for one.'",
        "'speaker_0': 'Okay. This next one, I think is very important. And this is having to do with, well, adding the methods to the language, but also discussing, uh, any attempt by council member to influence the city manager in the making of an appointment or the purchase of materials or supplies.'",
        "'speaker_0': 'So subject such council member and which includes the mayor to removal from office office for malfeasance. And again, this particular item was something that came to us as part of the recommendation for the grand jury.'",
        "'speaker_1': 'And and mayor, if I might jump in. So basically, at the May six meeting, council already gave the direction to start drafting language. So that's already being done. So we just didn't want another discussion tonight for timing and every other purpose.'",
        "'speaker_1': 'So we know that council already did give that direction.'",
        "'speaker_0': 'Okay. So then do we need a motion as far as timing?'",
        "'speaker_2': 'I will move that we place this item on the 2020 ballot November 2018.'",
        "'speaker_0': 'All right. It's been moved by the vice mayor, seconded by Councilmember Odie discussion. Councilmember Vela. It's actually related. Just for clarity on the last item. So I'll wait. Well, I just wanted to. I know that Councilmember Jason Kidd said that he wanted a discrete number given.'",
        "'speaker_0': 'Was that part of the motion or will staff just come back with a bunch of alternatives or.'",
        "'speaker_2': 'I think staff can come back with alternatives. I don't think we're in a rush.'",
        "'speaker_0': 'I just want to. I just.'",
        "'speaker_2': 'Don't know.'",
        "'speaker_0': 'Okay. What happened? Okay. Okay. All right. So. So I. I've had a motion to put this on motion second and second. Okay. Any discussion?'",
        "'speaker_2': 'But it's okay.'",
        "'speaker_0': 'Yes, you did. You did? No. Any discussion?'",
        "'speaker_2': 'Quick discussion. I'm going to support the motion. But you know, the substance of how I feel is how I feel. So.'",
        "'speaker_0': 'Understood. All right. Any further discussion? Hearing, then walk over, please.'",
        "'speaker_1': 'Councilman de SAG. Hi, Knox Light. Hi, Odie. Hi, Bella. High Mayor as the Ashcraft.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'Carries by five eyes.'",
        "'speaker_0': 'All right. Very good. Okay, that concludes item six. I see. We move on to item 60 really quickly. Yes. Who am I ignoring that, I guess. City attorney.'",
        "'speaker_2': 'Yes. You indicated that you, you or Councilmember Ody had indicated that you may want to have a discussion about whether we come back as one omnibus or whether you want each of these separated. Can we get brief direction from the council?'",
        "'speaker_2': 'Whether you prefer each of these separate is A, B and C, or do you want them all on the bus?'",
        "'speaker_0': 'Vice Mayor has his hand up. Why don't you start.'",
        "'speaker_2': 'With like I would like to move that. We have 15 more minutes of discussion. I know it's going to take us past midnight, but if not, we're shutting down right now at 11:55 a.m..'",
        "'speaker_0': 'I'll take that motion. It's been seconded. Any discussion? Okay. 15 more minutes. Takes us to ten after 12, right? Okay. So maybe the day after.'",
        "'speaker_1': 'You know, the roll call vote?'",
        "'speaker_2': 'Oh, vote yes.'",
        "'speaker_0': 'I think that might be the answer. Yeah. Sorry I.'",
        "'speaker_1': 'Missed it. Not quite. i0di vela mayor as the Ashcraft high carries by five guys.'",
        "'speaker_0': 'All right. It's starting from 15 minutes. As soon as we clarify for the the city attorney. Okay. On six c. Um, I would say, um. Okay, well, I, I would entertain, uh, discussion from my colleagues. I think that I would say that 7-3 should stand alone, that maybe the others and possibly the prosecutor went, too.'",
        "'speaker_0': 'But I'm. Those are my. Feelings. I think that. Well, that kind of means three separate ones. What is it, Councilmember de SAC.'",
        "'speaker_2': 'It seems to me that the way in which we've categorized it by A, B, C and D, I think those are clusters of thoughts that that kind of stems. I mean, they're intuitive. I mean, you could conceivably do A and B together.'",
        "'speaker_2': 'But but, you know, be seemed so much more substantive than than a but I do like I think they stand they they are they stand on their own if you do it separately. AB And whatever the third.'",
        "'speaker_0': 'Okay. Is that emotion?'",
        "'speaker_2': 'Oh, yes, sure.'",
        "'speaker_0': 'All right. Is there a second to that motion?'",
        "'speaker_2': 'I guess not.'",
        "'speaker_0': 'Oh, no. Um.'",
        "'speaker_2': 'I would propose that we combine A and B. Okay, that's fine. Let's get.'",
        "'speaker_0': 'In.'",
        "'speaker_2': 'Okay. All right. Danny would stand alone. Yeah. Okay. That makes sense.'",
        "'speaker_0': 'Three. He already is, but. Yeah. Yeah. Okay. So would you second that, Councilmember Desai?'",
        "'speaker_2': 'Well, why don't I get into that? I'll be an amendment to that. Okay, that's fine. I got the Chinese amendment. Which is amendment. But Tony. Tony is accepting money. Why don't we combine A and B as an amendment to his original.'",
        "'speaker_2': 'Exactly. Seconding that. Amended a motion. Yes.'",
        "'speaker_0': 'Rather than talk about A, B, C and D, can you just say which specific provision you know, together.'",
        "'speaker_2': 'A, is all those clean up language in there? And then there's two other ones and then B is the prosecutor. So those two kind of, I think, are in no slight to our city attorney. Those two are, you know, kind of mundane.'",
        "'speaker_0': 'They combined. Yeah.'",
        "'speaker_2': 'And logically combined. Whereas the measure, a C I believe is quite substantive as a7-3.'",
        "'speaker_0': 'Will see is the council pay that we can at least I got it standing on its own because it's in another year but in item D is the council.'",
        "'speaker_2': 'Interference. Yeah. Yeah, exactly.'",
        "'speaker_0': 'Okay. Okay. All right. Do you want to we make that motion? I think it would go a little confusing.'",
        "'speaker_2': 'Oh, well, the motion is that we combine A and B, um, as one set of, um, um.'",
        "'speaker_0': 'Charter ballot.'",
        "'speaker_2': 'Measures, ballot measures and that the two other items, the 7-3, which did you say is D I don't have it in.'",
        "'speaker_1': 'Ddc0bbddd7d.'",
        "'speaker_2': 'Dale okay. Yeah, the and, and the measure a measure of those two stand separate alone on their own. So what does that and B is together D and.'",
        "'speaker_0': 'D a separate. Is it.'",
        "'speaker_2': 'Any. Exactly.'",
        "'speaker_0': 'Okay. All right. With that clarification, Vice Mayor, will you still second?'",
        "'speaker_2': 'I still second.'",
        "'speaker_0': 'Thank you. Any discussion thing then maybe we have a roll call vote, please. Oh, was it discussion? No, I don't think so. Well, I can't hear Rudy.'",
        "'speaker_2': 'Oh, I'm sorry.'",
        "'speaker_0': 'Yeah, so.'",
        "'speaker_2': 'It's kind of non-controversial, and they would have no issue combining A, B and D E has to be on its own. Definitely.'",
        "'speaker_0': 'We have a motion in a second. Why don't we vote on the motion second that we have roll call vote?'",
        "'speaker_2': 'Well, let's let's I'd like to hear discussion. Is there a reason I kind of had the same thing I wondered about? Yeah. 7-3 as well.'",
        "'speaker_0': 'I feel I mean, if not, I feel like then we should have all of them separate because the prosecutor one I do think is confusing. Okay. Is that a motion to have each of them be separate?'",
        "'speaker_2': 'Oh, okay. Well, we could go back to separate, but I still like the idea of. Two two initiatives. It's very simple. But technically they're all cleanup. Yeah. That is why I think maybe NPR all clean up language.'",
        "'speaker_0': 'That's true.'",
        "'speaker_2': 'And he is a substance. Shouldn't be connected with anything else. This should stand on its own. That is if if that's the wishes of I do have my problems of stuff under age three but if you know that's that we're just talking process right now, so I'm fine with that.'",
        "'speaker_0': 'So supportive of that. Yeah. Okay. Okay.'",
        "'speaker_2': 'Let's do that then.'",
        "'speaker_0': 'Okay. So tell me again what we're doing.'",
        "'speaker_2': 'We're putting a band of us together in a separate.'",
        "'speaker_0': 'Correct. Okay.'",
        "'speaker_2': 'Mm hmm. Second.'",
        "'speaker_0': 'Mm hmm. Okay. Cause we need to move forward on this. That's because part of it is the grand jury's recommendation. So we need to take this seriously. And I just want to make sure we're not. I'm not. He's not in the conversation.'",
        "'speaker_0': 'I'm talking about the grand jury. Okay. So we've had a motion. Who made the motion? Is it? Yes. Yes. Okay. Councilmember deserve it because it was a new motion and his seconded it.'",
        "'speaker_2': 'Counsel seconded it.'",
        "'speaker_0': 'All right. Okay. All right. Rock over.'",
        "'speaker_1': 'Councilman or de thug? My next. Hi.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'I. Mayor, as the Ashcraft.'"
    ]
}