{
    "Services Agreement and Funding for Rent Review Program Administration.": [
        "'speaker_1': 'Okay. So I had pulled this item. I have concerns about the way this is being implemented. And specifically, for instance, I attended one of the workshops for the tenants and it was during the day. And initially a concern of mine had been that there most of the workshops for tenants were in the day and not in the'",
        "'speaker_1': 'evening. And then I know workshops were added in the evening to which I think is to accommodate the tenants. The workshop I went to, which was a tenant workshop, had four people present, one from person from Echo, another person from the business industry, and then two tenants that were concerned about being evicted.'",
        "'speaker_1': 'And something that came out during the presentation was that there was no ability to meet with anyone in person that you could expect. You could leave, you could telephone and expect a return call within three days, which the tenants that were there said that that was what had happened to them.'",
        "'speaker_1': 'It had taken three days to get a return call, but I am concerned that I would like to. I think we should consider having the ability for a person to get in line somewhere and talk with a person or make an appointment to meet with a person.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'So are you objecting to spending the money to fund the work that has to be done? Because I think those comments are good comments for the execution of what has to be done. But I think our charges to allocate the money.'",
        "'speaker_1': 'So, yes, I am objecting if we are not including in-person contact. Yes, I will be objecting. So I think that that's critical for this. I think that tenants have serious concerns. And actually, if you go to the housing authority right now for an issue regarding affordable housing, there is a line that you weigh in and then you'",
        "'speaker_1': 'can get assistance. But that and also, if you go downstairs to the Planning Department, both departments which use this program, for instance, the Planning Department will be connected with the CHP there. There's a way to get in line and see a person.'",
        "'speaker_1': 'So I am concerned that we're not offering that at this point.'",
        "'speaker_8': 'Yes, sir. If I understand you to be making a motion.'",
        "'speaker_4': 'I just want to make a point first before making the motion, because I do think that's probably a valid critique, because tenants and housing providers, for that matter, should be able to talk to a person. But that won't happen if we don't allocate the money.'",
        "'speaker_4': 'So I, I would like to get the, the city manager's response, but I would also like to make the motion that we allocate the money as per item five I.'",
        "'speaker_8': 'And I'll second that. I do have a discussion point to make to after the city manager.'",
        "'speaker_0': 'And I'd just like to say that we will share those that critique with the housing authority and suggest ways that they can be more customer service oriented.'",
        "'speaker_5': 'And just to clarify one point from Debbie Porter, the city's community development director. And the housing authority is already set up to do phone phone appointments. So they are doing phone appointments. And they have agreed to reevaluate in 60 to 90 days once they have a sense of the volume of activity, the ability to set up in-person'",
        "'speaker_5': 'meetings at that time so that it's not that people can't meet, they're being done by the phone. And that's really to assess and understand the volume of activity under the new ordinance.'",
        "'speaker_1': 'Could you clarify, is a phone appointment mean that you still are talking on the phone, not in person. So you're still not allowed to make an appointment to meet with someone in person?'",
        "'speaker_5': 'It is set up to take phone appointments that's over the phone. And they have agreed in the next 60 to 90 days to evaluate capacity to do in-person meetings as well.'",
        "'speaker_1': 'All right, member Ashcraft.'",
        "'speaker_8': 'Thank you, Madam Mayor. So the one comment I had from the staff report was from page three that says that. Starting on page two staff report. While RAC meetings at the Rent Review Advisory Committee meetings were previously held in the council chambers.'",
        "'speaker_8': 'They were not televised. The decision to relocate the meetings to the IPI community room that's in the.'",
        "'speaker_5': 'Independent's.'",
        "'speaker_8': 'Independence Plaza over adjacent to where the housing authorities offices are, was made to facilitate the mediation process and provide an informal setting that was more accessible to the mediating parties, particularly the tenants. There's some suggestion that given the increased awareness, it might be appropriate to relocate the RAC meetings back to the chambers and televise the meetings.'",
        "'speaker_8': 'I believe I was one of the motivating forces on getting the RAC meetings moved from this chambers to a more a setting that was more conducive to the mediation process because quite frankly, it was pretty awful when it was here and not the least bit user friendly.'",
        "'speaker_8': 'A mediation process for those who have participated should really have all the parties sitting around a table at eye level with each other, nobody looking down on one and not, you know, making landlord and tenant shuttled back and forth.'",
        "'speaker_8': 'And so I we also were going to consider some amendments to our Sunshine Ordinance this evening. And I know from reading that staff report that there are times when it's simply not possible or advisable to have a meeting someplace where we can have live streaming television.'",
        "'speaker_8': 'I don't think that's a necessity in this particular case, as long as we had an audio recording and accessibility to that. So again, I agree with the vice mayor that none of these changes and none of our ability to be more responsive to our especially our tenants in these cases.'",
        "'speaker_8': 'But landlords two is possible unless we vote for the funding. Thank you.'",
        "'speaker_1': 'And I personally prefer that the meetings be held here. The audio went there and I think it's important. Actually, I'd like us to consider televising it. The audio, if you playback the audio, it's very hard to tell who's speaking.'",
        "'speaker_1': 'It's really not a recording. And and I think it's actually critical for the success of REC that the meetings be held here where they are. I think this venue is is important. So I disagree with moving it well.'",
        "'speaker_8': 'In any way when we're not discussing that. So that was correct.'",
        "'speaker_1': 'Correct. So I appreciate that. So, all right. Do we have a motion.'",
        "'speaker_8': 'And we have a seconds that.'",
        "'speaker_1': 'Can be seconded?'",
        "'speaker_0': 'Can I ask one clarifying question? You said you were moving, appropriating the funds. Are you also approving the services agreement?'",
        "'speaker_4': 'Yes, that's correct. Yes.'",
        "'speaker_0': 'Yes. Thank you.'",
        "'speaker_8': 'On the second issue. Yes.'",
        "'speaker_1': 'All right. All those in favor. I oppose. I oppose. Thank you. Motion carries 4 to 1. When when it was all right. And then a5k. And I pulled this one.'",
        "'speaker_0': 'Okay. I know you want to do the final passage of ordinance authorizing the city manager to execute documents necessary to implement the terms of a ten year lease with two tenure renewal options and an option to purchase with LME 2.3 developers for Building eight located at 2350 Saratoga Street, Alameda Point.'",
        "'speaker_0': 'This item requires four. Affirmative.'",
        "'speaker_1': 'All right. And this one staff has a presentation. I don't know if you wanted to go over it. We also have one speaker.'",
        "'speaker_8': 'Well, why are we having a staff presentation?'",
        "'speaker_1': 'There is a presentation on here. I don't know if Seth wanted to present.'",
        "'speaker_5': 'Any of it. Excuse me. Then that mechanic from the Community Development Department based.'",
        "'speaker_0': 'We use department staff would like.'"
    ],
    "Lease and Purchase Option Agreement with Alameda Point Redevelopers for Building 8.": [
        "'speaker_5': 'To wait to see what the questions are before we do the presentation. We may be able to respond to the questions without the presentation.'",
        "'speaker_1': 'Okay. Then I'm going to go ahead and call the speaker at this time. Michael McDonough.'",
        "'speaker_4': 'Good evening, mayor, and members of the council and staff. I'm Michael McDonough, president of the Alameda Chamber of Commerce. I wanted to repeat our support for this project, the chamber's support for this project. In the last reading, I made the point that the formula for evaluation had been set by presidents, so that should not be an issue'",
        "'speaker_4': '. But as one going on further than that, as one of the esteemed members of this council said after the last reading, and I paraphrase, It's not just the price for the land, but the cumulative value for Alameda after the project has been developed.'",
        "'speaker_4': 'And this project really is a tremendous value to Alameda, we believe. Number. Me tell.'",
        "'speaker_1': 'You.'",
        "'speaker_2': 'I know that last time.'",
        "'speaker_8': 'I think you're sitting in the corner.'",
        "'speaker_4': 'Number. Number one, it transforms a long, vacant space that no one else has stepped up with. Another offer that would make a better value to the city. It's also an opportunity to expand on the maker's movement that has sprung up in Alameda, but not only adult makers spaces.'",
        "'speaker_4': 'There's been one very interested tenant that will bring a kid's maker space there, and I think that's tremendous for the kids that we have. I've also spoken to the developer about making vocational educational opportunities available. Things that are now no longer available in our high schools.'",
        "'speaker_4': 'But I think an important part of the future employment of our kids who don't choose to go on to college and. Lastly, the project will bring about 480 permanent jobs. But don't forget the temporary construction jobs, which many of our local businesses will bid and receive those contracts for the construction.'",
        "'speaker_4': 'And I know several that are members of the chamber that I know personally who intend to build on those projects. So we do believe this. This continues to offer great value to Alameda. We believe the value to the city as far as the price of the land is fair based on the improvements that are going to go'",
        "'speaker_4': 'in. And also the fact that it's a work live space really does mitigate any kind of traffic issues that might come up as well. So I think it's a win win for all and we support it.'",
        "'speaker_1': 'Thank you. So I had pulled this item at the last meeting. It was discussed. I believe the developer was thinking about having up to 100 space, 100 of these work live units. And at that time, the valuation per my question did not consider or was not affected by whether or not it had work live units.'",
        "'speaker_1': 'And the concern of mine and another and another concern is that these units do not count as housing for the city's code, which means they do not impact the number of housing units that we're required to have as the city.'",
        "'speaker_1': 'By the state. And now with this report that it appears that actually there's another part of the city's code, so that the number, the maximum number of work live units is anywhere between 73 to 86. Now that there's the city's.'",
        "'speaker_1': 'Change the number of units from what the what was spoken last time. Can someone speak to that?'",
        "'speaker_4': 'Evening. Mr. Spencer members of the Council. In terms of the number of work live units allowed on the site, the city's work LIB ordinance sets a maximum number allowed on any particular piece of property. It's almost based on the size of the property.'",
        "'speaker_4': 'This 73 number is based on a the specific amount of land that is available to this project. Today, there is another small piece that we anticipate will become part of the project in the future when the Navy conveys it to the city.'",
        "'speaker_4': 'It's the reason why we expect it to be part of the project is because we know where the roads are and that peace is between the building and the road. So it's a natural addition. So if you do the calculation on how many work live units they can do on the property today, based on the actual land'",
        "'speaker_4': 'that we have from the Navy, it's 73. If you assume that that sliver of land that's adjacent, which is on their side of the road, comes to us from the Navy, which we fully expect it will, and that then becomes transferred to this project.'",
        "'speaker_4': 'And then when you do that math on the project, it goes up to I don't have the number in front of me, but I believe it's 86. So. And one last just. Just so I know I know the mayor understands this, but for the public, the way this process has to play out, of course, is they can't'",
        "'speaker_4': 'do a single unit without a conditional use permit issued by the city of Alameda. There has to be a review and approved by the city, the planning board, and then is subject to appeal or call up for review by the council.'",
        "'speaker_4': 'And it's that process where the city and the community can decide what the right number of units is. It might be less, but it cannot be more.'",
        "'speaker_1': 'Thank you, Vice Mayor.'",
        "'speaker_4': 'I think that the point of about the residential portion of our work, live spaces is is a good point. But as you point out, that question is not on the table at this point, though. It has to go through a use permit process.'",
        "'speaker_4': 'And I think we do need to have that discussion because that that option is available in commercially zoned areas, and there's other restrictions that are described in our code. But I think we need to have a broader discussion on that.'",
        "'speaker_4': 'But as far as the item that's on the agenda right now, I, I think it's very specific to the entitlements that go with the lease option to buy. And I'd like to call the question on that.'",
        "'speaker_2': 'Um.'",
        "'speaker_8': 'On this. This is it. This is doing the motion. Go ahead. I'll make that motion. I move. Final passage of the ordinance authorizing the city manager to execute documents necessary to implement the terms of a ten year lease with 210 year renewal options and an option to purchase with Alameda Point Redevelopment LLC for Building eight located at'",
        "'speaker_8': '2350 Saratoga Avenue, Saratoga Street and Alameda Point.'",
        "'speaker_1': 'All those in favor. Oh, well. Okay. So then you can. Okay. All right. Because when you said call the question.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'Oh, well, thank you. I just want to quickly say that, you know, with the building project, we're really getting into the, if you will, there and the hand combat portion where of of base reuse, where we're really getting into those buildings that are so decrepit and that that we need people who are willing to take that entrepreneurial'",
        "'speaker_3': 'risk as it is already. You know, several would be developers have already fallen by the wayside in attempting to tackle these really, really difficult buildings. In the case of Caruso, they wanted to do the E Oak or BQ and also another site.'",
        "'speaker_3': 'So, you know, I think we're making a decision with our eyes wide open on behalf of the residents of Alameda. And in terms of the the financials, I'm satisfied that that we've done our due diligence and I'm satisfied with with the capacity of this entity to do follow through.'",
        "'speaker_3': 'But it is a difficult situation. And and, you know, that's why I think on the matter of work live, I'm okay with whatever the number is. So that's going to go through the process for the decision that we have to make tonight.'",
        "'speaker_3': 'I think. Are I speaking of one off, I feel satisfied having exercised due diligence on behalf of the residents of Alameda.'",
        "'speaker_1': 'And Brody.'",
        "'speaker_2': 'Surely you have called the question. So that eliminates or is going to.'",
        "'speaker_8': 'Say it's time to.'",
        "'speaker_6': 'Vote, have anything more to add that hasn't been already said.'",
        "'speaker_8': 'So.'",
        "'speaker_1': 'All right, then. All those in favor. I oppose. I oppose that motion passes 4 to 1. And next item. And when you say.'",
        "'speaker_4': 'Oh, yeah.'",
        "'speaker_2': 'Yep.'",
        "'speaker_4': 'So I'm very sure my apologies. Thank you.'",
        "'speaker_1': 'All right. Now we go to the regular agenda item six, a.'",
        "'speaker_0': 'Response to a city council referral regarding a possible wetlands mitigation bank in Alameda Point.'",
        "'speaker_9': 'Good evening, Mayor. Council members like. My name's Jennifer Bass, race director. Been here a couple other times. We're going to talk about wetlands mitigation banks in the Bay Area. When there there's development that occurs in the Bay Area, there are times when that development impacts or potentially impacts wetlands along the bay.'",
        "'speaker_9': 'And typically the regulators like the Army Corps and other folks try to essentially eliminate those impacts, if possible, or avoid them. But there are times when that there's reasons that coastal development, it's unavoidable to avoid impacts to wetlands.'"
    ],
    "Wetlands Mitigation Bank at Alameda Point Referral Response.": [
        "'speaker_9': 'And so what the regulate the regulatory system in the Bay Area has allowed is that essentially if you impact mitigation or you impact wetlands, you have to essentially mitigate your impact. And so that that overall that there is kind of a no net new net no net loss of wetlands along the in the coastal areas and in'",
        "'speaker_9': 'California. And in order to allow that, what has sprung up is essentially the ability to essentially it's created a market for areas where you can mitigate wetlands. And there are essentially developers that have been able to create wetlands mitigation.'",
        "'speaker_9': 'Banks were able to essentially purchase the right to impact wetlands in one location by mitigating, creating and enhancing or improving a wetland in another location. And there are all kinds of very detailed rules about how this occurs and a regulatory process that governs that.'",
        "'speaker_9': 'So usually what happens is a property owner. So for instance, the city of Alameda, property owner of land out at Alameda Point could essentially partner with a wetlands mitigation developer and create a bank on its property to essentially receive mitigation credits from developers throughout the Bay Area that are impacting coastal wetlands.'",
        "'speaker_9': 'And essentially they get paid to do that. And essentially what it does is from the proceeds of that, that banking you're able to create open space and wetlands on land. And so we did based on a referral from Councilmember Ody, we did evaluate this as a possibility at Alameda Point.'",
        "'speaker_9': 'So as a really as a means of creating open space and paid for through a funding source. So money that is, you know, not coming from the general fund, not coming from the base reuse department. But it also has a benefit of creating not only the the potential money for the creation of open space, but the maintenance'",
        "'speaker_9': 'cost. There's an endowment that's part of it that creates essentially has to spin off sufficient funds to essentially maintain those wetlands. And so definitely something that we've been talking about thinking about for a long time and a point and and and really needed to delve into the details to understand whether or not we thought it was feasible'",
        "'speaker_9': '. And so that is what we did. We consulted with our kind of our environmental consultant with a wetlands mitigation bank developer, was consultants that specialize in helping to create these with legal counsel on some of the issues related to state lands.'",
        "'speaker_9': 'Really try to delve in and do an analysis as to how feasible is this at Alameda Point. So there were two locations that are essentially zoned open space in our zoning that we looked at. One is deep paved park down here on the western edge of the seaplane lagoon.'",
        "'speaker_9': 'The other is this Northwest Territories, and I'll explain why these are different colors. But you can see in the black outline about 170 acres, I believe, or 170 acres total, 150 acre eight acres here. And we looked at these two locations as possible areas for wetlands mitigation bank.'",
        "'speaker_9': 'And what we did find was that it is just a 3 to 5 year process with a number of uncertainties. And, you know, we're we are glutton for punishment and base reuse. So we are familiar with complicated processes and things that take a long time.'",
        "'speaker_9': 'And and so, you know, that's we understand that. And there are but I want to walk through a little bit what those would be. So there's kind of five things that we need to be thinking of in terms of analyzing those five considerations.'",
        "'speaker_9': 'And when we did our analysis that we thought were important, the first is you can't create wetlands on land that is contaminated or that would create essentially, you know, a hazard or potential for wildlife or other things. And so because of that, there were land that were eliminated at the base out on here, out on this corner'",
        "'speaker_9': '. So we essentially had to subtract that land from the ability to to be a wetland wetlands area. The other is that they don't let you count public access as part of the wetlands mitigation, because the whole point is that this is essentially mitigating passive, very passive wetlands that exist today.'",
        "'speaker_9': 'And if there's public access, you can't. Essentially the square footage of public access. And so their staff's analysis of this, we felt that that, too, eliminated some areas from feasibility from our opinion, especially this Deep Pave Park, which we you look at the precise plan for town center waterfront area.'",
        "'speaker_9': 'Although it is intended to be more passive open space. It had significant trails going through here and intended to be a more highly used and active public open space area. And so essentially we felt this was also a very small area and makes you need some efficiencies and scales to really make this work.'",
        "'speaker_9': 'So essentially eliminating the option, we believe from our opinion of use of deep park, also wetlands construction, we learned a little about wetlands construction and that you you can only really count the areas that are wetlands. And the way that you construct wetlands, which we would essentially be doing here, is you can't count some of the upper'",
        "'speaker_9': 'layers. There's kind of this construction where it kind of comes down in tears. And there are certain upper tiers that you can't count that are essentially aren't are wetlands because you need the stagnant, the stagnation of the water and the still water to create the habitat for certain vegetation and aquatic habitat.'",
        "'speaker_9': 'And so you can only count the part that is that that creates that that's still water. And so you can't count those upper tiers. So that also eliminates land. There's a very detailed regulatory process, which is very complicated.'",
        "'speaker_9': 'It's not something, you know, I know from doing other permits through the Army Corps and the regulatory process, they're extremely impacted. Now with the economy, there's tons of applications. We're having a hard time. You know, even moving things through that process was something, you know, that's really improving water quality and other things.'",
        "'speaker_9': 'And there's the we understand from interviews is that that our local Army Corps isn't necessary. This isn't their priority. In other words, is it something that required to process and regulate? Sure. But because they see it as, you know, essentially allow helping to allow developers mitigate impacts, that doesn't mean they won't process the application, but it just'",
        "'speaker_9': 'means it's a little harder to move that process through a little faster. So it is very time consuming and onerous regulatory process. The last issue that we looked at is that the land out of the Northwest Territories is, once it's all conveyed from the Navy, is subject to Tidelands Trust.'",
        "'speaker_9': 'So as a state, essentially we are the city acts as a trustee on behalf of the state of California, which means we're all subject to all the restrictions that that land comes with. And that creates some problems because typically the regulators want to put conservation easements.'",
        "'speaker_9': 'They're saying to, hey, if you develop are going to get credit for impacting or eliminating a wetland. We don't want there to be this kind of time expiration on the mitigation that you created. So it. But the State Lands Commission typically does not like to put permanent restrictions on their land.'",
        "'speaker_9': 'It doesn't mean it's not possible. There's ways either through legislation, possibly through a memorandum of understanding with state lands and the regulators, that that could potentially get worked out. But it's just another consideration. And I think so once you take all that into consideration, really, we think the value that could come from this would be probably about'",
        "'speaker_9': 'when you pay the developer because they would essentially be taking all the risk. I mean, that's our assumption is that they would they would the developer would be taking all the risk, funding all the money up front. We wouldn't be doing that and that they would be taking significant amount of the proceeds to essentially pay the pay'",
        "'speaker_9': 'themselves back for constructing the open space and then essentially paying themselves a premium risk premium for having taken all that risk. So we we estimate in about $9 million after all of those reductions are made that could be netted from this.'",
        "'speaker_9': 'So I think in staff's, we think this is an option that should be absolutely kept on the table as a and we have this and a lot of things that are at the bases. We have a toolbox of things in terms of we've talked about this with regard to financing.'",
        "'speaker_9': 'We need to keep all of our tools in our toolbox and have them available and make decisions about when to use them. And we think this is one we should keep in our toolbox. We think there are other options.'",
        "'speaker_9': 'There are typically pretty significant funds from the state to fund open space and parks. There are about six and half million dollars in WW funds for the East Bay Regional Park District has for a park at Alameda Point.'",
        "'speaker_9': 'This is the location where they would like to build that. And so there, you know, staff believes there are other ways. And I think there are discussions that recently occurred with the subcommittee, with the Park District and the city about potentially exploring the possibility of in re initiating discussions about using that six and a half million dollars'",
        "'speaker_9': 'to create a regional park here. And so I think from our perspective is, you know, this is not a slam dunk. It was we didn't when we analyzed it, we didn't think it was kind of a panacea that was going to solve all of our problems out there.'",
        "'speaker_9': 'We don't think we should discount it completely. We think we could. If the council direct staff, I think we're planning we'd like to come back in June. To get direction from the city council to initiate re initiate those conversations with the Park District for a creation of the regional open space.'",
        "'speaker_9': 'But we don't. Those conversations may not be fruitful or they may be delayed. And so we think we should keep this wetlands but mitigation bank idea in our toolbox. We should keep it, consider it. And if at some point we think it makes sense to initiate it, you know, then we can start that up again.'",
        "'speaker_9': 'There's nothing that could that would stop us from starting that at a future date.'",
        "'speaker_1': 'Thank you. And we do have one speaker on this item, Richard Banger.'",
        "'speaker_6': 'Finally.'",
        "'speaker_4': 'Thank you, Madam Mayor, and members of the Council, especially council member Odie. Thank you for putting this on the agenda in January of last year. In fairness to the staff, they did complete this report in a very timely fashion.'",
        "'speaker_4': 'It was done, I think, in August of last year. And so I think the staff for that, it was very informative. And I think for me it illustrated something that a lot of hot ideas are not so hot after you get all the information.'",
        "'speaker_4': 'And I learned a lot from this. One thing that I learned was that this is going to take it would take almost magic, I would say, to get the state to agree to allow wetland mitigation bank to happen on public trust land.'",
        "'speaker_4': 'As Jennifer pointed out, the State Lands Commission frowns on that. If we have to go to the Assembly, I can easily see the assembly. I mean, members all over the state saying, well, we set a precedent here. What kind of future developer shenanigans might happen because of this?'",
        "'speaker_4': 'Because now it's a precedent and why not just leave well enough alone? Another issue is the no public access. Well, soon as I read that, that is completely incompatible with our white long standing vision of there being a regional park there.'",
        "'speaker_4': 'And I think one of the goals of the park should be to bring people in contact with nature, not keep them away from it. There's already about 512 acres on the VA property that is off limits currently, and I would like to see nature to be accessible to people.'",
        "'speaker_4': 'Another issue that would come up is what mitigation bank is a for profit operation, and I'm fairly certain I could be corrected on this, but I'm fairly certain that. That precludes receiving public tax money. I don't think we can give public tax money to a for profit wetland irrigation bank.'",
        "'speaker_4': 'So there goes the six and a half million dollars for the regional park. We're not going to be applying for any of that new money from the the regional ballot measure in June, if that passes. So I think there I think there is opportunity to create wetlands there that end grasslands, other natural habitat without going through this'",
        "'speaker_4': 'exercise, which we don't know how long it's going to take to even get that, you know, fully sell all those credits. And there's also another wetland mitigation bank that's about to be approved in the South Bay. And of course, they'll be they'll be ahead of us and they'll already be.'",
        "'speaker_4': 'Offering credits for sale. It's about 58 acres. So. At this point, I would say it's not a good fit for Alameda point.'",
        "'speaker_1': 'Thank you very much. Member It was your referral. Did you want to speak first?'",
        "'speaker_6': 'Let's make a couple of quick comments. I'm glad that Richard, we were finally able to hear your public comments. I know you stayed late for a couple of meetings and an agenda item got kicked. So appreciate you hanging in there.'",
        "'speaker_6': 'I do think it's a good idea to keep keep this on the table. You know, it is, you know, a 5 to 6 year project if we decided to undertake it. I mean, whereas if we actually somehow made a deal with the Park District to either give them or sell them this property, they could in turn.'",
        "'speaker_6': 'Turn it into a mitigation. Is that possible?'",
        "'speaker_9': 'Well, I think we first of all, we can't sell them the property because the state lands. When we act on behalf of the state of California as trustee to state lands, we have to maintain ownership over it. So we could only the maximum we could do would be a 66 year lease.'",
        "'speaker_9': 'And then I think, you know, that's going to be subject to the transaction. There would be a lease document and a transaction of the direction from the council were to essentially say the terms of you creating an open spaces that you can't turn around and create a wetlands mitigation mike that those could be discretionary terms that go'",
        "'speaker_9': 'into a negotiation and transaction with the Park District or the council could direct staff to say you could create it, but then we need to share 5050 in any proposal or you know, there is it would be like any other transaction that we could we could negotiate those aspects of it.'",
        "'speaker_6': 'Okay. Thank you. So just on a high level, you know, we are on the front edge of the battle for climate change and the battle to combat climate change. You know, we are at sea level will be directly impacted by sea level rise and and wetlands are a tool to help combat that.'",
        "'speaker_6': 'So I don't think it's something we should, you know, take off the table. You know, I do understand the concerns that, you know, once you put it in a bank, it becomes a passive park and you're pretty much restricted and you can't do anything on it, even trails.'",
        "'speaker_6': 'So that's something I think if we do decide to go down that path, we keep it in our toolbox and decide to do that. That merits a lot more public discussion to see exactly what type of parks we want out there, whether we want them passive or whether we want them more active.'",
        "'speaker_6': 'So, you know, these projects and just looking at the bottom line, 450,000, somebody else told me that they could be up to 600,000 or credit now. So, I mean, my understanding is the VA watch the map was up there.'",
        "'speaker_6': 'It's the spot right below. Right below.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'We were thinking of doing a mitigation bank. They actually have to provide some mitigation so they will be in the market for these credits. Is that. That's not. That's correct, right.'",
        "'speaker_9': 'That's my understanding. But I don't know for sure.'",
        "'speaker_6': 'So I mean, it could it could be a win win for both us and the VA because that's a project that we're also very excited to see come to Alameda and again. The mayor has discussed this when we've talked about leases, you know, about making sure that we maximize the value we get for our properties because this'",
        "'speaker_6': 'does belong to the public. And I think this gives us an opportunity to do that. If we keep it in our toolbox and, you know, if we're able to net $9 million from this someday, then that 6.5 million, this would be a supplement from that 6.50, that's similar.'",
        "'speaker_6': '6.5, you know, not a replacement. So, you know, I think if we somehow had 15 and a half, $16 million that we could spend on parks in the long term, that would be a good thing for Alameda. So I hope that we keep this in our toolbox.'",
        "'speaker_6': 'That's pretty much and I think, Steph, for all the hard work they've done on this.'",
        "'speaker_9': 'Can I just I just want to clarify one thing is that you can have public access. It's just that you can't count it towards the bank. So you have to kind of net that. I just want to be clear, you could have some public access.'",
        "'speaker_6': 'Like a trail, you know, walking and seeing the bird's nest.'",
        "'speaker_9': 'So that would be you'd have to net that out of it. Couldn't be counted towards the bank.'",
        "'speaker_1': 'Any other comments? Right. Then we're going to move on to item six B.'",
        "'speaker_0': 'Recommendation to appoint the nominated members of the Mayor's Economic Development Advisory Panel. Sorry to.'"
    ],
    "Appointment of Members to the Mayors Economic Development Advisory Panel.": [
        "'speaker_5': 'Good evening. I'm Debbie Potter, the city's community development director. And I am pleased to be before you this evening to request the council's appointment of the mayor's nominated members of the Economic Development Advisory Panel. The purpose of the panel is to enhance the business climate here in the city of Alameda, as well as support the city's key'",
        "'speaker_5': 'economic sectors. And when staff was considering how we wanted to best kind of use the the members of the of the panel and the way that we could most efficiently and effectively organize that panel. We had kind of three key principles.'",
        "'speaker_5': 'One is that we wanted the panel to be flexible and we wanted a flexible structure that would allow us to really look to some of the business leaders and the personal contacts they had in their in the sectors that they represented.'",
        "'speaker_5': 'We wanted to have the work of the panel be very focused. We wanted to look at ad hoc committees and ad hoc structures so that we could bring the panel as a whole together or individual members to work on very specific issues or challenges in the economic development arena, and then kind of disband until there was another'",
        "'speaker_5': 'key issue that we wanted to work on and we wanted to use the panel and its individual members in an ambassadorial role where we could really rely on them. I think that when you're meeting with a new business or working within a business who wants to expand in the city, if you have another business person talking to'",
        "'speaker_5': 'them about the the good things about Alameda and the way it is to work with staff, it's a more compelling story when you have business representatives with you so that we really saw that ambassadorial role as key, too.'",
        "'speaker_5': 'So those were some of the important items we really wanted to focus on with the structure of the panel. And then when we thought about the key activities that we would want to engage the panel with is we really wanted to be able to look to the panel to help the city with business retention, expansion and attraction'",
        "'speaker_5': 'leads and helping to make recommendations to us as a city about ways that we could enhance retention and attraction within our key economic sectors. We wanted to be able to look to the panel to help assist us with business visitations, which we try to do on a regular basis throughout the calendar year.'",
        "'speaker_5': 'We wanted this panel to be a panel of experts who could advise staff, as well as the city council, to help us on any kind of specialized assignments or recruitment activities. And once again, we really wanted that third party validation of why Alameda is such a great place to do business.'",
        "'speaker_5': 'So those were the key activities that we envisioned for the Economic Development Advisory Panel. The mayor has nominated nine, nine members of the panel, along with one what we're calling an ex-officio member who would represent the Alameda business community as a whole.'",
        "'speaker_5': 'The other members are. Each representatives of one of the nine sectors are key sectors that you see listed in the slide. And these members would serve two year terms. There is a list of the proposed members in the packet.'",
        "'speaker_5': 'It's an exhibit to the staff report and we are asking that the council appoint these members this evening. That's my staff report and I'm happy to answer any questions.'",
        "'speaker_4': 'An American.'",
        "'speaker_1': 'Vice mayor.'",
        "'speaker_4': 'I would like to see if we can. Separate out at least one of the nominees away from the vote as a number is a client of mine, and I'd have to recuse myself to avoid the appearance of any kind of favoritism.'",
        "'speaker_4': 'And one of the nominees is the CEO of Penumbra. I also have a question and a concern about having a ad hoc committee that has no agendas, no minutes, no notice, and formulating and advising the Council on Policy.'",
        "'speaker_4': 'In the past, I have tried to just to convince this Council that we should reinstate the Economic Development Commission. I think a commission is matters of economic development, particularly now. And actually, before we headed into the abyss of the great meltdown, where I think demanded a commission that has a balanced membership, that can advise the Council on'",
        "'speaker_4': 'what policies we want to make in the city with regard to economic development. And I, I can point to the Alameda Marina rezoning as as had an economic development commission looked at that. That parcel before rezoning, we wouldn't be in the mess we're in with it now, trying to save the jobs that are there.'",
        "'speaker_4': 'So I think it's really important that that that part of the work that's one of these key activities be on a commission level. So that, again, it's noticed. There's agendas, there's opportunity for the public to weigh in as those recommendations for or policy are are being formulated and the council gets the benefit of of what public.'",
        "'speaker_4': 'Participation and commissions give to us in sifting things down before it gets to this this council for decision.'",
        "'speaker_5': 'I believe that staff absolutely anticipates that when meetings are convened, those meetings would be noticed, minutes would be kept, the public would be invited. And that just like with the America's Cup, when there are ad hoc committees that are convened, we're working on updating the economic development strategic plan.'",
        "'speaker_5': 'We anticipate an ad hoc committee. Those meetings would also be noticed. They would minutes would be taken so that all of those procedural items would be would be undertaken with with this panel.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Member, Odie.'",
        "'speaker_6': 'Thank you. I guess I have a process issue on this because if you look at the staff report at the bottom of page two says the city council previously endorsed the structure and purpose of the advisory panel. And I remember this discussion and I just pulled the minutes from April 7th of last year.'",
        "'speaker_6': 'And then the presentation was to recommend to establish the Mayor's Economic Development Advisory Panel in lieu of reestablishing an economic development commission. And then there was an item there. A vice mayor at ABC moved approval of directing staff to follow the parameters of the referral reform EDC, which failed.'",
        "'speaker_6': 'And then on the call of the question, which was recommendation to establish the economic advisory panel, the question also failed. So I guess I'm not convinced that this council has endorsed the structure and this has come before us.'",
        "'speaker_6': 'And, you know, it was my memory or recollection is that, you know, it's not something that we authorized. And I'm a little concerned about.'",
        "'speaker_5': 'Well, there was there was actually an earlier action in October of 2013, and it was. That's right. And the.'",
        "'speaker_8': 'Council. Nor was the vice mayor.'",
        "'speaker_5': 'Right. The council about it. The council voted to repeal the ordinance that established the EDC and directed the establishment of the Mayor's Economic Development Advisory Panel in October of 2013, so that the action and the discussion on April 7th of last year was a follow up to that action.'",
        "'speaker_5': 'And this action is now that we've actually got the nominated members of the panel. The request is to appoint the members of the panel.'",
        "'speaker_6': 'I think we declined to establish it by our vote, defeating that motion.'",
        "'speaker_1': 'And the motion was. You want to correct me if I'm wrong, the motion was actually in support. But there there had been action taken back in October 2013. The vice mayor's referral was to move forward with the Economic Development Commission, and that failed, which means then it's what stands is the prior council's decision of October 1st, 2013'",
        "'speaker_1': ', that it's not that it's not changed because the referral failed.'",
        "'speaker_6': 'Well, that was the vote on the referral, but there was a staff report recommending to establish the Mayor's Economic Development Advisory Panel in lieu of reestablishing an economic development commission. And that question failed to yes, to no one abstain.'",
        "'speaker_6': 'So, I mean, to me, that's the direction of this council, not to create this ad hoc committee. And I think we were pretty clear that, you know, we didn't really give direction.'",
        "'speaker_8': 'Mayor, I have a question as well.'",
        "'speaker_1': 'Member Ashcraft.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'So I.'",
        "'speaker_8': 'I also concur with what Vice Mayor Ramirez's said about given the charge of this ad hoc committee to formulate policy, significant policy about the economic direction, development direction of our city. I would want that to be open and public and known by the community.'",
        "'speaker_8': 'And yet I think the next item we're going to consider or another item we're considering tonight are some proposed amendments to a sunshine ordinance. And from the description of the ad hoc committee in the staff report in your presentation, Miss Potter, this would seem to be a passive meeting.'",
        "'speaker_8': 'Passive? Because it's not a policy body that would actually. This is an advisory committee, at least under the red line version of the Sunshine Ordinance, which admittedly we haven't approved yet, but we're going to look at it. Advisory committees created by the initiative of a single member of a policy body, including the mayor or department.'",
        "'speaker_8': 'Head and passive meetings shall not include. Well. So not a my reading this correctly include a committee that consists solely of appointments of employees. Is this going to be a passive body? With that.'",
        "'speaker_0': 'I think maybe. I don't know. Assistant city attorney Roger can weigh in. Because it sounds like even if it is a passive meeting body, that staff intends on noticing it. So.'",
        "'speaker_2': 'Well, I think I think the question here really is that it's not this kind of a committee would not be required under our Sunshine Ordinance to do that.'",
        "'speaker_8': 'That was my reading.'",
        "'speaker_2': 'And we heard Miss Potter say is she's saying that that's what staff intends to do regardless of sunshine work.'",
        "'speaker_8': 'And I appreciate that. However, I think this is significant enough that we should have a better sense of what we're doing, how the noticing will take place and. And I guess the question, the overarching question that I had when I was listening to the presentation is, is there anything that is being proposed in this list of of'",
        "'speaker_8': 'I'm sorry, I'm just putting this up in the the list of. Key activities that we were just looking at that couldn't be carried out on an informal basis. If you have a question about something to do with waterfront development, is there some reason that you couldn't call upon?'",
        "'speaker_8': 'Maybe not just the proposed panel member from Power Engineer? I think it is, but maybe Bay Shipyard and put together a group, although that probably doesn't address the openness, the open meeting question. But I think I agree with Councilmember too that this is perhaps not what we had envisioned or we hadn't hadn't made a firm decision about'",
        "'speaker_8': 'what we wanted to have come back to us.'",
        "'speaker_5': 'I think that staff's understanding from that was that the referral the vice mayor made a referral twice about reestablishing the ADC and that in both instances that referral was not approved. And therefore the original action from October of 2013 to set up the advisory panel in lieu of the EDC was what stood, and that is how staff'",
        "'speaker_5': 'has been proceeding in terms of getting this this panel established. The panel itself and I would just want to clarify that the panel panel itself is not ad hoc. It's set up to be an advisory panel with the members serving two year terms, but that some of the activities that may be engaged in with would include participating'",
        "'speaker_5': 'on ad hoc committees. But the panel itself is not intended to be ad hoc. It's intended to be a formal standing panel that that is being adopted. That has been adopted in in lieu of the EDC.'",
        "'speaker_1': 'And then October 1st, 2013. At that time, the council voted to approve having a mayor's economic development advisory panel. Is that correct?'",
        "'speaker_5': 'That's correct.'",
        "'speaker_1': 'And remember, Ashcraft, you were on it then. So my at that point, do you know what the vote was? Do you know if it was unanimous?'",
        "'speaker_5': 'I believe it was unanimous. So I don't know for sure.'",
        "'speaker_1': 'And do you do you recall, aware?'",
        "'speaker_8': 'ASHCROFT You know, whether it was or whether it wasn't. There has been significant changes in our city, and we are considering it again so we can take a vote now and decide how we want to proceed. But I.'",
        "'speaker_8': 'I just I'm concerned with. The. The way this is structured.'",
        "'speaker_1': 'Member De SA.'",
        "'speaker_3': 'Thank you. Thank you, Madam Chair. When I look at the individuals who have been asked and who have agreed to participate, they represent an incredible. Group of corporations that we have here in town from the co-owner of Saint George Spirits, their distillery that many comedians love, and that is always in the Chronicle.'",
        "'speaker_3': 'So it gives great advertising for the city of Alameda. We also have a representative from Google and also the CEO from the. Medical devices company penumbra that recently located here. So there's an incredible amazing talent at that been coalesced here and.'",
        "'speaker_3': 'How I felt back in 2013 is and still prevails. I do think that we need a panel that can that's nimble and that can move quickly in addressing issues. And in, as you had said, serving that ambassadorial, serving like ambassadors to whatever companies that we want to bring into town or whatever companies that we want to keep'",
        "'speaker_3': 'in town. I have no doubt that if a panel like this was in existence even prior to 2013, the concerns about the marina probably would have been vetted from their lens and from that economic development lens. I think this is a plus for the city of Alameda.'",
        "'speaker_3': 'And if it means that, you know, we have to, in no uncertain terms, make sure that the Sunshine Act and all the Brown Brown Act provisions apply, then so be it. Because I suspect that these individuals are willing to do that.'",
        "'speaker_3': 'This is, I think. This is a benefit to the citizens of Alameda as well as the businesses. We tried the Economic Development Commission model and this is a altogether different model. I guess I would just want to close by saying, you know, I remember many years ago.'",
        "'speaker_3': 'I think it was ever since I was bought out by Abbott Laboratories and there was a possibility that that Abbott Laboratories was going to close the facility down. But we had staff. I remember, I think it was Erich von Stein.'",
        "'speaker_3': 'We were all along with then Mayor Beverly Johnson, along with, I'm sure you know, members of the of the chamber, you know, who rallied to sell Alameda. And I think it's that kind of team with that kind of incredible breadth of experience representing, you know, different successful firms in a variety of industry clusters that we have growing'",
        "'speaker_3': 'here in town. I think it's that kind of of approach to economic development that I think is sorely needed in this fast moving city versus city type of environment that we're in. So how I voted in 2013, I still feel the same way.'",
        "'speaker_3': 'I support this and I support this approach.'",
        "'speaker_1': 'Ashcroft.'",
        "'speaker_8': 'And I will just say thank you, Councilmember de like I said, you make a very persuasive argument and I could be persuaded. But my support would hinge on this specifically being a body that is subject to the Brown Act and the Sunshine Ordinance and not as a passive body, but as a policy body.'",
        "'speaker_8': 'Because I truly feel that this shouldn't just be a matter of, oh, you know, we'll have a meeting, and if we have time, we'll let people know we don't have to. And I think that's important. This is a significant enough undertaking.'",
        "'speaker_8': 'It should be open to the public. We should be transparent. So if that change can be made, I think I could go along.'",
        "'speaker_5': 'And staff concurs with that, with that process.'",
        "'speaker_3': 'So why don't we put it? Specify it. Yes. Not not into it.'",
        "'speaker_8': 'Right.'",
        "'speaker_6': 'Well, I'm still going to vote no, because I think it was clear that there was a recommendation to establish this that was not passed. So to sit here and say that we gave authority to do that and you kind of.'",
        "'speaker_6': 'Agreed with. We didn't give authority that a previous council yet totally ignoring the other motion and the result of that that vote. I mean, I think there are some fine people that are nominated, but I also think we have a chamber, we have business associations, we even have a mayor who acts as ambassador.'",
        "'speaker_6': 'So I mean, to sit there and say that we need ambassadors, you know, I think we need to focus on, as the vice mayor has said, economic development and some of these issues. And I just I just think you're kind of you're trying to pull a fast one on us, and I don't like it, so I'm not'",
        "'speaker_6': 'voting for it.'",
        "'speaker_8': 'You know, I am going to jump in here because we've had conversations before about addressing our staff respectfully. I wouldn't I think there may have been some miscommunication. I wouldn't have characterized it as such. I do see that the recommendation is to appoint the nominated members to the this mayor's economic development advisory panel.'",
        "'speaker_8': 'The vice mayor was asked if that vote could be bifurcated because he has a conflict on one member. I think the the recommendation that needs to be voted on is also to specify, as I said, that this this body falls within the the the requirements of the Brown Act and the Sunshine Ordinance for a policy body.'",
        "'speaker_8': 'Okay.'",
        "'speaker_1': 'Just a moment to make a motion.'",
        "'speaker_3': 'Well, I would like to move staff's recommendation and add the amendment that and if you want to wordsmith it even better, feel free to that. This panel fully adopt both the Sunshine Ordinance noticing requirements as well as whatever Brown Act requirements that there are.'",
        "'speaker_8': 'And I'll leave that to city attorneys in the cities to have to put it into the the correct language. I don't think that's asking too much of them. And I do think it's important.'",
        "'speaker_2': 'I guess I just want to try to be clear here. I don't really understand the difference between how we are modifying this advisory panel. It sounds to me like we're making it a commission. So I'm just a little confused with what the council I mean, my understanding, frankly, had been that this advisory panel was going to be'",
        "'speaker_2': 'some kind of a much more flexible, not formal organization. It sounds like we're trying to make it more formal. So I'm just a little confused what you want us to do.'",
        "'speaker_8': 'Okay. So if I could ask a question of your question, I what I'm looking for is so a commission, I guess, has set meeting dates, whether it's monthly or quarterly or whatever. This may be on more of an as needed basis.'",
        "'speaker_8': 'But I would still expect that there would be the sort of noticing requirements that we would have of a commission meeting. So however many days before this is this meeting is to take place in the location and all that is is specified.'",
        "'speaker_2': 'So who calls the meetings of the the the panels?'",
        "'speaker_5': 'So staff, I think the way it was envisioned that staff would convene the meetings and it could be that council gives direction that they would like the panel to have a certain issue studied, such as the zoning or Alameda Marina.'",
        "'speaker_5': 'Then staff could convene a meeting or if staff has an agenda that it would like to convene a meeting about. That is how we had envisioned it. I do agree, though, the idea was not to do a monthly meeting.'",
        "'speaker_5': 'A standing monthly meeting with the idea was to come together as needed to meet that those meetings should be open to the public, should be agenda ized. And then if there is an item, for example, that that the city wants to study a particular issue that either the council's director did or staff has, that there is an'",
        "'speaker_5': 'opportunity for individual members to serve on an ad hoc committee on a specific issue. Then that ad hoc committee would do its work. Pursuant to the Sunshine Ordinance and that with the same kind of notice seen in minutes, and then they would disband as they do under the Sunshine Ordinance.'",
        "'speaker_5': 'And that's kind of the flexibility that would be sought out if there were was a business visitation staff would be able to identify. Okay, we were looking at this, you know, this particular maritime business. We want someone from the maritime industry to come with us.'",
        "'speaker_5': 'We would access the panel for that kind of meeting. That that's the that's the idea.'",
        "'speaker_8': 'Madame Maresca So what, what is seeming apparent to me and maybe I'm the only one, but perhaps we need to send this back to staff for some, some further clarification. Otherwise we're relying on essentially minutes of the meeting.'",
        "'speaker_8': 'I mean, you've you've made some very plausible arguments, Miss Potter, but I would have liked them to have been in the staff reports with the public and the council could be aware of them. Could we ask that this be brought back with all of the input that we've heard from Council for our consideration and have a little'",
        "'speaker_8': 'better idea of what it is we're voting on?'",
        "'speaker_1': 'So I think. But. So let me ask you, is it possible to have that direction, given that we've already shared those specificities, the Brown Act, Sunshine Act minutes with the current motion? My preference would be to proceed this not necessarily the same five people, but City Council voted for this back October 1st, 2013.'",
        "'speaker_1': 'I've heard several councilmembers up here speak to how important it would have been if we'd had this commission or committee for some of these issues. And I think that it is important to get to actually start this and get the feedback from this committee, because we do have critical issues where I think we as a as a'",
        "'speaker_1': 'council would benefit from their input. So if it's possible to proceed.'",
        "'speaker_3': 'Let me raise this. I mean, because I think it's it's it's important to have all the council members if we can if we can get that. I think it's important to have all the council members give their seal of approval for this.'",
        "'speaker_3': 'Is it possible that we can move forward with accepting the nominations and then so that these persons are and the companies that they represent, they know that, you know, we want them and that that the putting a little bit more meat on the bones discussion can come back.'",
        "'speaker_3': 'I mean that maybe that's what.'",
        "'speaker_8': 'Well if it's.'",
        "'speaker_3': 'At least it sends a signal to the to the members that we're serious about.'",
        "'speaker_1': 'This. We we value represent.'",
        "'speaker_3': 'But we're just going to put a little bit more meat on the bones.'",
        "'speaker_1': 'Vice mayor.'",
        "'speaker_4': 'I think this is creeping closer and closer to a commission, which is what I thought. And the reason the reason I want it is because when we talk, it's the the ambassadorship. I'm fine. The the ad hoc committees where you get a couple of the key business leaders together is fine.'",
        "'speaker_4': 'On a specific issue, for example, how do we entice maritime concern to move here, etc.? And I think that can be that can be accomplished here with these volunteers that have it is actually a pretty impressive list. But when we're talking about formulating policy.'",
        "'speaker_4': 'That has to be publicly noticed, I think. And it has to it can't be it. But I think there's value to having to having a commission do that. The commission delivered our economic development strategic plan, and I think it's worth keeping keeping that up.'",
        "'speaker_4': 'And I think the previous commission, I am repeating myself, but I think the previous commission died its death because of of lack of direction. And I think the council has to give direction to to kind of push this, just like the council to push the need for economic development strategic plan back in the nineties in anticipation of'",
        "'speaker_4': 'of growth here so of. I'm I'm fine with with putting these folks to work again as long as it's noticed, as long as there are minutes and as long as they report back to the council again, I think it gets us closer to its you know, if it looks like a duck and sounds like a duck and'",
        "'speaker_4': 'walks like a duck, it's a duck. We're going to eventually get there. Just. Well, the Mayor's Committee on Disabilities became the Commission on Disabilities because it was important. They don't want to lose the momentum. But I do want to make sure that we have that basically balanced to nine business people.'",
        "'speaker_4': 'Nine people who are interested in it have their own stake. And then there's 70 X number, thousands of people who who may need to hear or may need to help form those discussions.'",
        "'speaker_1': 'So do you want to second his motion? Make a different motion? Where are we on this?'",
        "'speaker_4': 'Yeah, I.'",
        "'speaker_3': 'Know. I think.'",
        "'speaker_4': 'I want.'",
        "'speaker_1': 'It to sound kind of like emotion to.'",
        "'speaker_5': 'Me.'",
        "'speaker_1': 'I think somebody.'",
        "'speaker_6': 'You know, is getting to compliment her day sucks point about, you know, trying to have us come together if if we had voted to establish this committee or at least set as established guidelines on what all of my colleagues had said we wanted to do around the ACT agenda, you know, whatever, whatever, whatever.'",
        "'speaker_6': 'I'm fine with it, but I still don't think we're there yet. So if maybe we can bring back a recommendation to create something, whatever you want to call it, I don't really care as long as it does what we want it to do.'",
        "'speaker_6': 'And then I'd be fine with voting for the nine people, but I just don't. I just don't think that I just don't think that direction is there. And I I'd like to at least have a vote that says we voted affirmatively this council to create whatever advisory panel slash commission under these guidelines, because I don't think we've'",
        "'speaker_6': 'done.'",
        "'speaker_1': 'That comfortable voting yet.'",
        "'speaker_3': 'And Madam Mayor, if I can.'",
        "'speaker_1': 'Remember disagree, it's.'",
        "'speaker_3': 'Altogether possible that the nine persons who are excited about signing up, it's altogether possible that they themselves would like us to come back with an outline of how they. At a minimum, c c proceeding. So it's something that they would like.'",
        "'speaker_3': 'So perhaps the thing to do tonight is to accept the nominees. To signal to them that we're serious about this, we're excited about their companies. But also along the lines of putting more flesh on the bones. And at the end of the day, when we put more flesh on the bones, it might look like a commission, but'",
        "'speaker_3': 'it's still going to be called the Mayor's Economic Development Advisory Panel.'",
        "'speaker_4': 'Whatever it is. So the mayor with Councilmember de Sox explanation there. I would like to make a motion that we accept. Yeah. No, actually, I'll let someone else make the motion so I can recuse myself for Mr. Elsasser.'",
        "'speaker_3': 'I'll make the first motion that we accept the names of the eight members in the ninth. Not because we don't want the ninth person, but for reasons of. Possible conflict. So that would be the emotion.'",
        "'speaker_8': 'And I would second that.'",
        "'speaker_5': 'May I clarify? It's actually ten because we have the ex officio at large position. So it's it's actually ten.'",
        "'speaker_0': 'Right. Okay.'",
        "'speaker_8': 'So nine is not voting on.'",
        "'speaker_1': 'So we have a motion and a second. All those in favor I oppose.'",
        "'speaker_6': 'I'm going to abstain.'",
        "'speaker_1': 'One abstention. Four in favor. One abstention. And now. Yes.'",
        "'speaker_4': 'Technically it'll.'",
        "'speaker_8': 'Be a.'",
        "'speaker_6': 'And I don't know what we're.'",
        "'speaker_1': 'Yes.'",
        "'speaker_8': 'So so I'll move that Adam Elsasser of Penumbra be nominated as the member of the is it biotech or his biotech. Right. Could be health care, too, but I know his health care. Okay. So biotech. Okay. It's been moved.'",
        "'speaker_1': 'Okay. All those in favor I oppose. Abstain.'",
        "'speaker_2': 'Abstain.'",
        "'speaker_1': 'Passes, three in favor, one abstention.'",
        "'speaker_5': 'And remember, vice.'",
        "'speaker_1': 'May or may return. He counts as an abstention.'",
        "'speaker_0': 'Then absent. Absent of.'",
        "'speaker_1': 'All right. Thank you. So now we're going to move on to.'",
        "'speaker_4': '61, so why.'",
        "'speaker_5': 'Don't you. No.'",
        "'speaker_2': 'I'm sorry.'",
        "'speaker_4': 'Yeah, yeah, exactly. I'd like to make a motion that we send. The issue of the structure of this committee back to staff to ensure that the points that were raised, particularly around the formalities that are required by the Brown Act, the formalities that are that are associated with keeping minutes and providing agendas and public records are considered'",
        "'speaker_4': 'and brought back as a. That's a direction for how this committee will function and what its obligations will be.'",
        "'speaker_6': 'Second.'",
        "'speaker_1': 'All those in favor.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Motion carries unanimously. Thank you.'",
        "'speaker_5': 'And may I ask one clarifying question? So regarding policy, from a staffs perspective, the panel would never undertake any policy analysis or consideration unless directed to do so by the City Council, and that when that direction came, then panel would undertake that analysis and come up with those recommendations to return back to the Council is that I'",
        "'speaker_5': 'want to confirm that that's the sense of the Council to about how policy recommendations and policy analysis would be approached.'",
        "'speaker_3': 'Well, you said.'",
        "'speaker_1': 'That.'",
        "'speaker_3': 'You said never. But my sense is you got 9 to 10 people with incredible insights and experience. So they themselves might have some policy ideas that want they want to percolate up to council vice mayor.'",
        "'speaker_4': 'And to that point, as part of having that talent in the room on public display with public input and public comment is to me the real value of getting that back to it. So I don't want us to be the sole source of that.'",
        "'speaker_4': 'This is why we we've assembled the talent and we're grateful that they've volunteered. So I'd say that the answer is no is that the the policy can come from a direction can come from the council, but it can also come from the committee.'",
        "'speaker_1': 'But I also want to thank staff and all these business leaders that have stepped up to serve the city.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Good luck.'",
        "'speaker_1': 'All right. Our next item six C.'",
        "'speaker_0': 'Introduction of ordinance amending the Alameda Municipal Code by amending adding a deleting sections of Article eight Sunshine Ordinance of Chapter two Administration concerning local standards to ensure public access to meetings and public records.'",
        "'speaker_4': 'Keep put up the PowerPoint.'"
    ],
    "Ordinance Amendment on Sunshine Ordinance for Public Access. ": [
        "'speaker_0': 'Oh, there's PowerPoint. All right. All right. I don't like. Oh, I'm sorry. I don't think it was attached to sir. I had the ordnance red line and then the current ordnance and the staff report in the open government minutes is there.'",
        "'speaker_4': 'Well, there was but that but I think we can I think we can probably do without it. I'll get through the report.'",
        "'speaker_1': 'Do you want to see the red line? But you want to get through that? Okay. Absolutely. Exhibit one.'",
        "'speaker_4': 'Sure.'",
        "'speaker_1': 'I think that might be.'",
        "'speaker_4': 'It's not on.'",
        "'speaker_8': 'Yeah. Yeah. We don't have a problem.'",
        "'speaker_1': 'Should pull up exhibit one, the red line. I can just walk through that. That'd be great.'",
        "'speaker_4': 'Madam Mayor, members of the council, Michael Roush from the city attorney's office, this matter as the amendment to the Sunshine Ordinance is back in front of you. It was before the council back in October of 2015. The council looked at a number of changes at that time, accepted some and sent some back to the Open Government Commission'",
        "'speaker_4': 'for its consideration with a recommendation back to the Council. There are three major items that the Council wanted the Commission to look at further, and those are the items that I will address tonight. The other parts of the redlined ordinance I certainly can come back to if anyone has any further questions about that.'",
        "'speaker_4': 'Well, let me focus on the three major items and those items being the use of electronic devices at meetings. The amendments to the provisions concerning responsive responding to Public Records Act requests. And the third item having to do with the training.'",
        "'speaker_4': 'The Council will recall that we had recommended that the prohibition on the use of electronic devices be fairly broad so that they would not be able to be used at the meeting. Council had some concerns about whether or not that was unnecessary, if the prohibition was too broad.'",
        "'speaker_4': 'And so we sent the matter back to the commission for it to look at, and it came back with the language for that section that essentially reads very succinctly in order to ensure that all communications to policy board members presented in a public meeting are shared with the Public Policy Board members are prohibited from communicating electronically with'",
        "'speaker_4': 'others during public meetings that pertains to the business thereof. This is in section 2.91891.4 Subsection H. And so we would recommend, based on the commission's recommendation of that, that that language be adopted, but with one slight change, and that would be after the word meetings that we add about matters.'",
        "'speaker_4': 'So the last part would read the policy board members are prohibited from communicating electronically with others during public meetings about matters that pertain to the business thereof. We think that will make the sentence read a little better, clarify it.'",
        "'speaker_4': 'And so we would recommend that be a slight modification to what the Commission recommended. The other primary change is in section 2.9, 2.2, talking about the circumstances under which public records must be provided to people who request them.'",
        "'speaker_4': 'Currently, the way the ordinance reads is that there is a very short time frame or for the city to respond when a person makes a request for public records. Basically within a three day period informing the person who, how and when those documents will be presented, that could be a trap for the unwary.'",
        "'speaker_4': 'For example, if a a for example, one of the requests came to a an elected official who may have been out of town and would know about it until he or she got back. It would be a technical violation of the ordinance.'",
        "'speaker_4': 'And certainly that's not the intent of what this ordinance is supposed to do. So what what the commission has recommended is that that that language be deleted from the ordinance, and instead the language in the Public Records Act be inserted, which basically still provides a barrier, a very short time frame in which to provide those records basically'",
        "'speaker_4': 'ten days, but also allows for the records to be produced in a slightly longer period of time when there are unusual circumstances and the ordinance defines what those unusual circumstances are. For example, if the records are very voluminous or if they have to be obtained offsite and again, we paraphrase what's in the Public Records Act itself.'",
        "'speaker_4': 'The the final area. Has to do with the with the training section. Currently, the ordinance provides that there will be annual training on the Sunshine Ordinance. As much as everyone loves the ordinance, I would like to have that annual training.'",
        "'speaker_4': 'It probably is an overkill situation. So we are recommending that it be done every three years rather than every year. We typically tape those recordings or tape those presentations so that as people are hired by the city who are required to review the ordinance or as people are appointed to policy bodies or new council members come on'",
        "'speaker_4': 'board, they can review that so that they'd be up to speed in terms of what that ordinance provides. So with those being the three major changes, the Commission is recommending that the ordinance be amended as set forth in the red line version, and I'll be glad to answer any questions about those changes or any other changes.'",
        "'speaker_1': 'Clarifying questions. We do have one speaker. I'm going to go ahead and call the speaker then at this time, Irene Dieter.'",
        "'speaker_0': 'Hello, Mayor. City staff and City Council. As a member of the Open Government Commission, I wanted to thank you all for your very thoughtful discussion last time on this issue and for taking the consideration of the Commission's input.'",
        "'speaker_0': 'I really appreciate it. It actually broadened my perspective of different areas within the ordinance, and it also showed how advisory bodies in the city council can work meaningful, meaningfully together to accomplish the task at hand. I'd also like to thank the City Attorney's Office for working to synthesize all the input that we made and going into all'",
        "'speaker_0': 'the intricacies of every little detail. I really appreciate that. And the one thing that I wanted to talk to you about is I think there's one mistake that is in the red line version and understandably so. I it was pretty hard.'",
        "'speaker_0': 'We talked about public discussion, public comment in a couple of provisions within the Sunshine Ordinance. And I think there may have been a mistake about not deleting one little section in the ordinance by accident. If you even look at the minutes of February 2nd and March 30th in your packet, it explains the whole conversation of the commissioners'",
        "'speaker_0': '. So that one section that I'm referring to is on public comments by members of public bodies, which is 2-91.17. City staff had recommended that there be language added to that provision and of the thoughts that were the recommendation that the commissioners expressed was contrary to that, that we didn't think it was conducive to the Sunshine Ordinance to'",
        "'speaker_0': 'admonish volunteer board members that they can be removed by the city council, particularly in such a positive document, and particularly because it's under the public comment section. So I do think it was an oversight and I think it should remain committed.'",
        "'speaker_0': 'And I hope that you agree. And if you're unsure about it, the Open Government Commission can always look at it on the next go around of edits to the ordinance. So other than that one sentence, I urge you to take steps, recommendations from the Open Government Commission.'",
        "'speaker_1': 'Can you clarify? Are you speaking what sentence? The one that's in red?'",
        "'speaker_0': 'Yes, the one that shows that it's been added.'",
        "'speaker_8': 'All right. The one that talks about the removal. Right. Thank you. A bit harsh.'",
        "'speaker_1': 'Yeah. All right. That being said, any other questions, Vice Mayor?'",
        "'speaker_4': 'I agree with the speaker in that section. Should. I would like to see it deleted. I hope my colleagues agree with me and also on the the training section. I'd like to have my colleagues consider adding a training when the ordinance is revised.'",
        "'speaker_4': 'And I think you can say every three years, but I think there should be some sort of notification or training upon revisions, and we would agree with that. And just coincidentally, assuming that these amendments were passed, we certainly have training planned for this summer that will discuss the whole ordinance as well as these amendments.'",
        "'speaker_4': 'May I suggest that perhaps that that training occur when there, say, substantive or significant substantive changes to the ordinance? I mean, there may be some tweaks here and there that may not necessarily trigger the need for the training.'",
        "'speaker_4': 'But certainly when you have these kinds of revisions, we would certainly think that would be a good idea. I'm amenable to that. Yes.'",
        "'speaker_1': 'Thank you. Member Ashcroft.'",
        "'speaker_8': 'And so I am. I agree with Miss Dieter. And by the way, in reading the minutes, I really appreciated your comments. I thought they were very well stated and persuasive on this Section two, dash 2.91, Dash 17 Public comment by members of policy bodies.'",
        "'speaker_8': 'Notwithstanding that language, there is still the direction that we as members of the City Council have had that if we were to say, attend, oh, a planning board meeting and say express our opinion about some matter pending before the planning board that then comes to the city council, that could create a problem for us of a different'",
        "'speaker_8': 'kind. Is that something separate and apart from the Sunshine Ordinance?'",
        "'speaker_4': 'Correct. The the issue that that you raise is whether or not an appearance before an advisory body, let's say, with respect to a quasi judicial matter in particular, and and a council member expresses a viewpoint there. And then that matter comes to the city council, whether or not your participation would be construed as undue bias, and that'",
        "'speaker_4': 'might be a problem. Section 91 two, Dash two, Dash 9117 really doesn't address that. It really seems to go to a somewhat different issue, but the point you raise is valid. But the sunshine on this doesn't really address that.'",
        "'speaker_8': 'Right. And I think it's covered in case law in other other areas that the point I raised. Okay.'",
        "'speaker_1': 'And so any other questions or comments from Council member Jody?'",
        "'speaker_6': 'So if if we do take out that entire sentence on 2.91, just 17. The.'",
        "'speaker_8': 'It's the part. It's not the whole section. Yeah. The sentence.'",
        "'speaker_6': 'The part that says. Nothing. Nothing shall be construed to provide rights to appointed policy members beyond those recognized by law or to create any new private cause of action. I mean, is that something that we might want to keep in there?'",
        "'speaker_6': 'I mean, I agree that if you have something in the charter that is there, there's no really need to reference it because it's kind of like overkill and it is kind of a little bit kind of pointless to get somebody.'",
        "'speaker_6': 'But is there some some reason why that second part of that sentence is in there?'",
        "'speaker_4': 'Well, I think it it certainly wouldn't hurt to have that in there. I think the idea is that this section expresses the idea that that advisory body members and policy body members have the right to express an opinion.'",
        "'speaker_4': 'But we certainly don't want to necessarily create some sort of. Right. Should the council take action under the charter section to remove someone that someone would then say, Well, I now have some kind of vested right or some sort of liberty interest, which now you've created, that would then give me a cause of action to litigate against'",
        "'speaker_4': 'the city. So I would agree with Council member Ody that if you take out even if you take out that introductory clause, that you leave the rest of it in just as a belt and suspenders approach.'",
        "'speaker_6': 'And nothing in this section shall be construed to provide correct rights to blah, blah, blah.'",
        "'speaker_4': 'Leave it. Leave it there to the end.'",
        "'speaker_8': 'It's actually sorry. It's actually referring to section 10.10, dash nine of the city charter. So I will leave it to the legal eagles to reword it accordingly, because you can't just make that clause the sentence.'",
        "'speaker_4': 'We'll have to tweak that a little bit. But if the concept remains, if the council is an agreeable to keeping the concept, then we can work that language in appropriately.'",
        "'speaker_8': 'I think it's a point well taken.'",
        "'speaker_1': 'I think we need us.'",
        "'speaker_2': 'I think we need to get the language, though, because this is first reading. If you want to go through that, another first reading. So perhaps if I understood what you're suggesting, Councilmember, is that in the read section, we would delete the in that in that section two nine going down one, two, three, four lines and adding nothing'",
        "'speaker_6': '. Well, adding something that, you know, prefaces that. Nothing.'",
        "'speaker_2': 'Nothing in this section.'",
        "'speaker_6': 'Nothing in this section or nothing in the charter shall be.'",
        "'speaker_2': 'Construe, construe to and then pick it up with. Nothing shall be construed to provide rights to.'",
        "'speaker_6': 'Something like that. Just so. Yeah. I mean, that part, I think, has some value.'",
        "'speaker_1': 'So I swear.'",
        "'speaker_4': 'I. I'm I'm I'm not seeing too much value in there because it's already by law. So the entire red line section from in that section 10.9 all the way through new private cause of action, I would say just delete it.'",
        "'speaker_1': 'That would be my preference. My preference is to delete it. And I think that that's what.'",
        "'speaker_4': 'The and we're addressing a problem that's not there. I, I think.'",
        "'speaker_1': 'So at this point.'",
        "'speaker_6': 'I'm just concerned that we're going to has the city attorney said they were going to create some private cause of action, that if for some reason the city council did remove somebody that could say, they could say I was removed for exercising my free speech rights.'",
        "'speaker_1': 'This is under public comment under a section of public comment. And I would I would support the Open Government Committee's discussion on this and value that. And at this point, we've had a representative and we know we share their that sentence in its entirety to be stricken.'",
        "'speaker_1': 'I would agree with that.'",
        "'speaker_6': 'But I mean, I have a right to have a differing opinion and I just want to protect the city from.'",
        "'speaker_1': 'So is there a consensus to honor the work of the prior committee with this report to us or to make this change?'",
        "'speaker_6': 'But if I would, I would characterize it as that. I think I'm perfectly fine taking out the part that refers to the city charter and the note the mention of the council being able to remove somebody. But I think there should be we should at least provide some protection that we're not giving anybody any special right or'",
        "'speaker_6': 'creating any cause of action.'",
        "'speaker_1': 'Is that not true, then, with every one that serves on anything, I mean, why would that even be necessary to be included? You can always say you're not giving anyone one any additional rights for any reason unless it is actually affirmatively stated that you are providing that.'",
        "'speaker_1': 'I'm not sure why you would need to say that you're not.'",
        "'speaker_6': 'That's a belt and suspenders as the city.'",
        "'speaker_4': 'If if the council would like to leave it in, it should read something along the lines of. Nothing in this. Nothing in this section concerning the exercise of a member of a policy body to make public comment is intended to remove the council, is intended to prohibit the council member, etc..'",
        "'speaker_4': 'That would be again, I think that gives the cat, the council and the city the most protection. But is it critical? I mean, I don't think it's critical. I think it gives you more protection than not having it.'",
        "'speaker_8': 'And may I make one suggestion? So what I would just do is I would remove all the reference to nothing, you know, is intended to prohibit the council from removing a member. But I would say no sentence, nothing in this section, because we've already discussed what the section is about in the first sentence.'",
        "'speaker_8': 'So nothing in this section shall be construed to provide rights to appointed policy body members beyond those recognized by law, or to create any new private cause of action. And I do think that's just a good safety precaution.'",
        "'speaker_8': 'As you know, we do get sued. And so it's I don't and I don't think that that has any kind of harsh implications back to the policy body members.'",
        "'speaker_1': 'So I appreciate that. I actually don't know when this city was sued by an appointed policy body member. And I am and I'm considering.'",
        "'speaker_8': 'The standard.'",
        "'speaker_1': 'I'm concerned with that suggestion that that's actually a concern. So do we have a motion to make? You had a motion, right?'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Did you? I will put one in. Yes. I moves that we adopt the. Ordinance presented with the exception of removing the red line section and 2.91-17 into. To consider adding the words to. A required training session when there are substantial, substantial revisions to the ordinance.'",
        "'speaker_1': 'Then I think staff had set about to add the words about matters to subsection H.'",
        "'speaker_4': 'Earlier to include that. As described by Mr..'",
        "'speaker_3': 'Rausch, an American. All right. I have a question for our staff member. Question for the staff. So what is ultimately staff's recommendation with regard to this discussion that we just had? I mean, whatever staff recommendations I'm fine with.'",
        "'speaker_4': 'Well, I think again, I think that Councilmember Ashcroft's suggestion is is a good one for providing. Support for a situation where there could be some type of litigation filed because somebody might be removed based on public comment is a critical.'",
        "'speaker_4': 'The answer is no. Is it better? In my opinion, the answer is yes.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'So my concern with that would be that it could be chilling to members of the public to actually serve and then to speak, which is actually contrary to what we're trying to do here. We're actually speaking specifically that we do allow members of public bodies to also speak.'",
        "'speaker_8': 'And that's what this.'",
        "'speaker_1': 'Is about.'",
        "'speaker_8': 'With The Voice.'",
        "'speaker_4': 'I tend to agree with that because I think there's a problem. It's a problem we don't have and we've never had. I think the risk is low. It's always better to pile on protections, but then it becomes unreadable or not comprehensible.'",
        "'speaker_4': 'So I think the risk is low enough to excise the entire section that was red lined in.'",
        "'speaker_1': 'So there's the motion of. I'll second it. All those in favor.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'All those. And I suppose.'",
        "'speaker_3': 'I'm going to vote no and.'",
        "'speaker_1': 'Nothing. So a motion fails. Two in favor, three oppose. There another motion.'",
        "'speaker_8': 'I will make the identical motion that the Vice Mayor made with the friendly amendment that we include. The clause that I had stated in my comments.'",
        "'speaker_1': 'Their second.'",
        "'speaker_6': 'Second.'",
        "'speaker_1': 'Although some favor.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Oppose no oppose. So three in favor to oppose motion carries next item six d.'",
        "'speaker_0': 'Adoption resolution, adopting an addendum to the Certified Final Environmental Impact Report for the Army to point project for a new ferry Terminal Lagoon in Alameda Point approving a memorandum of understanding between the City and Water Emergency Transportation Authority and provide a framework for collaboration on funding operations and maintenance of the ferry terminal and approving a ferry terminal'",
        "'speaker_0': 'plan. Yes. All right.'",
        "'speaker_9': 'Good evening, Mayor. Councilmembers Jennifer Bass, news director. We're here to ask you to take two or three actions tonight, all related to implementing a new ferry terminal at the seaplane lagoon at all points. So the three actions are approve seaplane lagoon ferry terminal plan approved memorandum of Understanding with the Water Emergency Transportation Authority and then adopt an'",
        "'speaker_9': 'addendum to the army to point the air. A little bit of background. The reason we're doing a ferry terminal plan, other than it makes sense to have a plan when you're moving forward with trying to obtain funding and other things, is that the disposition and development agreement the city entered into last year with Alameda Point Partners contemplated'",
        "'speaker_9': '? This is an important step. It was very important to AMI to point partners to facilitate the development of a new ferry terminal. And we'll talk about why on another side and as well as part of the city's plans for for the base to have a ferry terminal.'",
        "'speaker_9': 'And so it made sense to jointly develop together as partners as part of this DDA, this planning effort to start to work towards that Sea Plan Lagoon Ferry terminal. And so became kind of a essentially a condition to closing on the land as a condition that both parties agreed to to work together to adopt a ferry terminal'",
        "'speaker_9': 'plan. So that's what you have. That's one of the actions you have before you tonight. And the other is the memorandum of understanding. And this is really in line with having we, the Public Water Transit Agency in the Bay Area, provide that service for us, just like they do at Main Street and Harbor Bay.'",
        "'speaker_9': 'And part of in order to essentially move forward with a new location and expansion of ferry service, there's a policy that the water merchants wish to has that requires this kind of a number of steps that you follow and trying to implement that new service that they've adopted as part of their expansion policy.'",
        "'speaker_9': 'And one of those key steps is to adopt enter into a memorandum of understanding. And so that's why we're here tonight with that menu. And we'll talk more about each of these. Also, just as as a side note, and we'll talk a little bit more about the money.'",
        "'speaker_9': 'But our main point partners as part of their disposition, a development agreement agreed to provide a $10 million upfront contribution towards the construction of that new ferry terminal. The benefits. I want to stop and kind of do a little bit big picture before we get into the details of each of these documents.'",
        "'speaker_9': 'But there's a number of reasons. And when we the staff came to you with the site project in June, there were a big part of this was really focusing on the ferry terminal and the importance of it and all the benefits for not only, we believe, for the city, but for the developer and for the Water Emergency'",
        "'speaker_9': 'Transportation Authority. And this kind of combines all of those. But the from the city's perspective, why staff is recommending this to you tonight is really, we believe, as part of this strategy of getting people out of their cars developing.'",
        "'speaker_9': 'And I'm at a point in a smart way that really minimizes traffic impacts and congestion as having a transit hub at the heart of Alameda Point is an important component of that. And to do that as soon as possible so that you are attracting residents, attracting employers that are coming to the site because you have a ferry'"
    ],
    "Resolution on Ferry Terminal at Seaplane Lagoon at Alameda Point.": [
        "'speaker_9': 'terminal, because there is ferry access to San Francisco, so that you're attracting people that are already predisposed to using transit. And so that is a key component of our overall transportation strategy and a key benefit to having that ferry terminal at the Sea Planet, going within walking and biking distance, but primarily walking distance of where the residents'",
        "'speaker_9': 'are going to be concentrated, where the jobs will be concentrated. We believe that from an economic development standpoint, maybe these should have been switched in terms of priority for our benefit. I believe they're really one of the major benefits is attracting a commercial users and jobs.'",
        "'speaker_9': 'Here is the number one thing that we hear when we talk to potential users is when is the ferry terminal coming and you know, when what year is it going to operate? You know, how far along is all these questions?'",
        "'speaker_9': 'And it was the first thing that both the developers that were finalists for our site asked when we want to talk to you about the ferry terminal, we want to provide funding towards the ferry terminal because we see that as a key component of our our project.'",
        "'speaker_9': 'And we believe if we're going to replace those jobs and really create an employment center at Alameda Point, the ferry terminal is a key, crucial component to that in attracting those jobs. We also believe, you know, get into the kind of nitty gritty of traffic congestion and obviously minimizing those peak hour vehicle trips.'",
        "'speaker_9': 'The general the city's general plan requires that these developments meet certain trip reduction goals. Those goals can only really be met if there is fast and frequent service being provided. Obviously, ferry is not the only thing we're doing.'",
        "'speaker_9': 'We're kind of a belt and suspenders approach, but the ferry is a key component of that. An idea is that you have, by having a ferry run in those peak hours, will be minimizing those peak hour trips to the tubes and through the other island crossings.'",
        "'speaker_9': 'From Rita's perspective, one might ask, Well, you know, why would we to do this? There's a there's the way that this is set up is not to replace the main street terminal, but essentially to supplement that service, be able to actually coordinate those two services, have seaplane really provide those.'",
        "'speaker_9': 'The service focus is more on the peak our main street continue to do peak hour but also have those connections with Oakland and you're able to kind of create a consolidated Western service that expands landside improvements. So parking, which we know is a concern, you're able to add more parking at Alameda Point, which allows them to draw'",
        "'speaker_9': 'more riders and you're able to do all of that without undermining Oakland service, because the Oakland service essentially depends on the main street service in Alameda. And if we were to replace it or relocate it, it would be very difficult to sustain that Oakland service.'",
        "'speaker_9': 'You're able to maintain the Oakland service, which helps support those midday trips at the same time create a new service that really takes advantage of the development that's planned at the base. As everyone knows, you read the newspaper here about this.'",
        "'speaker_9': 'There is a trans bay crisis now with getting people across the bay. BART is essentially at capacity. We believe we're, of course, biased, but because I mean is an island. But we believe ferry's is really one of the the major important solutions to that problem near-term and long term.'",
        "'speaker_9': 'And this essentially creates a new corridor, a new Transbay corridor, possibly with connections to Mission Bay in the future, where there's a major employment centers there, all kinds of potential there by creating a new transit corridor that doesn't depend on building a second tube under the bay, you know.'",
        "'speaker_9': 'And so we think this is a essentially cost effective way to really increase those transbay trips. And then from an endpoint partners standpoint, we already mentioned this, but this is a key part of their business plan to enhancing value, to support all the infrastructure that they committed to this project, all the perks, and really create enhanced marketability'",
        "'speaker_9': 'for all of their land uses the retail, the housing, the commercial. Having that ferry is a key component to their business plan and their development being successful. Where are we planning this? So we have this here. It's this is that you can see this is kind of site a up here.'",
        "'speaker_9': 'It's planned down here. And I'll talk a little bit about it's kind of at the terminus of where Pacific Avenue would continue through these buildings and hit the seaplane lagoon. There's a number of reasons that we chose this particular location.'",
        "'speaker_9': 'It wasn't just random. We believe number one is what they find, the transportation experts say, is that it's people are more willing to they're willing to walk further from their homes to transit than they are from transit to their jobs.'",
        "'speaker_9': 'And so we wanted in order to really create the incentive for the enterprise district in attracting the jobs to locate that ferry terminal, essentially at the heart of the enterprise district, to make it walkable to the jobs. And so and let the people who are living inside walk a little further to the to the ferry terminal, but'",
        "'speaker_9': 'really try to maximize the benefit for the job attraction. It minimizes conflicts of other uses. Unfortunately, this picture. And I think if if you're essentially you take this specific avenue that comes through here, you're you're having the ferries come in and then they're essentially come through this breakwater and they just pull right in here.'",
        "'speaker_9': 'That allows you to have other uses. We know there's been concerns and questions about making sure that the ferry doesn't interfere with recreational uses. This essentially preserves the majority of these 110 acres, which is the lagoon, about 110 acres for recreational users, and allows the ferry just to kind of sneak in here right to the terminus and'",
        "'speaker_9': 'avoid conflicts with other uses. And then this is turns out to be very important from a cost standpoint. But but this location and the design of the ferry terminal has been in place to avoid dredging. And dredging is extremely expensive.'",
        "'speaker_9': 'It's gotten more expensive over the last couple of years because of the regulatory policies of how to dispose of sediment that you dredge up. And so this design is essentially because there's very little shoaling or kind of buildup of sediment in the lagoon.'",
        "'speaker_9': 'We're able to design a ferry terminal pretty easily to avoid dredging altogether, which is a big benefit to being able to keep our costs down. So what are we proposing? We're proposing a service that's one essentially one dedicated vessel for Seaplane Lagoon, commute oriented, focused in the morning and afternoon evening commutes.'",
        "'speaker_9': 'So a minimum of three peak departures in the morning and two reverse peak departures from San Francisco, three departures in the evening. And then to reverse peak departures, no weekend or midday service initially. Really that's with the strength of the main street terminal.'",
        "'speaker_9': 'Is are those mid-day and weekend services because of the connection with Oakland that has a lot of regional transit with BART so a lot of Oakland service is actually the weekend midday service. And so we see that really probably staying at Main Street for the foreseeable future and then commencing in 2020 would you know, getting through all'",
        "'speaker_9': 'and I'll show you a schedule, getting through all the permitting and finding all the funding that we don't yet have identified, needing that time to do that to be able and keeping that 2020 date. So what are we talking about?'",
        "'speaker_9': 'We're talking about waterside improvements that are really more permanent in nature, where you're talking about abutment and pier gangway, boarding float, all adapted to sea level rise about 36 feet above a 100 year flood as part of the permanent improvements.'",
        "'speaker_9': 'So those are all the in-water improvements. And then landside we really to keep our cost down and to keep those connections we needed. We needed the city and Bccdc and some of the rail trades and the developer too, to know that there was a safe, accessible connection between site, each phase of site and the ferry terminal.'",
        "'speaker_9': 'And so there has to be landside improvements that make it easy to bike, walk, drive and then have a parking lot that is temporary in nature for now. Ultimately, when site gets developed, we really want to minimize the level of improvement here because we do expect this ultimately with site be being developed to get moved farther south'",
        "'speaker_9': 'when the new street work network gets put in and all of those improvements get made, the permanent waterfront improvements, which will include very extensive waterfront promenades and things like that. But to minimize the cost of these improvements on the interim, in the interim, but still create those safe and accessible connections between site A and the ferry terminal'",
        "'speaker_9': '. So 400 space parking lot, a transit stop drop off area, very important. We've talked extensively with AC Transit about providing service to the ferry terminal and making sure that they have the ability to turn around here. So all those things that are really going to try to create that intermodal connection and minimize car usage.'",
        "'speaker_9': 'So this is a schedule it's hard to see. We have a design going on right now for permitting and then ultimately would have a more detailed design for construction. Permitting is very extensive 18 to 24 month process through all the different regulatory agencies were commencing that.'",
        "'speaker_9': 'But this is really the beginning of that and then construction we actually have two windows because there's a very short work window that you each year that you can do work in the water. We put one in 2018 in the event that we everything just goes perfectly and we get all the money and we're able to make'",
        "'speaker_9': 'it happen and maybe we construct in 2018. More likely we're constructing in 2019 in order to obtain all the funding that needs to get done and then commencing operations in 2020. Use of funds. So I want to spend it's kind of washed out.'",
        "'speaker_9': 'I want to spend a little time in me. I think this is not a cheap endeavor by any means. And that's I don't think you we're looking at for the actual construction cost, about $18.2 million, including the ferry terminal, IN-WATER, improvements in the landside costs and which is probably on a relative level.'",
        "'speaker_9': 'It's actually not I mean, that expensive, believe it or not, for ferry terminal, but especially being able to avoid dredging but still a lot of money. And we'll talk about the funding vessel procurement at about $16 million, $60 million.'",
        "'speaker_9': 'That's based on a recent acquisition of a ferry, a new ferry. So that's probably a pretty a pretty good number. And then annual operating subs is a minimum of 1.8, could be more depending on a number of factors, but those are the cost of the funds.'",
        "'speaker_9': 'Now, let's talk about I guess the most important question was how you're actually how we're actually going to fund this. And the reality is, at this point, we have of those costs, we have about $10 million identified from the developer.'",
        "'speaker_9': 'We the has identified funding through Prop one be most likely using probable and B funds for the vessel procurement. All of that hasn't been set in stone yet because Prop one B varies year to year. And so it's not entirely clear that they'll have all that funding, but they think they will and would be procuring the boat'",
        "'speaker_9': 'through those Prop one B funding. And then there's annual subsidies that we expect to get through what's an ARM three, which is in regional Measure three? So that's essentially a it's actually sorry, these two are combined a bridge toll measure or a regional gas tax measure.'",
        "'speaker_9': 'We do think the region, because of all these transbay issues, is really looking at ways to enhance both bus and ferry service in the interim, because enhancing BART service is a really expensive endeavor that could take many, many years.'",
        "'speaker_9': 'And so I think they're starting to look at other transit services and that benefits Alameda because we don't have our we really depend on ferry and busses. So I think that's going to help us. And we do think those those regional measures will occur and that we do think we'll be able to get sufficient operating dollars from'",
        "'speaker_9': 'that. Does I can't stand up here today and say that it's guaranteed that we have it all figured out. We don't. But we think it's a real these are realistic projections of 2020 I think we did as to but there's a lot of things that have to fall into place.'",
        "'speaker_9': 'And we see this these actions tonight being the first step in moving us closer to that that goal. And with honesty, without a plan and without an M.O., you know, we have very little chance of getting that funding and making this happen.'",
        "'speaker_9': 'So we see this as an important step to to tell the region, to tell the federal government. We're actually submitting in the next couple weeks a Tiger grant to try to get the construction dollars for the remaining money for the ferry terminal, but to tell the whole region, the federal government, hey, we have a plan and we've'",
        "'speaker_9': 'got you know, we've got a schedule, we've got a budget. We know what we're doing here. We've got an Emmylou with a provider. And so we are a reliable source, you know, eligible and reliable recipient of your funding.'",
        "'speaker_9': 'And that's important when there is limited grant funding and these things are very competitive. So having these actions take place before we obtain that funding is important, but also but it is uncertain and it is competitive and we're going to do everything we can to make this happen.'",
        "'speaker_9': 'So the wider M.O., you just quickly, that's kind of the plan, the ferry terminal plan, the M.O., you is really just is an agreement between Rita and the city to say, hey, we're going to expand to Sea Plan Lagoon here.'",
        "'speaker_9': 'Basically, what we have in the ferry terminal plan, we're going to provide the service. We're going to have this parking. You know, it's very important to we did have those landside improvements. They see parking, you know, and we're going to talk more about that, I'm sure, later tonight and on Thursday night as well.'",
        "'speaker_9': 'And but but this is really important for I think for the city, is that we to take an action to say we're prioritizing Sea Plan Lagoon, we have an M.O., you add them, we're going to move that forward.'",
        "'speaker_9': 'And I think something that, you know, we do is going to comply with us on our Tiger Grant. And without this memo, you most likely wouldn't be able to do that. So they need to have this assurance of the menu.'",
        "'speaker_9': 'And then they we've agreed to support each other's efforts to secure funding. And in response, you know, when we are trying to obtain funding through another source or regional measure, we're going to be there by their side advocating for ferry service to help them.'",
        "'speaker_9': 'And so that's part of what this memo does, is create this partnership between the two agencies to to move the Seaplane Lagoon Service forward. Again, this is our recommendation. There's actually I'd just like to say, you know, I'm a new project manager, Michelle Giles, who's with me, who's worked very hard on this.'",
        "'speaker_9': 'And so she's here tonight and I want to appreciate her work on this. And then we also have Kevin Connolly with Rita that would like to say a couple of things. And then we also have Joe Ernst with our point partners.'",
        "'speaker_9': 'We'd like to take a couple of minutes if you're okay, to just talk a little. At about the importance of this action tonight.'",
        "'speaker_1': 'Okay. Well, we do have like six speakers, but one of them is actually Kevin Connolly. So if they're going to speak, if they could keep their comments brief or I could go with the public speakers.'",
        "'speaker_9': 'Okay. I'll defer to him, too, to determine that. You want to start?'",
        "'speaker_8': 'Oh, and I would just ask that we not limit Mr. Connelly and Mr. Ernst to 3 minutes because they're more than just public speakers. They have skin in this game. So, you know, I consider this part of the presentation.'",
        "'speaker_4': 'I'm happy to beat the estimate of 3 minutes anyway. Madam Mayor and council members, I'm happy to be with you tonight. My name is Kevin Connolly and the manager of transit planning at the Water Emergency Transportation Authority. I just want to kind of want to be here to support the proposal by your staff, to really commend the'",
        "'speaker_4': 'staff for really working very hard on this and working with us as an agency. And it's a partnership, as Jennifer mentioned. And that partnership is really the necessary factor that leads to projects. We sometimes focus on the fact of projects, do they have funding or not?'",
        "'speaker_4': 'The fact is, if there's an active and engaged partnership between a city and a transit agency, they don't ever get funding. So that's really the first step and that's what we see.'",
        "'speaker_9': 'DMO us, which is why we really ask it as a.'",
        "'speaker_4': 'Requirement. When we do our expansion projects or any project that we're doing, there'll be other ones that we're doing around the bay. But this is one of our one of our first that we've done. We did one recently in Richmond.'",
        "'speaker_4': 'But in terms of how are we moving this.'",
        "'speaker_9': 'How do we look.'",
        "'speaker_4': 'At this project strategically? Our our service, as you know, is booming throughout the bay.'",
        "'speaker_9': 'Especially in Alameda.'",
        "'speaker_4': 'There are lots of growing pains with that, which we acknowledge. And we are working again as a partnership to work to resolve some of those. But the positive side of those growing pains is that there are a lot of people who are not driving through the tube.'",
        "'speaker_4': 'There are a lot of people who are not driving right now. They are taking transit, and that's terrific. We need to find a better way to accommodate that demand. What we see in our near-term future are really by 2019 or 2020 is maximizing our utilization of the main street terminal, not just on the landside where we're obviously'",
        "'speaker_4': 'already experiencing parking issues, but really on the water side, we just cannot fit more boats in there to meet that demand by 2020. That's our forecast. So the seaplane lagoon comes in as a very.'",
        "'speaker_9': 'Welcome kind of.'",
        "'speaker_4': 'Addition here. It can help us address that capacity issue because if we didn't have to do that, we would have to improve Main Street and expand what Main Street is. So that's really where we are strategically. And when Jennifer says it makes sense for the city and I understand all the reasons there and I certainly understand the'",
        "'speaker_4': 'economic development aspect, but it also makes sense from a transit perspective in terms of adding more capacity, meeting the demand that's there and really doing a good thing in terms of getting people off the road. So with that, I'll just say thank you for having me here and available for questions later.'",
        "'speaker_4': 'If there's if there are.'",
        "'speaker_1': 'I swear.'",
        "'speaker_4': 'I do have a question and maybe you can expand on this. In all the discussions that we've had to date, where we've talked about contributing money to the the terminal. And in the memo, you there's a sentence here that talks about contributing money or evaluating the feasibility of contributing money to the costs of the vessel.'",
        "'speaker_4': 'And can you expand on that a little bit? Are you short of money for vessels? Are you asking, for example, are you asking Richmond to contribute to their vessel? I, I don't know if this is the same, but if you can tell the difference between, say, AC Transit and MIRA, because AC Transit is not asking us to'",
        "'speaker_4': 'buy our busses.'",
        "'speaker_1': 'You speak to specifically where that is.'",
        "'speaker_4': 'This is on under vessels. On page six of the memo you write for sentence if you could. AC Transit is asking you, though, to help pay for the operations of your new service on board of which you are doing so.'",
        "'speaker_4': 'They are there is precedent there through the regional measure money that's coming to us know also through your developer contribution. So you've dedicated over developer contributions to AC Transit. They're there. So can you expand? But I mean, yes, I can, because this is the first time it's really shown up on paper that.'",
        "'speaker_4': 'Sure. And they didn't just in terms of Richmond Richmond and through the to Contra Costa County is paying for the entire operations for 14 years of that service. So they are a very willing and kind of able a local partner in terms of that clause.'",
        "'speaker_4': 'And what that saying is that we do have some future moneys that, as Jennifer mentioned, it's Proposition one B money for a vessel at. She's correct. That is variable and volatile. We don't know how much money we get from year to year.'",
        "'speaker_4': 'Sometimes we need a local match requirement. So all's we can do right now in terms of and this is the part of the partnership is we're trying to sort of identify that there's a possibility that we'll have a gap there and we're going to work together to identify the feasibility of what we can do to find a'",
        "'speaker_4': 'way to close that gap. And so that's really what that idea any idea how much the gap is? Well, we won't know until it's a the prop Wendy program provides us a funding for that year. We could have no gap.'",
        "'speaker_4': 'We don't know until 2018. Thank you, Madam Mayor. That's all I have. Thank you.'",
        "'speaker_1': 'All right. Was there anyone else going to speak before I called Speaker George?'",
        "'speaker_4': 'Spencer members of the council. I'm Joe Ernst with Alameda Point Partners. I appreciate the opportunity to be here and certainly appreciate your consideration of this. When we were here last summer pursuing approval of the.'",
        "'speaker_3': 'Development plan and.'",
        "'speaker_4': 'The DDA, you know, we talked about the importance of.'",
        "'speaker_3': 'Value creation.'",
        "'speaker_4': 'And that the need, you know, the.'",
        "'speaker_3': 'Housing as.'",
        "'speaker_4': 'A means to an end, you know, the creation of value for infrastructure, for public parks and and amenities.'",
        "'speaker_3': 'And for jobs.'",
        "'speaker_4': 'And, you know, equally, the ferry.'",
        "'speaker_3': 'Is a very big part of that value.'",
        "'speaker_4': 'Proposition here. It will improve the.'",
        "'speaker_3': 'Transit.'",
        "'speaker_4': 'Solution. It will integrate well.'",
        "'speaker_3': 'Better integrate.'",
        "'speaker_4': 'Better with the transit.'",
        "'speaker_3': 'Structure that we are creating, making it that.'",
        "'speaker_4': 'Much more efficient.'",
        "'speaker_3': 'And effective.'",
        "'speaker_4': 'It'll be at the center of the critical mass. But I think one thing that's very important is since we've had the DDA approval, we've now been able to more actively engage with capital partners. We've been able to.'",
        "'speaker_3': 'Engage with companies who want.'",
        "'speaker_4': 'To locate to the point, possibly locate to the point. We've been able to engage more with the companies that are there. And without a.'",
        "'speaker_3': 'Doubt.'",
        "'speaker_4': 'Across the board, the ferry is a very important consideration to making Alameda Point a stronger job center. And so I think Kevin and Jennifer did a great job in laying out several the reasons. But we now have that evidence that since the DDA approval that companies and capital, which are important to achieving our objectives, are looking at'",
        "'speaker_4': 'this ferry as a very important component of elevated point. So thank you very much.'",
        "'speaker_1': 'Thank you. All right. So any other clarifying questions at this time, council? I have clarifying questions on page seven. It speaks to dredging and it says the city will undertake any initial dredging required to ensure adequate depth within Seaplane Lagoon to support Rita operations and that it is of a none is currently expected.'",
        "'speaker_1': 'However, I don't think that that's actually the language I need to be focused on. I think the language is the city will undertake any initial dredging. And is that discussed any where else? I'm not sure what initial dredging means as opposed to dredging.'",
        "'speaker_1': 'And what could the cost be on that?'",
        "'speaker_4': 'Yeah.'",
        "'speaker_9': 'We've actually have retained maritime engineers who have evaluated actually actually, first of all, did a what's called the Bathymetric survey, which is basically an underwater survey of the depths very recently. And I think last year we did it of the Sea Lagoon.'",
        "'speaker_9': 'So we have very accurate recent data on the depths of the Sea Plain Lagoon. That was the first thing we did. And then we retain marine engineers to essentially evaluate that depth information and the construction design of a ferry terminal.'",
        "'speaker_9': 'And they have essentially designed the ferry terminal to avoid dredging. And so we don't expect any initial dredging for this ferry terminal, and we designed it specifically to avoid it because of the potential cost impacts related to that.'",
        "'speaker_1': 'But what is initial dredging versus dredging to have it operate? Any dredging required to have it operate or what is it?'",
        "'speaker_9': 'There's very, very minimal. And what we because what we did is actually go back and compare that recent BATHYMETRIC survey to surveys that have been done in the past. And what was determined based on that analysis is that there's very little shoreline or in a build up of sediment.'",
        "'speaker_9': 'And so we don't expect.'",
        "'speaker_2': 'Now, my question is.'",
        "'speaker_1': 'It doesn't say just dredging or ongoing dredging. It says any initial dredging. So is initial dredging what it takes to get it operating initially?'",
        "'speaker_9': 'Yes, I'm sorry. Actually, it's not even to operate initially. It's to operate it initially, but also to construct the construct the ferry terminal. So sometimes you may have to dredge to can actually construct the ferry terminal or to allow the operation to occur.'",
        "'speaker_9': 'The boats, these are big boats to allow them to come in to that to that pier. In what? And so initial means is to get the operating started and to get the construction implemented.'",
        "'speaker_1': 'And if the city is wrong on that, that it does require dredging, then it's a the city is committing through this MRU to be solely responsible for that.'",
        "'speaker_9': 'We? Yes. I mean, we're essentially responsible for the cost of the ferry. We have agreed to be responsible for the cost of the ferry terminal construction and that initial and that dredging.'",
        "'speaker_1': 'Okay. And what if in the future it requires dredging, then who's responsible? Because I know we've had we're having that current issue with Mayor Ed right now. Correct. In there. But it requires ongoing dredging. So who is responsible for the ongoing dredging?'",
        "'speaker_9': 'So we would be we would essentially work with we that that would be a wider city issue that we'd have to address at that time. But we don't expect there to be ongoing dredging issues because of the essential.'",
        "'speaker_9': 'There's essentially no very, very little, very minimal shoaling that occurs in the lagoon and is what the data has shown over time. Unlike where you're talking about the shipping channel, there's significant shoaling. Not only you have significant shoaling, but you also have extremely large building boats that fall very deep into the water.'",
        "'speaker_9': 'These are the boats that we're talking for a week are actually much smaller in comparison. And so just don't I think it's called drafting that right. Don't draft is low. And so you just don't have those same issues.'",
        "'speaker_1': 'So the menu is silent as to any ongoing dredging. Who's responsible for it?'",
        "'speaker_9': 'I think so, yes.'",
        "'speaker_1': 'Okay. What about for the parking fees? It does speak to the. These could be charged for the parking. The city will evaluate possible implementation of that. And then it says all proceeds, if any, would be committed back to support.'",
        "'speaker_1': 'But who decides the allocation? Would that be up to the city to decide if it's for ferry parking, maintenance operations, or who decides that.'",
        "'speaker_9': 'We decide.'",
        "'speaker_1': 'City we'd have a decided.'",
        "'speaker_9': 'No, we. I'm sorry.'",
        "'speaker_1': 'So the city decides the city.'",
        "'speaker_9': 'Rides how it spends those dollars.'",
        "'speaker_1': 'Okay. All right, Dan, thank you very much. I'm going to proceed with calling the speakers at this time and Michael McDonough and then Jerry, 70. And then Kate Quick.'",
        "'speaker_4': 'Good evening again, mayor and council and staff. I'm Michael McDonough, president of the Alameda Chamber of Commerce. As you know by now, the chamber very much supports cite a for more than one reason. But a great big reason is for the infrastructure that it provides in order to not only maintain the businesses we have out there, there's'",
        "'speaker_4': 'a lot of infrastructure problems that we need to fix to allow the businesses we already have to stay. But of course, also to attract other businesses to to the point at the time that we have, for instance, site B that we've been talking about, this is really an infrastructure issue.'",
        "'speaker_4': 'The it's not just the water main or the electricity or the cell phones. This is transportation. And I know a big part of what we always discuss is traffic and the impact that traffic development will have on our traffic.'",
        "'speaker_4': 'This is essential to providing the infrastructure to reduce our traffic. And there are a lot of businesses out there that we don't think about as businesses like, for instance, Argosy University. This is their San Francisco campus located in Alameda.'",
        "'speaker_4': 'They get students from all over the Bay Area and this is something they're very excited about in order to increase their enrollment so they can stay in Alameda. We have the College of Alameda out there and we get most of our students from the area.'",
        "'speaker_4': 'But what if we could attract other students from outside the area? That would be good for the College of Alameda as well. So there are businesses we don't consider businesses sometimes, but they are businesses because without without people coming to those places, they can't stay in business either.'",
        "'speaker_4': 'So I think this is an essential part of really an infrastructure issue to allow for more people to get to Alameda for the the workforce that may come from outside Alameda and not have to go through the two.'",
        "'speaker_4': 'So we very much support this new terminal. I think everyone I've talked to is excited about it and I sure hope all of you are and approve this measure tonight.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Good evening. Mayor and Council. My name is Jerry Stravinsky. I've been up here before. I'm from the West End. I'm here on behalf of my family, our neighbors and our friends. We're really excited about this. We really want to see the agreement between city and we to go forward.'",
        "'speaker_4': 'We feel the operation of the ferry terminal in the sea. Playing the gluon is essential to the development of Alameda Point and to relieve traffic congestion on and off the island. Today and as we move into the future, it will allow visitors and workers from the West Bay to better access the developments at alameda point and the'",
        "'speaker_4': 'amenities that we have to offer in addition to giving our new citizens out at the point way to get to the West Bay. The added service will help alleviate some of the crowding that is currently occurring in the Main Street terminal.'",
        "'speaker_4': 'As an island, the need to ingress and egress us is limited and very essential as we look to the future. The ability to build more or expand the bridges and the tunnels that we have is very limited and very expensive.'",
        "'speaker_4': 'However, the ability to have ferries is limitless. We can have a lot of ferries come in and out of this island, and that will help us grow in a manner that makes sense. It will actually help the people get on and off the island without having to drive a lot.'",
        "'speaker_4': 'We have a better chance to integrate the ferries into busses and get the busses to get people all across the island. And that's really important to relieve congestion. It'll work better. You know, we a couple of months or so back, we're talking about a bicycle path know on central how better way to get people going places, you'",
        "'speaker_4': 'know, get them out of cars, get them on the bikes, get them to walk, get them on the ferries, get them out of the cars. That's what we want to see. And we really want you to get behind it.'",
        "'speaker_4': 'If you're not positive. You're the agreement between Rita and the city to get money out of the federal government in the state won't happen. You have to be positive. The council has to go forward with a very positive attitude about this.'",
        "'speaker_4': 'Otherwise, the agreement won't get the funds that we need. Thank you very much.'",
        "'speaker_1': 'You quick. Then Richard Banger.'",
        "'speaker_5': 'Good evening, Mayor Spencer and members of the.'",
        "'speaker_2': 'Council and staff. I'm Kate Quick and I'm speaking as a board member of the Alameda Home Team. The Home Team urges your approval of this item as it meets several important criteria to move the objective of creating housing and transportation for all income levels in Alameda.'",
        "'speaker_2': 'It'll provide a much needed new source of transportation to and from the west end of the island, which will lessen the traffic impact of new housing and industry in the Alameda Point area on particularly the Webster and Posey tubes during commute hours, which we know is.'",
        "'speaker_1': 'A critical mass already. It will allow all the island.'",
        "'speaker_2': 'Residents to connect.'",
        "'speaker_1': 'Via bus service.'",
        "'speaker_2': 'Which the prior speaker just addressed.'",
        "'speaker_1': 'To the new.'",
        "'speaker_2': 'Transportation hub. And the bus service will also serve.'",
        "'speaker_1': 'The new businesses.'",
        "'speaker_2': 'And new recreational opportunities at the point. So all of Alameda would benefit by that.'",
        "'speaker_5': 'Our current.'",
        "'speaker_1': 'Ferry on the north side.'",
        "'speaker_2': 'Would stay. So it's now.'",
        "'speaker_1': 'Getting so impacted that.'",
        "'speaker_2': 'This would add an important other valve to divert some of that building and building and building use of the ferry, which is exciting.'",
        "'speaker_1': 'But does put pressure.'",
        "'speaker_2': 'On the service and the parking of. The second ferry.'",
        "'speaker_1': 'With good bus.'",
        "'speaker_2': 'Connection during commute hours.'",
        "'speaker_1': 'I think would do a whole lot.'",
        "'speaker_2': 'To alleviate some of our current issues and to serve what we have planned.'",
        "'speaker_1': 'For that area so that.'",
        "'speaker_2': 'Not just those new houses and new businesses will benefit, but the whole island will see benefit by it. Thank you very much.'",
        "'speaker_1': 'To Richard Banger and then Ginger Gerry. And then Karen B.'",
        "'speaker_4': 'Thank you, Mayor, and members of the council and city staff. Ferry terminal. Seaplane goon. Sounds like a very good idea. We've talked about it for a long time. But I think it's premature to approve the ammo you tonight.'",
        "'speaker_4': 'Here's why. We've talked about it for a very long time. And as far back as 2009, there was a transportation study and yes, it had a seaplane lagoon ferry terminal. It also said that the main street terminal would be closed.'",
        "'speaker_4': 'And if you recall, back in 2009, we were talking about a lot more homes in Alameda Point. So now today with fewer homes. 1425. We're going to double the number of ferry terminals. I don't think there are any findings.'",
        "'speaker_4': 'That say it's a good use of our transit assets. But you do have a very good vehicle to examine that issue, and that's the recently approved citywide transportation study. You're hiring professionals to do surveys, plug in data, overlay their international experience.'",
        "'speaker_4': 'They could they could determine whether it's a good use of funds to have to ferry services on the West End. Now think about these these parking spaces. You've got 400 parking spaces there. Nobody who lives at is going to get up in the morning, go get in their car, drive around the block and park in that parking'",
        "'speaker_4': 'lot. So who's going to park there? Well, it could be people that currently use the Main Street terminal. And I don't think we should be considering this as an overflow lot for the main street terminal. If you're just going to siphon off riders from the Main Street terminal, what good have you done?'",
        "'speaker_4': 'I think it would make more sense if there was only one terminal, the West on the West End, and that was that at the Seaplane Lagoon. But we have no findings that say that this is a wise use of our funding and there's no emergency that it has to be approved tonight.'",
        "'speaker_4': 'You set about to have this citywide transportation study to create efficiencies in the use of our transit assets. If ever there was a transit asset that needed studying, it's this. It's a big one. It's not just coordinating shuttle busses.'",
        "'speaker_4': 'It's it's a big investment. And I might point out that that the the determination that this means that the Main Street terminal was going to stay open. It happened kind of in this planning process for the waterfront town center and then site A and then it wasn't until just recently that.'",
        "'speaker_4': 'Well, Main Street terminal is going to stay. Well, have we actually studied whether this is going to be a good use, a good use of funds? Well, we haven't. Thank you.'",
        "'speaker_1': 'Thank you, Ginger. And then Karen Bay.'",
        "'speaker_2': 'Mary Spencer, council members and staff. My name is Ginger Tree. I'm a staff member at East Bay and I'm also a member of Bike Walk Alameda. And also my partner Peter lives on center of and we were very excited to bike on a new bike lanes that were approved last month on Central AV.'",
        "'speaker_2': 'He incidentally works out of Makani, which is way right next to Seaplane Lagoon and the new here that they took over in general a bike you say we very much support the regional connectivity that the new seaplane terminal would create, as well as helping the Main Street terminal continue providing connections between Jacqueline and Square Oakland and all'",
        "'speaker_2': 'the BART access to Alameda. It's a great idea. I have we have some concerns about the local connections for people who want to safely bike and walk to this terminal. And I have three specific recommendations for the council.'",
        "'speaker_2': 'Number one is that we have a really good opportunity here to make encourage biking to the terminal. As we've heard from everybody here, congestion is a really big problem and the plan goes.'",
        "'speaker_9': 'Takes a really good step.'",
        "'speaker_2': 'By creating a two way cycle track with a buffer leading to a terminal. But this continues the leaves bicyclists mixing in traffic potentially. And one way to make people feel really comfortable is by creating a protected bike lane.'",
        "'speaker_2': 'You already have dedicated the roadway space for this two way cycle track in the buffer and it's just adding a little bit of concrete can just create this into a protected bike lane. You feel really great. This connection will connect to the Cross Alameda Trail and also the terminus of the central of Complete Street Project.'",
        "'speaker_2': 'Making a really great network out there in the West End are two other recommendations would be.'",
        "'speaker_9': 'To specify providing secure bike.'",
        "'speaker_2': 'Parking at the terminal. There's just on the plan there's just one little word that says bike parking and doesn't say what kind, how many spaces please that secure bike parking like the bike link lockers we have that BART people are going to be coming here from work to go to work in San Francisco, leaving the bike here'",
        "'speaker_2': 'all day. Let's keep them safe. And finally, please clearly mark the network your connecting the Bay Trail Cross Alameda Trails, Central Ave Complete Streets help people get where they need to go by providing greater signage. Thank you. Thank you.'",
        "'speaker_1': 'And then Karen Bay. And she's our last speaker on this item. If you want to speak on this item, please turn in your slip.'",
        "'speaker_2': 'Good evening, Mayor Spencer. Members of the city council and staff. Just wanted to also welcome our new city manager. Welcome. So I'm really excited about this item on the agenda tonight. I have written I've been a 15 year, maybe longer commuter on the ferry and I have witnessed firsthand the increase in ridership.'",
        "'speaker_2': 'And it's exciting, but it's a little scary. And seeing this item on the agenda, I feel very excited that we're we're positioning ourselves to grow our water transit, which is increasingly more popular not just in the East Bay, but in the San Francisco Bay area since New York just tapped the Hornblower to run the ferry system in'",
        "'speaker_2': 'New York. So it's becoming a very popular way to move transit. So I wanted to thank our staff for working so hard. I remember when it was just a hope and then it was a vision, and then it and then it was in our master plan and then we funded it.'",
        "'speaker_2': 'Thank you, Alameda Point Partners, for contributing the $10 million. And thank you, Leader, for approving the strategic plan, because that is definitely what helped us to get to this point today. So I cannot stress the importance of approving this memo tonight.'",
        "'speaker_2': 'There are times when, well, we've reached capacity. I can tell you, there are times when people are standing on the ferry. It's it's interesting. I mean, we don't have a lot of people standing, but we have a few people standing and we've got the parking lot so full.'",
        "'speaker_2': 'You've witnessed that. I'm sure you've seen it all the way down Main Street. And we haven't even built outside a, you know, all the homes and the businesses. So this is an important project and important plan and important vision.'",
        "'speaker_2': 'And I and I encourage you to approve it again as a commuter. 15 plus years. The people love the ferry. They walked through the mud during the rainy seasons. They park their car in the mud and walk in them.'",
        "'speaker_2': 'Right. Because they love our ferries. And the more and more people discover it, they think, well, I haven't done this before. So again, thank you, everyone, for all of your hard work. I've been following this when it was just a twinkle in our eye and it's just exciting to see this IMO.'",
        "'speaker_2': 'You come before us. We've got a lot more work to do, but I. I feel confident that we have the right people on the job. So thank you.'",
        "'speaker_1': 'Thank you. She's our last speaker. And I have another question I wanted to ask is part of this. It says that the waterside assets would become Wheaties upon completion, but it actually uses a different term earlier in the paragraph about birthing facilities.'",
        "'speaker_1': 'And I didn't see where water site assets. Is that the same as the birthing facilities or whatever water site assets?'",
        "'speaker_9': 'I think it's the same. I mean, the water. For. Yes.'",
        "'speaker_1': 'Because I would think if it is the same, because birthing facilities is enumerated what that is. However, in regards to when it talks about then than it does say before, all of a sudden it becomes a. I think it's very important that if the SAMU procedure tonight that we specify what in fact the is going to become'",
        "'speaker_1': 'we does. And if it is the same as the birthing facilities that are enumerated, then I'd suggest that that be the language.'",
        "'speaker_8': 'Could I just ask for a page which.'",
        "'speaker_1': 'Is 7 hours ahead.'",
        "'speaker_8': 'Of you?'",
        "'speaker_1': 'You at page seven? Are you okay? Categories, birthing facilities. And it does define that as very related facilities, extending the word of and including the access control gate. But there's a whole paragraph on that. However, after the pair of about the city being responsible for the dredging, then it says upon completion of construction.'",
        "'speaker_1': 'We are and we are operating the ferry service assume control of waterside assets through transfer of ownership with the city and whereby we will be responsible for operating and maintaining these facilities. So at that point, I'm not sure.'",
        "'speaker_9': 'Yes, let me clarify, because this was something we actually changed in the language now that I remember to make it clear, because there are some there are both waterside improvements and landside improvements in there within the waterside improvements category.'",
        "'speaker_9': 'There are past parts of the pier that will essentially be open to the public, and it's actually really important from the Bay Conservation Development Commission that there's benches that people can use that space when it's not having passengers there, and then there's a control gate and so everything.'",
        "'speaker_9': 'And so that's why we changed it to berthing facilities, because there actually are some waterside facilities that will essentially be under our control. We would then allow essentially everything from the control gate westward are considered berthing facilities that are under Rita's control.'",
        "'speaker_9': 'And I'm remember because that's that's why we changed we had that as waterside assets but then we all had the same conversation. And so we wanted to and I'm sorry if we didn't clarify sufficiently, but the idea was that the berthing facilities is everything kind of related to actually getting onto the ferry.'",
        "'speaker_9': 'Then you'd have public improvements on the eastern side of the control gate. That would be considered part of the city's response, you know, city's ownership and responsibility.'",
        "'speaker_1': 'So does Rita end up owning the what is we we do everything.'",
        "'speaker_9': 'Everything west of the control game.'",
        "'speaker_1': 'And that's currently public property.'",
        "'speaker_9': 'I mean, essentially they own the improvements. So it's right now is water and we don't own it yet, but we're hoping to own it next Tuesday. But but once we once the city owns the water, then we would obviously own the water in the submerged property that it was in.'",
        "'speaker_9': 'And then once we improved it, we would turn over ownership of the improvements, not the water. We can't obviously give them ownership of that, but any improvements made west of that control gate would be we'd as owner would be underweight US ownership.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Any other questions? Comments.'",
        "'speaker_8': 'Member Ashcroft comments. I'm ready to comment. Thank you, Ms.. Ott and Mr. Collin, Mr. Evans, for your comments. I'm very excited about this project. I want to see it move forward. I have some personal experience with the ferry commuter.'",
        "'speaker_8': 'My husband rides to San Francisco in and has actually since the night of the Loma Prieta earthquake when the red and White Ferry was pressed into service to bring people back from San Francisco. And I and sometimes I know he runs into Kevin Connolly from Weta, who, if you don't know already is an Alameda resident who does'",
        "'speaker_8': 'happen to ride his bike to the ferry. And I asked him, which ferry do you take? And he said all of them in Alameda because he wants to check out the different ferry. But he he bikes to the ferry, whichever one, from his East End home.'",
        "'speaker_8': 'We were communicating by email yesterday, and I know that on the 7:45 a.m. Ferry yesterday, that's one of four morning ferries that leave Alameda Main Street to go to San Francisco. There were 230 commuters. That's at about capacity and that number is multiplied times four because all of those boats, the 7:15 a.m., 745, 815 and 850 850'",
        "'speaker_8': ', they fill up. So that's if you do the math, almost a thousand people riding during commute hours. There are two more mid-morning ferries that you see the kids going on field trips through the shoppers or whatever. 925 and 1050.'",
        "'speaker_8': 'But you stop and do the math on that. Those are a thousand almost a thousand cars. Well, and with the the later morning ferries, there are a thousand cars that are not getting on the freeway, going over the bridge.'",
        "'speaker_8': 'And that's just our Main Street Ferry terminal. We have the Harbor Bay Ferry on the other end of the island. Yes, we do have some growing pains that we're dealing with much the way the mayor of San Leandro, if you heard any of her State of the city address the other day, talked about the good problem in'",
        "'speaker_8': 'San Leandro is it's growing. We've got growing pains. We have to deal with them. It's true in Alameda, too. And we are we are addressing those problems, but we also can accommodate even more ferry riders. It's true what Mr. Bangert said, that there was a time when we were looking at more houses at Alameda Point, but now'",
        "'speaker_8': 'we are focused more on job creation. And as Mr. Ernst said and I've talked to some of the capital partners too, there is a lot of interest in creating jobs. And the folks who want to work at Alameda Point tend to be the younger generation.'",
        "'speaker_8': 'That does things a different way than my generation. And they don't all own cars and they don't want to commute by car and we don't want them to. So they are going to be commuting some from Alameda Point to San Francisco, some from San Francisco and maybe south San Francisco to Alameda point to work.'",
        "'speaker_8': 'I think it's not a bad question to consider. Do we need 400 parking spaces? I mean, rarely has it been said that we have too many parking spaces for ferry riders, so maybe we were generous in that estimation.'",
        "'speaker_8': 'I leave that to staff in their capable calculations, but we know as elected officials that we have a mandate not just to the citizens of Alameda, but to the region around us to comply with Senate Bill 375, which requires us to reduce our greenhouse gas emissions by the year 2020.'",
        "'speaker_8': 'And one of the major ways we do that is by reducing the number of vehicles on the road. And the ferry has proved to be an immense, immensely popular, important resource for Alameda. We're so well positioned to take advantage of increasing water transit because of our unique, unique location.'",
        "'speaker_8': 'I'm thrilled that Rita and the city are partnering on this MRU and applying for the federal, state and regional grants that can come our way because, as Mr. Connerly said, none of this money comes our way without this showing of united support and that we're ready to avail ourselves of the money.'",
        "'speaker_8': 'And as he was talking and Mithat was talking about being ready to accept the funding, I was thinking of when Mr. Madawaska and I co-chaired the Campaign to Build the New Maine Library, the city got all of its ducks in order ahead of time.'",
        "'speaker_8': 'We already had the lovely Lynn Oaks Motel property, but we knew that was going to be the site. We had passed our local bond measures, so we knew we had the matching funds. So we were so well positioned to go to the state competition and say, Yep, we've checked up this box, we've checked up this box and'",
        "'speaker_8': 'this is what we can do to get more very many our way. And create this this ferry terminal. So I am thrilled to see this project moving along so well and I am fully behind the proposals we're about to vote on.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Remember SA Well, thank you very much. You know, in my office hours that I hold at the farmers market as well as at Blue Danube on Park Street, you know, what I hear time and time again is an incredible thirst on the part of residents.'",
        "'speaker_3': 'For real. See it. Feel it. Touch it. Transit solutions that will deal with the whatever. Housing impacts are generated by new development, as well as be an opportunity to bring in workers from outside of the Alameda to work in our work here.'",
        "'speaker_3': 'And I think in the $18.2 million project that we're possibly going to kickstart tonight, of which $10 million is coming through an agreement with a developer for site A, we're delivering. We're. Providing for the residents, delivering a real city.'",
        "'speaker_3': 'See it, feel it, touch it. Transit solution in this very system. But I don't think we can wait around. I think we need to start moving as soon as possible. I think we've heard testimony not just tonight but previously, that this is an asset, not just in terms of providing service for residents, but an asset in a'",
        "'speaker_3': 'false sense of the word that we will leverage to attract the type of economic development that we want, not just a site, A, site B, if we don't move forward with this type of asset and the type of economic development, especially at site B, will be that much limited, dare I say, to load job creating stack container'",
        "'speaker_3': 'type of projects. If we want the quality type of economic development project that we want that at, not just site A but site B, then we need to make this investment in an asset like this. I value it for the service it renders for the residents of the future residents and the service that renders or bringing in'",
        "'speaker_3': 'workers from San Francisco or other parts of the bay to Alameda. But I think I think a key point of this, though, is that it is something it's a tool that we can leverage to improve our economic development at site B.'",
        "'speaker_3': 'One example, for example, would be many years ago when we created the Ron Cowan Parkway as a result of creating the Ron Campbell Parkway, certain businesses that needed to get to the freeway in 5 minutes, the saying is 5 minutes to get to 55 or 5 minutes to get to 65.'",
        "'speaker_3': 'Suddenly we can have a types of economic development that that was not possible before. So you had you have people like Peet's Coffee or others coming to the Harbor Bay Business Park because of that investment and the Ron Count Parkway.'",
        "'speaker_3': 'In a similar vein. It's an it's this $10 million, $18 million investment that we're making that's going to attract the type of economic development that we need and that we want. So I think that's why it's important. I just want to end by saying, you know, this is the second, in my opinion, homerun that Alameda Partners has'",
        "'speaker_3': 'hit in agreeing to the 15 minute shuttle during the peak morning commute hours. Again, that's an example of a see it, feel it, touch it type of transit solution because people can actually see know that that will be a shuttle that goes from site a through parts of Alameda towards downtown Oakland.'",
        "'speaker_3': 'There will be a shuttle during the morning commute hours every 15 minutes. So it's this kind of non theoretic, but incredibly real transit solutions that that people are here in Alameda are really thirsting for and that we can demonstrate with with activities like this that we can have a smart, well thought out development.'",
        "'speaker_3': 'That's whose impacts, especially whose traffic impacts, are taken into account through these types of of of transit solutions. Now, we should begin to generalize this to other parts of Alameda, like the northern waterfront. And that will be part of the citywide transit strategy that we're implementing.'",
        "'speaker_3': 'But I think, you know, in on the final note, the residents should feel confident that, you know, we're making incredible investments in transit solutions so that. So that we can have the type of quality of life that we want and the type of businesses that we want.'",
        "'speaker_1': 'And Brody.'",
        "'speaker_6': 'Thank you, Madam Mayor. Just a few brief comments, because I think a lot of the rationale for supporting this has already been stated by my two colleagues that spoke earlier. But just to hone in on what Councilmember De Saag said, this is important for those two reasons that he outlined.'",
        "'speaker_6': 'You know, one, it's a transportation solution, not only for Alameda. You know, we're going to have a referral that we're discussing later that talks about the importance of of the ferry system to alleviate congestion and traffic on the island, but also to the greater bay area.'",
        "'speaker_6': 'I mean, this is a there are no other cross bay crossings being planned. We're not going to have another bridge. It may not be in my lifetime before we have another transbay tube. So the more we can develop these ferry systems and I hope it someday having reached the South Bay and all these are and San Jose'",
        "'speaker_6': 'so we could even have more people off the road on 880 and other corridors besides the Bay Bridge quarter. That would be even better. And also, it's critical to business attraction. We do want the high quality jobs that we're seeing.'",
        "'speaker_6': 'Building eight is promising us and the enterprise zone promises us and the site B promises. So this is critical. And I think it's important, you know, that we keep moving forward on this. And the more you as staff said, it's also critical for us to leverage the agreement to get funding.'",
        "'speaker_6': 'So these are the things we need to do in order to get funding, similar to the proposal we discussed a few months back about the 200 units for Alameda Point Collaborative. We needed to have that M.O. used so they can go off and leverage funding.'",
        "'speaker_6': 'So that's what we're doing today. We're laying the groundwork so we can get this done, and I hope we can do it in your aggressive 2019 timeframe and not the 2020 timeframe. But one comment I didn't hear yet, but I think is important as we go forward is the three suggestions made by the Biking Coalition.'",
        "'speaker_6': 'You know, that we find a way for secure biking. You know, that we have clearly marked paths so we know where the network is, you know, and that we have secure and safe bike lanes out there. Because ideally we'd like to have someone be able to go all the way from, you know, South Shore, all the way'",
        "'speaker_6': 'out to the ferry station on their bike safely and not have to worry. So I'm fully prepared to support this, excited about it. And I thank my colleagues for their comments.'",
        "'speaker_1': 'And vice versa.'",
        "'speaker_4': 'I think everybody agrees and I. Listening to all the speakers that keep playing laguna's a lot, the logical place for a ferry service in the ferry terminal. And I brought up the issue because I heard it again, that this is an $18.2 million project.'",
        "'speaker_4': 'It's not. It's a $34.2 million project. And I do have concern about the $16 million to procure a vessel because with no vessel, no service services, the way I read this. And I wanted to make sure and perhaps staff can talk a little bit about what our prospects are to close whatever gap might be in the funding'",
        "'speaker_4': '. That to date has not been been addressed. And all of the agreements that we've talked to to this point have always pointed to $10 million for a ferry terminal. And we actually had a safety valve in that, saying that until the ferry service is running site is to provide a shuttle from side A to the existing ferry'",
        "'speaker_4': 'service. So I think there's always been some some hesitancy or some. Not hesitancy, but some recognition that it's the actual commitment to run the ferry is is contingent on a lot of things happening. And there are 34.2 million reasons why it may not.'",
        "'speaker_4': 'Well, -10 to 24.2, because we have $10 million commitment. And I'd like to hear about what our strategy is going to be to. To gap this. And perhaps. Not to sacrifice some of those things that are necessary and infrastructure that goes into the ground or other transport or better use of transportation dollars.'",
        "'speaker_4': 'Then basically buying a boat.'",
        "'speaker_9': 'Sure.'",
        "'speaker_4': 'I'd be happy for you to play devil's advocate. Where are we? Because, again, everyone agrees that the Ferry Seaplane Lagoon location is the superior terminus. So, yeah.'",
        "'speaker_9': 'No, that's good. I'm glad you brought up because I think when I look at this report and I read it and, you know, obviously in the weeds somewhat, but, you know, you think it's the money, how are we going to make this happen?'",
        "'speaker_9': 'And in the way that I, I want to just take the way that I start thinking about it. And it's taken me a while. And in dealing with these issues, to think about it this way is there's kind of three buckets, and the first is the terminal construction.'",
        "'speaker_9': 'And that costs us the $18.2 million and we have 10 million already. We're going after the Tiger grant, which is very competitive. So we may not get that, but we also are starting to identify county funds that are coming through the measure b b that'll be competitive discretionary fund.'",
        "'speaker_9': 'So we start to compete, but we think we're we've done everything to kind of prepare ourselves and put ourselves in the best position to compete for those those county funds will be looking in the future at potential cap and trade, other state funds that we can use.'",
        "'speaker_9': 'And so we're looking now at all the different grant funds to kind of close that gap. I will say also that we actually had our master infrastructure plan, I think about $15 million for the ferry terminal. So to the extent that a new development comes in, you know, we may choose or the council at the council's direction'",
        "'speaker_9': 'to allocate additional funds from its MIP funds towards this if it wants to. That's another source that could be put on the table for that ferry terminal construction. Then there's the vessel boat and I to very much like you I'm boat I guess bucket but for the vessel is the $16 million I believe that you know, the'",
        "'speaker_9': 'way I'm thinking about this is that it is widows responsibility. I mean, that they have identified Prop one B funds. I think that those their funds are going to be sufficient and that we there's going to find capital dollars to do that.'",
        "'speaker_9': 'That agreement leaves open the possibility that we may need to be creative with them and look towards evaluating other options. It doesn't commit us to putting any of our development dollars towards that vessel. You're right that those vessel dollars weren't in our map, so we don't have those programed in our costs and things.'",
        "'speaker_9': 'So I certainly wouldn't come to you lightly with any recommendation to allocate those funds. And I we've I feel that we have a lot of room here to really evaluate that feasibility. We're not committing to doing it, I think, from Rita's perspective, and we went back and forth in some of this negotiation on both sides, us pushing'",
        "'speaker_9': 'them to leave open some flexibility in places. They're pushing us to leave open flexibility because there are so many unknowns and we don't know yet how that trajectory is going to go. And so I think there, which I think is a legitimate response to us, is let's just leave the door open a little bit.'",
        "'speaker_9': 'It's ajar, but it's, you know, you have a lot the city has its interests protected and that we're not committing to providing those funds, but we're leaving the door open to exploring that with them. We're not committing to doing it.'",
        "'speaker_9': 'And so, you know, given that there was a lot of push and pull on a number of issues where we wanted flexibility in other areas, I felt comfortable recommending that tonight. And then on the last bucket is operating subsidies and there really are that is going we believe and we've heard a lot of rumblings of a regional'",
        "'speaker_9': 'measure three or a regional gas tax. We know that MTC and the legislature and other folks are talking about this. This transit crisis is bringing that to a head, we believe, because of that transit crisis and because of the intractability, really, in terms of creating a second to for BART that they're going to be looking for other'",
        "'speaker_9': 'modes. And we do think ferries and our indication is that ferries are going to be a big part of that. And there's a lot of pressure for we to for Rita to really grow and be more visionary and expand.'",
        "'speaker_9': 'And I think the region and the state are coming to think that. So we do think eventually there's going to be and so that's that last bucket is the operating dollars that are going to come through some sort of regional toll measure or a regional gas tax measure.'",
        "'speaker_9': 'And that's how, you know, that's how we started to see it. Now, are there ifs and buts and unknowns in each of those buckets? There are. You know, I think there's a realistic path for each of them, and I think we're going to get there.'",
        "'speaker_9': 'But it's certainly not guaranteed and there's some uncertainty and we need some flexibility to respond to that.'",
        "'speaker_8': 'If I could just.'",
        "'speaker_5': 'Look.'",
        "'speaker_1': 'The price.'",
        "'speaker_4': 'Of your company.'",
        "'speaker_9': 'So that's my response.'",
        "'speaker_4': 'Hopefully, I think I think you laid out the risks. The big risk is not in the master infrastructure plan. It wasn't programed. In that being said, I think as long as whatever action we take tonight. Records and identifies that we believe that the acquisition of the boat is.'",
        "'speaker_4': 'A weight of responsibility, first and foremost. I think that's that helps mitigate that risk. Also, this this project, $34 million is not too much more than the theater cineplex parking garage. True. And that was a risk. You have to be forward thinking so.'",
        "'speaker_4': 'I. I feel we have to look forward and maybe take a risk.'",
        "'speaker_1': 'Remember Ashcroft.'",
        "'speaker_8': 'So I just wanted to respond in part to the vice mayor, respectfully, that it hasn't been a decision made by this body that the council would have that the city would have known that we would bear full responsibility for the bird acquisition.'",
        "'speaker_8': 'I appreciate you raising that point. I also don't want to see us tie our hands. I'm I'm gratified to be reminded of the $15 million in the master infrastructure plan for the ferry terminal. I think there are unknowns at this point.'",
        "'speaker_8': 'I mean, there have to be because we don't know all the funding sources, whether we'll get them, how much will get. And we I mean, if the funding gap was a narrow one and it just took a little bit of money, would we really want to paint ourselves into a corner by saying the boat acquisition is entirely'",
        "'speaker_8': 'the responsibility of we do. So I would just like to say that that's a concern that should be addressed. The cost of boat acquisition. But I'm I think without a full or robust discussion of that point by the council, we can't say it was a decision.'",
        "'speaker_1': 'All right, so I'd like to discuss this item. We had a speaker, Richard Banger speak in regards to is this a good use of transit assets? Shouldn't we wait that it's premature to approve this tonight? In lieu of that, we haven't had the heard back from the transportation study.'",
        "'speaker_1': 'Is my summary and staff. Could you address that? Why can't. Why can't we wait and hear back on our transportation study? And also, what is the fate of the Main Street terminal? That was also my recollection brought up in his comments.'",
        "'speaker_9': 'Yeah, I think I mean, I think one of I, I remember and, you know, have a discussion. I remember when we were talking about the citywide transit plan and team plan, some of the concerns that the council had were holding things up because we were waiting for 18 months study to come in and and determine these things'",
        "'speaker_9': '. And I think so our our feeling is this has been in the works for a long time. We we believe our plans have been discussing this for many, many, many years. And that's there's we have been studying it with we know what has been studying it.'",
        "'speaker_9': 'We've presented those those that determination and those and that analysis and the benefits here. You know, we don't think it makes sense to wait for the study another 18 months, and we don't think we can hold up all transit and transportation solutions for 18 months until that plan is done.'",
        "'speaker_9': 'Because we think there's a lot going on now with transit for good reason because of all the issues are experiencing. And I think our staff's recommendation would be to be nimble and continue moving forward on things, especially things have been planned for a long time.'",
        "'speaker_9': 'I'd also say that, you know, one of the real benefits of this terminal and hopefully getting it done by 2020 is being able to attract those residents that want to locate near ferry terminal. And this is worse. This is just this has taken a lot of effort to get to this point.'",
        "'speaker_9': 'But the effort has just begun. The permitting takes 18 to 24 months. We're going to be going to hearings before DC. There's a lot of risks there about Bccdc. What are they going to require us to do? And I think the longer we delay that, I think there's concern that we miss those work windows, that we could'",
        "'speaker_9': 'potentially not be ready to take advantage of the service in time to really create and attract the residents that want transit. And I think that's always been our key component of our transportation strategy, is to have the 15 minute headways of shuttle from day one, try to have a ferry terminal made up by day one, but day'",
        "'speaker_9': '365 or something. So that we're really attracting residents that want are depending on that service to be there that don't have cars or only have one car because they already know that service is there. And so I would just caution against us putting too much off into the future, especially in something that we've been studying for so'",
        "'speaker_9': 'long already.'",
        "'speaker_1': 'And I want to look at this isn't this is an MRU, it's a legal document where we are actually agreeing what we are going to do, what's the city responsible for? And and I really want to hone in on that part at this point.'",
        "'speaker_1': 'So one thing it does say on page two of this MRU is that after evaluating the Alternatives Expansion service to see Plan Lagoon while maintaining the existing Main Street service was identified as mutually beneficial. But does this and will you commit Rita to maintaining the Main Street ferry?'",
        "'speaker_9': 'There. There made it very clear in this memo you that they are not going to forego or replace that with this new service. And, in fact, their strategic plan that they're reviewing now that we commented on has policies, in fact, that are very clear that we cannot abandon our existing assets.'",
        "'speaker_9': 'They need to be part and part of the city's comments, staff comments to the their board was to say that exact thing. So they have no interest in.'",
        "'speaker_1': 'But is it does it speak to that in the same way you.'",
        "'speaker_2': 'They say.'",
        "'speaker_1': 'That you.'",
        "'speaker_9': 'Can look at it. I mean what it. My understanding we can is that it's very clear that they are not going to this is not a replacement of their existing service and they are going to continue their main street service.'",
        "'speaker_1': 'So I think, unfortunately, we actually have some ongoing, I'm going to say, disagreements going on with we do in other parts of our city, for instance, the Harbor Bay parking, the main street parking. And I and this is a legal document and I really think it's important that if in fact, that that is the intent is that'",
        "'speaker_1': 'in here because that I mean, that's.'",
        "'speaker_9': 'And I guess just let's be really clear what it what do you want it to clearly say that this is not a replacement of the Main Street terminal, that they I mean. I'm just trying to get at what would what would you like to.'",
        "'speaker_1': 'See the plan. The intent is to. Well, and so but the language that's on page two that I'm not sure is actually. And part of the US part, actually we were agreeing to it. It does say that after evaluating expansion, after evaluating the expansion service to sea, playing lagoon while maintaining it says maintaining the existing Main Street'",
        "'speaker_1': 'service was identified as a mutually beneficial approach. But of course, I can see. So it's on the bottom of page two under the strategy.'",
        "'speaker_8': 'Center of that. But.'",
        "'speaker_1': 'Okay. After evaluation. Right. So it says was identified as a mutually beneficial approach to accommodate ongoing demand for ferry service in West Alameda. However, I don't see a sentence that specifically says that we will is agreeing to maintain the existing Main Street service.'",
        "'speaker_9': 'I think later in that paragraph.'",
        "'speaker_1': 'Maybe that's here somewhere. Yes. Okay. Good.'",
        "'speaker_9': 'Because, you know, I don't have it all memorized, but I do see at the end of that same pair, the city. And we'd agree that at a minimum, the existing levels of service and current amenities, including both the quantity of on street and street parking facilities, will be maintained at the Main Street Ferry terminal, irrespective of future'",
        "'speaker_9': 'sea playing, lagoon ferry service being implemented. So there was this very.'",
        "'speaker_8': 'Fact that.'",
        "'speaker_9': 'They have a very successful service at Main Street, don't want to do anything to jeopardize.'",
        "'speaker_2': 'That.'",
        "'speaker_8': 'We're not.'",
        "'speaker_1': 'So it's my understanding that currently the parking at the Main Street terminal, the city is looking to add in additional parking. So does this mean that we just at all we're not discussing that at this point, is we are going to not go ahead and interrupt?'",
        "'speaker_9': 'No, I mean, not as part of this memo or this action tonight that's not being talked about. And we do we are working on those access issues. I think some of them are at Harbor Bay are going to come up later tonight.'",
        "'speaker_9': 'But I will say that that is something in fact, we did add as an expanded part of the scope for our citywide transit plan is how to address some of these transit connections to the ferry terminals and parking issues related to those.'",
        "'speaker_9': 'And so we expect, in fact, to come back in July as part of some of the near-term deliverables on that transit plan, talking about how we can start to take some near-term solutions to addressing the ferry parking issues.'",
        "'speaker_9': 'But that's not what the action is tonight.'",
        "'speaker_1': 'And in regards to the vessels that was on page six that the vice mayor brought up. The city is not committing to have to contribute any money to purchasing the vessel.'",
        "'speaker_9': 'Now we are committing to evaluate the feasibility of potentially using some of our sources of fund cities funds towards the vessel. That's all. We're not committing to allocating those. Certainly that action cannot be taken without the council's direction to do something like that.'",
        "'speaker_9': 'But we are committing to evaluating the feasibility of doing that.'",
        "'speaker_1': 'Okay. And in regards to the dredging. I am concerned that the city is agreeing to the initial dredging without any limit and what that cost could be to the city. I would prefer that there be some dollar amount to that.'",
        "'speaker_1': 'Unfortunately, we know when we've done projects we can be wrong. And in fact, we've had projects come back just recently where once they started, I believe it was the EOC, the EOC where we ended up needing additional moneys.'",
        "'speaker_1': 'So in the event that we're wrong, I would prefer that there be some dollar limit on what the city is on the hook for.'",
        "'speaker_8': 'I would say that that would be really premature without knowing more about what the what the costs are. I mean, we also have a study and the reason that you engaged a reputable, experienced firm to do that study and the reason we're citing the seaplane lagoon in this particular location is to avoid the the need for the'",
        "'speaker_8': 'dredging.'",
        "'speaker_1': 'And I appreciate that. But let me speak to this. When the EOC came back and needed additional funds. Member Ashcraft, you voted against allocating the additional funds for it.'",
        "'speaker_8': 'Now, that was.'",
        "'speaker_1': 'My.'",
        "'speaker_8': 'Questioning of the need for the EOC, not the fired, not the physician. But that's not but we're talking about.'",
        "'speaker_1': 'But to me, it is related because there are sometimes anticipated, unanticipated, as much as we're saying right now, there could not be. You know, it's it's unlikely. It does put the city on the hook for, in fact, all of the costs of that dredging.'",
        "'speaker_3': 'Madumere, if I may. On the matter of dredging, or anyone who's been a longtime resident of the city of Alameda, we well remember in 1983, when Captain Kelly ran the enterprise against the onto a onto a sandbar. And so for anyone and it happened in May and May Time magazine and and, you know, for anyone who remembers'",
        "'speaker_3': 'that, you know, we're always concerned about about shoals or sandbars or the need for dredging. My sense is that that is a serious conversation that can happen independent of the M.O. you tonight and probably would be better treated in its fullness outside of of of this.'",
        "'speaker_3': 'So I'm.'",
        "'speaker_1': 'I just.'",
        "'speaker_3': 'I hear I hear I hear you.'",
        "'speaker_1': 'I think it specifically says that the city is responsible for the dredging initially up until getting the the ferry operating. And then there is another point where in the same way you were dredging is discussed and it's on the bottom of page eight where it says in regards to capital rehabilitation there, it says the city, and we'",
        "'speaker_1': 'shall coordinate efforts to secure funding and permits to undertake future maintenance dredging as required. So it is spoken to there that the parties would work together for that, and I actually prefer language like that. Also in regards to any initial dredging that we would be working together, that it would not be solely on the city.'",
        "'speaker_3': 'My take my take on this is that this is a memorandum of understanding that outlines some of the responsibilities and expectations of each of the parties involved, but not to a t such that it's an, you know, a detailed, lengthy contract.'",
        "'speaker_3': 'It sets the framework for that detailed contract that would happen at some point in time. So if that's the case, then the discussion as to how to deal with dredging issues, I think still still stands. If if in the memo you if the memo states that the city of Alameda will be responsible for dredging, then then we'",
        "'speaker_3': 'will be responsible for judging. And to me that that's a natural predicate to that, is that well, then that implies that at some point in time we will have to have a serious analysis. And that serious analysis, again, is independent of of of looks there.'",
        "'speaker_9': 'I can I just want to. Yes. And one thing is, is that as I was saying, those three buckets, we have kind of assumed responsibility for that first bucket, which is the construction of the ferry terminal. And when we talk about initial dredging, that is usually lumped in with that construction of the ferry terminal because it is'",
        "'speaker_9': 'considered you know, that's part of the initial cost is to to dredge to put the terminal in to get operations started. And that we have kind of said, hey, we know you're doing, you know, we're going to work together on these operating dollars and the vessel hopefully from Prop one, be the cities through its developer and grants'",
        "'speaker_9': '. We're going to work together to try to get grants for that difference. And so we see that as being that part of that initial bucket. And I'll just say, I mean, if we're wrong, if our Marine engineers are wrong and there are dredging costs that will increase this budget, you know, we will not be starting construction on'",
        "'speaker_9': 'this until we have you know, until we have the money to do it. And so if it turns out that there's not sufficient funds because there's dredging costs, we don't think that's the case. That's not what our experts are telling us.'",
        "'speaker_9': 'We're not going to start construction and then find out we don't have enough money. The dredging is the first thing you have to do to get this started. And so we would know that as part of a very before we even start construction.'",
        "'speaker_1': 'So I appreciate that. So then what does that mean? That because the language is clear, it says the city will undertake the initial dredging required to ensure adequate depth. So to me that reads as so the city is responsible.'",
        "'speaker_9': 'I'm agreeing with you. We just we all of our studies and analysis have demonstrated that, in fact, the entire design of this terminal has been predicated on avoiding dredging.'",
        "'speaker_1': 'Okay, so what I'm trying to find out is, okay, if you look at that language and it comes back that it costs, I'm going to say $4 million for dredging. I'm just going to say a number I'm going to ask our attorney, does would we be able to or whomever hold the city responsible for the costs of'",
        "'speaker_1': 'the dredging at that point? It's on the bottom of page seven. Or is it something else? I see that. But I think what I just.'",
        "'speaker_2': 'Heard me say is that the city's obligation to actually do the construction is contingent on us securing the money. And I guess I'm not sure where that is in this document. I don't know if you know or if you know where that that kind of thing.'",
        "'speaker_2': 'But the answer would be no, because we do not have an obligation to move forward unless we have secured the money. And that's not in this section.'",
        "'speaker_1': 'Assuming, whereas I don't want to assume it's here, I actually want a legal opinion on where is that in here? Then you do not have to proceed if it turns out to be more. I'm sorry, I don't want you to interrupt me right now.'",
        "'speaker_1': 'I actually want to continue because the attorney just raised a point and what.'",
        "'speaker_8': 'She was reading over. I just want to point out that when we're talking about funding, this is a competitive process and we are going to be competing with other communities up and down the bay who also want ferry service.'",
        "'speaker_8': 'So that's the reason we're entering into a cooperative agreement.'",
        "'speaker_1': 'So this is this okay, this is a memorandum of understanding. This is not necessarily quality management.'",
        "'speaker_0': 'I mean, I also want to just point out that the grants that we're going after assume a cost. And if that costs is increased because of the dredging, then we will increase our requests and efforts to get additional funds.'",
        "'speaker_0': 'It doesn't say we have to use general fund dollars or city dollars. It means we will take the lead on dredging. But the other thing is the reason that we want this to be approved tonight is because we're trying to submit a Tiger grant for $18 million.'",
        "'speaker_0': 'So. So we have. That's why it's on the agenda tonight. So we can meet this deadline for the Tiger grant.'",
        "'speaker_1': 'I appreciate that. But this is a legal document. I think our attorney just raised a really valid point.'",
        "'speaker_2': 'You did my opinion.'",
        "'speaker_1': 'It'd be nice, right? That language should be in there.'",
        "'speaker_4': 'Man. Mayor?'",
        "'speaker_1': 'Yes, vice mayor.'",
        "'speaker_4': 'I think in. In this case, there's. Oh, we haven't. Are we going to get an answer soon or should we recess or.'",
        "'speaker_1': 'Well, every week. Recess.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Okay. We're going to recess. That's a great idea. Thank you.'",
        "'speaker_5': 'Is this language.'",
        "'speaker_1': 'Council, did you?'",
        "'speaker_2': 'Yes. So basically the answer is this is not like a construction contract where there is a performance and, you know, a set amount with performance date for performance and the ability to sue and be sued if people fail to perform.'",
        "'speaker_2': 'This instead is a memorandum of understanding and as the document states it at the very beginning, it establishes the framework for development of this new ferry terminal. And the hope is that it's going to be implemented as early as fiscal year 2020, but it doesn't establish any specific date when anything has to occur.'",
        "'speaker_2': 'And so in the question about if the city wouldn't have the funds all available as this I'd explain to build the terminal, we would not start building the terminal. And on page eight of the document, under the caption service expansion at Main Street terminal by 2021, the document says that by 2022, if I can't even talk, I'm'",
        "'speaker_2': 'sorry. If by 2021 the seaplane lagoon terminal has not been constructed. But regional operating funding is available for additional service to Alameda. So in other words, the city doesn't have the funding available, but we do apparently have some additional funding we may elect to make any necessary major capital improvements to accommodate additional vessels and service expansion at'",
        "'speaker_2': 'the Main Street terminal and reconfirm the validity of this memo at that time. So what this is saying is that's basically their remedy. If we aren't ready by 2021, that they can look to either utilize funds to improve the main street terminal and then basically renegotiate with the city to determine whether or not we have the adequate'",
        "'speaker_2': 'funding. But there's nothing in here that would force that would allow we to to force the city to build something we don't have the funding for.'",
        "'speaker_1': 'And then there is the comment raised in regard to secured bike parking that's not included in here. Does staff anticipate having funds for something like that or is that something we could work out with Leda? And I've heard about that other sites too.'",
        "'speaker_9': 'Yeah. So there is a place for bike parking and this has to go through a public design review process where we would then evaluate all of that and have to determine exactly the number of spaces this is meant to be that kind of overall plan that the Council's providing direction.'",
        "'speaker_9': 'Then we would go and put together a design review application that would go through that planning board process, and that's where we would get into the details of the streets. I mean, there is a protected bikeways, I'm not entirely sure all along side and then connecting down ferry point we show a buffered bike way.'",
        "'speaker_9': 'But but if if there'd be a public process through the planning process, if that bikeway we wanted that street to be configured differently, that could be done as part of the design review process.'",
        "'speaker_1': 'Okay. So in regards to any financial risk to the city. What risk do you think there is?'",
        "'speaker_9': 'I mean, until we you know, at this point, we don't think there is a rest of the city right now. All the permitting and other fees are being paid for by the developer that's contemplated in this, um, in our development agreement with them.'",
        "'speaker_9': 'And we don't spend money until we have, we can demonstrate that there's sufficient funding to move forward with it. So very little risk. I mean, our staff time, obviously, but very little risk.'",
        "'speaker_1': 'Any other questions or comments?'",
        "'speaker_4': 'McNamara I think I think we heard a good explanation from the city attorney about the position of this document and what we have to do. I've been satisfied with I think the biggest risk is that is that our infrastructure plan did not include the vessel.'",
        "'speaker_4': 'That being said, I've heard that Twitter has is got avenues of access to get that money. And that's a risk that I'm willing to take at this point. So I'd like to make a motion that we approve the Seaplane Lagoon Ferry Terminal Plan.'",
        "'speaker_4': 'We approve the M.O. you and we adopt the addendum to allow me to point.'",
        "'speaker_1': 'Out any questions, comments at this point. All those in favor I oppose. The motion carries unanimously. Thank you. At 1030, we need a motion to consider the remaining items. Six E budget. Nine A referral and we need four affirmative votes to do that.'",
        "'speaker_4': 'I moved.'",
        "'speaker_3': 'So do we have another vote at 11:00?'",
        "'speaker_2': 'That's an item after 1030, I guess right now it's not 1030 yet. So you could take six and then you vote again at 11, but you could not take up nine.'",
        "'speaker_8': 'But it's 1029. But then we vote again whether to go past 11, right?'",
        "'speaker_2': 'Yes. But not to take a new item.'",
        "'speaker_8': 'No. Right. But we we would stop at 11 if we didn't get the affirmative votes for that. Yeah. Oh ho.'",
        "'speaker_2': 'Ho. Quick.'",
        "'speaker_0': 'Quick solution. Amending the fiscal year. Can I.'",
        "'speaker_2': 'Presentation?'",
        "'speaker_1': 'Okay, wait a minute. Wait a minute. I had asked about a motion to consider remaining items. I didn't hear. I heard a motion. I didn't hear a second. Okay. If it doesn't need to start. No, no, I haven't called the item.'",
        "'speaker_1': 'I actually received this request. I have not called. The item is not appropriate. And I honestly please take a seat at this time. I've already. I received this note from the clerk. Okay. We had a motion. We didn't have a second.'",
        "'speaker_1': 'We don't have a second. We're not going to be able to. All right. So it's going to die a natural death, in which case at this point, I'm going to move forward. You didn't have a second?'",
        "'speaker_8': 'I think it was three cameras.'",
        "'speaker_1': 'I think there.'",
        "'speaker_8': 'Was a question about whether we would take another voted 11.'",
        "'speaker_1': 'And so so it's not really disjointed. We do this all the time. At 1030, she gives me the note and I and there's a motion made. There's not a second it dies. A natural death, in which case we continue to the items that we can go to without the motion.'",
        "'speaker_1': 'Which takes us.'",
        "'speaker_2': 'To.'",
        "'speaker_1': 'Oral communications and on agenda. I believe we could hear no. 60 and 90 were part of the motion. Okay.'",
        "'speaker_8': 'I think we need to revisit the motion because.'",
        "'speaker_1': 'I know someone wanted to. He made a motion.'",
        "'speaker_8': 'We have a motion.'",
        "'speaker_1': 'And the motion was to consider the remaining item six and nine. And it and I read the same slip.'",
        "'speaker_8': 'Yeah. And if your request for affirmative. 11. I understood what you said the first three times Mayor. So I and my caveat was simply this is one vote to take additional items at 1030, but we will vote again at 11 whether to go past 11.'",
        "'speaker_8': 'Okay. So under those circumstances, I will second the vice mayors motion.'",
        "'speaker_1': 'All right. All those in favor I, i others oppose. No, I oppose a motion. Carry 3 to 2. I know it requires four affirmative votes, so it fails, but it does feel all right. So that's correct. In which case the motion fails.'",
        "'speaker_1': 'And now we continue with if I and you could help me out of the.'",
        "'speaker_0': 'City manager communications. It's not required vote so you can continue with that section.'",
        "'speaker_1': 'City Manager Communications.'",
        "'speaker_8': 'Was there anything time sensitive about the budget?'",
        "'speaker_0': 'Yeah. Yes.'",
        "'speaker_8': 'I wish staff had spoken up.'",
        "'speaker_1': 'So we've had a motion and a vote at this point it's not.'",
        "'speaker_0': 'So is.'",
        "'speaker_1': 'There an.'",
        "'speaker_0': 'Option legally if one of the two votes chooses to reconsider that motion so we can get the budget approved tonight?'",
        "'speaker_1': 'So, Councilor, do you want to weigh in on this? We just had in motion we can.'",
        "'speaker_2': 'Do a reconsideration if one of the two opposing votes wants to make a motion. All right, guys. No.'",
        "'speaker_8': 'So we have to be.'",
        "'speaker_1': 'Yeah. Correct. You remember Audie and myself.'",
        "'speaker_6': 'To stop.'",
        "'speaker_1': 'And I and I'm not going to agree either at this point. If we've had a motion, we've had a vote, if neither of the people that voted against it want to proceed, then we continue with we honor the vote and we're ready.'",
        "'speaker_1': 'So in which case, now it's appropriate for a city manager communications.'",
        "'speaker_0': 'So the communication is. I just. There's no report. I mean, it sounds like we want to get through tonight. And what I wanted to do was to recognize AMP for getting recognized as the number one safest utility and it competing against 250 other utilities.'"
    ]
}