{
    "Resolution Supporting the Schools and Local Communities Funding Act.": [
        "'speaker_2': 'Okay to the let's go back to item five. I, um, this is the clerk. I don't want to step on your toes. What is this item?'",
        "'speaker_1': 'Adoption of resolution supporting the schools and local communities funding act on the November ballot.'",
        "'speaker_2': 'And I believe he could remind me whose staff report this is. That one is.'",
        "'speaker_1': 'It's the Sarah Henry, the POW. I think we're trying to admit her.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Thank you for bearing witness.'",
        "'speaker_2': 'The lady with the bookmarks.'",
        "'speaker_0': 'See? There she is.'",
        "'speaker_2': 'Get them to us momentarily. Councilmember Desai, did you have questions about this? Comments? Did you want to hear the staff report?'",
        "'speaker_3': 'I don't have questions or comments, but if the staff member wants to. Perhaps for the purpose of the public. Very briefly, describe what five is. I believe it has to do with Proposition 15.'",
        "'speaker_2': 'Sarah, you're muted.'",
        "'speaker_0': 'Molly. I am here now.'",
        "'speaker_2': 'This is, by the way, Sarah Henry, our amazing public information officer. She also staffs the Commission on Persons with Disabilities. There's a whole lot more so. Oh, yeah. And keeps up with our legislative agenda, both state and federal.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'So I didn't prepare a presentation tonight on this item, but this is the Proposition 15 on the November ballot supporting the Schools and Local Communities Funding Act. It is taxing the commercial property an annual or every other year assessment of actual value versus when it was sold.'",
        "'speaker_0': 'And the city has to gain what stands to gain about $7 million a year from this, the school district would gain about $5 million a year from this. And then, of course, our transit agencies and other municipalities would gain a lot as well.'",
        "'speaker_2': 'Thank you. Any questions or comments? Thank you. Miss Henry, there's another Sarah. I have a meeting with her tomorrow. Councilmember Desai. Any questions? Great. Just let me just comment.'",
        "'speaker_3': 'I don't support the split role tax approach. I believe we need to, because this is all about modifying Proposition 13. And I get and I understand that there's an argument that commercial and industrial wasn't meant to be part of Proposition 13 when it was passed in 1978.'",
        "'speaker_3': 'But the reality, though, is that especially in the times that we're in, it's particularly the very small businesses, the small mom and pop type of businesses who would be affected by this? Sure. The city of Alameda or even the school district stands to gain from this split roll approach.'",
        "'speaker_3': 'But I believe as a matter of principle, I believe Proposition 13 should remain intact, as it was originally put together back in 1978. It served businesses and residential quite well, and I would hope to see it continue the way it is in terms of dealing with funding issues.'",
        "'speaker_3': 'There's a whole range of other approaches that that I believe California ought to take. And so I'm not supportive of this flat roll approach.'",
        "'speaker_2': 'Thank you. And just a thank you. And then perhaps one of my colleagues whose hands are up might want to clarify some of the provisions in Prop 15. But I thought the vice mayor stand up, then Councilmember Vela, then Councilmember Ody.'",
        "'speaker_2': 'I'm pointing to where you.'",
        "'speaker_0': 'Are and I.'",
        "'speaker_2': 'Don't know where you.'",
        "'speaker_4': 'Are. I won't say much. I will say vice mayor, vice mayor, former vice mayor and current vice mayor. And actually, we were going to bring actually a referral asking our council to adopt this this evening. And so I just wanted to give my thanks to the city staff for actually seeing the importance of this and the council'",
        "'speaker_4': 'weighing in on this and bringing it forward. You know, I think what we know about Prop 13 is that there were loopholes that were left in that have unintentionally removed billions and billions of dollars each year from our schools, leaving our local communities underfunded in ways that many of us.'",
        "'speaker_4': 'I didn't grow up in California, but people of my generation benefited from, and then we removed it from them, transferring the tax load from companies who used to pay for it to homeowners and individuals today. I'll let my other colleagues weigh in, but I just wanted to thank our staff for bringing this forward.'",
        "'speaker_2': 'Thank you, Councilmember Vella.'",
        "'speaker_0': 'Yeah, I just wanted to clarify, there were some statements made that I think don't accurately reflect what Prop 15 actually does with regards to small businesses. Prop 15 exempts all commercial property below $3 million in value, which is pretty significant.'",
        "'speaker_0': 'And it provides a tax cut on business equipment that will actually mostly benefit our small businesses. So I want to clarify, there's a lot of misinformation out there that this is going to hurt small businesses. It's actually not geared at them at all.'",
        "'speaker_0': 'In fact, this is about having places like Disneyland pay their fair share. Disneyland is paying almost nothing per acre and they have lots and lots of acreage, as well as large parking lot owners and folks like that who have, you know, large scale commercial properties.'",
        "'speaker_0': 'These are not small businesses. These are businesses that have considerable wealth and equity in their property. So if your individual property is exceeding $3 million, then you will not be exempt from Prop 15. So I just wanted to clarify that.'",
        "'speaker_0': 'I did want to echo the vice mayors statements, and I'm very glad that staff brought this to us. I think this very much needs to be done. This loophole needs to be closed. Our our youth and students and everybody who works at public schools and in public education deserve this.'",
        "'speaker_0': 'This is an investment in our future and making sure that large corporations like Disneyland pay their fair share. So I'm going to be supporting this today.'",
        "'speaker_2': 'Thank you. By the way, it was the mayor and staff that brought it forward. But I know I thought we would be mostly supportive, but we thought that it's good to bring it up to vote. And Councilmember Ody had his hand up.'",
        "'speaker_2': 'Then I'll go back to Councilmember Days. I can't remember that.'",
        "'speaker_3': 'I will also thank the mayor and staffer and Sarah for bringing this. Henry sorry for bringing this this up. I mean, as much as we all would love to be back in 1978, I mean, we're not. Times have changed.'",
        "'speaker_3': 'I mean, one example of that changes. In 1978, our school system was in the top ten in the nation, and now it's in the bottom ten as far as funding. So I spent the better part of the last month talking to almost any almost everybody running for election this year in Alameda County.'",
        "'speaker_3': 'And, you know, with COVID 19, there's a lot of issues with funding. And you saw the staff report. We'd be. To receive $7 million, which would be a good shot in the arm for the city of Alameda to deal with all of our unfunded obligations.'",
        "'speaker_3': 'But, you know, some of our transit agencies are hanging by a thread. And that 24 million that would go to AC transit may make the difference between having a transit agency and not having the transit agency. And then you saw the others, whether it's Bay Area Air Quality or East Bay Mud or BART or, you know, the'",
        "'speaker_3': 'Park District, which, you know, we're going to be depending on heavily for some of our future recreational needs in the city. I mean, this is way overdue and I hope it passes the first time. If it doesn't, we'll go at it again.'",
        "'speaker_2': 'Thank you. Councilman Brody, let's hear from Councilmember Desai, then you, Mr. Henry.'",
        "'speaker_3': 'Just quickly, while while the owners of property who are small businesses generating no more than $3 million might not be subject to this. The small businesses will still be subject to this because many of them are tenants of larger properties.'",
        "'speaker_3': 'You could just go to South Shore Shopping Center, for example, their tenant. There are small businesses there. There are small mom and pop businesses throughout, not just Alameda, but California. And it's going to negatively affect a lot of businesses, those small businesses.'",
        "'speaker_3': 'And I think we need to be cognizant of that, especially in this economic environment. So and I just think there are other ways to deal with the school issue.'",
        "'speaker_2': 'Thank you, Mr. Desai. Councilmember Vela, briefly.'",
        "'speaker_0': 'Yeah. Just really briefly. It's not it's not for I for companies that bring in more than 3 million it's for commercial properties valued at 3 million or over. And I just want to add that this isn't more taxes, this is taxing everyone, the specific taxes on a relatively few specific people.'",
        "'speaker_0': 'And it will just it's basically 92% of the revenues generated are going to come from just 10% of the properties in the state. So I just think that those that those facts are very important.'",
        "'speaker_2': 'Thank you. And with that.'",
        "'speaker_0': 'I'd like to move the approval.'",
        "'speaker_2': 'Okay. We've got a motion and second move by Councilman Vela, second by Councilmember Odie. Quick, Miss Henry, before they take it away.'",
        "'speaker_0': 'Well, I was going to make the point that Councilmember Vela just made that such a large portion of the revenues is coming from a small portion of the commercial properties. But the other point I wanted to make to the general public, and I apologize for not doing this beforehand, is that properties right now are generally re-assessed when'",
        "'speaker_0': 'they're sold. And so the assessed value is less than the market value for commercial properties. They're sold on average every 30 years. For residential properties, they're sold on average every six years. So you can definitely see the disparities there.'",
        "'speaker_0': 'And that was all I want to just mention.'",
        "'speaker_2': 'Perfect. Thank you. We've had a motion. We've had a second. Any further discussions then maybe we have a roll call vote.'",
        "'speaker_1': 'So number data.'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Not quite. By Odie.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'I may as the Ashcraft.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'That carries by five eyes.'",
        "'speaker_2': 'Thank you. And then we move to item five K.'"
    ],
    "Repeal of Alameda Point Development Impact Fees Ordinance.": [
        "'speaker_1': 'Which is final passage of ordinance amending the element of principle code by amending Chapter 27 development fees by repealing 27 dash for only two point development impact reads in its entirety. And we have a speaker on this item.'",
        "'speaker_2': 'All right, um, our speaker, please.'",
        "'speaker_1': 'Jay Garfinkel.'",
        "'speaker_2': 'Mr. Garfinkle. There you are.'",
        "'speaker_3': 'Hi. Well, I don't have any particular interest in the outcome. I'm more concerned with the process. The item has a letter from an attorney representing a company that has assessed the situation and feels that it. I'm not sure if it's illegal or unwise or whatever, but there is a challenge to the proceeding and it would seem to'",
        "'speaker_3': 'me that we should hear from the city manager in writing and the city attorney in writing to determine whether there's any validity to the objection that's been filed. Like I said, I don't care how it comes out. I just think that it since a legal challenge is being raised, that we should get response from our city staff'",
        "'speaker_3': '. Thank you.'",
        "'speaker_2': 'And I will just say not that this Q&A, but just an observation that this is final passage of an ordinance as a second reading. And this item was before the council at the last council meeting and fully deliberated and voted upon at that time.'",
        "'speaker_2': 'Do we have any further speakers on this item? Public speakers, Madam Clerk.'",
        "'speaker_1': 'We have none.'",
        "'speaker_2': 'Okay. And then anything further from the council saying then maybe we have a roll.'",
        "'speaker_0': 'Call vote, please.'",
        "'speaker_1': 'Do you have a motion in the Second Amendment?'",
        "'speaker_2': 'I was doing it backwards. We would have gotten around to the immersion in the vice mayor is second from. Councilmember Vela second. Right. Okay.'",
        "'speaker_1': 'Again. Councilmember de fag? Yes. Next light. Hi, Odie.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Vella. Yes, Mayor. As the Ashcroft I carries by five eyes.'",
        "'speaker_2': 'All right. Thank you very much. So with that, we have concluded the consent calendar, and now we move to the regular calendar, regular agenda.'",
        "'speaker_1': 'Exchange, the adoption of resolutions, reappointing Thomas Saxby as a member of the Historical Advisory Board, reappointing Adam Gillet, and appointing a Tierney stringer as members of the Public Art Commission, reappointing Gerald 70 as a member of the Public Utilities Board, and appointing Samantha Soules as a member of the Transportation Commission.'",
        "'speaker_2': 'And approval he is second. Okay. Do we have any comments? And I just want to comment. I said I think I said this when I introduced these names of these individuals last week, that I am just overwhelmed and so heartened and gratified.'",
        "'speaker_2': 'And I know council would share my sentiments with the quantity and the quality of applicants we're getting. And I'm talking to our different staff who staffs our different boards and commissions. And we think it's a combination of, you know, it's COVID 19.'",
        "'speaker_2': 'People are working from home, so maybe they have a little more time to focus on some local issues. But I think with all the layers of issues we've been dealing with since the spring, people have really focused on how can I make a difference?'",
        "'speaker_2': 'And one of the things I love hearing when I'm interviewing and I always conduct the interviews with whoever the city staff is who staffs that Border Commission. But if people are saying they just want to give back, they love living here, they want to give back.'",
        "'speaker_2': 'And I'm really excited that we have a combination of folks who've lived here while we've got newcomers, and they all bring so much talent and energy to the to the table. So thank you all and welcome. And so, Madam Clerk, this is where and I see we've got Adam Gillett, who's a graphic artist who is on he's'"
    ],
    "Resolutions Reappointing and Appointing Members of Various Boards and Commissions.": [
        "'speaker_2': 'returning. He is the current president of the Public Art Commission. Tierney Ringer is a newcomer, extremely talented women worked for the Smithsonian when she was back in D.C., worked for the Exploratorium. When she came out here, mom of two preschoolers, you know, one of those with lots of free time, but willing to share her time and her'",
        "'speaker_2': 'talents. And then do we have some of our others or who could make it?'",
        "'speaker_1': 'We were told they were going to make it. So I just want to make sure if if anybody on it, maybe under a different name, that any of them could raise their hand because we could only find Adam.'",
        "'speaker_1': 'Okay, we got one more, Jerry. Yeah. They told us they were going to be here, but we were having trouble finding them on the zoom.'",
        "'speaker_3': 'Is on this, and.'",
        "'speaker_1': 'It's. Oh, Jerry, you found Jerry.'",
        "'speaker_2': 'Okay, there's Thomas. Saxby Thomas is an architect. He's on our historic advisory board. Where do you see?'",
        "'speaker_1': 'I think we're finding him, too.'",
        "'speaker_2': 'Where I see Jerry Boden.'",
        "'speaker_1': 'In in the attendees. We're looking in the list of attendees so we can.'",
        "'speaker_2': 'Promote that speech.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_2': 'Okay, guys, here comes Jerry, 70, reappointed to the Public Utilities Board.'",
        "'speaker_1': 'Yet.'",
        "'speaker_2': 'To be in charge of engineering for the Port of Oakland. Anthony Ally Parent who is, I know a really strong supporter back there. I'm not biased, but our kids start elementary school at Payton together and we've done lots over the years.'",
        "'speaker_2': 'And Isabella, remind me who Isabella is.'",
        "'speaker_1': 'Maybe Samantha, right? That's what we're hoping. Yeah. Is that you were hoping she might have been using a different registration.'",
        "'speaker_2': 'No. NOM de plume. Hi. You want to reveal your identity? Hi.'",
        "'speaker_0': 'I have the honor of Abigail Cafe. I'm Joan in your.'",
        "'speaker_2': 'Um.'",
        "'speaker_1': 'Sorry. We thought it was okay. Clearly not. No. Okay. She reached out. All right.'",
        "'speaker_2': 'Okay. Well, Samantha souls, if you're out there, raise your right hand. Maybe she took my advice and went for a hike.'",
        "'speaker_0': 'Yes. Yeah.'",
        "'speaker_1': 'So.'",
        "'speaker_2': 'Yeah. Go ahead.'",
        "'speaker_1': 'Just before we do the if we'll take the roll call vote just to have the vote on first.'",
        "'speaker_2': 'We've moved. Did you get who moved in second?'",
        "'speaker_1': 'Yes. Camera Odie moved in. Nice. Very nice. Split second.'",
        "'speaker_2': 'In. Perfect. Okay. That was to approve all of these appointments. Then maybe we have that roll call vote.'",
        "'speaker_1': 'Councilmember de SAG.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Knock fight.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Odie. Hi, fella. Mayor as the ashtray. I. Okay. If you will all stand and raise your right hand, I'm not sure how feasible it is to stand, but.'",
        "'speaker_2': 'On camera.'",
        "'speaker_1': 'And say, I love you. Just a fact. Yes. Okay. Do you solemnly do solemnly swear to uphold the Constitution of the United States and the Constitution of the state of California, and that you are well and faithfully discharge the duties upon which you're about to enter?'",
        "'speaker_3': 'I will. I will.'",
        "'speaker_0': 'All right. Thank you. Thank you.'",
        "'speaker_2': 'Yeah. Thank you all so much for. Thank you for stepping forward. And we are delighted to have you on board. I know the various staff have already let you know when your first meeting will be. And again, I was we're all just so appreciative for you as to you for doing this.'",
        "'speaker_2': 'So enjoy. Take care. Stay safe.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Thank you. Bye bye. Bye. See you right. All right. That's always a fun one. And next well, at the end of this agenda, I will announce my next nominations, and we'll do this all over again next week.'",
        "'speaker_2': 'So item six B.'",
        "'speaker_1': 'Recommendation to approve the D Pave Park Vision plan.'"
    ],
    "Developing a Race and Equity Action Plan and Joining GARE.": [
        "'speaker_1': 'Recommendation to approve staff's approach to developing a city of Alameda Racial Equity Action Plan for the organization, including joining the Government Alliance on Race and Equity.'",
        "'speaker_2': 'Thank you. And Assistant City Manager Bowden. Are you presenting, aren't you? Yes.'",
        "'speaker_3': 'Yes, I am. This evening.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_3': 'Hi. Good evening, Mayor. As the Ashcraft vice mayor knocks white members of the city council. I'm Jerry Bowden, assistant city manager. And we're either being joined or will be joined with, ah, by the director, Nancy Bronstein here, our senior analyst, Sabina Netto, and our acting police chief, Jeff Emmett.'",
        "'speaker_3': 'And I'll give a shout out to Amy Wooldridge, who's also been working with the director. Wooldridge has been working with Rec and Park Commission on this topic as well. So the team is starting to form around this. Obviously city manager and city attorney are with us as well.'",
        "'speaker_3': 'So it's an exciting new project where we're looking forward to getting going on on an action plan to address the resolution that declared racism a public health crisis in the city of Alameda. This was on July the 28th.'",
        "'speaker_3': 'And part of that resolution asked the as the city council asked staff to come back with an initial and ongoing action plan to address this topic, this crisis in our community. And so and with a real focus on the organization.'",
        "'speaker_3': 'So at this point, we have started to develop that comprehensive race and equity action plan for the city of Alameda. We've joined the Government Alliance on Race and Equity, and that's the organization known as GEAR. And we're exploring other options as well.'",
        "'speaker_3': 'And I'll touch on those just briefly this evening. But the the main focus of the presentation this evening is on is on gear. And gear does help government organizations across the country. They're the way that they put it.'",
        "'speaker_3': 'They develop a pathway for entry into racial equity work. And then they do offer the resources to help organizations, government organizations sustain it. So we believe that gear can be an effective partner for us as we develop our Race and Equity Action Plan.'",
        "'speaker_3': 'The purpose of the plan will be to foster a safe and inclusive workspace and workplace for our employees and to ensure that race and the race and equity lens is used to inform our policies and our programs. And I just want to acknowledge the link between the conversation we just had on the prior item and in the'",
        "'speaker_3': 'work that would go into our are our programs, policies and processes with the with a race and equity lens as we're doing this work. So our police department personnel would also be included in the gear training as part of the overall organizational effort.'",
        "'speaker_3': 'But due to the unique nature of their job, we also wanted to make sure that we infused the work plan with something that was a little more specific. The the hiring and partnering with a group called Fair and Impartial Policing is what we're suggesting.'",
        "'speaker_3': 'That group is different than gear. They provide implicit bias training and other training to police personnel. And the option that we're probably most interested in in terms of the fair and impartial policing work is how they deliver the training with police personnel and with community stakeholders involved simultaneously.'",
        "'speaker_3': 'So it's a way to bring police and the community together as part of an implicit bias training exercise. I'm aware of the national, local, regional conversations about implicit bias and and whether or not that's an effective tool or technique.'",
        "'speaker_3': 'But it is we are looking at a multifaceted approach, and we do think that this is a component that can be helpful as we as we move forward. And I'll talk a little bit about our community led process and how this might interface with that work as well.'",
        "'speaker_3': 'So the third component that we're so we've got gear, we've got fair and impartial policing. We also reached out to the Alameda County District Attorney's Office. They have an alternative to arrest pilot program that is being developed at this time.'",
        "'speaker_3': 'We don't have a lot of detailed information on the program right now, but we we do understand that the pilot program will be designed to provide law enforcement with the ability to link individuals in need to behavioral health services as an alternative to arrest.'",
        "'speaker_3': 'And so we're going to continue to explore that. And to a certain extent and maybe even more directly, this one ties into the fourth and final component that all discussed this evening. We have a community conversation happening right now.'",
        "'speaker_3': 'The steering committee that the city manager appointed is is off doing their work. Now, the five task force committees have been established. And so as the the the work of the community led process starts to be brought forward, we anticipate being able to merge that in with our organizational efforts and specifically with the the that the work'",
        "'speaker_3': 'that the police department, the opportunities that will be in front of the police department in the coming months. And so at this time, we're very roughly a. Estimating a budget of about $75,000 for this work, which we would incorporate into the October budget update.'",
        "'speaker_3': 'If there's council support for what we're suggesting this evening. And with that, staff is recommending that the City Council approve the proposed approach to developing a city of Alameda Race and Equity Action Plan for the organization. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Bowden. Are there any. I'm. I'm going to assume that we have public comment on this item. Is that correct?'",
        "'speaker_1': 'Mr. RISINGER At this point, no one has raised their hand, so we do not.'",
        "'speaker_2': 'Well, but just go to your. That is.'",
        "'speaker_1': 'Now, somebody raised their hand. So we have one.'",
        "'speaker_2': 'That's okay. We're going to open this to clarifying questions from the council and vice mayor next. Blake. I just hand it first and then I see council member already. So in that order, please.'",
        "'speaker_4': 'Thank you very much. Assistant City Manager Bowden. My question is, it's pretty simple. It seems to me that what you're asking for is, are you asking for us to adopt or. To approach to to to approve the city joining Gary and also for the city to move forward with the filth and the the implicit bias training.'",
        "'speaker_4': 'Or are you asking for us to prove $75,000 in the general approach that you have outlined? And that's a very good question. You know, Carol.'",
        "'speaker_3': 'I'll I'll start to answer. And then others on the team can can join in the the the work program that is attached to the staff report associated with gear includes workshops. We would be picking from that menu of workshops in a logical order to deliver the content to the organization and then to get into our policies and'",
        "'speaker_3': 'procedures. There are also department specific efforts that were mentioned in the staff report I didn't spend a lot of time on. So it's the work program, it's the gear program, the fair and impartial policing, and then an estimated budget of $75,000 that we would return to you for formal action on the budget component with.'",
        "'speaker_3': 'But we didn't want to leave out the budget discussion this evening.'",
        "'speaker_2': 'Does that answer the question, Mayor?'",
        "'speaker_4': 'Yeah. I guess I'll just ask, because I thought you were going one way and then you went a different way. But it sounds like you are asking us to approve the specific work program with flexibility for which workshops, etc., and also the use of the RFP.'",
        "'speaker_4': 'Correct. Okay. Thank you. Correct.'",
        "'speaker_2': 'Councilmember Odie.'",
        "'speaker_3': 'Thank you. I mean, there were a couple emails from the public on this that kind of concern me on the fifth. I mean, I don't know if you had a chance to look at them, but, you know, there was some issues raised about, you know, interview that that one of the leaders had with an online magazine and'",
        "'speaker_3': 'talked about how this was used in Minneapolis, in New York. And there still hasn't been a change in behavior. And, you know, who's who does the training. So, I mean, I'm just wondering what you know, what would you say to people?'",
        "'speaker_3': 'About those concerns, especially when, you know, we've kind of given a community advisory committee this job and now we seem to be like picking their solution for them. Yeah. So so this is this is definitely I appreciate the question.'",
        "'speaker_3': 'I, I tried to infuse a little bit of that into the presentation this evening. I think that the conversation around implicit bias training gets mixed reviews. And there's no there's no question about that in terms of how the media and the the general public and the results, frankly, of fairness of of implicit bias training have have panned'",
        "'speaker_3': 'out in recent years. But what I would say to that is the there is an organizational approach to training our employees that we do fair, we do implicit bias training currently. And the question is, how do we want to deliver that training going forward?'",
        "'speaker_3': 'We're still at work. We're going to continue to deliver implicit bias training. I believe that that could change. And that, I think is the the community led component of the conversation. It could change. But in the meantime, we're trying to establish a work plan for our organization.'",
        "'speaker_3': 'And implicit bias training is is an important foundational piece from our perspective as we did the research on this topic and and the, the, the individual group that we've selected happens to bring in the community as part of that conversation.'",
        "'speaker_3': 'It's not just in a conference room training session. So there's an opportunity to build relationships between the police department and the community with the fair and impartial policing approach to implicit bias training. And so that's the reason that that particular group was put forward in this work program for the organization.'",
        "'speaker_2': 'Thank you, Mr. Burton. And I was going to ask if I could put any of our other staff on the spot who might want to comment. But is this is the program that has been used by any other cities in the Bay Area?'",
        "'speaker_2': 'Mr. Levitt.'",
        "'speaker_3': 'You? Yeah. The implicit, implicit bias training regarding the second group that Jerry Brown's talking about actually has been used extensively in Berkeley as my understanding, and has had a lot of success. And they have seen some change in Berkeley based on it.'",
        "'speaker_3': 'Obviously, we're talking about long term issues that have been going on in our society for a long time. So you aren't going to change it overnight. But they I've seen and heard favorable reviews in Berkeley and they still continue to use this program.'",
        "'speaker_3': 'It's not just a one time training. It's to try to create it as an integration into the organization overall. And actually, you can go beyond the police department if we find success in that program.'",
        "'speaker_2': 'Thank you. Anybody from H.R. want to comment? Not necessarily. Okay. Kills them every day. So, guys, see your hand up, please.'",
        "'speaker_3': 'Great. Well, thank you. So my understanding of what we're dealing with tonight is we wanna put together a race and equity action plan. And in putting that together, we're drawing on resources like something called gear and something called also fair and impartial policing.'",
        "'speaker_3': 'So they've got the background. They understand, you know, the types of questions that need to be considered. And they will help us staff and any other stakeholders involved in that process and putting together a fair and equity action plan, all of which will cost, we believe some are roughly around $75,000.'",
        "'speaker_3': 'So which is well and good. My concern I just want to make sure that we have an evaluation component within the within the plan that we come up with and that the resources we're drawing on for assistance, whether it's G&A or whether it's fair and impartial policing or, you know, maybe some knowledgeable community member, the resources that'",
        "'speaker_3': 'we draw on help us kind of identify how we might go about evaluating the Race and Equity Action Plan once it's designed and once it's implemented. And I think the evaluation component will be important because if we need to like change course somewhere in midstream, you know, we will have a basis for doing so.'",
        "'speaker_3': 'And the reason why I want to harp on, on, on kind of having some kind of thought through evaluation and evaluation process where we get the input from Gair or from, from fair and impartial policing or from the county DA's office.'",
        "'speaker_3': 'The reason why I think the evaluation part is important is because. You know, several years ago in the San Francisco Chronicle, there was a major newspaper article about this racial equity training for youth. And it was talking about, you know, how that this project, you know, it would bring in high school students from throughout the San Francisco'",
        "'speaker_3': 'Bay area to spend several days in the Santa Cruz Hills. And this and this was extensive right up in the San Francisco Chronicle front page. And and I have the link to it. But the punchline of that article, though, was that the trainers themselves might not live.'",
        "'speaker_3': 'And you know that the techniques that they used were kind of iffy. And so we want to make sure that obviously this is going to be done professionally, but it's also going to be sensitive to, you know, the different perspectives that I got being involved in the process.'",
        "'speaker_3': 'But for for I think for this to ultimately work, I think we need to be able to intentionally think through how we're going to evaluate and kind of track ourselves so that if we have to make any adjustments as we're implementing the Race and Equity Action Plan that we're getting, that that we have a shared basis for'",
        "'speaker_3': 'doing so. So that's why I will really stress having that. The process by which we're involving Gare or fair or impartial policing or the county DA's office, that they also help us think through how we're going to evaluate the race and equity plan that we ultimately design and implement.'",
        "'speaker_3': 'So that would be my $0.02 evaluation.'",
        "'speaker_2': 'I have been like 24/7.'",
        "'speaker_0': 'And I have.'",
        "'speaker_2': 'Councilmember Vela, did I see your handout?'",
        "'speaker_0': 'I was just going to ask if we're in council discussion or if it's just council questions right now. And if we had a public speaker.'",
        "'speaker_2': 'We're in free form. Well, the last I heard from the city clerk, we didn't have any public speakers because that status changed.'",
        "'speaker_1': 'Yes, we have two now.'",
        "'speaker_2': 'Oh, okay. So council, we can still entertain any clarifying questions about the staff report on that thing. And then let's hear from our public speakers and we'll come back to wrap up our discussion. Okay.'",
        "'speaker_1': 'Alexia Rocha.'",
        "'speaker_2': 'Good evening, Mr. Roger.'",
        "'speaker_0': 'Hi. Good evening, everybody. I am concerned to read about these recommendations specifically related to the fair and impartial policing trainings. First, I'm confused because the racism as a public health emergency didn't go through this summer as initiated, since folks felt the community hadn't been heard.'",
        "'speaker_0': 'Then the subcommittees were created so that the community could be heard. But then, here we are with proposed plans directly related to these subcommittees without their input beforehand. Second, this LLC, considered for the bias trainings, have been used in multiple cities where cops are still killing black and brown folks.'",
        "'speaker_0': 'Bias trainings have often backfired and instead had the opposite effect reinforcing biases which has been studied and is easily Google evil. I'm very curious who the city manager has been hearing reports from as to their success in Berkeley, because I imagine if you asked folks of color, they wouldn't agree.'",
        "'speaker_0': 'This all goes towards reform. And as we have seen over the many, many years that policing has been problematic. Reforms do not work. They maintain the status quo and perpetuate the inequitable treatment between people of color and white people.'",
        "'speaker_0': 'Not to mention, these trainings are incredibly expensive. Instead, I believe we should be looking at how we can reroute these funds for people so that services are actually without the funds from police, so that services are actually working for the people and not against them.'",
        "'speaker_0': 'Thank you for your time.'",
        "'speaker_2': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Rasheed Shabazz.'",
        "'speaker_2': 'Hello, Mr. Shabazz.'",
        "'speaker_3': 'Peace be with you. I'm there.'",
        "'speaker_2': 'With you.'",
        "'speaker_3': 'Hey. Hey. I wanted to just comment as far as the overall racial equity plan and then suggest another organization that may help with some of the evaluations specific for the police department. So first, I think in another correspondence I suggested the Government Alliance for Racial Equity.'",
        "'speaker_3': 'And I think, you know, they do a lot of great work. And I think for some aspects of them, some of the larger frameworks that may be helpful for some of the things internal to city government specifically related to FEP, I don't know if people call it that.'",
        "'speaker_3': 'I think just with the concerns that people raised about the independent investigation into the incident with the party room, Ollie Watkins, and the concern around the law enforcement sort of entanglement, I use that phrase with that organization and it being confidential.'",
        "'speaker_3': 'I think the similar concerns are going to come up with another organization that takes a research approach is the Center for Policing Equity. And what they focus on is more about data. And so I think that because I don't know to what extent the issue has been studied in Alameda, analyzing the data by race, by gender, by'",
        "'speaker_3': 'location. Without that, I don't know if just doing more training or not having evaluated past training will let folks know if there's a problem, the extent of the problem, etc.. So I would suggest an academic organization like CP in the Center for Policing Equity at UCLA, and I think there's a couple of other ones and other institutions'",
        "'speaker_3': 'that can provide that level of data analysis that can help inform the community process and also what your oversight is as a city council.'",
        "'speaker_2': 'Thank you, Mr. Chavez. Are there further public comments?'",
        "'speaker_1': 'We have one more chair. Johansson.'",
        "'speaker_2': 'Mr. Johansson. 15 view. I'm sorry. There you go.'",
        "'speaker_1': 'I'm doing that.'",
        "'speaker_2': 'There you go.'",
        "'speaker_1': 'I'm a little concerned.'",
        "'speaker_0': 'That this is kind of cutting off the community input that we have, the community committees that we're formed to kind of give us guidance on this question. And I'm sort.'",
        "'speaker_2': 'Of afraid that.'",
        "'speaker_0': 'If we do this tonight, then you're kind of tied their hands.'",
        "'speaker_2': 'So I think maybe we.'",
        "'speaker_0': 'Should listen to the community first before we go ahead with some of us. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Johansen. Any more public speakers, Madam Clerk?'",
        "'speaker_1': 'That was our last speaker.'",
        "'speaker_2': 'Okay, then I'm going to close public comment at this point, and I'm actually going to ask staff to comment on some of the things that we have heard. First of all, Mr. Bowden or whoever Mr. Leavitt, whoever wants to take this, is this proposal, does it somehow hamper or preclude the public process that has started what appears'",
        "'speaker_2': 'to be a very robust process?'",
        "'speaker_3': 'Yeah. And I, I can I could start and I could I would one alternative I would recommend in addressing some of these comments is the committees are looking and working toward trying to bring a interim report back to the city council in December.'",
        "'speaker_3': 'At this point, it took a little while to get them together. So they're trying to bring some report, an interim report in December. So one option would be to maybe get is a little bit separate is separate from the policing committees.'",
        "'speaker_3': 'And so I would one alternative would be to go forward with care and we could take and maybe go forward and continue to research the district attorney's program that they're instituting. And then we could take the other part that people have more concerns about, and we could actually move that out to December, because I think between now'",
        "'speaker_3': 'and December probably is not a lengthy time. We're talking about something that we're trying to create a change in dynamics going forward for for a for the organization as a whole. So waiting until December for that, for the fair and implicit bias could be something that we wait till December and have those committees review it.'",
        "'speaker_3': 'That would be an alternative to this.'",
        "'speaker_2': 'Thank you. And I will just share that. I had a conversation with the district attorney, Nancy O'Malley, in the last month, and she did mention this pilot program that the county and her office had started, which would be to it actually has a lot of resemblance to the code program that you probably all hear.'",
        "'speaker_2': 'Tired of hearing me raise. But it does have a lot of merits. And 31 years old now. So anyway, I said, oh, please talk to our city manager, because I would be very interested in in having Almeida participate in something like that.'",
        "'speaker_2': 'So I think both the city manager, maybe the city attorney have had some conversations with her. And so thank you for that input. Mr. LEVITT. Councilmember Vale, I throw your hands up.'",
        "'speaker_0': 'Yeah, I, I'm a few things I'm supportive of generally the air program. I have a lot of reservations about implicit bias. There was actually an article in NPR about the NYPD study on implicit bias training and changing minds.'",
        "'speaker_0': 'And ultimately the conclusion was that it doesn't necessarily change behavior. And as a lot of law enforcement departments are looking at either changes in policy or potential reform, one of the most common responses has been to basically have folks take implicit bias training.'",
        "'speaker_0': 'And, you know, some of the original people behind developing implicit bias training, including some of the professors from Harvard, have said that ultimately they have a few concerns. One is that they worry about the quality of the implicit bias training for police and that there are a lot of concepts that are out there by different folks, but'",
        "'speaker_0': 'they're not necessarily all the same. And there's a certain degree of expertize that's needed. The other comments that that I thought were relevant and important was that, you know, the training itself, this was another psychology professor was that the training itself probably doesn't hurt, but there's an opportunity cost to consider that, especially in an effort to fix'",
        "'speaker_0': 'implicit. If the effort is to fix implicit bias in officers, it really often displaces other kinds of training that could be more effective and also can give cities an excuse to ignore factors that are external to policing but probably have a greater impact in the overall results.'",
        "'speaker_0': 'And so, you know, the suggestion has basically been that really this is not necessarily about looking at certain types of implicit bias training, but really that we find levels of intervention relative to overall office culture, which is, I think, what Gary is more geared at just, just in general, and that we are also looking at understanding the'",
        "'speaker_0': 'reasons for certain communities to have more encounters that are negative or with police, such as poverty or housing policies, that that end up concentrating particular ethnic groups into areas that then become designated as crime prone. And I think we've heard a lot of comments not just at this council meeting in our public comments, but in other council'",
        "'speaker_0': 'meetings of kind of the bias that exists in our community. And there's also kind of a widespread focus now nationally also on looking at kind of understanding, you know, different policies that we have in place, whether they're housing policies or different laws that we've enacted, that that cause people to really focus on trying to criminalize survival.'",
        "'speaker_0': 'And so, you know, I think I guess my concern is twofold. One, that I want to give room for this community process. So I would appreciate kind of holding back on the Fed and letting that process take place.'",
        "'speaker_0': 'But I do think that there's value in Gary specifically because it's more, as I stated, geared at that overall cultural approach within within the city or the organization and kind of addressing that and helping us focus on a process to really address those things.'",
        "'speaker_0': 'If we do partner with the city attorney's office or that's something that's on the table, I will have to abstain from that. My my employer represents the rank and file district attorneys at Alameda County, so I will not be be commenting or voting on that.'",
        "'speaker_0': 'But I just wanted to put that out there. And I, as somebody who has represented does represent people that are in law enforcement, I think that there's a lot of good intent behind things like the CIP, but I think that they ultimately take away from from broader goals and detract from the larger conversation, which is maybe where'",
        "'speaker_0': 'we want to spend the bulk of our time. So, you know, I do appreciate staff trying to move forward on this. And I think that there's a lot of misinformation out there that that the city is kind of dragging its heels and not trying to respond.'",
        "'speaker_0': 'And so I really appreciate this being on the agenda and that this is continuing to come back. To us. I think you heard from us that we wanted to see action. And so I think that's why there in particular is coming back to us.'",
        "'speaker_0': 'So I want to acknowledge that that that isn't just staff motivated. That was really coming from council in our conversations this summer, but that I think that there is room for kind of the specifics of that to be worked out through the community led process.'",
        "'speaker_0': 'And I think what would be helpful is also if the community if we could get some feedback on the community led process, like what sort of public meetings they might be having or opportunities for members of the public to to comment and be involved in that.'",
        "'speaker_0': 'I think I know that that's happening. I just don't want it to seem like the city is hiding that.'",
        "'speaker_2': 'Thank you. Councilmember Vela, Councilmember ODA, you're next.'",
        "'speaker_3': 'Thank you, Madam Mayor. I'm pretty much going to agree with everything my colleague just said, except I will comment on the 3D alternative a little bit. So I'm fine with the. With the gear because I think that was something we specifically called out when we were still deciding what we're going to do with that emergency health declaration'",
        "'speaker_3': 'that we even passed that on the first day. And, you know, I've personally heard instances of of of racism directed at our members of staff, and that's concerning. So I think the sooner we can work on that internally, the better.'",
        "'speaker_3': 'I mean, we just went through this process to kind of center our communities of color on the solution and then to bring forward a suggestion for the DA's office and to bring out a suggestion from this fit, which is basically funded by DOJ grants.'",
        "'speaker_3': 'I mean, it's kind of, in my opinion, centering institutional law enforcement. And I mean, if I mean, I'm not in the community of color, but I would kind of take that as a slap in the face because that's kind of what I'm hearing we're not supposed to do.'",
        "'speaker_3': 'So I would like to see this committee who we trusted with this, you know, and again, whether it's, you know, this three D program or cahoots or expanding community, parent medicine or whatever the solution is going to be understanding that, you know, that solution or recommendations were going to come back from the task force as opposed to'",
        "'speaker_3': 'the council kind of picking and choosing winners and losers. So, you know, I prefer that that that part of this agenda item, it will kind of be be evaluated by the committee because the Center for Policing Equity, I mean, that that's something I don't know if we've looked at.'",
        "'speaker_3': 'But, you know, just looking at the website, you know, seems like something I'd be more inclined to to hear more about than this other stuff which some members of the community have raised concerns about. So I think we should take those seriously.'",
        "'speaker_2': 'Thank you. Councilmember Oti, Councilmember de SAC.'",
        "'speaker_3': 'Well, great. Let me add to this conversation. Let me add this. I do think that because in Alameda specifically or across the country generally, the police force are especially implicated and the discussion about race and equity and how we treat one another.'",
        "'speaker_3': 'I believe that the process that would lead to the race inequity action plan that we're talking about tonight must involve the lens, the perspective of an organization such as fair and impartial policing. It doesn't have to be fair, impartial policing, but it has to be.'",
        "'speaker_3': 'I think the perspective of the police needs to be included in this process. And I say that especially because when it comes to race and equity type of issues that are related to police, I think there's something very special about the interaction between the possible interaction between police and and and persons of color and that and that'",
        "'speaker_3': 'quote unquote, something special has to do with, you know, issues of potential violence and harm. And so I think we definitely need an organization who understands the policing perspectives and the procedures and the policies, as well as an organization perhaps like Aguerre, who also understands, you know, the broader questions regarding race and culture and equity.'",
        "'speaker_3': 'So I think it would it would weaken the race and equity action plan that we're trying to put together if we do not include an organization that intentionally includes a perspective of of the police industry. Again, it doesn't have to be fair and impartial police and maybe it's someone else.'",
        "'speaker_3': 'But but but whomever I think that has to be involved because I don't know, for example, if government alliance on race inequity, if they have the subject matter expertize to be able to translate, you know, the questions, the questions and answers that they have with regard to matters of race and equity, if they can translate that into'",
        "'speaker_3': 'specific policies and procedures. Regarding the police force, I don't know if they have that subject matter expertize. So I do think you need someone like a FIP. It doesn't have to be them, but but it has to be someone with kind of a policing background.'",
        "'speaker_3': 'So so I will disagree with the city manager's suggestion that we hold off on including the FIP and move forward with the with Aguiar. I think we, I think we we we ought to move forward. And if we're going to hold off on the FIP, we ought to hold off only because we're in search of someone like'",
        "'speaker_3': 'FIP. I don't know if it's if it's the UCLA outfit that was referenced earlier today, but the fact that is associated with UCLA, I mean, does in my from my perspective, give it some semblance of credibility, particularly from an academic perspective, as well as from from policy and practice perspective.'",
        "'speaker_3': 'It doesn't again, it doesn't have to be that that that organization from UCLA. But but but I do believe it has to be someone who is intimately familiar with them with the practices and procedures of of policing and and how we can improve that through the Race Equity Action Plan.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember de so face paradox.'",
        "'speaker_4': 'I have to say, when Councilmember de SAC was saying about to say what his perception of UCLA was, I was really expecting this cal side to come out.'",
        "'speaker_3': 'So I held back.'",
        "'speaker_2': 'I think it's part of the system and I think you might have a familial relationship to that.'",
        "'speaker_4': 'So I just I said it. There's a lot that Johnny is and I was praising the UCLA system in this case. So I want to I want to step back and a couple of things. I have had the opportunity over the last few weeks to meet with our interim police chief and our in our captains to talk'",
        "'speaker_4': 'about some issues. And I have really appreciated the openness, the transparency and the commitment to conversation that that that I have that I have witnessed. And and I do feel that there is I say this talk for for the communities who is listening, a real commitment to openly talking about these issues in a way that that I'",
        "'speaker_4': 'have not seen up until this point. And so I just wanted to really acknowledge, you know, and appreciate the FIP process and the real attempt to. Be proactive. You know, I don't feel that I am the right person to decide whether PHP is the right process, whether implicit bias is the right process.'",
        "'speaker_4': 'But I do. And for me, I am interested in willing to approve the financed financial side of this on the FP issue. You know, my, my recommendation would be that if staff feels this is the first thing that should be done, that there should be some conversation with the appropriate subcommittee and steering committee, and then we should'",
        "'speaker_4': 'come back and hear what their feedback was so that I don't feel comfortable approving this program tonight. But I know that a lot of thought has gone into it, and I have read the studies to say implicit bias training is not useful.'",
        "'speaker_4': 'And I also know that, you know, the city of San Francisco who has gone, you know, you know, three young gun really strongly into this issue offers it. And it is a training that is that is encouraged for all employees.'",
        "'speaker_4': 'So, you know, I'm not going to micromanage with the rate with the right solution, is there? But I would like to make sure that we we hear a little bit more in this conversation. We've had lots of conversations about racism and what it is.'",
        "'speaker_4': 'And, you know, I think that there's still a lot of room for all of us to have conversations about how we can call out racist actions without accusing somebody of being an immoral, racist person. And I think well, Councilmember De Saag said that, you know, policing is kind of right there in the center in Alameda of kind'",
        "'speaker_4': 'of racial inequity and whatnot. And then maybe paraphrasing a little, you know, I don't mean on not not be correct, but quite honestly I think, you know, we just in case our police staff and enforcement effort here and we're having the same conversation about land use right now.'",
        "'speaker_4': 'We're having the same conversation about parks. I don't want to single out the police. There is a reason why they have been the focal point in part of it is because of what happened in Minneapolis. But part of it is what happened after Minneapolis with George Floyd and the conversations that we had.'",
        "'speaker_4': 'I, I do find myself wondering if there are some conversations before we start with implicit bias training that might need to happen to make sure that everybody is on the same page about how we're doing this and why we're doing this.'",
        "'speaker_4': 'But, you know, anger might be a place that can help the city. San Francisco has been a member of Dare. I have not personally gone through any of their programs, but I work with multiple people who have gone through their trainings.'",
        "'speaker_4': 'But the city has made a strong commitment to just putting cohort after cohort after cohort of people through their training. And that's that's I think what we need to understand is that this is not a one time cost for us.'",
        "'speaker_4': 'This is a commitment that we're making and that we're making for years and that a year from now, it is really going to be hard for us to out to do the important evaluation that Councilmember de SAC says it reminded us is important earlier today.'",
        "'speaker_4': 'So, you know, I strongly encourage us and have strongly encouraged us in the past to to join there and to get that underway. I would be happy to support the $75,000 with direction that staff come back when they have kind of something that they want to.'",
        "'speaker_4': 'I appreciate that. The I don't think Gare and RFP interlink. They are two separate things, but I appreciate that there's some interested in looking at how do we kick off some conversations here in the police department based on community feedback that we have received?'",
        "'speaker_4': 'I'd like that. I'd like both the police department and our community groups, too, to provide that feedback. Anyway, I yeah. I want to correct a couple of things that I heard tonight. We're two months in, and we have yet to have one single public meeting of these steering committee.'",
        "'speaker_4': 'In fact, a steering committee themselves have yet to meet. So we we don't have work plans. You know, I you know, in July, the council said, well, if we don't feel that they've you know, we've heard from them, we don't have information, we will we'll change course.'",
        "'speaker_4': 'I'm not expecting to change course. But I want to be careful that we are suggesting that there is a robust public process that is has happened because there has been zero public process. In fact, I can't even get the names of the people who are on the subcommittees at this point in time.'",
        "'speaker_4': 'And anyway, I just I want to be careful that, yes, we have a public we have public groups that are doing work. But until they start actually engaging the public, you know, we don't know what's happening. And that does concern me a little bit.'",
        "'speaker_4': 'I was one who said, hey, let's start talking about the city, how the city can start engaging on this. So I'm really appreciative of the the city manager, even though the council didn't actually support moving forward on this quickly.'",
        "'speaker_4': 'I saw the importance of this and brought it forward. And, you know, I think our city is is moving in the right direction. But I think we have some big questions and our timelines are starting to slip. And I don't know how to address that, but I think it's a conversation we should probably bring back some time'",
        "'speaker_4': 'so that we can, because now we're hearing our first report back from these committees will be in December when we were in July, going to be hearing back at least initial information in September. But I look forward to supporting this tonight with the caveat about the fifth and community input.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you, Vice Mayor. Um, I don't think it's my imagination. Didn't we receive the spreadsheet of all the committee members broken down by the committee? The city manager sent them to us. And I don't think you were excluded just last week, I believe, Mr. Levitt.'",
        "'speaker_3': 'I did, but I will send. I sent it out.'",
        "'speaker_2': 'Yeah, yeah.'",
        "'speaker_4': 'Thanks. I even just. I just looked for it, so I must have deleted it. Thank you.'",
        "'speaker_2': 'We get a lot of emails. I'll be the first to say if I haven't replied yours, please forgive me. So I think we've heard from everyone. So let me just chime in. Good. And I'll give you another chance if you want to.'",
        "'speaker_2': 'But thank you. Good. Good comments. I really appreciate Assistant City Manager Bowden putting this report together, doing a really deep dove. I know the city manager and I and I guess I've heard from business city manager Bowden mentioned a couple of times what good results Berkeley has had with gear.'",
        "'speaker_2': 'It's good to hear about San Francisco as well because I don't think we need to reinvent the wheel. And you know, when it comes to the Bay Area, Bay Area cities have certain issues in common and certain similar sensibilities.'",
        "'speaker_2': 'And so I think the recommendations are good about moving forward with the gear. I would concur with the city manager's recommendation that the fifth portion could wait until we've heard from from our subcommittees their input. And I want to address something Councilmember Otis said, because I didn't want to leave the impression that I signed up for being'",
        "'speaker_2': 'in this Diaz pilot, but I don't even know when it started. It was unclear whether it was even going to start. But sometimes if you don't get at least your foot in the door, then the opportunity, you know, closes.'",
        "'speaker_2': 'And so I chose the day this in Alameda resident but I'm really proud of this this work that we're undertaking. And yeah, it's taking time but there's the member is the steering committee and the whole big group they have on that and they have divided themselves into the relevant subcommittees.'",
        "'speaker_2': 'And I think we had about 200 expressions of interest from the community, which I consider a success right there, that there's so much interest in this, in this topic. And I was really pleased to see a wide range of folks who who are participating.'",
        "'speaker_2': 'But I yes, I very much favor approving the $75,000 expenditure moving forward as the city manager recommend. And I'm happy to if someone wants to make the motion, I think. Councilmember Kelly, did you want to say one more thing?'",
        "'speaker_2': 'I thought that had a good.'",
        "'speaker_0': 'Yeah, just that the update was sent out on September 7th and that the committee met on the eighth and the subcommittee members are all listed on the City of Oneida website. If you go to our website, it's, it's there under the policing review and racial equity.'",
        "'speaker_0': 'If you go to home residents policing review and racial equity, it also has the presentation in the agenda from the meetings with the the Police Reform Citizen's Committee's kick off convening from September 8th. And then all the names of the participants are as well as the selection committee are all there as well as their background.'",
        "'speaker_0': 'So I just wanted to put that out there, but I do want to recognize again the digital divide and the fact that just because it's on our website doesn't mean that people necessarily know about it. And so I do think perhaps in the city manager updates, if we can, at our council meetings, if we could just hear'",
        "'speaker_0': 'in advance if there are meetings, that sort of thing, I think members of the public would appreciate it.'",
        "'speaker_2': 'That's a good point, Councilmember Vela. And I think this weekend is when I do mine. I write my next article as you monthly articles, not for the newspapers. I'll try to be sure to include that one in there.'",
        "'speaker_0': 'Something about that as well.'",
        "'speaker_2': 'So with that, do we have a motion for moving forward? Councilmember Brody, you're leaning forward. 10 minutes. And that's to make a motion or.'",
        "'speaker_3': 'Oh, I got to look up. I got to open my eyes.'",
        "'speaker_2': 'The vice mayor's got is that.'",
        "'speaker_4': 'I move that we approve the city joining together and moving forward in developing a work plan and the and approved $75,000 for this effort including an effort to start engaging with our police force in concert in consultation with our both our police department and community enforcement subcommittees.'",
        "'speaker_2': 'Okay. We've had a motion I'll.'",
        "'speaker_0': 'Second that.'",
        "'speaker_2': 'We have a statement by Councilmember Vela. Any further discussion?'",
        "'speaker_3': 'Councilmember So would that mean that before whatever program or contractor or whatever we hired, it would come back to us? So or. You know how much they plan on that and what we would weigh. Yeah, we would.'",
        "'speaker_2': 'Have it.'",
        "'speaker_3': 'Outside of Gaza. We would wait on the on the other the fit, as people have called it. And we would wait on that until the police subcommittee reports come back. Or that's not my mom. Prioritize this or something.'",
        "'speaker_4': 'You're welcome.'",
        "'speaker_2': 'Mr.. Mr.. KNOX Wait. Just let Mr. Oteh finish his comments and then I will call on you. Counselor, O.D. You were say.'",
        "'speaker_3': 'I don't know. I kind of lost my train of thought because I was interrupted by Jim. It's okay.'",
        "'speaker_2': 'We're going to take a break after this, guys. So that's when I get a break. We've got more than that.'",
        "'speaker_3': 'So I guess I just want to make sure that, you know, the staff doesn't go off and pick somebody, you know, without somebody taking a second pair of eyes. On what the committee recommended. So we can make sure that, you know, whatever happens is aligned with with what the committee recommends.'",
        "'speaker_3': 'Not that I don't trust you here, but this is a very sensitive issue. And I think we need to work quickly, but also work smartly.'",
        "'speaker_2': 'And you want that community input is what I'm hearing.'",
        "'speaker_3': 'Right. And I'm going to make sure that, you know, we validate that it's been followed.'",
        "'speaker_2': 'Okay. Back to you, vice mayor.'",
        "'speaker_4': 'All right. So the motion was to actually allow the staff to have the flexibility to hire at the the appropriate consultant in consultation with the committees. I wasn't. We can ask we can add to it if you want, that it has to come back for council approval.'",
        "'speaker_4': 'That starts to feel like we're getting into administrative stuff, but maybe we can bring it back as an informative. My guess is the committees will let us know if something is moving forward that is not consistent with the recommendations.'",
        "'speaker_2': 'Okay. I understood that. Rody, does that satisfy your concerns?'",
        "'speaker_3': 'And may it be good to just add that to the motion. You know, I thought we were welcoming feedback from, you know, our bipoc communities on these things.'",
        "'speaker_2': 'So I think that's what the vice mayor is saying, are you not?'",
        "'speaker_4': 'That was that was in the motion. That was specifically what's not in the motion is that it's going to come back for council approval can.'",
        "'speaker_2': 'But the vice mayor is proposing this consultation with the subcommittees. Which are largely made up of our bipoc community.'",
        "'speaker_3': 'I'd like to say I still would like to review it and make sure that. Whoever is selected. I just want to have one more evaluation from the council before it selected. I mean, what if what if the staff refused declines the recommendation of of the committee.'",
        "'speaker_3': 'I mean, that's possible. Or the committee makes multiple recommendations.'",
        "'speaker_2': 'Oh, I don't know. Council members What do we think? Council Member Fellow.'",
        "'speaker_0': '$75,000 is not not a lot of money. And so my assumption would be that if there's multiple suggestions that we go with multiple things, that that will come back to us. I also think that what we heard was that there's going to be a report back from the committee in December.'",
        "'speaker_0': 'And so I would expect as part of that report back from the committees, that they address the usage of the $75,000, as well as what their recommendation was to this. So I and I heard from the city manager that he plans to come back.'",
        "'speaker_0': 'I just don't want to hold this up as a matter of official council approval. But I think we've made it very clear that it needs to be in consultation with these committees. And I think that there are some very vocal members of our community who know how to get in touch with us, if in that who are'",
        "'speaker_0': 'involved. And specifically on the anti-racism process of this, I feel very comfortable with the folks that are involved.'",
        "'speaker_2': 'Okay. So and I would say my concern. All right. Well, and I think your concern will be addressed, but I appreciate you raising that. Thank you. So we've had a motion by Vice Mayor Knox White, seconded.'",
        "'speaker_1': 'By Councilmember Vela.'",
        "'speaker_2': 'That's her. Yes. Thank you. I'm glad someone's keeping track. Any further discussions thing, then? Maybe we have a roll call vote with.'",
        "'speaker_1': 'Councilmember De said. It's not quite.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Odie. I vla.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Mayor as the Ashcroft.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Like carries by five I.'",
        "'speaker_2': 'Thank you, everyone. A very good discussion. Thank you. Members of staff in chief Emmett Bronstein, the netto, our assistant city manager. City manager, thank you very much. I'm granting a ten minute break for us. We will be back at 945, be at 945.'",
        "'speaker_2': 'So you might want to turn your cameras and your audio. Councilor Odie council member. That I thought.'",
        "'speaker_3': 'Oh, someone need to shave.'",
        "'speaker_2': 'Oh, I wasn't going to mention that to. Okay. There she is. Hey. So, Laura, are you ready for us?'",
        "'speaker_1': 'Yes, we are ready.'",
        "'speaker_2': 'All right. And let's go live.'",
        "'speaker_1': 'Eight. So item six is introduction of ordinance amending the army to missile code by adding a new article. Okay, that one is 19/3 party food and how that's not 19 touch. Wait a.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'I used Roman numerals there. You're killing me right now. That's ten. But then it be v i v and it is. That's weird. I think there's a problem with that rating. I got to double check that. Anyway, to an article at third party food delivery of Chapter six Business Occupations and Industries establishing a temporary limit on charges'",
        "'speaker_1': 'imposed by third party delivery services during the locally declared state of emergency related to the COVID 19 pandemic.'",
        "'speaker_2': 'Is it? 29? Is that what that is?'",
        "'speaker_1': 'I don't know because I thought that was I x 29 was i x? That's what I tried.'",
        "'speaker_2': 'Oh, I didn't know. Probably some third grader will email us. But so is this. And this potter's.'",
        "'speaker_0': 'Good evening, Council members. Mayor, I have a very short introduction and the pleasure of turning the presentation over to Amanda Gursky, who is going to be giving the staff report. And with that, Amanda, myself and Lois will be available to answer any questions.'",
        "'speaker_2': 'Hi. So there's this butler. Okay. All right. You welcome this jerky. Take it away.'",
        "'speaker_0': 'Thank you. So good evening. My name's Amanda Garki. I'm with the Community Development Department. I'm just going to give a short presentation on the ordinance we're proposing tonight that would limit the fees charged to Alameda Restaurants by third party delivery companies.'",
        "'speaker_0': 'So by way of background, I know folks are aware of how hard hit the restaurant industry has been by COVID 19. Like many businesses, restaurants were forced to close in March, and many have turned to takeout and delivery as their main source of income.'",
        "'speaker_0': 'Next slide, please. So after the initial shelter in place, orders took hold. Third party delivery services like GrubHub, Postmates, DoorDash, they were. They actually played a really important role in helping our restaurants to come up to scale, to respond to demand and kind of the new COVID reality that many of the restaurants were facing.'",
        "'speaker_0': 'So they provide a variety of services. In addition to coordinating deliveries, they also help to market restaurants, bring their menus online, provide customer assistance and help with point of sale technologies among other among other services. They also pay credit card processing fees and for liability insurance and PPE for delivery drivers.'",
        "'speaker_0': 'So, you know, these services really offer a lot, but they also, at the same time charge a lot of the fees that these companies charge restaurants for. Services vary based on individual service packages, but they range from 20 to 30% of purchase price.'",
        "'speaker_0': 'And in addition to charging restaurants, they also charge fees to customers. One 2019 article found that customer fees ranged from 12 to 30% of purchase price. Next slide, please. So in preparing for this ordinance, we reached out to Alameda Restaurants and we heard from many of them that delivery and takeout are their primary sources of income at'",
        "'speaker_0': 'this time. These restaurants are already operating on pretty slim margins of the 20 to 30%. Fees represent a real hardship for them. We heard from restaurant owners who are not taking salaries, who are dipping into their personal savings to keep their businesses running, and who are relying on PPE loans, which are quickly running out.'",
        "'speaker_0': 'I spoke to one restaurant owner who has a very successful restaurant, been working seven days a week, and he thinks that if things don't change, he might have to start thinking about closing in December. And that was kind of a thread that we heard throughout this process.'",
        "'speaker_0': 'We also recently conducted a focus group of restaurants and retailers, and we heard that folks are predicting a wave of closures over the winter if conditions don't change. Next slide, please. So the proposed ordinance would limit fees on restaurants to 15% of purchase price.'",
        "'speaker_0': 'This number is consistent with ordinances that have been enacted by other Bay Area cities, including San Francisco, San Leandro, Livermore, Fremont and a number of other cities across the country. We're recommending that the ordinance be temporary so that it would end when the state of emergency is lifted or whenever indoor dining can resume at 100%, whichever happens'",
        "'speaker_0': 'later. We're proposing a wide variety of enforcement options, including civil, criminal and administrative. And there's also a few other elements that are included in the proposed ordinance not allowing customer or not allowing the services to increase menu prices unless that was initiated by the restaurants, not allowing them to garnish or retain any portion of the driver tip'",
        "'speaker_0': 'and not allowing them to charge for telephone orders that don't result in a transaction. So in preparing for this ordinance, we also reached out to the third party delivery companies to get their feedback on this. And we heard from them that there may be some impact on the services they can provide if we implement and or limits'",
        "'speaker_0': '. They talked about reduced marketing for restaurants will be reduced delivery radii and also the potential to increase fees for customers. They said that higher fees to customers may result in fewer orders for restaurants through their company. So we we did run those potential impacts by some of the restaurants, and we heard some folks who had concerns about'",
        "'speaker_0': 'them. We heard other restaurants who weren't terribly concerned about it. One point I wanted to note that came up a few times was that some restaurants felt that if there were that it actually might be a good thing if fewer orders were going through the third party delivery companies, because it might lead to more direct takeout orders'",
        "'speaker_0': ', which is actually more profitable and preferred by many of the restaurants. Next slide, please. So in terms of alternatives, know one possible one would be to do something slightly higher than 15%. And the city of Oakland, they did a 15% fee limit for restaurants, but then also allowed the services to pass on their credit card processing fees'",
        "'speaker_0': '. Notes average about 2 to 3%. So it's kind of having a few limits up more around the 17, 18% point that just gives the companies a little more breathing room. In a similar vein, Berkeley and Los Angeles and New York and a few other cities have done a 15% plus five model.'",
        "'speaker_0': 'So that's 15% for delivery fees plus five for service fees. That comes out to about 20%. Council also has the option of, in addition to limiting the restaurant fee to 15% or some other amount of freezing customer fees at the current rate.'",
        "'speaker_0': 'So this option is recommended by our city attorney's office as a way to ensure that the costs aren't passed on to customers. And the research we did for this, we weren't able to find any other cities that have yet have passed a freeze on customer fees.'",
        "'speaker_0': 'So to my knowledge, at this point, we would be the first and I will say that we heard from delivery companies that if we freeze customer fees, that they may consider legal action against us or pull out of Alameda altogether.'",
        "'speaker_0': 'And then, of course, there's always no action. So that concludes my presentation and I'm happy to take any questions.'",
        "'speaker_2': 'Thank you. Thank you. And so you weren't able to find any cities that have capped the amount of fees charged customers that the city of Santa monica. Or were you looking at Bay Area cities?'",
        "'speaker_0': 'I, i we looked throughout the country, but we weren't able to look at all of them. I did not look at the city of Santa monica. So it's possible that that but that that they have done that.'",
        "'speaker_2': 'Okay. Um. Our city attorney has the connections in Santa monica. This is a very interesting, interesting item and timely because. Restaurants have been, as you noted, very hard hit. And then sometimes it seems like they just can't catch a break because just as our city council approved an and I want to really compliment the economic development department'",
        "'speaker_2': 'headed by Ms.. Butler, Mr. King, Ms.. Potter and air quality works with you. They've really reached out and worked closely with our business community, and just every week I could make the town call today, but every week there's a business townhall Tuesdays at 2 p.m. and really helping guide our businesses through some really difficult times.'",
        "'speaker_2': 'And then just as the public health department said, our COVID numbers are leveling off. So you can open for outdoor dining. And we set up these nice expanded spaces and our downtowns are closing off side streets. Then we get this horrendous air quality.'",
        "'speaker_2': 'Not today, but that kept a lot of people from going out and eating out. And then winter is coming. I know that the Game of Thrones, but that, you know, pretty soon we might have rain. I mean, I wish we'd get it tomorrow without lightning or wind, of course, but but that that's going to hamper some of'",
        "'speaker_2': 'the outdoor dining. So I think this is very timely will entertain any clarifying questions about the staff report. But I want to just check with the city clerk. Do we have public speakers on the side of that?'",
        "'speaker_1': 'We do not have any public speakers.'",
        "'speaker_2': 'All right. You'll let us know if we do. And so clarify, well, clarifying questions, whether kind of questions, because apparently we don't have public speakers. Councilmember Desai.'",
        "'speaker_3': 'Clarifying question. So in with regard to the city attorney's recommendation of also freezing on the consumer side, how pervasive was the response by potentially affected businesses when who said they might pull out? I meant, was that just one person saying that?'",
        "'speaker_3': 'Was that a across the board? How pervasive was that?'",
        "'speaker_2': 'And when we say businesses, you're talking about the Uber, the Lyft.'",
        "'speaker_3': 'Exactly who might pull out of because, you know, they don't want to they don't want to have their the consumer side frozen.'",
        "'speaker_0': 'Okay. We did hear from I think.'",
        "'speaker_2': 'I think.'",
        "'speaker_0': 'Three of the four we spoke to said that they would have major concerns about it. One, it hadn't come up at the time that we talked to them.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_2': 'As a clarifying question. No. Shaking your head. No. Okay. Something that I cannot remember where I heard this or read this. But the state not that I want to see Uber and Lyft go out of business, because there are other things that I try to keep in mind is that, you know, nothing is so simple as this'",
        "'speaker_2': 'is.'",
        "'speaker_0': 'Right, this is wrong.'",
        "'speaker_2': 'Because obviously people drive for these companies, Uber and Lyft, because they're trying to make ends meet. It's a way that gives them the flexibility. Sometimes in a household with two parents, kids, this.'",
        "'speaker_0': 'Is a way.'",
        "'speaker_2': 'That they can do that. You know, tag team parenting that is familiar to many of us who've done it and, you know, cover someone's home with the kids. Most of us aren't making the money. And so I don't want to I don't want to disparage that aspect of it.'",
        "'speaker_2': 'What I haven't been able to find out and you might know better, how are these drivers compensated? Is that what's the model? If if you know.'",
        "'speaker_0': 'So it it varies. They each seem to have their own method and they are rather complicated. They they use it. I'm thinking of one we spoke to that use an algorithm that included everything from the size of the order, the distance they had to drive, the time of day and demand that was happening.'",
        "'speaker_0': 'And then they and I know that they usually will have a minimum amount that they pay and then it kind of goes up from there. And then a lot of them also use bonus systems where they'll you know, if you fulfill a certain number of orders in a day, they'll give you a $500 bonus or something of'",
        "'speaker_0': 'that.'",
        "'speaker_2': 'And I know Councilmember Bella has some professional experience that might be what you're going to comment on. Um, Councilmember, then I think I see the vice mayor stand up maybe. Okay. Yeah.'",
        "'speaker_0': 'I was just going to say, you know, in addition to the the chamber, the business roundtables that happen on Tuesdays, there's also a subcommittee of the restaurants that meet weekly as well. I happened to sit in to the the meeting with DoorDash and one of the more appalling things that was said, or I thought at least just'",
        "'speaker_0': 'the tone deafness of it, was that, you know, not all businesses are doing well right now. And that was said to our small business restaurant owners. And what we know is, is that some of these companies have billion dollar valuations.'",
        "'speaker_0': 'And to the mayor's question, how are the the drivers compensated? They're not compensated as employees. They don't get sick days. They don't have paid sick leave. They don't have worker's compensation. They don't have Social Security. So, you know, I think my concern is in seeing the price gouging.'",
        "'speaker_0': 'And that's really what this is and what this is about of our small businesses. And Madam Mayor, I think we were on a town hall together where one of our small business owners, a restaurant owner, came forward with a bill where like 40% was taken out.'",
        "'speaker_0': 'So he did like $1,000 in business and pocketed just under 600. That that really concerns me because what it means is that these large companies are taking money from our community. They're taking opportunity from our community. And they're not necessarily helping the individuals who are actually doing the hard labor of bringing and providing the service of bringing'",
        "'speaker_0': 'food from the restaurants to the customers. So I also think it was really interesting hearing from our small businesses relative to this conversation is where the deliveries are going. And Alameda is not geographically, we're not we're not geographically spread out.'",
        "'speaker_0': 'And a lot of the business is staying in our city and not going far out. So even for the deliveries that are going outside of Alameda, they're going to Oakland or San Leandro, not not tremendous distances away. So I think for many reasons, it makes sense for us to cap these fees.'",
        "'speaker_0': 'I'm really glad that we had both. I think Lois was on the call with the restaurants as well as Amanda. And I think as a council, we've taken a lot of steps to help our small businesses. And this is just another one of those steps that will really make a difference.'",
        "'speaker_0': 'And it's something that we can do that they've been asking for. I am interested to hear from our city attorney about what the city of Santa monica has done or may be doing relative to the consumer side of things.'",
        "'speaker_0': 'I do think that that's a concern. I don't know how many other cities are tracking this. I know that other cities like San Francisco and San Leandro have capped the delivery fees. But if we can hear from the city attorney a little bit about where his concern for that aspect comes from in terms of the potential for'",
        "'speaker_0': 'the money to get shifted on to the consumer. Could could you speak to that city attorney?'",
        "'speaker_2': 'Mr. Shin. Ah, you muted.'",
        "'speaker_3': 'There we go. I'm happy to share some thoughts. I believe that there is the one city out there that's actively considering limiting consumer charges in Chicago. I know that Monica has consistently looked at consumer charges as an issue, hasn't taken any final action.'",
        "'speaker_3': 'And my concern has to do with the fact that essentially these third party, these online apps, essentially delivery apps, takes in revenue from two sources, the restaurants that they charge and the customers that pay for the food. And so if we adopt an ordinance that only limits the charge in one place and does not limit the charge'",
        "'speaker_3': 'in the second place, Alameda residents could face consequences such as increased charges because it is likely that these apps will make themselves whole in some other way by increasing charges to our residents. And as a matter of example, I believe Uber Eats is the one example where they have increased charges to residents after a jurisdiction recall exactly'",
        "'speaker_3': 'which jurisdictions capped delivery charges. And the result is that the residents of the community ultimately suffer these price gouging. And it is for that and other reasons we shared with you in our confidential memo that we are recommending that not only the Council consider capping charges to restaurants, but also freeze and place the delivery fees that they're'",
        "'speaker_3': 'charging to customers. As of the publication of the staff report, which is September 3rd.'",
        "'speaker_0': 'Not your muted.'",
        "'speaker_2': 'I know. I just realized that the vice mayor had his hand up anyway to call on him before we go back to people who have spoken with the mayor.'",
        "'speaker_4': 'But I did want to. Councilmember Vela is a little humble after that meeting two and a half weeks ago that she she mentioned she was at she reached out and said, hey, do you want to bring a council referral on this item?'",
        "'speaker_4': 'And knowing that there had been some conversations about this, I just wanted to give my great appreciation. We reached out to Eric and the city manager and staff to ask if we could, instead of doing a council referral and delaying this for another month, could, if they could bring this as a part of what was originally going'",
        "'speaker_4': 'to be a COVID response, economic development response. And I know that there was a little bit of a last minute scramble to do that. But they heard our businesses, they heard they got the letter from Dabbagh earlier this summer.'",
        "'speaker_4': 'So I just want to get my great appreciation for that really impressive amount of work that went into this, the thoughtfulness and whatnot. I will echo the comments of Councilmember Vella. You know, these app based services are basically just shifting revenues and income from people who are doing really hard work to people who run apps.'",
        "'speaker_4': 'They're there. They're, you know, Prop 22 is on the ballot right now to make sure that they don't have to pay people and give them benefits, people who are working really hard. And so, quite honestly, while I believe they are providing some service mean we've had delivery restaurant delivery for for many, many years.'",
        "'speaker_4': 'And I'm confident that that will continue to happen. Whether or not it's through businesses that have been found guilty of wage theft, through stealing tips and everything else, through their through their services. We have heard all summer from our from our restaurants how important this is.'",
        "'speaker_4': 'I don't think that this is going to be an overly controversial thing. To me, I am less I will support the will of the majority as long as we cap cap the fees to restaurants and at least adopt the the within the staff report.'",
        "'speaker_4': 'You know, I do think at the end of the day, it's going to be the drivers who suffer if we cap their ability to charge fees for people to pick up food. And at the end of the day, if we're asking people to drive food around, you know, we should be paying for that.'",
        "'speaker_4': 'It generates a lot of traffic. The impact of these services is huge when when we're not in COVID times for the congestion and whatnot. And that would be to me, it's a trade off. But, you know, I would be willing to move forward without capping the the customer that the direct to customer fee as long as it'",
        "'speaker_4': 'is clear upfront what that fee is. So people know what they're paying. And it's not like using a credit card in a Oakland taxicab where all of a sudden you get a strange $7 add on for you and you get your bill.'",
        "'speaker_4': 'So I'm looking forward to this. I just wanted to say thank you to the staff for bringing this forward, because I know that it was a quick last minute sprint.'",
        "'speaker_2': 'Thank you both, Mayor Councilmember Odie.'",
        "'speaker_3': 'Thank you. Just a quick question and thanks to the staff, I know economic development is overwhelmed and they're working triple time to try to support our businesses. So I appreciate that. So when you go in there and you can give a tip that goes to the driver.'",
        "'speaker_3': 'Right. That's not hijacked by anybody. Right.'",
        "'speaker_0': 'That's right. There were apparently situations in the past where some of these companies were garnishing tips from drivers. I think that's a practice that most of them have stopped. But we wanted to include it in the ordinance that they couldn't, you know, just to have that in writing that they couldn't do it.'",
        "'speaker_3': 'Okay. Thank you. Well, a lot of what's happened, I would say, has been said. So I'm not going to repeat it. I would I would prefer option three where we can freeze it on the customers as well. Because I, I do think that these, these businesses will try to just cost shift.'",
        "'speaker_3': 'And I mean, in my discussions with small business owners, especially restaurants, they're concerned about this. So I'm glad that you guys were all able to put this together and not wait for referral, which was on my list to do also, but just never got done.'",
        "'speaker_3': 'So I really don't buy the fact that, you know, if we do this, they're going to get out of out of our city, even if one does or two does. I mean, the demand is there and the simple of supply and demand is that there's demand.'",
        "'speaker_3': 'Then people are going to try to find a way to meet it. And, you know, 85 was a big controversial thing. And I'm glad that we've taken some steps to give these workers some financial security and benefits. So.'",
        "'speaker_3': 'I just. I think somebody is going to step in and fill the need as long as it's unmet. So you saw where Uber and Lyft threatened over Ab5 to pull out of California, the largest state in the country.'",
        "'speaker_3': 'And then ultimately they. Fell through on those threats because they know this is a large market and they know that probably most of their profits come out of California. So I'm not I'm not I don't feel threatened by that.'",
        "'speaker_3': 'But I'd like to see number three because I don't want to see, you know, all of a sudden, you know, instead of 40% of the restaurants as 40% of the consumer. And this is only a temporary emergency ordinance.'",
        "'speaker_3': 'So I think everyone needs to behave. And if they're not behaving, then we need to create some emergency legislation to force them to behave.'",
        "'speaker_2': 'Thank you, Councilmember Odie. Councilmember Daisuke.'",
        "'speaker_3': 'Oh yeah. I think we in Alameda have a rare opportunity to be leaders in terms of setting a freeze, both for a freeze on restaurants as well as freeze on customers. So I certainly appreciate it. I certainly approve both.'",
        "'speaker_2': 'And I'll just. I'm sorry. Did you finish, Kelso? Yeah. So I'm going to chime in and say, I mean, I look at this list of other Bay Area cities and think, why don't some of these pretty aggressive cities, why don't they also cap the fees on on what's charged to customers?'",
        "'speaker_2': 'I don't know. It seems like the right thing to do. And this is what I was starting to say and didn't finish. I have read somewhere or heard on a podcast or something that there are cities where bicycle deliveries of meals from restaurants to customers have have taken shape.'"
    ],
    "Ordinance to Limit Charges by Third-Party Food Delivery Services During COVID-19 Emergency.": [
        "'speaker_2': 'And in fact, I think I've actually seen I can't remember if it's in Alameda or if I've been someplace else. I've been out of Alameda lately. But but the bicycles have, you know, either pulling a trailer or with special panniers with thermal containers and stuff.'",
        "'speaker_2': 'So the point there being if Uber eats and Lyft were to pull out of the California market, but I'm with you, Councilmember O'Day. I doubt that they will. And I mean, I think that there could be some creative alternatives that spring up in their wake.'",
        "'speaker_2': 'And so, I mean, I don't want to diminish the value of these services because for some, you know, I would always urge people when you're ordering takeout and I hope you are to take out from your local restaurants as often as you can.'",
        "'speaker_2': 'Please try to go and pick it up yourself. Walk when the weather there is nice to get some exercise. I drive if you must, but. Or take your bike. But. But there are some people, as we all know, who simply aren't able to do those things.'",
        "'speaker_2': 'And they they need to be home because they may be more vulnerable to COVID 19 for health reasons or age or what have you. So we don't want to minimize the value of these. And so, you know, to that extent, I hope and I'm confident that some services will continue to exist.'",
        "'speaker_2': 'But know I think it's time for some bold steps. These are the grand. And when you think of what we're looking at in balance, are restaurants that are just barely holding on, some of them. And if we can help put a little more revenue back into their into their coffers by minimizing the fees that are taken out'",
        "'speaker_2': 'of them by these by these delivery services, I think it's the right thing to do. So with that, Councilman Brody, you have you end up.'",
        "'speaker_3': 'Sure. I'd like to make a motion then to approve the emergency ordinance.'",
        "'speaker_2': 'That is the.'",
        "'speaker_3': 'Limit at 15% for fees charged to restaurants and freeze customer fees at the current rate per the city attorney's recommendation.'",
        "'speaker_2': 'By the way, what is that current rate for my desk? It's quirky. You have that.'",
        "'speaker_0': 'It varies based on it varies based on each of the companies and location and a number of different factors.'",
        "'speaker_2': 'Okay. But it would be frozen as of the date that this ordinance is passed or the second reading, I guess.'",
        "'speaker_3': 'Well, it's emergency, but that's I don't know if the report was published.'",
        "'speaker_2': 'Okay. Let's hear from the city attorney, then, Councilmember Vela. Are you seconding Councilmember Vela, the city attorney?'",
        "'speaker_3': 'Just to clarify, this was actually a regular ordinance that's brought before you.'",
        "'speaker_2': 'But but when the emergency is declared over, that it is okay.'",
        "'speaker_3': 'Exactly. But we're proposing the freeze occurs on the date of the publication of the staff report to Prevent Gaming, which is episode 21.'",
        "'speaker_2': 'Okay. All right. Answer my question. Thank you. Councilmember Geller, you had your hand up.'",
        "'speaker_0': 'So I do have a concern about that, capping the fee on the consumer, because I think in many ways a lot of these companies have hidden fees elsewhere. So for instance, like in San Francisco with some restaurants, if you go to their website, you scroll down and you order directly through their website, you'll get the actual menu'",
        "'speaker_0': 'cost. But then if you click on the order online tab on top, which pops up as part of the marketing and you go order through DoorDash, they charge you on every item on the menu, but they get around it because they still cap the fee.'",
        "'speaker_0': 'So I do have a question about how the capping works and if there's other ways around it. I'm just wondering if we could bifurcate this where we pass the ordinance as written tonight, but then kind of I would like a little more understanding of like how we can.'",
        "'speaker_0': 'Because it just seems like what they'll do is they're going to hide it in menu item. They're going to they could just price shift on the items. I guess that's just a question that I have for the city attorney, because we can't really regulate that.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_3': 'So a couple of thoughts, Councilman Councilmember Bhalla. One of them is that this ordinance does contain a prohibition on prices charging for a price higher than a price set at the retail establishments. And the language we would propose, and if I may read it for the council, I think will be broad enough to capture hidden fees.'",
        "'speaker_3': 'And we would propose something to the effect of it would be it shall be unlawful for a third party food delivery service to increase anything costs or commission or establish any new fee costs or commission with respect to customers beyond those established on September 30, 2020.'",
        "'speaker_3': 'And if the Council desires additional flexibility for staff, the Council could also add another provision that allows the City Manager to implement additional administrative regulations to to implement this ordinance, which would give staff additional flexibility to try to monitor gaming.'",
        "'speaker_3': 'But we are proposing fairly broad prohibitions.'",
        "'speaker_0': 'And then another question, and that is, if I know that there were some attempts, there was a couple community members who were attempting to see if they could essentially start a company or provide a service where they would do local deliveries, working with restaurants.'",
        "'speaker_0': 'If they started that before September 3rd, are they then prohibited from changing their prices if they need to adjust to account for what they're trying to do? Because they just started out.'",
        "'speaker_3': 'I think this ordinance would create that prohibition because it would essentially cap prices in place that was already charged as of September 3rd, if there aren't any. That would be a very different story. Obviously, if they if they've not started charging that, obviously that be a very different story.'",
        "'speaker_2': 'But there are currently customer fees that are in place and those would be allowed. They just can't be increased. Correct.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'Yeah. I, I think my I guess my question is, I know that we have some folks that are trying to coordinate with local businesses. I'm just wondering if there's a way. I think what they're trying to do is very different from the other third party model.'",
        "'speaker_0': 'But but the the clarification seems like is that this applies to everybody. And we can't just we can't distinguish between those words proprietor owned and versus another third party service that that's employing or actually, I guess trying to bypass employment and contracting with.'",
        "'speaker_2': 'Well, it strikes me that if our objective is to protect our restaurants that are the ones that are struggling so much and also protect our residents who, you know, some of whom have been financially impacted by this pandemic, that we would want them protected, whether it's by.'",
        "'speaker_2': 'Large delivery companies or small community run ones that maybe the smaller community run ones wouldn't have the same needs to. I charge such high percentages that it's.'",
        "'speaker_0': 'Yeah. I'm just I'm just curious because I, I and I don't know what the, the local ones are charging. I don't want to see price gouging. And I think that that's our ultimate goal and I share in that.'",
        "'speaker_0': 'But I also want to make sure that the person providing the service is actually getting paid for their work. So if we're going to have, let's say, a bike delivery service or somebody tried it out, let's say by car, but now they want to shift a bike, but the cost might be more.'",
        "'speaker_0': 'Is that going to be permissible under this or is that not going to be permissible? Like if they if they mode shift? Does that make sense or is it just going to be the set the set rate? Or if they were doing it by bike before and now they're switching to car and there's additional costs, are they'",
        "'speaker_0': 'allowed to factor that in?'",
        "'speaker_2': 'Sounds like there's a cap on fees that city attorney or members. How do you see this?'",
        "'speaker_3': 'It's.'",
        "'speaker_2': 'Also, if I'm all right, I guess we'll go ahead and I'll I'll come back to my comment.'",
        "'speaker_3': 'And Councilmember, I'll point out one additional exception that we have put into the ordinance to guard against an unconstitutional takings, which is that any company, whether out of town or in town, has the ability to demonstrate proof that the limitations established constitute a concept, an unconstitutional takings, which is that we're essentially depriving them of the ability to'",
        "'speaker_3': 'establish a fair return, much like in the control context. And so any company who is able to demonstrate that proof is able to seek an exception from the city. So there should not be any companies that are not able to make the Constitution constitutionally reasonable return under the ordinance.'",
        "'speaker_2': 'Councilmember Odie.'",
        "'speaker_3': 'I mean it mode shifting is a concern. You know we couldn't allow a higher fee for those that practice mode shifting in Alameda. I don't know. Maybe that's another way to incentivize it. Well, if you deliver by bike, then you can go to 18%.'",
        "'speaker_3': 'Just an idea.'",
        "'speaker_2': 'So I go back to the, um, the second sentence in second paragraph in the executive summary of this item, which is in order to ensure food security and to safeguard the welfare of restaurant employees and customers who rely greatly on restaurant industry, on the restaurant industry.'",
        "'speaker_2': 'During this pandemic, SAP is recommending that third party delivery service fees for restaurants be limited to 15% of purchase price until the local state of emergency ends or indoor dining resumes at 100% capacity, whichever comes later. We're not doing 100% capacity for while.'",
        "'speaker_2': 'I think what I would suggest is that perhaps the best course of action, because I think the need is immediate for established restaurants is to move forward with this. Now, we can always come back and modify if we find that, oh, these new delivery services are springing up and they're they're running into difficulties.'",
        "'speaker_2': 'But then we could actually have some documented cases rather than speculation. My thought. Councilmember Gilet your answer?'",
        "'speaker_0': 'Yeah, I just the reason that I'm raising these questions is, for instance, 15% of $15 is $2.25. And so if I have a $15 order from from side Street and I need to pick it up and bring it somewhere, the drivers driving over there, picking it up and then leaving.'",
        "'speaker_0': 'I just think there's also just a general concern in making sure and I do think that there's an inherent value in trying to find some sort of local, local run delivery. I just don't want to kind of throw that out with taking on these bigger companies that are price gouging and doing it to help their their shareholder'",
        "'speaker_0': 'costs and prices rather than the actual worker. So I do want to recognize the work in in doing the pickup and the delivery. And anyways, I'll support this either way tonight. I just want to be I would like us to keep track of that and to look at that.'",
        "'speaker_0': 'And if it does become a problem for it to come back to us, because I also think that this is a necessary service right now, especially with the air quality and the pandemic. And so I don't want to be in a situation where we we cut ourselves off.'",
        "'speaker_2': 'Yeah, I don't disagree with anything you said, but I just feel that we could make a stronger ordinance when it's based on some actual documentation which may indeed be coming in. Councilmember somebody. I think I think that's right.'",
        "'speaker_3': 'I mean, I I'm sympathetic to that as well. But I agree with the mayor's comment that we could look at it again. But, you know, I've been to the Lyft headquarters, and I've just got to imagine that the overhead on, you know, four or five people in Alameda starting something up versus a company that has a huge'",
        "'speaker_3': 'building in San Francisco with hundreds of employees doing a bunch of admin and not delivering. I think it's got to be a lot less. And I think that their profit model would be different than than the larger companies.'",
        "'speaker_3': 'But, you know, if it's a problem, I'm happy to relook at it. So.'",
        "'speaker_2': 'Okay. Anything further to remind me? Do we have a motion? Councilor. Rudy, you made one of your about to. You made.'",
        "'speaker_3': 'I did earlier.'",
        "'speaker_2': 'Thank you. Was it seconded?'",
        "'speaker_3': 'Not yet, I don't think.'",
        "'speaker_2': 'Okay. Yeah.'",
        "'speaker_0': 'I'll second I'll second to the motion provided that we are keeping track and that we monitor this and have it come back.'",
        "'speaker_2': 'With that direction. Yes. Okay.'",
        "'speaker_3': 'For me.'",
        "'speaker_2': 'All right. Any further discussion?'",
        "'speaker_0': 'I just want to add, I just really quickly want to add I'm sorry that these these big third party delivery companies are not hurting for money they've spent. They are spending $180 million trying to get out of paying their workers and paying their benefits.'",
        "'speaker_0': 'And I think that this is a strong statement that we can make that that's just not okay. And that in Alameda, you don't price gouge and that you treat your workers with respect. So thank you all.'",
        "'speaker_2': 'Thank you. All right. We've had emotion. We've had a segue and we've had great discussion. Thank you, everyone, for that. Madam, quickly, we have a roll call vote, please.'",
        "'speaker_1': 'Councilmember de SAG.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Rudy.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Fella. Hi, Mayor. As the Ashcraft.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'That cares. Bye bye.'",
        "'speaker_2': 'All right, good work, everyone. Thank you, Staff. Thank you for all your hard work putting this report together. Thank you. Thank you, city attorney. All right, with that, we move on to item six e more Roman numerals.'",
        "'speaker_1': 'I got this one introduction of ordinance amending the municipal code by amending various provisions of Article eight Sunshine Ordinance of Chapter two Administration concerning special meetings, including the setting and noticing of such another meeting.'"
    ],
    "Ordinance Amendment on Special Meetings under Sunshine Ordinance.": [
        "'speaker_2': 'All right. So this is coming to us. My iPad always freezes once in a meeting. So. Somebody went to jail for better mayor.'",
        "'speaker_3': 'I believe Assistant City Attorney John Lay is going to give the staff presentation tonight.'",
        "'speaker_2': 'There's been a survey. There's a staff report flashing by.'",
        "'speaker_3': 'Okay. Good evening, Madam Mayor. Can you hear.'",
        "'speaker_2': 'Me? Yes. Wait. Councilman, a point of order. Yes, sir.'",
        "'speaker_3': 'Do we want to do our 1030 business before we go in?'",
        "'speaker_2': 'Reporter It's.'",
        "'speaker_1': '11. You have to tell 11.'",
        "'speaker_3': 'We have 11. Okay, never mind.'",
        "'speaker_2': 'We're going to be on our way home by 11.'",
        "'speaker_4': 'And the mayor. Jinks, you.'",
        "'speaker_1': 'Still have a No. One. You still have a 7 to 1 meeting.'",
        "'speaker_2': 'Going away.'",
        "'speaker_0': 'To a.'",
        "'speaker_2': 'Yes, we do. Okay, let's go.'",
        "'speaker_3': 'All right. So what we have this evening is an ordinance for introduction, amending the Sunshine Ordinance relating to special meetings. You might recall this actually started with a referral to the Open Government Commission. We went down and we got some recommendations from that and prepared an ordinance and the key features to the ordinance are an increase in'",
        "'speaker_3': 'the noticing from seven days to 12 days for all special meetings, for all boards and commissions, including the Council. It would preserve the seven day notice period for a closed session and city sponsored meetings and events. There's a carve out for emergency meetings or urgent meetings as defined in state law.'",
        "'speaker_3': 'There's also a provision trying to enhance the sort of outreach in addition to what we currently have in terms of publishing the agenda on the website. I'm talking about social media and other means. And finally, there's a minor amendment to the email list notification provision in the Sunshine Ordinance to specify that there would be notification to folks'",
        "'speaker_3': 'on the list of the meetings, special meetings, as well as agendas for both the boards and commissions and all of that of the council. And with that, I conclude my presentation and even I are available for questions.'",
        "'speaker_2': 'Thank you, Mr. Ley. And do we have public speakers on this, Madam Clerk?'",
        "'speaker_1': 'We have no speakers.'",
        "'speaker_2': 'Okay. Any clarifying questions or any discussion? Councilmember Gullah, and they'd like to move approval. Councilmember. Vice mayor.'",
        "'speaker_4': 'Wait a second. The motion.'",
        "'speaker_2': 'Okay. Discussion.'",
        "'speaker_3': 'Councilor Verity I was going to ask the Chair if the maker of the referral approved of these changes, but since she made the motion, I won't ask.'",
        "'speaker_2': 'Those that you were. Did you work with the city attorney's office on this?'",
        "'speaker_0': 'I didn't work with them on this, but I read through and I know that they I saw the comments from the Open Government Commission and I know that they took those into account as well as our conversation. So I'm happy with the work product.'",
        "'speaker_2': 'All right. Any further discussion council? Vice mayor.'",
        "'speaker_4': 'I'll simply say I listened to I think there were two open government commission meetings on this issue and I greatly appreciate the work and thought that went into this. They really did try to meet the goal of the referral while also making trying to find ways to make sure the city had the flexibility to address issues that'",
        "'speaker_4': 'came up. And I think between the recommendation and the city attorney's office, we've come up with a really good solution.'",
        "'speaker_2': 'All right. Thank you. Okay, we're all covered. Please.'",
        "'speaker_1': 'Let's remember Jason. Yes, not quite.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Odie I.'",
        "'speaker_1': 'Bella I. Mayor, as the Ashcraft.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Carries by five eyes.'",
        "'speaker_2': 'Thank you. All right, so then we move on to item seven. City Manager Communication.'"
    ],
    "Mayor's Nominations for Appointments to Various Boards and Commissions.": [
        "'speaker_2': 'Effort. So if there's nothing further from the Council and councilmember member, you address the general landscape. So thank you for that. So let's move on to item and ten B because it's always exciting to introduce some more nominations to you.'",
        "'speaker_2': 'I have been busy with staff doing lots of interviews, like I told you earlier, many excellent candidates for these boards and commissions. And what I always try to do is strive for diversity across a lot of different metrics and geographic age variance, racial, gender, ethnicity, ethnicity, just and wow, what great choices we have to make.'",
        "'speaker_2': 'And so it's a combination of reappointing incumbents or sometimes not, or maybe an incumbent and a newbie if there's more than one opportunity. So starting with the golf commission, there was one opening and I'm appointing nominating a gentleman named Ben Think and Binder who comes to us from well, gosh, he worked on the Obama campaign back in'",
        "'speaker_2': '2008, then went to work in the Obama White House for the next eight years. And now he's working in the private sector and out in the Bay Area. But what's exciting about him, besides that, he played golf in college and was a caddy in the LPGA, which I thought was important.'",
        "'speaker_2': 'It was impressive. But he also has been involved in a program called First Tee that's cheap and it's a way to bring affordable junior golf programs to communities that don't have them, especially in economically disadvantaged areas. And he mentioned that, you know, he'd really like to help start up a program like that.'",
        "'speaker_2': 'Here we have this beautiful course, and he just loved to bring more kids, especially those who might not otherwise have the opportunity. And he could wax poetic about all those skills and leadership and and other attributes that we need to play golf has for you.'",
        "'speaker_2': 'And so that's the golf commission. And then on the Housing Authority Board of Commissioners, there were five openings that first, you know, incumbents would serve another term and also some openings. So I have appointed these five and Bashir headed is the incumbent and he's also a tenant, which is one of the there's certain slots on this board'",
        "'speaker_2': '. He's originally from Algeria. He's then he is was a professor in neurobiology and teaches now. And Elizabeth Cowart is she's she's a newbie but wow, very impressive background. She works for an affordable housing developer. She has her undergraduate degree in architecture from Yale and she has her master's degree in planning from M.I.T..'",
        "'speaker_2': 'And one of my favorite planning commissioners, different board planning commissioners is and Cook, who I served with years ago. And she also had her degree from M.I.T. But I was excited to meet and interview Miss Carter. Sandra Kay is an incumbent.'",
        "'speaker_2': 'She's also a resident, a senior. She has work before she retired in affordable housing. She also lived in both Hong Kong and Australia. Her husband was a professor teaching those places, but she's very energetic and just loving what she's doing and wants to continue.'",
        "'speaker_2': 'Kenji Tamaki is another incumbent and he is just he's also involved in housing, affordable housing development. I'm going to go blank on specifically what he's he's been involved in the community with scouts and just very invested in housing and the inclusivity of it.'",
        "'speaker_2': 'He is a Canadian. Originally, his parents were Japanese immigrants to Canada and he is now a US resident and just enjoying giving back to his community. And the last of the five is per diem. Sit down, the cop and that name will sound familiar to some of you because when we still had the RAC, the the rent'",
        "'speaker_2': 'advisory board, he was one of our last appointments before the RAC was discontinued. And he is a native of Ukraine. He's an attorney. He's worked in a number of communities, including East Palo Alto City Attorney's Office and Oakland City Attorney's Office.'",
        "'speaker_2': 'But he recently moved to the city of Hayward, the city attorney's office, where he's working on housing. Programs that he's working with, among others. Jennifer, I knew some of you will remember from when she worked here, he didn't realize she'd worked here.'",
        "'speaker_2': 'So those are those are my five. And then finally, for the planning board, two openings. And I am reappointing the incumbent, Ron Curtis, who has has the development background from years ago. He's retired for a number of years and then a newbie.'",
        "'speaker_2': 'Her name is Damaris Cisneros, and she also has a very extensive background. She's worked in affordable housing development. She's worked in market rate development. She's worked for the Bay Area Council and councilmember. I believe she has her master's degree from Mills College, which would interest you.'",
        "'speaker_2': 'And I think she's an undergrad from UCLA, by the way. Mr. Desai But anyway, those are my two. Planning Board nominees, and I've got three more commissions to do. We will have wrap it up next week. Next, when we meet in October, I'll have a Civil Service Commission Commission on Persons with Disabilities and Schwab Social Service Human'",
        "'speaker_2': 'Relations Boards. I am going to interview till the cows come home. Okay. With that, we have to keep moving along. Oh, so. Okay, help me out. Madam Quirk, we're going to adjourn this meeting. Yes. Okay. So with that, we are adjourning the city council meeting that started at 7:00 and we are convening a special city council meeting'",
        "'speaker_2': 'at 701. May we have the roll call, please?'",
        "'speaker_1': 'Roll call has been noted. Five present.'",
        "'speaker_2': 'Thank you. And we have a single agenda item, which is to say, Madam Clerk.'"
    ],
    "Contract and Amendment for Economic Recovery and Day Center Services. ": [
        "'speaker_1': 'Recommendation to authorize the city manager to negotiate and execute a $1,000 contract with block by block to help in the economic recovery efforts for COVID from COVID 19 in Alameda Business Improvement Areas and negotiate and execute an amendment to the agreement with Creative Build INC to add $103,978 to provide extended hours of operation for the day center'",
        "'speaker_1': 'and related support services.'",
        "'speaker_2': 'Thank you. And oh, we've got a stellar team here. So you've met Debbie Porter, head of community development, Lois Butler, head of Economic Development. And Anna, back just here, we would be lost without in all our social service programs.'",
        "'speaker_2': 'So who is presenting this one to us society?'",
        "'speaker_0': 'So with that lead off, I am going to ask Anna to do a brief presentation. And then once again, Lois, Anna and I are available to answer any questions.'",
        "'speaker_2': 'Perfect. Thanks. You. Justin Bute. They tell me that all the time. It's too muted on the. Great. Perfect.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'Good evening, Madam Mayor, and members of the City Council. My name is Anna. Back to the Community Development Department. And first off, I want to thank you for your continued support of our unhoused residents, especially during this challenging times with the pandemic and then the fires and the winter is coming.'",
        "'speaker_0': 'And also, I want to thank you for your consideration to implement block by block in Alameda and to expand the Bay Center and safe parking programs. Both of these proposals totaling $203,000. We understand from your last meeting that you have some questions about the scope of the block by block program, and we're especially concerned about the coverage'",
        "'speaker_0': 'on evening peak hours after hours on weekends. You also wanted to ensure that block by block ambassadors have resources available to them to refer clients during these hours and on weekends. As we know, a lot of our service providers serving our homeless population do not work on weekends.'",
        "'speaker_0': 'So that's always a challenge. So bring in block by block will keep our downtowns clean, safe and welcoming, especially during this time of heightened public health concern. Because of the pandemic and expanding the day service center hours as well as the safe parking are especially critical during this time so that our house neighbors have a clean, safe'",
        "'speaker_0': 'and welcoming place to go as well. The proposal submitted by block by block includes coverage in early afternoons, evenings to 10 p.m. and also on weekends. In addition, the funding for the day center and safe parking the amount of $130,000 will also allow the village of LA, which operates the day center and Safe Parking Program, to extend'",
        "'speaker_0': 'its center hours to 8 p.m. and also at weekends. The safe parking will also be open with this funding from from 7 p.m. to 7 a.m. seven days a week, and that would also include weekends. There will be a flexible account that will be available to pay for emergency motel stays, car repairs to keep vehicles operable, and'",
        "'speaker_0': 'other items that are ancillary to making sure that our unhoused neighbors are safe during the pandemic. And Village of LA will also be able to add additional staff to do more outreach. They will hire a driver that can pick up and provide rides on demand, which they currently do not have the capacity to do under their current'",
        "'speaker_0': 'contract. We hope that the information that we provided with you are helpful and answer some of your questions and concerns that came up at the last meeting, and we're here to address any of your additional questions. Thank you again for your support.'",
        "'speaker_2': 'Thank you. Ms.. Factors. And I will just add that inspectors has been present at a couple of meetings that the city manager and I have had recently with concerns arising from um, just difficulties with the intersection of and has two individuals with a preschool in the area of constitution way and some of our local businesses.'",
        "'speaker_2': 'So sorry I did that. So thank you very much for bringing this forward to us. Council Do we have do you have any questions or concerns you want to raise? While you're thinking of them. And again, I. I think you touched on this.'",
        "'speaker_2': 'This fact is and we've talked about this before that. Outreach is really important. It's not enough for staff to I mean, obviously, someone has to staff the data center. That's a very important function. But we do need to have people go out to where the and housed individuals are.'",
        "'speaker_2': 'And the groups that are working with these these organizations are very adept at the very complicated work of establishing rapport, establishing trust and relationships, because you will remember that this is it's got to be voluntary. We don't have a means of just removing people, although I will say that I have submitted my question to our supervisor, Wilma'",
        "'speaker_2': 'Chan's office as to whether with any properties that Project Roomkey acquires in Alameda motels, hotels, that if it would be possible to set aside a certain number of rooms to be available for Alameda unsheltered individuals. So I am told that they will get back to us with an answer.'",
        "'speaker_2': 'And then the other thing that I said before that I think is really important is it is vital that we have these hotels like the marina village in and others extended stay that are being used to get people out, some living in the bushes.'",
        "'speaker_2': 'I mean, you just think about with this air quality, they kept all of us in our houses, closing our rear windows over the last couple of weeks. Well, what if you didn't even have a window to close because you lived outdoors?'",
        "'speaker_2': 'But these sites still have to be supervised and make sure that the.'",
        "'speaker_0': 'Rules.'",
        "'speaker_2': 'In place are are being followed so that residents.'",
        "'speaker_0': 'In the area are.'",
        "'speaker_2': 'Not impacted. I think there's room for everybody that we just need to respect everyone too. So I think this is great and I really applaud staff and and city manager for bringing this back to us. So council. Are we ready to approve?'",
        "'speaker_2': 'Questions. Councilmember de Daisuke I just.'",
        "'speaker_3': 'Just a quick comment. I had not I did not support safe parking for the reasons that I said. I thought we ought to focus our money elsewhere. But and I still feel that way. I'm not supportive of I actually don't think it's safe to have people sleeping in their cars in the cold Alameda.'",
        "'speaker_3': 'And that if we're going to have limited money, we should focus on putting people into shelters. But I think what we're discussing here tonight is not just that, but also funding outreach programs that clearly our businesses have have expressed a need for.'",
        "'speaker_3': 'So I'll be supportive of this.'",
        "'speaker_2': 'Thank you. Thank you. And by the way, the city manager the city clerk just graciously reminded me that we don't have any public speakers to thank you, because I forgot to ask of Councilmember Vela.'",
        "'speaker_0': 'Just wanted to thank staff for their work on this. I know we gave a lot of direction and feedback at the last meeting, specifically around extending the day center hours into the evening and the weekends. I'm glad we were able to get that worked out and with that I want to move approval here.'",
        "'speaker_2': 'We've had a motion by Councilor Vela, second by Councilmember Odie. Any further discussion? Seeing that maybe we have a roll call vote.'",
        "'speaker_1': 'Please remember de. All right. Not quite. Hi, Odie.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Bella. Hi. Mayor. As the Ashcraft I. That carries my five eyes.'",
        "'speaker_2': 'Thank you. That was an appropriate interview. That's another way we will help our business community and our shelter residents. And I will just add that it is no one's choice to have people sleeping in their cars. But. It is also a better choice.'",
        "'speaker_2': 'While we're finding other places for people to live because there is truly an imbalance of supply and demand for places to live, it's better to be in some place that has supervision overnight. And I know from talking to the women who stay overnight at the warming shelter in the winter months when it's open, that they're very fearful'",
        "'speaker_2': 'of things like sexual assault, when they just have their car parked on a street, that if they had unsafe parking where they.'",
        "'speaker_0': 'Knew there was.'",
        "'speaker_2': 'Supervision, that would go a long way to preventing the sexual assaults that if sometimes happens. And just.'",
        "'speaker_0': 'Letting people.'",
        "'speaker_2': 'Relax, get to sleep because they don't have to think. But I hope that we've got, you know, big issues to solve. And this is a step forward. And I thank you all for your time. Thank you so much, staff for your hard work, bringing this to it.'",
        "'speaker_2': 'Right. With that, I am going to adjourn this meeting. It's 1058, everybody. So we we definitely met our mandate of ending on the same day that we started. Thank you all. You covered a lot of a lot of territory.'",
        "'speaker_2': 'Good work, everybody. Enjoy the rest of your evening. Go read that good, clean air. Good night.'",
        "'speaker_4': 'It's at 20.'",
        "'speaker_2': 'Wow.'"
    ]
}