{
    "Proposed Ordinance on Cannabis Businesses and Smoking Regulations.": [
        "'speaker_1': 'Thank you. However, it's standing that we can give direction on and we are will be asked. And that was in the staff report on different parts. We will be giving directions out that evening.'",
        "'speaker_0': 'Right throughout the workshop.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you, Mayor. So further verification. I do that. And this isn't even a first reading of an ordinance, correct.'",
        "'speaker_2': 'Now? Correct. Thank you.'",
        "'speaker_5': 'I'm actually thank you for the introduction, Jill. And I'm going to in my opening comments, I'm probably going to repeat some of the information that's already been said, but it probably bears worth repeating at this point. So good evening.'",
        "'speaker_5': 'I'm Debbie Potter. I'm the city's community development director. And in response to two city council approved referrals regarding direction to staff to analyze upcoming regulations, updating our regulations and potential taxation of commercial cannabis activities. Staff has put together a City Council workshop on draft on a draft cannabis ordinance containing a proposed regulatory framework for cannabis activities in'",
        "'speaker_5': 'Alameda for council discussion and direction. No action is being requested this evening. Staff has prepared a series of questions related to permitting and regulating cannabis businesses in Alameda as part of the state's upcoming legalization of recreational or adult use of cannabis.'",
        "'speaker_5': 'On January 2nd, 2018, for which we are seeking council direction. And just to repeat what Jill said as part of her introduction, while I'm kicking off the staff presentation and will also conclude the presentation, there are a number of staff here this evening that have been working on this issue and are prepared to answer council questions.'",
        "'speaker_5': 'The staff team includes Paul, Hillary, the Police Chief, John Lay and Assistant City Attorney Andrew Thomas, Assistant Community Development Director, and Lois Butler, economic development manager. In addition, staff retained a consultant SDI Consulting Group to assist us in our work on this issue.'",
        "'speaker_5': 'And Neil Hall from MCI is also here this evening. Because this is a work session and there is a lot of interest in the community about the cannabis industry. We wanted to begin with a high level overview of the evolving cannabis landscape.'",
        "'speaker_5': 'NCI has a PowerPoint presentation that it calls cannabis one on one, and we thought it would provide background and insight and help inform the discussion. So we're going to start with that presentation. After that, I will present the policy questions for which staff is seeking feedback.'",
        "'speaker_5': 'It is then recommended that the City Council take public comment followed by its discussion, and we are requesting that questions arising from the PowerPoint be held until the conclusion of Neill's presentation. And then with that, I would like to introduce Neil Hall from Sky.'",
        "'speaker_5': 'Neil.'",
        "'speaker_1': 'Before you get there, how much time are you estimating for the presentation?'",
        "'speaker_5': '20 minutes for the PowerPoint presentation. Thank you.'",
        "'speaker_6': 'Thank you very much. Good evening, Mayor. Council members, staff and the general public. My name is Neil Hall. I'm with a company called SDI Consulting Group. MCI is primarily a public finance agency. About three years ago, clients started asking about the potential for cannabis, and they hired me at that time to do a little more research and'",
        "'speaker_6': 'look into what cities and counties were going to be facing with cannabis and what the opportunities might be for cities and counties. This is a very basic presentation. I know this may be repetitive. A lot of you may be familiar with some of this, but wherever I go, I find that there's generally about 50% of the people'",
        "'speaker_6': 'that aren't familiar with some of what I'm going to present this evening. So hopefully this will provide that background. Back in 1937, up until 1937, cannabis was legal between 1920 and 1933. We had prohibition here in the United States.'",
        "'speaker_6': 'When prohibition ended in 1933. Harry Anslinger, who is the assistant commissioner of alcohol prohibition, was made the commissioner for the Bureau of Narcotics Prohibition. And at that time, Harry was looking around at what he could do. He noticed that there were a lot at that in 1910 was the Mexican Revolution, and there was a backlash against that'",
        "'speaker_6': 'migration of Mexican immigrants fleeing from the revolution that was happening down there. And they brought with them marijuana. And Harry looked at that and decided that this was something that might be an opportunity for him to kind of grow his organization and enacted the Marijuana Tax Act of 1937.'",
        "'speaker_6': 'Marijuana spelled with an H up there. That is the spelling that was used back in 1937 and and not a misspelling. I get that question a lot after this. And that was followed by the federal government in 1951, in 1956, enhancing the penalties for violating the Marijuana Stamp Tax Act of 1937.'",
        "'speaker_6': 'In 1969, Timothy Leary came across the border in Texas. They found some roaches and some seeds in his automobile. He was promptly arrested for violation of the Stamp Tax Act. He pleaded the Fifth Amendment that required him to self incriminate himself by paying that tax.'",
        "'speaker_6': 'The U.S. Supreme Court agreed with him and the charges were dropped. However, immediately afterwards, Congress enacted the Controlled Substances Act of 1970, and marijuana was put into a Schedule one classification. And that's kind of where we are today with marijuana as a CSA, Schedule one class.'",
        "'speaker_6': 'The game changer really came in 2013 when Deputy Attorney James Cole, Deputy United States Attorney James Cole released a memo with eight criteria that if states with robust medical marijuana regulations implemented would help them avoid the federal government stepping in to take control of that.'",
        "'speaker_6': 'The Rohrabacher Farm Amendment then in 2014, these are two U.S. congresspeople, both from California, Sam FA and Dana Rohrabacher out of Orange County and Monterey County, enacted legislation that prevented and defunded the DOJ and the DEA for going after states with robust medical marijuana regulations.'",
        "'speaker_6': 'And then the Ninth Circuit Court of Appeals in San Francisco affirmed Rohrabacher far in 2016. Marijuana is medical marijuana is currently legal in 29 states. Non-medical and we call it non medicinal. Now as a result of SB 94 is currently legal in eight states and the District of Columbia of all places.'",
        "'speaker_6': 'District of Columbia. You can't sell it, but you can possess it and use it non medically. Non medicinally. Here in California. Marijuana has been legal medicinally since 1996 when Prop 215 was enacted. Prop 215 was the kind of the impetus was Dennis Peron, whose partner had AIDS.'",
        "'speaker_6': 'He went to the state legislature and asked them to allow the use of medicinal marijuana for people that had wasting types of diseases. They refused. And Proposition 215 was then enacted as an initiative of the people. As is the case with a lot of initiatives put forth by the general population.'",
        "'speaker_6': 'It didn't have a lot of regulations attached to it. And we had some further clarification with SB 420 and 23 finance or a budget in 2004 and then finally in 2015, the MRSA or the Medical Marijuana Regulation and Safety Act was passed.'",
        "'speaker_6': 'That was the joining of three bills. AB 243, AB 266 and SB 643 to regulate medicinal marijuana. Almost as soon as that happened, we had Proposition 64 on the ballot. I did attend a lot of the blue ribbon commission hearings.'",
        "'speaker_6': 'Lieutenant Governor Gavin Newsom spearheaded that and SB or Proposition 64 dovetails very nicely with the MRC. In fact, I spoke with the judge that wrote the opinion about it and asked if it wasn't kind of coincidental that and he said, Yeah, you could draw that conclusion, which led me to believe that I could draw that conclusion in'",
        "'speaker_6': '2017. Then we had the code joining of medicinal and non medicinal marijuana with SB 94. It's pronounced by a lot of people as Mark. It's easier just for me to say SB 94, but know that that's what I'm talking about.'",
        "'speaker_6': 'And what that does is it integrates medicinal and non medicinal marijuana regulations. We are still waiting for some clarification on that. When the MSI, RSA, SB 837, which further clarified the MRSA was passed and Proposition 64 passed, there were some additional regulations released by those three state entities that had responsibilities to the Department of Public Health, the'",
        "'speaker_6': 'California Department of Food and Agriculture and the Bureau of Cannabis Control each released further draft regulations to clarify what was in there when SB 94 was then enacted. They had to back away from that. We expect a redraft of those regulations to be released sometime in the fall.'",
        "'speaker_6': 'I'm hearing November, I'm hoping earlier. So SB 94 created the Bureau of Cannabis Control. It allowed vertical integration, which was not allowed in in a lot of things under the CRC. Testing is the only type of license that cannot be vertically integrated.'",
        "'speaker_6': 'It is also the only license that does not need to have a recreational or a or a non recreational medicinal type of license. It holds a single license but operates in both arenas. It eliminated transportation license. It allows for special permits for certain county fairs and agricultural events for the sale and onsite consumption of cannabis as well'",
        "'speaker_6': 'as at retail locations. Provided that the localities allow it as well, it provides a secure exemption for the ordinances that are drafted for regulating commercial cannabis until 2019. We consider these to be the big three of the cannabis industry that is retail and delivery, cultivation and manufacturing.'",
        "'speaker_6': 'And in fact, in Santa Rosa, we see that when they drafted their regulations, they drafted the other two testing and distribution as kind of ancillary activities associated with those those primary activities. Again, that's retail sales, manufacturing and cultivation.'",
        "'speaker_6': 'We're talking about ingestion methods. I'm a child of the seventies. Back in my day when somebody consumed marijuana, it was done with a joint. We could smell it. It was very strong. These days, that's not necessarily what's happening.'",
        "'speaker_6': 'We see vaping, which is the product, oftentimes a clear concentrate up to something over 392 degrees Fahrenheit and under the combustion range. So that what you end up with is a very almost in detectable odor from cannabis. There are probably people vaping around you all the time and you probably aren't even aware of it.'",
        "'speaker_6': 'If you look down below, that is a sample of a butane honey oil or a BHO that is produced by concentrating cannabis product. We also see tinctures and ingestible oils now and edibles and drinks. The whole industry is evolving very quickly and we believe will continue to do so at probably a geometric as opposed to a mathematical'",
        "'speaker_6': 'pace. We see topicals, which don't contain a lot of the psychoactive properties that work on a variety of different ailments. It's being used to treat arthritis and different types of muscular types of pains. This is what a retail dispensary looks like for how many people have been to a retail dispensary.'",
        "'speaker_6': 'Okay. In the.'",
        "'speaker_4': 'Room? Yeah.'",
        "'speaker_6': 'So we see a lot of people have been to dispensaries. Harborside is one of the better known ones. One of the bigger ones in the state, if not the United States. When you pull into the parking lot there, you're greeted by people in jackets.'",
        "'speaker_6': 'Very distinctive security people to make sure that you are, in fact, a patient even before you get inside. They direct you, and when you get inside, this is what it looks like. It's more of a bank type of store type of setup.'",
        "'speaker_6': 'Very nicely run. Very well run. I thought it was one of the better dispensaries I saw. And I've been to dispensaries not only in California, but Oregon, Washington and Canada as well. Cultivation. This is not what you see typically as a cultivation site today.'",
        "'speaker_6': 'Today, a lot of the cultivation sites are much more refined than this. However, this is typical of a cultivation site where you see the canopy is not quite to the flowering stage. It's just beginning. You're not seeing the colors that you would typically see, and we'll see probably in some of the other slides.'",
        "'speaker_6': 'But this is what happens in the cultivation site. It's grown and harvested in containers. This is a much more mature cultivation site, as you can see what they call the colas, that is the flower on top are quite big.'",
        "'speaker_6': 'In some of these outdoor grows, we're seeing upwards of 10 per plant now in in harvested bud. I know for a lot of people in the audience, they're shaking their heads and thinking, how could it be? But but truly, there are plants that are that size up in in the Emerald Triangle in particular.'",
        "'speaker_6': 'This is an indoor grow. And she is actually holding one of the sugar leaves. Those are the leaves that grow around the bud. They do contain a lot of THC. THC, they are normally harvested and used in the extraction process.'",
        "'speaker_6': 'In many cases, those buds will be. But those buds from an indoor grow now are worth between 1800 and up to 20 $200 a pound. This is a manufacturing facility. And as I tell people, we do, the manufacturing inspections in Congo were slated to begin up in the city of Shasta Lake.'",
        "'speaker_6': 'And and would like we'll be viewing those. They're not nearly this size. My guess is that there's a lot of this facility that's being utilized either for cultivation or for other activities. Most of the manufacturing processes could take place in a room that is extends no farther than for me to the wall in front of me.'",
        "'speaker_6': 'As you'll see from the equipment, it does not take up a lot of space. This is the equipment that's used in a lot of the extraction processes and there are various parts of the extraction process. It is not from beginning to end necessarily.'",
        "'speaker_6': 'The one that we're looking at in Kalinga, they're taking an extracted material that they call crude. It's kind of a dark, black, green substance, and they're refining it, spinning off the turbines and the THC into separate components and then putting them back together to produce a product that the that the retail outlets want to sell.'",
        "'speaker_6': 'But this is what it looks like. And those pieces of equipment are very highly regulated. They have to be engineered, certified, maintained. We have a material safety data sheet that we look at every time we go into those facilities.'",
        "'speaker_6': 'This is another look at a cannabis plant. Again, the sugar leaves on the top. A lot of the work that's done at harvest is trimming off those leaves so that you're left with that bud. We've developed what we call a 5 to 6 matrix, and all it means is that it's easy for everybody to remember.'",
        "'speaker_6': 'There are five categories of license types that I went through earlier. We have two client types, medical and non-medical or medicinal, non medicinal. And there are six key elements of cannabis implementation that we'll look at in just a moment.'",
        "'speaker_6': 'So these are the five categories with a responsible agency. So the Bureau of Cannabis Control now is responsible for retail microbreweries or micro businesses as well. Manufacturing is under the Department of Public Health Cultivation, under the Department of Food and Agricultural and then distribution and testing or back under the Bureau of Cannabis Control.'",
        "'speaker_6': 'These are a further definition of the state license types. And for those of you who aren't familiar with the license types, there are currently 12. We're missing a type nine license type. Five is not clearly defined yet. In 2023, type five licenses are envisioned to be large cultivation over an acre, outdoor and over 22,000 square feet of'",
        "'speaker_6': 'canopy indoors. Type nine license type is missing. We believe that will be the the nonprofit license type if, in fact, the state is going to approve those types of licenses. But as you look through the numbers, you'll notice that type nine is still missing.'",
        "'speaker_6': 'These are more about the cultivation sizes. A type four is a nursery license. So they're only harvesting or they're only cultivating immature plants and clones to be used later on for for cultivators that are actually going to harvest the final plant product.'",
        "'speaker_6': 'Type six and seven are your manufacturing licenses and we I see the type and and are still up there those were further defined when those draft regulations came out. They are not there now. We expect that they will be released.'",
        "'speaker_6': 'But for now you have a six and a seven type license. It is a testing laboratory, ten is a retailer, 11 is your distributor, and 12 now is the micro-business. Two client types that I talked about, medicinal and then non-medical.'",
        "'speaker_6': 'So we don't know of anybody who is strictly non medicinal at this point in time. These are the six key elements of cannabis implementation. The first is community research and outreach. And I know that Alameda has done a lot of this.'",
        "'speaker_6': 'There were a lot of municipalities that had not done that. This is a critical component and one that's often overlooked. So, you know, as a consultant, I applaud you for taking that step. Health and safety and land use regulations are the next step.'",
        "'speaker_6': 'You draft an ordinance to regulate. There are two components to that. One is the land use component and one is the health and safety component. You have your application process, which we didn't realize would be kind of a a step into itself.'",
        "'speaker_6': 'And we are working with several counties and cities now doing nothing but helping them with the application process because it is fairly rigorous, the regulatory fees that follow that are for full cost recovery. We do believe that the if tax revenue, a tax measure must be balloted, but that a tax measure, it should benefit the community as'",
        "'speaker_6': 'a whole. So the cost of regulating the industry needs to come from the industry itself. Those fees need to be paid for so that you preserve that tax revenue for the general population. The next step is a ballot and tax measure.'",
        "'speaker_6': 'All tax measures, as we know, are balloted. We'll get into just a little more detail about that with getting to without getting too far into it. And then finally monitoring compliance. We're doing a lot of the monitoring compliance right now.'",
        "'speaker_6': 'The state has said they'll do it. They probably will at some point in time. But we expect they're going to be inundated with applications. There is no opportunity for them to do the monitoring, compliance with their current structure.'",
        "'speaker_6': 'And so we're doing a lot of it ourselves. Community research and outreach we just talked about. I will kind of skip over that. But when we do this, we typically involve a lot of the stakeholders. So we involve the Chamber of Commerce, we involve people from the church and from the educational community, as well as industry participants'",
        "'speaker_6': ', a lot of law enforcement. We want everybody to have a seat at that table and to tell us what they want and they don't want, because that's how you find out what the preference of a community really is.'",
        "'speaker_6': 'And that is our goal. And we work with a lot of communities and I will say this to you now that there is not one single community out of the over 20 that we've worked with that have identical needs and preferences.'",
        "'speaker_6': 'They are all different and it's important. When we're drafting a regulatory ordinance. Yeah, there's kind of a skeleton that we look at and you'll see that format, but every single one of those goes back and forth, probably a half a dozen times between us or within the community.'",
        "'speaker_6': 'However, the community structures that before it's finally drafted to a point where you get some kind of consensus on what what it should contain. They are unique to the communities. We do want to ensure state and federal compliance.'",
        "'speaker_6': 'We want to dovetail with SB 94 and we want to be in compliance with that Cole memo. And then we want to look at the health and safety priorities of the community, address the land use and zoning priorities, and any other priorities that are important to the community.'",
        "'speaker_6': 'I just hesitated because I hope I'm not running over on time. This is what we look at as a typical ordinance element. The first three are the first four. I'm sorry. The first five are what we see in almost every ordinance.'",
        "'speaker_6': 'It's kind of the warehouses. You know, the definitions for those in the room that are attorneys are probably used to seeing a lot of that where we really get into the meat of the matter, the operational requirements, the prohibited activities, and then what we establish is permit fees and impersonal versus commercial applications.'",
        "'speaker_6': 'And then again, you have the enforcement and severability portions which are very typical in most ordinances. This is when we're talking about land use ordinances. This is the type of element that we see. I am not a land use expert by any stretch of the imagination, nor am I an attorney.'",
        "'speaker_6': 'But I do recognize what needs to be in these ordinances after reviewing probably over 100 of them at this point. Health and safety components, most of you are aware of those things. Odor, control, security and safety are the primary ones.'",
        "'speaker_6': 'But we have labeling and packaging that label you're looking at the label you're looking at up there. It came from the workshop down in Southern California, and it talks about the the potency of the product. Right now we're looking for testing for other things like residual solvents, microbiological contaminants, things that might be harmful to the general public'",
        "'speaker_6': '. You're talking about track and trace. You know, we want to know if there is a problem with a plant or with a product. We want to be able to track that back to where it came from so that nobody's getting sick and not knowing where it came from.'",
        "'speaker_6': 'We don't want to be the Chipotle of this group on parking and handicapped access. We want to make sure that, you know, if you're going to a if you're going to a place where you're going to purchase cannabis, that the parking and the handicapped are very important.'",
        "'speaker_6': 'You know, you have people that may need help getting in and out of the facility. You want to provide that cash management to cash business. Most of us know that there are ways around that, but there is a lot of cash involved in this.'",
        "'speaker_6': 'You have deliveries, deliveries, a whole nother aspect of this, and you have the disposal issues. We require cameras over all of the disposal and waste materials that are going on in any facility that we're doing the monitoring compliance for, because we want to make sure it's not toxic, but we want to make sure that it's being disposed'",
        "'speaker_6': 'of properly. Application process and processing. There are a variety of ways that we're seeing this done. We're seeing more and more RFP now, especially where you have limited types of businesses. So you say we're going to allow retail, but we only want three sites or five sites or four sites.'",
        "'speaker_6': 'You have more applicants than you have sites. It can go out to an RFP. It may want to have it merit based with preference points. You have a variety of different things that you can look out for that we look at the operations plan, the security plan, the owner qualifications and experience both within cannabis and without it'",
        "'speaker_6': 'fees for full cost recovery. As I say, you know, these need to be Proposition 26 compliant. They need to be they need to be paid for for what the actual costs are. However, what they do is they preserve tax revenue voted on by the general population for the general population by charging back to those people involved in'",
        "'speaker_6': 'these activities what the actual costs of those activities are. So there is no new revenue for any jurisdiction from these regulatory fees. They can only offset the actual costs of that regulation. Common types of fees. We see them for C P, which is a conditional use permit.'",
        "'speaker_6': 'That's a land use. We also we advise setting up a different type of permit that may have a little faster approval and revocation process. In our language, we call it a commercial cannabis business permit, but you can call it a variety of things and it goes along with that CFP and it has a fee attached to it'",
        "'speaker_6': 'as well. You have renewal fees and then you have the annual monitoring and compliance fees. This is a partial worksheet that we draft for for establishing those fees. It's a fairly simple document that comes after next the study of fees is done and you assign hourly costs.'",
        "'speaker_6': 'You assign the number of hours that's involved in doing it, and you come up with the actual fee for it. These are some fees for jurisdictions around us. We just use Oakland and Santa Rosa. But you can see, you know, the cost of the fees are fairly substantial and this is what they actually cost in a lot'",
        "'speaker_6': 'of places. Taxation. We just finished passing a special tax up in the city of Shasta Lake, passed by 79.1%. Are our thinking on those taxes is that if you're not in favor of attack or in favor of this, you say, fine, then just tax it.'",
        "'speaker_6': 'And if you are in favor of it, you say, fine, let us do it and just accent. So we don't see that the taxes are as big of an issue as a lot of people say, provided they're reasonable.'",
        "'speaker_6': 'Again, what we want to avoid with our taxes and with our regulatory fees is is keeping the black market going. The idea here is to make this a regulated and sustainable business tax methodology that we're seeing these days.'",
        "'speaker_6': 'You have a gross receipts tax or a square footage tax. The state has an inventory weight tax on dried flower and dried non flower material. We see some municipalities going that route as well. You have a special tax if you earmark the tax for a special use.'",
        "'speaker_6': 'You have to have a two thirds vote in order to pass that tax. That's what happened in the city of Shasta Lake, and it was an off general election tax as well, whereas a general tax is a 50 50% plus one threshold.'",
        "'speaker_6': 'You look at the timings and elections and your predicted support levels when you're planning your taxes. How much revenue? Back three years ago, when I started looking at this, before California was even doing it, I was looking at medicinal revenue from the state of Colorado, and then we applied it back to cities in California and for retail'",
        "'speaker_6': 'dispensaries that averaged between ten and $20 per person in that city. And it it actually was fairly accurate. The high side was when you were in a place like Palm Springs where you had a lot of tourism. And the low side was if you were kind of a standalone area.'",
        "'speaker_6': 'So here, if to apply that here, your population is roughly 80800 to 1000000 and a half dollars. From the retail side of it is what we would expect. And I ran those numbers at about a 7% tax revenue when I did them back then.'",
        "'speaker_6': 'I have not updated because frankly, the the taxes on other activities and this have changed so dynamically. It would be old before I came up with a new number again for monitoring compliance. Here's what we're looking at. We're looking at financial records.'",
        "'speaker_6': 'We want to see that track and trace verification. We go right into their system. We see what's marked on their product, and we go back and check to see where it is in the system. We make sure we can track and trace everything.'",
        "'speaker_6': 'We do it at random. We ask them to randomly test their product. We inspect the labeling, the premises. We do video monitoring in most of these facilities remotely, and we send a report to them of what we're seeing on these remote cameras, community communications.'",
        "'speaker_6': 'We handle complaints, we answer questions and we handle violation reports. Other issues. You have jobs. You have lessons learned from other jurisdictions on site. Consumption is going to be an issue, although it's not now. Most cities that I say that I typically, you know, they're not in favor.'",
        "'speaker_6': 'We do believe that over time that's probably going to become more normalized. Product safety, crime levels, operating a motor vehicle. I mean, we all know that there's still issues there. Is cannabis a gateway drug? These are the things that we talk about.'",
        "'speaker_6': 'So I think that's the end of my presentation. And I appreciate your time.'",
        "'speaker_1': 'Thank you. Thank you. All right. Potter. For those of you that would like to speak on this, please submit your slips. I already have 24. Where did you say we could ask our questions after the presentation?'",
        "'speaker_5': 'That's absolutely. If there are clarifying or other questions, Neil is available to answer those.'",
        "'speaker_1': 'We want you to take questions at this time. You. He asked that we hold the questions on the presentation to the end. So yes, I. You come back up, Mr. Hall. I'm Ashcroft. Good evening, Mr. Hall. And I should just for full disclosure, last week I attended a four day seminar on commercial cannabis regulations and considerations that'",
        "'speaker_1': 'was put on by SC. I signed up before I realized they were actually working with our city, but it was very good and instructive. Anyway, a couple quick questions. Can you explain the term vertical integration to us?'",
        "'speaker_6': 'Certainly vertical integration means that if you're a cultivator, you can also be a manufacturer. You can hold a license for manufacturing, you could hold a license for distribution. You could hold a license for a retail sales LLC. You have the ability to hold everything except for testing.'",
        "'speaker_6': 'Testing is the one area you may not hold another license in.'",
        "'speaker_1': 'So testing is the standalone license.'",
        "'speaker_6': 'It's a standalone license, yes.'",
        "'speaker_1': 'Okay. And then there was reference to a 600 foot buffer. Why 600 feet?'",
        "'speaker_6': 'Right now that's in the state regulations. But that is kind of a minimum distance that we see, that we see quite a few cities going 600 to 1000 feet, in fact. And again, it depends on the preference of the of the locality.'",
        "'speaker_1': 'And is it only with regard to a school or daycare center, or could it also be, say, a distance from a public park?'",
        "'speaker_6': 'We see it used for public parks. We see it used for churches. Again, it is the preference of the locality.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'And my third and final question is, so you talk about the we saw the matrix that you had for the estimated hourly rate of the different city staff members that would help process an application. But how would a city know how much time a given license application would take before they did it the first time?'",
        "'speaker_6': 'They really don't. And we didn't when we went into Coalinga. And one of the things that we learned is that that initial, just like anything else that first time through, I think we spent about 6 hours. There were two of us that went through it trying to learn everything we could about that.'",
        "'speaker_6': 'And over time, the last time I was there was just last month, and it took less than 4 hours apiece for two of us to go through that facility. And so what happens? There's a learning curve with that.'",
        "'speaker_6': 'And and again, it's such a dynamic industry that we expect that we're going to continue to have a learning curve for a while as this industry normalizes and really gets up to speed like other industries are. But there is, to answer your question, there is no real way to know that in advance, other than we do as'",
        "'speaker_6': 'part of our service, provide, you know, our estimates on that time.'",
        "'speaker_1': 'Okay. Thanks. All right. Thank you very much. Any other questions from counsel? Clarifying questions.'",
        "'speaker_3': 'Thank you, Madam Mayor. Just a few. So. A quick question. Maybe this is for Miss Potter. I think maybe this one might be for you. So in our smoking ordinance, do we include vaping in that?'",
        "'speaker_5': 'No, not at this time.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'So but part of the draft ordinance, that's before you would update our smoking ordinance to prohibit cannabis smoking, too.'",
        "'speaker_3': 'But what about, like tobacco vaping?'",
        "'speaker_5': 'The the ordinance. I think the ordinance is so old that vaping was not around when when we did it.'",
        "'speaker_3': 'Okay. So and then is that we're trying I thought when, when we first did this, we were rushing to meet some January 1st deadline. Is there some special significance to that deadline or to that date?'",
        "'speaker_5': 'So January 2nd is the date after which the state will start issuing temporary licenses and the state will issue temporary licenses for for cannabis active business activities in jurisdictions where those activities are permitted. And so that it is important for a jurisdiction to either affirmatively regulate the industry or to ban it outright ahead of the 2nd of'",
        "'speaker_5': 'January. Because if the city does not have an ordinance either banning activity or regulating it, then the state may assume, and this is basically on the feedback and what we've learned from the League of Cities and what the League of Cities is recommending is that we have something affirmative in place such that the state will not presume'",
        "'speaker_5': ', if you're silent on it, that that means you were permitting those uses solely tied to what the state requires.'",
        "'speaker_3': 'So I'm sorry.'",
        "'speaker_5': 'I was just going to say so as the Council goes through the process of debating and discussing and analyzing this issue, if there is not consensus in the next month or so, staff would recommend that we come back to you with an ordinance banning cannabis activity so that we have time to continue to work through it and'",
        "'speaker_5': 'adopt an ordinance ultimately that would provide the regulatory framework.'",
        "'speaker_3': 'I guess that was my second question then. So the current status quo is we have a ban on manufacturing, cultivation, dispensaries for medicinal, but we have nothing in place for adult use.'",
        "'speaker_5': 'That's correct. And we also would need to update our ordinance even if there was a desire to. And until we were done with the regulatory drafting process, we would need to update our existing ordinance to permit personal cultivation for recreational use, because we only address the personal cultivation for for medicinal at this time.'",
        "'speaker_3': 'Okay. And then maybe this let me see if I can get all the ones I have for you. I think those are the ones. Okay. And then the last couple I mean, there's been some discussion here on trying to encourage local ownership in your in your travels in the business.'",
        "'speaker_3': 'And have you seen cities that were able to do something like that?'",
        "'speaker_6': 'Yes, absolutely.'",
        "'speaker_3': 'Were they able to do that?'",
        "'speaker_6': 'It's a variety of ways. But not only have we seen it done for local businesses, we've seen it done also for local businesses or businesses to hire locally to give some type of program for local hiring. And it comes to mind as Atalanta, Oakdale, Salinas, Sonoma, Oakland.'",
        "'speaker_6': 'They all have preferences of different types for local businesses or or hiring locally.'",
        "'speaker_3': 'And then just a question on the 600 feet. Does the statue say it can be higher or lower or just say it can be higher? Or is it silent? I'm somewhere you send me that. And I thought it was.'",
        "'speaker_6': 'There's kind of a conflict on that. And we've had a discussion about it. And I'm not an attorney, so I can tell you what I see in the in the in the SB 94, in the back part of it, under the collective model, it says that it will be a minimum of 600 feet in the front part'",
        "'speaker_6': '. It actually says 600 feet or whatever a local jurisdiction determines. We're not we're not sure how they're going to reconcile that, whether it'll go one way or another. But there is kind of a conflict in that area.'",
        "'speaker_3': 'Okay. I'll save the rest. Thank you.'",
        "'speaker_1': 'Any other clarifying questions also? All right. Thank you, Miss Potter.'",
        "'speaker_5': 'So as I had previously mentioned, staff has prepared a draft ordinance and that draft ordinance is a two part regulatory framework. Kind of big picture on the ordinance. And the two parts are an operators permit and a land use permit.'",
        "'speaker_5': 'And that is kind of the big framework under which we have proposed to regulate activities. And then we have prepared the ordinance that that has a series of staff recommendations. And what we would like to do this evening is run through what staff is recommending and what's embedded in the ordinance, and then post kind of the high'",
        "'speaker_5': 'level questions that staff is looking for feedback from the council.'",
        "'speaker_1': 'So I, I would like to hear from the public before we give our feedback. I think that's appropriate. But did you want to, I guess, generally what your recommendation is exactly?'",
        "'speaker_5': 'So the ordinance is drafted, permits retail dispensaries, including delivery, manufacturing, indoor cultivation, distribution, testing and research and development. It prohibits outdoor cultivation and onsite consumption. So the kind of feedback we're looking for from the council and the community is what types of cannabis businesses should be permitted and whether those businesses should be medical only or medical and'",
        "'speaker_5': 'recreational.'",
        "'speaker_1': 'Can you clarify real quick on that? Is that current? Would that be allowed January 1st under state law to have dispensaries that are both medical and recreational?'",
        "'speaker_5': 'So the co-location issue is coming up in another slide. So I can talk about the co-location and and the ambiguity on that. And the ordinance proposes a cap on on the number of dispensaries, and it is proposing a cap of three dispensaries.'",
        "'speaker_5': 'And then it's proposing that there be no cap on manufacturing, indoor cultivation or distribution or testing businesses. So the feedback we're looking for is, does the council and community want to cap the number of cannabis businesses, dispensaries only or all businesses?'",
        "'speaker_5': 'And if capped, what number? And then whether dispensaries should be able to sell either medical and or recreational. And one of the confusions that's been happening as the different sets of state regulations are being reconciled is co-location. And right now, most folks are saying that the regs pretty much don't allow co-location of medical and recreational cannabis.'",
        "'speaker_5': 'And they're hoping that when the emergency regs come out probably in November, that the issue of co-location is addressed and that medical and recreational can be co-located in a single business. But in the event that that doesn't happen, we're asking the question, would you if you allow dispensaries, if you allowed recreation and medical, would you want to'",
        "'speaker_5': 'kind of divvy up the number of dispensaries selling medical and recreational if they couldn't be co-located? And then, as I mentioned earlier, we are recommending a prohibition on off site consumption. So that's another question we're looking for feedback on.'",
        "'speaker_5': 'Oops. I'm. Okay. Another recommendation that is in the ordinance is that we prohibit cannabis businesses on city owned land. As Neal mentioned, cannabis is a schedule one controlled substance at the federal level and it's illegal. All aspects of manufacturing, possession, cultivation, it's it's illegal at the federal level.'",
        "'speaker_5': 'And there is some risk to the city of the federal government deciding that it wanted to enforce and there could be forfeiture or seizure kinds of activities that the federal government may want to do if there are cannabis businesses on city owned land.'",
        "'speaker_5': 'And so just to mitigate that risk and not really compel the city to have to kind of deal with that. Staff is recommending that cannabis businesses be prohibited on city owned land. And then can you.'",
        "'speaker_1': 'Clarify forfeiture of the building?'",
        "'speaker_5': 'Or it could be forfeiture of the building. It could be for the land of the property. It and it really is uncharted territory. And so at least in the beginning, there are some things that it may be better to kind of have a wait and see attitude and see how things evolve at the federal level.'",
        "'speaker_1': 'And do we know of any cities that allow that? Mr. HALL.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'No, for, for us, yeah, for there was one I think the, the plant in Coalinga was a former prison or something, but it was sold for us. We may be this may be one of the more unique attributes of Alameda, but we have the former base that is still owned by the city and by the federal government'",
        "'speaker_5': '. And it's an outright the feds can't happen on federally owned lands how it is. And then we did we had a map up briefly and it's also attached as exhibit two in the staff report where staff had mapped all of the 600.'",
        "'speaker_1': 'We pull up the map. So you can actually describe that the people know where we're talking about.'",
        "'speaker_5': 'And what we mapped where all of the 600 foot radii of the sensitive uses that are. The state prohibits outright cannabis related activities within 600 feet of sensitive uses, which under the state definition are K-through-12 schools, daycare centers and youth centers.'",
        "'speaker_1': 'And so and what is the definition of youth centers? Is that a strict definition?'",
        "'speaker_5': 'There's a state definition that's contained in the ordinance. Okay.'",
        "'speaker_1': 'Yes.'",
        "'speaker_5': 'And so you can see all of our sensitive uses, everything up there that has a circle around it or a rectangle around it is a sensitive use. And then we are showing you.'",
        "'speaker_1': 'Member So with regard to the sensitive uses and Mr. Hall touched on this because this hasn't come to the council yet, we don't know if council might, for instance, want to include parks as a sensitive use, since the underlying objective is to keep the cannabis activity away from minors.'",
        "'speaker_1': 'And so and we also don't know if the council might want to go to a larger radius. So this is it's a first draft, but there certainly could be a different land use map with different integrations and calculations.'",
        "'speaker_5': 'That's absolutely correct. And the the draft ordinance is recommending the state minimums, but absolutely.'",
        "'speaker_1': 'That's what this is.'",
        "'speaker_5': 'That's what this reflects. And this council could absolutely provide different direction.'",
        "'speaker_1': 'Okay. And Nebraska, I'm just going to say this, and I know we've had some email communication, Ms.. Potter, that while I appreciate staff's recommendation, this is really a very significant decision for the community and the entire council since we are the elected representatives of the community.'",
        "'speaker_1': 'So I think at this point are clarifying questions. I'm sorry, and we need to keep going. I think it's. I appreciate that. All right. Let's continue. Thank you. Further, there are five questions. Thank you. Okay. Vice Mayor.'",
        "'speaker_7': 'So when staff was considering making their recommendations, did they look at any other types of maps that would have included parks or the distance exceeding 600 feet? Because I think part of all the to answer that.'",
        "'speaker_0': 'Or did.'",
        "'speaker_7': 'You only look at this map?'",
        "'speaker_5': 'We did do a map showing a thousand a thousand feet, which I actually have this evening. So I can put that up on the screen now or at the end of the presentation.'",
        "'speaker_1': 'Do you wish you could show us? Yeah. So if you did a map that includes park so you can see so we can see the differences.'",
        "'speaker_5': 'Yeah. So this is a map that shows a 1000 foot buffer.'",
        "'speaker_1': 'So what is the difference? But sites are not available.'",
        "'speaker_5': 'So a little more of part, a little more of park and a little more of Webster and Harbor. And over at the harbor. Yeah, the Bay Harbor Bay landing.'",
        "'speaker_1': 'So the harbor. And so there's no site then at Harbor Bay with the thousand foot dispensary site?'",
        "'speaker_5': 'That's correct.'",
        "'speaker_1': 'And then on the main island, what were the changes?'",
        "'speaker_5': 'You can see that park there. Their locations are removed from Park Street on the south and also on the south at Webster.'",
        "'speaker_1': 'So I remember.'",
        "'speaker_0': 'Audie, for.'",
        "'speaker_3': 'Clarification. So the the red was the previous retail and now the red that's not filled in. Those looking at that is the parts that are the areas that are removed based if you expand it to.'",
        "'speaker_7': 'The red outline.'",
        "'speaker_5': 'Right. Well, the 600 the 600 foot buffer map also shows an outline. It just shows that you're that shows that you're in a retail zoned area, but that you wouldn't be permitted because you'd be within 600 or a thousand feet of a sensitive use.'",
        "'speaker_1': 'Okay. So real quick, is it possible to go back to the other one and everyone look at that one and see where the 600 is? And if you could describe that, then so we focus on that.'",
        "'speaker_5': 'So so you can see that it would remove possible locations in the southern half of Webster, as well as more of the southern half of Park Street, because already some of Park Street would be impacted by the location of Alameda High.'",
        "'speaker_5': 'And then, as we said, Harbor Bay Landing would be removed as a potential site.'",
        "'speaker_0': 'Right.'",
        "'speaker_7': 'Vice Mayor So Councilmember Odie just mentioned one school. So is.'",
        "'speaker_0': 'It.'",
        "'speaker_7': 'The schools that are on this list? Are they? How did you determine which schools were included.'",
        "'speaker_0': 'With.'",
        "'speaker_5': 'All of the K-12 public, private and charter schools? So what we probably missed, if Lamar is closing in, we probably are still showing it on here.'",
        "'speaker_1': 'But what is open and what is what's on here, really? That's the point of what I think.'",
        "'speaker_5': 'Not long, but if we've missed something, we are happy to to map it and add it.'",
        "'speaker_7': 'And then my other question is, it's a thousand feet from the edges of the school property. How is it measured?'",
        "'speaker_5': 'The edges or this.'",
        "'speaker_1': 'So your description online said As the bird flies, as this descends door to door. That's what some jurisdictions have used. Yeah. Door to door then.'",
        "'speaker_5': 'So. So that's that. So that does give you a flavor of a thousand. A thousand.'",
        "'speaker_1': 'And do you have one that shows parks where the options would be if we included parks?'",
        "'speaker_5': 'And we have we do not have one map showing the parks, but we can certainly do that.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_7': 'Vice Mayor So were Parks considered when the, when staff made its recommendations to the council? Were Parks part of the consideration?'",
        "'speaker_5': 'No staff only took into account those sensitive uses as defined by state law and parks are not a sensitive use under state law. We have a lot of linear park land in the city and it would probably pick up a lot along the shoreline and out of that out at the Harbor Bay Business Park.'",
        "'speaker_5': 'It's probably what would what would happen with the parks. So that just so back to the map regardless of the buffer, staff is suggesting that retail dispense dispensaries may be appropriate in the city's two primary retail streets, as well as its shopping centers, and then cultivation and manufacturing in the city's two business parks and at Alameda Point'",
        "'speaker_5': 'once property transfers to private ownership. However, land use decisions are very important, and what staff is recommending is that the council direct the planning board to do the deep dove on the land use and make ordinance recommendations to the Council in the form of amendments to the zoning, to the zoning ordinance as part of this process.'",
        "'speaker_5': 'So that this, we're recommending, should go back to the Planning Board for its recommendation on the land use lease.'",
        "'speaker_1': 'In regards to the 600 feet buffer versus 1000 foot versus parks. No, not.'",
        "'speaker_5': 'So much that issue, but more that is it. The manufacturing zone, the key zone, you know, in which zoning districts would these various cannabis businesses be appropriate? This is a very high level kind of cartoon map about where we think it generally makes sense.'",
        "'speaker_5': 'But there's probably some more in-depth work for the planning board to do on recommendations to amend the zoning code.'",
        "'speaker_1': 'Okay. But then that would go back to council?'",
        "'speaker_5': 'Yes, absolutely. The council approves all ordinances.'",
        "'speaker_1': 'Okay. So we can get feedback on that later. Member matter.'",
        "'speaker_4': 'So the inserting a planning board hearing for land use into into your timeline that would. You mentioned in answering Councilmember Otis question, what does that do to the timeline? And given also the lengths that we've gone on here and we've got more people than we have minutes left for this hearing.'",
        "'speaker_4': 'Would what do you see our timeline looking at with that?'",
        "'speaker_5': 'Well, it's going to be it would be tight if council gave.'",
        "'speaker_4': 'No, I'm not asking an opinion about what, October. Right.'",
        "'speaker_5': 'If the direction were given to go to the planning board, we would get to the planning board in October next month.'",
        "'speaker_1': 'As the follow up, would it be possible to just have these questions posed to counsel?'",
        "'speaker_5': 'Absolutely.'",
        "'speaker_1': 'Thank you. All right.'",
        "'speaker_5': 'Okay. So can you get me back to my slide? Laura? So I'm. So. Oh, one another. One more. And one more. Oh. And then, obviously, if there are any other comments or directions. Those were that those were the key questions that staff was looking for feedback on.'",
        "'speaker_5': 'And then I. Our advance we placed. One more, one more. And then just to Councilmember Matt Orestes. Question, we have put together a timeline, but a potential timeline. But if you look at it, you can see that it's very ambitious and it it it addresses a lot of different aspects of this from dealing with the ordinance to'",
        "'speaker_5': 'the zoning text amendments and map amendments that we were just talking about. Staff is recommending that the implementation of cannabis business activities in the city, if it goes forward, be revenue neutral to the city. So that does require a fee study.'",
        "'speaker_5': 'Okay. So can you. And we would need to prepare a few study and amend the master fee schedule. And then if we want to cap dispensaries, we would have to go through the selection process. And then we the staff report notes some of the complexities around taxation because the city has some larger issues that it's looking at'",
        "'speaker_5': '. So we want to come back to you for a more in-depth discussion on taxation, so that that's an ambitious set of things to undertake in the fall. But that would be the timeline if we if the city was committed to getting something in place.'",
        "'speaker_1': 'Remember, Ashcroft and I have a lot more questions, but I want to hold them till after we hear from the public. But I have one that I want to ask now is that if the council were to decide to just approve one particular kind of cannabis business now.'",
        "'speaker_1': 'Could we still go back and revise an ordinance in the future but, you know, have something in place by the January 2018 date?'",
        "'speaker_5': 'Absolutely. And then we did in the staff report mentioned that we have a quality of life survey that was conducted in for a three to over three day period in July. And so we had we asked some questions of the community about the kinds of businesses it might be interested or willing to see in Alameda.'",
        "'speaker_5': 'And so this is the result of that survey. And the question.'",
        "'speaker_1': 'Is, okay, before you get there, can you tell us how many people participated in this? The methodology.'",
        "'speaker_5': 'It was a scientifically valid survey. I don't know what the who. I don't know.'",
        "'speaker_2': 'I think it was 600.'",
        "'speaker_5': 'And it was a random is a random.'",
        "'speaker_2': 'Random sample of voters on.'",
        "'speaker_0': 'Call a.'",
        "'speaker_1': 'Voters so limited to voters in the last election or voters defined by whites.'",
        "'speaker_2': 'It's done by the all registered voters and it's randomly selected. You know, it's not by the number of voters who have actually voted. It's those that have registered to vote.'",
        "'speaker_1': 'All right. And where did they get the phone numbers?'",
        "'speaker_2': 'From the rolls from the from the voters.'",
        "'speaker_1': 'All right.'",
        "'speaker_5': 'So it's interesting because.'",
        "'speaker_2': 'The survey is done every couple of years in Alameda. It's a quality of life survey and we add and this these four. Questions at the end of our regular survey. Just to give the council a sense of where this community.'",
        "'speaker_1': 'So are these the only questions that were asked regarding this topic? Yes, these are all of them. So okay.'",
        "'speaker_5': 'And it's interesting because people often say that 68% of Alameda voters voted to legalize recreational cannabis use. And these those who support or strongly support, strongly support or somewhat support the various types of businesses, dispensaries, manufacturing attacks, cultivation, pretty much mirror the same percentages.'",
        "'speaker_5': 'The lowest, actually, interestingly, is on cultivation, but it still is polling at strongly support or somewhat support at about 59%. And then the others are higher. So that was feedback that we thought would be interesting to share with the Council as part of this workshop.'",
        "'speaker_5': 'And with that and one last question.'",
        "'speaker_1': 'Another matter.'",
        "'speaker_4': 'I don't expect an answer for this tonight, but I'd like to get to the speakers and I'd like to have the answer at the next meeting is if we put all this effort into chasing a date. What's not going to be done by the people who are doing this?'",
        "'speaker_5': 'I'll defer to the city manager for.'",
        "'speaker_4': 'That, but I don't want the answer tonight. But I think we need to know that to prioritize what our next step is. Thank you.'",
        "'speaker_5': 'That concludes staff's presentation. Thank you.'",
        "'speaker_1': 'And I just want clarification. What you're asking then is that in regards to other work that would not yes.'",
        "'speaker_4': 'We have building and planning. We have the city manager. We have the city attorney all hustling to a date. That we have a couple of choices on. We can either put an outright ban in and take our time or we can rush to get something in.'",
        "'speaker_4': 'But that rush to get something in is going to displace other activities. Is that clear? Yes. Thank you.'",
        "'speaker_1': 'Thank you. All right. At this point, we have about 25 slips. Each speaker will get 3 minutes. I will call like five names at a time. And then if you all could line up on one side so that you're ready to go.'",
        "'speaker_1': 'And then if you could hold all fours and be respectful of all speakers, that would be greatly appreciated.'",
        "'speaker_3': 'My heart was not with you.'",
        "'speaker_1': 'And I want to clarify, as I understand, the 7:00 is not a hard stop so that we.'",
        "'speaker_0': 'Can.'",
        "'speaker_1': 'Continue to hear from the speakers atmosphere, continue to turn down and give the feedback on this item. All right.'",
        "'speaker_3': '11 is a hard stop if we don't want to. And after meeting.'",
        "'speaker_1': 'We're not going to. All right. Mendoza, van Clerk, Mike Grafton, Sharon Golden and then Agustin Ramirez. That's right. Go ahead and dance with me. Now, Carter, then you get a total of 6 minutes. Okay. Thank you.'",
        "'speaker_2': 'Okay. Greetings. Greetings, Mayor, City Council and community at large. So I want to say that I stand here in support of establishing a local system to control and regulate cannabis businesses in the city of Alameda. And I just want to say, with with the climate that's going on today, there's a lot on the line in the United'",
        "'speaker_2': 'States of America. Racism is rearing its ugly head and it's alive and well in America. Michelle Alexander, author of The New Jim Crow of Mass Incarceration in the Age of Colorblindness, said Here are white men poised to run big marijuana businesses dreaming of cashing in.'",
        "'speaker_2': 'Big, big money, big business selling weed. After 40 years of locking up impoverished black kids for selling weed, their families and futures destroyed. Now white men are planning on getting rich, doing precisely the same thing. So I stand here for my friend whose father spent years of her childhood in prison for cultivation.'",
        "'speaker_2': 'I stand here today for my mentee, a second generation immigrant who at 17 was forced into drug treatment and incarcerated, even though he's not an ad addict and deserves a second chance. I stand here for the disproportionate number of black and brown men and women who are arrested, sentenced and convicted for cannabis related offenses at higher rates'",
        "'speaker_2': 'than their white counterparts. I stand here today as a community member who believes in the decriminalization of cannabis for medical and recreational use. As a former teacher, juvenile probation officer, PTA president, a USDA parent and longtime resident of Alameda, I am personally and professionally invested in public safety.'",
        "'speaker_2': 'I work in implementing taxpayer measures funds through the City of Oakland Violence Prevention Services. When we regulate responsibly cannabis businesses, we are keeping our community safer. Don't get it confused in action. And what I want to point out as well too, when we are prioritizing local.'",
        "'speaker_2': 'Ownership. I completely agree with that. Consider the applicants here in Alameda before going outside. There's people in this community who are prepared to run cannabis businesses. I would also like to strongly encourage you to have one of those at least one of the businesses be a delivery service because the same type of regulations will happen.'",
        "'speaker_2': 'They will examine the premises, track the merchandise, but it's not not the brick and mortar storefront. I'm completely about transparency, cooperating with law enforcement, going through the live.'",
        "'speaker_1': 'Scan process, the.'",
        "'speaker_2': 'Security. This can make our city safer, not not less safe. So I want to say in closing.'",
        "'speaker_3': 'All. I'm.'",
        "'speaker_2': 'That I would like for us to be intentional in our effort to include include people.'",
        "'speaker_1': 'Most impacted by the war on drugs.'",
        "'speaker_2': 'And so that they can benefit from the expansion of the cannabis industry. When you allow people to participate in the local economy as small business owners, that will generate that will generate revenue for our city and improve lives.'",
        "'speaker_2': 'But let's not think about the mom and pop shops like going to a cannabis dispensary can be like going to a cafe. Do you want Starbucks or do you want the mom and pop shop down the street? So it's like it's or do you want a boutique experience or do you want fast food?'",
        "'speaker_2': 'So it all depends on the type of the market and the client. So I would say let's make sure that we can participate in this economy. Don't leave people out and please prioritize. Alameda. Thank you.'",
        "'speaker_1': 'Thank you. Diane Clarkson told your applause that Mr. Clarke, did you want to speak? You're good. Thank you. Mike Grafton, then Sharon Golden.'",
        "'speaker_4': 'Good evening, ladies and gentlemen. My name's Mike Grafton. In the industry, I'm known as Granddaddy Mike. I'm proud to be the recipient of a lifetime achievement award from the Marijuana Industry Council. I've been in the industry for a long time.'",
        "'speaker_4': 'I love cannabis. I think cannabis can do a lot to resolve a lot of the problems in our world today. And I think you're in a unique position to be able to make a decision about how that's done.'",
        "'speaker_4': 'I want to let you know that in my experience, cannabis is not toxic. Cannabis is not nuclear waste. You don't need to over impose and overregulate and overtax this industry in order to protect our citizens. I am indeed a grandfather.'",
        "'speaker_4': 'I have protected and encourage the development and empowerment of a number of generations in my family and certainly within this culture. I think it's important for you to realize that my own business model in this industry has been very successful, and I would like to encourage you to adopt it.'",
        "'speaker_4': 'It is one of small margins and high value. By that I mean if you can keep your local taxes minimal. I believe that you will invite, encourage and support this industry in a way that will allow this industry to support you and this community.'",
        "'speaker_4': 'So I encourage you not to put repressive tax limits into this industry so that you can have a well-regulated and income generating industry in your community. I also want to say that I think it's important that the fair market model be observed.'",
        "'speaker_4': 'I'm all in favor of, you know, benefits for local residents and certainly the voters who elected you expect you to represent their interests. I would also point out to you that the interests of this community have been served by people outside of this community for a long time and no doubt will continue to be so.'",
        "'speaker_4': 'I wanted to let you know that there are many of us who respectfully believe in public safety, in public health, in ecology, in the harmony of nature, and would continue to implement those values in this industry should you decide to support it.'",
        "'speaker_4': 'I think it's very important that Alameda get a board with ordinances and with permissible licenses before January 1st. Otherwise, I believe that the the tide of the cannabis industry will flow past this community. Right now, you're in a unique position with the repressive policies that are in place in Oakland to be more competitive and courage to do'",
        "'speaker_4': 'so. Thank you. Please hold your applause. Come on up.'",
        "'speaker_1': 'And we need to honor the three minute rose so we can let everyone speak. Let's go. Hi there. Sharon Golden, founder of.'",
        "'speaker_7': 'Alameda Island Cannabis Community. I just want to thank council and city staff are working really diligently on this. I'm kind of coming up here. I say the same things kind of every time. You know, we're advocating for local ownership, local hire.'",
        "'speaker_7': 'A couple other things.'",
        "'speaker_1': 'That I feel like because of the contention of local ownership and local hire that's getting lost is we.'",
        "'speaker_7': 'Really want to see some of this money get captured into community benefit fund that can go to programs like Alameda Promise, Meals on Wheels, a lot of other programs versus just getting completely put in the.'",
        "'speaker_0': 'Community into the general fund.'",
        "'speaker_7': 'We are also basically I just kind of want to comment on a couple different things about the presentation this evening. With the ten months that's.'",
        "'speaker_1': 'Passed since.'",
        "'speaker_7': 'Jim Ortiz groundbreaking referral in November, I'm really hoping.'",
        "'speaker_0': 'That we could.'",
        "'speaker_7': 'Try to avoid a ban.'",
        "'speaker_1': 'We've really made some great.'",
        "'speaker_7': 'Progress this year. I understand doing the research that it takes to get this done the right way, but.'",
        "'speaker_1': 'We got to kind of try to get this ball.'",
        "'speaker_7': 'Rolling. Also, in.'",
        "'speaker_0': 'Regards to the map.'",
        "'speaker_7': 'If we do the Thousand K, it's starting to look like where are these businesses going to open? I think that's going to directly impact that $800,000 potential revenue that we saw it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. I guess then Ramirez.'",
        "'speaker_0': 'And then Madam.'",
        "'speaker_3': 'Mayor, councilmembers. My name is I was still Ramirez and I'm here on behalf of the International Longshore and Warehouse Union. Everything I heard from the presentation is great, except that at no point did they mention the workers. And I believe that that to us and to and to you, that should be a priority also.'",
        "'speaker_3': 'I remind those of you that were here when we came in late 2014, early 2015, when I brought the the recycling workers from ASI, those workers were making $8.30 when we first met. And right now they are at $18.12.'",
        "'speaker_3': 'Thanks. Thanks to you. So that means that when when city councils get together and what city councils try to do the right thing, put their workers that that money is going to be reinvested here in your community. And if you implement, you know, local hire, as many other jurisdictions have, or at least a portion of local hires'",
        "'speaker_3': ', other jurisdictions have that. That money is going to be reimbursed to here people, as Mr. Ashcroft heard from some of the recipients at ECI, that now they are able to afford their own apartment, their car. Some some workers mentioned that for the first time ever, they were able to buy toys from my actual toy store.'",
        "'speaker_3': 'And that $0.99 store. That was those those were. I'm not saying that the that the cannabis workers are going to be in that category. But what I am saying is that we have to make sure that the rights of the workers are health and safety and are protected also health and safety and benefits.'",
        "'speaker_3': 'And the best way to do that will be that use that you put in the ordinance that before you issue any permit, regardless of the number of employees that they need to sign a labor peace agreement with a union of their choice are the companies.'",
        "'speaker_3': 'This is possible. They've done that in other cities and asked as you can as you can see what happened at ECI. The same things could happen here. Thank you very much.'",
        "'speaker_1': 'Thank you. All right. Our next case. Hold your applause. Our next speakers, Rich, Rich Moskowitz and Brian Agaba is sitting time to him, then Linda Astbury and then Mark Hershman and Nicole sitting time to him. So 6 minutes.'",
        "'speaker_3': 'Oh.'",
        "'speaker_4': 'Little technical difficulties.'",
        "'speaker_1': 'You're all feel free to open the windows back there if you're getting warm.'",
        "'speaker_2': 'And you hear the next speaker coming from Princess.'",
        "'speaker_1': 'Oh.'",
        "'speaker_3': 'Looks good.'",
        "'speaker_1': 'Yeah, that's.'",
        "'speaker_3': 'Perfect.'",
        "'speaker_4': 'Now that we're all set. Mayor City Council Member Staff Thank you very much. My name is Rich Moskowitz. I'm here today as the spokesman for Alaska. We are the Alameda for Safe Cannabis Access Group. Our mission statement, what we believe in and why we here today is we believe in safe access for cannabis for all Alameda patients'",
        "'speaker_4': '. We believe in compassionate regulations. And we also believe in the prioritization of local ownership. Benefits of local ownership, as we see them, are very simple. As we've all known Alameda and support Alameda. And in this way, we boost our local economy.'",
        "'speaker_4': 'We can develop the advantages of bringing cannabis here through what's known as the multiplier effect. Every cannabis dollar spent in the community often reaches much further than it was initially spent. And of course, we certainly believe in neighbors employing neighbors.'",
        "'speaker_4': 'To us, safe access means local access for patients. It addresses the need of the largest growing segment of this community, which is the senior community. Compassionate regulation of cost is a large part of safe access, and we certainly believe as part of compassionate regulation, an onsite consumption option, be it in the home or in a business, provides'",
        "'speaker_4': 'a special ability to those who medicinally use cannabis. Compassionate care as we see it seeks to and we educate on this regularly seeks to have people understand that cannabis does not prove the same risk or pose the same risk as tobacco use.'",
        "'speaker_4': 'Seniors, as I said, are the fastest growing segment of this market. And the big part of compassionate care and why we support onsite consumption is the state already addresses the idea that you cannot have the right or excuse me gives the right to landlords to prohibit medical usage in there in people's rental units.'",
        "'speaker_4': 'So if we go ahead and we don't think about this as a compassionate care issue and we ban the public consumption of cannabis in every way, if we bring a dispensary to Alameda, we are forcing people to either break the law in the street or break the law in their home.'",
        "'speaker_4': 'By breaking the law in their home, they're actually subjugated to a much greater risk. If somebody 3 a.m. and or Alameda Winter chooses to medicate in their home and the landlord finds out they could be evicted. Breach of contract.'",
        "'speaker_4': 'And we all know that an eviction in the Bay Area in today's climate is a de facto sentence to homelessness. So we believe compassionate care should be a big part of this conversation. Now, we'd certainly support bringing businesses to Alameda.'",
        "'speaker_4': 'We certainly support that for local access to our patients. We certainly support that for the revenue generated, the economic growth and the multiplier effect we have spoken about previously. And it seemed to get to the next slot. There we go.'",
        "'speaker_4': 'I want to introduce you a little bit to what we have done in case you're not familiar with us. And I certainly know some of you and most of you are. We were formed several months ago. We are a community education group.'",
        "'speaker_4': 'We have provided to the community a Facebook page and a web page with unbiased medical information about cannabis, its and its uses throughout the community. Additionally, we were all here. We were all here at 75. We all went quite late that night.'",
        "'speaker_4': 'Right afterwards, we had a booth on Park Street. This was phenomenal. Over 600 Alameda INS right here have signed a petition asking for local access. This was not a random thing from the city. This was a random thing by who goes to the Park Street Art and Wine Festival.'",
        "'speaker_4': 'In addition, we had over a thousand people there who just come to Alameda to spend their money and they very much wanted to sign the petition. But we asked for local people only. In retrospect, we realized we should have captured their signature too, because that is a big part of our community, people coming and spending their dollars'",
        "'speaker_4': 'here. So additionally, we had the Mastic event on August 20th. A lot of you came, we had roughly 140 people from the city have access to y'all. And we saw both sides or we tried to see both sides of the issue.'",
        "'speaker_4': 'So I just wanted to wrap up today. I know we've been given 6 minutes now through. Donation of time. However, I just wanted to wrap up and speak to what Ascot's vision of the future for cannabis and Alameda is.'",
        "'speaker_4': 'Though, as we've said over and over, we certainly like local access in Alameda. I agree we should not wait. That is not our decision. That is your decision and what you think is best for the community. We certainly feel that prioritizing local ownership is the best for Alameda and we all, as Alameda ends, enjoy knowing the people'",
        "'speaker_4': 'we purchase from. We enjoy having that daily contact, whether it's in the supermarket or at the place of purchase. This is what makes our community special. Towards that end, Alameda has always been a compassionate community. Recent events for the last two three weeks have seen us come together as a community, stand together.'",
        "'speaker_4': 'And we've always felt that Alameda and support our means and everyone is welcome here. Towards that end, a compassionate regulation. As I mentioned, we feel the onsite consumption option either in a business or in your home, is an important one.'",
        "'speaker_4': 'And remember, please, that the state has already addressed the in the home issue and the workplace issue. Public issue, of course, is also being addressed. And lastly, I'd like to say, in our vision of the future, no matter what your decision, and we certainly have our preference for your decision.'",
        "'speaker_4': 'But no matter what your decision, Askia was going to continue to be here. It's going to continue to educate the community because cannabis is going to continue to be part of this community, whether it's brought in from the outside, medically, recreationally, or it comes from the inside.'",
        "'speaker_4': 'And therefore we feel citizens need access to this information. We heard in a recent event some old information, but what's most important is the federal government is putting forth new information, cancer, dot gov, federal patents. There's a lot of information to be shared.'",
        "'speaker_4': 'National Institute of Health, CDC and ASCO will be here. We firmly believe that working together today, we can create tomorrow for all of us. Thank you for your time.'",
        "'speaker_8': 'Thank you. I'll go through some of your paths, Linda.'",
        "'speaker_1': 'Astbury and then Mark Hersman, and he'll get 6 minutes and then Don Shear. Linda. Yeah, I know. It's hard to hear with the doors open.'",
        "'speaker_0': 'All right. So sorry. It's very loud out there. Linda Asbury, executive director of the West Alameda Business Association. We first want to thank you for taking this thoughtful process that so important to our community and taking the time engaging, looking for community input.'",
        "'speaker_0': 'So input. So we want to thank you for that. We strongly agree that there should I think I wrote down a Type ten retail, only one permitted in any district or any designated area. So none of our areas would have more than the one.'",
        "'speaker_0': 'And would encourage you to look at a local preference policy. Keep our money here. Keep we have some very talented people in this community that are very interested in this subject. And if we could consider a local preference policy, I would appreciate it.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_1': 'Mark. Mark Hersman. And then don't share it. At 6 minutes. They have to.'",
        "'speaker_4': 'Thank you, Mayor Spencer. Council at other city leaders. What I would like to do tonight is read into the record communication that we sent most of you last week. Dear City Leaders, thank you for your diligent work in crafting the proposed ordinances that we are discussing tonight.'",
        "'speaker_4': 'As you know, my partner Nick and I intend to apply for a license and use permit for a cannabis related business venture to be located here in Alameda. Once the final ordinances are approved. In reviewing the proposed ordinances, we urge you to reconsider the proposed ban on onsite consumption.'",
        "'speaker_4': 'It is our considered opinion that by providing an available communal space for cannabis use, we can achieve better outcomes for our community in terms of public safety, while also meeting the needs of cannabis users in the community. By allowing but not regulating.'",
        "'speaker_4': 'I'm sorry. By allowing. But regulating available use spaces. We will provide the cannabis community an alternative to smoking in public parks, beaches and streets. We also provide a safe, secure location for cannabis users who reside in multifamily complexes that have strict secondhand smoking ordinances.'",
        "'speaker_4': 'The business that we'd like to establish. Now, Amita is a membership only social club that will allow the use of cannabis on site in order to protect the culture and public safety of the community we love. We commit to the following.'",
        "'speaker_4': 'We'll work with the police department to develop and deploy a multifaceted security system which will prevent crime on site. Well partner with a ridesharing company such as Uber or Lyft to provide safe and sober transportation options for our members will locate the facility near a major bus line in order to provide a public transportation option for members'",
        "'speaker_4': 'as well. Our private membership structure will allow us to control our clientele and enforce a zero tolerance policy regarding any violence, weapons or disruptive behavior on site. We will keep detailed records of our member visits or via our point of sale system, and we pledge to cooperate with the police department on any investigations that may involve club'",
        "'speaker_4': 'members. We will enter into a labor peace agreement with our staff and will not interfere with any attempt by our staff to join a labor union. We'll create approximately 20 to 25 local jobs with this project. And for those employees, we commit to pay a minimum of $17 per hour wage, provide health benefits for full time employees'",
        "'speaker_4': ', and provide flexible scheduling to accommodate personal needs of our staff. In addition, we plan to we will donate 5% of our pretax profits to local charities with specific focus on anti-poverty, anti-crime and domestic abuse victim support charities. We willingly make these commitments because as cannabis activists, we feel a sense of obligation to the voters of Alameda, as'",
        "'speaker_4': 'well as California at large, who overwhelmingly voted to legalize adult use of cannabis. We recognize that this is a social experiment, and if this experiment is to be successful, cannabis businesses must be prepared to work constructively with all stakeholders in their communities.'",
        "'speaker_4': 'We see so many benefits from legalization, from medical research and scientific discoveries regarding the potential therapeutic benefits of cannabis to relieving the social and financial burden of overincarceration those particularly harmed people of color. We would hate to see this experiment fail.'",
        "'speaker_4': 'Our goal is to operate an establishment that will be an example of best practices in the cannabis industry and help to destigmatize the use of cannabis. Thank you again for your time and consideration as we continue to research the topic.'",
        "'speaker_4': 'We have also included some articles of reference in the email that you received last week. Thank you. And I would just like to add, you know, in a much more informal format that our thought is meet people halfway.'",
        "'speaker_4': 'If you do that, they're going to meet you the other half. The other thing that I really am concerned about is Alameda not allowing onsite consumption really puts the city at a competitive disadvantage with cities nearby like San Francisco and Oakland.'",
        "'speaker_4': 'So I really urge you guys, aside from another very important point of considering local residents preference, if and how that's possible legally. I really, really urge the need for giving these businesses that will operate here in our city a competitive chance to compete against some dispensaries that allow onsite consumption both in Oakland and San Francisco, at least'",
        "'speaker_4': ', you know, within remote reach. And there are other cities that are even further beyond that, too, as well. So just take that into consideration. Thank you very much for your time today.'",
        "'speaker_1': 'Thank you. Please hold your applause down. Share it. And then Gretchen Lebow. Don. Don, share it. And then Gretchen LeBeau.'",
        "'speaker_4': 'Mayor Spencer, member of the City Council, on addressing this issue with a no vote. I'll be probably one of the first people will step up here and say no, I definitely appreciate it.'",
        "'speaker_1': 'Consultants, if you could please speak in the mike and.'",
        "'speaker_4': 'The consultants working on the presentation and a lot of people addressing this issue, I know who has friends and and acquaintances and it's a very hot topic. I'm coming from a different direction. Who am I? Dawn. Sure. A resident, a longtime resident, a parent of four children, two, two grandchildren in this community.'",
        "'speaker_4': 'Retired after 40 years of experience at the state, local and county level. Why am I opposed to cannabis? The pot industry? Classified. Now, it is a Schedule one drug by the U.S. government and a group of the country's most addictive controlled substances.'",
        "'speaker_4': 'That's from the NFL. My firsthand experience with middle and high school as a middle and high school administrator led me to understand that experimenting and elevating the use of drugs is commonplace. So why would the city of Alameda make marijuana more readily available?'",
        "'speaker_4': 'What sparked my interest as it sparked maybe a couple others in this room I know at the Western Fair Association convention in Reno. We had a chance to to talk to people that have implemented programs in their communities, and the cannabis industry was there to promote their programs.'",
        "'speaker_4': 'One of the things I got out of that and I'm getting here tonight is the main issue is how much money we can make and give to how many people and where are the profits coming from. I recently wrote a letter in the element of journal with my opinions regarding the city of Alameda adopting this ordinance.'",
        "'speaker_4': 'That letter sparked phone calls and conversations from many people, all who had many questions I could not answer. I promised to ask these questions to the city council and will continue to ask questions to the city council. Who on the council is pushing this agenda.'",
        "'speaker_4': 'On the November 1st, 2016 and July 5th, 2017, the Council approved referrals to move forward with the ordinance. Who made the motions and what was the vote? Have you gathered input and opinions from the following entities? Recreational Park Commissions.'",
        "'speaker_4': 'L.A. Unified School District Board of Education. The Social Services Board. Business Organizations. Civic Organizations. Narcotic officers from the APD and Churches. What Department of the City of Alameda will be in charge of this ordinance? I challenged the Council to do a force field analysis on this important city change issue, and if money in revenue comes out to'",
        "'speaker_4': 'be the majority factor, then the over again social ramifications. I sincerely hope the Council will decide to vote no. I'd like to thank Sabrina Chan and Lina Tam for a conversation on this issue I had with them the other day over.'",
        "'speaker_1': 'Thank you, Gretchen. And then Dorothy Freeman.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Thank you. Gretchen LeBeau, please hold your applause. Thank you.'",
        "'speaker_0': 'Your council people? Yes, I. I taught school for many years, and I know what smoking marijuana is all about because I had a lot of students in my classroom. There's a whole nother dimension to cannabis that I entered into when my husband was dying.'",
        "'speaker_0': 'And cannabis is often used in palliative care. Palliative care means compassionate care. And that was a whole nother dimension that I had to learn when I went over to Harborside to pick up the the pick up the cannabis.'",
        "'speaker_0': 'And I met all kinds of people just like me who were helping their loved ones die. And so I wanted to share that with you because it's a whole nother dimension of the use of cannabis and that we should not lose sight of that.'",
        "'speaker_0': 'I think that cannabis gets sort of a one sided idea because it's smoking and so on and so forth. You can't smoke in public anyway public places. So I just wanted to share with you that cannabis use for palliative reasons is very much on the up and up and I think I support this.'",
        "'speaker_0': 'Ordinance that you guys want to put in effect and study it and I'm all for it. Thank you.'",
        "'speaker_1': 'Thank you. Dorsey Freeman and then Scott Stockton.'",
        "'speaker_9': 'Good evening, mayor spencer and council members and city of alameda. Alameda is always concerned about tax bleed without approval of both recreation and medical marijuana. Our taxes will go to our neighbor cities. I support both recreation and medical locally owned dispensaries.'",
        "'speaker_9': 'I also support locally owned businesses.'",
        "'speaker_1': 'That they will carry back because.'",
        "'speaker_9': 'They will care more about the city, its citizens and keeping it safe.'",
        "'speaker_1': 'I support three.'",
        "'speaker_9': 'Dispensaries within Alameda. I also support much needed testing and research. Alameda point is a perfect place where testing can be housed in a private facility, so there are no problems.'",
        "'speaker_1': 'With the feds.'",
        "'speaker_9': 'I believe in our no smoking laws and agree no smoking laws should apply to cannabis, especially in apartment buildings and public spaces.'",
        "'speaker_1': 'Cannabis taxes do not belong in the general fund.'",
        "'speaker_9': 'Cannabis taxes.'",
        "'speaker_1': 'Should be dedicated only.'",
        "'speaker_9': 'To activities that have direct.'",
        "'speaker_1': 'Impact on the people.'",
        "'speaker_9': 'Such as recreation and parks, the public library, our animal shelter.'",
        "'speaker_1': 'Our food bank.'",
        "'speaker_9': 'Our art commission. Alameda Homeless and Drug Education for our Youth. Thank you. Thank you.'",
        "'speaker_1': 'Scott Stockton and the Mallory Penny. And please hold your comment, your applause. Sorry. Go ahead, Mr. Stockton.'",
        "'speaker_4': 'Hi, my name is Scott Stockton. I'm a Alameda resident. I got kids in the area. I'm not for this at all. I think there are some serious considerations you need to look at, quite frankly, that I'm not sure you all are.'",
        "'speaker_4': 'Primarily, the fact that it is illegal at a federal level puts a lot of implications into where these organizations can bank. In fact, they can't bank right in any FDIC insured bank. It's a federal crime, right? It's a cash heavy business.'",
        "'speaker_4': 'You're projecting $1.6 million in tax revenue. That's at a 15% tax rate. Right. Which these slides show that means $10 million worth of cash is going to be in Alameda. Where is that cash going to be? How's the city of Alameda going to accept $1.6 million of cash on tax day?'",
        "'speaker_4': 'Where are you going to put it? Where you store it. I don't understand the rush. It seems like there's this fear of missing out that these conditional permits are going to be given away by the state of California in January.'",
        "'speaker_4': 'And if we don't rush that, we're going to miss out. I don't think that's the case at all. In fact, all the decisions I made in a rush that involve marijuana, it never turned out good. They never turned out the way I thought they would flat out.'",
        "'speaker_4': 'Not a pot expert. But that's my experience. Right. So I think you really need to look at this. Right? The political climate is not the same as it was on a federal level. You got an attorney general that's coming after pot.'",
        "'speaker_4': 'Right. You're basing all this on a Cole memo. That's not law. That's a memo, right. That can be overturned at any time. Right. The guidances do not allow this on city owned land because of federal forfeiture laws. Those laws apply to commercial premises as well.'",
        "'speaker_4': 'Right. This stuff's happening. It happened at I think it's called Midwest Distribution down in San Diego about a year and a half ago where they confiscated 340 $300,000, never charged anybody and they lost the money. Where does your tax revenue go?'",
        "'speaker_4': 'Right. There's IRS tax code 280, which taxes cannabis companies at a huge rate. Right. Is our tax going to be based on that or are we back in that out? Have we thought about this? Have any of you guys thought about this?'",
        "'speaker_4': 'Right. I don't see why we have to be the tip of the spear on it. Right. Harborside. It's a great facility. I've been in that facility. It's awesome. It's 1.8 miles away from here. It's not about access. Right.'",
        "'speaker_4': 'The guidance is to allow handicapped parking spaces. Where are these parking spaces? Arbor site has people in jackets. Meet me in the parking lot. Right? Right. I don't want people in the parking lot to meet me and my family going to a movie.'",
        "'speaker_4': 'I don't want.'",
        "'speaker_0': 'That.'",
        "'speaker_4': 'Where are these parking spaces? Behind Tom Mattina lying. Tucker's at the movie theater. Anyone.'",
        "'speaker_1': 'I just want to make sure everyone knows we're not allowed to respond to the questions. Mallory, Penny and then Sasha. Sasha Still worth.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_9': 'My name is Mallory Penney.'",
        "'speaker_7': 'And I want.'",
        "'speaker_0': 'To say forgive me for repeating myself as I did speak at the town hall already, but I feel it's important to reiterate these facts here. I am an Alameda resident. I have lived here since I was six years old and right now I currently teach and direct children's theater here on the island, which I'm very passionate about'",
        "'speaker_0': '. And I also work at the local Pete's Coffee and the Fish Shop, so I know a lot of people here in town. My personal story with cannabis started when I was a teenager. I got really bad cramps from my period and my doctor prescribed me Vicodin.'",
        "'speaker_0': 'So receiving a prescription for an opiate opioid before I was even 18 was pretty startling to me and really put things in perspective with kind of the priorities in America. Anyway, I discovered cannabis from that, so maybe it was a blessing in disguise.'",
        "'speaker_0': 'When I was 17, I got my doctor recommendation and my mom had to come with me to get that, and she had to come with me to the dispensaries to obtain my medicine. I also have done extensive research on CBD and THC and various aspects of cannabis that are not just recreational but also medicinal.'",
        "'speaker_9': 'If dispensaries were.'",
        "'speaker_0': 'Local, we wouldn't have to leave the island. We wouldn't be adding to that horrible traffic that I know we all experience when we're trying to get island off this island. I think it's really important to have access here for everyone.'",
        "'speaker_0': 'I'm advocating for local ownership, fair wages for employees with a minimum of $17 per hour. We are the one city in the area that did not up our minimum wage when everyone else did. And I think that's really problematic.'",
        "'speaker_0': 'I also think that I encourage you to think about 600 feet from schools as opposed to 1000. I also would encourage you to map the bars and see where they are with regards to schools and parks. We have quite a few, and I would say that we have.'",
        "'speaker_0': 'Cannabis, as far as I know, is a lot less lethal than alcohol is. I also advocate for onsite consumption having a safe place where we can all. For me medicate for other people recreational usage of it would be I think, a great thing.'",
        "'speaker_0': 'And I want to.'",
        "'speaker_9': 'Just say I am so proud of the city for being a sanctuary.'",
        "'speaker_0': 'City. Let's consider this a sanctuary for other people as well that are using this medicinally. Just want to use it recreationally. We have an opportunity here, so I really encourage you to think about that. Thank you very much.'",
        "'speaker_8': 'Sausage dollars. And then.'",
        "'speaker_1': 'Jennifer Williams. And then Betsy over. AC Hello.'",
        "'speaker_0': 'Good evening and thank you for listening to all of the public here today. I am number one, a cannabis user. I care from the West End today before I bike to consume cannabis. I am active part of my community.'",
        "'speaker_0': 'I donate a lot of my time to cleaning up our beaches after people from the outside come and cool off on the beach. I participate in our community. I've lived here for a year and a half. I would have loved to put my business here as well.'",
        "'speaker_0': 'I own a cannabis business. We manufacture edibles. We were in SoCal for seven years, came up here to be in the bay. I'm from Europe. I don't like the weather in SoCal. I don't know what's up with a hundred degrees up here.'",
        "'speaker_0': 'It's not what I signed up for. So when we talk about having a cannabis business on the island, we're not talking about people smoking in the street. We're talking about people being able to access cannabis without having to go and spend their money in Oakland or in Emeryville or anywhere else.'",
        "'speaker_0': 'I currently pay $4,000 at a commercial kitchen in Emeryville. I could be renting from somewhere here on the island. We pay our workers a minimum of $15 an hour. That's what you start when you walk in the door.'",
        "'speaker_0': 'We. We have. Ah, ah. I'm sorry. My anxiety is kicking in. I haven't medicated in a long time. A few hours we've been sitting here. Our workers get paid for. For donating time to the community every month. It's part of working with our company.'",
        "'speaker_0': 'I don't see the problem in putting cannabis businesses on the island because guess what? Cannabis is already here. All the consumers that are consuming on this island are just going somewhere else to getting the cannabis. And why not spend your money here?'",
        "'speaker_0': 'The the tax implementations, the everything that can. Yes, it's money. But it's not just to get people rich, it's to fill the community with the money from our businesses. So I hope that you guys will lift the ban on whatever level that may be manufacturing, cultivation, dispensaries.'",
        "'speaker_0': 'But consider the fact that I right now employ ten people and in a few years will employ many more. And hopefully we can do that here. I think it's important to mind the date of getting something on the books.'",
        "'speaker_0': 'Anything. If you don't feel comfortable with dispensary here yet, start slow. You can't smell that. We make anything with cannabis. I promise you, you can walk past our facility while we were baking. You would not know the difference.'",
        "'speaker_0': 'Thank you for your time. That's all.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Jennifer. And then.'",
        "'speaker_1': 'Basic.'",
        "'speaker_7': 'Good evening, Madam Mayor. Members of the City Council and staff. I'm Jennifer Williams. I'm a member of the school board here in town. But I'm here tonight in my individual capacity as just a parent and a member of that community.'",
        "'speaker_7': 'As I.'",
        "'speaker_5': 'Indicated at the.'",
        "'speaker_7': 'Event at the Mastic Center, my concern solely revolves around the.'",
        "'speaker_5': 'Location of these businesses.'",
        "'speaker_7': 'Related to our.'",
        "'speaker_5': 'Children and kids. And I'm asking for a 1000 foot.'",
        "'speaker_7': 'Buffer from our school sites, playgrounds, rec centers, places where children congregate. Other jurisdictions in the area have adopted similar restrictions.'",
        "'speaker_5': 'San Francisco, San Jose, for example.'",
        "'speaker_7': 'And I also think it's.'",
        "'speaker_5': 'Important to note that under federal law.'",
        "'speaker_7': 'There are criminal penalties for distribution within a thousand feet of a school. So at least.'",
        "'speaker_5': 'With that small caveat, I think we should be consistent with.'",
        "'speaker_7': 'What federal law requires. The other thing I wanted to note was that last week in Denver, the 2017 National.'",
        "'speaker_5': 'Cannabis Summit occurred.'",
        "'speaker_7': 'And there were a number of breakout sessions.'",
        "'speaker_5': 'By public health entities regarding the effects of cannabis business on youth. Doctors from the Public Health Institute.'",
        "'speaker_7': 'Did a presentation there on the importance of slowing down the process in terms of city regulation to get it right.'",
        "'speaker_5': 'Even if it means a couple of extra months to consider.'",
        "'speaker_0': 'All aspects.'",
        "'speaker_7': 'Of the regulation process. Some of the other recommendations.'",
        "'speaker_5': 'That public.'",
        "'speaker_7': 'Health groups had with respect to youth would be to consider restricting the number of permitted retailers to assure a safe distance from youth serving institutions, like I previously mentioned, require freestanding establishments away from malls and restaurants. Because studies show that locating marijuana business in mainstream shopping.'",
        "'speaker_0': 'District districts.'",
        "'speaker_7': 'Has strong associations.'",
        "'speaker_5': 'With underage use and seek to limit products that appeal to youth, for example.'",
        "'speaker_7': 'The flavored THC, edible products, things of that nature, and also consider advertising regulations. I didn't see in the proposed.'",
        "'speaker_5': 'Draft any conversation about limits on advertising. And I think when you look.'",
        "'speaker_7': 'At the long documented history with regard to advertising in the.'",
        "'speaker_5': 'Alcohol business and its impact on kids, that's something.'",
        "'speaker_7': 'That we should really be.'",
        "'speaker_5': 'Taking into into.'",
        "'speaker_0': 'Account.'",
        "'speaker_5': 'And then using part of the taxes collected to.'",
        "'speaker_7': 'Finance a local wellness fund to support prevention and education in our schools. About marijuana.'",
        "'speaker_5': 'Use. A couple of people have talked about that tonight.'",
        "'speaker_7': 'I know at the Mastic Center event, I believe Mayor Spencer voiced support and something along those lines. So I would also ask something like that be added to the proposed ordinance. And then finally, one of the women that did a presentation at the.'",
        "'speaker_0': 'The National Cannabis Summit.'",
        "'speaker_7': 'Last week.'",
        "'speaker_0': 'Was a doctor from the UCLA.'",
        "'speaker_5': 'School of Public Health.'",
        "'speaker_7': 'And what she what she talked about was that. Thank you.'",
        "'speaker_1': 'Thank you very much. AC And then Michael McDonagh. And then Debbie George.'",
        "'speaker_4': 'I met a mayor. City council and staff. I'm here as a Alameda parent, as a resident here for the last 16 years and also as a current police officer. I work in law enforcement. They have for the last 21 years.'",
        "'speaker_4': 'I'm here to. Talk mostly about thousand foot buffer around schools. I think it's important to give schools a wide berth, especially with onsite or I'm sorry, distribution centers. I think it's important that just as it would be with any other business, I mean, people talked about bars and cigaret tobacco distributors.'",
        "'speaker_4': 'I wouldn't want those near schools either. They're already there. I don't know what can be done about that, but I think with this new industry, it's like the green gold rush and everyone's rushing to get in and get it first.'",
        "'speaker_4': 'But I think it's like someone said, get it right. I don't begrudge people and I don't want them to have to forage off, you know, off the island to go places for their medical marijuana. I don't. I want them to be safe.'",
        "'speaker_4': 'But I also want us to have thoughtful and measured rollout of this. And if you have to vote in favor of rolling this out, that is I'd like to see it then slowly. I don't see what the rush is.'",
        "'speaker_4': 'The money is going to be there. There's no rush. It's not going away. And I think just a thoughtful, measured approach. And then also we're on site. I've heard live scan. I think that's a great idea to have people in the industry.'",
        "'speaker_4': 'Live scanned and record checks. So that's all. I just really like you to consider a thousand foot buffer and those other items. Thank you.'",
        "'speaker_1': 'Thank you. Michael McDonagh.'",
        "'speaker_4': 'Good evening, Madam Mayor, and city council and staff. I'm Michael McDonough, president of the Alameda Chamber of Commerce. The Chamber doesn't support or oppose whatever you decide to do as far as lifting the regulation, the ban or establishing new regulations.'",
        "'speaker_4': 'We don't see it from our standpoint as a business support organization. We don't consider it from the from the moral aspect or the social aspect or even the medicinal aspect. But we do think it is worth considering, as you are considering it as a business from the business aspect.'",
        "'speaker_4': 'And we believe that education of the public from that standpoint is also very important. The issue is, is that there are a lot of jobs that could be created. There are a lot of peripheral businesses that you'll hear from maybe one or two today that are affected, businesses that never touch the leaf, but that will be affected'",
        "'speaker_4': 'through in the insurance business, the banking business, the real estate business, and a lot of the surrounding businesses that would support any business that comes to town. As far as the local ownership business, I fully support local hiring policies.'",
        "'speaker_4': 'I fully support local zoning policies where that is appropriate. For instance, the dispensaries, the delivery, the cultivation. But I also want you to be sure that when considering. Ownership of companies or businesses that require special. Expertize or technical technical aspects that you choose the best business so that we don't have someone that is starting to learn how'",
        "'speaker_4': 'to be the best testing lab or the best manufacturers. But someone who has already experience how to grow a business of that nature so that the city can benefit from the high quality and the experience that they've learned maybe elsewhere.'",
        "'speaker_4': 'But certainly if we bring in businesses outside who have that type of expertize, a local hiring policy would be a great thing to have. Also in this educational aspect of what we believe needs to go on so that the local business community, the parents and individuals and a lot of the people that are here tonight can get'",
        "'speaker_4': 'a better idea of what's going on in local business, local regulation. I really think this is a great workshop and the chamber is also taking this issue on. We are going to at our business expo coming up in September 20th, have a feature there where Rob Bonta, who has played a large part in the regulation on the'",
        "'speaker_4': 'state level, will do the keynote speech on the cannabis effect on jobs and the California economy. And then we will he will moderate a panel where we have some of the five experts in the area, including your Neil Hall, the the consultant with the city, including the author of the regulation and three businesses that may come to'",
        "'speaker_4': 'town. So thank you for considering this issue.'",
        "'speaker_1': 'Thank you, Debbie George and then.'",
        "'speaker_8': 'Michael Nolan and Brian Hall.'",
        "'speaker_0': 'Madame Mayor and City Council members. My name is Debbie George, and I'm a resident here in Alameda. A business owner, property owner, commercial, both commercial and residential. And I see this as a. I'm for the regulation and not the ban.'",
        "'speaker_0': 'I see this as an opportunity for Alameda. We're a forward community. And my my view point is to see that we do this correctly and in a way that's going to benefit everybody, because I do see a lot of benefits in it as far as the money on the tax could go to our police departments that we're'",
        "'speaker_0': 'short on. I mean, a lot of things in the city ordinances. But one thing because I'm a business owner on Park Street and I was involved with the downtown Alameda Business Association. I'm not speaking on behalf of Darva tonight.'",
        "'speaker_0': 'I'm just speaking on behalf of myself. But you may remember a few years ago, there was a tattoo parlor that wanted to come to town. And it really just opened up this big controversy. And basically, the company, which was a very well-known and large company, left because they thought, well, these people are just crazy here in Alameda'",
        "'speaker_0': '. So what we did in our district, the downtown Park Street District, is we talked about how do we feel about having tattoo parlors, kids going to come in. It's going to be on the street. They're all going to see this.'",
        "'speaker_0': 'So what we did at that time is we put in to our bylaws that anybody that wanted to put a tattoo parlor in has to be on the second floor. And it actually worked. We have several in the district, and probably a lot of you don't even know that they're there.'",
        "'speaker_0': 'But I am all for forward thinking. I'd like to see this happen. I appreciate. The the presentation that we had, it shows that this isn't a sleazy behind screen door type of a business, that it can benefit a lot of people and it can benefit our community as well.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Michael Nolan and Brian Hoge. So there's two names on this list, so I'll read it again. Michael Nolan and Brian Holmes. So 6 minutes.'",
        "'speaker_4': 'Accordingly, Madam Mayor and City Council. It's an honor and a privilege to be here as a native comedian. And I commend you guys and ladies in your efforts to be open minded. And the time and efforts that you've put in on behalf of this.'",
        "'speaker_4': 'I'd like to share a few accomplishments of. My best friend. I've known this man for 44 years. Our parents have known each other for in excess of. 70 years combined. His accomplishments in the city and on behalf of other business owners, speaks for itself.'",
        "'speaker_4': 'I believe nobody in this room has more experience in this industry. I believe he is a valuable resource to the community and also to to fellow. Attendees here that are aspiring to enter in this industry. Not just in Alameda, but Mr. Nolan, as has been the owner and the founder of the Green Door, which I believe is'",
        "'speaker_4': 'the second longest running dispensary in the world. His we'd like to state his accomplishments speak for themselves. You know, and I think from the community's perspective, I'd just like to get a show of hands of anybody in this room who has had the opportunity to meet Mr. Nolan and also had the opportunity to have a family member'",
        "'speaker_4': 'or friend benefit from his involvement in this industry and in the community. Thank you. So without further ado, I'd like to give the remaining time to my best friend and business partner, Michael Nolan. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you very much. Thank you, Brian. I did take down a few notes here, so I wanted to make sure that was very clear. Good evening and thank you, Madam Mayor and Full Council. I greatly appreciate your most valuable time.'",
        "'speaker_4': 'I like to say that being the founder of the Green Doors dispensary in San Francisco has given me the experience to share the information in this industry, as well as having generations of family in Alameda and businesses. This is a very passionate goal to better the city and its constituents.'",
        "'speaker_4': 'In San Francisco, as well as other municipalities and states. We have worked with numerous charitable organizations, such as the Friends of the Urban Forest, Teaching Children, tree conservation in different municipalities, working with the United Players in San Francisco for the last five years during the gun buybacks in which we've taken thousands of guns off the street and'",
        "'speaker_4': 'we've provided them with target gift cards rather than giving them funds that could go back into the inner city in which they might go into the wrong direction where there could possibly be drug activity. We work with the Black Works Arts Foundation to locate sculptures that the children have built in parks that we've built around the city'",
        "'speaker_4': '. We work with military hospitals to help provide medicine to terminally ill patients to have a better quality of life while having the honor of passing with dignity. We have also worked with the Academy of Sciences, in which we have done numerous art contests for children at the different schools to experience science and field trips in which we'",
        "'speaker_4': 'contribute the busses and the tickets for their admission. I leave it with this fact that I learned from my father, James Nolan, who was the executive director of the Boys Clubs. Fail me to hear you. President Nixon came down to congratulate him on what a great job he did for this great city of San Francisco or Alexa'",
        "'speaker_4': 'of Alameda and the children. When I was in the third grade, my grandmother, who lived in urban Ohio, had a form of stomach cancer that was a terminal at that time that can be treated. And I remember being in Columbus, Ohio, and the doctor telling us if we could find cannabis.'",
        "'speaker_4': 'And he used the term marijuana at the time to provide a better quality of life for her while she's going through her chemo. That perhaps it would be good for her. And I had to ask my dad, I said, and this is during the Reagan administration.'",
        "'speaker_4': 'I said, You told me drugs were bad. How am I supposed to understand this if this is a physician? And he said, Well, son, you take aspirin, don't you? I said, Yes. And he said, Well, that's a drug.'",
        "'speaker_4': 'He said, It's all about abuse. He said, If you're not abusing things and you have the opportunity of acquiring any type of relief through some type of medicinal value, then you should have that opportunity. Therefore, I felt that I was in a better place.'",
        "'speaker_4': 'What I would like to do is I've collected data on more than 3 million patients and received more than a thousand letters per dispensary annually. I've helped write legislation in more than 23 states. I worked with Congressman Rohrabacher, who did the rollback for Amendment, and it's now the robocall of Blumenauer was just reinstated.'",
        "'speaker_4': 'And I worked very closely with Congress as well and numerous senators. I was with Senator Rand Paul on his presidential campaign. I work on both sides because I'm a diplomat. I want to come up with win win resolution and what's best for our communities at large.'",
        "'speaker_4': 'At this point, I would like to say I have many more things to contribute, but I think we can save that for someone else because in the interest of time, I would like to make sure that everyone has their most attentive attention to be able to speak on their behalf as well.'",
        "'speaker_4': 'If there's any questions, I'm happy to answer any questions at this time of night. I look forward to having meetings with you all to see how I could be a benefit and an asset to this great community. I thank you all for your most valuable time, and thank you for your attention.'",
        "'speaker_1': 'Thank you, Rosemary McNally. And then James Nelson.'",
        "'speaker_9': 'First. I think it's really important that you're here, that we're all here. I'm a child of the sixties and I took a few tokes and I remember how I responded. Then I went several decades without touching the stuff, and I became a senior citizen with trouble sleeping.'",
        "'speaker_9': 'I found out how you get a recommendation, which is a process in itself. I scoped out two dispensaries in Berkeley. I scoped up two up in Portland, and then I went to Harborside and it was like going to the makeup counter at I Magnums.'",
        "'speaker_9': 'There are incredible opportunities, potato chips for you, candy cookies, you name it. There are two qualities the THC which get you stoned, the CBD, which does not get you stoned. It's really important that people put themselves in a high education program before you start allowing kids and even some seniors who need a learning curve.'",
        "'speaker_9': 'This is powerful stuff. It's very. And my father, too, he was dying of lung cancer in 1976. He, too, took a little bit. Somebody found a joint someplace, but he was also taking cocaine, morphine, Thorazine, which was under the under the table.'",
        "'speaker_9': 'But he had a really hip doctor who gave that to him, and it calmed him down and it was a relief. So I would like to thank Frank, Matt SC for saying take your time figuring this out. I believe there's no rush and once you open the door to these recreational buyers, you don't know what's going to'",
        "'speaker_9': 'happen. The end, even the medicinal people. When you go to Harborside, I recognized three Alameda people there and I wasn't complaining about my money going off the island, but I was very interested to know that I know three people here who go over to Harborside and I started talking around and there are many people there are there'",
        "'speaker_9': 'are little lozenges you can take. There are the lotions you can put on your skin. There are tinctures, the tonics, mouth drops. Cannabis comes in many forms and in many formulations. And for those who do not want to get stoned, it's really important that you take your time choosing what to buy and what to use and how'",
        "'speaker_9': 'to use it. So I would say go slowly, figure this out. And I'm not a recreational user. I think medicinal purposes are fine.'",
        "'speaker_1': 'Thank you. James Nelson and then Kevin Pietersen and then Serena Chan. If you'd like to speak on this item, please submit your slip.'",
        "'speaker_4': 'Good evening, city leaders. I'm going to bring a little different subject up, and that's the insurance subject hasn't been spoken about here tonight. But I've been in the insurance business for 33 years. I own new growth insurance, which is located right here in Alameda.'",
        "'speaker_4': 'And. Presently. We. The one of the requirements that the insurance brings to this particular industry is security. You might be. Interested to know that the alarm systems, the video inside and out, the prison systems at the doors, vaults, safes, fencing around the property lock.'",
        "'speaker_4': 'Security gates. Security personnel inside, outside the building are all come as part of the insurance requirements. So that's a big concern in most communities, and that's handled just through the insurance alone. Presently our company is in eight different states.'",
        "'speaker_4': 'We've insured over 100 different cannabis businesses to date, and that's all happened primarily in the last 6 to 8 months. Most of those are in California. However, we're in Washington, Oregon, Nevada, Colorado, Maine, Florida and Pennsylvania as well as California.'",
        "'speaker_4': 'I'm a member of the two largest cannabis organizations, and one of them is the National Cannabis Insurance, a National Cannabis Insurance Agency. And it's a newly formed I'm on the insurance committee. There's only ten of us in the United States that are on that committee.'",
        "'speaker_4': 'I'm also on the California Cannabis Industry Association Insurance Committee that's newly formed here in California. As far as what you're going to see out there, dispensaries are going to be the only cannabis businesses that you're going to see that are going to have any branding on it.'",
        "'speaker_4': 'You won't even see the indoor building cannabis grow facilities. You won't even know they're there. Manufacturing, same thing. The. The job so that that that's that's the big thing I'm seeing in all these businesses that we've insured. For instance, Cultivations can have anywhere from 3 to 30 employees on site.'",
        "'speaker_4': 'That's pretty typical manufacturing, anywhere from 5 to 20, dispensaries, 10 to 20. Then you have transportation services, delivery services, attorneys, consultants. The list goes on and on. And we've heard different people speak tonight of how many different businesses are formed out of cannabis alone.'",
        "'speaker_4': 'Right now, some states require general liability insurance to be part of the permitting process. Along with now we're seeing product liability, which protects the consumer against any product malfunction or that that they may occur, which is pretty important.'",
        "'speaker_4': 'Other insurance is are on the crop itself. We can ensure the plants in various stages, building the transportation, the delivery, the cars, the people who drive them, labs and manufacturing.'",
        "'speaker_1': 'Thank you. Ken Petersen.'",
        "'speaker_4': 'Mayor Castle, thanks very much for the good presentation from the staff. It was a good job. I am a doctor of pharmacy degree from the University of California, San Francisco. I've been interested in drugs, legal and illegal, for 55 years or more.'",
        "'speaker_4': 'And fascinating. I'm not a user of marijuana and I don't advocate it one way or the other, but I am concerned about general public health and welfare. Cannabis is probably the largest economic crop in agricultural crop in the state of California, which is very proud of its agriculture.'",
        "'speaker_4': 'And cannabis uncontrolled cultivation is an environmental catastrophe in the national forests and other such places destroying streams, wildlife, endangered species and people that happen to wander into the wrong places. One of the startling things about illegal drug use and attempts to control it is that when they try to make it illegal and and punitive, the value of'",
        "'speaker_4': 'the product goes up and the criminality goes up. On the other hand, in places around the world where they have tried to decriminalize and control and provide safe products, the crime and addiction even and the health issues have decreased greatly.'",
        "'speaker_4': 'Portugal, the entire country of Portugal has decriminalized. Switzerland is decriminalized. The city of Maastricht was a place where they decriminalize marijuana and they had a flood of tourists coming in. The local people weren't much interested in it doing the in Liverpool decriminalized.'",
        "'speaker_4': 'But medical control has been very successful in decreasing crime, illness and addiction. Thank you. Thank you. By the way, have a good trip.'",
        "'speaker_1': 'Thank you. Sarina chan.'",
        "'speaker_9': 'I'm vertically challenged. Good evening, Mayor Spencer. Members of the council. I'm sure you're tired of getting my emails. My name is Sabrina Chen. I lived here on the island for over 20 years. After moving here to raise my son in a safe environment the past 25 years, I've been a public health advocate working on tobacco control and'",
        "'speaker_9': 'learning all the best practices around tobacco control and alcohol control. And we have an opportunity here if we are to consider cannabis outlets to apply our best practice knowledge about how communities have tried and attempted to control tobacco and alcohol after it got out of the bag at the very front end.'",
        "'speaker_9': 'So I agree with most everything that was in the presentation. SEIU did a great job. They had one slide that said Health at the very end, and I'm all about a public health approach to cannabis and we need to do our best.'",
        "'speaker_9': 'Kids, unlike adults, if they start taking cannabis, out of all the adults who take cannabis, 9% will get addicted. That's according to the CDC for all the kids, people under under 18 who start using cannabis. 17% will become addicted.'",
        "'speaker_9': 'And addicted means addicted. I just have to mention that when I worked for an association that took a lot of secondhand smoke complaints, all the second hand smoke complaints that I got in housing, about half of them were regarding secondhand marijuana smoke.'",
        "'speaker_9': 'We had people calling us who had elderly and children and their next door neighbors were smoking cannabis and as a result, their health was being affected. And cannabis is listed on the state's list of toxic contaminants because 33 of the components of secondhand marijuana smoke are on that list.'",
        "'speaker_9': 'So it is recognized by the state of California to be a human carcinogen. So be very careful where you allow it to be smoked. And I was looking over the data from Colorado because this is a really complicated subject.'",
        "'speaker_9': 'And I've been reading everything and I feel like I need to smoke a joint. But what I found there is that in Colorado, they did a lot. They've been doing a lot of studying of the statistics. And still about 87% of the cannabis is consumed in the form of smoking.'",
        "'speaker_9': 'So even though edibles and vaping might be safer for other people around them, we have to take that into consideration too. But I'd be very happy to share with you the tons of documentation that the public health community has produced in relationship to the legalization of cannabis.'",
        "'speaker_9': 'And it's not prohibition. It's all about looking. How do we protect our communities? Thank you.'",
        "'speaker_1': 'Thank you. All right. Our last speaker is Linda Weinstock. If you want to speak on this issue, please submit your slip. Linda. I. Mayor.'",
        "'speaker_0': 'Hi, council members.'",
        "'speaker_1': 'My name is Linda Weinstock.'",
        "'speaker_0': 'I've been in the community for about ten years. I'm going to talk to a little bit about how marijuana seabeds have affected my family.'",
        "'speaker_1': 'About three years ago, I started having seizures.'",
        "'speaker_0': 'And the doctor.'",
        "'speaker_1': 'Put me on a medication called Topamax. I started to have problems with my vision.'",
        "'speaker_0': 'I started having problems with losing my hair. The next thing was they recommended that I start using CBD.'",
        "'speaker_1': 'Because they felt.'",
        "'speaker_0': 'That this would have less adverse effect. And also the fluorescent lights weren't bother me, but I was using them. At this moment I have a.'",
        "'speaker_1': 'Grandson who's suffering from.'",
        "'speaker_0': 'Tourette's. You look online right now, one of the best researches.'",
        "'speaker_9': 'For suffering from Tourette's is marijuana.'",
        "'speaker_0': 'Doesn't have the adverse effects. And I think we need to look at all the all of the adults, the seniors, the kids that are using medication right now that's destroying our bodies. And I think. We have an opportunity to have a really safe community and a really healthy community and especially our seniors.'",
        "'speaker_0': 'We're living really long lives. I'm 67 and I guarantee you I'm going to get to be 100 if I live in this community. So I just am hoping that we all look at the health of all of us.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. There. Looks like we have another step. Andy Huntoon.'",
        "'speaker_4': 'Really? Right. Oh, I don't know what happened to it.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'But you put a different number.'",
        "'speaker_4': 'My dad. Mayor council members. I am here tonight as a long alameda resident. Close to 60 years. And at one point, I had just come home from Vietnam and I got turned down in my friends who hadn't had the privilege of going to Vietnam.'",
        "'speaker_4': 'Some of them later did, but they had gone over the Summer of Love and learned a little different.'",
        "'speaker_6': 'Attitude towards their.'",
        "'speaker_4': 'Fellow men going across around the world and killing people. And they came up with a kind of a hippie mantra, two things to remember and some things to consider when you're doing drugs in the light. I thought they were pretty productive and they've treated me well.'",
        "'speaker_4': '50 years ago, I was actually incarcerated in this building. We're doing somebody a favor, providing them with some drug. And I really, to this day, don't see what I'm doing wrong. There's always enlightening as it is. It offers me in the fact that I might be able to just sit down and relax and smoke.'",
        "'speaker_4': 'Smoke a joint without being incarcerated is thrilling, but it still doesn't address the problem that you're talking about hiding this thing and taking it out of this. The sites of the site of souls children, the realm of children.'",
        "'speaker_4': 'I'm thinking the children should be part of the formula. It's their world or their inheriting, and they should know what's going on and they should see what drug addicts act like and what what's motivating them and what's getting in my head.'",
        "'speaker_4': 'People do in everything that they do in the world should be a transparent things. We can understand what's going on to try to straighten out society. That's about all I had to say on so.'",
        "'speaker_8': 'All right. He's our.'",
        "'speaker_1': 'Last speaker. At this point, did we want to make a few comments or want to go to staff's questions?'",
        "'speaker_0': 'And Brody, let me to go first. Well.'",
        "'speaker_1': 'You're right. The first referral.'",
        "'speaker_3': 'Okay. So you got your pen ready? You might want to call because I may have a couple of questions. I'm sorry. So I'll try to go through this quickly because in the interest of time. But I do want to make some really short.'",
        "'speaker_3': 'Thank you. Thank you to staff and the consultant for all your work on this. And thank you to the mayor for asking me to co-host the town hall. We had a few weeks ago. I appreciated the opportunity to collaborate and.'",
        "'speaker_3': 'It was happy to say yes. I thought it was a very interesting event. Thanks for the community for coming out. You know, when we did this ban back in the middle of the night at 4:00 in the morning after we did the rent thing, we did say that we were going to have this this community outreach.'",
        "'speaker_3': 'So I appreciate everyone coming out at 530 for an early meeting. And just just briefly, I mean, one of the speakers said this. It's here. So it's something we have to deal with. The argument over whether or not we're going to have adult use that was decided last year at the ballot, that that issue is not up'",
        "'speaker_3': 'for debate. The same thing about. The same thing about medicinal cannabis. That's not up for debate either. That's been 20 years. I mean, it took us a long time to get regulations. But, you know, that debate is over.'",
        "'speaker_3': 'So like Dorothy Freeman said, you know, it's not a question of, you know, we want our taxes to go to other cities. I mean, do we want our jobs that could be had here to go to other cities?'",
        "'speaker_3': 'So I'll just rattle off, you know, where I stand on the different questions. And then first I'll just go through some general stuff. So because I think I had those listed first, I do think we need to take care of vaping in the in the smoking ordinance as I think we need to look at banning flavored tobacco'",
        "'speaker_3': '. I know it's tangentially related, but if we're looking at smoking, I think we should look at that. Also on the deadline. I mean, I kind of agree with Councilmember Matt Arrestee. I'd rather do this right. It'd be great if we can do it right by January 1st.'",
        "'speaker_3': 'But if we can't, I'd rather do it right. I think we should look at delivery just in case we don't approve dispensaries. You know, there's going to be delivery in Alameda, so it'd be great if we can figure out a way to regulate that or somehow raise revenue from that.'",
        "'speaker_3': 'I do think we should, at the dispensary level, incentivize local ownership. I don't know what that looks like. I don't know what's legal. But I do think that's something we need to do licensing and permit having, you know, different fees for the actual permitting versus the actual application.'",
        "'speaker_3': 'I like that idea. I mean, local hire, I think that's a good idea as well. And if there's a way and I know some people talked about, you know, a live scan and that maybe as a solution. But, you know, a lot of people in a lot of communities have been impacted negatively by the, quote unquote, war'",
        "'speaker_3': 'on drugs and Nancy Reagan and all that crap. But so we might want to find a way to. You know, make sure that they can benefit from, you know, this being legal now. So if there's a way we can do that, those that have been impacted in a negative way, I'd like to see that as well.'",
        "'speaker_3': 'As we figure out the taxing structure, I'd like to see some type of a community benefit component where maybe some of this money goes into a grant fund and our shrub takes, you know, an opportunity every year to emptied out because I don't want it to be, you know, seized at the end of the year.'",
        "'speaker_3': 'And then we can kind of do this competitively and not like, you know, whoever gets the favorite charity of the month behind them, that type of thing. I'd like to see some type of incentivizing of incubator space. There's a lot of people in the business, but there's a lot of folks that, you know, may want to get'",
        "'speaker_3': 'into the business as we go. A labor piece, of course, to me is critical, whether it's card check or some other type of labor piece. I mean, there has to be that way. And then on the kids, I mean, the the speakers that touched on that, I think that's critical education.'",
        "'speaker_3': 'I think some way we can educate children on, you know, what's good because this is adult use, it's not children's use. So we want to make sure that we don't. Do anything that makes it easier for children, whether that's advertising signage.'",
        "'speaker_3': 'I actually think the 1000 foot ban is a good idea. Quickly, going through your your questions. To the extent I have an answer. What types of businesses? I'm fine with all of those. I think we should consider onsite.'",
        "'speaker_3': 'I mean. If we're going to be talking about this, let's talk about this and let's have this debate. I mean, it is something that especially since we're doing well, at least I hope we're doing the thing where you can't use it in apartments and out in public.'",
        "'speaker_3': 'Maybe we think about a different creative way and make sure, you know, our police department is is involved. Medical only or recreational. I mean, what is the market? I mean, to me. That would be the driving force on that decision.'",
        "'speaker_3': 'I mean, if we think we can be successful in a market where there isn't anybody like recreational. I don't know. I don't I don't really. I don't really know. So let's just kind of see where where the market is and where you think we can be most beneficial.'",
        "'speaker_3': 'And finally, the three dispensary cap. I think the others don't need to be capped. But the one thing the one speaker from Webster that that was interesting that maybe we cap, you know, one in each, you know, area, one of our retail areas.'",
        "'speaker_3': 'I thought that was interesting because maybe we don't want three on, you know, Webster Atlantic. Right. Maybe, you know, we want to space them out. And then. Okay. So I think I answered that one. I answered that one city on land.'",
        "'speaker_3': 'I agree with staff. No city on land. And I think I answered all your questions. Thank you.'",
        "'speaker_1': 'Thank you. And staff, you can fit the questions up so we can all be looking at those to prompt us. That'd be great. I vice mayor.'",
        "'speaker_0': 'Mayor?'",
        "'speaker_7': 'I think there's been a lot of work, obviously that's been put into this and a lot of thought. But I also hear that there's a number of our community members. When I looked at some of the numbers who aren't fully on board and and I think when I look at that, I want to make sure that we're'",
        "'speaker_7': 'doing our part to really work with the community and talk to them and hear them out. I think we're going to be better for it if we can bring people along rather than kind of force something onto our community members without really getting their buy in.'",
        "'speaker_7': 'You know, in terms of the deadline, in a way, it's somewhat of an artificial deadline because we can do things to kind of put things in place while we actually fully articulate what it is we intend to do.'",
        "'speaker_7': 'I would like this to be done once and done right. I don't want us to rush into it. One thing I would like us to consider is the possibility of phasing certain things in. If there is, there's certain areas that might be less controversial.'",
        "'speaker_7': 'I would like to start with looking at that, seeing that we do that right, perhaps starting with lab testing or manufacturing things that might be, you know, not involving direct retail sales where we could address some of the issues that have been raised tonight.'",
        "'speaker_7': 'How are we going to handle the tax revenue that comes in? How are we going to make sure these facilities are safe in some communities? You know, the sheriff has an access, you know, video surveillance into the facilities.'",
        "'speaker_7': 'They can check, they can monitor. They're working with them on, you know, delivery, timing, best practices, things like that. I think that there's absolutely an opportunity for us to kind of perfect that in the areas where we're not adding that additional element of direct retail sales right away, that sort of thing.'",
        "'speaker_7': 'I also think that, you know, it's not to say that we don't look at some of the other things, although I am concerned about our capabilities and capacity at actually being able to deal with any sort of major incident.'",
        "'speaker_7': 'Right now, I know we have to call for mutual aid in the event of fires and things like that. I'm a little less inclined to kind of prioritize something like cultivation, where we're an island community, we have infrastructure issues currently on Alameda Point.'",
        "'speaker_7': 'You know, I want to make sure that there's not a kind of runoff issue or some sort of issue with water or things like that in terms of production and cultivation. Also, in the event of a major incident, I want to make sure that we actually have the crews needed to handle whatever that would look like and'",
        "'speaker_7': 'to do that sort of analysis. I don't know that we have. You know, in terms of looking at the direct retail aspect of it, I do think that I would at least want to see that come in at maybe a later phase if it's something that we're going to consider.'",
        "'speaker_7': 'One thing that I've heard a lot of is people wanting an opportunity to participate in the conversation of what direct retail sales might include or look like. You know, is three the number that we want to have, we still don't know if we're going to be able to co-locate.'",
        "'speaker_7': 'That's something that's still outstanding that could affect the analysis. I also think that we should do our best to engage groups like the PTA, the school board, different community groups that are out there, folks at Mastic Senior Center, our Parks and Rec folks, friends of the Park.'",
        "'speaker_7': 'I think we need to try to get as much feedback and buy in from them. I don't know if that would look like a task force or some sort of additional town hall that we would have in the coming months relative to what direct retail might look like if we are considering it, and what our biggest and'",
        "'speaker_7': 'chief concerns are. You know, I do. I think in terms of the setbacks, you know, in Colorado in 2012, the federal government issued a number of cease and desist letters to dispensaries located within a thousand feet of schools.'",
        "'speaker_7': 'I think under the current climate, we absolutely have to consider that. So we're we're looking at this especially with regards to schools. I think it's something that we have to consider. I would like to see a more detailed map and what that would potentially look like.'",
        "'speaker_7': 'I also think I know we have a number of different parks. Something that's come up is parks where there's place structures, there's different types of parks out there. And that's perhaps something that the community could discuss. But I think the 100,000 feet from schools is something just based off of the federal climate of things right now.'",
        "'speaker_7': 'I'm more interested in looking at what a map like that would look like, and then also the feasibility of what types of spaces are actually out there. Are we just kind of creating a map and then there isn't really spots for things to land?'",
        "'speaker_7': 'I do want to have a more robust conversation in terms of land use and zoning for different things. I think that that's something that hasn't really been dived into in the report that we got and is is still obviously outstanding with regards to the live scan.'",
        "'speaker_7': 'I think we absolutely should encourage looking at things and looking into things and making sure our facilities are as safe as possible. But I also know that there's a number of people who are in the industry who because we've we've just made things legal, have had you know, we'll have records.'",
        "'speaker_7': 'I think that we don't want to say just because you have a record or some sort of past that you can't operate now legally, I think we want to encourage people coming into the industry in a legal fashion.'",
        "'speaker_7': 'You know, with regards to the cap, I think at least initially, I'd like to limit the number that we're looking at just so that it's manageable and we're not getting staff kind of inundated with the approval process and having that take up a lot of our time in terms of what our other priorities might be.'",
        "'speaker_7': 'So I think figuring out what that number might look like and what we think we can actually process and regulate in a in a given year is something that's worth looking into. With regards to residency, I think residency can be a little arbitrary in terms of how we actually go about defining it.'",
        "'speaker_7': 'Is it three years? Is it five years? What do we actually look at? I think the metrics that we're looking for, the underlying concerns is what is your connection and commitment to our community? And to that end, I think I'd be really interested in looking at those sorts of indicators, like, do you hold a current business license'",
        "'speaker_7': '? Have you ever held a business license in the city of Alameda? Have you gone through a permitting process in your personal capacity or otherwise? What would what would that look like? What's your history in terms of your ability to work with our staff and to really work with us as opposed to working against us or being combative'",
        "'speaker_7': 'or litigious? I think also looking at things like what's your involvement in our local community? Are there community groups that are supporting you or that you've worked with, that you have a history with that sort of thing? I think that, again, that really hits the heart of whether or not you're committed to our community or not.'",
        "'speaker_7': 'And I think those people who are residents of our community are long term, you know, community members in various ways are going to meet those those aspects more so than other people who are less interested, let's say, in being a long term community partner.'",
        "'speaker_7': 'You know, I would also like to see something around a labor peace agreement right now, the state saying 20 or more employees. I would like to at least cut that number into half. I think that that gives us insight into making sure that the facilities are safe and that we're really working towards safety and safe access also'",
        "'speaker_7': 'in the working environment and can be with the union of their choice. But I would like that to occur before we actually issue a permit that there's some sort of agreement worked out that that they're going to be working with a different labor union.'",
        "'speaker_7': 'They're going to have ten or more employees. I like the idea of limiting, you know, one type of retail per district. And I also would echo my colleague's comments regarding flavored tobacco bans and looking at the smoking ordinance.'",
        "'speaker_7': 'One thing, if we do have some sort of I kind of want to. Parcel these out and talk about them separately as opposed to in, you know, in combination collectively. If we are looking at, you know, retail, I think we do have to have a conversation simultaneously with if we're looking at our smoking ordinance and making those'",
        "'speaker_7': 'changes, which I think it's worth looking at, are we going to have on site? Because if you live in federally subsidized housing, you can't smoke at home. And at the same time, we don't want people necessarily smoking in our parks, smoking around our kids.'",
        "'speaker_7': 'I think that's going to push it into those areas. So I think there is a value in really looking at on and what that looks like. And I think there's ways that we can address whatever issues might exist, like, you know, safety on the roads, safety for people in the neighborhoods.'",
        "'speaker_7': 'One other thing that I've seen is, you know, in some of these different areas, requiring different people when they get to the final stage in terms of applying to actually have the applicant put together some sort of town hall or community access, just like we notify folks if we're going to be making changes to a building that'",
        "'speaker_7': 'are going to be drastic or could involve the neighborhood, that we would notify the neighbors, give them an opportunity to meet the prospective owner and actually have that process happen and take place so that we can get that community input and we can get whatever the concerns are, we can actually address them as opposed to dismissing them'",
        "'speaker_7': '. And I really hope this process is focused around, you know, addressing whatever the underlying issues are, if it's safety. Let's actually have a conversation about that and talk about the what ifs and if we can do those sorts of things that are going to make people feel safe and comfortable with what's happening.'",
        "'speaker_7': 'Because I think that that's really important. And I think that, you know, this people were strongly supporting, but we don't talk about the details. And I think the details really matter in terms of making sure people in our community feel like we're addressing their needs in terms of quality of life.'",
        "'speaker_7': 'So those are my comments.'",
        "'speaker_0': 'I want to go next.'",
        "'speaker_1': 'What member matter.'",
        "'speaker_4': 'S.E., thank you. I agree with most of what my colleagues have said there. I do think we have to start small in a phased in approach. I think most of the people have talked about dispensaries, and I do think we need to cap manufacturing, cultivation and distribution and testing.'",
        "'speaker_4': 'And I think the point about distribution may be a function of what is allowed. On the two other or the three other categories. My biggest concern right now is location where this is going to be located. And it's really not my personal concern.'",
        "'speaker_4': 'It's the concern of the people who get notice when there's a conditional use permit if you're within 300 feet of it. I think that's when the theory of legalization becomes the reality. Who wants this next door to you?'",
        "'speaker_4': 'Whatever this is, then you can talk about parking. You can talk about all the the horror stories are. We had the debate about whether medicinal should be used and whether recreational. Views. I think Councilmember already pointed that out, but I think it's very important that we talk about the location and that's a I think is a land'",
        "'speaker_4': 'use issue and the planning board should help us with that. I think the thousand feet for the the reasons that were mentioned from a federal level and from experience where for example, in in the seventies, Oakland put in a thousand foot ordinance for new liquor stores because that was the scourge of the time.'",
        "'speaker_4': 'Was it within a school? I think the comment on on putting parks into the equation as well as balancing that equation off with on site use activities, I think that still has to be debated. My second concern is directly with the this draft ordinance.'",
        "'speaker_4': 'And it's not this is not an order of importance. But I'll make the police department, particularly the chief or the chief designee, is tasked with a bunch of activities. And here are hearings, enforcement, appeals. These are some of our most expensive employees who people are clamoring that should be out on the street enforcing the speed limit.'",
        "'speaker_4': 'I want to make sure that this is not only revenue neutral and I. I don't harbor the illusion or the delusion that we're going to get $1.6 million in tax revenue because this is going to cost us a whole bunch more than I think it is.'",
        "'speaker_4': 'And we need to pay those bills first before we start divvying up the money to all the all the the other services. Because I was just reading in the Chronicle where a grow house in the Lower Dimond in Oakland was raided by a SWAT team.'",
        "'speaker_4': 'They caught the guy and nobody was hurt. The guy was there, according to the report, two steel plants. So I was glad nobody got hurt. It was resolved. You know, the alarms went off, all the security work the police got there.'",
        "'speaker_4': 'But it was a SWAT team and. Ching, ching, ching, ching. That's dollar signs. And it's also police officers who are not doing the things that we're tasking them to do now. So I want to make sure that our police department is paid and expanded to handle whatever is brought in here, regardless of how it turns out.'",
        "'speaker_4': 'And then that comes to the cash nature of the business. It was dramatically stated that $1.6 million is a lot of $20 bills wrapped up in a pile and deposited right here down to the Department of Finance over a period of time.'",
        "'speaker_4': 'How do we how do we make sure? How do we mitigate the liability of having a heist in the parking lot or a heist at one of these places? It's like a bank robbery where people get tempted because there's a pile of cash that they can take and run because robbing a bank is a federal crime, I'",
        "'speaker_4': 'think. Right. The federal crime. Robbing a pot dispensary is not a federal crime. And we don't have that protection. And I don't want to have the city ignore that liability. And how do we address that? How do we address I appreciate the protection for the workers.'",
        "'speaker_4': 'Are we address having the workers pay into the Social Security system if they're receiving cash? How do we make sure that they're being paid overtime, they're receiving cash. And when I say we make sure that means we have to pay somebody to audit this gentleman who does audits from SCA.'",
        "'speaker_4': 'Well, that's being paid and. That's a cost to the city. And. We have to. We have to know what those numbers are so that we can fund it and balance those those against what we're gaining by allowing one of these aspects or all of these aspects.'",
        "'speaker_4': 'And I agree with the. No city property. No federal property. A thousand feet from a school. I would like to see something come up with the parks especially and that overlay with the with whether there's a on site consumption activity or not.'",
        "'speaker_4': 'So those those are my comments on it. And I do think this is going to be a long discussion if there's a way to phase it so that we get started as a pilot to see. How safe it is, how much it costs, and what the problems are.'",
        "'speaker_4': 'That's great because ordnances are meant to be examined and reviewed and refreshed. To make sure that we're meeting the current needs of. But I don't want us to ignore that. And I don't want to wait to the end and have the ordinance approved.'",
        "'speaker_4': 'And then we spend another few months arguing over what the fees are. We need to know. In parallel with what the fees and what the cost of this is. We need to take our best shot at it and be conservative on what the impact is on on this.'",
        "'speaker_4': 'And I think it's not just going to be cost. It's going to be more people that are going to be needed. Because we don't have enough people now to enforce many of our ordinances. This one has with the cash that's going to be resident here.'",
        "'speaker_4': 'This one has bigger implications than, you know, a signed ordinance or a a public nuisance ordinance. Thank you.'",
        "'speaker_1': 'I'm going to go next member Ashcraft. Thank you. And thank you to my colleagues who have spoken before. As Councilmember Madras said, I concur with much of what's been said. So having spent a full day this past week at this seminar with.'",
        "'speaker_1': 'Government officials from cities and counties, mostly in the Northern California area, but many of whom are already doing some form of commercial cannabis business. The overarching theme we heard from those who've been there is go slow, that it's always you're always able to add as you go.'",
        "'speaker_1': 'It's really hard to take away something that you've permitted. And there were some horror stories which I will get to. But so at the outset, I want to say that I respectfully disagree with staff's recommendation, that we permit everything, all the different categories, with the exception of outdoor cultivation.'",
        "'speaker_1': 'At the outset, I don't think that's going slow, and I don't think that gives the council and the community an opportunity to get their arms around what this means for Alameda. And I do appreciate hearing from all the advocates who have come out on both sides of this issue.'",
        "'speaker_1': 'I also am mindful that our schools just went back into session about two weeks ago. So during the summer a lot of families were in and out of town and not even aware that, you know, of what was going on around this topic.'",
        "'speaker_1': 'So I do want to I think the vice mayor mentioned bringing in the school district recreation and parks stakeholders. I would add to that the Boys and Girls Club and Girls Inc, and I do want to see that buffer.'",
        "'speaker_1': 'I worry less about limiting tax revenue if you expand the buffer too wide than I do with the primary. Overarching reason for the regulations is to keep this cannabis out of the hands of young people. So you logically keep it away from schools and parks.'",
        "'speaker_1': 'And after all, a number of our parks are the site of afterschool programs that are run by the Recreation Parks Department, our Recreation and Parks Department, or Girls Inc, for instance. And I also want to just pause for a minute and say, I have complete compassion for all of you who are or have had family members who'",
        "'speaker_1': 'are cancer survivors or patients or other debilitating conditions for whom medical cannabis has provided relief. And that's one of the reasons that medical cannabis has been legal in the state since 1996. This is not a question about do we legalize it or not?'",
        "'speaker_1': 'It's legal. It's been around since 1996. And not only is Harborside a dispensary 1.8 miles away and I love the analogy of I magnets make up counter we are showing our age because there hasn't been I magnets for a while, but there are also a number of dispensaries that deliver to Alameda.'",
        "'speaker_1': 'So nobody needs to go and find and find a parking space and that sort of thing. So we're not you know, we are mindful of those needs. I also like the idea of creating jobs, but not just any jobs.'",
        "'speaker_1': 'And that's why if Augustine Ramirez is still here and I worked closely with him on the ACA recycling workers, so we want to make sure that we're creating well-paid jobs, that there are benefits. That and very good question from my colleague Matt Arrestee.'",
        "'speaker_1': 'How do you make sure that that's done in a in a cash economy? So put that on your list of things to look into because the Bay Area actually has a very robust economy, unlike, say, Eureka, where I had lunch at the conference with some folks and one of them is a planner was is a planner in'",
        "'speaker_1': 'the city of Eureka, Humboldt County, which produces 92% of all the cannabis in this country. And she was telling me that it's a very real issue there because people are jobless. The forestry and the lumber industry has left that area and it's not coming back.'",
        "'speaker_1': 'And she said as we legitimize these businesses and have these dispensaries, it brings the price of cannabis down and it makes it less lucrative for the illicit operators. They are dealing with Mexican drug cartels in the national forest in their county.'",
        "'speaker_1': 'This is not a good thing. It's also not a problem we have here. But my point is we can be a little more selective about the jobs and a little more demanding of what these workers, what their benefits and pay should be to the extent that we're allowed to do that.'",
        "'speaker_1': 'But one of the things she said and also the city council member from the city of Arcata said, watch out for too much of a concentration of cannabis businesses in any one retail area, just like too many bars on a on a street or in the business district, it really changes the climate, the whole atmosphere of that'",
        "'speaker_1': 'area. I would favor starting slowly with the least. Intrusive, if you will, businesses. I am convinced now, having heard from a professor from UC Davis who started the first lab for testing cannabis products ten years ago in this country, that testing laboratory testing is very important for the safety of the people who use these products.'",
        "'speaker_1': 'And there is so many different variations and the impacts of the different kinds and that sort of thing. A testing lab in Alameda or two. I would think that that would be a pretty good place to start, kind of get our our feet on the ground a little bit manufacturing, maybe.'",
        "'speaker_1': 'The lady who spoke who has her business in Emeryville can invite me over to come see it. I am trying to get all the education I can. I also thought we learned it at this seminar that you can have a brick and mortar business that doesn't include a retail storefront, but it can do delivery.'",
        "'speaker_1': 'And I thought, well, delivery because that gets the cannabis into the hands of people who need it without having to come to the place. Now, one of the police officers from UC Davis, not UC Davis, the city of Davis who was there, did tell us a little horror story about there have been a couple of armed robberies'",
        "'speaker_1': 'at deliveries where someone called in or requested a delivery. It was really a vacant house and there were really gang members waiting there. But I you know, we have our very capable police chief, Paul Woolery, in the audience.'",
        "'speaker_1': 'And I'm sure this is something that police chiefs around the state are discussing how to deal with. And but, again, I would I would start slow with one or two of the the different uses. I would love to get into the hands of the Council on Staff.'",
        "'speaker_1': 'This report from the Denver conference. It's like this, but I think it's great reading for us. And I also I said that the thousand foot buffer includes our parks, including the skate park. And as far as the residency requirement, I'm all for hiring local.'",
        "'speaker_1': 'But as far as permit applications of operators, the staff participants also emphasized that experience and track record is very important. That's not to say that you couldn't have some points for being local, but you know, when we get around to issuing permits, I would rather see a good, strong track record.'",
        "'speaker_1': 'Maybe it comes with locals or maybe it doesn't. And so then in the ordinance itself, just quickly, I've highlighted some pages that concern me. The. Well, first of all, we did say it's one of the findings that we will hold several public meetings.'",
        "'speaker_1': 'So this, as far as I'm concerned, is our first public meeting because it was a great town hall that the mayor and council member Odie put on, but it wasn't put on by the city. So it, you know, more information is better than less.'",
        "'speaker_1': 'So let's hold more another town hall and hear from maybe some different aspects. The. I also. Want. So and well, I wouldn't even get to dispensary and retail permits because I wouldn't do that in the first year. I would do something less, less impactful to the community.'",
        "'speaker_1': 'See how that all shakes out. And then we'll think about. Retail and others. The. Something that. Security for cash businesses has already been raised. The. Background information is important. But bear in mind, and it's in the ordinance that you cannot in under the ordinance, you can't deny someone a permit for a previous conviction under California Health and'",
        "'speaker_1': 'Safety. 11. 350 or 11. 357. My probation officer days are a little ways behind me, but is that. Is recreational use of 11 350 and 11 357 Health and safety. Somebody help me. What is that? Oh, come on.'",
        "'speaker_1': 'You can hear someone speaking on the mic off the top of your head. Chief, did you want to take that question for us or not? It's not it's not the penal codes. That probably was our chief of police.'",
        "'speaker_1': 'Paul, we're. Larry.'",
        "'speaker_4': 'Paul. Larry. Police Chief. You caught me off guard. 357 and 350. Our Health and Safety Code Sections 357 B was the one that we always would before would use for the infraction citation for less than an ounce of marijuana and 350 was sales.'",
        "'speaker_1': 'So the point is that. And you can go sit down and relax. Thank you, sir. The point is, you can't deny someone a permit for a previous conviction on those statutes. And that we do. Councilmember matter S.E. mentioned and it's true we stretch our staff very thin.'",
        "'speaker_1': 'And so right now I was looking under the licensing regulations. And so there are all these requirements to come up with insurance and inspection, all that. And do we do that on an annual basis? And, you know, do we do we make sure that someone is current on their on their license, on their business license, on their'",
        "'speaker_1': 'use permit? Because I know sometimes with our other licenses, they could be overdue months going up to a year. But in in a case like this, I would think it's very important to stay on top of that. So.'",
        "'speaker_1': 'Um, and, you know, you can answer yes. You add it to your list. Yeah, I'm not looking to too, but. But then we do. There is on page 15 the failure to pay the required fees, taxes or any other monies owed to the city.'",
        "'speaker_1': 'So my question there for staff for another time is and then how long do we we know that that would result in a revocation of the license. So is there a grace period? How long before you've gone without paying your license fee for the renewal year before that licenses revoked, it wasn't clear in there.'",
        "'speaker_1': 'And then there is the so the chief of police is deemed to or can designate someone is going to do the hearings and determine who or reviews the applications for permits and determine who gets it. And then a permit could be revoked, temporarily revoked.'",
        "'speaker_1': 'But the the license holder or permit holder can ask for a hearing before a hearing. Officer My question is, who pays for the hearing? Officer The hearing officer comes up in a couple of different instances. So please have that information for us and then.'",
        "'speaker_1': 'Okay. And the shopping centers and I said this in an email to Ms.. Potter last night that and I see, you know, we've expanded the radius, but a shopping center like South Shore, I think Jamestown Properties, is doing an outstanding job.'",
        "'speaker_1': 'They're trying to be very family friendly. In the winter, we have a skate park. They've just put in a playground next to Bed, Bath and Beyond. They held weekly activity sessions for toddlers all during the summer months. We have children's stores, we have food trucks on the weekends.'",
        "'speaker_1': 'That is not a good place for retail cannabis sales. And the same thing could be said of Park Street. And I remember when what is now Peet's Coffee was going to become a cigarets cheaper and the community erupted because it was so close to the high school and that was cigarets.'",
        "'speaker_1': 'But and I actually think the city bought that property and then sold it to Peet's and it's been a great success. So just think of all the family serving activities and locations up and down and in the environs of Park Street, including Alameda Theater, including the main library checkers, ice cream.'",
        "'speaker_1': 'I could go on, but you all know our city, I think. And. They're on the delivery piece, and I know that. Delivery, it says, shall be directly to a residents or business address and only between certain hours. And it has to be signed for that.'",
        "'speaker_1': 'What's to keep that delivery out of the hands of a young person? If a minor is the only person home that teenager, does he or she get to sign for the cannabis or does it go back with the delivery service?'",
        "'speaker_1': 'So I would like that answered as far as the locations that were suggested on page 34 for cannabis cultivation. I was mildly surprised and I was very surprised that made a point. Adaptive Reuse District, the army, the Point Enterprise District were called out because the council hasn't really had that discussion.'",
        "'speaker_1': 'And I think we're looking at being a lot of things. We've got a lot of tech companies that are out there and are acting as incubators to others. This kind of goes in a different direction, quite a different direction.'",
        "'speaker_1': 'We also have the Alameda Point Collaborative out there and Operation Dignity and Bessie Coleman Court and, you know, lots of families and, you know, more more residents is coming to Alameda Point. And then, of course, and I think the vice mayor touched on this.'",
        "'speaker_1': 'There's the infrastructure that is in need of everything out there. And we're charging over $1,000,000 an acre. But I, you know, I. I don't want us to do just anything to bring in revenues. I just don't think that the council's had a a robust discussion on whether cannabis is illegal, is appropriate in that area.'",
        "'speaker_1': 'But at this point, I wouldn't favor cultivation indoors or outdoors anywhere in the city. And and again, I think when you talk about the army to point locations, you do need to think of the other uses that are out there, including the collaborative.'",
        "'speaker_1': 'Finally. Um. Okay. And so. In summary, I think that we can be proactive but conservative. I think we can get something very limited on the books to protect us from the January 28 date. But I would start with very small steps.'",
        "'speaker_1': 'Learn from that, and whatever we do will make sure we do it right. We don't need to be early adopters on this. Thank you. All right. So I want to thank. First of all, I want to thank the community.'",
        "'speaker_1': 'I want to thank staff. Their presentations. The legal advice. I want to thank my council members for. Considering this, I'm going to answer some of the questions that were raised. First of all, why Rush? From my perspective, and I'm going to remind you all what my perspective is.'",
        "'speaker_1': 'I'm a Mexican-American woman who grew up in Los Angeles in the sixties. From my perspective. And in regards to who? Who is the one that got busted? I am in I do want to ask our police for the records of who got cited.'",
        "'speaker_1': 'I my understanding is from looking at Oakland and Los Angeles, they're going back 20 years to find out if there was any disproportionate siting for cannabis related offenses in regards to the skin color of the people that were, in fact, cited.'",
        "'speaker_1': 'So I want to know what records we have on that or if there's any area of town that received more citations. And that is what other cities are looking at. And I agree that that is something we need to at least look at the data.'",
        "'speaker_1': 'So we are making an informed decision in regards to if there is a response required or at least that should be considered for that as other cities are. So in regards to the question, why Rush? I don't think this is rushing.'",
        "'speaker_1': 'I think that our country has been dealing with this for over 50 years and some of you would say 60 years. And I would submit that our country has done a very poor job with this issue. And that connects to my next issue that many of you spoke about, your personal journeys.'",
        "'speaker_1': 'And and I have heard from people in the community in regards to their children themselves. Their parents are needing medicinal cannabis to.'",
        "'speaker_0': 'Actually.'",
        "'speaker_1': 'Be able to participate in life. It is and from and that leads to as all many of you know, I am a ten year breast cancer survivor. Triple negative impacts. Women of color. High fatality rate. Very aggressive chemo.'",
        "'speaker_1': 'And with that comes side effects. With that comes doctors, oncologists prescribing medications that in fact are very detrimental to our bodies. So why does that matter? Why does it matter to all of you that can stand up here and say you are not that person?'",
        "'speaker_1': 'You have your health so that driving to Oakland doesn't matter. It should be something we can all do. I'm going to ask you all to close that door. Thank you. Honestly, a lot of us cannot do it. A lot of us cannot do it.'",
        "'speaker_1': 'I heard many of you say you care about education and yet then you say, well, other cities are have deliveries come into our town. So it doesn't matter that you're going to be able to get it, but you're not going to get is that conversation.'",
        "'speaker_1': 'That is, in fact, what needs to happen. And should someone that has impaired health. I have to go to Oakland to have that conversation. Should they have to have that conversation with someone they don't know? I also support preference for local ownership and employees.'",
        "'speaker_1': 'Why? Because it matters. I want them to be able to have a conversation without the stigma. I also want our country to figure out how to move forward with medical research so that we all know how to do the best we can.'",
        "'speaker_1': 'So my position on all of this 600 feet. Why? Because it's the state law. It is not reckless. Reckless. It is not. It is in quote unquote, minimum. But it is done with measure. They they when they are suggesting 600 feet, there is a determination by our state that that is sufficient.'",
        "'speaker_1': 'And when you look at our map at the 1000 feet, and I'm sure if you include other things that you want to measure from. We will not have any retail establishments on the farm. I do not think that is appropriate.'",
        "'speaker_1': 'Why? Because access does matter. Going to someone in person does matter. And yes, we can keep it safe. And in fact, any of you that think cannabis is not here, you are wrong. It is here. If you ask your friends who has a card, who is using.'",
        "'speaker_1': 'Your friends use it. Please do not fool yourself into thinking that no one that you talk to uses and it's not. So from my position, it's not a rush. We are way behind. Should we in fact be measured?'",
        "'speaker_1': 'We are measured. Member already brought his first referral. Someone asked this question. Who brought the referrals? Member already brought the first one in November. What was the vote? My recollection is. And who made the motion? I actually made the motion on the referral.'",
        "'speaker_1': 'It was a31. One is my recollection to hear the referral with myself member ODY and member matter SC of voting to hear it. With member Ashcraft my recollection voting not to and member de sog abstaining. That was in November.'",
        "'speaker_1': 'Come May. I felt like we actually needed to. Moving along. And I'm going to use that. Move it along. So I brought another referral. It actually coincides with my treatments that I go to the cancer center for every six months.'",
        "'speaker_1': 'And as the clock ticks and I'm thinking, why do people like me? I go to the cancer center. If any of you want to join me, I'll be going again in November here at Cancer Center. You can see stories like this, and I'm going to explain what it is.'",
        "'speaker_1': 'Last time I was there, there was a gentleman African-American receiving chemo. He had a caretaker with him. He was in a wheelchair. They could not move him to a non wheelchair to receive his chemo. He could not really speak.'",
        "'speaker_1': 'He had to have the caretakers speak for him. The saddest part was, okay, so I when I did my chemo almost ten years ago, I had what they called dense dosing. I went every three weeks instead of a traditional four.'",
        "'speaker_1': 'I do not now my current treatments every six months. Which means I go to the cancer center every six months. At the end of his treatment, the nurse said, I will see you tomorrow. There are cancer patients that go every single day.'",
        "'speaker_1': 'We do have serious problems. And it's not just cancer. There are other illnesses. There are others. We heard it tonight. Other medical conditions that can get relief this way. I don't think it's appropriate for Alameda to not. I do agree with the term compassionate, compassionate care.'",
        "'speaker_1': 'These are our loved ones. They are parts of our community. And I know and I trust that Alameda can do it responsibly. I also trust I was former PTA council president for two years. I was on our school board for six years.'",
        "'speaker_1': 'I am confident. And yes, I do want to work with our schools. I want to educate that we have teachers that do that currently because they know students are offered marijuana in this town. There is access. And we have students every day that say no.'",
        "'speaker_1': 'Yes. And we have parents every day that step up and teach their children what's appropriate and what's not appropriate, whether it be in regards to marijuana and alcohol. And some of you I know heartache and alcohol and yet our thinking that we can have.'",
        "'speaker_1': 'So when I moved up here, I was a little surprised to see a liquor store right across the street from Alameda High. I was also surprised to see a liquor store not very far from another one from Alameda High.'",
        "'speaker_1': 'I was also surprised to see how many bars within walking distance to both of our high schools and other schools in town. But you know what I was told? Trish. They were kind of grandfathered in. It's the Alameda way.'",
        "'speaker_1': 'So that is something that this town has done. And and teachers and principals and school board members and parents all know it to me every day when we, our children walk past those. They do it.'",
        "'speaker_0': 'Responsibly.'",
        "'speaker_1': 'Please do not ever discount the intelligence of our youth, our youth. And in fact, also walk past. Dispensaries. And by that I mean brick and mortar dispensaries. I think the number three by staff is appropriate. I think it is appropriate to have one on each side of the main island and one on the farm.'",
        "'speaker_1': 'I also on site consumption. I also support that. I think it is actually complements our ordinance of no smoking because we honestly I would prefer that people that want to smoke have a site that is legal instead of having them smoke.'",
        "'speaker_1': 'And you all know what? Smoking in our parks, smoking at our beach, smoking behind a crap cove, smoking on our streets. You know it. Let's give them a safe place.'",
        "'speaker_0': 'That was that is legal.'",
        "'speaker_1': 'To smoke and them as in people that are people that do look like yourself. I did, in fact, have someone that I highly respect. I wish I didn't see anyone that looks like us support this. Look in this room.'",
        "'speaker_1': 'This is representative of Alameda.'",
        "'speaker_0': 'This is.'",
        "'speaker_1': 'Us. Okay. Deliveries. My preference would be to have dispensaries, brick and mortar in this town sooner rather than later, because I don't think it is best practice to have deliveries only and we cannot stop those other cities. You can order from a dispensary outside the city.'",
        "'speaker_1': 'They are driving it through this town. They are driving it through this town with product our city. We have a proposal for a permit that includes jeeps, the $3,000 regulations that would make it safer. And we cannot put our proposals on these other cities.'",
        "'speaker_1': 'We could offer a safe alternative, a safer alternative, and encourage our residents to purchase from our delivery services that then have safeguards put on them. And I would prefer that please do not kid yourself that you are stopping deliveries to this town.'",
        "'speaker_1': 'You are not. You would only make it so. It's not regulated the way the Alamitos want to regulate it so that we can in fact have it as safe as possible. Economic Development Department. I believe that this should go through the economic development department like other business permits.'",
        "'speaker_1': 'I think it is critical that it go through fire and it goes through police. I don't think it is the best. I don't think it is appropriate to have it go through police to begin with, because I am concerned that, first of all, our police have jobs.'",
        "'speaker_1': 'They are very busy and I want them to be dealing with criminals. Guess what? Our state has legalized this. This is no longer criminal, so it's not appropriate to have a police chief in charge of it. It should, in fact, go through economic development department like any other permit.'",
        "'speaker_1': 'And when it requires oversight. Yes, it goes through police and fire, but not with our chief being in charge of this. Local ownership, I absolutely support. I think it's critical. And I do want to know the data. If we have any data that would support an equity policy like other cities have in regards to especially people of'",
        "'speaker_1': 'color and certain areas in town. Commercial Benefit Fund. I'm fine with that. We have many uses. Many, many causes. You all know that. I could ask you all raise your hand. Who supported a cause in this town? Every hand's going to go up.'",
        "'speaker_1': 'I know it. We all know we have many causes in town. I'm happy to fund them. 600 feet buffer. I think that's appropriate in regards to schools and use centers. But our state requires. I support community education. Yes.'",
        "'speaker_1': 'And banking. That is an issue. I would encourage each one of you, especially those of you that have been concerned, to reach out to everyone that's running for governor, make sure they have a platform to require that they will, in fact, commit to having a banking system in our state.'",
        "'speaker_1': 'Other states that have done this issue have in fact, implemented their own banking systems. We need it to. So unfortunately, here in Alameda, we will be limited that make sure, especially all of you that are this is your hot issue.'",
        "'speaker_1': 'In fact, I've done this. We had Antonio Villaraigosa show up in Oakland. I went to the meeting. I asked that question critical, the side effect from other drugs, opioids. We know that you can look at that statistic if you don't think that we should try something different.'",
        "'speaker_1': 'It is critical that we as a society figure out how to do medical cannabis advertising. We don't have billboards in this town. I would also and I'm sure our state will be having high safeguards on this, but I would oppose advertising for this.'",
        "'speaker_1': 'Somehow word gets out products that appeal to children. Okay, I. I do think alameda can do it better. I am in support of having manufacturing. I am not in support of manufacturing that appeals to children. I think it's critical that we raise that bar.'",
        "'speaker_1': 'Do it well. I do want containers and that was in the proposed ordinance. I am fine with trying to come up with a safe packaging. Okay. Another reason why I think it's critical that we do this. Drug dealers.'",
        "'speaker_1': 'When when people. I on the street, they get exposed to a lot more than cannabis. It could be guns. It can be drugs that have serious consequences. When people use cannabis, it can be for health reasons. It can also be for recreation.'",
        "'speaker_1': 'But no, they shouldn't have to buy it on the street. And we can again. To me, this is an improvement. It's a serious improvement because unfortunately, people that sometimes you go to buy, you can have something go terribly wrong.'",
        "'speaker_1': 'And we have had people in this town that end up with serious injuries, if not worse, from having a drug, being just being there. Drug deal go wrong. Insurance requirements, that was discussed by a speaker. Thank you for being here.'",
        "'speaker_1': 'That should appease a lot of these concerns. Vaping in regards to adding to the smoking ordinance. I actually am not sure about that. I'm not. I know why because I think vaping is actually used to help people stop smoking.'",
        "'speaker_1': 'But to me that is something that would come back to council and we can have the community weigh in on that issue. Okay. So I'm not sure if I've hit all these issues. I hit everything, but. I, I am supportive of.'",
        "'speaker_1': 'So initially going into this, I was thinking I would not support cultivation, commercial cultivation in town. However, we had a speaker that spoke about where is it being cultivated now? Unfortunately, sometimes in our national forests. So you know what?'",
        "'speaker_1': 'I'm okay with having cultivation in town and that will just be something else that I think we have to figure out the best practice for doing it. There's all there's so many businesses connected to it that. So. So I'm not I'm going to support all of them.'",
        "'speaker_1': 'And. And I also. So so the only other issue I think I might not have touched on is labor peace. The state has said 20 to 1. I think that that is sufficient. Again, I would defer to our state.'",
        "'speaker_1': 'I don't think we need to lower it. And I want to make sure that we are not putting up barriers just for the sake of. So. So and I already saw shaking heads. I have we had businesspeople stand up here and say that they actually take pretty darn good care of their employees compared to other business retail'",
        "'speaker_1': 'businesses in town. So they. So I think there is, in fact, another way that you don't, in fact, have to require of. So. So the state is already saying 20 to 1. I'm fine with that. I think we can also.'",
        "'speaker_1': 'Ask and well and where we've heard our businesses are already offering higher pay than if, for instance, working in a lot of our retail in town. So I am happy to entertain, you know, how to make sure that we get if we think we want to do that for one business.'",
        "'speaker_1': 'And in regards to minimum wage. I brought a referral for that.'",
        "'speaker_0': 'A long time ago.'",
        "'speaker_1': 'And it is something that. I think we do need to look at it. I actually don't know if you can look at it in regards to just one industry, but in regards to the Labor piece, I'm comfortable with 20 to 1.'",
        "'speaker_1': 'I'm less comfortable with having people have to go off island. To get to go to a dispensary there. And I'm even less comfortable with having deliveries being made where we ourselves are not offering the education and doing offering the educate the education in a respectful manner that we think would work if I didn't already say it.'",
        "'speaker_1': 'I see some people in the audience that spoke to onsite consumption. Yes, I support that, too. All right. So now as a.'",
        "'speaker_0': 'Member, Odie can.'",
        "'speaker_3': 'I just had a couple of things get some things came up and I wanted to make sure that staff knows that I agreed with some of the comments.'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_3': 'One thing I didn't mention, I do think to the extent we can de-politicize the selection process, I would like to see that. So it's not the person with the I see Mr. McConnell sending up the fanciest lobbyist. I think we should.'",
        "'speaker_3': 'I just prefer that. That would be great. I did neglect and I apologize. Madam Chairman, your point about. But the rush. I mean, I appreciate that because, you know, you did do a second referral that kind of jumpstarted the process, which I thought was taking a little bit longer.'",
        "'speaker_3': 'So I am concerned if I don't do it right, but I also don't want that to be permission to staff to let this linger, you know, another year.'",
        "'speaker_1': 'That's right. It's been almost a year since memory.'",
        "'speaker_0': 'Was first before.'",
        "'speaker_3': 'I do want to I mean, I agree that, you know, there is some sense of urgency for the reasons you mentioned. But, you know, if we have to wait till January, February, I'm fine with that. But I, I just don't want to see this linger a lot longer.'",
        "'speaker_3': 'And I'm afraid if we say slow down, that it's just going to be, you know, interpreted as permission to wait.'",
        "'speaker_1': 'So so I really appreciate that comment. Thank you.'",
        "'speaker_3': 'That, you know, I made that comment. You know, I like the also the idea of, you know, the planning board getting involved and making sure that this is an economic development because it's not a crime anymore, folks in the state of California.'",
        "'speaker_3': 'So why are we emphasizing the police department when it's a it's really a health issue and it's really economic development.'",
        "'speaker_8': 'So those comments came from.'",
        "'speaker_3': 'My my two colleagues. And then and then also the time commitment, you know, some of our highest paid ice pension employees should be doing what they're supposed to be doing and not, you know, administratively managing our cannabis business in the last concern.'",
        "'speaker_3': 'And I think the mayor mentioned, you know, artificial restraints. I mean, if you consider the shoreline a park and you, you know, draw a line around the shoreline and you're basically cutting off, you know, big chunks of the city.'",
        "'speaker_3': 'So. Well, I'm cognizant of that park issue. I want to make sure we do it in a way where, you know, by saying that we're not whether intentionally or unintentionally, kind of making it impossible for any business to be permanent at all.'",
        "'speaker_3': 'So let's just be careful about that.'",
        "'speaker_1': 'I appreciate all those comments. I think I agree with them. Thank you.'",
        "'speaker_3': 'We did. So I wanted to make sure staff knew that. Yes. Some other agreement that, you know, I wasn't able to say in the beginning because I don't want to hog all that.'",
        "'speaker_1': 'I know that. Okay. So member already brought the first referral. I brought a second one to move it along. He and I did do a townhall and I do appreciate his work on this issue.'",
        "'speaker_3': 'And same here.'",
        "'speaker_1': 'So many questions. All right. Member Ashcroft So and maybe you were about to say how we will proceed. So that's what I was going to. I do think there's some difference of opinion. And I do want to touch on the issue of not having the police do the applications.'",
        "'speaker_1': 'I think it is important for a number of reasons that we do background checks that we make. We would still do background checks. Yeah, I anyway, I don't I'm not hearing that we have agreement across the. Right. So what I want to restructure.'",
        "'speaker_1': 'So what I wanted to do was to ask counsel at this point I would propose that we go back to staff, have them raise the series of questions that you've heard from all of us, and then you can start getting direction.'",
        "'speaker_1': 'So this is not an actual vote. This is where all of us can weigh in on your breakdown of lists. Yes.'",
        "'speaker_2': 'Well, I think we've been taking notes and I think all of you have responded to those series of questions.'",
        "'speaker_1': 'So I was. So, no, actually, I do want to give direction. I want to give the what is supposed to happen. I want our audience to know where each and want each of us is on each of these issues.'",
        "'speaker_1': 'And I want you to hear the long list so we could go over the list and see where we have three. Where we where we don't. If you could stand up here so we can hear you. And there were many issues raised and our attorney lay.'",
        "'speaker_5': 'So there were a number of issues raised, and they were a broad range of issues. And maybe what I could start by telling the council where I thought that I heard there was at least sort of a majority position and if we can work from there, as opposed to marching through each of the issues, because one of'",
        "'speaker_5': 'the key things that I heard and that might have been almost unanimous was a desire to go slow and to get it right. And so it sounds like there is a majority who is supportive of a starting slowly phasing in.'",
        "'speaker_5': 'And what I heard was that there was a consensus to start with that manufacturing and testing was something.'",
        "'speaker_1': 'That, hey, wait, wait, let's do the first. Your comment of you, what you think you heard was the majority that said go slow. Phase in memory.'",
        "'speaker_3': 'I mean go slow. It to me didn't mean phasing. It meant making sure we took the time to draft an ordinance that, well, was not rushed. So with that said, I mean, we're not cutting edge here. Emeryville, San Leandro, San Francisco, Oakland.'",
        "'speaker_3': 'I mean, we could Berkeley. I mean, we could go down the list. We're like almost last to the party. So we're not like the tip of the spear, like somebody said. I guess so. So rather than say. But.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_1': 'So we need to see if we have two or three or four on this. So actually, I need you to break it down. Can you actually. So in regards to go slow, if you want to use that term, then I'm going to have to toss it back to and you can tell me what go slow means.'",
        "'speaker_5': 'Okay. So one of the things that I heard was that there's a desire for more community input to solicit feedback from all SSA to be reckoned, park a USD PTA potentially itself. Okay. One idea, one thought is do is the council interested in having that community outreach happen first before there is something that's drafted?'",
        "'speaker_1': 'So that's the question.'",
        "'speaker_5': 'Parallel track.'",
        "'speaker_1': 'So are you guys good answering that? I'm actually not. I don't think I think that if we had a school board member come here, we also had a school board member come to the town hall. I think we have had time for input and we will have more meetings on this.'",
        "'speaker_1': 'When you come back with a proposed ordinance, that would be another time for people to speak and they can always email. So. So Mayor. Yes. Member Ashcraft. So I, I do. First of all, the ordinance in the findings said that several public meetings were held.'",
        "'speaker_1': 'This is the first public meeting that the city has held. And it's the city who's drafting the ordinance. The school board member. And by the way, it was the same one tonight who spoke at the Mastic Town Hall, emphasized that she was not speaking in her capacity as a school board member.'",
        "'speaker_1': 'And in fact, this issue hasn't come to the school board. But I do believe that they are going to consider a resolution requesting a 1000 foot buffer from school properties. So, Mayor and Councilmember Odie, I, I understand your sense of urgency, but I also want to make sure we do it right.'",
        "'speaker_1': 'And I think it's only respectful that we hear from the community, which also doesn't mean dragging it out. Let's put together a forum where the different groups that Ms.. Potter just mentioned can be heard from, and at the same time, staff will be working on addressing the concerns that all of us have raised tonight.'",
        "'speaker_1': 'Member I'm sorry. Vice Mayor.'",
        "'speaker_7': 'Um, I don't want to say go slow. I think we all want to do things in a thoughtful manner, including staff. And I think we want to be very considerate and thoughtful and full of purpose whenever we do take action and have a clear understanding, I think that's a little different than going slow.'",
        "'speaker_7': 'So I do want to preface my comments with that. What I did hear from my colleagues is that were there is more than three votes, I guess you could say, in support of lab testing. There seems to be a majority of us that are in support of working on manufacturing.'",
        "'speaker_7': 'I'm just wondering, Mayor, if there's a possibility that we could perhaps bifurcate what the conversation looks like to look at those two things and to staff have staff work on that into a lot of the questions seem to come from how we would go about looking at what direct retail sales would look at.'",
        "'speaker_7': 'And I think that that's where a lot of the.'",
        "'speaker_1': 'Question let's see where if we have at least three of us that are willing to phase in all this phase in. And you can make sure I have them on the mat.'",
        "'speaker_7': 'And I'd be amenable to putting down a timeline for when we want to presumably have certain things come back to us or about when we would want to perhaps look.'",
        "'speaker_0': 'At. Okay.'",
        "'speaker_7': 'Different elements of that.'",
        "'speaker_1': 'Okay. So and then so the.'",
        "'speaker_0': 'Non.'",
        "'speaker_1': 'Brick and mortar dispensary. So so. Lab testing, manufacturing distribution deliveries. That is not. A brick and mortar dispensary. Are you looking at items we're going to vote on? Is that what this is now? This. Yes, these. This is the group that I from listening to vice mayor, the things that I think we may be able to phase'",
        "'speaker_7': '. In sooner.'",
        "'speaker_1': 'Rather than later. And that. Right. Oh, cultivation. Was that one of them?'",
        "'speaker_2': 'Could we maybe just start small and just do manufacturing first testing and do on one at a time?'",
        "'speaker_1': 'So my preference, what I'm I want. So I, I was listening to the vice mayor use your comments. Okay. So let me just make sure what your statement was, because I thought you were talking about really everything thing.'",
        "'speaker_0': 'But.'",
        "'speaker_7': 'Brick and mortar retail. I didn't hear my colleagues. What I heard from my colleagues had to do with lab testing and manufacturing. When I when I was listening to people, I might have heard differently. Okay. I think.'",
        "'speaker_5': 'So now you.'",
        "'speaker_1': 'Can call out if you can call the different ones and then we can respond. Okay. Okay. A lab testing.'",
        "'speaker_5': 'Right. So I had heard that there was more than three for the lab testing in the manufacture categories.'",
        "'speaker_1': 'One at a time, please. Lab testing, just like we did on the rent control as you break it down.'",
        "'speaker_5': 'Lab testing.'",
        "'speaker_1': 'Okay. How many of us are in favor of bringing. We're phasing in the lab testing at the beginning.'",
        "'speaker_4': 'Mayor.'",
        "'speaker_0': 'I'd just like.'",
        "'speaker_4': 'To make a comment on this going down. These, to me, seems to be trying to get everything done right at this moment. And I do think, like, if you ask the question, what I'm hearing from most of my constituents and most of the people here is people have a medical need.'",
        "'speaker_4': 'They want to be able to buy it here. They want a harborside here. Mm hmm. And then the the easiest one to control. They're they're not piles of cash around is a lab. You know, no one's going to rob a lab for little test samples, you know?'",
        "'speaker_4': 'You know, to me, that's logic. And I'd like I gives our staff some credit for synthesizing what we've been peppering them with and then bringing it back to us and bring it back next meeting, you know, and, and say we have that on a.'",
        "'speaker_4': 'I'm not gonna say a clean slate, but a revised version of this.'",
        "'speaker_1': 'Okay. So what I heard was loud.'",
        "'speaker_4': 'Can I finish my comment? The other thing that I heard also is that and I think a majority of us said this is. The police chief of police shouldn't be responsible for administrating a land use and a permit process.'",
        "'speaker_4': 'But I think that's another thing that's loud and clear. So I'm hoping staff can synthesize that down. And I think we can still make the timeframe if we if we get a second draft and we can bounce things off that.'",
        "'speaker_4': 'Based on what people here said. Basically what people email said and we're doing all of this right here.'",
        "'speaker_1': 'So you're not you're actually saying to them all.'",
        "'speaker_0': 'At.'",
        "'speaker_1': 'This point. And when it comes back, as in our next reading.'",
        "'speaker_4': 'Not these are not readings, these are drafts, it's not the first.'",
        "'speaker_1': 'Reading but in regards to so but they could come back.'",
        "'speaker_4': 'With this source of information.'",
        "'speaker_1': 'So I'm just trying to make sure I'm understanding what you're saying. Are you saying that you'd like them to come back with only labs.'",
        "'speaker_0': 'Just brick and mortar.'",
        "'speaker_1': 'Dispensaries.'",
        "'speaker_0': 'And then.'",
        "'speaker_1': 'Those two? Or did you say everything?'",
        "'speaker_4': 'I'm saying that that's what I've heard. Agreement on those two. That's what people are saying.'",
        "'speaker_1': 'So that's what you're hearing.'",
        "'speaker_4': 'And the second point I want to make is that a phased in approach is a phased in approach. It could be one. It could be three. Like said here. And I disagree with no cap on all the others.'",
        "'speaker_4': 'You know, put a cap on it. Start small.'",
        "'speaker_1': 'Okay. So that's why I think it's important that we all get to answer the question.'",
        "'speaker_4': 'Yeah, but I think so.'",
        "'speaker_1': 'So. But that's what. So. Tim.'",
        "'speaker_0': 'Do you?'",
        "'speaker_7': 'I was trying to understand. I mean, I. I know what I heard. I just want to get some sort of understanding of what Stafford I think perhaps if we could hear from I'm open to hearing from staff in terms of what they think that they heard in terms of the priorities of moving forward.'",
        "'speaker_7': 'But I do want to have some clarity in terms of what we get back the next time we meet so that it's not just. We all have a different idea of what we think is being worked on.'",
        "'speaker_5': 'So there were three or four items that I heard that there was majority support on that kind of address, different things. And now I'm hearing different discussion the second go around, which makes it perhaps a bit more challenging.'",
        "'speaker_5': 'But maybe I could tell you what I heard initially, just kind of the list as I heard it, where they're on different items, but that I heard that there was a desire to update the smoking ordinance and to take a look at the vaping and the flavored flavored tobacco and the other issues around updating our smoking ordinance'",
        "'speaker_5': '. So I heard that as something that there was consensus about updating the smoking ordinance. I heard that it should be phased in, that manufacturing and testing. There were there were at least three votes to support manufacturing and testing.'",
        "'speaker_5': 'I heard at least three votes to support a 1000 foot buffer or for the uses. I heard a desire to have more more outreach to the community and that the land use decisions should be taken to the planning board.'",
        "'speaker_5': 'I believe that there was a majority support in engaging the planning board on the land use. I heard that there was a desire for us to look seriously at the onsite consumption, relative ease of the parks and multi-family residential so that onsite consumption may make sense relative to those issues.'",
        "'speaker_5': 'There were at least three three council that I heard in there, and then I heard that there was a desire not to have the police department head up the operator permit piece of what was proposed as a term to part permit the land use permit and the operator permit.'",
        "'speaker_5': 'But it sounds like there's a desire to see those those two types of permits administered by the Community Development Department or another department that's not a police department. Those were issues where I heard a broad majority for the first go around.'",
        "'speaker_5': 'I think that the discussion started to then look and go towards dispensaries and whether or not medicinal dispensaries made sense at this point. One thing, there was a lot that we wrote down. There were a lot of notes, a lot of things that were being asked to go back and research.'",
        "'speaker_5': 'One thing in terms of keeping momentum going that you might want to consider is a ban with a hard sunset date which keeps people, which keeps staff and the counselors in the communities kind of feet to the fire to keep going on this, but gives us the time that we need to do it right.'",
        "'speaker_5': 'That's a possibility. That is what some jurisdictions are doing and they're putting in a hard sunset date so that we would keep working towards a goal, but that we wouldn't have to really I mean, we could not come with all of the work that's being requested.'",
        "'speaker_5': 'October 3rd staff reports were due last Thursday in terms of our internal process within City Hall and how we work as staff. So our ability to really tackle what we heard this evening and and evolve consensus and work with the Council to get to consensus.'",
        "'speaker_5': 'That it's a daunting prospect to do it over the next three, three months. So you might want to consider directing us to look at a band with a hard sunset date and that. Could keep us then going. It's a suggestion.'",
        "'speaker_1': 'All right. So in regards to so you had said lab testing in manufacturing is no manufacturing in testing yet. That's what you'd said right there where you thought you had three. Want to ask council now? If I heard member matter.'",
        "'speaker_1': 'I see you raised medicinal dispensaries. Yeah. So I would be supportive of that.'",
        "'speaker_3': 'I think I heard four on that.'",
        "'speaker_1': 'Okay. So medicinal dispensaries, two comment. There's four of us that I hear. Are you supportive of that? I have a question. So I think that we need more input. So we're talking about medical dispensaries. And is that the on site usage that you're also contemplating?'",
        "'speaker_1': 'So I think councilmember matter. No. So we're branching off into recreational and on site.'",
        "'speaker_4': 'Know, I haven't have we haven't had that discussion.'",
        "'speaker_1': 'Okay. I just. So right now, I was going to say I would want more input to on the public safety aspects of that of how people get to and from and also the locations. I think that's really important.'",
        "'speaker_1': 'So but I also feel like we're sending staff out in a lot of different directions. So I want to ask council distribution, do we have three that want that added in member odor? You're right, other cities have done this.'",
        "'speaker_0': 'So this this is we're.'",
        "'speaker_3': 'Not reinventing the wheel.'",
        "'speaker_1': 'Right. So I'd like to see if we have three to include distribution.'",
        "'speaker_4': 'Yeah. I'm an American. Yes, I make a comment on that before I abstain or whatever you want to call it in this kind of straw vote thing is that one of my points was about the cash and I still don't have an answer of what is happened in other jurisdictions relative to this list of activities, to how'",
        "'speaker_4': 'many police calls happen to go with the cash that's along the supply chain here. We don't know that. All I know is the odd things that make the newspaper and that should be a consideration, too, is what kind of risk.'",
        "'speaker_4': 'Because until until there's a banking system, there's we we can answer all these questions. It's all well and fine. But if you got people who are not paying into the Social Security or we have no verification of their salary if we've got piles of cash that put.'",
        "'speaker_4': 'People at risk for armed robbery. You know, I want to know about that and talk about those risks in a forum like this so we don't have that information. We can rattle this list off and it it's that part's uninformed.'",
        "'speaker_0': 'I mean.'",
        "'speaker_1': 'No, I'm sorry. We're not. However, I feel our staff's my understanding that employees do pay into Social Security staff or expert. Mr. HALL, can you answer that question?'",
        "'speaker_6': 'Yeah, I knew this question would come up. And so I checked with the dispensary owner up in the city of Shasta, like her solution had been to hire a temporary firm that does that. But most dispensaries that I'm aware of.'",
        "'speaker_0': 'That that's.'",
        "'speaker_4': 'What that's what.'",
        "'speaker_6': 'The temporary firm they just pay they hire the employees from the temporary firm pay them a gross the firm pays the Social Security.'",
        "'speaker_4': 'Tax. I mean, these people get all their.'",
        "'speaker_6': 'Money for a long time doing this. Yeah, the others actually send in their tax payments because even under 80, you have to make your tax payments, your Social Security payments, so it gets made. And it's not that it's not happening.'",
        "'speaker_6': 'One of the things they also do is they meet them in the bank with the payment. They make the payment into the city's account in the bank, sign a receipt for it and move out. So there are a variety of solutions for that.'",
        "'speaker_6': 'And I'm not saying it's not a cash business member already.'",
        "'speaker_3': 'I mean, I, I, I don't know what the federal people do, but I know on the state level that the BOA actually makes them take their cash to San Jose and make their deposit. So that's and the Franchise Tax Board.'",
        "'speaker_3': 'So, you know, they're doing that. I mean, that may the other thing may sound like money laundering but you know, I see. Ah, I be that's what some of these garbage people were doing in San Leandro to avoid the minimum wage laws.'",
        "'speaker_3': 'So we fix that and we fix that. But I mean, it's. Yes, not great. I'm let me finish. Sorry. I mean, it may not be the greatest thing. I mean, but it's technically legal. But I do know that they do that.'",
        "'speaker_3': 'But we do need to hear the answer to cuts over matter. These question are more than just me or. Someone from the audience member Ashcraft.'",
        "'speaker_1': 'Thank you. So, yeah, that that does concern me. And this is not something that you would know. Mr. HALL But several years ago, as Mr. Ramirez mentioned, there are are recycling workers from the company that our city contracts with.'",
        "'speaker_1': 'They were being hired through a temporary agency. Temporary. Some of them were working there 12, 11, ten years. Temporary agency means you don't get vacation pay. You don't get sick pay. You don't get time off for holidays. And these people were barely making ends meet.'",
        "'speaker_1': 'I mean, not only can they buy their cars now, they're not living in their cars. So I think I that's and my concern, too, with getting into the dispensary business now before some of these issues are ironed out, is that we don't quite know how we're going to handle the cash, whereas a laboratory and a or manufacturing'",
        "'speaker_1': ', it's less amounts of cash coming in, some of them because it's testing, it's not purchase. It's actually was done by credit card payment because that question came up at the seminar I attended. So I just I think we might be getting a little ahead of ourselves not and I'm with you, Mayor, we don't need to take forever'",
        "'speaker_1': 'and the hard deadline and, you know, maybe a temporary ban will, but we'll give staff the time to research these many questions we raised. But I cannot support something that brings employees back through a temporary agency. So I don't think that's necessarily what the businesses would be proposing.'",
        "'speaker_1': 'But I want to get back to the direction that we are giving staff. Yes.'",
        "'speaker_2': 'What I'm hearing is there's more information that the council wants about delivery and the cash business. We are still working on this. Why don't we come back with options for the Council to consider? And we already have the other list that Debbie already talked about, which is already a big lift for staff.'",
        "'speaker_1': 'So I appreciate that. I just want to make sure we are adding as many types of businesses to this list that we can. I actually don't think there should be such a heavy lift for staff. I think you can look at and we have you hired an expert, a consultant to help you.'",
        "'speaker_1': 'He is very familiar with this. There are many cities you can look at and how to do this. So I just want to make sure manufacturing, testing, we put medicinal dispensaries on that list. We have three people that would be supportive of that.'",
        "'speaker_1': 'Yeah. Library staff comes back though as at the initial at the initial phase.'",
        "'speaker_3': 'I mean, the proof is as the I'm sorry customer matter, he said when somebody is in the 300 foot radius, whether or not these 66% numbers stand up. But, you know, that's a decision. I think we we let the planning people take care of that decision.'",
        "'speaker_1': 'Okay? Yes. Okay. And then on the third. So go ahead. Call it ask for direction on the medicinal dispensaries. How many of us are supporting.'",
        "'speaker_7': 'I guess from my perspective, it seems like and the reason I'm saying that I really feel it's important to bifurcate. I guess the lab testing manufacturing portion from the dispensary portion is that there seem to be a number of outstanding questions relative to the dispensary and direct retail salesperson.'",
        "'speaker_7': 'And I feel that that in and of itself could be a separate item that we look at. Separate from the manufacturing and the testing site, the testing portion of it, just because we we still have to have the conversation about the different processes, the conditional use permits relative to retail.'",
        "'speaker_7': 'There's a number of issues that are still coming up. I'm not saying that we don't talk about it, but I'm just.'",
        "'speaker_1': 'Wondering, can they be parallel tracks then? Are you saying so we could do manufacturing testing on one.'",
        "'speaker_0': 'Proposal.'",
        "'speaker_1': 'That they could also come back with medicinal dispensaries that we could look at?'",
        "'speaker_7': 'I guess my question my question to staff is really how much how many other things? And this goes back to councilmember mode. Rossi's question earlier, which is how many other things are going to not get dealt with that we have that are pending that we've given already given direction on?'",
        "'speaker_7': 'So if we're going to look at this, is there, you know, how much time is it going to take to really look at both aspects of this? Is there one that's easier to roll out? Could you work on both of them in a parallel way?'",
        "'speaker_7': 'But what's the timeline for things? And I think that that's information that we'll get when staff comes back to us.'",
        "'speaker_1': 'And just and I'm wondering about distribution, if that is something that is similar to the manufacturing and testing in regards to staff time, if that if that's something that we could also consider distribution and if we have three of us that support looking at distribution.'",
        "'speaker_1': 'We have three of us to support looking at distribution to get the answer to the question the vice mayor was asking of staff so that we have parallel tracks. Well. And what else?'",
        "'speaker_7': 'Well, and what else?'",
        "'speaker_2': 'Have a number like tonight. We have the rent stabilization that has to be heard. That starts a whole process that staff will be involved in legal will be involved in.'",
        "'speaker_1': 'Form.'",
        "'speaker_2': 'Staff. The manager's office planning will be involved in. We have the inclusionary housing ordinance that council has asked for. We have a number of development projects that are coming forward, all that take a lot of focus on the same individuals who are looking at this tonight.'",
        "'speaker_2': 'And so, again, we've talked about priorities and are the priorities. Is this the priority or do you want a more thoughtful process that gives us another six months to look at this or four months or whatever number the council wants and know that there are other priorities in the list that's on the agenda tonight.'",
        "'speaker_2': 'Of all the referrals, the 23 referrals that this council has asked for and so.'",
        "'speaker_1': 'So I heard six months. Well, that number matters.'",
        "'speaker_4': 'Also, I think this council already prioritized these. And if I remember correctly, this one is lower than inclusionary housing, lower than the homeless and lower than the other housing issues. So that I'd like I'd like to get a real number, not a not a not an arbitrary number of six months.'",
        "'speaker_1': 'And I well and I want to clarify, when we did the priorities, that was prior to me bringing another referral.'",
        "'speaker_4': 'But but still that was a vote by council and it was official until we have that vote to overturn it, then that's the priority. So we have to stand by what we voted for. We're moving along on this.'",
        "'speaker_4': 'We had a good discussion tonight. I think I make a motion that we the direction give staff is take what Ms.. Potter listed as the as the commonalities with a majority of votes. Take the other notes that were input from all of us and to the community.'",
        "'speaker_4': 'Synthesize that come back with us and to us with the next step in a time that meets the priorities that we addressed.'",
        "'speaker_1': 'So which means what? Well.'",
        "'speaker_4': 'Can you give us a time? So that's my motion. So I have a second.'",
        "'speaker_1': 'Can I just get clarification on what it was that you said, Ms.. Potter? So I want clarification in regards to the time. What are we talking.'",
        "'speaker_0': 'About in the question?'",
        "'speaker_5': 'So we are probably talking about the first council meeting in November.'",
        "'speaker_3': 'Yeah, inclusionary is on. The next agenda is.'",
        "'speaker_5': 'To come.'",
        "'speaker_2': 'Back, but not the final product.'",
        "'speaker_4': 'Proposal.'",
        "'speaker_5': 'Right? Not not the final product. And if you if you kind of do the kind of do the math in terms of how many meetings are going to have to be held, we will not be we will not have an ordinance prior to January 2nd.'",
        "'speaker_5': 'So at that, either now or in November, you may want to give direction about Banning with a hard sunset in conjunction with the work that that we're going to be doing with the revised ordinance.'",
        "'speaker_3': 'I mean, at this rate, we're going to have extra meetings in September, October.'",
        "'speaker_1': 'All right. So I personally think a question on the November so yes. Member Ashcroft. So one thing I was thinking and this is 2020 hindsight, I did think that 530 to 7 p.m. was kind of an optimistic time estimate for this time.'",
        "'speaker_1': 'But I think we've had a really good discussion, heard lots of good speakers. I think we did hear consensus on wanting to get more community input. Is it possible to do a standalone meeting? Only on synthesizing. But the community said and hearing what you've come back with, you and staff have come back with an answer to our'",
        "'speaker_1': 'questions. I'm just worried that if we and I know scheduling is tricky with five people and travel schedules and all that that I'm just thinking if we could divert a special council meeting, we might be able to knock out that first draft of the ordinance and then it prior to the November 1st.'",
        "'speaker_1': 'Well, so that we hold that date for the first reading. Well, okay, let's hear from the city.'",
        "'speaker_2': 'I mean, I just thought of an option rather than have a ban that has a hard. Sunset is that we could do a very focused ordinance that looks at manufacturing and testing and prohibits everything else. Until this council does it and we will revise it as we go through this process.'",
        "'speaker_2': 'So instead of spanning everything, we start slow with the two two categories that this council has said they want us to look at, and we'll bring that back before January one. I mean.'",
        "'speaker_1': 'He said November 1st.'",
        "'speaker_5': 'Right. And then if if that's if that kind of skinny down, phased in approach works, you could do a first and second reading and have it be effective in 30 days of November.'",
        "'speaker_3': 'First time. I'm sorry.'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_3': 'First time this idea was approached. I don't think it got a lot of favor. And, you know, I'm not in favor of that either, because it seems to me staff is trying to find a way to say no instead of finding a way to say yes.'",
        "'speaker_2': 'We're saying and.'",
        "'speaker_3': 'Yeah, but you're saying yes to just a piece of it. And we kind of rejected that earlier, if I remember if I recall correctly. And now that same idea is being rehashed after we said we didn't like that idea.'",
        "'speaker_3': 'So I'm I might be open to this hard this hard thing, but I don't want to go much past the end of the first quarter of next year on this. I mean, so that that's just my thought.'",
        "'speaker_1': 'Yes. Member Ashcraft. So I actually find the city manager's proposal reasonable. And I think if we were to decide to go that route, we could also say what the road map is for the next what we want to be the next items to add to the ordinance.'",
        "'speaker_1': 'And I would would think I mean, excuse me, I think we do our discussions in public. The but if I'm I'm hearing your concern, Councilmember Odie, that you're afraid that this will just somehow drop off the horizon and not come back.'",
        "'speaker_1': 'And I don't think that's going to happen.'",
        "'speaker_3': 'Had staff suggested twice now and the council has said no. So, well, this is what we know but that is that, you know, without and I mean no offense by this, you know, without something to light a fire like a hard deadline, I'm just afraid this is not going to get done.'",
        "'speaker_3': 'And again, it seems like three of us have said we want to move forward on dispensaries, but yet staff has twice said, no.'",
        "'speaker_8': 'Don't do that. So this is where this is where I.'",
        "'speaker_3': 'Think there's a disconnect. And I'd like to see. I like to see a path to yes on this instead of a path to no.'",
        "'speaker_7': 'So in that in that is there in that vein, I do think that it also behooves us to be realistic in terms of what. What sort of timeline we're really faced up against and make sure. I think it's fine to say let's start with those two things.'",
        "'speaker_7': 'I'm not saying I don't want you to work on the dispensary aspect of it. That's not what I'm saying. I would like work on that, but I would also like a realistic date of when we could have a more robust conversation about the dispensaries, because I think that there's still a conversation that needs to be had about'",
        "'speaker_7': 'what the process is going to be, who's involved? Is it going to be medical, is it going to be recreational? And frankly, we're not going to hear from the state if those two things can be co-located, if they can be co-located, that might change the analysis.'",
        "'speaker_7': 'For some of us, that's not going to come at the earliest until November. I don't think it's the end of the world to lay out a date of when we want to hear back. And it's not to say that we couldn't enact something by January 1st.'",
        "'speaker_7': 'We couldn't do a first and second reading in December regarding what our path forward is regarding dispensaries or what that would look like, or we couldn't do a first or second reading in January or something like that. I think I'm just frankly, I'm just worried about making sure that we're bringing everybody along.'",
        "'speaker_7': 'We're being realistic about the constraints from staff. So I think if there's a certain deadline that you want to hear the issue and really work on the issue of dispensaries, and I would frankly like to have that robust conversation with the full council at a special meeting.'",
        "'speaker_7': 'I have no problem with that, but I would really like to also give staff the opportunity to come back with all of our questions and answered with all of our options before us and what that would look like and give the community another opportunity to weigh in, because that, frankly, from my standpoint, that's where we need to'",
        "'speaker_7': 'do the most work in terms of bringing certain people along. And I would like it like to do it right, and I would like to bring as many people along with us as possible so I don't have a problem with that.'",
        "'speaker_7': 'Councilmember Ody If there's a date that you would like, a date certain to hear back from staff regarding a second portion of it, is that something you would consider?'",
        "'speaker_3': 'I think Councilmember Matt Arrestee, he asked, you know, if we were to do a hard cap or I mean, a ban that had a fixed date, what they could you bring the stuff back to us? I mean, I didn't hear an answer to that.'",
        "'speaker_3': 'I mean, is it March 31st? I mean, is it April 30th? Is it July or January 20/30? I don't know.'",
        "'speaker_5': 'Well, I mean, it's we're only one half of the equation in terms of inputting the information and then what comes back out. But it seems to me that as part of the process and people are committed to moving it through that over the next six months is a reasonable time frame to tackle this.'",
        "'speaker_5': 'And if there's a willingness to do a special meeting and do some of the things that allow us to kind of expedite some of some of the discussion and some of the direction that's helpful to staff, too.'",
        "'speaker_1': 'Okay. So is my understanding when we're giving direction, we're not actually making motions, is that correct?'",
        "'speaker_0': 'Yes, that is. But if I can just so I'm sorry.'",
        "'speaker_1': 'Well, so I want to make sure because we had a motion my second.'",
        "'speaker_0': 'Direction, you know, having a say in.'",
        "'speaker_1': 'So I am now asking the question yes, you are you.'",
        "'speaker_0': 'So it's not appropriate.'",
        "'speaker_1': 'For me to call a question. It's not proper for us to do a motion. So let's hear from the city attorney.'",
        "'speaker_0': 'I may just add something, right? Because of some of the things that have been complex like this, where we have had counsel and no offense and with all due respect, kind of all over the map, I heard a couple of councilmembers say that maybe it's good to kind of check in without coming back with the final product'",
        "'speaker_0': 'or the product that we think is closer to the final. I would suggest that we do something along those lines because my notes show that almost all of you said you were not concerned about delaying somewhat to January so we could get things done.'",
        "'speaker_0': 'Now it's changed on some of you and this is what happens. And I'm not saying it's bad, that's why you have discussion, but a lot of things are changing. So now we're being what I'm hearing is we're being told, well, let's try to buy for it.'",
        "'speaker_0': 'So we get something going, come back with manufacturing and labs. But I didn't hear caps on manufacturing in labs, locations on manufacturing. I heard it on dispensaries. So I think it would be it would help staff and not waste our time and have us come back to you with something that half of you are saying.'",
        "'speaker_0': 'No, that's not what I thought we directed. If we could do a little bit of synthesizing, come back to you to do a bit of a check in and then try to move ahead in in a phased way, if that makes sense, or if we're able to answer your questions with timelines, with those kinds of things.'",
        "'speaker_0': 'And I don't.'",
        "'speaker_1': 'At a special meeting, then, is that what you're suggesting?'",
        "'speaker_0': 'I would suggest we can't we can't introduce an ordinance at a special meeting, but I don't think we're to that point yet.'",
        "'speaker_4': 'But Madam Chair, member matter. I see a city attorney is was the motion inappropriate or not?'",
        "'speaker_0': 'So you can do a motion for direction if that's that if you're you want to do that, but that would be fine. But what you're doing is direct.'",
        "'speaker_4': 'Was out of line making the motion. No, no. Okay, I have a second. And can you a city clerk, can I have have you read the motion again?'",
        "'speaker_2': 'I had stepped away. I'm so sorry. I was in the back. I totally apologize.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'You want to repeat it?'",
        "'speaker_4': 'Yes, I do. Yes. The motion was to take the list that Ms.. Potter read of consensus. To take the input. That was heard from all of us and from the community and have staff go back and give us a second draft.'",
        "'speaker_4': 'Of this first draft based on the input as well as the consensus.'",
        "'speaker_7': 'And I. I don't know.'",
        "'speaker_4': 'Is there one.'",
        "'speaker_7': 'I don't know if Councilmember Ashcroft was trying to make a friendly amendment to ask that that perhaps occur at a. Another.'",
        "'speaker_4': 'I accept it another day.'",
        "'speaker_1': 'But I think I in.'",
        "'speaker_0': 'A.'",
        "'speaker_4': 'Special.'",
        "'speaker_1': 'Meeting I think a special.'",
        "'speaker_7': 'Meeting.'",
        "'speaker_1': 'We would have a better opportunity to talk and not keep other people waiting.'",
        "'speaker_0': 'So we have said we.'",
        "'speaker_3': 'Had a meeting.'",
        "'speaker_0': 'So we had a.'",
        "'speaker_7': 'Motion and a second and a friendly amendment.'",
        "'speaker_4': 'Yes, and I accept. Do you accept?'",
        "'speaker_1': 'So we have.'",
        "'speaker_3': 'We're still keeping the one, the 12. So deadline. At this point.'",
        "'speaker_1': 'Is, are we keeping score? That's a good question a member already asked. Are we still keeping the December 31st deadline?'",
        "'speaker_4': 'I don't think we'll know the answer.'",
        "'speaker_0': 'Until we have this week.'",
        "'speaker_5': 'We would still endeavor to do that.'",
        "'speaker_1': 'And and then I want that I'm also asked for clarification at this point. Or is the motion to move forward with the lab testing and manufacturing only? Does it include medicine and what does it include?'",
        "'speaker_5': 'It maybe it includes every taking it everything, synthesize it into a new draft ordinance, present that new draft ordinance at a special meeting where there would be an opportunity for for input and further.'",
        "'speaker_1': 'Direction each item.'",
        "'speaker_5': 'Then on the new draft ordinance.'",
        "'speaker_1': 'But would that include every type of cannabis business?'",
        "'speaker_0': 'Yes, yes.'",
        "'speaker_1': 'Yes. Well, it would be discussion to deal with it. This is. That's where it's decided. Love it. It's not.'",
        "'speaker_5': 'But it would it would talk about how it would include dispensaries with the whole analysis that's been asked for the cash business, the cap medical versus recreational. That would have all of that would be part of the synthesis we would present almost as a check in, as the city attorney was talking about at a special meeting, get'",
        "'speaker_5': 'all of that feedback and if we were much closer, we would have the potential to have that then come back as a first reading, second reading, 30 days. It's possible we could, you know, we would endeavor to meet the deadline if we missed the mark or if new issues come up or we haven't thoroughly answered the questions'",
        "'speaker_5': '. It may be that we're sent back to do more, more work. And at that point, the Council may want to reevaluate what they want to do about the the in the upcoming January one.'",
        "'speaker_1': 'So when do you think the special meeting would be? That depends on our schedules. We were going to.'",
        "'speaker_5': 'LA and within the next four weeks.'",
        "'speaker_1': 'Within the next four week.'",
        "'speaker_0': 'No, no. All right. The clerk.'",
        "'speaker_3': 'With that offer.'",
        "'speaker_5': 'Can.'",
        "'speaker_1': 'Call as soon as possible. So I heard.'",
        "'speaker_5': 'Because we would have said I.'",
        "'speaker_3': 'Can call the question to it.'",
        "'speaker_1': 'Just clarification.'",
        "'speaker_5': 'You would only we would question.'",
        "'speaker_3': 'I fully understand.'",
        "'speaker_1': 'I okay. Clarification. QUESTION Yes. Senator Ashcroft.'",
        "'speaker_3': 'The question basically takes preference, but.'",
        "'speaker_1': 'So then we have to take a vote to call the question.'",
        "'speaker_3': 'I mean.'",
        "'speaker_1': 'Yes. So then I have let me ask my clarifying. He said call the question. When that said, I actually do. So I need to ask if there's a majority of us that want to call the question. So this is not calling the question.'",
        "'speaker_1': 'This is asking if we want to call the question, all those in favor of calling the question, what's in it? All those in favor of calling the question and not allowing member Ashcraft to ask her questions is what it is.'",
        "'speaker_1': 'That's what I'm being asked to do, is cut her off. I have to ask you to do this personally.'",
        "'speaker_0': 'Is that.'",
        "'speaker_3': 'Vote no.'",
        "'speaker_1': 'All right. So that.'",
        "'speaker_0': 'That is when.'",
        "'speaker_4': 'You ask your question.'",
        "'speaker_1': 'All right. So now remember Ashcraft. Thank you. Ms.. Potter, are you also going to look at the question of caps on manufacturing and dis and testing as part of your as we.'",
        "'speaker_5': 'Will synthesize that I made.'",
        "'speaker_4': 'The comment.'",
        "'speaker_0': 'And all the.'",
        "'speaker_5': 'Comments that we.'",
        "'speaker_1': 'Heard, you know.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'All right. As you were.'",
        "'speaker_4': 'Know now.'",
        "'speaker_1': 'So now all those in favor of the motion that was member matter as these motion.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'I was that was I unanimous. Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'That's a very. And now I'm going to call a short recess. Five minute recess. Greatly appreciated.'",
        "'speaker_5': 'By the world.'",
        "'speaker_0': 'Tuesday.'",
        "'speaker_3': 'Night.'",
        "'speaker_1': 'Everyone take your seats, please. And I really appreciate your patience. We're going to get through this calendar now. The balance, hopefully faster. A special joint meeting of city. Actually, I need to adjourn that meeting. I'm adjourning the special city council meeting.'",
        "'speaker_1': 'I'm now opening a special joint meeting of city council and successor agency to the Community Improvement Commission, S.A.C.. I see. Roll Call.'",
        "'speaker_2': 'So, members here. Here they are, Spenser here. And the other two will be back.'",
        "'speaker_1': 'All right, we have one item consent calendar three. A recommendation to accept the investment report for the quarter ended March 31st, 2017. We have moved. We have a second.'",
        "'speaker_7': 'Second.'",
        "'speaker_1': 'All those in favor.'",
        "'speaker_0': 'I.'"
    ],
    "Investment Report for Q1 2017.": [
        "'speaker_1': 'Motion carries unanimously and may the record reflect member Ashcraft just joined us I will now during that meeting and now I will open the regular city council meeting and it is now a quarter to ten. 945 roll call.'",
        "'speaker_2': 'We have five present now.'",
        "'speaker_1': 'Thank you. All right. Agenda changes. I am pulling five. Oh, actually, I'm just plan to vote no on it, so I just need to reflect that. Are there any items, any other items we need to pull?'",
        "'speaker_3': 'I'm going to pull five. I'll actually vote no on it. So if.'",
        "'speaker_1': 'You're voting no on.'",
        "'speaker_3': '505l4, Larry.'",
        "'speaker_0': 'If I make council members, what I want to do is vote no. You can just record that without pulling the item.'",
        "'speaker_3': 'And I'm happy to do it that way.'",
        "'speaker_1': 'Okay. So on this, the balance of the consent calendar be approved.'",
        "'speaker_2': 'Oh, I'm sorry.'",
        "'speaker_1': 'Does your gender change?'",
        "'speaker_0': 'We're not there.'",
        "'speaker_1': 'Yet. So that's agenda changes. So it's only 500 and five L that I heard anyone speak to.'",
        "'speaker_7': 'Is it possible, Mayor Spencer, to move up at nine B to be heard after the item 60?'",
        "'speaker_1': 'Which item.'",
        "'speaker_7': 'Nine be.'",
        "'speaker_1': 'What is nine.'",
        "'speaker_0': 'It's the referral.'",
        "'speaker_1': 'So I would not. So so that's the and they would not move moving up referrals.'",
        "'speaker_7': 'To move it after item 60.'",
        "'speaker_1': 'Those there. I don't support that. Um, I actually was thinking you might say another item. Um. Ah. Is there more majority that wants to move up a referral to to before 60 or after 60?'",
        "'speaker_0': 'I wanted.'",
        "'speaker_7': 'To. So if I may, I wanted to see if we could move item 60 up in the regular agenda to be the first regular agenda item since we do need to vote on that tonight.'",
        "'speaker_1': 'Right. Yeah. I would second that motion that that's ahead of me. So is that ahead of our proclamations? Is that what you're asking, that it would be the next thing we go to? Okay. So I'm not in favor of that.'",
        "'speaker_1': 'Is anyone else in favor of that? But I mean, now she's asking to move up six d to have it be the next thing we go to.'",
        "'speaker_7': 'After the consent item, since we do need to vote on that matter tonight.'",
        "'speaker_1': 'I would support that.'",
        "'speaker_3': 'I would do.'",
        "'speaker_0': 'Oh, right.'",
        "'speaker_1': 'Okay. I think we have a vote in a second. Okay. That follows the consent calendar. Mm hmm. Okay. I thought you were asking about.'",
        "'speaker_0': 'I'm going to.'",
        "'speaker_7': 'I'm going to withdraw my referral.'",
        "'speaker_1': 'Okay. Okay. Okay. So next then I just want to confirm agenda changes. We only have five oh and five oh. We had to know about one on each of those. Any other changes are on that. Okay. So then we can move to our proclamation three, a proclamation declaring September 16th, 2017 as Coastal Cleanup Day.'"
    ]
}