{
    "Oakland International Airport Presentation on Air Traffic during Runway Closure and Fleet Week.": [
        "'speaker_0': 'Thank you. Was there a different one? All right. So five innocent, Nancy, five is Anne Frank. And now proclamation special orders of the day, three A We have a presentation by the Oakland International Airport on anticipated air traffic during the closure of runways number 12 and 34, maintenance tentatively scheduled for September 4th through September 18th, 2017, and'",
        "'speaker_0': 'during Fleet Week, October 2nd through October 9th. Thank you.'",
        "'speaker_7': 'Though Mayor Spencer and council members understand there's a presentation that will come up on the screen.'",
        "'speaker_3': 'Oh. Thanks.'",
        "'speaker_7': 'All right. Well, thank you. I'm Hugh Johnson, senior aviation project manager in the Aviation Planning and Development Department at the Port of Oakland. And I'm here to present a material about the Runway 1230 rehabilitation project we have planned for September.'",
        "'speaker_7': 'I'll try to go through the material relatively quickly. If you have any questions, please let me know as we go along. So first I just want to indicate this is a project that we do every 15 years or so.'",
        "'speaker_7': 'It's a payment rehabilitation. We have an asphalt concrete runway that requires an overlay and at the same time, it needs a runway light rehabilitation as well. So the lights typically last 30 years. In this case, we have a series of runway, centerline and edge lights that also have to be repaired in sequence and just in advance of'",
        "'speaker_7': 'the paving project. We have a few images here that indicate the current condition of the runway is already cracking and we're doing regular maintenance on a weekly basis. But we've reached the point where we have to do an entire pavement overlay.'",
        "'speaker_7': 'This image depicts the entire south field, a pair of runways, and then the two images on the bottom depict either end of the runway. So what you see above is in yellow. It's a temporary runway that we will build using a a taxiway for the main runway, and that temporary runway will be used while the main runway'",
        "'speaker_7': 'is being paved. This is a rather unique approach to doing these types of projects, and it was brought to our attention, our air introduced 15 years ago last time we did this and owe a debt of gratitude to Alameda and to San Leandro for bringing that to to the concept.'",
        "'speaker_7': 'Quick points we've coordinated. This is essentially going to be a two year coordination and planning effort for a two week construction project. We've coordinated with a number of lines of business at the FAA and other at the ATO, ATO as well as community outreach meetings.'",
        "'speaker_7': 'We held a community outreach meeting in February. We've met with San Leandro City Council a couple of weeks ago here today, and we've made ourselves available for community groups or neighborhoods that want more information. We've also we're also doing outreach through our regular aviation stakeholder committee meeting.'",
        "'speaker_7': 'We have one coming up, I believe, next week. We will touch on this in the Noise Forum. And I think there's a Fleet Week presentation also scheduled for a couple months from now. And I mentioned the tax away, which is an alternative approach to performing the work.'",
        "'speaker_7': 'And our intent is to do the painting for two weeks in September. I'll just go through this very quickly. So this colorful graphic depicts essentially a weather chart for the months of the summer months. And as you can see, we have a real advantage to doing this project in August or September.'",
        "'speaker_7': 'After that, the likelihood of rain starts to pick up. And we don't want the rain overlap with when we're doing especially the markings or even just the paving and light work. This is a graphic of the entire airport.'",
        "'speaker_7': 'The main thing I want to highlight here is we will have all departures still in Southfield. And but we will have a few large aircraft arrivals in Southfield on the temporary runway. That's different from the way it was done 15 years ago, where it was just a departures only runway and all arrivals came into Northfield.'",
        "'speaker_7': 'So we're going to use our field for the larger aircraft that require the additional length that we'll have in Southfield on the temporary runway. We have a longer runway, even on a temporary runway in Northfield. There's a lot of numbers here.'",
        "'speaker_7': 'The main thing I want to point out is on the left, the arrivals for Northfield, there will be 108 commercial jet arrivals and all of the heavy jets will arrive in Southfield. And and then about 60% or so of the commercial jets will arrive in Northfield, and the remainder will be able to be accommodated in the south'",
        "'speaker_7': 'on temporary runway. This is a maybe a familiar graphic for the noise forum. It shows a typical 65 C.M. Contour for the airport. And this next graphic shows how it will change representative life for those two weeks. And as you can see, there'll be a minor shift in self-heal, fewer operations in Southfield.'",
        "'speaker_7': 'And then you see the extent extended noise contour in Northfield, mostly due to the arriving aircraft in Northfield. A very, very minor extent into the golf course area and some of the communities there. And then on the whole roots, the focus has been to make sure that we keep our roots on 98th Avenue.'",
        "'speaker_7': 'There have been some recent discussions about a possible access point off of Harbor Bay Parkway, and we're still in discussions on that to determine where that will come out. And last point I want to make is that we are reusing the asphalt grinding from the runway on our stability berm and essentially reusing all of that material.'",
        "'speaker_0': 'Thank you. Any questions? Council members. So I want to thank you, Mr. Johnson, for coming down here and making this presentation. Thank you for sharing it.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'All right. Next, we have coverage. We have a motion for the consent calendar. Accept items.'",
        "'speaker_2': 'If0 we have oral communication.'",
        "'speaker_0': 'Or I'm sorry, work oral communications, not agenda. Do we have any speakers on that?'",
        "'speaker_2': 'We have three speakers. Oh. Okay.'",
        "'speaker_0': 'Okay. The first one is for a referral to be heard this evening. I see it didn't have a name on it. If someone recognizes this writing, they can come on up and speak. I'm sorry. Could the lights be turned on?'",
        "'speaker_0': 'All right. I know it's Vernon, and then go ahead.'",
        "'speaker_2': 'I know that we might have a chance to be heard later on tonight, but if the city council meeting has to go past 1030.'",
        "'speaker_4': 'I would really hope that we could.'",
        "'speaker_2': 'Actually have our the referral heard this evening.'",
        "'speaker_0': 'Thank you. Gray Harris.'",
        "'speaker_6': 'Stepped out.'",
        "'speaker_0': 'Ken Petersen. Gray hairs. Can Peterson. Come on up, Mr. Peterson.'",
        "'speaker_1': 'Thank you very much, Madam Mayor. Council and staff. First thing has to do with the questions of sound. We've had many complaints about people not being able to hear, and we're told that if we can't hear you, just let the assistant city clerk know and they'll up the volume.'",
        "'speaker_1': 'The other thing is they have auxiliary hearing devices and we just try and three of them and they're just marvelous. Everything is so crystal clear. They work really beautifully. We have three of them down here.'",
        "'speaker_0': 'Oh, all right. I see. We have three people modeling them this evening. Thank you.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Let us know how they work out.'",
        "'speaker_1': 'That's really dangerous. People will know what's going on. And I just did another thing that we can't fix, and that is when people are talking, they turn aside. You can't hear because these are directional likes. And so if somebody's going to talk, you need to talk into the microphone and not lean back or off that way or'",
        "'speaker_1': 'talk into the lectern. As far as the sound of the people sounding like they're mumbling with a mouthful of mush, there isn't a lot that can be done about that. I think that's inherent in the system, and I don't think that it used to be like that.'",
        "'speaker_1': 'We have a new system so as to improve it, but going back ten years ago and things were much better.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'So that's the kind of opening things that the housekeeping. But I want to talk about things that happened the first meeting in June. And good thing I didn't come to the next meeting because I would have said among a number of intemperate things.'",
        "'speaker_1': 'But I'm going to talk now about yourself. Madam Mayor, I'm going to use the third person because it's talking about you. And what happened here is that you have been subject to scurrilous attacks, vilifying you. And they're false.'",
        "'speaker_1': 'They're not at all true about and about you or your record. Back in 2009, the school board when you were a member, had an option to have an anti-bullying program, and the anti-bullying program was supposed to take care of all students of what are called those media, California protected classes.'",
        "'speaker_1': 'Those are people with disabilities, national origin, ethnicity, race, religion, sexual and gender orientation and sexuality. All of those are required. They're also required to be addressed and taken care of. And so all students are protected under Title nine in the Department of Education, the United States Department of Education.'",
        "'speaker_1': 'Now, the things that were proposed was it classes for only one group of those protected students, and they excluded everyone else. Now, the mayor at the time, the school board member, was urging the inclusion of all of the classes and particularly the racial and religious.'",
        "'speaker_0': 'Thank you. Your time is up.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'I appreciate that. Gray Harris, is she here? All right. Thank you. Then let's move on. Do we have a motion for the consent calendar excluding five, F and five? And as in Nancy, that were pulled?'",
        "'speaker_6': 'I will the approval of balance of the consent calendar.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'All those in favor. Motion carries unanimously. Thank you. Five f.'",
        "'speaker_2': 'Recommendation to award a five year contract for an amount not to exceed a total.'",
        "'speaker_0': 'Five year.'",
        "'speaker_2': 'Expenditure of $8,264,931.69 to West Coast Arborists Inc for.'",
        "'speaker_0': 'Citywide urban.'",
        "'speaker_2': 'Forest maintenance services.'",
        "'speaker_0': 'Vice Mayor Pull this. Did you want to speak to it?'",
        "'speaker_4': 'So I had one question that I'd asked the city manager about earlier that was answered, which was why the total expenditure of $8 million. And that's because it's there's an option to extend for four years under the term.'",
        "'speaker_4': 'My second question has to do with why the golf fund fund to 80.5 is being included under the financing for this provision? And if and and how much of that how much how much of the funds are actually going to be used for this and if it includes maintenance of trees at the golf course.'",
        "'speaker_1': 'Good evening, Madam Mayor and city council members. We're asking you to basically approve this avoiding of this contract and the numbers actually, as you mentioned, the 10% contingencies that explains and the five year contract, which means that what those numbers are the way they are as far as the golf.'",
        "'speaker_1': 'The golf course. This is something that is within the. As far as I understand it, it does cover the the trees in the golf course areas. And there is also the there as you can see, there's some private trees that are belong to that are within jurisdictions of what used to be.'",
        "'speaker_1': 'And and there's also the work that is other work that is done for parks and recs. So it's in the contract.'",
        "'speaker_4': 'So that so the trees in the front, the golf funds being used is how much?'",
        "'speaker_1': 'So I'm I have to look at the numbers. I don't have the numbers right on the top of my head.'",
        "'speaker_0': 'But so is success will.'",
        "'speaker_8': 'Be pro-rated by the number of trees and the funding associated with it.'",
        "'speaker_4': 'Okay. And then I thought we have a contractor that's taking care of the golf course. Does that contract not include maintenance and care for the trees there?'",
        "'speaker_1': 'That's something that I would need to get back to. I don't have the actual information on that.'",
        "'speaker_8': 'These are probably under the city's jurisdiction or it.'",
        "'speaker_0': 'Can we have public commons sized.'",
        "'speaker_8': 'Cities, trees at the beginning?'",
        "'speaker_6': 'Perhaps someone might want to take out a public speaking slip.'",
        "'speaker_0': 'To speak on the item. You need fill slips or. You need to fill out a slip if you'd like to speak on it.'",
        "'speaker_4': 'I would like clarification relative to this before I feel comfortable signing off, because I think that there has been questions about the usage of golf course funds in the past for things not having to do with the golf course.'",
        "'speaker_4': 'So I would like to understand and get information.'",
        "'speaker_1': 'Right. Unfortunately, I understand this staff report is not clear enough on that. I need to get talk to your staff and get back to you.'",
        "'speaker_0': 'So if there is someone that could help address the answers, it'd be nice if they could fellowship it.'",
        "'speaker_6': 'So I guess Mary Ashcroft, if first of all, may ask the city manager, city manager, is this is this time critical?'",
        "'speaker_3': 'Yes, it.'",
        "'speaker_6': 'Is. Actually, it is. Yes.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_6': 'So. As much as I appreciate potential Golf Commission members speaking, I think for the basis of my vote, I probably need to hear more information from staff.'",
        "'speaker_2': 'But I.'",
        "'speaker_0': 'Could you speak into the mic if you'd like to comment, please?'",
        "'speaker_2': 'Well, I was just thinking maybe we can just table this one and we can do a little research internally, and then we can come back to you tonight for an answer to that. Tonight?'",
        "'speaker_1': 'Yeah, I may be able.'",
        "'speaker_0': 'To do that. Well, we do have one member of the public to speak.'",
        "'speaker_6': 'And I'm sure he'd be allowed to speak then, too, unless you want to go.'",
        "'speaker_0': 'I'll take my comment as appropriate, so I'll go ahead and call Joe Van Winkle.'",
        "'speaker_1': 'So I believe the amount is actually indicated far down in the contract. If you read the details. And I think it's about 90 $600. And it's not actually my understanding is it's not actually for anything on the property, but rather adjacent to the property on Otis that runs along the golf course.'",
        "'speaker_1': 'And I think this has to do with the historical negotiation of that agreement. And I'm sure if staff gets a chance to to look at it, they'll be able to verify that.'",
        "'speaker_0': 'Can you all hear if you can? I hear you need to raise your hand. All right. I need the sound turned up so we can hear.'",
        "'speaker_1': 'I can speak.'",
        "'speaker_0': 'Louder. Thank you.'",
        "'speaker_1': 'Okay. So, first of all, in the very small print, at the bottom of that contract, way down below, there's an attachment that has all the amounts for all the different line items. And you'll find something down there. I think it's 90 $600.'",
        "'speaker_1': 'It doesn't specify that it's coming out of the golf fund. You have to kind of.'",
        "'speaker_5': 'Infer that by the location. But it's basically the strip of property that is adjacent to the golf course. It's not on the golf course. It's the Otis.'",
        "'speaker_1': 'I think it's Otis as it runs along there. And as part of that contract agreement, they made the contractor contribute some amount for maintenance around the golf course. So that's kind of like a business park amount.'",
        "'speaker_0': 'Thank you very much. All right. So that's five F. So as staff. So do we have a motion to accept this at this time? To approve it?'"
    ],
    "Contract Award for Citywide Urban Forest Maintenance Services.": [
        "'speaker_6': 'I appreciated the assistant city manager suggestion that we. Moves a little later in the. In the agenda.'",
        "'speaker_0': 'Okay. So I'd like to move that. We accept this. Your second. All right, then it fails. So then I don't know what you.'",
        "'speaker_8': 'You want to make a motion to consider this towards the end of the evening?'",
        "'speaker_6': 'I would be happy to make that motion. And I was just asking the assistant city manager if you would give me a little information about where you'd like to put that at the end of the regular calendar.'",
        "'speaker_0': 'So my preference would be that it be after nine A so that we can hopefully get to my referral tonight. It shouldn't take this much time to approve this contract. And honestly.'",
        "'speaker_6': 'Questions are supposed to be asked in advance. So. And of course, that applause will take a little time, too. No, I'm just saying move it to the end of the regular agenda.'",
        "'speaker_0': 'So I appreciate that. But this is supposed so there's a motion as there is starting to move it in front of nine is the motion. There a second.'",
        "'speaker_5': 'The motion is to move it to the end of the regular drive. So that would be after six D?'",
        "'speaker_6': 'Exactly.'",
        "'speaker_0': 'So it would still be in front of nine? Yes. I just want to clarify Frank's motion. So there's no wasn't my motion member. Guess you would be the third.'",
        "'speaker_6': 'Yeah, but, Mayor, I hear what you're saying, and I'll try to work toward getting to your item.'",
        "'speaker_0': 'I just say, in the future, we are supposed to try to submit our questions in advance. So we have a motion that was our seminar emotions back and all those in favor of my motion carries forward the one I oppose.'",
        "'speaker_0': 'So five and.'",
        "'speaker_3': 'A.'",
        "'speaker_0': 'This is on the to. Do we have any public comments on this?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Could you please pass those and staff. This one was on consent. It was pulled. I'd like to go forward with the public comments at this time. Thank you. And if I could ask staff to bring up the slips that we have them ready to go.'"
    ],
    "Ordinance Amendment on Accessory Dwelling Units Regulations.": [
        "'speaker_0': 'I need to get through this meeting. Thank you. So if you can look ahead. I need to keep going. Mr. Buckley, did you turn in a slip right there? Okay, well, then that goes at the end. Everyone that wants to speak, you need to turn in your slips.'",
        "'speaker_0': 'I call them in the order. So who turned in the first slip? And who turned in the first if you gave me two piles.'",
        "'speaker_2': 'Up. Ever a.'",
        "'speaker_0': 'Whatever it is that you gave me to pass.'",
        "'speaker_2': 'Those duties to him first, or.'",
        "'speaker_0': 'They go under. Got it. Charles Hurt HRT. Stephen Aced. And then David Baker.'",
        "'speaker_1': 'You ready?'",
        "'speaker_0': 'Yes, thanks.'",
        "'speaker_1': 'I would like to first point out that I am not against increasing available housing. I am, however, very interested in preserving the state of Alameda. The state is in, you know, the esthetics and.'",
        "'speaker_5': 'The cross cultural mix and so forth. I think what you guys are.'",
        "'speaker_1': 'Proposing, as I understand it.'",
        "'speaker_5': 'Would increase available.'",
        "'speaker_1': 'I think it's considered.'",
        "'speaker_5': 'Right to decide.'",
        "'speaker_1': 'Housing in lots where it could increase the the.'",
        "'speaker_5': 'Density to the point where it would impact traffic and decrease the esthetic appeal of Alameda.'",
        "'speaker_1': 'And in particular, I think that housing, which is added in the front of a house without having a design review, is really a poor idea. Know, one of the things that you know, among other great things in Alameda is, is, you know.'",
        "'speaker_5': 'The architecture in the area. And for you guys to propose that anyone could build, for example.'",
        "'speaker_1': 'A mobile home or a modular home in their front yard just because they felt like it without the consideration.'",
        "'speaker_5': 'Of their neighbors or a design review. I think that's really, you know, a very poor idea.'",
        "'speaker_1': 'Also, I would like to point out that 1200 square.'",
        "'speaker_5': 'Feet is actually quite a large chunk of property. I live on Caroline Street. My house is, I think, 1800 square feet.'",
        "'speaker_1': '1200 square feet is a small three bedroom house.'",
        "'speaker_5': 'That's huge. And, you know, neighbors will be impacted. So I would urge you to consider moving back your 1200 foot maximum.'",
        "'speaker_1': 'In favor of something like, you know, say 600 feet, which I think, you know, that's still quite a bit, but I think that's a much.'",
        "'speaker_5': 'More reasonable.'",
        "'speaker_1': 'Number. That's all I have to say.'",
        "'speaker_0': 'Thank you. Stephen East. And then David Baker.'",
        "'speaker_1': 'I share similar concerns with the previous speaker and has to do with the fact that the. Relative size of remaining 1200 square feet can become excessive in relationship, especially on the smaller lot.'",
        "'speaker_0': 'Thank you, David Baker. And then Scott Brady.'",
        "'speaker_1': 'The issue is whether or not there should be public input in design review for second dwelling units up to 1200 square feet. The answer is a definitive yes, because we all make mistakes and thus our democratic institutions are designed for public input, since everyone, even with the best intentions, makes mistakes.'",
        "'speaker_1': 'In my world. And this will cause a chuckle with all the carpenters that are in the audience. The mantra is measure twice. Cut once. Since I'm a pencil pusher all day, every day, I put a mental magnifying glass to documents.'",
        "'speaker_1': 'But the problem is that this is a form of tunnel vision. Which creates a different set of blind spots. The situation is made even worse by the fact that so many documents are produced and read on computer screens.'",
        "'speaker_1': 'And my experience is that print free documents are not actually read. But only scanned. If we do not have public input into a design review process, we are setting ourselves up for failure. Thank you.'",
        "'speaker_0': 'Thank you, Scott Brady. And if you all could line up so that we're ready to go, then Eric Steiger. And then Renata Frey.'",
        "'speaker_1': 'Mayor Spencer. Members of Council. My name is Scott Brady and I'm here to talk about the new ordinance or request that the maximum buy right size for new structures be limited to 600 square feet. 1200 square feet is larger than many of the bungalows in town.'",
        "'speaker_1': '1200 square feet is far larger than necessary for a elderly person and a caretaker, which is sort of been described as the ideal use for these types of things. 1200 square feet will increase density, increase traffic congestion and increase parking problems.'",
        "'speaker_1': 'Many Alameda neighbors already have serious parking impacts. Nothing would prevent an applicant from applying for a larger ADU. And if all conditions are appropriate, it will be approved. So why allow more by right density and traffic than required?'",
        "'speaker_1': 'Concerns for neighborhood density in traffic are very valid and in a city surrounded by water with limited means to leave, managing any increases in density and traffic are critical for the quality of life in the town. So I request that the limit be placed at 600 square feet.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And remember, if you can't here, raise your hands so I can ask them to speak up. Or we can turn up the volume. Thank you.'",
        "'speaker_1': 'Hi. My name is Eric Steiger. I was here when you guys vote on this before, and I just like to ask you to just reconsider a couple of points. I'm not opposed to the 80 ordinance at all. Again, just looking for a couple of I think are reasonable accommodations, one.'",
        "'speaker_5': 'Of which there have been mentioned that the maximum by right limit be limited to 600 square.'",
        "'speaker_1': 'Feet. One of the arguments that staff gave of why 1200 should matter is it would only affect 15% of the housing stock. I find that sort of a double edge argument because if it's if it has limited effect, why not have those extra.'",
        "'speaker_5': 'Steps in it for it? Because when it does happen, you know, you want that for all the reasons I mentioned, we want that additional review. Have the public have a chance.'",
        "'speaker_1': 'To have a say in it, but just making automatic just because it only applies to.'",
        "'speaker_5': '1500 homes doesn't seem like a good argument.'",
        "'speaker_1': 'And the other thing is, just from what I understand, the way that the audience was actually worried, the language about design is still somewhat vague. It doesn't say clearly that it.'",
        "'speaker_5': 'Will adopt the current buy right design.'",
        "'speaker_1': 'Guidelines. It's somewhat subjective with respect to detached units are not available from the street. And when this was discussed before, I don't think staff really made that clear. It made it sound like it would absolutely be applicable to the current design guidelines.'",
        "'speaker_5': 'That's not the case where it is right now. Thank you.'",
        "'speaker_0': 'Thank you, Renata. And then Nancy heard in the Nancy Gordon.'",
        "'speaker_2': 'Hi. My name is We're Not Afraid and the risk of repeating what we've heard from the previous speakers, I just want to express my support for their points, specifically in the increased density, the parking challenges, and the access to and from the island.'",
        "'speaker_2': 'And as well as the increased coverage of open space on any given lot if size edu of 1200 square feet were to be added to many of these units, we would lose a lot of our permeable surfaces and the benefits of those.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Nancy Hurd. And then Nancy Gordon. And then Jim Smallman.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_2': 'Alameda has no shortage of developers who want to build market rate housing in Alameda. Few units are affordable to Alameda teachers and service workers who want to live here. I looked at Craigslist over the weekend to see how many units are currently available for renters in Alameda and found that only three were less than $2,000 for a'",
        "'speaker_2': 'two bedroom and few one bedroom units for this amount. An average square foot for a two bedroom apartment is 700 square feet. I don't think 2000 is affordable for teachers and service workers. A 1200 square foot adu is the size of a house and would probably rent for about 3500 a month.'",
        "'speaker_2': 'You have an opportunity to open up some new housing avenues to teachers and service workers and still provide more housing to these citizens while reducing traffic on the roads that they travel to come to work each day. I request that you reduce the square footage of the Adus to something that will lead to more affordable housing.'",
        "'speaker_0': 'Thank you, Nancy Gordon and then Jim Smallman.'",
        "'speaker_2': 'Mayor and council. Thank you for the chance to speak. Now, I've been in Alameda since 73 property owners and 75 realtor realtors since 78. And I've seen a lot of properties seeing what people have done and the care that they take, or perhaps sometimes lack thereof.'",
        "'speaker_2': 'Also, there's been an ordinance for parking that you couldn't park within the first 20 feet of your property for many years. Have any of you ever seen it enforced? No. And when you look down the streets, if it were enforced, you couldn't find parking.'",
        "'speaker_2': 'Okay. So at least most of these cases that I've seen aren't tandem. If you start getting tandem parking and then you don't pay attention to people who are putting concrete in their front yard, and you can end up with, you know, the old song.'",
        "'speaker_3': 'From the.'",
        "'speaker_2': 'Sixties of parking lot. Everything's going to be turned into a parking lot. And if when you have tandem, it's very difficult unless everybody on the property has a key to everyone else's car. What if you suddenly need to go someplace or someone's pregnant has to get the hospital or whatever other situation arises?'",
        "'speaker_2': 'Very, very difficult. And it could be life threatening. I also think 600 square feet is plenty. Your average starter at her house is around 1000 to 1300. And you can have. Seven more people and depending on their ages, you could have seven more cars on someone's property.'",
        "'speaker_2': 'In addition, I've let people stay in my house for the last 12 years or so because they can't find another place. I've taken them in as housemates. Most of them have cars. I appreciate being able to do that.'",
        "'speaker_2': 'I appreciate them being around. It's still an issue when you have to put the cars on the street with everybody else's property. There are a lot of future ramifications of this.'",
        "'speaker_3': 'See.'",
        "'speaker_2': 'A year ago I asked my tenants in a nine unit building on Central. It's a deep lot joy to add more parking. Or do you want a greenbelt? You want landscaping? They all said We want landscaping, we don't want more parking, which means there's only room for one car per unit.'",
        "'speaker_2': 'And if there are two people there, which there are in several units, they have to find street parking. They're willing to do that because they want the quality of a yard. They want the green, they want the trees.'",
        "'speaker_2': 'They just don't want a lot of parking. Also, visitors don't follow the rules. My tenants are really good watchdogs and they tell me when someone's friend is parking there. So not only do you have the people who live on a property in that building, but you have visitors and sometimes there's more than one, right?'",
        "'speaker_2': 'So it's very, very difficult. The tiny houses that I've seen in Portland where my daughter lives. They're in different styles. They paid attention to having variety, and they're basically. Six feet by eight. Something like that. That's plenty.'",
        "'speaker_0': 'Thank you. Moment in the Mary J. J. J. And then Chris Buckley.'",
        "'speaker_1': 'Thank you for the opportunity to say a couple of words. I would like to disabuse some of the Council on the idea that apes.'",
        "'speaker_5': 'And I don't speak for apes as a board member any longer, but I'm a member a long.'",
        "'speaker_1': 'Time that that apes is somehow opposed to.'",
        "'speaker_5': 'Helping with the housing crisis in.'",
        "'speaker_1': 'Alameda. We have never opposed the auxiliary to dwelling units, but we we have some suggestions about how to improve it, retaining the term of Alameda that we all value at the same time and making important contributions to the housing issues.'",
        "'speaker_1': 'Number one, do not increase the maximum.'",
        "'speaker_5': 'Size of a by rite 80.'",
        "'speaker_1': 'You from the existing 600 square feet to 1200 square feet. Except for to use contained within existing building envelopes. For years, people have tried to put basement units in so-called mother in law units. And and there.'",
        "'speaker_5': 'Are any number of horror stories about how.'",
        "'speaker_1': 'People have argued with the city to try to allow it and and so forth. I think that's a good solution because it doesn't change the architecture and it doesn't improve the footprint. The other issue is design standards. And I think going away eliminating design review.'",
        "'speaker_5': 'Is a for the external buildings.'",
        "'speaker_1': 'Is a slippery slope that we should not go down, that that's that's difficult. And whatever decision is made tonight.'",
        "'speaker_5': 'Or made on this.'",
        "'speaker_1': 'On this auxiliary dwelling unit issue, we're going to have to live with, or at least my children will for 30 or 40 or 50 years. This isn't this is not something that.'",
        "'speaker_5': 'You can decide 20 years from now. Gosh, we shouldn't have done it.'",
        "'speaker_1': 'Because it's too late then. So I want I want you to consider it carefully before you go ahead with anything over 600. And I did have one only slightly. Spacey's argument. And that is, if we could take the backyards of some of the council members here and stake out a 1200 square foot building just to show you'",
        "'speaker_1': 'what it looks like, because it's hard to visualize. And I appreciate that. It is hard. And if anybody is willing to do that, I think it might be a service for us all. Thank you.'",
        "'speaker_0': 'Thank you, Mary.'",
        "'speaker_2': 'And then Chris Buckley mean. Thank you. Hi. My name is Mary Yitzhak. I wanted to encourage you to require the design review for a to use and keep the size at a 600 square foot maximum if the goal and that has been a strong message lately that we need more affordable housing in Alameda.'",
        "'speaker_2': '1200 square foot units are not going to be affordable. I think that the key would be to have if you're going to have those kind of units, to have them be small. Another thought that has occurred to me is these are going to be up against the property line potentially.'",
        "'speaker_2': 'So now your yard, if you have a yard, will have potentially have a building right on the property line. And that's very different than having the setbacks. It's a completely different feel. It's it increases that sense of density and a lot more than having a unit that, you know, is is there but not so I don't know'",
        "'speaker_2': '. Looming over your own backyard which is we all know we're pretty small in Alameda anyway. And the. Having a senior moment here. The the other concern I had was that parking you know, we all we all talk about parking.'",
        "'speaker_2': 'And I wanted to share with you my experiences with that, that it's not just a complaint like, oh, gee, I can't find a parking or I have to park around the block when I visit my friend. It has been in my neighborhood.'",
        "'speaker_2': 'The main cause for police calls, restraining orders and issues between neighbors. It creates a lot of stress between neighbors just when there's difficulty parking because, you know, somebody has left their car for too long or somebody is parked in two spots.'",
        "'speaker_2': 'And, you know, I'm sure I. I don't have to tell you what all those oh, all those shapes that that takes. But the the lack and limit of parking is a big stressor in the neighborhoods. And it creates strife that you may not, you know, imagine would be occurring over parking.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Chris Buckley and Patsy Bear sitting. Time to hear him.'",
        "'speaker_5': 'Christopher Buckley with the Alameda Architectural Preservation Society. So I have 6 minutes rather than 3 minutes.'",
        "'speaker_0': 'Minutes.'",
        "'speaker_5': 'Thank you. Okay. First, we received several letters from us, most recently June 19th, and then we had an email exchange today. Our June 19th letter articulated the two main recommendations that APS is submitting concerning the 600 versus 1200 square foot law area limit and also the need for clearer design standards.'",
        "'speaker_5': 'So I'm asking we have a lot of people here who I believe are not planning to speak. And so may I ask everyone who supports AP as he has his position to please raise your hand now. Thank you.'",
        "'speaker_5': 'I'd like to walk you through a couple of points in the particularly the July 2nd letter that we sent. Again, our first recommendation of the two is do not increase the minimum maximum by right size of an ADU from the existing 6000 square feet to 1200 square feet, except for 80 use contained within the existing building envelope'",
        "'speaker_5': '. So if you are wanting to take an existing basement or another existing portion of an existing building and put a 1200 square foot A.U. in that we don't have a problem. It's just a the use that our new construction attached to an existing building or an expansion of existing building or a new freestanding structure.'",
        "'speaker_5': 'We want to make that clear. The some of the other speakers pointed out a 1200 square foot AEW could contain three or I would suggest even four bedrooms. Even a 600 square foot adu could include two bedrooms, which would be more than enough to handle the needs of a homeowner who needs assistance and have another bedroom for'",
        "'speaker_5': 'their caretaker. An 800 square foot adu, you could probably get three bedrooms into that. So going this size of buy right for 480 use seems reckless. I would like to remind you that the way the ordinance is written is that the 80 years meet the standards.'",
        "'speaker_5': 'There would be no public notification, no design review, and no use permit for an 80 use. All they need is a building permit and the related ministerial approvals. The second recommendation is Theresa maintain the existing design standards for detached edu's.'",
        "'speaker_5': 'We quote those design standards in our July 2nd letter and they are very clear and they're very ministerial in language which is consistent with a ministerial approval. They basically state for detached age to use when detached from a primary building.'",
        "'speaker_5': 'The design of the second unit, shall I emphasize, shall be consistent with that of the primary residence, incorporating the same materials, colors and styles of the exterior of the primary dwelling, including roofs, materials and pitch eaves, windows, accents, distinctive features and character defining elements.'",
        "'speaker_5': 'That's very clear. Now, if more flexibility in that's desired, it should be written in a standards based language rather than the proposed language that makes reference to doing something other than the primary dwelling.'",
        "'speaker_1': 'If there is a clearly.'",
        "'speaker_5': 'Recognizable architectural style in the immediate surroundings, what do immediate surroundings mean? Are we talking adjacent properties? Are we talking properties within 100 feet? You that needs to be clarified. It goes on to say that where the immediate context is eclectic, what does that mean?'",
        "'speaker_5': 'And no particular style of architecture is dominant. We have more subjective language. Dominant, no particular style. A greater degree of architectural variety may be established. What does that mean? This terminology, if more flexibility is desired, the terminology needs to be defined or designed review required.'",
        "'speaker_5': 'I would. There's also in the last meeting, staff had indicated that the guide to residential design would be used for this language. But this language, which makes reference to immediate surroundings, is inconsistent with the language. In the guide to residential design concerning accessory structures, which we which are use it to use are defined as accessory structures.'",
        "'speaker_5': 'And the existing language in the guide to residential design is very similar to the existing language in the current ADU ordinance, making reference to the existing building on the same lot, not neighboring buildings. Now I'd like to walk through some of the points in an email exchange, a very friendly email exchange that staff and I had earlier'",
        "'speaker_5': 'today. I've passed out hard copies to you. You know, staff. You know, we had done a survey of some neighboring communities which we provided to you. And what they're maximum by right 18th floor area is. And we know that that and the communities are Berkeley, Oakland, Piedmont, Santa Cruz, San Jose and San Leandro and Walnut Creek.'",
        "'speaker_5': 'And all of them had more restrictive. Edu maximums. Then Alameda is proposing staff subsequently brought to our attention that Hayward and Pleasant Hill are using the 1200 square feet. Although we there was some confusion on whether Hayward is actually been adopted or whether it's still a wrap.'",
        "'speaker_5': 'So at some point we'd like to have to clarify that. But still, those are outliers. And Alameda is very fragile and we believe it's reckless to go ahead with to the max on this.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'When other community.'",
        "'speaker_0': 'That's thank you mayor Marianne Bartholomew counts Rosemary McNally and then Dorie Miles. Marianne. Okay. Thanks.'",
        "'speaker_2': 'So I just wanted to thank you because I appreciate that you're taking this issue up. I think that I support the new California law. It's designed to address our state housing crisis. And I think that the city taking this issue on to hopefully incorporate some more affordable housing options for people is a really positive thing right now'",
        "'speaker_2': '. Both my husband and I are working education. We have plenty of people who cannot actually live in the cities that they work in. And I think that's really critical to sort of think about that big long term solution.'",
        "'speaker_2': 'With that said, I have been a homeowner in Alameda since the late nineties. We have a family of four living in a 900 square foot house on Briggs Avenue. So I know all too well that 1200 square foot properties are really big.'",
        "'speaker_2': 'We're lucky enough to have a long lot that has a big we have a big urban garden in the back. I have no plans on putting concrete to sort of mess out that area. But at the same time, if I did choose to actually build a structure or a secondary structure for like my parents as they're getting'",
        "'speaker_2': 'older, I would want my neighbors input. Actually, I want it to be part of the community. I do appreciate the sort of flexibility of thinking about how it fits within the guidelines. So I differ in a piece a little bit about that.'",
        "'speaker_2': 'I do think that there are plenty of modern housing options that might actually fit within the framework. So I'm hoping that maybe there is a little bit of meeting of minds and talking about sort of what what modern framework, what might work in with historical architecture.'",
        "'speaker_2': 'But with that said, I am concerned that we are not that the current ordinance proposal is seeking. No feedback beyond this, up to 1200 square feet. I do support the notion that anything beyond 600 square feet should have sort of a an input from the local neighbors.'",
        "'speaker_2': 'So I thank you for your time.'",
        "'speaker_0': 'Thank you, Rosemary McNally. And if you guys could be ready to go. And then Dorie. And then Joe Van Winkle.'",
        "'speaker_2': 'I agree with.'",
        "'speaker_3': 'Everything that Chris basically said on a number of apps. And on top of that, I have a couple of questions. Is there anything that says these new new dwelling units have to be one story? Can they be two stories?'",
        "'speaker_3': 'And could somebody build a cinderblock house in their backyard right now? I think these are really important questions that need to be answered. Thank you.'",
        "'speaker_0': 'Thank you, Dorie. And then Joe Van Winkle.'",
        "'speaker_2': 'Right. Good evening. Thank you for allowing me to speak. I've been a Alameda resident since 1983. Love the island, but my home in the East End in 1990. The neighborhood that I live in is from the architecture, joked George Noble.'",
        "'speaker_2': 'There's lots of bungalows that range from 800 to about 1100 square feet, and my home is 1060 square feet. So I know it's plenty big for families, in fact, families to live there before I moved in. So I agree with the apps.'",
        "'speaker_2': 'I think 600 square feet is a good maximum. I think the accessory dwelling units should be that accessories not 1200 square foot primary type homes. I also agree that the design review should be implemented to give everybody a chance to see what these homes will look like before they're put into place.'",
        "'speaker_2': 'I don't see any reason why we should allow our density to increase with the ADA use more than our neighboring communities and cities. Okay. Thank you. Please give give your your vote to 600 square feet. Thank you.'",
        "'speaker_0': 'Thank you. Joe Van Winkle. And then Dorothy Freeman.'",
        "'speaker_1': 'Madumere and members of the Council. Thank you for the opportunity to often citizens are surprised by actions taken by the city, whether it be a housing development or an addition or a remodel, or of course, when we had the cutting down of trees on Park Avenue, Park Street.'",
        "'speaker_1': 'Excuse me. People don't like to be surprised. No one likes surprises. Now, staff says that citizens should not be surprised. If you pay attention, there's notice, there's hearings and and you shouldn't, you know, be surprised, but not any more.'",
        "'speaker_1': 'Now we'll have 1200 square feet with no notice and no hearing and we'll have surprises. People will be upset, they'll be frustrated.'",
        "'speaker_5': 'And things could be overlooked.'",
        "'speaker_1': 'Safety issues could be overlooked. Things that when you get many eyes looking at something and somebody made a comment earlier, people make mistakes, but just more eyes looking at things, seek greater clarity and usually improves things. And we have historic neighborhoods in Alameda that are really a point of pride.'",
        "'speaker_5': 'And why would we want to put that at risk? So require the design.'",
        "'speaker_1': 'Review above 600 feet. Let there be transparency. Notify the neighbors. Let the citizens have their input. Encourage the dialog and maintain the great neighborhoods and good neighborly relations. Thank you.'",
        "'speaker_0': 'Thank you. Dorothy Freeman. And then Alexandra safely.'",
        "'speaker_2': 'Good evening and good evening, everyone. I have a 1200 square foot home in Livermore. I can't imagine.'",
        "'speaker_6': 'How you.'",
        "'speaker_2': 'Would put that into someone's backyard. I vote for 600.'",
        "'speaker_6': 'Square feet because I believe.'",
        "'speaker_2': 'That is more perfect for our neighborhoods. And since.'",
        "'speaker_6': 'Everybody else has already.'",
        "'speaker_2': 'Mentioned the rest of my comments, I will not say anything more on that. But the headphones are perfect.'",
        "'speaker_6': 'Please get.'",
        "'speaker_2': 'More.'",
        "'speaker_0': 'Thank you. All right, Alexandra. And then our last speaker on this item is Donna Reagan.'",
        "'speaker_2': 'Good evening. I would like to strongly encourage you to make it use feasible. There's clearly a lot of benefit to a design review process. It includes more people. It prevents some of the, you know, really awful things from happening.'",
        "'speaker_2': 'It also costs more and it puts a lot more risk on the project for anybody wanting to develop. To use, the simple fact is there will be a lot fewer ADA use if there's a design review process required.'",
        "'speaker_2': 'And so I'd like to urge you to think about the benefits that would be gained from having the design review process versus the benefits that would be gained from having more ADA use. How many more ideas? How? Who knows?'",
        "'speaker_2': 'But that's it. This law is coming into effect from the state because there's seem to be an awful lot of benefit to having more to use. We've had to use allowed in this city for many years. So from my understanding is that to have been approved, many people have tried to get them approved.'",
        "'speaker_2': 'I as an architect, I've had quite a few clients in my little practice asking me about it. The requirements have been too onerous, and we're talking about not changing them all that much. And so I'd like to look for it for all the benefits that the use bring, addressing the housing crisis, keeping people more likely in their'",
        "'speaker_2': 'homes because they can afford it, keeping families together, keeping older people in the communities they've lived in for a long time, and otherwise they may be pushed out financially. Like How much are the benefits of design.'",
        "'speaker_0': 'Review.'",
        "'speaker_2': 'More important than the benefits of creating more to use? The state law says it's the intent of the legislature that an accessory dwelling unit ordinance get to the important. It that the the the local ordinance not be so burdensome, excessive or arbitrary as to unreasonably restrict the ability of homeowners to create a use and.'",
        "'speaker_2': 'We're looking at changing all that much. And we've had two approved so far. Maybe something needs to change a little bit more to make these really viable for people to build. I also about the design guidelines and relating to prefab structures which I've brought up before.'",
        "'speaker_2': 'If you. I don't even know how this time review would mesh with pre-fab structures of prefab structure. It is or it isn't. Design review is all about tweaking and compromising, but you can't do that with prefab structures. So if you eliminate prefab structures, you've that's a whole other bunch of way to use that.'",
        "'speaker_2': 'You've eliminated a 600 square foot cottage isn't big enough for an accessible one bedroom.'",
        "'speaker_0': 'Thank you very much. You. She's our last speaker on this item. BUZZER Are there any other slips.'",
        "'speaker_6': 'This lady is.'",
        "'speaker_0': 'Did you turn as a speaker? Said you.'",
        "'speaker_6': 'Called.'",
        "'speaker_0': 'Me ma'am. All right. Sorry. Go ahead.'",
        "'speaker_2': 'Donna Hagan.'",
        "'speaker_0': 'Oh, okay. Good, good. Then you're the last speaker. Yeah, I'm sorry. Go ahead.'",
        "'speaker_2': 'Okay. I'm a renter here in the area. I've been here for about a year and a half. And I love I mean, it's a great place. Your issue seems like it's been 600 square feet, 1200 square feet. Whatever the square footage is, to me, that doesn't make any difference.'",
        "'speaker_2': 'The issue is we have zero tolerance on the streets for parking. And, you know, I'm not even talking about the bridges to go here and there. That doesn't make any difference. I'm just talking about street parking where you live.'",
        "'speaker_2': 'And because of that, I really think that in any kind of design mode, whatever the square footage is, that decided that there should be included in that, that there needs to be parking off street for that unit and not tandem parking, but parking, you know, if they have a big enough slot to put 600 507 on or'",
        "'speaker_2': '1200, however big their lot is, it has to be off the street because there's zero tolerance on our streets now in Alameda for any parking, it's impossible. So to add a thousand or 1200 units or whatever might happen, you're adding a lot of impact to the residents that already live on the streets of Alameda.'",
        "'speaker_2': 'So it's really important that I believe that it's critical that it be off street parking for these new units and not tandem, which creates issues that have been brought up tonight.'",
        "'speaker_0': 'Thank you. All right. She's our last speaker. Council members who wanted to go next. A member Ashcraft.'",
        "'speaker_6': 'And may I ask staff member Alan Tie to come up so I can ask him a few questions for clarification, please.'",
        "'speaker_0': 'Five questions first, Mr. Chai.'",
        "'speaker_6': 'Thank you, Mr. Chai. We heard a lot of comments, and I just want to make sure that we're all on the same page. Literally and figuratively. Would you spend some time talking about this 1200 square foot size? Can anybody decide to put a 1200 square foot edu accessory dwelling unit in their backyard?'",
        "'speaker_1': 'Thank you, Madam Mayor. Members of Council, L.A. Planning Services Manager. So the state law sets a maximum of 1200 as a ceiling for an EDU. But the requirement is actually the lesser of 50% of the existing floor area of the main dwelling or 1200 square feet.'",
        "'speaker_1': 'So in order to build a 1200 square foot adu, your house has to be at least 2400 square feet in size.'",
        "'speaker_6': 'And let me just clarify, is it your house like all two or three stories of your house add up to 2400 square feet? Or is it the footprint on the lot?'",
        "'speaker_1': 'It's a total floor area. So if you have two floors, then that that would be the gross floor and not the footprint.'",
        "'speaker_6': 'Okay. And what about a percentage of light coverage?'",
        "'speaker_1': 'So our proposed ordinance also stipulates that including the footprint of the the you and the footprint of the main building, including any impervious surfaces, including like a paved driveway, paved patio. All of that cannot be more than 60% of the total land area.'",
        "'speaker_6': 'And is there a limit to how many stories an accessory dwelling unit can be, one that's freestanding and not in the basement, obviously. Yes.'",
        "'speaker_1': 'Detached accessory buildings are current requirements are one story. No taller than 15 feet. And 15 feet is actually measure to the peak of the roof. So the side walls, there's actually a special, specific requirement that the walls cannot be more than ten feet tall.'",
        "'speaker_6': 'And what is cinderblock dwelling be allowed.'",
        "'speaker_1': 'Under the current rules? If the main house is built as cinder block, then yes, your accessory building, you're 80. You must be a cinder block wall. What staff is trying to do with the new language is to add flexibility where you don't have to do that.'",
        "'speaker_0': 'But could you answer her question? Your question was could well, you could be under the current proposal. Could it be made out of cinder block?'",
        "'speaker_6': 'So, Madam Mayor, I think I did hear the answer. If the if the main house is cinder block, do we have main houses that are cinder block in Alameda?'",
        "'speaker_1': 'Very rarely. I think there might be a few, but the answer is you would have to go through the zoning reviews via design review staff would review the proposed design of the building.'",
        "'speaker_0': 'Under the proposed ordinance.'",
        "'speaker_1': 'Under the proposed ordinance, staff would have the discretion using our city's design review manual to make a decision whether a cinder block would be appropriate. I would say in most cases we won't come to that decision.'",
        "'speaker_6': 'And you mentioned design review, and we heard a lot of comments to the effect that there would be no design review for accessory dwelling units. Can you clarify for us.'",
        "'speaker_1': 'Yes. When when surface for referring to design review? In this case, I'm referring to the lower case design review where staff is reviewing the plans. We are doing architectural review of the plans, comparing it with our design review manual, make sure that the proposed architecture and details would comply with the provisions.'",
        "'speaker_1': 'What's different about that architectural review process done by staff? Staff level with the capital? D.R. Design Review is that there's just no public notice. There's not an appeals process, and that's all stipulated under state law. The review process has to be ministerial.'",
        "'speaker_1': 'If you meet the city's requirements, which includes design standards and design criteria, then you get a building permit.'",
        "'speaker_6': 'And in the the correspondence that you had today with Mr. Bartley from the Architectural Preservation Society. And thank you for copying us on it. You made the point that in Berkeley, in Oakland, because those ordinances were pointed out, they actually allow accessory dwelling units of up to 75% of the existing floor area.'",
        "'speaker_6': 'But in Alameda, we are limiting it to no more than 50% of the existing floor area. That's correct. And in still, it would have to fall within the limitations on how much impervious surface can be, can be occupied, can be covered.'",
        "'speaker_6': 'And what about Mr. Buckley always raised this great. I don't see him, but he always raises great points and makes me think he's concerned with. I think it's a permissive language of whether you need to use the same materials as in the main house, the existing home for your accessory dwelling unit.'",
        "'speaker_6': 'Can you tell us why the language is permissive and not mandatory?'",
        "'speaker_1': 'So I should very clarify. There are different standards for the different situations. Obviously, if you're proposing to add an 80 you to the back of your house so that it's part of one building, our requirement, a proposed requirement is yes, it would have to match so that it's one building.'",
        "'speaker_1': 'I don't think there's any controversy there. The other option, obviously, would be if you were located on a corner lot or in the rare cases where your main house is built on the back of the lot and there's a lot of open space in the front in your property, that's where you're proposing the adu in the front'",
        "'speaker_1': 'of the lot. Staff is also proposing in those cases that the the on the corner lot and in the front yard that the architecture match matched the main building. But in all other cases where really you're having a detached unit in the backyard, what staff is putting in the ordinance is we look at the immediate surrounding and'",
        "'speaker_1': 'and via the amendments to the draft ordinance introduced at the last council meeting, we we clarified it by saying immediate surroundings and, and based on past precedent and how staff describes properties and immediate surrounding really means immediately adjacent buildings.'",
        "'speaker_1': 'So we would look at what is what is on the property, what is the main building look like, what do the adjacent buildings look like? And we use that as a standard to decide what the EDU should look like.'",
        "'speaker_1': 'And this is these are provisions based these are based on provisions that are already in the city's design review manual. The city's design review manual tells staff that, hey, when you are deciding on compatibility for new buildings, look at the surroundings.'",
        "'speaker_1': 'And so that's how we crafted this language.'",
        "'speaker_6': 'And my last clarifying question is talk about if in 80 you were to be built in the front yard of a dwelling, ie, there are some lots in Alameda that probably have a front yard large enough. What kinds of design review considerations applications would there be?'",
        "'speaker_1': 'So in that case, our proposed language would would say that you would have to look at the existing main building and try to mimic that character. So the same basically match the the building, the main building that's in the back.'",
        "'speaker_6': 'Okay. Thank you, Mr. TIME and reminder.'",
        "'speaker_5': 'Yes, a thank you, Mr. Tai, for clarifying that and answering the questions that were posed. I do think it's important that. There be a direct reference having heard what people. But what was this question?'",
        "'speaker_0': 'Did you have questions? Answer any clarifying questions. Sorry. Also for that, our vice mayor.'",
        "'speaker_4': 'Is there? There was a question raised about the setbacks, and I know that there's a reference to section 30, Dash 5.7 F, which includes some set back requirements and also some requirements. Are those still going to apply?'",
        "'speaker_1': 'Yes. Or how we're defining to use in audiences. They are a type of accessory building. So the section that you reference in the municipal code covers all of that. And so setbacks would apply.'",
        "'speaker_4': 'So all of the setbacks would apply. Okay. Thank you. And then my other question has to do with when you mentioned adjacent properties other than a corner building, would there be a scenario where staff would be looking at the design of a building on the street behind the house?'",
        "'speaker_4': 'Meaning the house behind the existing structure on the other street.'",
        "'speaker_1': 'Yeah. With, with AIDS and all new buildings, staff will always be looking at the design regardless of the situation. I think in the case where there might be a street behind the house. We would also factor in adjacency and from that public street what the structure would look like.'",
        "'speaker_1': 'And so those are all provisions already in the city's design review manual.'",
        "'speaker_4': 'And then relative to the footprint question, there is language that I saw that said that it must be subordinate to the footprint. So what does that mean?'",
        "'speaker_1': 'Subordinate means smaller. So we would we would ask that a for a detached building again because 80 use or accessory buildings and by definition, accessory buildings are really subordinate. They are accessory. I don't think staff would accept then, you know, 12.'",
        "'speaker_1': 'Well, the maximum size requirement already dictates that it's no greater than 50%.'",
        "'speaker_4': 'So I have a question. So if the building the total gross square footage of the building is 2400 square feet, including a second story, but the ground floor was 1200 square feet. Could the and assuming that the property was large enough and had enough permeable, short square footage and surfaces, could you build a 1200 square foot?'",
        "'speaker_4': 'Accessory dwelling?'",
        "'speaker_1': 'No. In that case, staff's response would be the proposed building is not subordinate by design, by footprint.'",
        "'speaker_4': 'Okay. And I had asked a question at the previous meeting on this issue as to whether or not we had any information. I know we had figured out that perhaps 15% would be eligible based off of the square footage of the property and the square footage of the house.'",
        "'speaker_4': 'Do we have any information relative to the impact of the permeable surfaces? That was one of my questions before was how out of those, how many would be ineligible because of lack of permeable square foot surfaces?'",
        "'speaker_1': 'Unfortunately, that's not data that we have for each property. So but what we would have to do is look into the 15% universe of 15% a little bit more. And what we found is that the majority of those larger homes are located in Harbor Bay.'",
        "'speaker_1': 'And previously I've explained that in the Harbor Bay community, it's a planned development. It's these homes are pretty much built to the maximum coverage. There's really, I would say, almost no space to accommodate a detached structure. Another about 300 units are also located at Bay Port.'",
        "'speaker_1': 'There's also some percentage of units located in the newer developments like Tri Pointe Marina Cove and where where there are strict design requirements and development regulations that I would say preclude detached ADA use. And then the remainder of lots that would be eligible for a detached 80, you would be sort of in the neighborhood of the Gold'",
        "'speaker_1': 'Coast. Mm hmm. Also and also for inside where you have large lots along the water. But a lot of those lots already have existing accessory buildings.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Member Odie.'",
        "'speaker_9': 'Thank you. My questions were kind of similar to the vice mayor's. So of this 50% number, that 50% is just based on square footage, right? That's correct. So we don't know of the actual lots. How many? I'm sorry.'",
        "'speaker_9': 'Let's go back to the the footprint thing. So the even though we say you could put a 1200 square foot adu on a lot, that includes a 2400 square foot house. I mean, the reality is, if 1200 is the first floor, it has to be subordinate.'",
        "'speaker_9': 'Yes. Right. So really that number of 2400, that 15% is like super inflated, right?'",
        "'speaker_1': 'Correct. And it's important to remember that the maximum size is really just one of a list of development standards or setbacks that the impervious surface coverage, the design criteria about subordinate structures.'",
        "'speaker_9': 'And we don't have an idea. I'm sorry I let you finish. I'm sorry. And we don't have an idea of how many of those 15% actually have ads on them now. Right.'",
        "'speaker_1': 'The the 15% to 15%. There are no ideas.'",
        "'speaker_9': 'Okay. And then do we have an idea? And I think you kind of answered this with the vice mayor's question, but how many of those that might be eligible to have a 1200 square foot adu based on the the property size?'",
        "'speaker_9': 'You know, actually, you'd be able to do that because of the permeable surface.'",
        "'speaker_1': 'Yeah. That's not something that we can figure out. We just don't have data about how much pavement people have in their yards or driveways. And and we also don't have information about all the setbacks and whether the square footage is one or two floors.'",
        "'speaker_1': 'Yeah, that's just not data that's available.'",
        "'speaker_9': 'Okay, thanks. And then the you know, we heard some concerns about parking. I mean, what to what extent can we consider parking in adopting an ADU ordinance under the new state law?'",
        "'speaker_1': 'So under the state law, one of the things that the state legislature legislature did was provide a number of situations where parking cities cannot require parking. One of which is if the ADA is located within a half mile of public transit, and that basically rules out the entire city of Alameda because we are at this point transit'",
        "'speaker_1': 'friendly.'",
        "'speaker_9': 'And then just a couple more quick questions on on Mr. Buckley's email. I think he he referenced the new ordinance and then he referenced the design manual. And it sounded like the point he was trying to make was the design manual was a little more strict than the ordinance.'",
        "'speaker_9': 'So how do we reconcile that, given that we're we're not supposed to make it unduly burdensome? Right.'",
        "'speaker_1': 'So the design guidelines are guidelines are intended to support ordinances and sort of expand on it. In this case, we have situation where the provisions in our design manuals is very specific on unnecessary buildings. And but by broadening that, adding flexibility in the code, we're actually able to open that up.'",
        "'speaker_9': 'And then I think there was a hypothetical that I mean, can we build a modular if you lived on Grand Street, for example, could you build a modular home? Edu, in your front yard?'",
        "'speaker_1': 'In the front yard, if the main building is modular?'",
        "'speaker_9': 'Okay. I don't think there are any solar. So I'm thinking like for the moment that they're not.'",
        "'speaker_1': 'So the answer would be no. Okay.'",
        "'speaker_0': 'I won't do that.'",
        "'speaker_9': 'I just want to say thank you. I'm finished.'",
        "'speaker_0': 'All right. I want to ask questions. So in regards to the new California state law requires, could our ordinance require more design review than what is being proposed? Are we? Are we allowing more homes to be approved without design review?'",
        "'speaker_0': 'More aid used to be approved without design review. Then you think we have to.'",
        "'speaker_1': 'So procedurally, the design review will still happen. But at staff level, as I had explained it, if if you are thinking about the public notification aspect of the city's current design review process, then if the ADA application meets the ordinance requirements, then no, there will not be the public notification.'",
        "'speaker_1': 'Could the city decide to insert a design review process that that would be possible, but we would have to change a lot of the provisions in our proposed ordinance.'",
        "'speaker_0': 'Okay. So I want to get back to so the comments of 600 square feet versus 1200 square feet that range. Could the city propose an ordinance that requires public notice to the neighbors or proposed to use that are 600 feet or greater and still be in compliance with the California law?'",
        "'speaker_1': 'Yes, but that basically means where we're referring back to our current ordinance.'",
        "'speaker_0': 'But that would be in compliance with the current law. Yes. Thank you. All right. Any other questions, vice mayor?'",
        "'speaker_4': 'What's the estimated cost of a publicly noticed design review versus the internal staff design review?'",
        "'speaker_1': 'So the way the ordinance is written is if you don't meet the requirements and you have to go through the design review, it's design review plus a use permit. So a use permit costs 1600 dollars. Design review is also about another 600.'",
        "'speaker_1': 'So.'",
        "'speaker_4': 'Okay. And relative to what staff is considering, you said you don't have the data relative to the permeable surfaces or the setbacks. Those would those be things that staff considers as part of their design review process?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'And Brody, did you have questions?'",
        "'speaker_9': 'I think you've started one more question. So I think I asked this last time, but then, Mr. Buckley, it sent around different audiences. And the question related to whether we could require some type of affordability restriction. And back when we did this the first time, I think we talked a lot about the Piedmont ordinance.'",
        "'speaker_9': 'And then it looked like in the documents that that were sent to us that the new Piedmont Ordinance does include some type of of affordability restrictions. So can you talk a little bit about what we might or might not be able to do regarding some type of affordability restrictions?'",
        "'speaker_9': 'I'm sorry. Let me because I think the answer I was told last time was that would be an undue burden. But then I, I mean, I think that's the new Piedmont Ordinance that Mr. Buckley sent. So I'm just wondering if you can reconcile that.'",
        "'speaker_1': 'Yeah. Steph's position would be that any requirement for affordability or or requirement that's not provided under state law could be interpreted as a burdensome and excessive requirement. Again, understanding the purpose of the state law was to streamline and remove the obstacles.'",
        "'speaker_1': 'There are other components of the Piedmont Ordinance that staff has looked at as well, such as them requiring a separate design review permit that the first I think it might raise some legal issues, but because it's a another city's ordinance, I won't comment on that.'",
        "'speaker_1': 'But it would be my interpretation of the state law that if the city were to introduce requirements that weren't provided in the legislation, that there might be some legal concern.'",
        "'speaker_9': 'I appreciate the. Thank you.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_6': 'And. Mr. Chai I think it was some of the correspondence we got previously talked about how and you actually referenced that we have properties that have accessory units in the back, usually not accessory dwelling units because this is the new ordinance we're looking at.'",
        "'speaker_6': 'But they've in many cases they have been left to deteriorate with this ordinance be applicable to someone who say I long for inside has a, you know, a boathouse or something that's no longer a boathouse. But they wanted to convert it.'",
        "'speaker_6': 'Could they could they come to the city with an application to make it into an accessory dwelling unit.'",
        "'speaker_1': 'Provided that there's only one main building and one unit on the property? Yes, that's a possibility. And they would still have to meet all of the requirements and the proposed ordinance.'",
        "'speaker_6': 'Yeah. The requirements that you've set forth. Okay. Okay.'",
        "'speaker_0': 'Okay. I believe that completes council question.'",
        "'speaker_6': 'Questions? Yeah.'",
        "'speaker_0': 'Okay. Comments. Motion member matter.'",
        "'speaker_5': 'SC I just wanted to clarify because my understanding and I think it's reasonable based on what, what I've heard and of. A review of what we talked about last time, that the fact is a 1200 square foot building is quite large.'",
        "'speaker_5': 'And this is not about design review. This is design review from everything. And it was confirmed tonight. Design review is going to happen for every accessory dwelling unit. And I think that provides a certain amount of protection. So I think that issue is I'm fine with that issue.'",
        "'speaker_5': 'The second issue is with what is by right, which my understanding, again, I think it was confirmed tonight, is anything up to 600 square feet by state law is by right and a ministerial review which includes design reviews, small D, small R.'",
        "'speaker_5': 'So I think that's fine. I think anything bigger than 600 square feet should have the notification and public input to the design review. So I'd like to see that. You know, I'd like to see that in our current ordinance.'",
        "'speaker_5': 'And I think it does make it different than the existing ordinance. And then lastly on, I think staff talked about a front yard and side yard. I think anything that can be visible from the street and. Visible from the public street should be subject to the design guideline.'",
        "'speaker_5': 'Those are my comments.'",
        "'speaker_0': 'Thank you. Want to go next? All right.'",
        "'speaker_6': 'I'll go next, if you may. Thank you, Mayor. I just want to go back to the preamble to the state legislation. It's section 65852.15 of the California government code. That is the basis of this ordinance we're talking about, says that accessory dwelling units are a valuable form of housing in California because they provide housing for family members'",
        "'speaker_6': ', students, the elderly and home health care providers, the disabled and others at below market prices within existing neighborhoods. Homeowners who create accessory dwelling units benefit from added income and increased sense of security. Having someone there living on the property.'",
        "'speaker_6': 'One of our speakers, a realtor with a big, beautiful house, mentioned that she likes having people living there with her and Addus also provide additional rental housing stock in California. And because they are smaller, they lower the cost of housing within existing neighborhoods while respecting architecture character.'",
        "'speaker_6': 'And so they because there were some comments made, about 600 square feet is all you need. You can provide the person who lives there and a caregiver. That's all you need. And I would say we're not really all about one size fits all in Alameda.'",
        "'speaker_6': 'We are unique. But I'm also cognizant of the fact that, as Mr. Ty pointed out, those larger homes with larger lots that would even accommodate an accessory dwelling unit tend to be in neighborhoods that wouldn't that don't have that extra space.'",
        "'speaker_6': 'So Harbor Bay, the homes there are lovely and large and I love the way it's laid out. Their backyards are not big. Bayport is similar, but there may be some we've I don't have the cities in front of me, but it's single digit.'",
        "'speaker_6': 'How many of these have even been approved since the ordinance has been on our but before the state law came into effect. But I am still mindful and but I want to say to all you speakers and I do appreciate you coming out and what I hear from all of you and not the ones just the ones'",
        "'speaker_6': 'who spoke tonight. But you've been emailing. So you really care about Alameda. You care about the character, what we look like. It's you know, it's a charming city and you're not alone. We do to every one of us on the city council.'",
        "'speaker_6': 'We don't want ugly things built in our house. And we. In our house. I sorry. I was looking at that adorable young family leave because we got too late, I guess, and just thinking we have this need in our city, in our region, in our state.'",
        "'speaker_6': 'We are trying to address it. I know it brings up a lot of fear. We fear the unknown. We fear what's happened in the past. In other times in Alameda, when there weren't regulations on the books, we saw Victorians torn down.'",
        "'speaker_6': 'We saw those what could be affectionately referred to as Soviet style apartment blocks built on some lovely historic streets. We don't do that anymore, and that's good. And I also want to say that we have a city government, a planning department, we have a design review manual, and we and when it was amended most recently and any'",
        "'speaker_6': 'time it's amended, it's done in a public hearing and there's lots of public input. And so that would be applied. Our planners care about what Alameda looks like, too, which is the reason you haven't seen cinderblock houses going up, by the way.'",
        "'speaker_6': 'So I do understand your concerns. I've heard a little bit of misinformation about, you know, just everybody who wants to can slap up a 1200 square foot accessory dwelling unit, but they can't. And we have restrictions in place and we also have some very compelling needs.'",
        "'speaker_6': 'But I think this is one of those instances where we really can address competing interest and interests. It is not an either or. So I certainly support the ordinance that the majority of this council passed last time. Thank you, Mayor.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_4': 'I'll keep it brief. I think, you know, at the end of the day, I have concerns with the 600 square foot limit, partially because of, you know, the added cost of having the public process. And second of all, relative to the fact that, you know, if you look at the universal design ordinance that we have been working'",
        "'speaker_4': 'on, I, I have spoken with several architects regarding the requirements of universal design. And 600 square feet is not going to really allow to meet all of the requirements of our universal design ordinance to make an accessory dwelling fully accessible.'",
        "'speaker_4': 'And I, I really don't want to hinder that process either. So it seems to me like if we did a design review it public design review requirement at the 600 foot limit, we're almost punishing people for building accessible, 100% accessible universal units, which is something I would like to avoid, especially because a number of people who have'",
        "'speaker_4': 'contacted me relative to wanting to build accessory dwellings have spoken about wanting to age in place and have a, you know, a unit that or have a unit that they could have a family member who they're caring for stay in.'",
        "'speaker_4': 'So for those reasons, I think the 600 square foot barrier would be too low. I do hear the concerns relative to the where an accessory dwelling would be built in the front yard or the side yard. I'd be willing to consider something under 1200 square feet for those parcels where it would be out front and center.'",
        "'speaker_4': 'But again, 600 square foot would be, I think, too low in terms of meeting the accessory accessibility requirement. So, you know, that's the only scenario where I would be comfortable looking at lowering it from 1200 square feet, because I do think that when it's front and center like that and people are going to be seeing it, I'",
        "'speaker_4': 'don't think that there's harm necessarily in public notice, but I wouldn't want to put the number too far below a thousand square feet.'",
        "'speaker_0': 'Let me ask. Sorry. But 750 square feet notice. Is that too low for you? May I ask a question? Let me let me start asking. And you can but remember memory. I want to speak. But you had raised the comment.'",
        "'speaker_0': 'So if you could just think about that and then I'll go to member Ody. Member Ody.'",
        "'speaker_9': 'Thank you, Madam Chair. Most of the comments I would have said have been spoken already by my three colleagues. I do feel we do have robust design standards and our staff pays really close attention to them. So I also feel comfortable that we're not going to have adus of any size approved that are out of character for'",
        "'speaker_9': 'either the individual lot or the individual neighborhoods. What does concern me and you know, except in the situation where, you know, you have a a landlord tenant relationship, I really believe that we should not interfere too much with people that want to improve their property.'",
        "'speaker_9': 'I mean, it's their property. I mean, unless they're leasing it or and in the business of providing housing, you know, I don't want to see property owners like the property owner on Saint Charles go through that long and onerous process just for a parking garage.'",
        "'speaker_9': 'I mean, they want to redo their garage now. I can't imagine what would have happened if they wanted to put an accessory dwelling unit in their backyard. And I think that gets to the gist of the entire thing we're trying to do here, which is remove the barriers for folks that want to do that.'",
        "'speaker_9': 'So I think that the design review process, having it in public I think is a significant barrier. And, you know, I'm pretty comfortable with the existing ordinance the way it's written. I just want to add before I close, I, I do appreciate the input of Aaps and I did have an opportunity to speak with Chris today.'",
        "'speaker_9': 'And I'm not one who has any negative inferences or thoughts of apps. I really enjoy the letters and your input and your thoughtful analysis and actually talking to you when I have that opportunity to do so. And we're continuing to do that.'",
        "'speaker_9': 'So I want to thank you for all of all that you do to help keep the charm of Alameda the way we love it. So I plan on supporting this as it is.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_6': 'You know I'm okay if you know, I want to hear your comments.'",
        "'speaker_0': 'So.'",
        "'speaker_3': 'Well.'",
        "'speaker_0': 'I was hoping to see about reducing so the houses I won't be able to support, but that obviously if you want to make a motion, my preference would be to require a public notice and. So that there could be that conversation with the neighbors.'",
        "'speaker_2': 'At a lower square.'",
        "'speaker_0': 'Footage.'",
        "'speaker_4': 'You know, my comment was really for the properties where it's built, being built in the front yard or the side yard. And the number that I had heard from some of the architects that I had spoken with prior to the meeting regarding the universal design aspect was 850 square feet.'",
        "'speaker_4': 'So for for the for the accessory dwellings. And I think that this really, you know, reading through the comments from apes and hearing everybody speak tonight, I think it has to do with, you know, making sure we're preserving the kind of overall charm of the neighborhood.'",
        "'speaker_4': 'And in that aspect, I can understand concerns relative to the design of accessory dwellings in the front yard or the side yard where it's going to be visible from the street.'",
        "'speaker_2': 'And so so I'll I'll make an.'",
        "'speaker_4': 'Well, I'd like to hear from my other colleagues to hear if.'",
        "'speaker_0': 'I think we've heard. I don't remember. Did your state member matter?'",
        "'speaker_5': 'Well, I'd like to make a motion to have the existing of these the existing text of this be amended to, um, have anything greater than 600 square feet, require notice and have to it explicit. In here, the design review will be conducted regardless and for any.'",
        "'speaker_5': 'The third is for any accessory dwelling unit visible from a public street. It has to meet the design guidelines.'",
        "'speaker_0': 'Is there a second?'",
        "'speaker_9': 'You know what? I have a question.'",
        "'speaker_3': 'Remember, we can.'",
        "'speaker_9': 'Can we make those? Hypothetically, can we make those changes and still qualify for a second reading or.'",
        "'speaker_5': 'Okay. So we would have to have another we have another meeting to have a second reading if this person.'",
        "'speaker_0': 'I have a Ashcroft.'",
        "'speaker_6': 'So I am concerned with.'",
        "'speaker_0': 'Let me go ahead. I'll second and then you can make your comments. Okay. I'll second the motion member.'",
        "'speaker_6': 'So I cannot support this because I we have all been waiting for the universal design ordinance to come along. And I think that we have to in this city be mindful of people of all differing needs. We want people to be able to age in place.'",
        "'speaker_6': 'We had correspondence from people who talked about wanting to build an accessory dwelling unit in their backyard, move into that and rent out their main house. So I don't want to start limiting our ability to apply the universal design ordinance, which I think most people know.'",
        "'speaker_6': 'But it means when you build, you build so that people who might need a wheelchair or a walker, a greater turning radius, so wider doorways, wider hallways can can be there. It's it's allowing people the dignity of living in their home and sometimes without a caregiver, sometimes with a caregiver.'",
        "'speaker_6': 'So I, I might consider coming down in the square footage number, but not to something that would conflict with universal design ordinance because the rights of the folks who would need that are.'",
        "'speaker_4': 'Important to.'",
        "'speaker_0': 'Remember matter.'",
        "'speaker_5': 'S.E., I don't have any evidence other than what was relayed verbally that we would preclude universal design in a 600 square foot. And it is.'",
        "'speaker_0': 'So.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Okay. So we had a motion and a second. Can I.'",
        "'speaker_3': 'Go to make my.'",
        "'speaker_9': 'Comment? I mean, what you know, what might be helpful in this is perhaps in six months we hear back from staff, you know, kind of an overview of the 82 applications that we have. And we can look at the pictures, we can have an update on if any of these other cities, more restrictive ordinances are being challenged'",
        "'speaker_9': 'in court and kind of see if if we put this in place, if it needs to be tweaked, because if we don't have any of these I mean, we had six applications from the beginning of the year. I mean, if we still have six more and they're all backyards of less than 600 square feet like the current'",
        "'speaker_9': 'ones, the current six are I mean.'",
        "'speaker_5': 'You know.'",
        "'speaker_9': 'Are we really you know, are we chasing something that's not there?'",
        "'speaker_0': 'And so we have a motion and a second. So and I'll go ahead and call that question and then we can have. Right. Okay. So I'll call that question. All those in favor. I, i. Oppose.'",
        "'speaker_4': 'No, no motion fails.'",
        "'speaker_0': 'Is there another motion?'",
        "'speaker_4': 'I'll make a motion to accept the language as is, but to add a requirement that it come back to council in six months time with an update as to what has transpired in the six months relative to applications within the city of Alameda, as well as the laws being passed in neighboring jurisdictions.'",
        "'speaker_0': 'There is.'",
        "'speaker_2': 'May I just clarify that? So that's not part of the ordinance. That's just direction to staff? Correct. Correct.'",
        "'speaker_0': 'Very second. I'll second. Any comments? All those in favor.'",
        "'speaker_3': 'I oppose.'",
        "'speaker_0': 'No, I oppose motion passes. 3 to 2. Thank you. All right. Now we move on to 6:36 a.m.. Oh, I'm sorry. 6 a.m.. Adoption of resolutions appointing Unterberg in Jennifer Barrett and Lisa Hall as members of the Commission on Disability Issues, Ron Taylor and Joseph Van Winkle as members of the Gulf Commission.'",
        "'speaker_0': 'Amber Bailes, Cynthia Silva, Travis Wilson and Dorothy Lismore as members of the Library Board.'",
        "'speaker_2': 'And Laura Palmer as.'",
        "'speaker_0': 'A member of the Transportation.'",
        "'speaker_2': 'Commission.'",
        "'speaker_1': 'Move approval, Madam Mayor.'",
        "'speaker_0': 'Thank you. All those in favor. I motion carries unanimously. So all of those that are here. Would you please come up to the podium with the names that she just read? Our new commission members. Ron Taylor. I'm sorry.'",
        "'speaker_0': 'I'll start with Aunt Anto. I don't know. Get me in. Jennifer Barrett. Lisa Hall. Ron Taylor. Jo Van Winkle. Amber Bailes. Cynthia Silva. Travis Wilson, Dorothy Whisper and Laura Palmer. If you're here, please approach the podium. Thank you.'",
        "'speaker_0': 'And you'll be sworn in. You take your oath.'",
        "'speaker_1': 'I got one.'",
        "'speaker_3': 'Okay. That's fine. But no. I just. I just. I was actually on. He.'",
        "'speaker_6': 'But.'",
        "'speaker_2': 'Please raise your right hands. Do you solemnly swear that you will support the.'",
        "'speaker_0': 'Constitution of the United States and the Constitution of the State of California, and that you will faithfully discharge the duties of the office.'",
        "'speaker_2': 'Of the.'",
        "'speaker_0': 'City of Alameda according to the.'",
        "'speaker_2': 'Best of your ability. Right. Thank you. If you would, please.'",
        "'speaker_0': 'Welcome. New commission members.'",
        "'speaker_3': 'Hmm. Okay.'",
        "'speaker_9': 'I'm moving.'",
        "'speaker_3': 'You guys.'",
        "'speaker_0': 'We're going to take a five minute short recess while they're doing that.'",
        "'speaker_3': 'Okay. Okay.'",
        "'speaker_0': 'Is that? Take your.'",
        "'speaker_3': 'Seats. If they really could.'",
        "'speaker_0': 'Please take your seats so we can resume. All right. The next item is.'",
        "'speaker_3': 'Six B.'"
    ],
    "Ordinance Amendment for Site A at Alameda Point.": [
        "'speaker_0': 'Assemble a public hearing to consider introduction of ordinance. Amending the Disposition and Development Agreement between Alameda Point Partners LLC and the City of Alameda for CI eight at Alameda Point. We have a staff member. Let's go. If you want to speak on this item, please submit your slips.'",
        "'speaker_10': 'It even numeric council members. My name is Jennifer. Best for you as director here to recommend amending the State Aid, Disposition and Development Agreement for Alameda Point. What has happened. So the city council last heard this item. This was it was January.'",
        "'speaker_10': 'And the city council extended the closing date for the phase one parcel within sight from December 11 to April 11th. Since that time costs, construction costs, have escalated significantly, especially for the apartment blocks. And so block nine, for instance, is one of the apartment blocks in the phase one, the land value attributed to the cost.'",
        "'speaker_10': 'I just want to talk a little bit about land value is basically the revenue from vertical development, how much you can rent the units for versus the cost of building those units. And the difference between those is the residual land value that essentially becomes a revenue in the land perform a compared to infrastructure costs.'",
        "'speaker_10': 'And so when that land value gets reduced in this case by $8 million, there's less money to pay for infrastructure so that this construction cost increase has impacted the revenues in the land, perform on how much someone's willing to pay for improved land with infrastructure.'",
        "'speaker_10': 'So because of these this cost escalation, the financials no longer work without changes to the development plan for the site development plan and the disposition of development agreement. And because of that, I mean a point partners could not meet the April 11 closing date that was extended the next day.'",
        "'speaker_10': 'After they did not meet that closing date, the city council or the city staff issued a notice of default default on April 12th. So the very next day. And then allow me to point partners presented a plan to cure the default.'",
        "'speaker_10': 'So the current disposition development agreement DDA contemplates that if there is a default, there is a period of time and different ways that the developer can cure or essentially make up fix that that default. They were presented a plan within 120 days, which gets us to August 9th, which is allowed under the DDA with a proposal to'",
        "'speaker_10': 'amend the development plan and change amend the disposition the DDA, the Planning Board has unanimously on May 22nd approved the plan amendment. And so now here tonight we're here to essentially the second part of the cure of the default to two men, the DDA.'",
        "'speaker_10': 'I wanted to be clear, this is first with a development plan amendment. What does excuse.'",
        "'speaker_0': 'Me member already?'",
        "'speaker_9': 'I'm sorry. I just want to cut to the chase on a question. Yeah, if we approve this, is the developer going to have the financing.'",
        "'speaker_10': 'In place by.'",
        "'speaker_9': 'Well.'",
        "'speaker_10': 'So you are going to hear from the from the developer, that's all.'",
        "'speaker_9': 'I just really want to know at this point because if we're going to go through this and he's not going to have the financing that I'd like to know that. Okay, what if it doesn't? I'd like to know what happens.'",
        "'speaker_10': 'So as of as of today, the city does not have a feasible financing plan from the developer. And so you would need we would like to speak to that and and answer your question. Okay.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_10': 'So what the development plan doesn't what doesn't change? I just want to be clear. There's no change to the amount of development and the infrastructure being proposed as part of this project. There are no changes to the transportation improvements or the contributions towards transportation.'",
        "'speaker_10': 'What does change is the development plan that phases two and three are switched. So the land south of Atlantic that we don't yet own was phase two. That's now phase three. And phase two is the land north of the first phase.'",
        "'speaker_10': 'And I'll show this on a map, and that now becomes phase two. That's land that we already own. There are relocation of housing units onto cleaner property from phase two to the northern to the parcel north of phase one.'",
        "'speaker_10': 'And then there are moderate income units that are moved out of phase one and into a proposed Alameda Unified School District Employee Housing Project and phase two.'",
        "'speaker_0': 'And I'm sorry, do you have a question? Yes. So this developer is in default, correct. Is this presentation any different? Is that being taken into consideration from staff's perspective when they're presenting this presentation in lieu of the question for member Odie and there we are, we're not talking about a financial plan being presented.'",
        "'speaker_10': 'Well, we can talk about what the developer is going to stand up.'",
        "'speaker_0': 'Well, but is there a reason why staff honestly, is there a reason why staff is not talking about finances when the developer is in default?'",
        "'speaker_8': 'So the developer is in default until August 9th.'",
        "'speaker_10': 'Right?'",
        "'speaker_8': 'So they have between now and August 9th to come up with a financial plan. And then according to the DDA, there are other options for the developer.'",
        "'speaker_10': 'Well, let me just be clear that the finances depend on the land uses. There's no financial plan without a land use plan. And so the development plan directly affects the ability to finance the project. What is being built, how much of it, what phase is it in the timing of it?'",
        "'speaker_10': 'So you can't divorce those two things. That's why we have to talk about this. What's why the developer's proposal to cure the default had an amendment to the development plan attached to it because those things are very interlinked.'",
        "'speaker_10': 'The staff report went into attached about four different financial performance and talked about all the different summarized. Very in very detailed form the implications of those performance. And I'm happy to go over that. But what we're trying.'",
        "'speaker_0': 'To I actually I want to talk I so I just thought it was a good question from member.'",
        "'speaker_10': 'Already but all of these changes affect the bottom line the development plan changes. And we want to be clear what what the council is being asked to change. And the development plan here is moving the the housing that was in this phase which is on land that's has environmental restrictions and being moved here.'",
        "'speaker_10': 'And the commercial that was here is being moved now to south of Atlantic. The revised phasing is now this is phase three and this is phase two. And this stays phase one. The amendment that's before you is really the financial aspect, additional financial aspects of this.'",
        "'speaker_10': 'The deferral of four of the $5 million of sports complex sports complex payment is asked to be deferred from from phase one to phase three.'",
        "'speaker_0': 'And remember.'",
        "'speaker_9': 'I'm sorry, can we go back to that previous slide? I'm sure I have. So you mentioned the teacher housing. Can you point on the map for the upper and.'",
        "'speaker_1': 'Of the public.'",
        "'speaker_10': 'Right here? It's about 70 units of teacher housing, moderate income deed, restricted units for for a really employee housing for element of unified school district.'",
        "'speaker_9': 'And then can you tell us the difference between the square footage of commercial in the 2015 plan versus the square footage in commercial in the revised plan? There's no change. No change. No. Okay.'",
        "'speaker_10': 'And there's no change in the number of housing units.'",
        "'speaker_0': 'So then can you speak to where does this teacher housing come from?'",
        "'speaker_10': 'Yes, absolutely. So the way that this is and you can hear from the developer the special Ed, I.'",
        "'speaker_0': 'Actually want to hear from staff.'",
        "'speaker_10': 'That's fine. But the other.'",
        "'speaker_0': 'Thing I want to.'",
        "'speaker_10': 'Hear. Okay. So I can explain it. It was it was detailed in the staff report. But the.'",
        "'speaker_6': 'Report.'",
        "'speaker_10': 'Yeah, it is in the staff report. So the way that this works is that it would be essentially there are no unlike very low and low income housing units, there are significant public financing mechanisms to finance the very low and low.'",
        "'speaker_10': 'There are no essentially no public financing available for moderate income units other than market rate units. And so what this does is essentially and has been done in other locations and the developer can speak to that because they have actually built these projects, is that the developer, what it allows it to be done is that the school'",
        "'speaker_10': 'district helps finance the units with rental income from the moderate, from the units, and they essentially finance debt from a certificate of participation that the school district issues that would be between the developer and the school district. The school district has issued a request for proposals.'",
        "'speaker_10': 'They got two proposals. They have now narrowed those proposals exclusively to the side project and are evaluating it further. And so that that is between the school district and the developer. And this would be a way essentially to use public financing to help finance the moderate income units, which essentially improves the feasibility of the project to get'",
        "'speaker_10': 'at the financing.'",
        "'speaker_0': 'Are these in addition? So as my understanding, 25% of the 800 units are below market rate? That's correct. Are these part of the 200 units?'",
        "'speaker_10': 'This they are.'",
        "'speaker_0': 'The so under the first plan, anyone within our city would be eligible for the below market rate. And now the proposal is to limit some of those 200 units to a USD employees only.'",
        "'speaker_10': 'That's correct. Number two, there's 70. That would be through the school. District two would be part of the blockade, affordable housing.'",
        "'speaker_0': 'Those are not in addition to the 200 units that were in the past.'",
        "'speaker_10': 'They're part of the 200 units.'",
        "'speaker_0': 'And then to do those, A USD employees have to currently live in Alameda to be eligible.'",
        "'speaker_10': 'I'm not sure of the details. The developer specialized in this, and this would be part of the discussions and negotiations with the school district. They haven't finalized a deal. So some of that could be worked out through their deal, but it hasn't been done.'",
        "'speaker_10': 'So a deal has been done.'",
        "'speaker_0': 'So my understanding was under phase one, the 200 units, there's a list that the housing authority keeps. And people that are on that list currently would be given priority to those 200 units. Is there? So now it sounds like that the 70 units would be different from the way we currently.'",
        "'speaker_0': 'That's correct. Correct.'",
        "'speaker_10': 'That would that would be different.'",
        "'speaker_0': 'So it would actually reduce the number. It would not follow the same list that we currently use with our house.'",
        "'speaker_10': 'It would be different than the way it was contemplated before and being restricted to Alameda Unified School District Employees.'",
        "'speaker_0': 'Member asked.'",
        "'speaker_6': 'Clarifying question. Ms. that was part.'",
        "'speaker_3': 'Of sorry.'",
        "'speaker_6': 'Too much greeting. People at the parade yesterday was part of the intent of the proposed a USD housing the fact that the district is having a hard time hiring new teachers because they can't afford to live in Alameda.'",
        "'speaker_10': 'And I don't want to speak for the school district. My understanding and conversations with them that it's not just its employees. So not just teachers, but maintenance workers, cafeteria workers, but also new teachers, especially because they're there make less money when they come in.'",
        "'speaker_10': 'So it's really young. It's that the teachers that are starting off that have a hard time finding, being able to afford in Alameda. That's my understanding. I want to speak for them. But that's my understanding is it's really young, you know, new teachers and employees.'",
        "'speaker_0': 'So aren't new teachers and employees eligible to apply through the Housing Authority currently? Yes, everyone is right.'",
        "'speaker_10': 'Anyone that meets the qualifications of the moderate income units. That's correct.'",
        "'speaker_0': 'Thank you. All right.'",
        "'speaker_10': 'So the DDA amendments considers a number of of changes to the DDA to improve the feasibility of the project and then gets directly at the financing. And the ability to finance this project is really in order to finance a project and attract capital.'",
        "'speaker_10': 'The project has to show that it pencil's currently under with cost escalation. It doesn't pencil and that would performa was attached to the project that with the moderate income units and the $5 million sports complex payment, we did not we had a negative essentially revenues or costs exceeded revenue.'",
        "'speaker_10': 'So not a project you could finance. And this gets at the ability to finance the project and close by reducing the.'",
        "'speaker_0': 'Excuse me member already.'",
        "'speaker_9': 'I'm sorry. So I want to talk about this. So. Do we a couple questions. Do we have a guarantee that we're going to get that extra form, other $4 million?'",
        "'speaker_10': 'We is we do not. I mean, there what we have now is essentially is that this would get deferred to phase three. And if they didn't close on phase three, then we would not get this money. It is a risk.'",
        "'speaker_9': 'So then another hypothetical and this gets back to my first question about the financing. I mean, say, for instance, we do close, but then a week later we find out that it's not going to happen and we have the 10 million for the ferry on deposit.'",
        "'speaker_9': 'Right. But then all we have out of this is the 1 million for the sports complex. So we'll never see that. 4 million if that hypothetical.'",
        "'speaker_10': 'Correct. If if they don't close on phase three, then we would not see the $4 million. If we if we don't I mean, I think the question and we'll get to this and staff recommendation. I agree. It's a risk as it was in the staff report.'",
        "'speaker_10': 'We think it's a risk under the current the DDA that you had before you were getting the $5 million at closing for phase one. In this case, you wouldn't be getting until phase three. And there's a risk if they don't close that you don't get the 4 million.'",
        "'speaker_9': 'So it could happen again, hypothetically, that somehow this project doesn't go through. But the developer owns the land, not the city anymore. And then they would be able to sell it, presumably in the future and bank it without, you know, fulfilling this commitment to the sports.'",
        "'speaker_10': 'Well, they they can't own phase three land, so they can't ever own phase three land until they pay the 4 million.'",
        "'speaker_9': 'They can own phase one and phase two.'",
        "'speaker_10': 'Phase one, and they could own their own phase two, assuming they met all the conditions to close on phase two. What? They can't landbank the land. They have strict requirements to perform under both in terms of infrastructure construction and vertical construction.'",
        "'speaker_10': 'And so if they didn't meet certain milestones, one of them is completion of infrastructure, another is vertical completion. They would be in default of the DDA and the city could use its remedies under the DDA. Essentially they would be in violation of the contract.'",
        "'speaker_10': 'So they can't bank phase one. They have to perform if there are any reason they default on phase one. What the city gets up front before they close on phase one are the bond performance bonds for the infrastructure.'",
        "'speaker_10': 'It gets a note for the ferry terminal payment. It gets the $1 million in the bank before we close. So you have those. And then we would so let's say they default worst case scenario in phase one, they don't finish the infrastructure.'",
        "'speaker_10': 'We call on the surety bonds to essentially give us the money and then we perform that work. Those are our remedies if they default on phase one.'",
        "'speaker_9': 'Okay. I appreciate that. Then that's helpful information.'",
        "'speaker_0': 'Can you clarify from how many homes would be built under phase one and two before we get to phase all 800? So all 800 homes would be built. The profit would go to the developer from phase one and phase two and phase three.'",
        "'speaker_0': 'The city could get left with not being built.'",
        "'speaker_10': 'Well, phase three, under our current scenario, had no housing either. In the current did that?'",
        "'speaker_0': 'No, I appreciate that. Just because we didn't have a developer in default before, now we do. So that's why I think it's very important that we ask be allowed to ask these questions to staff. So I just wanted to clarify, all 800 homes are in phases one and two, and it's actually phase three.'",
        "'speaker_0': 'That is the commercial and the public benefits the way it's being at the the proposal.'",
        "'speaker_10': 'Well, that is true that there is no housing in phase three. I will say that it's you're not you're postponing the $4 million that but the vast majority of the infrastructure is still in phase one of the project.'",
        "'speaker_0': 'So I appreciate that. Thank you. All right, Vice Mayor.'",
        "'speaker_4': 'Relative to, you know, we're talking about the number of housing units being built. And there's obviously concern from the community relative to the amount of housing coming on board. What's the risk if the housing doesn't get built relative to our housing plan?'",
        "'speaker_10': 'Mean I think the risk if the how you mean in terms of the housing element correct. Or I mean, I think there's, you know, less housing that's built is less supply of housing, less affordable housing. And it's one I mean, there's 200 units of affordable housing here working closely with Eaton Housing.'",
        "'speaker_10': 'There would be 130 affordable, very low and low units that wouldn't get built if we didn't move forward. And that's part of the calculation that staff made. And Wayne, you know, to be honest, we don't these aren't changes.'",
        "'speaker_10': 'We didn't. These aren't changes that we like. These are changes that we think are necessary in order to be able to move the project forward and save the benefit of the backbone infrastructure as part of phase one. So there's this waiting calculation.'",
        "'speaker_10': 'And so you would the affordable housing and the very low and low is all in phase one. So you would get those benefit of those units towards your towards your housing. You know, towards housing construction in the city.'",
        "'speaker_4': 'And so what was going to happen if we had split them between phases one and two relative to our housing element? Because don't we report in eight year increments? So are we moving it up? Are we? How does this how would it in units?'",
        "'speaker_10': 'Aluminum point units are not currently in.'",
        "'speaker_2': 'Our.'",
        "'speaker_4': 'Housing plan.'",
        "'speaker_10': 'Housing is the housing element.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Statecraft.'",
        "'speaker_6': 'But just with regard to providing more affordable housing and we've heard a lot about the need for affordable housing, and apparently we're not going to have an accessory dwelling unit anytime soon. We if we weren't to go forward right now with this new proposed phase, that's that many units of affordable housing that we just won't add to'",
        "'speaker_6': 'Alameda.'",
        "'speaker_10': 'That's that's correct.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_10': 'So the other thing that's in the DDA amendment that we want to just be clear about is that there is an extension period between the April 11. So what? There's two ways that they can cure their default. One is to close and this gets it.'",
        "'speaker_10': 'Councilmember Ortiz question are they going to close? Is this going to do it? And you'll have you're going to hear from them directly. But there's two ways. One is to close by April 9th, because they've met all the requirements of the financing plan.'",
        "'speaker_6': 'If they don't come in August.'",
        "'speaker_10': 'I'm sorry, August. Sorry in August. I wish we had two different. But the second way is to X to essentially pay to extend the current DDA allows them to pay 50,000 per acre. To extend. What the changes in the day.'",
        "'speaker_0': 'I'm sorry. 50,000 per acre to extend that then comes out of the 10 million for the ferry or is it in addition to that.'",
        "'speaker_10': 'So if so, it's in addition if they don't complete 50% of infrastructure, once they complete 50% of infrastructure, then that money would be credited.'",
        "'speaker_0': 'So it's not really as long as they satisfy that, then there really is no penalty.'",
        "'speaker_10': 'That's I mean, there's no penalty. It gets credited after.'",
        "'speaker_0': 'It gets credited. So there's not any additional profit or gain to the city.'",
        "'speaker_10': 'But I want to just clarify, because what we're saying here is there's those are the two ways that they can cure their default, either pay to extend or.'",
        "'speaker_1': 'Or.'",
        "'speaker_10': 'Close by August 9th. What this changes do is essentially covers this extension period retroactively to April 11. So they're essentially paying for their cure period, whereas technically. And so I just want to be clear, the changes here essentially start this.'",
        "'speaker_10': 'If they were to in either scenario, if they closed by August 9th or if they extend the city gets paid for 120 days as part of this option extension, extension. If they pay the option payment, then it would go for an additional eight months to April 11, 2018.'",
        "'speaker_10': 'But the city would get covered for those 120 days. That option payment, if it's made before August 9th, is, as you said, is is refund. It's potentially a refund. It's prorated to when they close because they may close before April 11th, 2018.'",
        "'speaker_10': 'And if they do, then there's a refund of how much they've paid for the period that they've used before they can close. The other is that after 50% of infrastructure, it gets credited. And so there is one of the documents on your chair or some changes to the amendment, the some changes that are made to just clarify'",
        "'speaker_10': 'what happens in the event that they take the second option of extending.'",
        "'speaker_0': 'Right. I want to clarify. You keep saying pay to extend. I think it's actually that they pay in advance, but it's not additional money. It is as long as they close and they get credit. So it's not it's not closed.'",
        "'speaker_10': 'It's only if they complete 50% of.'",
        "'speaker_0': 'Right. Which were which I would assume staff is hoping happens then if we are going forward. Yes. So in that scenario, then it's not new money to the city, it is just that they pay early and then they get a credit for it.'",
        "'speaker_10': 'So there isn't 150, there is $150,000 that is nonrefundable to the city essentially to pay for our transaction costs. Obviously, all these amendments require legal assistance and so and other.'",
        "'speaker_0': 'But still, that's to pay for the city's transaction costs, correct? So it is to offset costs that the city is sharing. All right. So I think it's important that we clarify that.'",
        "'speaker_10': 'That's right.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_4': 'Can you go over just the the infrastructure, the cost of the infrastructure that we're looking at and the timing for that?'",
        "'speaker_10': 'Sure. So the cost is about 40 about $43 million of, you know, infrastructure costs. It doesn't include total costs for phase one in the lab performed. When you take everything into consideration, it's about $80 million. Hard construction costs about 43.'",
        "'speaker_10': 'What was your other question?'",
        "'speaker_4': 'And the timing.'",
        "'speaker_10': 'On the timing. So within 30 days, they have to show us before close that they have a construction contract that's been executed. They have to have final permitted improvement plans, which they have demonstrated to us. SWEENEY And so and then within 30 days of close assuming again, as Councilman Otis question is assuming they can demonstrate does have'",
        "'speaker_10': 'a feasible financing plan then 30 days of close they have to start construction on infrastructure.'",
        "'speaker_4': 'And are there any infrastructure projects out there that will have to be completed regardless of if this project is completed or not?'",
        "'speaker_10': 'Are there? I'm not sure.'",
        "'speaker_4': 'Are there any infrastructure costs that the city is going to be on the hook for in the event that this project doesn't go through?'",
        "'speaker_5': 'No.'",
        "'speaker_3': 'Hmm.'",
        "'speaker_10': 'No. I mean, there are performance bonds that are posted prior to close that the that the city would the city would essentially, if they defaulted and halfway through their infrastructure or a quarter of the way through the infrastructure, then the city would call on the surety, collect that money, and then and then implement those improvements.'",
        "'speaker_0': 'Aren't those per phase, though? Yes. So phases one and two could be built with the 800 units of housing, and there's no guarantee that the third phase would be built.'",
        "'speaker_10': 'That. That's correct. They could not meet the requirements of the closing for phase three.'",
        "'speaker_0': 'Thank you. All right.'",
        "'speaker_10': 'All right. There are also lender requested clarifications on security financing. So this is what happens. This is these are all the worst case scenarios. What happens if there is an event of default? The lender requiring additional clarity about what happens in that case.'",
        "'speaker_10': 'These are very typical ones. Once you have a third party investor to clarify some of the things prior to closing, what we were very careful is that nothing diminishes the city's existing remedies to obtain the backbone infrastructure through the performance bond and the affordable housing obligations the $3 million in the event of a default.'",
        "'speaker_10': 'So they would they will have to post $3 million for the contribution for the affordable housing prior to putting a security interest on the property so that we know the city has access to the $3 million. And the bonds, of course, are posted or the surety is provided to us prior to close.'",
        "'speaker_0': 'If phase three is not built. How does the city get the 4 million?'",
        "'speaker_3': 'We don't.'",
        "'speaker_1': 'If if the.'",
        "'speaker_10': 'Phase three, if they don't close and they default on the deed because remember, this is a default on the DDA if they don't close on phase three because they are required under the DDA to complete all three phases.'",
        "'speaker_10': 'So if they don't close on phase three and they default on phase three, I'm getting to your answer that they don't then we don't get the infrastructure as part of phase three either. The package of infrastructure, we do not get it.'",
        "'speaker_0': 'So 80% of the 5 million then is what we're talking about. The city could, could lose under this new proposal.'",
        "'speaker_10': 'The 80%.'",
        "'speaker_0': 'Yeah. Because they were supposed to pay the 5 million up front the first phase. And now that.'",
        "'speaker_10': 'We would not get the 4 million if they don't close on phase three.'",
        "'speaker_0': 'Yet for the sports complex member matter.'",
        "'speaker_5': 'Could part of this amendment require them to post a $4 million bond against that risk?'",
        "'speaker_10': 'I mean, we can you can ask the developer, we have asked that what we understand is that that's very expensive to purchase. But we I think we should have the developer come up here and answer that question. Would you like them to do that now or you want me to finish the PowerPoint?'",
        "'speaker_10': 'Yeah, but I think it's. I think.'",
        "'speaker_3': 'You will.'",
        "'speaker_10': 'Assessment of benefits. And then we're going to talk about assessment of risk. So the benefits, I think from staff's perspective, like I said, we we recommended a deal in 2015 that we thought was the best deal. These are changes to that deal that are essentially less favorable to the city.'",
        "'speaker_10': 'So we're not happy to stand up here and recommend this. We think that these are necessary to make the project feasible and to move the project forward. And we think that the benefits which I'm going to talk about now outweigh the risks and the potential downside.'",
        "'speaker_10': 'It's not perfect for what we do. The benefits is that we move forward with phase one. And there are significant we intentionally put a lot of the affordable housing and infrastructure in phase one so that we really frontloaded the benefit to the city.'",
        "'speaker_10': 'If they move forward with phase one, it can demonstrate a feasible project to us and we get those benefits associated with Phase one, which are 130 units of very low and low income, affordable housing, eight acres of parks and open space, a $10 million ferry terminal payment, which now we have the essential gap financing for.'",
        "'speaker_10': 'So we have a fully funded ferry terminal and major infrastructure improvements like the sewer line, the expedited infrastructure benefits.'",
        "'speaker_0': 'I'm sorry, before you move on, you talked about the low and very low and workforce. Is that the total number of units of housing in phase one? The total number of units of.'",
        "'speaker_10': 'Housing, no. There's also market race housing like the town.'",
        "'speaker_0': 'Where is the market rate? What's the number for that?'",
        "'speaker_10': 'So it's it's 100 and 162 workforce are market rate units. So 130 minus the 674.'",
        "'speaker_6': 'It's in the staff report, 4548.'",
        "'speaker_10': 'It's essentially the it's about 540 market rate units. That includes 162 workforce unit.'",
        "'speaker_0': 'So phase one is 540 housing units total?'",
        "'speaker_10': 'No, it's.'",
        "'speaker_0': 'What's the number of housing units total? 674 674 674 of the 800 units are part of phase one.'",
        "'speaker_3': 'Correct.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Question on the.'",
        "'speaker_0': 'Number.'",
        "'speaker_6': 'Thank you. Ms.. On the 162 workforce housing units, are they what is called affordable by design?'",
        "'speaker_10': 'Correct.'",
        "'speaker_6': 'So they are smaller units and they will be priced accordingly. So although they're market rate, it's a different sort.'",
        "'speaker_10': 'Of and this is I'll be clear, these are according to Alman point partners. What they have said to us is that their units, based on the pricing that they currently have now, that pricing could change. But based on the size of the units in the current estimated market rate pricing, those units fall within 120, 180% area median'",
        "'speaker_10': 'income, which aren't deed restricted. So if the market value goes up, then those units, you know, presumably, you know, you hope incomes kind of go up too. But you have there is a potential for those units, but they are currently the way they're priced and designed to meet the 100 to that income range.'",
        "'speaker_6': 'And is that in response to things that have been heard from this council desires from this council?'",
        "'speaker_10': 'Yeah. And also and also the market that demands these smaller units. Yes. Both at both of those things. Thanks. So the expedited and I want to say is the phase two is now expedited by four years. So all the benefits in the phase two, which is north now, which would benefit the adaptive reuse area as well as'",
        "'speaker_10': 'the Main Street area and two point collaborative project is now expedited by almost four years that they'll be able to move that forward that much faster because the fact that we own the land and because of the the benefit essentially of kind of almost combining those two phases into a large phase.'",
        "'speaker_10': 'So it's expedited and then you have the benefit to Main Street. And after reuse areas, the relocation of housing on to cleaner properties.'",
        "'speaker_0': 'Is a nice mayor.'",
        "'speaker_4': 'Can you explain why that why that would be expedited? Is it does it have to do with putting in the infrastructure or is that the connection or what's the what's the reason that it's expedited? Well.'",
        "'speaker_10': 'So the phase two, it's phase one is obviously same schedule.'",
        "'speaker_4': 'But I'm saying why why would it expedite? I'll be more specific. Why would it expedite the Main Street Neighborhood Project and Alameda Point collaborative projects?'",
        "'speaker_10': 'Well, so the Main Street and adaptive reuse depend on infrastructure like the West Tower Avenue. Mm hmm. And that was before part of phase three. Mm hmm. And so it benefits them because by expediting that and having that happen faster, they can then take advantage of the efficiencies and tie in to that infrastructure that's now been brought'",
        "'speaker_10': 'closer to their property. Mm hmm. And the same with adaptive reuse. West Tower Avenue is the main kind of arterial into the reuse area. So now you have infrastructure in that area. It's far. You don't have to go as far to pick up that infrastructure.'",
        "'speaker_4': 'So if this project doesn't go through, how would that impact those projects?'",
        "'speaker_10': 'If the project, then the projects would have to pay for the Main Street if Main Street were to go forward. And that phase one of Main Street that we've talked about, what the market rate in the cloud, we would have to find a way to build infrastructure without side A we've looked at we've looked at those numbers'",
        "'speaker_10': 'and they'd have to build the sewer line, for instance, all the way from the, um, from the project. It, it strains the ability. It's a pretty big infrastructure hurdle. We would have to look carefully at how we would make that work so effectively.'",
        "'speaker_4': 'We would have to completely redo those projects or at least look at redoing them because.'",
        "'speaker_10': 'Like we had talked about trying to do more workforce housing as part of that project, we probably wouldn't be able to afford to do that, or we'd have to be looking at lower density, more higher value products there.'",
        "'speaker_10': 'We'd have to look at all kinds of things. I think we need to we want to see what happens here to be able to really craft that RFP in a way that we want to give certainty to those developers or some certainty to those developers coming in for Main Street and it is dependent on site and what'",
        "'speaker_10': 'they'd have to pay for.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_10': 'So we also think there is a benefit to relocating the housing on to the cleaner property that's currently owned by the project. It allows it to be built. It could be built on that other property, but there would be no restrictions in terms of ground floor and some additional vapor barriers that would need to be built.'",
        "'speaker_10': 'This kind of takes that off the table. Improve land use consistency with the enterprise district. We think having that commercial on the south, which is closer to enterprise district, has more land use consistency as well. Now let's be clear, we want to be very honest about this.'",
        "'speaker_10': 'We think there are risks. We've we've assessed those risks. We want to disclose those publicly. We do believe, because we didn't we believe that moving the moderate income units are we've looked at the performa without the Army, the unified school district project that phase two doesn't pencil.'",
        "'speaker_10': 'There is not sufficient market rent units to support the 70 moderate income units because the school district is essentially a public financing mechanism for helping to pay for those this works with. We are indications from the way that the school district process is going is that's looking good.'",
        "'speaker_10': 'We know that our developer has experience building this, but there is a risk that phase two does not pencil without the AC project. So we want to be clear about that feasibility of phase three and sports complex payment.'",
        "'speaker_10': 'These are the questions you're bringing up. We, too, want to be really clear about that. A commercial only project. It works financially and it generates an internal rate of return. But it really depends on a a stronger market than you currently have out there for commercial.'",
        "'speaker_10': 'So the idea is that you build phase one, you build all those amenities, you start to build and then you then you're going to get commercial values that are higher that are out there today. The phase through phase three performa depends on that increased commercial value to be able to support the sports complex payment and the infrastructure'",
        "'speaker_10': 'in phase three. So there is risk that you don't achieve the commercial values and if you don't, then there's a chance that the project doesn't phase three project does not move forward. There's also a risk of not moving forward, which is, I think, Councilmember one of the councilmembers questions.'",
        "'speaker_10': 'I think if you don't, this is really the staff's kind of grappling with how to what to recommend to you tonight. It's not simple. It's not easy. And I think for us, we really weighed the risk of not moving forward is essentially looking for another developer to potentially step into their shoes, take a 2 to 4 years'",
        "'speaker_10': 'to do that through a solicitation process, a transaction process. And it's likely that they will face if we don't go into an economic downturn in that period, some of the same challenges of construction costs and that we're having to move forward with a project that's a different than what we have now.'",
        "'speaker_10': 'You know, we can't say for sure we don't have a crystal ball that that's what's going to happen. But there are risks of not moving forward. And the alternative is delay. And the alternative is that the phase one amenities and affordable housing is delayed.'",
        "'speaker_10': 'Is there also a risk that this still doesn't move forward? Yes, but we think the benefits, potential benefits of getting the Phase one infrastructure and amenities outweigh the risks to those future phases and phase two and three. And that's why we're recommending this to you tonight.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_6': 'Thank you. So I'm perhaps the developer might be the the one to answers, but let me ask it have you missed it? So it does seem like a lot is riding on these 70 moderate income units as part of an ESG project.'",
        "'speaker_6': 'But the school district is a separate entity from the city. And we you know, we have no control over what they do or don't do. Is there a plan B if the school district project doesn't come through for so.'",
        "'speaker_10': 'I know. Yeah, I think it's a valid question and you're absolutely right. That's why we see it. I mean, that's why we felt it was such a risk that we really wanted to disclose because we don't control that.'",
        "'speaker_10': 'The council doesn't control that does. Is it all looking good like it's headed in the right direction? Yes, but I we don't the plan B, they are evaluating plan B, we can ask them. But I think the plan B is that I understand those contingency would most likely require an amendment to our settlement agreement with renewed hope'",
        "'speaker_10': 'because they wouldn't meet that agreement. And so it would mean, for instance, we do all very low, low because there are other public financing mechanisms out there. But that's not what's specified in our current settlement agreement with renewed hope, which says you have to do 9% moderate.'",
        "'speaker_10': 'So if you were to able you switch those units to very low, low, for instance, and you then you'd have access to tax credits and other sources of financing, you're not building the moderate income units. And so it's hard to say that we have a clear cut plan B because they require other parties, again, that, you know'",
        "'speaker_10': ', we would need to have further discussions with.'",
        "'speaker_0': 'So doesn't the school district have property out of Alameda Point currently that they're planning to do. They're considering doing AOC housing on. They do. So this would then be in addition to that for a USG employees.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_10': 'That's correct.'",
        "'speaker_0': 'Okay. So then the people that are currently on the housing authority, that list for housing, then they just get bumped because they don't work for current, they don't work for Alameda Unified.'",
        "'speaker_10': 'You were correct that there's a different process and that the process would prioritize some employees and teachers.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_9': 'Thank you. Quick question. Should I? I forgot it.'",
        "'speaker_10': 'Well, let me finish. If it comes to you, you can interrupt me now.'",
        "'speaker_9': 'Yeah, I remember it. Could you kind of update us on the status of where the school district is on this?'",
        "'speaker_10': 'Yes. So the school district did just take a vote to they had two proposals that they received to therapy and they took a vote to continue to evaluate the site, a proposal. So now there's only one proposal that they're evaluating and they have hired economic consultants.'",
        "'speaker_10': 'I've had conversations with them and they are reviewing now the site proposal in more depth. So there's no one else that they're evaluating except for the site proposal.'",
        "'speaker_9': 'I mean, I know, as I think my colleagues, that we can't really put ourselves in their shoes. But I mean, are they on track to get this signed, sealed and delivered in time for closing, or do they have some other deadline or so?'",
        "'speaker_10': 'I don't think this would happen. Well, it would not happen by the August 9th closing date if there is an extension that's done. You know, if they decide to take that other half of pain for additional time, then possibly.'",
        "'speaker_10': 'But I don't know the timeline exactly. I know that they are working. I mean, they're taking action. They're working hard on it. They were having consultants review it. I've had conversations, so I know it is moving forward. But the next step, I imagine, is to evaluate it, recommend, you know, that they move forward and they'd have to'",
        "'speaker_10': 'do a transaction with the developer, which, as we know, takes time.'",
        "'speaker_3': 'Yes. Okay, thanks.'",
        "'speaker_10': 'So I just want to be clear what we're recommending. The DDA amendment is that we're recommending updates to the phasing plan, performance milestones and infrastructure package consistent with the approved development plan amendment, providing an extension, allowing them to have an essentially an extension payment for the cure period.'",
        "'speaker_10': 'So the period 120 days and to allow the changes to essentially move forward with an extension payment for, you know, to elect to take an extension payment for a full year going back to April 11th being a start.'",
        "'speaker_10': 'So additional eight months, if they elect to do that, that could be refunded any portion of that be refunded if they closed sooner and then credited once they complete the 50% infrastructure. It defers the $4 million sports complex to phase three and then facilitates these lender requested clarifications on essentially the security for the financing and for the'",
        "'speaker_10': 'loan. And I'm happy to take more questions. I'm also happy to have the developer stand up here and answer some of your questions. I do think it's important to hear from them why they want their why they need this and what their what the status of their financing plan is.'",
        "'speaker_10': 'So I'm I will turn it over to them when after your.'",
        "'speaker_0': 'Can you go over what, phase three under the new proposal, what phase three would include.'",
        "'speaker_10': 'Sure. Let me go back to I can scroll here. So there is a O here. So phase three now is down here. And it includes this parcel. It includes about.'",
        "'speaker_0': 'How many square feet of commercial.'",
        "'speaker_10': 'Square feet at 500,000 square feet.'",
        "'speaker_0': 'And how many square feet of commercial are in phases one and two.'",
        "'speaker_3': 'More than.'",
        "'speaker_10': '170. So 400 and phase three and 172, almost 200,000 in phases one and two.'",
        "'speaker_0': 'Okay. So what else is in phase three?'",
        "'speaker_10': 'Oh, there's a hotel that's included in that. Square footage.'",
        "'speaker_0': 'The approximately 400 square feet of commercial. What else?'",
        "'speaker_10': 'And then there is promenade improvements here. Yeah. The park here which. And then the park here, this retail center, that's part of the commercial square footage here. And then you have infrastructure essentially brought down closer to the enterprise district.'",
        "'speaker_10': 'So there's infrastructure improvements as part of this as well. Now, phase two is here and you get the park for this as part of phase two. This is now the new phase two.'",
        "'speaker_0': 'So. Okay. So I just wanted to comment that is very small for us to be able to decipher what you're referring to. In the future, maybe you could do two slides, so it's visible.'",
        "'speaker_6': 'I would just say just for clarification, when we're reading on our iPad, so you can always.'",
        "'speaker_0': 'So I appreciate that, but we're trying to do a public meeting here. So the public I'd like to be able to be able to see this, too. So thank you. Okay. So so the so that's commercial, right? So what if the developer does phases one and two with the 800 units of housing?'",
        "'speaker_0': 'And also, I'd like you to confirm it's my understanding that the deal with the Navy is, in fact, to focus on jobs, not housing.'",
        "'speaker_10': 'Right. I mean, the deal with the Navy says that it really focused on jobs. And that's why we have the 1425 housing unit cap at the point.'",
        "'speaker_0': 'Okay. So if phases one and two are built and not phase three, then is it possible for the city to for a developer to be able to build these things that you were speaking to the commercial, as well as the 4 million for the sports complex for the city to be able to get that that the city'",
        "'speaker_0': 'would would need to consider additional housing units.'",
        "'speaker_10': 'So based on we required them to provide us with a performa for phase three that demonstrated to us what their assumptions were for phase three, so that we could then we could look at exactly what you said. Is this are you just postponing this?'",
        "'speaker_10': 'Can you really afford with a commercial development to pay for the infrastructure in the sports complex payment they have provided us that performa was attached to the staff report. What it shows is that yes, it does. But I will say and this was one of the risks, I said it assumes commercial land values at higher levels than'",
        "'speaker_10': 'we.'",
        "'speaker_0': 'Currently than we currently have right now.'",
        "'speaker_10': 'Seems to me that all the benefit of a phase one will generate you'll generate higher commercial values because of all the amenities and housing that will be built. If that assumption doesn't come true, then it could be that phase three is not feasible.'",
        "'speaker_0': 'Could you turn to slide nine? That's where you say that. So that the only way under the current proposal, the only way this makes sense with phase three is in fact if commercial rates are higher than they currently are.'",
        "'speaker_0': 'When was the last time commercial rates were higher than they currently are?'",
        "'speaker_10': 'Well, commercial rates do go up and have gone up in the city.'",
        "'speaker_0': 'So that do currently. When when was the last time commercial rates are higher?'",
        "'speaker_10': 'They are gone up considerably over the last couple of years and pretty significantly highest rate. And we've had what we did we did have our financial consultant review this and to review the assumption. And what he said is basically what I'm telling you, which is, Jenn, do I think this is possible if all of these amenities are'",
        "'speaker_10': 'built? Could they achieve these values? Yes. Is there a risk that they don't I mean, yes. That these are aggressive values that there and and but we do think that in the realm, given all the amenities and infrastructure that are being built, that you could achieve them.'",
        "'speaker_10': 'There is a risk, though, that.'",
        "'speaker_0': 'You know, my question was, when was the last time commercial rates were higher than they are now? Isn't this the highest that we have seen them?'",
        "'speaker_10': 'Well, but every we've seen in the last five years, if you look at the trend is growth.'",
        "'speaker_0': 'I know. But currently. So regardless of what is this risk is whether or not your your statement is commercial only phase requires sufficiently strong market to support it actually requires a I believe this is what I want you to clarify a stronger market than what we currently have.'",
        "'speaker_0': 'It doesn't pencil out at current rates. That's what you're saying, right?'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'So it doesn't pencil out current rates. And current rates for commercial are actually the highest that we've ever seen.'",
        "'speaker_10': 'Well, it's also the type of product, so you can hear from them.'",
        "'speaker_0': 'But so I appreciate that. But I know.'",
        "'speaker_10': 'But I want to say is that we think that there's there's a market for office higher intensity development like office R&D, whereas now we really see more light industrial. So what we're saying is that you're you're going to be able to attract higher intensity, higher value commercial uses because you have amenities and other things there.'",
        "'speaker_10': 'You have housing. So currently there's not a market for office at all going to point. But we think because of the amenities and things being provided, phase one, that there is a possibility, a real possibility that you could achieve that as part of phase three.'",
        "'speaker_10': 'Can we tell you now that that's a for sure guaranteed we can't. And that's why we want to disclose that there is a risk that you don't.'",
        "'speaker_0': 'All right. Thank you. Resort member Ashcraft.'",
        "'speaker_6': 'You would would you say that these estimates and projections are on the conservative side?'",
        "'speaker_10': 'I, I would say that on the phase three commercial values there, they tend I don't think they're extremely aggressive, but I think they're on the more aggressive side. They're not on the conservative side.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'All right.'",
        "'speaker_10': 'So we think they're in the realm of reasonable and we've had our financial consultant review them and they think they're in the realm of reasonable. But they do assume that you're getting a higher value product like office for at least some portion of the square footage.'",
        "'speaker_0': 'Okay. Member Odie.'",
        "'speaker_9': 'I just want to check the pulse of my colleagues. If we would like to hear from the developer, maybe ask them some questions.'",
        "'speaker_6': 'Slightly.'",
        "'speaker_9': 'Before we go into public comment.'",
        "'speaker_1': 'Or.'",
        "'speaker_0': 'So. I just think I'd like to.'",
        "'speaker_6': 'Comment, but I'd like to hear from you. We've heard from this. I would like.'",
        "'speaker_10': 'To hear and I think some of these questions about the commercial I think would be great because we do have a commercial developer as part of their team, Joe Ernst, and he can answer some of these questions and explain to you his assumptions as well.'",
        "'speaker_10': 'But I wanted you to know that we vetted them independently as well.'",
        "'speaker_0': 'So we have about 12 speakers from the public. My preference would be to go to them at this point. But would counsel like to do?'",
        "'speaker_5': 'Madam Mayor, I'd like to hear the answer to the financial question, and I think the public is going to come up and speak, might benefit, might want to hear that, too.'",
        "'speaker_0': 'So in regards to that comment. So who would like to speak on behalf of the developer in regards to the financial question?'",
        "'speaker_5': 'Well, I actually have a little presentation there. Some comments I would like to make. What's before you is essential for the success of this project, and we are committed to the success of this project. A firm indication of that is we're prepared to fund a million and a half dollars in order to pursue this extension as it's'",
        "'speaker_5': 'which is above and beyond or greater than what was underwritten or required in the DDA. So I think that that's intent of our good faith to move forward here. But I'd like to without, you know. Restating everything that you've heard in the past.'",
        "'speaker_5': 'And it costs have gone up they have gone up dramatically for construction projects throughout the bay area. This is not unique to alameda. Revenues are neutral to somewhat negative. And we've seen that those have been, you know, headline stories we have just contracted for in capitalized $135 million project in Oakland, downtown Oakland, that we hope to start'",
        "'speaker_5': 'in the next several weeks. And the project's hard costs have increased nearly 30% in the three years since we've been involved with that. So it's an indication of that project is is largely a union. The remainder of it is commercial prevailing wage.'",
        "'speaker_5': 'So we have a good sense of what these projects that we're proposing here on Alameda Point are going to cost. And our objective has always been, one, to maintain the integrity of the master plan, all of the public improvements, the parks, the commercial area, the quality architecture, the affordable housing, these are all elements and we haven't changed'",
        "'speaker_5': 'those elements. We want to build those elements since we were last in front of you in January. We've completed a there's been a lot of progress on a number of fronts working with the city. The ferry terminal has been financed, so we have a ferry that's ready to go.'",
        "'speaker_5': 'All first phase sites are approved, are entitled with the exception of BLOCK nine and BLOCK nine went through a study session in May and we think that was a good study session and we think will be approved in the next 90 days.'",
        "'speaker_5': 'All phase one infrastructure improvements are approved, permitted and contracted. We have a PSA with a builder on a purchase and sale contract with a builder on block blocks six and seven, as was mentioned. And we can talk more about it.'",
        "'speaker_5': 'A USD is very supportive our of our proposal to build teacher and faculty workforce housing on block 15. AP has committed to the extension of the DDA. We've received VASH certificates and VPI and AHP funding for BLOCK eight.'",
        "'speaker_5': 'The Navy has conveyed and store line draft or excuse me has conveyed storm drain line G and the city has acquired now all the first phase land which it didn't have when we were last in front of you.'",
        "'speaker_5': 'We've resolved and remediated new on site contamination contamination issues which relate to BLOCK nine. The continued phase zero activities, including what Vive's return, has been an ongoing success. The containers have been acquired for the Container Village and we're currently processing permits.'",
        "'speaker_5': 'Number 12 Planning Committee. The Planning Board unanimously approved the RE phasing the relocation of housing units from blocks one, two and three to block 15, which move the residential units off the Navy's environmental remediation area and adjacent to the Main Street area, and the relocation of the mod of the monitoring units and the introduction of workforce teacher'",
        "'speaker_5': 'housing was something that they supported and as previously noted, 50% of the entire 800 units are affordable. I want to talk a little bit about, since it's come up about the moderate units, the moderate units in the city of Alameda for one bedroom, the moderate rent is 20 $300.'",
        "'speaker_5': 'The two bedroom unit is 20 $800. The three bedroom unit is 30 $200. Through our program that we're proposing without with a U.S. city, we're looking to achieve rents of 1500 dollars for a one bedroom unit, $2,000 for a two bedroom unit, and 20 $500 for a three bedroom unit.'",
        "'speaker_5': 'We can do this. We have done it with other school districts throughout the Bay Area. We work exclusively with school districts in which we are developing and it's our way of giving something back to those communities. And consequently, we think this is a very promising program and a great development for our site.'",
        "'speaker_0': 'Before we move on, are you guaranteeing those dollar amounts?'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'No, we're not making them. But I can.'",
        "'speaker_0': 'You may continue.'",
        "'speaker_6': 'What are you doing, Mr. Dorfman?'",
        "'speaker_3': 'If you're guaranteeing.'",
        "'speaker_5': 'I can tell you that the rents are set at levels that cover 100% of the operating costs and the principal interest on the bonds and a reserve. And based upon those rents, we have achieved these these rental rates before.'",
        "'speaker_5': 'And we will we think that it's achievable here as well.'",
        "'speaker_0': 'But you're not willing to guarantee them?'",
        "'speaker_5': 'We don't guarantee we can't guarantee the success of our project once we build it. That's a function of the market. It's a function of a lot of things that are outside of our control. But we can what we can do in.'",
        "'speaker_5': 'We do successfully. And the reason why we're here is we lay a foundation that allows for success. So we're comfortable that this will move forward. We're confident that we can achieve these objectives.'",
        "'speaker_0': 'Are you guaranteeing phase three will be built?'",
        "'speaker_5': 'As I said, we cannot guarantee things that. Can you guarantee phase three is going to be built? I don't think so.'",
        "'speaker_0': 'I'm actually asking the developer is the developer's job. Thank you.'",
        "'speaker_6': 'Number Ashcraft So I'm staying on the the school workforce housing for the moment. Mr. Dorfman, have you built these sorts of projects in other jurisdictions?'",
        "'speaker_5': 'Yes, we built them in San Mateo, Redwood City, and also in Santa Clara.'",
        "'speaker_6': 'And they're completed. They're up and.'",
        "'speaker_5': 'Running. Yes. Okay. Yeah. There's a track record. And and really, as teachers in particular are getting priced out of these markets, I think it's incumbent for recruitment and retaining of particularly entry level teachers that school districts move forward with these sorts of programs.'",
        "'speaker_2': 'And we're out of here.'",
        "'speaker_6': 'Sorry. Oh, sorry. The rest of the question and the model that you're proposing with a USDA workforce housing is the same or similar?'",
        "'speaker_5': 'Well, it's actually somewhat better by virtue of the fact that we can control the land and the infrastructure through the current phasing of the project. One of the reasons why the school district was looking at its site out at the base but is having trouble underwriting is the fact that there is infrastructure costs of a million and'",
        "'speaker_5': 'a half per acre. Those costs go away because we're providing that infrastructure.'",
        "'speaker_0': 'Now member.'",
        "'speaker_9': 'Thank you. Just a quick question on the teacher housing. So two parts. I mean, can you tell us about the occupancy rates in the previous projects you've done for teacher housing and then what the what the plan is if you don't have enough uptake?'",
        "'speaker_9': 'Sure. If we don't have all of the units rented by teachers, the demand isn't there.'",
        "'speaker_5': 'Sure. Well, first off, relative to the other programs and this goes back to 2001, the occupancy rates have always been virtually zero or excuse me, virtually 100% vacancies in virtually zero. They've had waitlists because there's so much under market.'",
        "'speaker_5': 'So it has been a real inducement for those school districts. And each one of those school districts is looking at expanding their teacher housing communities. With regard to the benefits of the Second Amendment of the DDA to the city, it does allow re phasing to develop housing outside of the contaminated areas and adjacent to the Main Street'",
        "'speaker_5': 'neighborhood. This infrastructure is important for the Main Street neighborhood to move forward and it also retains the proposed commercial square footage and plan and that is being moved adjacent to the enterprise zone. So it's a it's it's tying in real well to the overall plan in which the site is nestled.'",
        "'speaker_5': 'It moves 32 moderate units to block 15 to allow the AUC teacher housing staff to move their teacher staff housing to move forward. It expedites delivery of phase two land and phase three land, and it provides $150,000 payment to the city as part of our extension.'",
        "'speaker_5': 'I'd also like to just add that if this doesn't move forward, what the city forgoes is the new ferry. It forgoes 200 affordable housing units. It forgoes thousands of local and high paying construction jobs. It forgoes all the parks that are part of this plan.'",
        "'speaker_5': 'It forgoes the revitalize revitalization of Alameda Point and the improvements for site B and the neighborhood, the Main Street neighborhood. It forgoes $500,000 of sports complex payments that were still scheduled to make it forego 600 units of market rate product that will relieve the burden on the remaining housing stock that you have.'",
        "'speaker_5': 'One of the reasons why you had so many issues with rents rising is because there isn't an outlet for new residents or higher paying residents to move. Clearly, that's a target for us. And I will further add that, you know, virtually all of the multifamily units and 10% of the townhome units are a universal design.'",
        "'speaker_5': 'There's a lot of pluses that are part of it. We're at a critical juncture here, as we've shared with city staff and city staff has communicated to you. We're at close to a break even on this. We're willing to move forward on that basis.'",
        "'speaker_5': 'We need these concessions. To the extent they're concessions, I think it's a win win. But nonetheless, we request your consideration. Thank you.'",
        "'speaker_0': 'Any other questions?'",
        "'speaker_9': 'Remember, I still had my original question. Are you going to be able to get the financing? I mean, I am still waiting on an answer to that.'",
        "'speaker_5': 'Yes. I am confident we are going to get the financing by.'",
        "'speaker_9': 'What do I do? You have an idea.'",
        "'speaker_5': 'We are still negotiating right now. Again, the our negotiations are somewhat contingent upon what happens tonight, but this will certainly move it forward.'",
        "'speaker_0': 'And can you clarify, is that the financing for phase one or for all three phases?'",
        "'speaker_5': 'This is financing for phase one. So phase one is, if I may. Phase one is roughly a $500 million project.'",
        "'speaker_0': 'Okay. So you're confident you're going. So when you say so, you're saying you're confident you're going to get financing for phase one? What about phase two?'",
        "'speaker_5': 'I think that phase two financing. I'll let Joe speak to the commercial component. But for the residential component, yes, I'm confident we can get the financing for that.'",
        "'speaker_0': 'Okay. And what about phase three?'",
        "'speaker_5': 'I'll let Joe speak to the commercial component.'",
        "'speaker_0': 'Okay. Got it. Any other questions from counsel?'",
        "'speaker_6': 'No, but I think we want to hear from Mr. Ernst.'",
        "'speaker_0': 'So I'm hoping that whomever is going to stand up next can is prepared from the developer side to answer all the questions so that we can then get to public comment. Mr. Owens, would you like to try to help us out on this here?'",
        "'speaker_1': 'So the questions are phase two and phase three commercial, is that correct?'",
        "'speaker_0': 'Apparently, that's what he's not able to answer. He said to go to you.'",
        "'speaker_1': 'So, yes. So the phase two commercial I have we have a partnership, the same partnership that is currently doing Buildings nine and 91 rehabbing those buildings are the same partners I have for the phase one and phase two commercial, which specifically includes Blocks ten, 16, 17 and 15.'",
        "'speaker_1': 'A It's about 267,000 square feet of commercial there. And so we've, you know, through our activity in marketing nine and 91, we are seeing a lot of interest. Some of that interest is contingent on seeing site go forward.'",
        "'speaker_1': 'So but we are having success. It's requiring a lot of concessions, it's requiring a lot of work, but it's planting the seed and the whole argument with, you know, phase the moving commercial to phase three. I mean, I think we're still pretty balanced.'",
        "'speaker_1': 'We're still offering the same amount of commercial. But you could argue the phase three commercial is kind of following the same arguments that we've had about site B that, you know, we need to create A there there with, you know, amenities, housing, infrastructure, transit.'",
        "'speaker_1': 'You know, we're still committing $600,000 a year to transit programs for site. We are we are negotiating a lease right now for building nine at a buck 33 per square foot net. We have pro forma and phase three which is ten years out at only a buck 85 net.'",
        "'speaker_1': 'So I feel like we've been very conservative. If you look at this, downtown Oakland. Oakland is now the hottest market in the country for office space in terms of rent growth and vacancy. And why is that? It's because now there's a there there in the last cycle with Jerry Brown's ten K plan, we now have people living'",
        "'speaker_1': 'in downtown. Restaurants have moved in and now businesses want to be there. That's the same thing we're going to do at City.'",
        "'speaker_0': 'Okay. But can you answer the question?'",
        "'speaker_3': 'What's the question?'",
        "'speaker_0': 'Are you confident you're going to have financing for all of phase two, including the commercial? I am.'",
        "'speaker_1': 'Confident we will have.'",
        "'speaker_0': 'Financing. Are you willing to guarantee that there.'",
        "'speaker_1': 'Are no guarantees in this.'",
        "'speaker_0': 'Business? The answer's no. Okay. What about phase three?'",
        "'speaker_1': 'I'm confident we will be able to raise the financing, but I can't guarantee that.'",
        "'speaker_0': 'Okay. And will you bond out that it's.'",
        "'speaker_1': 'Not bond double? There's nothing to bond today.'",
        "'speaker_0': 'So is there anything you can put up then that the city has assurances that the complete project will be built all three phases because the housing is in the first two phases.'",
        "'speaker_1': 'I mean, just just my word and reputation, given what we've done over 20 years in this in Alameda, we've developed 3 million square feet. You know, we took over Harbor Bay Business Park in early 2000. There was 100 acres of vacant land that had been through bankruptcy twice.'",
        "'speaker_1': 'And we've now developed it all with good companies, now very high tax generator for the city. So, yes, based on our track record, I'm very confident we can do that.'",
        "'speaker_0': 'But you don't think there's any mechanism or tool that can be offered to the city to guarantee that those phases will be built in entirety?'",
        "'speaker_1': 'I think the best guarantee for phase three to be built is to get phase one built.'",
        "'speaker_0': 'You don't think there's any kind of bond that can be put up for the city?'",
        "'speaker_3': 'There's nothing.'",
        "'speaker_0': 'Personal.'",
        "'speaker_1': 'There's no market for a bond like that.'",
        "'speaker_0': 'All right. Thank you. Any other questions from counsel? All right. I'm going to go ahead and call the public speakers then. Thank you. I'm Mike Gaines. And if you guys could if you could line up the first three or whatever so that we can try to move this along.'",
        "'speaker_0': 'Mike Gaines, it looks like. And then David Craig. Leslie Cameron, thank you.'",
        "'speaker_5': 'Hello, counsel. My name is Mike Gaines. I'm the director of the Board of Your Society, a circus dance and performance company that has perched its 12,000 square foot tent out on the taxiway. Three months this year and three months last year.'",
        "'speaker_5': 'We've brought more than 10,000 people through to our events, and we just finished a successful run of a dinner theater show for the past month. And we lost our space in San Francisco two years ago to development and and met shortly thereafter Joe and his partners.'",
        "'speaker_5': 'And they open their arms to us and gave us a place to perch this monstrosity of a tent. And we have. So I'm really here as to support the character of the people that I know who, again, have opened their arms and helped subsidize some of our our stay here.'",
        "'speaker_5': 'And we've since moved 60 of our casting crew to Alameda. We rehearse there on a daily basis. And the economic impact isn't huge of my company on Alameda but you know over over time.'",
        "'speaker_7': 'And it has been.'",
        "'speaker_5': 'Substantial we believe we also produce corporate large corporate events and we brought C-2 out for a 21 day stint on and they used our tent. And so we we. We love our mirror in in the way that we are have invested all of ourselves in it and and support this project to its fullest.'",
        "'speaker_5': 'And.'",
        "'speaker_0': 'Thank you. Thank you, David Gregg. Then Leslie Cameron. And that might be what it is.'",
        "'speaker_1': 'And good evening, Mayor. Members of the Council, thank you for giving me the opportunity to speak tonight. My name is Daniel Gregg. I'm a field representative at Carpenters Local 713 and Hayward. I represent approximately 35,000 carpenters in Northern California.'",
        "'speaker_1': 'Encourages me to see a development.'",
        "'speaker_5': 'Team move in the right direction by continuing to commit to the city of Alameda, the surrounding community, and to labor. Alameda Point site will indeed revitalize.'",
        "'speaker_1': 'The surrounding area. This project provides much needed housing for both market rate. And even as we begin to see rent stabilize a significant amount of affordable housing, it will include hundreds of thousands of square feet of commercial and retail bringing jobs back to Alameda.'",
        "'speaker_1': 'The developer is also committed to the use of a responsible general contractor. A commitment to labor on a project like this means certified apprenticeship, local hire and the payment of area standard wages and benefits, which is a living wage.'",
        "'speaker_1': 'This creates career pathways for good paying, head of household jobs for individuals who will place money back into the local community.'",
        "'speaker_5': 'Perpetuating economic growth.'",
        "'speaker_1': 'And closing the Carpenters Union fully supports this development. We ask council to accept staff's recommendation.'",
        "'speaker_5': 'And move it forward. Thank you.'",
        "'speaker_0': 'Thank you. Leslie Cameron and then Jim Summers.'",
        "'speaker_3': 'Hello.'",
        "'speaker_2': 'Mayor and council members. My name is Leslie Cameron, and along with my partners, we own Bay Shipping Yacht Company here in Alameda. And I'm going to be very brief without reiterating any of the points anyone else has made, just to say that the time is now and we support this project.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Jim Summers. And then Kari Thompson.'",
        "'speaker_1': 'Good evening, Mayor. Members of the council. Good to be here this evening to support this project. I'm vice president of Silvergate Construction. We are a company was founded right here in Alameda in 1932. Seeing the history of Alameda, how it's built out and we're excited to be a part of this project.'",
        "'speaker_1': 'For the last 18 months, we've been working closely with Alameda Point Partners. They're a very professional and knowledgeable group. They have challenged us to be. What I would call sharpen our pencils and understand how they can get value engineering done, get the best price possible to make this project work.'",
        "'speaker_1': 'This project will employ hundreds of people. Right now, we currently employ over a thousand people during the peak of the construction season, and all of them are local operators, laborers, all in the union. We're ready to mobilize on this project as soon as we get a green light from Almeida Point Partners.'",
        "'speaker_1': 'We worked with many of the different groups over the last 15 years that have looked at this project and tried to bring it to fruition. And I would say that with my personal knowledge of the different groups that I've worked with over the last 15 years, budgeted for given estimates, too, I'd say that the group that you'",
        "'speaker_1': 'have here right now before you is the group that's been the closest that I've ever seen to getting this done. They have a group that is dedicated to making this project work. Track record, as you heard from Mr. Ernst earlier and Mr. Dorfman earlier.'",
        "'speaker_1': 'Anecdotally, I want to stress that something that Mr. Dorfman said, that the prices have gone up. You know, this isn't the only project we work on. We're working on literally probably dozens of projects throughout the Bay Area, from the peninsula all the way into the North Bay.'",
        "'speaker_1': 'The 30% number that he used is very accurate. We're seeing every one of the builders and developers that we work with and literally we work with almost every one of them, the Bay Area, they're having the same challenge.'",
        "'speaker_1': 'The vertical costs are going up dramatically and they're trying to adjust to make it work. When you look at the amount of equity that they put into this project already and what they've accomplished so far, faced with the option of moving forward and trying to restart the process, I think you'd be well served to approve this tonight'",
        "'speaker_1': 'and let them get across the finish line. I hope that you approve this this evening, because I know that this will be the first step in letting the redevelopment and reuse of Alameda Point provide many jobs and much housing that's needed in Alameda.'",
        "'speaker_1': 'Appreciate your concern and approval this evening. Thanks.'",
        "'speaker_0': 'Thank you. Carrie Thompson and the Michael McDonough.'",
        "'speaker_2': 'Good evening, Mayor and City Council. I'm Kerry Thompson. I'm the chairperson for the Government Relations and Economic Development Committee for the Alameda Chamber of Commerce. And we fully support this project. We would like to see that this may have been a bump in the road, but that this road will continue to get paved and maybe even a'",
        "'speaker_2': 'wonderful road down the road, down the line. The option of it not happening is unthinkable. At this point, it really is. Nothing has been done for far too long. And so it needs to continue. And if there are changes that need to be made, they need to be made from a banking perspective.'",
        "'speaker_2': 'I fully understand that they need this process tonight to go forward. Otherwise it is hard to get financing. Nobody wants to do anything on something that there is no guarantee from anybody. And as you heard, they cannot guarantee the future is is uncertain for everyone.'",
        "'speaker_2': 'I mean, we don't even know if tomorrow is going to come. So, you know, in the long run, this just makes sense to continue to go forward. Thank you.'",
        "'speaker_0': 'Thank you. Michael McDonough and then Linda Astbury.'",
        "'speaker_1': 'Good evening, Madam Mayor. The rest of the council and staff. I'm Michael McDonagh, president of the Alameda Chamber of Commerce. After Mitt. I'm a little upset right now. I can understand being a little cautious after a developer going into default, but I can also understand that it was a design strategy that was actually agreed upon in the'",
        "'speaker_1': 'initial DTA that this could happen. Nothing said tonight was not something that was planned for previously. And you know, we have, as the Chamber of Commerce have always been very respectful to everyone here on the dais. But tonight, I'm a little upset.'",
        "'speaker_1': 'I do understand cautiousness. But what I don't understand. Is being worried about the risk of not getting $4 million and a sports complex. Isn't the real risk not having. A modern infrastructure for the existing businesses out on Alameda Point that really need that in order just to operate their business.'",
        "'speaker_1': 'Now, I don't know what caused this power outage over the weekend, but it's happened before for other reasons. And these businesses out there need the current need, the more modern infrastructure. They're not going to be here for forever waiting on that.'",
        "'speaker_1': 'It was a promise that was made when we started leasing out those areas, and it's a promise we need to keep. Number two, risk of not having this badly needed affordable housing. It's a shame if we weren't able to approve that for what's needed out there right now.'",
        "'speaker_1': 'And if we can get the teachers in there, great. Even greater and even lower than than the the average affordable housing. Number three risk of not having in fact. Now. I can't even read my writing right now. So.'",
        "'speaker_1': 'Number three, of having to start all over again with a developer that we don't know. They will face the same costs and the same financing challenges as our developer that we've been working with. For how long has it been now?'",
        "'speaker_1': 'A couple of years, it seems, and we had a deal and things change. But frankly, I think change for the better in many ways. After all, this developer has proven itself itself time and time again. And now here we are questioning his integrity.'",
        "'speaker_1': 'I don't understand how we're looking for the the city to make more profit because of delays out of their control. Penalizing the developers for things that are not in his control. Are we really penalizing those businesses out there now that need that infrastructure?'",
        "'speaker_1': 'Are we really penalizing the people who need affordable housing? Are we really penalizing the entire community who have waited 20 years to have a dilapidated military base developed into the jewel of the bay, which I really believe can happen?'",
        "'speaker_1': 'And the last thing I would say is from chaos rises opportunity and there's a lot of opportunity in.'",
        "'speaker_0': 'Moving Salisbury and the wrong Curtis.'",
        "'speaker_2': 'Linda Asbury, executive director of the West Alameda Business Association. Mayor Spencer and Council. I'm delighted to be here and on behalf of the board of directors and some of you know them personally, and you've known that they've been invested in this community for a very long time.'",
        "'speaker_2': 'I'm on behalf of them saying we totally support what's been put before you tonight, the staff report, and we're hoping that you will see it that way, that this is great progress, a little someone sad, a little bump in the road.'",
        "'speaker_2': 'And I we understand that. But on behalf of our board of directors in West Alameda, we strongly think this should go forward. Thank you.'",
        "'speaker_0': 'Thank you. Ron Curtis and Janice Curtis's sitting time to him. So he has up to 6 minutes.'",
        "'speaker_5': 'Madam Mayor. Members of the council. My name is Ron Curtis. I'm a member of the Planning Board. I voted for this project, and during the discussion of the project, one of my main concerns was the fact that the developer was in default.'",
        "'speaker_5': 'The projections going out created a lot of risk as we went from from phase one to phase two to phase three. At Phase one, I'm pretty sure that everything will be successful. Phase two all the houses are built and benches and essentially most of the cash has been generated for this project.'",
        "'speaker_5': 'Phase three, these things up in the air now. Staff has done an incredible job working with the developer in terms of developing this plan, which phases the development. It's a good development. It's phased as good as it can be to get done what needs to be done.'",
        "'speaker_5': 'The thing that's missing is the assurances that the development will be completed. And I heard tonight that you can't bond anything in in in in phase three because there's nothing bond about this whole development is a contract. And you can put up a letter of credit.'",
        "'speaker_5': 'You can put up a bond. In some amount to assure that it's being done. I could think of nothing worse than the developer taking the money out of the project with all good intention. Going to go to stage three and leaving the city holding the bag.'",
        "'speaker_5': 'Ergo, the taxpayers holding the bag. You know, it's tough to get up here listening to the support because it is a good project. It's a great project. But there's risk that goes with it. And the city shouldn't be the one holding the bag with all of the risk.'",
        "'speaker_5': 'The risk should be shared. And it's tough for all of you up there because you have the responsibility to take the action to support this, the taxpayers, and to protect them for something that that doesn't doesn't happen. But whether it's a letter of credit, whether it's it's it's bonding, a portion of the future improvements.'",
        "'speaker_5': 'It. It can be a determination made between staff and the developer, but provide some sort of protection to the city in some kind of a penalty if the thing isn't completed. That will give to you the protection and security that you need.'",
        "'speaker_5': 'You're going out a lot of years and a lot of things can happen. And I could think of nothing worse for jobs and for the city to get halfway through a phase and then say, hey, we can't do it because.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you. On Andreas Cleaver. Cleaver and then Doug Biggs.'",
        "'speaker_5': 'Good evening, Mayor Spencer. Council members and staff. My name's Andreas Cleaver, Secretary Treasurer of the Alameda County Building Trades Council. And on behalf of our 28 affiliated unions, we strongly urge you to support the amendments to the DDA on this project.'",
        "'speaker_5': 'At first I'd like to just kind of go down a little bit of memory lane here. I mean, we've been involved as building trades on partners, on the development of Alameda Point for quite some time now. And we've gone through a series of developers which I will not bring up.'",
        "'speaker_5': 'And I think it's important to note with this developer, they are true partner. They came out, we negotiated and worked on a project labor agreement with them in 2015 and since then they haven't wavered from that from those commitments in terms of having good union jobs on this site.'",
        "'speaker_5': 'In addition to the fact we now have the project labor agreement with the city, thanks to you and we're really upping our recruitment for a city of Alameda residents into the trades and we just a great opportunity for those residents as they mature into journey workers to be working out on the site.'",
        "'speaker_5': 'As indicated, construction costs have gone up. That's not a reflection of labor rates. Labor rates have kind of stayed up with inflation of that. It's just a very competitive environment. It's a construction boom going on. And, you know, and the development world is a very uncertain world.'",
        "'speaker_5': 'It's it's a world where market forces can kind of change the direction of project. So that's what's happening. And we have to work to help to try to make this project a reality. I think the wins for the city were mentioned by a lot of the previous speakers and we need to see this project move forward.'",
        "'speaker_5': 'This amendment is necessary to move that project forward. And finally, I mean, development is a risky and uncertain business, there's no doubt about that. And but if this amendment is not approved today, the only certain we have is this project will die.'",
        "'speaker_5': 'And it'll be years before we're back here trying to move this forward. So from the building trades, we strongly urge you to support this amendment. Thank you very much.'",
        "'speaker_0': 'Thank you. Doug Biggs and then and MC Harrigan.'",
        "'speaker_1': 'Good evening, Madam Mayor. Members of the City Council. My name's Doug Biggs. I'm the executive director of the Alameda Point Collaborative. I want to first talk about the some of the changes that are being proposed. And to let you know that we think it's a vast improvement over what the initial design was.'",
        "'speaker_1': 'We had concerns initially that were addressed in the DDA about keeping those large warehouses and making that kind of an impermeable barrier between our neighborhood and theirs. The new design with the teacher housing really opened that up and provides a very fluid opportunity for our residents to be able to access the main or the the main commercial'",
        "'speaker_1': 'area, the very point. So that's a huge improvement. Moving infrastructure into in the phase one initially that was going to be in phase three up in that area. That would make it a lot harder for our development to move forward now because they put housing up there, the infrastructure has to go up there in phase one.'",
        "'speaker_1': 'That's going to make our job a lot easier. That's why we want this to happen. Why do we need this to happen? Let me just share my last week out at Alameda Point on Friday, we lost water service to Building 92.'",
        "'speaker_1': 'What does that mean? That means on Saturday, we have 200 people coming out to use the food bank. We don't have restrooms for them. That means the Red Cross that uses the water to make ice to carry out on their mobile blood drives may have to cancel those blood drives.'",
        "'speaker_1': 'I call the city. The city says, no, we don't handle water out of alameda point. Better check with the contractors. I literally had to drive around to five buildings around that area to ask if anybody had shut off the water.'",
        "'speaker_1': 'By the time I figured out what it was, it turns out it was a contractor on behalf of the city that was mapping the water lines and it turned a waterline off. Luckily, he came out about 7 p.m..'",
        "'speaker_1': 'We turned it back on up until Saturday at noon. We were still dealing with rust in those pipes and the water was coming out of the fast brown that infrastructure at Alameda point. Yesterday, we lost power. All of West Alameda.'",
        "'speaker_1': 'If you saw the tweet from Alameda Municipal Power, they said that overnight there were 3 to 5 buildings that still didn't have any power. There were 4 to 6. Building 92 was also with power. But guess what? Alameda Power didn't know that because the maps were incorrect.'",
        "'speaker_1': 'The infrastructure is so bad out there, people don't know where the lines are going. That's the infrastructure we're living with now. That is not Alameda infrastructure. That is not first world infrastructure. And if you decide tonight. Do not move forward.'",
        "'speaker_1': 'You're taking on the burden of responsibility to say to the businesses out there, the residents out there, we deem that you deserve to live with this kind of third rate infrastructure. We decided it's not important enough to move forward on this.'",
        "'speaker_1': 'That is a typical week for us nowadays, and it's only going to get worse. Chances are because of that water outage, we've now got damaged pipes. So we're going to have to go back in and work on it.'",
        "'speaker_1': 'Just going to get worse that we really need to move ahead on this. I understand there's risk, but there are huge risks to the city. If you decide that the people and the residents and the businesses that are out there don't deserve better.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you. And Mekere here again and then Laura Thomas.'",
        "'speaker_2': 'Good evening, Mayor. Council members and staff. My name is and Mike Harrigan. And this evening I am here on behalf of the AUC Board of trustees. As you know, California is one of the lowest per pupil funding states in our country.'",
        "'speaker_2': 'With that, in our immediate area, Alameda Unified is the lowest funded district in our county. As you can imagine, this makes it very difficult for us to be able to pay our teachers and employees a wage that they deserve.'",
        "'speaker_2': 'And so one of the most difficult things that we face is recruiting and retaining our employees. The board began investigating a variety of different ways of trying to help do that with without having the ability of being able to do it through a salary.'",
        "'speaker_2': 'And one of those things was through being able to provide housing for our employees. In a recent study that was done, of which 523 of our employees responded, 45% stated that they did not live in the city of Alameda.'",
        "'speaker_2': 'Of that, 45%, 80% of those respondents said it had to do with cost that they could not afford to live in the city where they worked. At the last school board meeting, we were our staff presented two options that we had for housing.'",
        "'speaker_2': 'One was the option that was that is addressed today related to site. The other is the option of going forward on something on the land that we have already in out on the point. What I can tell you is that site which is larger and could possibly provide more housing the cost, although we really couldn't even clarify'",
        "'speaker_2': 'it, is almost double of what we're looking at. And the reality is there's probably much more that at this point they couldn't even begin to determine what that was. What I can tell you is of the two that were placed forward, every board member enthusiastically and I will highlight enthusiastically directed staff to move forward with the site'",
        "'speaker_2': 'plan. By doing this, you do two things when you support this site moving forward, which is very important to this community. But on the other hand, you also would be able to give us the ability, the district, the ability to be looking forward to provide that affordable housing for our employees.'",
        "'speaker_2': 'So on somewhat of a personal note, because of what I stated before or funding has always been so tight, it's not unusual for districts to have to come up with creative solutions. And I can personally say that I was very excited with this creative solution that was brought forward, and we are looking forward to hearing from staff'",
        "'speaker_2': 'who we do know is working diligently with the developers to give us the final numbers on this. So thank you.'",
        "'speaker_0': 'Thank you. It's now 1030, so we need to have a motion to hear the balance of the agenda. The other agenda items remaining are six C, which is approving a lease with Force 60, the ordinance for a 15 year lease with Teleport Communications and my Referral nine A regarding cannabis businesses.'",
        "'speaker_6': 'So then there was also the.'",
        "'speaker_9': 'Five eight.'",
        "'speaker_0': 'Yes, you're right. Ten A delegation.'",
        "'speaker_8': 'I remember.'",
        "'speaker_6': 'From the Highlander five F.'",
        "'speaker_9': 'Has in Frank.'",
        "'speaker_0': 'OC five F but also I'm sorry, 1010 A the designation of voting delegates for the league.'",
        "'speaker_3': 'So move.'",
        "'speaker_0': 'So is there a second?'",
        "'speaker_9': 'Can I just a question? How many speakers do we have for the remaining items? Eight. And that's all on ten and the referral or I'm sorry, nine. I mean, could we, we cut that to 2 minutes each.'",
        "'speaker_6': 'Or can we say that we won't go past 11 p.m.?'",
        "'speaker_0': 'Well, I'd like.'",
        "'speaker_3': 'To be so.'",
        "'speaker_0': 'Okay. I personally would prefer the 2 minutes each.'",
        "'speaker_9': 'So if.'",
        "'speaker_0': 'Entertaining that I'd be fine with that.'",
        "'speaker_1': 'Moved. Oh, I'd be fine with that.'",
        "'speaker_9': 'Then I'll second.'",
        "'speaker_0': 'All those in favor. I.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'I. How many votes do we need at that point? We need three or four. We need four. So I heard three.'",
        "'speaker_6': 'So.'",
        "'speaker_0': 'But we have a fourth.'",
        "'speaker_2': 'Oh. Okay.'",
        "'speaker_0': 'All right. Well, yeah, Lord, thank you. Thank you. Member Ashcraft. All right. We're going to roll it. So that was Mr. Kerrigan. Next speaker is Laura Thomas and then Karen Bass.'",
        "'speaker_2': 'Good evening, counsel Laura Thomas with renewed hope housing advocates. I'm actually feel my heart pounding because this is such an important project. I don't even know if I can speak.'",
        "'speaker_9': 'Tell you the truth.'",
        "'speaker_2': 'Renewed hopes of the city and got a 25% requirement for affordable housing in 2001. And then because the measure A, we just couldn't get past to fail development developers and now we finally have multifamily housing and we have a really good developer, a couple of really good developers, and the city's worried about its risk.'",
        "'speaker_2': 'We don't risk anything. I don't see what the city risks. Nothing. You have put nothing in. You got nothing out. The developer's putting everything in. And the developers willing to do something that's actually quite difficult. It's actually renewed hopes faltered so hard.'",
        "'speaker_2': 'We asked for 25% affordable housing and it's the right thing to do and they're willing to do it. And what are we doing? Risking. What are we risking? Risking losing the ferry route, risking losing 128, a very low and low income units.'",
        "'speaker_2': 'That isn't being done anywhere, that number anywhere in the Bay Area. And we're risking losing being a failed city, basically, that can't take care of its people, can't create a public infrastructure, can't get public transportation, can't build housing.'",
        "'speaker_2': 'That's what we risk by not going ahead. I don't understand. $4 million for a sports complex, really? I'm sorry. I'm kind of angry. I've been working on this a long time on the behalf of the citizens of Alameda, and I can see how much people are coming together around this project.'",
        "'speaker_2': 'The school part is great, not big because it limits the moderate income housing to the school district because unfortunately that's what it takes to get this project to move forward. But because the school district is now involved and we're all working together, tons of people are working together.'",
        "'speaker_2': 'Thank you. This better go forward.'",
        "'speaker_0': 'Karen Bass. And she's the last speaker on this item. If you'd like to speak on this item, please submit your slip.'",
        "'speaker_3': 'Hey. Good evening, Mayor. City Council staff. I just want to, first of all, thank the developer for their presentation. I think we all needed to hear from them. And I personally and I listened to the list of everything that they've accomplished.'",
        "'speaker_3': 'And that's a sign of a developer here to stay. And it's a sign that the developer is committed to this project, especially include the pre-development cost that they've already spent today. So I'm here to support the site amendment, and I think we need to give this.'",
        "'speaker_3': 'We need to give this developer everything. They need to succeed. Because if they succeed, Almeida succeeds. This changes in development plans happens in development, especially for a development this size and especially for a development with this size and cost.'",
        "'speaker_3': 'Let's not forget the many phases land use changes, financing changes that Catullus went through before they got it right. And now they are in their final phase. I was I mean, I remember coming to the city council and for and I want to disclose I work for Catalyst.'",
        "'speaker_3': 'So I learned a lot about real estate development and construction working for Catalist. So I've seen the number of of of changes that a development plan can go through. It's about market and timing and cost. So I encourage you to approve this site.'",
        "'speaker_3': 'This site, a Second Amendment. And I guess I want to close by saying I'm just really proud that we have a local developer that's managing this this project. So it's it's amazing. And I heard I listened to him talk about his reputation and he has a great reputation.'",
        "'speaker_3': 'And and I think I don't I think we don't want to forget that what he's accomplished and he lives he lives in this community. He's committed. So I just hope you approve this amendment because I think everything is contingent upon site A and he's this developer is committed I heard that tonight in their presentation.'",
        "'speaker_0': 'Thank you JP Fairey and he is our last speaker.'",
        "'speaker_1': 'Mayor Council members, thank you for the opportunity to speak. My wife is a teacher here in Alameda. I live in Alameda. My older son moved back to Alameda.'",
        "'speaker_5': 'After college and I run Alameda Point Studios, which is out on the point. And this this deal is not perfect for us, but we want it. Our sewer line collapses. Electricity comes in and out. There's things that this is just going to help with us.'",
        "'speaker_5': 'We're a community of artists, makers. You know, it's so popular to.'",
        "'speaker_1': 'Call yourself a maker, but that's what we are furniture builders, artists, painters.'",
        "'speaker_5': 'Sculptors, welders. And, you know, it's not this is not going to be perfect for us, but we need it. So we just wanted to put our support behind it. Thank you.'",
        "'speaker_0': 'Thank you. Member.'",
        "'speaker_9': 'Thank you, Madam Mayor. And thank you, everyone, for coming out and speaking. A special appreciation to Jen and all the hard work your team does every day on moving this project forward. Before I go into my remarks, I just do want to point out that we do sit up here and we do have an obligation to ask'",
        "'speaker_9': 'the tough questions. I mean, they may be uncomfortable for some people, but, you know, we do have an obligation to find out the answers. And we do have an obligation ultimately to our entire community. And I mean, to me, the risk is is in the first question that I asked and the last question that I asked, is'",
        "'speaker_9': 'the developer going to come through with the financing if we make these these amendments? Because if we do make them and and they don't, then the whole thing falls apart and then we have nothing. So, I mean, those are the questions I wanted to hear answers to.'",
        "'speaker_9': 'And I wanted to learn more about whether or not we were going to be able to do this. So, I mean, I'm going to analogize with a little story and you'll probably, you know, get the gist of it really quickly.'",
        "'speaker_9': 'It's like, you know, a person searching for a relationship the first time they meet somebody, you know, everything's happy, they get excited, and then they find out a little bit into it that, you know, they're not compatible. And then they move on to the next one.'",
        "'speaker_9': 'So they wait a few more years and they meet another person and they think, wow, fireworks, you know, this is super compatible. And then they find out super early that they're completely incompatible because the other person is just, well, I'm not going to say that.'",
        "'speaker_9': 'So then so then they go on a few more years later and they're a little older and then maybe they're a little more desperate and they think they'll never find partner again. And then all of a sudden, the knight on the shiny white horse rides in and, you know, seems perfect.'",
        "'speaker_9': 'And then they're willing to overlook, you know, an occasional flaw. And there's things that they just, you know, kind of think, okay, I can accept that, you know? But, you know, they never really pay attention. Then a couple of years in, then the bloom is off the rose and they notice some of the faults.'",
        "'speaker_9': 'And then they have to decide, you know, am I going to keep moving forward with this person or am I going to to not? So I think that's where we are today that, you know, there was a lot of expectations.'",
        "'speaker_9': 'There was a lot of the community's hopes. I think there may have been some things that the community may have, you know, overlooked that, you know, maybe we should have looked at as red flags two years ago. But, you know, now they're here and now we have to face them.'",
        "'speaker_9': 'So, you know, we're faced with the choice, you know, like a person in a relationship, you know, do we go through our counseling and find out a way to make it work or do we, you know, walk away?'",
        "'speaker_9': 'So, I mean, I think we've invested a lot in this project, and I am still cognizant of the fact that I am concerned that this is going to to close, but it's not going to close if we don't vote for it.'",
        "'speaker_9': 'So I can tell you that I can tell you right. Right now that's the case. So, you know, just to kind of recap, we've heard a lot of a lot of the the positives and the negatives. And there are certain things certain things about this project that really, really appealed to me and I think are are positives'",
        "'speaker_9': 'for the community the ferry terminal payment getting that done now there's there's things wheels in motion in Sacramento with a bridge toll increase that are really going to make our ferry system boom. So I think we need to be putting it putting ourselves in a position to take advantage of that.'",
        "'speaker_9': 'I mean, the accelerated building of housing, one of the the comments that people talked about that we need we need this housing and now phase two is going to be accelerated by four years. So that's four fewer years.'",
        "'speaker_9': 'I mean, we've waited almost two for this, but now there's four fewer years we'll have to wait for for the phase two project, the teacher housing. And I think that's an amazing coup to to put that together. I mean, there are financing mechanisms that are available for teacher housing that don't exist for the other housing.'",
        "'speaker_9': 'And I think we do owe something to our teachers and give them something back for everything that they've done, you know, to educate our children and make this community great. So, I mean, this is kind of a no brainer, but, you know, no housing on that contaminated property.'",
        "'speaker_9': 'I mean, that was one of the things, you know, maybe we should have raised a red flag about that earlier. But but now that that has been moved to a different area and Doug brought up this point, you know, the more continuity and the fluid ness of the residential neighborhood now that will have an outside A and'",
        "'speaker_9': 'the phase two and then Main Street contiguous with each other. And then also we'll have the commercial on the South Side on contiguous with the enterprise zone. So I think, you know, overall, I think that's a better a better plan and no loss of commercial space.'",
        "'speaker_9': 'I mean, that's important to me. I really hope that when we get to the point where we're ready to go to phase three, that we actually stick to the plan and build commercial there. And no, but I'll just leave that at that.'",
        "'speaker_9': 'And, you know, last but not least, you know, the commitment to labor is critical to me. And, you know, all the jobs that are going to be created and, you know, the wealth that's going to be grown from our working folks.'",
        "'speaker_9': 'So, you know, there are certain things that I I'm not particularly keen about. I mean, I think, you know, the sports complex is an important aspect of this. I mean, I worry about the risk of the $4 million and the overall risk.'",
        "'speaker_9': 'But again. You know, the risk for me is, is the developer going to make the deadline and secure the financing? And they both stood up there and assured us that they would. So I'm willing to like the person that is in the marriage counseling and is asked to take a chance.'",
        "'speaker_9': 'I mean, I'm willing to take a chance and trust them at their word. And I will be voting to move this forward.'",
        "'speaker_0': 'Member matter, S.E..'",
        "'speaker_5': 'I look at this and I think there's a very good layout of the potential. Outcomes of this change of this amendment and staff did a really good job in boiling it down in the in the presentation. I'm willing to support this for three reasons.'",
        "'speaker_5': 'One is the first reason is it commits a substantial amount of infrastructure between at the low end, $43 million immediately. And then with the if for some reason phase two doesn't occur, we still have the infrastructure money from the bonding for the ferry.'",
        "'speaker_5': 'And that's really important because without without sewer, gas, electricity and water, nobody lives there and the businesses deteriorate. Number two is that we have a potential to get affordable housing that is at the highest percentage. And I've been pushing to up the percentage of inclusionary housing.'",
        "'speaker_5': 'This delivers it and it's a small amount in the big scheme of things, but it is a significant amount in Alameda and I think we need to do it. The third is that I don't have. You know, I can I'm willing to to gamble on on not getting the $4 million for the or the sports complex because'",
        "'speaker_5': 'it's offset by the value that's added to our property with infrastructure that is not just in phase one, but. Feeds the north end of the enterprise zone in the south end of the main street. And without if we don't go forward on this, we don't have that.'",
        "'speaker_5': 'So we lose that value. And then lastly. We have an example where and I'm not going to say I don't have faith that phase three is going to happen. So but I will say that I'm skeptical because I saw it happen with Alameda landing.'",
        "'speaker_5': 'And. I will say that I'm not going to be willing to give more houses because that last phase of commercial doesn't pencil not there. So I think I would like to have staff have a way to if phase three doesn't happen, if we don't move forward with that, then there is no right left for the developer that'",
        "'speaker_5': 'the city takes that and folds it into its commercial development, which is happening around count the number of lease options to buy that we've had outside of site A starting with. The areas by the by the married fleet with there's like five or six of them that go up and down up to building nine and 91.'",
        "'speaker_5': 'So I, I think we can do it ourselves, but I don't want to be tied to the developer if they can't do phase three and you know, the show's over. No houses. No, you know, we're not going to give you any anything more to answer.'",
        "'speaker_5': 'Some concerns that people gave me about. Well, what happens if the. The run up on market rate housing continues to escalate and there's a windfall well, in the development and disposition agreement. There's city participation in. Profit over internal rate of return, starting at 18% where we get 10%.'",
        "'speaker_5': 'And one of the things not for tonight, but I'd like us to think about that windfall is going to come from high cost of housing. So the city's participatory fund should go back into subsidizing housing. So you know that that's what I'm looking at.'",
        "'speaker_5': 'And I really want staff to plan for plan for the failure of phase three. I know the developer doesn't want to hear that. I, I've seen what they've done out it at at the Harbor Bay Business Park and I think it's possible.'",
        "'speaker_5': 'But we need to plan for the failure of it so that we can complete the commercial development ourselves.'",
        "'speaker_0': 'Member.'",
        "'speaker_6': 'Ashcroft Thank you, Mayor. I might not have used the term plan for failure, but I. Well, really.'",
        "'speaker_5': 'Black and white. This business is not emotional.'",
        "'speaker_6': 'Are there other than that phrase, though, I'd like to say that I very much agree with Councilmember Materazzi. One of the things that occurs to me in the years that I've spent on the City Council is, well, my three qualifications for being a council member.'",
        "'speaker_6': 'Tough skinned sense of humor and a backbone. The backbone comes into play. They all do tonight, though, because when we're dealing with high stakes issues and this is very high stakes, we need to be resilient. We need to be nimble.'",
        "'speaker_6': 'We need to play the hand were dealt. It is fine to ask tough questions, but that doesn't mean that we need to attack the people giving the answers. This is the market. And I want to first just back up and say, Jan, Art and your team have been outstanding.'",
        "'speaker_6': 'That includes the city attorney's office because there's been a lot of legal ramifications to all of this and the changes and going through everything. And I very much appreciate the way you wrote the staff report and you brought out to us what you consider the risks.'",
        "'speaker_6': 'We we can't just look at, you know, all the good and not look at what the potential downside risk is. But you wrote an excellent staff report. It was all laid out. Yes, we're merging three phases into two, but we will still have 800 housing units, well-needed housing units, both market rate and affordable.'",
        "'speaker_6': '200 of those will be affordable. 600,000 square feet of commercial still there. The reason I feel confident on the commercial is I've seen the kind of leases we're getting in Alameda Point. A few of us were out at a business called Astra last week.'",
        "'speaker_6': 'I think it was pretty amazing. High tech folks, they are, you know, former Googlers and various things, but they're they're doing some amazing things and they're expanding. And how did they find out about it? Well, they know somebody else who's listening.'",
        "'speaker_6': 'I want made a point. We are getting on the on the map, but backing up to what I was going to say, the calculus that I'm applying here is what will we gain if we vote as a council to move forward with this amendment to the DDA?'",
        "'speaker_6': 'What will we lose? What are the priorities of this city? My priorities are and by the way, I just want to call out Michael McDonough from the Chamber of Commerce. Your remarks tonight were some of the best I've heard from you or any speaker in just laying out who are we penalizing if we say no to this'",
        "'speaker_6': '? Are we penalizing the developer? And again, our former mayor, Marie Gillmor, used to say this a lot, and I think I said it when I was planning board president once upon a time, don't let the perfect be the enemy of the good.'",
        "'speaker_6': 'As much as I would like to wave my magic wand, I'm still looking for it. But you have to you have to stay abreast of what are the changes. This isn't just unique to Alameda. It is the market.'",
        "'speaker_6': 'There's also such a thing as timing. If we let this window of opportunity close, the opportunity might not come back or not for a long time. If we think that the panacea is to scrap everything that's been done and look for the new white knight that's going to take a couple of years just to be back at'",
        "'speaker_6': 'square one again. And I should probably throw in that. I've been married for 35 years, so I've got a lot of confidence in, you know, knowing that you can't necessarily have a crystal ball, but you do look a lot at a lot of the attributes and and qualities.'",
        "'speaker_6': 'And and I do have confidence in this development team. But to the points that Michael McDonough was raising and Doug Biggs to from Alameda Point Collaborative, who are we penalizing the folks out there, the formerly homeless families that we had a lot of lip service to serving?'",
        "'speaker_6': 'Are we going to make them live with the water and the electricity going out? Not to mention the businesses who have been trying to run a business out there for all these years since the the Navy moved out.'",
        "'speaker_6': 'And what are our priorities as a city? Mine is to see that infrastructure that is World War Two, vintage and older replaced. We want healthy. I don't want to be Flint, Michigan, with contaminated water because of the quality of the pipes.'",
        "'speaker_6': 'We owe that to our residents and to our businesses and our visitors. And I want to see housing. That's extremely important to me. I will say I although it was the majority of the council who voted, I'm disappointed the way the adu.'",
        "'speaker_6': 'Ordinance went down, but maybe we'll have another chance to tweak that. But right now we have a very exciting project in front of us. I'm excited about Parks and open space, the sports complex, love sports. My kids played square.'",
        "'speaker_6': 'It's going through school. It is not the make or break deal for me. My my priorities are I don't want people sleeping in parks. I want parks, but I don't want people sleeping there because they lack housing and the partnership with USD.'",
        "'speaker_6': 'I never want to be in the position where I pit one group in need of housing against another. Come on, we. We need housing. We need more of it. We'll build everything we can build it. Alan made a point and it won't be enough.'",
        "'speaker_6': 'But what happens if we don't build it at all? We're in that much more of a deficit. I love the idea of the collaboration with the school district. I am always a little leery about things I don't have control over, but I'm hoping that there are some really good reasons, not least of which is the cost to'",
        "'speaker_6': 'keep the parties moving forward on this. And so I, I just want to again, thank everyone who has worked so hard on this, because we are closer now than we've ever been to developing Alameda Point. I know this is the third developer.'",
        "'speaker_6': 'It's really not fair to analogize them to a assuncao, for instance, because they're so different in so many ways. But did things turn out the way we thought they would? Almost three years ago when we entered this? No, but look around.'",
        "'speaker_6': 'This country has changed. Markets are changing. So the time to act is now. My vote is yes. Thank you.'",
        "'speaker_0': 'We need a motion to go past 11.'",
        "'speaker_9': 'So second.'",
        "'speaker_0': 'All those in favor I motion unanimously. Thank you, Vice Mayor.'",
        "'speaker_4': 'You know, I've heard a lot we talked a lot about the risks, and there are great risks for sure. But the guarantee, the only guarantee that I see is that if we vote against this, we don't get all of the benefits that were also discussed.'",
        "'speaker_4': 'And I think that for me, this is as much about our ability to control our own fate as the city. We know we need the infrastructure we're talking about, you know, at best or the lowest estimate being $43 million just for sewage, water, things like that, plus another ten for the ferry.'",
        "'speaker_4': 'So at best, $53 million, you know, in terms of the lowest cost. But it's probably going to be we know it's going to be much more than that. Not to mention the benefit to our Main Street neighborhood project, the Enterprise District.'",
        "'speaker_4': 'And I think that when we talk about the guarantee, the guarantee about going back to square one means that we don't know what the future holds because the construction costs are going to continue to rise. So as we defer this project.'",
        "'speaker_4': 'What we see is that we end up getting less and less bang for our buck in terms of the affordable housing, the ability to get all of these infrastructure projects completed, the ability to work on our transportation projects, the in transit projects that we have coming up.'",
        "'speaker_4': 'And so that that's really what is motivating me when it comes to this project. I do also hold concerns relative to the feasibility of phase three and the sports complex payment. But I, I trust that we can find a way to work with staff to ensure that there isn't some sort of bait and switch or something like'",
        "'speaker_4': 'that that happens. That would then delay other projects that are contingent relative to the housing numbers or, you know, impact our ability to meet our commercial goals that are set for out there. Because I think there's a lot of commercial and I and I that said, I also think there's a lot of different things happening within the'",
        "'speaker_4': 'commercial industry that very well could come to fruition depending on what happens in that space. So I'm prepared to vote in support of this project.'",
        "'speaker_0': 'Thank you. I appreciate the comments of my fellow council members. Some of the speakers of the charge back when the Navy gave us that property and I want to read it from the Naval Air Station. Alameda point info was in fact to replace 14,000 jobs.'",
        "'speaker_0': 'It is there's there's 14 and 25 units of housing that the Navy has allocated for this property to offset the jobs. But the focus is, in fact, to replenish jobs, phases one and two. If without the guarantees of phase three occurring, this is essentially a housing project, not a job project.'",
        "'speaker_0': 'So I will not be able to support this project. Every time the developer when I ask and I and I appreciate Councilmember Otis question specifically in regards to the financing, the financing should in fact be for all three phases.'",
        "'speaker_0': 'This is not a private developers land. This is the people's land. This is the land of Alameda. And for me to have a developer stand up in front of us and say, I do not have I cannot I will not guarantee the entire project.'",
        "'speaker_0': 'I think it's irresponsible for us to proceed. We need jobs. We know that if we wanted to give this land to a developer for a housing project, that was not a problem. Building housing has not been the problem.'",
        "'speaker_0': 'It is, in fact, trying to get the jobs replenished. And that is in fact, the charge. Thank you. So I would like to finish my comments. So in regards to the analogy, I have a different analogy. The analogy I'd like to use is if you go to sell your house and you make a deal with someone to'",
        "'speaker_0': 'purchase it at whatever the prices, and then they don't fall through, they drop the ball. And you don't blame yourself because you are still trying to sell your house. It is, in fact, on the buyer that it satisfy the conditions of the deal.'",
        "'speaker_0': 'And when we have someone who is in default, that is very serious. So this is the people's property. The people are, in fact, titled entitled to that 4 million to finish that project. Well, we do need the commercial property.'",
        "'speaker_0': 'We made a deal with a developer who is now in default and is telling us straight up that there are no guarantees to get it built. So, no, I don't think it's appropriate to proceed then. And if you were selling your house and you had someone show up and say, you know what, I'm not going to pay'",
        "'speaker_0': 'you what I had promised. No guarantees. I don't think you would close the deal either. And that's essentially what we are being asked to do. To close the deal where we are being told straight up, no guarantees and an and in fact, we had someone from our planning board who I do respect his opinion that there could'",
        "'speaker_0': 'in fact be a letter of credit or some way of bond in the future of the improvements. And the developer is not offering to do either of those things, nor assess any penalty if the job if the project all three phases are not completed.'",
        "'speaker_0': 'And I appreciate that we have people that do need jobs to build projects. We also have people that need jobs to go to every single day, not just build a project. So that being said, we have.'",
        "'speaker_5': 'I'll make a motion.'",
        "'speaker_6': 'I'll second.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_3': 'And I.'",
        "'speaker_0': 'Oppose motion carries 4 to 1. Thank you.'",
        "'speaker_6': 'Take a quick.'",
        "'speaker_3': 'Break.'",
        "'speaker_0': 'And.'",
        "'speaker_2': 'Is okay.'",
        "'speaker_0': 'Okay. We will take a short break until 10 minutes after 11.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Very much. Before we needed to finish up this last item. Attorney Andrew, go.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'Panic is going to help us out. Go ahead.'",
        "'speaker_1': 'Good evening, Madam Mayor. Members of the city council. Members of the public. My name is Enrico Pinnick, assistant city attorney. Council members, you just took a vote on item six. Be dealing with the site a DDA amendment. I just want to get your clarification that you were voting on the Second Amendment to the DDA as amended.'",
        "'speaker_1': 'That amendment was put on your chairs just before the meeting commenced and was made available to the public at the clerk's table. Ms.. Art mentioned that in her verbal remarks, but when you made the motion, it was a little bit quick.'",
        "'speaker_1': 'And I just want to clarify for the record that you were voting on the Second Amendment as amended.'",
        "'speaker_5': 'Affirmative.'",
        "'speaker_0': 'So we need a motion.'",
        "'speaker_1': 'No, your your affirmation is is fine.'",
        "'speaker_2': 'Yes, yes.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Thank you for voting against that part. Thank you.'",
        "'speaker_1': 'But thank you. I apologize for the for the clarification.'",
        "'speaker_0': 'All right. Thank you. All right.'",
        "'speaker_6': 'Now we're doing clarifications. And no, this doesn't involve you. Well, you and I, I was reminded by the city attorney's staff that I am mathematically challenged because the new ordinance only requires three affirmative votes, not four. I had four votes on my mind, so we did.'",
        "'speaker_6': 'We did. That was the second reading.'",
        "'speaker_0': 'And so if I could keep going.'",
        "'speaker_6': 'No, I just want to clarify. Otherwise, I don't want to be misleading.'",
        "'speaker_0': 'All right. Thank you. Okay.'",
        "'speaker_2': 'Six C Introduction of ordinance approving a lease with Friends of Alameda Animal Shelter.'",
        "'speaker_8': 'And this is just a extension of the previous approval by council. This is first reading and second reading will happen in the next meeting.'",
        "'speaker_0': 'Okay, so do we have a motion?'",
        "'speaker_9': 'So I'm up.'",
        "'speaker_6': 'Second all.'",
        "'speaker_0': 'Those in favor I I curious unanimously. No one oppose. Right. All right, let's move on to 60.'",
        "'speaker_2': 'The introduction of ordinance approving a 15 year lease with three.'",
        "'speaker_0': 'Five year extension options.'",
        "'speaker_2': 'With Teleport Communications of America LLC for conduit space for one containing fiber from.'",
        "'speaker_0': 'The intersection of Grand Street and Fortman.'",
        "'speaker_2': 'Way across the Oakland.'",
        "'speaker_0': 'Estuary to Coast.'",
        "'speaker_2': 'Guard Island requires four affirmative votes.'",
        "'speaker_0': 'We have a motion.'",
        "'speaker_3': 'Or.'",
        "'speaker_9': 'A presentation.'",
        "'speaker_5': 'Can you give a little background for people?'",
        "'speaker_8': 'Yes, this is actually we have a Bob or Veda is here from AMP. But the short story is that this is a conduit that goes from the island to Coast Guard island and it needs to be approved by council.'",
        "'speaker_0': 'Did you want to add anything since you're here? Waiting for 11 p.m.?'",
        "'speaker_6': 'I would like to.'",
        "'speaker_1': 'I'm here to answer questions.'",
        "'speaker_0': 'You're here to answer questions? Anyone have any questions?'",
        "'speaker_5': 'This is essential for Coast Guard activity, so I may move it.'",
        "'speaker_0': 'There's a motion. Second, all those in favor. All right, I want the motion carries unanimously. Thank you.'",
        "'speaker_6': 'Thank you, Mr. Rivera.'",
        "'speaker_0': 'So now.'",
        "'speaker_9': 'With the lights turned back up. I'm sorry I'm late. Sorry. Thank you.'",
        "'speaker_0': 'You just asked to have the lights turned back up. All right. So next item seven.'",
        "'speaker_2': 'Actually, now we were taken in by the five f.'",
        "'speaker_0': 'I s f as in Frank. There were a few questions.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Good evening, Madam Mayor. Council members, my name is Sharon Malcolm is a city engineer for Al Media, and I'm here to respond to the question raised by Vice Mayor Vella regarding the funding for the contract that we are recommending to be approved.'",
        "'speaker_1': 'Historically, Gulf funds have been used as a small component in the funding mechanism for this type of project. For this type of contract, there are the trees within the the golf course itself. Ah, I understand now they're being basically managed by way by an outside entity called Greenway which they, they happen to hire their own contractors to'",
        "'speaker_1': 'do their work. However, these funds could be used. That is, the golf fund to maintain the trees that are adjacent to the golf course itself. That said, if the city council would like to remove this funds from the the golf fund, that is from the contract and either we have to has it replaced by general funds or'",
        "'speaker_1': 'alternatively, we can reduce the contingency on the contract, reducing it from 10% to some lower number. So after the contract or through.'",
        "'speaker_4': 'So it's for the vice mayor. All right. So it's for the trees that are adjacent to the golf course. And do we have the amount that we're talking about spending?'",
        "'speaker_1': 'It's about $20,000. My understanding.'",
        "'speaker_0': 'Any other questions from counsel? Do we have a motion?'",
        "'speaker_5': 'Remember I move that we adopt the contract with the clarification that approximately $20,000 is allocated from the Gulf Fund to maintain the trees adjacent to the golf course.'",
        "'speaker_6': 'Our second.'",
        "'speaker_0': 'Any comments? All those in favor. I. I.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'A motion carried unanimously. Thank you. Now, item seven, City Manager Communications.'",
        "'speaker_8': 'I would just like to thank the Coast Guard for their really good support and the Coast Guard festival. After the parade, the 4th of July parade yesterday. And the second thing is, Building 91 that was is owned by Joe Ernst and is in line for becoming organic malt and cultivation has successfully gone through escrow and they've exercised'",
        "'speaker_8': 'their agreement to purchase that building, and they purchased it for 3 million, which starts the city's contribution for improving the infrastructure on Alameda Point. So that happened on Tuesday. On Monday, actually.'",
        "'speaker_1': 'And a mayor?'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'Can I ask the city manager to give us an update as our representative on the public utility board on local solar and recs, because that's coming up on the 17th, I believe it.'",
        "'speaker_8': 'Is coming up. And the RECs is.'",
        "'speaker_6': 'Do you want to spell out for people who don't? Yes. No. Renewable energy.'",
        "'speaker_8': 'Renewable energy credits. And what it does is, one, because we are actually very green, one of the greenest utilities in the state, we are able to sell our green credits. And to companies that are not as green as the AMP, the Alameda Municipal Power, we have used that money and to do additional green efforts, including we just'",
        "'speaker_8': 'won an award for doing. Bulb replacement throughout the island to lower everyone's energy costs. We are about ready to do another round of selling the rec dollars, the renewable energy credits, and it's going to come in around $9 million, eight or $9 million.'",
        "'speaker_8': 'And so the question is, how is the board going to direct staff to spend those new credits? And that's coming up in front of the pub, the Public Utility Board. And what I said at the last meeting is I just wanted to remind the other members of the board about the.'",
        "'speaker_8': 'So the city's previous goals for Community Solar and to an AMP staff is also looking at Mount Trash more as a site for community solar at that location. And so if that feasibility study comes back and says that's a positive solution for a community solar.'",
        "'speaker_8': 'I express this council's previous position to support that effort going forward.'",
        "'speaker_5': 'So the feasibility study is happening.'",
        "'speaker_8': 'The feasibility study is underway, and on.'",
        "'speaker_5': 'The 17th, they're going to allocate, not allocate the funds they'll.'",
        "'speaker_8': 'Give direct.'",
        "'speaker_5': 'To the funds. Okay. Yes, thank you.'",
        "'speaker_0': 'Can I just ask what.'",
        "'speaker_4': 'The timeline is for that? Well, I know that they're assuming they approve it.'",
        "'speaker_8': 'The timeline for the study.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_8': 'I do not know, actually, what the consultant's expectation is. Okay. But I can provide that to the council. Okay.'",
        "'speaker_2': 'That would be.'",
        "'speaker_5': 'Helpful. Of agendas.'",
        "'speaker_8': 'Fine. Yes.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Do we have any oral communications? Not agenda. Agenda item eight? None. Thank you. Counsel Referrals nine A.'",
        "'speaker_2': 'Considered directing staff to proposed regulations to authorize convenient and safe cannabis businesses in Alameda.'",
        "'speaker_0': 'Thank you. So I brought this referral. I know. And I do want to thank member Odie for bringing his referral back in, I believe November and at that time I had made the motion to move forward with that.'",
        "'speaker_0': 'And here we are in June and July. Now, I'm sorry. Here we are in July. And I had brought my referral in the beginning of June to see if there is any way to give further direction to staff to try to help expedite this issue.'",
        "'speaker_0': 'And and I think that, if at all possible, if we can do that, to expedite it, to expedite having cannabis businesses and specifically dispensaries in town, I think it's very important that we give that further direction, if possible.'",
        "'speaker_0': 'And and why? Because unfortunately, at this point, many of us either are or know people with serious health issues that unfortunately, they're not able to purchase here in town. They have to go into Oakland or San Francisco or other cities to be able to talk to someone in person, to get information and then to be able to'",
        "'speaker_0': 'purchase. And I myself am a cancer survivor. I have done very, very serious chemo. That was ten years ago. At that time, my journey was it was interesting. It was pre where we are today as a society, which means it was back when you could not get a card, you could not do it and do it legally'",
        "'speaker_0': '. And so back then, when I did my chemo, I actually would go to PTA meetings and I'd show up here all and speak on behalf of PTA. I was PTA council president and I would go to meetings and people knew that I was going through breast cancer and they would stop me after a meeting and say, Trish'",
        "'speaker_0': ', if you need anything, I will help you. And that that was very hard. So fast forward today, I'm doing I've had to deal with side effects from the very aggressive chemo. So I'm back going to the cancer center here at cancer center every six months for infusions to try to strengthen my bones, which is very painful.'",
        "'speaker_0': 'And at this point, people like me can, in fact, legally access cannabis to help us with the symptoms. And to me, time is critical, which is why I'm actually brought this referral to see if there are the three votes on this council to try to give better direction to staff of working, of coming up with a proposed'",
        "'speaker_0': 'ordinance to have dispensaries in town. So sooner rather than later, because in fact, if you are one of these people and honestly, God bless you if you're not, but those of us that have to live in the real world, I have had these experiences where I could be on my sofa.'",
        "'speaker_0': 'So the first time I did these treatments that I just started that I will be doing every six months. I was right before Thanksgiving, the day before Thanksgiving, and that worked out really well because Thanksgiving, that Friday, that Saturday and that Sunday, I did not have any obligations as mayor, which worked out really well because I could'",
        "'speaker_0': 'not have done anything. I was, in fact. Stuck in my home for those four days. And that is what the face of anyone dealing with serious health issues, especially side effects from either going through chemo or side effects from chemo.'",
        "'speaker_0': 'And if you've got been that person or you know those people, the journey is tough. So now I'm doing these treatments every six months and it's these side effects, thank goodness, are not as bad. But the last time I had two weeks of nausea.'",
        "'speaker_0': 'So I think I'm so I'm hoping that I'll have the support of counsel to try to narrow the direction and get better direction of actually come back with an ordinance proposed ordinance to start having dispensaries here in town.'",
        "'speaker_0': 'So that's why I brought the referral. And I'm we do have speakers so with at this point I would entertain calling the speakers if you if you all are good with that and we're ready.'",
        "'speaker_9': 'I mean can we have staff kind of update because you didn't outline the previous referral and the timeline? I mean, is it possible for staff to update us on where we are on presenting? While making their presentation to council.'",
        "'speaker_3': 'Just.'",
        "'speaker_8': 'Sure. So the council, as the mayor said, had a referral that was broad on cannabis. It was when we went to the February work session, it was identified as a medium priority, partly because of the timing with what the state was developing, the regulations.'",
        "'speaker_8': 'And so if we get too far ahead, we might have to change, um, depending on the regulations of the state. We have been going to a lot of the informational information about all of this. We actually had an internal workshop for staff on all of the different, the six different categories of primary activities and support activities for'",
        "'speaker_8': 'cannabis. We want to have that consultant come in and share that same information with this council, hopefully the first meeting of September. That's where it when it's tentatively scheduled right now. And the council will be asked at that time, what activities do we want to regulate and give more information about policy planning and an update on where'",
        "'speaker_8': 'the state is. They did just get approval for their regulations and the governor signed it. So we are now in perfect timing for taking this forward as quickly as possible, and we still have until January 2018. We also are looking at taxing cannabis companies and that would go on the ballot on November 2018.'",
        "'speaker_8': 'And we are doing a quality of life survey that should be coming out in a couple of weeks. And that has one question on it about how do you feel as a community about the different aspects of cannabis distribution, cultivation and manufacturing?'",
        "'speaker_0': 'So that goes to why I want to know if we have the three votes at this point to ask to give direction to staff to come back with a proposed ordinance. I do not think it is. I am concerned if we're going to be waiting until January, that's another six months.'",
        "'speaker_0': 'And I just think that that is too long to wait. If, in fact, there's a way to expedite it and I appreciate that staff is proposing workshops and surveys, but my my referral goes to having dispensary's sooner rather than later.'",
        "'speaker_0': 'And I am very concerned. We just spent over a year on that. And I appreciate, you know, I was going to bring up the animal shelter. We spent over a year on that issue. I don't think it's appropriate that we spend over a year on this issue, and that's the timeline we are on at this point.'",
        "'speaker_0': 'So I would like to go ahead and call the speakers at this time. Thank you. Melody Montgomery and and then Sharon Golden.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'I'm Melody.'",
        "'speaker_2': 'Thank you for letting me speak. I want to speak to you as a patient and a perspective business owner. I've been a patient since 1996 when when the California law first went into effect. I don't really want to share with you all why.'",
        "'speaker_3': 'But I have been a patient. I abide by those laws. Just recently, I've started my own business. That's a topical business for people that have pain. You don't smoke it. You put it on where it hurts and it takes the pain away, which has.'",
        "'speaker_2': 'Very little effect to.'",
        "'speaker_3': 'The people around you.'",
        "'speaker_2': 'I'd like you to go ahead and and approve.'",
        "'speaker_3': 'And go forward with what we're going for. It's very important that we have access here on the island. It's very important that not only do patients have access.'",
        "'speaker_2': 'But that prospective businesses can do business here. I don't want to take my business.'",
        "'speaker_3': 'And have to go to Oakland. I don't want to go.'",
        "'speaker_2': 'Anywhere but the place where I live. So it would be lovely.'",
        "'speaker_3': 'If we could do that. It provides not only businesses and jobs for for us as business owners, but jobs for people that we're going to hire and.'",
        "'speaker_2': 'It will eventually pay, get some tax money going.'",
        "'speaker_3': 'So I would really like to see it go forward. And to you, Trish, I'd like to talk to you about CBD for your for your bones.'",
        "'speaker_0': 'And how you.'",
        "'speaker_3': 'Think you.'",
        "'speaker_9': 'Point of information. We're on the 2 minutes, right, Madam Clerk? Okay.'",
        "'speaker_2': 'Sharon Golden and they are sharing golden age. Sisi, thank you for letting me speak tonight. I really want to thank everybody for kind of starting this whole process last year without him taking the step forward, I'm not sure that Alameda would have ever been ready to have this dialog.'",
        "'speaker_2': 'But I also want to be thinking her answer this evening for her referral, ICC fully stands behind her referral. There's a couple of reasons that are a little bit different than Brody's. We really we really are here to kind of make sure that our local residents, your constituents are given an opportunity to open a business or have'",
        "'speaker_2': 'access to their medicines on the island. And being that staff is coming back nearly ten months after his referral. And in addition, I heard from staff that there's going to be an additional like a SurveyMonkey of types that are has not yet made it to other constituents, other Alameda.'",
        "'speaker_2': 'I'm kind of concerned that without this referral, we're not going to have a streamlined process. And this can be this can really drag out way beyond the January 2008 season. And I would like to also point out that in January 2018.'",
        "'speaker_4': 'We're going to need a very.'",
        "'speaker_2': 'Clear direction as cannabis business owners, as patients or as adult users. And I would like for my city to kind of make that.'",
        "'speaker_8': 'Clear to us.'",
        "'speaker_2': 'In some form of a proposal to propose rules or something that we can kind of go off of, even if we're not able to fully permit the applicants by that time.'",
        "'speaker_3': 'Hmm.'",
        "'speaker_2': 'Furthermore, I the city. Oh, I'm sorry. My phone just went out. Okay, so a while. Alameda has that back. Cannabis has undoubtedly grown into a huge business. And what I've seen from. Thank you. I do that.'",
        "'speaker_0': 'Rich Moskowitz and then Amber Lopez.'",
        "'speaker_5': 'Mayor Spencer, members, staff, city people. I want to thank you all for being here and allowing us to meaning to go along tonight. I didn't want to speak about my own history with cannabis.'",
        "'speaker_1': 'Or medicine or any.'",
        "'speaker_5': 'Of those things. I want to speak to three issues that are pertinent to all of us in this room as meetings.'",
        "'speaker_1': 'And I think.'",
        "'speaker_5': 'That cannabis addresses all of these. So first, I'd like to urge all of you to support the mayor's motion to move forward tonight. And the three issues I want to bring up where cannabis can be an assistance to the island is if we choose as citizens, as our leaders to allow cannabis businesses to the island, they provide'",
        "'speaker_5': 'three benefits direct, certainly the sales tax issues, certainly the excise tax issues. That's a no brainer. But it also employer and it also involves employing people on the island. That also involves cutting down traffic. So as we move forward and discuss for many hours tonight additional dwellings and the issues that we've all are very well aware of'",
        "'speaker_5': 'with the rental markets, I'd like to put this in a new light and simply say that if you feel that it's proper to move forward for the community, then there are supplemental benefits separate from the obvious ones. And very specifically Tricia's video.'",
        "'speaker_1': 'Excuse me, Mayor Spence's video.'",
        "'speaker_5': 'Spoke specifically about our meetings, trusting our meetings and also not liking to leave the island. We can all acknowledge both these two facts. Cannabis is growing from the.'",
        "'speaker_1': 'Community, not from outside the community, by residents for residents.'",
        "'speaker_5': 'Provides that confidence to people who are new to this world.'",
        "'speaker_1': 'Also assures them as other alameda and.'",
        "'speaker_5': 'We don't want to impact their life on alameda. We are aware that for many years this has been a very different conversation than it is today. And as such, we want to bring the people who are new to this world to see us as good, competent members of the community.'",
        "'speaker_5': 'We don't want their children exposed. We have the same concerns as them and such. And thank you very much. I urge you to vote for the mayor's proposal.'",
        "'speaker_0': 'Thank you, Amber Lopez.'",
        "'speaker_2': 'Hello. Thank you for letting me talk. I would like her proposal to.'",
        "'speaker_8': 'Go through and be executed because I believe Alameda should have safe access to cannabis on site and that having cannabis businesses of all types can bring a lot of business here and give a lot of people jobs as well, because there are a lot of talented people here that are in the field that work outside of Alameda'",
        "'speaker_8': 'to make a living. But doing what they love and if they can do it here in town, it cut down commute time.'",
        "'speaker_2': 'It would be a stronger community and I think.'",
        "'speaker_8': 'It'd be a great idea.'",
        "'speaker_0': 'Thank you, Adele. Of course. I'm sorry. It's a bell, baby. Thank you. All right, a bell. And then Mark. First one.'",
        "'speaker_1': 'So much. Appreciate it. Oh, my name is Abel. Have two. Georges and I am here as a proud member of the class of 1998. We'll see what middle school and the class of 2002 in Snell High School, Jets Proud alum.'",
        "'speaker_1': 'And you know, many years ago, in 2002, I actually sat right there as a student school board representative, and here I am. Fast forward, still a handsome young man supporting my good friends who are doing amazing work with an entrepreneurial spirit and true Olympians who are, you know, really advocating at this point to seize and a very'",
        "'speaker_1': ', very important opportunity. You know, we have known throughout our time that Alameda is a jewel. But oftentimes, you know, we've seen things come and go and the opportunities may have been passing or may have been inaccessible. Here we have a very unique opportunity right in front of us, and we're sitting in the driver's seat.'",
        "'speaker_1': 'Mr. Rodriguez, one of my mentors at Encino High School. Some of you guys may know, used to say to me, in action is not an option. I had no idea what he was talking about. But now I've seen through experience and now I'm looking at each and every one of you realizing that at this present moment, inaction'",
        "'speaker_1': 'is definitely not an option. We should definitely move forward, support the new crop of entrepreneurs that are locally based, that are homegrown and that are loving members of this community and classmates. So, you know, if we want to do this the right way, it has to be done the Alameda way.'",
        "'speaker_1': 'And in order for it to be done, the Alameda way has to be done by our comedians. So stand here in strong support of the mayor's referral and his strong support of good entrepreneurs and friends who are trying to do some amazing work in Alameda.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_11': 'My personal heart. And then I have a speaker set that has an address.'",
        "'speaker_0': 'I'm sorry. If you could hold your applause, then I have a speaker slip with an address on bass and sideway without a name. So it's Mark, and then it's the person that didn't put their name on here.'",
        "'speaker_1': 'Thank you. And I want to especially thank Councilmember Odie and.'",
        "'speaker_5': 'Mayor Spencer, both of whom came to the Alameda Island cannabis community, separate meetings to to address us, talk about where the city is and in relation to cannabis, and also come with open ears and open mind and really listen to our our concerns and answer our questions.'",
        "'speaker_5': 'Those are great interactions. And we really appreciate the way that you're you're working to support us and represent us. I want to speak on two aspects of cannabis businesses moving forward. I'm a prospective business owner myself, along with my partner Nick Portales, another long term Alameda resident.'",
        "'speaker_5': 'Our one aspect which has been getting some play tonight is the idea of residents preferences or requirements. Many of you probably recall 2008, we had a brush with an outside entity that came in to run a dispensary here in town.'",
        "'speaker_5': 'It didn't go well. They weren't committed to the community. They weren't ingrained in the fabric of the community. And I think when we start talking about cannabis businesses where there's a public safety concern, particularly those businesses like dispensaries and delivery, that are going to be more ingrained with the business community and dealing with.'",
        "'speaker_1': 'Residents on a day to day basis.'",
        "'speaker_5': 'I think having that local control and that commitment to the community coming from this business really is essential for it to be done right. So I'd like you to strongly support a residency, either requirement or preferences. Secondly, I'd also, as you move forward, I'd like you to also be open to the idea of onsite consumption.'",
        "'speaker_5': 'Currently, cannabis.'",
        "'speaker_1': 'Regulations are really tracking that of tobacco, so it's very, very difficult for people to medicate.'",
        "'speaker_5': 'In certain places. If they live in apartment buildings, for instance, multi-family.'",
        "'speaker_1': 'Dwellings they may not be able to consume at home.'",
        "'speaker_5': 'And by having onsite consumption.'",
        "'speaker_1': 'Allowed at dispensaries or related entities, I think it'll also help to keep.'",
        "'speaker_5': 'Consumption out of off the streets, off the beaches and so forth.'",
        "'speaker_0': 'Thank you. No need to feel that you're at the base inside, base inside. And then Ryan.'",
        "'speaker_1': 'Hi. I'm Tim Anderson. I live on the island, as do my parents. Alameda is full of cannabis businesses and cannabis consumption. And so that experiment is being done. And you can look at your crime statistics and see the what happens.'",
        "'speaker_1': 'ALAMY does legal fully legal cannabis businesses are in Berkeley and Oakland and they are thrilled to have them. And you can go talk to Berkeley and Oakland and see how thrilled they would be to have even more of Almeida's cannabis businesses.'",
        "'speaker_1': 'So that experiment is being done. You can go to Berkeley and Oakland and see how happy they are to have all of the cannabis business that they can get in general. I guess what keeps coming up in Alameda is how can you stay on the island?'",
        "'speaker_1': 'And just looking at the bay census, only 10% of Alameda is like bike walk or work at home. Everyone else drives to work. So anything that can let people do those, that 10% of the working on meetings who have found a way to do that.'",
        "'speaker_1': 'Anything that can help them do more of that and more people do that way is good for Alameda. It's good for people involved, and it's good for the planet. And so I support cannabis.'",
        "'speaker_11': 'Proposal Ryan was about.'",
        "'speaker_0': 'Ryan.'",
        "'speaker_6': 'It applies to we.'",
        "'speaker_0': 'Have one.'",
        "'speaker_2': 'Speaker, okay.'",
        "'speaker_0': 'And I have one more speakership after this. If there's anyone else that wants to speak, please submit your set. Thanks.'",
        "'speaker_1': 'Hello. Thank you, everybody. Thanks for staying so late and hearing us out. I was born here in Alameda. I was raised here in Alameda. I went to school elementary through high school. Even in college. I'm a product of Alameda.'",
        "'speaker_1': 'I'm not going anywhere and my family's not going anywhere. But I'm here today because this month marks the fifth year of losing my auntie to spinal fluid cancer. So I seen we took care of her, me and my mom.'",
        "'speaker_1': 'We took care of her in her last 18 months of her life. And from the beginning, I recommended to her, to my uncle and her and my my cousins that, hey, let's you know, she's she's she's not looking too good.'",
        "'speaker_1': 'Let's let's let's help her out. You know, let's give her some some medicine that can ease her, you know. And they were just totally against it. You know, the doctors were saying, don't do it and they didn't do it.'",
        "'speaker_1': 'It wasn't until she was completely bedridden and she couldn't get up, she she wasn't even able t to eat food anymore without it coming back up because the chemo was so strong. It wasn't until that point that she was able to you know, her family's able to finally say, okay, let's let's let her try an edible.'",
        "'speaker_1': 'And from that point on, from the last six months, she was taking edibles and she was able to at least enjoy the remainder of her life, you know, eating and laughing and, you know, spending time with her family and not just sitting there suffering.'",
        "'speaker_1': 'And, you know, I just I ask all you just to, you know, find some compassion in your heart, not just for, you know, patients, but also, you know, somebody who may they might be healthy today, but then tomorrow something may happen.'",
        "'speaker_1': 'And to not have access to this or like me or Spence who said, you know, I have to go to Oakland when you're when you're bedridden, I mean, how how fair is that? You know, I mean, we're we're it's 2018.'",
        "'speaker_1': 'People can get or 2017 and people can access this anywhere else but Alameda and even San Leandro. And that's I mean, you're saying we're behind San Leandro, so that's all I have to say. Thank you very much.'",
        "'speaker_0': 'And I think hold your applause. I appreciate Andrew Huntoon. And if we have any other speakers slips. Andrew Huntoon. They submit your slips.'",
        "'speaker_9': 'Yeah.'",
        "'speaker_7': 'You're not going to believe this. I actually walked out of this meeting, went around the corner, saw a movie, got back here, and.'",
        "'speaker_1': 'Now, I believe that.'",
        "'speaker_7': 'This is my third attempt. And I just want to say, as a lifelong Armenian and a graduate of high school, a participant in the Vietnam War, and a person who visualized a different method, when I got back and hooked up with my friends who went to the Haight Ashbury and thought that things were a little different.'",
        "'speaker_7': 'I never imagined that marijuana would have a medical benefit. But I've come to find that to be true. I think of my father in law who basically starved to death because he couldn't generate an appetite. There's no way in hell he would smoke a joint.'",
        "'speaker_7': 'There was such a stigma associated with it, and I think it's time to wipe the slate clean. And the government should start accommodating the people and servicing the people, all the people. There should be no differences between any of the people in the world and even any of their beliefs.'",
        "'speaker_7': 'People got to learn to respect one another and accommodate one another. This is something God given we need and it's something that we should all be able to partake in once we achieve adulthood. Thank you. Thank you. All right.'",
        "'speaker_0': 'Juliette Lockwood and then Dorothea McPhatter. And then those are the last speaker steps I have.'",
        "'speaker_2': 'Good evening, Mayor Spencer and Council. Appreciate you all for this evening's extra time. I am an owner of a cafe here in West Alameda. I am a long time supporter of cannabis from the standpoint of not ever wanting to be on pharmaceutical.'",
        "'speaker_2': 'I'm a natural food supporter. I'm also a preventative health care worker. I had worked in the cancer environment in Louisiana and saw quite a lot of changes in my outlook on life. So I moved back to California to open a business again.'",
        "'speaker_2': 'I had already had a business here. I was an artist and a decorator, but I'm still here. I've returned to Alameda and this is the place I wanted to have a business. So I am a believer that cannabis could be lifted for a particular population of adults who are suffering from anxiety, depression, OCD, PTSD.'",
        "'speaker_2': 'There's a range of things that we all go through here in our lives. We would like to lift the ban here in Alameda as small businesses. And I'd like to actually look forward to the future of the VA hospital being a wonderful research center.'",
        "'speaker_2': 'And I think that it'd be, you know, a pretty good balancing act for us to look into how we can prepare for that. So I think it'd be foolish for us to wait any longer. I'm back and I'm not going anywhere.'",
        "'speaker_2': 'I want to see this island mature, and I know change is hard in a place like this, but I'm here to be supportive of the things that we can possibly do to make it safe. For children, adults, veterans, end of life care.'",
        "'speaker_2': 'So thank you for your time. And wellness is really the real reason for this. So I appreciate all the considerations people we all know that may need this for wellness. Thank you.'",
        "'speaker_0': 'Thank you. Dorothy McPhatter. And then Terry Golden.'",
        "'speaker_2': 'Good evening. And mostly I'd like to really appreciate your time, each and every one of you giving us this opportunity to speak. Personally, I've been dealing with cannabis for over 50 years for the simple.'",
        "'speaker_3': 'Fact that I've been in major car accidents. I've been.'",
        "'speaker_2': 'I've been dragged. I was hit three times at a gas station, flew through the air, landed on my head on concrete, and was rolled over. At the time I was given a type of pharmaceutical, but my Los Angeles L.A. Rams.'",
        "'speaker_3': 'African doctor told me, smoke a joint. That's what he told me, because when I walked.'",
        "'speaker_2': 'I made 25 to 30 different motions to put one foot down.'",
        "'speaker_3': 'To step and walk in front of the other.'",
        "'speaker_2': 'I was told I'd never speak again. I'd never walk again. A lot of things that I haven't done. But I'm in the process because cannabis has helped heal me. I come from a natural path background and I can say I always try.'",
        "'speaker_2': 'Pharmaceutical pollen has been getting me for the last few years. I have just looked horrible and I have found that using the steroids put me in a state of fury.'",
        "'speaker_3': 'Where I wanted to hurt people. And the main thing was I didn't want to hurt myself.'",
        "'speaker_2': 'So I would smoke a joint or I would CBD.'",
        "'speaker_3': 'I've been using it.'",
        "'speaker_10': 'Across the.'",
        "'speaker_3': 'Board from edibles.'",
        "'speaker_2': 'Just trying to see what works for me. And like.'",
        "'speaker_10': 'Mellody said.'",
        "'speaker_2': 'Mayor, as far as the CBD is, I know a lot of athletes who utilize it. I'm doing Nike and I'm dealing with bone health and so many other things. So I'll be 64 at the end of the month and I put some color in my hair today and then I just look forward to having those 3 to'",
        "'speaker_2': '4 votes. If you all have that in your hearts to give us that, because going forward, I think that cannabis would give us the kind of financial stability where we can get that $400,000 or million dollars and get the sports center out on the island.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_11': 'Thank you, Terry. Terry Golding.'",
        "'speaker_0': 'Terry Golden, and she's our last speaker. My name is Terry.'",
        "'speaker_2': 'Golden and I am a constituent, but my official name is Theresa Gold and I go by Terry Golden. I wasn't going to speak, but decided that I would come up and speak. I personally have never used cannabis in any form and.'",
        "'speaker_2': 'I'm a construction worker. Haven't even been home yet from work.'",
        "'speaker_0': 'So we're randomly drug test tested.'",
        "'speaker_2': 'But I will say my husband is a. Sorry. Pancreatic cancer survivor. He's one of the 6%. He's got. Two and a half years. Cancer free right now. We? Like likely. I have an amazing daughter who got involved in this industry.'",
        "'speaker_2': 'And when she first got involved, I were I don't know how I felt, but, you know, when life hits you with it, you know how you feel. She set up a regime regimen for us and what my husband was taking was CB A and THC A and we attribute this to his.'",
        "'speaker_2': 'Consistent recovery that.'",
        "'speaker_0': 'He's in right now.'",
        "'speaker_2': 'So I, I want something to move forward because we've heard from from people who suffer and. I'm excited to see what you guys are going to do tonight. And thank you for listening. And sorry I cried.'",
        "'speaker_0': 'So I want to thank everyone that came out tonight. I actually don't think I can add more than what the speakers already said, and I'm just going to go there. The council would like to speak.'",
        "'speaker_9': 'And Brody and I can speak a little bit, so I guess. I want to go back to the schedule. So I mean, hypothetically, we approve this. First time we can have a come back is September.'",
        "'speaker_8': 'September 2nd.'",
        "'speaker_9': 'So that's the plan. Second. Well, seventh.'",
        "'speaker_8': 'The first Tuesday of September.'",
        "'speaker_9': 'That's the. The fifth. Right. I mean, can we get a commitment that. You know, we'll have the analysis. On that day or. Because that's the mean. That's the first available meeting anyway, right. Right, because.'",
        "'speaker_8': 'The package is out tomorrow at noon. And and we're close. We're dark during August.'",
        "'speaker_9': 'So then what would be the steps, assuming we we decided we want some type of ordinance or, you know, to get rid of our whatever we've repealed or I'm sorry, whatever we banned.'",
        "'speaker_8': 'So I what we were envisioning for September is a series of questions for the council that will help draft the ordinance. You want it retail dispensaries separate from cultivation and what zoning districts it would be allowed and things of that nature and setbacks from schools, etc. like we have for liquor stores and cigaret sales.'",
        "'speaker_9': 'So then we would expect that the first available. Again, I'm just trying to plan out the logistics because I think with this referral, whether it passes or not, the fact that it's been on the agenda three, three times may have actually succeeded in its intent, which is to get the ball rolling and get get the hearing and'",
        "'speaker_9': 'get the ordinances drafted. So I guess then, you know, we would have a first reading on the 3rd of October and the second reading on the 17th, or is that kind of where we're looking?'",
        "'speaker_8': 'I mean I mean, it depends on the direction of the Council on September 5th. But if the council says we want to focus just on dispensaries and as outlined in the referral, we could put that ahead of looking at cultivations.'",
        "'speaker_8': 'We could put that ahead of taxation questions. The taxation question is probably the longest time period because we can only put that on a ballot where that council is running for reelection, which is November 2018. Where we've started that process.'",
        "'speaker_8': 'We've already started talking to consultants about that. That's why there's more testing at now or the language to put on the ballot in November. We will have those results presented to the Council in September that will have that information for the council to make a decision as well.'",
        "'speaker_9': 'And I guess my preference would be that we, you know, we we we keep going and moving on this process and that we have, you know, the presentation where we have community input and and discuss the possible ordinance as soon as possible.'",
        "'speaker_9': 'And then whatever the council decides and we get those ordinances drafted. Right. And I guess, I mean, right now my personal thought would be not to restrict, you know, potential ordinances to one category, you know, to kind of evaluate the entire entire option, I mean, the entire list.'",
        "'speaker_9': 'So, you know, I don't know that that needs emotion. I mean, just a couple other, you know, items.'",
        "'speaker_3': 'I mean, the.'",
        "'speaker_8': 'The exists the referral previously includes all the options. This one is more specific to dispensaries.'",
        "'speaker_9': 'And it did also include a request for some type of ownership. So I would hope that that would be part of the analysis that comes back. I mean, what we could do to incentivize or not incentivize local ownership, what's legal, you know, what's not, because I don't know what the answers are and we're not going to find'",
        "'speaker_9': 'that out today. But when we had that presentation, you know, some analysis of what what our options are like, maybe if we do I mean, hypothetically, if we do have a dispensary application process like San Leandro went through, which I think was supposedly, you know, apolitical and blind, you know, do we have points for this?'",
        "'speaker_9': 'We have a point system. Do we have a requirement? Just I don't know what the options are.'",
        "'speaker_8': 'So that's one of the options that we'll be talking about in September 5th and we've spoken about internally is one option is to say we will allow two permits for dispensaries on the island and then you have a criteria process and you have a third party selected.'",
        "'speaker_8': 'So it is not political. One of the criteria is could be local ownership cetera, but that's a question for the council to direct staff. And what is that number, you know, and do we want to start slowly or do we want to open it up to, you know.'",
        "'speaker_8': 'Any options.'",
        "'speaker_9': 'And I guess all those questions have to be answered. So hopefully staff when they come back will.'",
        "'speaker_8': 'Have a list of questions that we can then fill in the blank for future regulation.'",
        "'speaker_9': 'And I also like to see some analysis on the onsite consumption issue because we do have a smoke free ordinance in Alameda tax apartment users and such. So.'",
        "'speaker_8': 'And that was new to me tonight. That isn't on our list right now. So we'll.'",
        "'speaker_9': 'Add it. I know it wasn't part of the referral, but it was something that came up. So and then of course, the revenue, you know, that that's kind of one of the more important things to me. I mean, every everybody's position here and their their testimony I think was was helpful.'",
        "'speaker_9': 'But I mean, the revenue was something I think we can't lose sight of.'",
        "'speaker_8': 'And there's two revenue sources besides sales tax, but one is a doing a just like we do. Cost recovery. So we would identify what the cost is for having it in the city and then charge that to the business.'",
        "'speaker_8': 'It becomes a business license tax that recoups our additional costs for having this business in the city. And then there's also the tax that gets put on the ballot. Okay.'",
        "'speaker_9': 'Those are kind of my comments. I mean, a lot of that the rest doesn't need to be said. I mean, if you've knocked on doors precinct locking on Friday night, you know, there's pervasive use of cannabis in Alameda and with with recreational you know.'",
        "'speaker_9': 'It's it's the law of the state now. So I think we need to put ourselves in a position where we're, you know, we could benefit both the city and and our residents from it. So.'",
        "'speaker_11': 'But these. Hold your applause.'",
        "'speaker_0': 'I want to circle back. Please hold your applause. MEMBER Audie, could you clarify, would you be agreeable to focusing first on dispensaries as opposed to this is a long list. And, you know, my concern is that if we're going to have all these issues addressed, that it would, in fact, take more time.'",
        "'speaker_0': 'So my my request is, in fact, that we focus on the dispensaries and the on site consumption. I'm fine with trying to work that in, but this list that staff is proposing, we know in reality it is going to be more than one meeting.'",
        "'speaker_0': 'So if we could break it down two parts, that's why I brought the referral. If you would be willing to entertain, at least address that part first.'",
        "'speaker_3': 'I mean.'",
        "'speaker_9': 'I'll just give my $0.02. I mean, my colleagues can chime in as well. I mean, I think there's some low hanging fruit here in the manufacturing side, in the lab side and the testing side. You know, that the who knows it might not require an ordinance.'",
        "'speaker_9': 'It could be, you know, something we do with planning and something we do with zoning. So I'd like to not shut the door, you know, on one thing over the other. I do think personally, I mean, this is.'",
        "'speaker_9': 'My opinion, it's not my position and I think dispensaries will probably be the most controversial of the topics we talk about. So. That's just my opinion. I mean, I'm not saying that's my position.'",
        "'speaker_4': 'Vice mayor tried a few questions. I know that most of the speakers referenced medical use, but I think the elephant in the room is the recreational side, which obviously was just signed by the governor last week. And so I just want clarification whether the staff presentation in September is going to only include the medical or if it's'",
        "'speaker_4': 'also going to include adult recreational use.'",
        "'speaker_8': 'We were envisioning both.'",
        "'speaker_4': 'Okay. And then. And then my next question is relative to, you know, it looks like we're possibly considering some sort of dispersion zoning, that sort of thing. One of my concerns is that we tend to put everything out on Alameda Point, so everything in the future tends to always be on Alameda point.'",
        "'speaker_4': 'And I think that, you know, when we look at the dispersion aspect of it, are we looking at how that's going to impact whether something can be located on, you know, in Harbor Bay or Bay Farm, if something could be located on the East End.'",
        "'speaker_4': 'I mean, I. Are we going to get to see maps and proposals for that in terms of the, you know, for instance, the conditional zoning regulation included in the referral of 600 feet of public and private schools.'",
        "'speaker_0': 'Not within not within.'",
        "'speaker_4': 'Not within six feet. But so what? So what does that what does that actually look like? Are we going to have a are we going to have that sort of mapping and that sort of thing to review? Like, because one of the for instance, I mean, people were referencing San Leandro, San Leandro hasn't there isn't a dispensary'",
        "'speaker_4': 'in San Leandro right now. Everything's been held up. So they issued permits and it's been delayed for 24 months. They did get they they got one through early on. Then they they've been sitting around. So my other concern is, you know, and part of the issue has just been locating an actual place to put, you know, the'",
        "'speaker_4': 'the next one. They issued two additional permits, one. One's been held up for one type of reason. The other has been held up because there's nothing there. So are we going to actually get to see the options in terms of where something's potentially possible?'",
        "'speaker_4': 'Because. I mean, hypothetically, we could approve something. And then it turns out that you can't put it anywhere.'",
        "'speaker_8': 'Yes. But I don't think we'll be able to without getting direction from the counsel of what the limitations are. I have a map that pre predicts what your direction is going to be. We can turn that around. But there are two commercial areas.'",
        "'speaker_8': 'Webster and Park are probably where we'd look first, and then you have to look at available buildings and right size and all sorts of different things like that. But I, I think the siting of the sighting of the locations is going to be the most difficult.'",
        "'speaker_4': 'Okay. And then my other question has to do with if you if we lift the ban, what is the impact of that on, you know, Councilmember Otis referral or any of the other work that's being done relative to.'",
        "'speaker_8': 'I mean, so lifts the ban that is in place right now.'",
        "'speaker_0': 'Correct.'",
        "'speaker_8': 'Well, we have medical marijuana ordinance. We are having the consultants look at that to see how. How that can match this new state regulations going forward, and that will be part of the discussion in September.'",
        "'speaker_4': 'And then are we also looking at part of what was passed at the state level, required labor peace agreement? You know, essentially labor peace relative to businesses of certain sizes, but this that local cities can regulate further than that.'",
        "'speaker_4': 'Is that going to be included in the presentation?'",
        "'speaker_8': 'That could be council direction when we bring it back. We were looking at the state regulations.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Nebraska.'",
        "'speaker_6': 'Thank you, Mayor Spencer. I appreciate everyone who came out and shared their views. When I make a decision, I like it to be an informed decision, and I appreciate it. By the way, first and foremost, of course, medical marijuana is essential.'",
        "'speaker_6': 'But I also understand that Harborside and I've visited a couple of times will deliver. So it's not that we're cutting off our, you know, patients in Alameda who need medical marijuana, but. What we heard from tonight is people have been very much in the industry who are users.'",
        "'speaker_6': 'We represent the entire city. I'm glad to hear that the survey that the city will be doing will have some questions because we do need to take the pulse of the community so that this is a big decision.'",
        "'speaker_6': 'But we also need to get our regulations in place so that it's local control, not the state that's telling us how to do what we're doing. The and there's some other things I'd like to have considered. And by the way, I feel like we've got the council referral already in place.'",
        "'speaker_6': 'Council mean staff is coming back to us. The first meeting in September. I don't know that we can tell them work faster. So, you know, this is good. But I have also read that there have been increased law enforcement costs, especially in driving under the influence, because there isn't currently a way to measure driving under the influence'",
        "'speaker_6': 'of cannabis. But we do see an increase and I've talked to the police chief about this, have seen an increase in driving under the influence, accidents and things. So I'd like to factor in, you know, what what costs will that will that bring?'"
    ],
    "Cannabis Business Regulations in Alameda. (Mayor Spencer)": [
        "'speaker_6': 'I. I just look forward to hearing the night when I got back from the League of Cities Conference in Monterrey last week, or maybe while I was there, I emailed the city manager and said, Oh, I just, you know, sat next to somebody who is a consultant with a firm that looks at the taxation issues around cannabis'",
        "'speaker_6': 'sales and dispensaries, manufacturing. And and that's when the city manager informed me that, well, we actually just had a staff presentation from another consulting firm, so we've gathered good information. So let's share it. We always, you know, you make better decisions with more information rather than less.'",
        "'speaker_6': 'So I am very. Enthused to see what staff has in store for us in September. Based on the previous council referrals. It's already been brought in. Just one last thing, if anyone knows. It is my understanding that the no smoking ordinance that exists in Alameda is silent on medical marijuana.'",
        "'speaker_6': 'So that's I mean, if you're a patient and you have your card, sorry, we don't take questions from the audience, but that's it is the ordinance is simply silent on that. So so anyway, I am I am content to wait for staff to come back in September because we're not going to get it on the next meeting'",
        "'speaker_6': 'and we'll be back to the first meeting in September. And and I think we'll all be able to make a good informed decision are several then. Thank you.'",
        "'speaker_0': 'And remember.'",
        "'speaker_3': 'See.'",
        "'speaker_5': 'You know, I was looking at this referral and I think the question has to be asked and answered. So I don't see a reason not to have the referral go forward as direction. However, I also want to make sure that.'",
        "'speaker_5': 'We make an informed decision, and that decision will include the experiences of other cities. In contemplating what we're doing compared to where it's already happened in California, as well as other states where there are a little bit ahead of the timeline, Colorado, Washington or what have you.'",
        "'speaker_5': 'And also, like, whatever comes back, because I think to simply drop these components into an ordinance and approve that in October is unrealistic. I'd like to have that full information. I'd also like to make sure that we take into account the fact that cannabis is still illegal federally.'",
        "'speaker_5': 'And there is much of the industry, I think, and I would like to know if it's actually true. Is a cash industry. Mm hmm. So.'",
        "'speaker_3': 'And so are.'",
        "'speaker_5': 'We talking piles of money that are going to be. Well, I don't want an answer now, but I. I think we need to look at the impact of that as far as what we plan on doing here.'",
        "'speaker_0': 'Remember.'",
        "'speaker_9': 'I'm sorry. I just. I just want to follow up on the vice mayor's point. We do see what other cities do on some of these zoning requirements in these these areas, the Green Zone, so to speak. So maybe when staff comes back with their maps, you know, they can give us options.'",
        "'speaker_9': 'You know, if we do it like city X with this number of feet, these are our zones. If we do it like citywide, that has a different number. I mean, this is our zone. I mean, just so we can kind of get a picture in our head, you know, rather than, you know, wait for us to give'",
        "'speaker_9': 'direction on a number. You know, we might be able to be better informed on what that number should be based on the maps.'",
        "'speaker_3': 'Well. Okay.'",
        "'speaker_0': 'So my referral was very specific in regards to including things like preferences for owner operators who currently live in Alameda, conditional zoning regulations as well as limit the numbers of of dispensaries. But I appreciate, you know, the staff is working on coming back on September 5th.'",
        "'speaker_0': 'And what I would hope is that I would have the support of council to give further direction, to propose these regulations, to have staff be more specific when they come back and and hopefully on the fifth, give us then the options so that we can give clear direction.'",
        "'speaker_0': 'Of what to come back with at the next meeting in September of what we'll be looking for September 19th, and that's the meeting after. Instead of thinking that we're going on until January, if there's any way to move it along faster.'",
        "'speaker_0': 'So I. Did you want to add, Brody?'",
        "'speaker_9': 'I mean, I don't want to wait till January either. I mean, so.'",
        "'speaker_0': 'Right. But otherwise, if you want to use the mike.'",
        "'speaker_8': 'That's when the state regulations go into effect and when recreation becomes.'",
        "'speaker_0': 'Right. But in regards to coming up with our ordinance now for medical, we should be able to do that and then be prepared to go forward in January with recreational, but not wait until January to move forward with medical access on the island.'",
        "'speaker_0': 'So that's that's in fact, my concern. What I want to try to expedite this and at least send a clear signal to staff that that's what we're looking for, that we really do want to try to expedite it.'",
        "'speaker_3': 'But I.'",
        "'speaker_0': 'Think.'",
        "'speaker_5': 'Oh, sorry. All right.'",
        "'speaker_4': 'But I just wanted to understand specifically what so what you're asking for is you're saying prioritize medical to go into effect before January 2018 and then.'",
        "'speaker_0': 'Well, that's. That's what she was saying. Because she's talking about.'",
        "'speaker_8': 'That's what I heard you say. You want the medical dispensaries to come in before it becomes.'",
        "'speaker_0': 'Legal right now within our state. Right. So, yes. That right now medical is accessible at dispensaries in other cities and not here. So, yes, so that is the ask. That's why that's what the referral is about. I mean, I'm happy to clarify it, but that's why I'm bringing in this referral.'",
        "'speaker_0': 'I don't want to wait until 2018 to be talking about medical dispensaries. I think it's appropriate for us to give direction to move forward with that now. Just like other cities do. Maybe you're not aware you can go to other cities, get medical cannabis at dispensaries.'",
        "'speaker_0': 'So that's what my ass.'",
        "'speaker_4': 'I've been working on the issue for quite some time. I am aware of that. I'm just asking what your timeline is relative to what you're asking for, because your referral includes a number of different things, including dispensaries, cultivation, manufacturing, purity and potency, testing labs, quality control facilities and other activities.'",
        "'speaker_4': 'So I don't see anything in the actual language of the referral relative to prioritizing medical dispensaries other than there's a line. Currently our medians must travel out of town to purchase cannabis, but I don't see anything else in here specific to that.'",
        "'speaker_4': 'So I'm trying to understand what your what your motion is or what your proposal is.'",
        "'speaker_0': 'So to. So I do appreciate member Ortiz comments in regards to low hanging fruit, if there are parts of it that he thinks we can expedite. But at this point, since it's the medical that is legal, then that is what the focus would be to proceed with that and come up with that.'",
        "'speaker_3': 'I ask.'",
        "'speaker_9': 'A question. So. I mean, is it possible to bring back some ordinances? I mean, again, I don't really want to. You confine it to just dispensaries because I do think manufacturing cultivation are.'",
        "'speaker_5': 'Are.'",
        "'speaker_9': 'Opportunities for Alameda but to bring back some draft ordinances excuse me in the first meeting in September maybe not a first reading, but at least some language that we could see. And if it's going along the.'",
        "'speaker_3': 'Right path, why.'",
        "'speaker_8': 'Don't we bring back examples from other cities that we have looked at and feel are good? Places to start. For the council. I mean, we can bring. The, you know, recommendations.'",
        "'speaker_9': 'And then, you know, this discussion, I think, was very helpful because this is the first time we've had a chance to talk about it since the referral. And if we didn't have this referral, we wouldn't have had an opportunity to share additional thoughts, which I think that's helpful.'",
        "'speaker_9': 'So, you know, some of the other direction that came from my colleagues on what they'd like to hear, what they'd like to see, I mean, we could take that into you can take that as direction also, right?'",
        "'speaker_0': 'A member of addressing.'",
        "'speaker_5': 'Again. I think the question should be asked and answered and. I don't see any problem with bringing in examples as long as it's not the first reading of an ordinance. I think, again, that's unrealistic and I want the the broad public to be able to weigh in on this.'",
        "'speaker_5': 'I think the I the efforts that are going on on polling and survey, I think are absolutely critical. To in the in the real world, in the world of government governance, is to understand what the broad community thinks.'",
        "'speaker_5': 'And then I still also want to understand the implications of a business, a business that's only legal in Calif or new from for our point of view, but illegal on the federal level. So our taxes being paid are so our employees paying into Social Security.'",
        "'speaker_5': 'How do we how do we gauge. The the revenues and in the business license and, you know, all these other things that go along with when you don't have when you don't have a when you have a cash economy.'",
        "'speaker_5': 'You know, that's those are questions in my mind, I think are worth the public understanding. So and I certainly want to understand that before I make a vote.'",
        "'speaker_0': 'Okay. So I. So then, so my, my motion would be to move forward with the referral plus the other comments that were made from council members. That makes sense. Remember.'",
        "'speaker_9': 'You know that everyone has a right to right.'",
        "'speaker_0': 'So so that I think. So that I'll try that. So moving forward with the referral by referral along with these other issues that were raised.'",
        "'speaker_5': 'If it, if it, if it matches what's written here, I'd say yes because then this doesn't also doesn't have a timeline. So I'm okay with that because I don't think we'll know what the timeline isn't. We have the information in front of us.'",
        "'speaker_1': 'So I would go second.'",
        "'speaker_5': 'I'll second that.'",
        "'speaker_0': 'All right. And did you have a question?'",
        "'speaker_6': 'No. I just feel like we've given staff a lot of direction. I don't really see what we're going to accomplish.'",
        "'speaker_0': 'Okay. All those in with the vote. Sorry. All those in favor.'",
        "'speaker_3': 'I. Won't let you vote.'",
        "'speaker_0': 'I suppose.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Motion carries 4 to 1. Thank you. All right. Ten. A designation of voting delegates and alternates for the League of California Cities annual conference. So who is our current series star with that? Who's our current? Who are our current delegates or do we not have delegates?'",
        "'speaker_6': 'I. I am in his mouth.'",
        "'speaker_4': 'I'm the interviewer.'",
        "'speaker_0': 'So apparently we need. So you guys currently are and that we need another motion for this specific conference. So move there a second.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'All those in favor. I motion carries unanimously ten be marriage nominations for okay at this point the nominations I have. For disability. Thomas Mills AM I. L l s. Our Planning Board, Stephen Gertler and Reuben Cellos. And those are the ones I'm able to go forward with tonight, chipping away at this.'",
        "'speaker_0': 'So have Historical Advisory Board and Public Art Commission next time, hopefully. That being said, then I can go ahead and adjourn the meeting.'",
        "'speaker_6': 'No council communications, I think.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'Can you repeat the council communique? I'm sorry, but.'",
        "'speaker_4': 'Can you repeat the names?'",
        "'speaker_0': 'Okay. So, commission on disability issues. We needed one seat. Thomas Mills and my L. The other commission planning board and my nominations on that are Steven Gawler, Gio, RTL E r and Reuben Kilos. T. I. L o. S.'",
        "'speaker_0': 'Those and then his travel advisory board and Public Art Commission all need to come back on. Now Council Communications.'",
        "'speaker_3': 'Actually.'",
        "'speaker_0': 'Did you have anything member Ashcroft did ask?'",
        "'speaker_6': 'I did, because you and I both attended the League of California's Cities Conference this past Wednesday, Thursday and Friday in Monterrey. And so we.'",
        "'speaker_0': 'Report back the.'",
        "'speaker_6': 'There were some great sessions there when.'",
        "'speaker_0': 'I.'",
        "'speaker_6': 'Attended included making housing more affordable. We just can't talk about that enough, but it does help to hear what other communities are doing. I also attended a session on voter outreach and the California Voting Rights Act reforms, and our Secretary of state actually was one of the speakers.'",
        "'speaker_6': 'There was a session on dealing with outlier city council members. And also that this was really important in today's this day and age is creating a governance of governance, culture of civility and purpose. And that's something that is really incumbent, as I said, upon the council members, the mayor and the council, to set the tone.'",
        "'speaker_6': 'We often hear from angry people more and more, but hopefully we can be civil to each other, to our staff and. And set the tone and. There were some other are really good over the one on earthquake preparedness and always good to get out there and see what other other cities are doing and and meet your colleagues'",
        "'speaker_6': 'in other communities. And also, I wanted to say that yesterday I thought the parade was awesome. And then we also attended the Coast Guard festival at at near the Hornet afterwards. And I thought a couple of the Coast Guard challenge coins, I meant to bring one so I could show it.'",
        "'speaker_6': 'But the Coast Guard did an adorable job of minting a coin that had fireworks and the Hornet and the bridge and all that. But on the other side, it also was very Alameda and even had our little love our island logo little with the rest of some little scenes about Alameda.'",
        "'speaker_6': 'So there's probably a way you can get hold of them. I think Barbara Price, who chaired the parade, has access to some of them or the city manager, right? Yeah.'",
        "'speaker_8': 'I think you're right. Barbara Price does have access to them. If anyone wants one, they can also contact our office and we'll make that connection as well.'",
        "'speaker_6': 'All right. Very nice. But anyway, and as I told the other Coast Guard folks that I met, we are very grateful that they renewed their commitment to be a Coast Guard city for another five years. And we appreciate all that they do, not just in our city, but while the mission of the Coast Guard is broad and'",
        "'speaker_6': 'they do a lot for our country. Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor.'",
        "'speaker_4': 'I attended the Alameda County led abatement JPA meeting, as I typically do as the delegate from the city of Alameda. One thing that we covered was the fact that East Bay Mud did announce that they have lead contamination in some of their pipes in the Berkeley Hills and also in Moraga.'",
        "'speaker_4': 'I'm sorry, Lafayette. And so they're Lafayette. And so they're currently working on finding out figuring out a pathways forward to remediate that. And the other issue that we discussed was the fact that there is a large there was a news article relative to a publication by the FDA that there is a can lead in a lot of'",
        "'speaker_4': 'the baby food that is out there on the market. And the FDA won't release the names of the individual companies that are producing food that have lead contamination. But interestingly, Gerber is fighting the publication of any of the names and also fighting the report to say that they think that letter is naturally occurring and therefore, okay.'",
        "'speaker_4': 'So we are trying to figure out ways that we can partner with the food banks and other groups to get the information out and to perhaps press for more transparency relative to what those tests actually what the results of those tests were.'",
        "'speaker_4': 'And finally, we have in October. So June was led led awareness prevention month. And in October we have a specific week that we focus on. I think it's the third week of October. And so I was in communication with our city manager about potentially having Larry Brooks, who is the executive director, the new executive director, come to'",
        "'speaker_4': 'make a presentation to our city council about the work that's being done, what's going on with funding and other legislation that's been pending and and the work that the lead abatement agency is actually doing.'",
        "'speaker_0': 'Member.'",
        "'speaker_9': 'Thank you. I'll be quick. I just want to give a quick shout out to Barbara Price and the entire parade committee for a fantastic parade yesterday. Maybe we can just. APPLAUSE I know it's against the rules, but. And last week I was in a maybe this requires a referral, so I'll just put it out there and see'",
        "'speaker_9': 'what happens. But it was a press conference with the public defender and there's an effort to move all arraignments from Oakland over to the new courthouse in Dublin. So that would make it harder for any any defendants and the folks in custody in Alameda and their families to actually attend that hearing.'",
        "'speaker_9': 'So perhaps the council could consider, you know, weighing in on a letter to the presiding judge.'",
        "'speaker_4': 'It's also going to impact staff time relative to having to commute out there for arraignment. So all of our officers who have to go testify are going to have to tack on the additional travel time to go out there.'",
        "'speaker_9': 'Which could be like two or 3 hours.'",
        "'speaker_5': 'The city manager, everybody says.'",
        "'speaker_0': 'Yeah, all right. So well, that's.'",
        "'speaker_6': 'Which means we'd like to hear all sides of the situation. It sounds very compelling, but there's probably a reason.'",
        "'speaker_9': 'Money.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_0': 'Remember? Does that complete your comments?'",
        "'speaker_9': 'Yes. Thank you.'",
        "'speaker_0': 'Okay, then I. Go ahead. Okay. Then I wanted to share and I want to thank we have some people here at the live in town that had created a movie in regards to gay marriage that we hosted here in chambers a few weeks ago.'",
        "'speaker_0': 'And so I want to thank them for sharing it. And the people that attended it was different then from a historical perspective, and I think we'll end up showing it again in the future. Another thing recently we had Relay for Life in our city is Anson High one more year.'",
        "'speaker_0': 'And that's always for those of you that don't know, it's a 24 hour period where people show up at the track and our police and fire. Our city had a team. We were all out there raising money to find a cure for cancer.'",
        "'speaker_0': 'Then we had and that member I spoke to, she and I were both down at the convention in Monterrey for a few days to for the issues that she spoke to. And some things that came up there that we might want to consider was having councilmembers speak once and timing council members, not just the public.'",
        "'speaker_0': 'We may want to look at that.'",
        "'speaker_5': 'We have that in our state.'",
        "'speaker_0': 'We really want to.'",
        "'speaker_3': 'Have 3.'",
        "'speaker_0': 'Minutes, so maybe we want to look at implementing that. That was one of the things that.'",
        "'speaker_5': 'Already been implemented we're not following.'",
        "'speaker_0': 'Okay. So I appreciate that. We also had we had young Dongguan Mayor Park Si Bok, the delegation from our new sister city that we of we supported at the last council meeting. And then we formalized the employees. They were here.'",
        "'speaker_0': 'They came on Saturday. They were here through the parade. They participated in our parade. And I know and I want to thank our meetings because I know on the parade route there were Alamitos. They had signs congratulating them that I thought was really, really good.'",
        "'speaker_0': 'It's just great when our in our community steps up. So and I want to thank all the businesses that supported that. It is, of course expensive. And so you know thank you to all the businesses and he Xiong Matz who was the chair of who is the chair of that sister city delegation and then U.S. Coast Guard'",
        "'speaker_0': '. Base. Allen made a pact and did it one more time, stepping up with our inaugural festival. There were over I heard 2000 people attended. They do plan to do it every year in the future. And it turned out really well.'",
        "'speaker_0': 'Of course, the parade was was amazing. So thank you, everyone.'",
        "'speaker_6': 'Member Ashcraft I'm sorry, I forgot when you and I both were at Relay for Life on that Saturday, and then I went later in the day to the ribbon cutting for the Center for Independent Living. And a lot of you know that it Center for Independent Living started, I think, in the sixties in Berkeley, and they have'",
        "'speaker_6': 'just opened up a headquarters at Marina Village Parkway. And they also presented a lovely gift to the city, which was this beautiful, streamlined, mechanized wheelchair that would allow you to go on the beach and even into the water if you are confined to a wheelchair.'",
        "'speaker_6': 'And they presented it to our recreation and Parks Department. You have no idea. Well, maybe you do. I didn't know how beautiful and streamlined wheelchairs have become. They're going to be working with our school district. And I said, you know, we're getting ready to finalize this universal design ordinance, so maybe you can weigh in on some of'",
        "'speaker_6': 'that. But it's it's very nice to have their presence in Alameda.'",
        "'speaker_0': 'And I want to thank you. So I was late to that event. And so member Ashcraft was there for the actual ribbon cutting. But then I was able to tour the facility and encourage them to participate in the run yesterday morning.'",
        "'speaker_0': 'Midway Shelter to benefit Midway Shelter. And you may have seen we had a few people here in wheelchairs from from that center participating along with Admiral MEJA and Coast Guard members. So that being said, I will now during the meeting at 1230 to goodnight, everyone.'",
        "'speaker_3': 'I guess.'"
    ]
}