{
    "Resolution for Cooperation Agreement with Eden Housing for Affordable Housing and Transportation Projects at Alameda Point.": [
        "'speaker_1': 'Adoption resolution authorizing the interim city manager to execute a cooperation agreement and any amendments thereto between Eaton Housing and the City of Alameda for compliance with the requirements of a grant application under the Affordable Housing and Sustainable Communities Funding for the 70 Unit Affordable Housing Project on BLOCK eight within City and Alameda Point and Transportation Projects.'",
        "'speaker_4': 'Good evening council. I'm I'm Debbie Potter, the city's space reuse and community development director and this item is requesting approval to submit a grant application in conjunction with Eden Housing for what we sometimes call the cap and trade money, which has the fancier HSC grant.'",
        "'speaker_4': 'And we set up the staff report in a way that provided some flexibility for for the Council because we were not sure which transportation projects would best fit within the grant application, and we were working on that. And one, we had two changes that we wanted to call to council's attention this evening prior to the Council's vote'",
        "'speaker_4': '. One is that we are requesting lighting for the cross Alameda Trail that was value engineered out the first time around and we had the staff report reflect that cost of $800,000, that cost has actually gone up to $950,000.'",
        "'speaker_4': 'But fortunately, we can still be competitive under the grant with a $950,000 request. So we're asking that the resolution be modified or when you adopt the resolution to be modified to reflect the 950. And then we have determined that the Main Street project is the project we're going to move forward with.'",
        "'speaker_4': 'And depending on the budget, we would like to have the flexibility to add a new sidewalk on the east side of Main Street. And so we just want to call that to your attention to. And then the idea would be that we would ask that the Council adopt the resolution as amended to reflect the additional funding, the'",
        "'speaker_4': '950,000 for the lighting and the opportunity to potentially do the new sidewalk on the east side of Main Street. And I will say that these few changes that we're proposing do not affect the overall maximum grant amount. So it would still be happening within that cap.'",
        "'speaker_4': 'So that is the request. And then we have the representatives from Eden Housing here this evening. They are chomping at the bit. They are really anxious to give the council an update on where they are with the two housing projects because a lot of a lot of progress has been made since the last time we were before'",
        "'speaker_4': 'the council in October. And so I would like to ask Lewis Lis, who is the project manager for Eden, to come up and give a brief update on the senior as well as the family housing project.'",
        "'speaker_0': 'I think I can speak for the council by saying that we love to hear about good progress, so come on up.'",
        "'speaker_7': 'Hello and thank you for the.'",
        "'speaker_2': 'Chance to make a.'",
        "'speaker_6': 'Brief update. It's good to see some new faces and some less new faces.'",
        "'speaker_0': 'And if you could get a little closer to the mic, we could even hear you.'",
        "'speaker_2': 'Awesome. So I just wanted to update that. The Alameda Point Senior Project, thanks to our close work with the council, is ready to close and we'll be closing in mid-February and starting construction soon after. So that'll be up and ready to go in 2020.'",
        "'speaker_2': 'And then as well as this asset grant, we're taking a few other shots for funding on Alameda Point Family and we're excited to keep you updated on how everything goes.'",
        "'speaker_0': 'That was brief. Okay. Thank you so much. All right, counsel, are there any questions or comments? Miss Potter, had you finished your remarks? Okay. So with that, we we need to approve this resolution as amended with the amendments suggested by Miss Potter.'",
        "'speaker_0': 'Do I have a motion so moved? Vice Mayor has moved. Councilmember Vela has seconded all in favor. I. I it passes unanimously. Thank you all. Okay. So moving on our. First Council item is six eight.'",
        "'speaker_1': 'Recommendation to provide direction on the city's proposal for the Homeless Emergency Aid Program and authorize the Interim City manager to work with the Social Service Human Relations Board to finalize and implement the city's programs and services.'",
        "'speaker_0': 'Thank you. When you get them.'",
        "'speaker_4': 'As we go. Yes. Good evening, counsel. I would like to have the staff presentation be made this evening by Anabaptists, who is our community development analyst and who has been working tirelessly on this topic. And she has a brief PowerPoint presentation.'"
    ],
    "Direction on the Homeless Emergency Aid Program and Authorization for the Interim City Manager.": [
        "'speaker_4': 'I believe there are probably a number of speakers, and then we're happy to answer any questions. Thank you. I'd like to introduce Anna.'",
        "'speaker_0': 'Can you hear me? Yeah. Yeah.'",
        "'speaker_9': 'Well, good evening, Mayor Ashcroft and members of the city council. My name is Anabaptist, community development analyst with the Base Reuse and Community Development Department. We have a very exciting and unique opportunity to address homelessness in our city.'",
        "'speaker_9': 'And we thank you for giving us some time tonight to talk to you about some of the ideas that we have for how we're going to spend our homeless emergency aid program, which is also known as Hip, and I'll be using that acronym from here on.'",
        "'speaker_4': 'So I see.'",
        "'speaker_9': 'So tonight's presentation, we're hoping to provide you with some overview of heap answer your questions. Also obtain your input and direction on the cities proposal that we submitted to the county in November about the potential projects that we can explore for this funding and also obtain your approval to authorize the Interim City Manager and Social Service Human'",
        "'speaker_9': 'Relations Board to work together to finalize the the and implement the plan for the programs and services that will fund under this this grant. The homelessness. And this is not new information for you. What I wanted to do is just provide you some backdrop of the homelessness in Alameda County as well as in the city of Alameda'",
        "'speaker_9': ', because there is a new report that was published by the County Continuum of Care S.O.S. called Everyone Home. And this report is a strategic plan to end homelessness in our county. So they pointed out that there were 5600 people who are homeless in the last point in time count, which was that in 2017, we have one coming'",
        "'speaker_9': 'up at the end of this month. So we'll see what those numbers look like from where we stand right now. And at this point in time count, in January of 2017, 204 people were identified as homeless in our city of Alameda and the city strategic plan to end homelessness.'",
        "'speaker_9': 'There's a very aggressive goal of ending homelessness, of course, but in the next five years, what they want to do is slash the 5 to 600 homeless people to about 2200 in the next five years. So we have to do our part as the city of Alameda and part of the county to to help with ending homelessness'",
        "'speaker_9': 'and meeting this goal. In the plan. They did an analysis of what it would have taken for the clients that they served in 2017 to end homelessness. And it's no surprise housing, whether it's rapid rehousing, subsidized permanent housing or permanent supportive housing, would have made a difference in ending homelessness.'",
        "'speaker_9': 'The other is prevention. We don't do enough around prevention. And actually this our clients that they interviewed who were part of their program. So there are many more prevention programs that are going on out there, including in our city that we don't know about.'",
        "'speaker_9': 'So we need to find out about that. And that was actually shared with us today at a meeting that I was in this afternoon. So a quick overview of HEEP. This was established last year by Governor Brown signing into law in August of 2018 and Senate Bill 850.'",
        "'speaker_9': 'Provided this influx of money for homeless emergency aid and it is really to address homelessness in our local jurisdictions and the immediate challenges that we have that we can address overall as a state, we are getting a 500 $500 million block grant.'",
        "'speaker_9': 'Cities that are large with 330,000 people or more can apply directly to the state for this money. So the city of Oakland is the only city in Alameda County that has that means that that population threshold. And so they were able to get $8.7 million on their own.'",
        "'speaker_9': 'And then as a county, we are receiving $16.2 million, including in that is Oakland. And out of that, $756,524 will be allocated to Alameda City. So we have a very good opportunity to address some of our issues here.'",
        "'speaker_9': 'On November 20th, the Board of Supervisors approved this proposal from this from the staff on this allocations. And actually, we have several mayors, including our mayor, former Mayor Trish Spencer, who is actually here. Really go out there and advocate for for making sure that we get our fair share.'",
        "'speaker_9': 'So thank you for for doing that. And that really made a difference. So continuing on with the overview, there's a very aggressive timeline on spending this money. So as we think about programs and services that we're going to implement, we have to think about how readily can we implement these services, because half of the money has to'",
        "'speaker_9': 'be contractually obligated by basically the end of this year. And we anticipate having a contract in place with the county right around March. So we have nine months to have half of the money contractually obligated and then 18 months later, in 2021 of June, all the funds have to be expended and Alameda requires Alameda County requires a'",
        "'speaker_9': '30% match. What constitute a match that still has to be worked out? So we don't have the details of that yet. But many of our cities, including ours, is really advocating for making sure that this doesn't give us any more burden coming up with cash.'",
        "'speaker_9': 'And so and because we do have a lot of investments already from our city in homeless services and many of our cities are are in the same boat. So we're hoping that it will be a very reasonable match requirement to make this 30%.'",
        "'speaker_9': 'And then also the cities are allowed to carve out about 2.5% of their funding for administration. So the hip contract or hip grant has three eligible uses. So basically broad categories. The first one is services. And including in services are things like street outreach, health and safety, education, homeless prevention activities, other services that will prevent folks from'",
        "'speaker_9': 'becoming homeless. The second category is rental assistance or rental subsidies, housing vouchers, motel vouchers, rapid rehousing programs, those kinds of things. And then finally, capital improvements. So building emergency shelters, navigation centers, transitional housing and what have you are under that.'",
        "'speaker_9': 'They use this muscle and they use this of the funding must align with California's housing first model. So meaning that, you know, if we build something, services must be low barrier because that's part of the reason why a lot of homeless people don't want to, let's say, go to shelters or go to some of these housing that'",
        "'speaker_9': 'will be available because of the the barriers that they have to kind of overcome to be able to access those service services. So providing housing first and then we can provide intervention, that's really very important for the success of our over the clients.'",
        "'speaker_9': 'There are also very specific metrics that the state is requiring for reporting purposes. So here are some of them. These are the minimum required. So we will be collecting data on number of people serve number of persons exiting to permanent housing, what have you.'",
        "'speaker_9': 'And the county might require us to also provide some additional data, but these are the ones that we will be collecting right off the gate. So when we submitted the proposal, it was a very quick turnaround. November six, the county issued the the request for cities to submit the proposal.'",
        "'speaker_9': 'Two days later they were due. And so we didn't really have enough time to process this with, you know, with the city council, the Social Service, Human Relations Board, the community. However, we knew that the money was coming down the pike.'",
        "'speaker_9': 'So we have some ways of engaging with some groups, including the homeless outreach team, which is we call it heart, also known as the collaboration Advancing Resources, Efforts and Support for Alameda Homeless or Cares. And this is a team that's made out of of multiple disciplines, multiple sectors, including the business associations, faith based community, the food bank'",
        "'speaker_9': ', Alameda Unified School District, the community based organizations. And a lot of them are actually here tonight. And they the Alameda police, they have been very supportive. And and we meet on a regular basis. And so because they're boots on the ground, we know exactly what is needed because that's what we talk about at these meetings.'",
        "'speaker_9': 'And so we who have identified some of these programs and services that's really needed, that's not here in Alameda. And with this money, that's an opportunity for us to really think about what makes sense for our clients based on what we're hearing from from the streets.'",
        "'speaker_9': 'Also, we participated in everyone home as well as county meetings regarding Heap. And so there were lots of meetings around that. So we we were in attendance at these meetings. And then we also looked at smaller cities and for maybe opportunities for us to collaborate.'",
        "'speaker_9': 'So Fremont, Hayward, San Leandro and Union City, because we knew that there was, you know, the money's not going to be big. But however, are there opportunities for us to kind of partner together and leverage the dollars that we're going to get?'",
        "'speaker_9': 'And so we've had some meetings around that as well. So here's what we propose to the county. And I just you know, the caveat is this is more like a placeholder than it is a permanent sort of fixed proposal.'",
        "'speaker_9': 'The projects that we identified here, again, are based on some conversations and also looking at our homelessness report that the council approved last year in March. And the county is going to give us flexibility in moving some of these funding around.'",
        "'speaker_9': 'So if we feel and as we go along, that we need more money, let's say, in rental subsidies, when we can move some of those moneys around, as well as some of these programs and projects can be changed.'",
        "'speaker_9': 'And as we talk to the community members, business community, our hot team, and we are gathering all of those input to see what really makes sense. So. We have divided the sort of the the allocation as 20% under services.'",
        "'speaker_9': 'And one of the projects that we identified is maybe sharing a mobile hygiene unit with the cities of the smaller cities. I mentioned earlier Hayward, Fremont, Union City in San Leandro. And so basically we can purchase together like a refurbished bus where it's a shower facility, and then one day it can be in Alameda, the next day'",
        "'speaker_9': 'it could be in Union City and what have you. We also talked about a sanctioned car and RV parking. We have a lot of folks here in Alameda that are homeless, living in their cars and they're one foot from losing their car and being in the streets.'",
        "'speaker_9': 'So, you know, again, and they don't feel safe parking in a parking lot in the evening, especially women. I've talked to a couple of women at these dine and connect dinners that we have, and they have multiple health conditions.'",
        "'speaker_9': 'They're elderly and they're living in their cars. So, you know, really a big concern. So we said maybe 20% of our allocation, around 4100 $47,000 will be on services and then rental subsidies, motel vouchers, about 10%. And then finally, capital improvement.'",
        "'speaker_9': 'And one of the programs that we thought would help the business community are public restrooms, one on the west side and one on the downtown Parks Park Street side, because we know that folks, especially in our business community, have been complaining about the smell of urine and and what have you said?'",
        "'speaker_9': 'Attention is important. So some of the feedback that we received since we submitted the proposal, we are doing work on engagement, on outreach. Right now we are a funding operation Dignity and also building futures for outreach. However, we need more efforts to go into engagement because we know that to build trust we need they need to see'",
        "'speaker_9': 'us more often. And we have our outreach workers spending an entire day, for instance, going to Hayward, sitting with a client to apply for a job. And they need to serve more people. And so they can't really spend, you know, one client at a time.'",
        "'speaker_9': 'They need to really be able to serve more. And but there may be some opportunities for us to create some programs that really would provide more engagement to to some of our clients, one of which is an ambassador program.'",
        "'speaker_9': 'There's also a need for, you know, in this engagement, we can also problem solve around housing with this with our clients. So, you know, really trying to figure out together how we can help them get connected to housing, including maybe there may be family members not in Alameda but outside or could be a family member in another'",
        "'speaker_9': 'state. Is there a way that we can reunify them and and figure out a way we can help them and support them in reunification? We also want to develop, you know, another feedback that we receive is we need to encourage more landlords here in the city to accept Section eight voucher housing.'",
        "'speaker_9': 'Section eight, Section eight vouchers. We need to increase some of those affordable housing stock here in Alameda. So can we create a campaign using some of this dollars to do that drop in center? If we have a place for them to go during the day, then they won't be loitering around the downtown districts.'",
        "'speaker_9': 'We can provide services by bringing the service providers there. We can enroll them to service has right, right then and there, and we can even do some job trainings. For instance, if we have a drop in center and even though this is immediate one time, you know, quick money, can we use the money as a seed funding'",
        "'speaker_9': 'for a larger infrastructure project in the future? And then we have a warming shelter right now that's funded by the county. That's just a season this winter. And every winter we have cold and rainy season. So is there a possibility of kind of investing more into a more permanent warming shelter for our homeless residents and then providing'",
        "'speaker_9': 'the rental subsidies? It's another it's another idea. This afternoon I had a meeting with the business community, and they also came up with some ideas. The idea of having a mobile shower unit was very overwhelmingly supported. The idea of having the public restrooms, not so much.'",
        "'speaker_9': 'There were other some other ideas around, you know, really addressing mental health because we have clients who, as we know, not everyone who was homeless has a mental health issue, but those who who have mental health issues really need a lot of support.'",
        "'speaker_9': 'So can we address some of the mental health issues using this this funding? And then in terms of prevention, we have somebody from Saint Vincent de Paul who attended this meeting, and they're doing a lot of work already.'",
        "'speaker_9': 'And there are other organizations and churches who are doing a lot of work around the homeless. And these these organizations are preventing some folks from becoming homeless. So can we support them because they're also struggling? So can we put together some kind of assessment of who's doing what in our city and then try to provide some support'",
        "'speaker_9': 'for for for some of these already existing programs, including the ones that are run by volunteers. So as a next step, we would like to hear your feedback tonight and then we will continue engaging with the business associations and their members, other stakeholders.'",
        "'speaker_9': 'We will continue to work with the Alameda Cares and the Homeless Outreach team. We want to align whatever it is that we're doing with the strategic plan to end homelessness that the county has put out there. And then finally, we want to work with the interim city manager and the Social Service Human Relations Board to finalize the'",
        "'speaker_9': 'plan and oversee the implementation of this program. So if you have questions and comments, we're here to answer them.'",
        "'speaker_0': 'First, I want to thank Ms.. Bag, too. That was an excellent report. And you are doing such important work. You and your team are doing such important work in the city. And so I thank you for that. At this point, I'm.'",
        "'speaker_0': 'Do we have any clarifying questions from the council? We'll do our feedback on our discussion after we've heard our public speakers. But Councilmember Odie.'",
        "'speaker_3': 'Thank you. And a second to comments about the presentation. Thank you. My question was regarding the Section eight advertisement. Just say, for instance, we did have 20 landlords that were willing to provide Section eight vouchers. I mean, how would they go about doing that?'",
        "'speaker_3': 'I mean, is there a cap? Are they available?'",
        "'speaker_9': 'We don't have those kinds of details yet. We will be working with the Housing Authority on how to put some a program like that together. And so definitely engage in how best to deploy this kind of program when we go when we go ahead and implement the program.'",
        "'speaker_3': 'Okay. Then my second question was, so the 30% we have to come up with another say 30,000 or what is it, 210 to an $11,000? Is the the money that we allocate that we've allocated before, can that be counted as a match?'",
        "'speaker_9': 'That's what we're hoping and that's what we're pushing the county to consider. We have a contract with Operation Dignity, for instance, that's funded through general funds, city general funds. We also have a contract with our building futures right now.'",
        "'speaker_9': 'We have many other programs. If they would accept, for instance, in-kind support or in-kind match, if you count just the people who are sitting at the homeless outreach team, public works, Alameda Police Department, if we can count those, we would be way overmatched already.'",
        "'speaker_9': 'Yeah. Yeah.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'And Councilmember De.'",
        "'speaker_2': 'Thank you very much for your presentation. The thing that caught my attention was your reference to RV camps. So have we as a city made commitments that we are going to have RV camps and and have we as a city move forward in terms of, you know, the policies and practices and and how we're going to deal'",
        "'speaker_2': 'with that. My understanding is that in some cities across the Bay Area that this isn't necessarily well-received. So I want to make sure that we have our expectations are clear and our policies are clear. And so I just want to know I don't know if the answer is tonight, but at some point in time.'",
        "'speaker_9': 'Also, we have not made a commitment. What was the conversation with the other smaller cities that identified this as a need? And what we had said is we can explore where this might be possible, including maybe approaching the county and having an RV park and safe parking in an unincorporated part of the county.'",
        "'speaker_9': 'And I know some of the cities had a location in mind, but again, no commitments from anyone. It's a conversation that we've had and we will revisit that and see if it makes sense.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. And his next councilmember village, raise your hand up. Yes, please.'",
        "'speaker_8': 'So I did have a question and it was a question that was from earlier this week, which is the impact of the federal government shutdown on programs like Section eight. So are we putting that into working that into consideration as we're kind of exploring what the different options are?'",
        "'speaker_4': 'Um.'",
        "'speaker_9': 'Maybe I'll turn it over to Debbie Potter.'",
        "'speaker_8': 'I know that the the housing authority has made arrangements for the next few months, but before we advertise expanding a program, I would just. I just want to know for building those sort of questions in.'",
        "'speaker_4': 'Right. I think that right hand left hand coordination is always important to end. My guess is because we don't anticipate the money and the contracts coming from the county until March, we would be quite hopeful that the federal shutdown will have been resolved well before then and that by the money comes in and then we'll begin the'",
        "'speaker_4': 'deployment. And we would work very closely with the Housing Authority staff. They have a a team that works with really the private landlords and engaging them and marketing to them.'",
        "'speaker_8': 'Would we? So taking that into account, I understand that we're being helpful. Will we make alternative plans for the rest of the funding in the event that that's not the case?'",
        "'speaker_4': 'Yes, and this is one I think that will not be a high dollar amount, because it's really a marketing campaign to encourage the private sector landlords to step up and take Section eight. So, yes, we I don't think we would undertake something that we think isn't going to be successful because of other ways, you know, that we'",
        "'speaker_4': 'can't control like the shutdown. Okay. Thank you.'",
        "'speaker_0': 'Both very. Did you have any questions at the same. All right. Thank you very much, Inspectors. So at this point, we have three public speakers on this item. The first is Mr. Pat Nagle, and you will each have 3 minutes to address the council.'",
        "'speaker_7': 'Mayor Ashcraft and city council members and all of you. My name is Sister Pat Nicole. I am a member of the Alameda All Faiths Coalition and also of the Heart Cares team. Many years ago, a young spiritual teacher invited us to live our lives by loving one another as ourselves.'",
        "'speaker_7': 'Sometime later in his journey, he was met or joined by other spiritual leaders who also shared this value. Love your neighbor as yourself. And love. Is that what unites all of us? We're experiencing that love today here in Alameda.'",
        "'speaker_7': 'My outreach to our brothers and sisters who are without shelter and who are living in the streets and in their cars. This reality is close to all of us, not only in our personal lives, but also in our lives communally.'",
        "'speaker_7': 'I have experienced the Dine and Connect Meals, which are held monthly for several months, and I have witnessed and felt the trust building and the engagement, the signs of acceptance and trust in our community of unsheltered friends. And really the love of the generous group of volunteers who keeps this dinner going monthly is a witness and a'",
        "'speaker_7': 'testimony to the people of Alameda. We're at a juncture now with the heat money that's coming and what will really help us and what will really serve to base what we do and the love that binds us all together.'",
        "'speaker_7': 'And that will be engagement will foster that engagement and sense of belonging and acceptance among all the possibilities. I urge consideration of a day drop in shelter. Of course, homeless and providing homes is the major need. And I expect to see from all of you and all of us an aggressive effort to provide shelter for everyone.'",
        "'speaker_7': 'It's their right. If that's not possible, then let's have a day drop in shelter. Folks would love to come and connect and hang out and just rest for the day and get out of the cold and smoke. If we have any other fires, I know how hard some of our community members worked during the fires.'",
        "'speaker_7': 'That's it.'",
        "'speaker_0': 'That the time is that. Thank you, Sister Pat. The next speaker is Liz Varella. Liz. And after that, our last speaker is Marguerite Bashan.'",
        "'speaker_4': 'Good evening, mayor and council. I'm Liz Barela.'",
        "'speaker_8': 'I am the executive director of Building Futures. We provide homeless domestic violence and housing services here in alameda.'",
        "'speaker_4': 'I have to second what Sister Pat said. I think we have done a great job in the city of being creative and leveraging our resources and using the community to help make things possible. This heat money is really a chance for us to imagine what do we need?'",
        "'speaker_4': 'What seed we need a plant for infrastructure to help homeless people that live here in Alameda live a dignified, safe life until they get into housing because of the housing crisis, that may might take longer than we think.'",
        "'speaker_4': 'And so I think we have to think that way. How do how are we going to support people living on the street? When I say living, that means they're doing everything we do in our house, everything we do.'",
        "'speaker_8': 'In our bathroom, everything we do in our bedroom.'",
        "'speaker_4': 'In public, outside, in front of us. And so how.'",
        "'speaker_8': 'Does Alameda want to address that? What do we want to build?'",
        "'speaker_4': 'Daytime.'",
        "'speaker_8': 'A daytime drop in center will be great. A low threshold navigation center. A shelter where people can go.'",
        "'speaker_4': 'That would be great. Those are the kind of things we all need to think.'",
        "'speaker_8': 'About and invest in.'",
        "'speaker_4': 'So that we so we use the $700,000 and really make a difference for not just the people who are living on the street, but our community making us all safe here in Alameda. I really.'",
        "'speaker_8': 'Am encouraged that that we will make the right decision here in Alameda and that.'",
        "'speaker_4': 'The city is really talking to the right people. Thank you.'",
        "'speaker_0': 'Thank you. My mission.'",
        "'speaker_7': 'Thank you, mayor and council members. I'm Marguerite Bouchon. We provide with Operation Dignity. We provide transitional housing out here and in Oakland for formerly homeless vets. And we also do street outreach here in Alameda and in the city of Oakland.'",
        "'speaker_7': 'We're doing some of those the community cabin sites in Oakland as long as well as outreach I second in support everything that has been said thus far I we have an outreach worker here every day. I just spent a little time with her today to kind of get an update.'",
        "'speaker_7': 'She kind of seconded some of these ideas and the challenges. You know, there's a couple challenges we don't. The good news is there's not a lot of people when you think about what we're dealing with in Oakland and you think about Alameda, it's a very different situation.'",
        "'speaker_7': 'It's doable. Finding people is hard. So getting people to services is difficult because it's difficult to find people. Getting people to leave their stuff is difficult because that's that's what they've got. That's their, their worldly possessions. Getting them to come somewhere for the day is hard.'",
        "'speaker_7': 'So when you think about solutions, clearly housing assistance is great and that's really important. Daytime drop in center warming, shelter, good ideas. I would like to see it so that it's more like maybe it's a navigation center. It's something that people can really come and stay for days on end.'",
        "'speaker_7': 'And there's meals potentially. We do that in Oakland so that they can kind of get out of the elements. They feel safe and then you direct services to those individuals. And we have found that to be I mean, it's you know, it's incremental.'",
        "'speaker_7': 'It's one person at a time, but we are having a positive effect when we're doing that. So I would just say sanctioned sites or something like that, drop in centers, those are so important. The last thing I want to say is we had a really great story today.'",
        "'speaker_7': 'So my outreach here spent the entire day working with a young man who's living in his car here in Alameda with his girlfriend. And her goal today was to get him connected to social services and get food stamps.'",
        "'speaker_7': 'So right before I left, she came back and said he got the food stamps and they offered him a job because he's bilingual. So he's going for an interview tomorrow. So once again, it's one person at a time.'",
        "'speaker_7': 'But, you know, it's a dedicated effort. If we really see it through, we can. I think we can. We can do it here. So I thank everybody for their time. And I think all the agencies we're working with.'",
        "'speaker_0': 'Thank you very much. It's our last public speaker on this item. So now we will add to our discussion of the council. We've we've seen the presentation, we've read the staff report. Who wants to who wants to lead off on this one?'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_4': 'I.'",
        "'speaker_8': 'Think ultimately starting at a place of compassion and recognizing just basic human dignity and providing access to it are kind of the the central focus of all of the things that have been put forward is different ideas. I do like the idea of trying to see where we can accomplish a number of different things through one action'",
        "'speaker_8': '. I think, and I certainly appreciate the work and I know the work that went into this because there is a quick turnaround time and there were a number of different other elements going on and outside forces trying to, you know, that were complicating the conversation a little bit politically.'",
        "'speaker_8': 'But $750,000 is not a huge amount of money. And so I do think we we should kind of think big about how, you know, what are the real needs of the of the population that we have, but also recognize the constraints of this funding and then think about how we're going to provide ongoing services, how do we'",
        "'speaker_8': 'start something, do it successfully, and then give it room to grow? And so I do like a lot of these ideas. I think to the extent that we can combine and I think things like, you know, if there's an opportunity to expand the warming shelter so that it becomes a drop in center than you have access to'",
        "'speaker_8': 'restrooms, you have access to food, you can allow for that engagement. Those sorts of things seem like they can accomplish more than one goal. And I think sometimes we start out by throwing out a list of solutions rather than sitting around and defining the problem.'",
        "'speaker_8': 'And I think ultimately where I get at with this is that the problem is, is basic access to simple things. That allow for people to retain their dignity regardless of if they're housed or unhoused. And so, you know, access to clean facilities that are safe so that you can use the restroom, so that you can be safe'",
        "'speaker_8': ', that you can be warm. And the elements don't stop necessarily just because it's daytime. And so that is a concern. And I think where we can, like I said, overlap and be efficient in terms of providing a number of different things in one place.'",
        "'speaker_8': 'That's what I would like to to focus on.'",
        "'speaker_0': 'Thank you. So we just go down the line, Vice Mayor, and that's why you're on.'",
        "'speaker_6': 'You wanted to go.'",
        "'speaker_3': 'It's up to you.'",
        "'speaker_0': 'We'll go down the list.'",
        "'speaker_5': 'So thank you for this. And I want to thank staff for answering a number of questions I had before the meeting. You know, I think this is an interesting list. I guess the way I've come to think about this, these are one time funds and one time funds.'",
        "'speaker_5': 'I would I would I do appreciate is that the staff's proposal in the Shrub proposal really does focus the one time funds on something that would be built and then permanent. And I think the more that we can use these funds for permanent long time use rather than short term.'",
        "'speaker_5': 'But unfunded operations, I think would be good, which is not to say that we shouldn't look at some sort of rental subsidy work, but I think the more that in Vice Mayor Vella said this as well, the more that we can use this to build something that can continue, I think the better.'",
        "'speaker_5': 'You know, the public restrooms on two Main Street areas is one that kind of raises some concerns for me, not in that it's not needed, but I worry that it's going to have one of two impacts. It's either going to become something that is that is built and people are kept away from.'",
        "'speaker_5': 'So it just becomes a public amenity for shoppers, which is really not with the uses here, or it's going to become a place where where people congregate because it is a place that they can use facilities and what not.'",
        "'speaker_5': 'And if we were to go forward with something that that referred to, it was looking to build restrooms, etc. I would like to see some sort of operations plan and commitment from both the business associations and the and the city to use it as a, as a site, you know, for the shared, the mobile hygiene unit, etc.'",
        "'speaker_5': ', and for offering services and connecting with people because it will become a working in San Francisco. I can tell you that they do become site gathering sites, not always necessarily in a bad way, but the city, I think, has learned that as they do, you need to be there to offer services, connect people and then get them'",
        "'speaker_5': 'the further services that you need with it. Similarly, I very much appreciate the creativity of partnering with five other cities, two or four other cities to get a mobile hygiene unit, which I do think is likely needed. Just making sure that if we were to move forward in that we have some sort of a use agreement, we'",
        "'speaker_5': 'have some very large cities that would be partnering with us, and it would be an unfortunate thing for us to spend a fifth of our our money on a fifth of a of a RV that we get to use once or twice a month.'",
        "'speaker_5': 'And so I would be looking look, looking for for how that is. I think because of seismic issues in one area, we do have a very vacant building that has been vacant for decades across the street looking at it, even if there are some sort of shorter mid term solution that could be used for navigation center or'",
        "'speaker_5': 'something like that at the Carnegie the old Carnegie building, I think if there were some way to use some of this funding to to put something in that could serve people for through the cold, cold days, etc., I think could be a be a good use.'",
        "'speaker_5': 'We've been unsuccessful to find anything else to do with it, and it's not providing much other than architectural beauty, which it will continue to do, whether it's a navigation center or not. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Daszak.'",
        "'speaker_2': 'Well, thank you. I really appreciate the partnering that our staff is doing with other cities. And in Alameda County along the 80 corridor, I think, you know, we should continue to dialog with them, share resources. And so I think that's an imperative.'",
        "'speaker_2': 'So I want to definitely encourage that. I would say that, you know, you know, keep a keen eye on on discussions regarding a dedicated RV park that's sanctioned by the city. You know, I have seen articles on television news where, you know, sometimes that doesn't turn out to be what you think.'",
        "'speaker_2': 'And and so we need to be careful about that, that that would be the only thing that I would encourage. Well, thank you for the partnering and thank you for looking out for Alameda Councilmember Odie.'",
        "'speaker_3': 'Thank you, Mayor. And I guess my thoughts on this are very similar to the three speakers. I mean, I'm not only informed by that, but, you know, I agree with a lot of what they said. I think and I think the vice mayor also, you know, encapsulated I'm sorry, I'm still not changed.'",
        "'speaker_3': 'Councilman Rivera, you know, encapsulated the value statement, you know, that we want to make sure we provide dignified services to our neighbors regardless of whether they're sheltered or unsheltered. So just quickly on the matching, you know, I prefer not to go back and use something we've already spent to match, because I think the purpose of this money'",
        "'speaker_3': 'is to provide require us to come up with our own funds and have some skin in the game. I don't prefer that. We don't try to say that we spent public works money or police money or fire money to do this, that that we actually go out in the next budget.'",
        "'speaker_3': 'You know, a lot of our one time money is basically transfer tax, which comes from the sale of real estate. And the sale of real estate often leads to increases in rentals by the new owners. So a lot of the cause of some of these folks that are homeless, not by choice, but because they've been, you know'",
        "'speaker_3': ', priced out of their housing. So I think that finding a way to use that money to, you know, complement this this program, I think, is the appropriate use of of one time money. So I think I would be more inclined to lean more towards services like the three speakers we're talking about than, you know, two bathrooms.'",
        "'speaker_3': 'I don't think, you know, this is one time money that I don't know if we'll ever see again. So spending 70% of it or a half a million dollars on and two restrooms, I don't know if that really helps our our unsheltered neighbors in the way that the three speakers described they need to be helped.'",
        "'speaker_3': 'You know, there are you know, as the vice mayor, I got that one right. As the vice mayor stated, you know, we do have that building across the street that the city could use, you know, for I don't know what these cost, but, you know, you could put up a temporary trailer somewhere to help have a temporary'",
        "'speaker_3': 'navigation center. And I also think we do more on rental subsidies, because if you if you kind of drill down into the numbers, it was, what, 18, 18% of the folks in Alameda County were homeless because of make it the exact term that was used that it was prevention.'",
        "'speaker_3': 'So to me, that means folks that were forced out of their houses by or their housing due to, you know, inability to pay the rent. So if you say Alameda, okay, we have 204, you know, 18% of that's about 20.'",
        "'speaker_3': 'So I mean, that to you know, if we give rental assistance of one $2,000 check, you know, that's only 36 people. So that doesn't really you know, that doesn't really help. And I'm concerned about Section eight because every time I propose an idea to incentivize landlords to provide Section eight, like the mayor of Oakland did with with'",
        "'speaker_3': 'her incentive program, I'm told that there are no more vouchers. So, I mean, if that's really true, then I don't know if I'd want to spend money to advertise something where there's there's no vouchers available. So I'd like to see more more services in the showers.'",
        "'speaker_3': 'You know, again, the vice mayor made a point, you know, we all take showers every day unless we choose not to. So I think our our homeless neighbors and our unsheltered neighbors should also have that opportunity. And not once every three days, once every four days, you know, or three times a month, if we if we get'",
        "'speaker_3': 'a van. So I appreciate the partnerships with other jurisdictions. You know, I think we need to make sure we take care of folks and make sure they have the same opportunity, that they're not denied that based on, you know, their status of shelter.'",
        "'speaker_3': 'So those are my comments. I could see more towards service and rental subsidies, less towards bathrooms. And I appreciate that our business community, you know, didn't like that idea because, you know, solving the homeless problem is to provide people with housing and services.'",
        "'speaker_3': 'It's not to make it more convenient for our business communities. So they have people shuffled off somewhere where they're not seen. So I appreciate that, that they share that value. And I they made those comments. So again, thanks very much.'",
        "'speaker_3': 'Great presentation. A lot more work to do. And I'm glad that we had an opportunity to, you know, at least take a dent into the into the problem.'",
        "'speaker_0': 'Thank you for all of your comments here in mind. So since we've mentioned Oakland and the mayor of Oakland a couple of times, I will share that. I've had the honor and privilege to meet with Mayor Schaaf a couple of times just since taking office, and that Debbie Porter and I met with her together on my first'",
        "'speaker_0': 'day in office. And one of the things that Mayor Schaaf mentioned that Oakland is doing is when there is an apartment building or some multi dwelling unit that. Is up for sale. The city has looked at it and in some cases has bought it with funds that they have allocated.'",
        "'speaker_0': 'And then the city can turn around and turn it over to an operator of affordable housing. Some of it is Section eight, but some of it is simply affordable housing. And and this is a way that the city can increase its stock of affordable housing.'",
        "'speaker_0': 'And one of the benefits there is, besides the fact that the need is huge, is that it takes much less time to rehab an existing building than it does to build from new. And so and I think that in addressing homelessness and and other housing issues that are all part of the housing crisis we're in, there's no'",
        "'speaker_0': 'one immediate solution. We we're going to have to go after a number of different solutions, and we can do that in something that's happening in Alameda. And I was very encouraged to hear about this. I had a nice meet and greet with the planning and transportation departments this afternoon.'",
        "'speaker_0': 'And among other things, they shared with me that in the last year, Alameda has approved 49 permits for adus that's accessible dwelling units or granny flats or the cottage or the, you know, the backyard or the basement unit.'",
        "'speaker_0': 'And and some of those are being built or being or going up as we speak. Those also are ways that we start to house people more quickly. So that's that's one of the of a range of solutions. I am all for the mobile hygiene unit and I think it's really inspired.'",
        "'speaker_0': 'But bear in mind, Alameda would probably get it one day a week, I'm guessing, since we're one of five cities sharing it. And that's fine if, you know, you could you could make do with a shower once a week.'",
        "'speaker_0': 'It's better than not at all. When it comes to restrooms, you can't use restrooms once a week. And so I, I understand the argument that one time fans maybe it doesn't make sense to to use them to provide public restrooms in our downtown areas.'",
        "'speaker_0': 'At the same time, I have had multiple conversations with representatives of both of our business districts, West Alameda and the Park Street, downtown Alameda Business Association, complaining to me about the issues of human waste when people have to relieve themselves or sometimes choose to relieve themselves, but for for lack of other opportunities.'",
        "'speaker_0': 'So at some point, I would love to and I do believe that this council is going to probably vote to authorize our interim city manager to meet with the the departments that are looking at how to apportion this money and for what uses.'",
        "'speaker_0': 'But I would like the question posed to the business community help us be a part of this solution, because I do think the need is there inspired idea that someone put out about maybe the warming shelter that is currently being housed at the Christ Church.'",
        "'speaker_0': 'And huge kudos to that congregation. Now, all the other faith communities that are helping support that effort that we can't really realistically expect everyone to find their way to Christ Church to use that one bathroom that's there on the porch.'",
        "'speaker_0': 'As you go into the this the community center, the social hall, the idea of the Carnegie Library, I saw that, I think on social media something today, and I've heard my colleagues discuss it. I think that's certainly worth looking into.'",
        "'speaker_0': 'And something that I heard discussed somewhere in a in a conversation and I'm not going to remember where exactly it was, but was a mobile laundry facility because people also have a need to wash their clothes in, you know, the homeless population, I know a lot of them want to work.'",
        "'speaker_0': 'They have opportunities to go to job interviews, but they don't have clean clothes or the ability to clean up. So if we could also look into the possibility I know I've heard some some discussion of how to address that.'",
        "'speaker_0': 'And and, yes, I think services are very important. Mental health issues need to be addressed. But you should always we should also ask ourselves, I mean, if you were having to live and fend for yourself on the street and for your your family, can that push you into some mental health issues?'",
        "'speaker_0': 'So prevention is certainly key. We we need to do a lot of things to make sure we're providing more housing stock for people who need it, keeping our current renters from being pushed out of their homes, onto someone's couch, into their car or onto the street.'",
        "'speaker_0': 'And as I've shared with a couple of mayors, I attended the Alameda County Mayors conference last week. And. And I said to, well, the mayor of Berkeley and I rode Bart back from Dublin and had a nice conversation.'",
        "'speaker_0': 'I said, we we can't, on the one hand, brag about California being the fifth largest economy in the world and have thousands of our residents sleeping under freeway overpasses in form fields, in parks. We can't do that. And so every city and Alameda is one of them has to step up and do its fair share.'",
        "'speaker_0': 'Councilmember Vela and I will be in Sacramento this week on Thursday, because we are both members of a statewide policy committee for the League of California Cities and Housing Community and Economic Development. And we'll bring back some inspired ideas from our colleagues around the state.'",
        "'speaker_0': 'But anyway, I'm I'm very I'm very grateful that we have this opportunity to to spend this money. Let's yes, use it as an investment seed money and go after the the programs that will help keep people from needing to have warming shelters and to get in out of a cold, rainy night like tonight.'",
        "'speaker_0': 'So thank you very much. With that, do I hear your hinted. Councilmember ballot?'",
        "'speaker_8': 'Yes, I did. Want to follow up on something. I think we've talked about these mobile units, but and I and I understand that we want to be able to bring these different services to folks. But I guess when I was talking about kind of trying to find efficiencies, you know, having visited the warming shelter that we are'",
        "'speaker_8': 'using and that has been designated and there was considerable amount of resources put into establishing it as a warming shelter. You know, is it you know, are there things possible like getting a washer and dryer that could be that we could use this money essentially to pay for to get that installed there that could be used and'",
        "'speaker_8': 'available for use. Is there a possibility of expanding the bathrooms there? I mean, those rather than building new facilities elsewhere, is it are there opportunities for those sorts of capital expenses that we can invest in, something that's already been established where we can make the facility into a better facility and perhaps try to negotiate extended hours, those'",
        "'speaker_8': 'sorts of things. I do think that, again, this is a small portion of money. I agree with with Councilmember Otis statement about putting new, new money towards this. And I also think that a lot of the issues in the underlying issues that have been raised and concerns are going to be ongoing conversations, even though this is one'",
        "'speaker_8': 'time money, because we know the need is not going to go away. I just would like to see us use this efficiently so that we know and we can figure out if we're on the right path and where we would need to expand things as we move forward or what's been successful and what hasn't been, or how'",
        "'speaker_8': 'can we improve it. And I do think our former mayor, Trish Spencer, for going to that Alameda County Board of Supervisors meeting, because this money was not an automatic give. And it wasn't just that we had to put in the application, but we also had to make our pitch for why Alameda deserved our cut.'",
        "'speaker_8': 'And I think it gives us this opportunity to have these sorts of conversations. So thank you.'",
        "'speaker_0': 'Thank you. And I'm just going to come in on the idea about possibly expanding services at the women's shelter. I think that we should also give consideration if there's room for a laundry facility and maybe there is, but washers use lots of water.'",
        "'speaker_0': 'And so I think we would also need to give consideration to helping with the water bill lately.'",
        "'speaker_8': 'I support.'",
        "'speaker_0': 'That. Yeah. Okay. Councilman Brody.'",
        "'speaker_3': 'Thank you. Just just to follow up on that, know, I think we should also consider partnering with our school district and see what they may have as far as ideas, because, you know, homeless children do go to school.'",
        "'speaker_3': 'And, you know, one idea I think they did it somewhere in Oakland was washers and dryers and schools, you know, and that may be, you know, a relatively cheap solution that can we can also partner with. And you know, that that may help people out as well.'",
        "'speaker_0': 'Thought and I know I believe I just appointed is it Vice Mayor Knox White and Councilmember de Soto? Are you the appointees to the ESD subcommittee? Yes, my memory serves me correctly. Do you know when your next meeting is?'",
        "'speaker_5': 'Or 28.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'I think it's actually been continued to February 13. That's what I.'",
        "'speaker_0': '13. So maybe whoever puts the agenda together could get that on the agenda. Okay, lovely. Okay. Any other comments? So what we're looking for tonight, if I recall correctly, is this is a recommendation to provide direction on the city's proposal for the the hip homeless emergency aid program and authorize the interim city manager to work with social'",
        "'speaker_0': 'services Human Relations Board to finalize and implement the city's programs in. Services. Do we have a motion to incorporate? All of our suggestions is.'",
        "'speaker_8': 'So moved incorporating the suggestions raised tonight by my by this council.'",
        "'speaker_0': 'Oh, that's all right. We have a motion to have a second and second by Councilmember de SAC. All in favor.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'All right. Passes unanimously. Thanks, everybody. Yes.'",
        "'speaker_5': 'I sit there for a few people on January 30th. Everyone counts. The county's homeless count will be happening. That is a volunteer led effort to make sure that we actually are aware of how many folks are living unsheltered in Alameda.'",
        "'speaker_5': 'You can if you just Google, everyone counts 2019, you'll go right straight to the page. It's an early morning, but it's something that's pretty quick, easy and actually very fulfilling. You can take care, take part of.'",
        "'speaker_0': 'I think some of the slots are already filled. I don't know if they all are, but for some census tracts they are. Yeah.'",
        "'speaker_5': 'The website has that.'",
        "'speaker_0': 'Yeah. All right. Okay. So moving on. Oh, councilmember design.'",
        "'speaker_2': 'Well, thank you, Madam Mayor. The next item, I will have to recuse myself because my house is roughly 20 feet away from a site where that would stand to benefit from this proposed item. So I've been in discussions with the city attorney, and he had agreed that I should recuse myself from this item.'",
        "'speaker_0': 'All right. Thank you. Thank you. We'll see you in a bit.'",
        "'speaker_7': 'Yes, I will.'",
        "'speaker_2': 'Actually, I'm going to work. I brought my computer.'",
        "'speaker_0': 'We're not checking on you. There's brownies.'",
        "'speaker_1': 'It's a public hearing to consider. Introduction of ordinance amending the Alameda Municipal Code by amending Section 30 Dash ten cannabis to add cannabis retail businesses as a conditionally permitted uses in the C one neighborhood business and C and commercial manufacturing zoning districts, and amend certain portions of the zoning code to enable cannabis retail businesses to dispense nontraditional'",
        "'speaker_1': 'or adult. Use cannabis and amend certain portions of the zoning code to remove the dispersion requirement and repeal ordinance 3228 and introduction of ordinance amending the Alameda Municipal Code by amending Article 16 Cannabis Businesses of Chapter six businesses, occupations and industry to eliminate the cap on testing laboratories allow for two additional cannabis businesses to operate as dispensary'",
        "'speaker_1': 'delivery. Delivery required open to the public within the zoning districts for cannabis retail. Amend the dispersion requirement to require no more than two cannabis retail businesses to operate on either side of grants to create a two tier buffer zone from sensitive uses for cannabis businesses.'",
        "'speaker_1': 'Amend certain portions of the regulatory ordinance to enable cannabis retail businesses to dispense non-medical or adult, use cannabis and modify requirements for off island delivery and make other clarifying and conforming amendments thereto. And repealing ordinance 3 to 2 seven.'",
        "'speaker_0': 'Thank you. And who's doing the the presentations that interim city attorney Michael Roche.'",
        "'speaker_2': 'Madam Mayor and members of the council. I'll give the kind of procedural issue as to how we got here or why we are here. And there are members of my staff and also from the Base Reuse and Community Development Department here to answer any substantive questions that the Council may have about the the two ordinances in question'",
        "'speaker_2': '. My background in November, the City Council adopted two ordinances concerning the cannabis business in Alameda and those ordinances are now in effect. A complaint was filed, however, under the City of Sunshine Ordinance that the agenda titled for those two ordinances when the Council considered their introduction in October of 2018, that the agenda title did not reflect certain'",
        "'speaker_2': 'provisions in the ordinance that were subsequently introduced that evening. And then those ordinance, as I mentioned, were adopted on November seven. The Open Government Commission conducted a hearing on that complaint, sustained it and as a remedy, held that the ordinances were null and void, and that the Council may consider reintroducing the ordinance as following a public hearing'",
        "'speaker_2': '. Our office had advised the Commission and the Council that the Sunshine Ordinance that the Commission did not have the legislative authority to render the the ordinances null and void. But given the decision of the Commission, we feel at this point that it would it would make good sense for the council to reintroduce the ordinances and then eventually'",
        "'speaker_2': 'adopt them, if that's the council's desire. And that as a consequence of that, the two ordinances in question that the Commission felt should be null and void would be repealed when the new ordinances were adopted and became effective.'",
        "'speaker_2': 'We think this is the the most expeditious way of resolving any potential legal issues concerning those two ordinances. It carries out the spirit and intent of what the Open Government Commission did, and for that reason we are recommending the course of action as set forth in your agenda report.'",
        "'speaker_2': 'I'll be glad to answer any questions about the procedural issues in the. And members of my staff and the Community Development Department are here if there are questions about the substantive provisions of the two ordinances.'",
        "'speaker_0': 'Thank you, Mr. Roush. Do we have any questions on procedure of this item?'",
        "'speaker_3': 'Just a quick.'",
        "'speaker_0': 'One. Councilmember Odie.'",
        "'speaker_3': 'Two quick ones. So if we approve this today, we still have what we have today. Right?'",
        "'speaker_2': 'Correct. If the council introduces and subsequently adopts the ordinances, it will be the same as the ordinances that were introduced and adopted back in 2018.'",
        "'speaker_3': 'And if we don't approve this today, we still have what we have today, right?'",
        "'speaker_2': 'That is correct.'",
        "'speaker_3': 'Okay. So we just as a matter of aside, I mean, is there a plan to come back and talk about the Sunshine Ordinance and where it may conflict with the charter in the Constitution?'",
        "'speaker_2': 'That is correct, I think. I think that that is a matter that I think that when you make your appointment with to the new city attorney, that is certainly one of the things that she or he may well want to take up, both with the council and the Open Government Commission to see if there need to be'",
        "'speaker_2': 'any amendments to that ordinance. I think that would certainly be in order. Correct.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Clarification on your response to Mr. Rudy. Mr. Ash, you're saying that regardless of how the city council votes tonight, the previous. The previous ordinances will stand either with a new number or the way they were.'",
        "'speaker_2': 'Correct. It is it is our officers opinion that those ordinances were properly and legally adopted and that the the commission did not have the legal authority to render those null and void. We would rather not get into a debate or get into a conflict issue with respect to who is correct on that issue.'",
        "'speaker_2': 'And so our recommendation is to reintroduce the ordinances as as approved, as it were, and repeal the two ordinances in question. And so to get to the same place as where as if the complaint had not been filed.'",
        "'speaker_0': 'I might not be alone in wondering why we're even bothering to go through this exercise. If the outcome is already known.'",
        "'speaker_2': 'Well, the the certainly it will take three votes of this council to reintroduce this ordinance if the three votes aren't there. I do agree that the current ordinances will stay in effect, but it does then raised the specter of a potential legal challenge somewhere down the road, which is what I think we would like to try to'",
        "'speaker_2': 'avoid.'",
        "'speaker_0': 'I see. Okay. Any other questions?'",
        "'speaker_3': 'Just two more.'",
        "'speaker_0': 'So.'",
        "'speaker_3': 'Thank you, Madam Mayor. So, just to be clear, the item of youth centers is not on the agenda tonight.'",
        "'speaker_2': 'That is correct. It is not on the agenda.'",
        "'speaker_3': 'And if we were to say change this ordinance by I don't know, I'm not even going to throw out a hypothetical but change anything in there. Then we could run into the same issues we had with the original complaint that was filed with the sunshine.'",
        "'speaker_2': 'If the Council wants to amend substantive provisions of what's in front of you, it would be my recommendation that we would not take have the Council not take any action tonight to introduce anything, and we would bring that matter back to the Council at a subsequent meeting for reentry for introduction.'",
        "'speaker_3': 'Okay. I appreciate. Appreciate the answers. Thank you.'",
        "'speaker_0': 'Any other questions or clarifying?'",
        "'speaker_8': 'Councilmember Vella and the reason that that you're saying that it stays into effect, that has to do with Article three of our charter where it vests all the powers to the council to make those decisions. Is that what we're relying upon?'",
        "'speaker_0': 'So I will I will leave it to the city attorney to make sure that you're staying within the framework of the agenda item.'",
        "'speaker_8': 'I'm trying to understand why we're essentially why we're here.'",
        "'speaker_3': 'I think you asked.'",
        "'speaker_0': 'It was almost a rhetorical question.'",
        "'speaker_2': 'And the. We provided a a confidential memo to the city council, which laid out in some detail all of the reasons why we felt that that the legislative that the commission did not have that that authority. We provided a somewhat truncated version of that to the commission so that it understood what our position was.'",
        "'speaker_2': 'I, I don't recall specifically if Article three is involved, but it was part of the memo, then the answer is yes.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Okay. By spirit, not white.'",
        "'speaker_5': 'I have a I have a couple questions, I guess. I think it would be good for us. And I mean, try to be careful there. The Open Government Commission was set up specifically to oversee to provide citizen oversight of the city attorney's determination.'",
        "'speaker_5': 'And I guess I'm confused a little bit on how that didn't come back to the Council for reinterpretation. Ed, I mean, I don't want anybody reading, so I wonder if we shouldn't try to at least address that piece before we wait three months to hire a city attorney in case there are future open government.'",
        "'speaker_5': 'So I'll just leave that there. My question is, especially given what you've just suggested, we have two questions. We're not approving anything related to any applications that are out there, correct?'",
        "'speaker_2': 'That is that is correct.'",
        "'speaker_5': 'And so any action we take tonight will not impact. Applicants that are out there that we have we have we have a successful applicant. There's an applicant who has been successful any as we are not taking action. He's I'm trying to I feel like I've gotten multiple different answers.'",
        "'speaker_5': 'And yet we just had a council member recuse himself because tonight's action was going to directly impact the financial well-being of a specific applicant and therefore somehow perhaps his own. And he says that you agreed and encouraged him to recuse on that.'"
    ],
    "Ordinance Amendments for Cannabis Businesses in Alameda.": [
        "'speaker_5': 'And so I'm trying to I'm trying to square what our action is doing, because I think it's important. The last time I listened to all the candidates, this is my first cannabis hearing. I was actually hopeful that this would be done before we got here.'",
        "'speaker_5': 'But from for all of our times. But I'm confused because there's confusion and also in the community about what these actions are doing as they relate to applicants.'",
        "'speaker_0': 'And so I see Debbie Potter with you and introduce yourself and enlighten us.'",
        "'speaker_4': 'We use in Development Director. So just to clarify, it is correct that there has been one applicant who has been given the right to pursue a land use permit as well as an operator's permit that that provider is pursuing their applications under the existing ordinance, because the ordinance that the council approved in November is actually effective this'",
        "'speaker_4': 'Thursday. So they have they have made application and they're pursuing their applications under the original ordinance. That ordinance was for medicinal dispensaries only. So in the event that either the ordinance is reintroduced today or nothing happens this evening and that the new ordinance goes into effect on Thursday, that ordinance will allow for adult use so the applicant'",
        "'speaker_4': 'could amend their application under the new ordinance and proposed to do adult use as well as medicinal. So it there is an indirect impact on the applicant who's going through the process.'",
        "'speaker_5': 'And can I ask a quick question?'",
        "'speaker_0': 'The floor member and our vice mayor knocks later.'",
        "'speaker_5': 'Yeah. The so the successful applicant the RFP process has the ability that if changes are made in the future you can just amend it. It seems to me that that applicant would then need to reapply and that in under the new program we're making a you know, I would submit that this open government committee commission thing is'",
        "'speaker_5': 'about the fact that, you know, these changes are substantive. Right. It was unanimous twice that that, you know, public, publicly available dispensary.'",
        "'speaker_0': 'It's why don't we hear the answer to your question? First, you posed the question of what would happen. And so the and then there's a time for discussion. But this is clarifying questions.'",
        "'speaker_5': 'Trying to explain my question. But thank you.'",
        "'speaker_4': 'So I believe that. We staff would permit then an amendment to the land use application as well as the regulatory permit application to permit the adult use sale. Because the new ordinance would then affect that. We would not we did not anticipate running that applicant through that the new RFP process.'",
        "'speaker_0': 'And was there another part of your question?'",
        "'speaker_5': 'Well, I guess my so still wasn't my question. My question was, is that how the RFP is stated? Does it state in the in the RFP that if if future changes are made, you can just amend your application?'",
        "'speaker_5': 'They've been selected, but they haven't even actually completed the process to be a successful applicant yet.'",
        "'speaker_4': 'They have been they have been granted the right to apply. They have applied for both their land use permit and their regulator permit. Right. Has the RFP allowed? Does the RFP allow for that? I'm not sure. John, I'm going to ask him next.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'Madam Mayor, members of the council staff and members of the public. John Lay, assistant city attorney, is I want to make sure I understand the question is a question whether or not the person, the ALP, the successful applicant would have to resubmit because the RFP process has already gone through.'",
        "'speaker_5': 'They applied under a process for medicinal use only. And now we're saying, oh, there's going to be a process for adult use or medicinal use or just adult use. I'm just curious how it is that somebody who applied under a past program can then just say, Oh, we want the other one.'",
        "'speaker_6': 'Well, one.'",
        "'speaker_2': 'Of the way to answer this is, um, and I've had a discussion with the. And we staff has had a discussion with the applicant about this, that many of the changes that happened before they reached the stage of receiving their land use entitlement would apply to them.'",
        "'speaker_2': 'So that would include the adult use provision that you're discussing now, but that would also include some of the other provisions that the applicant has actually expressed concern about, particularly certain sensitive uses that might be applicable to them.'",
        "'speaker_2': 'And they have expressed concern about the applicability of those definitions. And because of that, I think the the applicant is concerned that many of the requirements are going to apply to them. And as to your question about whether or not they can amend their application, we currently do not have, I don't believe, a specific provision that prohibits'",
        "'speaker_2': 'an applicant from amending their application. And that doesn't mean that we can't say that they can't do that, but we also don't have one that sort of freezes it in time. They've currently submitted an application, it's currently pending and staff is in the process of reviewing that application.'",
        "'speaker_2': 'And so I guess the answer to the question is in the instance in which we do have applications that are pending, whether or not an application can be sort of and resubmitted and if it has been done in other contexts, that might guide the analysis.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Did do that. That is the question. Okay. Councilmember Vela.'",
        "'speaker_8': 'I want to ask the inverse, which is if and you'd kind of hinted to this, which is if we had changed something that would have negatively impacted them, do they then lose the ability to apply after they've already invested?'",
        "'speaker_6': 'Well, um.'",
        "'speaker_2': 'It depends on the particular provision, but, um, that could be a possibility. Yes. And that's something that I believe was raised in a previous meeting as well. Um, and it was in the context of discussing the notion of vested rights.'",
        "'speaker_2': 'You may recall that discussion.'",
        "'speaker_8': 'Okay.'",
        "'speaker_0': 'Okay. Any further questions?'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'Sorry. I don't remember the reinvestment, the investment rates, but. Sorry. The best. Thank you. I knew I was going to miss some of that. The event, the vested rights. So you're suggesting that because they applied under the old program, they have vested rights?'",
        "'speaker_2': 'I don't know if it's actually the opposite. Is that because they've not actually the IRP process, the conclusion of the RFP process provides the applicant, the successful applicant, a conditional award letter that allows them. And the only thing it allows them to do is the ability to submit an application.'",
        "'speaker_2': 'And from there, it would it would sort of stand in the same shoes as an ordinary sort of copy. But it also has the additional layer of an operator's permit. So just as in operators excuse me, a copy applicant has not had their hearing, has not obtain their land use entitlements.'",
        "'speaker_2': 'There's also an additional process of getting the building permit. To the extent that there are any improvements that need to be made or any other construction related tasks that need to happen. So they're really starting at square one.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Okay. Thank you. Okay. Any further clarifying questions? So then we're going to go ahead with our question, our public comment. We have nine speakers slip. So under the council rules, that means each speaker has 2 minutes. So I will and keep things moving because it's almost 9:00.'",
        "'speaker_0': 'I'll call the first three speakers and you can just be ready when it's your turn. I'm a bit of clarification. I've got a spruce up for Mark Kurzman and then I have a speaker slip for Nick Portolesi with a notation, give my time to Mark who's so suggests, you know, under the newest council rules, we don't cede'",
        "'speaker_0': 'time. But if you would like Mr. Kurzman to have your 2 minutes, he has your 2 minutes and his two. Is that okay? Okay. Then I will take Mr. Palacio out of the out of the queue. But we're still 2 minutes because we have eight speakers.'",
        "'speaker_0': 'All right, Mr. Holzman, Mark Kurzman, you're your first.'",
        "'speaker_4': 'And we don't see time.'",
        "'speaker_0': 'We don't see time. That's what I was telling him, that either one of them has 2 minutes, but one of them can't take two plus two. But, Mr. Blasi, I believe if I was reading his hand signals, you don't want to speak at all.'",
        "'speaker_0': 'Is that correct? No, no, no. You can have your 2 minutes if you wanted to. You're right here. I can put you back in. It's okay now. Okay. Hi.'",
        "'speaker_6': 'Hi. Mayor Ashcraft and Council. Thank you. I am my business partners. And I sent a letter to you yesterday that we would like to read into the record tonight. As you're all aware, one of the final acts of the previous council was the finalization of the cannabis business ordinances.'",
        "'speaker_6': 'It's our understanding that the Open Government Commission has an objection to the nullification process leading to the passage of the ordinances, as discussed at the October 16th City Council meeting and finalized on November 7th. Specifically, the complaint focused on the change from the authorization of two storefront dispensaries and to delivery only dispensaries to the final decision allowing'",
        "'speaker_6': 'for storefront dispensaries with a minimum of two offering delivery services. Regarding the specific issue, we were attendees to that debate. I reviewed the video recently and we noted the following. The key issue debated was not the visual footprint on the city of having for storefront dispensaries.'",
        "'speaker_6': 'Primary concern was access to cannabis delivery for patients who are compromised in their mobility. Once council received guidance that they could require a minimum of two dispensaries to provide delivery services throughout Alameda City limits, the physical nature of these dispensaries, storefront versus warehouse, became irrelevant to that discussion.'",
        "'speaker_6': 'Further, it was noted that delivery only warehouse dispensaries would need to conform to the same regulations as storefront dispensary. And the city attorney gave guidance to the council that the change from warehouse delivery to storefront was not material enough to require a new first reading for public comment as witness to the council meeting in question.'",
        "'speaker_6': 'It's our opinion that the previous council acted in good faith and by requesting advice from the city, attorney was well aware and respectful of their obligations under the Sunshine Ordinance. Clearly, the LGC disagrees with the city attorney guidance, putting you the new city council in a very difficult position.'",
        "'speaker_6': 'While we understand that opening up this one issue for public comment is being done to satisfy the request, the LGC we respectfully request that your actions be limited to this one item regarding the public notice requirement concerning the nature of the approved dispensaries and not relitigate the balance of the cannabis.'",
        "'speaker_6': 'That's time.'",
        "'speaker_0': 'Thank you, Mr. Huseman. And the next speaker is Rosalind Fortuna.'",
        "'speaker_4': 'Good evening. I'm Rosa, Linda Fortuna, and I request that Tony Dyson be able to participate in this. It's not correct that he is admitted. He is a property owner. He's a neighbor. He knows the area. And for him to be recused from this is not right.'",
        "'speaker_4': 'When I heard that, it just didn't make any sense to me. He is a person that would know his neighbors and how they feel and how the families feel in that neighborhood about any cannabis coming, a storefront coming into that neighborhood.'",
        "'speaker_4': 'So I'm sorry that that's my opinion. Also, he is a citizen of Alameda. That doesn't make this this really doesn't make sense to me. Furthermore, I you know, when I talked to some merchants on Webster Street, I was just shopping.'",
        "'speaker_4': 'And then.'",
        "'speaker_1': 'The merchants said.'",
        "'speaker_4': 'Oh, did you know the cannabis center is coming? And they were saying, We're so upset. And I said, Oh, I didn't know that. She said that she was told that when she went to City Hall. They said it was already approved and then nothing could be done.'",
        "'speaker_4': 'And then now you're saying, oh, it's subject to the land use permit. So she doesn't speak English very well. She was told that it's already done. Then I there was another merchant that I talked to. She's super upset.'",
        "'speaker_4': 'She said she doesn't want to see the long lines of people standing out waiting for their cannabis purchases or whatever they do to, you know, to interfere with her business. And she's very, very upset, just like in Oakland.'",
        "'speaker_9': 'There's just long, long lines.'",
        "'speaker_4': 'Having you in storefronts is not the right place. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Phil Read. I've got it.'",
        "'speaker_6': 'Which I would like to remind people. When we voted for recreational marijuana by 68.9%, we already had medical use in medical businesses in our city. I believe we voted for legal cannabis because the real danger is not cannabis.'",
        "'speaker_6': 'We know that after five years of legalization, that is pretty benign. And what happens if you drink too much coffee, you get the jitters. If you smoke too much weed, you get high. Funny how we all treat cannabis as more dangerous than guns and alcohol in Alameda.'",
        "'speaker_6': 'Parents are expected to teach their kids how to be responsible around alcohol, cigarets and guns and sugar, fire and a million other worldly dangers. Why can't we just expect the same for cannabis? Statistics say legal cannabis decreases alcohol use, so you are literally killing people if you deny them this, right?'",
        "'speaker_6': 'The only difference between medical use and recreational use is the intent of the user. In no matter how you use it, it's always non-fatal. You know, the real danger is the danger is in the illegal supply chain. If back in the day, I used to buy weed from gangsters in high school and I've been robbed at gunpoint'",
        "'speaker_6': 'maybe a few times. It was an acceptable risk back in my day. Where there is a void. They will exploit it. If you take away a healthy legal market, you leave yourself more vulnerable to the illegal markets. And they've had two years to set up shop while you've been sitting on your hands.'",
        "'speaker_6': 'And the Wild West of cannabis is already here. Also, any changes to the ordinance undermines two years of hard work by the last council and speakers on both sides of this issue. This would also be a hard step away from current progressive values.'",
        "'speaker_6': 'Legal cannabis protects children, but you also have to look at the big picture to know that I know I don't have to explain to you again how safe a dispensary is. It's guarded and guarded and all that good stuff.'",
        "'speaker_6': 'Take away. Take it away. And it leaves too many more potential customers just sitting out in the dust looking for new sources. And organized crime will more than take it advantage because currently cannabis is a scofflaw. I'm sitting here with cannabis right here.'",
        "'speaker_0': 'That's true, Red. Your time is up. And our next speaker is Tyler Chisholm, Champlain Heavyweight Champion. Champion.'",
        "'speaker_6': 'Good evening, Mayor. Council members and staff. I'm here to speak in support of item six, be and encourage council to once again adopt this ordinance. As we all know, as we are all aware, there have been countless hours staff, council stakeholders and members of the community have put into this ordinance, given the multiple public meetings that have'",
        "'speaker_6': 'already taken place and yet another staff recommendation to adopt. I would hope this would be an easy vote for council, as noted in the executive summary provided by staff along with their recommendation. Staff notes that 68% of Alameda voters voters supported the ballot initiative to allow recreational use and sale of care and the sale of cannabis.'",
        "'speaker_6': 'The citizens want this. We we have a solid ordinance that staff the previous council and stakeholders all are all in support of stakeholders, have secured locations and are incurring costs and are prepared to submit applications now. Again, I am in full support of this ordinance and encourage Council to approve the first reading and move for a second'",
        "'speaker_6': 'reading on February 5th meeting in anticipation of opening the RFP as soon as possible.'",
        "'speaker_0': 'Thank you. Thank you. Our next speaker is Spencer. Evening Council.'",
        "'speaker_4': 'City manager. City attorney.'",
        "'speaker_0': 'But I wanted to speak to and I appreciate all the earlier comments.'",
        "'speaker_4': 'First of all, I want to.'",
        "'speaker_8': 'Thank member Odie for.'",
        "'speaker_4': 'Bringing the first referral on this.'",
        "'speaker_8': 'Item over two years ago.'",
        "'speaker_0': 'I want to remind Council that every step of the way we did in fact.'",
        "'speaker_8': 'Ask our city attorney.'",
        "'speaker_0': 'If it was appropriate for us.'",
        "'speaker_8': 'To proceed, especially after the.'",
        "'speaker_0': 'Complaint.'",
        "'speaker_8': 'Was brought to the Open Government Commission.'",
        "'speaker_4': 'And so we I believe we.'",
        "'speaker_0': 'Were advised.'",
        "'speaker_8': 'By three city attorneys that it was appropriate, including our current acting interim city attorney.'",
        "'speaker_4': 'In regards to what happens if you make it null and void.'",
        "'speaker_0': 'What I didn't see.'",
        "'speaker_4': 'Discussed was there's always.'",
        "'speaker_0': 'That 30 day period.'",
        "'speaker_4': 'After the second vote.'",
        "'speaker_8': 'When someone can bring.'",
        "'speaker_0': 'A referendum. And we've just gone through that and you.'",
        "'speaker_8': 'Know how long it can tie up an item. And I don't know what would happen if we, in.'",
        "'speaker_4': 'Fact, had.'",
        "'speaker_0': 'A.'",
        "'speaker_8': 'Referendum brought during.'",
        "'speaker_0': 'That 30 day period. That did.'",
        "'speaker_4': 'Not happen.'",
        "'speaker_8': 'When we brought our did our final vote on November 7th.'",
        "'speaker_0': 'Which made it.'",
        "'speaker_8': 'Effective December.'",
        "'speaker_4': '7th. And if you all.'",
        "'speaker_0': 'Decide to open it up again. What happens if a.'",
        "'speaker_8': 'Referendum is brought?'",
        "'speaker_4': 'And we all know it's.'",
        "'speaker_0': 'Critical that we allow.'",
        "'speaker_4': 'Cannabis businesses to open and know that they have that.'",
        "'speaker_8': 'They can count on this.'",
        "'speaker_4': 'Council to.'",
        "'speaker_0': 'Allow them to do.'",
        "'speaker_4': 'Their business. I strongly encourage you all to give the green light to cannabis business.'",
        "'speaker_0': 'Let them know that we do.'",
        "'speaker_4': 'Support medicinal and recreational and that.'",
        "'speaker_8': 'We all know we've been trying to.'",
        "'speaker_0': 'Provide safe legal.'",
        "'speaker_8': 'Cannabis.'",
        "'speaker_4': 'That has been the cause.'",
        "'speaker_0': 'We've worked really, really hard. However, that's my why I.'",
        "'speaker_4': 'Decided to come tonight. What happens then.'",
        "'speaker_0': 'If we do get a referendum? My guess is that.'",
        "'speaker_8': 'Everything gets tied up in. Who knows where we are.'",
        "'speaker_0': 'Thank you. Thank you. And our next speaker is John Sherritt.'",
        "'speaker_6': 'Well, good evening, Mayor Ashcraft and members of the city council. Here we go again. Confusion, staff responsibilities that probably have not been met. And I'd hate to say it. What are we voting on or what are we fooling with here tonight?'",
        "'speaker_6': 'Let me go ahead with what I had prepared. I would like to thank Serena Chen for formatting the cannabis issue and maybe staff should talk to her about how to put something together on the agenda. That makes sense.'",
        "'speaker_6': 'She has facts from day one and a council member of John Knox wife or at least being open for a dialog on the issue. Where am I coming from? I'm coming from 38 years as an educator with the scene.'",
        "'speaker_6': 'Too many kids use marijuana as a starter drug. I'm not saying stop all this. I'm saying take time and start something, but start it right and monitor it right. I'm not against American medical marijuana. Dispensary is not in a place where kids have activities such as preschool, parks, etc..'",
        "'speaker_6': 'And it is regulated. So since December 19th, 2017, when the original ordinance regulating cannabis in Alameda passed the highly organized cannabis industry and I give them a lot of credit has pulled strings on the acting city manager and some of the council members and has chipped away at many of the protections for kids that were listed in'",
        "'speaker_6': 'the original ordinance. The changes proposed are examples making again more moves to chip away. I have to cut my whole thing in about half and I just want to end it with a comment made. There is a group formed and a group formed is called Pot Watch to Protect Alameda Kids.'",
        "'speaker_6': 'And I'm going to say they're going to be monitoring. Everything that goes on with this from start one and I'll end with a comment by a retired. School teacher Candice Good Lehman, a retired, a U.S. city and community member.'",
        "'speaker_6': 'When she says that's time.'",
        "'speaker_0': 'Thank you, Mr. Chair. That is your time. But you can submit your comments in writing to the city clerk if you'd like to do that.'",
        "'speaker_6': 'And I come back next time and say that.'",
        "'speaker_0': 'You certainly can. Do you have is it like one sentence that you have? Okay. And we did get the letter from Ms. even.'",
        "'speaker_6': 'I'm just trying to figure out who's on first.'",
        "'speaker_0': 'Thank you. Our next speaker coming from. Thank you. Our next speaker is Deborah mendoza. And our last speaker after Ms.. Mendoza is Richard Paulson. Good evening. Nice to see everyone in the new year. Welcome, John Knox White. And I didn't prepare my statement tonight.'",
        "'speaker_0': 'I came here and I kind of learned some more information as I went along. But some of you may know that I was involved in.'",
        "'speaker_4': 'Advocating for cannabis to be permitted here in Alameda.'",
        "'speaker_0': 'Back in November. I put together a petition for allowing.'",
        "'speaker_4': 'The delivery only. So one thing I'm a.'",
        "'speaker_0': 'Little disappointed is it.'",
        "'speaker_4': 'Went that four.'",
        "'speaker_0': 'Of the storefronts can have two deliveries, but that.'",
        "'speaker_7': 'Doesn't.'",
        "'speaker_0': 'Address that delivery only is are.'",
        "'speaker_4': 'A way that people most.'",
        "'speaker_0': 'With the least amount of perhaps wealth, access to resources, equity can enter into this industry. And I and I agree with my neighbor.'",
        "'speaker_4': 'Who spoke earlier.'",
        "'speaker_0': 'About, you know.'",
        "'speaker_4': 'Criminalization.'",
        "'speaker_0': 'So when we do not, you know, allow people to operate, you know, legally, it does push it does push the underground market, which we don't want to see.'",
        "'speaker_4': 'That's not what public safety looks like.'",
        "'speaker_0': 'So I would just I'm also I also.'",
        "'speaker_4': 'Believe that that we should be able.'",
        "'speaker_0': 'To transfer medicinal to adult use, because that was the whole you know, that's the whole.'",
        "'speaker_4': 'The point.'",
        "'speaker_0': 'Of this new legislation is to allow cannabis to be consumed recreationally. We don't you know, the medical model is from years prior. So it doesn't make sense to me. With businesses moving forward, should that should be.'",
        "'speaker_4': 'Easy to make.'",
        "'speaker_0': 'That transfer. Thanks for your consideration and I'll see.'",
        "'speaker_4': 'You later on.'",
        "'speaker_0': 'Thank you. Richard Paulson.'",
        "'speaker_6': 'Ashcroft City Council. My name's Rich Polson. I'm a local attorney here on the island, and I have two children that are school age emerging. The Council to move forward with opening Alameda to cannabis businesses. I've been following this issue and seen firsthand how much time and effort has been put in by the City Staff Council.'",
        "'speaker_6': 'Long hearings, a lot of public comment, a lot of opportunity for people to raise their issues. And I think there's still seems to be a misunderstanding of how heavily regulated this industry is, not just at a state level, but the effort that the city has been put into it to make sure that the citizens of this community'",
        "'speaker_6': 'are being protected in a fair and evenhanded way. But I think we need to move forward at this point. I mean, there's clearly demand, popular support is high for this issue. And we should move forward and bring this theory and bring this process to a close to the extent that any complaints about long lines in front of'",
        "'speaker_6': 'a dispensary. I think the obvious solution would be to open more dispensaries. There's clearly the demand for it, and I think the city needs to move forward and make this a reality. Thank you.'",
        "'speaker_0': 'Thank you. Okay. That was our last public speaker. So we will move into council discussion. And just for clarification, I'm in the city clerk and the interim city attorney, if you would help me on this. We are actually considering introduction of two ordinances and on the second ordinance, I suggested a word, one word change.'",
        "'speaker_0': 'Do you want me to read it? It's the it is so interjection to ordinance amending the muni code section 16. And this is paragraph C which currently reads Amend the dispersion requirement to require no more than two cannabis retail businesses to operate on either side of Grand Street.'",
        "'speaker_0': 'And we would my suggestion, I think the clerk and the interim city attorney agreed, is that we would change the verb required to allow because we don't we're not requiring. But we were allowing. So I just want to note that for the record.'",
        "'speaker_0': 'Okay, who wants to open the discussion or make a motion for that matter?'",
        "'speaker_5': 'I guess I'll speak to.'",
        "'speaker_0': 'Vice, the person who's.'",
        "'speaker_5': 'Actually weighed in on this.'",
        "'speaker_6': 'Right.'",
        "'speaker_5': 'Right. This is not how this meeting was. I expected it to go. I thought we would have at least a couple of new voices up here. And so I'm going to make a couple comments. The first one is I just wholly disagree that if somebody submits under an RFP, that is one thing that they just automatically get'",
        "'speaker_5': 'to have the more expanded whatever else. I think that that that, you know, it is possible with adult use that there could be furthermore people who are interested in going and as we're expanding forward that's that's a new program.'",
        "'speaker_5': 'So yeah I kind of think that that's something that maybe should come back from the for the council possibly. I'm going to assume there are legal issues related to that decision, but then possibly in a closed session, I just I did that was completely news to me.'",
        "'speaker_5': 'And and I it does change it. Well, it changed the complex, the complexion of this board. So I want to I want to I want to I just wanted to mention that I wanted to just really quickly, there were some comments.'",
        "'speaker_5': 'It's my understanding Mr. De Sung asked to be recused and then confirmed that that his decision was but he was not forced to recuse himself. That's a decision he gets to make. So I just wanted to and as the person who was asking the question, it was not that somebody told him he could not participate.'",
        "'speaker_5': 'And then I'm hoping maybe at the end of this, Debbie, if you could maybe speak to to Ms.. Fortuna about the process, because it is true that there is a successful applicant, but they have not gotten through the process by which they have been approved and are definitely going to open.'",
        "'speaker_5': 'There is still a process whereby neighbors will be able to give input, etc. So I just wanted to make sure that was clear. I've really struggled on this and I think that the way that, that, that, that, that this has been set up is I think the agenda its agenda is badly and out of out of whack'",
        "'speaker_5': 'with what our sunshine ordinance requires. I don't think that even if somebody were to challenge that, I don't think that it means that it would get thrown out. But this is one of the most difficult titles I've ever read.'",
        "'speaker_5': 'And the specificity of specificity of it makes it so that we cannot talk about anything. We have to either move it forward as written or restart the process again and come back in four weeks with a new first reading.'",
        "'speaker_5': 'And I think that's unfortunate. I have up until yesterday been using the term I think we need to go slow. And I have heard very loudly that, you know, while being aware that we have been working on this for two years, we've gone slow.'",
        "'speaker_5': 'I think we still need to go small. And I'm going to just jump ahead to reading, reading the board a little bit. I would be willing to.'",
        "'speaker_6': 'Support.'",
        "'speaker_5': 'Maintaining this as written, but I would like to do so with direction to staff that they only issue an RFP for two more two more dispensaries. I don't think there's been a case made for that necessary. I think that we can issue two more and and, you know, take it take it a little take it a little'",
        "'speaker_5': ', you know, start small, learn, learn from what we're learning and have the the ability to go out for a fourth as well. You know, I do think that there is some concern out there. To Mr. Sherrod's point. I do want to point out that there is a subsection here that says the chief of police, if there are'",
        "'speaker_5': 'welfare issues that he leave, sorry. Anyway, the chief of police has the ability to actually take immediate action to suspend operations. If people are violating the rules on these things, I will expect that our chief of police is not going to do so under a very ticky tacky complaint.'",
        "'speaker_5': 'But if people are doing things that are shown to be attracting or impacting children, I would expect that that action will be taken very, very swiftly. I also the reason I feel well, I would like to see some changes here.'",
        "'speaker_5': 'I know that a lot of work has gone into this and I'm going to honor that work. From my standpoint, I believe that the annual permit people would be coming back every single year gives us a lot of control.'",
        "'speaker_5': 'If there are bad actors, they will find themselves. At least for me, having invested a lot of money to operate a business for a year and then not being permitted to continue to do so. So with that, I'd love to hear from my colleagues.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Who's going next? Councilmember Vela.'",
        "'speaker_8': 'So I am a little concerned and I want to echo the vice mayor's comments about the interpretation of the RFP. I. I want to assume that we will we will get more advice once there's been a little more research into that, because what I heard essentially from Mr. Lay was that he wanted an Ms..'",
        "'speaker_8': 'Potter, was that they wanted to look at other groups and how we'd done things. So I would like to get guidance on that. What concerns me in particular is, especially with the recusal issue, is that essentially if so, does that mean that if there's another, you know, person who's thinking about applying and I live within 500 feet'",
        "'speaker_8': 'of that, you know, that area that I'm now or any one of us would then be recused. I just I think it creates a kind of we could dove down a rabbit hole where we're in. Essentially, everyone could potentially have recusal issues because of the possibility of future changes or future applicants.'",
        "'speaker_8': 'And so that when that occurs, it seems to me that that's an issue of kind of general, you know, that it applies to everybody. And therefore, the recusal law wouldn't necessarily apply that. That's kind of an off the cuff thought that I'm having.'",
        "'speaker_8': 'But I would like to get some clarity on that because I think it will become an issue as to the specificity and how complex this title was. That was specifically in response to the complaint, which said that the title itself did not clarify with enough specificity what we were discussing.'",
        "'speaker_8': 'And so that's kind of the outcome of that, is that we get these very long titles that kind of lay out every single change since. That was my understanding. That was that was Ms.. Chen's complaint. Additionally, you know, I'm not inclined to change.'",
        "'speaker_8': 'I haven't heard anything that's that made me inclined to change my position on the substantive issues. I think that there's a lot of misinformation in the community and a lot of people who don't really understand. And I think we need to do a better job of clarifying what the specific process is, where there's an opportunity for community'",
        "'speaker_8': 'input. And we've had several meetings now where we've heard from community members that are near certain locations. And the feedback that I've given before and I think that this counsel has given before, is we need to clarify where and when the opportunity for those concerns to be raised would be and how people can go about doing that'",
        "'speaker_8': '. And that's going to be largely before the planning board. But the other thing that we'd given direction on in past meetings was that there be some sort of good neighbor policy work done where we can kind of establish so that we avoid these sort of ticky tacky violations.'",
        "'speaker_8': 'But there can be standards put out where people can give feedback and the good neighbor policy can exist. It's something that's been done in San Francisco and other communities so that we know where what sort of things would constitute a substantive violation wherein, you know, the permit would not be renewed on the annual basis.'",
        "'speaker_8': 'I also think that, you know, regarding the delivery only thing, part of the discussion centered around around the time this came back to us, there were changes to the state regs. Prior to that, the state regs essentially allowed for delivery only to be operated under a different set of regs from storefront properties.'",
        "'speaker_8': 'And the state regs changed over summer. And they essentially said, nope, delivery only. You've got to comport with all of the regs that exist for storefront property. So now you have to have a separate location, you have to do all these different things.'",
        "'speaker_8': 'And that's been an extensive conversation that was going on with the state, and they changed those regs over the summer and it did have a significant change. And that was part of the reason for why we said, okay, you know, if they have to be the same, let's make it storefront, but let's require that they offer delivery'",
        "'speaker_8': 'only. And then the other reason that we we instituted the Grand Avenue dispersion was that the mile dispersion was an issue. It was hard to calculate. It made it difficult to kind of have people planned out. And you you made it dependent upon when different applicants came in, it became a very difficult process.'",
        "'speaker_8': 'But what we did institute relative to that Grand Avenue dispersion was that essentially you have to have one on each side of grand before you can get that second one. And that was something that we had talked about and we had put in there.'",
        "'speaker_8': 'And so what that does is that means that we will go slowly. Implementation will be considerate, it will be thoughtful. There is a process. We do want community input. We're not saying no to the community. The community, just like in other conditional use permit situations, will have an opportunity to input and give input.'",
        "'speaker_8': 'But this will stagger when different businesses come online. And so it's not that we're going to go from. 0 to 4 overnight. And in fact, when we look at other neighboring cities like San Leandro that are similar to two cities like Alameda, San Leandro, Emeryville there, they've been working on their cannabis rags for quite some time.'",
        "'speaker_8': 'San Leandro just finally got to a point where their cannabis dispensary is finally getting moving through the process. And it's been three years or two years, something like that. Three. So anyway, so I'm not compelled to change the substance of this.'",
        "'speaker_8': 'I do hope that in the future we can discuss and go over and be more considerate and thoughtful of transparency and access, but also lay out a process where we can address these procedural challenges sooner so that we're not drawing out the process for longer than it needs to be.'",
        "'speaker_0': 'Thank you. Councilman Brody.'",
        "'speaker_3': 'I'm way over here by myself.'",
        "'speaker_8': 'You lonely? You're hot.'",
        "'speaker_3': 'Just a quick question of the interim city attorney. So I there was a question raised about a possible referendum. So I believe a referendum would either make us like repeal this ordinance, which I think, if that happens, would revert us back to what we have today.'",
        "'speaker_3': 'Or we would have we would suspend the implementation of it and put it on the ballot, which I think also would revert us back to what we have today. Is that correct?'",
        "'speaker_2': 'That is a correct analysis.'",
        "'speaker_3': 'Okay. So I appreciate that. So, I mean, and I appreciate my my colleague, Ms.. Vela, you know, kind of re restating the history. But I think it's important to understand how we got to where we are today. I mean, the important thing to me is we can pass this, you know, we can quibble about why we're here'",
        "'speaker_3': 'and, you know, whether we should be here or not. But we're still going to have the same thing we have today. And if we don't pass it, we're still going to have the same thing we have today, except maybe a little bit more legal risk that the city attorney is concerned about.'",
        "'speaker_3': 'So, I mean, okay, I mean, six and one half dozen the other, I'd rather have less legal risk than more legal risk. And also, if I'm looking at this, you know, I'd rather pass it and then, you know, make it a little bit more ironclad.'",
        "'speaker_3': 'I, I sit up here and, you know, this. I don't know how many times we've had this discussion. I think if I counted it out, we've had, what, like 44 meetings over the past two years. I think 25% of them have had cannabis come up because I think there was my referral, I think to Spencer put in'",
        "'speaker_3': 'another referral. I think we had a discussion and we had a workshop. So I think that's three. I think we had one ordinance that had two readings, so that's up to five. I think we had a second ordinance that had two readings that's like seven.'",
        "'speaker_3': 'I thought we did something related to the July 1st testing lab. I don't remember if that was one or two. So if it was two, that's nine. We had the the discussion about the youth centers, that's 11. So now this is like meeting 12.'",
        "'speaker_3': 'And then if we have a second reading of this, that's like 13 meetings and we've talked about this a lot and I'm not going to use my whole time because, you know, there's probably an hour and a half worth of me talking on this.'",
        "'speaker_3': 'So I'm a little concerned that we're getting that people are getting a second bite at the apple to try to get rid of this. But now I'd like to pass it and get it done. What we did as a council and this is what I wanted to do.'",
        "'speaker_3': 'And I think Councilman Avila talked about, you know, San Leandro. I think it's been four years. Someone could check me if I'm wrong and I'm sure it'll be over Twitter if I'm if I'm incorrect. But it's been four years since they issued the first permit, and I think they're just starting to open.'",
        "'speaker_3': 'And then they had to go back and do a second one and then they had to go back and do a third one. So what I wanted to do here, and I think our council agreed, was set a framework to allow these businesses to go forth and let the market and let the planning process sort it all'",
        "'speaker_3': 'out. And then so we're not coming back, you know, you know, every time doing Whac-A-Mole, when, you know, somebody said somebody got a wrong deal here. Somebody didn't get a fair deal here. You know, we set the framework and the market will decide if there's four, maybe there won't be, maybe there'll be four and they'll be long'",
        "'speaker_3': 'lines and we'll have to reconsider that. Maybe they'll be one. Maybe in four years like San Leandro will still be struggling to have one open. I don't know. That's what the planning process is for. That's what the market is for.'",
        "'speaker_3': 'And I think our our job as council was to set a high level policy and put the framework in place for those other processes to play out. I think that's exactly what we're doing. I prefer that we don't have any delay in our piece.'",
        "'speaker_3': 'And, you know, I'd like to keep the same for so I'm not going to support any direction that would change our piece from, you know, four to any other number. So that's where I am on this.'",
        "'speaker_0': 'Okay. So I'll go last. And I, I think my position has been pretty clear all along. I have supported medicinal dispensaries all along. Testing laboratories, manufacture delivery only is fine. But I am troubled that we have managed to with a, you know, three two majority but it was still a majority morph into all of the dispensaries being'",
        "'speaker_0': 'able to dispense adult use as well as medicinal. And I know I've heard the statistic cited that 68% of Alameda residents voted in favor of legalizing recreational cannabis. And I'm sure I was one of them. But that was not a vote on.'",
        "'speaker_0': 'Wanting to have it in our in our city, in just any location. I am troubled because I don't think we have been respectful to segments of our community. We have an open government commission for a stated purpose, their mission, and they're there.'",
        "'speaker_0': 'They're the tasks that they're to complete and conduct were reviewed by the city attorney's office. So it is somewhat curious that the city attorney's office is now telling them, no, you don't have that authority, but be that as it may.'",
        "'speaker_0': 'I've also been troubled with the changing definition of youth center and the fact that I don't think we've heard or that we've been respectful of merchants on Webster Street. I get that they can come to a a hearing and object.'",
        "'speaker_0': 'But I think it was perhaps premature for the Webster Street or the yeah, the West Alameda Business Association to say that the Merchants Association approves this when we've heard from an awful lot of Webster Street merchants who certainly don't.'",
        "'speaker_0': 'But I do have a question for the city attorney. Interim city attorney, is the the issue of the changing or changed definition of youth center? Is that coming back to the council?'",
        "'speaker_2': 'No, unless there were three votes to have the matter returned to the council.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Well, I doubt that that would be the case. Okay. So so I'm not going to support either either of these ordinances, but are we ready for a vote, folks? And city clerk you want us to do each separately.'",
        "'speaker_1': 'Do a vote on both.'",
        "'speaker_0': 'The vote and both. Okay. So is there a motion to consider introduction of, you know, let's well, that probably doesn't make a difference. Okay, we're okay with that city attorney interim city draft. Okay. So public hearing to consider introduction of ordinance amending the Alameda Municipal Code as stated in the first paragraph of item six B and then'",
        "'speaker_0': 'introduction of ordinance, amending the municipal code by amending the articles and zoning districts and all stated in the second paragraph of item six B Is there a motion?'",
        "'speaker_3': 'I'll make that motion as long as I don't have to read the whole thing.'",
        "'speaker_0': 'I was avoiding it too. We have a motion by Councilmember Otis. Do we have a second? Is there any discussion? I'd just like that Vice Mayor.'",
        "'speaker_5': 'Discuss for a couple of seconds. Sure. And rather than make an alternative motion or whatever else, I guess, I mean, I'd like to ask for consideration of limiting the RFP. I haven't yet heard a heard a. The original consultant on this said that Alameda should look at 3 to 4 dispensaries.'",
        "'speaker_5': 'I haven't heard a compelling reason why four has to be the number, and I've heard that people are okay with Ford, but I've also heard a lot of concern in our community, and I just wonder if we could pass this and then do the RFP for three and and and vote and get at least three votes on'",
        "'speaker_5': 'this to just move it forward, get rid of the, you know, legal whatever that the attorney has referenced. I am just wondering if you would be willing to consider that I'm making a last minute. I know you said no, but I'm asking again.'",
        "'speaker_3': 'Madam Chair, if I may, and I did say I wouldn't be and I. I still wouldn't be. I appreciate the ask. I think if I recall correctly, the consultant said it's like one dispensary for 15,000 people. So, you know, Ford may actually be one less than our market would support.'",
        "'speaker_3': 'So because we have, what, 78, 79, almost 80,000 people. So, you know, I would like to just keep the process that we passed and keep moving forward with it without any changes.'",
        "'speaker_0': 'Your hand.'",
        "'speaker_8': 'Councilmember Avila Yeah, and that was a point that was also raised at the I think the last time that we voted on this. And specifically he had said it was for one for every 15,000, and that was based off of the total number of sales that they do per day plus the the volume that that because they're'",
        "'speaker_8': 'limited in terms of how much they can sell per day, blah, blah, blah, blah.'",
        "'speaker_0': 'Okay. So we've had a motion and a second all in favor. I opposed. No. Okay. So the motion is tied to into.'",
        "'speaker_5': 'The item film.'",
        "'speaker_0': 'So so yeah.'",
        "'speaker_3': 'With more legal risk and exposure to the city.'",
        "'speaker_0': 'All right. Thank you, everyone. And at this point. I'm just going to give you a roadmap of.'",
        "'speaker_3': 'How we're going to get our.'",
        "'speaker_0': 'Oh, yeah. We have another calling. Um. Okay. I'm sorry. You've lost him.'",
        "'speaker_3': 'How could you lose a council, mate?'",
        "'speaker_0': 'I thought he went through there. Okay. A Tony de song? Yeah. This one here?'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_0': 'So while the city clerk is hunting for our highest council member, we've rarely lost one for long. This is. This is the way the meeting is going to proceed, unless anyone has strenuous objections. We're going to finish items seven, eight, nine and ten and 11.'",
        "'speaker_0': 'I'm going to adjourn this council meeting. We are going to go back for a brief closed session because there was one item, but it's a short item we didn't get to before this meeting. And then we will return.'",
        "'speaker_0': 'And I'm told, I believe, no more than 30 minutes. Mr. Potter, give me a nod of the head, everyone. Okay? No more than 30 minutes for the closed session item, and then we will come back.'",
        "'speaker_8': 'And take a break.'",
        "'speaker_3': 'I don't want to do.'",
        "'speaker_0': 'An issue and then we're going to come back.'",
        "'speaker_3': 'To use the bathroom.'",
        "'speaker_0': 'Okay. But I'm still I still want to proceed, as I.'",
        "'speaker_3': 'Know you guys can figure.'",
        "'speaker_0': 'Out what.'",
        "'speaker_3': 'To figure.'",
        "'speaker_0': 'Out. Okay. Okay. We are going to take.'",
        "'speaker_4': 'Are we still in the matter?'",
        "'speaker_0': 'No, we we finished. We finished that item. It's done. And okay, we will take a ten minute break. This meeting is resuming at 940. Thank you. It's 940 and we are going to we're going to we're sorry. Went the wrong agenda.'",
        "'speaker_0': 'Okay. City Council. Okay. Here we're. Okay. Thank you, everyone, for keeping that to 10 minutes. And this is what we're going to do. Well, I'm just having a little trouble bringing my agenda up, but I'll try again. Okay, so we are on item seven and this is a meeting.'",
        "'speaker_0': 'It's a little unusual because we have a special meeting following the regular meeting, but I'm going to insert a brief, brief closed session because there was an item with Debbie party that we did not get to before seven.'",
        "'speaker_0': 'We had to come to the 7:00 meeting. We were a little late to that, so please bear with me. So I'm going to just go down the list. We are now at City Manager Communication. No report. All right.'",
        "'speaker_0': 'And do we have any oral communications non agenda? Okay. And we don't have any council referrals. How about council communications? Councilmember Odie, can I start with you?'"
    ],
    "Ballot Arguments and Rebuttals for the April 9, 2019 Special Election Measures.": [
        "'speaker_0': 'Okay. All right. I'm. Who's presenting this? Is that you, Mr. Roche?'",
        "'speaker_1': 'Oh, I guess.'",
        "'speaker_0': 'Oh, you are okay?'",
        "'speaker_1': 'Yeah, you were right about. So basically, the two subcommittees of the council went ahead and both prepared their argument. The one against the initiative and the one in favor of the Carrying Alameda Act. And so those two are before you.'",
        "'speaker_1': 'And what you need to do is just review it blessed. And then you can have a brief discussion about how you want to handle signatures and rebuttals.'",
        "'speaker_0': 'Okay. Thank you. So where do we start, Councilmember Vella.'",
        "'speaker_8': 'For the valid argument against which I worked on with Mayor Ash Ashcraft, I did want to note there is a link now that we can add in. So in the second line where it says a report was prepared for the city council link, the I would like to replace the bracketed link with the direct link to the'",
        "'speaker_8': 'report, which is HTP s colon.'",
        "'speaker_4': 'I've got it. You've got it. Yeah.'",
        "'speaker_7': 'With.'",
        "'speaker_8': 'Backslash Alameda S.A. of McKay report. And so for those watching, essentially we've got the direct link to the report so you don't have to go on to our website and look through the past agendas in order to find out it's now directly available there.'",
        "'speaker_8': 'Mm hmm. And so with that change, I would just say that I think that, you know, our subcommittee worked. Fairly hard getting this done in the in the quick turnaround time. And I you know, I feel comfortable with the the language as written.'",
        "'speaker_0': 'And I will note that we have speakers. So do we have any council questions before I go to public speakers? Hearing that I'm going to call our public speakers. First, I have Doyle Saylor and then I have Doug Biggs.'",
        "'speaker_6': 'Mayor Ashcraft and council members and everybody pretty much knows who I am. So we talked about this issue with the McKay Avenue Respite Center. We talked with Doug Biggs quite a bit. So we understand it and renewed hope because is very feels very strongly that this rezoning is not necessary and we were opposed to it.'",
        "'speaker_6': 'So we just wanted to deliver a message that we're going to oppose the measure and mobilize against it in the coming election. And we're looking to get together with our allies to have a united effort against this. And we just want to let everybody know that we're going to do that.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Doug Biggs.'",
        "'speaker_6': 'Thank you. Good evening, Mayor Ashcraft and members of the City Council. I'd like to thank both committees for the wonderful work you did on on writing the ballot matters. I have just one minor suggestion, and it doesn't have to really do with the major itself, but how we refer to it for the ballot argument against Mackay.'",
        "'speaker_6': 'That's the zoning change ordinance. It's not an open space initiative because it's not creative open space that should be referred to as the zoning change initiative.'",
        "'speaker_3': 'I think we do a disservice to the community when we refer to it as.'",
        "'speaker_6': 'An open space initiative because it doesn't create open space, it just change zoning. And I know the discussion is going to come up around signature gatherers. As you know, over 500 Alameda INS have signed a letter endorsing the project and opposing the initiative.'",
        "'speaker_6': 'We have a number of folks who are very interested in signing on to to the ballot arguments and also to the rebuttals. I think it would be wonderful if it's each of the two committee members of each of the initiatives signed on, and then there's other members of the public that would be very interested in signing on'",
        "'speaker_6': 'in the district of those. I just put that out there. Thank you.'",
        "'speaker_0': 'Thank you. Okay. Those are all of our public speakers. So council comments. Who wants to start? Have a question. Councilmember Vela.'",
        "'speaker_8': 'If this is for our city clerk, the ballot argument against that's just listed here. Is that also printed on the thing on the in the booklet?'",
        "'speaker_1': 'Yes. The voter information pamphlet basically identifies the that the one is the argument the order of printing is actually the argument in favor, then the rebuttal to the argument in favor. Then the argument against and the rebuttal to the argument against.'",
        "'speaker_1': 'So that's the way it is identified.'",
        "'speaker_8': 'And the title at the top is also printed.'",
        "'speaker_1': 'No, they use the exact wording of the elections code but. Oh that so.'",
        "'speaker_8': 'That that line isn't going to be.'",
        "'speaker_1': 'No, no, no. It'll say measure blank, you know, with the number of the letter.'",
        "'speaker_8': 'But I hear what the speaker said and I note that.'",
        "'speaker_1': 'Okay, thank you.'",
        "'speaker_0': 'But but so the I mean, the point you're making is it will not will it reference.'",
        "'speaker_1': 'It will say argument against measure and then the letter.'",
        "'speaker_0': 'Right, then not the.'",
        "'speaker_1': 'Title of any form other than right. It's against or.'",
        "'speaker_4': 'For. Okay. Measure. Yeah.'",
        "'speaker_0': 'Yeah. Yeah. Okay. Councilmember Okay.'",
        "'speaker_3': 'So, and then just to clarify what you're going to ask us for direction on actually doing a rebuttal argument.'",
        "'speaker_1': 'Correct. Okay. I'll have to make that decision time because you do not have another meeting prior to submitting those on the 24th.'",
        "'speaker_3': 'And our options are.'",
        "'speaker_1': 'You can maintain the same subcommittees, you could swap subcommittees, you could just figure out.'",
        "'speaker_7': 'Okay, I'm not a mayor.'",
        "'speaker_0': 'Council, I'm a vice mayor.'",
        "'speaker_5': 'Nice way to a quick question. I guess I'm thrown off by that. I know that the way you can format these is very, very limited. I'm thrown off a little bit by the bullet points and then the lack of them in a couple of places.'",
        "'speaker_5': 'And I and I understand the intent is to bullet point a couple of things that are headers, but I mean, is there a way to indent or something so that when this aligns, you know.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'You'd have to give me that formatting by 5 p.m. tomorrow and you know, whatever you decide. But that intention is allowed and it's this is different than candidate statements that are required to be in block format and have no anything.'",
        "'speaker_1': 'Special arguments have a little more leeway. And so you can do bullets, you can indent, you can.'",
        "'speaker_0': 'If I could just interject, I would appreciate if we could perhaps have the city attorney's office. Ms.. Chan has been working with us on these, perhaps just also give a look it over and help with whatever reformatting you're suggesting.'",
        "'speaker_5': 'Yeah. Is that okay? Yeah, that's one for.'",
        "'speaker_0': 'And what else?'",
        "'speaker_6': 'So you.'",
        "'speaker_5': 'I have no personal comments to to Councilmember Ortiz question. I would recommend that we we look to have the authors of each of these sign them and then leave the other spaces open for community members who might be sending.'",
        "'speaker_5': 'And then to your your question, I would suggest. Oftentimes, it's actually the campaigns that write the ballot. And I think maybe the rebuttal should be written by the by the campaigns rather than the council.'",
        "'speaker_1': 'I just want to say, if different people write the rebuttal, there's an additional requirement that the authors that do the first one have to release to allow other authors. So there's just an additional form that has to be signed, but it's just something to be aware of and understand.'",
        "'speaker_0': 'Right?'",
        "'speaker_8': 'Councilmember Vela So I think that the intentions went away as a formatting switch over to we used to, we hadn't tried in previous one. So I'm happy to reformat that and then also add the link and work on that.'",
        "'speaker_8': 'I would I actually would like to propose that we take a vote tonight in terms of having the mayor, there was a vast majority of us who signed off on on these on both initiatives. I would like to essentially give the mayor the authority to sign on behalf of the the council, and then that would leave open'",
        "'speaker_8': 'for spots for community folks to sign on. And my question is for the city clerk. Can we do that? Can it say mayor. Mayor Marylin as he Ashcraft on behalf of. Or is it just her signature statement title?'",
        "'speaker_5': 'Yeah.'",
        "'speaker_1': 'I mean, I know she could put her title Mayor City of Alameda City Council. I know she could put like her exact title, but I don't. I on behalf of little.'",
        "'speaker_2': 'I would be a little wary of doing it that way.'",
        "'speaker_0': 'Well, what was the question again, that.'",
        "'speaker_9': 'On behalf of.'",
        "'speaker_5': 'Half of the city council. Oh.'",
        "'speaker_2': 'I would say it would tend to sound like there's five and now you're adding additional four.'",
        "'speaker_6': 'I think. And I think we can do it.'",
        "'speaker_0': 'Well, I think you are destroying that. One of the things. Okay, let's everybody let's let's see what the acting city attorney, an interim seizure he's got for us.'",
        "'speaker_2': 'Mr. Jam points out to me, we're looking here at not sure where it's coming from, but it does say print name, title and if applicable, submitted on behalf of. Yes, so so it could be done.'",
        "'speaker_0': 'So my question.'",
        "'speaker_1': 'That's the notice that went out. And that notice is just to clarify that if it's not a voter of the city, it has to be on behalf of an organization. Right. So but I'm not sure that that even that in there, when they're representing their organization, I'm not sure they get to put the on behalf of words'",
        "'speaker_1': 'in. I think they just put their name and their title. I would have to double check with outside counsel.'",
        "'speaker_0': 'My comment would be, I would well know so-and-so comma, executive director of Sierra Club as opposed to on behalf of and the. The concern I would have is that we will recall we didn't have a unanimous vote of the council to do this.'",
        "'speaker_0': 'And so to say that it's on behalf of the city council seems a bit misleading and also unfair to our colleague Councilmember de Sykes position. I think when we did a lot of brainstorming in the course of our drafting.'",
        "'speaker_0': 'And one thing that Councilmember Vela and I thought is that perhaps the mayor and vice mayor could sign in our respective titles and then we would scurry around and get our other three signers. And we did. We started compiling a list.'",
        "'speaker_0': 'It's just we haven't done the outreach to get them nailed down. But we will.'",
        "'speaker_1': '5 p.m. tomorrow.'",
        "'speaker_0': '5 p.m. tomorrow. Okay. Okay. Councilmember Ody, I mean.'",
        "'speaker_3': 'I agree with the indentation, so that's fine. And I like the idea of having the mayor and the vice mayor, you know, sign both. You know, I personally would like to sign the Carrying Alameda Act, but, you know, if the council would prefer to do it the other way, I'm fine with that, too.'",
        "'speaker_0': 'Let's get to that next. Let's let's let's dispose of the first one. Hold that thought. But right now we've got the ballot argument against the Mackay Open Spaces Initiative. That's for identification purposes only. The formatting will be cleaned up, the link will be added.'",
        "'speaker_0': 'So everybody okay with the wording? Yes. Okay. And by 5 p.m. tomorrow we will have five up to five signatures and maybe we don't have to have a five, but. Okay. And Councilman Brody, sorry.'",
        "'speaker_3': 'So then on the rebuttal, I mean, isn't it also true that if we if we choose, we get first dibs, right? But then if other people submit, then there has to be like a random drawing or something, right?'",
        "'speaker_1': 'No. Okay. So that's. That's not for the rebuttal.'",
        "'speaker_3': 'That's okay.'",
        "'speaker_1': 'The director.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'There is an order in the elections code, and the council is highest in the order. So your arguments will be selected.'",
        "'speaker_3': 'But if we choose to, like, delegate this out to the quote unquote campaign, then we're kind of losing that or no?'",
        "'speaker_1': 'Well, no. Once there's two sides that have done the direct arguments, then the rebuttals are done by those same groups.'",
        "'speaker_3': 'Okay, so.'",
        "'speaker_1': 'Maybe just another.'",
        "'speaker_3': 'Okay. So we can't really farm out the.'",
        "'speaker_1': 'Rebuttal, okay. Yeah. I mean, you could work with somebody else, but technically, I mean.'",
        "'speaker_8': 'The original.'",
        "'speaker_1': 'Group has the authority over the.'",
        "'speaker_7': 'Rebuttal.'",
        "'speaker_3': 'Okay, so then the committee, the subcommittee would probably be the one that does it. I mean.'",
        "'speaker_0': 'That was my assumption that the two drafters would handle the rebuttal to the opposition, to the pieces that council member Jody and Vice Mayor Inoculate. Is that.'",
        "'speaker_6': 'True? Yeah. How do.'",
        "'speaker_5': 'You mean?'",
        "'speaker_0': 'Like I said, it was my assignment. We did a good job.'",
        "'speaker_5': 'If the council has to do it. Yes, that makes sense.'",
        "'speaker_0': 'Okay. Completely. Okay. So is that so? Okay. So we are we have approved the language of the argument against the Open Space Initiative. And then. Okay. And then we're going to let's take a look at the.'",
        "'speaker_6': 'Point of order.'",
        "'speaker_0': 'Oh, sorry. Yeah. Yeah. Yes, we do. Okay, so let's see. Well, how many votes do you want us to take? Citizens.'",
        "'speaker_1': 'I think if you want to combine this, like, motion to say you're approving the language with the link in the indent, and then you're authorizing the same subcommittee to work on the rebuttal. And then you're having the mayor and vice mayor sign and figure out the other three signers.'",
        "'speaker_1': 'That could be the motion. Okay.'",
        "'speaker_0': 'That's for the first one. Okay, let's break it up that way.'",
        "'speaker_8': 'I will make that motion.'",
        "'speaker_0': 'What she said. Yeah. Yeah. Okay. So it's been moved by Councilmember Vela. Is there a second then we'll have discussion.'",
        "'speaker_5': 'I'll second it for discussion, but I'd like to go. So the problem with going one at a time is that Councilmember Ody has indicated interest in signing the other one. So the question for me is, do we want mayor and vice mayor on one and mayor and Odie and the you know, we can have two different signers'",
        "'speaker_5': 'on each. But. Or do we want to say the mayor? I don't know.'",
        "'speaker_0': 'Good question. What do we want to do, folks.'",
        "'speaker_5': 'Before we make a decision here and then we're okay?'",
        "'speaker_0': 'When a time when it time. Are you done? Okay. Councilmember Vela.'",
        "'speaker_8': 'I am happy to have and I think it's appropriate to have the mayor and the vice mayor sign both of them. I think in the event that we but I also think that there is a value and intrinsic value to show that there is a coalition of folks that are involved in this.'",
        "'speaker_8': 'It's not that the rest of the majority of the council wouldn't be involved or actively supporting it or even listed as supporters. But I think just for the purposes of the ballot argument, I think having the mayor and the vice mayor sign is a show of solidarity among the majority of the council and then have these other'",
        "'speaker_8': 'community groups sign on. That's that's what my vote would be. But if there's a strong feeling from one of my colleagues to sign on in a separate measure, I would consider that separately. As for this measure, I'm fine not signing it.'",
        "'speaker_8': 'However, if we are unable to get other signatures, I'm more than happy to be called at 450 and come to City Hall to sign it if needed.'",
        "'speaker_0': 'I have a I have a suggestion. What if. So we've got two valid arguments and then we have rebuttals. What if the vice. The mayor. Vice mayor signed off on the arguments and I from that expression, I'm going together, infer that you're not terribly in this.'",
        "'speaker_0': 'And then two other council members sign off in the rebuttal with members of the community member Odie.'",
        "'speaker_3': 'I mean, I'm fine with just having the two, I think, and happy to have my signature in reserve, but we could still sign the paper and then you could just use it. You don't have to rush over here at 445, right?'",
        "'speaker_3': 'I think you can have it in your hand and if you need it, you could take it. And if you don't need it, then you just picture pages.'",
        "'speaker_1': 'I don't require it. I'll be on the same page.'",
        "'speaker_3': 'Okay. So.'",
        "'speaker_0': 'Okay. So I'm not sure we decided anything, did we?'",
        "'speaker_3': 'That the mayor and the vice mayor are signing and that if.'",
        "'speaker_0': 'It signed both.'",
        "'speaker_3': 'And is a sign of unity and strength. And then, you know, we would offer our signatures as a backup if we couldn't get community members, because I agree that having a show, a strong show of community support is is probably stronger.'",
        "'speaker_0': 'Minor technical point. I'm going to be in a train at 730 tomorrow morning.'",
        "'speaker_3': 'You could sign it now.'",
        "'speaker_0': 'I could sign.'",
        "'speaker_3': 'A separate piece of paper.'",
        "'speaker_5': 'Okay. That's my hope.'",
        "'speaker_3': 'Okay. I mean, we all could.'",
        "'speaker_5': 'Live tomorrow.'",
        "'speaker_0': 'So. Yeah.'",
        "'speaker_1': 'So you can both sign tonight. Okay.'",
        "'speaker_3': 'On the clerk could choose. If she gets the others, then she's good. If she doesn't, then.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'She has some bank.'",
        "'speaker_1': 'Well, the the subcommittee would have to let me know who the five signers are. Right.'",
        "'speaker_0': 'Right, right, right. Okay.'",
        "'speaker_8': 'And I'll be around tomorrow.'",
        "'speaker_0': 'Great. Okay. And I think you could probably call in Mr. Biggs and others in the community to help you. Vice Mayor.'",
        "'speaker_5': 'That's why I have just just because I didn't understand the nuance exactly about the rebuttal. If Marilyn and I sign the mayor and I sign this, do we if if the mayor and. Councilmember Vela are doing it. Do I have to sign the release?'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'There's an.'",
        "'speaker_6': 'Additional.'",
        "'speaker_5': 'Signatures after the writing.'",
        "'speaker_1': 'That's just the signature. It's just to release. If if some anybody any of the five signers of the original argument are different than the rebuttals. All five original signers have to sign a form releasing who? The names of the different signers.'",
        "'speaker_1': 'And it can be just one different sign or it's still required of.'",
        "'speaker_3': 'Got a great point of information. Do we need that by tomorrow?'",
        "'speaker_1': 'No, that's by the 24th. Okay. When the rebuttal.'",
        "'speaker_0': 'The rebuttal arguments are due January 24th, but these by 5 p.m. But these signatures are required by tomorrow at 5 p.m., correct? Yes. Okay. Okay. So before we do a vote, we should take a look at the valid argument in favor of the Carry Alameda Act because we're going to vote on them altogether, right?'",
        "'speaker_0': 'Oh, no. Sorry. Sorry. We were. Yep, we were going. We're going. Yeah, we do. We have a motion in a second and. Well, because we won the discussion. Okay, so any further discussion. Okay. So all in favor of proceeding is as we've outlined.'",
        "'speaker_6': 'I, I.'",
        "'speaker_0': 'Opposed abstain. Okay. So four in favor. One abstention. Thank you. Okay, now we move on to exhibit two, which is the ballot argument in favor of the Carrying Alameda Act. Any discussion?'",
        "'speaker_3': 'I would make the same motion we just made last time.'",
        "'speaker_0': 'Okay. So does any OC do this motion?'",
        "'speaker_3': 'Sure. I'll move exactly what we did. Yes.'",
        "'speaker_0': 'What? I said.'",
        "'speaker_1': 'Yes, I repeat it again.'",
        "'speaker_3': 'Sure.'",
        "'speaker_1': 'Okay. It's keeping the same subcommittee to write the approving arguments presented, approving the same subcommittee to write the rebuttal, and having the mayor and vice mayor sign. And then looking the two of them looking for additional signatures by by 5 p.m. on the 24th.'",
        "'speaker_1': 'And then the direction in this one would include if you released.'",
        "'speaker_4': 'The rebuttal rebuttal release.'",
        "'speaker_0': 'Okay. So there's a motion. Do we have a second?'",
        "'speaker_5': 'I will second it, but then there's.'",
        "'speaker_0': 'Some discussion, part.'",
        "'speaker_5': 'Of discussion I would like to suggest. I think that that unity can look and look lots of ways. I heard Councilmember Ortiz say he'd like to sign off on this and I would be very happy to have him sign off on this with the mayor.'",
        "'speaker_5': 'So the mayor's on both. And this one is Councilmember Odie. I don't think that's a problem. I don't think somehow vice mayor is so exceedingly and I think breadth helps and given his interests, I just wanted to throw that out there.'",
        "'speaker_5': 'I will support my name being on it, but I definitely doesn't have to be.'",
        "'speaker_3': 'I want to defer to the. Titles.'",
        "'speaker_0': 'Um, you know, I think you, I my my sense is that it might seem just a little confusing to voters because it almost suggests that if it's the mayor and vice mayor, those are the two positions of, you know, it's not top position because we're heavy, which is but we are designated.'",
        "'speaker_0': 'If we saw that another individual, I think it could just call into question, oh, does that mean the vice mayor doesn't support the this? So I mean, but but where you could help us is by helping us round up those signature gatherers cause you are going to write the rebuttal.'",
        "'speaker_0': 'But what do people think? That's just my my impression, to keep it as simple. Straightforward.'",
        "'speaker_8': 'I agree. I think the the more, you know, we stick with the same, the better. Um, and then, like I said earlier, it's not that we're not supportive of it. Obviously our votes on the record, it's not that we're not in, you know, voting to endorse the measure or take action on it.'",
        "'speaker_8': 'We've done that. So I think there's other ways we show our support.'",
        "'speaker_0': 'And I would also suggest that maybe when it subcommittee is looking for signers, there might be one set of additional signers who are more affiliated with care centers and dealing with the homeless. And there might be another set of signers for the, the, the argument in our position who are, you know, who know parks and Recreation and'",
        "'speaker_0': 'what it does and doesn't entail. So that might be where you differ, but I think the council members do best to keep that uniform. But I do appreciate your sung strong support. Councilmember Odie.'",
        "'speaker_3': 'I wanted it to be uniform too, so okay. But I mean, I could say in the rebuttal to I mean it's I can be in reserve.'",
        "'speaker_0': 'Perfect. I don't have.'",
        "'speaker_3': 'To be the one on there.'",
        "'speaker_0': 'Got it. Okay. Any further discussion on this one before we vote? Yeah, we've got a second. Right. Okay. It's been moved and seconded. All in favor, I, I opposed. Abstain. Motion passes four in favor with one abstention. All right.'",
        "'speaker_0': 'And with that, we are adjourned once again. But this time for real. Tony Sosa. Oh, I'm sorry. I am rushing this one. Yes. No. Okay. Yes. To be or not to be.'",
        "'speaker_1': 'No recommendation to consider directing the city attorney to initiate litigation to obtain a judicial declaration. Whether enforcement of the Open Space Initiative will require the City of Alameda to compensate the owner for the value of McKay Avenue Property Event.'"
    ]
}