{
    "Review and Update of Local Action Plan for Climate Protection.": [
        "'speaker_0': 'All right. So now we get to number nine counsel referrals. Nine A is the first referral.'",
        "'speaker_1': 'Instead of directing staff to give you an update, Almeida's 28 Local Action Plan for Climate Protection. This item was posted as Councilmember Smith.'",
        "'speaker_0': 'Number matter.'",
        "'speaker_5': 'S.E., thank you. And I just want to put a fine point on that. The referral was to a request to direct the city manager. And City manager direct staff. So I got that right in there. In 2008, the city of Alameda approved the local action plan for climate protection, and there was requirements in that plan to periodically'",
        "'speaker_5': 'review it. So this is a referral, but it's more of a reminder because it's even if the referral doesn't pass, the policy document says we're supposed to be reviewing and updating it. And it's been a while. A lot has happened in within that while we're also on our own.'",
        "'speaker_5': 'And we're lucky we have CASA and now a umbrella group to fill the role that the original group of individuals I see they're stuck. There was one of the people who brought this to the council back in 2007, I think it was, and launched the effort.'",
        "'speaker_5': 'I think it's absolutely important nexus for the ordinances that we're talking about for animal tree light pollution. Those ordinances are tied into something like this. We have AMP initiatives with. How to handle solar power and net meter. Net metering in the future is tied into this.'",
        "'speaker_5': 'There are a number of issues that are coming to a head, so the time is now. So I'm asking my colleagues to consider the direction.'",
        "'speaker_0': 'And we have quite a few public speakers. Oh, so anyone has any questions before I call the speakers?'",
        "'speaker_9': 'Now after the speakers, I just want to let the council know that I've invited, even though this is a very community driven process, we also want to provide staff direction on what this could look like working with the community.'",
        "'speaker_9': 'And so Liam Garland is here, acting public works director to also answer any questions from the council.'",
        "'speaker_0': 'All right. Thank you. I want to go ahead and call the public speakers, Sylvia Gibson, Jeff Gould, and then. Or. You're stuck there. Stuck. Thank you.'",
        "'speaker_6': 'I'm Sylvia Gibson and I'm here representing CASA with Community Action for Sustainable Alameda. And thank you, Councilmember Matariki for bringing this to the Council. This referral to review and update the local climate action plan that was written in 2008 and it spans until 2020 its goals so part of this referral.'",
        "'speaker_6': 'Well, it's just the beginning of a process that will take some years to complete as we look to review and updated probably in 2020 to have an update ready. And in the meantime, to look at goals that we've met and celebrate those and look at goals that have not yet met and create a kind of a game'",
        "'speaker_6': 'plan for meeting those goals that are part of the current climate action plan. So the process will need dedicated involvement from every city department. So it's not like something we can just throw to one department and say, you do this because sustainability is is everywhere.'",
        "'speaker_6': 'And in addition, involvement of community stakeholders, individuals, groups, nonprofits, business partners, the utilities, the schools, the students, etc. and course is prepared to help coordinate the community involvement that's needed for this update. And we ask the city for leadership in the form of a few dedicated individuals or a green team to to facilitate, update and and our'",
        "'speaker_6': 'continued efforts to make Alameda the most sustainable city in the Bay Area. So thanks.'",
        "'speaker_0': 'Thank you. Mr. Gould. Jeff.'",
        "'speaker_4': 'I. I like to thank council member Mary for bringing us up and. With respect to CASA, I have to say that I don't believe Alan Bean is all that green anymore. I've watched our content mix go from 84%.'",
        "'speaker_4': 'About four years ago to approximately 14% green. Right now, that was due to the sale of our seas and our geothermal part of our bio mass energy of we've been producing to Shell Oil Company. Other words are green power went to the highest bidder.'",
        "'speaker_4': 'Now. Alameda did a great job prior to that being green today. Like I say, we're not. Now all the proceeds from the sales of the dresses and all of our green power for the past four years. And now into the future, another two years.'",
        "'speaker_4': 'But the new contract they just signed. Will produce, you know, maybe $20 million. That money needs to be a part of this update and review. That money has to be allocated in a way that makes sense and this review slash.'",
        "'speaker_4': 'Update is part of that process. And I believe. Simply. Directing staff to handle this. Is only part of a plan. I believe that several members of the community. Need to be part of a committee that creates this update and this.'",
        "'speaker_4': 'A future plan. Thank you. I support.'",
        "'speaker_0': 'Thank you, Mr. Baer stock and then Richard Baker and then Alan Pryor.'",
        "'speaker_11': 'Well, thank you very much, Madame Mayor, and council members. I also want to commend Frank Maher for bringing this up again. He was at the beginning of this process ten, 11 years ago. And to renew it before the whole council and our city is a truly a remarkable step.'",
        "'speaker_11': 'I think you can hear from the celebrations that we heard from already and the intention from your council member and also the seriousness of the challenge that we still face, that we need a robust, vigilant review. Clearly, Alameda started and has been and I agree that we've been a model city in the whole barrier in many respects'",
        "'speaker_11': 'in the country. The selling off of our clean energy was a complicated decision, but it has been a ten year period. The city only had about 5% of emissions and that came from the government and that was reduced.'",
        "'speaker_11': 'The ferry was a big problem ten years ago. We have a ferry boat system that is now clean. AMP has taken some steps, but we need another addition to that. There's been a tremendous work on recycling school gardens and of course the consideration of putting solar into our schools, which I strongly support and hope the financing of'",
        "'speaker_11': 'that can work out and that similar things could be done for the hospital. But we need to accept the challenge. You need to accept the challenge. And as has been alluded to already, citizen participation actually initiated this 11 years ago.'",
        "'speaker_11': 'It was fully embraced by the council and all the other by business and civic groups, the schools and others. We need that same kind of spirit that goes into the next steps. So I would like to urge that we look at transportation, at the codes for new buildings.'",
        "'speaker_11': 'There's a big surge in buildings. The Planning Commission has dealt with these in past years. We need to be very strong in that as the updated plan comes into effect to take the successes we've had and bring them further.'",
        "'speaker_11': 'The fact that there is going to be a kind of a celebration soon is a great step. It was anticipated in the plan that the council adopted ten years ago to have in a regular review, a public review, not just in C2, in a council where there are a few people here.'",
        "'speaker_11': 'And that had taken place a couple of times with the participation, I believe, of the majority of the council members and the mayor. But we need to do that if we're going to truly achieve success with the whole public involved and to take it the next step.'",
        "'speaker_11': 'It involves public transportation, biking, not just one day to school, but biking. Lots of people in this town, a lot of steps that we can do with public participation. I'm also the president of the United Nations Association in the East Bay and then in Northern California.'",
        "'speaker_11': 'And I would like to suggest that when the review takes place and I will finish with this point, that there should be some consideration that Alameda will not only work with the governor and the state and the county, but that Alameda will adopt the principle that in in the context of the global accords that were adopted by'",
        "'speaker_11': 'every country in the world in Paris last year, 193 countries, it was up to voluntary action of businesses and countries and cities, and that Alameda should aspire to and hopefully will have a recommendation and an adoption that we will conform to the goals of that global climate accord.'",
        "'speaker_11': 'Otherwise, we're going to be facing sea level rise here and public health problems and a shortage of the things that make Alameda a great city. Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Bangar. Mr. Prior. And then it's Abby, and then she's our final speaker.'",
        "'speaker_4': 'Thank you, Mayor. Members of the council and city staff. I'd like to preface my remarks by pointing out that even though this plan has the tag word of climate in it. Even if all of the. Ice sheets in the world were status quo and there was no melting and no increase in temperature.'",
        "'speaker_4': 'All of the issues raised in that plan would still warrant attention by a conservation minded public and its public agencies. I'd just like to point that out. They're all good. They're all good. Areas that we should focus on as stewards of the earth.'",
        "'speaker_4': 'The the area that I would like to highlight or bring to your attention that I think meet that needs needs some more focus in this this new update is a look at the policy and decision making processes that Alameda municipal power users and the Public Utilities Board which essentially follows the lead of Alameda Municipal Power in making'",
        "'speaker_4': 'various decisions. I think I think the. A working group or however you want to phrase it that that that updates this plan needs to take a hard look at those policies and how decisions are made. I'll point out a few in the brief amount of time I have.'",
        "'speaker_4': 'One is the recent change in the rates for rooftop solar. Now much is or is made about. It's our own public utility. Well, at that meeting, there was something like 25 speakers that spoke against changing it. No one spoke in favor of changing it.'",
        "'speaker_4': 'Yet it was changed. And that put Alameda Municipal Power right in line with the state of Nevada, which adopted a similar change in their metering program for solar. And it led to hundreds of layoffs in the rooftop solar installation business and in Nevada.'",
        "'speaker_4': 'Another area that. I can't seem to get any traction on is doing a simple feasibility study on whether it would make sense to put a solar farm on Mount Trash, more city owned property that has no no other use in sight.'",
        "'speaker_4': 'And get a study just to see if that's feasible. But yet there was there was a feasibility study done as to whether we could establish a microgrid at site. Well, it turns out that it's not feasible. Part of the reason cited was there won't be any solar there, even though all of the new buildings will be solar'",
        "'speaker_4': 'ready. Thank you.'",
        "'speaker_0': 'Thank you. Alan Prior and then Ruth. Abby. If you want to speak on the asylum, please submit your slip.'",
        "'speaker_4': 'I'm Alan Pryor and I'm speaking for Gabby Dolphin. She couldn't make it tonight. And she writes, thank you. Council member matters for your referral. To update the city's Climate Action Plan over Earth Day weekend, I gathered 100 signatures in the space of 3 hours asking for AMP to let Alameda do more solar and a Change.org petition has'",
        "'speaker_4': 'gathered 197 signatures asking to have the same as we move forward. I encourage collaboration among council members, public utility board members and members and the citizens of Alameda to chart a bold new course for Alameda in mitigating climate change.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Ruth. Abby. And then she's our last speaker.'",
        "'speaker_8': 'I'm really happy with the Community Action for Sustainable Alameda and I wanted to rise in support of the council referral. I think that we have a really big opportunity here in Alameda not only to update our greenhouse gas emissions reduction plan, but also to set a course for sustainability, which includes a lot more than just greenhouse gas'",
        "'speaker_8': 'emissions reduction. But it includes revenues, jobs, industry, things that we want here that can be a win win. And there's no conflict between jobs and the environment in our and this new energy world. And we're really looking forward to the collaboration with the council, with the staff, with the community to chart our course for the next 20'",
        "'speaker_8': ', 50 years and will really recommend council move forward to ask staff to initiate a process. We're ready to support in any way we can, and I very much appreciate all your leadership on these issues over the years.'",
        "'speaker_0': 'Thank you. And Brody.'",
        "'speaker_4': 'Thank you, Madam Mayor. I also want to commend my colleague for bringing this to our attention. I could sit here and talk about it for 10 minutes, but I'm going to I just agree with everything he said when he made his original presentation.'",
        "'speaker_4': 'And I appreciate all the speakers who also provide a comment. So please don't confuse my brevity with the lack of compassion for this issue. But I am going to ask, though, make a motion that we move this item, maybe tweak it just a little bit to make sure that the comments that were made by the speakers are'",
        "'speaker_4': 'incorporated into whatever plan of action staff comes up with to implement this vice mayor.'",
        "'speaker_8': 'I want a second with a friendly amendment. I think we're really strapped in terms of staffing. And I while I appreciate Liam working on this and working with the various groups. One thing that I would like to have looked into is whether or not we could have a consultant come in to work on this, since we haven't'",
        "'speaker_8': 'done an update for for some time. Or if there is funding out there for for those sorts of consultants, the San Francisco Foundation had been offering funding previously. So if we could get an outside consultant to help kind of coordinate either a public workshop or hearing on this and working with the different groups, I think that that'",
        "'speaker_8': 'could be very helpful in terms of facilitating this and seeing this to fruition in a timely fashion and also looking into if we could work with. We have a number of different MPP and graduate schools in the area, a number of whom have folks who have a background in environmental issues, who are looking for theses projects to'",
        "'speaker_8': 'work on. And that could be something where we partner with one of these local schools to see if they have a student who has that background, who's interested in working with a consultant to actually put together a feasible report that the council could then look at sometime in the next year.'",
        "'speaker_8': 'So those are friendly amendments.'",
        "'speaker_4': 'I'll defer to the writer on the referral if that's acceptable.'",
        "'speaker_5': 'I don't care how it's done. This is this is this is one of those things. It should be. All right, staff up, because this is, as I mentioned before, is this is a document that mandates that staff does something.'",
        "'speaker_5': 'So the referral is a reminder. It's not I mean, whether it's voted on or not, staff still has to do it.'",
        "'speaker_8': 'No, I.'",
        "'speaker_5': 'So whatever by any means necessary, it's the city manager has to figure that out.'",
        "'speaker_9': 'Right. And we can look into that. And if we do an RFP or a contract or it will likely come back to council. But. Liam. And Liam has already like. Looked at a path forward. It is about a two year process to make sure that we first meet with all the stakeholders and all the different departments and'",
        "'speaker_9': 'do the analysis and the inventory track where how we buy data, how well we are meeting our old plan and then taking it, as many of the speakers said, a level or two higher and then figuring out what that greenhouse gas emission improvement will be over time.'",
        "'speaker_9': 'So. We will start on it. If it sounds like the council is headed in that direction and it will be a very expensive process and I think it's a good idea to look at both students and working with the community and hiring a consultant.'",
        "'speaker_8': 'And the other thing is, I think we should have some sort of you're saying it's a two year but potentially a two year process? I think a timeline setting out specific goals and dates would be helpful more than, you know, more than just the first time it will come back to council.'",
        "'speaker_8': 'But I think giving different milestones throughout that process to just make sure that we're keeping on task and on target.'",
        "'speaker_9': 'And we do have that draft already. And it would if it would start in May and the final adoption is planned, I think, for June 2019 or.'",
        "'speaker_0': 'And we're Ashcroft.'",
        "'speaker_3': 'Thank you, Mayor. So I my question was just and I adopt everything everyone else said, this is very important and we need to do it. So just looking at this city council referral tracker, is it fair to say that this would be quality of life slash environment category?'",
        "'speaker_9': 'Yes.'",
        "'speaker_3': 'And so with this, I mean, this seems pretty pressing. So could it come ahead of. Some of the others are wrapped in with it or you need to get more information and get back to us. City Manager Um.'",
        "'speaker_9': 'I think a lot of it is concurrent. I would, I would like to move. Keep moving forward on the night sky and dark sky and the heritage trees, which are scheduled for October and November. This would start before then, but.'",
        "'speaker_9': 'I think we have to work on them concurrently. I don't want to slow down some of the other things if. Unless the council wants to finish one before the other. But I think we can do it concurrently. And it's two different departments.'",
        "'speaker_9': 'And so from that perspective, they can work together and not and share sort of the workload.'",
        "'speaker_3': 'Okay. Well, I look forward to the next steps then. Okay. But yes, I'm fully supportive.'",
        "'speaker_9': 'So. So is this a medium or a high priority?'",
        "'speaker_0': 'I'd like to speak. Thank you. I have some concerns about the point that this supposedly the plan itself has a target date of 2020. So I'd like to know what staff has done today on making sure we're ready to meet the.'",
        "'speaker_0': 'Because I'm sure this process is not dependent upon a referral. This is something Steph's aware of. So I'd actually like to know because the way I would look at that should be what should be happening is that assume staff has been working on this and has a plan, and I'd like to hear that.'",
        "'speaker_4': 'Good evening, Madam Mayor. Members of the City Council. I'm Liam Garland with Public Works. Yes, staff has been, along with the community, moving forward a lot of initiatives consistent with the original Climate Action Plan. There was an update to council in 2013 which shared that there had been reductions in greenhouse gas emissions of about 8% below the'",
        "'speaker_4': '25 baseline and the 2020 goal is 25%. So. And let me clarify, this was a 2013 update to the City Council on the 2010 results. It's essentially looking at the emissions in 2010, doing the calculations and the modeling to come up with about that 8% reduction.'",
        "'speaker_4': 'The target for 2020 is a 25% reduction. So in one sense, you look at that 8% reduction, you say, oh, well, the plan was passed or adopted in 2008. You've already got about 8% reduction a couple of years later.'",
        "'speaker_4': 'That means you're trending in the right direction. On the other hand, that was in the midst of the Great Recession, where a lot of this is driven by transportation and you had vehicle miles traveled going down. So in that sense, the wind was at the city's back in terms of reducing those emissions.'",
        "'speaker_4': 'It's very likely that when we go through the process of trying to update those emissions, that are going to be much more difficult conversation about where to target resources, how, what actions to prioritize. And that's something that not just a conversation here, but is with community members who had just spoken.'",
        "'speaker_4': 'Does that make any sense?'",
        "'speaker_0': 'So that was 2013.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'So what's your next? What is your next step? What's going to happen?'",
        "'speaker_4': 'Well, what I'd propose is that we've got the the event in May is that that is a springboard for the community. CASA Public Works, Alameda Municipal Power, other city departments to reengage on what's been accomplished through the Climate Action Plan, what remains to be accomplished or what needs to be focused on next?'",
        "'speaker_4': 'There are some big questions potentially in that examination of was that original goal the right one? Other cities have looked at that and said, let's set a new and different goal. There might be other areas for activities that weren't even conceived of back in 2008, but might be areas we we invest in more heavily now.'",
        "'speaker_0': 'Okay. But so what is stuff? Suppose that stuff's planned. So that to me, this shouldn't require a referral. And I'm trying to figure out, did it require a referral? Has staff been working on this? Do the staff already have a plan?'",
        "'speaker_0': 'You can't apparently came to council in 2013. I wasn't on council then, so I don't know if back in 2013 then there was direction to come back in 2017 or what. But is was already the plan.'",
        "'speaker_4': 'What staff would propose. And this is after reaching out to base for use in transportation Alameda municipal power and obviously having an internal discussion and public works is that that we come back by this December so the end of the calendar year with essentially laying out a proposed scope for the update.'",
        "'speaker_4': 'And again, that's not that's not going to be an easy question if everything is on target. And, okay, that's an easy discussion, but that's not likely to be the discussion we're having in December. It's likely to be. Where do you want it's likely us seeking approval from the city council about what new policy initiatives you want, us'",
        "'speaker_4': 'working with Costa and the community to get more public input to then bring back to the council at a later date.'",
        "'speaker_0': 'They said the current plan by staff is. Doing something in May with those groups and then an update to council in December.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'All right. Council has everyone on board for that. And then in the meantime, if you can follow up with vice mayor suggestions, if you think that would be helpful to try to get a consultant, if we can get funding, things like that.'",
        "'speaker_0': 'And staff may already be working on that. Groups may already be working on that. I'm not sure. And then so and I just and I don't know if there's other policies that council that the city has that have things when you're supposed to be circling back.'",
        "'speaker_0': 'But I assume that staff keeps a timeline and handles that stuff.'",
        "'speaker_4': 'I do. I do want to note something which is in the next city council meeting, there's a referral on the straws on request ordinance. Yes. So that is an issue that might get folded into the Climate Action Plan update.'",
        "'speaker_4': 'So that that is where we might we might be moving forward on a couple items all within the same update.'",
        "'speaker_0': 'Okay. But I'm hoping that doesn't take two years. That's my referral. And there were people from the audience that suggested that. But I'm hoping that doesn't take two years to implement. So I appreciate that. All right. So I think you've been given feedback.'",
        "'speaker_0': 'Is everyone good on that? All right. Thank you very much. And we're going to.'",
        "'speaker_4': 'Are we going to vote.'",
        "'speaker_0': 'For the second? We need to love the motion. So. Okay.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Well, actually, I want to clarify because the was feedback from Leigh that may not actually be what your motion is, but do you want to repeat your motion?'",
        "'speaker_4': 'Was just move the staff to move the referral with consideration of the input from the community during the public comment. And then there was an addendum and then the controller met her. She said, I don't care how it gets done, I just want to get it done right.'",
        "'speaker_0': 'Okay. So I'd like clarification because staff gave us more information of planning to attend a workshop, start work with our partners, community partners in May, and then come back to council in December with an update. So I'd like to make the incorporate that information in the motion if possible.'",
        "'speaker_8': 'It was part of my part of my friendly amendment was to make sure that we have a timeline with dates laid out for each of the next steps. So I hope that that would be included. Liam's comment would be included in that December.'",
        "'speaker_8': 'We stick with that date of having feedback in December of 2017.'",
        "'speaker_4': 'And I was fine with the comments on the timing, too. I mean, the party has to be high because the ice is not going to stop melting. But, you know, we know it's a two year project, so the sooner we get started.'",
        "'speaker_4': 'So it may start before some of these, but it will most likely end after some of those. So.'"
    ],
    "Review and Update of City Council Rules of Order.": [
        "'speaker_0': 'Right. All those in favor. I motion carries unanimously. Thank you very much. And I really appreciate the community's efforts and staffs to continue this massive project and policy. All right. Next nine e.'",
        "'speaker_1': 'Consider reviewing and updating the rules of order for city council agendas and meetings. It was placed on the agenda of council member.'",
        "'speaker_5': 'Okay. As as with head to toe in a role. I want to finish this one quickly. Actually, this came to my mind after having gone through the two meetings that are referenced in the referral, the referral list request that we consider appointing a subcommittee of our members or tasking the Open Government Committee to review the rules of'",
        "'speaker_5': 'order. Of the city council. And the reason I think this is important is because we had a couple of meetings, the workshop on the 17th and then the meeting of March 7th, where there was confusion over. How people should be allowed to speak and what were what are basically what are the rules of addressing the council and'",
        "'speaker_5': 'even among the council themselves? And I received from the city clerk on request the resolutions that pertain to rules of order. And there are some very interesting items in these referrals. I mean, in these resolutions, including. For example, the power of the council to either allow speakers to address the council or anyone else other than the council'",
        "'speaker_5': 'to address the council during deliberations. That's a council decision according to one of these resolutions. There's also a three minute limit on council members in the deliberations. So it's there are some interesting things, and I think there's also interesting rules around.'",
        "'speaker_5': 'The limitations of a speaker to address the council and items four and eight. According to the way I read this, it could be read that they could speak on anything they want, including an item that's further agenda. I think it's good to review these and to see if they need to be updated, but just for public awareness'",
        "'speaker_5': '. Additionally, there seems to be a gap in and this comes up periodically when there's a very contentious issue is how the agenda is put together and who has responsibility for it. It's really not defined anywhere, clearly, either in the charter or in the rules of order.'",
        "'speaker_5': 'So I think those are important enough to do whether they're to this, I don't think this is a high priority. I definitely think we should have it looked at and I think a disinterest as I read reread my referral, which was written in March.'",
        "'speaker_5': 'I think it would be a good task for our Open Government Committee to do as a as a as a, I could say, disinterested party, but a party that's interested in making sure that government is is clear and understandable to to us as well as the public.'",
        "'speaker_0': 'Let's go next to Russia.'",
        "'speaker_3': 'I think you raised some good points. Council member matter. I, I would want the both the city attorney's office and the city clerk's office involved in. Any review because I want to make sure that we are I mean, at some point, it might be appropriate to have the Open Government Committee take a look at this.'",
        "'speaker_3': 'But I want to make sure that we are up to date on all the applicable laws and rules. And I think that the city attorney's office in the city clerk's office are a great place to start, unless they are the last stop before it comes back to us.'",
        "'speaker_3': 'But in any event, I do think I would want to hear.'",
        "'speaker_8': 'From.'",
        "'speaker_3': 'Both of those departments.'",
        "'speaker_5': 'Me too.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_4': 'I mean, again, I thank you for for doing this. I think this is something that's sorely needed for the reasons you mentioned Councilmember Meter, S.C. But also, I think, you know, the public seems to be more cognizant of the length of our meeting times and maybe the quality of our interactions, which with each other.'",
        "'speaker_4': 'So, I mean, I think if if we could find a way to improve that, I think that would that would be helpful. I mean, I think we all, myself included, we need to look in the mirror on a lot of those things.'",
        "'speaker_4': 'So and I wonder if maybe having a subcommittee of the council might be more fruitful than having the Sunshine Committee look at it. But I do agree with my other colleagues comments at the city clerk and city attorney should be involved and they don't seem to have a lot of things on this list.'",
        "'speaker_4': 'So I'd be I would be happy to, you know, participate with any one of the four of you on the subcommittee.'",
        "'speaker_3': 'I would be happy to participate with you. Councilmember Brody.'",
        "'speaker_0': 'My preference is to go to vice mayor.'",
        "'speaker_8': 'Sorry. You know, one thing I do want to be cognizant of. Why do you think it's important that we get updates if there's any other laws or potential conflicts? I would want to be cognizant to make sure that we're not trying to censor or, you know, kind of sway the Open Government Committee in terms of making a'",
        "'speaker_8': 'decision. So while I would like to hear from our city attorney and our city clerk on that process or if there's any potential conflicts or issues in conflicts, I just I think we just need to be very cognizant of that because we are talking about, you know, the public's ability to communicate with the council and also are'",
        "'speaker_8': 'making sure that we're as transparent as possible. Not that I think that our city attorney or city clerk would intentionally do either of those things. I just think we need to be cognizant in terms of how we set that up so that there isn't a perception of that.'",
        "'speaker_8': 'The other thing is, you know, there isn't really a limit for staff time in terms of presentations. And while I think it's really helpful to have the presentations that we get, some of them have been incredibly long, especially when we have very heavy agendas.'",
        "'speaker_8': 'And so I don't know if that's something else that can be considered or looked at in terms of are we really allocating the correct amount of time for the presentations? And is, you know, you know, have we been consistent when we say something is 30 minutes or 90 minutes?'",
        "'speaker_8': 'Have we really been hitting those marks with regards to different agenda items? Because I think part of it is also having the public be able to plan for when different items are going to be heard so that they can look at the agenda and make a time estimate for what time they think the item is going to'",
        "'speaker_8': 'actually be heard. But I think looking into this is a good idea.'",
        "'speaker_0': 'We're Ashcroft.'",
        "'speaker_3': 'Thank you, Mayor. So censorship was certainly nothing the farthest thing from my mind. I want to make sure that applicable laws are brought to bear. We have heard suggestions in the not too distant past about the Brown Act.'",
        "'speaker_3': 'Perhaps doesn't need to apply at city council meetings. And that's that's California law. So that's that's where I was going with that. I would like to piggyback on the vice mayor's comment about the length of staff reports. And I don't so much fault staff, but I think we could give it direction maybe through our city manager that'",
        "'speaker_3': 'obviously the council comes to the council meetings prepared. We read our materials we have through the Sunshine Ordinance, the requirement that packets go out 12 days in advance. So members of the public who are interested are going to get that material too.'",
        "'speaker_3': 'So nobody needs to be spoon fed. And on balance, I think the public and you're right, Mr. City, we've heard from the public that they don't like being out until one or two in the morning and actually either do we.'",
        "'speaker_3': 'And so that we could like tonight, I thought was an excellent example. We had the two Business Improvement Association presentations. They went quickly staff. I mean, council asked their questions. We had a little discussion and we voted and we should be able to do that every time.'",
        "'speaker_3': 'I think that's something to also be cognizant of. But and I would just reiterate that I would be happy to work with my colleague, council member OTI, if the council, whoever else. Yeah, I'd like to work with you.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_8': 'And I. While I appreciate my colleague's desire to have a subcommittee, I think my preference would be to have it go to the Open Government Committee just so that we have that kind of independent check and we can have have them have a hearing on it and get the public input.'",
        "'speaker_8': 'That's just that would be my preference.'",
        "'speaker_0': 'I appreciate the comments of my colleagues. I am not supportive of a subcommittee. I think that we have commissions and one of them is our open government and I think this is appropriately theirs to lead. And then it goes through them.'",
        "'speaker_0': 'They have meetings and then it comes to us eventually. So I would be supportive of going utilizing that commission. And and one issue that has come up is the order of items on the agenda, for instance, referrals. And I would entertain looking at the order and possibly moving them to the front.'",
        "'speaker_0': 'But looking at the order of the agenda items and, you know, I think that should be something that the Open Government Committee looks at first. So we have. Did someone want to make a motion of how they like to handle this?'",
        "'speaker_4': 'I wonder if and again, feel free to disagree. I mean, some of these items, you know, the Brown Act, the way the agenda is written, who gets to talk where? I mean, I think that was all I recall correctly, part of the Sunshine Ordinance.'",
        "'speaker_4': 'So that may be well within their purview. But I think the way that the council conducts meetings and the suggestion by Councilmember Ashcraft about, you know, staff presentation time, I mean, I do think. We as a council would benefit from some introspection on our own on how we could make our meetings move a little more effectively and'",
        "'speaker_4': 'more efficiently. So, I mean, maybe there's a way to split the baby and, you know, send some stuff to the to the Open Government Commission and maybe have a different a smaller subset of those items, you know, kind of talked about in council because ultimately, you know, the things that control our behavior I think are best generated'",
        "'speaker_4': 'from from ourselves. But that's just my thought.'",
        "'speaker_0': 'So I'd like to hear from staff. Sir, do you have any suggestions of how you think it should be handled?'",
        "'speaker_9': 'Well, from the staff perspective, we are already talking internally about how to streamline our staff reports and presentations and making that assumption, as Councilmember Ashcroft said about every council member will read the staff reports and the presentations, and it's a longer time than most other cities.'",
        "'speaker_9': 'So it will be. Shorter than, or at least we're working on making it shorter. But there are some very meaty things that require the transparency, like the budget coming up. The council asked for a special meeting on the budget.'",
        "'speaker_9': 'That will be detailed because even if you look at the numbers on the page, you're the story behind the numbers is two volumes to just put in writing and so that kind of stuff. I hope the Council will allow for a more detailed conversation as far as why, whether it goes to the Sunshine Committee or not.'",
        "'speaker_9': 'I think. Dividing that up since we have a new grandfather on the.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_3': 'I was going to say we were only giggling because that analogy about splitting the baby to a brand new grandfather.'",
        "'speaker_8': 'So.'",
        "'speaker_3': 'Granddaughter but.'",
        "'speaker_9': 'Tied up a task to have the subcommittee and.'",
        "'speaker_0': 'But I still want to support his subcommittee because I think that it's like, okay, who's going to want to be on it? If you want to have issues, come back to the council, then my preference would be to have it come to council the items and then we can all weigh in if because if we're really looking'",
        "'speaker_0': 'for it, say this to a member already, if we're really looking for a discussion of how we want to what we think is appropriate behavior, how we, you know, our input and I think it's appropriate to have that come so we could hear from all of us.'",
        "'speaker_4': 'I don't have to be on the committee. So I mean, I just volunteered, but. Go to the city manager's point. I mean, I appreciate that contribution, you know, to the staff side. And there is items like the, you know, the different rent things we had to go through in the budget.'",
        "'speaker_4': 'That will take a lot of detailed time. And I think the public and the council understands that. But, you know, there's there's a side that this council, I think, needs to take a look at. And, you know, you can't prescribe that.'",
        "'speaker_4': 'I don't think the Sunshine Committee can prescribe that. I don't think any of the staff members can prescribe it. And I think that has to come, you know, organically from us. And, you know, I'll step aside from volunteering if others want to do it.'",
        "'speaker_4': 'But, you know, I, I do think that it requires some in-depth analysis and introspection, you know, whoever the members of the committee are.'",
        "'speaker_0': 'So I'm actually supportive of the committee. I want the introspection of all of this, if that's what the concern is. So as mayor.'",
        "'speaker_8': 'So perhaps we could have some sort of report back about how our meetings have been, you know, how many meetings have gone past 11:00? How many items are, you know, running over in terms of the time estimates that, you know, efforts that are being made to kind of streamline different things if we could perhaps maybe agenda is'",
        "'speaker_8': 'that is something when we come back in September or something like that to hear and get feedback. That way, because I think there's people point to specific meetings anecdotally about will this happened at that meeting or I went to this one council meeting and this this happened, I think kind of just doing a quick review of what's'",
        "'speaker_8': 'gone on perhaps in the past year or so. And if, you know, if there were meetings that went over, what happened where we. Was it just a busy meeting with a lot of heavy topics that needed that level of transparency?'",
        "'speaker_8': 'I think perhaps, you know, having some review of of that might be helpful.'",
        "'speaker_0': 'I remember.'",
        "'speaker_3': 'When I was just going to suggest that since it was Councilmember Mattresses Council referral, perhaps he should have the last thing on the motion.'",
        "'speaker_2': 'He was going to be.'",
        "'speaker_0': 'Born after. But we're not the last thing.'",
        "'speaker_5': 'So I don't need to say. But I do want to say that I see no reason why we can't have a subcommittee and have the Open Government Committee both look at it because the subcommittee is on our time and.'",
        "'speaker_5': 'They're whoever it is, I don't need to do it. This perfectly capable of reporting back, just like the open government. And I do want to go Open Government Committee to look at it as well. So I'd say do both and and move on.'",
        "'speaker_4': 'I like that idea.'",
        "'speaker_0': 'And then my concern would be in regards to any staff time where it is in regards to the priority on this because I personally. So staff, how much time do you think this would take? Everything takes time and we have priorities for council.'",
        "'speaker_0': 'What's the priority on staff time? You want us?'",
        "'speaker_9': 'Well, the way I think the motion is, is or at least the proposed motion is not staff intensive because it has the subcommittee working on some of it and also the Open Government Committee working on it. I don't want to speak for the attorney's office or the clerk's office, but they I'm thinking that they will be resources'",
        "'speaker_9': 'through the Open Government Committee and respond as information is requested from that committee. So I don't think it's like the climate local climate action plan, intense work. It's more responsive to the committee, but.'",
        "'speaker_0': 'Well.'",
        "'speaker_6': 'I can just respond that the clerk and the city attorney's office both do staff the Open Government Commission.'",
        "'speaker_5': 'So, Madam Mayor, I would like to see this go forward in the timeframe that because like I prefaced before, this is not. High priority. I think the best thing that could happen between now and the time that the Open Government Committee gets to meet on this is that our subcommittee meets because it's on our time and that'",
        "'speaker_5': 'we all read these things because you'll find out some interesting stuff in here. For example, I think the council had to. We're deliberating on an open motion. Is there motion yet? I take that back. Okay. Well.'",
        "'speaker_4': 'Normally they're right. There's a three minute. There's a three minute. I mean.'",
        "'speaker_5': 'So I don't think that's the most important thing that can happen.'",
        "'speaker_4': 'I mean, in Oakland, they have a time limit that you're allowed as a council member for questions and deliberation. So that might be something we might want to think about.'",
        "'speaker_5': 'So I've said my say.'",
        "'speaker_3': 'You've made your motion.'",
        "'speaker_5': 'Oh, I'll move that we. I'm. Direct the council to appoint a subcommittee and ask the Open Government Committee to review the rules of order for government that are captured in these resolutions. And that the timing for the meeting of the Open Government Committee is scheduled within the workload of the city clerk and the city attorney.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'All those in favor I motion carries unanimously.'",
        "'speaker_4': 'Who's our committee.'",
        "'speaker_0': 'If you decide that at this time.'",
        "'speaker_4': 'Let's do we do that?'",
        "'speaker_0': 'So did you want to leave this?'",
        "'speaker_5': 'He wants to be on it. I don't I don't care to be on it. I heard two people volunteer.'",
        "'speaker_3': 'I'm still willing to work.'",
        "'speaker_4': 'With you or the mayor or anyone or not.'",
        "'speaker_3': 'Were you were you meeting one of.'",
        "'speaker_4': 'Well, you said that already. So sorry.'",
        "'speaker_0': 'Well, some I'm hearing. So. So I don't support this part of it. Member already a member Ashcraft.'",
        "'speaker_4': 'Is that okay with its final menu? Yeah. Okay, then.'",
        "'speaker_0': 'So. So I would actually propose that the vice mayor and I do this.'",
        "'speaker_3': 'But you're the one who objects to this process to begin with.'",
        "'speaker_0': 'Because so to me, it should. My preference would be that we always include the vice mayor and the mayor and something like this. And I've actually proposed that my preference is to include all council members. However, if we're going to limit the two of us, then I then my preference would be the vice mayor and myself.'",
        "'speaker_3': 'But just a point of clarification, Mayor. We can't. It wouldn't be a subcommittee because we would have a problem if there were more than two.'",
        "'speaker_0': 'I appreciate that. So my preference would be then that it's the vice mayor and myself that if we're going to have a subcommittee.'",
        "'speaker_4': 'Make a motion, I.'",
        "'speaker_5': 'Move. Council member owning. Council member.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Host I oppose. And Vice mayor is abstaining.'",
        "'speaker_6': 'The motion.'",
        "'speaker_0': 'Carries a311. Council communications.'"
    ]
}