{
    "Resolution to Call an Election on the Rent Stabilization Act and Ordinance 3148.": [
        "'speaker_3': 'increases applicable. To certain rental units and limitations on evictions and the payment of relocation assistance applicable to all rental units. And amending Section two Dash 23.4 concerning the duties of the Rent Moving Advisory Committee and suspending Article 14 of Chapter six in its entirety and consider authoring direct and possible rebuttal arguments.'",
        "'speaker_3': 'And I have a presentation if you think that I will be giving just a very brief presentation, because on July 19th, the City Council directed that this matter be brought back. Staff prepared the resolution that would need to be adopted to place the matter on the ballot.'",
        "'speaker_3': 'The resolution contains the ballot question, which is here before you on this slide, and that's limited to 75 words. And this meets that requirement. The two new provisions which were added as part of the matter being presented to the voters is that future amendment or repeal of the ordinance would be retained by the council.'",
        "'speaker_3': 'So although it's going to the voters for them to consider, it would still be able to be amended or repealed by the council action. And then there's another provision on conflicting law which states that if this measure and the renters initiative, which has already been placed on the ballot, both pass.'",
        "'speaker_3': 'If this one receives the higher number of votes, it would prevail and the other would be void. And then the last thing that we need to talk about tonight is if you are interested in authoring an argument and possible rebuttal arguments, because the resolution also allows for rebuttal arguments.'",
        "'speaker_3': 'And if you do that, the deadline is August 18th, which is ten days away, and then the rebuttals would be August 25th. And then just so you guys know and everybody knows, the city will be doing educational outreach similar to the Utility Modernization Act just to provide information to the public and keep them informed about the facts'",
        "'speaker_1': '. Of the.'",
        "'speaker_3': 'City.'",
        "'speaker_0': 'Thank you. Are there any comments from the city manager to add to the presentation?'",
        "'speaker_1': 'No. This is a policy question for the council. And what we're. What we did last time was to bring the option of putting it on the ballot before the council. And we didn't have the language back then. And so this is the language that staff has provided.'",
        "'speaker_0': 'Thank you. Are there any questions from the Council on this?'",
        "'speaker_4': 'Councilmember Desai A question for him is why is. In the ballot? There's possibilities of people putting signatures. Is it is it possible for. Should we also decide is it possible for five council members to be included as the signatures?'",
        "'speaker_3': 'Yes. If the council decides tonight to author the argument, you would want to do the same thing you did with the Utility Modernization Act, where you'd pick to a subcommittee of two to write it, and then all five council members can sign it.'",
        "'speaker_3': 'It's just only two can write it, or else you would have to write it in open session.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'But for clarification, that's. Oh, sorry.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'For clarification. That's just one possible right permutation there.'",
        "'speaker_3': 'Or you have a mix of council members and other people sign it.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'There's four options we'd have to decide among. Get to that point. Thank you.'",
        "'speaker_0': 'Question Council member Odie.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor. Quick question. I know this is in the staff report and on the agenda, but for the benefit of the public, I mean, can you recap what has changed vis a vis the landlord proposal since last time?'",
        "'speaker_6': 'Yes.'",
        "'speaker_3': 'So at the July 19th meeting, we were waiting to hear if the signatures would be found valid on the landlord initiative that had been circulated, and that in fact wasn't found sufficient. It was short and several hundred signatures, and therefore that petition did not qualify and will not go on the ballot.'",
        "'speaker_3': 'So this is the only item before you tonight.'",
        "'speaker_0': 'Mayor Spencer, any questions?'",
        "'speaker_1': 'I had a clarifying question when I looked at the ballot question. I think it's 68 words and I wasn't sure what stuff it counted. And we did receive an email question about modifying it. So I want to know how many words is in the mail now?'",
        "'speaker_1': 'Question Currently I head count.'",
        "'speaker_3': 'I can do a quick count. I'm sorry I had it. I think it was close to the limit, I believe. But let me do a quick here and I'll get back to that.'",
        "'speaker_1': 'Okay. Now it makes.'",
        "'speaker_0': 'Is that your only question, Madam Mayor?'",
        "'speaker_1': 'Yes. To my understanding, we can only have 75 words in regards to the audience's question of modifying it. We have to see whether within that, if we decide to go that path.'",
        "'speaker_0': 'So that. Clarify the under. I'm understanding the mayor say that there's two parts to her question. One is 75 words. Second is modifying the wording.'",
        "'speaker_3': 'Yes, it is limited to 75 words. And yes, potentially words could be changed.'",
        "'speaker_0': 'Okay. Great.'",
        "'speaker_5': 'And just for clarification, and the connection is a bit fuzzy, but I thought I heard the mayor say in response to the audience's question, it wasn't the audience's question. We got one email from one individual. I'm not sure that that forms the basis of changing a valid argument.'",
        "'speaker_5': 'But just for clarification, we're not talking there's an audience here, but and perhaps that gentleman is in the audience. But what the council received was one email.'",
        "'speaker_0': 'And there may be questions that come up from the audience as well. And if there are no more questions, I'd like to call the speakers. The first three speakers of I will outline their names Paulus Forman, Dorothy Freeman and Joseph Woodard.'",
        "'speaker_0': 'The clerk tells me that. Ms.. Freeman and Mr. Woodard are seated there. Time to Mr. Forman, is that correct? So the total time, Madam Clerk.'",
        "'speaker_3': 'We've been doing 6 minutes for anybody who gets time.'",
        "'speaker_2': 'It's not going to take that long. I just want to be under the law.'",
        "'speaker_0': 'Said Mr. Foreman.'",
        "'speaker_2': 'Thank you, Vice. Vice Mayor. Maharishi. Council members. City Manager. City Attorney. I came here on the 19th to speak on behalf of Alameda Citizens Task Force, who had written you a letter asking you to endorse putting the city ordinance, rent, rent ordinance on the ballot.'",
        "'speaker_2': 'At that point, we anticipated it was going to be as an amendment to the bylaws. I was as surprised as anybody to learn from the city manager and just sitting here on the 19th that the game had changed and that you now we're going to consider putting it on the ballot as an Ordinance four to confirm the'",
        "'speaker_2': 'ordinance. I was thrilled with that result because of the fact that it means that the ordinance can be amended by a simple majority of council. And in my mind, that is probably the very strongest or one of the very strongest arguments for this ordinance as opposed to the HRC initiative.'",
        "'speaker_2': 'This is a complicated matter. As I stated before, it needs to be constantly monitored and improved. You know how I stand on that, so I'm not going to say any more about it. However, when I got home the next day and slept on it, I began to get this haunting feeling of I've never heard of anything like'",
        "'speaker_2': 'this before, having an initiative for an ordinance that has already been adopted. And I started to obsess about it and Googled it because I don't have Lexus available to me and couldn't find anything in Google of anything like this ever being done.'",
        "'speaker_2': 'And then I emailed my friend Bob Seewald and said, Bob, what do you think about it? And he says, Well, I've been thinking the same thing. And of course, last night that little shoe dropped with the piece that he wrote in the in the Merry-Go-Round.'",
        "'speaker_2': 'When I first read it, I was extremely upset. And for a few minutes, maybe a few hours, I thought, maybe I need to come here today and urge you not to put this matter on the ballot. But then I started to think about the fact that even though Mr. Sewell's points may be very valid.'",
        "'speaker_2': 'That the there's a risk of litigation. What the the the issue he doesn't address is what is the. How significant a risk are we talking about? And when I started thinking about that and thinking about what he wrote, the most serious problem would be if both the ordnance and a RC one.'",
        "'speaker_2': 'And the ordinance got more votes than HRC because if that happened, I would expect the NRC people would argue, number one, the ordinance was illegal on the ballot. Or number two, that a a amendment of the bylaw. Trump's, if you'll pardon the word, a an ordinance, even if it gets less votes.'",
        "'speaker_2': 'Problem. But the next thing you have to consider, though, is what's the possibility of both of these winning? And I think that alamy the voters are very informed. I can't imagine any more than a very few voters would vote yes for both of these initiatives.'",
        "'speaker_2': 'Therefore, I see almost no risk of both winning. So I kind of discounted that. So the next risk, what if both lose? If both lose, then the plaintiffs, if anybody are going to be the landlords because they're going to argue, hey, they both lost.'",
        "'speaker_2': 'There's no rent control. Any longer in Alameda. We don't have to put our initiative out there. I think, number one, that's a weak argument because of the fact that the ordinance is already on the books and is not going to be repealed just because it loses this initiative.'",
        "'speaker_2': 'And so and finally, with regard to that argument, I think the landlords are probably pretty smart people. And if FARC has lost, they have dodged a bullet. Are they now going to jeopardize the less stringent? More amendable city ordinance and litigate the matter?'",
        "'speaker_2': 'I don't think so. So there again, I think they have a weak case. And I also think they might not even litigate. In fact, I would be surprised if they did. And then the third and by the way, I.'",
        "'speaker_2': 'Well, I don't have to get to that point. The last point for my final weighing of this is my original point last week. If both of these items are not on the ballot, the voters do not have a fair choice.'",
        "'speaker_2': 'They do not have an equal playing field. And when I look at it all, I say it's worth taking the risk of litigation. Anything you do has a risk of litigation. But again, when I look at the probability of actual litigation occurring, much less winning or losing it, I don't see much of a probability of that happening'",
        "'speaker_2': '. So I urge you to stick to your guns and put this on the ballot. And whatever wins, wins will we'll live with it. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Foreman. The next speaker, Eric Strimling.'",
        "'speaker_6': 'Good evening. And again, thank you for having us so early in the agenda. So, so many things to speak on. The legal concerns are very great. I brought that up last time, the strife, the two months of battling it out.'",
        "'speaker_6': 'Honestly, I have a lot of respect for people sitting across from me right now and I don't really want to fight you for next two months. I really don't. And I would prefer to come up with a way that you can be neutral in this fight and and let the ballot work.'",
        "'speaker_6': 'Not sure.'",
        "'speaker_5': 'What good.'",
        "'speaker_1': 'Is.'",
        "'speaker_6': 'But what I think I want to do is talk to you a little bit about the canvasing I did last night. Some of the people that I spoke to, we're going.'",
        "'speaker_2': 'Door to door. We're doing voter.'",
        "'speaker_6': 'Identification. We are trying to find out where people stand, what their stories are on rent control. Ah, I spoke to a young family of three who signed a lease. The rent is so high they're planning to live out that lease for the year and leave.'",
        "'speaker_6': 'Alameda spoke to two families who hadn't lived here for a year yet, so they hadn't had a rent increase, which was good. One was from San Francisco and said, What do you mean you don't have rent control? Didn't understand why why people would live that way.'",
        "'speaker_6': 'And I just would ask people say, oh, look at San Francisco. The rent control is terrible. They're. Talk to tenants in San Francisco and talk to residents of San Francisco. I have many friends in San Francisco. They are not of that opinion and they aren't people who lived there.'",
        "'speaker_6': 'When it originally passed, they moved in at a time they could afford the rent at that time and they got to stay there. I have many friends in Berkeley. Same story. Another thing that is talked about, I talked to a family that moved in in February.'",
        "'speaker_6': 'She said, yeah, we had to get the landlord to fix a lot of things. The kitchen counter was collapsing and and he finally did do it. You know, one of the things they say about rent control is that it causes the buildings to deteriorate.'",
        "'speaker_6': 'Well. The building department has red tagged several buildings this year. I mean, it's the properties are deteriorating with no rent control going on. It's not as a result of rent control if the building's deteriorating. It's the result of negligent landlords or negligent tenants.'",
        "'speaker_6': 'But it's not about the rent control, public health regulations, building department regulations. They deal with those issues. It's not about the rent control. In the final conversation on hitting a. Please avoid this battle. Please avoid the potential legal battles that will come after it.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Crumlin. Sister Pat Nagle.'",
        "'speaker_7': 'A thank you to the city council. I spent this afternoon. With many residents from the Bayview Apartments. You are once again facing. And no cause eviction. Many of them. My heart aches for them. And I assured them. That I would do all I can to address unjust systems.'",
        "'speaker_7': 'That's support. Such devastating. Results. Catholic social justice teaching. And I am Catholic. Teaches us. That housing. Is a basic. Fundamental right. For all people. Catholic social justice teaching also recognizes the rights to private property. And Catholic social justice teaching also says.'",
        "'speaker_7': 'That governments and communities have the obligation. To ensure and protect those rights. I fail to see. I'll placing an ordnance. Already passed on the ballot with incomplete information. Serves the community of Alameda. And most especially, how it serves those most in need of safe, secure and affordable housing.'",
        "'speaker_7': 'I am deeply saddened by the divisiveness that exists in this community, this one single community of Alameda. Since the issue of rent control has come up. We're not a community that stands together. And that stands together to ensure that the rights of all are protected.'",
        "'speaker_7': 'I'm not sure. How I can support you. Much longer. I want to. But I spoke today with the people who are effectively being forced into a no cost eviction. Basically you've agreed to it. By agreeing to set a limit.'",
        "'speaker_7': 'Of allowing 25% of all rentals. To be open for no cause eviction.'",
        "'speaker_0': 'If I could have you wrap up your.'",
        "'speaker_7': 'I'll wrap it up. Thank you, Mr. Speaker. I'll wrap it up when I am finished. As a person of faith, I do believe that someday justice will come. And it must come at the expense, not at the expense of the poor and vulnerable.'",
        "'speaker_7': 'But it must come because all of us have worked for justice in this city. Thank you.'",
        "'speaker_0': 'Thank you. So. Bill you. Bill Rowan. Followed by Beth Allen.'",
        "'speaker_2': 'A member of the audience just gave me a comment card. I'm just going to give it to. Well, as you've undoubtedly gathered by now, or you may be heard, art is, of course, taking the position that we do not want this placed on the ballot.'",
        "'speaker_2': 'And, of course, I'm not the only speaker who is going to be saying that. My obviously we have objections and of course that's been discussed over and over to the council, the ordinance that was passed. And you just heard one of the most significant objections because it allows landlords to evict 25% of the people in a building'",
        "'speaker_2': 'without regard to the size of the building. If the building is a hundred units, you can kick out 25. If the building is 20 units, you can kick out five. And there are many, many other flaws in the city ordinance.'",
        "'speaker_2': 'And I know the members of the council. I feel that this was a wonderful achievement that they passed, and obviously we disagree about that. But what I'm mainly concerned about tonight. Is the way that the ordnance is being placed on the ballot.'",
        "'speaker_2': 'And I disagree with Mr. Forman because I think that a lot of tenants well, let's put it this way, Art is going to go around and we are definitely going to advise voters to vote yes on our initiative and no on the city proposition, because that is the only way we can guarantee that both won't pass.'",
        "'speaker_2': 'And I really disagree with Mr. Foreman about that. I think a lot of tenants who may not understand what they're doing and I think there's going to be some are going to say, well, I like the ARC initiative.'",
        "'speaker_2': 'I also like the city initiative because they both help tenants. So I will vote for both. And then I think there's going to be a certain number of landlords and other people who are going to look at it and they're going to say, Well, I don't really like the city ordinance that much, but it's better than the'",
        "'speaker_2': 'ordinance. And guess what? The city ordinance ends up with more votes, even though both have a majority of the voters in the city. And I think that would be a very regrettable situation. So unfortunately, we are being forced to tell people to vote no on the city ordinance.'",
        "'speaker_2': 'And this is just really a regrettable situation. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Allen. Beth Allen.'",
        "'speaker_1': 'Thank you. First of all, I want to say that I don't support the city ordinance going on the ballot. This is my story that I'm presenting to you today. I'm a person with a chronic disability and I live on Social Security.'",
        "'speaker_1': 'I realize how important the Alameda Renters Coalition initiative is. In 2012, I became ill. And this illness has left me with chronic pain, exhaustion and a broken immune system. I lost the ability to take medications and could not return to work because of my illness.'",
        "'speaker_1': 'I manage my pain just through daily choices diet, acupuncture, massage and limited exercise. Even with a roommate and shared expenses, I end up choosing between food and my health. I make decisions each month and end up sacrificing something that will improve my health.'",
        "'speaker_1': 'With rising rents, I am juggling the risk of homelessness with managing a disability. This past year my SSI did not go up at all. When it does, it is usually 1 to 2%. If rent goes up five or more percent, then how do I compensate for the increase?'",
        "'speaker_1': 'My income stays the same. For these reasons, I proudly support the HRC charter amendment for the rent. For the rent to 65% of the CPI. And no cause evictions and create an elected rent board. I will fight for this initiative all the way to November 8th.'",
        "'speaker_1': 'Because this is personal, because I live in this town and I make my health sacrifices every single week between acupuncture and food or massage and food. So this is very personal for me. Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Allen. Monty Herring and I have a Lisa Vincent who's seated her time to Mr. Hain. So the total, Madam Clerk, is 6 minutes. Thank you.'",
        "'speaker_2': 'I should have 6 minutes. Someone say to 10 minutes. Okay. My name is Morning and I have lived in Alameda for 16 years. Tonight you will be voting to place the city's rent ordinance on the November ballot. But it's a modified version containing some last minute poison pill language.'",
        "'speaker_2': 'Tacked on at the end that enables a city attorney to sit at his or her desk and override the will of 8000 people who signed a petition for true renter protections. This legal maneuvering is a mockery of the democratic process.'",
        "'speaker_2': 'I object. I have heard some of your claim that the rent ordinance is better because it is more flexible and can be modified by the City Council to make improvements as needed. I submit that this very flexibility makes the ordinance vulnerable to political whims.'",
        "'speaker_2': 'This City Council has demonstrated a curious reluctance to modify this ordinance except on behalf of landlords, as in the case of the poison pill ordinance addendum I just mentioned. Six months after the fixed term lease loophole was called to your attention.'",
        "'speaker_2': 'You still have not taken action to close it. What good is flexibility if it is used only to benefit special interests? You claim that rent ordinance is better because of the rec? The Rent Review Advisory Committee citing it as an effective tool for mediating renter and landlord conflicts.'",
        "'speaker_2': 'I submit to you that the REC is ineffective because most renters fear landlord retaliation, that the REC is a biased forum because it is made up of political appointees. Would you like to have to seek justice before a tribunal of political appointees after you've been hit by a speeding car?'",
        "'speaker_2': 'The rack is obsolete. People see through the facade. To me, it seems like the city council is out of touch with the voters of Alameda. You live in a social bubble. You need to get out in the streets more and listen to people.'",
        "'speaker_2': 'April Squires and I spent two and a half hours yesterday afternoon canvasing voters at Alameda landing in front of Safeway. If our results are any indication of voter sentiment, backers of the rent ordinance are on the wrong side of a tsunami.'",
        "'speaker_2': 'The ratio was 40 to 3 in favor of the Coalition's measure. When Jim Sweeney was here a few weeks ago, the mayor allowed him to drone on and on, well past his allotted 3 minutes. Then city council members spoke at length, some mercifully, about Mr. Sweeney and the part planned in his name.'",
        "'speaker_2': 'Parks are important, but housing is more important. And timer evaporated, evaporated until high school students had to stage a demonstration to be heard so they could get home at a decent hour on a school night. These were the students from 470 Central who had lived under the traumatizing threat of eviction for over nine months.'",
        "'speaker_2': 'Think about what that has been like, worrying about where are you going to go to school and losing all your friends. Reading the worry on your parent's faces. The silence where there used to be warmth and joy. And this wasn't the first time there was a destructive pattern here.'",
        "'speaker_2': 'What do you think it does to children to know their government simply doesn't care about them? I submit that all this angst adds up in a child, that you're doing permanent damage to children and their sense of possibility and life.'",
        "'speaker_2': 'And there's no prosthetic or an amputated spirit. I think they think you can do better than this. More than a couple of you on this dais are attorneys. I hope you will ponder for a moment a number of landlords, property managers, developers and realtors on your client lists and recuse yourselves, where appropriate, from voting to put the'",
        "'speaker_2': 'rent ordinance on the ballot. It will only confuse voters. And besides, some pretty smart lawyers are saying your proposal is an invitation for a string of expensive lawsuits. Thank you.'",
        "'speaker_8': 'Back to Mr. Hain.'",
        "'speaker_0': 'Catherine Pauling. And this was the last speaker slip I have. Please submit. If there's anyone who would like to speak tonight, now's your chance to submit your speaker slips.'",
        "'speaker_1': 'Hi. I'm only going to speak a short time to I think many of us feel a certain amount of despair because of the disconnect that exists with the council and with most of us in the city, quite frankly.'",
        "'speaker_1': 'And I do want to maybe add one explanation when Sister Pat said the incomplete information on the ballot, I think she's correct. This was my first time seeing the argument that is going to be put on there. And you basically are saying, well, it provides some rent stabilization.'",
        "'speaker_1': 'It provides some rent, some eviction protection, it provides some of this. And you don't at all mention that you are allowing no fault evictions, no cause evictions. This is huge. And it's a huge difference that responsible tenants, responsible families, retired people, veterans, the people of our city, of our community can be thrown out with 60 day notice'",
        "'speaker_1': '. And it's disingenuous to put it on there as if somehow it's some of this and some of that. And it looks just like what the same city attorney wrote with our name. You have the nice fuzzy name and we have the harsh rent control rent board costing money.'",
        "'speaker_1': 'And you don't even mention for cause evictions, which are the only way that we would allow evictions. And so it slighted it. Absolutely. Putting an existing ordinance on the ballot. And you say just to confirm, but if people vote against it, I my question is, does the ordinance remain?'",
        "'speaker_1': 'In other words, what if we don't pass but people vote against yours? Does that mean there is no city ordinance? And I can't imagine why that's true. If that's true, why is it on there? Except to confuse and split the vote?'",
        "'speaker_1': 'California Apartment Association, the political director, has sat here the last several regular meetings, didn't have to speak, sent out a letter because we always get copies of them. It's a broad circulation about how pleased he was with what the city council was doing.'",
        "'speaker_1': 'He hasn't needed to come up here and I don't think it's intentional. I think what you tried to do was to kind of do the half loaf, bake a half loaf, kind of do something out there, but not quite.'",
        "'speaker_1': 'But in fact, you're doing their work for them. This is the strategy they did in Richmond. This is the strategy they are pushing in Mountain View and Burlingame. And that's to put a second ballot measure, put on a similar ballot measure that confuses people and splits the vote.'",
        "'speaker_1': 'And I'm sorry, but those 75 general soft words that really don't tell what's going on will specifically do that. It will cause confusion. It does not tell people what the difference are. Thank you.'",
        "'speaker_8': 'Thank you, Miss Collins.'",
        "'speaker_0': 'Our last speaker is Mary Paris Ruiz.'",
        "'speaker_1': 'Thank you. My name is Mary Berry Reese, and I'm a I've been a resident of Alameda for over, I don't know, 15 to 17 years. I was not intending of coming today. But this is very personal to me.'",
        "'speaker_1': 'I, I work in the city of Alameda with working with shelter homes, working with Alameda Point Collaborative. And I, I believe that what we're facing right now is just more than than. Rent control. The housing crisis in Alameda itself is bigger than what we have.'",
        "'speaker_1': 'And I honestly believe that what we are trying to what you're trying to do right now is to create a bigger crisis of what it is, because right now you have a community where you have in the west end of Alameda, families who have been formerly homeless, who are in extreme poverty.'",
        "'speaker_1': 'And then you have in the other side of the immediate families that are. More affluent and the middle class people like myself and those who are in attendance, we are caught in the middle. I have two jobs. I'll be starting this week working in JCPenney's.'",
        "'speaker_1': 'I'm a professional. I'm a I have a master's degree, and I had to take a second job to pay my rent. I shouldn't have to. I did everything right. You know, when a school got a degree and I.'",
        "'speaker_1': 'But what is going on right now is to me is very painful to see because I purposely chose to live in Alameda for a number of different reasons. But one of them, it was the community. If I was out on a business trip, my neighbors would come in and water my plans and walk my dogs.'",
        "'speaker_1': 'And I was willing to pay a little bit extra for that. You know, but it comes to a point where I have to decide whether to take a second job or possibly a third job to be able to afford the same unit that I came in.'",
        "'speaker_1': 'I got a print out just the other day from my property manager would indicate that I have in the last ten years have paid over $200,000 in rent. And my light bulb broke in the kitchen and I was asked to pay it.'",
        "'speaker_1': 'They will not replace it for me. I have to buy one and they'll come in and install it for me. So I should be looking into what is what what we want this community to be and who we want the residents to be.'",
        "'speaker_1': 'And as I look at what's going on in Alameda Point and we have we have, you know, companies coming in and investing and we have a vision of what we want to do with that. And I just honestly feel that there's plenty of revenue that is going to come to support any cost that could that could that'",
        "'speaker_1': 'could be accrued by the expense of having a body that can manage, you know, and and help engage the conversation with the property managers, with the landlords. I understand I'm a businesswoman. I understand the importance to having them around.'",
        "'speaker_1': 'There's there's a value to the to the to to them. But I also think that by we're losing track of what made, what has made Mm. Such a beautiful place, you know. Anyhow, I just want to thank you for your time and I hope that we can move forward in a positive way where Alameda is for all'",
        "'speaker_1': 'of us, not just for a few. Thank you, Mr. Rees.'",
        "'speaker_0': 'That was our last speaker. So I'd like to open the discussion up to the Council. Like to kick it off. That's my road.'",
        "'speaker_6': 'Okay. I guess I'll go first. Thank you, everyone, for coming out. Talked to a lot of people over the past few days about this issue and I recall being a proponent of putting our measure on the ballot. I still am very proud of what we did.'",
        "'speaker_6': 'I'm proud of our measure. I think we've we've moved the ball. We put in some strong tenant protections. I wrote about it in the paper. So if you want to hear that again, you can read the paper. I'm not going to repeat all that given.'",
        "'speaker_6': 'I do have some concern about putting this on the ballot. I mean, given that I think we did such a good job, you know, the argument shouldn't be whether we did nothing or whether we did something because we did something.'",
        "'speaker_6': 'And I'm glad that that kind of tenor changed today. If you think it wasn't enough, then okay, go ahead. Make that argument to the voters. But if yours loses, ARX loses and then ours loses, then I'm left to wonder.'",
        "'speaker_6': 'I mean, where what moral high ground is the city have to defend our ordinance anymore? Because a majority of the voters basically said no. I think it was Monti maybe who made that made that comment. You know, let's try to remember how we got here.'",
        "'speaker_6': 'You know, I sat in that back room with many tenants a long time ago and people from Berkeley, and they basically said, you know, we want this, we want this Santa monica, Berkeley style rent control. And we don't want anything different.'",
        "'speaker_6': 'No movement, no budging, no negotiation. Now, a few weeks later, I sat in the other room with a bunch of landlords that basically said, We don't want anything. We don't want any rent control. CAA basically said, We want you to keep everything the same.'",
        "'speaker_6': 'No option A, no option B, no option C, no a hybrid between A and B, you know, blah, blah, blah. So I mean, I get that being an attorney, you know, if you think you you have the leverage, you know, you don't want to compromise.'",
        "'speaker_6': 'So now we're here. Now we have a battle between side A and side B and at some point I feel like Mercutio, you know, a plague on both your houses. I mean, in Oakland, the tenants and landlords and the council got together and everyone put together an ordinance which, by the way, has some components of the council's'",
        "'speaker_6': 'ordinance. So it can't be that bad for tenant protections. And they put they came together. We didn't do that. So I say to myself, I wonder, is this really my fight? I mean, is this really our fight as a city council?'",
        "'speaker_6': 'We did what we were supposed to do. Two sides on the extreme refused to compromise. We were the grown ups in the room. We came up with a compromise that moved the ball forward and did a lot towards tenant protections.'",
        "'speaker_6': 'So I'm wondering, is this really our fight? You know, maybe this is a fight between ARC and the CAA. I mean, they were the two opposite sides. And I'm not saying one is wrong, one is right, but I'm saying maybe it's not the city council's fight.'",
        "'speaker_6': 'In my view, I think that our fight is the Yuma. I mean, that's the most critical item on the ballot, in my opinion. And I think as a council we should be devoting our energy as a city staff, we should be devoting our energy and our time to getting the U.N. passed and not weighing into this fight'",
        "'speaker_6': 'that is really between, you know, ARC and the CAA. So at this point, I will be voting that place, the city's ordinance on the ballot.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_5': 'I want to thank everyone for coming out tonight and speaking and all the people I've met with outside of this room. And by the way, I have been out on the street and I have been walking and talking and meeting with many of you in this room and many others.'",
        "'speaker_5': 'I just want to address a couple of comments that caught me by surprise because of the strength of the tone. Sister, while I appreciated the principles on which you spoke and I'm a huge fan of Pope Francis. I also want to recognize that Alameda is a very diverse community, and many of us come from other ethnic backgrounds'",
        "'speaker_5': 'and other faith groups. And so I certainly don't want anyone left with the impression that one group or the other occupies the moral high ground. And I would say that everyone on this council has searched their soul long and hard going into this.'",
        "'speaker_5': 'And so while you may not like everything we did, we were the ones who got the ball rolling. We tried to reach out. We tried to get landlords and tenants to meet with us to see what we could all work together in an ordinance.'",
        "'speaker_5': 'Many of the provisions that are in the charter amendment explained, for example, the unintended consequences of something like having an extra premium for relocation assistance for vulnerable citizens who are the elderly. 62 and over have a disability. Very eloquent speaker this evening or have children in the household 18 years and younger.'",
        "'speaker_5': 'The reason and this comes from the executive director of our housing authority is the unintended consequences is that landlords don't want to rent to those categories. Better to have relocation expenses that are fair across the board. Rather than single out categories.'",
        "'speaker_5': 'But that's something that in our ordinance, we at least have the flexibility. A lot of thought went into that. There's a number of of items in our ordinance where we differ. But remember, this council was the one that addressed this.'",
        "'speaker_5': 'So I'm taken aback. And I know you're right that the dialog has gotten heated, but, you know, please don't accuse us of having done nothing. We did something. It wasn't to everyone's liking. But and the other thing is about the CAA.'",
        "'speaker_5': 'Yes. I've been contacted by members of the CAA. And you know what I told them and I told them this even before the petitions were counted, I said Grassroots efforts will trump the big money every time I've been involved in a couple of them over my years of political involvement in this city.'",
        "'speaker_5': 'So but at the end of the day, we also on the council had to look at all sides. We are looking at what is good for the city in terms of being able to maintain a budget, to cover services like the building department, like code enforcement that goes out and finds these homes that need to be red'",
        "'speaker_5': 'tagged and need and repairs done. So we don't want to bankrupt our city, but we can get into the details. I feel as strongly today as I ever did about the ordinance our council put together, and I will support it and I will go out and speak.'",
        "'speaker_5': 'I thought Councilmember Odie did a nice job in his opinion piece in the paper. I have no concerns with the flexibility of a charter amendment versus an ordinance, but I also realize that this is a long ballot that we're going into.'",
        "'speaker_5': 'A week ago, a little over a week ago, League of California Cities East Bay Division met, Councilmember De Saag attended, I attended. City Manager Joe Carmack attended a political consultant for the league, was there speaking to us about only some of the 17.'",
        "'speaker_5': 'That was 17 state measures that are on the ballot this time. And that's after, you know, the presidential party and, you know, everything on down. And then we have county measures that will be on the ballot. And by the way, there's a very important one that you all need to get before, and that's the county affordable housing'",
        "'speaker_5': 'bond, because if as at least one speaker mentioned in this room, it's also a matter of supply and demand. And we've been harping on that. I will arrange a presentation and ask for this council to endorse that measure.'",
        "'speaker_5': 'We are not looking the other way. We realize that it's a matter of looking at a lot of different solutions because there is no one cause of of the problems that we're facing. But given that it is a long ballot and given and let me just ask for clarification here, maybe from the city clerk in the presentation'",
        "'speaker_5': 'that you did, there was the point. It said the city will do educational material outreach similar to the Utility Modernization Act. Are we able to do that even, you know, just to educate the electorate about our ordinance?'",
        "'speaker_3': 'Yes. And the attorney can back me up. Just to educate?'",
        "'speaker_5': 'Yes.'",
        "'speaker_3': 'Just to present facts and educate. We're not advocating for a position. We were just putting out education.'",
        "'speaker_5': 'What's out there? Because I do want the voters to understand and the voters will decide. And I have huge respect for the voting process that there is a law out there that exists. It is a flexible law. And I've already reached out to a number of you and said if you're and I mean a number of you'",
        "'speaker_5': 'renters and said if your measure doesn't doesn't get the requisite number of votes, I am ready today to sit down and talk about what we could do better. I already have my own list, but I'll compare mine with yours.'",
        "'speaker_5': 'But anyway, at this point, I am interested to hear what the rest of the council says. But I feel that we can support our ordinance, that it is a winner for a number of reasons that doesn't necessarily have to go on the ballot.'",
        "'speaker_5': 'But I want to hear my colleagues speak as well. Thank you.'",
        "'speaker_0': 'Council member de SA.'",
        "'speaker_4': 'Well, thank you very much. Thank you very much for everybody coming out on this Monday night to talk about an issue that will indeed be one of historical significance for the or the city of Alameda. Indeed, we are right now in the midst of a regional and local rent crisis of many months.'",
        "'speaker_4': 'So the question tonight is basically this what role must government play in stopping the excessive rent increases? Because that's the crux of the matter. Stopping excessive rent increases. Alameda. Voters are discerning, intelligent and not easily confused persons. Whether they're homeowners or renters, whether they live on the East End or inside.'",
        "'speaker_4': 'And I think that whatever decision that we make tonight, we have to honor that. We have to pay tribute to that. Is this our fight? Yes. I do think that this is our fight. But the reality is this.'",
        "'speaker_4': 'Judging by how well-organized the coalition is, the reality is that we're going to it's going to be really, really difficult trying to eke out a victory for our measure should we put our ordinance onto the ballot? It will be a real uphill battle.'",
        "'speaker_4': 'But I believe that even if it is a losing cause, I do believe that this is the fight that we must join. And I feel that way because. What I see in our ordinance is. The Alameda way of dealing with.'",
        "'speaker_4': 'Seemingly intractable issues the in a way that I've known since I first came here in 1974. And that way is about working things out, about dealing with matters on a case by case basis and letting the proponents and opponents figure things out.'",
        "'speaker_4': 'And when I look at the rent review advisory board and the way in which we strengthened it with the March ordinance. I really see that reflecting Alameda way of dealing with seemingly intractable issues. I'm really concerned about the.'",
        "'speaker_4': 'Yeah. Renner initiative. I see so much of it really reflecting more Berkeley or more Santa monica in my understanding is that that's that's where a lot of the initiative came from. Right. So I think I do think that in promoting our ordinance and placing it on the ballot, it's important that we do that because it reflects the'",
        "'speaker_4': 'Alameda way of dealing with intractable issues. And it also is demonstrated to be an effective way of dealing with the excessive rent increases. Since the adoption in March, there's been almost 40 cases or so. And many, many of those cases have come to through the mediation process have been settled.'",
        "'speaker_4': 'Now I'll be the first one to admit, you know, the settlement, I think, has been on average about 8%. I'd be the first one to admit that at 8% is much higher than 1.7%. But I'll tell you what.'",
        "'speaker_4': 'We stop that 20%, 30%, 40% rent increases. We stopped the $500 rent increases with the mediation process. And I think this is something that we need to tout the rest of the residents. I'll be the first to admit, you know, seeing how well organized you guys are and seeing how, you know, the energy with which you bring'",
        "'speaker_4': 'that your passion to adopt, you know, the the Berkeley style rent control. I'll be the first to admit that, you know, in pushing our ordinance. I'll admit this may be a losing battle, but I tell you what, I think it's worth the fight because I do think it represents the Alameda way of doing things.'",
        "'speaker_0': 'Thank you, Mr. De Saag. In my opinion, I think the best community discussion that we can have is to have both items on on the ballot. There's a lot of degrees of understanding those of us who live within the bubble and who've lived this issue for the last, oh, two years, understand it and understand the ins and'",
        "'speaker_0': 'outs. And even though that ordinance has only been in effect since March, it's still not fully known. However, I think it's very important for the electorate to be exposed to two campaigns campaigns that point out the strengths and weaknesses of of the ordinance and or the initiative.'",
        "'speaker_0': 'An informed vote is better than a vote of frustration, and I think this is the best way to do it. And it is only to two ordinances and whatever. Whether this ordinance is on the ballot or not, there are still going to be 17 state measures on in front of us.'",
        "'speaker_0': 'So I think the the long ballot argument I don't buy. It's people pay attention and I mean what's in the Alameda voter pamphlet and I think it'll give us a good chance to have a discussion. And I look forward to talking to people.'",
        "'speaker_0': 'I've talked to a lot of you. I've talked to a lot of my neighbors and my constituents about this, and I look forward to speaking with them on the specifics and having the debate. And I think it can be civil at the tone tonight with civil at the tone in the last few meetings has been very civil'",
        "'speaker_0': '. And this is what democracy should be about. And I look forward to it. Madame Mayor.'",
        "'speaker_1': 'Thank you. I. In my humble opinion, this ordinance was the hard work of council listening carefully to the community. There were many compromises from council members along the way to come up with this. I don't think it is reflective of what any of us started with, and to me it is actually a very reasonable solution to a'",
        "'speaker_1': 'very serious problem. And I personally agree with the vice mayor his comments that in order to actually have a full discussion of what the tenants or a proposed ordinance as well as councils in the state, it is best to have it both on the ballot.'",
        "'speaker_0': 'Do I hear emotion? I.'",
        "'speaker_1': 'Or I'd like more discussion.'",
        "'speaker_5': 'Please.'",
        "'speaker_0': 'By the way.'",
        "'speaker_5': 'Explain city attorney, if you would, how the how the rest of what we have to do works, because there's the question of whether or not to put the measure on the ballot. But there's also the question of who would author the direct and possibly the rebuttal argument.'",
        "'speaker_1': 'Yes. So that's what we're we're asking you to do. Should you choose to put the measure on the ballot, you would have to approve the resolution and then decision would have to be made as to whether or not the council wants to draft an argument simply for the measure, and because there is not time to come back'",
        "'speaker_1': 'again to an open public session, we would we would suggest the council appoint a committee of two, which is what you did for the Utility Modernization Act, and they would do it.'",
        "'speaker_5': 'So my problem, I'm just listening to the comments. I think I can see where the votes are are headed. Meaning no disrespect, but vice mayor matter. S.E., you, of course, voted against the ordinance to begin with. So, you know, had you had your choice, we would have just gone with the rack.'",
        "'speaker_5': 'So. Well, yeah. I mean just.'",
        "'speaker_0': 'That's let me respond to that. Had in my head had I had my choice, I would have. And I said this multiple times as I would have liked to have seen that the relocation fees be subject to mediation because I believe strongly in mediation.'",
        "'speaker_0': 'It works. I was supportive of the other measures that were in, but I think that was a serious flaw that we applied one standard, whether you needed it or not, to the back end of the process. And I repeated this many times.'",
        "'speaker_0': 'I don't plan on offering myself as part of a committee to write a arguments in favor. That's and if this measure is defeated by a vote of the people, our ordinance goes down and the ordinance goes down. I see that as an opportunity to open up the discussion and modify.'",
        "'speaker_0': 'So that's that's where I stand. And I would suggest that tonight, if we take the question of whether it should be on the ballot first as a as one motion and then deal with the motion and the discussion about whether the council offers an argument and a rebuttal with the second motion or a second set of discussions'",
        "'speaker_5': '. And just to follow on your response, the the beauty of an ordinance is it has the flexibility to add other provisions. But. Okay, so then. If let's suppose the vote is a 3 to 2 vote. Is it only the voters?'",
        "'speaker_5': 'Only the members of the council? Who or can it be it? It could be an oak.'",
        "'speaker_4': 'Or the Marriott.'",
        "'speaker_1': 'I I'd like to make a comment.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_1': 'Thank you. In regards to the ballot question, I had some proposed changes and a few I didn't understand both there if you wanted to as part of the motion, the ballot question.'",
        "'speaker_0': 'So go ahead.'",
        "'speaker_3': 'City Clerk The adoption of the resolution includes the ballot question. Therefore, if you adopt the resolution, you'd be approving the language of the ballot question, which I did do the count and is 73 words.'",
        "'speaker_1': 'The 73 words correct. So in regards to the ballot question, some changes, I was going to suggest this at the beginning. Shall the voters adopt the city council's march, ferret out the word council there? Just because I think that I'm not sure people will understand it, I'd like to be able to describe it as city council.'",
        "'speaker_1': 'Another part that I thought we could consider changing would be on BEE requires mediation review, possibly add the word review there. I'm not sure that that's necessary, but because really mediation on C in regards to the title that says restricts reasons for evictions.'",
        "'speaker_1': 'I'm concerned about that language. I would prefer language that says limits and conditions, evictions. So that doesn't change the number of words. But to me it's more forthright about what the council is proposing. Limits and conditions. Evictions. And then.'",
        "'speaker_1': 'Also on the it says. Okay. Including binding decisions for rent increases above 5%. So that might also make it more clear. But it is and I don't know where the council members are in any of those suggestions, but those were ideas I had.'",
        "'speaker_0': 'Matt Ashcraft.'",
        "'speaker_5': 'I'm not sure I can even follow that. The.'",
        "'speaker_0': 'So if I could repeat what I thought was said, one is that it adds the word council. After City salts. The City Council adopted by the City Council. Correct.'",
        "'speaker_1': 'Correct. City Council's apostrophe S.'",
        "'speaker_0': 'And then the second requires review, not mediation of all residential rent increases above 5%. Is that correct?'",
        "'speaker_1': 'A French. Mediation review for the word review. I'm not sure that's necessary. May be redundant. Same on the second part of that phrase, including binding decisions on rate increases above 5%. If you want to clarify that.'",
        "'speaker_0': 'Well, unless there's some wording we're not here, I don't think we have the capability of reconstructing the whole thing. But I think and then and then the other one was limit and condition. Reasons for evictions.'",
        "'speaker_1': 'See on TV evictions, it says, restrict reasons for evictions. I think limits and conditions evictions appear more clear in regards to what we're really doing.'",
        "'speaker_0': 'So going down the list, how does everybody feel about adding council to its as adopt the cities right now adopt the city council's March 31st. Mr. de Song.'",
        "'speaker_4': 'Madam City Clerk. The inclusion of the word council actually doesn't represent a new number, right? Because City Council is still one word.'",
        "'speaker_0': 'Those everybody agreeable to that one.'",
        "'speaker_6': 'Well, I'm not voting for it. So not agreeable to anything.'",
        "'speaker_5': 'Yeah, I remember Ashraf. I'm looking at the city attorney. Were you going to add?'",
        "'speaker_1': 'Well, the only thing I would say about that is it is city councils. It's the city council adopted it, but it is the city's ordinance that's in the Alameda Municipal Code. But I don't mean to be argumentative. It's up to the Council.'",
        "'speaker_0': 'Mr. Desai.'",
        "'speaker_4': 'Well, what I would definitely defer to is the city attorneys or city managers. Observations on these are largely because I have to believe that whatever wording that we chose, it was. Tightly wound. So, you know, I. So there.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'I agree.'",
        "'speaker_0': 'Not not hearing a majority. I suggest that we now consider a motion on whether to put the words as written on the on the ballot for the direction that we gave staff. We have a motion.'",
        "'speaker_4': 'As some.'",
        "'speaker_0': 'Moved by Councilmember de SOG.'",
        "'speaker_5': 'A motion to put the measure on.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'As written? Yes. I was at a second, Madam Mayor.'",
        "'speaker_1': 'I'll second it.'",
        "'speaker_0': 'Okay. It's been moved and seconded. Oh, I'd like to have a roll call per the clerk's instruction.'",
        "'speaker_3': 'Thank you. Council Member States?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'As the Ashcraft?'",
        "'speaker_5': 'No.'",
        "'speaker_3': 'Matter? Yes. No. Mayor Spencer.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Carries three.'",
        "'speaker_0': 'Motion. Carries 3 to 2. On the second question of offering a argument for or against.'",
        "'speaker_1': 'They would be interested in offering arguments, and I would like to be part of that.'",
        "'speaker_5': 'All right. And I'm going to if you'd call on me.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_5': 'I'm going to strongly object to the mayors having any part in the drafting for a couple of reasons. I saw the opposition. You wrote to the renter's measure and. Excuse me. To the. To the.'",
        "'speaker_1': 'Well, we go.'",
        "'speaker_5': 'To.'",
        "'speaker_1': 'The TV.'",
        "'speaker_5': 'BOTH Yeah. Yeah. No, I have seen the draft. Yes, I will. Sure, sure. We can start at the top. You have authored a measure in opposition against your own councils. Act, the Utility Modernization Act, but that's another topic for another day.'",
        "'speaker_5': 'But that certainly gives me pause and having you involved in this one. And I did see the opposition that you authored to the the ranchers ballot measure. And the reasoning was. Substandard. The writing was poor. And and I think it's time for other people to step up to that task.'",
        "'speaker_1': 'With all due respect, I think it is appropriate because I've been very you know, I've been part of this process from the beginning. I am the mayor and this is council's work. So I would like to be part of it.'",
        "'speaker_1': 'I don't know if there's anyone else that would be interested in that. In writing it.'",
        "'speaker_0': 'Mr. Dysart.'",
        "'speaker_4': 'The real since I have already been involved in the UML and I have joined in with members of the residents in raising concerns by a ballot response to the Renner initiative. I. I'm not I'm happy to get involved, but I don't have to get involved.'",
        "'speaker_4': 'That what I'm getting at. I would like to say I would like to sign it, though. As a council member, I have confidence that whoever writes it and offers it in conjunction with staff will write something that is.'",
        "'speaker_4': 'Persuasive.'",
        "'speaker_0': 'Mr. Modi.'",
        "'speaker_6': 'Thank you, Mr. Vice Mayor. I do think there's some value in having a different set of authors. Author This one than. Author The opposition to the The Ark Ordinance. It's up to two. Right. So it could just be one.'",
        "'speaker_6': 'I think we could just say ask, have you write it?'",
        "'speaker_5': 'Or it could be the two of us. And the point being, I would like the opportunity to highlight the strength of our ordinance as opposed to attacking anyone. But if I would be willing if Mr. O'Reilly would be willing to do with me and I will say I do appreciate my colleagues, council member de SAC and vice'",
        "'speaker_5': 'mayor matter. He did a very nice job and the the humor. Arguments and with the help of city attorney. Okay. But still you did. And but so a couple of us haven't stepped up to the plate.'",
        "'speaker_0': 'And I'd like to mention also that the process that we went through wasn't Councilmember de Song and I. Who wrote it. We sat in there, put good ideas down, and they were formed by with the help of city staff.'",
        "'speaker_0': 'And I see this is the same way. And I think if I'm not mistaken, the opposition to the Uma that the mayor. Right. You can correct me if I'm wrong. You wrote it yourself.'",
        "'speaker_1': 'Yeah. Mission to the enemy.'",
        "'speaker_0': 'Yes. Without city staff and.'",
        "'speaker_5': 'We probably.'",
        "'speaker_1': 'Without staff. Correct? Without staff.'",
        "'speaker_0': 'And I think that this is a process. If we're going to follow this, it's either question, we're going to follow the same process or not. And if we.'",
        "'speaker_1': 'Don't have a problem, we're going to sell.'",
        "'speaker_5': 'Okay. So Manning emotion based here.'",
        "'speaker_0': 'Sure.'",
        "'speaker_5': 'Go ahead. So I will make a motion that I would volunteer myself and Councilmember Ody for the subcommittee just as we designated. The Vice mayor and councilmember, they said before. But anyway, we have a second.'",
        "'speaker_0': 'We have a second.'",
        "'speaker_4': 'Well, let me ask this question. Are there possibilities of council members joining in and as signatories, once you guys have finalized whatever language, it's a possibility?'",
        "'speaker_5': 'Well.'",
        "'speaker_6': 'I mean, if you look at option three, have a combination of council members and other eligible voters. Or for authorized no more than two council members. Okay. I'm sorry. Three or four other people. So that would be option three, I guess, right?'",
        "'speaker_4': 'Yeah. Well, I'd be happy to cosign on the rebuttal. OBL rebuttal against ours.'",
        "'speaker_5': 'Okay, well, should we do this?'",
        "'speaker_6': 'I mean, if we have a committee, then that limits us to option two, three and four. I guess we could pick two, three and four after we pick a committee or it doesn't really matter to. I think if we ever.'",
        "'speaker_0': 'Get a second.'",
        "'speaker_6': 'On the floor, you're going to say.'",
        "'speaker_4': 'Oh, no, I just want to know. I would like to sign one of these two, whether it's the rebuttal to the the opposition or whether, I mean, one.'",
        "'speaker_5': 'Understood.'",
        "'speaker_6': 'So do you want to pick an option and then see if we can?'",
        "'speaker_5': 'I think a number four would cover that.'",
        "'speaker_4': 'Okay, then.'",
        "'speaker_0': 'Do we have a second position? Okay. Second, it's been moved into active discussion.'",
        "'speaker_1': 'So I'd like to ask for clarification.'",
        "'speaker_0': 'Yes. What's your question?'",
        "'speaker_1': 'My clarification is everything that I heard on the last part correctly, member Ody and member Ashcraft both voted against putting this on the ballot. And now both of them are asking to be the two that write the argument in favor of putting it on the ballot.'",
        "'speaker_4': 'That is a.'",
        "'speaker_1': 'Little. Is that correct?'",
        "'speaker_0': 'Yes, that's correct.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'So I think that that's ironic.'",
        "'speaker_1': 'And I would be very concerned about having two people's rights and argument in favor of it, just voted against putting it on the ballot. However, that being said, if in fact, the rest of the council has an agreement to do that, I would think it should absolutely be reviewed by the majority of council before it is submitted'",
        "'speaker_1': '. And I personally would.'",
        "'speaker_5': 'Like the way it.'",
        "'speaker_1': 'Was so that all council members have the opportunity to sign the argument in favor, not just the two that voted against putting it on the ballot. So I don't think that's at all appropriate.'",
        "'speaker_0': 'So I see the city clerk shaking her head. My understanding is that the committee works with staff to to write this and then individuals can sign it. But there's no meeting to everybody. Put a thumbs up. You either sign it or you don't.'",
        "'speaker_0': 'Is that correct? Right.'",
        "'speaker_1': 'I want everyone to have the opportunity to sign it. And I would be concerned, though, that if there's only those two, I would prefer that there be at least someone that voted for putting on the ballot involved in writing it.'",
        "'speaker_1': 'And every that third person is it doesn't have to be myself, but I don't think it is all appropriate to have two people that voted against putting it on the ballot be the only two councilmembers involved in writing it.'",
        "'speaker_6': 'Can I speak to that?'",
        "'speaker_1': 'I truly think it's important to have someone who voted for putting it on the ballot involved in writing it.'",
        "'speaker_0': 'Member.'",
        "'speaker_4': 'I think Mayor Spencer raises a good point. My feeling is, is this is that, though, what I would hope is that. Given the magnitude of the issue before us, whether we're going to have focused our rent control or we're going to go forward with the strengthened mediation process, given the magnitude of the impact of the of the'",
        "'speaker_4': 'question before us on generations of Americans, in my opinion, my hope is that this is something that all council members sign off on. And if that means that Council member Odie and Council member Ashcraft write it up, I'm fine with that as long as that we all because this is this is huge as huge as any issue'",
        "'speaker_4': 'that will face in the history of Alameda. This one is for the. This one is for the fences. And I think. As a council, we need to be united in expressing our support for the ordinance.'",
        "'speaker_0': 'Not to mavrodi.'",
        "'speaker_6': 'Thank you, Mr. Vice. One of the things we take seriously well, some of us do take seriously on this council is that when the council makes a decision, if we were in the losing side, then we respect the will of the council.'",
        "'speaker_6': 'And if tasked with the assignment of drafting this as a subcommittee, I will respect the will of the council, even if it disagreed, you know, with with the vote I took. I mean, that's what we're supposed to do.'",
        "'speaker_6': 'Some on the council don't always do that. They continue to undermine even after the council spoke. And so I, I think maybe we may if I can ask for a friendly amendment, because I think we did number four, which doesn't call for any council members to sign all except and then we want to have the possibility of'",
        "'speaker_6': 'council members signing it. So that would be number three, right?'",
        "'speaker_5': 'Yeah, I believe so. Yeah. I accept your friendly amendment.'",
        "'speaker_0': 'And you repeat the amendment. A city clerk. So we all know we're.'",
        "'speaker_3': 'Authorized no more than two council members to draft an argument and have a combination of council members and other eligible voters sign.'",
        "'speaker_4': 'Well. So I guess if I'm going to be clear about that the that language of. I just want a very specific that the two council members write it and then the five of us are assigned it if we so choose.'",
        "'speaker_5': 'You know what I read? I read number two.'",
        "'speaker_6': 'Well, that's all council members saying. We could modify three and say that up to all council members. And if one refuses, then other eligible. Yeah. How about that?'",
        "'speaker_0': 'Oh, declined.'",
        "'speaker_6': 'I mean. There may be a contrarian in the mix. You never know what this council.'",
        "'speaker_0': 'Madame Mayor comment on.'",
        "'speaker_1': 'I would support. I think it's imperative that all council members be allowed to sign it.'",
        "'speaker_4': 'And that allows for that possibility. But. Councilmember Ashcraft and Councilmember Odie are going to put it together.'",
        "'speaker_6': 'With staff's help.'",
        "'speaker_5': 'Just like you did, right?'",
        "'speaker_1': 'Well here.'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'All right. I think we have a motion.'",
        "'speaker_0': 'We have a motion in a second. Madam City Clerk Roll call.'",
        "'speaker_3': 'Councilmember Daza Yes. As the.'",
        "'speaker_5': 'Ashcroft Yes.'",
        "'speaker_3': 'That arrestee.'",
        "'speaker_0': 'As.'",
        "'speaker_1': 'Odie, yes.'",
        "'speaker_3': 'Mayor Spencer.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'So that was unanimous. Five Vice.'",
        "'speaker_0': 'Game.'",
        "'speaker_1': 'Okay. Then, in regards to their rebuttal.'",
        "'speaker_0': 'I understand the rebuttal argument will be. It's the same committee, the same conditions similar to the Uma. Is that I see people nodding heads on. They're radio for the fly, Madam Mayor. Yes, it's correct. Yes. Thank you. Any more questions from the council?'",
        "'speaker_1': 'So I don't think that that was the emotion. I think it was for the argument, not argument and rebuttal.'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'May I address.'",
        "'speaker_0': 'Member Ashcraft, please?'",
        "'speaker_5': 'The second directive was consider authoring a direct and possible rebuttal argument. We took care of both of them in one vote.'",
        "'speaker_6': 'That's what the staff report says.'",
        "'speaker_0': 'Okay. Understanding the staff report. Is that clear? Okay. Item six be.'",
        "'speaker_1': 'That has nothing.'",
        "'speaker_0': 'I just I would like to have the city clerk just read the note so that everybody knows. She joined us late.'",
        "'speaker_3': 'So. And. Six Feet was a placeholder for potentially putting on the landlords initiative and since it was not found sufficient, we did not add it.'",
        "'speaker_0': 'Thank you. Item seven City Manager Communications.'",
        "'speaker_1': 'So one thing I just wanted to follow up on Glenn's Tigers General Manager retirement that he talked about at the beginning of the meeting. Liz Warm. Adam is going to be the interim. Part time general manager and Joel and Boyer is going to assist as a previous AMP employee as well.'",
        "'speaker_1': 'So I just wanted to let everyone know about that and I really appreciate those taking this on in addition to everything else.'"
    ]
}