{
    "FEMA's Proposed Revisions to Floodplain Maps.": [
        "'speaker_1': 'A informational report on the Federal Emergency Management Agency proposed revisions to flood plain maps, which could impact Alameda property owners. Good evening, Madam Mayor. Can in my in the microphone for good?'",
        "'speaker_0': 'Yes. Okay. If I lean in. If you can. It doesn't always pick up.'",
        "'speaker_1': 'All right. Good evening, Madam Mayor. Honorable Vice Mayor, members of city council. I'm Aaron Smith from the Public Works Department. And presenting before you tonight an informational report only there's no action or decision required of council on this matter at this point in time.'",
        "'speaker_1': 'The Federal Emergency Management Agency, commonly spoken of as FEMA, is the agency within the United States Department of Homeland Security that manages the National Flood Insurance Program. This program allows property owners in participating communities to purchase insurance protection from the government against losses from flooding.'",
        "'speaker_1': 'Property owners and Nonparticipating communities are not eligible for federally subsidized flood insurance, federally backed mortgages, federal grants or federal disaster relief. In 1978, the city joined the National Flood Insurance Program and in 2009 amended the Floodplain Management Chapter of our Municipal Code to adopt flood insurance rates rate maps which are issued by FEMA.'",
        "'speaker_1': 'It is these maps that identify the special flood hazard areas within the city where specific standards of construction, which are specified in the code would apply. FEMA periodically updates the flood insurance rate maps based on new information and science.'",
        "'speaker_1': 'And this is what brings us here this evening. FEMA will be issuing preliminary maps that expand the special flood hazard areas in the city of Alameda. Eric Simmons from FEMA will present this evening on the specifics of those preliminary maps and the public process that FEMA is required to move the maps through before their final issuance.'",
        "'speaker_1': 'Although not required of the city, we've hired an independent hydrologist to review the new maps. And although our hydrologists confirmed FEMA's conclusion based on existing conditions, additional study can be done to potentially reduce the impacts of flooding on Bay Farm Island with modifications to the dike system.'",
        "'speaker_1': 'The Port of Oakland has also hired their own hydrology consultant to investigate the modeling used by FEMA at the Oakland Airport in Bay Farm Island. The city supports the port of Oakland's efforts, and we await the conclusions which we understand will be presented during the formal appeal period for the preliminary maps.'",
        "'speaker_1': 'So, Eric, when you come on up, when Eric's done with this presentation, I'll return just briefly to speak a little bit more to the extra outreach efforts the city will be taken, given the potential number of newly affected property owners.'",
        "'speaker_8': 'Good evening and thank you for the opportunity to talk about flood hazard mapping. My name is Eric Simmons. I'm an engineer with FEMA, and we have a regional office right across the estuary in Oakland.'",
        "'speaker_3': 'And in April.'",
        "'speaker_8': 'We released preliminary flood insurance rate maps. And Aaron was able to do a really good job of giving some of the the background and history there. So what I wanted to focus on was some maps that show the differences between what's currently mapped by FEMA and what's proposed to be mapped by FEMA.'",
        "'speaker_8': 'And the basis for FEMA flood mapping is the 1% annual chance flood. It has a 1% or greater chance of occurring each and every year. Some may hear it as a 100 year flood, but over the long term average, over a 30 year period, it has a 26% chance of occurring.'",
        "'speaker_8': 'So on this slide, in the next couple slides that the blue zone is that 1% annual chance floodplain. And on the graphic, on the left is the current flood insurance rate map. It's based on a study from the mid eighties and with FEMA is embarked on a new coastal mapping for the entire United States that includes the'",
        "'speaker_8': 'Pacific Ocean and the San Francisco Bay. And we're issued these draft preliminary maps for the Bay Area counties, including Alameda County here, the Main Street area. You can show you can see how the blue zone that 1% chance flood plain is is widening.'",
        "'speaker_8': 'And this new map also shows a moderate hazard area. It's the 0.2% chance floodplain or often commonly called the 500 year floodplain. Looking in another area here, Webster Street. You can see again the proposed changes. And in general, the flood zone or the city of Alameda is being widened.'",
        "'speaker_8': 'Here on the east end of the Alameda Island, where in general the current flood insurance rate map shows the mapped high hazard area right along the shoreline. We have numerous houses in that high risk floodplain and even more in the moderate hazard area, that 500 year flood plain.'",
        "'speaker_8': 'And one thing to highlight this is based on sea levels, conditions today. These are flood insurance rate maps that are used to rate the. Flood insurance, and therefore it's based on existing conditions. The last slide here probably shows the greatest change here on the western part of Bay from Island.'",
        "'speaker_8': 'You can can look along the lagoons on the golf course area and other areas showing what I'd call a major change in in that mapped 1% annual chance floodplain. So I'm going to hand it back to Aaron to cover kind of the next steps and the process.'",
        "'speaker_1': 'Thanks, Eric. So these are preliminary maps which FEMA, we are pending FEMA's announcement in the Federal Register when they put it in the Federal Register. FEMA will also due to notifications in local newspapers, which officially starts this 90 day appeal period.'",
        "'speaker_1': 'The appeals are not between the property owners and the city, but between the property owners and FEMA. So I want to also just speak to a little bit of the additional work the city is going to be doing to ensure that our property owners are well informed.'",
        "'speaker_1': 'So immediately following FEMA's announcements in the Federal Register, the city will send out a targeted mailing to all affected property owners. We'll post the announcement and information on the city of Alameda Web site and hold a public information meeting where questions can be answered.'",
        "'speaker_1': 'The intent of these extra actions are to ensure that people are aware of the change. They understand the requirements once the maps are final, and that they understand their right to appeal to FEMA, although appeals and protest are collected by the city.'",
        "'speaker_1': 'I don't want that to be confused with the fact that we are just passing them on to FEMA. Once FEMA resolves the appeals and protests, they do issue a letter of final determination for the new flood insurance rate maps in order for the city to continue participation in the National Flood Insurance Program and allow property owners the'",
        "'speaker_1': 'benefits of federally backed mortgages. Federal disaster relief, among other benefits. Council is required to adopt the new flood insurance rate maps into Chapter ten, which is our floodplain management section of our municipal code. So with that, the informational report is complete.'",
        "'speaker_1': 'Myself, Eric and Lori Koza check from Public Works, who's the lead staff member on here, can certainly answer any questions you have.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_3': 'Is it fair to say, or if you can explain the reason why these zones are expanding? Is that there's projected sea level rise.'",
        "'speaker_1': 'I'm going to let Eric from FEMA answer that one.'",
        "'speaker_8': 'So the the proposed flood zones are based on today's condition and not on a future sea level rise condition. There are there are a couple of reasons why the proposed flood zone is is wider than the current flood zone.'",
        "'speaker_8': 'One is we have much better information on the elevation of the ground using new technology. We have more accurate and precise information that shows these flood prone areas. FEMA also developed a bay wide model. It has information at over 8000 locations along the bay that we have modeled the past over 55 years of of conditions, whether it's'",
        "'speaker_8': 'surge to the Golden Gate or, you know, during El Nino conditions where higher water levels are as long as as well as tides, wind conditions that can affect. Water levels. And so we just have better information on on the hazard that is today.'",
        "'speaker_3': 'So it's more accurate. And there's a larger body of data, as I interpreted you saying. Correct. Thank you.'",
        "'speaker_0': 'Any other council comments?'",
        "'speaker_9': 'I have a question.'",
        "'speaker_0': 'And.'",
        "'speaker_9': 'In the presentation on page four of ten, on the third bullet point, it says properties proposed to be mapped in the 100 year flood plain equals 1800. So right now, what's the number of properties that are in the current floodplain?'",
        "'speaker_9': 'Is it this 40 or. Or is this the number of people who have flood insurance?'",
        "'speaker_8': 'That's the number of people that are currently mapped in that high hazard zone.'",
        "'speaker_9': 'Oh. So the increases. 1760. Yes. Okay. And. Of the 1760, then basically it's complete. Do we know how many of the 1800 already have some form of flood insurance?'",
        "'speaker_8': 'We can provide a summary of the flood insurance coverage in the city. I don't have that exact number with me.'",
        "'speaker_9': 'Okay. Because. Right now within the map area, within the current map, there are 40 properties subject to the current 100 year flood plain. But when you compare it because that's the next bullet points. Now when you compare it to the actual number of people who have taken out flood insurance, there's more.'",
        "'speaker_9': 'There's 134. Right. Which suggests that within the envelope that will contain 1800. There might be a number of homeowners already with flood insurance. Right. I think what I'm getting at and I think we'll do that and we've got plenty of time.'",
        "'speaker_9': 'But is this just getting the accurate data as to the current conditions, existing conditions? Because. You know, it's altogether possible that you can read this and you can have one incredible, huge sticker shock of, you know, suddenly 760 homeowners affected, which might be not or might not be.'",
        "'speaker_9': 'So we just need to make sure to get that.'",
        "'speaker_1': 'One other day. So I will definitely follow up. We have a which those parcels are okay. Make sure that we get that information from FEMA and we can provide that to you rather quickly.'",
        "'speaker_9': 'All right. And one last thing is if we can also get the. The incremental change, if there is any, between those? Well, will there be any incremental change in the flood insurance amount right now? And the bullet point on page four of ten.'",
        "'speaker_9': 'It says on average, people are paying 511. I don't know if.'",
        "'speaker_8': 'Yeah. So one thing we try to emphasize is, is those homeowners or business owners that are impacted by this flood zone change. FEMA has adopted a policy that allows them to purchase the least expensive type of flood insurance as long as they purchase it, you know, sooner rather than later.'",
        "'speaker_8': 'So they can save money in the long term by purchasing flood insurance sooner. And again, because the city participates in the National Flood Insurance Program. Any homeowner or business owner or renter is eligible to buy flood insurance. It doesn't matter what flood zone they live in.'",
        "'speaker_3': 'Or where where they work.'",
        "'speaker_8': 'All all those people are eligible to buy flood insurance through the National Flood Insurance Program.'",
        "'speaker_9': 'We thank you.'",
        "'speaker_0': 'Mayor Brody. And we do have one speaker.'",
        "'speaker_4': 'Thank you. Just a couple of quick questions. So there's the four areas outline here, the the Main Street, Webster, Starkville, East End and Bay Farm. So the areas that are not mapped, are they just not in the floodplain or did you not map them or.'",
        "'speaker_8': 'You know, FEMA's. New study studied flood hazards throughout the bay so all of the city of Alameda currently for example Alameda point is not mapped with high or low flood hazards. But our new study did study.'",
        "'speaker_9': 'That.'",
        "'speaker_3': 'And.'",
        "'speaker_8': 'Proposing maps. We didn't rate graphics.'",
        "'speaker_3': 'For every area of the island.'",
        "'speaker_4': 'It said, okay, because that was my question. You know, we just signed off on a housing project on Alameda Point. Are are those houses going to be in the floodplain that requires them to get flood insurance? And the same thing with the Del Monte and all of the other projects along the northern waterfront.'",
        "'speaker_4': 'I mean, people will be buying those.'",
        "'speaker_8': 'Right. And I'm happy to say we've had coordination ongoing and so that the the FEMA study is being used to build much safer in that area. You know, above the 1% chance flat elevations and then also considering future conditions.'",
        "'speaker_4': 'Okay. So but this is just the highlights of your map. This isn't the entire map that we have.'",
        "'speaker_3': 'Right.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. I'm going to go ahead, Kristen. All right.'",
        "'speaker_5': 'Thank you, Miss Smith. I didn't get everything down that you said earlier that the city council is required to adopt these regulations into. Is it chapter ten?'",
        "'speaker_1': 'It's actually the map. So we already have our Chapter ten, which can references the existing maps that Eric had shown on there. So that identifies the special hazard zones now. So what will be required to do is adopt the new maps once FEMA finishes their public process and they issue a letter of final determination.'",
        "'speaker_1': 'And we have a six month period of time to adopt those new rate insurance maps into our municipal code.'",
        "'speaker_5': 'Okay. And then I understand the six month window of time. Give us the time frame from about when to when will the start?'",
        "'speaker_1': 'The cities poised to act. We're waiting on FEMA to post in the Federal Register so that once they do that, then there's the 90 day appeal period. And then the question is, is after the end of the appeal period, how quickly FEMA issues the letter of final determination?'",
        "'speaker_8': 'So that that timeline depends on what kind of comments we we have, and then we resolve them in coordination with the impacted cities. This map change does not impact just the city of Alameda, but other cities, certainly. So there's a coordination process.'",
        "'speaker_8': 'But typically, the new flood insurance rate maps go in effect about a year and a half after this preliminary issuance.'",
        "'speaker_5': 'Okay. But our residents should expect to start receiving letters in the mail in the next.'",
        "'speaker_1': 'Do you have an estimated date of when you'll be posting in the Federal Register?'",
        "'speaker_8': 'A little bit outside of FEMA's control. But I just checked off work in the.'",
        "'speaker_2': 'Past.'",
        "'speaker_8': 'Four weeks or so.'",
        "'speaker_5': 'In the next 3 to 4 weeks.'",
        "'speaker_1': 'We have our letter ready to go and we're checking the Federal Register daily.'",
        "'speaker_5': 'Okay. And so what I would just ask of city staff, you know, I think we all agree that more information is better than less. So if you could all do your best efforts to get word of this out into the public, through our newspapers, and not just the legal notice that I know is going to be posted'",
        "'speaker_5': '. But I heard you say it'll be on the city's website. Not everybody goes to the city's website. So let's be as proactive and communicative as possible. Mr. Hahn is making motion. I didn't quite understand.'",
        "'speaker_3': 'We're actually going to send a letter to every affected homeowner. So we will put them on notice through a letter from the city as a service to our citizens. You don't need to do that. But we're doing we're being proactive and reaching out.'",
        "'speaker_5': 'And I appreciate letters and sometimes people don't, you know, pay attention to everything they get. And I again, more information is better than less. It wouldn't hurt to layer on some of their.'",
        "'speaker_0': 'During our comments.'",
        "'speaker_5': 'I was just finishing my sentence to Mr..'",
        "'speaker_0': 'Flynn on that later. Yes. I'd like to take once.'",
        "'speaker_5': 'Blake, you, Mr. Hunter, I.'",
        "'speaker_0': 'Appreciate I'm going to go ahead and call her up. Carrie Johnson.'",
        "'speaker_5': 'It wasn't. And if you want to say.'",
        "'speaker_2': 'Good evening, everyone, I am Kerry Thompson. I am here as a homeowner in the new flood zone. Thank you very much. What a nasty little shock that was today. I frankly am opposed to it. Initially, when I did purchase my home in 1987.'",
        "'speaker_2': 'It was in a flood zone. We were aware of that. We had to go through the whole process and thank heavens after a while it was determined it was not in a flood zone. So we've not been able to you know, we've not been required to have flood insurance as part of our our loan.'",
        "'speaker_2': 'And frankly, that's just another impediment to homeowners existing and future in that area, because now everyone has to disclose that that that will become effective in, what is it, 12 to 18 months, they just said. So I'm really disappointed because frankly, it doesn't seem like anyone had an opportunity to weigh in.'",
        "'speaker_2': 'There really isn't an opportunity to opt out. It sounds like it's a done deal. So I'm kind of concerned that this whole thing was pointless. Thank you.'",
        "'speaker_0': 'Thank you. All right. Member comments. So I would agree with member Ashcraft that if the city could actually put something in the newspaper in addition to the letters, to make sure that all the homeowners do receive, do our best to make sure that they received notice.'",
        "'speaker_0': 'And also, if we could have the whole maps like in our planning department, people could go and see the whole map and double check it for whatever reason they need to talk to someone about is my home within that area.'",
        "'speaker_0': 'If we could have the full maps available in the planning department and then the public could come and double check with a person and speak to it if they have a problem or question anything that we could do to help facilitate that.'",
        "'speaker_0': 'And and I appreciate my understanding the staff we are hiring someone to also check this.'",
        "'speaker_1': 'When we already have and they've they've already concluded confirmed FEMA's conclusions pending additional study on modifying the dike system in Bay Farm Island. So they've confirmed FEMA's conclusions based upon existing conditions.'",
        "'speaker_0': 'So I appreciate that staff that took that extra effort to try to confirm because as the Speaker noted this, our speakers know this will be challenging for many of our homeowners member, Ashcroft.'",
        "'speaker_5': 'And so just to follow up on the speaker's comments, Mr. Smith. This isn't exactly something that we can opt out of or the city could opt out of recognizing our floodplains. But at considerable cost as as in.'",
        "'speaker_1': 'Opting out would mean. Are you suggesting not participating in the National Flood Insurance Program.'",
        "'speaker_5': 'When when homeowners say and understandably, I mean, we all see our, you know, costs of insurance and property ownership costs go up every year. But I just you know, I'm not sure that the public understands quite the ramifications to all of us, not just individually, but the city, if for some reason we weren't to comply.'",
        "'speaker_5': 'Sure.'",
        "'speaker_1': 'Well, I'd like to just. First start with that. This is not a done deal. This we haven't started a 90 day appeal period. So we are at the cusp of a 90 day period for public input that, you know, can still dialog can still occur between the public and FEMA.'",
        "'speaker_1': 'Also, I'd like to have Eric speak to once the maps are issued, there are options for individual property owners to do what's called a survey certificate. And if you could briefly explain what that is.'",
        "'speaker_5': 'And if I could also ask you, if you're able to just talk about what would an appeal look like? What are criteria for appeal?'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_8': 'Let me first touch upon the the issue of of after these maps are updated in and the opportunity to revise or amend them is always there. Theme every year processes thousands of letters of map amendment and letters of map revision where either a homeowner or a community provides better data to FEMA to show that they're at or'",
        "'speaker_8': 'above this flood elevation. Or maybe there's new construction and the development involved fill, and they put that fill to elevate the new development again above the flood elevation. So the maps, even though they get revised through a big revision that we're talking about now, can get amended and revised at any time in the future.'",
        "'speaker_8': 'And then. What Aaron referred to as an elevation certificate is a form that documents the surveys that substantiate those changes and the newer information. And your question referring to what kind of appeal or other data FEMA may receive during this 90 day period.'",
        "'speaker_8': 'In that we're open to any technical or scientific data. One, I wouldn't say common, but situation that does occur is perhaps a homeowner has one of these elevation certificates. They're being mapped very close to the line of that special flood hazard area.'",
        "'speaker_8': 'And that elevation certificate shows that they're, in fact, at or above the flood elevation. And we can clarify that situation through a letter or, if necessary, make that small modification on the map. That's probably the most common kind of scientific or technical information we receive.'",
        "'speaker_5': 'Thank you both.'",
        "'speaker_0': 'Member OTI.'",
        "'speaker_4': 'Thank you, Madam Chair. So on that that's survey that elevation certificate. So you have to do a survey to get that if you don't already have it.'",
        "'speaker_8': 'Yes. Typically, the homeowner or another party hires a licensed land surveyor or professional engineer to fill out that form the elevation certificate.'",
        "'speaker_4': 'So that that kind of was my question then, you know, hire. What's the average cost of one of these surveys? You know, it.'",
        "'speaker_8': 'It depends on where you are. And it also depends. Sometimes homeowners get together, you know, if ten homeowners get together and their costs maybe, you know, $300.'",
        "'speaker_3': 'Or.'",
        "'speaker_8': 'Or a lot less. But if if one homeowner hires a surveyor or that professional engineer, it could be over $1,000, depending on where you are.'",
        "'speaker_4': 'I mean, it just, you know, seems to me, you know, you're kind of. In a bad way. Either way, you know, you either have to shell out the money to buy to get a survey, or you're stuck with buying insurance.'",
        "'speaker_4': 'And the homeowner really has no recourse except to pay one of those. And it just seems unfortunate. So just one more question on the this appeal. So you said we had a staff and analyze that. They agreed with with the FEMA maps.'",
        "'speaker_1': 'And the independent hydrologist that we hired on public works. Correct. They they agreed they confirmed FEMA's conclusions based on existing conditions.'",
        "'speaker_4': 'So I guess I'm concerned based on that, that if we do have homeowners that do appeal this, that that the city and the staff will be supportive of those appeals. It seems to me that there's a belief that, you know, the FEMA maps are valid.'",
        "'speaker_1': 'Again, the city's kind of a pass through body in terms of the actual appeal. That's for FEMA to consider.'",
        "'speaker_4': 'Okay. Again, I think it's unfortunate that, you know, homeowners have to shell out money regardless. And it's just. Just one of those things, I guess.'",
        "'speaker_9': 'Member Data Two sets of questions. The first set of question is when the independent hydrologist or whomever did their analysis, did they do analysis on the ground or do they use some kind of GIS system? And based upon that.'",
        "'speaker_1': 'I'm going to have Lori speak to that. She was our staff member that worked directly with the hydrologists.'",
        "'speaker_6': 'Madam Mayor and council members. The hydrologist was ballance hydrologists and they took a look at the data that the that FEMA had used and pretty much looked through their method of calculating the base elevation of the floodplain and how that was.'",
        "'speaker_6': 'The question was whether. That Stillwater elevation could have time to go inland during just the high tide or just the storm event, and they calculated that it would have time to do that.'",
        "'speaker_9': 'And the inputs into their calculation was based upon numbers that's already in some kind of system, and they just had to review the system and make some updates.'",
        "'speaker_6': 'I believe the light hour or the elevation data came from the county. Is that okay? Did you use the county elevation or do your own? Okay. So they were partially using survey data that came from the county and so they were kind of checking FEMA's calculations, using that.'",
        "'speaker_6': 'They did not go out and do an independent, complete survey.'",
        "'speaker_9': 'Just really like of a metadata findings based upon a metadata analysis. Yeah. So it's not completely. So it's altogether possible that people could still. Do their analysis. And it's completely possible that some parts of Alameda are higher than what's in the what's in the database.'",
        "'speaker_9': 'So I wouldn't at their own at their own. And that's something that we need to discuss. The second set of question in our maps, the the the 1800 or so that will be subject to the new boundaries, although.'",
        "'speaker_9': 'Thank you very much. Appreciate your assistance. These are the these homeowners, these resident properties are in the blue area, is that correct? Correct. So this is not the brown areas in the map?'",
        "'speaker_1': 'No, the brown areas where the lower the 500 year flood. So yes, aren't those are more for planning or advisory purposes.'",
        "'speaker_9': 'So I just want to clarify. So there's is there any effect in having the number of units, residential or otherwise, that are in the brown areas they're not going to suddenly get thrown with. Some kind of new bill is a correct.'",
        "'speaker_9': 'They're just for whatever reason, they're just categorized as being in this moderate flood plain zone.'",
        "'speaker_1': 'That's my understanding, right? Yeah.'",
        "'speaker_9': 'Okay. Yes. You know, I mean, going back to Councilmember Otis point of view point is that a lot of these brown areas are also near the blue areas. So I wouldn't completely ixnay the idea of, you know, doing one's own analysis.'",
        "'speaker_9': 'That's a very technical term, by the way. Yeah. So but, you know, figuring out how to help the residents is something that we need to do in the coming weeks and months.'",
        "'speaker_1': 'I'd also like to just just add this survey certificate that we're talking about is not yet these analysis is are done at a certain level, granular level. So you could have any one particular parcel on a block that has something.'",
        "'speaker_1': 'And so it's not just because our hydrologist confirmed FEMA's conclusion that shouldn't in any way discourage a property owner from pursuing that, if that's what they feel they'd like to do.'",
        "'speaker_0': 'Like member Ashcraft.'",
        "'speaker_5': 'And Miss Smith. You mentioned earlier, and I just wanted a little more information that FEMA will allow homeowners to purchase a lower cost flood insurance if they do so quickly. Is the procedure for doing this going to be contained in the letter that's going out to these homeowners?'",
        "'speaker_5': 'How will they how will they find out about it is my question.'",
        "'speaker_1': 'That's a really good question. We allude to it, and we also invite property owners to a public meeting that will be holding to answer any questions. If I can work with Eric in advance of the letter and be as specific to that policy and reference it, I will certainly integrate that into the letter.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'Without sounding like a broken record, more information is better than less. And if we know that some of these homeowners are almost certainly going to have to bear the cost of flood insurance, I'd like to see us at least give them the information about how they could lower that bill.'",
        "'speaker_5': 'So if that could go, if you've got the ability to get that into the letter that's going out, I think that would be great.'",
        "'speaker_1': 'It's not a problem. We will do.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'And do you have the date of the meeting that you've referenced again?'",
        "'speaker_1': 'So we're poised kind of for the Federal Register notice and then all our actions come subsequent to that.'",
        "'speaker_0': 'Right member day. So.'",
        "'speaker_9': 'You know, and I think this is where council member Odie might have been going the direction, but it's something that we can mull over in the coming weeks, months. It's completely possible that the city of Alameda ground truths the blue areas.'",
        "'speaker_9': 'Something to think about. So.'",
        "'speaker_1': 'I just also keep in mind, Port of Oakland is is also pursuing their own independent study that impacts Bay Pharm Island, which is our largest impacted area. And so we are cooperating and await the conclusions of that study as well.'",
        "'speaker_0': 'Thank you. Iran.'",
        "'speaker_3': 'As. Just to remind one last thing. If you do not have a federally insured mortgage, you're not required to have flood insurance. Okay. So if you don't have a FEMA or Fannie Mae mortgage, then you're not required to have flood insurance.'",
        "'speaker_3': 'You're going to be in a flood zone. So that's up to you. But you're not required to do that. Okay. It's only required for federally insured mortgages.'",
        "'speaker_4': 'Ethan.'",
        "'speaker_0': 'Thank you. All right. They no other comments on 60. Thank you very much. And now we're going to go to six. B I'm sorry, six B That was 63.'"
    ],
    "Creation of Rent Review Advisory Committee and Review of Rent Increases Ordinances.": [
        "'speaker_1': 'Introduction of ordinances amending the Alameda Municipal Code by adding Section two, Dash 23, Article two concerning creation of a rent review advisory committee and an ordinance adding Article 14 to Chapter six concerning the review of rent increases.'",
        "'speaker_2': 'Good evening. I'm Debbie Potter, the city's community development director. On May 5th, staff presented two alternative ordinances governing rent review procedures in the city. City Council gave staff direction to move forward with the ordinance that does not require a minimum rent increase to access the rent review process.'",
        "'speaker_2': 'Council also requested that staff analyze the proposed ordinance to ensure it does not that it is not in conflict with state law, specifically the Costa Hawkins Act, which precludes certain types of local rent control. Legal staff has concluded that the proposed ordinance is consistent with state law.'",
        "'speaker_2': 'Additionally, council requested several minor revisions to the ordinance, including grammatical changes, the addition of a severability clause and modifying language regarding alleged violations of the ordinance so that the alleged violation would be evidence and not a complete defense in any court proceedings.'",
        "'speaker_2': 'These changes are highlighted in Exhibit One of the staff report. Staff has also made a few changes to the ordinance, including adding the definition of a housing unit and breaking the ordinance into two ordinances so that the rent review process is addressed in one ordinance.'",
        "'speaker_2': 'And the inclusion of the rack in the municipal code to better outline the specific duties and responsibilities is in a second ordinance. Lastly, you will note that a revised staff report was posted today to fix some minor typos, including clarifying that an alleged violation of the ordinance will be evidence and not a complete defense.'",
        "'speaker_2': 'This change was made in two subsections of the ordinance, but overlooked in subsection three. Based on the legal analysis that concluded that the proposed ordinance is consistent with state law, staff is recommending that two ordinances, one governing the rent review process and one codifying the RAC, be introduced this evening on first reading.'",
        "'speaker_2': 'And with that brief staff report, I am happy to answer any questions.'",
        "'speaker_4': 'Member Thank you, madam. Thank you. Ms.. Potter Just a couple quick questions. So there's this definition of housing unit. Room or group of rooms. So this ordinance only applies to housing units as defined in this in this ordinance.'",
        "'speaker_2': 'Yes. And this was really meant to clarify that if you are renting out an individual room in your house, that that would not that room rental would not be covered by the ordinance, that this is really to cover standalone.'",
        "'speaker_4': 'So that Mrs. Murphy exception in the old term in property law. But if you do that so like for example the Toni's yes councilmember de Suggs so his his tenant has no recourse if he jacks up the rent.'",
        "'speaker_4': 'If he doubles the rent. That's basically what we're saying.'",
        "'speaker_2': 'That's under this ordinance. That's correct.'",
        "'speaker_4': 'Then one other quick question on on the Housing Authority Housing Authority property, are they subject to this? Because I did receive some complaints from this.'",
        "'speaker_2': 'The ordinance has drafted would exempt the housing authority because the housing authority is governed by federal law so that that process is completely different than than state law and then local law.'",
        "'speaker_4': 'So all the folks at Independence Plaza, when they get a rate increase.'",
        "'speaker_2': 'They have there's a whole separate process that's established for for appealing that via the federal law.'",
        "'speaker_4': 'Okay. Those are my clarifying questions.'",
        "'speaker_0': 'Thank you. Member de SAG.'",
        "'speaker_9': 'Has to follow up on the issue raised by Councilmember Ody. I didn't say, oh, no, no, I'm not feeling defensive whatsoever. I think it's a valid point. I think it's important because I am of the opinion that I hate to use the word landlords, but landlords in the situation that I'm in ought to be subject.'",
        "'speaker_9': 'But so that begs the question, so why is there a legal reason as to why a person who lives in her or his own home and rents out an available room is not subject. Is there a reason why with.'",
        "'speaker_2': 'The precluded is the the logic that staff applied to this was that we we thought for consistency it would be better to line up the definition of a housing unit with our zoning with the city zoning code and to really kind of keep internal consistency within our municipal code.'",
        "'speaker_9': 'I was just curious.'",
        "'speaker_2': 'Yeah, that was the primary reason.'",
        "'speaker_0': 'Member.'",
        "'speaker_5': 'Ashcroft Thank you. So, Mr. Potter, in this staff report, there is mention of the. The study that is going to be done to study a study to analyze the impacts of rising rents on Alameda residents. And I'm delighted to read that it's you've retained an economics group and the work commences on.'",
        "'speaker_5': 'Did it commence July one?'",
        "'speaker_2': 'We actually we had a kickoff meeting today, earlier today. And they've been working. Yes.'",
        "'speaker_5': 'Okay. And so will that study look at renters who rent individual rooms or. No, because it's not a part of this ordinance.'",
        "'speaker_2': 'So the charge really is to understand the impacts of rising rents on Alameda residents. And so I believe the focus really is going to be on. You're a renter in a full park, full freestanding unit. Yes.'",
        "'speaker_5': 'Okay. And then just a point of clarification, because I know this was in the the May staff report, there was reference to both the Fremont ordinance and the San Leandro ordinance that have provisions that are similar, if not identical to the ones that are in our proposed ordinance.'",
        "'speaker_5': 'And so I checked with Michael Rausch, the assistant city attorney, who did our legal research on this, and found out that the Fremont ordinance was adopted in 1990 and the San Leandro ordinance was adopted in 2001. So those ordinances have been around and functioning for that many years, decades.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'So I have a question. If someone is running a room and they go to Iraq right now, could they file a complaint with an rent advisory committee if they have a rent increase that they want to challenge?'",
        "'speaker_2': 'I'm sorry I missed the very first part of your.'",
        "'speaker_0': 'If someone is renting a room today and they had an issue with a rent increase, could they go to Iraq for relief? Would RAC review that? Or do they have to actually be renting what's being described here as a room with a kitchen and whatnot?'",
        "'speaker_0': 'But if they're just renting a room here in Alameda and they had a rent increase that they wanted to challenge, could they take advantage of our rack? Could they file a complaint?'",
        "'speaker_2': 'Yeah. Yes, I would say that's probably the case because we have not we have not had a formal ordinance on our rent review process where we have set forward definitions. But I am not aware that we've ever had an actual situation where someone who is renting a room has filed a renting company's rent increase complaint form.'",
        "'speaker_0': 'You know where I'm going with it, right?'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'So so is there a reason why this could not be broadened to include those that rent a room? Because I actually would submit that we do have a significant number of renters that rent a room. And if, in fact, today they could go to rack to file a claim, is there a reason why we would not staff'",
        "'speaker_0': 'want to be able to? Why would we want to preclude that.'",
        "'speaker_4': 'Taking away a right that.'",
        "'speaker_0': 'We can. You might go ahead.'",
        "'speaker_4': 'Seems like we're taking away a right that they have today to just to continue on the mayor's point.'",
        "'speaker_2': 'If the council wants to make that change. I don't I don't think that there is a big downside. We were really looking just to define it to end, like I said, consistency with the zoning code.'",
        "'speaker_0': 'All right.'",
        "'speaker_5': 'QUESTION So, Ms.. POTTER and Counsel, I think what I would rather see because I do like I do like data based actions, we are commissioning this study. I would like it to include looking at people who are renting rooms who may have felt that they had egregious rent increases.'",
        "'speaker_5': 'I'm not sure that we need to add this to the ordinance before we know if indeed it's a problem. So.'",
        "'speaker_4': 'Yes. We can discuss that.'",
        "'speaker_0': 'We can discuss that during discussion. Yeah.'",
        "'speaker_5': 'Yeah. So I'm just saying, before we jump to say, okay.'",
        "'speaker_4': 'We may have different opinions.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'All right. So we have approximately.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'And we have probably ten speakers, if you could try to keep your comments to 3 minutes and I'm going to call them three at a time. And if you do want to speak on this item, feel free to turn in your slip.'",
        "'speaker_0': 'Beth, Charlie, Catherine Polley and then Barbara Duncan. You may speak. Says, Beth, are you Beth?'",
        "'speaker_5': 'You called three?'",
        "'speaker_0': 'Yes. Beth first. Is Beth here? Then Katherine and then Barbara. How do we not have this? All right. We can call her back later if she does. Maybe she's the that the next Katherine falling, then Barbara Duncan.'",
        "'speaker_2': 'Hello, Mayor. Mr. Mayor. Council. I'm actually here on the part of Angela Hawk about. She's out of town with her family, and she asks that I read her letter to you and to record. Dear Mayor, Vice Mayor, Council members.'",
        "'speaker_2': 'I'm writing today to encourage you to approve the rent review ordinance at this Tuesday's city council meeting. The Rent Review Advisory Committee needs to be strengthened now. The housing crisis has only worsened since we first spoke in January, and renters have few tools to address the rent increases that keep coming their way.'",
        "'speaker_2': 'You might recall Council Member De Saugus report on the census during the January 20th City Council meeting. It showed that homeowners incomes increased between 2011 and 2013, while renters decreased during the same time. Renters were not prepared for these rent increases and are struggling to hang on to their homes.'",
        "'speaker_2': 'Should say our homes. I understand that the council will be on break in August, which means that this ordinance will not be finalized until September. Renters have already waited months for the council to address this housing crisis. And while many renters applaud the upcoming new housing units coming to the market through the approval of sidewalk, those improvements'",
        "'speaker_2': 'are years away. Renters need help now. We hope for the swift approval of the rent review ordinance tonight and reviewing the supporting documents for the rent review ordinance. I appreciate that the council and the legal department have gone the extra mile to ensure the enforceability and legality of this ordinance.'",
        "'speaker_2': 'We hope that you will approve the rent review ordinance as a starting point to build more community stabilization in the city of Alameda. Much more needs to be done to protect the citizen renters of Alameda. Here are a few of my ideas.'",
        "'speaker_2': 'One. Make any application to the rock trigger an inspection by the Planning Department to ensure that any unit in question is up to code. We feel that RAK applicants often come to the rock with concerns about the quality of their rental units and that the only way to truly know the status of a unit is to inspect'",
        "'speaker_2': 'it. We believe that many of these rent increases would be reconsidered if the true scope of deferred maintenance on a given rental into a rental unit was understood to institute a moratorium on rent increases in the city of Alameda.'",
        "'speaker_2': 'This is the only way that some families will be able to remain here in our city. Three required landlords to give tenants 30 and 60 day notices to vacate to provide moving assistance, for example, or reimbursement for moving costs.'",
        "'speaker_2': 'And the full replacement of the security deposit. This will ensure a displaced renter can find new housing. In this housing crisis, the renters of Alameda are looking to the Council for Leadership on this matter. Thank you for taking the time to review the issue.'",
        "'speaker_2': 'I hope we can continue to find new solutions to address this very urgent crisis. And thank you for the extra 30 seconds.'",
        "'speaker_0': 'Thank you. Thank you. Barbara Duncan. And then you. And then Annette Zelinski. You may proceed. Okay.'",
        "'speaker_6': 'My name is Barbara.'",
        "'speaker_0': 'Duncan, and I'm for rent.'",
        "'speaker_2': 'Control.'",
        "'speaker_0': 'I came in tonight and gave Marilyn Ashcroft.'",
        "'speaker_2': 'Something for the mayor. And it's about the Berlin.'",
        "'speaker_0': 'Rent control and how.'",
        "'speaker_2': 'It's worked.'",
        "'speaker_0': 'And right now we have Richmond.'",
        "'speaker_2': 'Online.'",
        "'speaker_0': 'And we have San Francisco online. Okay. They both want rent control. The way it's going now.'",
        "'speaker_2': 'You want the.'",
        "'speaker_6': 'Council.'",
        "'speaker_0': 'You were put up there by us, by the people. Now we feel you should act.'",
        "'speaker_2': 'For the people.'",
        "'speaker_0': 'One way or another, if you please, would sit down and think about the.'",
        "'speaker_2': 'People.'",
        "'speaker_0': 'That cannot afford this rent increase, because Richmond has already found out that people are going in there buying their housing up and raising the rents. Alameda was known as a diamond in the rough. I don't know.'",
        "'speaker_6': 'Who said that, but that's what it was called.'",
        "'speaker_0': 'And it will not be.'",
        "'speaker_6': 'I mean, I drove down the street yesterday.'",
        "'speaker_0': 'And couldn't get from one point to another.'",
        "'speaker_6': 'Without stopping, so. That's it.'",
        "'speaker_0': 'I have no more to say. Thank you. And we will provide copies of your hand out to all council members. Thank you very much. U u t u t.'",
        "'speaker_5': 'E Boota.'",
        "'speaker_0': 'V to. Etta. And then Annette and then Bill Smith.'",
        "'speaker_2': 'Good evening. First, let me applaud.'",
        "'speaker_10': 'The mayor and the city council for going ahead with such a. I believe that's very important because there's plenty of people in Alameda right outside a it would have to move someplace else because they cannot afford to live here.'",
        "'speaker_10': 'And I hope this is a new beginning for the city of Alameda, because this is a very serious issue. I speak to quite a few people and everyone says the same thing. My my rent went up. I can't stay here anymore.'",
        "'speaker_10': 'My kids have to go to a different school. My husband has to travel 5050 miles.'",
        "'speaker_2': 'To go to work.'",
        "'speaker_10': 'So it's disrupting lives. And I'm hoping. It is a new beginning and the mayor and the city council will move forward to more affordable housing. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Hi. I'm Annette Zielinski, and some of you have heard me tell my story before, so I'll try to keep it really short. But basically, about a year ago, well, August of last year, my rent went up 20%. And I went through the rack process and I felt that a 10% increase was fair and was willing to pay'",
        "'speaker_2': 'a rack, supported that decision. And my landlord, when the ten days was up to supply me with a new lease to honor the recommendation of the rack committee, decided to call me and evict me over the phone. And said that he'd be following up with writing in the notice in writing shortly.'",
        "'speaker_2': 'So in that time I had called eco housing and renewed hope and got some help. And it took a couple of months, but after a couple of months they were willing to give me a new one year lease, but for the full 20% amount that they originally proposed.'",
        "'speaker_2': 'In that time, I had gone to look for housing and couldn't believe that in the two and a half years that I lived there, what had happened to rents in Alameda? And I got really scared because I was recruited to work here.'",
        "'speaker_2': 'I was living on the East Coast at the time and was recruited to work here by the North Face, which is like a fairly prominent business on the island. And for what they were willing to pay me at that time, I could afford a one bedroom apartment.'",
        "'speaker_2': 'Now I can't. Like I am at the max of what I can afford. I made my company aware of my situation and they, you know, instead of my annual 3% raise, I got a 4% raise, which really doesn't compensate for a 20% rent increase.'",
        "'speaker_2': 'I guess I really want to I don't know all the details of what's in this new ordinance, but I would like to see the committee have some enforcement authority. You know, I mean, they can make a recommendation, but if the landlord doesn't want to follow it, where does that leave people like me?'",
        "'speaker_2': 'I mean, I had to suck it up with that 20%. And to be honest with you, I've given up on looking for another place to live that's in this state. Like, I'm trying to head to Oregon, and that really bums me out because my livelihood is very specific to the footwear industry, which is what I'm doing here'",
        "'speaker_2': 'in Alameda. And it's I've been actively job hunting since January to no avail. So I'm really scared and I kind of lose sleep about this all the time because in that process, my landlord got a little heated with me and said that he he thinks he should be getting 2450 for my apartment.'",
        "'speaker_2': 'When I rented it four and a half years ago, my rent was 1500. It's now 1800. So come October, when my lease is up, I'm looking at nearly $1,000 rent increase in less than five years. So I'm scared, I'm desperate, I lose sleep.'",
        "'speaker_2': 'And I just beg you guys to, like, consider some enforcement authority for the rack. So thank you.'",
        "'speaker_0': 'Thank you. Bill Smith and then Pamela Tozer. And then. And Mike Harrigan.'",
        "'speaker_3': 'Mayor Spencer and council members and staff. I'm Bill Smith speaking on behalf of renewed hope. And as we've heard from the last speaker to thrive or community service workers who wait tables, who design shoes, who work in retail and clean our schools and stores.'",
        "'speaker_3': 'Rents, though, are rising faster than wages paid to the providers of these services. They threaten the fabric of our community. As was just heard in very elegant testimony. Rents are rising because many of us are thriving in the tech business and the tech businesses are expanding.'",
        "'speaker_3': 'There's money available. It will take time, though, for this money. The fortunes of the tech world to trickle down to retailers, restaurants, government, north face workers, allow them to pay wages to cover the increased rents will take time to build new housing to satisfy the increased demand.'",
        "'speaker_3': 'It takes almost no time for rents to rise and evict the service workers. The service workers need to suffer have buried a disproportionate share of the cost of accommodating the new workers and the success of the region. To thrive in our communities, governments, retailers, restaurants and other businesses to raise wages of service workers while housing providers moderate'",
        "'speaker_3': 'rent increases until those wages rise. I. I thank the city for leading the way by raising the wages of service workers at the Davis Street Transfer Station earlier this year. I urge the city to continue to assist our most vulnerable citizens by passing this ordinance.'",
        "'speaker_2': 'Greetings, Mayor. Council and staff. My name is Pamela Tozer. I shared a brief version of my story in support of site. You may recall that my 12 year old daughter and I share a room and a bed in an apartment that, due to rent increases is now.'",
        "'speaker_2': 'The rent is now more than half my income, half my monthly income. I also have a 20 year, 26 year old son who, through economic displacement in Alameda, found it necessary to move out of state and is awaiting the return of affordable housing.'",
        "'speaker_2': 'If my rent were to increase any further, I fear my fate would be the same for my daughter and myself. As a resident for over ten years, that would devastate my daughter. We moved here when she was two.'",
        "'speaker_2': 'You have seen her. You've seen her in The Nutcracker on the stage at Kaufman. You've seen her play soccer at Lincoln. At Lincoln Park, T-ball at Riddler Park and softball like Russi. You've also seen her sailing in the bay and in the estuary.'",
        "'speaker_2': 'We want nothing more than to remain in our home while we await the construction of affordable rental housing. I am not alone in my desires or concerns. Elderly, disabled and other single parents. We feel exposed and vulnerable and without protection and care.'",
        "'speaker_2': 'I believe strengthening the RAC is a great first step in establishing community stabilization. Personal Security. I encourage you to look at all innovative solutions to help Alameda renters. Thank you.'",
        "'speaker_0': 'Thank you. After and we'll be Barbara Price than John Spangler and then Garfield can cross.'",
        "'speaker_2': 'Good evening. Good evening, Madam Mayor. Council and staff and just, you know, Barbara did have to leave, so she will she won't be here to speak. I'm here this evening to encourage you to support these ordinances in strengthening the rack.'",
        "'speaker_2': 'The work they have done in the past has been beneficial to many, and I think the strengthening of the verbiage will help it, especially in the fact that it helps level the playing field requiring the landlord to attend.'",
        "'speaker_2': 'So often in the past that has been part of the problem is, is that the other side just didn't need to come and never did. And so I think that that's a valuable part. I also think that it's very important to accept as written in the sense that there is no specific percentage noted because markets do change'",
        "'speaker_2': 'and what may seem reasonable today may be extremely unreasonable in the past. In the future, I mean, we've had times where any kind of an increase may not be reasonable. So I think this allows the rack to be able to react to the to react to the market as it is at that point in time.'",
        "'speaker_2': 'I also want to thank member Ashcraft for asking to look into the the issue of borders in the sense of somebody who's living in your house renting a room. What? I'm not an attorney, but my understanding is those laws are quite different than those covering renters.'",
        "'speaker_2': 'So it may be that actually the act does not even cover those at this point in time. And I think it's really important that that that's that we are.'",
        "'speaker_10': 'Again ensuring that whatever ordinance we are writing, it is not in conflict a law that is already on the books. Thank you.'",
        "'speaker_0': 'John Spangler. And then Garfield came across and then Karen Bay.'",
        "'speaker_3': 'Thank you very much. Mr. Spencer, members of the council staff and fellow renters. It broke my heart to hear Annette's 3 minutes of comments here a minute ago. We will be losing a wonderful person from this community. If she is forced out of here and she unfortunately is not alone.'",
        "'speaker_3': 'My wife and I had been feeling the same pressure for the last five years because we are now renters instead of homeowners. The imbalance of power is really obvious when you change that one from one side of the fence to the other.'",
        "'speaker_3': 'And it's really disturbing. This ordinance even weakened as it is in the last 60 days and relatively. Ineffective to start with because it does not include rent control is still going to help a little bit and we'll take it.'",
        "'speaker_3': 'I encourage you to pass it tonight. But there's still no way to legally stop egregious rent increases and robber baron behavior on the part of people who happen to own property. And it just stinks. The United Nations holds that decent housing is a human right.'",
        "'speaker_3': 'And that's a little different than the free market seems to be able to accommodate. With the referral back to staff. The original implementation date of this ordinance will be six months later than it would have been. That's six more months of stories like Annette's.'",
        "'speaker_3': 'And journalists and unfortunately, a lot of nameless people who have just given up and left. I want to close by reiterating the points that Angela Hawk about who I wish was here tonight. Stated in her email. One. Make an application to the rack.'",
        "'speaker_3': 'Trigger an inspection by the Planning Department, the building department, to ensure that any unit in question is up to code. To institute a moratorium on rent increases in the city of Alameda. Three require landlords who give tenants 30 and 60 day notices to vacate to provide moving assistance.'",
        "'speaker_3': 'That's reimbursement for moving costs and the full replacement of the security deposit. Those are not rent control, particularly either, and they're not enough either. But those should be considered and adopted as soon as possible. We are far from done.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Mr. Ken Cross.'",
        "'speaker_3': 'Hello. Good evening, mayor. And City Council members, I. Recently applied to the RAC and. Mayor. You saw the turnout for that. We received some recompense through the through the rec committee. However, you know, the landlord has no binding agreement, you know, or an obligation from the city to participate.'",
        "'speaker_3': 'We we had a difficult time getting his presence to be here. And I spoke to the other owner. You know, they had lots of people come out to the health department after I complained for four years to this landlord in writing about three different times over the over the past two years.'",
        "'speaker_3': 'Termites in the they they rendered our balconies unsafe. So due to the balcony collapse that that took place recently in the news they were ready to do this in in a you know, expeditious manner, which, you know, I'm glad they did that.'",
        "'speaker_3': 'But but they were very reluctant and even sort of laughed off the idea of a city mediation body like the RAC. And I still feel the pressure because there is no binding agreement for, you know, that that allows these laissez faire Ayn Rand types to, you know, use the market as, you know, as as their as their'",
        "'speaker_3': '. You know, it seems like they're using it as a weapon on the middle class. You know, and I'm just I'm just tired of that. It shouldn't happen in the United States. You know, it's like it's like a leveraged overthrow of of democracy.'",
        "'speaker_3': 'You know, and this is serious to me. I've studied these aspects of of history quite deeply and. And I'm just appalled at that type of thing happening throughout the country. I'm an advocate for some more regulation. You know, there's deregulation taking place overall over the last several years in the banking sector, the financial sector.'",
        "'speaker_3': 'The tech sector is is at the helm of appointing, you know, people in big governments to do things in India like Narendra modi, bring it back, child labor or, you know, it's just and these things that are happening are just overwhelming to tell you in 2 minutes or 3 minutes.'",
        "'speaker_3': 'But I feel I feel the effects of this. It's like a war on the weak, you know, it's like what happened in Weimar Germany to a certain extent. Thank you very much.'",
        "'speaker_0': 'Thank you. Erin Bay and then Susan, Laura and then Laura Thomas. If you want to speak on this item, please turn in your slip.'",
        "'speaker_6': 'Good evening, Mr. Spencer. Members of the City Council staff. My name is Karen Bass, and I'm a landlord. In this city, I've been a tenant as well. And I'm here tonight to urge you to approve the two ordinances before you and then move swiftly to form some kind of a taskforce to discuss the next steps.'",
        "'speaker_6': 'The city of Oakland and the city of San Francisco did a joint conference a few months ago to discuss the housing crisis, and in that conference, they shared some of their shared ideas on some of the other tools that can be used to address the housing conference I'm sorry, the housing shortage crisis.'",
        "'speaker_6': 'And then they each went back to their respective cities and began to implement some of those. One of the ideas. It's a note. Examiner Today, San Francisco Examiner on page four, new strategies to address the housing crisis. And I know this might be a little controversial, but it's actually a great idea.'",
        "'speaker_6': 'But what they're proposing to do is to approve some of the sort of granny units that have been deemed illegal for some reason and give those housing providers an opportunity to make them legal and provide affordable housing. And they would go into a housing affordable pool.'",
        "'speaker_6': 'Now, this is not city wide. They're doing it. They just selected certain districts. But that's just one of the tools. And they they they they believe that this could create thousands of housing units immediately. And so these are the kind of tools that we need to look at.'",
        "'speaker_6': 'There are a lot of possibilities. I have some great ideas myself, and I would like to be part of that task force. But I think people need to see us working together to solve this problem. And I do believe that there are a lot of great ideas out there and I would love to discuss more.'",
        "'speaker_6': 'But please, tonight I approve the two ordinances. Thank you.'",
        "'speaker_0': 'Thank you. Susan.'",
        "'speaker_2': 'Good evening. We are definitely the bottom of the barrel at this particular point because we are landlords. I was born and raised in this town, as were my parents, and I love this place more than any place else I've ever been and always come home.'",
        "'speaker_2': 'So the one question that I have for the proposed study is that going to include the owners who have worked and have. Gone in and you know. Gone into hock to buy a place in the last 15 years, especially before 2008, and then still hung on.'",
        "'speaker_2': 'Are they are they going to be and are we going to be included in this so that we get our point of view across, too? I'm not saying that rack and this ordinance, both of the ordinances, I think they're a wonderful idea.'",
        "'speaker_2': 'And I think on a case by case basis that rap could do some wonderful things, but it needs to be a case by case basis. 20% increase from $1,000 or doing a 400% increase over the course of, you know, five years or whatever.'",
        "'speaker_2': 'It's ridiculous. No owner should be doing that. But they also have to be able to do what they do. They're there. We're in it for business. We're not. We're in it to make money to support our families, to help them out, too.'",
        "'speaker_2': 'This isn't just a one way street that we're coming in and doing this. Going in with a full replacement of security deposits is unfair. A full replacement of a security deposit because you've asked somebody to leave because they damage the property would be totally unfair to the owners.'",
        "'speaker_2': 'I mean, you know what? If they're just really bad neighbors, would you want them in your house? Because I'll be happy to move my bad neighbors right into your house. I'll even help them pack. But if they're in there and they've knocked holes in my walls, ripped up my carpet because they didn't like the color and laid'",
        "'speaker_2': 'down something they did. No. I deserve to get those damage deposits taken care of and done properly through the state of California rules that we have. So to to take it out on all owners isn't correct. But we definitely need to do something to cover everybody, including the owners.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Laura Thomas. And then Carrie Thompson. And then she's our last speaker.'",
        "'speaker_10': 'Good evening, Madam Mayor and members of the Council. I'm Laura Thomas. Renewed Hope Housing Advocates. Of course we support this small boost to the powers of the Rent Review Advisory Commission. It's the result of a lot of work and goodwill on the part of both renters and the conscientious landlords in Alameda.'",
        "'speaker_10': 'And it ought to be approved tonight. I feel like I'm a kind of a broken record on this issue. But I thought I'd come one more time and say that renters in this town deserve more respect and they need a lot more protection than this minor change to the powers of the Rent Review Advisory to what the'",
        "'speaker_10': 'Rent Review Advisory Commission can now provide even with this. I think if we don't. Deal with this crisis than we're going to be in the same situation as Healdsburg is in at some point. And if you read the page one of the Sunday Chronicle, you would read about Healdsburg and how the hollowing out of that community from'",
        "'speaker_10': 'a rapid shift to wealthy people, some of whom mostly bought second homes there. I mean, they 42% of the population of Healdsburg has been there less than 14 years. And they may contribute to the tax base with what they spend on wining and dining over the weekend.'",
        "'speaker_10': 'But the city is a mere playground for them and they don't really contribute time. They don't even seem to be contributing their money and to community organizations. And the public school enrollment is dropping because obviously their children aren't going to school there.'",
        "'speaker_10': 'And I think when school enrollment starts to go down, then, you know, your your community is dying. And we're losing a lot of children through this rent crisis. What happened to them rapidly could happen to Alameda, perhaps more slowly.'",
        "'speaker_10': 'And we don't want a shell of attractive community. We want a real one. And I think it's crucial to stabilize the rents in this town and provide more power to one half of our residents or will become like Healdsburg historical lovely old homes redone for magazine features, but with no real people and no real place to live'",
        "'speaker_10': '. Thank you.'",
        "'speaker_0': 'Thank you. Carrie Thompson is our last speaker on this item.'",
        "'speaker_2': 'Thank you, Madam Mayor. I Kerry Thompson. I am the immediate past president of the Almeida Chamber of Commerce, and I do support staff recommendation to pass these ordinances to help Alameda renters and to help landlords understand some of the burden that is on renters.'",
        "'speaker_2': 'Believe me, I have been a landlord. I've also been a renter. I am a homeowner. I've experienced all of those hats. And I feel like right now that frankly, landlords are being vilified. And that is not exactly a fair representation of all landlords.'",
        "'speaker_2': 'Yes, there are nasty landlords out there. There always have been. There always will be. But I believe that the RAC will help that situation and correct that situation. I really appreciate the fact in there. Councilmember O'Day and I were talking earlier today that, in fact, if the landlord does not show up to the hearing, nothing can happen'",
        "'speaker_2': 'for a year. No increases can happen. So I think that is a big step for the renters there. It also encourages the landlords to be more involved in what is going on with their tenants. I think some of the things that were requested are a little beyond the scope of rec and should be beyond the scope of'",
        "'speaker_2': 'rack because there is you can't control what people do with their rental property, just like you cannot control what they're doing with their own home. So to put some of those restrictions on those as far as requiring them to pay for somebody to move for an inspection, that it unless there are health reasons or something, I think'",
        "'speaker_2': 'you're kind of would be stepping outside the boundaries there. But I do encourage you to pass this ordinance because it is long past time for the renters here. Thank you.'",
        "'speaker_0': 'Thank you. All right, counsel. Russian comments.'",
        "'speaker_3': 'Right.'",
        "'speaker_0': 'And vice mayor.'",
        "'speaker_3': 'Yes. I'd like to resolve this point that was brought up about the housing unit, because really, this is a the way I read this, this is a ordinance that protects the rights by rent review advisory commission between a tenant and a landlord.'",
        "'speaker_3': 'And in some respect, the definition of housing unit is not material to that. If you. Read The definition of tenant. Because it does say any person having legal responsibility for the payment of rent or residential property. So that could mean a room that could be in a housing unit.'",
        "'speaker_3': 'So as long as that's resolved. And I'd like. The attorney and the staff to make sure that there is no unintended consequence of the definition of. Housing unit that precludes that resolution of of an issue between the landlord and tenant.'",
        "'speaker_3': 'Otherwise, I'm ready to vote for the first reading of this ordinance.'",
        "'speaker_2': 'So if there is a consensus on that council that you would like to cover, as has been the procedure to date rooms as well as for units, I have a suggested modification to the ordinance that if that if you're interested in hearing that, I'm I can share that with you.'",
        "'speaker_5': 'Well, and before Miss Potter gives us that suggested modification. I agree with the vice mayor that I would like to know from the city attorney's office, is there any legal reason that we couldn't do that?'",
        "'speaker_2': 'Not that we're aware of.'",
        "'speaker_3': 'And that was my my request was because this is truly the relationship between a landlord and tenant, not the relationship of whether there's a kitchen associated with the room or not. So, again, I think the the definition of housing is immaterial.'",
        "'speaker_3': 'However. I want to make sure that there's no exclusion because someone doesn't live in the housing unit as we defined it. So if they're paying rent under a contract with to a landlord. There should be protections and vice versa.'",
        "'speaker_2': 'So the suggested change, which I have worked on with our assistant city attorney, is as follows. So what we what we would recommend is that the definition of housing unit B be deleted.'",
        "'speaker_0': 'From page three.'",
        "'speaker_2': 'Yes, on page three. And that the definition under residential property, which is further down. So it would read that residential property means any housing unit, including a room or group of rooms designed and intended for occupancy by one or more persons or a mobile home.'",
        "'speaker_2': 'And so that would then capture. That would all be captured under the definition of a residential property, and we would delete the definition of a housing unit. And so that so that has been vetted with with the.'",
        "'speaker_0': 'Thank you very much. I would agree with that proposal. Any member would.'",
        "'speaker_4': 'Agree with that, too, because I could see. I understand the vice mayor's point, but as an attorney, I could argue that, you know, housing unit, because it was added, you know, we took the special time to figure out what a housing unit was.'",
        "'speaker_4': 'And even though we defined tenant, we further defined housing unit and we specifically excluded these these rooms from housing units. So therefore, we intended not to include them. Plus we had a discussion about it. So, you know, I could see where an attorney that's worth his or her salt can, you know, can.'",
        "'speaker_4': 'Can argue that we didn't include intent to include those. So I supportive of that amendment.'",
        "'speaker_0': 'All right. So do we have any other comments before we have a motion? A member? Odie.'",
        "'speaker_4': 'I'm sorry. I just have a couple of comments. Miss Potter, can you kind of explain again in December what this council is going to be receiving as far as data and a report?'",
        "'speaker_2': 'Yes. So the direction that was given to staff previously was to undertake a study that will be looking. It's a quantitative study that will be looking at the impacts of rising rents in Alameda, on Alameda renters, and that that is the analysis that is being looked at right now so that we're the consultant will be looking at'",
        "'speaker_2': 'impacts by tenure, by gender, by age, by race, ethnicity. And we'll be looking there was a number of points that the council asked us to study regarding the impact on rising rents. And then the council also directed us to look at some next steps in terms of policy recommendations based on that quantitative data so that our analysis'",
        "'speaker_2': 'will include some some next steps recommendations.'",
        "'speaker_4': 'And if we find that there is widespread rent increases that are outside the range of affordability for a tremendous amount of our tenants, can can that report include the analysis of this moratorium, this Berlin type rent freeze that that some of the people have brought forward today?'",
        "'speaker_2': 'Yes, we can include an analysis of that idea.'",
        "'speaker_4': 'And other ideas that have been put forth, because rent control is not the end all, be all in solving the issue of rising rents. And, you know, I would contend that it probably doesn't work in places where it's intended to, but we still have the issue whether or not we have it rent control or not.'",
        "'speaker_4': 'So I'd like to see a wide range of policy options that we have as a council to try and address this issue. If it turns out, as most people in the audience are telling us, that it is a widespread issue.'",
        "'speaker_2': 'Yes, we can do that as part of the report. And I would just also like to remind the council that the ordinance requires staff to come back and report annually on on the implementation of the ordinance. So we will also have those data points 12 in 12 months.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_4': 'And one.'",
        "'speaker_2': 'Other member Sorry.'",
        "'speaker_4': 'And then I apologize. So on the the ordinance for the Iraq as far as the. The selection of the the members now that we're giving this body a little more teeth and it actually has, you know, some enforcement authority as to instead of just, you know, a simple well, you may participate.'",
        "'speaker_4': 'You may not participate. You know, I wonder if it makes sense that the council and the community have a little more input in selection because we're already. Pigeonholing certain seats for, you know, landlords, some for tenants, you know, some for for the other category.'",
        "'speaker_4': 'You know, if if we could have some, you know, public application process where, you know, we vet we have public applications for this and Berkeley these are elected. I mean it's a rent board are granted they have rent control and a lot more authority.'",
        "'speaker_4': 'But you know, I think the public would be better served in this council would be better served if for this particular board that it's a more public where we have applications, you know, perhaps we have interview public interview with the council asking the potential member because, you know, these individuals are going to have an impact on potentially'",
        "'speaker_4': '51% of our population. So that that's my my suggestion on the selection. I mean, no offense to anybody's ability, past or future in selecting these people, but I just think it's something we should have a little more public input in.'",
        "'speaker_0': 'Remember Ashcroft.'",
        "'speaker_5': 'So in addition to the comments I was about to make, I would wholehearted, wholeheartedly endorse the suggestion that Councilmember Odie just made. I, I actually have been thinking that that is a process and it's a process followed in other cities, choosing their representatives to boards and commissions that it isn't the way we do it in Alameda, where'",
        "'speaker_5': 'the mayor appoints and the council basically rubber stamps. But all of the applications come to all the council members. The interviews are actually held in public so the community can see and hear, too, and then the whole council votes on it.'",
        "'speaker_5': 'And I do think now that we're putting some well-needed teeth into the RTC and the governing ordinance, that we should give serious thought to that. So I don't know, is that a council referral coming back in the fall member Odie, or you'll think about it over a break.'",
        "'speaker_3': 'Well, you know.'",
        "'speaker_4': 'I was just specifically talking about this particular commission, the.'",
        "'speaker_3': 'Iraq.'",
        "'speaker_5': 'Right, and we should stay on topic now. So let me go to the comments I was going to make and I know I said this last time this came up before us in May that I had then recently heard a forum on NPR.'",
        "'speaker_5': 'And I think I sent some of staff the the link. But the mayor, Libby Schaaf of Oakland was speaking and I've actually met with the director and assistant director of the Housing Authority, and we started to explore it's a state law and it allows a landlord who is willing to commit to having his or her building.'",
        "'speaker_5': 'And it might not even have to be the whole building, but a certain percentage of it rented to low income. As that is, that term is defined in state law. Residents for 35 years would enjoy certain tax breaks.'",
        "'speaker_5': 'So when we're looking at possible ways to address rights.'",
        "'speaker_2': 'So you had brought that up at the last meeting and we have incorporated those proposals into the work scope for the consultant to analyze and come back to us.'",
        "'speaker_5': 'Glad to hear that. Thank you. And and I would just say that I was poised and ready to support this last time around, as I am today. But I do want to just touch on a couple of comments that were made that we don't mean to vilify one half of our population or the other.'",
        "'speaker_5': 'Well, landlords are exactly half of the population, but renters are a little more than half. We will only find good, workable solutions if we all work collaboratively and avoid accusatory kinds of language and actions. And I do think, as has was we've seen in the past, a few bad apples will spoil the barrel.'",
        "'speaker_5': 'And that's why I really applaud the proposal to require to actually put teeth into requiring the landlord. I know there's another name, property owner or whatever it is, or someone who has authority to actually act to be at those hearings.'",
        "'speaker_5': 'So once that happens, I think, you know, you'll you'll see some improvement. And then with the statistical data that you're collecting, I think we'll have an even fuller picture of what's going on. But I do I, I appreciate the anecdotal evidence that comes before us, but I think, you know, we all need to remember that there are'",
        "'speaker_5': 'some very decent landlords out there. They've actually been working hard with their fellow landlords who aren't so decent to try to bring them around. And anyway, I applaud everything staff is doing and I hope the council is prepared to move this forward tonight.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'I spare.'",
        "'speaker_3': 'Time for a motion.'",
        "'speaker_5': 'Or.'",
        "'speaker_9': 'I'll just make a quick comment if it's okay.'",
        "'speaker_0': 'Yeah. And you can make a comment after emotion.'",
        "'speaker_3': 'Do you want to make a move? I'd like to move that. We approve the first reading of this ordinance with modifications as stated by Ms.. Potter, that is, to remove the definition of the housing unit and the modified definition of residential property to include a room that is rented for habitation.'",
        "'speaker_9': 'I'll second second as well.'",
        "'speaker_0': 'Comment Member de sa.'",
        "'speaker_9': 'Thank you. Well, thank you very much for the members of the public, particularly those who are very involved in this process that has gone on for several months now. This doesn't solve everything, but from what I can see is a pretty well measured, calibrated approach to the rental housing crisis, with the caveat that there is going to'",
        "'speaker_9': 'be more work that needs to be done and the sooner rather than later. But it's a good start. So I certainly would like to join council members in supporting the the ordinance that's before us this evening.'",
        "'speaker_0': 'I also want to thank Jeff Canberra. There are many, many meetings along with the public members that participated to arrive at this. I also want to thank staff. It was important for staff to spend time reviewing it. There's a lot of work put into this, as well as trying to make it as legally sound as possible with'",
        "'speaker_0': 'that.'",
        "'speaker_4': 'Kind of information.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'That is okay. This is just the first.'",
        "'speaker_3': 'Rent review ordinance.'",
        "'speaker_0': 'All right, all those in favor. I oppose motion carries unanimously. Thank you.'",
        "'speaker_2': 'The staff is also requesting that the Council introduce on first reading the ordinance, codifying the rec in the municipal code.'",
        "'speaker_0': 'And remember, Ashcroft.'",
        "'speaker_5': 'I was going to move. But our second.'",
        "'speaker_0': 'Discussion. I want to thank staff for doing this work. This is something that many of us thought had been done years ago. And we learn by going through this process that had not been codified. So thank you, staff, for bringing this forward with that.'",
        "'speaker_0': 'All those in favor I.'",
        "'speaker_5': 'He's the landlord. Mr. De SA recused himself because he is a landlord.'",
        "'speaker_0': 'Motion carries unanimously. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And now we have 60. We're going to see 61st and we're go back to six. See for those of you that weren't here earlier.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'Several actions for the master plan for the Del Monte Warehouse Project, which was approved in December 2014, including subdividing the property, authorizing an agreement to transfer certain city owned land to the housing authority, and outlining the required rent to develop affordable housing unit by adopting two resolutions and introduction of an ordinance.'"
    ],
    "Del Monte Warehouse Project: Subdivision Map, Land Transfer and Affordable Housing Actions.": [
        "'speaker_3': 'Yes.'",
        "'speaker_8': 'Good evening, Mayor Spencer, Vice Mayor Matt Rossi, members of the council. My name is Andrew Thomas, city planner. We're here before you tonight for three subsequent actions implementing the Del Monte Warehouse Master Plan. I'm going to quickly go through a number of slides, two or three slides, and I'm going to hand the podium over to Victoria from'",
        "'speaker_8': 'the Housing Authority, who is going to do the last couple of slides for us tonight. This is a basically a joint presentation between myself and the Housing Authority. And then we'll both be available to answer questions. Just to remind everyone, the project we're talking about is the Del Monte Warehouse Master Plan.'",
        "'speaker_8': 'This was approved by the council in December of 2014 and included a development agreement. Just a couple of the highlights from that master plan focusing on the major public benefits. The plan, of course, includes the preservation of this city monument.'",
        "'speaker_8': 'It's privately owned, but it's a designated city monument. It's also on the National Register of Historic Places. So it's preserving this building for future generations. It's a mixed use plan with 380 units spread primarily within the main building, but also two smaller pads that we'll be talking about tonight.'",
        "'speaker_8': 'Within the total project, it includes 55 affordable housing units. And tonight, we want to focus on the affordable component of the project. It also includes the major public improvement capital project. That's the extension of the Clement Avenue from Atlantic to Sherman behind the building.'",
        "'speaker_8': 'And it included $2 million for Jean Sweeney Park. So I just quickly update you. We've had a busy six months since that approval. Working to implement that plan and everything so far has gone as planned within. Within a few weeks of the approval, the development team transmitted the first $300,000 installment of the 2,000,004 Gene Sweeney Park.'",
        "'speaker_8': 'And you are very capable. Parks and Recreation Department also submitted applications for matching grants. And I think I can. I can announce that they were successful and quickly turn the $2 million contribution from the development from this development into a matched it with a 2 million state grant.'",
        "'speaker_8': 'It was state state grant. So with the private 2 million plus the state 2 million. And I think you also have another 2.5. We now have the city has $6.5 million for the improvement at that park, which is a major accomplishment.'",
        "'speaker_8': 'We are also been working with Wind River, which is owned by Intel, I believe, on the acquisition of the land for the Clement Avenue extension. Some of that land to complete the road. The developer needs to buy some land from Wind River.'",
        "'speaker_8': 'So those those negotiations are ongoing. I personally have had a few meetings with the representatives. They fly out from Boston occasionally because Wind River is owned by Intel. They're actually going to be here tomorrow. And they did want me to pass on a message to you that although they couldn't be here for tonight's meeting, they are very'",
        "'speaker_8': 'pleased about the idea of the Clement Avenue extension, and they plan to have their negotiations done with TLC. That's Tim Louis Communities, who is the project developer very soon there. They're also anxious just to complete those discussions. It's going to benefit the Wind River campus as well, provide that second access the as part of their original plan'",
        "'speaker_8': 'or the master plan that was also imminent. You will remember a lot of discussion in the neighborhood about parking, and there was a sequence of studies that needed to be done. And the first study where the development team and staff worked with the neighborhood to create the baseline study structure and that initial study was completed.'",
        "'speaker_8': 'It's really just creating the baseline so that when the project starts to develop and when it's complete, they can go back and redo the study and see if there's been an impact on the neighborhood for parking. Then in May, the planning board approved all the approved the next phase, the design review phase for the affordable housing, which'",
        "'speaker_8': 'was what was the very next step that we had laid out in the master plan. They also recommended that the planning that the City Council approve the tentative map, which is one of the actions tonight. And I just also wanted to report I know there was a lot of conversation in December and January about the fact that'",
        "'speaker_8': 'we had phase three approvals and didn't have all of the density bonus materials in hand in December because of the phase nature of the project. All those materials are now complete and and we're moving on. With this project.'",
        "'speaker_8': 'So tonight, three actions. The first one, the tentative map. This basically just implements the plan. This is a drawing literally from the master plan. And it shows how this parcel, which is a little over nine acres, will be divided into seven lots.'",
        "'speaker_8': 'Three of them will be for actual development. The first is Lot A is, of course, the building itself. B is a parcel at the roughly at the corner of Sherman and Bueno Vista. And I just want to point out, you'll see on the drawing there's one I got a piece there which is shown with a yellow arrow'",
        "'speaker_8': '. The stimulus community owns the top half of B, the city owns the bottom half of B, so the map does not deal with the city piece. It's just subdividing the land that's owned by Tim Louis communities. And then C is a third vacant pad for future development.'",
        "'speaker_8': 'And then it creates four lots for for the roadway network. It's no different from what was anticipated in the master plan but sets up and helps to finance the project. And phasing of the public infrastructure so that where for example when we build clement and just remind the council and the public when Clement is built, it's going'",
        "'speaker_8': 'to be deeded back to the city as a public road. So where we're trying to set up the later conveyances of property between the city and Telus communities as well. On the public infrastructure. The second item. So the planning board unanimously recommended approval of the tentative map.'",
        "'speaker_8': 'And that recommendation was, of course, to the city council who has final authority on that tentative map. I just wanted to now zoom in to that left hand corner at Sherman and Buena Vista. And this is the second item we're recommending that the council enter into a purchase purchase option agreement with the City of Alameda Housing Authority'",
        "'speaker_8': 'for the small piece of land that the city owns right at the corner of Sherman and Bueno Vista. And it's shown on this drawing as the sort of parcel a it's approximately just under half an acre. It's right on the corner of of the of the project.'",
        "'speaker_8': 'It used to be an old railroad right of way. And then the city always owned a little piece on the corner there as well. Well, the railroad actually had an easement across city property at that location. So the idea here is that the city would convey or provide an a purchase option to the housing authority for that'",
        "'speaker_8': 'little that little corner piece identified as a on the map. If the city if the city council approves the first reading tonight of that option agreement and it does require four votes, then what Tim Lewis is going to the developers will do is they will convey parcel B just to the to the above it to the housing'",
        "'speaker_8': 'authority as well. And what that will then do is give the housing authority the two pieces and essentially just under an acre of land, 0.8 acres upon which they will be building 31, very low and low income housing units for seniors on this site.'",
        "'speaker_8': 'So that's the gist of the purchase option agreement. Of course, if the housing authority is unable to acquire the financing, Tim Lewis is giving them land. They're also giving them cash and doing all the infrastructure to support the pad.'",
        "'speaker_8': 'Housing Authority will be applying for tax. Tax credit. Thank you. That's a tax increment. No, it's not tax increment. It's tax credits financing for this project. But if they fail or for some reason the project does not proceed as we have planned, of course, because it's an option agreement, the land would then come back to the city'",
        "'speaker_8': '. So if the project doesn't work, for some reason you would be getting this land back and we're available. The city attorney's office has been very involved in this document, as well as the housing authority. So we're all available to answer more questions.'",
        "'speaker_8': 'I won't get into all the details on it tonight. Senior housing, senior affordable housing on that corner. We were we are very excited about this. Throughout the Del Monte planning process with the neighborhood, there was a lot of discussion about how nice it would be to have seniors living on the site for a variety of reasons.'",
        "'speaker_8': 'They have a very low parking impact. Once again, parking was a concern. So senior housing is always nice from a traffic and parking perspective. It also implements a citywide need. Just in 2014, the city updated its housing element.'",
        "'speaker_8': 'As you probably remember, we did it just two years prior in 2012. So the city staff approach was, okay, we just this will be a quick update. The one policy issue that everybody in this community, the planning board, the housing commission, everyone sort of said, hey, not so fast, staff.'",
        "'speaker_8': 'There is a major policy need in this city and it's about senior housing. So it's great to be coming back in six, nine months with a senior housing project. The master plan also anticipated on these two outer pads, and this would be developed on one of them, a, you know, buildings up to 55 feet.'",
        "'speaker_8': 'And that generated a little bit of concern in the neighborhood. It was like, okay, maybe that, but it feels a little tall for that corner. This project is coming in at 37 feet in height. So, you know, it's a little bit less of a visual impact on the neighborhood.'",
        "'speaker_8': 'We're also are pleased from just from a senior housing perspective. We, as you all know, we have an DIAMANTI project at the end of Park Street on the East End, 62 units. We have, of course, Independence Plaza on the West End, 186 senior units.'",
        "'speaker_8': 'And Del Monte is sort of very nicely situated, right, kind of in central Alameda. So it just feel felt to us that this was just a great fit for senior affordable housing. And then at this point, I'd like to turn the mic over to Victoria Johnson from the Housing Authority, who is going to finish it out.'",
        "'speaker_2': 'A good evening, mayor. Vice mayor, members of the council, members of the public and staff. Thank you. My name is Victoria Johnson. I'm the director of development and housing at the Housing Authority. We were first approached the housing authority was first approached by Tim Lewis communities last summer.'",
        "'speaker_2': 'It's been over a year since we've been working on this project. We were very excited. We were actually very surprised. We were asked if we'd be interested in partnering with Tim Lewis communities to develop an affordable project. And we we staff went to our board board of Commissioners and the board agreed that that was a great opportunity'",
        "'speaker_2': '. At that time, we had not made the decision whether the units would be family or affordable. But looking at our own community opinion, looking at our housing need, looking at our own waiting lists, listening to discussions right here at city council.'",
        "'speaker_2': 'And based on all of that, we went back to our board and asked if we could proceed with a plan for senior housing, and the answer was yes. So our Board of Commissioners is very supportive of senior. That does not mean that there is not an equal demand for family housing, but we have to make a choice'",
        "'speaker_2': 'because no matter which funding program we use, it's necessary to define one or the other family or senior. And we made that choice that we would ask for authority to develop a senior project. So I want to talk a little bit about what type of senior projects the Housing Authority would develop and operate and focus on the'",
        "'speaker_2': 'service enrichment that's available to folks that will live in this community. The building itself will have a community center, a computer lab, a lobby designed for congregating a covered patio for outdoor recreation. And there's a courtyard that is designed for mild exercise for folks that are much very mobility impaired, but still need to get out every day'",
        "'speaker_2': 'and get some fresh air and exercise. We've actually designed the courtyard so there's a pathway and you can walk a small distance around the courtyard. We have a lot of experience in the housing authority in senior communities. We spent an extensive number of hours working with the architect to talk about ways that everything from the trash room'",
        "'speaker_2': 'to the laundry room will be designed to accommodate seniors. All of the units will be accessible. They will not be 100% ADA compliant. Only a percentage will be. But all of the units will be accessible wide doorways, showers, not tubs, grab bars, a wide range of of facilities that allow residents to age in place.'",
        "'speaker_2': 'We now, as Andrew mentioned, do have two older properties. And in particular, the oldest of the properties was built in the sixties and it was not designed for aging in place. And we have to very often go in and make physical adjustments to those units.'",
        "'speaker_2': 'So we we now understand people live longer, people want to stay at home. And so we really have been able to design this project to accommodate that those long lifespans and an active life lifespan as well. Within the building.'",
        "'speaker_2': 'We will also have senior services. The there will be a licensed licensed social worker available to the residents. They'll also be a regular part time, not a full time, but a regular there perhaps as many as five days a week, half time social services coordinator who will do everything from planning poetry readings and parties to making sure'",
        "'speaker_2': 'that the residents have the services, the connection to the services that they need, which is potentially meals assistance with housekeeping, the medical referrals that are necessary. So we have very experienced social providers who are used to our senior population, and this will be available to all of our residents.'",
        "'speaker_2': 'We will also make ample use of the code required capacious bicycle storage area and we will have, we want to say will have senior tricycles so that people can check out bicycles, tricycles and and take advantage of the great weather and the nice level sidewalks.'",
        "'speaker_2': 'The property itself is part of the larger Del Monte project. And so there'll be an opportunity for people to stroll over to Littlejohn Park. This drawing to the left, their shoes, you'll see there's a kind of pink crosswalk highlighted in the upper left, and it's just walking across two lanes of traffic, 26 feet.'",
        "'speaker_2': 'You can cross over from the sidewalk in front of the senior building to the main building. And there's actually two crosswalks and it's about 500 feet to walk to the proposed retail uses. Those uses have not been specifically defined, but we're assuming it'll be a coffee shop, a dry cleaner, and maybe a bookstore, some or something.'",
        "'speaker_2': 'That would be a reason to walk. And so we think that's a great opportunity to get out and about and meet friends. And we'll also be a number of outdoor recreational areas. And then of course for the very active, there'll be a trail into the soon to be developed Jean Sweeney Park and so some of our.'",
        "'speaker_2': 'Seniors will be we assumed jogging through Jean Sweeny Park for for real active lifestyle. So we generally we just think it's an amazing location. This is a tremendous opportunity. The Mastic Senior Center is just a few blocks away.'",
        "'speaker_2': 'We couldn't have asked for anything more perfect in terms of location for seniors. And next slide, I push. Thank you. Okay. So that is a description of the site. And of course, we can answer questions if there are additional questions that Andrew mentioned, that there are three actions being considered tonight.'",
        "'speaker_2': 'So the third action is to approve the affordable housing agreement. This agreement is a fairly standard part of each one of the affordable projects that's been developed over the really the past 20 years. Every inclusionary project within the city has a governing affordable housing agreement.'",
        "'speaker_2': 'It is the regulatory agreement that mandates affordability for 59 years, and it also specifies the nature of the income targeting. So in this in this example, it will require 31 affordable rental units that they remain affordable for at least 59 years and that there be 17 very low and 14 low income units.'",
        "'speaker_2': 'With housing authority ownership, it is nearly certain that the affordability will be perpetual. That's for a number of different reasons, most obviously because that is the purpose of our agency. And as long as we retain ownership, we would we would never seek to end the affordability period, but also the way the regulatory programs are written at the'",
        "'speaker_2': 'state level, the projects that are affordable. And because the state has learned, many of the projects that were developed in the sixties and seventies fell out of affordability. And so there's a real concern now at the state level with preservation.'",
        "'speaker_2': 'So the new regulations, the more recent regulations are designed so that the affordability restriction renews through a variety of mechanisms. And and so that's very important to us as a as the affordable housing provider. So that affordable housing agreement has been tailored to this project.'",
        "'speaker_2': 'Our our city attorney has work with our outside counsel. And we we believe that we have a very satisfactory form of agreement of the timeline for the development of the senior project is intended to be coterminous with the market rate project.'",
        "'speaker_2': 'If all goes well, we get the vote and we secure the funding. We would expect to commence construction as soon as potentially the end of 2016, just, you know, a year and a half from now. And that our project completion would coincide with the first occupancy of the market rate units.'",
        "'speaker_2': 'So again, we're very excited and we welcome your questions. If you have questions, of course, Andrew and I are here. Our architect, someone from the architectural firm of B.a.r, is here to answer any questions about design or site plan.'",
        "'speaker_2': 'And also the housing authority outside counsel is here to answer any legal questions. Thank you.'",
        "'speaker_0': 'Those questions first. I swear.'",
        "'speaker_3': 'If you don't secure the funding to build, what happens?'",
        "'speaker_2': 'So when I say the uncertainty, there's always uncertainty. Any loan application is, you know, an application. So we have to succeed. With most of the affordable housing programs, the funding is oversubscribed as as as everyone knows. And I would say that if we fail in the first year, we would succeed in the second year.'",
        "'speaker_2': 'There's never a certainty. But there's no reason to believe that the level of oversubscription is so great. And the State Allocating Committee has recently revised the regulations so that smaller projects actually have a better shot. And this is considered a small project.'",
        "'speaker_2': 'So we feel quite confident that if we do not succeed in year one, we would succeed in year two.'",
        "'speaker_3': 'But if you fail, what happens?'",
        "'speaker_2': 'Well, if we failed completely, we have several options. Option one is that the developer, the master developer, is obligated by the development agreement to provide the gap funding. And we also, as the housing authority, would be willing to make more of a contribution of public resources subject to the Board of Water Commissioners.'",
        "'speaker_2': 'Approval, of course.'",
        "'speaker_3': 'So if we fail to get the funding by the Housing Authority, the developers not obligated to build these affordable units, that we would have to backstop it with public funds that would sit.'",
        "'speaker_2': 'And sorry if I wasn't clear. So the the plan a scenario is for the housing authority to apply for competitive tax credits and the developer to provide gap funding, which is millions and millions of dollars. If that fails, there's a there's a plan B, there's a secondary tax credit program, which is the noncompetitive tax credit program.'",
        "'speaker_2': 'We could apply in a subsequent round to that noncompetitive program. But as you might guess, the noncompetitive program is not as financially lucrative and the developers contribution would be greater. But that is a is a very viable plan B, there is much less uncertainty.'",
        "'speaker_3': 'So I'm just looking for the answer that in any event, we're going to have 55 affordable units and we're not going to have to pay for it. It's going to come from the developer. Correct.'",
        "'speaker_8': 'It's the developer's responsibility to provide 55 affordable housing units on this project. It was the basis upon which they got their density bonus. If the housing authority fails or forever for any reason, tomorrow walks away from this and says, You know what, we have other priorities.'",
        "'speaker_8': 'We're not interested anymore. The House. The project must provide the 55. Thank you.'",
        "'speaker_0': 'Member Odie.'",
        "'speaker_4': 'Thank you, Madam Chair. I just had two questions. So on this purchase option, it says height at 37, not 55. Is that 37? If we for some reason don't approve the purchase option, is the height still 37 or does it go back up to 55?'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Well, thank you.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'I am Stephen Hedges, one of the senior architects at B.a.r. Thank you for joining us. So the height limit is so there's an Alameda datum and then there's the height over the great plain of the building. So the 37 is it was a great pane, the building from level one.'",
        "'speaker_5': 'Could you speak a little closer to the.'",
        "'speaker_3': 'Third, the 37 feet? It's from the first floor level. The higher number you're seeing is off the Alameda datum, which a civil engineer could speak to a little bit more than I can. But it isn't. So we're going off level one, which is zero.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_8': 'I think if I understood your question, it was the master plan which is already adopted says the maximum that this that any building on this site can be as 55 feet.'",
        "'speaker_3': 'Right.'",
        "'speaker_8': 'The Housing Authority has designed a building that is approximately 37 feet tall. So it's less than the height limit. But if the housing authority walks away or they don't get this option agreement or they never get this corner piece, Tim Lewis can still develop their piece.'",
        "'speaker_8': 'That's little piece B. Mm hmm. And they can go up to 55 feet. Okay. Under the master plan.'",
        "'speaker_4': 'And my second question, and I really hate to ask this because I normally don't get into this, but I did get a constituent letter. And, you know, given the historic significance of of the Del Monte, is that designed in stone?'",
        "'speaker_8': 'Of the building itself.'",
        "'speaker_4': 'No, this this the senior housing. My personal opinion, I think it looks out of place next to the Del Monte building. Are we too far down the path there on this.'",
        "'speaker_8': 'Or it has? We have moved by the planning board. We did. And working with B.a.r and our historians. I mean, it's this is part of the.'",
        "'speaker_4': 'And I'm sorry, I don't like to get into.'",
        "'speaker_8': 'No, no, it's things, I guess. I'm glad you asked. What they are trying to do is not try to reproduce that El Monte building. They're trying to contrast with the Del Monte building and not try to. So that's, that's the concept behind the design.'",
        "'speaker_8': 'From an architectural. Yeah, they did achieve.'",
        "'speaker_3': 'Sorry.'",
        "'speaker_4': 'No, I think the vice mayor. I mean, it it just it would seem, in my opinion, again, I'm not an architect, but, you know, we're in a neighborhood of homes where next to this landmark that a building that would look perfectly fine on an Alameda point or you know over at Alameda Landing just just seems a little'",
        "'speaker_4': 'bit out of place to me. So I don't know if we have an ability as a council to influence that or is that pretty much done?'",
        "'speaker_2': 'So I guess that's my question.'",
        "'speaker_0': 'Could someone answer his question? Is it too late for council to weigh in on the appearance of this?'",
        "'speaker_2': 'That is correct. There was a ten day period that you could have called it up for review, and that has expired. So I would suggest.'",
        "'speaker_0': 'Suggestions the majority of us.'",
        "'speaker_2': 'Know.'",
        "'speaker_3': 'That.'",
        "'speaker_5': 'That trend has left the stage.'",
        "'speaker_0': 'A number of days I'm thinking that. I agree. Just to. This goes to, I think why we have to attend planning board meetings and.'",
        "'speaker_9': 'To two points. I think what staff member Thomas is getting at is that and as well as the communities that we don't want, I think the term is faux historicism where it doesn't, doesn't in trying to recreate an historic thing, it ultimately fails because it's so phony that that so.'",
        "'speaker_9': 'So I understand I understand where the architecture and the planning process has come in with regard to that. But nonetheless, it would be informational and support helpful to the community to understand kind of the theory behind the design.'",
        "'speaker_9': 'And let me put it this way. Many years ago, when we did the Walgreen's project on the corner of Webster and and and Atlantic Avenue, you know, there was a theory behind the Walgreens project, we call it, you know, led by then council member Barbara Kerr, who kind of introduced the nautical theme because it fit in with'",
        "'speaker_9': 'the you know, with Alameda. But in addition to that, the materials that we used, we wanted them to be kind of consistent with Independence Plaza across the street. So that's why you kind of see the Walgreens project the way that it was.'",
        "'speaker_9': 'And this is a long time ago, by the way. So I guess it would be helpful, though, to understand, you know, the theory, the idea that that this design is trying to achieve.'",
        "'speaker_3': 'So the new building is meant to, as previously said, speak to the warehouse without trying to mimic it. It makes references to the building primarily through scale. You'll see on the existing warehouse building there are pilasters on the exterior, and those are the structural bays of the existing warehouse building.'",
        "'speaker_0': 'Could you put the picture of it so that he can actually refer to the diagram? That'd be great. Thank you.'",
        "'speaker_3': 'Yeah. So if you look on the rendering there, you'll see these vertical strips and those are structural pilasters. And that's where the trusses and the column lines are on the interior of the building. In that with which is 20 feet, is used as a scalable element in the senior building.'",
        "'speaker_3': 'We've also taken the individual panes of glass within the existing windows and use those as a building block for other scalable elements on the senior building. Most notably would be the windows of the apartment units where the moyens are placed.'",
        "'speaker_3': 'So that's a big part of it. Another part of it is the massing of the senior building is broken down to have a kind of townhome scale to it, to relate to the residential neighborhood. And you'll see that in the bays and then there's stoops.'",
        "'speaker_3': 'And if you look at.'",
        "'speaker_0': 'The senior housing building.'",
        "'speaker_3': 'If we look at one of the renderings with the perspective. Uh hmm.'",
        "'speaker_4': 'Yeah, there it is.'",
        "'speaker_3': 'Now, that's actually from the private drive, looking at the entry, if we could see one from Sherman and Buena Vista. Okay. But along Sherman and Buena Vista is where we have patios and stoops that the units face onto.'",
        "'speaker_3': 'They're not meant to be the primary entries into those units or kind of secondary, but it is to kind of blend in work with the scale, the existing neighborhood.'",
        "'speaker_5': 'So just for clarification, what we're looking at is from what direction or.'",
        "'speaker_3': 'So this is the northeast corner of the building of a view from the private drive in the master plan, looking at the primary entry into the senior building. So that canopy that you see is a little it's kind of kicking up there.'",
        "'speaker_3': 'That is the canopy into the lobby, the entry lobby. Okay.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_9': 'Thank you. Thank you.'",
        "'speaker_0': 'I have a question in regards to the the 24 moderate homes they'll be interspersed. Well, those be available to singles and families or who who will those be available to?'",
        "'speaker_8': 'Yeah, that's family housing.'",
        "'speaker_0': 'So that's family homes.'",
        "'speaker_8': 'Or families for the moderates within that.'",
        "'speaker_0': 'Single family. Yeah, right. And regardless of age.'",
        "'speaker_8': 'Right.'",
        "'speaker_0': 'Okay. And then.'",
        "'speaker_2': 'Sorry, Mayor, just the the affordable housing agreement does stipulate a minimum family size. So the a single person could not purchase a two or a three bedroom. There's a, you know, one obviously one person minimum per one bedroom, two bedroom people, two, two bedroom, etc..'",
        "'speaker_0': 'Do you know what the breakdown is? Can you do you remember the 24 units? So.'",
        "'speaker_2': 'Oh, no, I don't. I don't know if Jessica the the you're talking about the bedroom sizes of the 24, right.'",
        "'speaker_0': 'That are we we've been speaking about the senior housing, but there are going to be 24 moderate homes within the main building.'",
        "'speaker_2': 'I'm Jessica Grossman with Tim Lewis. Communities. The 24 units will be spread proportionately based on.'",
        "'speaker_6': 'The size and distribution.'",
        "'speaker_2': 'Of units that we'll have in the building.'",
        "'speaker_6': 'So depending on how many studios, one bedrooms, two bedrooms, they'll be spread.'",
        "'speaker_2': 'Proportionally through the building.'",
        "'speaker_0': 'Great. Thank you. Um, okay. And then the. In regards to the senior housing. But this preclude having senior housing at another site that will be coming before us, such as at the Island High site. But this decision today preclude that.'",
        "'speaker_2': 'So the the decisions are, you know, completely separate. So I don't think that one would have bearing on the other. We have made physical plans because we've done the design for this site to be senior housing and the both the ordnance and the affordable housing, the regulatory agreement both specify it for affordable senior housing.'",
        "'speaker_2': 'So this project is proposed to be senior, but it would have no bearing on other projects.'",
        "'speaker_0': 'All right. And also, when I looked at the distance from where this housing would be, the senior housing is actually the farthest in relation to where the. Facil. The public facilities are at the edge. Across the parking lot.'",
        "'speaker_0': 'My understanding. So in regards to the parking lot, will there be a way to have those crosswalks protected somehow to make it safe for our seniors to have access to the public facilities within the main building?'",
        "'speaker_2': 'And an. Absolutely. When we actually get to the point of doing the construction drawings, we will make sure that they are marked and illuminated to the to make that a safe crosswalk. It's only a driveway. It's not a street.'",
        "'speaker_2': 'But you are correct, particularly in the, you know, twilight hours, that it could be a potentially, you know, someone crossing the driveway. So I think we are very conscious of that fact and will make sure that it's as safe as any crosswalk can be.'",
        "'speaker_0': 'On regards to. More than likely, we will have a higher percentage of people living there with mobility issues. So that's a concern.'",
        "'speaker_2': 'Right. So it's just the two lanes. It would be a Tulane. Tulane Street, not a.'",
        "'speaker_0': 'And then also in regards to access to Littlejohn Park, what will we be looking at somehow ensuring that the seniors will have sufficient time to cross that street to be able to access the park?'",
        "'speaker_8': 'I'm sorry. You're talking about the crossing. To Jean Sweeney and to.'",
        "'speaker_3': 'Littlejohn.'",
        "'speaker_5': 'And.'",
        "'speaker_0': 'Rochester. So we are especially since we know we're going to be having a senior housing development there.'",
        "'speaker_8': 'Absolutely. So we are we can absolutely take care of that. We are building a brand new intersection with a new signal to Jean Sweeney Park. We're also as part of this Del Monte project, re re constructing the Blain of Vista.'",
        "'speaker_8': 'Sherman intersection. You know, now, right now it's got a pork chop. You know that three, right? Once Clement is done and the trucks can move to Clement. Then we redesigned and this project's responsible redesign that getting rid of the pork chop that's going to improve for pedestrians that intersection.'",
        "'speaker_8': 'And then there's also, as part of this project, an improvement of the crossing from little the other end of little John where there's the pedestrian passed through through the building to Alaska Basin essentially one block. Down Bueno Vista.'",
        "'speaker_8': 'So we are already planning on improving pedestrian connections. And of course we will absolutely will make a note of it, make sure that we've got the timing for those signals done appropriately. I just wanted to get back to the design issues for a second.'",
        "'speaker_8': 'The design review on this building is approved. It was approved a month and a half ago. There is a there are some final details that are going back to the planning board for another discretionary decision. Colors, if you're a constituent, was concerned about the blue color.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_8': 'The materials, final materials. And then there was some discussion. And this slide doesn't really show it about how to treat the actual parapet. There was like there's the flat parapet shown here. There was another parapet that had, you know, how the Del Monte building has those little sort of triangular parapets.'",
        "'speaker_8': 'There was a back and forth discussion at the planning board, sort of like talking about the pros and cons of doing something that would. Sort of a stronger reference to the Del Monte building. And the playing board was sort of.'",
        "'speaker_8': 'Saying, You know what, let's see some alternatives on that. Bring it back. So I just want you to know, because we 2 minutes ago, we sold, you know, it's final now. It's not the footprint, the size of the building, the basic scale, the building that is final.'",
        "'speaker_8': 'But these details that I just mentioned, there will be another hearing. Of course, every planning board decision is you can call it for review. So.'",
        "'speaker_0': 'All right, keep.'",
        "'speaker_8': 'An eye on that. We'll let you know if there is.'",
        "'speaker_5': 'I have a question about the color, because part of what might be a little shocking for we have a screen and we're looking at this at our at the dais. And the blue is kind of like a turquoise blue in this picture.'",
        "'speaker_5': 'But when I turn around and look at it up on the the big screen, it reads as more of a silver blue. So I would I happen to like the design and having been a part of the library building team, we did go through that whole argument about, you know, oh, should we try to recreate the old'",
        "'speaker_5': 'Carnegie or historic building or something? And I happen to think that the modern rendition we did has worked quite well and has its own classicism. So this doesn't worry me, but the color did, you know, and it may be that if we were to see sample boards that we'd be more reassured.'",
        "'speaker_8': 'That's exactly why we require color and material boards, because you, no matter what screen you're looking at or what Xerox copy you're looking at, it can be totally different. So we actually expert. But anyway, I just want you to know, I don't imply that you can totally redesign the building, but there are certain details are still coming'",
        "'speaker_8': 'back on board.'",
        "'speaker_5': 'Member Ashcraft and this is just in the present day, not in the future. I did want to thank Mr. Thomas or whoever it was on staff because I've been harping about all of the overgrown dry. And I did talk to Miss Johnson about it too, with the overgrown dry grasses and weeds that ran along the point of'",
        "'speaker_5': 'Vista frontage and the Sherman side. And I was very pleased that a couple of days ago when I when I drove past, that was all mowed down. So thank you, staff, wherever you are for doing that because we are in a dry season and we want to be safe.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_4': 'Member Odie I'm sorry, one more clarifying question. So can we go back to the the point the mayor raised about the crossings into the do we have that picture? Are these are these pedestrian only crossings that are going to have a signal or are they.'",
        "'speaker_8': 'Let's go. Let's stop. Bob, stop right there. The stop right there. I just. Just to orient everyone. The intersection on the left hand side is. Well, first of all, the top intersection is the brand new intersection. It doesn't exist today, which is going to be the intersection of Eagle Clement and Sherman Sherman.'",
        "'speaker_8': 'That's the that's going to be the main entry into Jean Sweeney Park. And it has a new traffic signal. There is then going to be a new traffic signal or a new not a new signal, but a re time signal and a new crossing at Buena Vista.'",
        "'speaker_4': 'Vista.'",
        "'speaker_8': 'Sherman. And then if you go down Buena Vista, where Stanton right now tees into Buena Vista, right across from the middle of the Del Monte building, new pedestrian crossings at that point.'",
        "'speaker_4': 'And then.'",
        "'speaker_8': 'At. No, it's at Stanton. Is that us here. Oh. How does how did you do that? Yeah, exactly. Thank you. That's my Vanna White there pointing to that.'",
        "'speaker_4': 'So is that so? Is that a signal there.'",
        "'speaker_8': 'That's no, it's going to be a pedestrian crosswalk. So we're still designing it. But the idea is because you may remember the way the building is designed, there's going to be a public access easement running right through the inside of the building.'",
        "'speaker_8': 'Right. To get people from Little John Park to the Alaska Basin and the Bay Trail, which is going to be right here. So it's got this very cool feature and we really want people to be able to get from Little John Park safely across Buena Vista at this intersection and through the building.'",
        "'speaker_8': 'Now, the other crossing that we've been talking about internally is the so that a senior building is on this pad right here. Then if we can go to those that other side real quick and I promise not to bore anybody back on here fast.'",
        "'speaker_8': 'No one more back. Right here. So the build the affordable building sits right here. There's a crosswalk across this drive aisle right there. And a second one right here. There's one more slide. Bob, can you go?'",
        "'speaker_0': 'And that's also a parking deck, correct? Next.'",
        "'speaker_8': 'Stop it.'",
        "'speaker_4': 'That's.'",
        "'speaker_8': 'So here's the footprint of the Big Del Monte building. There is a crosswalk from the Affordable here, and there's one right here and those are lined up. This is an internal corridor inside the building so a senior can cross the drive aisle.'",
        "'speaker_8': 'If it's a nice sunny day and they want to stay outside along the water's edge, there's a path all the way along and a nice big public space facing the water here in front of the commercial, which is these brown areas.'",
        "'speaker_8': 'Alternatively, it's a rainy day. They cross the dry veil, enter the building at this internal court, which runs all the way down inside the building.'",
        "'speaker_0': 'So will that be a covered crosswalk then for the seniors? Well, it's access the main building.'",
        "'speaker_8': 'Or they know how to cross, not across the drive aisle. It's not covered, but it's a 26 feet across.'",
        "'speaker_4': 'That's a drive. That's not a street, that's a driver. And so we're not having any any pedestrian only crossings. It's all have to be at an intersection that's already.'",
        "'speaker_8': 'I'm sorry I missed.'",
        "'speaker_4': 'We're not having any special crossings so there's no pedestrian only entrance into the park you have to cross at the main intersections.'",
        "'speaker_8': 'I have just been handed a note. There's a flashing beacon at the crosswalk.'",
        "'speaker_4': 'No flashing beacons.'",
        "'speaker_8': 'So, I mean, the idea is, you know, so, look, we we want seniors to feel very safe walking. We do. Yes. Building across the drive aisle to the Del Monte building on the waterfront.'",
        "'speaker_4': 'So and into the parks.'",
        "'speaker_8': 'And then into the park. So crossing into the public, Jean Sweeney Park, they're going to be crossing signalized intersections, going from the from the senior housing into the Del Monte building. And the commercial services are going to be crossing a crosswalk with this flashing.'",
        "'speaker_4': 'Beacon magic word. Did Batman give you that?'",
        "'speaker_8': 'I don't know. Somebody magically showed up from behind me.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'So I'm happy now.'",
        "'speaker_0': 'And the story of Jon before I call this public speakers, apparently. Thank you. All right. Our public speakers will be Carey Thompson and then Audre Lorde, Housman and then Art Leonhart. Thank you. I believe we have about ten public speakers.'",
        "'speaker_2': 'Good evening, I think three times as my record today. But there's a lot of fun stuff going on. I am looking forward to you approving this next phase of the affordable housing piece of the Del Monte Project, because I think other than some of those design things that people seem to have some concerns for that this really'",
        "'speaker_2': 'does benefit seniors. I know it's not the entire issue of everybody who needs affordable housing because frankly, everybody needs affordable housing. And but it's a step and I appreciate the fact that we are moving forward with that. And I thank you for helping this process along.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Audre Lorde Housman. And then Art and then Rosemary Riley.'",
        "'speaker_5': 'Hi.'",
        "'speaker_2': 'Good evening, Mayor Spencer. Council members. Staff. I also a big supporter of the senior housing and I think the location is great. I think the redesign of the intersection without saying is, you know, absolutely paramount. But what I but it sort of takes me back to is my father lived to 98 years old and I he was'",
        "'speaker_2': 'very mobile for the most part. Taylor was about 93. And along he lived in a senior facility. And, you know, one of the key points was keep moving. That's what he kept telling me. He says, no matter what you do, keep moving.'",
        "'speaker_2': 'And no matter what mode of transportation they used.'",
        "'speaker_0': 'Even if it.'",
        "'speaker_2': 'Was walking around the block of the facility, which equaled four blocks, actually that distance to the retail that you brought up is probably much less than that. So I would you know, I think. It's very safe the way it's designed.'",
        "'speaker_2': 'That one small street, which is not really a main street, is not a Buena Vista, and it's not going to be that big of a challenge. And I think that access to the what, you know, to the water side, the estuary side is going to keep them out of harm's way.'",
        "'speaker_2': 'And with the change in the intersection that Sherman and Buena Vista, I think it would be really good. I would strongly and make sure that all the outside amenities in front of the Del Monte on the estuary side are ADA compliant.'",
        "'speaker_2': 'My husband and I uncovered a non ADA compliant bench installed at Alameda Landings Shopping Center and we pass that on to public works and they're taking care of it. But our eyes are so keen now, we could tell right away it wasn't 17 inches.'",
        "'speaker_2': 'And but I think that encourages seniors then to come out and congregate and enjoy the amenities that are going to be on on that side. So I would encourage you to approve this and add to the senior housing, which we sorely need.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Mayor Spencer. Members of the council staff. Thank you for your time and patience. My name's Art Lenhart, and I think it's a real privilege to live in this town. I came here in 68, as I've probably told you more than once.'",
        "'speaker_3': 'I come from a family that could never afford a house or a car. When I got here, I figured out how to do something for me and my family and get both those things taken care of. Bought a house in 72 and I found out with the house next door to me sold for last month and I'",
        "'speaker_3': 'had to take my heart medication. It was rather startling. One of the positions I've held in the past is working with seniors, installing emergency response devices. Matter of fact, I'm wearing mine. Little buttons you wear around your neck.'",
        "'speaker_3': 'So if you live alone, as I do when you fall down, you can get help. It's allowed me the privilege to go into many homes of seniors under many different financial circumstances. And I can only say I applaud you're looking at this project.'",
        "'speaker_3': 'I'm no engineer. I'm no architect. I'm no color consultant. The idea of the concept of adding this is so essential. And just hearing tonight for the first time and maybe I haven't been reading the paper, there's something going on at the Old Island High Project where even more of this.'",
        "'speaker_3': 'Again, good for you. I like this island. I love. That's my home. And I think the people that are here. They're being forced out because they're old or infirm will be given this opportunity. And I thank you for addressing it.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Rosemary Reilly, then Pamela Tozer. And then. And MacArthur again.'",
        "'speaker_1': 'Good evening. I've been the director for Alameda. I'm Rosemarie Riley. I've been the director for Alameda Meals on Wheels for 25 years, and I fall into that senior category. Now, in my life, I'm really.'",
        "'speaker_2': 'On a daily basis here and see the.'",
        "'speaker_1': 'Need for affordable housing for our seniors. And I was on the phone this morning with two recipients who are really in trouble in many ways in their lives, including health issues. And they've been on a waiting list for a very long time.'",
        "'speaker_2': 'With the.'",
        "'speaker_1': 'Housing authority also really pleased with this development that they have really considered our seniors and working with the housing authority is exciting to me because I've seen the work firsthand of the Housing Authority. We have many of the same recipients and they are very thoughtful about placing people, but there's a desperate need for more.'",
        "'speaker_1': 'The other thing I was thinking with this particular development, I live on the north side and it's an incredible location for seniors. As Victoria mentioned, you've got Littlejohn Park. You're going to have the beautiful Jeanne Sweeney Park not too long from now.'",
        "'speaker_1': 'You can walk down to the water. You've got the shopping center, it's flat. You can walk. I don't know that I'll be jogging down there.'",
        "'speaker_2': 'Frank might pass me on the path.'",
        "'speaker_1': 'Jogging, as he sometimes does. But it is really a great location. Years ago, many of us worked very hard to turn that. Where Little John Park is now was just an empty parking lot for years and years. We worked very hard as a group of citizens, get approval by the city to turn that into a park, the'",
        "'speaker_1': 'only spot in the island that didn't have a park within walking distance. So there's a lot of history for me there and working in that area. And then something I debate mentioning to you, you'll probably see me again because some of you might remember, do you, Councilman Charlie Tillman and Charlie was on the council years ago and'",
        "'speaker_1': 'he was the active advocate in the city of Alameda for our seniors. And he would come into the office at Meals on Wheels to make sure I was doing my job correctly, and he would give me a fun, hard time.'",
        "'speaker_1': 'Charlie told me in his later years, I want you to watch very carefully, Rosemary, when I'm not doing that work anymore and when any development is proposed in the city. You were to be there and you were to speak up and you were apt to ask the city council members and the planning board to always consider our'",
        "'speaker_1': 'seniors. So I can almost hear Charlie channeling to me as I'm driving down here tonight, but that's something I'm going to pay attention to. And you may see me again on that issue, but we had our big fundraiser Sunday for Meals on Wheels well-attended.'",
        "'speaker_1': 'People came to.'",
        "'speaker_2': 'Have a good time.'",
        "'speaker_1': 'But this community is so terrific. They came because they care about our seniors and wanted to make sure everybody got that meal today. So I thank you very much for your time, and I appreciate your obvious interest in watching out for our seniors.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Greetings again. I'm Pamela Tozer. I am delighted with the senior project. I have a mother. She lives alone in San Francisco and rents. She's 75 and still works to maintain her apartment. But it won't be long until she cannot work anymore.'",
        "'speaker_2': 'And then she will be in my care. So I'm really excited about the senior project. I also live in the neighborhood of one of us two area neighborhood. And I know that there's been a lot of concern about the parking.'",
        "'speaker_2': 'There was a lot of discussion about it at the planning board. I'm not particularly concerned about the parking overflow, but what I do see as a potential solution is having the streets marked for parking to evenly distribute the parking places.'",
        "'speaker_2': 'There's a lot of parking where, you know, 1 to 2 more cars can fit and one just sits in the middle. Motorcycle parking, taking up all space. So that's my recommendation for that neighborhood. That would be helpful. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And. And then John Spangler and then our last speaker, Laura Thomas.'",
        "'speaker_2': 'Good evening again and thank you for this opportunity. I wholeheartedly support.'",
        "'speaker_10': 'This this.'",
        "'speaker_2': 'Program and encourage you to do the same. We are in desperate need of affordable housing, and everyone knows that. But one of the things that truly endears Alameda to me and why.'",
        "'speaker_10': 'I love having this is my.'",
        "'speaker_2': 'Home is we are a community who cares about others and we care about those who struggle and we care about providing.'",
        "'speaker_10': 'For them.'",
        "'speaker_2': 'So affordable housing in general is something that this is it just is woven into this community, in my opinion. To add on to that, to have a housing area specific for our seniors who really have an have as they age, have even a greater difficulty.'",
        "'speaker_2': 'And to be able to know that they have someplace that they can live for this is a worry they no longer have to have, I think is, again, something that is just very representative of this community.'",
        "'speaker_10': 'And one of the reasons that I love.'",
        "'speaker_2': 'Living here and and enjoy being in Alameda and so, so much. I'll give a little twist on the design. For me, I look at it a little differently. For one thing, the Del Monte is was is a structure that was a business structure.'",
        "'speaker_2': 'And as you turn down Sherman and head along, it's really the beginning of what is a new business park. Just kitty corner from this you have the central storage unit, for instance, which is just sort of there. But it again, it almost then eases you into the Wind River and on into the business park.'",
        "'speaker_2': 'So it's to me, it's sort of an opening in addition to transitioning into that point. But I think it can be nicely done where it where I think the design has been nicely done. So it really does transition into that part.'",
        "'speaker_10': 'Of our community as well. Thank you.'",
        "'speaker_3': 'Good evening again. I'm John Spangler and currently renter. And I want to say to council and staff and the developer thank you for a very nice project. I have two segments to my comments tonight. First, speaking officially for the Alameda Renters Coalition, Angela hawk about was here at previous meetings to speak in favor of this project.'",
        "'speaker_3': 'And we as an organization are still in favor of it. For all the reasons you have heard many times. Summer of 2018 is a long way off, though, for some of the seniors in our group who are looking for affordable housing and to be able to stay in Alameda.'",
        "'speaker_3': 'Some of them were on fixed incomes. Katherine Pauling, who just left, is raising her grandchildren here in Alameda, as I believe she has said from this podium. And so she needs something other than a one bedroom. The two teenagers, as you might imagine.'",
        "'speaker_3': 'But she's looking forward to the affordable units that are dispersed to the rest of the project to be able to possibly. Hang on to the crowd control issues until the kids are out of high school. I wish you all the best.'",
        "'speaker_3': 'Now my personal comments on this project first. Again, I want to reiterate from a personal standpoint, this is a great project and I did a little rough calculation while I was sitting here thinking and I ran it by a couple of people who know far more about housing than I do and what the needs are, because I'",
        "'speaker_3': 'can't remember all the numbers that I've seen about what we need. But my rough calculation in terms of order of magnitude. Okay, don't quote me on this as a finished figure. We only need about 100 more of these to meet the demand for affordable senior housing in this city.'",
        "'speaker_3': 'So keep up the good work, please. I may be off by 50%. Okay. That's my. That's what I mean when I say. But back to the envelope. But even if I am. 50 times 31 is a lot of units.'",
        "'speaker_3': 'Independence was it was 186. So we need at least one more of those. And I also want to say I support the remarks made recently by Andrew Lloyd Houseman and Art Leonhardt, both friends of mine and both people I look to for inspiration and great ideas.'",
        "'speaker_3': 'And they've come through again tonight. And one other thought, I think a covered walkway might be worth something. Crossing a parking lot is a long way from a BART escalator. But there are some significant advantages to BART having installed a cover over its escalator on 19th Street for a number of pedestrian comfort reasons.'",
        "'speaker_3': 'In addition to the maintenance on the escalators. Thank you.'",
        "'speaker_0': 'Thank you. Yes. And you are our last speaker, Laura Thomas. Anyone else wants to speak for in your slip, please.'",
        "'speaker_10': 'Good evening again. I'm here to support the land transfer that will bring about the construction of housing for low income seniors as a part of the Del Monte project. And as we all know, the skyrocketing rental costs are affecting all levels of incomes and people on fixed incomes.'",
        "'speaker_10': 'Actually, along with those on declining incomes, are among the most vulnerable. I believe that Angela Hawk about told me that about one half of the people that contact the renter's coalition for help are seniors. So there is a lot of clamor for senior housing.'",
        "'speaker_10': 'Years ago, the call for senior housing in this town, I hate to say it came out of a prejudice, actually, that seniors were mild mannered people who wouldn't cause any trouble even if they were low income while low income families were unwanted.'",
        "'speaker_10': 'Period. Now that the new economy is is disposed of so many middle income jobs, I hear a lot more sympathy expressed for everybody at all income levels in this town, which I think is a great improvement. We actually gasp at the thought of paying some of us to own homes.'",
        "'speaker_10': 'We gasp at the thought of paying what renters are forced to pay to keep a roof over their head. And yes, we have to build housing for everybody in this town. I want to make a really important point, though.'",
        "'speaker_10': 'The building it for seniors should not be done to mollify people who don't like affordable housing, because, in fact, that's an act of condescension towards seniors. We should be doing it because there's a real need and because it's the proper way to treat.'",
        "'speaker_10': 'The older generation in this town who looked after us. In this community, I have the utmost faith in both the Housing Authority and Tim Lewis and their ability to carry forth this project. This transfer should be approved tonight because the road to securing funding and building this project is lengthy and there are people who are desperate now'",
        "'speaker_10': '. So please don't hesitate. Thank you.'",
        "'speaker_0': 'Thank you. She was our last speaker. Councilor. Comments. Motion.'",
        "'speaker_5': 'Yeah. I think we're ready to make this motion and I'd be pleased to make. Well, it's actually three isn't it. And I do just want to say, well, I'm pulling up the list of things we have to vote on that this has been a long time coming.'",
        "'speaker_5': 'And what have you got?'",
        "'speaker_8': 'No, just interrupt.'",
        "'speaker_5': 'Just you.'",
        "'speaker_8': 'Just four. So the public understands you have this on your dias. It was a minor amendment we added to the affordable housing agreement. It's in the nondiscrimination clause. I just wanted to make sure that was just for public information.'",
        "'speaker_8': 'There's a nondiscrimination form, which is a standard nondiscrimination, but we did add a sentence just to because we thought it was important saying, you know, notwithstanding the foregoing, this is going to be a senior housing project.'",
        "'speaker_5': 'Oh, well, and maybe just to clarify the foregoing, for those who don't have this in front of you, it the the article talks about the developer covenants agrees that there should be no discrimination against or a segregation of any person or group of persons on a count of any basis listed in another subsection.'",
        "'speaker_5': 'But of course, in this case, they have to carve out a little exception because the separate the independent building is going to be age restricted to seniors at a certain level of affordability. So that's what the legalese was there for.'",
        "'speaker_5': 'Anyway, I we've had a lot of great comments. I don't think I could do better than the public speakers. This has been a long time coming. I know we have three items to approve, so we guess we take them one at a time.'",
        "'speaker_5': 'I will be pleased to move adoption of the resolution approving plan 15-0165a7 lot tentative subdivision map at 1501 Buena Vista Avenue to implement the 2014 Del Monte Master Plan.'",
        "'speaker_3': 'A.'",
        "'speaker_0': 'Any comments?'",
        "'speaker_4': 'Just one quick comment. I echo my colleagues noting that anything we could say is not as eloquent as what was said in the public. And as we look at these housing projects that come before us, you know, I think it's important we focus on the bookends, you know, the entry level for young people that either grew up'",
        "'speaker_4': 'here or want to move here or want to stay here. And at the opposite side, the seniors who may want to downsize or who also want to stay in Alameda but can't afford or for physical reasons can't can stay in their home.'",
        "'speaker_4': 'So I think it's important we focus on on those bookends. And, you know, I'm very, very pleased to be supportive of this tonight.'",
        "'speaker_0': 'All right. I would like to suggest that when it goes through design again, that they look at covering the walkway. I am concerned about the safety of the seniors walking through the parking lot if and make it as convenient as possible and as safe as possible.'",
        "'speaker_2': 'Well.'",
        "'speaker_5': 'I think I would like that to come back for discussion and the covered walkway. I mean, I don't quite understand protecting them from rain that I, I mean, I guess it can come back to us as some sort.'",
        "'speaker_5': 'Well, go to the leave.'",
        "'speaker_0': 'It goes to design.'",
        "'speaker_8': 'We can take a look.'",
        "'speaker_0': 'And.'",
        "'speaker_8': 'We can actually take a look on out with each phase of the project. Take a look. We have to sort of figure out trucks and various things. So we'll take a look at it and keep you posted.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'I don't think.'",
        "'speaker_5': 'No. Yeah.'",
        "'speaker_0': 'And that was another suggestion I was suggesting. They looked at yes. Or the minister.'",
        "'speaker_5': 'Wholeheartedly think yes, we should take a look.'",
        "'speaker_0': 'That being said.'",
        "'speaker_9': 'Member yes. Thank you. It's important to note that this is a necessary predicate to a lengthy process, the highlight of which occurred in late, late 2014 and 2015. So to remain respectful of that, I think it's imperative to move forward with this project.'",
        "'speaker_9': 'There seems to be some kinks that we can iron out, particularly with regard to some aspects of of of design. So I think that I certainly look forward to that. But it's important to remain faithful with that process that began.'",
        "'speaker_9': 'So.'",
        "'speaker_0': 'I just would like to clarify if the number of units was already approved previously. What's happening now is that we're being asked to address the property issue so that we can have the separate building or the senior housing, which do have a defined as senior housing has to be a separate building, which is what why that's occurring'",
        "'speaker_0': 'and why it's coming to us for approval. After. We'd like to clarify that any further. Thank you. All right. That being said, I'm going to call the motion now. All those in favor. I oppose motion carries unanimously at a make you member.'",
        "'speaker_0': 'Ready?'",
        "'speaker_4': 'I'd like to move. Introduction of the ordinance authorizing the purchase option agreement between the city of Alameda and the Alameda Housing Authority and authorizing the Interim City Manager to execute all necessary documents which transfers 0.47 acres of city owned real property identified as Assessor's Parcel Number 079-0383, Dash 001 and Dash 002.'",
        "'speaker_4': 'Located at the northeast corner of the intersection of Buena Vista Avenue and Sherman Street from the city of Alameda to the Alameda Housing Authority for the construction of a 31 unit, affordable senior housing development.'",
        "'speaker_0': 'All right. And then I'd like to clarify for the audience that there's actually three separate votes pertaining to approval of this project. Any other comments? All those in favor. I motion passes unanimously. Thank you.'",
        "'speaker_5': 'Next motion on the adoption of resolution approving an affordable housing agreement between the city of Alameda and our partners Sale Partners one LP outlining the requirements to develop 55 affordable units, including the 31 unit Affordable Rental Housing Development on Parcel three at 1501 Buena Vista Avenue, and authorizing the interim city manager to execute the agreement.'",
        "'speaker_0': 'Like Mr. Desai seconded. Any discussion? All those in favor.'",
        "'speaker_3': 'Of.'",
        "'speaker_0': 'My motion passes unanimously. Thank you. And now we're going to take a short break and recess. Well, it's taking a short recess before we resume with item six. The.'",
        "'speaker_3': 'Pretty.'",
        "'speaker_0': 'We're going to read them. Thank you very much. All right. And we are now on six C, is that right?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Six C, we've so we had taken 60 out of order. Now we're on 60.'"
    ],
    "Input on Recruitment Brochure for City Manager Position.": [
        "'speaker_1': 'Recommendation to provide input to Avery and Associates regarding the recruitment brochure for the city manager. Recruitment. Hello, Madam Mayor. Members of the City Council.'",
        "'speaker_2': 'My name is Robin Young. I'm a senior analyst with the Human Resources Department. As you are aware, you have engaged to Avery and Associates, a consulting firm, to head up your city manager recruitment. I have with me here Paul Chmura, who is leading this effort and who would like to review the brochure for yourself without further delay'",
        "'speaker_2': '. Oh.'",
        "'speaker_3': 'You. Very much. Good evening.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_3': 'Mayor. Council members.'",
        "'speaker_0': 'Thank you for allowing us to take the other item ahead of yours. Appreciate that.'",
        "'speaker_8': 'Oh, absolutely.'",
        "'speaker_3': 'Real important, as well as interesting discussions about challenges where all all the communities are facing on housing. But, you know, thank you very much. I wanted to just return to you after having had a chance to individually meet or speak with each of you to solicit your input on the ideal candidate profile for your city manager.'",
        "'speaker_3': 'So incorporating.'",
        "'speaker_8': 'All of the.'",
        "'speaker_3': 'Central themes we I put together a preliminary draft of the job announcement. Staff was kind enough to work with me and ensure that the most of the facts were accurate.'",
        "'speaker_8': 'And tonight.'",
        "'speaker_3': 'I wanted to check with you to see your thoughts on the job announcement. And if there were any changes or edits that you would like to see. And then thereafter, to open up the recruitment so that we can try and find you a new city manager by year's end.'",
        "'speaker_0': 'Right. Comments from council or as I know, we don't have any speaker tips on this one. Correct. All right. Comments from Council.'",
        "'speaker_5': 'I liked it. I thought. I thought it did a good job of talking about our historical character. Reputation? I like the friendly and sophisticated island community, but, you know, talking about our attributes, great schools, family friendly beaches, successful historic movie theater, retail stores, ample recreational opportunities and abundant parks and playgrounds.'",
        "'speaker_5': 'But also the very next paragraph talks about the development that we're embarking on in Alameda Point and the characteristics we would like to see in a city manager to lead us through that, that process. And I like the photographs.'",
        "'speaker_5': 'It's I think there's a lot to choose from in Alameda when you're looking at photographs, but I think it was a nice representative sample.'",
        "'speaker_0': 'The other member comments. All right. So I have a few. When you describe our city as the second paragraph. Okay. In the middle of city of Alameda, best places to live. It has a high median family income. My understanding our median income is 75,000.'",
        "'speaker_0': 'So I'm not sure what that's based on. In regards to high, I really don't even know what that means. But I think very I would say that we are a socio economically diverse community. Well educated populace. Again, I don't know what that's based upon, but I think we I would like to describe the diversity as socio in'",
        "'speaker_0': 'the diversity of our community I think should be represented. And we can go over that language later. But I don't think this captures our diverse community. And with that, of course, comes. I would be hoping that we have we end up selecting a manager that recognizes the diversity of our community and supports the diversity of our community'",
        "'speaker_0': 'and wants to work with us to provide a higher quality of life and a be aware of quality of life for our the the diverse needs of the community members. So that's why that connects to. The the application then attributes.'",
        "'speaker_3': 'Mm hmm. Absolutely.'",
        "'speaker_0': 'All right. Any other comments? And this was just for feedback. It's my understanding. We don't need to take a vote on this. Just a question. Yes.'",
        "'speaker_3': 'When is it actually going to start? The recruitment was intended to start after you approved the brochure. You're not.'",
        "'speaker_8': 'Meeting, apparently, next.'",
        "'speaker_3': 'Month. So we were hoping we might be able to get approval this evening, initiate the recruitment, have a filing period close in early September, and have candidates presented to you by early October.'",
        "'speaker_5': 'I'm all for moving forward expeditiously. But can you just maybe do a read back of how you would incorporate the mayors? I mean, she's right. We are an ethnically diverse community. The. You know, we could debate about high median family income, but maybe there's a way to kind of.'",
        "'speaker_6': 'Right.'",
        "'speaker_5': 'Incorporate all of that.'",
        "'speaker_3': 'There is room and we can certainly speak to the diversity of the community. We can take out the comment about the high family, high median income.'",
        "'speaker_8': 'And I think.'",
        "'speaker_3': 'The what I would emphasize is that.'",
        "'speaker_8': 'Because.'",
        "'speaker_3': 'This is more of a marketing brochure as opposed to an all encompassing description of what exactly each of you might want. You know, I tried to. Under communicate. Rather than overcommunicate just to it to ensure that we we did make it more of a brief statement and try and attract the.'",
        "'speaker_8': 'Diversity of candidates that you would all look for. I think the other change I would.'",
        "'speaker_3': 'Try and make, given the mayor's input, is under the ideal candidate profile. Perhaps the next the last paragraph we can talk about someone who recognizes and appreciates a diverse community and can add, you know, positive benefits for the.'",
        "'speaker_2': 'Betterment party unity.'",
        "'speaker_0': 'Unfortunately, because that may not we might we might not be a good fit for certain candidates. We are I think, you know, we are a we are a diverse community. We are different from a lot of communities in the United States.'",
        "'speaker_0': 'Sure. So I think it is important to put that there. You know, initially so personally, I'm concerned about the comments that I think make it appear that, you know, the median income and then the well-educated populace, I don't think that really speaks to us.'",
        "'speaker_0': 'We are diverse in regards to education as well as income. But really, I think what we are is socioeconomically racially, racially. Sexual orientation, however you want to come up with that, really describes the diversity. And I think that's our richness as opposed to the attributes that are focused on here.'",
        "'speaker_0': 'However you want to describe that.'",
        "'speaker_5': 'I'm going to jump in and say, remember, we are casting our net wide. I think the we will be best served as a council making this very significant decision for our city if we have as wide a candidate pool to select from as possible.'",
        "'speaker_5': 'There is nothing wrong with saying we are a well-educated populace. We are, you know, right next to UC Berkeley. I think, you know, some of us up here on the dais have degrees from the University of California. So there's I mean, there's nothing to be ashamed of in our our capabilities.'",
        "'speaker_5': 'I and I don't think it's an either or proposition. So, yes, the cultural diversity and I you know, we should remember, too, we're in the San Francisco Bay area. I mean, some of that almost goes without saying, but nothing wrong with speaking to our rich cultural diversity.'",
        "'speaker_5': 'But I don't think we need to be ashamed of a have a good education. After all, we tout one of our selling points. I mean, any realtor will tell you is that we have a good school system in our students go on to good colleges, which.'",
        "'speaker_0': 'Is another point which is there. The next paragraph.'",
        "'speaker_5': 'Speaks We don't need to take.'",
        "'speaker_0': 'Your family first.'",
        "'speaker_5': 'We don't need to take out well educated populace. I'm okay.'",
        "'speaker_0': 'With that. I don't think it's based on fact, but I mean, it's up to you. That's my opinion. I don't know where the rest of you stand. We have people at cross.'",
        "'speaker_3': 'I'd like to see the process get going as quickly as possible. I don't think I don't think people are going to read this. So I think it's going to go out. I really don't. I think people are going to understand there's a city manager job opening in Alameda.'",
        "'speaker_3': 'They're going to Google it. They're going to look. They're going to talk to you. And you're going to go to your contacts because you have a we hired you because you have a lot of contacts. I don't want to spend any more time tonight on this.'",
        "'speaker_3': 'Go ahead and put in the diversity comment. Go ahead and put in that. We are in the San Francisco Bay area. It's cutting edge or whatever it is and get the recruiting going. That's my opinion.'",
        "'speaker_4': 'I second that.'",
        "'speaker_0': 'So we do.'",
        "'speaker_5': 'Have the.'",
        "'speaker_0': 'We do have a speaker.'",
        "'speaker_2': 'But you do?'",
        "'speaker_0': 'Yes. Sorry. So it's 1030. So to consider the remaining items six e ordinance of part time sick leave, six F Ordinance of sunshine and any nominations. Ten A We would require a motion with four votes to pass. Three Have a motion.'",
        "'speaker_0': 'All right. All right. Well, we do not have a motion.'",
        "'speaker_6': 'So.'",
        "'speaker_3': 'So move a second.'",
        "'speaker_0': 'All right. All those in favor. I know. All those opposed? No. Oppose. So, yes, the motion.'",
        "'speaker_2': 'To.'",
        "'speaker_0': 'The motion fails. Two in favor, three opposed. So we will just finish up this item. Thank you. And then we have speakers. Kara Goldstein. Yes.'",
        "'speaker_2': 'I'm sorry. I'm sorry, man. A man. That happened a little quickly. We have an ordinance that is actually fairly urgent because it's a requirement from state law. That's six, which you haven't heard yet. That is an item that we need that we need to we need to decide tonight.'",
        "'speaker_5': 'I wish we'd known about that being a change.'",
        "'speaker_0': 'Then we do. Six. Do we have a motion to entertain? Six.'",
        "'speaker_4': 'Only I'll make that motion.'",
        "'speaker_3': 'I'll second that.'",
        "'speaker_0': 'All those in favor.'",
        "'speaker_2': 'I think you opposed none.'",
        "'speaker_0': 'Okay. So we'll be hearing six after this item. Carol, you may proceed. Thank you.'",
        "'speaker_2': 'Hi, Carol Gladstone, resident. I just.'",
        "'speaker_6': 'Wanted to.'",
        "'speaker_3': 'Back up the.'",
        "'speaker_1': 'Mayor a little.'",
        "'speaker_2': 'Bit on the earnings. I just happened to have the summary for Alameda 2013 earnings. According to Transparent California, our total population of 74,818 people. The median earnings for full time year round employed residents.'",
        "'speaker_3': 'Is.'",
        "'speaker_2': '$61,378. That I wouldn't say is high income. And and I agree, we're not Piedmont.'",
        "'speaker_3': 'And I.'",
        "'speaker_2': 'Don't think we should be made.'",
        "'speaker_3': 'To look like we are.'",
        "'speaker_0': 'Thank you. Any other comments.'",
        "'speaker_9': 'On.'",
        "'speaker_0': 'Amor de SAC?'",
        "'speaker_9': 'A Thank you. I actually like the brochure as it is. For example, you know, when you look like I showed before, when you look at the median income of homeowners and in the city and remember, homeowners are half the households.'",
        "'speaker_9': 'It's $113,000, man. That's not chump change. The median income for renters is $51,700. You know, that's certainly low. So I like the the the inclusion of the education because to me, what all of these speak to is a need to get the prospects, to send them a clear message as to what kind of city they're coming to'",
        "'speaker_9': '. They're coming to a city with high expectations because they themselves have high expectations for themselves and because they are high. The residents here are well-educated. When you look at the data and I've looked at the data, so I like the way I like it the way it is.'",
        "'speaker_9': 'I'm not you know, I'm not going to get into a wordsmithing battle, but I just want to say, great.'",
        "'speaker_0': 'So do you have a are opposed to adding information about being. Diverse, somehow speaking to the diversity of our community.'",
        "'speaker_9': 'Well, I don't. But what I would suggest is perhaps somewhere that we should make data available so that the people clearly understand the parameters of diversity, whether it's along the income score or any other. So. I can give you the data, too.'",
        "'speaker_9': 'It's not a big deal.'",
        "'speaker_5': 'I'm not a mayor.'",
        "'speaker_9': 'Okay, so. So somehow if you can, you know, make sure that people can reference basic census data so that they can make conclusions for themselves. I think diversity is a fine catchall, but I don't want to send the wrong message that, you know, we're as diverse as, say, the city of Gustin in Merced County.'",
        "'speaker_9': 'You know, so, you know, diversity and whatever topics that we use, there has to be some semblance of the parameters. I'm fine with that, and I think somehow we can still convey that the details.'",
        "'speaker_0': 'Any other comments? Member Ashcraft.'",
        "'speaker_5': 'Oh, I was just going to say I agree with Councilmember de SAC and the vice mayor. And I also think Mr. Chmura has shown himself to be quite a bit of wordsmith. If you could throw in the cultural diversity somewhere.'",
        "'speaker_5': 'I have confidence that he can do that. But otherwise, yeah. Let's just get this train out of the station.'",
        "'speaker_0': 'Any other comments? Thank you. All right, then we can move on to the motion.'",
        "'speaker_5': 'This is just reckless with.'",
        "'speaker_0': 'This information being shared.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Thank you. So now we can move on to six E. Thank you.'"
    ],
    "Ordinance Amendment on Sick Leave Accrual for Part Time Employees.": [
        "'speaker_1': 'Introduction of ordinance amending the Alameda Municipal Code by deleting Section 20 5-2.4 concerning the accrual of sick leave by certain part time employees.'",
        "'speaker_2': 'Good evening, Madam Mayor and council members. My name is Monica Alvarez Celis, and I'm an analyst in Human Resources Office. I'm here tonight to speak to you about amending the municipal code, in particular, Section 25, Dash 2.4, that references the part time sick leave due to the implementation of AB 1522, commonly referenced as the Healthy Workplace Healthy'",
        "'speaker_2': 'Families Act of 2014. Our current municipal code is in violation of the requirements enforced under the new paid sick leave law. Allow me to direct you to the chart posted on page two of my report where a comparison is provided describing the key differences between our current MUNI code and AB 1522.'",
        "'speaker_2': 'Under the new paid sick leave law, its requirement that we allow our part time employees to accrue a maximum of 24 hours of leave or a three day equivalent. They would accrue leave based on actual hours, worked at a rate of one hour for every 30 hours worked.'",
        "'speaker_2': 'Our current existing municipal code provides a five day equivalent based on the average hours worked for the year. Total hours worked. Only certain part time employees are eligible. And that we are eligible to receive the sick leave 12 months after their one year anniversary date.'",
        "'speaker_2': 'The hours are not accrued but frontloaded at the at their date of eligibility. So as a staff member, it is the city's Human Resources Department recommendation that we implement the new requirements imposed by AB 1522 while simultaneously providing a more generous leave accrual, allowing a minimum of 28 hours of sick leave per calendar year by continuing to'",
        "'speaker_2': 'abide by the policies set by the current municipal code. The city is in violation of the paid sick leave law and potentially at risk for penalties. This concludes my report. I'll be happy to answer any questions you may have Member Ashcraft.'",
        "'speaker_5': 'So I have a question that I'm a little embarrassed to ask because I emailed and Michael Roche sent me a nice detailed answer and I still don't quite understand it. This is my question. Are you aware of it myself, Ellis?'",
        "'speaker_5': 'Yes. Okay. So that what I said is and that's a great table that was really helpful, but there is no reference in in the ordinance, deleting the ordinance. We're going to vote on that. Delete Section 25, dash 2.4 to the proposed administrative procedure provisions which exceed Assembly Bill 1522, specifically the 28 hours or equivalent five days and'",
        "'speaker_5': 'the one hour paid sick leave for every 30 hours worked or a front load of 28 hours at date of hire. So how if we're deleting the old ordinance that included that what takes its place so we make sure those provisions exist.'",
        "'speaker_2': 'We have drafted an administrative procedure that we have shared with the departments that have the high level of part time employees. And it's primarily it's all dependent on what's decided here at this current council meeting, whether or not we're deleting the muni code.'",
        "'speaker_2': 'So we'll have to go back in amended if we have any changes. But basically what we're doing is recommending that we go with the 28 day annual accrual based on their actual hours work rather than their average total hours worked as current under the muni code.'",
        "'speaker_5': 'And no, I understand all that. So then the administrative procedure that you reference that you're circulating among these departments. That's a good point. Not all departments would have a lot of part time work, recreation and parks probably does and some others.'",
        "'speaker_5': 'But. And is that administrative procedure something that is just approved at the executive level and doesn't come back to council?'",
        "'speaker_2': 'That's correct. Staff makes a recommendation. We send it up to administration for approval and then we implement it.'",
        "'speaker_5': 'This time I understood. Thank you.'",
        "'speaker_2': 'Perfect.'",
        "'speaker_6': 'And a mayor.'",
        "'speaker_0': 'Member ready.'",
        "'speaker_4': 'To move. Introduction of an ordinance amending the Aluminum Municipal Code by deleting section 20 5.2.4 concerning the accrual of sick leave by certain part time employees.'",
        "'speaker_0': 'Second comment member asked.'",
        "'speaker_5': 'Quick question, I guess I do have one more so on page two. The regarding the proposed administrative procedure leave accrual, how will it be determined whether sick leave is accrued one hour per every three days, worked or frontloaded 28 hours at date of hire?'",
        "'speaker_5': 'Did you just answer that?'",
        "'speaker_2': 'I did not. Okay. Our plan, our recommendation to the city administration is that anyone who is hired as a part timer on a variable schedule, that they are set up for a one hour accrual for every 30 hours worked.'",
        "'speaker_2': 'The front loading should only be made available to those who are seasonal and are all primarily in the park and RECs department because they are only eligible to work for a maximum of six months. And so we wanted to be able to provide them with the sick leave benefit sooner rather than later.'",
        "'speaker_5': 'Thank you very much. Okay.'",
        "'speaker_0': 'Okay. Although some favor I. Opposed. Motion carries unanimously. Thank you. Thank you. And now we have. City Manager Communications.'"
    ]
}