{
    "Community Preservation Fund Revenues Appropriation Order.": [
        "'speaker_0': 'Thank you. Dr. 031 child will be referred to the Committee on Government Operations. Mr. Clarke, please read.'",
        "'speaker_1': 'Dr. 0313 Duncan Number 0313 message in order for an appropriation order in the amount of $27,205,854 from fiscal year 2022. Community Preservation Fund Revenues for Community Preservation Projects. At the recommendation of the City of Boston Community Preservation Committee.'",
        "'speaker_0': 'Fed chair calls on At-Large City Council Michael Flaherty Council.'",
        "'speaker_3': 'Rates to look forward to sharing an expedited hearing. Hope to get something on the council chamber calendar very soon. Prior to the beginning of a budget process so that there are no delays and backlogs to funding these very worthwhile projects.'",
        "'speaker_3': 'So we get 27.2 million, 14.6 for housing, 6.1 for historic preservation, and 6.5 for open space and recreation. So I'll make sure we get notice out to other colleagues so they can attend and advocate and learn about projects that are happening in their in their respective districts.'",
        "'speaker_3': 'Thank you, Ms.. President.'"
    ],
    "Short Term Extension of Urban Renewal Plans in Boston.": [
        "'speaker_0': 'Thank you, counsel. Clarity. Docket 0313 will be referred to the Committee on Community Preservation Act. Mr. Clerk, please read Docket 0314.'",
        "'speaker_1': 'DUNCAN Number 0314 message in order for your approval. In order for a short term extension of nine over the 14 remaining urban renewal plans in Boston.'",
        "'speaker_0': 'The chair calls on District City Councilman Frank Baker. Counsel Baker, you have the floor.'",
        "'speaker_1': 'Thank you, Mr. Chair. I just want to make a quick announcement about this. This talk a number here between council block and myself. Council block. Had we had a hearing scheduled to talk about some of the powers of BPD.'",
        "'speaker_1': 'A lot of them fall under urban renewal. So we've decided to cancel next week's hearing and roll it and roll it into this 0314. So just so people have a little bit of clarification. Thank you.'",
        "'speaker_0': 'Thank you, Counsel Baker. I could 0314 will be referred to the Committee on Planning, Development and Transportation. Mr. Quirk, can you please read docket 031640319 together? Yes. Mr. Corrao, please read Typekit 0315.'"
    ],
    "Reappointment of Matilda Drayton to the Boston Housing Authority Monitoring Committee.": [
        "'speaker_1': 'a term expiring February 28, 2024, and talking numbers 0319 message in order for the confirmation of the reappointment of Matilda Drayton as a member of the Boston Housing Authority Monitoring Committee for a term expiring February 28, 2024.'",
        "'speaker_0': 'Thank you, Mr. Clarke. Now. Councilor O'Hara, chair of the Committee on Housing and Community Development, is seeking suspension of the rules and passage of these dockets. We had similar dockets in the last meeting, which we also suspended the rules and passed council of our review working to speak on this.'",
        "'speaker_0': 'Okay. Okay. We will take the vote on each docket separately. They cheer, they cheer. Recognizes District City Councilor Frank Baker, Counsel Baker.'",
        "'speaker_1': 'Thank you, Mr. President. I just want to make a point about the last meeting when we did suspend and pass the the new members for the the this housing board. At the at the time it was happening, I was unable to speak.'",
        "'speaker_1': 'I was having something going on. But I think it's our duty for for confirmations, especially when they're not three appointments, new people. I'm sure you don't know what the Housing Housing Board does. So the reason for hearings and reason for confirmation of the people that are coming on those boards for us to find out what they do'",
        "'speaker_1': '. It isn't just asking people who they are, what they like, what color you have. It's what. Why are you good at going to be good for our city in this job? And actually, what does it what does the job entail?'",
        "'speaker_1': 'So we would also be asking VHA executives, probably, I would think, what what the task of the housing board is just a stake in him. Is that. Mr. President, I'm not. Look, these are all re appointments and we we routinely routinely suspended past reappointment.'",
        "'speaker_1': 'But I think with appointments, we should be looking we fight for confirmation powers school committee, I think at a baseline should come here and we should confirm those school committee appointments. That's something that we don't have in the original legislation that Eddie Eddie's dad put forth.'",
        "'speaker_1': 'The original legislation had city council confirmation powers within it. When the legislation came back to us, those those confirmation powers were taking out for the school committee, I stand up because there's a reason why we have confirmation powers.'",
        "'speaker_1': 'So just a statement. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counselor Baker. Thank you for those comments. They they are very helpful. As these re appointments counsel Lara is seeking suspension of the roles in passage of these dockets. We will take the vote on each docket separately.'",
        "'speaker_0': 'Mr. Caulk on Docket 0315. Yeah. Okay. 1.20315 Console virus suspension of the rules in passage. Again, docket 0315. All those in favor say aye. Aye. I opposed say no. The ayes have it. Docket 0315. Council are seeking suspension of the rules and passage of docket 0316.'",
        "'speaker_0': 'All those in favor say aye. Aye. I oppose say nay. The ayes have it. Docket 0316 has passed. Council are seeking suspension of the roles and passage of docket 0317. All those in favor say aye. Opposed say no.'",
        "'speaker_0': 'The ayes have it. Docket 0317 has passed. Council are seeking suspension of the rules and passage of Docket 0318. All those in favor say aye. Aye. I oppose any. The ayes have it. Docket 0318 has passed. Council are seeking vet suspension of the rules and passage of docket 0319.'",
        "'speaker_0': 'All those in favor say aye. Aye. I oppose say nay. The eyes have it darkened. 0319 has past reports of public officers in other. Mr. Clark, please read docket.'",
        "'speaker_1': '0320.0320 communication was received from the City Clerk regarding the 2021 2022 University Accountability Statistical Report.'"
    ],
    "Federal Grant for Violence Against Women Act Stop Program.": [
        "'speaker_1': 'Submits a report recommending the order of the test and number 0166. The Committee on Public Safety and Criminal Justice, to which was referred on January 26, 2022. Number 0166 message in order authorizing the City of Boston to accept and expand the amount of $125,000 in the form of a grant for federal fiscal year 21.'",
        "'speaker_1': 'Violence Against Women Act stock grant awarded by the United States Department of Justice as passed through the Massachusetts Executive Office of Public Safety and Security to be administered by the Police Department. The grant will fund civilian violence, if you could, who provide services for victims in Jamaica Plain, East Boston Child's Time and overtime for all domestic violence'",
        "'speaker_1': 'advocates submits. A report recommended that the order author pass.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Clarke. The Chair recognizes counsel for each year of the Committee on Public Safety, Criminal Justice. Counsel for Charity of the Floor.'",
        "'speaker_3': 'Mr. President. Then, thanks to the clerks, you'll make my job much easier and shorter. We get six dockets that we're looking at. So these matters are sponsored by Mayor Wu and referred to committee on January 26th. We held a public hearing Thursday, February 17th.'",
        "'speaker_3': 'Thank my colleagues for attending us to the great questions. We heard testimony that's 0159 and 0163 together for those of the fire departments. Commissioner john dempsey and deputy commissioner, administration finance kathleen judge are coming to testify and the safer program ensures it will be a recruit class of 85 for the Boston Fire Department.'",
        "'speaker_3': 'The commission reports that the grant is the largest grant in the country and will save our city over 24 million in the next three years. The salary benefits for these new recruits. And with respect to docket 0163 is so eloquently described.'",
        "'speaker_3': 'This obviously is to help our first responders over in the mass and CAS area. It'll be a collaborative effort between the fire department, first responders, the mayor's Office of Recovery Services, Boston Public Health Commission, Boston Police to help improve response times to opioid overdose calls and events.'",
        "'speaker_3': 'So with that, she was asking that both of those dockets. And it's again, it's a year for a four year agreement with respect to the remaining four dockets docket 0161. That's Captain three because Mesquite and Lieutenant Richard Driscoll came in and testified on behalf of the police department.'",
        "'speaker_3': 'This grant will improve the police department's capacity to respond to violent crimes and assist in the review inventory and follow up investigations of up to 100 unsolved sexual assault cases that pose the most significant risk and threat to public safety.'",
        "'speaker_3': 'Docket 0162. With respect to Emergency Services Best Team, this grant is intended to support law enforcement, behavioral health system, collaboration, and to improve public safety responses and outcomes for individuals with mental health, illness, substance abuse who also come in contact with the criminal justice system with respect to Docket 0164.'",
        "'speaker_3': 'Those funds will assist the crime laboratories to increase their capacity to process more DNA samples and to reduce the number of forensic DNA and DNA database samples awaiting analysis and to prevent a backlog with respect to forensics in DNA samples in Docket 0166.'",
        "'speaker_3': 'That grant obviously targeting Jamaica Plain, East Boston and Charlestown. Civilian positions, civilian advocates working in partnership with BPD to help provide victims of violent crime with protections and services they need. And so as a result of that, as chair of the Committee on Public Safety, moving for passage of docket 01590161016201630164 and 0166.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, counsel. Already. At this time. The at this time the chair recognizes Counselor Edwards, counsel Edwards. Do you have the floor?'",
        "'speaker_4': 'Just for my clarification to the to the chair. Counsel Flaherty We had hearings on every one of these. Correct. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Edwards. Anyone else want to talk before we vote on this? Any further discussion? Counsel of Clarity. The Chair and the Committee on Government Operations seeks acceptance of the Committee report and passage. We'll do each, each one individually.'",
        "'speaker_0': 'The first one is docket 0159. All those in favor say aye. Aye, oppose. Say nay. The ayes have it. Docket 0159 has passed. Counsel of Clarity, the chair of the Committee on Government. Coming up on public safety six acceptance of the committee report and passage of docket 0161.'",
        "'speaker_0': 'All those in favor say aye. Aye. Opposed, say no. The ayes have it. 0161 has passed the Council with clarity. The chair of the Committee on Public Safety, Criminal Justice, seeks acceptance of the Committee report and passage of docket 0162.'",
        "'speaker_0': 'All those in favor say I post-Sandy the ayes have it 0162 has passed. Council of Florida, Chair of the Committee on Public Safety Criminal Justice seeks acceptance of the Committee report passage of docket 0163. All those in favor say aye.'",
        "'speaker_0': 'Aye, oppose. Nay, the ayes have it. 0163 has passed counsel priority. The Chair of the Committee on Public Safety Criminal Justice seeks acceptance and passage of the Committee report passage of docket 0164. All those in favor say I am opposed.'",
        "'speaker_0': 'Nay, the ayes have it. And finally, Council of Florida, the chair of the Committee on Public Safety, Criminal Justice, seeks acceptance of the committee report and passage of docket 0166. All those are all those in favor say aye.'",
        "'speaker_0': 'Aye. Opposed nay. The ayes have it. 0166 has passed. Mr. Clerk, please read docket 0222.'"
    ],
    "Home Rule Petition on Real Estate Transfer Fees and Senior Property Tax Relief.": [
        "'speaker_1': 'Lucky number 022 to the Committee on Government Operations, to which was referred on February 2nd, 2020 to Docket 0222 message in order for your approval, a home rule petition to the General Court entitled Petition for a Special Law Relative to an Act and be enact relative to real estate transfer fees and senior property tax relief submits a'",
        "'speaker_1': 'report recommending that the home move petition to pass in a new draft.'",
        "'speaker_0': 'Thank you, Mr. Clarke. The Chair recognizes counsel. Royal Chair of the Committee on Government Operations Counsel. Royal. You have the floor.'",
        "'speaker_1': 'Thank you, Mr. President. This docket was sponsored by the administration, referred to the committee on February 2nd, 2022. The committee held a hearing on February 10th and a working session on February 25th. I want to thank all of my council colleagues who attended the hearing, the working session.'",
        "'speaker_1': 'It was, and the entirety of the council actually attended. So that was Counselor Baker. Counselor Edwards. Counselor Flaherty. Counselor Flynn. Counselor Louis Gen Counselor. Overall Counselor Murphy. Counselor Media Counselor Counsel Laura Lara, Counselor Fernandez Anderson and Counselor Brady.'",
        "'speaker_1': 'So thank you, all of you, for your attention to this. I also want to thank Chief Dillon, Deputy Director Tim Davis, Commissioner Shea and Neil Dougherty for their attendance and participation. Docket number 2 to 2 is a home rule petition that would authorize the city of Boston to impose a transfer fee to be paid on certain real'",
        "'speaker_1': 'estate real estate transactions and expand the current senior property tax relief program. The transfer fee provisions would allow the city to impose a transfer fee of up to 2% on real estate sales over 2 million, exempting the value of 2 million of the sale.'",
        "'speaker_1': 'Revenue from the fee would be deposited in the Neighborhood Housing Trust. Transfers between family members, transfers of convenience and transfers to the government would be exempt. The city would outline specifics of the program through an ordinance which would come through this body for approval.'",
        "'speaker_1': 'The senior property tax relief provisions would adjust the income and asset limits for senior property tax relief eligibility. At the hearing, the administration testified that this home rule addresses a fact that all councilors are aware of, which is that too many Boston residents are struggling with housing.'",
        "'speaker_1': '15,000 seniors and the city are paying more than 30% of their income for rent. 60,000 non senior households are also rent burdened. Over 40,000 people are on the waiting list for housing. On any given night, there are 900 unhoused individuals in the city of Boston and as of the last census data, 900 families living in the Boston'",
        "'speaker_1': 'family shelters. We know that for families to build wealth and stay in the city, they need to have access to affordable housing and to expand affordable housing. We need increased revenue streams to do so. The proposed transfer fee will provide much needed revenue for affordable housing and housing stability programs based on 2021 sales.'",
        "'speaker_1': 'The fee would have affected 704 transactions across the city, the majority of which would have been in downtown neighborhoods and on high priced condominiums, as well as larger commercial transactions. The administration also highlighted how both components of the home rule proposal would help seniors in need of affordable housing who are having trouble meeting their expenses.'",
        "'speaker_1': '74% of individuals and 44% of older couples living independently in Boston have incomes below the elder index, meaning that they have less income than it costs them to live in the city. At the working section, the committee discussed various concerns, including overlap with the pending state legislation reevaluations of the exempted value amount, that amount for account for'",
        "'speaker_1': 'inflation and the extent of the ability provision. The administration explained that despite potential overlap, the current proposal would provide Boston with the best remedy for its residents. Councilors also suggested the addition of language for flexibility to increase the exemption value with inflation and market values.'",
        "'speaker_1': 'Though to be clear, the actual exemption amounts will be determined in an ordinance that will come to this body before this ever gets implemented. Regarding the amend ability provision, the administration stated that given the interest from multiple municipalities and the multi-year conversions on the topic of the transfer fee, giving the state maximum flexibility would increase the bill's'",
        "'speaker_1': 'chance of passage. The Council expressed concerns about the broadness of the current language regarding amend ability, and the Chair suggested limiting this language slightly, even just to specify the objectives laid out in the bill itself. Ultimately, based on information gathered at the hearing in the working session and follow up with the administration, that amendment was not taken'",
        "'speaker_1': 'up. The exempted value section was amended to change the evaluation period from five years to three years and also direct evaluations to happen. So to be clear, Councilor Flaherty and I believe Councilor Zero, among others, raised the the exemption amount with inflation with rising cost of inflation.'",
        "'speaker_1': 'Could could catch folks in the in the web that it wasn't designed to do. In the amendment that we have in the amended version seeks to incorporate the amendments that they suggested, which are to change the language to ensure that those evaluations happen, to change the years from five years to three years.'",
        "'speaker_1': 'So the evaluations were supposed to happen every three years, every five years. And the original draft in this draft, it's every three years. And so that's what's in the amended said section. It's those amendments that were taken up.'",
        "'speaker_1': 'There was also a request to to split essentially this into two parts. One part for the seniors tax relief, another for the transfer fee that was also not taken up. Passage of docket zero 2 to 2 and its amended version will provide property tax relief to vulnerable senior residents and provide the city with the authority and maximum'",
        "'speaker_1': 'flexibility to impose a transfer fee on certain real estate, the revenue from which will contribute to much needed resources for affordable housing in the city of Boston. As the Chair, I recommend that this this docket ought to pass in the new draft.'",
        "'speaker_1': 'And just again, to be clear. The transfer. Tax itself will have to come that transfer fee after we get approval from the House, after we get approval from the Senate, after the governor signs it, it will still have to come through this body and be passed by this body, the senior tax relief that will actually get implemented'",
        "'speaker_1': 'immediately. And so once that gets signed, that is that is law. And so, Mr. President, I am seeking a vote and passed in a new draft. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Royal. Any of my colleagues like to discuss the matter at this time. I want to recognize the chair, recognizes counsel, priority counsel, clarity of the floor.'",
        "'speaker_3': 'Take, Mr. President, and obviously we want to thank the chair. I was having connectivity issues and he I don't know how he was able to do it, but masterfully was able to decipher what I was actually saying and then to, you know, accurately report those questions back to the panel.'",
        "'speaker_3': 'So I appreciate his effort as I was struggling with that with the Internet and also thank the one of the lead sponsors. And I've been a leader on this party with respect to affordable housing prior to her tenure here, but also while here.'",
        "'speaker_3': 'And this petition, I feel, is stronger than previous petitions that we've sent up to Beacon Hill, because it does more to ensure that we're not unintentionally targeting middle class property owners with that 2 million exemption as well as and I appreciate the indulgence of the lead sponsors in the chairs to to work with the administration on on'",
        "'speaker_3': 'having that reevaluation done every three years just to make sure, again, we're not sort of catching unintentionally catching folks in in that web, but this is targeting sort of the flippers, you know, the residential and the commercial flippers that we want to make sure that lifelong residents and to our long term property owners, those that I consider'",
        "'speaker_3': 'to be, as you say, house rich, but cash for many of the folks that we know that fixed income seniors that have on their own property, they retired and they continue to see things happening around their neighborhood, which they're not necessarily participating in.'",
        "'speaker_3': 'But every time that tax bill comes in, they're paying a price for that just by the fact that they've only their property. They've kept their property up and they're being valued and evaluated based on what sort of happening on that street or around the corner.'",
        "'speaker_3': 'So this will just sort of maybe bake in some protections for them. It's also an improvement because the senior property tax relief that changes Section 41 see that both the chair and council literary which had described in detail because we have seniors in every neighborhood, in every corner of the city that have burdened and overburdened by the'",
        "'speaker_3': 'increased property taxes. I also briefly want to touch on the ongoing discussion about the neighborhood housing trust, the ability to efficiently receive and distribute the influx of of funding. This was a discussion that we've had multiple times on this body, probably most recently as 2019 with an early version.'",
        "'speaker_3': 'And then we had passed that again in 2022. So if this were to pass in the State House, it's critical for us to be very prospective via the ordinance with the district distribution and use of these funds. You know, I've often suggested that, you know, we have an affordable housing crisis, a line item, we should have a'",
        "'speaker_3': 'line item in our budget in that so that we, as elected members on behalf of residents, could more readily and easily access those so that we could target those affordable housing crisis needs in our city. I also want to echo some of the comments that our colleague, Counsel Baker, had mentioned during the hearing specifically.'",
        "'speaker_3': 'You know, that's the most pressing issue facing our city. And yet the resources we continue to throw at it each year, it's still extremely difficult for all of us to help get people placed in housing and to secure affordable housing via the ADP.'",
        "'speaker_3': 'A lot of it still remains to some a mystery. So we need to continue to double down on our efforts to streamline that process. And, you know, so we need a district that is in need of affordable housing or a unit we as their elected representatives, district writ large council, we should be a conduit.'",
        "'speaker_3': 'We should be able to run out the ground ball for that person to get them into a house. And so I, I know that the D.A. and our affordable housing team, they do great work. And it's truly a labor of love for for many of our city employees, particularly those that are on the front lines for affordable'",
        "'speaker_3': 'housing. But I do want to stress that it's important that we allocate precious funding towards the highest and best use for affordable housing issues and really gives long thought to targeting shovel ready projects so that that money that once it becomes available, can go right to work and put someone in a home and get a roof over'",
        "'speaker_3': 'their head. And then we as their representatives can advocate on their behalf and help them facilitate an affordable housing unit. Thank you, Mr. President, for to to support him.'",
        "'speaker_0': 'Thank you, counsel. Florida, the chair recognizes District Council Counsel Baker Council baking of the floor.'",
        "'speaker_1': 'Thank you, Mr. President. Just a couple comments. I will be voting no on this today. Based on based on the fact that I think the the senior benefits should be separated out of out of this. So so when we do send it to the state House, they're voting on just a senior benefit.'",
        "'speaker_1': 'This is something we should be doing already, shouldn't be attached to a tax. The problem I have with the tax with the with with this coming in here is somewhat council clarity had to say if this were much more prescriptive if we were in year one, going to build a West End library with 100 apartments above it'",
        "'speaker_1': 'and all the money was going to go towards that. I'm in if we were going to go into District four and some of our city land that we own or we're going to build 40 unit, 40 unit buildings, the.'",
        "'speaker_1': 'Many unit buildings here, the money being directly directed right there, large pieces of money, not $1,000,000 here to a connected development, $1,000,000 here, unconnected program or four 5 to 1 C, I think it needs we need to start taking larger pieces of our money, whether it's IDP, whether it's job, job, not job trust, housing, trust money and'",
        "'speaker_1': 'putting the amount of ten, 20 million into building our own infrastructure. Again, just the way the money gets cut up and sent spreads the infield. I don't find it to be an effective, effective model. And then the third point is we can't get our own people in these units that are getting built.'",
        "'speaker_1': 'Good luck trying to find an apartment for somebody when we know they're getting built all over the place. No. Yeah. 800th on the list. You've been on the list for ten years. Can't get you in. So there's a problem there some place I'd like the city to start actually owning the buildings that we're building, using our money'",
        "'speaker_1': 'and building infrastructure instead of just giving it to developed to developers. Because a lot of the money that's made in affordable housing is made in building fees. That's how that's how the people that are building these are making the money.'",
        "'speaker_1': 'And then and then it gets and then it gets managed to we have to do lotteries and everything else to get our people in. So I hope I didn't I made some sense there. But thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counsel Baker. The Chair recognizes District Councilor Ken Rivera and this will not be council of our is made in speech console of our view of the floor.'",
        "'speaker_4': 'Thank you, President Flynn, as the chair of the Housing and Community Development Committee and as the City Councilor representing District six, I just want to reiterate my support for this home law petition. District six has one of the highest concentrations of seniors in the city, and in addition, our neighborhood in the past decade has seen an increase'",
        "'speaker_4': 'of displacement, lack of affordability and gentrification, which has made affordable housing that much more important. It's for that reason that I think it's not only important that we pass the transfer fee, but also the expansion of 41 C together.'",
        "'speaker_4': 'And so I ask that the Council not bifurcate those two, but keep them collective at this moment.'",
        "'speaker_0': 'Thank you. Thank you, counsel. Anyone else like to speak on this matter? Thank you, Councilor Arroyo, the chair on the committee. The Chair of the Committee of Government Operations seeks acceptance of the Committee report in passage of Docket 0222 in a new draft.'",
        "'speaker_0': 'Let let me call on counsel. Bork, would you like to speak before we do the vote? I just want to say.'",
        "'speaker_2': 'This. And I think we need more resources for affordable housing of all types all over the city. And it's a very, very urgent thing. I actually wanted to thank Councilor Flynn. I think that the the hearings and working sessions that we had on senior property tax relief last year at his behest because of hearing orders that he'",
        "'speaker_2': 'filed, really allowed the administration to start getting into the weeds at 41 C. And so I think the ability for the administration to add that piece to this and combine the two really came out of that conversation we had in Ways and Means last year.'",
        "'speaker_2': 'So just wanted to acknowledge that I think this is a proposal that has been worked through by some really good council work, both by Councilor Flynn and our committee, and then also of course, by Councilor Edwards and some of our predecessors on the council.'",
        "'speaker_2': 'So I just wanted to thank everybody for all the work of the council in partnership with the mayor to get to this point.'",
        "'speaker_0': 'Thank you. Thank you, Councilor Mark, and apologize for not calling on you sooner. Um. So Councilor Arroyo, the chair on the Committee on Government Operations, seeks acceptance of the committee report and passage of Docket 0222 in a new draft.'",
        "'speaker_0': 'All those in favor say aye. All right. All those are proposing a a mr. Kirk, will you please do a roll call vote?'",
        "'speaker_1': 'Roll call vote on docket 0222. Councilor Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Name? Councilor Baker. No. Councilor Book. Yes. Councilor Bullock. Yes. Councilor Braden. Councilor Braden. Yes. Councilor Edwards. Councilor Edwards. Yes. Councilor Fernandes Anderson. Councilor Fernandes. Anderson.'",
        "'speaker_1': 'Yes. Council. 30 Years. Council 30 years. Councilor Flynn. Yes. Councilor Flynn. Yes. Council. Council. Ah. Ah yes. Councilor Lui Gin Council. Region. Yes. Councilor me here. Councilor Murphy. Councilor Murphy. Yes. And Councilor World. Yeah. Councilor Warrell. Yes.'"
    ],
    "Special Law on Environmental Justice in Boston.": [
        "'speaker_0': 'Thank you. Thank you, Mr. Clarke. Docket zero to Tokyo has passed. Motions, orders and resolutions. Mr. Quiroga, please. We talk at zero 3 to 1.'",
        "'speaker_1': 'Ducking number zero 3 to 1. Councilor Edwards offered the following petition for a special law re securing environmental justice in the city of Boston.'",
        "'speaker_0': 'Thank you, Mr. Clark. I know Councilor Edwards will move to substitute the updated draft in central staff already distributed the new draft. At this time, I call on City Councilor Edwards. Do you have the floor?'",
        "'speaker_4': 'Thank you very much, Mr. President. Am very excited to bring this to the floor for us to to introduce this new home rule petition at the end of the day. It is dealing with our constitutional rights, our recent defined rights as for environmental justice and also making sure that our zoning is in line with those rights.'",
        "'speaker_4': 'I want to be I don't know if anyone else has read the Constitution and our constitutional rights in Massachusetts, but Article 97 states, very clearly the people should have the right to clean air and water freedom from excessive, unnecessary noise, the natural, scenic, historic and esthetic qualities of their environment, and the protection of the people in their'",
        "'speaker_4': 'right to conservation, development and utilization of the agricultural, mineral, forest, water, air and other natural resources is hereby declared to be a public purpose. So in our own Constitution, we have the right to clean air and water. Moreover, and part of that conversation continued as of last year, when we defined environmental justice principles and our general laws'",
        "'speaker_4': '. Those principles meaning that the people. That people in the Commonwealth. Shall have protection from environmental pollution and the ability to live and enjoy a clean, healthy environment regardless of race, color, income, class, handicap, gender identity, sexual orientation, national origin, ethnicity or ancestry, religious belief or English language proficiency.'",
        "'speaker_4': 'And those principles include the meaningful involvement of all people with respect to the development, implementation, and enforcement of environmental laws, regulations and policies, including climate change policies, and, of course, the equitable distribution of energy and environmental benefits and environmental burdens.'",
        "'speaker_4': 'Our laws are very clear about our rights and the procedures that are to protect us. We are moving towards a more environmentally just state. But what isn't moving towards that is our zoning. And as many of you will know and some of you new councilors will soon learn.'",
        "'speaker_4': 'Boston is unique when it comes to zoning. When we want to change how we do business and how we build in the city of Boston, what we want to change is on the zoning board of Appeals. We and only the city of Boston must go to the state house.'",
        "'speaker_4': 'That is why this is in the form of a federal petition. Other cities and towns could easily inject and move environmental justice principles in their zoning with the snap of a finger. We must go to the State House because our system is broken.'",
        "'speaker_4': 'Article six, Section six of our zoning code currently allows the following. A building structure early on used to be land used or to be used by a public service corporation. Utility company may be exempted from the operation of zoning, regulation or amendment.'",
        "'speaker_4': 'If a competition of the corporation, the State Department of Public Utility shall, after public notice and hearing decide at the present or proposed situation of the building structure, land in question is reasonably necessary for the convenience of public welfare.'",
        "'speaker_4': 'In short, public utilities can simply petition the department or the public utilities to forego rezoning. And as long as the State Department of Public Utilities decides that it's best for Boston and our public welfare, that they forego and go through any process or zoning they can.'",
        "'speaker_4': 'Which brings me to this reason why I'm presenting this today. The East Boston substation is a perfect example of what happens when you can petition the state to determine what is better for a neighborhood and not actually have to face the individuals who will live with that permanent structure by their park, by their homes.'",
        "'speaker_4': 'When the city of Boston essentially abdicated their role because the utility company could simply ask to foreclose. So I'm asking you to support this homework petition because it corrects that system. That system we've been asking for and we saw it was broken.'",
        "'speaker_4': 'We had a five hour hearing at East Boston in many languages. We watched how the Dpu and the state agencies literally didn't include people who didn't speak English in the process for the substation. We, as you all know, have a mandate as public officials.'",
        "'speaker_4': 'That mandate on November 2nd made clear in every single one of our districts and of course, at the city at large, that that substation does not belong where it currently is situated and needs to go to another location.'",
        "'speaker_4': 'More importantly, the process that got it there was a failure. And as you know, question two is the most popular referendum we've ever had in the city of Boston getting more votes in the mayor. And of course, any individual, one of us in our districts.'",
        "'speaker_4': 'The time to act is now. And what I propose is this homo petition that would do three things. One for the first time if it allow for us at the city of Boston to take from the state this power that they have over us.'",
        "'speaker_4': 'And allows for us at the city of Boston to come up with a process. For for public utilities. If they want to be sited in our neighborhood, it then tells them, tells us or tells the city of Boston that the passing zoning commission will come up with that alternative process.'",
        "'speaker_4': 'We will not be going to the state House anymore to regard zoning. We will create it ourselves for public utilities and to make sure that they can move as fast as they need to. But according to our terms.'",
        "'speaker_4': 'And then ultimately it injects environmental justice as one of the enforcement powers of our building commission. Mission pursues me. That person already can stop a project because it's not safe, because it's not sanitary, and now because it's environmentally unjust.'",
        "'speaker_4': 'I want the Building Commissioner to be able to walk into a project and determine, based off of certain standards, that the environmental justice is being so violated that it cannot continue to operate and cannot continue to build. Basically, adding to the police powers of the city of Boston for our safety and for our loans that are guaranteed'",
        "'speaker_4': 'to us under our Constitution. As I mentioned, when I opened the right to clean air, the right to clean water, and essentially the right to live in a healthy environment. I'm hoping that you will join me. Sign on today to this Homo petition.'",
        "'speaker_4': 'I look forward to an expedited or close to hearing before I leave this body, and I look forward to catching this home rule on the other side. Beacon Hill. You have to know that environmental advocates are excited about this conversation and the amended version.'",
        "'speaker_4': 'I just wanted to note the only amendment was put in to make sure that our waterfront was also part of the enforcement protection from the building commissioner. Ultimately, this is where we need to go. This is where we are going as a state, as a country.'",
        "'speaker_4': 'We need our zoning to be updated, to include environmental justice standards and to protect our neighborhoods. And I hope you'll join me in doing that. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Edwards. Would anyone else like to speak on this matter? Would anyone else like to ask? That she recognizes counsel, clarity, counsel, clarity of the focus.'",
        "'speaker_3': 'Should obviously commend their colleague for her work on this and through the chance for her want to see whether or not there's an opportunity with existing sites that are not good neighbors and have been polluting. Is there a way through this legislation to maybe kind of hook back on to those and work with, you know, some city'",
        "'speaker_3': 'officials, etc., to maybe talk about either moving them or in finding more appropriate locations? Or are they, I guess, technically grandfathered? Right. I would because obviously I'm supportive of calling in for efforts in East Boston. But we can go across the city and you sit there and you say, how did that happen and why is that there'",
        "'speaker_3': '? And I heard about this. So. Is there a way through this legislation that will be able to kind of go back in time and identify sites that are inappropriate in those particular locations and then work with those entities to maybe move them to more appropriate locations?'",
        "'speaker_3': 'Again, just a question for the chair to make it count.'",
        "'speaker_0': 'Councilor Edwards.'",
        "'speaker_4': 'Thank you very much. As the standards for sanitation grow, as the standards and enforcement standards grow, and any other aspect of which the building commissioner can enforce our zoning laws, then they would have the same standards and the ability to grow and stop works on existing environmental injustices.'",
        "'speaker_4': 'So it isn't just that we don't like something. And I want to be very clear, this isn't a NIMBY move to stop infrastructure. We do need and need to talk about how we are building for our electrical grid.'",
        "'speaker_4': 'There is no doubt at some point we will need versions of substations in all neighborhoods. The issue with this one was the process that there wasn't an actual open assessment of the data used by Eversource. The fact that we weren't allowed to question it and moreover the fact that they didn't even think of green alternatives.'",
        "'speaker_4': 'And that would have happened, I believe. And we can zoned that and require that to happen going forward. But with the building commissioners, police enforcement powers, if there's an active environmental injustice, they should be under this law able to stop it, to move it.'",
        "'speaker_4': 'Well, that might be something you might want to put in a friendly amendment in the future.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you. Counsel. I would think. Counsel. Clarity. Anyone else like to speak on this or your name? Mr. Clarke, please add Counselor Arroyo. Counselor Bach. Counselor Braden. Counsel Fernandez Andersen. Counsel. Clarity Counsel. Laura Counsel. Illusion Counsel.'",
        "'speaker_0': 'Murphy Counsel. Overall, please add the chair. Dawkins zero 3 to 1 will be referred to the Committee on Government Operations. Mr. Clerk, please read docket 032 to please.'"
    ],
    "Hearing on Voting Rights for Immigrants with Legal Status.": [
        "'speaker_1': 'Ducky number 0323 Counsel LRA offer the following order for a hearing to discuss restoring municipal voting rights to immigrants with legal status.'",
        "'speaker_0': 'The chair recognizes Cancellara. Cancellara. You have the floor.'",
        "'speaker_4': 'Thank you, President Flynn. Given the nature of my hearing order, I will be delivering my speech first in Spanish and then in English. And Los Estados Unidos. Amazon will be another Pueblo born Pueblo Pueblo Bedouin Lugard as a cornerstone of democracy and must complete the 80%.'",
        "'speaker_4': 'Nosotros El Pueblo si are definitely my de la limitada Saudi saddle, but I'm aware that a classical M.A. in I got it. I lost the Rachel Sebelius Alaska money that is Kaesong historical maintain marginal us. In Boston, Mass.'",
        "'speaker_4': 'They got into emailing me. Grant, this is Stan Buddy Battles this is the Rachel's partner with us ladies electorally they support to maintain exclusion they will probably be all nosotros no f exclusive. And that is the immigrant this.'",
        "'speaker_4': 'No, that was both. I was hoping to sell it in Las Elecciones this representantes las personas because Duncan Garcia led us on this Posadas, the successful Alamo later in with a fantastic new dad. But incrementally, ladies, this and all this worthy.'",
        "'speaker_4': 'And with this. The participating. A process of electoral. So you get an Oscar. I don't go get people that I'm into representative representative of the remote control, maternal PR and electoral problem. This address that if any see on their democracy in one thing these towns here divided central and as Montenegro's.'",
        "'speaker_4': 'Cataloger. Linda vamos nuestros vecinos escudos. Therefore they're not oppressor. Unable to, but able to motivate us. Extruder. Democratization must be. Poor Supuesto. But the most common side I founded Eldorado Legacy and that parable, DA or Gondor. The Rachels advising me grants equal the order in and.'",
        "'speaker_4': 'But I process or democratic or not, they're meaner. Me They better. Me not this voice can say a mythical model. Nosotros El Pueblo todo el pueblo the ready almost an animal there no solo para representantes si no. But I participated in a mean inquisition discussion.'",
        "'speaker_4': 'Every deliberation came back that the idea. Nosotros are Pueblo Podemos her organization with rebel valores de las personas potency dance. Yes, but at the head of astrobiologists democratization laws regarding the trabajo guarantees are made of the Venus of the nameless but familias Prospero.'",
        "'speaker_4': 'Nosotros are pueblo. Well, then listen to me. Not. I'm innocent of this blasphemy in the last movie. And that's going to allow us for lack of money that it goes through. It must be the end of socialism. But most indicative of the killings.'",
        "'speaker_4': 'Nosotros and pueblo podemos central sobre Tania in DNA a implementable regulations ambiental is commenting on the lack of money that is most vulnerable as the most resilient. This frontier cambio climatico el centro de la toma. The decision is.'",
        "'speaker_4': 'No problem. But it must have been sad. But at least out of the reach of the vote, the municipal is paralyzed immigrants. Yasser Cano's old muscle mass starvation. They all are Democrats of Seattle. Transformative to them. Process. A process of Democratic alchemy inside Las Ordonez is expanding.'",
        "'speaker_4': 'Ms.. I think we are no longer in look the trabajo. Oh, God, yes. Cullar. But I get glasses and I'm on. How about us gassing Mr. Vice Minister Stadium in West Sudan? Lucas Oil I think I'm way out of the Terminator Collective.'",
        "'speaker_4': 'I'm into Super Duper Democracia. No, the end of the river. The end of the world. No, they were bad ideas. Del Centro. See? No, because you are saying I shot them through this. The nose. Martinez must play. Thank you, President Flynn, and good afternoon to all of my colleagues on the city council, the staff and constituents who'",
        "'speaker_4': 'are present in attendance here today. Let me begin by expressing my deep gratitude to the people of District six. Thank you. It's my honor to serve as a steward of our collective vision here at City Hall. The first time that I stepped foot in the iron chamber, I wasn't a city councilor.'",
        "'speaker_4': 'I was 13 years old, standing in the gallery, attending my first protest. At the time, I couldn't imagine that I would be here with you today. I'm humbled to be the first person of color to represent my district and to have earned the trust of such a diverse coalition of people.'",
        "'speaker_4': 'But the path from the margins to the center was not an easy one. The campaign trail was long and filled with pointed reminders that women like me belonged on the outside. Still. The electoral process pulls us in. It activates our neighborhoods.'",
        "'speaker_4': 'It ignites conversation and debate. It allows us to hear our neighbors most challenging concerns and revel in their most transformative visions for a more inclusive city. One of the unexpected joys of the campaign trail was running into other candidates, loved ones.'",
        "'speaker_4': 'We all know that our family members are our best surrogates. And there's a special pride in a parent's piece when they ask you to vote for their child. I talked about public safety with Johns. Billions died and was Roxbury.'",
        "'speaker_4': 'I ate freshly baked cookies with David Talbot's mom and JP, and when I met Bridget NE Walsh's childhood friend at Holy Name, she did not hesitate to pull out the photos of them growing up together in South Boston.'",
        "'speaker_4': 'They couldn't wait to fill in that bubble next to their loved ones games. My own father. Stood outside Doris Bunting Apartments in Eggleston Square from seven in the morning to seven in the evening every election day. Sorry. He canvased his entire building.'",
        "'speaker_4': 'Stringing together the few English words that he knew. And handed out literature to anybody who would take it. Convincing them. Thank you. Think. Convincing them to cast their vote for his daughter. And yet. Despite all his hard work.'",
        "'speaker_4': 'His pride in seeing my name in yard signs all across the district. He never had the chance to see my name on the ballot. My father, a 30 year resident of the city, could not vote for his youngest daughter.'",
        "'speaker_4': 'In the US. We believe in a government of the people, by the people and for the people. But instead of bringing us closer to a more complete, more representative democracy, we the People has been narrowly defined, used to further the ruling class interests and deny civil rights to historically marginalized communities.'",
        "'speaker_4': 'In Boston alone, 40,000 immigrants are disenfranchized by our current voting laws. Unfortunately, exclusion from the proverbial weed isn't unique to immigrant communities. We don't give young people a voice in choosing their representatives. People who are incarcerated are stripped of their access to the ballot, and our unwillingness to implement common sense policies like same day registration deter our'",
        "'speaker_4': 'constituents from participating in the electoral process. If we want to create a truly representative municipal government, we must commit to expanding the electorate, deepening our definition of democracy, and ultimately bringing those in the margins to the center. Every place that we see our neighbors excluded from power offer us a unique opportunity to address barriers and to build'",
        "'speaker_4': 'a stronger social democracy. Of course, we can start by expanding the electorate, lowering the voting age, enfranchising immigrants and putting a ballot box in every jail. But ultimately, the democratic process doesn't and shouldn't end after a vote is cast.'",
        "'speaker_4': 'We the people, all the people should have the power. Not just to elect our representatives, but to fully participate in every decision, discussion and deliberation that impacts our daily lives. Excuse me. We, the people can rearrange our values and put people over profit.'",
        "'speaker_4': 'Protect workers, democratize workplaces, and guarantee sustainable livelihoods so that our families can thrive. We the people. Can eliminate the threat of displacement, expand community controlled land trust, build more social housing and support tenant unions. We the people. Consent for indigenous sovereignty and implement environmental protections that keep borders most vulnerable communities resilient in the face of climate change'",
        "'speaker_4': '. We? The people. Can move to restore municipal voting rights for immigrants and get one step closer to our vision of a transformative social democracy, one where the democratic process starts at the ballot but expands beyond the walls of local government into every workplace, home and school.'",
        "'speaker_4': 'So that the working class people who make our country, our state and our city what it is today have the power to collectively self-determine their future. Because democracy does not come from the top. It comes from the bottom.'",
        "'speaker_4': 'It doesn't reverberate out from the center, but instead it echoes inwards from the farthest of the margins. Thank you.'",
        "'speaker_0': 'Thank you. Thank you, Counsel Lawrence. Excellent. Excellent speech. Maiden speech with. Very inspired by those words. Would anyone else like to add their name to docket 03234 to speak on the matter? But I wouldn't like to speak on the matter, I should say first.'",
        "'speaker_0': 'The Council recognizes District City Council. Ricardo Arroyo. You have the floor.'",
        "'speaker_1': 'Thank you, President Flynn. I just want to commend Councilor Lira on a beautiful maiden speech and for making the very first thing that you do on the council. Move to enfranchise more members and residents of our communities and to have more voices that are often unheard brought into this space and into this chamber.'",
        "'speaker_1': 'So I deeply appreciate that. I also want to say that this is great that you are moving forward on this. This is something that we've seen in different iterations. I know my father presented this in 2000, I think it was six or seven, and we got very close.'",
        "'speaker_1': 'It failed 7726, six. It was very close. And then Councilor Campbell also brought this forward as something to explore. And I think we've seen this now in many, many cities, most recently in New York. And I think it's important to note for folks who often say, you know, become a citizen.'",
        "'speaker_1': 'This is the entire incentive. Many residents, many legal residents have been trying to become citizens for decades. The process in this country is essentially broken. It's something that is not a surprise to many in terms of a conversation.'",
        "'speaker_1': 'That's not something that is a shocking statement to say that our process for legalization and for citizenship is a broken process. Many people have debated the system on this for decades, but frankly, you can have people who are in that process for 20, 30 years on, and those are folks that are paying taxes.'",
        "'speaker_1': 'Those are folks who are sending their kids to our schools. Those are folks who are participating in all the other ways in which our communities impact their lives and deserve a voice in how and when those decisions are made.'",
        "'speaker_1': 'And so I look forward to this hearing. I commend you for having the courage and the foresight to to put this on the floor. And I look forward to attending and participating in this hearing whenever it is set.'",
        "'speaker_1': 'So thank you. President Clinton. Thank you, Counselor Laura. And please add my name.'",
        "'speaker_0': 'Thank you. Counsel Arroyo. The Chair recognizes District City Council. Kenzie Bar Council. BLOCK You have the floor.'",
        "'speaker_2': 'Thank you so much, Mr. President. I also want to thank Counselor Laura for such a wonderful maiden speech and to ask you to add my name, Mr. President, and just say that it has my thoughtful and strong support.'",
        "'speaker_2': 'I think I, as some folks know, lives abroad for a few years in the UK, which was at the time part of the European Union. And one of the things that I think is interesting over in Europe is there's a there's a norm in most European countries.'",
        "'speaker_2': 'If you're living in a country that's different from your own citizenship, you can't vote at the national level for the president, but you can vote in your city. And the reason is because there's a recognition like Councilor Laura saying that like I mean, democracy, we the people, it's got to be the people to the left and the'",
        "'speaker_2': 'right of us around in our city. The people who are doing the work, living their lives, going like, you know, are just part of the fabric. And I think that this is a this is a great thing for this council to take up.'",
        "'speaker_2': 'I think I wouldn't be surprised. I think this council might be the first majority, either immigrant or child of immigrant council, maybe for 100 years, going back to the initial Irish immigration. And I just think I think it is a very worthy topic for us to take up.'",
        "'speaker_2': 'So I'm grateful to Councilor Laura and please add my name.'",
        "'speaker_0': 'Thank you, Counselor Buck. Would anyone else like to speak on this matter?'",
        "'speaker_4': 'Okay. Thank you, President Flynn. Also, congratulations, Cancellara on a great maiden speech. My parents had their own immigration citizenship journey here and fortunately our citizens. But so many of my aunties were similarly at polls on election day, telling people into English they could muster to vote and they should have also been given that opportunity.'",
        "'speaker_4': 'There are other cities where this is happening. And so as the chair of Civil Rights and Immigrant Advancement, I'm very excited for this hearing and to push this through, through so that we can have a more inclusive democracy and so we can really center the voices of our immigrants here in our city.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you. Console And anyone else like to speak on this matter. Counsel Fernandez Anderson, you have the floor.'",
        "'speaker_4': 'For the record, this is not my maiden speech. I just wanted to thank you, Councilor, for your courage and for articulate lady that so, ah, so eloquently. I myself. I became a citizen in 2019. I lived in this country for almost 20 years, undocumented.'",
        "'speaker_4': 'I came when I was ten. I ran a campaign and I wasn't a citizen and also then ran for office in 2000, voted for the very first time in 2020, and then ran for office in 2021. And today, here I am, a district city councilor.'",
        "'speaker_4': 'So I deeply understand this issue and have dedicated myself for 33 years to a country, to a society, to a city that I could not vote in. I look forward to the discussion, and I thank you again and I applaud you for your courage, because it does take more than insight.'",
        "'speaker_2': 'Connection and relativity.'",
        "'speaker_4': 'To be able to understand this issue. But it takes courage for.'",
        "'speaker_2': 'You to actually be at the forefront to lead this. Thank you and great job when.'",
        "'speaker_4': 'You made the speech.'",
        "'speaker_0': 'Thank you. Councilor Fernandez Anderson, the chair recognizes council and council. Great. And you have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I also want to thank Councilor Laura for an amazing maiden speech. Very, very important issue that you're raising. And I look forward to the conversation when we have the hearing. I also am an immigrant.'",
        "'speaker_4': 'I came in 95. I became a citizen in 2008. It's not an easy task to become a citizen. There's many hurdles. But for so many of our immigrants and in Boston and across our country, that doesn't stop them being civically engaged, participating in all sorts of ways in a democratic process.'",
        "'speaker_4': 'But they're not allowed to participate by voting. So I cut my teeth and working on campaigns for many, many years. And like your father, you know, talked, advocated was out there, but wasn't able to vote myself. But I really feel so much of our municipal government is involved with the daily lives of every Bostonian.'",
        "'speaker_4': 'Whether you come from another country or whether you are born and bred and lived here all your life, and those issues touch every aspect of our lives. So it's really important that that the residents of Boston are given more tools and more opportunity to participate in our civic process.'",
        "'speaker_4': 'And I really look forward to this conversation about enfranchising more residents of Boston who are immigrants and look forward to bringing back those voices into the space. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Braden. Anyone else like to speak on this? Anyone else who got their name, please add. Counsel Edwards Please add counsel Fernandez Andersen Please had counsel Rajan please. Ad Counselor We're all pleased. Counsel Murphy. Please add the chair.'",
        "'speaker_0': 'And I also wanted to briefly highlight myself and Counselor Edwards always spoke about the veterans community and many of the veterans that are overseas serving overseas are immigrants themselves. Many of them can't vote, but here they are serving our country in very difficult environments, hazardous environments willing to put their life on the line, die for our country'",
        "'speaker_0': ', and I have the right to vote. So I just want to acknowledge the important hearing that you're bringing forward. Counsel, Laura, and you did an outstanding job with your maiden speech. Docket 030293 will be referred to the Committee on Civil Rights and Immigration Events on.'"
    ],
    "Hearing on Civil Rights and Re-Entry of Returning Citizens.": [
        "'speaker_0': '0323. Committee on Civil Rights, Immigration and Immigration Advancement. Docket 0324. Mr. Clarke, please read 03240324.'",
        "'speaker_1': 'Council Illusion offered the following order for a hearing on the civil rights and liberties of returning citizens and reentry into their Boston communities.'",
        "'speaker_0': 'They did she recognizes counsel counsel Luann and and on docket 0324.'",
        "'speaker_4': 'Thank you very much, Mr. President. I offer this order, hearing orders that we can really evaluate and see what we can do more to support our returning citizens. Many of us participated in various forms of the budget listening tour that the mayor held, and we heard again and again the ones that I attended from returning citizens themselves'",
        "'speaker_4': 'about the lack of resources and lack of. And what we have we now have an office of returning citizens. What we can do to further buttress that office, to support the more than 3000 people a year returning to the city of Boston from prisons and jails who are in need of permanent housing or in need of employment'",
        "'speaker_4': 'or in need of driver's licenses. The very basics. And sometimes we need more than just referrals. We need people who are actually able to do case management and, you know, help people interact with them through the process. And we know that this is an issue that disproportionately affects our black and Latinx residents who are overrepresented and disproportionately'",
        "'speaker_4': 'represented in our criminal legal system. And we know that there are particular burdens, burdens that are that returning citizens face when it comes to placement in public housing because of because the very stringent rules around who can reside in public housing.'",
        "'speaker_4': 'And we also know that the prison system has long housed and held a significant portion of folks out front for mental health issues. So this is really when we're talking about folks returning our returning citizens, we're talking about connecting them to the mental health resources that they should have gotten in the first place.'",
        "'speaker_4': 'I had clients as a housing attorney who were I had to go visit in jail when they really should have been receiving services from a psychiatrist and got caught up in a very, very punitive system. So this is a hearing order to bring together voices in this space, a lot of them being led by returning citizens to'",
        "'speaker_4': 'really put our money and focus on really helping people to become whole. We too often are focused on individual decision making by a by an individual and not systemic problems and not bad policies that lead to people making sometimes decisions that are that lead them to this to places of incarceration.'",
        "'speaker_4': 'So this hearing order, I hope to discuss these issues and bring our office of returning citizens together with a lot of folks just for housing has been very active in this space and a number of returning citizens are hoping that we can get this out as part of the discussion to also talk about it as part of'",
        "'speaker_4': 'the budget. Thank you.'",
        "'speaker_0': 'Thank you. Counsel. Which and would anyone else start? Sorry. I'd also.'",
        "'speaker_4': 'Like to add Councilor Ryan.'",
        "'speaker_2': 'We're out to this to this here in order.'",
        "'speaker_4': 'Thank you. Sorry.'",
        "'speaker_0': 'Council of Wirral has added Council. Where would you like to speak on this matter? The Chair recognizes counsel role. Thank you.'",
        "'speaker_1': 'Chair, and thank you, counsel Louis.'",
        "'speaker_0': 'Jahn for bringing this quorum.'",
        "'speaker_1': 'Issue to the floor. And with the shadows, mass incarceration.'",
        "'speaker_0': 'Has cast upon too many of our communities.'",
        "'speaker_1': 'Especially.'",
        "'speaker_0': 'Black and brown neighborhoods.'",
        "'speaker_1': 'In our city. We need to ensure that those who have served their time.'",
        "'speaker_0': 'Can return to their communities with the opportunities, services and support they need to reintegrate successfully. Too often, residents end up in our correctional facilities because our city has failed to deliver them. The Education Economic Opportunity. As Counsel Louise Diane said also said mental health.'",
        "'speaker_1': 'Services and stable housing.'",
        "'speaker_0': 'They need it and to which they are entitled to. These systemic failures are exactly why we need to assess.'",
        "'speaker_1': 'How we can ensure every returning citizen has a.'",
        "'speaker_0': 'Civil rights restored and that our reentry efforts adequately address the root causes of criminal criminalization incarceration. I'm proud to support this here in order to better support our return to citizens and in assess how we interrupt these cycles.'",
        "'speaker_0': 'Thank you. Thank you, Counsel. Earl. But anyone else like to speak on this matter? The Chair recognizes counsel of our counsel. Why? You of the fourth.'",
        "'speaker_4': 'Thank you, President Flynn. Well, that feels nice. Thank you, Counselor Eugene and Counselor Morel for bringing this hearing order onto the floor. In a previous life, I served as a street worker and a direct violence intervention worker here in the city of Boston, first in Mattapan and then in lower Roxbury and in the South End.'",
        "'speaker_4': 'A large part of the work that I did was to support young people and young men and women who are not only systems involved, but who are currently and previously incarcerated. And so this is an issue that's very near and dear to my heart.'",
        "'speaker_4': 'I think when we're having conversations, particularly around the civil liberties of people who are currently or formerly incarcerated, we need to expand what civil liberties are afforded to them before they become systems involved and also after they come home and want to expand the way that we think about reentry, not only with a problem, with a problem'",
        "'speaker_4': 'free solution frame, which calls on whether they have education, have a house and so on and so forth. But to think about the emotional well-being and how they are reintegrated into their community and into the civil process, whether it be through community organizing, voting and so on and so forth.'",
        "'speaker_4': 'So I'm really looking forward to this hearing. I'm looking forward to hearing from folks who are currently or previously incarcerated on what the levels of support they need from the city of Boston. And I would also urge us to look beyond the supports that come from city government and look directly to communities to offer the support to'",
        "'speaker_4': 'these folks. So thank you.'",
        "'speaker_0': 'Thank you. Thank you. Counsel. Laura. The chair recognizes Counselor Arroyo. Counsel Royall, you have the floor.'",
        "'speaker_1': 'Thank you. President Flynn. And thank you, Counselor Louis Gen and Counsel Ralph for offering this. Over 90% of our incarcerated population returns back to our communities. That's that's the number. And so often what they need and what led them into the to be system involved in the first place is stabilization and resources.'",
        "'speaker_1': 'And often when they are entering or exiting, they are not receiving those resources. And that's actually a detriment to our public safety, a detriment to them, a detriment to their families. And if we are serious about ending cycles of trauma, ending cycles of of harm, we're going to have to be serious about providing resources and dedicating resources'",
        "'speaker_1': 'to folks. I know this deals specifically as well with some of their civil liberties in the actions we take there. But I also know that it has to deal with and does mention the things that we have to do to make sure that we take care of them from a resource standpoint.'",
        "'speaker_1': 'And so this is incredibly important work. This has a direct impact on so many people's lives and family's lives and a direct impact on ending cycles of harm and trauma. And so please add my name. Thank you for your leadership on on presenting this.'",
        "'speaker_1': 'And I look forward to hearing not just what comes out of this hearing, but what we do from the from that hearing on. So thank you all.'",
        "'speaker_0': 'The the chair recognizes the council region. Okay. Anyone else like to speak on this matter? The chair recognizes Councilor Baker. I just want to say. Okay, please. That council. Baker's name, please. That council box name. Buxton, Councilor Brading Council.'",
        "'speaker_0': 'Royal Council. Edwards. Councilor Fernandez Anderson. Councilor Clarity. Councilor Laura murphy. And please add the chair. I also wanted to highlight that myself and Council have already had several hearings in the past on quarry reform, which is also a critical part of this as well.'",
        "'speaker_0': 'Governor Patrick did an outstanding job working with the legislature in making reforms to quarry, but we need to go even further than that. As a as a former probation officer, there's nothing more frustrating for someone coming out of jail or coming out of prison to have that quarry hang over their head for their entire life, not being'",
        "'speaker_0': 'able to get a job or get into housing. But just want to say thank you to my councilors, fellow colleagues, for the incredible work that they've done on this work, on this issue. Docket 0293. Okay. 0.20234 will be referred to the Committee on Civil Rights Immigrant Advancement.'",
        "'speaker_0': '3240324. Mr. Clarke. Please read docket 0325.'"
    ],
    "Committee Meeting on Quasi-Public and Semi-Independent Entities.": [
        "'speaker_1': 'Docket number 0325. Councilor Braden and Councilor Flynn offered the floor for the following order for a committee meeting to discuss the organization of plays a public and semi-independent entities related to the city of Boston. Thank you, Mr. Clarke.'",
        "'speaker_1': 'The Chair recognizes Councilor Braden. Councilor Braden, you have the floor.'",
        "'speaker_4': 'Thank you, Mr. Chair. I want to thank President Flynn for joining me as an original co-sponsor on this order for the appropriate committee. Council committee to hold a hearing. Now hold a meeting, actually, not a hearing to discuss quasi public and semi-independent entities and agencies related to our city government.'",
        "'speaker_4': 'I signed this order with the intent, with the intention, along the amount, along the same sentiment of the hearing order. I filed last council meeting with Councilors Bach and Constitution to review our Organization of City Government, City Charter and Code of Ordinances.'",
        "'speaker_4': 'Knowing that our city is in a turning point for a new with a new mayoral administration and being a city council with two thirds of new members serving for their first or second term, I believe a general overview to understand the basic structure of the quayside public and semi-independent agencies of our city would greatly benefit our collective'",
        "'speaker_4': 'institutional knowledge of city government and help demystify many misconceptions. As a first term city councilor, two years ago, my office had to learn the ins and outs of how to discern the functions, responsibilities, budgets and authorities of these entities which operate separate separate from our city government and city hall.'",
        "'speaker_4': 'These and these entities include the Boston Housing Authority, the Boston Public Health Commission, the Boston Redevelopment Authority, BRE and the Environment and the Economic Development Industrial Competition. Also, all of those two entities doing business as the Boston Planning and Development Agency, the Boston Water and Sewer Commission, the Boston Finance Commission, and the trustees of the Boston Public'",
        "'speaker_4': 'Library, all of which have their enabling legislation as state statute, varying financial relationships with the city, with their governing boards appointed by the mayor, and some of which we confirm not all as a legislative body of the city government, which has the right to consider legislation affecting these bodies and their public facing operations.'",
        "'speaker_4': 'It is our duty to have a baseline understanding of the structure, function, history and enabling legislation. I drafted this order as a committee meeting rather than as a hearing, so that we may focus on setting a strong foundation among Councilors of Knowledge on the organization of these entities and prioritize dialogs for the administration to ask background background'",
        "'speaker_4': 'questions, counselors to answer background questions that councilors may have. We've talked about in the past few months, we talked about the Boston Water and Sewer Commission and their the diversity of their workforce. We're talking about Boston Health Public Health Commission.'",
        "'speaker_4': 'I think this is a timely opportunity just to get a better understanding of how these what these quayside public and semi-independent entities are and how they function and how they relate to our roles as city councilors. Thank you.'",
        "'speaker_1': 'Thank you, Councilor Braden. The chair recognizes the second original sponsor, Councilor Council President Flynn.'",
        "'speaker_0': 'Thank you, counsel of Royal. Thank you. Council operated for including me on this on this hearing order. And I know it'll be very helpful to me, but also be very helpful to all of our colleagues because those quasi agencies play a critical role in a lot of quality of life issues in the city of Boston, whether it's'",
        "'speaker_0': 'the water and sewer, the the critical role the public library system plays in Boston, certainly the BPA, Boston Housing Authority. It will be informative for all of us, including our new colleagues. But that's what makes us a better body, is learning from each other and learning from other city or quasi agency departments and making sure that we'",
        "'speaker_0': 'can provide the best services and quality of life to residents. Thank you, Councilor.'",
        "'speaker_1': 'Thank you, President Flint. But anyone else like to speak on the matter? Seeing no hands. Would anyone else like to add their name? Mr. Clarke, please add Councilor Baker, please add Councilor Bach. Please add Councilor Tanya Fernandez Anderson, please.'",
        "'speaker_1': 'That Councilor clarity please. And Councilor Laura, please add Councilor Lui Jan please and Councilor Murphy and please add Councilor Allen, please add my name at docket 0325 will be assigned to the committee on the whole. Mr. Clarke, would you read docket number 3 to 6?'"
    ],
    "Resolution on Russian Invasion of Ukraine.": [
        "'speaker_1': 'Doug in number 0326 Councilor Braden and Councilor by calling for the following a resolution condemning the unprovoked invasion and egregious act of aggression against Ukraine by the Russian Federation. Thank you, Mr. Clarke. The Chair recognizes Councilor Braden. Councilor Braden, the floor is yours.'",
        "'speaker_4': 'President Flynn as an original co-sponsor.'",
        "'speaker_1': 'Seeing and hearing no objections. Councilor Flynn It is added as the third original co-sponsor. Councilor Braden You have the floor.'",
        "'speaker_4': 'Just as how the Council has adopted resolutions in the past condemning war and imperialism across the globe. I offer this resolution today to condemn Russia's egregious invasion of Ukraine. Let's call it what it is. It's a war when you're firing cruise missiles into populations, civilian populations.'",
        "'speaker_4': 'It's a war, as we have seen in the news early Thursday morning, February 24th. The president of the Russian Federation, Vladimir Putin, launched a full scale invasion of sovereign Ukraine. The number of dead and injured, both military and civilian, is undetermined and growing.'",
        "'speaker_4': 'But the cost of this act of aggression will be lives, livelihoods, homes and cities. And the impact will reverberate beyond Ukraine and Eastern Europe, and it will reverberate in this country as well. To date, it looks like 800,000 Ukrainians have already been forced to seek refuge in neighboring countries and up to 4 million Ukrainians are expected to'",
        "'speaker_4': 'be displaced in this act of war. We must also condemn the threat of nuclear aggregation that was that has precariously mounted since the 2014 annexation of Crimea just less than three months ago. I introduced a resolution that was adopted by the council renouncing nuclear weapons proliferation and urging the United States to pull back from the brink and'",
        "'speaker_4': 'prevent nuclear war. In this situation in Ukraine, we are not one step closer to an on and on anticipated and unexpected escalation into a nuclear conflict. We must affirm our unwavering support for Ukraine's independence, sovereignty, self-governance and territorial integrity by calling for the immediate cessation of violence and illegal Russian invasion of Ukraine, which is lacked regard for'",
        "'speaker_4': 'citizens lives. And commend the courage, resolve and resilience shown by the Ukrainian people, both in Ukraine and overseas here in Boston and in here in Boston, in their pursuit of sovereignty and democracy. On the humanitarian front, we must ensure all citizens have safe passage to escape into and that including black Ukrainians, have been held back from fleeing'",
        "'speaker_4': 'and seeking asylum. We must also increase aid efforts to for refugee resettlement both nationally and locally for those who are displaced, both as a result of the war in Ukraine as as as well as those who have been and will continue to seek asylum.'",
        "'speaker_4': 'Before and after Ukraine. What we're seeing in the turn on the television in this moment in the 21st century. It's such a sad and tragic situation that we do not have better mechanisms to solve and promote international cooperation and peace.'",
        "'speaker_4': 'And I do urge you to my colleagues to support this resolution. Thank you.'",
        "'speaker_1': 'Thank you. Councilor Braden, Councilor Bach, you have the floor.'",
        "'speaker_2': 'Thank you so much, Mr. Chair. Today for Catholics and civilians like myself, it's Ash Wednesday. And Ash Wednesday is a day of reflecting on our mortality and fragility and the extent to which we all ultimately depend on God and one another.'",
        "'speaker_2': 'And I think that when we see a situation like the situation in Ukraine and that there are a million conversations about what are the foreign policy options about the looming terror as counselor and great instead of nuclear war.'",
        "'speaker_2': 'But I think that the first thing that we can do and that we must do, and that to its credit, I think the world has largely done in this moment, is is to lift up our prayers. And that was why it was so good to be joined by Father Roman at the beginning of this meeting and to'",
        "'speaker_2': 'stand in solidarity with one another. And I think that this resolution is a way for this council, the city council of the city of Boston and the United States far away from Ukraine and yet home to a Ukrainian American community here, as we heard this morning and as we are home, as we've been discussing to so many'",
        "'speaker_2': 'communities of immigrants that still feel that that tether and tie to moratorium homes. And I think that what we can do here in the council today is to is to say that we stand with the Ukrainian people and to express, as the resolution expresses, not not only condemnation and then standing with, but also recognizing that Boston should'",
        "'speaker_2': 'be a home and a welcoming place for refugees and migrants from all countries. Just as we joined in supporting the resolution on against Title 42 a few weeks ago. And I think that that, you know, no one city anywhere in the world right now can be all of what the Ukrainian people need.'",
        "'speaker_2': 'The Ukrainian people are reaching within themselves of their own resources. And yet the.'",
        "'speaker_4': 'World we have.'",
        "'speaker_2': 'Has to figure out all the things that we can do. And and and. And just recognize together that when we many decades ago made the fateful decision as a as a humanity to move towards nuclear weapons and towards a destructive foreign force that quite literally ties all of our fates up together, that that also obligates us to'",
        "'speaker_2': 'think in universal terms about solidarity and moments like this. So I do hope that the council will join us in passing this resolution today. Thank you so much, Mr. Chair.'",
        "'speaker_1': 'Thank you. Councilor, back at the path, I would like now to recognize. Council President Flynn. Council President Flynn, the floor is yours.'",
        "'speaker_0': 'Okay. Thank you, counsel Counsel Arroyo. And just wanted to highlight the some of the Ukrainian flag raising ceremony, as we've had with counsel, clarity and counsel of counsel Baker and Councilor O'Malley. That was that was here before with attorney Nick Zazula, who was one of the leaders there in the community, and Professor Peter Walsh and Chuck.'",
        "'speaker_0': 'But it was a great, great to see the Ukrainian Ukrainian community join these flag raising ceremony. But what we also learned from the community is their love of country and their love, love of democracy. And as as counselor great and Counselor Bach discussed on this, the Ash Wednesday, we prayed for for peace and an end to the'",
        "'speaker_0': 'senseless war and suffering across across Europe and across Ukraine. And we continue to stand with the Ukrainian people during this very difficult time. The U.S. has always stood with people in need, and that's something we're proud of and we're going to continue to do.'",
        "'speaker_0': 'Thank you. COUNSEL Well, thank you.'",
        "'speaker_1': 'President Flynn. The chair now recognizes Counselor Clarity.'",
        "'speaker_3': 'Thank you, Mr. Chair. Raised to support Ukraine. Please add my name to this resolution and through the chair to the makers if they would consider a sixth resolve in that calling upon the Biden administration to stop buying oil from Russia, it's been reported that we may be buying somewhere, let's say, of 600,000 barrels a day.'",
        "'speaker_3': 'The fact that we're participating in their economy is unconscionable. Not to mention we're getting price gouged through the chair to the makers if they would consider a six resolve calling upon the Biden administration to stop buying oil from Russia.'",
        "'speaker_1': 'Thank you, counsel. Clarity. I'm going to turn it over to counselor back. Counsel, but the floor is yours. Or Councilor? Sorry. Not concerned about Councilor Brady.'",
        "'speaker_4': 'I thank my colleague for his an amendment to a resolution. I'd be happy to hear that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'So I also had another two comments. In Alston Brighton we have a large immigrant population of elderly, retired, Russian and Ukrainian folks. Many of them fought in World War Two to defeat fascism and Nazis. And I really want to stress this moment that Russian folks living in the city of Boston are not our enemy.'",
        "'speaker_4': 'Many of them fled oppression and persecution in the former Soviet Union, and they sought shelter and they were refugees here, along with their Ukrainian neighbors. So I want to stress that while we condemn the actions of President Putin and the Russian Federation in this moment, that we embrace and support our Russian and Ukrainian neighbors in our in'",
        "'speaker_4': 'our neighborhood, in our district and in our cities.'",
        "'speaker_1': 'Thank you, Counselor Brady. And before I just go to the opens. It sounds like that's a yes for adding the six resolves that counselor clarity suggested that is there that so I'm saying that it heads from all of the original co-sponsors.'",
        "'speaker_1': 'I'm not going to go to Counselor Baker. The floor is yours. Thank you, Mr. Chair. And thank you for my colleagues for bringing this bringing this to be a very, very important issue that we stand with the Ukrainian people in my quest to educate myself on things other than Boston.'",
        "'speaker_1': 'I started listening to political podcasts, and I came across a woman, Anne Applebaum, who broke down the Ukrainian new Ukrainian Russian issue that's happening, and in what she had described it as, is very similar to what the English had done to to the Irish.'",
        "'speaker_1': 'They they wanted them to be English subjects and the Irish wouldn't have it. They they went so far as to to even stab the Irish people going back to the 1830s, which is why the despair happened in Ireland and why you have Irish people all over the entire world as early as night, as late as 1930.'",
        "'speaker_1': 'Now, this this. This policy goes back to Czar Nicholas and was also enacted by Joseph Stalin. So in the thirties and they called it the Harlem. They went door to door in the Ukraine, taking their food to starve them out the exact same way that they did to the Irish people.'",
        "'speaker_1': 'So this is the type of longstanding political battle that's going on. And let's not forget that, that when Hitler came in, Hitler came into Poland first. Ukraine's right next to that. So this is scary, scary time. And I'm thrilled that you guys put this on the floor here today, and I'm glad to add my name.'",
        "'speaker_1': 'Thank you. Thank you. Councilor Baker, Councilor Louis. Jan, the floor is yours.'",
        "'speaker_4': 'Thank you, Counselor Arroyo. And thank you for to the sponsors for introducing this. So many of us right now are, you know, standing in solidarity with what's happening with Ukrainians who did not ask for this war and with many Russians through also did not ask for this war.'",
        "'speaker_4': 'Just want to make sure that we are also highlighting the plight of migrants of all of all of all colors who find themselves in Ukraine, even in times of war, xenophobia and anti-blackness reared its ugly head. And it is, you know, someone who is, you know, wants to be or is upset by the fact of war, by'",
        "'speaker_4': 'the act of war. It is it hurts w more when you see migrants, when you see folks of Arab descent, when you see black folks being denied entry into other countries as they to seek refuge. So as we address the issues here of war, of imperialism, of let's also not forget that migrants in countries, whether in the'",
        "'speaker_4': 'United States or in the Ukraine, also deserve safety and to be free from harm and persecution and war as well. So thank you.'",
        "'speaker_1': 'Thank you. Councilor Lui. Jen, Councilor Edwards, the floor is yours.'",
        "'speaker_4': 'Thank you very much. I echo the comments of my colleagues as well, especially the comments from Councilor Braden, noting that the Russian people are not our enemy. I had the honor of getting to know and befriend a Katya who lives in Russia right now.'",
        "'speaker_4': 'And it was just somewhat surreal that I watched what's actor and said, How are you and what's going on? And for her to respond and say, None of us want this. We don't want this. This is not us.'",
        "'speaker_4': 'And I really want a lot of us to. My my neighbors, my friends to understand that the the Russian people are equally not are not behind this. This is the result of a madman, a dictator, and someone who honestly probably wasn't even legally elected to lead his country.'",
        "'speaker_4': 'So even his his authorities, I believe in question. I also want to shift not so much to shift the focus, but also added to this conversation. There's something Special Counsel Flynn and I both share, and that is our military connection.'",
        "'speaker_4': 'And I want you to know that when talks of war happen, there's a special kind of feeling you get in your gut. My mother served in the band the Air Force, and I grew up on military bases. And during Iraq one, everyone feels that part of that unique community, especially when you're the child of someone who could'",
        "'speaker_4': 'be deployed. And so we had therapy. We had people dealing with those of us who are going to school every day and knowing our parents going to work was going to Iraq and going to deal with and possibly not come home.'",
        "'speaker_4': 'So this is this is a message also to those who are serving in the military, those who are serving, of course, already in the military and Ukraine, but also to those who are coming and volunteering in different countries around the world, and especially ours, and to those who have been retired.'",
        "'speaker_4': 'I know you feel it as well. You feel the sense of it's it might be time, it might be coming up. It might be one of us. And I just want you to know, you, of course, have all my solidarity, my sense and and my patriotism.'",
        "'speaker_4': 'And I wanted to express that and thank those who've already answered that call and ultimately had the ultimate sacrifice for this country. But, you know, being a kid of the 19, 1980s, a good chunk of my childhood was during the Cold War on a military base.'",
        "'speaker_4': 'This is eerily familiar feeling. It's eerily familiar about Russia. It's eerily familiar from feeling. And so I want to acknowledge that feeling. And there are a lot of us who are feeling it. So thank you.'",
        "'speaker_1': 'Thank you, Counselor Edwards. Would anyone else like to speak on this matter? Seeing. No. No hands. Would anyone else like to add their up? If I can.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'Com's President Flynn for.'",
        "'speaker_0': 'Thank you, Counselor Arroyo. I'll be very brief. Just want to. Wanted to respond to my good friend and colleague, Councilor Edwards. Um, we spent a lot of time over the last four years talking about military families, and you added so much to the discussion.'",
        "'speaker_0': 'I also want to recognize our other colleague, Tanya Fernandez. Anderson is also a military family. And we also know the the sacrifices of Tanya and and her family as well during this difficult time in our in our country.'",
        "'speaker_0': 'So I just wanted to acknowledge my acknowledge our colleague as well. Thank you. Thank you, Mr. Chair.'",
        "'speaker_1': 'Thank you. Council President Flynn. Would anyone else like to add their name? Please add Councilor Edwards. Mr. Clarke, please add Councilor Fernandez Anderson Please add Councilor Lara, please add Councilor Lui. Jan, please add Councilor Murphy, please add Councilor Allen, please add the chair at this time to turn it back to Council.'",
        "'speaker_1': 'President Flynn But I do believe that there's a motion on the floor from Councilor Clarity, that is, to adopt new language that that is being brought out. And then I think it will be a vote on that amendment and then a vote to suspend and pass it today.'",
        "'speaker_1': 'So. Council President Flynn. Should I stay here? Yeah, I'll take care. I don't know if that I know that the. Mr. Clarke, do we already have the copy of. I see. Counsel Clarity has his counterpart.'",
        "'speaker_3': 'Thank you, Mr. Chair. The language is being just drafted to for the friendly amendment, and it just requires a second and a quick vote of the council. Maybe just a quick, brief recess. Another in your lady's office taking that's.'",
        "'speaker_1': 'We'll take a brief recess until we have the. Until we have that in front of you. We are back in session. Thank you.'",
        "'speaker_5': 'Okay. Yes. Yes.'",
        "'speaker_1': 'I now recognize Councilor Fire to.'",
        "'speaker_3': 'Take a message through the charity to the Makers. A friendly amendment to add a sixth resolve. Calls on the Biden administration to stop buying oil from Russia. Requires a second and a vote and we can move forward.'",
        "'speaker_1': 'Thank you. So seconded. Now, Mr. Clarke, if you can do a roll call vote on the motion to amend the roll call. Vote on a motion to amend. Councilor Royal. Yes. Councilor Roy. Yes. Counsel Baker was voting on the motion to implement.'",
        "'speaker_1': 'Yes. Councilor Baker. Yes. Councilor Bark. Councilor Kiss. Councilor Braden. Councilor Braden. Yes. Councilor Edwards. Councilor Edwards. Yes. Councilor Fernandes. Sanderson. That's different than the standards. And yes, council clarity has clarity as. Councilor Flynn. Yes. Councilor Flynn. Yes. Council The Council.'",
        "'speaker_1': 'Our Council. Our Yes. Council. The Regional Council. Regional Council. The Here Council. Murphy. Yes, that's. Murphy. Yes, and Council World. Thank you, Mr. Clarke. The resolution will be so amended. Now we are seeking a vote, a suspension of the rules and passage of this docket as amended.'",
        "'speaker_1': 'Number 3 to 6. All those in favor say I all oppose. I say nay at the ayes have the ayes have it. Docket 3 to 6 is passed.'",
        "'speaker_0': 'Thank you, counsel rail. We're going into personnel orders. Mr. Clark, please read docket.'"
    ]
}