{
    "Grant from the US Department of Treasury for COVID-19 Response and Recovery.": [
        "'speaker_1': 'Lucky number 0503 message. In order authorizing the city of Boston to accept and expand the amount of $349,500,000 in the form of a grant awarded by the United States Department of Treasury to be administered by the City of Boston.'",
        "'speaker_1': 'Chief Financial Officer. Collector. Treasurer. This grant payment is made from the coronavirus state and local fiscal recovery from fund sl f r f in the Treasury of the United States, established by Section 9901 of the American Rescue Plan Act of 2021 a.'",
        "'speaker_1': 'R. P. Pursuant to the requirements of the ERP, the grant payment would fund COVID 19 response and recovery efforts and accelerate a Green New Deal for Boston through a once in a generation transformative investments that address the systemic health and economic challenges in the areas of affordable housing, economic opportunity and inclusion.'",
        "'speaker_1': 'Behavioral health, climate and mobility. Arts and culture and early childhood. 0504 Message. In order authorizing the City of Boston to accept and expand the amount of $40 million in the form of a grant awarded by the United States Department of the Treasury to be administered by the City of Boston as Chief Financial Officer.'"
    ],
    "Hearing on Boston's Nonprofit Social Sector and Post-Pandemic Recovery.": [
        "'speaker_1': 'Pursuant to the requirements of the RPA, the grant payment would fund provisions of government services to the extent of the reduction in revenue of such state territory tribal government due to the COVID 19 Public Health Emergency relative to revenues collected in the most recent full fiscal year of the state territorial tribal government prior to the emergency and'",
        "'speaker_1': 'docket numbers. 0436. Order for a hearing on the state of Boston's non governmental nonprofit social sector and chart charting a post-pandemic recovery.'",
        "'speaker_0': 'Thank you, Mr. Craft. The chair recognizes counsel, a chair of the Committee on Boston's COVID 19 Recovery Council. You have the floor.'",
        "'speaker_5': 'So much, Mr. Chairman, and thank you to all the councilors who came to our hearing yesterday afternoon, including Councilor Flynn, Reid and Baker, Murphy, Flaherty, Fernandes, Henderson were all here, and it was a good first introduction to the administration's proposal on the American Rescue Plan funds 350 million.'",
        "'speaker_5': 'So Casey Brock Wilson and Jim Williams set up the Budget Office and she magically sought several. All joined us from the administration. As we discussed at that hearing. It was really just a kind of first overview of what they're proposing.'",
        "'speaker_5': 'And then, as I've mentioned a few times, my intention is to have a series of more kind of topic focused ones where we both talk about the details of their proposals in different categories like housing, public health, etc., but also put next to it the things that councilors have been filing and talk about the details of those'",
        "'speaker_5': 'and kind of hash out what makes sense from this body's perspective, since this really is this transformational one time funding that we're getting. And it's got to be an agreement between the council and the mayor as to what the most impactful way to spend it is.'",
        "'speaker_5': 'So that was the first hearing in a process. We also noticed it, as the clerk mentioned, on the $40 million revenue replacement docket that's really supporting the budget that's in Councilor Furniture, Edison's committee. And then as well, I've heard from a number of nonprofit leaders on the docket that Councilor Braden had proposed about sort of what the'",
        "'speaker_5': 'role of the nonprofit ecosystem should be in this space. And in particular, thinking about what are the ways that our funding and the program that we set up could could really strengthen the nonprofit sector as it recovers. And I think there was some really good conversation about that, recognizing that the city doesn't have money to bail out'",
        "'speaker_5': 'the nonprofit sector here. But are there ways that in our contracting with the nonprofit sector in terms of like making things intentionally available to smaller nonprofits, and then that really like thinking about how the quality of the jobs that we have, um, that we're supporting with these contracts and agreements look like could we help transform that sector'",
        "'speaker_5': 'to one that's more sustainable for the people who work in it and the people that it serves. So I think it was a really robust, good conversation. And it was and I want to thank in particular Councilor Brayton is she was the sponsor of that third docket.'",
        "'speaker_5': 'Um, but it was very much the beginning of the conversation. My, my office will have out today or tomorrow morning. Our draft information requests from questions that councilors asked. But as councilors have any questions that you'd like to add on to that?'",
        "'speaker_5': 'You can write back to our office with that. So we're going to try to wrangle that all by the end of the day, Friday, so that we can send it over, so that we can make sure that we've got the right information in hand in advance of the next hearing with the administration.'",
        "'speaker_5': 'We're also in the midst of nailing down and we'll hopefully have nailed down by Friday the exact schedule of those upcoming hearings so that people can know. But what I would encourage in the meantime is that colleagues continue to do what folks have been doing, I think, including in the agenda today, which is if there's something that'",
        "'speaker_5': 'you want put alongside the proposal and to talk about as a use of ARPA funds. File it in the council docket. With that mention of ARPA funds in the title so that we know that that's a conversation we're trying to participate in.'",
        "'speaker_5': 'And and we'll definitely be figuring out how to make sure that the time in those subsequent hearings is not just about the administration's proposals. It really is about what councilors are proposing. And I'm excited to keep hashing that out together.'",
        "'speaker_5': 'So thank you so much, Mr. Chair. I will ask that the dockets, all three, remain in committee.'",
        "'speaker_0': 'Thank you. Council Docket 0503. I'm sorry. The chair recognizes Counselor Baker. Counsel Baker. You have the floor. Thank you. Thank you, Mr. President. And I would like to thank the chair of the. Of the the committee for holding this in and to.'",
        "'speaker_5': 'Listen to us.'",
        "'speaker_0': 'And our concerns. I made mine quite clear yesterday. I don't really see anything in here that speaks to mental health other than what's happening down in mass. And Cass and I believe we do need investments down there, but I don't think we need to invest in.'",
        "'speaker_2': 'Buying things like the Roundhouse.'",
        "'speaker_0': 'Hotel and things like that. I think we should be investing in.'",
        "'speaker_2': 'Our young.'",
        "'speaker_0': 'Kids that are going to bear the brunt of this, of this what's happened to us the last two years. Everything that's happened there, it's young kids. Just look at what's going on in our schools, the violence and the misbehaviors that are happening in our schools.'",
        "'speaker_0': 'It's all mental health driven. And I don't see one thing in this $350 million that speaks to that to speaks to youth development. Thank you, Mr. Chair. Thank you, Counsel Baker. The Chair recognizes Councilor Braden. Councilor Braden, you have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I also want to thank the Commissioner for her leadership and chairing the committee hearing yesterday and allowing us to add our docket to the hearing to look at Boston's non-governmental, nonprofit social sector and how they and hear from representatives of that sector and how their fared during the pandemic.'",
        "'speaker_4': 'It's really it was a timely reminder that our nonprofit sector are essential partners for the city in delivering essential services in the sphere of housing and mental health. And so health and human services all across the board, we have 200,000 residents of Boston are actually employed in this sector, and very many of our smaller nonprofits dug into'",
        "'speaker_4': 'their financial reserves. And in the early days of COVID, to meet the and to meet the need thinking, it would be a short term challenge. It wasn't a sprint. It turned out to be a marathon, actually, probably a super marathon longer than the 26 miles.'",
        "'speaker_4': 'So, you know, I think it was a timely conversation. And I do hope that we will continue to consider how we might support the nonprofit sector as we consider how we might expend our ARPA funds going forward and targeted and mindful of expenditure in certain things will actually give us a lot more benefit going forward.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. And the chair recognizes counselor. Me here, counselor. Me here. You have the floor.'",
        "'speaker_6': 'Yes, thank you to the chair and to the sponsors for bringing this very important conversation to our chamber yesterday. I just would like to go on the record and echo the importance of making sure that we as councilors understand and recognize the important role that we play in determining how these dollars are going to get allocated and'",
        "'speaker_6': 'used. I always say that nothing about us without us is for us, and when we get presented things that we need to react to, it always feels like an afterthought. And in the spirit of the new administration and in the spirit of collaboration, I think that we have an opportunity to change the way we do business and'",
        "'speaker_6': 'making sure that we're listening directly, not to not only to our our council colleagues, but also to those who put us in this position. So I look forward to the continued conversation and being a loud voice in this process.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Counsel me here. The chair recognizes Counselor Fernandez innocent. Counsel Fernandez, innocent. You have the floor.'",
        "'speaker_4': 'Thank you, Council President. I thank you, Madam Chair, for holding the hearing and to my colleagues for their express concerns. And I think that, you know, we have a long way to go in terms of like procurement and quantity contracts in managing BJP and ensuring that these processes or how we're contracting, employing people in the city of'",
        "'speaker_4': 'Boston is or not equitable. So I did hear that there was a plan for specific allocation to ensure to fulfill some assessments thereafter or some sort of metrics in monitoring how we're going to be equitable or how the implementation of these programs would be equitable.'",
        "'speaker_4': 'I did appreciate the ideas that the administration had. I think they're I think most of them for for are wonderful ideas. But I also think that councilors have 1 to 4 ideas. I also think that councilors have been planning and organizing and meeting and working and galvanizing and spending a lot of time and organizing toward their own'",
        "'speaker_4': 'projects or consolidation of community efforts. So I believe that we should probably go into conversations about how we are expanding on the proposal to include us. And so I look forward to that and I won't belabor this any further, but to say that again, when we look at our contracts and our records, we're not doing a good'",
        "'speaker_4': 'job. So allocating such a large amount to projects and say, okay, here's 5 million to ensure that it is equitable, I think it's concerning. And I think that historically, you know, the pattern so thus far historically and I and I know this is speak to the administration currently, but because there is a lack of trust, because the'",
        "'speaker_4': 'relationship has not built upon where we as people of color or counselors of color believe or feel that the equity has truly been solidified in city government, then the honest and sincere conversation should roll out where we are included.'",
        "'speaker_4': 'So lead by example to speak to council me here point. So I look forward to doing that and having those open conversations without without insult, without judgment. But to say, how are we doing this in the way that we say that we're supposed to be?'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Counsel Fernandez Anderson, would anyone else like to speak? Docket 0503050404364 Women in Committee Motions Orders in resolutions. Mr. Kirk, please read Daugherty.'"
    ],
    "Hearing on Housing Code Enforcement and Rental Inspection Program.": [
        "'speaker_1': '05870587 counsel as Lara and Fernandes, Sanderson offered the following order for a hearing to discuss the impact of inequitable housing code enforcement. In Boston's proactive rental inspection program.'",
        "'speaker_0': 'Thank you, Mr. Clarke. The Chair recognizes counsel. Our counsel over at U of the floor.'",
        "'speaker_7': 'Thank you, President Flynn. And thank you to Counselor Fernandez Anderson for co-sponsoring this matter with me. We all know that asthma is a chronic respiratory disease that's responsible for about 1.8 million annual emergency department visits in the U.S..'",
        "'speaker_7': 'It's also the leading cause of childhood morbidity. It is a preexisting condition that we have seen exacerbate COVID 19, increasing the risk of hospitalization and death disproportionately for black and brown people in the city of Boston. And housing has been shown and housing quality in particular has been shown to be critical determinants of asthma, particularly for children'",
        "'speaker_7': 'with more. Excuse me. With more than 44% of the risk of childhood asthma diagnosis being attributed to exposure at home. In 2013, the city of Boston passed the Proactive Rental Inspection Ordinance, which implemented a proactive rental inspection program that requires owners of all nonexempt units to undergo inspection every five years.'",
        "'speaker_7': 'Last month, Harvard released a ten year study of our housing code enforcement, specifically for reported asthma triggers, which showed a 17% longer median response time, 14% higher probability of cases being overdue, and a 54.4% lower probability of repair in neighborhoods that have the lowest proportion of white residents in the city.'",
        "'speaker_7': 'We know that renters typically are slow to report this type of incident for fear of retaliation. And so we can expect that the number of people that are living in private rental units and are being exposed to asthma triggers are much more significant than what we see here.'",
        "'speaker_7': 'I believe that there's really an urgent need to strengthen code enforcement systems and programs like Breathe Easy at Home and the proactive rental inspection program if we want to protect the health and safety of our tenants, particularly in the city's most marginalized communities.'",
        "'speaker_7': 'As the chair of the Committee on Housing and Community Development, I'm committing to ensuring that our constituents not only have access to ample affordable housing, but that the places that they call home are also safe and healthy. I'm calling this hearing because our current interventions have proven to be plagued by the same systemic racism that we see'",
        "'speaker_7': 'in all of our city agencies. And I think that a policy failure is going to require a policy solution, and I hope that we can get to one here. Thank you, President, for.'",
        "'speaker_0': 'Thank you. Thank you, counsel. Lara. Um. The chair recognizes Counselor Fernandez Anderson. Counsel Fernandez Anderson, you have the floor.'",
        "'speaker_4': 'Thank you. Counsel President. Thank you, counselor, for for inviting me and ask and inviting me to partner with you in this. So I guess, just to reiterate not what, which, what hasn't been said, right? So you put that so eloquently.'",
        "'speaker_4': 'In short, I think if you live in a predominantly black neighborhood because of the intersection between like, you know, systemic racism and class inequality, that neighborhood is more likely to be poor working class. So then obviously predominantly white neighborhoods than they are predominately white neighborhood counterpart.'",
        "'speaker_4': 'And I think because of this, to reiterate the example documented here, though, we could just as easily discuss other examples. Obviously asthma and other conditions that come with lack of inspections in in these communities obviously impact the communities disproportionately in a negative way.'",
        "'speaker_4': 'So thank you again and I look forward to hearing with you. Thanks.'",
        "'speaker_0': 'Thank you. Counsel Fernandez innocent. Is anyone else looking to speak on this matter? The chair recognizes Constitution. Constitution? You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. I rise in support of this talk. But also to say that one of the reasons why it's incredibly important to have is doing inspections is because people are so afraid already to withhold rent when it is their right, when they're not being provided an apartment.'",
        "'speaker_5': 'That is up to standards. We see it time and time again. People are paying for for apartments that are not quality. Right. But they feel like if they don't pay the rent, even though they're not getting heat or even though they're, you know, living in subpar conditions, that they're still required to pay rent.'",
        "'speaker_5': 'When they're not they are required. They are able to withhold rent. And the more we get ESD out there to inspect the apartments, the more people will feel empowered that they can actually withhold that rent that they can.'",
        "'speaker_5': 'And so I think it's important that we have see out there also so that our neighborhoods, our people in our neighborhoods feel like they can take ownership, even if they're just renting. What's coming out of their pocket and what's coming out of their pocket meets the value of what they're getting.'",
        "'speaker_5': 'So just right in support. And I think this is a really important conversation. Thank you.'",
        "'speaker_0': 'Thank you. Counsel. Again, the chair recognizes counsel role council. Will you have the floor?'",
        "'speaker_3': 'Thank you, President Flynn. And thank you to the Makers counsel Laura and Anderson Hirono to point to some staggering data around preparing items that are health hazards have received pictures of unhealthy living living situation from rodents, cockroaches and mold.'",
        "'speaker_3': 'As a city, I believe that we should be looking towards a more proactive enforcement does not that does that rely on tenant reports? For example, in 2003, the Greensboro City Council enacted their own certificate of occupancy ordinance and required mandatory inspections for essentially all rental housing.'",
        "'speaker_3': 'And after they enacted their ordinance, they saw that code violations dropped by 77% in eight years and that the city was able to bring more than 8700 properties up to a minimum minimum standard over the course of four years.'",
        "'speaker_3': 'I'm looking forward to working with the makers of ESD to ensure that the resources that we are able to enforce and strengthen the policies on inspection repair.'",
        "'speaker_0': 'Thank you. Thank you. And you want your name? Absolutely. The chair recognizes counselor Brad and counsel Brad and U of the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I also want to thank the makers for this very important hearing order. And it also dovetails very nicely with some work our office has been doing on the issue of scofflaw landlords who do not keep their properties up to code and deferred maintenance and etc. without.'",
        "'speaker_4': 'And usually the code enforcement finds is just a cost of doing business. So we're working on that. The other issue that we are addressing in this context with regard to that issue is looking at the capacity of our Inspectional Services Department and making sure that they have the technology to actually be more effective in enforcing the codes'",
        "'speaker_4': '. And and my understanding is being that, you know, they have been using basically a paper and pencil and paper, a pen and a paper approach, and that they do that the addition of added technology such as iPads, so they can do a field report in the field and have photographs and log.'",
        "'speaker_4': 'The conditions will expedite and be much more effective in enforcement. So always with any of these questions, I echo your concerns. Mr. President, we when we bring in new rules, new mandates, it's really important to ensure that our Inspection Services Department is equipped and has the it has the appropriate level of personnel to be able to be'",
        "'speaker_4': 'an effective enforcers of the code. So thank you so much.'",
        "'speaker_0': 'Thank you, counsel.'",
        "'speaker_4': 'And please have my name tag incarcerated.'",
        "'speaker_0': 'The chair recognizes. Counsel me here. Counsel, I'm here.'",
        "'speaker_6': 'So thank you, Mr. President. So I just want to rise and support and thank the leadership of the Housing Committee for spearheading this council a lot of for your and relentless leadership and all things that deal with housing.'",
        "'speaker_6': 'I really do appreciate and love how you lead in this space as well as council. Fernandez Anderson I'm really looking forward to the work and not only just having the conversation but really putting in the systems that are going to help support your vision.'",
        "'speaker_6': 'So please add my name. Thank you.'",
        "'speaker_0': 'Thank you. Counsel me here. Anyone else like to speak or add their name? I will. I will. I want to say thank you to the makers of this important hearing. I also want to highlight what counsel were all mentioned.'",
        "'speaker_0': 'The important role pest control plays in healthy living in apartments especially. But they contribute significantly to a decline in our public health our our our health for our children. So dealing with pest control is also a critical role.'",
        "'speaker_0': 'I know several of my councilors have mentioned that, but that's an important and important subject. And I just want to thank all the councils for the important work they're doing on this. If you'd like to add if you'd like to add your name, please raise your hand.'",
        "'speaker_0': 'Mr. Clarke, please add Councilor Arroyo. Councilor. Councilor Braden Councilor Fire Council, whose own council may hear Councilor Murphy Council roll. Please add the chair. Docket 0587 will be assigned to the Committee on City Services, Innovation Technology. Mr. Clarke, please read Docket.'",
        "'speaker_1': '05880588 counsel as Lara. Amanda Sanderson offered the following in order for a hearing to discuss the Malcolm X Park renovation.'"
    ],
    "Hearing on ARPA Funding for Non-Profit Health Services for Disenfranchised Populations.": [
        "'speaker_1': '05900590. Councilors Fernandes, Sanderson and Murphy offer the following order for a hearing to discuss ways in which RPA funding can support an ecosystem for nonprofit, holistic wraparound health services for disenfranchized populations.'",
        "'speaker_0': 'Thank you. The chair recognizes counsel Fernandez innocent. Counsel Fernandez innocent. You have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. And Mr. Clarke. When? When I was writing this, the title read like that. Just the way you read it. And I was like the now for holistic wraparound health services. So I was really enjoying the way you read that because this is exactly how it played my mind.'",
        "'speaker_4': 'I was like, Dang, this titles too long. But anyway, just the title I listen. I'm going to listen. You know what? It's a dissertation. No, it's four pages long. Yes, I know. Listen. Right. Y'all only allowed if I can if I if I can add counsel allusion as original co-sponsor as well.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_0': 'This Constitution is so ordered.'",
        "'speaker_4': 'Thank you, Mr. Counsel. All right, all jokes aside, we hear councilman here talking about this all the time. And I don't know the I don't know how to quote you, but Boston is resource for coordination, but coordination poor.'",
        "'speaker_4': 'And so imagine an ecosystem that and I think this is already in play this is not something that I'm just pulling out of a hat. But imagine because I do that a lot. But imagine, though, an ecosystem that is actually working in synergy in terms of the health services or wraparound services.'",
        "'speaker_4': 'A lot of us talk about mental health or behavioral health, and I think that understanding the scope of it, I think even bringing training to the council, understanding the scope of like what preventative measures would look like in terms of wraparound services to address mental health is super important.'",
        "'speaker_4': 'So an ecosystem of all of these health services that are working together in collaboration with one one nonprofit that is serving as the hub or the connector. So in any type of health, you need the coordinator or the umbrella, if you will, of these services so that if I am going for substance abuse or substance misuse, rather'",
        "'speaker_4': 'services and I need housing, that there is an automatic network that you can plug me to so that it actually is wraparound, so that if I go for myself and my child needs help and but then you're also working with my uncle.'",
        "'speaker_4': 'You're working with my grandma that may need elderly housing or something like that. That is what we call in the trauma informed world of services wraparound that you were working with the full family or you're working with the full community in terms of holistic services, I think that there are a lot of agencies in our community that'",
        "'speaker_4': 'have proven best practices, that have actually implemented services in a very practical and efficient way. And I think it's warrant it warrants a conversation for us to talk about how are we looking at all of our resources in creating this so-called ecosystem?'",
        "'speaker_4': 'And I do have to say, Counsel Braden, I was not I was not motivated by your idea, but then because I wasn't really listening when you were breaking it down. So I apologize if this goes into specifics of your idea.'",
        "'speaker_4': 'And I came to see you today to say like, hey, look, oh my God, great minds think alike. But this is an actual more specific to to and as an extension to what you have brought up already. And I would love to collaborate in how we can fuze this together.'",
        "'speaker_4': 'And that's pretty much all I have to say about that. Thanks.'",
        "'speaker_0': 'Thank you, Counsel Fernandez and Fernandez Anderson. The chair recognizes counsel. Who? And counsel. You have the floor. I'm sorry. I'm sorry. The chair recognizes counsel. Murphy. Counsel. Murphy, you have the floor.'",
        "'speaker_7': 'Thank you. And thank you, Counselor Fernandez Anderson, for asking me to join on. And I do just have to say that it took a few days to read through it. My office kept saying, Did you read it yet?'",
        "'speaker_7': 'I'm like, I'm half way through, but I think I'm on board. So thank you for this work because we know it's so important. And so I will just state that, you know, we always need to support our nonprofits all the time, but especially through this pandemic and through the recovery that we'll be going through for a long'",
        "'speaker_7': 'time. And the mental health crisis is one of the pandemics within the pandemic. And we know so many are struggling. And we had a hearing yesterday where we heard from the nonprofits, and what we already knew was really shared more eloquently about the staffing is another crisis that so many of our nonprofits, social service industry are struggling'",
        "'speaker_7': 'through. They've been hit the hardest. You know, they've been stepping up and providing these supports, the much needed supports to keep our city moving forward. When we shut down, they were all out there on the front line and they needed to work more.'",
        "'speaker_7': 'And they have a staffing shortage. And we know that we don't pay our social service workers the pay that they need and they deserve. They also have been pivoting to ensure that our communities get the necessary services they need, and I know we hope covid's over, but we know it's not.'",
        "'speaker_7': 'And so many of our neighbors and residents not just need mental health services, but also basic services like food and heat and housing still. So we can't forget that. So I believe that this order is going to help Main Stream and ensure that the much needed services continue to get to the families in our city.'",
        "'speaker_7': 'So I look forward to the work ahead and partnering with you on this and also with council because I, I feel like most of the orders that have been filed in Council of Florida and those who have been around and it might seem like we keep kind of filing the same things, it seems like we care about'",
        "'speaker_7': 'the same thing. So moving forward, maybe we should, you know, we continue to work together, but in a way where we know that we're not in any way trying to step on each other's toes but get this important work done for the city.'",
        "'speaker_7': 'So thank you very much.'",
        "'speaker_0': 'Thank you, Councilor Murphy. The Chair recognizes Councilor John Councilors. And you have the floor.'",
        "'speaker_5': 'Thank you, Mr. Chair. And may the force be with you.'",
        "'speaker_4': 'It's all right.'",
        "'speaker_5': 'I made sure I set it up. I want to thank the leadership of Councilor Fernanda Anderson and Councilor Murphy on this issue. I'm happy to be added. We know that non-profits engage in COVID 19 and health recovery services are already doing the work in the communities that we live in and that they serve.'",
        "'speaker_5': 'I mean, if you don't know that these nonprofits are doing the work, you're not looking hard enough because they're there. They're present, oftentimes using money from their own pockets and helping a nonprofit leader who's been who's been pouring herself into this work of really shepherding her nonprofit through the not throughout COVID and is behind on some on'",
        "'speaker_5': 'some of our housing payments, because she's caused so much of her own funds into this work. So they need our support as concerts are construction on this and said wraparound services provide a comprehensive and holistic family driven solutions to health services.'",
        "'speaker_5': 'It puts the individual youth and families right at the center. COVID relief funds have been almost completely and inaccessible to our communities, to our undocumented communities, to returning citizens and a shelter rights committee and Immigrant Advancement Committee. I want to make sure that everything we do is in partnership with those who it's it's has become and has'",
        "'speaker_5': 'historically been easy for us to exclude. So we need to make sure that they're getting the resources they need so that they can share in the prosperity of the city. We know that oftentimes providing a housing voucher or job training will not solve the underlying problem because people are complex.'",
        "'speaker_5': 'And, you know, the the needs are very varied. And I think nonprofits oftentimes are doing meeting people at all of their various needs. I think about, you know, the work of the Brazilian Worker Center Equity now and beyond Asad on La Alianza, so many nonprofits out there that are doing the work sometimes out of their own kitchen'",
        "'speaker_5': '. And this is especially the case when it comes to black and brown nonprofits that don't have the advantage of networking, of structures and of access. And so I'm incredibly excited to support the work conjuring Andre Anderson of making sure that we are building ecosystems that work and that are responsive and working in partnership with the people already'",
        "'speaker_5': 'doing the work. So thank you very much for this opportunity and I look forward to the work.'",
        "'speaker_0': 'Thank you. Can't solution. Is anyone else hoping to speak on this matter? The chair recognizes Councilor Braden and counsel Brady. You have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. And thank you, Councilor Fernandez Anderson, for this initiative. You know, just I think the connection and the building of networks, an effective, effective coalition building across different non-profits to do different parts of the job.'",
        "'speaker_4': 'Having and having a safety net and a network that actually doesn't have big holes in it. And when we see the holes being able to try to correct the deficiencies. I just want to speak to something that happens out in Alstom.'",
        "'speaker_4': 'Brighton, we have the Alstom Brighton Health Collaborative and it is a very loose coalition of folks who from a wide range of, of nonprofit entities and our neighborhood is about 40 organizations all together and they work together pre-COVID.'",
        "'speaker_4': 'But when COVID hit, they the coordinator, the executive director had a Adam multiple several times a week covered networking meeting so that we pulled all our resources together and connected. And that network includes the Brazilian Workers Center, the Brazilian Women's Center, ABC, and the Elizabeth Hospital, the whole the whole range and the community health centers.'",
        "'speaker_4': 'And it was really about, okay, what does anybody need? What's going on on the ground? How can we get better, more resources? And it was really that sort of. Collaborative approach that helped us weather the storm. And, you know, I think we need to explore more models of that.'",
        "'speaker_4': 'I know what a neighborhood level, every neighborhood organizes and does this, but it's maybe formalizing it and putting some more resources into it. These are these networks, these former neighborhood networks. Formalizing them more and putting some resources into supporting that grassroots, neighborhood level.'",
        "'speaker_4': 'Wraparound interventions is is really something we probably should be looking at very, very carefully. So thank you so much for this hearing order and please have my name.'",
        "'speaker_0': 'Thank you. Thank you, counsel. Brian, the chair recognizes counsel me here, councilman. Here you have the.'",
        "'speaker_6': 'Full thank you to the makers for bringing this hearing order to the space. Really super excited about the conversation. As someone who always talks about the fact that I started my career in the nonprofit sector and that's all I've ever known aside from my time at MTV.'",
        "'speaker_6': 'And even then I was still working with the nonprofit sector in different capacities. I think that, you know, when I talk about our ability to be resourceful, oftentimes those who have the most access to information are the ones who usually get the most dollars and also are the ones that have the most capacity.'",
        "'speaker_6': 'But the ones who are doing the work oftentimes are overlooked. And I think creating an ecosystem where we're all really recognizing the strengths and we're not going to be acting like, you know, crabs in a battle, always fighting for whatever little resources and whatever crumbs we can get.'",
        "'speaker_6': 'So I think this whole idea of really creating an ecosystem that creates opportunities for people to be in collaboration with, not in competition with each other, will really help us get at the core of a lot of the issues that we have relied on our nonprofit sector to lean into.'",
        "'speaker_6': 'And I'll just say that, you know, I know that this is specifically for established nonprofits. I'd just like to add that our office has been doing a lot of work with mutual aid groups who are looking for organizations to partner up with.'",
        "'speaker_6': 'And I think that when we think about building capacity, there are a lot of folks who are doing the work right out of their homes with very limited resources. And so our hope through this conversation and we hope to bring some of these mutual aid groups into the into the fold.'",
        "'speaker_6': 'We're going to be hosting a capacity building conference in July to help support these organizations. And so look forward to having the hearing before then so that we can learn how we can better support everyone. So thank you.'",
        "'speaker_0': 'Thank you, councilman here. If you'd like to add your name, please raise your hand. Mr. Clarke, please have counsel. Royal Counselor Baker Counsel of Bar Counsel Braden. Counsel Fiery Counsel Lara. Counsel here. Counsel Murphy. Counsel. Earl, please out the chair.'",
        "'speaker_0': '20590 will be referred to the Committee on Boston's COVID 19 recovery. Mr. Quirk, please regroup at.'",
        "'speaker_1': '05910591 Council of Clarity offered the following order requesting certain information under Section 17 of relative to the Mission Hill K through eight school.'"
    ],
    "National Survivors of Homicide Awareness Month Resolution.": [
        "'speaker_1': 'I can have a059 to counsel as me here. Laura in Arroyo offered the following resolution, recognizing November 20th through December 20th, 2022, as National Survivors of Homicide Awareness Month.'",
        "'speaker_0': 'Thank you. The chair recognizes counsel. Counsel me here. Counsel me here. You have the floor.'",
        "'speaker_6': 'Thank you, Mr. President. And before I even read this, I just wanted to acknowledge counsel, morale and counsel of Baker for bringing the Lucy Brown Peace Institute here a few weeks ago. So I really do appreciate your support for Tina and her team.'",
        "'speaker_6': 'So thank you for bringing them into the space. And I would also like to thank my co-sponsors, council, Elida and Arroyo. I know this resolution will be recognizing and Awareness Month all the way in November, but we frankly need to be recognizing survivors of homicide 365 days a year.'",
        "'speaker_6': 'We use the word, quote unquote, resilient in a lot of political spaces, perhaps sometimes too much. But it's hard to think of another word to describe the families and loved ones of those who have survived homicide. That kind of loss, this pain that sticks to you like no other.'",
        "'speaker_6': 'And as we have recently seen in recent events that have happened with the graves of our young loved ones in our cemetery in Roslindale, that pain and trauma can renew itself over and over again. And I think that too often we lose a loved one to homicide.'",
        "'speaker_6': 'That's that's the initial wave of support. People send you meals, reach out words of encouragement, refer you to trauma services. But what happens after that? What happens during that first birthday or holiday season without them? Who is there for the families in that time of need?'",
        "'speaker_6': 'And I think that's why we need a time like Survivors of Homicide Awareness Month, because there isn't a moment in time when the grieving stops, when you finally move on, especially when you have lost someone to homicide, as I have.'",
        "'speaker_6': 'This Sunday, I will be walking in the 26th annual Mothers Day Walk for Peace as a city councilor, but more importantly, as a mom, I need to be there not only to show my support, but because I know that we can't just keep having the same conversations around violence in our community.'",
        "'speaker_6': 'Something has to give. So that by this time next year, the 27th Annual Mothers Day's Walk for Peace can be a place where we can celebrate the fact that we realized our potential as a city and make major systemic changes to how we address the violence in our communities.'",
        "'speaker_6': 'I really hope that we can get to this point. And before I move to suspend the rules and ask my colleagues to speak, you know, I met so Tina was my neighbor. And when I started my career in the nonprofit sector, her son Louis was gunned down on Geneva not too far from where I live.'",
        "'speaker_6': 'And that was 20 something years ago. And we keep having the same conversation around violence. And I think that what we have lost touch is, is with the folks who have to continue to carry on. My niece. Lost the the father of her son to violence.'",
        "'speaker_6': 'In my first year here as a city councilor. And his tomb was one of the ones that were. Uh, one of the ones that were messed with. And it was my daughter. Who told me about it. And I think that when we think about survivors and we think about the pain and the trauma, all of those things'",
        "'speaker_6': 'need to be taken into consideration. If we're really serious about this work here in the city of Boston, I just feel like everything here is so political and it just gets tiring and people are tired of it. And I think that.'",
        "'speaker_6': 'You know, we all are responsible and we all have to be held accountable to what we're going to do if we're really serious about restoring the harm that so many are experiencing here in the city of Boston. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Here. The chair recognizes council borough council ora. You have the floor.'",
        "'speaker_7': 'Thank you, President Flynn, and thank you to Councilor for asking me to co-sponsor this resolution for including me in this resolution. And Councilor Arroyo, our other co-sponsor. I became a homicide survivor for the first time when I was 11, when my oldest brother, who was 25 at the time, was murdered.'",
        "'speaker_7': 'I didn't know at the time that I would become a survivor another dozen times over in in my life, all of my colleagues, if not most of the folks here have are either survivors themselves or know and love survivors and their families who they either work with or are in their communities.'",
        "'speaker_7': 'And so I feel like this resolution is an ode to that strength and that resilience and the commitment to keep going from homicide survivors. And for me, it's really a commitment to the ongoing fight against gun violence. As a member of the trauma response team.'",
        "'speaker_7': 'I spend most of my time responding to victims and survivors of penetrating wounds in my neighborhood. I then became a street worker and did violence prevention and intervention work in Mattapan first and then in Lower Roxbury in the South End?'",
        "'speaker_7': 'And so to say that I have spent most of my adult and professional life. In the midst and trying to manage and fight for and advocate for not just our young people who are victims, but their their friends and families in our communities would be an understatement.'",
        "'speaker_7': 'There are things happening in my district currently that, you know, the folks in our community are really feeling the weight of, including this issue that we've been seeing at the cemeteries, one of which is a constituent of ours.'",
        "'speaker_7': 'And our office has been working really closely to support. And so, you know, when I think about survivors of homicide, I like to think about my mom who lost her, you know, lost her first child and how she dedicated her life maybe for the possible next ten years to finding my brother's murderer who wasn't arrested when my'",
        "'speaker_7': 'brother was shot. And that is the kind of tenacity that I see in all of our people, in all of our pain, all the pieces of the people and the constituents of the city of Boston. Who have to carry the weight of surviving homicide.'",
        "'speaker_7': 'So I'm really excited and happy to support this resolution, and I hope that we can continue to honor honoring survivors by making the policy decisions that are ultimately going to create safe communities for all of us.'",
        "'speaker_0': 'Thank you, Counselor. Laura. The chair recognizes Counselor Arroyo. Council of Arroyo. You have the floor.'",
        "'speaker_2': 'Thank you. President Flynn. I think counselor here and Counselor Laura for raising this with me. I had a murder hit very close to my home. Michelle Nova, the pizza delivery man who was murdered in High Park. I was the father at the time with my partner, and so I was there for the direct impact of that.'",
        "'speaker_2': 'And for the years after that, that's actually how I became very aware of the services that the city offers and where they're good and where they're poor. I got to meet Courtney Gray at that time. I have to give him some praise in this moment as somebody who is excellent at dealing with trauma.'",
        "'speaker_2': 'And the reality is they only have the resources at that point for folks who don't know. Rochelle Nova was a pizza delivery man who had taken a shift and that night was murdered over essentially $50 and. When that happens, there's obviously a lot of trauma, residual trauma, a lot of lifelong obvious pain and harm.'",
        "'speaker_2': 'And what the city was able to offer, which I think is certainly better than nothing, was a week essentially of Courtney Gray and sort of the trauma response team services. They got a week of that, and it was incumbent upon myself and people close to this family to basically ask them as many questions as we could to'",
        "'speaker_2': 'figure out how do you guide somebody through? Unspeakable loss and trauma, just the deepest, worst destabilizing thing that can happen to someone. And with his guidance and his ability to be somebody I can check in with regularly. There was healing there and there were things that were in play.'",
        "'speaker_2': 'But there's still that loss. There's still that trauma. There is still residual. Every holiday is very different. Every birthday is very different. Every moment that would bring joy. Generally, whether it's a graduation or a marriage proposal or however that is going, there is harm and loss and missing.'",
        "'speaker_2': 'And so to think about the families in Boston and in the state and in the country experience that I think Homicide Awareness Month is or is is the least of what we can do. I think focusing resources towards dealing with that trauma that families are feeling in those moments.'",
        "'speaker_2': 'And I would just also note that this was a case where they were able to arrest the folks who did this and bring them through a judicial process. But we know that in Boston, especially, many families have never had that closure.'",
        "'speaker_2': 'Many families have had to experience the feeling of not knowing who did this to their loved one. And so as we do this, you know, I just want to highlight that there are services that we have offered that I can testify, frankly, work really well, and we need to expand that action and that practice and make that'",
        "'speaker_2': 'more accessible. The other thing I will just mention here, too, is that people don't often think about this, but when people are die unexpectedly about to do murder or homicide, there is a cost that a family must now carry that is unexpected, and often times it is devastating to have someone who has just lost someone.'",
        "'speaker_2': 'And their first request is for money or for help securing money because they are stressed and worried about how they are going to properly honor their their loved one because they don't have the resources to do so in this time of trauma need.'",
        "'speaker_2': 'And I know that the city does do some very small allocations in the budget to help with those things. But I think that is something that I would like to see focused on in the budget as well, because it is heartbreaking to see families that do not have the resources to make it day to day, have to'",
        "'speaker_2': 'all of a sudden figure out how to get into debt or how to borrow money from other people so that they can honor their loved one while also going through such trauma. And so these are the kinds of wrap around things that I think we really have to focus on as a city and figure out how to'",
        "'speaker_2': 'address, because homicide is awful and terrible and there are all these sort of butterfly effects and ways in which we can be helpful and I can speak to that personally. And so thank you for lifting this up. I see all of those who have suffered this harm, and my thoughts and prayers, frankly, are with you all of'",
        "'speaker_2': 'the time, but especially now. So thank you, President Flynn and the council.'",
        "'speaker_0': 'Thank you, Counselor Arroyo. The chair recognizes counsel for Charity Council, Florida U of the Fall. Thank you, Mr. President. Please add my name. And as the lead sponsor, it stated It really is a year round. A year round diet for four families.'",
        "'speaker_0': 'I lost my cousin back in 1994. 28 years has gone by. We think about it. The whole family thinks about them all the time. And one of the things we do think about is if the Boston of today, the Boston that supports strongly supports, arduously, supports our LGBTQ community, if that was the situation in 1994, we probably'",
        "'speaker_0': 'wouldn't have not have lost our cousin. And so that's constantly reminding me of of his passing, but also for those that are in this chamber or those that have lost a loved one, that I understand that and that we do think about our loved ones every day and wish that we could have that moment every day like'",
        "'speaker_0': 'something he had just alluded to. So please add my name and encourage others to join as well. Thank you, counsel. Clarity. Those wishing to add the name, please raise your hand. Mr. Kirk, please add Counselor Arroyo. Counselor Board Counselor and Counselor Fernandez Anderson.'",
        "'speaker_0': 'Counselor Baker, Counselor. Clarity. Counselor. Illusion. Counselor Murphy, counsel. We're all employees. That the chair. Councilors. Consoles me here. Laura and Arroyo. Now seeking suspension of rules and adoption of Docket 0592. All those in favor say aye. Aye. I oppose any.'",
        "'speaker_0': 'The ayes have it. The docket has passed. Mr. Clerk, please read docket.'"
    ],
    "Recognition of Asian Americans and Pacific Islanders During Asian Pacific American Heritage Month.": [
        "'speaker_1': '05930593. Counsel of Flynn offer the following resolution Recognizing the contributions of Asian Americans and Pacific Islanders during Asian Pacific American Heritage Month in May.'",
        "'speaker_2': 'Thank you, Mr. Clarke. The chair now recognizes. Councilor Flynn. Councilor Flynn, you have the floor.'",
        "'speaker_0': 'Thank you. Thank you. Counsel. Royal counsel, royal counselor Fernando Fernandez Anderson as an original co-sponsor.'",
        "'speaker_2': 'Seeing no objection, she is now added.'",
        "'speaker_0': 'Thank you. Many, many know that I represent the largest AAPI community in Boston. Mostly in Chinatown, but also in the South End in itself, Boston as well. Outside of my district, we have a vibrant Vietnamese community that's in council, a baker's district.'",
        "'speaker_0': 'Um, and Councilor Braden also has a large Korean community as well. And council has a large AAPI community, as do other councilors. There's a large Cambodian community outside of Boston, up and up in Lowell. Um, over the weekend, I had the opportunity to attend.'",
        "'speaker_0': 'The Asian Jade Banquet, which is a celebration of Asian police officers throughout New England. And they came together and talked about the important role of Asian and Asian-American police officers that play in our cities and towns. And they do an exceptional job.'",
        "'speaker_0': 'But I always come back to. A story that I have said several times. But when the Chinese community first came to the United States. They helped build the United States, literally with the transcontinental railroad. And Chinese laborers along with Irish laborers.'",
        "'speaker_0': 'Connected the East Coast and in the West Coast, and they connected up a bit outside of Salt Lake City. And there's this there's a famous photo of kind of a ribbon cutting ceremony completing completing the railroad. And there's about 200 people in one of these old photos.'",
        "'speaker_0': 'And of the 200 people, there's not one Asian person in the photo, even though they practically built and built the railroad. And after that, after completing the railroad, what did the U.S. government do? We enacted the Chinese Exclusion Act.'",
        "'speaker_0': 'What Chip scored in Chinese from coming to the United States was the first time that the United States intentionally excluded an ethnic an ethnic group from coming in here. We also during the during World War Two, we imprisoned Japanese Americans, mostly out in the West Coast, in California, in some other some other states as well, even though'",
        "'speaker_0': 'they were born here. Um. During this pandemic. We actually held the first public town hall meeting on COVID 19 in the country. And there was a Josiah Quincy School, and there was a young woman. She was a student at the Boston Latin at Boston Latin Academy.'",
        "'speaker_0': 'And this was in January 2020. And. COVID really didn't hit this part of the United States yet. But we we knew it was coming. And this student got on the train heading to school when she got on the train.'",
        "'speaker_0': 'She walked into the train and all the other people on the train got off the train. Because they associated her with with COVID 19. She was a young kid, probably 16 to 17 years old, telling telling me that story at this at this town hall.'",
        "'speaker_0': 'And then I thought to myself, you know, we're going to see a lot of anti-Asian racism in this country. anti-Asian hate hate crimes. That have happened here in the city of Boston, not just with the AAPI community, with immigrants, with communities of color as well, LGBTQ as Council of Clarity, as I mentioned also, um, and these, these'",
        "'speaker_0': 'hate crimes against immigrants continue to this day. I was at a hearing the other night and an elderly Asian woman was visiting Boston. I think she lived in Somerville. She was probably 80 years old. She got punched in the head by a young guy, probably, probably 20 years old, just just because she was Asian.'",
        "'speaker_0': 'But what I but what I want to do as we celebrate AAPI. Certainly we have to deal with the discrimination and the hate crimes, but also to celebrate the important role the Asian community has played in the United States, the contributions and the sacrifices that they made for our city and for our country.'",
        "'speaker_0': 'So I'm proud to partner with Counselor Fernandez Anderson. But I also want to say to my colleagues, I know you, you have also supported the AAPI community, not just today or this month, but for all of the year.'",
        "'speaker_0': 'So I want to recognize my colleagues for the tremendous work they do in this field. And I also want to recognize our first mayor of the city of Boston, Mayor Malveaux, who with have partnered on this resolution many times before.'",
        "'speaker_0': 'But I just want to say thank you to the mayor for her important work as well. So thank you. Mr.. Thank you also for giving me the opportunity to speak.'",
        "'speaker_2': 'Thank you, Councilor Flynn. The Chair now recognizes Councilor Fernandez Anderson.'",
        "'speaker_4': 'Thank you. Uh, Councilor. Sorry, President Flynn, for filing this resolution. And I just wanted to take a moment to just, you know, sort of now go by the formalities and just express my sentiment around this. When I arrived to the United States and did not and I was looking for a job to save money so that I'",
        "'speaker_4': 'can bring my brother or sister. And I would save every little bit. And I didn't have a green card, so I would I found a way and there was a few friends in Cambridge that I met some Bengalis and and other Nepalese friends that had hooked me up with some jobs and we would all work together.'",
        "'speaker_4': 'And of course, the joke was that immigrants that we work two or three jobs and sometimes we're called, you know, people would say, are you Jamaican if you work more than three jobs, right. So we all share this culture of working hard and being disciplined and putting out, you know, a lot of work because of our, you'",
        "'speaker_4': 'know, ethics or work ethics in terms of being disciplined in putting out work. But I a lot of my friends also share the sentiment. And as you know, Muslims being highly Asian or Asian Pacific Islanders share this expression that or the sentiment that.'",
        "'speaker_4': 'Because where because they work very hard and because they are disciplined or humble in the way that they ask for recognition that they are not recognized as human beings for the work that they put out. And not to repeat everything that often has said.'",
        "'speaker_4': 'But I was really happy that you mentioned all of the different historic contributions to the United States and building this country, but also all of the hardships that people have gone through. And I think that a lot of the times we human as human beings, we're not very good with the unknown.'",
        "'speaker_4': 'So we wait for this paradigm shift to take us to, oh, wait, it's wrong to discriminate against LGBTQ. Ah, oh, wait, it's wrong to be. To discriminate against blacks. Oh, it's wrong to be this way or that way.'",
        "'speaker_4': 'So I think that we should try to get into the culture of being open and understanding that there are nuances. As and as Counselor Laura has mentioned, we're not a monolith. So that's not to any and that's to every group.'",
        "'speaker_4': 'Everybody. There's nuances and culture and differences and music and food and everybody's different. And I think what happens is we we tend to clump up people in one category or one bucket Asians, that's it. But there's so much beauty and diversity and language and culture that comes with the different type that different Asians and Asian Pacific Islanders'",
        "'speaker_4': '. I'm so happy to partner with you in this and thank you so much, so much for your work. But not just because you're not just because you represent a lot of Asians, but because you're you are a very kind man.'",
        "'speaker_4': 'Castle Flynn. And I really just appreciate you for taking the time and not it's not about faults for you. It's like this. These are people I represent and I'm going to do that to the best of my ability with heart and passion.'",
        "'speaker_4': 'And I appreciate you for that.'",
        "'speaker_2': 'Thank you. Councilor Fernandez Anderson. Would anyone else like to speak? Seeing no one. Would anyone else like to add their name? Mr. Clarke. Please add. Councilor Baker. Councilor. Councilor Braden. Councilor Flaherty. Councilor Lara. Councilor. Legion. Councilor here. Councilor Murphy.'",
        "'speaker_2': 'Councilor Allen. Please add my name. Councilor Flynn seeks suspension of the rules and passage of docket 0593. All those in favor say I am opposed. Say the ayes have it. Docket 0593 has been adopted.'",
        "'speaker_0': 'Thank you. Thank you, Counsel Royal. Mr. Clarke, will you please read 20594 police.'"
    ],
    "Support for State Bills on Forfeiture Reform and Data Reporting.": [
        "'speaker_1': 'Numbers 059 for council and me here or for the following resolution in support of Senate 2671 An act relative to forfeiture reform and Senate 2105 enact relative to civil asset forfeiture data reporting.'",
        "'speaker_0': 'Thank you. The chair recognizes. Counsel me here. Counsel may hear you over the floor.'",
        "'speaker_6': 'Thank you, Mr. President. I'd like to suspend Rule 12 and add Counselor Arroyo and Laura as original co-sponsors.'",
        "'speaker_0': 'Hearing no objection. Counselor Arroyo and Counsel Laura are so out of it.'",
        "'speaker_6': 'Thank you. In March, the Committee on Government Accountability and Transparency and Accessibility held its maiden hearing on Docket 0200 in order for a hearing on government accountability, transparency and accountability towards surveillance equipment. We learned a lot regarding the purchasing of the cell site simulator and how it's used and what the process is in regards to civil asset'",
        "'speaker_6': 'forfeiture dollars are in how they're used. We also walked away with a greater sense of knowledge about the current state of civil asset forfeiture across the Commonwealth of Massachusetts. According to the Institute of Justice. Massachusetts earns an F for its civil forfeiture laws with the lowest bar to forfeiture, poor protections for the innocent and a large profit'",
        "'speaker_6': 'incentives. We have to do better. Fortunately, there is legislation at the state level that seeks to make an impact. An act relative to forfeiture reform will require the attorney general, each district attorney and each police department to file an annual report with the Executive Office of Administration and Finance and the House and Senate Committees on Ways and'",
        "'speaker_6': 'Means detailing all assets moneys proceeds from the assets seized pursuant to the Section. An Act relative to the relative to civil asset forfeiture data reporting will require the State Treasurer to establish and maintain a case tracking system and searchable public website.'",
        "'speaker_6': 'That includes, among other things, name of the law enforcement agency that seized the property, date of the seizure type of property, seize estimated value of the seizure, the outcome of the suspect's arrest and more. These are small changes that will by no means fix everything wrong with our civil asset forfeiture policies.'",
        "'speaker_6': 'But they are a start in the right direction that has a positive impact on the state of government accountability, transparency and accessibility. I'd like to thank Alex MATTHEWS for bringing these these pieces of legislation to our attention, as well as Fatima Muhammad Muhammad and Kate Crawford for their tireless work in seeking transparency and accountability.'",
        "'speaker_6': 'I move that we suspend the rules and urge my colleagues to vote in favor of this resolution. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Here. The chair recognizes Counselor Arroyo. Counsel Arroyo. You have the floor.'",
        "'speaker_2': 'Thank you, President Flynn. At civil asset forfeiture in Massachusetts has the. Is the sole one in the entire country with 50 states where the only one in which you can seize assets just on the basis of probable cause, which is the lowest form and the lowest bar.'",
        "'speaker_2': 'And so, you know, civil asset forfeiture has a number of issues, including the fact that we can seize assets when there was no charges brought. We can seize assets even in cases that end up dismissed or where a jury ultimately finds them not guilty.'",
        "'speaker_2': 'And in the state that has occurred in multiple jurisdictions, this doesn't address that. This doesn't change the bar. This also doesn't create any restrictions on where and how that money is used. The only thing that this does is create transparency in the data of what assets are seized, when they are seized, and what cases are they seized'",
        "'speaker_2': 'and how they are spent. But it doesn't in any way, shape or form impact the bar to seize them or the process to seize them. Nor does it change in any way the decision making and the processes that allow that money to be spent in whatever way they they need to spend it.'",
        "'speaker_2': 'Obviously, those are reforms that I would support and look forward to seeing happen, but this doesn't do that. What this does is it says when and where we are seizing assets, when and how we are seizing assets should be transparent to the public.'",
        "'speaker_2': 'We should be able to see those things. We should be able to know what cases they come from. We should be able to know how they are spent. We should be able to know ultimately what the outcome of those charges, if there are charges are.'",
        "'speaker_2': 'And I think that transparency is a good thing for the Commonwealth, especially in light of the fact that we are the only state that allows those seizures at a probable cause standard. And so with that, I have I'm happy to sponsor this and look forward to seeing appropriate action and support of Senate Bill 2671.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Counsel Arroyo. The Chair recognizes counsel avira counsel Lara U of the fore.'",
        "'speaker_7': 'Thank you, President Flynn, and thank you to my co-sponsors. I have very little to say for two reasons. One, because my colleagues have outlined the importance of this bill and this resolution so very clearly. And two, because I have been out since seven in the morning and I'm running out of steam.'",
        "'speaker_7': 'I am incredibly supportive of this matter. When we held our hearing on the purchase of the cell site simulator by the Boston Police Department. I had all of these questions and it became very obvious that there was policy changes that needed to happen at the state level in terms of what we could do to reform civil asset'",
        "'speaker_7': 'forfeiture. And so I'm excited to support this resolution. I'm excited to support this bill. And my counsel mentioned, I hope that it's gathering this data and having the information is only going to give us everything that we need to make sure that further reform comes down the line.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. Laura, the chair recognizes counsel. Florida counsel. Florida, you have the floor. Thank you, Mr. President. Thank you to the sponsors, and I appreciate the clarification from our colleague, Counsel Arroyo. Those are just the questions that I had.'",
        "'speaker_0': 'And I guess the question for the chair of the makers, would they consider having a hearing as opposed to sort of a suspension, an adoption, so we can kind of break that down? I know the way it works now is that the the procedures divided, I believe, have go to the law enforcement agency and the other half'",
        "'speaker_0': 'goes to the Suffolk County District Attorney's Office. I think that's the way that it was always broken down. I've made efforts on this floor to try to have those funds or at least have treatment or recovery, be it sort of the third leg of that school, particularly at school, and particularly in instances where there was a it'",
        "'speaker_0': 'was a result of a drug forfeiture. But and they would resist it vehemently. Clearly, Boston police had their thoughts and ideas as to where they wanted to spend their forfeiture money. The district attorney's office thought that they had their ideas, but we always were pushing from this body to get treatment and recovery into that equation if we're'",
        "'speaker_0': 'going to seize those assets. And as a result of of the case involved drugs and alcohol, we felt that it should go to treatment or recovery. So I would love an opportunity to bring the appropriate parties down and have that discussion in terms of clearly how the forfeiture happens and the mindset behind it, but whether or not'",
        "'speaker_0': 'it makes sense to potentially maybe inject treatment or recovery into that equation once again. But again, that's just for the makers. I do appreciate the clarification and I look forward to see whether or not hearing makes appropriate sense.'",
        "'speaker_0': 'Thank you counsel far to just want to respond to counsel clarity counsel here counsel Flaherty asked if. As the original sponsor, would you consider a hearing order, not a resolution. Just want to recognize you. Counsel me here.'",
        "'speaker_6': 'So I don't I solo I have my co-sponsors to help to weigh in. You know, the fact of the matter is that this is something that's happening in the Senate. Right. And this is a resolution on the council floor in support of it.'",
        "'speaker_6': 'Right. That's one. And number two. We did have a hearing in regards to this conversation. So I do think that I just want to honor that that conversation is still being held in my committee. So there might be opportunities in the future to unpack specifically what you're talking about.'",
        "'speaker_6': 'But I just want to be really clear that this is a resolution in support of something that is at the House right now. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Councilman here. Would anyone else like to speak on this matter? Would anyone else like to add their name? Please raise your hand. Mr. Kirk. Please add Councilor Bullock. Councilor Braydon. Console illusion. Councilmember here is seeking suspension of the rules and adoption of Docket 0594.'"
    ],
    "Haitian Heritage Month Resolution.": [
        "'speaker_0': 'All those in favor say aye. Aye, aye. Opposing. The ayes have it. The docket has been adopted. Mr. Clerk, please read docket 05950595.'",
        "'speaker_1': 'Council of Louisiana for the following resolution recognizing me as Haitian Heritage Month.'",
        "'speaker_0': 'Thank you, Mr. Clarke. The Chair recognizes Constitution. Constitution? You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. I am very excited to be writing today in recognition of May as Asian Heritage Month. Actually, Boston is the first place where we started celebrating Haitian Heritage Month in 1998, and it's because of the number of events that happen in the month of May that, you know, that are relative to Haitian history, that'",
        "'speaker_5': 'it became a whole month, including the most. For me, the most important Haitian holiday is our Independence Day, which is on January 1st. What Haiti was able to do when a 13 year slave revolt, the only the only republic born out of a slave revolt.'",
        "'speaker_5': 'That is the most important holiday. But the most celebrated holiday in Haiti is actually May 18th, and it is still a holiday celebrated around the world, in Haiti communities. It's our Flag Day, where we honor Captain Flynn for creating the Haitian flag by essentially tearing up the French flag and creating something new from that which is symbolic'",
        "'speaker_5': 'of everything that Haiti has represented and continues to represent. You know, so much of the hate story of Haiti, as we know, you know, there's a lot of pride, but there's also, you know, a lot of pain. I'm not thinking just about the seven months in which, you know, I was running for city council.'",
        "'speaker_5': 'You know, the things that came up in the assassination of our president. An additional earthquake after continued trauma from the first earthquake that happened in 2010, you know, dodging hurricanes and really and with the political instability in the country, a lot of it being the result of American foreign policy.'",
        "'speaker_5': 'So there's just so much there. And I think, too, about just growing up as a as a young Haitian woman in this city. You know, when I was in elementary school, we didn't have a Haitian Heritage Month, and I was in a school, an elementary school with a large Haitian population.'",
        "'speaker_5': 'But I was not an English language learners class, but I was noticeably Haitian. And my father, who was at the school every day, he's supposed to be here, but he's running late because that's what we do. We really he I couldn't hide the fact that I was Haitian.'",
        "'speaker_5': 'Right. He was always in the school is a very thick Haitian accent when he speaks. And in my classroom, there were other students who were Haitian. But, you know, sometimes they didn't always mention it because they made fun of the Haitian or the Haitian English language learners.'",
        "'speaker_5': 'And as a result of that, they made fun of me in my classroom. And I think about how confusing that was as a young elementary student, not knowing why it was worth making fun of people trying to learn English or why it was worth making fun of people who had dark skin.'",
        "'speaker_5': 'And so when I now as a full adult and now as a Boston city counselor, go into classrooms and go into elementary school rooms, I always remember that little girl who was in those classrooms and who wanted to see someone say.'",
        "'speaker_5': 'It is more than okay to be proud of who you are and of where you come from. And so I'm really happy that I had this opportunity. My father, who just wanted.'",
        "'speaker_4': 'To to other.'",
        "'speaker_5': 'Haitian Heritage Month and to also, you know, honor my dad, who is one of the reasons why I am able to stand here as a very proud Haitian person. He made sure that my sister and I were reading Haitian Creole, we're speaking it, which is a thing that a lot of people can do.'",
        "'speaker_5': 'If you weren't born in Haiti. And so he made me even though it wasn't cool for your dad to make you someone carry your pride, he made me carry the pride of this flag everywhere that I went. And so building on that, we had this whole month where I doing a lot of really awesome programing on the'",
        "'speaker_5': 'USS Constitution Museum in Charleston, actually has original letters from Toussaint Louverture, where he, the Haitian freedom fighter who is the cause and the reason for our freedom, and really showed the example to the world of what enslaved people can be and become and how we could break off the shackles of slavery.'",
        "'speaker_5': 'We are having the Haitian Flag Day parade on on May 15. We'll also this council has actually had a breakfast honoring our Haitian Flag Day every year. And for the first time since we have a Haitian American city councilor, I will be hosting it.'",
        "'speaker_5': 'My announcement for the week, I'm just putting it here, is that I invite all of you to that breakfast happening here next Friday at 10:30 a.m.. I also just want to also recognize the number of Haitians working here in city hall, including my cousin Charlene, who is here.'",
        "'speaker_5': 'I just there's so many of us here, and I think it's important. I always say that the third largest Haitian diaspora is in Boston that is cognizable. It is here in the city of in in city hall and in our hospitals, in our schools, everywhere we are.'",
        "'speaker_5': 'And so I'm just so grateful that I now have this ability to do this, to be a representative for my people. And I know that this hearing was also filed last year by any society George and Andre Campbell.'",
        "'speaker_5': 'So many people here have, you know. We represent communities that are vibrant Asian communities. I think of Council Valley, think of Castro Arroyo. I know that we have many friends here and I just am so grateful for the work that we do not only to, you know, go to Asian communities when they need, you know, when it's'",
        "'speaker_5': 'time to get a vote or, you know, to say that I'm a good friend, but to really do the real work of being in deep partnership with communities that are often struggling. Right. We have folks coming here from the border.'",
        "'speaker_5': 'We have folks who are being displaced by fires. We have Haitian nonprofits that are running on shoestring budgets. We have a diaspora here that is in deep, deep need of having a place where we can be centered and anchored in our culture when things happen.'",
        "'speaker_5': 'So I just thank you all for your commitment to the Haitian community here. I'm into the work that we are going to do together. I'm just going to say this a little bit. Bill Bascom Gabriel Castillo because you've spent considerably more education and I've been to Boston look in L.A. City Hall young film one to excuse me'",
        "'speaker_5': 'Le Couteur by La Avenue minute.'",
        "'speaker_4': 'Corner toot toot.'",
        "'speaker_5': 'Kutumela. What do you miss here when talking with you about this? Are your men and women taking liberty to Kariobangi Newport Tabla and looking to get these women on wharf? It no communication. What can you do that well somebody's awesome their kids may poop I love it really scares me if you poo I'm pretty junior so I'",
        "'speaker_5': 'just want to say thank you to everyone and thank you to my council colleagues. I hope to see you all next Friday at the breakfast and thank you for the work that you do for me and my people.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Council, John. And on behalf of the body, we also want to welcome you out here. We're proud we're proud to have you here as well. Welcome. The chair recognizes counsel. Have clarity. Counsel clarity. View of the floor.'",
        "'speaker_0': 'Please add my name to this resolution as the very first sponsor of that breakfast that passed that are working within our mind to see it back in the day passed it on to former counsel Rob Consalvo, who passed it on to former counsel to McCarthy, who passed it on to our colleague Ricardo Arroyo, who obviously passed it'",
        "'speaker_0': 'on to our first Haitian-American here and roots in Louisiana. So I appreciate the on to come along to that breakfast, but also to her dad. We may want to cook him up with Kerry because he came in a little late after for a speech.'",
        "'speaker_0': 'So we may able to get him the full tape working through central staff so that he didn't miss the he didn't miss all the action. All right. Thank you, Mr. President. Great, great recommendation, counsel. Clarity. Thank you. The chair recognizes Counselor Arroyo, Counsel Arroyo of the fall.'",
        "'speaker_2': 'Thank you, Counselor. Louisiana. You know, the country of Haiti is really a beacon for the world in the way in which they were formed in a slave revolt successfully. And much of the trauma and harm that Haiti has experienced has been the result of foreign policy, frankly, from places like the United States of America, which at the'",
        "'speaker_2': 'time were slave owning and had slave owning leadership that saw Haiti as an existential crisis. And so there's many different ways in which I think we can raise our voice to ensure that we are. We're leaving them, frankly, of the harm that has been done in all of our names.'",
        "'speaker_2': 'And I know one of the ways in which we can do so as well is pushing for the repayment from France to Haiti, for the debt in which they have incurred upon Haiti, which it was fully paid, which was for themselves.'",
        "'speaker_2': 'Haiti, upon their liberation, was imposed a debt from France where they were to pay for their own freedom, and that should be returned tonight. And I'd raise my voice to that. And I will say that as we have the privilege and the benefit of a large Haitian population here in Boston, I believe that the district with the'",
        "'speaker_2': 'most members of the Haitian diaspora in the city of Boston, the breadth of service that has come from that, the culture and in the ways in which they have lifted up our small businesses have joined in and been parts of our community and making them better and in bringing in soccer leagues and doing all of these different'",
        "'speaker_2': 'things that have created a better day to day for all members of our city. I'm grateful to them. I'm grateful for their spirit, for their resilience and for their pride and where they come from, both from a historic way, from a personal way, from their homeland, but also in the ways in which they uphold their culture and'",
        "'speaker_2': 'their tradition so proudly for all the rest of us who are members of different diasporas to see. And so I'm very grateful to counsel Louis Gen for raising this. I am in full throated support of this, so please add my name and I'm grateful to our Haitian community here in Boston for all that they do and for'",
        "'speaker_2': 'the country of Haiti, for all they have done for other countries like the one that my parents come from, who have also grappled with colonialism and with imperialism, and in that specific case, the the ultimate sin of of slavery.'",
        "'speaker_2': 'And so thank you for for that. And thank you to all Haitians for uplifting their country here at home. So thank you, Counselor.'",
        "'speaker_0': 'Flynn Thank you, counsel. While the chair recognizes counsel to counsel. COUNSEL Larry, you have the foster.'",
        "'speaker_7': 'Okay. Thank you, President Flynn. I think Counselor Fernandez Anderson was before me, but she very graciously gave me her spot. I wanted to rise in support of this and to thank Counselor Lujan for filing it. I've said this before and I want to say this again that black people all across the diaspora in this entire world, all'",
        "'speaker_7': 'the people of Haiti, a great debt and that we are where we are now because of their fervor and because of their fight for liberation. And I also want to stand because I think it's incredibly important to publicly show support as a woman from the Dominican Republic.'",
        "'speaker_7': 'I think that. You know, what we have seen happening on the Dominican and Haitian border in the past few years has been unconscionable. And I think that as people of the Dominican diaspora here in the United States, we have a responsibility to stand in solidarity with the Haitian people.'",
        "'speaker_7': 'And with your permission, I would like to speak in Spanish to the Baron in terms of for your resolution that they need the assets of Mr. Mario a mr. Patrimonial is also a story. Is that resolution the lack of seclusion for you in the Dominican at the end, rather that they are saying in solidarity that it's a'",
        "'speaker_7': 'las personas, the idea of establishment of those eating with straw. So thank you for filing this and please add my name.'",
        "'speaker_0': 'Thank you, counsel. Ira. The chair recognizes Counsel Fernandez innocent. Counsel Fernandez innocent. You have the floor.'",
        "'speaker_4': 'Well, we just going to make this multicultural, whatever, because I'm both so I'm. I'm publisher. Is your comment separate on power, Robert, not hold back, huh? Well, that well, they're massive for everything that you do for our Rosa.'",
        "'speaker_4': 'I always say when I met your dad, I told him, I said, you know, you carry all manageable, fancy, suitable, fancy and manageable control. But she but he was like, okay, you know, it doesn't matter. You're speaking it.'",
        "'speaker_4': 'We understand. Let's go. So I really I really love you, dad, and appreciate you watching this. And during the campaign, I would tell the people the same thing. I'll be like, hey, you're my cousins because y'all left covered right.'",
        "'speaker_4': 'West Africa went and it being or Cuba as well being one of the first islands to land. So literally, we eat your food. Thank you for your zouk. I know cassava is not Haitian, but still it's your culture and thank you for your food.'",
        "'speaker_4': 'Keep word being that it's a very new civilization or in terms of post-colonial. We didn't have TV, we didn't have music. We have a lot. So we benefit from your culture and we dance your music and your food and your traditions, or rather what you left behind.'",
        "'speaker_4': 'So messy for being here, for being president. But I also think that, you know, I literally just watched the documentary again because I love watching it again and again and again to remind me that how we have the strength to be able to fight.'",
        "'speaker_4': 'But I have great respect for the Haitian people, for their strength, for just a story and how they really showed the world and being the only one to fight a colonial colonialism. So shout out to Toussaint Louverture, as you said, and thank you so much for being here.'",
        "'speaker_4': 'And I would hope that in the way that I treat you, in the way that I interact with you is exemplary in how I respect you and love you. So I'm good to you for that reason because you are a priority for me.'",
        "'speaker_4': 'Thank you. Love you.'",
        "'speaker_0': 'Thank you. Counsel Fernandez Anderson, the chair recognizes. Counsel me here, counsel me here. You have the floor.'",
        "'speaker_6': 'I am so incredibly happy to have our first and I hope will not be our last Haitian representation here on the city council. So thank you, Counsel Louisiana, for everything that you do, not only to just amplify the voices of our people, but to also continue to fight as hard as you do.'",
        "'speaker_6': 'Thank you. I just wanted to share the same sentiments as counsel. A lot of you know, I always talk about being an Afro Latina and reclaiming my black roots. Right. I think that Dominicans really struggle with recognizing that we share the island of.'",
        "'speaker_6': 'Yeah. And that this is an opportunity for us to really as Dominicans to really lean into this conversation that we're here because of you. And I think that's really hard for a lot of Dominicans to to digest that.'",
        "'speaker_6': 'I actually met your dad even before I was even thinking of running and when I was advocating a deep collaboration with the Haitian community during the earthquake, because there was a lot of tension with Dominicans and Haitians here in the city of Boston.'",
        "'speaker_6': 'And I think that this solidarity needs to just be here on this council floor. But we need to work in collaboration and bring our communities together to recognize that we need each other and we need to continue to fight for one another.'",
        "'speaker_6': 'And I do so in the spirit alongside you, Councilor Lucian, for this day and every day. Thank you. And please sign my name.'",
        "'speaker_0': 'Thank you, Councilman. Here. The chair recognizes counsel Braden. Counsel Braden. Thank you.'",
        "'speaker_4': 'Thank you, Mr. President. And thank you, counsel Louisiana, for this celebration of Haitian Heritage Month. You know, you've met my nephew, Jamin, and he's a very tall, handsome black man who came from Port au Prince as a very little child.'",
        "'speaker_4': 'His mom is from Haiti, and she's married to my brother in law, Henry McCarthy. And they live in New Orleans. And my association with that family and by extension, the Haitian community is limited in many, many ways. But I just one thing that impresses me is the incredible tenacity, perseverance and courage of the Haitian people in the'",
        "'speaker_4': 'in the in the face of so many recurrent and sequential challenges, natural disasters, political strife and political unrest over the last year of the history of the over the history of the nation. And I'm very honored to consider you a friend and colleague on the Boston City Council, the first Haitian woman you walk in, you following in'",
        "'speaker_4': 'the path of a few other very strong and remarkable Haitian women in politics in Boston. And I'm so honored to have you as a friend and colleague. So I wish all the folks in the Haitian diaspora here in Boston a very happy celebration of Haitian Heritage Month.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Counsel. The chair recognizes counsel. Earl. Counsel Earl. You have the floor.'",
        "'speaker_3': 'Thank you, President Flynn. And thank you to counsel Louis Gen for bringing this to the floor. I'm in support of this resolution, and I just want to. Let's also add that, you know, just like the Haitian community, you know, setting the example of being resilient fighters and preserving through all the turmoil that they have gone through, you'",
        "'speaker_3': 'know, you know, Counsel Louis Jean brings that fighting spirit to the city council. And I'm a big fan of the culture, just like Councilor Tang and Anderson has said, you know, typically these that Copa music. And I'm looking forward to celebrating the culture on Haitian Flag Day.'",
        "'speaker_3': 'And I also know what it's like to have very prideful parents, me being a West Indian, it's one thing that, you know, your parents are always happy for you when you're, you know, doing doing the smallest thing sometimes or, you know, even to this height, you know, recognizing your culture.'",
        "'speaker_3': 'And it. Jamaicans also have a slogan that says, out of many, we are one. So it's in that collaborative effort that I look like to be united with the Haitian community in my district to kind of move things forward.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Counsel world. The chair recognizes Constitution. Constitution? You have the.'",
        "'speaker_5': 'Floor. Yeah. Sorry, I'm not going to take that. I just want to say thank you to all my colleagues for your kind words. Sometimes we sit here, we pass these resolutions, and we're like, What is it doing right?'",
        "'speaker_5': 'I just want to say that I will. I tell people that no city council is recognizing Haitian Heritage Month. We passed a unanimous resolution. So God willing. Right. And they just stood up. It just the joy for folks who for so long have been excluded, who are downtrodden, who have been forced to.'",
        "'speaker_5': 'When you go into this resiliency. Well, and I just think that like these small, they seem small. But it really does matter to a lot of people. You know, when I was in Kansas and Anderson was here recognizing, you know, and fighting for it as a holiday, what that when I looked around at, you know, the Muslim'",
        "'speaker_5': 'folks in this room and how much that meant to them, it's the same thing. So I just am so honored to have all of you speak so, so, so nicely about the Haitian community here and hope that that also translate to the work that we have to do.'",
        "'speaker_5': 'So thank you, Ms.. Champion. KIMBALL And the benediction. May God bless everyone.'",
        "'speaker_0': 'Thank you, counselors and anyone else I'd like to speak. I would like to add that I'm also proud to. Sign on to this because of the incredible contributions and sacrifices of the Haitian and Haitian American community here in greater Boston is with the constitution several months ago out in front of the federal building where we will be'",
        "'speaker_0': 'protesting in support of fair immigration for for the Haitian community that came to here came to the United States during the earthquake in 2010, 2010. And I was only I was about 80 miles away from that earthquake when it when it hit.'",
        "'speaker_0': 'No. And I was part of the I was part of the. Relief team. But I just wanted to say the the resilience of the Haitian community here in our country is exceptional and they are tremendous tremendously to Boston answered into the United States.'",
        "'speaker_0': 'So happy to sign on as well. Anyone else like to sign on? Please raise your hand. Mr. Clarke, please add Councilor Baker. Council Councilor. Bar Council Operating Council. Flowery. Also our council here. Council. Murphy Council. We're all in the chair.'",
        "'speaker_0': 'Um. Constitution is seeking suspension of the rolls and adoption of dockets. 0595. All those in favor say aye. Aye. Opposed saying the ayes have it. The docket has passed. We arrived too late. Files. I am informed by the correct that there are zero eight files.'",
        "'speaker_0': 'Since we are onto green shoots, anyone wishing to remove a matter from the green sheets may do so at this time. The consent agenda. We're now moving on to the consent agenda. I have informed by the clerk that there is one addition to the consent agenda agenda.'"
    ]
}