{
    "Home Rule Petition for Affordable Housing in South Boston.": [
        "'speaker_1': 'All those in favor of approving the meetings from the last meeting say I opposed. Say nay. Thank you at the meeting. The minutes of the last meeting stand as approved. Communications from the Toronto the mayor. Mr. Kirk, can you please read docket.'",
        "'speaker_2': '07070707 message in order for your approval? A Home Rule petition to the General Court entitled Petition for a Special Law enacted relative to certain affordable housing in the South Boston section of the City of Boston.'",
        "'speaker_1': 'The chair recognizes Council Arroyo, Chair of the Committee on Government Ops Counsel. Arroyo You have the floor and you can present Flynn.'",
        "'speaker_8': 'As chair of the committee. Could 0707 today. This Home Rule petition seeks to allow the Boston Housing Authority to take part in the redevelopment of the Mary Ellen McCormick developments using federal funds. Previous reforms to the Commonwealth contracts and procurement and award laws do not allow a path forward for the VHA to participate in this redevelopment effort'",
        "'speaker_8': '. Without the development, this project could be struck with an overly structured bid process, meaning would have a separate general contract and subcontractor selection. And I believe this would not be a fair and transparent process for the city. In the past, the VHA has filed similar legislation, namely for the Whittier Street, Bunker Hill, Orchard Gardens, Mildred C, Haley'",
        "'speaker_8': 'Aurion Heights and Franklin Hill. Family Developments. The passage of this docket today would ensure the residents of Marilyn McCormick, a fair and transparent process, will revitalize in the current development. Due to the matter of urgency with the state legislature ending their sessions in July as chair of Government Operations Committee, I seek suspension of the rules to pass'",
        "'speaker_8': '0707 today so that we can get it up there before they end their session in July. But I am more than happy to, and I've been told by the administration they're more than happy to once we get to the procurement process.'",
        "'speaker_8': 'Part of this is to have a hearing to discuss that path forward. But this allows them to do that. Thank you.'",
        "'speaker_1': 'Thank you. Counsel. Royal counsel. Royal seek suspension of the rules. Okay. The chair recognizes counsel, clarity. Counsel for the office support the chair in this effort. I served as Chair of Government Operations and led the effort to do the previous ones that he had mentioned also was born in the old have a project which is the Mary'",
        "'speaker_1': 'Ellen McCormick. And that development is in dire need of a rehab and revitalization as well as the opportunity to build additional housing there. So look forward to having this expedited and obviously get the briefing as soon as possible to get the update as to where they stand.'",
        "'speaker_1': 'Thank you. Mr.. THAT Thank you, Counsel. Clarity. The Chair recognizes counsel and counsel. You have the floor.'",
        "'speaker_9': 'Thank you, Mr. President. I also wanted to rise in support of the Chair's recommendation. When I worked at the Housing Authority to chase these specific types of home rule petitions through the State House, and they are totally critical to the revitalization of public housing.'",
        "'speaker_9': 'It has to do with the fact that the law is written in a way where if you're paving a road, great, and it's designed to help us get the lowest price on paving the road. But the kind of iterative process that we do with our housing communities around exactly how we want them to take shape, basically, this'",
        "'speaker_9': 'fails the bid process prevents the kind of the kind of adjusting of the program over time that we want to see. So it's important for the housing authority to have the flexibility that the home rule petition creates. And I would say that it tends to take a little while to get them through the state legislature.'",
        "'speaker_9': 'So I think time is of the essence. Thank you.'",
        "'speaker_1': 'Thank you, Counsel. The chair recognizes Counselor Baker. Counsel Baker, you have the floor.'",
        "'speaker_8': 'Thank you, Mr. President. I just rise in support of this. As you know, Marilyn McCormack is in my district. We've been talking about the the redo of Mary Ellen McCormack for a couple of years now. This this actually makes it real.'",
        "'speaker_8': 'So we just wanted to show my support. Thank you.'",
        "'speaker_1': 'Thank you, Counsel Baker. I'd also. Echo what Councilor Baker and. Council clarity and my colleagues council and council Bach as well. Council royal and but especially thanking council baker and council of clarity for the work you do with the residents.'",
        "'speaker_1': 'And Mary Ellen McCormack. It's an important development that wonderful people. So I want to say thank you to Councilor Baker council floury and the team for the important work that you're doing. Councilor Royal. Seek suspension of the rolls and passage of docket 0707.'",
        "'speaker_1': 'All those in favor say I am opposed. Say they have it. The docket has passed. Mr. Carr, can you please read Dawkins 07080708.'"
    ],
    "Grant for Forensic Science Training and Education for Police Department.": [
        "'speaker_1': 'Thank you, Mr. Clarke. Docket 0708 will be assigned to the Committee on Housing and Community Development. Mr. Clarke, can you please retarget.'",
        "'speaker_2': '0709.0709 message in order authorizing the City of Boston to accept and expand the amount of $34,309 in the form of a grant for the Federal Fiscal Year 21. All Coverdell Forensic Science Improvement Formula Allocation awarded by the United States Department of Justice.'",
        "'speaker_2': 'Please pass through Massachusetts State Police and crime lab battery to be administered by the police department. The grant will fund training and continuing education for forensic examiners, criminalist and laboratory personnel.'",
        "'speaker_1': 'Thank you. The chair recognizes Counsel Flaherty, chair of the Committee on Public Safety, Criminal Justice Counsel. Flaherty. You have the floor. Thank you, Mr. President. Somewhat of a minus grant for the forensics division and looking forward to suspension and passage to get these very necessary funds over to the lab.'",
        "'speaker_1': 'Thank you, Mr. President. Thank you. Counsel. Clarity. Counsel, clarity. Seek suspension of the rules and passage of docket 0709. All those in favor say aye. Aye. Opposing. The ayes have it. The docket has passed. Mr. Carr, can you please read docket 0710 and 0711 together, please?'"
    ],
    "Approval of Constable Bonds of 20 Individuals.": [
        "'speaker_1': 'Thank you, Dorcas 0720. Besides the Committee on Planning, Transportation Development, Mr. Kirk. Please read Dr. 0721.'",
        "'speaker_2': 'Number 0721. The County Constable Bonds of James Darby. Sheila Darby. William McQueen. Michael Janus. James Burke. Frank Privett. Russell Castagna. George Reece. Lucier McLean. McLean. Robert Masina. Michael Lopes. William Doniger. Mark Kominsky Gabriel as a book and Whiskey Machado, Giovanni Colon, Derek Hughes, Tyrone Grant, Nikola Twitter and Keith Christiansen has been.'",
        "'speaker_2': 'Duly approved and received by the collector. Treasurer.'",
        "'speaker_1': 'The. The chair recognizes counsel, clarity, counsel, clarity of the floor for suspension and passage of docket zero 7 to 1. Obviously, service process in the city is essential and these individuals obviously have been duly approved and their livelihoods and businesses depend on it, asking for suspension and passage so we can get them their licenses and get them'",
        "'speaker_1': 'out there. Thank you. That could. Docket. Docket 0721 is approved under usual terms and conditions. Reports of committees, Mr. Kirklees retorted. 0487205012. The police. Take some.'",
        "'speaker_2': 'Docket number 0487 the Committee on Ways and Means, to which was referred on April 13, 2020 to Duck. And then enough docket number 0487 message in order authorizing a limit for the Boston Public Schools Revolving Fund for fiscal year 2023 to support the maintenance and repair of facilities, including custodial and utility costs for extending building time, floor'"
    ],
    "Boston Police Department Revolving Fund for Canine Unit Training Program.": [
        "'speaker_2': 'instructional software. This revolving fund shall be credited with any and all receipts from equipment, sales and repair fees for Boston Public School technology. Receipts and resulting expenditures from this fund shall not exceed $2 million. Submits a report recommending the order to pass docking of a0490.'",
        "'speaker_2': 'The Committee and Ways and Means, to which was referred on April 13, 2020 to Dorking Number 0490. Message In order authorizing a limit for the Boston Police Department Revolving Fund for fiscal year 2023 to support the K9 units training program for officers and police dogs from non city of Boston law enforcement agencies.'",
        "'speaker_2': 'The Special Operating Division will charge tuition and other fees to outside law enforcement agencies for the K-9 unit. The tuition and other fees by outside agencies will be used to purchase training equipment, certify instructors, update facilities and provide funds for other training needs not otherwise budgeted.'",
        "'speaker_2': 'The Special Operations Division will be the only unit authorized to expend from the fund, and such expenditures shall be capped at $125,000. Submits a report recommending that the order are to pass. Lucky number 0491 The Canadian Ways and Means to which was referred on April 13, 2022.'"
    ],
    "Distributed Energy Resource Revolving Fund for FY 2023.": [
        "'speaker_2': 'Lucky number 0497. The Committee on Ways and Means on Ways and Means to which was referred on April 13, 2020 to Dr. Number 0497. Message in order authorizing and limit for the Distributed Energy Resource Revolving Fund for fiscal year 2023 to facilitate the purchase of US offsets of greenhouse gas emissions, which shall be associated with a portion'",
        "'speaker_2': 'of the electricity consumed by the city.'",
        "'speaker_8': 'Annually.'",
        "'speaker_2': 'And to operate, maintain, monitor and expand the city's existing solar arrays. In Boston, public schools combined heat and power facilities. This revolving fund shall be credited with any and all receipts from the sale of renewable and alternative energy certificates and demand response program revenues produced by combined heat and power units located at Boston Public School sites and'"
    ],
    "Environment Conservation Commission Revolving Fund for FY 2023.": [
        "'speaker_2': 'solar renewable energy certificates produced by the city's photovoltaic arrays. Receipts and resulting expenditures from this fund shall not exceed $150,000, cements a report recommending that the order of the pass doc number zero 490, the Commission Committee on Ways and Means, to which was referred on April 13, 2020 to number 049, a message in honor of the raising'",
        "'speaker_2': 'and limit for the Environment Conservation Commission Revolving Fund for fiscal year 2023, for the purpose of securing outside consultants including engineers, wetlands, scientists, wildlife biologist and other experts, in order to in to aid in the review of proposed projects to the Commission.'",
        "'speaker_2': 'Per the city's ordinance protecting local wetlands and promoting climate change adaptation, the revolving fund shall be funded by receipts from the fees imposed by the Commission for the purpose of securing outside consultants. The Environment Department Department will be the only department authorized to expend from the fund, and such expenditures shall be capped at $50,000.'",
        "'speaker_2': 'Submits a report recommending that the order or surpass the numbers 0499 The Canadian Ways and Means to which was referred on April 13, 2022. Docket number 0499 Message in order approving an appropriation of $500,000 from the city's Boston Equity Fund to create a special revenue project grant in order to support equity applicants and licensees as defined by'"
    ],
    "Appropriation of PEG Access and Cable Related Fund for Cable Related Purposes.": [
        "'speaker_2': 'Chapter eight, Section 13 Establishing the equitable regulation of the cannabis industry in the City of Boston Submits a report recommending the order to pass docket numbers 0500 the Committee and Ways and Means, to which was referred on April 13, 2020 to number 0500 message in order approving an appropriation of $4,560,000 from the 21st Century Fund, also known'",
        "'speaker_2': 'as the public, educational or government. Pig Access and cable related fund pursuant to section 53 of three quarters of Chapter 44 of the General Laws to the PEG Access and cable related grant for cable related purposes, consistent with the franchise agreement between the cable operator and the city, including but not limited to one supporting public educational governmental'"
    ],
    "Appropriation of Parkman Fund Income for Boston Common and Parks.": [
        "'speaker_2': 'access cable television services to monitoring complaints of cable operator with the franchise agreement. Three Preparation of renewal of the franchise license. Submits a report recommending the order pass and docking numbers 0501 The Committee and Ways and Means to which was referred on April 13, 2022.'",
        "'speaker_2': 'Numbers 0501 message in order authorizing the appropriation of $1,400,000 from the income of the George Francis Parkman Fund, the funds are to be expended under the direction of the Commissioner of Parks and Recreation for the maintenance and improvement of Boston Common in Parks in existence since January 12, 1887, submits a report recommending that the order ought to'",
        "'speaker_2': 'pass.'",
        "'speaker_1': 'Thank you, Mr. Kirk. You're welcome. The chair recognizes Counselor Fernandez and a chair of the Committee on Ways and Means Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_5': 'Thank you. Mr. President, these dockets represent revolving funds and other annual appropriations that are related to the city's budget, including the apartment fund, peg access fund and the equity fund. We heard some of these funds together with relevant departments and received testimony on all of them.'",
        "'speaker_5': 'These are standard annual appropriations and our sources of external external funding that don't come from the city's tax dollars. So I recommend passage of all 15 dockets. Thank you.'",
        "'speaker_1': 'Thank you. Councilor Fernandez Anderson. We will now take a vote on each of these dockets separately. Councilor Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report and passage of Docket 0487.'",
        "'speaker_1': 'All those in favor say aye. Aye. All opposed say no. The ayes have it. The docket is passed. Counsel Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passage of Docket 0488.'",
        "'speaker_1': 'All those in favor say aye. Aye. Opposed. The ayes have it. The docket has passed. Councilor Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report and passage of Docket 0489. All those in favor say aye.'",
        "'speaker_1': 'Aye. Opposed nay. The ayes have it. The docket has passed. Counsel Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passage of Docket 0490. All those in favor say aye. Aye, aye.'",
        "'speaker_1': 'Opposed. The ayes have it. The docket has passed. Council Fernandez Anderson, a chair of the Committee on Ways and Means, seeks acceptance of the committee report, the opposite of Docket 0491. All those in favor say aye. Aye. Opposed say no.'",
        "'speaker_1': 'The ayes have it. The docket has passed. Counsel Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passage of Dawkins 0492. All those in favor say aye. Aye. All opposed nay.'",
        "'speaker_1': 'The ayes have it. The docket has passed. Council Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passage of Docket 0493. All those in favor say aye. Opposed Nay. The ayes have it.'",
        "'speaker_1': 'The docket has passed. Council Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report passage docket 0494. All those in favor say aye. Aye. Opposed Nay. The ayes have it. The docket is passed.'",
        "'speaker_1': 'Council Fernandez Anderson, the chair of the Committee on Ways and Means six six acceptance of the Committee Report Passage of Docket 0495. All those in favor say aye. Aye, aye. Opposed nay. The ayes have it. The docket has passed.'",
        "'speaker_1': 'Council Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Garcia 0496 All those in favor say aye aye opposed. And the ayes have it. The docket has passed. Counsel Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report.'",
        "'speaker_1': 'Passage of Docket 0497. All those in favor say aye. Aye. Opposed May the ayes have it. The docket has passed. Council Fernandez Anderson, the chair of the committee and weighs main seeks acceptance of the committee report passage of Docket 0498.'",
        "'speaker_1': 'All those in favor say aye. Aye. Opposed nay. The ayes have it. The docket has passed. Council Fernandez Anderson, the chair of the committee Ways and Means, seeks acceptance of the committee report. Passage of Docket 0499. All those in favor say aye.'",
        "'speaker_1': 'All opposed nay. The ayes have it. The docket has passed. Council Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passage of Docket 0500. All those in favor say aye. Aye, all opposed.'",
        "'speaker_1': 'And the ayes have it. The docket has passed. Counsel Fernandez Anderson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report passage docket 0501. All those in favor say aye. Aye. Opposed nay. The ayes have it.'",
        "'speaker_1': 'The docket has passed. The docket has passed. Before we go on to matters recently heard from possible action, which are the budget which are the budget votes? I want to take talking zero 7 to 2 out of order, which is a hearing order from Councilor Carter, and she will be making her maiden speech.'",
        "'speaker_1': 'Yeah. Mr. Clarke, please read docket zero 7 to 2 and to the record.'"
    ],
    "Capital Budget Appropriation for Various City Departments and Projects.": [
        "'speaker_2': 'Motor vehicles and trailers. Ambulances. Firefighting equipment. Office equipment. Telecommunications equipment. Photocopying equipment. Medical equipment. School and educational equipment. School busses, parking meters. Street lighting, installation, traffic signal equipment and equipment functionally related to and components of the foregoing. Filed in the office of the City Clerk on April 11th, 2022, and docket numbers 0485.'",
        "'speaker_2': 'Message in order approving an appropriation of 500 $550,370,000 for the acquisition of interest in land or the acquisition of assets or the landscaping, alteration, remediation, rehabilitation, improvement of public land, the construction reconstruction, rehabilitation improvement, alteration, remodeling, enlargement, demolition removal or extra ordinary repairs of public buildings, facilities, assets, works, or infrastructure for the cost of feasibility studies or'",
        "'speaker_2': 'engineering or architectural services for plans and specifications for the development, design, purchase and installation of computer hardware or software and computer assisted. Integrated Financial Management and accounting systems. In any and all cost incidental or related to the above described projects for the purposes of various city departments, including Boston Center for Youth and Families, Department of Innovation and'"
    ],
    "Appropriation for Boston Public Schools Projects and Services.": [
        "'speaker_2': 'Technology, Environment, Fire, Neighborhood Development, Office for Arts and Culture. Parks and Recreation. Police. Property Department. Property Management. Public Works and Transportation Departments. Boston Public Library. Boston Redevelopment Authority and Public Health Commission filed in the Office of the City Clerk on April 11, 2020 20486.'",
        "'speaker_2': 'Message in order approving an appropriation of $138,535,000 for the acquisition of interest in land or the acquisition of assets or the landscaping, alteration, remediation, rehabilitation or improvement of public land for the construction, reconstruction, rehabilitation, improvement, alteration, remodeling, enlargement, demolition removal or extra ordinary repairs of public buildings, facilities, assets, works, or infrastructure for the cost of fees, feasibility'",
        "'speaker_2': 'studies or engineering or architectural services for plans and specifications for the development design, purchase and installation of computer hardware or software and computer assisted integrated financial management and accounting systems and any and all costs into incidental or related to the above described projects for the purposes of the Boston Public Schools filed in the Office of the City'",
        "'speaker_2': 'Clerk on April 11th, 2022.'",
        "'speaker_1': 'Thank you. The chair recognizes Counsel Fernandez Arneson, chair of the Committee on Ways and Means. Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_5': 'Q Counselor. President Flynn. Mr. President. I'd like to request that we move Docket 0480 to the end of the list and take docket 048120486. First, with the counsel indulgence. I will speak on all dockets collectively and then return to remarks on individual docket.'",
        "'speaker_5': 'You should have all of you should have five committee reports at your desks.'",
        "'speaker_1': 'Yes, that's. That's. That's fine. Thank you, Counselor Fernandez. And sent you over the phone.'",
        "'speaker_5': 'Thank you. Well, it's been quite a budget process, but here we are with some daylight before us. We have all done a lot of work over the last couple of months, and I salute all of you and your passion and patience.'",
        "'speaker_5': 'Before I go any further, I want to shout out to my team to whom who are integral to getting us to this point. My sincere gratitude to Amena, Scott, Joshua McFadden, Arlene Mercury and Colombo for working so hard behind the scenes, which allowed me to properly out face with you guys.'",
        "'speaker_5': 'A huge thank you to Michelle Goldberg with Michelle. Yes. It's. For her efficiency, tenacity, humility and professionalism. Thank you to Carrie Jordan, Juan Lopez, Lorraine Schettino, Ashley Purcell, Candice Morales, Ron Cobb, Christine, Megan, Joe, Lady, and of course, especially Miss Quorum on Tron for all that they do in keeping us informed and making this process work.'",
        "'speaker_5': 'And now for Boston Public Schools. For our Boston Public Schools. I feel they need to continue in order to continue in order for us to or our support in order for them to continue. Yes, there are improvements to be made and discussions to be had.'",
        "'speaker_5': 'But our students have a variety of needs and you don't meet these needs by reducing a budget, and yet there is surely work to be done. We need to continue to diversify our teachers workforce. Our schools are predominantly students of color, while our teachers are still largely white.'",
        "'speaker_5': 'It is imperative that our black and brown youth see more pedagogies and who look like them and who have lived in the experiences that are integral integral to their lives. Additionally, all of our youth need more mental health support, more addiction counselors, more librarians, more teachers, more music teachers, more afterschool programs, and more athletic opportunities.'",
        "'speaker_5': 'So let us support our most precious resource, our young, by funding and supporting the schools they attend in appropriate manner. I realize that some of my council colleagues and historically have rejected without prejudice and I welcome conversations and comments.'",
        "'speaker_5': 'Again, I re-emphasize that we have much work to do in order to for BPC to bring their services up to standards, the standards that our young deserve. And again, welcome your comments. Docket 0481. Is one of the several dockets that comprise the city's total operating budget and is a prop and appropriation order for BEPS for FY 23'",
        "'speaker_5': 'in the amount of 1.33 billion. This FY 23 budget includes a 400 million increase in funding over our FY 22 to exceed a third year of three to exceed the year of three year 100 million. Commitment made to Boston schools in 2020.'",
        "'speaker_5': 'Investments in FY 23 operating budget include 6.6 million, four new social workers, school psychologists and guidance counselors to build out coordinated, multi-tiered systems of support for students and their families. 26.7 million directly to schools to ensure equitable access to vital student programs and services.'",
        "'speaker_5': '5.5 million to expand access to libraries and invest in inclusive library collections and materials. 6.8 million and operations. Improvements and expanded organizational capacity for transportation, food and nutrition services and facilities maintenance repairs. 3.8 million to increase access to mass core at the secondary level and access to more physical education, art, music, and academic enrichment.'",
        "'speaker_5': 'Creating high quality, rigorous and ethically and culturally responsive curriculum and instruction. And. 2.6 million. To expand language access with transition translations and interpretations for school meeting and materials. The FY 23 operating budget also includes a proposed $16 million increase for charter school students totaling public education funding for FY 23 at $1.6 billion.'",
        "'speaker_5': 'Public education spending remains over 40% of the city's budget, and per pupil spending at veeps will reach $27.20 sorry, $27,100, an increase of $3,600 over last year. And so as Chair of Ways and Means, I recommend that this docket ought to pass.'",
        "'speaker_1': 'Thank you, Counsel Fernandez Anderson. Would anyone else like to speak on this stock? And this is docket 0481. The chair recognizes. Counselor, me here. Counsel me here. No, that's okay. I'm going to go to counseling here. Counsel me here.'",
        "'speaker_1': 'You have the floor.'",
        "'speaker_7': 'Thank you, President Flynn. And a thank you to the chair for shepherding us through such a whirlwind of budget conversations. And one of the things that I always kept saying in the budget hearings is don't bring me any more PowerPoint, and you hold them accountable to making sure that they talked about the return on investment.'",
        "'speaker_7': 'So I really do appreciate your leadership in that space. And I'm not here just only as the chair of education, but also a graduate and a parrot. And everyone in politics likes to talk about what, you know, the critical moment that we happen to find ourselves in or major turning points.'",
        "'speaker_7': 'And it tends to get overused. But when it comes to BEPS, it's really true. Think about all of the upcoming changes going on in our Boston Public Schools. We're working towards creating a an elected school committee. We're expecting a new superintendent.'",
        "'speaker_7': 'And of course, the issues of state receivership still looms over our heads. So all eyes are on us at this moment. And while the chaos and the politics happens at the top, it's the people at the bottom who are experiencing the ripple effects of our decisions.'",
        "'speaker_7': 'I know this because our office has visited and spoken with educators and students from across the district. We have seen firsthand how our educators are working their magic in classrooms to mold a generation of compassionate, curious and well-rounded students to go from those schools.'",
        "'speaker_7': 'Seeing educational excellence at work to go into administration budget hearings can give you a little bit of whiplash because there always seems to be a disconnect between the decisions that are being made at the top and the impact that they'll decisions have on everyone, not just overall.'",
        "'speaker_7': 'What we are spending our tax dollars on this year and BEPS is in alignment with the goals that we have for our students. We're seeing more money for ELL students, more money for special education. Fewer schools are seeking a decrease, are seeing a decrease in funding.'",
        "'speaker_7': 'And when we went out and spoke to educators and students across the district, many of their concerns from mental health to other support services are seeing an increase in funding this year. With that being said, there's still a number of areas that are of concern to me when it comes to capital planning.'",
        "'speaker_7': 'We need to see greater strategic vision in cases like the Shaw School. We still don't have a just a decided upon plan on how to support the sixth grade option there. I'm also not satisfied with how we're using our equity and opportunity gap tools to make decisions for our district.'",
        "'speaker_7': 'There are lots of areas that we can do better. The funding is there, but it's never a matter of how much money we're spending. I want to stand up here and say that we need to see more investments in this or that.'",
        "'speaker_7': 'But at this point, it's not a matter of investments. So I want to be clear that I'm planning on voting in favor of the budget. Absolutely. But I don't think it's fair to say that someone who votes against the budget is opposing public education and someone who votes in favor of the budget is in favor of doing'",
        "'speaker_7': 'business as usual. So I just think it's really important for us to to recognize, you know, that this moment is crucial. And as the chair of education, I take that role to heart. And I'm looking forward to this year really looking at how we can support our Boston public schools to get to where they need to be'",
        "'speaker_7': '. But it's going to take all of us working together to make that happen. And so I am supporting the passage of the budget with the caveat of knowing that I'm going to be watching it as a hawk for the next year, but also holding myself accountable to what we need to do as a council to support them'",
        "'speaker_7': 'in achieving their goals. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Here, the chair recognizes Counselor Murphy. Counsel Murphy over the floor.'",
        "'speaker_6': 'Thank you, Councilor Flynn. So I stand, as you all know, as a former teacher, student and parent. But I don't have many good reasons to pass this $1.33 billion school budget. Our return on investment is low, with declining enrollment, poor reading levels, an increase in violence, and the inability year after year to properly service our most vulnerable'",
        "'speaker_6': 'students who are on IEPs and receive ESL services. Those were my students for many years. We even struggle with the basic operations such as transportation and food services. And we all know how I feel about the dismal amount we invest in our school athletics, which, if properly funded, can provide the opportunity for so many of our children'",
        "'speaker_6': 'to participate in team sports and build the physical and mental health that in strength that we know they need. And you mentioned, Councilor Anderson, that they've increased to $27,000 per student, more than that. And we're still spending less than $100 per student on athletics.'",
        "'speaker_6': 'I also struggle with the lack of transparency apps. I've asked questions time and time again in the six months I've been here on the council. In most time, those questions are half fancied or ignored entirely. Moving forward, there is a need for accountability, transparency and oversight in our Boston public school system.'",
        "'speaker_6': 'I will continue to always advocate for our teachers who I know show up every day and work so hard in many of the administrators. I'll always advocate for our families and always put our children first. Every child in the city of Boston deserves a quality education.'",
        "'speaker_6': 'And there are so many moving parts right now in beeps that make this more challenging. There's the possibility of receivership. Council meetings are happening now around switching to an elected school committee. And we have an outgoing superintendent who's leaving in a few weeks.'",
        "'speaker_6': 'The finalists will be announced next week and possibly a vote on June 22nd. And we'll know who our new superintendent is going to be. And that superintendent is going to be tied to this budget. And we know that Superintendent Cecilia's and her staff who are leading these budget proposals will not be there on July 1st.'",
        "'speaker_6': 'So the timing of this budget would be more reasonable, I believe, if we named the superintendent first. But I know that we have time constraints here on the council. So I wanted to share my concerns and hear from any other council councilors.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_1': 'Thank you. Counselor Murphy, the chair recognizes counsel. We're all counsel. We're all you off the floor.'",
        "'speaker_10': 'Thank you, President Flynn. And thank you to counsel, Anderson, for leading us through this budget process. Student enrollment is declining. I'm encouraged with the new initiatives and the investments EPS will be making to our students this year. While we have heard about all the great programs and new investments.'",
        "'speaker_10': 'We have not heard data on literacy rate, postsecondary success or how our students do in the job market. As a counselor, we do not have a clear understanding of BP's goals for our students what our students outcome, what student outcomes we are driving towards.'",
        "'speaker_10': 'Do we know the academic baseline of our students? With so many high school graduations taking place this time of year, it is important for us to ask how BP is preparing our students for success after high school. What data shows that our children are ready for college, a trade, a certificate program, or a job.'",
        "'speaker_10': 'We are spending $1.33 billion dollars without the ability to evaluate and validate the curriculum, programs and initiatives to ensure we are preparing our students for life after high school. How many of our students graduate college? How many our students go to go into trades?'",
        "'speaker_10': 'What is the what is a BP educating worth in the real world? Do we know the average salaries of our high school graduates in 2016? So data graduates, average salary was around 35, $37,000 a year. This is the most recent data I found, and it is old data, but that's the issue.'",
        "'speaker_10': 'We can't change the outcome. We cannot change the outcome, but we do not have the information readily available. Making a livable wage is important. We need to be tracking that information, making the necessary changes and beeps to prepare students for college or career.'",
        "'speaker_10': 'We do not need to wait for Superintendent Tenet to tell us that our students need to prepare for life after high school. We can start that infrastructure building right now by being transparent with our student data set and benchmarks, identifying metrics and working with trusted partners for evaluating and validating student data.'",
        "'speaker_10': 'Although there is still work to be done, I'm grateful for and confident in the collaboration and creation when it comes to data. So I will be voting yes for the studio for the DPS budget. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, counsel. Earl. You know, we'd also like to speak on this matter. Councilor Fernandez Anderson, the chair of the council. I'm sorry. I'm sorry to say the chair recognizes. Councilor Coletta. Councilor Coletta, you have the floor.'",
        "'speaker_5': 'Thank you. Council President. I just wanted to go on record to give a statement. So we all know the world is faced by peace right now due to generational divestments and mismanagement, but I won't repeat them. What I will say is that as a BHP's graduate, I know how strong our kids, families and teachers are, especially with'",
        "'speaker_5': 'what they've gone through the past couple of years during the pandemic. I believe that BHP's community is resilient and I believe in what public education can do to transform the lives of our children. I will also say that I do not support any top down approach and I still have yet to see the receipts.'",
        "'speaker_5': 'So given this, I still have great concerns about adequate supports for English language learners and children with special needs. I also want to see an investment in my O'Donnell school playground in Boston that serves 88% of Latin kids who do not otherwise have access to open space in their community.'",
        "'speaker_5': 'I also believe that increases in central office budget should be reallocated to go directly to our classrooms to recruit and retain excellent teachers and paraprofessionals, enhance healthy learning environments, and improve and modernize our curriculums to give our kids the best shot at success in the 21st century.'",
        "'speaker_5': 'And despite this, I'm going to support the Chair's recommendation to pass the DPS budget. We as a family, including the mayor, the school committee, and the new superintendent, whoever she may be, can get this done. So I will go on record in support of passing this budget and look forward to the conversations I.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilor. The Chair recognizes Councilor Braden. Councilor Braden, you have the floor.'",
        "'speaker_3': 'Mr. President, this morning I had the very great pleasure of visiting the Baldwin Early Learning Pilot Academy in Brighton, a diverse inclusion school providing our youngest students with a solid foundation for their future learning within Boston Public Schools.'",
        "'speaker_3': 'I am so impressed and grateful to all the teachers and staff who work every day to support our students and a school community across the city for their tenacity, their resilience, and their stick to it ness. Our public schools are in a competitive market to attract and retain students, and it is vitally important that we.'",
        "'speaker_5': 'In.'",
        "'speaker_3': 'And as and so I stand to appeal a stand and ask us that we invest in early learning and literacy to ensure that our youngest students get the foundation that they need to succeed right from the very start.'",
        "'speaker_3': 'If students begin an early, early education in our school system, they will. And the system they will continue. And those families will be engaged and invested in our and our public school system in Boston. I want to echo my colleague, Councilor Wales, concerned about outcomes.'",
        "'speaker_3': 'How prepared are students to enter the 21st century workforce? I also want to raise up the issue of access to athletics. I firmly believe that athletic programing in schools is a mental health support that our students vitally need.'",
        "'speaker_3': 'Having weathered this unprecedented pandemic that we've just come through for the last two years as the Council for Alston Brighton District nine, I also want to stand up and advocate for a robust and planning process for the fair and a new Jackson Elementary School and for a new Horace Mann School for the Deaf, which is a regional'",
        "'speaker_3': 'school for the Deaf for 150 year history of excellence. And I hope that we can continue to support our special ed students across the city and our English language learners also. It's it's so inspiring. When I visit a classroom and see the work of our students and our teachers every day.'",
        "'speaker_3': 'And although I have very grave concerns about the state of things in the Boston Public Schools, I will be voting to support this budget today, but I do realize that we have a lot of work to do. Thank you.'",
        "'speaker_1': 'Thank you, Councilor Bright. And the chair recognizes Counselor Arroyo. Counsel Arroyo, you have the floor.'",
        "'speaker_8': 'Thank you. Counsel President Flynn, I want to take a second to thank Counselor Fernandez Anderson for her inaugural budget and shepherding us through this the first time for everybody with the amendments and all the changes that we've done to the budget process in the last year.'",
        "'speaker_8': 'So thank you very much for your leadership and for putting in the hours to get us here. I just want to take a moment to thank our educators. It has been an incredibly difficult two years for our teachers.'",
        "'speaker_8': 'My sister is a teacher right now teaching in a Boston public school, and my mother did so for 35 years. And so I got a first hand seat at watching her grade papers and correct papers until the wee hours of the morning and just sort of the dedication that it requires.'",
        "'speaker_8': 'And when we added sort of the virtual learning and all the challenges of this pandemic, that job got incredibly difficult, incredibly fast, and our teachers responded. And so I just want to thank them for that. I know that beeps.'",
        "'speaker_8': 'I, as a former student myself, often gets a bad rap in how they are discussed or talked about. But I know that in each and every single individual school, we have educators and teachers and nurses and social workers and guidance counselors who are doing their very best to educate and prepare our children and are sometimes facing surmountable'",
        "'speaker_8': 'odds when insurmountable odds when we talk about the requirements that we are placing upon them and or the lack of resources and funding that we are giving them to reach and meet these goals and frankly, the lack of supports they receive when we are talking about things like housing or outside of the classroom, problems that impact inside'",
        "'speaker_8': 'the classroom. And so I am very heartened by the fact that this budget maintains the progress we made last year with a school nurse in every school. I am grateful that it adds one social worker at minimum per school full time.'",
        "'speaker_8': 'I think that's one of the places I would like to see our budget continue to go, which is addressing the mental health of our students. And so in that sense, I'm grateful that this adds 26 school psychologists. I would like to get us to a place where we have one per school as well, because we already had'",
        "'speaker_8': 'issues with making sure that our kids were receiving the social and emotional supports that they need at school. The pandemic only is going to continue to sort of make that a much more dire and pressing need. And I think we are seeing sort of the impact of that on educators and on students.'",
        "'speaker_8': 'And so I'm grateful that this budget adds 26 school psychologists. I'm grateful it adds one full time social worker per school. And I hope that as we continue to work on these things, that we continue to take into account not just their performance academically, but their actual social and mental health and well-being, which includes also athletics, as'",
        "'speaker_8': 'Counselor Murphy has brought up in making sure that we are teaching and reaching the whole child. Right. I'm grateful to the strides that this budget makes towards creating curriculum and materials that are inclusive and diverse in who and what kids are learning and seeing, and that they are seeing themselves reflected in both what is available to them'",
        "'speaker_8': 'in their library, but also in the curriculum. And so I will be voting yes on this. There are places where I think we can do better. I would hope am still pushing for ARPA funding to go towards infrastructure changes so that we can actually address some of the real infrastructure problems that we have within our schools that'",
        "'speaker_8': 'we've had for decades and frankly are long overdue and that we continue to build upon things that we have not done well and we continue to sort of ensure that we are giving funding to those issues and addressing those issues with staffing and making sure that we get to a place where our teachers are reflective of our'",
        "'speaker_8': 'populations. But this budget, as it's currently written, does address one of my major issues, which is social and emotional health for our students. And so in that way I'm grateful. And in that way I support this budget. I will be voting yes.'",
        "'speaker_8': 'Thank you. Council President.'",
        "'speaker_1': 'Thank you. Counsel Royal. The chair recognizes counselors and counselors. And you have the floor.'",
        "'speaker_7': 'And and I.'",
        "'speaker_5': 'Want to thank Counselor Fernanda Anderson for all the work you've done in really getting us here. A lot of it was late nights and by yourself and and doing a lot of work with Michelle. So thank you so much on that.'",
        "'speaker_5': 'You know, as many people who are here, I am also a graduate and DPS is our biggest expense as it should be, as if we maintain public education as a public good and we need to support it with our resources.'",
        "'speaker_5': 'So I'm encouraged by this budget. I'm encouraged especially by the $2 billion commitment to a Green New Deal for our schools. Our school buildings need to reflect the dignity and affirm the dignity that we have for each and every one that each and every one of our students has.'",
        "'speaker_5': 'And so I'm encouraged by that. And one of the things that was really that struck me at the hearing on state receivership that I spoke in opposition to and so many others spoke in opposition to, there was a guidance counselor of the year was present and a lot of the members asked her, what can we do to'",
        "'speaker_5': 'better support our students? And she said, we can have more guidance counselors, more and more and more guidance counselors, even more than meeting what the state minimums are and what the national standards are. Our students are facing an unprecedented, unprecedented mental health crisis.'",
        "'speaker_5': 'When we talk about what's been happening not only with the pandemic, but, you know, the racial reckoning and issues going unaddressed. And so I think that we have a lot more work to do when it comes to providing more guidance counselors for our students, when it comes to supporting our English language learners, our students with interrupted learning'",
        "'speaker_5': 'in our slide program who have faced a number of challenges but are still trying to either learn English or maintain going to school despite life challenges, we need to support our principals and support greater teacher diversity to reflect what the classrooms look like, because we know that there's incredible value in that.'",
        "'speaker_5': 'I talk about these issues because they're also the issues that were important to me. My guidance counselor really helped me navigate processes that I wasn't familiar with, that my family wasn't familiar with. And we know that guidance counselors can really change lives.'",
        "'speaker_5': 'So and I hope that in that the work that our new superintendent does and the work that a lot of folks have been talking about, that we continue to support our students as they navigate issues both in school and out of school.'",
        "'speaker_5': 'And also, there's something that I've said a lot. There are a lot of good things happening at BP's, and Bebe's just needs to do a better job of communicating what's working. Like the availability of more kids are our kids are in k onesies that parents don't know about, students graduating with associates degrees, including from Madison Park.'",
        "'speaker_5': 'So a lot of our ability to attract students from charter schools, although we need to be able to track that data better. So there's a lot of things that are working in that we just need to do a better job of communicating that.'",
        "'speaker_5': 'So I'm going to support the chair here and her recommendation to pass that BEPS budget with the understanding that our role here as city counselors is to hold BP accountable, to really make sure that BP's central office is is doing the work, to make sure our busses are arriving on time, to make sure that students are getting'",
        "'speaker_5': 'the teachers that they need, that we are that when we see graduates crossing the stage, as I was seeing yesterday, that we can look into their eyes and say that we've done everything we can to prepare you and set you up for a good life.'",
        "'speaker_5': 'I'm not sure we can do that 1% now, but our role is to make sure that that happens. So thank you. And thank you, Madam Chair, for all of your work.'",
        "'speaker_1': 'Thank you, Counsel. The chair recognizes counsel. Have clarity. Counsel. Clarity. You have the floor. Thank you, Mr. President. And thanks to the respective chair of the Chair, ways of beans and Chair of Education for me. As it stands right now.'",
        "'speaker_1': 'I'm a no. We have children who do not feel safe in school. We have children who are not arriving to school on time and some not arriving at all. We have we don't have the bona fide vocational tech school.'",
        "'speaker_1': 'I'm talking best in the country. Not enough of our kids are getting into some of the greatest schools in the world that call Boston their home. We boast of the best colleges and universities in the world. Not enough of our kids are getting into those schools and the ones that do and are fortunate to get in.'",
        "'speaker_1': 'Most of them are home at the Thanksgiving break, not to return because of the curriculum. And so as it stands, let's forget about facilities. And we're talking about, obviously, lack of sporting programs and lack of attention to to school psychologists and things like that.'",
        "'speaker_1': 'So, yeah, we're continuing to make strides. And, you know, I've never not supported our Boston Public Schools and our Boston Public School students. But the time has come with this legislative branch has to say, we have seen and heard enough.'",
        "'speaker_1': 'And whether it's the bullying that takes place in the schools or whether it's the violence that's taking place in the schools, or whether we continue to hear story after story after story of late arrivals or children actually being left on the street at the curb, not getting picked up at all.'",
        "'speaker_1': 'Enough is enough. And I think our leverage is right now. We have an opportunity to send the message back to Boston Public Schools that we you know, we're obviously tired of of the spin. We're tired of ducking and dodging.'",
        "'speaker_1': 'We're tired of no accountability. And then our leverage now is that we send it back, that we're not prepared to pass this right now. They need to do better. They need to make assurances to this body, to the student body and to their families that their schools will be safe, that their children will get to school on'",
        "'speaker_1': 'time, and that with respect to teaching.'",
        "'speaker_8': 'And learning and.'",
        "'speaker_1': 'In addition to the extra efforts that need to be made, obviously, for our English language learners and students with disabilities who are completely being left behind, all of that, some in substance says, hey, we shouldn't just pass this right now.'",
        "'speaker_1': 'We ought to send the message back to them that they need to do better, that we're going to hold them accountable. And this isn't about our teachers who do great work. Our colleague spent tremendous amount of time on the front lines, taught my children.'",
        "'speaker_1': 'There are some good news stories happening in the Boston Public Schools. We don't hear enough of them in its in.'",
        "'speaker_8': 'The classroom with.'",
        "'speaker_1': 'Teaching and learning. So my issue with this budget is not with our teachers and not with the teaching and learning. It's with Central. It's bloated. It's a morass. They don't listen. They're not responsive. And they're not accountable. No matter what, superintendent comes in.'",
        "'speaker_1': 'And as a result of which, we're seeing the results of decades of neglect. So for me, I'm a no. I'm encouraging my colleagues to be a no. Let's send a message back to them that we're not there yet.'",
        "'speaker_1': 'They need to sharpen the pencils. They need to come back to us with all of the things that we've just discussed. Our colleagues, through you, Mr. Chair, have raised some very important, critical issues. And my suggestion through you to them is if if what you've raised is not in this budget, then we need to say no right'",
        "'speaker_1': 'now, and let's see if we can get them in the budget over the next three weeks. Thank you, Mr. Chairman. Thank you, Counsel. Clarity. The chair recognizes counsel. Baker That I'll recognize counsel. BLOCK After counsel. BAKER You have the floor.'",
        "'speaker_8': 'Thank you, Mr. President. I don't want to delay belabor a lot of this here. We've talked about safety, transportation, vocational, vocational education, certain curriculums. I believe that we're not giving our children the best what we should give them.'",
        "'speaker_8': 'This is not an issue. 50 plus years. And we think something is going to change. A vote here, a yes vote here today is a vote for status quo because we think you're doing good enough. I don't think we're doing good enough.'",
        "'speaker_8': 'And I will be voting no today to echo a counselor or a well warrior who was was eloquent in in the way he spoke about what are they doing after school? What is the value of a veep's education?'",
        "'speaker_8': 'I'd be. I'd be very interested to see what that is. Multiple people have talked about great concerns that way. We will speak to grave concerns if it's if it's a no. And we send it back and it becomes a 1/12 budget.'",
        "'speaker_8': 'And they come in front of us every month to talk to us about what they're doing. I don't feel that this was a oh, and also think I want to do from the beginning, I should have thanked Counselor Anderson for her work and all this yeoman's work.'",
        "'speaker_8': 'But yes, I think there's a saying in AA, if nothing changes, nothing changes. This vote is to throw more money at it. But we're not getting it through that. We're not changing some things. We need to change transportation, school safety, vacation, what we're doing around inclusion, the one inclusion school that I had in my in my, I'",
        "'speaker_8': 'think, council role and I share that chair the area has been decimated. They were a national model. They're not anymore. And that was because of decisions made from on high that they implemented in a school that was that was doing very well.'",
        "'speaker_8': 'We can't say that today with a straight face. So I will be a no here today. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Counsel. Baker, the chair recognizes counsel. BLOCK Counsel of the fall.'",
        "'speaker_9': 'Thank you, Mr. President. And I also want to thank Counselor Fernando Sanders, and I know firsthand how much work this all is. And I want to offer more thanks to some of the other dockets, but definitely on DPS.'",
        "'speaker_9': 'It's about a third of the hearings and and really quite a lot of information to process for the council so we can be here today. I think what I want to say is it's very much to agree with colleagues about many of the great challenges that we face ups.'",
        "'speaker_9': 'But to disagree with councilors. Baker and clarity about sort of what the logical move at this juncture is. I think we recognize that the Boston Public Schools face tremendous challenges. I was here a year ago saying that obviously enrollment declines.'",
        "'speaker_9': 'Seems like in certain ways the biggest one, if only because it drives the challenges for everything else in terms of giving our students these quality schools and and attracting everyone to the system. And then, as I've mentioned before, the early literacy rates continue to concern me deeply, although I think the the administration has in the intervening years'",
        "'speaker_9': 'been quite aggressive about rolling out new standards across and so on the academic front. I'm encouraged both by that and by the commitment to those core. But with huge challenges and we all know that the, you know, the building commitment is great, but gosh, is it needed?'",
        "'speaker_9': 'And and, you know, the thought about, okay, we want to have a quality schools commitment is great but how are we going to get there? I just think that when, you know, when you're in a storm and then you're about to appoint the sort of captain of the new ship, it's not the time to also kind of'",
        "'speaker_9': 'court martial them. And my sense is that, you know, that this is really a moment where we need deep partnership in the city. And that means that we need the council to be in partnership with the new mayor and the imminently very new superintendent to really to really steer the ship in a better direction.'",
        "'speaker_9': 'And I can't see starting that out instead of being from a place of partnership, sort of being show up your first day and maybe before us on your budget. I mean, to me, there's already enough swords hanging over this system when we talk about sort of the state apparatus recently, and it just feels to me like we're'",
        "'speaker_9': 'reaching out to all of our partners. We want our you know, we want our private partners, our universities, all our community partners to really, like, come in and all wrap our arms around us and make it the best system it can possibly be and a system of choice that attracts people and get those enrollment numbers back up'",
        "'speaker_9': '. And it's hard for me to imagine that we would start that virtuous cycle by saying by signaling, you know, an unwillingness to pass this budget. So I guess the way I feel is that although these challenges are before us, there are challenges that we have to take collectively and that the steps that the council can take in'",
        "'speaker_9': 'good faith today for an incoming superintendent facing a lot of uncertainty and headwinds is to give them the certainty of a passed budget. So I'll be voting in the affirmative. Thank you so much.'",
        "'speaker_1': 'Thank you, counsel. Anyone else like to. Speak on this. Council. Fernandez Enerson, the chair of the Committee of Ways and Means, seeks acceptance of the committee report and passage of Docket 0481. Mr. Clarke, can you please take the roll call?'",
        "'speaker_2': 'Roll call on docket 0481 Council or Royal Council? A Royal Yes Council. A Baker Council. A Baker and eight Council. The Board Yes. Council. The Board. Yes. Council agreed. Yes. Council Aberavon. Yes. Councilor Coletta. Coletta yes. Councilor Fernandez Edison.'",
        "'speaker_2': 'Yes. Councilor Fernandez Sanderson yes. Council three The Council of Phil, everybody. No. Council Flynn. Yes. Council of Flynn. Yes. Council Laura. Council. Areas Council. Louisiana Council. Louisiana is council on me here. Councilor, me here? Yes, Councilor Murphy. Councilor Murphy know and council well?'",
        "'speaker_2': 'Yes. Council world? Yes. Docket zero 41 has received the majority.'",
        "'speaker_1': 'Thank you, Mr. Carter. I'm so. The chair recognizes counsel FERNANDEZ Innocent. Counsel Fernandez innocent of the full.'",
        "'speaker_5': 'Is it okay if we take a five minute break? I have to tinkle.'",
        "'speaker_1': 'This body will be in recess for 5 minutes. And then. We're back in session. Counsel Fernandez Anderson will speak on docket 048 to this is the next matter we'll take up. The chair recognizes Counselor Fernandez Anderson. Counsel Fernandez Anderson, you have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. Docket 0482 represents the operating budget allocation to funds excuse me, to fund the city's liability for other post-employment benefits. OPEB While the city is required by law to make an annual contribution toward reducing its unfunded pension liability, there is no such requirement for retiree health and life insurance benefits.'",
        "'speaker_5': 'In FY oh eight, the city was required to follow new Governmental Accounting Standards Board Gas, GASB required requirements to identify and disclose this estimated liability. At the same time, the city also voluntarily began to annually allocate funds to reduce to OPEB liability.'",
        "'speaker_5': 'Annual allocations are retained in an irrevocable trust fund authorized through the city's acceptance of Massachusetts General Laws. Chapter 32 V. Section 20 as added by Chapter 479 of the Acts of 2008, the city has been contributing $40 million to this fund each year since f y 13.'",
        "'speaker_5': 'And so as Chair of Ways and Means, I recommend that this docket ought to pass.'",
        "'speaker_1': 'Thank you. Counsel Fernandez innocent. Would anyone else like to speak on this matter? Council. Fernandez Andersson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report. Passes passage of Docket 048 to Mr. Clark.'",
        "'speaker_1': 'Can we do a roll call vote, please?'",
        "'speaker_2': 'Roll call on docket number 0482. Consuelo Arroyo. Yes. Councilor Arroyo. Yes. Counsel The Baker High Council of Baker High Council. Book Counsel of Buckeye Counsel. Brady Counsel Very nice counsel. Collette Coletta Oh yes. Counsel Coletta, yes. Counsel Fernandez Anderson.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Counsel Fernandez Henderson Yes. Counsel Clarity. Yes. Counsel Clarity. Yes. Counsel of Flynn Yes. Counsel of Flynn yes. Counsel Yes. Counselor Yes. Counsel. Louisiana counsel. Louisiana Yes. Counsel Let me hear. Counselor me here. Yes. Counselor Murphy. Counsel. Murphy Yes.'",
        "'speaker_2': 'And Counsel Warrell Yes. Counsel We're talking of 0482 has received a unanimous vote.'",
        "'speaker_1': 'The docket has passed. Mr. Holmes counsel Fernandez Anderson will speak now on docket 0483. The chair recognizes Counsel Fernandez Anderson Thank.'",
        "'speaker_5': 'You again, Mr. President. Now moving to docket 0483 ten, Docket 043 involves an appropriation of $1,600,000 from the city's Capital Grant Fund to address the impact of transportation network services on municipal roads, bridges and other transportation infrastructure, or to be used for any other public purpose sustainability related to the operations of transportation network companies.'",
        "'speaker_5': 'Taxes in the city. Under Chapter 187 of the Acts of 2016, certain transportation network companies must submit to the Department of Public Utilities dpu the number of rides from the previous calendar year that originated within each city or town.'",
        "'speaker_5': 'And for a ride assessment which are credited to the Commonwealth Transportation Infrastructure Fund. And then half of the fee is distributed by the Department of Public Utilities dpu proportionately to each city and town. Based on the number of rides that originated in the city or town, the funds are collected and deposited to the city as special revenue'",
        "'speaker_5': 'and must be included in must be appropriated to be spent. These funds are earmarked for TNC related purposes, including investments into way into into ways of mitigating the impact of taxes and alternate modes of transportation. And so as chair on Ways and Means, I recommend that this docket ought to pass.'",
        "'speaker_1': 'Thank you, Counsel Fernandez Anderson. Mr. Clarke, can you please call the roll.'",
        "'speaker_2': 'Roll call on Duncan Number zero 43. Councilor Royal Yes. Council Royal Yes. Councilor Baker. Councilor Baker I Council the book council the Book of Celebrity Council The Great Knight Council Collective Council Collective Yes. Council Fernandez Anderson.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Councilor Fernandez Sanderson Yes. Council Third yes. Council Clarity yes Council Flynn yes. Council of Flynn yes. Council Lara yes. Council ah yes. Council Louisiana yes. Council Louisiana yes. Council Let me hear. Council on me yes. Council the Murphy Council and Murphy yes and council overall.'",
        "'speaker_2': 'Yes. Council overall. Yes. Lucky number 0483 has received unanimous vote.'",
        "'speaker_1': 'The docket has passed. The chair recognizes council Fernandez Anderson on docket 0484.'",
        "'speaker_5': 'Thank you. Now moving on to docket 048420486 capital. We come together as a collective today to put forth a budget that will work for the masses of the residents and citizens of our city. And it isn't just for the matter of total amount of money that will be spent.'",
        "'speaker_5': 'Rather, it's who the money will be spent on and who gets to decide how the money will be spent. That we acknowledged today. We speak often of equity, but we don't practice it nearly as often. And when it comes to the proposed capital budget, I see much of much to approve of.'",
        "'speaker_5': 'But I can't help but to note that the plethora of projects that are being proposed are in predominantly affluent communities. It has been said that in the capitalist country, when there is a struggle between a rich person and a poor person, the rich person usually emerges victoriously.'",
        "'speaker_5': 'I humbly propose to you that we should put our shoulder to the wheel in an effort to reverse this to the best of our ability. So for those who do not have access to power, for those who aren't listened to when they speak, and for those who are food insecure, rent burton burdened, homeless, suffering from addiction, victims'",
        "'speaker_5': 'of an untreated mental illness. Simply put, for the masses of black, brown, immigrant and working class communities throughout our city, we must say to them clearly and unequivocally that we are with them and that this budget will begin a process by which they can thrive and not merely survive.'",
        "'speaker_5': 'The resources are there. Of that, there is no doubt and we support that the significant funds be utilized via the capital budget, but we must ensure that our support is rooted in guaranteeing that our communities most in need of resources and services get what they need.'",
        "'speaker_5': 'This is essential both as repair for histories of racism and class inequality. And for the ongoing manifestations of inequity that are prevalent across a spectrum of socio economic concerns. And so with all of that being said, I will recommend that as Chair Ways and Means.'",
        "'speaker_5': 'I recommend that these dockets be read for the first time and assigned for further. Further action.'",
        "'speaker_1': 'Thank you, Counsel Fernandez Anderson. Mr. Kirk. Well, before we do that, would anyone else like to speak on this matter? The chair recognizes counsel. We're all counsel. We're all. You have the floor.'",
        "'speaker_10': 'Thank you. President Clinton would like to thank the administration for working in collaboration with our office to bring in expanding capital investments in District four. And when I walk the streets of my district, a constant theme I hear in the black and brown neighborhoods in Boston is it's kind of sad to hear it is that nothing, nothing'",
        "'speaker_10': 'changes and government doesn't work. The truth in their statements is visible. When you walk on main streets and neighborhoods and see the legacy of generations of investments vacant lots, unused buildings, broken sidewalks and repair schools and playgrounds disproportionately in my district.'",
        "'speaker_10': 'Last September, many of our residents went to the polls, hopeful that after two years of protests against systemic racism in a historic mayoral field, they will finally be served in a way that understands the urgency of the moment.'",
        "'speaker_10': 'We all were sworn in knowing that business as usual was not working for too many people. The word equity we use often came to the forefront, and in that time we all understood going back to systems and practice.'",
        "'speaker_10': 'The practices that historically contributed to disinvestment of black and brown neighborhoods was clearly out of the question. If not now, then when? And what other moment is needed in the last five years? District four has received the least in the capital plan by dollar amount in percentage of any neighborhood.'",
        "'speaker_10': 'It is not. It is the only neighborhood whose capital budget has not surpassed $200 million during that time frame, while other districts have surpassed over $1 billion. We need corrective, equitable investments that are constructive with urgency. I want to I want to thank Mayor Wu that in this capital plan, we are inching towards making those investments and'",
        "'speaker_10': 'righting past wrongs with line items like a steady for town field, improvements to streets and upgrades to Banka, along with commitments for future investments. Our communities, who have strictly not seen infrastructure investments, will now see more the state of our environment.'",
        "'speaker_10': 'The state of your environment affects your behavior and how as a city, the role we play in eradicating the ongoing issues facing black and brown communities and directly it is directly correlated with the investments that are made in the capital plan.'",
        "'speaker_10': 'New and increased investment investments will not only be perceived as transformative leadership, but will heal past trauma and restore faith that local government can and will work in underserved communities. I am looking forward to the urgency around current and future future equitable investments to correct the wrongs of years of disinvestment in black and brown neighborhoods and making'",
        "'speaker_10': 'our capital plan more equitable. Thank you.'",
        "'speaker_1': 'Thank you. Council World. The chair recognizes council board counsel Bach. You have the floor.'",
        "'speaker_9': 'Thank you so much, Mr. President. And also rise to support the capital plan. But to say that, you know, I think I'm I'm glad to hear about studies and such that have been added to achieve greater equity. I think as we've often seen in the capital budget and a small study in the first year can turn into'",
        "'speaker_9': 'a major expenditure. And I hope that as some of the things that counsel were, I'll just reference that sort of bloom that that really adjusts some of these totals that he was just talking about. And I also just want to say that I am.'",
        "'speaker_9': 'Just as hopeful and also impatient that by the time we're here again in a year, we will really be seeing the the progress from the administration adding these positions in PFG that they that are promised in this budget.'",
        "'speaker_9': 'Because I think, as folks have heard me say before, one of my frustrations is not only that. There's the question of what what is the equity and frankly, just the level of commitment that we're rising to in the actual capital budget.'",
        "'speaker_9': 'But then it's like, how quickly is that commitment actually realized? And, you know, so many of us see projects that just kind of languish year after year. And so I'm really hopeful. I know there's a significant number of us on the council.'",
        "'speaker_9': 'I know Councilor, the Madam Chair, Councilor Fernandez Henderson shares this view. Cats are legion, but that we could be just doing more in the capital budget. And the reality is even under our 7% limit, we're only hitting an effective 5.3 because we're just not getting these projects out the door.'",
        "'speaker_9': 'So I just I want to emphasize that I'm excited about a number of things in this capital budget, but particularly excited about the idea that we could just be building more infrastructure more quickly for the residents of Boston, because I really don't think there's a better bet investment wise than public infrastructure in this country.'",
        "'speaker_9': 'Often, you know, we we talk about it like it's 30 year stuff, but we tend to build a hundred year stuff and it just has such a huge impact on the kind of public goods of the city that all of our residents get to enjoy.'",
        "'speaker_9': 'And I just wanted to flag I meant to say this, but it's more appropriate here that for me, one of my focuses in the next six months is going to be, as we talk about this, BHP's $2 billion capital plan.'",
        "'speaker_9': 'How do we really make sure that that specifically is being pursued with the urgency? That doesn't sort of put us in the traditional capital timeline, but actually really make sure that those new schools are going to be delivered for our students on an expedited schedule, because I think that will make all the difference for it really fulfilling'",
        "'speaker_9': 'its promise. So with all that said, proud to support the capital budget today.'",
        "'speaker_1': 'Thank you, counsel. Berkeley Chair recognizes counsel and counsel and you have the floor.'",
        "'speaker_5': 'Mr. President, I will belabor the moment. I just wanted to thank the Chair Ways and Means Councilor for Andre Anderson and Council World for all their work. You know that we've done really an uplifting, how inequitable we can sometimes be when we're planning for our future, when we're planning, when we're looking at the capital budget.'",
        "'speaker_5': 'So I just when we're looking at our poorest districts, we're looking at our districts that have a concentration of black and brown folks. And when we're thinking about equity being the corrective action that we need to take, we really need to be leaning in and making sure that our capital budget really reflects that council back up.'",
        "'speaker_5': 'You know, we are we are very wealthy city. We have a lot of money. And it's just that wealth is not shared, that prosperity that we experience as a city that is often built on the backs of working class folks, black and brown folks, that is not shared.'",
        "'speaker_5': 'And I think our capital budget is a way for us to really think about how we're using our fiscal strength and think about how we're bonding and how we're using our triple-A bond rating to really invest in the public infrastructure in the way that Castro Brock was talking about.'",
        "'speaker_5': 'So I just want to thank you, Madam Chair, for the work that you've done here, because all the data and the research you've done to show how much you've disinvested in neighborhoods like before, and hopefully we can get it right continuing in the future.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_1': 'Thank you, counsel. Lewis And the chair recognizes Councilor Murphy. Counsel Murphy you have the floor.'",
        "'speaker_6': 'And thank you, chair, vice chair for all your work. So I definitely have high hopes for this $3.6 billion capital plan. And I want to thank Mayor Woo and the administration for this. It includes improvements to our schools, open spaces, community centers, streets and bridges.'",
        "'speaker_6': 'Although I am in support of the project, I want to highlight a few that I'm especially excited about the improvements to our community centers, especially the Curley Matter Hunt in North End centers and the Paris Street Pool, improvements to the East Boston Police Station, the preservation of the Long Island facility in Woods, Mullins shelter and the resiliency'",
        "'speaker_6': 'improvements in the harbor walk and open space construction, which I know will make our oceanfront more equitable and accessible to all. In the improvements to the Boston Public Schools facilities, especially when I see athletic facility upgrades, I'm very excited.'",
        "'speaker_6': 'So the amount of money, this amount of money has the ability to transform our city and jumpstart projects that have been overshadowed in the past. And I do want to thank you, counsel world for bringing that to us to light with your data of d for and as an at large city councilor, I'm here to support and'",
        "'speaker_6': 'advocate your efforts in that district, so I will be voting in support of the capital budget. Thank you.'",
        "'speaker_1': 'Thank you, Counselor Murphy. The chair recognizes. Counselor. Me here, Counselor. Me here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. This is a new day, right? The way we normally do business is we either when it comes to the capital budget, and we usually have a tradition to just, you know, vote without prejudice. And so I wasn't prepared to speak on the capital budget, but now I have been inspired to do so.'",
        "'speaker_7': 'Just really quick, again, I want to thank the chair and the vice chair and actually all of my colleagues who have been uplifting the importance of recognizing that we have a responsibility as a citywide councilor. You know, I spent a lot of time across the city, and I see who has and who has not.'",
        "'speaker_7': 'And I think as we continue to move through these processes, I think it's really important from a process standpoint, is that when it comes to the capital budget, I don't see a lot of conversations that are happening in the community about what it is that they need.'",
        "'speaker_7': 'And I think that that's an opportunity where we have to be able to lean in to create more opportunities for those who are living in in different neighborhoods, to speak for themselves around the things that that they want to see.'",
        "'speaker_7': 'Oftentimes, a lot of these conversations around the budget usually just falls on the operating budget, which I appreciate and I understand there's a lot at risk. But at the same time, I think capital should be another space where we start leaning in a little bit more if we're really serious about building equity here in the city of'",
        "'speaker_7': 'Boston and more importantly, creating space for those who actually pay for our salaries to be informing how we spend their capital dollars. So with that, I just wanted to uplift the importance of voice and look forward to moving the conversation along.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember here, the chair recognizes council, president, council. And you have the floor.'",
        "'speaker_3': 'Thank you, Mr. President. I'm excited to see this broad ranging capital budget. One, two concerns I want to flag up. One is, you know, in terms of we appropriate funds for capital projects. But but in the in the past, I echo my colleague, Constable Cox, concerned about sometimes the glacial pace of progress, but very often that boils'",
        "'speaker_3': 'down to the need to have a project managers in place and all the folks that manage a project and and shepherded through the process. And we have a human resources challenge here, and I hope that we can address that aggressively in the next year to make sure that we have the infrastructure in place to help shepherd these'",
        "'speaker_3': 'projects to their completion. As a district councilor for Allston, Brighton District nine, I applaud the inclusion of a study for a new elementary school in Alston and the new school, the Horace Mann Regional School for the Deaf and Hard of hearing.'",
        "'speaker_3': 'One of my biggest concern is the urgency of addressing the imminent closure of the BCA f community center at the Jackson Man Complex in Union Square. It is the only community center, busy wife community center we have in our neighborhood.'",
        "'speaker_3': 'We're the second largest neighborhood in the city with a population of over 75,000. And this is our only. Community center. It is a it is an emergency, FEMA emergency, central heating and cooling center. It is the polling place for five precincts.'",
        "'speaker_3': 'It is it is adult education, early education and child care. It is an absolutely essential piece of our community infrastructure. We cannot afford to have it shuttered and closed and have nothing in its place for for the time that it will take to build a new center.'",
        "'speaker_3': 'So I am appealing for urgency, and I will be continuing to advocate strongly to have this this project expedited in the near future. So I will be voting in support of this capital budget, but I also want to hold up these concerns with regard to Brighton.'",
        "'speaker_1': 'Thank you, counsel. But anyone else like to speak on this matter? Mr. Clarke, can you please call the roll.'",
        "'speaker_2': 'Roll call on docket 0484? Councilor Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Councilor Baker. Councilor Bug. Councilor BLOCK. Councilor Brady. I have been a Councilor Coletta. Councilor Colette. I guess. Councilor Fernandez. The interest a. Counsel for Ananda Sanderson.'",
        "'speaker_2': 'Yes. Counsel. Clarity. Counsel Clarity. Yes. Counsel Flynn. Yes. Counselor Flynn. Yes. Counselor. Counsel. Lara Yes. Counsel Louisiana. Counsel. Allusion Yes. Counselor Me here. Counsel Let me here. Yes. Counselor Murphy. Counselor Murphy. Yes. And counsel. World Yes. Counsel World.'",
        "'speaker_2': 'Yes. Talking number zero 44 has received a unanimous vote.'",
        "'speaker_1': 'The docket has received its first reading and will be assigned for further action. The chair recognizes Counsel Fernandez Enerson on Docket 0485.'",
        "'speaker_5': 'Thank you, Mr. President. Typically I like to talk and I have jokes, but today I didn't want to talk so much. Moving on now, returning to docket 0480 departmental operations. No.'",
        "'speaker_1': 'They recognized.'",
        "'speaker_5': 'What? Oh, sorry.'",
        "'speaker_1': 'Yeah, that's right. The chair recognizes Counsel Fernandez. Innocent Docket 0485.'",
        "'speaker_5': 'Yeah. I've already spoken on them. Say it again.'",
        "'speaker_1': 'The. We'll take a brief recess. Yeah. We're back in session. We're continuing 0485.'",
        "'speaker_2': 'Roll call vote on docket 0485. Counsel Arroyo.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Counsel Arroyo. Yes. Counsel Baker. High Counsel Baker Uh, Counsel of Counsel by Counsel Brady And so Braden. Counsel Coletta. Counsel Coletta yes. Counsel Fernandez Anderson.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Counsel for Ananda Sanderson Yes. Counsel Flaherty. Counsel Clarity Yes. Counsel Flynn yes. Counsel Flynn Yes. Counsel Yes. Council Area Counsel. Louisiana. Intrusion yes. Counsel here. Counsel Murphy. Counsel Murphy Yes. And Counsel. World Yes. Counsel Well, yes. Lucky number zero 45 has received a unanimous vote.'",
        "'speaker_1': 'The docket has received its first reading and will be assigned for further action. Mr. Clark, would you do a roll call vote on.'",
        "'speaker_2': 'Dockers 0486 Roll Call on Docket 0486 Councilor Royal Council Overview. Yes Councilor Baker. Councilor Baker High Council of Full Council of Book Council. Green Council. Green Council Calera Council. Calera Yes. Council Fernandez Sanderson.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Council Fernandez Sanderson Yes. Council Florida. Yes. Council Clarity. Yes. Council Flynn. Yes. Council Flynn. Yes. Council Area. Council area yes. Council Allusion. Council Louisiana. Council me here. Council meeting. Yes. Council Murphy. Yes. Councilor Murphy. Yes. Council world yes.'",
        "'speaker_2': 'Council. Well, yes. Talking numbers 0486 has received a unanimous vote.'",
        "'speaker_1': 'The docket has received its first reading. Will be aside for further action. We will go back to docket 0480, which is the operating budget as amended by the Council pursuant to our new authority under the Charter Amendment. Amendment.'",
        "'speaker_1': 'The Chair recognizes Council. Fernandez innocent. You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. And now the moment we've all been waiting for. Now returning to docket 0480 Department of Operations. Finally, I want to take this time to first thank our dear clerk, Alex and team. Appreciate all the work that you do.'",
        "'speaker_5': 'Thank you. I'd like to thank my incredible colleagues who this could not have been possible without. Counselor me here. I thank you for standing firmly. Feet planted. As you speak, your truths with an epic strength and passion. Councilor Murphy.'",
        "'speaker_5': 'I applaud you for your fundamental decency, your career in education, and for your ongoing concern and advocacy for our city. Councilor. President Flynn. I deeply appreciate your kindness and consistency in the face of ups and downs in seemingly second nature to this work.'",
        "'speaker_5': 'Councilor Morrow, I warmly acknowledge your quiet, quiet strength and steadfastness and your willingness to collaborate. Councilor Lara, I salute you for your for being an eternal soldier on behalf of these disenfranchized and marginalized. And for bringing your fighting spirit into this chamber each and every day.'",
        "'speaker_5': 'Councilor Braden. I greatly appreciate your thoughtful, intuitive and quietly strong demeanor. There have been times. In this chamber when I may not have heard or seen you, but I felt your presence. Councilor Bach. I am incredibly, incredibly grateful for your intelligence and for the hard work you put in.'",
        "'speaker_5': 'Your ability to selflessly do the work of five people is nothing short of mind boggling. Councilor Baker. You're my guy. I love your big heart and powerful passion. In truth, because of those traits. I would rather disagree with you.'",
        "'speaker_5': 'Then agree with most of the people I've known. Councilor Lucien. You have become my sister. You combine equal parts, brilliance and boldness. And getting to know you has been a highlight of this journey for me. I care for you deeply while learning to love you.'",
        "'speaker_5': 'Counsel clarity. I so appreciate your acts of kindness to me personally. And for your great professionalism, class and class that you demonstrate daily. Counselor Arroyo. I wouldn't have this experience without you. And you know what I mean. This was not possible without you.'",
        "'speaker_5': 'I am grateful for your skill and your, well, your passion for justice in your quiet but firm leadership that you exercise so eloquently. And finally, Councilor Coletta. So gentle. I salute you for jumping in right into this process.'",
        "'speaker_5': 'With the confidence, knowledge and presence of a ten year old veteran, and it has been a marvel to behold. I am happy to have all of you as my colleagues, and I am happy to say that we have put forth a budget that can begin.'",
        "'speaker_5': 'Might I say that again, begin to function toward a betterment of all Bostonians? On this day, I state with confidence our proposed policies have begun to match our jargon and our actions have inched closer to our words. Let us continue on this path together until we collectively craft and create the conditions that will assist in producing a'",
        "'speaker_5': 'city that we can all be proud of. Pursuant of the 2021 Charter amendment, the city council has worked as budget season to put forward an amendment draft rather than our typical rejection on the second Wednesday in June. The committee conducted a robust process to review the mayor's proposal beginning in April and running through June through this week'",
        "'speaker_5': '. This process has included 30 public hearings on departmental budgets and associated capital projects, including two sessions dedicated to public participation and has received written testimony from all city departments as well as written recorded testimony from the public. The committee also held four working sessions for council deliberation to put forward amendments to the mayor's proposal.'",
        "'speaker_5': 'The Council's proposed amendments to Docket 0480 fall into two categories intra departmental and inter departmental. It's for inter. I'm sorry. For intra departmental amendments include additional environmental health inspectors, for pest control, for other rodent abatement materials, including traps, baiting and dry ice.'",
        "'speaker_5': 'Additional funding for senior home repair programs. Two additional part time cross guards for the Winship and Baldwin schools. Funding to contract a tour bus company for the artery in District seven. Tourism contracts dedicated to African culture events such as festivals and parades.'",
        "'speaker_5': 'Additional addition of an EMS supervisor in the Community. Initiatives Division. Initiatives Division. Mental Health Response. Crisis Training to be provided to the City Council and 311 staff. Additional youth and senior programing at the Nazario Community Center. Grant opportunities along the artery in District seven.'",
        "'speaker_5': 'Two additional parking enforcement officers in East Boston. A pilot home ownership voucher program for the BHF. Funding for Historic Preservation of an African-American Arts Museum in Roxbury. Maintenance of the Grant to the Smart from the START program. Funding for acquisition of land to preserve natural wild.'",
        "'speaker_5': 'Funding for a college youth academic partnership program that will pay students for participating in tutoring. Funding for experiential learning. Opportunities for youth. Funding to expedite pedestrian safety measures. Funding to build capacity. And linguistically appropriate. Technical assistance for immigrant businesses.'",
        "'speaker_5': 'Grant opportunities for immigrant owned small businesses. A Jackson Man Transition Coordinator Position. Jackson Man Transition Resources. Addition of an early literacy specialist position. A pilot for housing stipends for young people age 19 to 29. 20 for my apologies.'",
        "'speaker_5': 'Housing stipends for municipal employees struggling to pay rent. Or own a home payments. Now moving on to an intro. So Interior Department to amendments totaling $8,832,000 or 0.53% of the budget of the appropriation order. Now, moving on to entire department or amendments.'",
        "'speaker_5': 'The addition of 15 Hokies two for Allston, Brighton four want one for Chinatown, two for East Boston, two for District four, two for Roxbury, two for Fenway Mission Hill. Beacon Hill two four District two and two City Wide District three.'",
        "'speaker_5': 'My apologies. The addition of a director of waterfront planning position funding for BHO for the city housing voucher program, which set aside for project based basing at IDP units to buy deeper affordability. Returning citizens and VHA Home Ownership Pilot Launch funding to accelerate waste reduction programs with additional staff positions.'",
        "'speaker_5': 'Funding to provide a subsidy for expanded Mission. Hill Link Service. Additional staff for tree maintenance. An increase to the annual allocation to the Boston Groundwater Trusts to $200,000. Full funding for 6000 youths jobs and 1500 year round jobs.'",
        "'speaker_5': 'Additional personnel for general support in a city clerk's office. Increase capacity for black male advancement. Funding for erstwhile courses. Increase capacity in the Office of Returning Citizens. Small grant opportunities for graffiti busters. Increase to city council personnel services to right size staff wages.'",
        "'speaker_5': 'And add central positions to support the Council with its new budgetary authority. Funding for LGBTQ Events. Additional Funding to support immigrants. Lead Boston. Personnel funding to bolster already budgeted for upgrades to the legacy 311 system to reform Boston 311.'",
        "'speaker_5': 'Funding to provide technical assistance for all 20 Main Street districts. Funding I'm sorry additional staff for Saw Charlestown funding for burial assistance, funding for senior programing at the Veronica Smith Center in Brighton and commissioning of a citywide life insurance study.'",
        "'speaker_5': 'Funding for BFD Carr five Boston Fire Department. Carr five. Funding for the Clerk's Office to provide. Procure clarification services for the review and. Sorry. Record ification of the City of Boston Code Ordinances and special acts relating to the City of Boston, including the city charter youth workers to support programing for youth residents of VHA, Commonwealth Apartments and'",
        "'speaker_5': 'the Boston Public Housing Authority. Public Housing Authority. Faneuil Garden's Programmatic Support for citizenship day salary increases for employees at Boston Youth Development Network. Interdepartmental amendments total $17,006,618 in $18 in fund transfers across various departments, which represents just over 1% of the docket appropriation order.'",
        "'speaker_5': 'The amended draft being proposed is net neutral. Pursuant of our responsibilities under the Charter and reflects the Council's priorities for FY 23 in working toward a better, safer, more equitable city that takes care of its residents and employees.'",
        "'speaker_5': 'And so, as Chair of Ways and Means, I recommend that this docket ought to pass in an amended draft. Thank you.'",
        "'speaker_1': 'Thank you. Thank you. Counsel Fernandez Emerson. Would anyone else like to speak on this matter? The chair recognizes counsel. Our counsel, LRA. You have the floor.'",
        "'speaker_7': 'Thank you, President Flynn, and thank you to Counselor.'",
        "'speaker_5': 'Fernandez Anderson for stewarding us through this very long and tedious process in the budget. I rise today to show my support for this amended budget. I think that. The budget that was presented to us by Mayor Woo did an amazing job at what she calls getting the small things right so that we can do the big things'",
        "'speaker_5': '. And this budget that has been presented by the City Council in its amended version goes one step further, not only to reaffirm the mayor's vision of doing the small things right, but to do it in a way that is collaborative.'",
        "'speaker_5': 'And that includes not only our personal vision for the big things that the city of Boston needs, but the very specific needs that our constituents has that have asked us to represent here on the city council. I think that this amended version of this budget is a beautiful amalgamation of both the mayor's vision and the needs of'",
        "'speaker_5': 'all of our districts. And I'm excited to send it to the mayor for her approval. I want to rise today to speak specifically about the amendment that I included here in the committee report. The amendment for a just under $7 million for youth jobs in the city of Boston is representative of the largest line item amendment made'",
        "'speaker_5': 'to the city of Boston budget. And it's something that's very near and dear to my heart because I got my start organizing here in the city of Boston, asking for the city of Boston to increase the city's budget.'",
        "'speaker_5': 'At that time, I was 15 years old. I am almost 33 now. And so it's been a long fight of almost, if not already, two decades of the young people of the city of Boston asking for the city council and the mayor to ensure that the resources that were set aside for the young people in the city'",
        "'speaker_5': 'of Boston were up to par with the needs that we would be investing in young people, investing in their well-being and investing in the safety and the well-being of our communities as well. But today, I don't just want to talk about myself.'",
        "'speaker_5': 'I want to talk about Michael Brown. Eyeball. Brown was a 17 year old young man from Mattapan. Cool. At a very young age as a juvenile. Spent his time with the wrong crowd. And became getting involved very early.'",
        "'speaker_5': 'At the age of 15, I came across a youth worker who offered him a youth job during the summer.'",
        "'speaker_7': 'And that was the catalyst for eyeballs transformation.'",
        "'speaker_5': 'I've always spent the next three years becoming what I consider one of the most prolific youth organizers received. An eyeball spike of choice with the UV job spike. Year after year. Eyeball came.'",
        "'speaker_7': 'And testified before the City Council to ask that the.'",
        "'speaker_5': 'Boston City Council increase the budget for the youth jobs. Sometimes we won. Sometimes we lost. Sometimes we made concessions. But never did the mayor or the city council meet the requests that the young people in the city of Boston were making.'",
        "'speaker_5': 'I got the incredible pleasure of being eyeballs youth worker at 31 Heath Street. Youth in Boston, a family service of Greater Boston. I got to watch Eyeball Blossom into an incredible young.'",
        "'speaker_7': 'Man.'",
        "'speaker_5': 'Who committed all.'",
        "'speaker_7': 'Of his time.'",
        "'speaker_5': 'Not only into maintaining his own youth job, but into ensuring that all of the young people in his neighborhood who were currently or previously getting involved had an opportunity to get out. On Memorial Day as I was sitting on his front steps waiting for his mother to bring him to one.'",
        "'speaker_7': 'Of our actions. I've always stopped and killed.'",
        "'speaker_5': 'Now I know that to a lot of people this may sound like maybe it's not a success story. Because Eyeball didn't make it. But my advocacy for these $6.9 million. Comes from a place of considering. The shooting.'",
        "'speaker_7': 'That didn't happen. And the young person that didn't.'",
        "'speaker_5': 'Have to lose their life like I will. Because they weren't at the wrong place at the wrong time. The young person who decided to change their life. And go back to school or attend college. Because of the redirection that was given to them by being a part of a youth jobs.'",
        "'speaker_5': 'I know that we talk about this budget in frame of numbers and in frame of balance and in frame.'",
        "'speaker_7': 'Of the financial health of the city of.'",
        "'speaker_5': 'Boston. But I am incredibly, incredibly heartened by the support that has come for this specific amendment from my council colleagues. I am excited about what we're going to be able to do with this level of resource. And I just wanted to lift up what the human cost is.'",
        "'speaker_5': 'We don't always win.'",
        "'speaker_7': 'We don't always get these amazing young people that we can save.'",
        "'speaker_5': 'But if $6.9 million means that maybe we lose 15 less young people somewhere, then I think that that is an incredibly worthwhile investment. And I am so incredibly happy to support it and I'm incredibly happy to have the support of my council colleagues.'",
        "'speaker_5': 'Thank you, Chair, for including this here. And I'm thankful for all of the youth organizers that almost 20 years later continue to show up here to tell us that they need resources and that the vision for the city of Boston that they have is one that's not only inclusive, but meets every single need of every single young'",
        "'speaker_5': 'person in the city of Boston. I am a product of the youth justice movement here in the city of Boston. I'm elected here to the city council because the youth justice movement in Boston got behind me and made sure that I got elected.'",
        "'speaker_5': 'And it is my honor to steward this amendment on the city council. So I just wanted to thank my colleagues and I wanted to lift up the voices of all of the young people in the city.'",
        "'speaker_1': 'Thank you. Thank you, counsel. Laura. Would anyone else like to speak on this matter? The Chair recognizes. Councilor Baker. Councilor Baker, you have the floor.'",
        "'speaker_8': 'Mr. Chair, just a quick point of of of. Of interest, I guess so we're voting on this is where all of our and this is for much is the people at home as it is for us here we are voting on our amendments now, which is different from the way it used to be.'",
        "'speaker_8': 'Correct. Okay. So. I'm not necessarily in agreement where with some of the direction of the city and in particular down at Mass and Cass, I think that that's going to be basically a money dump for the next 20 years, and I don't think we're ever going to get in front of them.'",
        "'speaker_8': 'The problem I think the people that are down there, the way they're handling with them, we're putting them on a treadmill. And I think it's I don't think it's going to get any better. That doesn't say I hope I don't hope it gets cut.'",
        "'speaker_8': 'I do hope gets better because my ass in cash now is leaking into every neighborhood around it. My neighborhood. Your neighborhood, lower Roxbury. Your neighborhood. Not going to get any better. So. With that being said. This budget's different in a sense, where we you guys, more than me, I think, have been able to add in things that'",
        "'speaker_8': 'are important to you and important to help your neighborhoods, your districts, and you be able to do your job. So I think that being said is good news. So I will be voting in favor of this operating budget here.'",
        "'speaker_8': 'Anxiously looking at how it comes back, how much of what we did yesterday, in the previous days, how much is actually going to come back to us? How much are we going to be able to say we made a difference?'",
        "'speaker_8': 'We were there. And quite honestly, I wish that what we did yesterday, we did with ARPA because the Apple Money is where we can bring things into into District four, where we can help out. Everybody knows what I'm looking to do.'",
        "'speaker_8': 'I'm looking to do the fieldhouse. The fieldhouse is going to be generational change for people. Generational. There's three housing developments that within walking distance, yet unable to get any kind of back and forth with this administration on that issue.'",
        "'speaker_8': 'That would make me want to vote against an operating budget. That would make me want to vote against a capital budget just because of the lack of. Someone coming and asking me who I am, what I, what I want, what you know, what do you think?'",
        "'speaker_8': 'What are your thoughts? It hasn't happened in this in this budget season. For me, $800 billion, $800 million has gone through this floor right here. We haven't had a say on it. None of you have had a say on.'",
        "'speaker_8': 'So that to me is problematic, is problematic of what may what the future looks like with an administration that's not really going to pay attention to us. You know, they're paying attention now because we had those budgetary amendments and we were able to we'll see what happens with it.'",
        "'speaker_8': 'I think the process, because a lot of what we did yesterday, I thought if I one opportunity without the money being that we could have filled a lot of those holes with the money. I hope what we did didn't go in and read budgets of city departments because I consider myself first and I've said this a thousand'",
        "'speaker_8': 'times, I consider myself a city worker first, a good 35 years in the city. I started in real property. I went over the printing department and every year around the budget season I was like, Oh, I hope our boss, the the head of the department, is fighting for us, getting us the money we need, getting us, you'",
        "'speaker_8': 'know, whether it fits, whether it's, you know, cleaning products we needed at the printing department, whether it was whether it was, you know. An extra person to come in and be an extra hand. I hope. I hope we didn't go in and just raid city departments and now they're all going to scramble for figuring out how they'",
        "'speaker_8': 'make that work happen, where they thought the budget was there. Now we went in and are shifting it around. We'll see what happens. I'm interested in seeing what happens, but just wanted to make a couple of points, especially about ARPA.'",
        "'speaker_8': 'This offer here is is a missed, missed, missed opportunity. We're just being told where it's going to be spent. You'll be good with it. Just trust us. Trust, but verify. We haven't had a chance to verify here. His three 350 million.'",
        "'speaker_8': 'You guys are okay with that, right? Yeah. Just improve at the. Send it along. That's a problem. Thank you, Mr. President. I will be voting in favor of this because. Not because of the budget that came from across the hall.'",
        "'speaker_8': 'Because it's the budget that you guys helped to put together. And you guys are going to be able to do things in your districts and in your neighborhoods that are going to help you, because we know as counselors in a smaller, more refined way, I think what our neighborhoods need more than maybe people are a little bit'",
        "'speaker_8': 'removed. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Thank you, Counselor Baker. The chair recognizes. Councilman. Here, Councilman. Here, you have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. This budget season has definitely been a learning experience. Two years ago when I stood up and voiced my opposition to was then referred to as the mayor's budget. We made it clear that we can't be doing business as usual because this isn't the mayor's budget, it is the people's budget.'",
        "'speaker_7': 'And with that, since then, the city council, the city councilors have been working and more importantly, the people. We are now in a position to reflect the voices of the people in our budget process. This first year was a proving ground.'",
        "'speaker_7': 'It was an opportunity to test the waters of these new powers. Because of that, we have been bowled. And we have been sitting through at least. The last few working sessions 7 hours to get to where we needed to be under the leadership.'",
        "'speaker_7': 'Of this powerhouse over here. I feel I'm 6 hours, 16 total, but 7 hours each. It felt like maybe 24 hours roundtrip. But I feel really confident in our ability to fight for things that the people have been demanding.'",
        "'speaker_7': 'A little bit in our process. Every year, our office holds a series of budget pop ups in our community spaces across the city, in barbershops, hair salons, restaurants, schools, you name it. We're there, people. We're there to listen.'",
        "'speaker_7': 'This year, we were able to hear firsthand from residents from across the city about what their priorities are. And through our amendment process, we were able to make those priorities a reality. And I also want to shout out the advocates who have been working fiercely around youth jobs.'",
        "'speaker_7': 'And I am so incredibly happy that Councilor Lotta, as someone who has been in deep community with young people, has been able to deliver on these promises. And there's still so much more to do on that front. And I look forward to working alongside her to get some more money next year.'",
        "'speaker_7': 'And one of our pop ups. We heard firsthand from immigrant business owners about the struggles that they have getting their businesses off the ground. And because of that, we managed to secure. You know, $500,000 to do two things.'",
        "'speaker_7': 'First. We're using some of the funds to create two positions. We will serve as case managers for immigrant businesses. The rest of the funds will be available to small immigrant owned businesses to access resources like web design, logos, banners and other technical assistance that immigrant businesses have.'",
        "'speaker_7': 'I'm not going to go through the whole line item of all the things that we were managed to secure, because I think you all will get the memo. And this is not just about the things that we were able to do as office, but I do want to just take a moment to really highlight that this can't'",
        "'speaker_7': 'be politics as usual and if the council has been given the power. To make amendments. It is really important for the administration. Right. To recognize that power and give us the power to do just that, which is to send back the budget with the needs and wants of this council.'",
        "'speaker_7': 'Right. Anything other than that would be completely unacceptable. And I want to go on the record that what this council has approved is what I will be supporting. Periods and end story and you could rewind. Because this is not the moment for us to say that we want to be collaborative.'",
        "'speaker_7': 'And then send us something that we're going to have to compromise on. And this should not be about The Hunger Games either. Where there is a will, there is a way. And this is an opportunity for us to find the dollars to make it happen.'",
        "'speaker_7': 'And I want to be really clear. As I stand here in support of passing this operating budget. That's, I think. This is our responsibility and our in our opportunity. To rise up and give the people. At the very least, the belief that government is working for them.'",
        "'speaker_7': 'And one last thing that I'll say is that I've been echoing this alongside my other colleagues about the opera funding. Yeah. I am not going to when it comes to that budget approved things that we have not really had a real say because there's a lot of money on the table right now.'",
        "'speaker_7': 'And we need more processes. And protocols and procedures in place to make sure that we get a piece of that pie, too. So with that, I just want to go in favor of supporting this operating budget in a better come back as is.'",
        "'speaker_7': 'Thank you very much. And Madam Chair and Madam Chair, like what you did so masterfully. Masterfully. Right. It is not easy to work with 13 multiple personalities because we all have the. And get us to where we need to be.'",
        "'speaker_7': 'And I just want you to know that the work that you did to get us here, given that this was the first time that we were all doing this. Thank you. And thank you to Florida and Flint for feeding us along the way to really do appreciate that.'",
        "'speaker_7': 'Because, you know, I'm a grub, but not seriously. Let's just make sure that we lean in and we recognize this moment as a collective. Thank you, Madam Chair, for your hard work.'",
        "'speaker_1': 'Thank you, counsel. Here the chair recognizes counsel of counsel book. Thank you on the floor.'",
        "'speaker_9': 'Thank you, Mr. President. And with your indulgence, I just want to spend 2 minutes addressing off topic the ARPA question and then turn back to the docket at hand. I want to emphasize to counselors that, you know, when the administration filed this ARPA docket, their original hope was that we would also be having an ARPA vote today'",
        "'speaker_9': '. That's why it was introduced with the budget. And we are not having an ARPA vote today precisely because my committee is focused on making sure that council is going to saying that. Now, folks may have noticed that there hasn't been a lot of legislative time because we have been going through five major dockets that the Chair has'",
        "'speaker_9': 'just spoken about today. And so we have grabbed every possible hearing slot that was available to consider this, the proposal that the administration proposed. Now, I think it's fair to the administration to have gone through in a series of hearings the proposals they put before us, much like Councilor Anderson sat over 30 hearings on the department budgets'",
        "'speaker_9': 'before we got into working sessions. So it is my hope as the chair of COVID 19 recovery that with hopefully results from today that the Ways and Means Committee is going to be able to release a few holds over to the COVID 19 Recovery Committee so that we can hold some of these working sessions that councilors are'",
        "'speaker_9': 'clamoring for. But I do not, frankly, think it is fair to the committee or to myself as Chair to suggest that the problem mid process is that we haven't gotten where we got at the end of a process with budget.'",
        "'speaker_9': 'So I just I would really appreciate if councilors would maybe pursue their challenges on this differently. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilor.'",
        "'speaker_9': 'And then on Councilor Anderson's docket, and I really do want to congratulate her. I just think. You know, Councilor McInnes referenced the fact that a number of us who are sort of, you know, here together, we were actually not here.'",
        "'speaker_9': 'We were on Zoom two years ago talking about the budget in 2020 and feeling tremendously frustrated by the by the tools that the council had at our disposal, the tools that we discussed. And at that point, we embarked on this process led by Councilor Edwards.'",
        "'speaker_9': 'Now Senator Edwards, to propose. Yes. On one this charter change and. I, I always thought to myself that, you know, I don't know if the council fully knows what we're getting ourselves into because what the yes on one charter change did was yes, it gave the council more power in the budget, but it also gave the Council'",
        "'speaker_9': 'tremendously more responsibility. It is much easier to say, no, no, I don't like not good enough than it is to say, here's what would make this better and actually put your vote on the line to support something that would make it better.'",
        "'speaker_9': 'And it's harder because we live in a world that's a work in progress and nothing is ever perfect. Right. And so I think that, you know, it's a it is a big responsibility for the council to have take it on.'",
        "'speaker_9': 'And I also think that once we passed it and we started looking at it, you know, one of the things that you realize is that so much of how we do the business of government, it's not just in the written legal language, it's also in the norms and the institutions.'",
        "'speaker_9': 'And the reality is that in this budget process, we have been doing something that the Council has no prior norms or institutions for. And I just think that in that context, that Council for understand and has shown tremendous grace in trying to piece that new process together and really saying, hey, we need to use this like we'",
        "'speaker_9': 'need to step into this responsibility. Yes, it's going to be a little bit awkward and it's going to involve all of us saying more directly to each other the different hopes and dreams we have, as opposed to everybody kind of going off and saying it to the mayor's side and hoping that they're the ones who are heard'",
        "'speaker_9': '. And I think that that is harder work for this body and that it is the work of really the democratic representative governance. And so I'm just I'm really grateful to Council for Number Sanderson for leading that and for leading us to a point where, as Councilor Baker said today, we have an omnibus amendment that's being proposed by'",
        "'speaker_9': 'the chair, one which I intend to support. And I a couple of things that are particularly exciting for me about that. Councilor Laura is not here, but I'll just echo her remarks on, you know, I think the youth jobs are probably marginally one of the most impactful things we do with city dollars.'",
        "'speaker_9': 'And so I think the call for us to to meet that commitment in the budget with more further funds was important. Um, I also was really pleased that council that colleagues saw fit to include this 2.5 million further increase in addition to the 2.5 that the administration is putting forward for housing vouchers.'",
        "'speaker_9': 'I think we found that these city housing vouchers are a really great source of sort of flexibility for us to help particular vulnerable populations that aren't well served by the feds in the state. And whether we're talking about, you know, the really project facing and IDP, we're talking about our returning citizens, we're talking about undocumented folks.'",
        "'speaker_9': 'We're talking about how to pilot a new homeownership voucher approach that council has been working on. I think that getting that line item increased in the operating budget is really important. And I think folks know that if if I have had a secret mission, not that secret for the last six years, um, since really coming back to'",
        "'speaker_9': 'Boston, it's been to increase the total amount of housing resources and particularly the total number of resources from the city going to housing. And I think this is another step in that important direction. And then, you know, we've been talking a lot under the mayor's leadership about a Green New Deal.'",
        "'speaker_9': 'I think there's some amazing amendments in the council's proposal here that are part about making that real. So I'm really excited about the idea of these like eight additional people for parks on the tree, that sort of tree maintenance and urban wilds maintenance front.'",
        "'speaker_9': 'Um, I think that's a constant. Speaking to Councilor Vega's point issue for us in our districts. And I also think that as we support the green jobs program of the city is launching, we need permanent parks jobs for folks to land in and not for nothing.'",
        "'speaker_9': 'You know, the Parks Department once set up at like 400 people and now it's that sort of 200 odd. And I just think when we talk about our when we talk about our commitment to being a Green New Deal city and all that infrastructure, it needs maintenance, it needs city workers.'",
        "'speaker_9': 'That stuff that we should be doing here in house in the city, not contracting out. And so I feel like this is a really substantial step in that direction. Similarly, the support for waste reduction work which the city really needs to accelerate.'",
        "'speaker_9': 'Um, another person working on open streets the some a little bit more support for the groundwater trust which sewer is a really important natural resource in my district these and across a number of other districts these just they feel like really important things and that's why I'm hopeful that and I think we have reason to be hopeful'",
        "'speaker_9': 'that this law of across the net by the council will be met with collaboration in the mayor's office. I think that what the slightly different tone I would take from councilman here is just, you know, I do think that there are places here where we can go back and forth collaboratively.'",
        "'speaker_9': 'What I mean by that is, for instance, we proposed that the tree maintenance for people are. In a specific there are specific like job description. If if the arborist and the parks commissioner were to come back to the council and say, actually, for the right kind of tree pruning, we need this different description, like I as a'",
        "'speaker_9': 'councilor be open to that. I think what's nice is that this process has moved that whole conversation into the light, into the public, has let us all kind of like learn along the way about the whys and wherefores.'",
        "'speaker_9': 'Why is this money available and why is it not? And and I'm excited about that process and and not for nothing. The last two years. Each budget season, the argument has been. Between like the concept of the perfect budget and no budget at all.'",
        "'speaker_9': 'And I think that's always set us up with a really crummy false choice where we're kind of hanging out over a cliff, looking at the 112 and saying, is it worth it? And I think that's put everybody in a difficult position.'",
        "'speaker_9': 'And I like the fact that, you know, with the mayor proposing a budget, with us proposing back this amended budget today, which I hope we will in support of the chair and with the mayor then responding, and then an opportunity for the council to respond.'",
        "'speaker_9': 'I think the hope would be that we are working together on perfecting a budget. And so I very much look forward to that work ahead and plan to vote in the affirmative. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Counselor. The chair. The chair recognizes counsel, allusion and counsel. The and you have the floor.'",
        "'speaker_5': 'This president says this budget represents stark investments in opportunities to reimagine our city and what city services look like. Kudos to mayor. This is our first budget. She's a mayor committed to transforming, redesigning and rethinking how city hall works to make it work for the people and for all people, from affordable housing to investments in early childhood'",
        "'speaker_5': 'education and child care. The mayor has been recognizing the urgency of this moment. I commend her and her team, including Jim Williamson, budget director, for all their efforts and also especially for your willingness to listen. I commend Chair for John Anderson.'",
        "'speaker_5': 'I think if nothing, this process has shown how brilliant you are and how you are willing to pour your entire self into this work, not for you, but for the people of Boston and for the people who have often been silenced by our budget and ignored by our budget and whose backs the city has been built.'",
        "'speaker_5': 'So thank you for that. This has definitely been historic. This is our first time in the city council being able to weigh in. And I, I as a new city council wasn't part of the moment where we started thinking about how do we have an influence and impact.'",
        "'speaker_5': 'So I also think all of my colleagues who were here before me really did the fight to make us have this shared power that the people have given us on these amendments to the city budget, help us achieve that shared power, which hopefully will translate to more shared prosperity on some things like investing in the Office of'",
        "'speaker_5': 'Returning Citizens, which we've heard from numerous times, both here and in opera hearings, is important to those who are formerly incarcerated, because that's an officer has never been invested in it was created and never given the power or the or the capacity to really lean into the work of making sure that our returning citizens and formerly incarcerated'",
        "'speaker_5': 'folks have space in this city to really thrive. And so investing in that is sending a signal to the administration that we need to look at all of our city departments and fund them holistically. The budget with the council amendments are fiscally sound and will lead to transforming how our government shows up for people.'",
        "'speaker_5': 'It's saying, you know, we need to rein in overtime. And when Vpd tells us, I was just but went back and looked at their responses to an RFI where I asked, you know, what are the efficiencies? And they talk about all of the things that they're doing to improve that expenditure.'",
        "'speaker_5': 'We should believe them and really hold them to task there. You know, every day is another chance for us to get it right as a city and for us to continue the fight. And so we must continue to push for a budget that invests in building strong communities.'",
        "'speaker_5': 'And this is a start. I don't know. Someone said that this is just the beginning and and there are so many great things that we were able to do as a result of these amendment powers. You know, we're still learning, so making mistakes as we go.'",
        "'speaker_5': 'But I think this is a really great start from funding things like Smart from the start to the quarter to more Hokies, so that all of our neighborhoods, including Dorchester and Mattapan, can look as good as all of our other neighborhoods.'",
        "'speaker_5': 'So supporting a lot of 13 and car five, you know, to supporting immigrant businesses, to supporting our citizens who are immigrant communities, who have faced so many stumbling blocks when it comes to becoming citizens. And so providing them with the resources to legal assistance and has been something that I care deeply about so that they can become'",
        "'speaker_5': 'citizens and making sure that we are not forgetting our immigrant communities when we're doing this work. So I'm just really thankful for this shared power that we now are experiencing alongside a mayor committed to the work, thankful again to chair Fernanda Anderson.'",
        "'speaker_5': 'I will be supporting these amendments and seeing looking forward to the work that will continue to do here. So thank you.'",
        "'speaker_1': 'Thank you, Constable. The chair recognizes Councilor Carter. You have the floor.'",
        "'speaker_5': 'Thank you, Council President. I'll start my remarks just by saying that I'm extremely excited that we are now utilizing our new power. I want to thank the mayor and her team for a great first budget. I want to commend my colleagues for welcoming me, welcoming me into this process with patience as I dove right into the thick'",
        "'speaker_5': 'of it the last three weeks. I especially want to thank you, Madam Chair, for shepherding us through this new found power with grace, authority and humor at the appropriate times. I think on that point, I am grateful to everybody to have been given four, to have the opportunity to articulate my priorities and to showcase the power of'",
        "'speaker_5': 'targeted investments as a statement of our values. And I especially want to uplift in honor now, Senator Edwards, who said, let's break this down and change the system. She leaned in to the work with Armani White. And those who involved and those who were involved in.'",
        "'speaker_5': 'Yes, on one for a better budget. So I just want to uplift them in this work. What we are voting on today is historic. Let us not forget the time and energy it took to get us all here and what we've proposed.'",
        "'speaker_5': 'We do know that some of what's in here is a work in progress. There is still relevant information that needs to be obtained by the administration, and I look forward to working with Mayor Wu and members of our team to iron out the details, especially as it pertains to funds allocated to youth employment and engagement.'",
        "'speaker_5': 'I do believe that that amendment is needed right now in this moment and I think council are for introducing it. What I am most proud of are the significant investments in specific departments and programs that will positively impact East Boston, Charlestown and the North End.'",
        "'speaker_5': 'I'm not going to get into them, but I do hope that I hope and pray that the odds are in my favor and they will remain. So I do plan to vote in the affirmative on this, and I look forward to collaborative conversations in the months ahead with the mayor's office.'",
        "'speaker_1': 'Thank you, Counsel Carter. The chair recognizes. Counselor Murphy. Counselor Murphy, you have the floor.'",
        "'speaker_6': 'Thank you, President. Yes. So as this was for many of us, our first budget season and the first for all of us with the new council powers, I do want to recognize the chair and all of us for the hard work and effort over these past few months.'",
        "'speaker_6': 'We powered through and I am pleased with the amendments that we are presenting to the mayor. Increased funding for senior programing and standalone senior centers, increase programing at our community centers for our youth and teens. A big investment in youth jobs, which is very necessary.'",
        "'speaker_6': 'Addressing the road and problems throughout the city that many businesses and residents deal with in all of our offices, not just council, operate and get lots of calls on them. We all we all get them. We know supporting public safety by bringing back car five, which we know will increase diversity at the top of the department and'",
        "'speaker_6': 'also returning Ladder 13, which will bring quicker responses to ourselves and residents and also bring more supports to those struggling at mass and casts. As a chair of Veterans in Public Health, I am pleased. I'm most pleased with the increased funding for recovery and mental health services, especially for our veterans and young adults who are struggling not'",
        "'speaker_6': 'only with mental health emergencies, but also with the opioid crisis. So I will be voting in support of these amendments today. But I do hope the mayor finds other ways than taking from public safety to support these important amendments.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilor Murphy. Would anyone else like to speak on this matter? I want to take this take this opportunity. To thank the chair of Ways and Means Council, Fernandez Anderson, for the incredible hard work and professionalism that she has shown during this budget process.'",
        "'speaker_1': 'She has worked with our colleagues, with the mayor's administration in a professional manner. In an inclusive manner and making sure our voices are heard and respected in the process. She also has included the public. In a robust discussion to make sure the public voice is heard during the budget process as well.'",
        "'speaker_1': 'It's a difficult job of being the Ways and Means chair, but counsel for them is. Anderson You've done an exceptional job leading. Leading our strongest budget budget process in budget debate. So I want to acknowledge our. Incredible work during this.'",
        "'speaker_1': 'During this time. During this time. Is it as a district councilor? From district to. I'm also concerned about what Councilor Baker has highlighted about the Mouse and Cass area as well. And it certainly impacts my area because I represent the South End in South Boston and Chinatown, and it certainly impacts Councilor Fernandez Anderson, her district as well'",
        "'speaker_1': '. Councilor Baker actually Council Councilor Bach also we share the same area down towards the the Boston Garden, which has some challenges, major challenges. So as I would I would like to see over the next several weeks, too, as we vote for the final budget, I would like to see.'",
        "'speaker_1': 'What services, what programs, what assistance we can provide the area in and around mass and CAS. Because we know that residents are calling us daily about quality of life issues and as district city council councilors. We don't pass the buck and we deal with these constituent calls and constituent requests.'",
        "'speaker_1': 'Every day. And I want to I want to work with the mayor's administration and team on what services, what programs, what assistance we can further provide to the residents in and around mass and chaos. And that's certainly. Roxbury.'",
        "'speaker_1': 'The South End. Dorchester. South Boston. Chinatown. Is further out, but it's impacted. So I'm going to. Hopefully coordinate and work closely with the. With our colleagues, but also with the mayor's office. As we as we continue this debate about what services are are critical in the mountain house area.'",
        "'speaker_1': 'The the quality of life issues that were mentioned already in this budget, including pest control, including inspectors for licenses related issues, whether it's Airbnb, whether it's after hours work, construction, whether it is. Other quality of life issues. But it's the nuts and bolts of of city government is what's important.'",
        "'speaker_1': 'To two district councils in At-Large councils. But we want to make sure that these nuts and bolts issues, these basic city services in this budget are protected because the quality of life for residents is what's really important for for all of us.'",
        "'speaker_1': 'And as we go forward over the next several weeks, I want to make sure that we continue having a meaningful conversation about quality of life issues nuts and bolts, city government issues, city government related issues. So, again, just want to say thank you to Councilor Fernandez innocent during this period of time.'",
        "'speaker_1': 'And also I want to highlight my district council is particularly certainly my At-Large colleagues, but the district city district council has played a critical role during during this budget. And we listened to residents. We have the calls, as did large councilors.'",
        "'speaker_1': 'But we want to continue to focus on basic city services. I just want to acknowledge one of our one of our colleagues as Councilor Council. We're all for the important work that you've demonstrated during this period of time.'",
        "'speaker_1': 'So thank you, Council. We're all for bringing a lot of these political issues to the forefront and for your important work and leadership on the. On the budget as well. But anyone else like to speak on this matter?'",
        "'speaker_1': 'Council. Fernandez Andersson, the chair of the Committee on Ways and Means, seeks acceptance of the committee report and passage of Dorking 0480 in an amended draft. Mr. Korra, can you please call the roll.'",
        "'speaker_2': 'Roll call on docket 0480 as amended? Councilor Arroyo Council. Arroyo Yes Council. A Baker Council. The Baker High Council The Book Council A Book Councilor Brain Council. Brain Council Coletta. Councilor Coletta. Yes. Councilor Fernandez Anderson. Counsel for Ananda Sanderson.'",
        "'speaker_2': 'Yes. Counsel for. Counsel 30 years. Counsel Flynn Yes. Counsel of Flynn Yes. Counsel Lara. Counsel Ah, yes. Counsel Allusion. Counsel Allusion, yes. Counsel Let me hear. Counselor me here? Yes. Counselor Murphy. Yes. Counselor Murphy. Yes. And. Counsel Well, yes.'",
        "'speaker_2': 'Counsel. Well, yes. Dark in number. All 480, as amended, has received a unanimous vote.'",
        "'speaker_1': 'Thank you. 0480 has passed and an amended draft. We're on to something. Yeah. The chair recognizes counsel FERNANDEZ Innocent. COUNSEL You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. I didn't want to close that chapter of this meeting without thanking the administration for their participation in public hearings and for their crucial work behind the scenes, particularly Jim and Joanna and the rest of the budget team.'",
        "'speaker_5': 'Thank you. I am exceptionally grateful for the IG team. I'd like to thank Claire Kelly, Neil Doherty and a very special thank you to Shantel Barbosa. We didn't move any money out of ADR so that you can get a big raise.'",
        "'speaker_5': 'I think you three were you incredible patients for your incredible humility, professionalism. You were there every step of the way. You did your work, you came, you showed up, you never complained. And you really supported my first year as chair on Ways and Means.'",
        "'speaker_5': 'And I thank you. And I think we all here thank you and thank you to my council colleagues for believing in me and for us doing this work together. I really, truly believe that whatever we submitted here for the amendments we all today submitted, all of these amendments we all have passed, or at least for now have'",
        "'speaker_5': 'passed the recommended budget. So I thank you so much and I look forward to my work. Thank you.'",
        "'speaker_1': 'Thank you, Counsel Fernandez Anderson Well-stated. And I also would like to echo especially the comments you mentioned about the Intergovernmental Affairs Team. They've been exceptionally professionalism and very responsive. So I want to echo what you said in thanking the Intergovernmental Affairs Team.'",
        "'speaker_1': 'Um. We're on to motions, orders and resolutions. However, I would like to take one, one docket out of out of order at this time for scheduling issues. So, Mr.. Mr.. Clark, can we go to. Can we go? 20726.'"
    ],
    "LGBTQIA+ Pride Month Resolution.": [
        "'speaker_2': '.0726 Council Operate in Louisiana offer the following resolution designating June 2022 as LGBTQ Plus Pride Month.'",
        "'speaker_1': 'The. The Chair recognizes Councilor Braden. Councilor Braden. You have the floor.'",
        "'speaker_3': 'Thank you, Mr. President. And thank you to my colleagues and for your accommodation. I have to leave for an important meeting very shortly. So thank you so much. May I please seek suspension of the rules in order to add Constable Baucus and original co-sponsor in addition to myself and Council Louisiana, please.'",
        "'speaker_1': 'Hearing no objections. Baucus Order.'",
        "'speaker_3': 'I offer this resolution and recognition, celebration and further commitment to the ongoing and very necessary work. Given June being Pride Month and as I expressed at the start of the meeting, it is an honor that Peggy of Dignity Boston was able to offer the council blessing today.'",
        "'speaker_3': 'LGBTQ, A-plus individuals in particular transgender and gender nonconforming individuals, especially those of color, face a disproportionately high risk of becoming victims of violent hate crimes. And in 2022, thus far, there has been at least 14 transgender people fatally shot or killed by or by other violent means.'",
        "'speaker_3': 'The COVID 19 pandemic has compounded the systemic and inequity of the LGBTQ eye to plus individuals face in health care, employment and housing systems across the United States, which has led to a disproportionate a disproportionate impact on this community and as individuals.'",
        "'speaker_3': 'Recently, the city has made strides towards attaining further equity for LGBTQ two plus members of our community with the Mayor's Inaugural Office of LGBTQ Plus Advancement tasked with developing policies and community oriented programing. We will provide resources for the city's multicultural, multi-generational and multilingual LGBTQ plus community.'",
        "'speaker_3': 'We are very excited to welcome. Quincy Roberts is the executive director leading the office to empower and protect and advance the rights and dignity of the LGBTQ plus residents across the city. And I invite my colleagues on the City Council and across the city departments to commit to furthering the values of Pride Month, not just in June'",
        "'speaker_3': ', but as an interdisciplinary approach to ensuring the needs of the LGBTQ. Plus, folks are integrated into city and council constituent services through an equity lens. Pride Month is a recognition that there is more work to do to enshrine civil rights protections and build a future for all individuals, especially our LGBTQ plus brothers and sisters and and transgender'",
        "'speaker_3': 'community. And while we celebrate pride in our community and in our communities existence, resilience and achievements to date, we must commit, recommit to the work that still lies ahead. As I mentioned last year when I spoke about this, I had never experienced a pride celebration in my life until I came to Boston in June of 29, 1996'",
        "'speaker_3': ', I, I attended the interfaith service at Old South Church, and I'd never been in a house of worship that recognized me, saw me, and celebrated my existence. And I sat there and cried and cried even today. But I sat there and cried as I saw this incredible outpouring of warmth and support for the LGBTQ.'",
        "'speaker_3': 'I. Q Plus, I keep my community in Boston, and I was I had, you know, I was sitting there, the tears running down my cheeks, and this really nice Irish guy from Dorchester was keeping me and the tissues and holding my hand.'",
        "'speaker_3': 'And I was like, This is incredible. And then I walked out the door and I bumped into the mayor of Boston with a police color guard and LGBTQ. Color guard and I've got like blown away. Like I come from Northern Ireland where you went to the Pride Parade and you had a bag over your head because you'",
        "'speaker_3': 'didn't want to be recognized, because you could lose your job, you could be discriminated against, you could be physically abused and assaulted. It was very different. And but I also want to say that in this moment with the with the attack on the woman's right to choose and have access to a comprehensive woman's health care, including an'",
        "'speaker_3': 'abortion, is a movement in this. And there's a movement in this country to sort of push us back into the shadows. There's a movement in this country to make us go back into the closet and hide. There's a movement in this country that tries to not not give us our rights as equal citizens.'",
        "'speaker_3': 'So I really feel that in this moment, we have to reaffirm our commitment to recognizing our LGBTQ close brothers and sisters. And really. Dig in and affirm the dignity of all human beings, but especially the members of this community and in this moment.'",
        "'speaker_3': 'So I thank my co-sponsors for joining me in this, and I ask the city council to support this resolution. Thank you.'",
        "'speaker_1': 'Thank you, counsel. Bret and the chair recognizes counsel. Illusion, little console, illusion. You have to fall.'",
        "'speaker_5': 'Thank you, Mr. President. And I want to thank you for thinking of me and adding me to this. And I want to thank you for the grace that you both you and your partner have showed to me from the very beginning.'",
        "'speaker_5': 'I really appreciate it. This, for me, in this space, actually has has a lot of meaning, because in my early twenties and my friends and I were I think I told the story before were thrown out of a nightclub in Boston because we were black.'",
        "'speaker_5': 'And it really was a drawing experience for me. You know, we faced discrimination, of course, as black people trying to attend nightlife or go to clubs in Boston, but never to the extent that we experienced it that night.'",
        "'speaker_5': 'And I remember, you know, then Councilor Pressley finding out about it and asking me to come testify before city council. And I was sitting here and I remember it very clearly. I'm sitting right where I was sitting and next to me.'",
        "'speaker_5': 'And it was just it was a panel about discussion about discrimination in the city of Boston. And next to me was a trans activist who talked about his experience of discrimination in the city of Boston. And after I gave my testimony, I really forgot what I said because of how much I had learned from the person sitting'",
        "'speaker_5': 'next to me. And that person is someone who has continued to be someone in my life that I think about and reach out to when it comes to issues affecting our LGBTQ community, I came here, you know, sharing information about my own experience and really understanding how intersectional all of our issues are and how interdependent we are'",
        "'speaker_5': 'all on our each other for our for our freedom. And so that sitting here in this city council more than a decade or so ago and having coming full circle and co-sponsoring this resolution means a lot to me.'",
        "'speaker_5': 'You know, a person who sat next to me no longer lives here in Boston, but I reach out to him from time to time to just, you know, tell him about the work that we're doing here on the council and how just influential he was in elevating the needs of all the communities, really, that are too often'",
        "'speaker_5': 'sidelined and silenced here, but particularly the LGBTQ plus community. And for him, the trans community here coming off of last weekend where on city hall there was a celebration of liberation for our trans community, led by trans wonderful trans activists and folks here.'",
        "'speaker_5': 'I just am so grateful that we have such voices elevating issues that matter most to our LGBTQ plus community. And I think, you know, Quincy Roberts is going to do an amazing job at the Office of LGBTQ Advancement, Jessie Bowman, who put on the celebration of liberation that honored leaders in the community like Grace and Usher, and'",
        "'speaker_5': 'so many people who put out so much of themselves to make sure that especially our trans women, our trans women of color are stunted when we talk about issues of health and housing. So, you know, this is a month of celebration and there's so much to celebrate, but it's also a reminder of the work that we have'",
        "'speaker_5': 'to do. And so I hope to always show up as an ally in the work and to be a good ally and to be steered when, you know, allies need to be steering. And I just am grateful for the opportunity to co-sponsor this resolution.'",
        "'speaker_5': 'So thank you. Consecrated.'",
        "'speaker_1': 'Thank you, Constitution. The chair recognizes counsel. Counsel. Bork, you have the floor.'",
        "'speaker_9': 'Thank you so much, Mr. President. And thank you so much to Counselor Braden for inviting me to join you and Councilor Lucian as a co-sponsor. And I think, as you've already heard from my colleagues, that, you know, this is a moment where we intermingle joy with a sense of danger and a need for renewed resolve and on'",
        "'speaker_9': 'behalf of our liberty. Q I was community I, I have to say that it's a community that's very special to me. I think that I think I might be one of. One of sort of the first generation of American kids to ever grow up in a majority LGBTQ community.'",
        "'speaker_9': 'I grew up in Bay Village, also known sometimes as Gay Village. It was this. It was the overflow of the South End's gay community at a time where that community was still stigmatized, still living in the shadows. Still to come, solutions point trying to create spaces of their own where they could be themselves.'",
        "'speaker_9': 'And and what's so interesting for me is that I didn't know that initially growing up. What I knew was the tremendous community of love that these people had structured because our LGBTQ parents were not mostly able to adopt and be parents.'",
        "'speaker_9': 'Yet it meant that I had all of these kind of aunts and uncles growing up in a village looking out for me and and just getting to know God belonging to a church that was one of the first kind of LGBTQ friendly churches in the city.'",
        "'speaker_9': 'And, and getting to know sort of the gay softball league as a norm and kind of like growing up in this context of joy. And then only as later as an adult really, you know, talking with and learning from these like, you know, mentors of mine in the community and really understanding, oh, when, you know, when we'",
        "'speaker_9': 'founded that softball league, we lost half the team to AIDS one year. Right. And, you know, when those like places that were we used to have the Bay Village Neighborhood Association Christmas party in gay club Napoleon and just understanding that those spaces had not even been allowed, had been shut down by the police, were not places that'",
        "'speaker_9': 'people could be. It just it it always reminds me that we've come that whole distance, even just in my lifetime. Even though I wasn't as aware of it when I was a kid, what I was aware of was the the tremendous love and mutual support that the LGBTQ community built up around each other and so many others'",
        "'speaker_9': 'at a time when our systems were not stepping up. And so I think it's a huge thing when the official system step up, when we get something like the LGBTQ office that the mayor is founding and that we're funding in this budget.'",
        "'speaker_9': 'Not to you know, I think it's worth saying that the budget that we voted on today includes the first funding for such an office, and that one of the council amendments that we just supported was to increase that even further.'",
        "'speaker_9': 'But I also think that that's structural. Those structural wins are hard won and they're not secure. As Councilor Braden said, they're not secure nationally. And I just in my last, I would say like 15 years have gotten to know so many trans individuals who still really bear the brunt of a very similar experience and an experience that'",
        "'speaker_9': 'unfortunately has not become better of what our other folks in the gay community were experiencing 30 years ago. And so I just really want to say in this pride, like I let's re commit ourselves both to that fight and and to the joy and incredible upwelling of love and and.'",
        "'speaker_9': 'Tremendous example that the LGBTQ community gives us. And I want to just shout out. I try to always shout out in these contexts here in City Hall, the employee resource group here, because they're doing so much to support all of our employees, everyone us.'",
        "'speaker_9': 'Emily Brown, my chief of staff, is on the executive committee. I'm along with a number of other really fantastic folks. And I just want to stress that even here in City Hall, we have a significant number of LGBTQ plus employees who are who are not out.'",
        "'speaker_9': 'You know, and I think that that it's just a testament to the fact that we have to not just be supportive in what we see as LGBTQ spaces. We have to be supportive and welcoming and building these structures of acceptance in in all of the spaces that we are in all the time.'",
        "'speaker_9': 'So I'm hoping to dedicate myself to that in Pride Month. And thank you so much, Mr. Chair.'",
        "'speaker_1': 'Thank you. Council BLOCK. The chair recognizes. Counsel me here. Counsel me here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you to the sponsors. This is so. This is the first time on my council that I am not one of the co-sponsors of this. So I just really want to rise in support to just share my deep gratitude for this resolution that's being put forth today.'",
        "'speaker_7': 'As someone who started my career in youth development and the amazing privilege of working with Grace at Bagley and so many other nonprofit organizations that taught me so much about what it looks like to be truly embraced and what the real meaning of all means all was really all about, especially for so many young people who are'",
        "'speaker_7': 'experiencing so much here in the city of Boston. So I just wanted to add my name, and I also wanted to uplift my staff, in particular, Jacob Blake, who has taught me so much about what it means to be a fierce advocate for the LGBTQ community here.'",
        "'speaker_7': 'So much so that when we filed a resolution around reproductive rights, Jacob was so incredibly adamant about making sure that we talk about being gender inclusive of that language. And so when you think about the work that needs to be done here on the council and you think about the the staff that is behind so much of'",
        "'speaker_7': 'that work, it is important for us to recognize that we're only as good as the staff that we have. And when we have staff who are living the realities and doing the work, that we are better for that.'",
        "'speaker_7': 'So just want to give a shout out to to all of the efforts that my team makes every single day for us to make sure that we show up. I'm so pleased that my name. Thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilman. Here with anyone else to speak on this matter? The D chair. Would anyone like to add the name? Please raise your hand. Mr. Kirklees council. A Royal Council Baker. Console collector console Fernandez Anderson console clarity console.'",
        "'speaker_1': 'Lara, console me here. Console Murphy, please. Out of the chair. Councilor Braden. Council illusion in Council Book six Suspension of the Rules and Adoption of Docket 0726. All those in favor say aye. Aye. Opposed nay. The ayes have it.'"
    ],
    "Hearing on Fire and Emergency Disaster Relief Services.": [
        "'speaker_1': 'The resolution has been adopted. Congratulations. Mr. Clarke, we're going we're going to 0723. Mr. Couric, please read Dr..'",
        "'speaker_2': '0723.0723 Counsel allusion and Flurry offered the following order for a hearing on fire and emergency disaster relief services in the city of Boston.'",
        "'speaker_1': 'Thank you. The chair recognizes counsel Lewis and counsel to adjourn. You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. I'd like to ask that we suspend rule 12 so that I can add a rate as a third and a co-sponsor.'",
        "'speaker_1': 'The hearing. No objection. Counsel. Braden is so, so adamant.'",
        "'speaker_5': 'Thank you, Mr. President. I believe with you, Mr. President. We just spoke about getting the the nuts and bolts of city government. Right. And so this hearing water really is about that. I'm sorry. I'm not speaking. I passed it.'",
        "'speaker_5': 'So this hearing water really is about getting that right, you know, every day. You know, too often in the city of Boston, we have our residents who are displaced because of fire. You know, one of my early cases as an attorney was helping a family navigate the experience of losing their home to a fire and really working'",
        "'speaker_5': 'with the city departments to get that client shelter. Really taught me a lot. But not just shelter, access to resources, making sure that they were close enough to the hospital that one of our children went to so that he could receive dialysis.'",
        "'speaker_5': 'There was so much involved in once a family is displaced from a fire, oftentimes landlords that are required to maintain insurance don't do that. And they're supposed to be able to provide relocation benefits to their tenants. But that doesn't always happen.'",
        "'speaker_5': 'And so this hearing order is about figuring out how we get it right. How do we show up for our vulnerable residents who face fires, you know, analyze Boston's fire incident reporting system? Does it have any quantifiable, quantifiable data on the injuries or displacement numbers?'",
        "'speaker_5': 'And we know the city of Boston has an emergency assistance fund for victims of fire, that we need to do more work to make sure that we're supporting all of our residents. There were recently there's recently a fire in Mattapan, and there were young leaders from the Mattapan teen center that held a bake sale because we were'",
        "'speaker_5': 'falling short as a city in providing for this family. There have been multiple occasions where families who had nowhere to go showed up in our office. Shout out to my chief of staff, Emily, who is, you know, does a great job at triaging that issues.'",
        "'speaker_5': 'But we have to do better at providing the basic city services to our residents who are experiencing fires. So this hearing order is about bringing our different city departments together to make sure that we're providing adequate city services, that we are using this emergency assistance fund that we have.'",
        "'speaker_5': 'And looking at the modeling, Cambridge, Cambridge has a fund that sort of Cambridge has a fire relief fund that residents, public and private entities and others can donate into in order to assist those facing displacement and fire. This is not by no means to supplant the work has done in community, to really help those who are who'",
        "'speaker_5': 'who face violence, really, to try to bring all those resources together and so that we maximize our impact on our families that experienced fires, especially for our tenants who are renting and renting in subpar units, often feel this the most.'",
        "'speaker_5': 'So thank you so much to my co-sponsors, Councilor Flaherty and Councilor Reading, and I look forward to this hearing. Thank you.'",
        "'speaker_1': 'Thank you, counsel. Again, the chair recognizes counsel, clarity, counsel, clarity of the floor. And I'll be brief, obviously, that I appreciate the lead sponsors inclusion of me on this as a co-sponsor. It's done a lot of work in this space and not quite sure whether or not it's quiet because folks that I give folks my name a'",
        "'speaker_1': 'number or if it's the board of companies that do it. But nonetheless, we are oftentimes in the middle of this working either with the landlords or more particularly the tenants, particularly those that don't have tenant insurance. So more needs to be done, I think in the space, any time an incident like this happens, more often than not'",
        "'speaker_1': ', individuals or families, they lose everything in a fire and they're starting from scratch. And so anything that we can do, assisting them with housing, working closely with neighborhood services, working closely with Inspectional services, all of those different agencies and organizations and resources, we have a responsibility to do that for residents.'",
        "'speaker_1': 'And so with that, I look forward to an expert adhering to find ways that we as a council can continue to help individuals who are displaced due to fire and or those that have lost everything in an effort to help them get back on their feet and find resources so they can keep a roof over their head'",
        "'speaker_1': 'and start to get back to life as they knew it prior to the fire. Thank you, Mr. President, and look forward to work with my colleagues next to counsel religion. Thank you. Counsel Florida. The chair recognizes counsel Baker.'",
        "'speaker_1': 'Counsel Baker, you have the floor.'",
        "'speaker_8': 'Thank you, Mr. President. Just please sign me on here as a district city council. This is unfortunately something that we come across too often. We only offer these families that are displaced in the street one week worth of housing.'",
        "'speaker_8': 'We need to offer more than that. But also, counsel already had mentioned the board of the boarding up companies just a heads up two people that our district city council has the at large for that matter they are the pariah in this here.'",
        "'speaker_8': 'If you go to a if I see them all standing with their clipboards, they use that as an opportunity to to put a lean on those properties. So just so people know what, when you're on the scene and you see the guys with the clipboards, they're they're looking to steal the house most of the time looking to'",
        "'speaker_8': 'steal the house from the people that are watching it burn right now. So just so people put in the back of their minds and please sign my name.'",
        "'speaker_1': 'Thank you, counsel Baker. Is anyone else stopping to speak on this matter? Would anyone like to add their name? If you could raise your hand. Mr. Kirklees Council. Royal Council. Bacup Council. Borough Council. Fernandez Innocent Council. Borough Council.'",
        "'speaker_1': 'Me here. Council. Murphy please have the chair originally. Originally I was going to place this docket into the into the Committee on Public Safety and Criminal Justice. But after further discussion and consideration, I'm going to place this in city services and innovation technology.'"
    ],
    "Hearing on Audit for Boston Public Schools Special Education Services.": [
        "'speaker_1': 'Thank you. Mr. Clerk, please read docket. 07240724.'",
        "'speaker_2': 'Council on Me offer the following order for a hearing on an audit for Boston Public Schools Special Education Services and return on investment.'",
        "'speaker_1': 'Thank you. The chair recognizes. Councilman. Here, Councilman. Here. You have the floor.'",
        "'speaker_7': 'Yes, counselor. President Flynn, I know that my colleague has. What have I co-sponsors? Also has a time commitment. So, given the fact that I've done a lot today, I would like to ask if you would be willing and my co-sponsors who are going to be joining me would be willing to allow us to bring up give my'",
        "'speaker_7': 'colleague an opportunity to talk about both. I know I said no at the beginning, and I'm switching it up just because of time. I didn't know that we would be here until 4:00 today. So with that said.'",
        "'speaker_1': 'Mr. Clerk, please read the the added docket, please.'"
    ],
    "Hearing on Boston Public Schools Transportation System.": [
        "'speaker_2': 'Talking about 0725 Council on Me here offer the following order for a hearing regarding the Boston Public Schools Transportation System.'",
        "'speaker_1': 'The chair recognizes. Counsel me here.'",
        "'speaker_7': 'President Council, President Flynn. You see why you're so dope. Thank you. I appreciate Your Grace. Thank you. And I want to thank my colleagues. But well, let me first read this, because I need to know who my co-sponsors are.'",
        "'speaker_7': 'Right. So thank you, Mr. President. I'd like to suspend the rules and ask an ad counselor, Laura and Counselor Anderson to join me as co-sponsors for the Special Education 144.07.'",
        "'speaker_1': 'OC 40724. Counsel Vara and counsel Fernandez Andersen are are added hearing no objections.'",
        "'speaker_7': 'Okay. Thank you. I'm going to read the second one that I am 40725. I would like to suspend the rules and add Councilor Lara and Murphy as co-sponsors.'",
        "'speaker_1': 'Hearing. No objection. Counsel O'Hara and Counsel Murphy are so out of it.'",
        "'speaker_7': 'Okay, great. Okay. I'm trying to figure out how I'm going to do this with both. I'm going to have a little bit of technical assistance here. But really quick with the audit for the Boston Public Schools Education Services and return on investment.'",
        "'speaker_7': 'This is where I believe the moment in time that we've been talking about as it relates to Boston Public Schools. This is where we have an opportunity to really lean in and support through real, meaningful partnerships with the council and our in our ability to help support and hold ourselves and the district accountable to providing oversight that'",
        "'speaker_7': 'will ensure that the money that we are proving to be spent are going to be spent and that we're going to see the return on those investments as it relates specifically to the budget and the supports for special education services.'",
        "'speaker_7': 'You know, according to BEPS as of October 2020, there are about 11,350 students aged 3 to 21 with disabilities, 21% of our total enrollment enrolled in special education programs and BEPS. The f y 23 recommendations budget for special education was over 351 million.'",
        "'speaker_7': 'Many advocates and administrators agree. At this point, it's not a question of resources. We are a resource rich, poor, coordination, poor. And students across the district are not having many are not having their IEP met and IEP needs met.'",
        "'speaker_7': 'Staffing rates making it difficult to provide a full range of services. Transitions at the top. Making it a bigger challenge to provide strategic vision to help support and provide care and services to our students. And so we're failing this hearing already because the conversation on how we support our special education students cannot begin and end with a'",
        "'speaker_7': 'budget. Like, really, this is where I oftentimes believe that we fall short. I look forward to this conversation and to working alongside my colleagues who both have been fierce advocate in the education space. And then the last thing that I'll say in terms of transportation, I myself, as a parent have gotten over 25.'",
        "'speaker_7': 'Notifications between January to me that my daughter's school bus was either going to be delayed or not going to show up at all. Luckily, I have the resources and a village that helps support me, but I also have received countless of communication from other parents with their frustration and their level of just.'",
        "'speaker_7': 'A contempt for the way we are doing business as it relates to the transportation situation. We spend roughly 10% of our entire budget on transportation and over 110 million and a half Y 23 alone. That's over 4 million that we spent last year.'",
        "'speaker_7': 'And we're bussing fewer students than we did last year. The Boston Public Transportation team has struggled with hiring bus driver retention problems, which have led to bussing being late or not arriving at all. And we also have seen how this has impacted our out of school athletic events.'",
        "'speaker_7': 'It is clear that we need to take a deeper dove into the transportation without all the flashy PowerPoint presentation and jargon. This conversation needs to be live beyond the budget season, and I believe that if we could really do this work and lean in and figure out how we can be partners and being able to help hold'",
        "'speaker_7': 'BP accountable, but also hold ourselves accountable to their success, then only then will we really be able to move the needle. So I look forward to joining my colleagues in this robust conversation, and I look forward to the President's recommendation on what happens after I speak because I choose to that point.'",
        "'speaker_1': 'Thank you. Thank you, Councilman. Here on docket 0724, the chair recognizes counsel Lara. Counsel Lara, you have the floor.'",
        "'speaker_7': 'Thank you, President Flynn. And in the.'",
        "'speaker_5': 'Interest of time, I'm only going to be speaking once on both dockets. So at this point, everybody here on the council and people across the city have heard me speak in support of not only our Boston public schools but.'",
        "'speaker_7': 'Against specifically state receivership.'",
        "'speaker_5': 'Naming specifically that I believe that Mayor Wu.'",
        "'speaker_7': 'The city council, the incoming superintendent, and soon.'",
        "'speaker_5': 'The elected school committee should be given the opportunity to fix the problems.'",
        "'speaker_7': 'That we have.'",
        "'speaker_5': 'In our schools and really do the work to make them joyful places of learning that we know that they can be. This is a moment for the Council to be in solidarity not only with the parents, the students, the teachers and the administrators and VIPs, but also with the mayor's office and stand against state takeover of our'",
        "'speaker_5': 'public schools. And for me, solidarity is a verb. So I consider this to be an all hands on deck project. And, you know, my colleague.'",
        "'speaker_7': 'Council, Flaherty often.'",
        "'speaker_5': 'Says that we need to have both hands on the wheel. And this is the moment where we need to have both hands on the wheel that if we're going to pass this budget and we're going to make sure we're asking to be given the opportunity to do the work that we have to do, the work that we'",
        "'speaker_5': 'have to make sure that our schools are functioning at the level that they're supposed to, that our investments are going in the places that they need to, and that we, not the state, have the opportunity to come up with the solutions that are going to be necessary for our children.'",
        "'speaker_5': 'My son Xavier is autistic. He's a special needs student at BIPs. He's six years old going into first grade and similar to my co-sponsor, Councilor Mejia. Oftentimes the bus is late or it doesn't show up. And I'm grateful that I have a car that I can drive to school.'",
        "'speaker_5': 'But everybody here has had to pay the price of me being late to a hearing or not being able to show up at all because of it. And so I am in support of our public schools, not because I think that they're perfect, but because I know that we are going to be able to come up with'",
        "'speaker_5': 'the best solutions possible to fix those issues. As one of, I think only two people on the council that have students who are currently in the decisions that we make here very, very much directly impact me and my family.'",
        "'speaker_5': 'And so I want us to be thoughtful and I want us to be gracious, but I also want us to put both hands on the wheel, which is why I'm excited to do this work with Councilor Me. He has the chair of the Education Committee at the helm.'",
        "'speaker_5': 'Thank.'",
        "'speaker_1': 'Thank you, counsel. Laura, the chair recognizes on docket 0722 for counsel Fernandez Anderson. Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_5': 'And thank you to the original co-sponsor on this docket and my co-sponsor, Cancellara, as well. It is incredibly vital that we provide first class, high quality special education services. However, for us to know the nature of these problems, whether the money being put towards said programs and services is being well spent, we need more information.'",
        "'speaker_5': 'We all have anecdotal story stories that great of great successes or horrific failures in this area, and those are not to be dismissed. But what is needed is a comprehensive, concrete breakdown of services, provided the costs of services provided and the positive impact or lack thereof, and that the student acquired by accessing the services.'",
        "'speaker_5': 'And I say this knowing that we cannot analyze this data in a vacuum, for there are a variety of socioeconomic issues that are influencing and impacting our youth. But it is imperative that we gain a better understanding of what services our youth are being offered.'",
        "'speaker_5': 'I thank you again, the original co-sponsor, and thank you and look forward to this work. Thank you.'",
        "'speaker_1': 'Thank. Thank you, Counsel Fernandez Anderson. The chair recognizes Counselor Murphy. Counsel Murphy.'",
        "'speaker_4': 'You can call President Flynn.'",
        "'speaker_6': 'So our office gets countless calls and emails from concerned parents that their children are being stranded at bus stops. We get these calls several times a week. We have 22,000 students on busses each day. Yet on average, 2% of these students, around 442 children are not picked up, forcing them to arrive late or miss school entirely.'",
        "'speaker_6': 'That may seem like a small number, but one child is too many to be left at a bus stop. To make matters worse, most of our students that are on busses and have 1 to 1 monitors are on IEPs in our ESL students.'",
        "'speaker_6': 'These vulnerable students benefit the most from our schools, but with our transportation problems, we fail these students and the families. This is why I am happy to co-sponsor this motion for a hearing in regards to the Boston Public Schools Transportation System in hopes that this ongoing problem is not only addressed but also starts to get solved so'",
        "'speaker_6': 'that our students and families don't have to lose out. I also want to mention that we also have heard in the news and many calls our office also gets about the busses in the afternoon that are stranding our very few students who participate in athletics and they're missing sports.'",
        "'speaker_6': 'And other teams also have to forfeit games because we're unable to get our student athletes to events. So thank you.'",
        "'speaker_1': 'Thank you. Thank you, Councilor Murphy. Would anyone else like to speak on this matter? I would like to briefly state that. I think this is an important fold. Both are important hearings, especially services for special education. In our public school system.'",
        "'speaker_1': 'You know, I wanted to highlight my sister's. My sister's son also has a special needs child. Out of, out of out of Burning Tree. And I know the critical role. That special education plays in the lives of families.'",
        "'speaker_1': 'And I also know Counsel Laura has been exceptional. On this issue as as all my colleagues, including Councilor Murphy, to educating, educating so many children. Um, and I highlight my, my nephew because my, my parents have watched him for about three or four days a week, usually when my sister's working, but they're not able to do it'",
        "'speaker_1': 'anymore just because of their. My my parents have not been feeling well, but I, I do know the incredible role that parents and grandparents play in educating our special needs children. And our parents and parents like console are they're really unsung heroes in our city of of the love and compassion they provide.'",
        "'speaker_1': 'So many, so many children recording, including all of Boston Public School teachers as well. So I just want to highlight the incredible role families play on this issue. So. On Docket 0724. Would anyone would anyone like to add the name on 1.0724?'",
        "'speaker_1': 'Please raise your hand, please. At Council of Royal Park and Religion Media Murphy to cheer Dawkins 0724 will now be added to the Committee on Education. Mr. Clarke, we're going on 20725.'",
        "'speaker_7': 'But I.'",
        "'speaker_2': 'Think.'",
        "'speaker_1': 'It's a. Oh, yeah. Oh yeah. Oh yeah. And on talking 0725. Please raise your hand. If you'd like to be added to.'",
        "'speaker_7': 'The.'",
        "'speaker_1': 'Council BLOCK Council, Royal Council. Fernandez Anderson Councilors and Council Councilor Murphy in the Chair. Councilman here. The chair recognizes. Councilman here. Councilman here? Yes. You have the floor.'",
        "'speaker_7': 'Thank you. President, I have to stand up and thank you. I just wanted to ask if it's possible to put it into the Government Accountability and Transparency Committee. Because what I really want to do is start moving a lot of the conversations that we're having about the budget and supports and BEPS to the post audit.'",
        "'speaker_7': 'And that is what the committee is set up for is to do to talk about post auditing and transparency. And so I just would like to advocate that that specific these to dockets are more in regards to transparency and accountability, even though they're education related items.'",
        "'speaker_7': 'So I just want to ask if that would be possible.'",
        "'speaker_1': 'Okay. Thank. Thank you, Councilman, here. We did discuss earlier that it could go to either committee. But having heard the recommendation, we will assign it to your committee. Councilman here. So government. Mr. Chair, please assign it to Government Accountability and Transparency Committee on seven.'",
        "'speaker_1': 'On on the docket 0724 in on docket 0725.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'We are. We are on. Okay. We're on. We're on two personalities. Mr. Clerk, please read docket 0727.'",
        "'speaker_2': 'Duncan number 70727 Council of Flint Full Councilor for an end of.'"
    ],
    "Home Rule Petition for a BPL Branch in Chinatown Affordable Housing Development.": [
        "'speaker_1': 'Mr. Clarke, would you please read to 0505 and to the record, as Councilor Royal mentioned, it should be on page 12. Yes.'",
        "'speaker_2': 'Page ten from the Committee on Government Operations, Duncan Number 0505 message in order for your approval, a home rule petition to the General Court entitled Petition for a Special Law regarding an Act relative to creation of a branch of the Boston Public Library within an affordable housing development at Paracel or Dash one in the South Cove Urban'",
        "'speaker_2': 'Renewal Area in the Chinatown section of the city of Boston.'",
        "'speaker_1': 'Mr.. Mr. Clarke, can you please poll the committee members to see if if they would allow the doctor to come before the body?'",
        "'speaker_2': 'Members of the Government Operations Committee. Counsel Arroyo.'",
        "'speaker_8': 'Yes.'",
        "'speaker_2': 'Counsel Luis Yen. Sorry. Country Council, the Royal Council, the Media Council, the Book Council for Clarity and Council a color collective.'",
        "'speaker_1': 'The Docket 0505 is now properly before the body. Councilor Roy, you have the floor.'",
        "'speaker_8': 'Thank you. Council President Flynn, this home rule petition will allow the Boston Redevelopment Authority doing business as the Boston Planning and Development Agency to ground lease the BPA owned vacant land to a developer selected by a RFP process using state and federal funds to fund the development of affordable housing.'",
        "'speaker_8': 'Because of the limited buildable land in Chinatown, this project would create a space that would be conveyed to the Boston Public Library, creating the much awaited Chinatown Branch Library within this development. The passage of this docket relies on very much the same issues that were faced by Docket 0707.'",
        "'speaker_8': 'You might remember that from like 4 hours ago regarding an extremely structured sub bid process. However, also constructing a library within a nonprofit development requires exceptions from the Commonwealth contract procurement and award laws. So due to the matter of urgency with the state legislature ending their sessions in July as chair of the Government Operations Committee and suspension'",
        "'speaker_8': 'of the rules to pass 505, which will hopefully with passage and with passage to the State House. Bring us the Chinatown Branch Library.'",
        "'speaker_1': 'Thank you. Counsel Royal Counsel. Royal moves for passage of docket 0505. All those in favor say I. I say nay. The ayes have it. Docket 0505 has passed. The chair recognizes.'",
        "'speaker_8': 'Oh, no. Sorry.'",
        "'speaker_1': 'Okay. Okay. Anyone else like to remove anything from the green sheets? We're on to the consensus consent agenda. I have been informed by the clerk that there are no additions to the consent agenda. The Chair moves for the adoption of the consent agenda as presented.'"
    ]
}