{
    "Donation from Boston Public Health Commission.": [
        "'speaker_0': 'Thank you. Docket 1274 message. In order to accept the benefits of the City of Boston, Mayor's Office of Emergency Management, a donation of a shower trailer from the Boston Public Health Commission Commission valued at $38,781.'",
        "'speaker_1': 'Thank you so much. The Chair recognizes Councilor Arroyo, chair of the Public Health Committee Council, where you have the floor.'",
        "'speaker_3': 'Thank you, Madam Chair. This is a one time transfer of property and a shower trailer from the Boston Public Health Commission to the Mayor's Office of Emergency Management. The Office of Emergency Management plans to utilize a trailer for decontamination after disaster and emergency responses.'",
        "'speaker_3': 'As Chair of Public Health, I ask that the City Council suspend the rules and pass this docket.'",
        "'speaker_1': 'Thank you so much. Council Royal six suspension of the rules and passage of Docket 1274. All those in favor say I.'",
        "'speaker_3': 'Am.'",
        "'speaker_1': 'Any opposed. Nay, the ayes have it. Docket 1274 has been passed. We will now move on to reports of public officers. Madam Court, could you please read Docket 1275?'"
    ],
    "Task Force to Address Literacy Rates Ordinance.": [
        "'speaker_1': 'Thank you so much. Dr. 1275 will be placed on file and we will now move on to reports of committees. And Madam Clerk, could you please read Docket 0600 Docket 0600?'",
        "'speaker_0': 'The Committee on Government Operations, to which is referred on April 28, 2021. Docket number zero 600 Ordinance to create a task force to address literacy rates in the City of Boston, submits a report that the order ordinance ought to pass in a new draft.'",
        "'speaker_1': 'Thank you so much. The chair recognizes Councilor Edwards, chair of the Government Operations Committee. Councilor Edwards, you have the floor.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_2': 'This legislation is the hard work of our colleague, Councilor me. The proposal to establish a task force on literacy rates in the city of Boston. And the.'",
        "'speaker_5': 'Purpose would be to study rates.'",
        "'speaker_2': 'Of illiteracy across the city, to develop a plan to help adults, as well as children who are not able to read or write or access city services and to recommend programs that not, um, that help to eliminate illiteracy, but also help to advance and make our city more accessible to those individuals.'",
        "'speaker_2': 'It establishes a membership of a task force and terms. The ordinance also provides that members of the task force who are not employees of the city will receive a stipend of $100 per meeting not to exceed $50,000 per year.'",
        "'speaker_2': 'Highly unlikely that we'll get that many meetings in, but the proposal also outlines the responsibilities and authorities of the task force. I would like to turn it over with your permission, to the lead sponsor and advocate for this proposal, and I recommend that this task force pass in an amended draft.'",
        "'speaker_1': 'Thank you so much. The chair recognizes councilman here. Councilman here. You have the floor.'",
        "'speaker_5': 'Thank you, Madam President. So good to see you. Back in the chamber. Caught me off guard here. So I just would like to first say that when we filed this ordinance back in April, we all need to acknowledge the tremendous privilege we all have that allows us to communicate with each other on a daily basis through emails'",
        "'speaker_5': ', text messages, city forms, and other paperwork. Both my mom and I came to this country from the Dominican Republic not being able to speak, read or write in English. My mother never got beyond an education past the third grade and to this day even struggles to read and write, even in her own native language.'",
        "'speaker_5': 'This is a reality for many families across the city of Boston. But this conversation is so much bigger than just what is going on with our immigrant friends and neighbors. We also need to be talking about the school to prison pipeline and those who experience interrupted education.'",
        "'speaker_5': 'The data is clear across the U.S. 85% of juveniles who interact with the court system struggle with reading and writing. And 60% of the nation of our nation's inmates who are incarcerated have little to no literacy. We need to be asking ourselves, as elected officials, what are we doing to ensure that folks reentering our society are set'",
        "'speaker_5': 'up for success in all aspects of life, but especially when it comes to reading and writing. A little bit of history as to who as to how we got here when we filed that ordinance, our language access efforts, which passed earlier this year.'",
        "'speaker_5': 'We wanted to put into that policy a set of standards for how to engage people who cannot read or write in any language. We received word from the administration that the city was not ready to implement these standards because we did not know enough about literacy rates in Boston.'",
        "'speaker_5': 'And sure enough, we did the research ourselves and found that and found very little is known or compiled about literacy rates. The most recent data provided by the National Center for Education Standards for Literacy Rates in Suffolk County was in 2003.'",
        "'speaker_5': 'That's almost 19 years ago. We need to do a better job in this city to understand the scope of literacy in order to find new and creative ways to provide services. We also need to know that there are currently organizations across the city, organizations like English for New Bostonians, the Meet Up Coalition, and others who do amazing'",
        "'speaker_5': 'work for English language learners. But this city needs to play a role in making sure that these services are coordinating and collaborating with each other to ensure that as many people as possible are receiving these services. Since filing this ordinance, we we have made very few changes.'",
        "'speaker_5': 'We have made a distinction between community members and administration members who are listed as ex-official. You guys got to Google that word. Other changes have been made to ensure that this ordinance is compliant with our city's charter. Overall, we have been lucky in that in this issue everyone is ready and willing to roll up their sleeves and'",
        "'speaker_5': 'get to work. I know people tend to look down on task force, but in this instance we literally don't even know what we don't know. So reaching out to people who cannot read or write to learn more about how to provide care for them is a challenge because our whole institution of gaining knowledge is based on written'",
        "'speaker_5': 'surveys and emails. I also want to give a shout out to Edith Bazil and Elizabeth Santiago, who worked incredibly hard on this project alongside our office. So thank you to both of them. I'm encouraging my colleagues to vote in favor of this ordinance, and I also just kind of like want to acknowledge and thank the administration for'",
        "'speaker_5': 'their support in moving us along in this process. There was a lot of point of tension for me. I'll always talk about this work being personal and professional, but if we're really serious about dismantling the school to prison pipeline and addressing the issues that so many of our students are facing in the classroom, then we're going to'",
        "'speaker_5': 'need to lean in to some of the root causes. And if we're really serious about looking at the issues around reentry, we need to make sure that our incarcerated loved ones are being set up for success and can actually fill out job applications.'",
        "'speaker_5': 'And if we're really serious about supporting immigrants, then this, especially those who have had interrupted education. I think literacy is a fundamental human right, and I think we have an opportunity to just do more than just be a task force, but to really invest.'",
        "'speaker_5': 'And so I do hope that my colleagues will all vote in favor. And thank you to Counselor Edwards for shepherding us through this process. I really do appreciate your support and thank you very much.'",
        "'speaker_1': 'Thank you so much. Counselor Edwards seeks acceptance of the committee report and passage of Docket 0600 in a new draft. Madam Clerk, would you please call the roll?'",
        "'speaker_0': 'Thank you. Councilor Arroyo. Councilor Roy. Oh yes. Councilor Baker. Councilor Bond. Councilor Bockius. Councilor Brady. Councilor Brady AS Councilor Campbell. Councilor Campbell. Yes. Councilor Edwards. Councilor Edwards. Yes. Councilor Savage. George. Councilor. Sorry, George. Yes. Councilor Flaherty. Council Flaherty.'",
        "'speaker_0': 'As Councilor Flynn. Councilor Flynn. Yes. Councilor Janey.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Councilor Janey. Yes. Councilor. Me here. Councilor me here. Yes. Councilor Murphy. Councilor Murphy. Yes. And Councilor O'Malley. Yes. Councilor O'Malley. Yes. Councilor Baker. Thank you, Councilor Baker. So report.'",
        "'speaker_1': 'It. Thank you so much. The committee report has been accepted in docket zero six. Zero zero has passed in a new draft. Before we move on, I want to acknowledge that we are joined in the chamber by councilors elect Tanya Anderson and Ruth C, who Jean, thank you so much for being here.'"
    ],
    "Creation of the Boston Commemoration Commission.": [
        "'speaker_1': 'Madam Clerk, could you please read docket 0638 at this time?'",
        "'speaker_0': 'Thank you. Docket 0638 The Committee on Government Operations, to which was referred on May five, 2021. Docket number 0638. Ordinance to create the Boston Commemoration Commission submits a report recommending that the ordinance ought to pass in a new draft.'",
        "'speaker_1': 'Thank you so much. The chair recognizes Councilor Edward's counsel. Edward, you have the floor.'",
        "'speaker_2': 'Thank you very much. Docket 0368 again is the work of Councilor Kenzie Bach, who I think has been leading in general and the historic preservation and understanding of our history on the council. And I wanted to thank her for that and thank her for this commemoration commission.'",
        "'speaker_2': 'It would establish a commemoration commission with the purpose of developing a plan to celebrate upcoming historical anniversaries of significance to Boston and to make sure that that celebration is inclusive, it's accurate, and it actually includes everybody in the diverse history of Boston.'",
        "'speaker_2': 'The ordinance establishes the membership of the Commission, the creation of the subcommittees, and defines the responsibilities and authority of the commission. And I believe, as this commission will continue to grow and be diverse and make sure that we are always accurate and inclusive of all aspects of our history and how every single one of us in our'",
        "'speaker_2': 'backgrounds played a role in building this beautiful city. So I would like to turn it over with your permission to Councilor Bach, and I recommend that this order pass or excuse me that this ordinance passed and amended form.'",
        "'speaker_1': 'Thank you so much. The Chair recognizes Councilor Bach Council. Bach, you have the floor.'",
        "'speaker_6': 'Thank you so much, Madam President. As Councilor Edwards alluded to upcoming anniversaries, they provide us with an opportunity to both plan commemorative events and update our local and state laws concerning historic buildings and archives in ways that more fully preserve and honor a history that includes all Bostonians.'",
        "'speaker_6': 'And I think it's clear to us that there's a ton of opportunity here and not just originally for some folks on the council. Remember that I filed this thinking about this Hester Centennial, the 250th for 2026 of the country.'",
        "'speaker_6': 'But also, as we're on a path to the 2030 400th anniversary of the city of Boston, and we know that there's an opportunity to really tell our history in ways that include everyone in our interaction, as Councilor Edward says.'",
        "'speaker_6': 'But we also know that doesn't happen by accident or on autopilot. You have to be intentional about it. And so the purpose of the commission is really to pull the many pieces of our city that touch historical memory and the many stakeholders we have around of our neighborhoods, sort of into conversation together and coordinate and invest in'",
        "'speaker_6': 'inclusive and robust historical resources and preservation tools while telling the full range of our history, including the struggles and accomplishments of Boston's indigenous, black, immigrant, women's and LGBTQ plus communities who who have historically often been left out of our official narratives.'",
        "'speaker_6': 'Um, as it says in the ordinance, this ordinance affirms that our diverse and intertwined community histories are of great value to the city of Boston and its residents. The historical tourism should be a driver of true shared prosperity.'",
        "'speaker_6': 'That inclusive and honest historical memory is a crucial public good worthy of our attention and resources, and that communities all over the city should have the tools and resources to research, preserve, acknowledge and celebrate their history. And, you know, the aim here is to have everything from local history modules in in veeps to local people, library branches'",
        "'speaker_6': ', having exhibits about that neighborhood's history, local trails. You know, as we talk about 2026, there is as much revolutionary history in Dorchester as there is downtown. We need to be really working together to tell that whole story and have everybody's voices.'",
        "'speaker_6': 'And so I'm just really thankful to the city departments that have participated in crafting this ordinance and all the advocates who have added their thoughts. And a lot of who's on the commission was informed by that, and also to the government operations staff and committee members and all the councilors who came along the way for their help'",
        "'speaker_6': 'in finalizing this ordinance and of course, for the Chair, a councilor, Senator elect Edwards. Um, and, and also the Vice Chair, Councilor Flaherty, for very helpfully chairing one of the sessions on this. So I'm grateful for the recommendation.'",
        "'speaker_6': 'And thank you so much, Madam President.'",
        "'speaker_1': 'Thank you so much. Councilor Edward seeks acceptance of the Committee Report and passage of Docket 0638 in a new draft. Madam Court, could you please call the roll?'",
        "'speaker_0': 'Certainly. Docket 0638. Councilor Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Councilor Baker. Councilor Bach. Councilor Baka. Councilor Braden. Councilor. Councilor Campbell. Councilor Campbell. Yes. Councilor Edwards. Councilor Edwards. Yes. Councilor. Savvy George. Councilor Sabi George. Yes. Council Flaherty. Councilor Flaherty as Council.'",
        "'speaker_0': 'Flynn. Councilor for ten years. Councilor Jane. Yes. Councilor Janey. Council me here. Councilor me here. See? Councilor Murphy. Councilor Murphy. Yes. Councilor O'Malley. Yes, sir. Male Yes, Madam President, I voted 0638.'",
        "'speaker_1': 'Comedian Thank you so much. The committee report has been accepted in docket 20638 has passed in a new draft medical. We're going to take the next three dockets together. That's 12, 19, 12, 20 and 1221.'",
        "'speaker_0': 'Certainly. Dark at 1 to 1 nine, the Committee on Government Operations, to which is referred on December 1st, 2021, docket number 1219 Petition for a Special Law regarding an Act regarding the Disability Pension for Matthew Morris, and this report recommending that the home rule petition ought to pass in a new draft.'"
    ],
    "Special Law for Disability Pension for Scott O'Brien.": [
        "'speaker_0': 'Docket number 1 to 2 zero the Committee on Government Operations, to which was referred on December 1st, 2021. Docket number 1220. Petition for a Special Law regarding an Act regarding the Disability Pension four Richard Santillo submits a report recommending the The Home Rule petition pass in a new draft and docket number 1 to 2 one.'",
        "'speaker_0': 'The Committee on Government Operations, to which is referred on December four as 2021, docket number one 2 to 1 Petition for a special law regarding actor going the disability pension for Scott O'Brien submits a report recommending that the home rule petition ought to pass in a new draft.'",
        "'speaker_1': 'Thank you so much. The Chair recognizes Councilor Edwards, chair of the Government Ops Committee.'",
        "'speaker_2': 'Tickets are consistent with several of the rockets we have done before and with police officers who as a result of an injury, have been decommissioned or unable to perform their duties. They were sponsored by Councilor Sobhy George and similar to the deep conversations that we had before when it came to the other dockets we went through and'",
        "'speaker_2': 'made sure that they were consistent in language. We removed things like Sirius and really made sure we were talking about firearm injury. We wanted to make sure that while that they could have additional income and we increased that income to $100,000 versus capping it at $15,000, I was one of the biggest concerns and also made sure that'",
        "'speaker_2': 'the there were certain outdated language that if a spouse got remarried somehow, some way, she should lose her benefit. That has been removed as well. So we made this consistent after a deep back and forth with the retirement commission and with other law enforcement individuals from prior hearings.'",
        "'speaker_2': 'So based on what we did before, this is consistent with that. I wanted to acknowledge also the service of these individuals. I know two of them were shot in East Boston. And so I did want to acknowledge that, um, that trauma.'",
        "'speaker_2': 'And how what they must have gone through in their families as well. And I would be remiss without acknowledging the leadership and the definitely the coming through of of council clarity on so many of these dockets as of late and as well as Christine O'Donnell for her shepherding so much of this as well.'",
        "'speaker_2': 'Thank you, Christine. So I want to now turn it a with your permission to Councilor Sabi George, who is the lead sponsor of the three dockets.'",
        "'speaker_1': 'Thank you so much. The chair recognizes Councilor Sabi George. Councilor Sabi. George, you have the floor.'",
        "'speaker_7': 'Thank you very much, Madam President. And thank you to the chair and to the Vice Chair for their work to ensure that this could be before this body today. I do want to echo Councilor Edwards. Thanks for Matthew Morris, Richard Santillo and Scottie O'Brien for their service to our city.'",
        "'speaker_7': 'And through this ordinance, through this work, I believe we will make these officers and recognize their service, will make them whole and recognize very formally their service to our city. They all three have sustained tremendous and significant physical injuries as well as will have forever some emotional scars that will remain with them forever.'",
        "'speaker_7': 'So just grateful for their service to our city and look forward to an urge, passage and acceptance of these three dockets. Thank you, Madam President.'",
        "'speaker_1': 'Thank you so much, Madam Clerk. We're going to take these dockets separately in terms of our votes, beginning with Docket 1219. Oh, sorry. The chair recognizes Councilor Raul Castro. You have the floor.'",
        "'speaker_3': 'So I wanted to start by thanking these officers for their service and also pre facing this by saying that I'm going to vote for this. I continue. And the reason I am going to vote for this is because we've created a standard now.'",
        "'speaker_3': 'And the previous the previous three, I think it was that we did this, we created this new sort of standard and formula. And so I'm going to vote for this because it's now part of what we already do as a set standard.'",
        "'speaker_3': 'I will just continue to uplift that. My concern with it is not the service of these gentleman or their injuries. As somebody whose grandfather was injured on the job as a police officer and had disabilities, I do have concerns about the council having different sets of standards for different for how you receive your injury rather than what'",
        "'speaker_3': 'the injury you have is. I do believe that, frankly, and thank God most of our officers did not receive their injuries through shootings. They receive their injuries in other ways. And I don't want to create a system where we are prioritizing how you received your injury rather than the severity of your injury, even if they are the'",
        "'speaker_3': 'same injuries. And so I know that we have a new standard that I will down vote to approve this under that, because that's been set up. But I do want to just voice that concern because I don't want officers or firefighters or other folks coming in with the same injuries in a different way that they've received them'",
        "'speaker_3': 'and receiving different treatment or different standards. And so I would like us to have some thought about in the future how we make this a uniform process for all. And that is all. And again, thank you for their service.'",
        "'speaker_3': 'They all were injured in really heroic ways, frankly. And so I will be voting for this today. Thank you.'",
        "'speaker_1': 'Thank you, Councilor Arroyo. Madam Clerk, we're going to take each docket separately, beginning with 1219. Can you? Councilor Edward seeks acceptance of the committee report. Passage of Docket 1219 in a new draft. Could you please call the roll?'",
        "'speaker_0': 'Thank you. Docket 1219. Counsel.'",
        "'speaker_3': 'Arroyo Yes.'",
        "'speaker_1': 'Counsel.'",
        "'speaker_0': 'Arroyo Yes. Counsel. Baker. Counsel. Baker, I counsel. Counsel. BLOCK I counsel. Brady Counsel. Braden I Counselor. Campbell Counsel. Campbell Years Counselor. Edwards Counsel. Edwards Yes. Counselor Savi George Counselor Savi George's Counsel of Clarity. Counsel of clarity as counsel Flynn Counsel Flynn yes.'",
        "'speaker_0': 'Counselor.'",
        "'speaker_1': 'Yes. Counselor.'",
        "'speaker_0': 'Genius. Counselor. Me here. Counselor here. Counselor Murphy. Counselor Murphy. Yes. And Counselor O'Malley. Counselor O'Malley. Yes, Madam President. Docket number 1219 has received a unanimous vote.'",
        "'speaker_1': 'Thank you so much that I could 1219 has passed and in a draft we will now vote on docket 1220. Madam Court, could you please call the roll?'",
        "'speaker_0': 'Thank you. Docket 1220. Counsel. Arroyo. Yes. Counsel Arroyo. Yes. Counselor Baker. Counselor Baker. I. Counsel. BLOCK counsel back I counsel Braden. Counsel Braden I. Counselor Campbell. Counselor Campbell. Yes. Counselor Edwards. Counselor Edwards. Yes. Counselor Sabi George. Counselor Savi George's.'",
        "'speaker_0': 'Counsel of Clarity. Counsel Clarity as counsel Flynn's counsel Flynn years. Counselor.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Counselor. Janie. Yes. Counselor. Me here. Counselor. I'm here. Yes. Counselor. Murphy. Counselor Murphy? Yes. And Counselor O'Malley? Yes. Counselor O'Malley? Yes, Madam President. Docket number 1220 has passed unanimously.'",
        "'speaker_1': 'Thank you so much. Docket 1220 has passed and in the draft we'll move on to docket 1221. Madam Court, could you please call the roll?'",
        "'speaker_0': 'Thank you. Docket one, 2 to 1. Counselor Arroyo? Yeah. Counselor Arroyo? Yes. Counselor Baker. Counselor Baker. Counselor. Counsel Barchi. Counsel Brady. Counselor Braydon I. Counselor Campbell. Counselor Campbell. Yes. Counselor Edwards. Counselor Edwards. Yes. Counselor Sabi George. Counselor Sabi George is counsel clarity.'",
        "'speaker_0': 'Counsel of clarity as counsel Flynn. Counsel Flynn yes.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Counselor Janey is counsel me here. Counselor me here? Yes. Counselor Murphy. Counselor Murphy? Yes. And Counselor O'Malley. Counselor O'Malley? Yes, Madam President. Docket number one, two, two, one has received a unanimous vote.'",
        "'speaker_1': 'Thank you so much. Docket 1221 has passed and a new draft. Before we move on, I just want to acknowledge that we are joined by former City Councilor John Tobin. Thank you so much for joining us. Thank you.'"
    ],
    "Creation of a Sheltered Market Program for Disadvantaged Minority and Women Owned Vendors.": [
        "'speaker_1': 'Madam Court, could you please read docket 1239?'",
        "'speaker_0': 'Certainly. Docket 1239. The Committee on Government Operations, to which was referred on December 1st, 2021, docket number 1239 message an order authorizing the creation of a sheltered market program in conformity with the requirements of general laws. Chapter 30 B Section 18.'",
        "'speaker_0': 'This authorization applies to contracts for goods, professional services and support services. This authorization is for no more than six contracts, which must be awarded by June 30th, 2022. This sheltered market program shall be available for disadvantaged, minority and women only vendors, for whom there is a demonstrated substantial disparity in the city's 2020 disparities.'",
        "'speaker_0': 'Study submits a report recommending the order ought to pass.'",
        "'speaker_1': 'Thank you so much, Madam Clerk. The Chair recognizes Councilor Edwards, chair of the committee. Councilor Edwards.'",
        "'speaker_2': 'You have the floor. This is this is actually a matter, I believe, sponsored by the.'",
        "'speaker_8': 'Mayor in Cannes.'",
        "'speaker_2': 'In conformance with the recommendations from the disparity study and making sure that we opt in to this this pilot program under mass general laws 30 Section 18. Again, it's really just following the recommendations of an already studied issue, which which demonstrates a disparity between minority contractors or women contractors receiving contracts in the city of Boston.'",
        "'speaker_2': 'So this would allow for us to shepherd and move these six contracts to those already designated groups who have a disadvantage. And I think it's.'",
        "'speaker_8': 'Really fulfilling a promise.'",
        "'speaker_2': 'Of making sure that we go through and make sure all aspects of the city government, including the financial benefits, are accessible to people in the city of Boston. I recommend that this pass and I hope that my colleagues will vote for it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you so much. Councilor Edward seeks acceptance of the committee report and passage of Docket 1239. Madam Court, could you please call the roll?'",
        "'speaker_0': 'Certainly. Docket 1239. Councilor Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Councilor Baker. Councilor. Councilor Barker. Council Braden. Councilor Braden. Councilor Campbell. Councilor Campbell. Yes. Councilor Edwards. Yes. Councilor Sabby. George. Councilor Sabby. George. He has Councilor Flaherty. Councilor Flaherty as Councilor Flynn.'",
        "'speaker_0': 'Councilor Flynn. Yes. Councilor Jane. Yes. Councilor Janey. As Councilor me here. Councilor me here as Councilor Murphy. Councilor Murphy. Yes. And Councilor O'Malley. Yes. Councilor O'Malley. Yes. Madam President, do I get number 1239 has received unanimous vote.'",
        "'speaker_1': 'Thank you so much. Dockett 1239 has passed and now we will move on to matters recently heard for possible action. Madam Clerk, if you could please read docket 0863.'"
    ],
    "Hearing on Pest Control and Illegal Dumping Issues.": [
        "'speaker_0': 'Certainly Docket 0863 order for hearing to discuss pest control and illegal dumping in the city of Boston.'",
        "'speaker_1': 'Thank you so much. Docket is up. The chair recognizes counsel. Flynn. Counsel, you have the floor.'",
        "'speaker_3': 'Thank you, Madam President. Madam President, we held a working session on pest control and illegal dumping. Um, on December 15. Um, we held this working session with docket 0863 as in order for working session to discuss pest control, illegal dumping.'",
        "'speaker_3': 'I want to thank my colleagues, Councilor Murphy and Braydon, for attending. In the administration panelists for participating as well. This is a follow up from several conversations we've had throughout the year on the same subject. Because we know that there's a significant increase in rodent and pest control related issues in the city.'",
        "'speaker_3': 'And we have had neighbors reach out to us across District two. But I also know colleagues, District City Council colleagues, as well as our lodge have also received significant calls as well about pest control related issues as we move into the new year.'",
        "'speaker_3': 'We wanted to discuss ways that the city can adequately handle this critical issue. It's important that we discuss measures for effective pest control and keeping our streets clean, healthy, especially when we are trying to keep our residents and environment environment healthy as well.'",
        "'speaker_3': 'In the working session, we're fortunate to have great leadership that are part of a task force that includes the City of Boston Public Works and Inspectional Service Department, and they are providing the tools to curb rodent activity and illegal dumping.'",
        "'speaker_3': 'And we also talked about the possibility of using products that would stop rats from reproducing, using a new kind of trashcans that we had a pilot program before the pandemic in the south end and increasing the number of inspectors in inspect inspectional services.'",
        "'speaker_3': 'Inspectional services play a critical role, as does public works department. On this issue, we need to continue working with them with the mayor's office, to expand public outreach in different languages and continue doing neighborhood walkthroughs and working with residents on this critical issue.'",
        "'speaker_3': 'And finally, I highlighted the critical need that this is a public health issue. It's a public safety issue. It's a quality of life issue. And as we go forward during the the budget debate next year, it's critical that we all advocate for more resources for pest control.'",
        "'speaker_3': 'Again, it's impacting every district in the city, and we need to stay on top of this to provide our residents the best public health and environmentally safe neighborhoods as we possibly can. Thank you, Madam President.'",
        "'speaker_1': 'Thank you so much. DUCKETT 0863 will be placed on file. We will now move on to docket 0732.'"
    ],
    "Federal FY21 Urban Areas Security Initiative Grant Acceptance and Expenditure.": [
        "'speaker_0': '1167 Certainly. Docket 1167 message in order authorizing the city of Boston to accept and expend an amount of $13,520,000 in the form of a grant for the federal FBI 21 Urban Areas Security Initiative awarded by the United States Department of Homeland Security Executive Office of Public Safety and Security to be administered by the Mayor's Office of Emergency'",
        "'speaker_0': 'Management. The fund will continue to support planning exercises, training operations that build regional capacity to help prevent, respond to and recover from threats or acts of terrorism, including chemical, biological, radiological, nuclear and explosive, explosive incidents.'",
        "'speaker_1': 'Thank you, Madam Clerk. The Chair recognizes Councilor Campbell, Chair of Public Safety and Criminal Justice. Councilor Campbell, you have the floor.'",
        "'speaker_8': 'I thank you, Madam President. The Committee on Public Safety and Criminal Justice held a hearing this past Monday. We actually held it on three dockets. We'll talk about the other two later in the agenda. But for now, I'll just talk about docket 1167.'",
        "'speaker_8': 'We heard from the Mayor's Office of Emergency Management Chief Charmaine Benford, who testified on behalf of the administration. Docket 1167 is a grant from the Urban Areas Security Initiative. It is administered by OEM. The grant will fund continued support for planning, exercises, trainings and operations that build regional capacities to help prevent, respond and recover from threats or'",
        "'speaker_8': 'acts of terrorism, including chemical, biological, radiological, nuclear and explosive incidents. Chief Benford explained that this grant provides infrastructure support for OEM and the city's primary public safety disciplines in being able to maintain, of course, a readiness posture for safety and security threats.'",
        "'speaker_8': 'It is awarded to a region and this region includes Boston, Brookline, Cambridge, Chelsea, Everett, Quincy Revere, Somerville and Winthrop, for which the city of Boston serves as the fiduciary. It's managed by FEMA within the U.S. Department of Homeland Security.'",
        "'speaker_8': 'The funds and the application are submitted by the state through AIOPS. And then, of course, it comes back to the city of Boston to actually dish out and allocate these funds. OEM collaborates with various regional partners to allocate these funds using a risk based methodology.'",
        "'speaker_8': 'This is going to be a little long. I apologize. The eight specific mission areas of the grant include several safety and security, which the breakdowns were sent to. All councilors, of course, who can review those. But $1 million for that critical infrastructure and protection.'",
        "'speaker_8': '$2 million. Intelligence and information sharing. $3.1 million. Interoperable communications $2.2 million. Chemical, biological, radiological, nuclear and explosive detect. Detection and response. 1.6 million public health and emergency services $430,000, which also includes planning and community preparedness at 1.2 million.'",
        "'speaker_8': 'And lastly, cyber security at 1.2 million. There are further breakdowns in this. I sent this all to various councilors, some documents before the hearing, some documents during the hearing, and some documents that we received this morning from the various departments.'",
        "'speaker_8': 'A significant portion of these funds come from the Program Administration Fund and allow for much of this to serve some human capital. There were significant and I want to acknowledge that there were some concerns about the grants effect with respect to compliance of the surveillance, the new surveillance oversight ordinance and the funding of risk.'",
        "'speaker_8': 'And Chief Benford explained that the grant will, of course, be in compliance with that new ordinance that was passed by the Council. All of the new councilors and of course, the new mayor will have to ensure that happens, particularly with the procurement of any new additional technology.'",
        "'speaker_8': 'I also note that there were several questions that we forwarded to the BRIC and we did get some responses to those. Councilor Arroyo. I will just say more detail than we've received in the past, which I really appreciated in such a short timeframe.'",
        "'speaker_8': 'I also will stress that because this is a regional grant, some of this, of course, is within the control of other municipalities. So what they procure, for example, for their security, their safety may be different from what the city of Boston procures.'",
        "'speaker_8': 'And obviously they do not have the ordnance that Boston has. So there are different provisions that are in play. But here in the city of Boston, we got more information about what some of this regional technology will be.'",
        "'speaker_8': 'Some of it includes critical infrastructure monitoring system maintenance, which is referred to as Sims. This is an existing camera network that is a regional project. This will also include gunshot detection system, which is also a regional project. There is a license plate reader program that is not actually include Boston and includes some of the other regions.'",
        "'speaker_8': 'So it's not a project that DPD participates in. So this is some of the major technology that will be funded by this, and this will probably about be about 10.2% of the budget in terms of the BRIC. There are several positions that will be funded by the BRIC, and we know that this came up before with a'",
        "'speaker_8': 'previous grant of $850,000 that the council decided to hold because we didn't get as much transparency in responses to those questions. This, I think, is a little different here. We got specifics around what they will be funding these for.'",
        "'speaker_8': 'Analyst positions. I know that folks have questions about, well, what will they be analyzing? That's going to be a question for the new council, the new mayor to have to go through. They obviously have not been hired yet.'",
        "'speaker_8': 'And I would implore the council and the new mayor to do just that, to follow this, to continue, of course, to follow BRIC, to encourage greater transparency from the agency, and in addition to greater transparency, greater accountability and greater partnership, hopefully with the Council.'",
        "'speaker_8': 'I will just add, because the funding for the BRIC was folded into this regional grant, which is over $13 million. I am going to recommend that it be passed and that we pass it as a council because it includes so many regions and so many necessary equipment items and various infrastructure supplies that every department, every municipality absolutely'",
        "'speaker_8': 'needs. And also I will just add some of this infrastructure and supplies go to support our efforts with respect to COVID, which we know is still, of course, devastating of the Commonwealth. And I'll just add one more point.'",
        "'speaker_8': 'I just want to thank the councilors who actually attended thank you to councilors Brayden, Murphy, Arroyo and Flynn for joining the hearing and following up. Thank you to Sean Tall, who is over here for getting us responses really quickly.'",
        "'speaker_8': 'And thank you to Chief Benford, who, as he said, prides himself on transparency with respect to O&M. He was incredible at the hearing. He did not have all the answers, but he worked really quick with air to get as many responses as we could.'",
        "'speaker_8': 'So I'm recommending passage, but of course, asking that capacity issue. God bless you. The council colleagues as well as the new mayor continue. I think the advocacy of this body, continued advocacy of this committee in ensuring that certain departments connected to public safety in the city of Boston are transparent, are continuing to do the work, of course'",
        "'speaker_8': ', of rooting out racial disparities, which we all see still exist in our response and our public safety response. So thank you for allowing me to go on a little bit long. Thank you, Madam President.'",
        "'speaker_1': 'Thank you so much. Councilor Campbell seeks acceptance of the committee report and passage of Docket 11 six.'",
        "'speaker_2': 'Thank God this is the last.'",
        "'speaker_3': 'Of.'",
        "'speaker_8': 'These red.'",
        "'speaker_1': 'Lights. Thank you so much. The chair recognizes Councilor Royal Council role. You have the.'",
        "'speaker_3': 'Floor. Thank you, Madam President. Thank you to chair of Public Safety Catholic Campbell for a very good summation. I'll be voting yes on this, but I do so with reservations, largely based on the the so the truth is, this is much more information than we received on that grant.'",
        "'speaker_3': 'It is not very close. And I'm assuming the reason for that is the size of the number here. And my vote yes for this is largely for the reasons that you detail. There's regional partners here. There's there's other communities involved in this.'",
        "'speaker_3': 'And what I will say, which is sort of just a notice for for the for for both Boston reasons intelligence center for the administration I think also for the council is that most of their answers were we're going to comply with the, uh, surveillance oversight that we passed and check back us, back up with us in August'",
        "'speaker_3': 'of 2022 when we put together our report. And I think it's important that we just because I was kind of stunned at the amount or the lack of amount of say in where these funds go that OEM had given other the administrator their more of a pass through.'",
        "'speaker_3': 'They they ask for the grant they get the grant but they couldn't detail exactly what was going to be done with the grant, who was going to be doing what with the grant, whether or not, for instance, these analysts are going to be using the gang database, are going to be focused more on regional counterintelligence for terrorism'",
        "'speaker_3': 'or things of that nature. And so I look forward to in August of 2022, going through this and making sure that we do this, because I believe this is the annual grant and this is something that we will have the ability to ensure compliance moving forward with, with our ordinances, with the things that we have dictated we'",
        "'speaker_3': 'would like to see from a transparency, uh, for transparency sake moving forward because, because of the surveillance oversight, we should have more say in terms of what that information that they're doing and what they are doing with these dollars, because this is not a small amount of money and so we'll be voting for it.'",
        "'speaker_3': 'But with the, uh, just with the notice for everybody who's still going to be here, anybody who's joining that, we still have work to do on ensuring that they, that this is money that is being used properly, that is being used in a way that is the most positive for our community.'",
        "'speaker_3': 'So thank you, Madam President. Thank you, Madam Chair, for for your leadership.'",
        "'speaker_1': 'Thank you so much. Does anyone else want to speak on this? Okay, great. Councilor Campbell seeks acceptance of the committee report and passage of Docket 1167. All those in favor, please indicate by saying I may oppose. The ayes have it.'",
        "'speaker_1': 'The docket 1167 has passed. Thank you so much, Madam Clerk. Let's take the next four dockets together. Docket 1168, 1169, 1170 and 1171.'",
        "'speaker_0': 'Great. Thank you. Docket 1168. Message in order. Authorize the city of Boston to accept. And an amount of 2,000,007 $70,874 in the form of a grant for the f y 22 Title three C Award by the U.S. Department of Health and Human Services passed to the Master Executive Office of Elder appears to be administered by the H'"
    ],
    "Accept and Expend Grant for Federal FY22 Title III-A for the Age Strong Commission.": [
        "'speaker_0': 'The grant will fund caregiver services for older adults in the city of Boston. And docket number 1171 message in order authorizing the city of Boston to accept an expanded amount of $417,870 in the form of a grant for the federal employee 22 Table three a.'",
        "'speaker_0': 'Awarded by the U.S. Department of Health and Human Services Task of the Executive Office of Elder appears to be administered by the Age Drawing Commission. The grant will fund costs for the administration of Title three programs.'",
        "'speaker_1': 'Thank you so much. The chair recognizes Councilor Braden, who is chair of the Strong Women Families and Communities Committee. Counsel Braden, you have the floor.'",
        "'speaker_2': 'Thank you, Madam President. A report from the Committee on Strong Women, Families and Communities has been distributed to each of the conference seats. The committee was referred dockets 116831171 and November 17th. And the hearing was her, her, her yesterday on December 14th.'",
        "'speaker_2': 'These four dockets are titled three grants awarded by the US Department of Health and Human Services, passed through the Massachusetts Executive Office of Elder Affairs and administered by our each strong commission. The four grants total $4,021,379 and will support each strong Commission's work through the throughout the city for nutrition and distribution of meals, supportive senior activities and'",
        "'speaker_2': 'housing stabilization programs and caregiver services, including seniors who are caring for youth. The Committee testimony from Commissioner Emily Shea from each strong who provided she provided testimony on behalf of the administration. Commissioner Shea stated that these federal funds from the Older Americans Act are from the Older Americans Act.'",
        "'speaker_2': 'The city of Boston is eligible for this funding because the Age Drunk Commission is a federally designated as an area agency on aging. A large majority of this funding will be used to put out requests for proposals to aid strong community partners to determine how this funding be used to meet the needs of the community and follow'",
        "'speaker_2': 'guidelines as stated in the Older Americans Act. At this time, it's my recommendation to the council that these moderate matters ought to pass. Thank you.'",
        "'speaker_1': 'Thank you so much. Any red lights? Anyone want to speak? Okay, now we are going to vote on each docket separately, starting with docket 1168. Councilor Brennan seeks acceptance of the committee report and passage of this docket. All those in favor, please say I, I any oppose.'",
        "'speaker_1': 'Nay, the ayes have it. Docket 1168 has passed. Moving on to docket 1169. All those in favor please indicate by saying I any opposed? No, the ayes have it. Docket 1169 has also been passed. Moving on to Docket 1170, Council Brain six acceptance of the committee report and passage of this docket.'",
        "'speaker_1': 'All those in favor please indicate by saying I any oppose? No, the ayes have it. Docket 1170 has been passed and the final docket is docket 1171. All those in favor please indicate by saying I the oppose say nay.'",
        "'speaker_1': 'The ayes have it and docket 1171 has also been passed. Madam Clerk, I think we're going to take the next two decades together. Docket 12 zero seven and 12 zero nine.'"
    ],
    "Grant for Jail/Arrest Diversion and Mental Health Training for Boston Police Department.": [
        "'speaker_0': 'The grant will fund a full time recovery coach, forensic peer specialists to assist Boston Police Department offices with hub and center responsibility meetings. City wide docket number 1209 message an order authorizing the city of Boston to accept and an amount of $72,600 in the form of a grant to the FBI.'",
        "'speaker_0': '2022 Jail Arrest Diversion grant awarded by the Department of Mental Health to be administered by the Boston Police Department. The grant will fund overtime costs to backfill crisis intervention training and other mental health training for officers.'",
        "'speaker_1': 'Thank you so much, Madam Clerk. The Chair recognizes Councilor Campbell, Chair of the Committee on Public Safety and Criminal Justice. Councilor Campbell, you have the floor.'",
        "'speaker_8': 'Thank you, Madam President. And thank you, Madam Clerk. We held a hearing on Monday, and we also included these two dockets, Docket 1207 and docket 1209. I want to thank Gina Savage from the police department, who is the deputy director of research and development, who came and testified on behalf of the administration on both of these grants'",
        "'speaker_8': '. I also want to thank again Councilors Murphy, Braden, Arroyo and Flynn for joining us in the hearing and bringing your questions. Docket 1207 is a grant from the State Department of the Department of Mental Health. It is to hire a full time recovery coach and forensic cure specialist to work with our BPD officers.'",
        "'speaker_8': 'Deputy Director Savage explained the city has received this grant for several years and used these funds to hire a best clinician. But now the best clinicians are funded by the operating budget. And I'd be remiss if I didn't think counselor Savi George for her leadership with respect to the best clinicians and expansion and expanding that human capital'",
        "'speaker_8': 'within the police department across several parts of the city. She also explained the department was able to work with the damage to continue using these funds through the best program, which resulted in the current proposal to hire this particular recovery coach.'",
        "'speaker_8': 'And she noted that they may look to revise the grant to actually be able to hire a few more folks. So that is docket 1207. And I will just add at the end, it speaks to the hub and center of responsibility meeting city wide.'",
        "'speaker_8': 'I want to thank in particular mass housing and Thaddeus and Kayla and some folks out of Chelsea, Jamaica Plain. I had attended some hub meetings, particularly in Jamaica Plain and Chelsea with respect to this community response to public safety and work with our department to actually expand the resources for this.'",
        "'speaker_8': 'And so through some creative partnerships including with. Various conversations, they were able to secure funding to bring on more hub folks and to expand that model across other neighborhoods, including C11 and V3. So I just want to thank the PPD grants division for their leadership on this.'",
        "'speaker_8': 'And I also want to lastly talk about Docket 1 to 0 nine, which is also a grant from GMH. This is to fund backfill for officers who are going through the crisis intervention team and going through mental health trainings.'",
        "'speaker_8': 'And so officers are going through the trainings. They obviously have to cover their responsibilities. This is what this grant does. It would, if it was explained at these trainings, are voluntary, but of course aimed at officers who ride with the best clinicians to have training.'",
        "'speaker_8': 'Officers obviously are excited to be able to participate. It makes it easier when there's funding to allow that to happen smoothly so that doesn't disrupt the operations of the department. So at this time, I'm seeking as chair of the Committee on Public Safety and Criminal Justice, I recommend passage of these two dockets, dockets 1207 and 1209.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Does anyone else want to speak on these dockets? Great. We're going to take separate votes, starting with Docket 12 zero seven. Councilor Campbell seeks acceptance of the report and passage of Docket 12 zero seven. All those in favor please indicate by saying I only oppose.'",
        "'speaker_1': 'Nay, the ayes have it. Docket 12 zero seven has been passed, moving on to 12 zero nine. All those in favor please indicate by saying I any opposed say nay the ayes have it and docket 1 to 0 nine has also passed.'",
        "'speaker_1': 'Madam Clerk, could you please read? Yes, ma'am. Yes. Do you have them?'",
        "'speaker_0': 'They were just. It was just.'"
    ],
    "Grant from Massachusetts Port Authority for East Boston Senior Center.": [
        "'speaker_1': 'Um, Madam Clerk, if you could please read the next docket, which is 1240.'",
        "'speaker_0': 'Thank you. Schneider authorizes the city of Boston to accept an extended amount of $399,000 in the form of a grant for the East Boston Foundation to awarded by the Massachusetts Port Authority to be administered by the H. Drawing Commission.'",
        "'speaker_0': 'The grant will fund eight strong commissions, operations and management of the East Boston Senior Center.'",
        "'speaker_1': 'Thank you so much that you recognize this council. Brain cancer brain. You have the floor.'",
        "'speaker_2': 'Young, strong women, families and communities was referred doc at one 1240 on December eight and the hearing was held yesterday, December 14. This docket is a grant in the amount of $399,000 for the East Boston Foundation Fund, too, awarded by the Massachusetts Port Authority to be administered by the Eight Strong Commission.'",
        "'speaker_2': 'Commissioner Shea provided testimony on behalf of the administration and stated that the funding is in the form of a pilot payment for from Massport and will fund the operation and management of the New East Boston Senior Center at Orient High Orient Heights.'",
        "'speaker_2': 'This money will be distributed through 2027, and the strong commission is also expecting an additional $180,000 from the mast from Massport every other year to support the East Boston Senior Center. At this time, we recommend to the council that this matter f to pass.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you so much. The chair recognizes Councilor Edwards. Would you have the floor?'",
        "'speaker_2': 'Several folks for this wonderful grant and moment at the senior center in East Boston. It's been something that the community has been asking for for a very long time. And Massport.'",
        "'speaker_8': 'And finally fulfilling.'",
        "'speaker_1': 'Its promise.'",
        "'speaker_2': 'To operate it while the city of Boston has committed to at least getting it open and doing the groundbreaking. So to see this finally come to fruition, we're very close to having a senior center in East Boston that it will be multilingual, will be diverse, will be welcoming of all of our seniors.'",
        "'speaker_1': 'Is very.'",
        "'speaker_2': 'Exciting. I just want to acknowledge that and say thank you to the administration and to Massport for this.'",
        "'speaker_1': 'Thank you. Would anyone else like to speak on this topic? Wonderful counsel. Braden seeks acceptance of the committee report as chair of the committee and passage of Docket 1240. All those in favor please indicate by saying i, i any opposed?'",
        "'speaker_1': 'No. The ayes have it at 1240 has been passed. We're now moving on to personnel orders. Madam Clerk, Docket 1276, please.'",
        "'speaker_0': 'Thank you. Docket 1276. Counsel Janie for counsel.'"
    ]
}