{
    "Confirmation of Mark Kiefer for the Beacon Hill Architectural Commission.": [
        "'speaker_1': 'on May 1st, 2023. Dr. Number 0407 notice was received from the mirror of the appointment of Edward Fleck as an alternative member of the Beacon Hill Architectural Commission for a term expiring May 1st, 2024, and number 0408. Notice was received from the Mayor of the appointment of Marc Kieffer as a member of the Beacon Hill Architectural Commission'",
        "'speaker_1': 'for a term expiring May 1st, 2026.'",
        "'speaker_0': 'Dr. 040540408 will be placed on file before we continue. The Chair recognizes Council.'",
        "'speaker_3': 'Just to confirm that those three appointments don't require confirmation by the Council because it's the previous appointments for that board. I know we've sat and done confirmation and I just I know the board is urgently in need of a quorum.'",
        "'speaker_3': 'So if in fact, the Council does need to act on this, I would rather we figure that out. What we can still do reconsideration during the meeting. So just if, Mr. President, if somebody could just to double check that those are actually just notices.'",
        "'speaker_0': 'Thank you, council block for bringing that to our attention at this time. The Chair recognizes council priority council clarity over the floor.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. Clarity. We will check that during this hearing. And we will we will figure out the answer for that. Thank you, counsel. BLOCK for bringing that to our attention. Reporter of public offices. Mr. Kirk. Oh, yeah.'",
        "'speaker_0': 'Matters recently heard for possible action. Mr. Clerk, please read docket 0294 place.'"
    ],
    "Urban Renewal Plan Extension Approval.": [
        "'speaker_1': 'Using planning and land use tools for public good and docket number 0314 Message in order for your approval in order for a short term extension of nine of the 14 remaining urban renewal plans in Boston.'",
        "'speaker_0': 'Thank you. The chair recognizes Councilor Baker, chair of the Committee on Planning, Transportation Development Council. Baker, you have the floor.'",
        "'speaker_2': 'Thank you, Mr. President. Thank you for allowing me to merge these these two docket numbers. The first 10192 was filed by Council BLOCK and co-sponsored by Council of Louisiana. It was to discuss land use tools for public good, basically urban renewal tools that we have that are available to us.'",
        "'speaker_2': 'And I believe Council will get up and speak about some of those. So we had two separate two separate panels. The first panel was from the EPA and they spoke on 0314, which was the extension for 14 urban renewal areas.'",
        "'speaker_2': 'And in so we were able to dig into a lot of content. We talked about elders quite a bit. Land disposition, land disposition agreements. We talked about land trusts and a whole lot of there was a whole lot of content content there.'",
        "'speaker_2': 'But what we came up with, with the 14 with the 14 urban renewal areas six years ago, we took a vote to extend it to this April. So basically, if we don't take a vote on this, all 14 of these go away.'",
        "'speaker_2': 'And within those districts, there's there's a number of tools that we use that help us in development and also protect the LDA, protect affordable housing. They protect open space, they protect a whole a whole wide range of different things.'",
        "'speaker_2': 'So what we come up with out of the 14, I believe we're going to take votes on on extending nine of them. And we're thinking about we're not going to we're not taking a vote on this today. We're looking to bring it to a vote next week.'",
        "'speaker_2': 'So councilors have a have a a week to talk about it, see what's within their districts. I know Councilor Warrell has some changes, so we want to give different people different times, but we're looking to extend nine of them.'",
        "'speaker_2': 'Ten of them extend extend ten of them because we added park plaza in the park plaza was on was on the list that we would sunset. But there are some major concerns around height issues and things like that around Park Plaza.'",
        "'speaker_2': 'So we will have the vote on that hopefully next week. And Council of Clarity came up with wanted to extend it two years and do a six month check in every two years. So what I think we're looking at doing and we're open to it is extended a year into a six month check in, which would be'",
        "'speaker_2': ', I believe, in the end of September. So these will remain in committee and we will vote on them, will vote on 031 for next week. And with that, I'd like to turn it over to the to the to the lead sponsor of 019 to council.'",
        "'speaker_0': 'BLOCK Thank you. Thank you, counsel. Baker The chair recognizes counsel via counsel. Walk. You have the floor.'",
        "'speaker_3': 'Thank you so much, Mr. President. Thank you to Councilor Baker for running such a thorough hearing yesterday and to my co-sponsor, Councilor Louie Jan. We appreciate it. Everybody's indulgence letting us combine these two things, because in some ways they were kind of two sides of the same coin.'",
        "'speaker_3': 'On the one hand, we've got the long and difficult legacy in the city of urban renewal. As I mentioned there, I represent the West End, which is one of the many parts of the city that bore the brunt of that.'",
        "'speaker_3': 'And I think that the mayor's administration is laying out a path for us to really transform the city's relationship to planning into these tools and and looking at places where it's appropriate to sunset. At the same time, some of the stuff we were talking about yesterday was how do we think about like using some of these tools'",
        "'speaker_3': 'that we have for things like community land, trust, for things like building social housing on public land. And I think we had a really good second panel with some of the advocates in those spaces. Thinking about on the climate mitigation side, how do we assemble land parcels where we might need them to protect the fringes of the'",
        "'speaker_3': 'city? So I think it was a really productive conversation. And as councilor, as Councilor Baker said, I think, you know, the first part came out with some kind of good, good trajectories for the immediate decision at hand. But I'm very optimistic about the opportunity for the Council to be part of a real re-envisioning of how we use'",
        "'speaker_3': 'land use tools and public land for public good in the city. So thank you so much to everybody who came.'"
    ],
    "Hearing on App Development for Parental Involvement and Support.": [
        "'speaker_0': 'Thank you, counsel. Would anyone else like to speak on this matter? Docket 019 will remain in committee. Docket 0314 will remain in committee motions. Order in resolutions. Mr. Clerk, please read Docket 04090409.'",
        "'speaker_1': 'Councilor Fernandes Anderson offered the following In order for a hearing to discuss developing an app to support parental involvement and support.'",
        "'speaker_0': 'Thank you. The chair recognizes Counsel Fernandez Sanderson. Counsel Fernandez Sanderson. You have the floor.'",
        "'speaker_5': 'Thank you, Mr. President. So in my experiences, I'm going to tell you a little bit about some of the my efforts in my past experiences and the things that I've developed over the years, working in behavioral health, working for the Boston Public Schools, as well as just working in community advocacy as well.'",
        "'speaker_5': 'So as a foster parent, there are so many ways that there are resources already existing that supports our children in the community or lack thereof. When you're a parent, especially when you are a single parent and you lack resources to navigate a child's schedule, to navigate all of these services that come into place, especially with a high'",
        "'speaker_5': 'level care of foster care, you definitely need more resources to be able to consolidate all of these services, all of the collaterals, all of the appointments, all of the people involved that it takes in order for you to raise a child in a healthy environment.'",
        "'speaker_5': 'And so I spent 11 years working as an intensive care coordinator, which means essentially an umbrella of that oversees all behavioral health initiatives. And the issue that I faced was basically that in providing, I also provided in-home therapy to families.'",
        "'speaker_5': 'And so in providing those services, you have to assist parents with charts or therapeutic interventions in order for them to follow through with the therapeutic treatment plants. And so you give them charts. You create different ways of navigating these systems or of supporting that child with that out of school time.'",
        "'speaker_5': 'But it's all over the place. You know, people are inundated with stressors. People are busy. People have two jobs. And there are so many collateral and different services coming in to the child's home. And so all of these charts are not enough to be able to consolidate services and to be able to organize a child's out-of-school time'",
        "'speaker_5': '. What I did is create a toolbox that I would give parents, right? So back in back then it would be a toolbox that, you know, one is for behavior modification or one is understanding a child diagnosis and what that meant in order to follow through with the treatment plan.'",
        "'speaker_5': 'This one is for de-escalating crises. This one is for communication. This one is for maybe problem solving. It's a lot on it's on a parent. It's a lot for them to track your child's all of the physical appointments with the doctors.'",
        "'speaker_5': 'Maybe the alternative for psych meds is physical therapy or some sort of, you know, fitness and wellness, nutrition and all the other stuff. So I thought what an opportunity would be to create this toolbox that offered all of it in one place.'",
        "'speaker_5': 'So I actually created this and I would do like group therapy and all this sort of stuff that would do it. Then when I went into Peeps, I worked partly with Perry University as well as family engagement, where you can parents can attain classes or credit courses by taking these courses that would support the children with academic'",
        "'speaker_5': 'supports in the home. And I also taught ESL. So then I went into creating this curriculum, sort of a binder that parents can also support the children with academic supports in the home. So always thinking of how to consolidating this and making it easier for parents.'",
        "'speaker_5': 'Here I am in City Hall. I thought, wow, here we go. Full circle. Right. As a parent, as a single parent, we know for those of you who are not parents yet, even when you have your nieces and nephews with you or you're babysitting, it's a lot.'",
        "'speaker_5': 'And let's admit it. At first, you kind of wing it. You just, you know, 19, your first child breaks a leg. Your second child is okay. Your third child's a genius. That's the child that makes it. So I am proposing that we get together and talk about the possibilities of looking at different curriculums, the possibility of looking'",
        "'speaker_5': 'at already stuff that's already in place. How do we collaborate, maybe with a tech company or maybe a school to look at a possibility of one location to put all of this so that one the parent is saying Johnny brush his teeth or behavior modification, you guest stars.'",
        "'speaker_5': 'And the incentive is at the end of the week, you get allowance, but you track it all in one place. Me and my kids, I'm a tomboy. I know I look cute. I'm very girly, but I'm a tomboy.'",
        "'speaker_5': 'I ride a pickup truck. So I used to run with my kids 5:00 in the morning. But what if this app could also do physical fitness tracking? What if this app. I can also do nutrition. You're teaching parents to have very little resources to put all of this in one place and help them to be involved.'",
        "'speaker_5': 'Homeschool connection. Therapeutic Intervention. Follow support. Behavior modification, connecting to the site, connecting to all the services, all on one location. We know with digital divide parents and not all don't always have the time or the access to go on computers.'",
        "'speaker_5': 'But they're on Facebook, right? On Twitter. They have a phone. And so maybe we can use those resources to make it more accessible, user friendly, and support our families in improving and setting up their child for success. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Fernandez Anderson. Would anyone else like to speak on this matter? The chair recognizes Councilor Baker. Councilor Baker, you have the floor.'",
        "'speaker_2': 'Thank you. Councilor Fernandez Sanderson. I'm the 12th of 13, so I guess that makes me like a super genius or something like that. But I just want to rise and sign my name on. Thank you.'",
        "'speaker_0': 'Thank you. Please, Councilor Baker's name. What? Anyone else like to speak? The chair recognizes Councilor Edwards. Councilor Edwards, you have the floor.'",
        "'speaker_6': 'I wanted to rise to thank the maker. I think this is an incredibly creative approach to having the city meet people where they are and really acknowledging who the people are and what their day to day concerns and issues are coming from the perspective of a single parent coming from somebody who, as you said, is just trying'",
        "'speaker_6': 'to manage so many balls in the air. Creating an app or creating a city service is what I see it as. That means people there simply they can download it and possibly help organize well organized health, organize their day to day concerns and issues.'",
        "'speaker_6': 'And this is part of a lot of conversations when it comes to apps, as some of you may be aware, Attorney General Maura Healey had an app that dealt with young people who are in recovery or potentially going to be in recovery and concerned.'",
        "'speaker_6': 'So meeting people through an app is something a lot of local governments have not our state government has already tried to do, and I think it's wonderful to meet parents that way. They are already reaching out in so many different digital aspects to try and deal with how we run, how we eat.'",
        "'speaker_6': 'If you have intermittent fasting, if you have social, social, social connections, meeting people across the world, it's all happening on our watches. So the fact that the city of Boston that is so committed to meeting people where they are should also come up with a way to meet people on their watches or on their website that people'",
        "'speaker_6': 'can download apps for our school busses. We do that right now. We download apps to figure out all sorts of different things. So I think it's great. I also wanted to just echo the work that we have done in the City Council, the conversations we've had that as we build this again, meeting people where they are opportunity'",
        "'speaker_6': ', app opportunities to look at whatever as we build this. Just wanted to note the work that our sisters in service Mayor Woo and also councilor at large Julia McKee did in the language access ordinance to making sure that as this is developed we are developing in a way that it's meeting all people where they are in the'",
        "'speaker_6': 'language that they want. And again, credit where credit is due, not necessarily in words but using. The app to meet people who may not have the same literacy competency as everybody else. So thank you again, councilman, here for making sure that as we grow to meet people, we're meeting them that way as well.'",
        "'speaker_6': 'So I look forward to a culturally competent, language accessible app conversation about meeting parents and gathering resources together. Thank you so much for starting that conversation.'",
        "'speaker_0': 'Councilor Anderson Thank you, Counsel. Edwards The Chair recognizes Councilman here, Councilman here you have the floor.'",
        "'speaker_4': 'Thank you, President Flint. And thank you to my sister who is bringing so much innovation and creativity to how we are approaching city government and the role that we play. So I just want to thank Councilor Fernandez Anderson for her thoughtfulness and innovative ways of how we move through our committee around accessibility.'",
        "'speaker_4': 'These are the sort of things that we have really been exploring, like how do we make sure that city services are accessible to the people? So that accessibility piece is really important. And I really do appreciate my colleague, Councilor Edwards, uplifting the fact that there are a lot of people, adults.'",
        "'speaker_4': 'You know, I often talk about the fact that my mom didn't make it beyond the third grade and struggles to read and write, even in her native language. And as we start thinking about accessibility, that we have to be super mindful of the fact that we have returning citizens who are coming back, who are struggling with literacy'",
        "'speaker_4': '. We have young people who are being passing grade to grade, who are struggling religiously. So all of our digital accessibility issues need to be centered on the fact that not everybody knows how to read and write, and that's a privilege that a lot of us have.'",
        "'speaker_4': 'So thinking about the use of visuals and videos and other ways, it's going to cost a little bit more. But if we're serious about making sure that everyone has access to the information, even if it's through an app, that visual component and audio is going to be key to the success of this.'",
        "'speaker_4': 'And I also really do appreciate that you brought in your own story in terms of navigating, because as my good colleague, Counsel Lara always says, that the personal is political. Right? And when we're creating policies that we have lived through, what the solutions that we come to the table with are based on things that we wish we'",
        "'speaker_4': 'would have had. And so I know that I'm your leadership in this space. Not only is going to be about the public hearing, but you're going to also lean into it to make sure that we also get the resources that we need to be able to do it.'",
        "'speaker_4': 'I just want to say thank you and counsel that I uplifted you and our education committee because you do you do mention that the personal is is political and professional. And the and the intersectionality is the expectation is is that we are supposed to leave ourselves at the door when we come into this chamber.'",
        "'speaker_4': 'But we need to bring all of who we are into these spaces so that we can make sure that we fight for the people who put us here to ensure that we're representing them and their issues. And that's what this does today.'",
        "'speaker_4': 'So thank you, Consul Fernandez Anderson.'",
        "'speaker_0': 'Thank you, Councilman. Here. Anyone else like to speak on this matter?'",
        "'speaker_4': 'Can you add my name to please?'",
        "'speaker_0': 'Yes, please. Out, councilman. His name? The chair recognizes counsel. Clarity plays out. Counsel, fire his name. If you'd like to add your name, please raise your hand. Please add counselor Royal Counselor Bock Counsel Brady and Counsel Edwards. Counsel Clarity.'",
        "'speaker_0': 'Counsel Laura. Counsel Eugene. Counsel of counsel to hear counsel. Murphy Counsel Rao, please add the chair. 0409 will we refer it to the Committee on Public Health, Homelessness and Recovery? Mr. KIRK Please read so I could 0410 please.'"
    ],
    "Confirmation of Ralph Jackson for the Beacon Hill Architectural Commission.": [
        "'speaker_3': 'Just went through my initial motion and now instead I'm moving suspension and passage of docket 0406040720408 with the consent of the Chair a planning development of transportation. The Beacon Hill Architectural Commission currently only has one valid full member, and so it's creating a real issue.'",
        "'speaker_3': 'And our side and all three of these people are are well known folks who have been very active in the community. And so. Mr. President, I seek reconsideration since I know we put them on file, but instead to suspend and pass all three dockets.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, counsel. Do I hear a second? Second? Councilor Edwards second the motion. At this time, the chair recognizes counsel Baker. Counsel Baker. You have the floor.'",
        "'speaker_2': 'I just wanted to rise. And in consultation with counsel, counsel, I'm familiar with this situation here. I believe for the for the Beacon Hill Architectural Commission to actually do business. This is this is this is an easy road for me here.'",
        "'speaker_2': 'So I have no problem not having a hearing on these ones. Thank you, Mr. Chair. Mr. President.'",
        "'speaker_0': 'Thank you. Thank you, Counsel Baker. So on docket 040604070408. Mr. Clerk, are we taking a we're going to take a vote on each one separately. So we'll start with zero four, zero six. All those in favor say I.'",
        "'speaker_0': 'I opposed say no, no. The ayes have it. Docket 0406 has passed. We talk at 0407. All those in favor say aye. Aye. I oppose any. The ayes have it. Dawkins 0408 all in favor, say I. I opposed.'",
        "'speaker_0': 'Nay, the ayes have it. Docket 0406.0407.0408 have passed. We're on to personnel orders. Mr. Clarke, please read Target.'",
        "'speaker_1': '04110411 Council of Flynn for Councilor Loyal.'"
    ]
}