{
    "Certification of Election Results for District 1 City Councilor.": [
        "'speaker_3': '06320632 communication was received by the city clerk from Anita Tovar as chair of the Boston Election Commissioners, certifying the results of the May 3rd, 2022 election held for the office of District one city councilor. From the city election department to Alex Durant, interim clerk city of Boston from Anita Tovar as Chair Boston Election Department May 16, 2022'",
        "'speaker_3': '. Regarding May three, 2022 Special Municipal Election for your records. Listed below is the candidate elected to the office of District One City Councilor held on May three, 2022 at the special municipal election in Boston. District City Council elected for a two year term to fill vacancy.'",
        "'speaker_3': 'Gabriella Coletta, 99 Trenton Street District one Certified results are attached. Sincerely, Anita Tovar as Chair Board of Election Commissioners.'",
        "'speaker_1': 'Thank you, Mr. Clerk. All those in favor of accepting Docket 063 to say I oppose say nay. The ayes have it. Docket 063 to has been accepted and will be placed on file. At this time I would like to invite mayoral and councilor like Coletta to come up and begin the swearing in.'",
        "'speaker_6': 'Thank you, Mr. President. First, I want to say it's always wonderful to be back. Old habits kind of stick. I accidentally voted to accept and approve the minutes killed off in this last vote. I also want to invite the Coletta family to please come up and be present and stand with us during the ceremony.'",
        "'speaker_6': 'So as.'",
        "'speaker_4': 'The.'",
        "'speaker_6': 'Terrorist family is coming up here, I'll just comment that here we have someone who is stepping.'",
        "'speaker_4': 'Into this role.'",
        "'speaker_6': 'Who has been doing the work for a long time. Did. You knows every part of this building. Having served alongside giants in this role before and at other levels of government. And more importantly, she knows every part of the district already, in addition to a very brief, quick special election campaign.'",
        "'speaker_6': 'She has been serving in these roles and serving the community for many, many years. So I'm incredibly honored to.'",
        "'speaker_4': 'See her step into this role.'",
        "'speaker_6': 'And for all of the work.'",
        "'speaker_4': 'That is ahead.'",
        "'speaker_6': 'And all of the incredible leadership that I know you.'",
        "'speaker_4': 'Will continue to demonstrate and.'",
        "'speaker_6': 'To bring into fruition. I want to recognize that as part of that journey, there are many others who serve in office now and have served who are so proud and cheering you on as well. Of course.'",
        "'speaker_4': 'The documentary filmmaker Lydia Edwards.'",
        "'speaker_6': 'Who is capturing every moment of this state senator. State Representatives Adrian Monroe and Aaron Mikovits are here. Former City Councilor Anita Savvy George is here. Former former city councilor Selin martinez is here.'",
        "'speaker_4': 'Oh, and I see former former former city councilor Dan Monica.'",
        "'speaker_0': 'Is here as. Did I miss anyone?'",
        "'speaker_6': 'No. And of course, we see community leaders from East Boston, from Charlestown, from the North End all gathered here as well. Okay. So first, would you like to introduce your family and then all of us?'",
        "'speaker_4': 'So I'm incredibly lucky to be surrounded by amazing individuals who showed me the way. So I just want to introduce my sister, Angela. She's seven months pregnant. She's still here. She's amazing. Sebastian Zapata, my partner, my grandmother, Helen Coletta is here.'",
        "'speaker_4': 'The matriarch of the family. My father, Edmund Coletta. And my mom, Nina. Get a koala.'",
        "'speaker_6': 'Okay. So we're going to administer three separate oaths to the commonwealth, to the city and to the United States of America.'",
        "'speaker_4': 'I. Gabriella Coletta. Do solemnly swear. But I will bear true faith and allegiance to the Commonwealth of Massachusetts and support the Constitution thereof and will support the Constitution thereof. So help me God. So help me God. I. Gabriella Coletta.'",
        "'speaker_4': 'Do solemnly swear. That I will faithfully and impartially discharge in. Discharge and perform. All the duties incumbent upon me as a member of the City Council of the City of Boston. As a member of the City Council of the City of Boston, according to the best of my ability, understanding according to the best of my ability and'",
        "'speaker_4': 'understanding agreeably, agreeably to the rules and regulations. The rules and regulations. The Constitution and the laws of this. Of the Constitution and the laws of this Commonwealth. So help me God. I. Gabriella Coletta. Do solemnly swear. That I will support the Constitution of the United States.'",
        "'speaker_4': 'So help me God. Congratulations. She's signing the official book. First woman.'",
        "'speaker_1': 'Excellent.'",
        "'speaker_4': 'Thank you. So I'm very lucky. Boston City Council President Ed Flynn had told me I'm able to give some brief remarks that doesn't count as my maiden speech, so I will certainly take advantage of that. But I promise I will be brief because I know we have a packed agenda.'",
        "'speaker_4': 'I just want to say thank you, Mayor Wu, distinguished guests and now my colleagues on the council and everyone for being here to share this incredible day with me as a former city council staffer. I have a unique appreciation and reverence for these chambers from being an Easter kid coming in here with my mom to advocate for'",
        "'speaker_4': 'our community. To my first day here as a staffer. I stand before you now deeply honored and humbled to be Boston City Councilor for District One. I'm in full acknowledgment and awareness of who and what it took to bring us here together today.'",
        "'speaker_4': 'So in this moment, I want to create and share this space in gratitude with you all. There are some special people in my life who I will recognize first, and that is my family. I mentioned them briefly, but I just want to first recognize the matriarch of my family, Helen Coletta.'",
        "'speaker_4': 'So happy you could be here today, Grandma. I'd also like to recognize my grandparents who are here watching over us. The late Edmond Colette, a senior, the late Alessandra argueta, and the late Celia Trujillo. Please watch over me and guide me on this journey.'",
        "'speaker_4': 'My parents, Edmund Calata and Nita Gaita to letter. Dad, thank you for instilling the values of kindness, humility and service to the community. Thank you, Mom. If I say if I. If I have sharp elbows, she's the one to thank.'",
        "'speaker_4': 'Thank you for my activist spirit and how to not only break the ceiling, but how to swing the hammer. Thank you. My sister and hype woman, Angela Colette Acevedo. My brother and political strategist Chris couldn't make it here today.'",
        "'speaker_4': 'He lives in Baltimore, but I know he's here with me today. And my incredible partner, Sebastian Zapata. I could not have done this without you first. I could not have done.'",
        "'speaker_6': 'This without you.'",
        "'speaker_4': 'Of course, to the incredible elected officials who are here. Mayor Woo, thank you for already pushing us to aim higher and to be bold. You're already making history and I so look forward to working with you. Thank you.'",
        "'speaker_4': 'Other elected officials who are here. Diane, Monica. I'm here because you did everything. I stand on your shoulders. You were the first. So thank you. I also sell a martini here. And thank you, Sal. And I believe Paul Skripochka will be joining us in just a little bit.'",
        "'speaker_4': 'And then also the state delegation. State Rep Aaron Markowitz. Thank you so much for everything. State Rep Dan Ryan, he's not here, but thank you, Dan and State Rep Adrian Monroe. It only took seven years to go from little sister to colleague, but I'm so happy to do this work with you.'",
        "'speaker_4': 'State Senator Lydia Edwards. It's Lydia with a Y. I told you. To the moon and back. Always. Thank you for teaching me to shine my brightest light. And a special recognition to the Boston City Council and President Ed Flynn, his staff and central staff for accommodating and welcoming me on my first day and to my colleagues on'",
        "'speaker_4': 'the Boston City Council. What an impressive group of powerhouse individuals. I look out at all of you and I realize that this is Boston. And I'm happy to be here. And I'm just in on every single one of you and what you've accomplished as a body this year.'",
        "'speaker_4': 'We are here because we believe in the power of municipal government and how it can better the lives of residents. We are here to ensure a vibrant, resilient, resilient and equitable city for everybody. We are here to bring the voices of those in our communities to the halls of power.'",
        "'speaker_4': 'And I look forward to learning from each and every single one of you and what your lived perspective is. And ensuring that we can build a brighter Boston for everyone. The work literally starts today. We have a working session at 3 p.m., so I will see you there.'",
        "'speaker_4': 'And I know that we will not agree on everything and there will be some tough conversations ahead of us. But I promise to be collaborative. To work towards consensus and compromise and to let the work be the motivation and not the politics.'",
        "'speaker_4': 'I want to be sure to recognize the district that raised me. They gave me everything and elected to elected me to represent them on the city council. Charlestown, East Boston in the North End. I love you. You have my heart always.'",
        "'speaker_4': 'Each is uniquely beautiful and each has its own set of challenges. But I know looking at this room and those in the community, there's nothing too big for us to tackle together. For my neighbors and constituents. You have my commitment to be bold, to speak truth, to power, to fight for your interests, to be inclusive and welcoming'",
        "'speaker_4': 'of all people, no matter who you are or where you come from, especially our immigrant brothers and sisters. I promise to be accessible and responsive, and you have my commitment that I will center your voice in every conversation and action.'",
        "'speaker_4': 'I promise to serve with empathy, with compassion, and with a little bit of that grit that I got from my mama. I won't be perfect, but I ask for Your Grace and for your partnership in this work to learn, grow and mobilize with me.'",
        "'speaker_4': 'The work starts today and I cannot wait to get started. Thank you, everybody.'",
        "'speaker_1': 'Thank you. Thank you, Mayor Wolf, for being with us today. And we're proud of you. And you're welcome to the council any time. And thank you to some of the city employees that are here with us as well to experience today's day.'",
        "'speaker_1': 'The mayor mentioned the former elected officials that are that are here. I was going to do that, but I don't think they need to be recognized twice. Mr. Clark, can you can you have the record reflect that Counsel Fernandez Anderson is here?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'And Counselor Carter is here. We're going to we're going to go back to the original start of the agenda. And we do have several, several groups that are here with us today. So we wanted to take this opportunity to to recognize them.'",
        "'speaker_1': 'So one of the groups that we have, counselor inclusion already already mentioned was a poet and performer. And we also have another special guest from Counselor Murphy. As you can see, our dedicated and professional M.S. staff is here as well.'",
        "'speaker_1': 'She. So at this time, I'm going to I'm going to ask Council Jen to please introduce our perform before today. We usually have one performer each week, but this was a special exception. So we are having to choose today.'",
        "'speaker_1': 'Come up and come on up, counselor.'",
        "'speaker_4': 'Thank you, President Flynn, and welcome to our new colleague, Councilor Gigi Carrera. Looking forward to working with you. So in continuation today is Haitian Flag Day. Last Friday, many of you joined us for our wonderful breakfast that we had out on City Hall Plaza.'",
        "'speaker_4': 'And but I wanted to bring a bit of that spirit into the chamber today, given that today is the day of the Flag Day. And with me, I have originations founded in 1994 by artistic director Samba de Banga.'",
        "'speaker_4': 'Origination is a nonprofit that produces innovative and dynamic performing arts programs which motivate, challenge and inspire you to be the best they can be. They offer quality dance, theater, arts and African history education. And I have friends who've been in originations, and I'm so glad that we can have them here today.'",
        "'speaker_4': 'Performing for us will be ninth grader, ninth grader Alana Laforest, who herself is Haitian-American resident of Rosendale, ninth grader, all star. And to those of you who were here last Friday and saw the Manhunt School perform there, a dual immersion school, a dual immersion school in Mattapan, where they take classes in Haitian Creole and in English.'",
        "'speaker_4': 'She works with them. So she's just an all around, all star ninth grader at Basilan Academy who's here to sing for us and read us a poem. So, without further ado, Alana. I just want to thank counsel there, John, for that beautiful introduction.'",
        "'speaker_4': 'So to begin, I will be singing the Haitian anthem so I can can I ask that all rise for the. Why did they send us information? Men. Other men. Not me. 10%.'",
        "'speaker_0': 'But against, let's say, fat Sal.'",
        "'speaker_4': 'Matt said. No, no. I say mandala means nothing.'",
        "'speaker_0': 'I mean, be bad. I know. I know. My dad wants.'",
        "'speaker_4': 'For. I see all known tombstones. But no.'",
        "'speaker_7': 'Next I will be reciting a poem written by.'",
        "'speaker_4': 'Somebody in Gita Banga, and then I will translate it into Haitian Creole for it in honor of Haitians like that. So. I love myself. I love my brown skin, the bend of my hair, my dark brown eyes and the way that I stare.'",
        "'speaker_4': 'I love my physique. The way that I walk, the way that I smile and the way that I talk.'",
        "'speaker_7': 'I am unique. I am one of a kind.'",
        "'speaker_4': 'There is no one like me in this world so divine. I'm an original. Can't ask for more than that. When I was created, the whole world jumped back. I'm proud to be me. These hips and these lips. The fullness of my nose.'",
        "'speaker_4': 'And the fall of my twist. I am me. And I love myself.'",
        "'speaker_7': 'And now for the Haitian translation. Well, I may sit and wait. Men. Women, men. Formal wear Cuban now shave in. Jane Wyman when Joe MacPherson went on it, when I met Physique, my advice on where my shit went unique.'",
        "'speaker_4': 'We say you.'",
        "'speaker_7': 'Non-Euclidean.'",
        "'speaker_4': 'By ken akin lots tom.'",
        "'speaker_7': 'We're not lemo went Oh, easy now we're back. Come on, de.'",
        "'speaker_4': 'Poo, please. Possessor. LIM We're.'",
        "'speaker_6': 'Clear.'",
        "'speaker_7': 'LIM One idea followed to Lim. When you.'",
        "'speaker_4': 'Did sit with was the boost that Mensa at severe to.'",
        "'speaker_7': 'A desire. Once it went. And William sent me. So just want to say.'",
        "'speaker_4': 'Thank you to Alana. Thank you to Shonda. How you reached out and were like, How can I help? And I'm glad to have you here. I know there's so many of us here are so big fans of yours.'",
        "'speaker_4': 'I know Cancelmi has been a longtime fan, so just thank you for all you do for our young kids and making them know their history and being able to celebrate Haitian flag. And thank you to President Flynn for allowing this moment to happen.'",
        "'speaker_4': 'So thank you, Steve. I think they.'",
        "'speaker_1': 'Thank you, counselor. Joan. And that performance was was excellent. The poem was excellent in the song. The national anthem was excellent. Our next presentation is by Councilor Murphy and I. I'd like to ask Councilor Murphy to please come up.'",
        "'speaker_1': 'At this time.'",
        "'speaker_6': 'Thank you, President Flynn. So and thank you and congratulations. It's nice to see that someone sitting in the seat again. Welcome. It's wonderful. So dating Boston EMS professionals provide lifesaving services every day and risked their lives each time they answer the call of service for our city.'",
        "'speaker_6': 'Boston Emergency Medical Services is one of three public safety agencies that respond to 911 calls in the city of Boston. Their department cares for patients with clinical proficiency, professionalism and compassion. They have been frontline leaders in helping our communities combat the COVID 19 pandemic, the opioid epidemic, and citywide emergencies in turn in 2021 alone.'",
        "'speaker_6': 'EMS professionals have answered the call for over 126,000 clinical incidences 160,577 life support responses, and 79,210 transports serving residents across the city in every neighborhood. In addition, regarding COVID 19, the Boston EMS have cared for tens of thousands of suspected COVID 19 patients.'",
        "'speaker_6': 'Over 7800 confirmed positive residents. And they have administered more than 2300 COVID 19 vaccinations. This year's National EMS Week theme is rising to the challenge, something members of the Boston EMS have exemplified during the COVID 19 pandemic and always before that also.'",
        "'speaker_6': 'Earlier this week, I attended the graduation ceremony alongside EMS Chief James Hooley and Councilor Baker and Bach, and celebrated the graduation of the largest class, the graduating class of 30 M TS. This class was the largest in over a decade, and we saw the next classes already started there.'",
        "'speaker_6': 'Two weeks in, we will give the. This will give the EMS a boost to continue their service to our Boston community and residents. In short, I asked that the Boston City Council join me in honoring the contributions of the Boston Emergency Medical Service Department and EMS Chief Hooley and all of his workers his and recognize that May'",
        "'speaker_6': '15 through May 21st as Boston Emergency Medical Service Week.'",
        "'speaker_0': 'So thank. Two speeches.'",
        "'speaker_6': 'And thank you also yesterday for being here for the budget hearing. That was wonderful. Yes.'",
        "'speaker_2': 'No.'",
        "'speaker_5': 'Thank you. I know you got a busy day. Thank you for thinking of us this week.'",
        "'speaker_1': 'This body's has been terrific as long as I can remember. The City Council has done something like this for us.'",
        "'speaker_5': 'We typically try to get a little bit bigger group, but everyone's kind of.'",
        "'speaker_1': 'Busy today too as well. Deputy Alexander, who met yesterday at the hearing.'",
        "'speaker_5': 'Today, is working a grill at Shirley Street in Roxbury as we're attempting to.'",
        "'speaker_1': 'Feed people on all three shifts, delivering food out to them so that we, the command staff, we're able to take turns at it today. So she's busy and one of our other deputies unfortunate injured in the minor accident yesterday and she couldn't make it today.'",
        "'speaker_1': 'But anyway, thank you all very much. Rising to the occasion as the theme this year and rising is the council was saying and you know, we want to be there. We want you all to be able to count on us, depend on us, and thank you for all the support that you give us every day that makes'",
        "'speaker_1': 'that possible. Thank you. Thank you. I'd like to ask my colleagues to please join us for a photo. And then the second photo, I'm going to ask the Haitian delegation if we can do a second second group photo as well.'",
        "'speaker_1': 'So if my council colleagues could please join us and then please stay up here, and then we'll ask the Haitian delegation if they could come up immediately thereafter.'",
        "'speaker_0': 'The United States. But I'd like. Yes. We?'",
        "'speaker_5': 'And now we see to say that we have a six.'",
        "'speaker_6': 'Arms sort of.'",
        "'speaker_5': 'Space theory with.'",
        "'speaker_2': 'All things.'",
        "'speaker_6': 'And while we're waiting for the second photo, I do just want to thank Councilor Braden for co-sponsoring this with me. I did not mention that.'",
        "'speaker_0': 'Sorry. It was nice to see you.'",
        "'speaker_1': 'We're going to do the second. We're going to do the second photo now.'",
        "'speaker_2': 'Which I'm not. I will come back. Yes. I think thinking was.'",
        "'speaker_1': 'Thank you. Communications from her honor the mayor. Mr. Kirk, can you please read docketed 062520628 together, please.'"
    ],
    "Supplemental Appropriation for the Boston Police Department and the New York Typographical Union Contract.": [
        "'speaker_3': 'for collective bargaining by $5,473 to provide funding for the Boston Police Department for the fiscal year 22 increases contained within the collective bargaining agreements between the city of Boston and the New York typographical union. Miss docket number 0630.'",
        "'speaker_3': 'Message In order for the supplemental appropriation order for the Boston Police Department for fiscal year 22 in the amount of $5,473 to cover fiscal year 22 cost items contained within the collective bargaining agreements between the Boston Police Department and the New York typographical union.'",
        "'speaker_3': 'The terms of the contracts are until the first 2020 to September 30th, 2023. The major provisions of the contract include base wage increases of 2%, 1.5% and 2% to be given in September of each fiscal year. The contract term filed in the office of the City Clerk on May 16, 2022.'",
        "'speaker_1': 'Thank you, Mr. Kirk. So Ducats 062520628 will be referred to the Committee on City Services Innovation Technology on Docket 0629. 0630. The chair recognizes counsel Bork. Counsel Bork as the Chair of the Committee on City Services Innovation Technology Council book.'",
        "'speaker_1': 'You have the floor.'",
        "'speaker_8': 'Thank you so much, Mr. President. We, for the four prior dockets, will have a hearing to discuss the particulars. But with this specific the $5,000 appropriation in oh six to 900, that's really for just two workers. And it's it's exactly the same as the agreement that the council already approved for asked me 93.'",
        "'speaker_8': 'So it's the identical deal. And I think in the interest of letting those two workers get their backpay and because there's no further information that the council hasn't already heard from the administration, I wanted to move for suspension and passage of dockets 0629 and 0630.'",
        "'speaker_1': 'Thank you, Counsel. BLOCK Counsel seek suspension of the roles and passage of Docket 0629. All those in favor say aye. I am opposed. Say no. The ayes have it. The docket has passed. Council BLOCK six suspension of the rules and passage of docket 0630.'",
        "'speaker_1': 'All those in favor say aye. I opposed say no. The ayes have it. The docket has passed. Mr. Clerk, please read docket.'",
        "'speaker_3': '06310631 message transmitting certain information under section 17 of regarding the Mission Hill K through eight school docket number 0591, passed by the Council on May 4th, 2022.'"
    ],
    "BCYF Revolving Fund Limit for City Hall Child Care.": [
        "'speaker_3': 'Orders for the capital budget, including loan orders and lease purchase agreements. And docket number 0492 message in order authorizing a limit for the Boston Service for Youth and Families. DC Way of work revolving fund for fiscal year 2023 to pay salaries and benefits of employees and to purchase supplies and equipment necessary to operate the City Hall.'",
        "'speaker_3': 'Child Care. This revolving fund shall be credited with any and all receipts from tuition paid by parents and or guardians for children enrolled at the center. Receipts and resulting expenditures from this fund should not exceed more than $900,000.'",
        "'speaker_1': 'Thank you, Mr. Clarke. The chair recognizes Councilor Fernandez Andersson, chair of the Committee and Ways and Means Counselor Fernandez Innocent. You have the floor.'",
        "'speaker_4': 'Thank you. President Flynn, the Committee on Ways and Means continues to hold hearings for to review the FBI 23 budget docket under a048020486. And on Thursday, we heard from what we've heard. We've held six public hearings so far this week with at least all of my counsel colleagues in attendance, alternating in attendance.'",
        "'speaker_4': 'On Thursday, we heard from Boston Public Boston Police Department. At 10 a.m. we heard from Boston Commissioner's office, the Bureau of Professional Development, the Bureau of Professional Standards, Bureau of Community Engagement and Bureau of Field Services. At 2 p.m..'",
        "'speaker_4': 'Then we heard from Bureau of Admin and Technology, Bureau of Investigative Investigative Services and the Bureau of Intelligence and Analysis. Then on Monday, we were joined in the chamber at 10 a.m. by the Boston Center for Youth and Families, where we discussed their budget and revolving funds at 4 p.m. on Monday.'",
        "'speaker_4': 'Also on Monday, we hosted Youth Employment and Engagement Hawaii. Yesterday, we were joined for two sessions by the Boston Public Health Commission, 10 a.m. We heard from child, adolescent and Family Health, community initiatives and infectious diseases. Later at 2 p.m., we heard from emergency medical services, homeless services and Recovery Recovery Services.'",
        "'speaker_4': 'So. And tomorrow we'll be hosting the Office of Equity Resiliency and Racial Equity at 10 a.m. And then to we will hold we will have in attendance the Boston of the Office of Immigrant Advancement and the Office of Women's Advancement.'",
        "'speaker_4': 'And this afternoon, we will have our second working session to discuss FY 23 budget at 3 p.m. and 2 p.m. On to your room. Over the next weeks, we will continue to review the FBI 23 budget and with additional departments and also counsel working sessions.'",
        "'speaker_4': 'I recommend that these matters remain in committee.'",
        "'speaker_1': 'Thank you, Councilor Fernandez Anderson. Docket 048020482.0483.0484204862049. To remain in committee motions, orders and Resolutions. Mr. Clerk, please read Docket.'",
        "'speaker_3': '06340634 Counsel letter of the following order for a hearing to discuss the creation of a civilian construction details program.'"
    ],
    "Hearing on College and High School Partnership for Jobs and Academic Supports.": [
        "'speaker_1': 'Council. Royal Council. Meet here. Council. Anyone else. Okay. Docket 0634 will be assigned to the Committee on City Services in Innovation Technology. Mr. Clerk, please read Docket 0635.0635.'",
        "'speaker_3': 'Councilor Fernandes Sanderson offer the following order for a hearing to discuss ways of creating a partnership between colleges and high schools that will create jobs and academic supports for students.'",
        "'speaker_1': 'Thank you. The chair recognizes Counselor Fernandez Anderson. Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_4': 'Thank you. Earlier, I just so you know, I forgot to do my slogan when you said Councilor Fernandez Anderson aways, it means I was going to be like where the money resides, where the money resides. But then I forgot and then it's just too late.'",
        "'speaker_4': 'So I'll just go on to talking about this one now. So I think that, you know, the possibility of getting academic support to our high school youth via partnering between area colleges and high school is super exciting. I wonder if we can discuss at this opportunity in terms of how we can hold colleges accountable by way of'",
        "'speaker_4': 'some sort of community benefit or pilot program where they can compensate lower socioeconomic class or lower income students to tutor high school students and then create and also creating jobs to our high school or stipends as a compensation.'",
        "'speaker_4': 'So creating this incentive to get high schools. The two would get compensated of consequence compensated and the tutor would also be employed. And so a partnership between the city and area colleges and high schools to get academic supports to our high schools is important and vital.'",
        "'speaker_4': 'And I hope you guys can support this idea. Thank you. Oh, and I'd also like to add Councilor Resolution and Councilor Mickey to this order. Thank you.'",
        "'speaker_1': 'Hearing, hearing. No objection. Council illusion and councilman here. So, so added. Is anyone else looking to speak on this matter? The chair recognizes Constitution. Constitution. You have the floor.'",
        "'speaker_4': 'Thank you, President Flynn. And thank you, Councilor Fernandez, and for offering this. Many of the students in our city have no choice but to work and sometimes have to choose work over school because of family situations, especially for our black and brown students, especially for immigrant families.'",
        "'speaker_4': 'And so it's whether, you know, and we see this all the time, and sometimes it's just because of spending money. A lot of us here started early. I started as soon as I was able to work, I was working.'",
        "'speaker_4': 'That is why I think this is a really great idea, so that we can provide stipends. I'm a big fan of learning and earning give jobs to folks who are young kids, where they are able to learn and able to put some money in their pocket.'",
        "'speaker_4': 'That was a big benefit for me and all of my sisters who started working when we were 14. Um, so we know that a lot of our students are dropping out. They're not finishing school as the rate of at the rate of their white peers.'",
        "'speaker_4': 'And we know that a lot of them suffer from entrenched poverty that's rooted in cycles of structural racism. And so they can't afford to test for test. And we know that all of our wonderful and really wealthy colleges have the capacity to give back more and be better neighbors here in Boston to our students who need it'",
        "'speaker_4': 'the most. A stipend for studying program, as the counselor has offered, would be a win win win for our students, for our schools and for our local colleges. And universities would pay dividends for the students who need resources to move and motivation to continue their academic pursuits and choose learning over, you know, a just a regular job'",
        "'speaker_4': 'if every college students take a leadership role and to really be invested in the city of Boston. So I think this is a really great idea and I'm looking forward to partnering with Councilor Fernando Anderson on this to make sure that we are incentivizing our young kids and really doing the work of making, giving, giving them money'",
        "'speaker_4': 'so that they can so that they can learn. Thank you.'",
        "'speaker_1': 'Thank you. Counsel. Again, the chair recognizes councilman here. Councilman, here you have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you to my colleague for adding me. What a beautiful surprise. So I just thank you. And I just would offer that, you know, I always talk about the fact that I had three jobs when I was in high school.'",
        "'speaker_7': 'So working wasn't something that I felt was a privilege. It was really more about survival. And I think the more opportunities that we can create for young people to earn while they learn and also create a pipeline of being able to give back is important.'",
        "'speaker_7': 'So I'm I'm happy to support this and look forward to having this involved in any of my committees, both as the Chair of Education and Workforce Development. This is a nice intersection of both. I really do appreciate your leadership and your creativity about thinking outside the box.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_1': 'Thank you, councilman here. Would anyone else like to speak on this matter? What? Anyone else like to sign on to this? Please raise your hand. Mr. Kirklees. Council. Royal Council of Balk Council. Brighton Council. Councilor Fernandez Innocent Council.'",
        "'speaker_1': 'Florida Councilor Laura. Councilor Murphy, please add the chair. Docket 0635 will be assigned to the Committee on Pilot Agreements, Institutional and Intergovernmental Inter-Governmental Relations. At this time. I just want to acknowledge the former colleague, Boston City Councilor Paul Skippy Serpico.'",
        "'speaker_1': 'Paul, thank you for being with us today. Mr. Quirk, please read docketed.'"
    ],
    "Hearing on Life Insurance Need Study for Low-Income Residents.": [
        "'speaker_3': '06360636. Councilor Fernandes Sanderson offered the following order for a hearing to discuss the initiation of a study that assesses life insurance needs for low income residents.'",
        "'speaker_1': 'Thank you. The chair recognizes Counsel Fernandez and to send Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_4': 'Hello again. Thank you, counselor. President Flynn. So I'm getting a little bit chatty this afternoon, and I know it's going to. It's going to settle down, so I offer you this order. Due to both historic discrimination, merit out of perspective, black and brown holders of life insurance, and ongoing disparities in those who have coverage today.'",
        "'speaker_4': 'So black people have often been charged higher insurance rates for the same policies that others receive at lesser price. Due to this ongoing legacy of discrimination and a degree of distrust has developed. And many in the in the black community or black and brown community tend to overestimate the cost of life insurance.'",
        "'speaker_4': 'Black women are least likely or at least likely group to be insured, despite being largely responsible for raising a good percentage of the family units that they are a part of. Life insurance is an important financial resource to pass down.'",
        "'speaker_4': 'Those without it are in distinct disadvantage in terms of generational wealth. For these reasons and more, I offer this order to initiate a discussion in regards to the life insurance needs of poor and working class communities. And I guess I'd just like to say that, you know, it's also a really good idea to have to set up'",
        "'speaker_4': 'as a family to set up your financial portfolio. And for poor families, they often face this challenge of not being prepared. Unfortunately, we've all, I think, quoted the research here that black and brown people die in Roxbury 30 years sooner than their counterparts in Back Bay.'",
        "'speaker_4': 'And so oftentimes you see a lot of like sort of fund raisers, last minute go fund me to bury their loved ones. I think that this is it would be a really good idea to just do a study just to sort of assess the need in Boston and how we can support our poor and working class families'",
        "'speaker_4': '. Thank you.'",
        "'speaker_1': 'Thank you. Counsel Fernandez Anderson. Is anyone else looking to speak on this matter? Would anyone else like to sign on to this matter? Please raise your hand. Mr. Kirk, please add Council of Royal Council. Book Council. Braddon Council.'"
    ],
    "Hearing on Fines or Funding for Distressed Private Properties.": [
        "'speaker_1': 'Kolkata Council. Flaherty. Consultation Council here. Councilor Murphy, please have the chair. Dawkins 0636 will be assigned to the Committee on City Services and Innovation Technology. Mr. Clerk, please read Docket 06370637.'",
        "'speaker_3': 'Councilor Fernandes Sanderson offer the following order for a hearing to discuss reinforcing fines or implementing funding for distressed, distressed, privately owned buildings in vacant lots.'",
        "'speaker_1': 'Thank you. The chair recognizes Counsel Fernandez Anderson. Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_4': 'So I just got a note from my count, my colleagues it to read it. I'm kidding. Here we go. Listen. Look. How did I end up talking so much today? So I've been talking with Ice-T in different departments and really looking into this issue in Roxbury and particularly.'",
        "'speaker_4': 'And we you guys hear me talk a lot about the decrepit sort of, you know, abandoned looking and neglected properties in Roxbury. Right. And seriously, as we all know, there are dozens of lots around the city, particularly 87 and in surrounding predominantly black and brown working class communities.'",
        "'speaker_4': 'These lots offer space where exciting and innovative ideas could be occurring. And so also, you know, with a lot of these buildings to some some of it some of the issue is we know that of from poor families, they're not able to actually afford to repair their property and some of them fall in different category and there's'",
        "'speaker_4': 'different technicalities that prevent them from repairing their property. So I think it's it would be a good idea for us to start talking about what programs already in place funding that is left or not left. From what I'm hearing from different departments is that the funding is actually very low at this point and the program is always'",
        "'speaker_4': 'at almost at its end. So if we can actually discuss bringing in back reinforcing fines to those who can afford it without disproportionately impacting black and brown or poor families, obviously. And I would like to also add, as an original co-sponsor, Councilor Laurel, I know he's not here, know how that applies, but in council allusion to this'",
        "'speaker_4': 'order. Thank you.'",
        "'speaker_1': 'The chair recognizes.'",
        "'speaker_3': 'Counsel.'",
        "'speaker_1': 'Counsel Eugene at this time.'",
        "'speaker_4': 'President. Thank you, President Flynn, and thank you to Councilman Dennison for offering this. We know that we have an incredibly impossible real estate market right now. But still, Boston finds itself with a lot of buildings that are vacant or abandoned or blighted.'",
        "'speaker_4': 'And this has happened. This has been going on for years and years and years. Sometimes the reason is in part because speculators are land making and they're holding on to land and letting the prices rise while investing nothing and forcing neighbors to live next to properties that are in desperate need of repair.'",
        "'speaker_4': 'Many times, however, there are times when it's because the owner just doesn't have the money to keep up. It's really expensive to get work done. The cost of labor is increasing, so we need to continue to find ways to tell the difference between those opposed to the land making by the investors and the homeowner who just can't'",
        "'speaker_4': 'afford to make the improvements necessary. The other category of land owners who can't afford you should be supported with resources that Catherine Anderson was talking about. We need to make sure that we're uplifting, uplifting and supporting the neighbors in the neighborhoods to be able to do something about the property that everyone can be proud of.'",
        "'speaker_4': 'I was on the phone yesterday and today with a constituent who is dealing with this very issue. Banks, grants, consulting and programs all play a role in revitalization. And I know that there is a problem task force, problem property task force here.'",
        "'speaker_4': 'But how they work with community groups, neighborhood associations, see programs and grants still leave a lot to be desired. We, the city can do better to help connect the resource, connect resources and create them where necessary, especially in neighborhoods that have been historically disinvested.'",
        "'speaker_4': 'To make sure that each neighborhood is somewhere where, you know, we have we're building thriving neighborhoods where we all feel like our neighborhoods affirm our dignity. So thank you for having me as original co-sponsor and I look forward to the work.'",
        "'speaker_1': 'That you council. Mr. Kirk, please add Council John as an original co-sponsor. Unfortunately, we're not going to be able to add council. Where else, since he's not here. The chair recognizes Council of Bach. Council? Bach. You have the floor.'",
        "'speaker_8': 'Thank you so much, Mr. President. Thank you to the sponsors. And I just wanted to strongly say, please add my name. I was out walking with property management in Mission Hill yesterday, talking about graffiti and just in general, all these places where we see buildings that, you know, again and again, residents are reporting them.'",
        "'speaker_8': 'And it's coming back with that answer of either an investor owner who's absentee and can't be reached or in some cases a small business owner or a residential order that just the owner that just doesn't have the money.'",
        "'speaker_8': 'So I totally agree with the sponsors that we have to we need a program that better distinguishes between those folks and that is providing support for the folks who need the resources and I think is providing more substantial penalties and penalties that really bite for folks who are intentionally leaving their properties until an investment like a development'",
        "'speaker_8': 'opportunity arises and letting everyone else live with it. In the meantime, I just wanted to strongly second this and please I mean my.'",
        "'speaker_1': 'Thank you counsel block that she recognizes counselor Brad and counsel Brad and you have the.'",
        "'speaker_4': 'Floor. Thank you, Mr. President. Please add my name. I thank you so much for bringing this issue forward. Councilor Fernandez Anderson, the the business. The other issue that I know, my predecessor and councilor, Madam Ali, raised the issue about vacant shopfronts and storefronts in our business districts and our main streets.'",
        "'speaker_4': 'It's a similar sort of issue that may or may not be rolled into this conversation, but it's very detrimental to our Main Street districts to have vacant shopfronts and premises left vacant for long periods of time, years in some cases in our district, because an absentee landlord, landlord is just waiting for a more.'",
        "'speaker_4': 'Profitable opportunity, then perhaps a small local business that might use the premises. So please have my name. Thank you.'",
        "'speaker_1': 'Thank you, counsel. Anyone else like to speak on this matter? The chair recognizes. Counsel me here. Counsel me here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you to the sponsors. Please add my name. I'm really super enthusiastic about this, and I'd like to echo my colleague's sentiments, Councilor Breeden. And last year I believe it was council and I embarked on another journey to really address the commercial vacancies that are happening in our community.'",
        "'speaker_7': 'Those are all often distressed as well, and I think we have an opportunity to open up those storefronts and allow small businesses to incubate in those spaces. So I think that there's some room in this discussion if the chair allows through the chair to also add commercial vacancies into this conversation, because I think that is part of'",
        "'speaker_7': 'the whole community. So I wanted to just offer that as something that we can include. Thank you.'",
        "'speaker_1': 'Thank you, councilman. Here. Would anyone else like to what? Anyone like to sign on? Please raise your hand. Mr. Carter, please had council. A Royal Council. A Baker Council. A council. Brighton Council. A council. A celebrity. Council may hear.'"
    ],
    "Hearing on ARPA Fund Allocation for South Boston Community Health Center Expansion.": [
        "'speaker_1': 'Councilor Murphy, please have a chair. Docket 0637 will be assigned to the Committee on City Services, Innovation Technology. Mr. Clerk, please read Docket 0638.'",
        "'speaker_3': 'Duncan 0638 Council of Flynn offered the following quarter for a hearing to discuss the possibility of allocating our full fund funds for the expansion of South Boston Community Health Center.'",
        "'speaker_5': 'Thank you, Mr. Clark. The Chair now recognizes Council President. Flint Council. President Flint Clause.'",
        "'speaker_1': 'Thank you, Counsel Arroyo. May I add? Counselor Murphy in council as well as the original co-sponsors, please.'",
        "'speaker_5': 'Seeing no objections there. So added Councilor Flynn, the floor is yours.'",
        "'speaker_1': 'Thank you. The South Boston Community Health Center plays a critical role in our community. It provides many seniors with quality and compassionate medical care. We also have a strong behavioral and mental health component to it. We represent a large number of residents living in public housing and on some type of assistance.'",
        "'speaker_1': 'Many of the residents are from Mary Ellen McCormick. Many residents are from West Broadway Development. All the old colony, which is in Lynch as well. West Ninth Street. Which is another BP facility. Many of the patients that are at the South Boston Community Health Center, Health Center are communities of color.'",
        "'speaker_1': 'As I mentioned, 60% of the patients rely on some for some part of assistance. Many are living below the poverty line. During the height of the pandemic, the health center vaccinated over 35,000 people. There's also a vast increased demand, as I mentioned earlier, on behavioral health.'",
        "'speaker_1': 'I had the opportunity to visit recently and. The number of young people in students seeking mental health counseling or behavioral counseling is increasing dramatically. There is a proposed $20 million. For the continued COVID response another 8 million to augment behavioral health services.'",
        "'speaker_1': 'The expansion of the South Boston Community Health Center would would serve to fulfill both of these proposed uses under ARPA funding. They're expanding right next door. And again, part of that expansion is to the is to work on mental health counseling behavioral health counseling.'",
        "'speaker_1': 'I hope to have a hearing on this matter that it would be in the appropriate committee. But listen to residents, listen to the health center staff. Listen to patients, community activists, partners on on this proposal. Thank you, Councilor Rail.'",
        "'speaker_5': 'Thank you, Councilor Flynn. Councilor Flaherty. The floor is now yours. Thank you. Just to echo.'",
        "'speaker_1': 'The comments of my colleague and our council president, Cybersecurity Health Center does a phenomenal job, as do all of our community health centers. We are blessed. Not only do we talk about this all the time, we boast of some of the best hospitals in the world.'",
        "'speaker_1': 'We also have a network of community health centers that just provide front line care to some of our most vulnerable residents. And during COVID, I would argue that I believe it is the South Boston Community Health Center that stepped up and got right into so that COVID action, if you will council put in they were able to'",
        "'speaker_1': 'connect folks in our community particularly we have a Somali community that they service as well as the Dominican community and both of our local public housing developments. And as a result of that, they were able to expand the care and support other agencies like a local nursing home that was under siege at the time.'",
        "'speaker_1': 'So hats off not just to the South Boston Community Health Center, but to all of the community health centers, all the leaders, all those frontline workers that went to work every day helping all of our residents. And they're in need of some additional facilities and expansions and they want to expand their programs as to a sort of'",
        "'speaker_1': 'a lot of our other community health centers. So I wholeheartedly support this and look forward to an expedited hearing.'",
        "'speaker_5': 'Thank you, Councilor. Clarity. Councilor Murphy, the floor is yours.'",
        "'speaker_6': 'Thank you. So I'd like to start off by saying I am a patient at the South Boston Health Center, as is my family, and I'm also a board member on their fundraising committee. So I definitely know firsthand the great work they do and the strong role they play in that community.'",
        "'speaker_6': 'So not only is the South Boston Health Center the sole provider of primary and preventive care in South Boston, but it is also the first major health care provider located in the ever expanding South Boston waterfront. Funds would help the center prepare and expand this growing population.'",
        "'speaker_6': 'These funds would also combat inflation, especially with medical equipment supplies in their food pantry, which has seen a 50% increase in the amount of food distributed since the pandemic. They have done an amazing job feeding the people in the community.'",
        "'speaker_6': 'And in recent news, the health center has proven that the health center successfully rises to extraordinary challenges day to day in find safe ways to deliver care for their people. They did this especially during the pandemic. In 2021, the Massachusetts Health Quality Partners awarded South Boston Community Health Center for being one of the top practices in Massachusetts'",
        "'speaker_6': 'for patient experience in pediatric primary care. And in 2020, the Health Resources and Service Administration recognized them as the Health Center Quality Leader. This award is given to health centers that exemplify the best overall clinical performance among all health centers.'",
        "'speaker_6': 'And also lastly, in 2020, the health centers, overall clinical quality was in the top 30% of health centers nationwide. We know they're an amazing health care provider. They're also a great partner in the community and in the neighborhood.'",
        "'speaker_6': 'So with that being said, these funds would greatly benefit the health center and continue allow them to continue to deliver valuable care and services to their growing community.'",
        "'speaker_5': 'Thank you, Councilor Murphy. Would anyone else like to speak on this matter? Seeing no one? Would anyone else like to add their name? Mr. Clark, please add Councilor Bok. Councilor Baker. Councilor Bok. Councilor Braden. Councilor Coletta. Councilor Fernandez Anderson Councilor Lara, Councilor Emily and Councilor me here and please add my name.'"
    ],
    "Special Law for the Historic Beacon Hill District.": [
        "'speaker_5': 'Mr. Clark, can you please read docket 063900. Sorry, I got to refer that to a committee. Docket 0638 will be referred to the Committee on Boston's COVID 19 recovery. Thank you, Ms.. Clark. Mr. Clark, can you please read Docket 0639.0639?'",
        "'speaker_3': 'Councilors Bach and Flynn offered the following the petition for a special law regarding an act to make certain changes in the law relative to the historic Beacon Hill District.'",
        "'speaker_5': 'Thank you, Mr. Clark. The chair now recognizes Councilor Bach. Councilor Bach, you have the floor.'",
        "'speaker_8': 'Thank you so much, Mr. Chair. And thank you to Councilor Flynn for joining me in this. I'm going to speak on both of our behalf. Councilor Flynn and I have the benefit of sharing together the representation of Beacon Hill, and we'll have more working sessions under your remit, Mr. Chair, and opportunity to talk in greater detail.'",
        "'speaker_8': 'I'll be brief. Basically, when the Beacon Hill historic district extended down the North Slope in 1963, the city was poised to build our fire station on Cambridge Street, and people didn't want it to interfere. And so a very narrow strip of the last sort of 40 feet before Cambridge Street was excluded from the district in order to'",
        "'speaker_8': 'not have that complication. Now, there is the big project going on up on the other side of Cambridge Street and concern about some of the historic buildings, including the pepper building that's mentioned here from the 1890s that run on the Beacon Hill brick side of Cambridge Street.'",
        "'speaker_8': 'So the main thrust of this docket, and it's come to us from the Beacon, also the association and residents in the neighborhood is just to complete that last 40 feet of the district, which is something that I think most people assume is already in place, but actually technically isn't.'",
        "'speaker_8': 'So it's that and then a couple of other technical fixes to that. This is a home rule petition because the Beacon Hill historic district is in state statute. And so the first step would be amending it here at the council and then it would have to go up to the state.'",
        "'speaker_8': 'So just to say that this is something that has been discussed for a while and the Beacon Hill community and so folks have asked us to bring it forward. And I'm really pleased to be joining the council president and bring it forward today.'",
        "'speaker_8': 'So thank.'",
        "'speaker_5': 'You. Thank you. Councilor Bracken. Anyone else like to speak on this matter? What anyone else like to add their name would add their name. I would. Okay. Chair Now recognized Councilor Fernandes Anderson.'",
        "'speaker_4': 'I think you know what else can I say? There's nothing to say here except that this offer is a beacon of hope. And as long as we hope, we will never be over the hill. No, it's just. Come on, you guys are relying on me.'",
        "'speaker_5': 'So it's tough on.'",
        "'speaker_4': 'It's all right thing.'",
        "'speaker_5': 'The U.S. electorate heads when anyone else likes to speak on this matter. Seeing no one would anyone else like to add their name. Mr. Clarke, please add Councilor Braden, please add Councilor Coletta, please add Councilor Fernandez Anderson. Please add Councilor Flaherty, please that Councilor Lara please add Councilor Lui Jen please ad councilor me here please add Councilor'",
        "'speaker_5': 'Murphy and please add my name as well. Docket 0639 will be referred to the Committee on Government Operations. Thank you, Ms.. Clarke. Thank you.'",
        "'speaker_1': 'Thank you, Councilor Royal. At this time, I'd also like to acknowledge a friend of the council, Suffolk County Sheriff Steve Tompkins. Thank you for being with us. Mr. Clerk, please read dockets. 0640 in 0641 together please.'"
    ],
    "Section 17F Information on Personnel Review Committee and Vacancies.": [
        "'speaker_3': 'Numbers 0640 Council of Reading off of the following order for a hearing on appropriating federal relief funds to stabilize and expand public sector personnel capacity beyond pre-pandemic levels in dark number 0641 Council of after the following order requesting certain information under Section 17 F relative to the Personnel Review Committee and personnel vacancies.'",
        "'speaker_1': 'Thank you, Mr.. But she recognizes counselor Brad. And Counselor Brad. And you have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. These are two dockets related to our personnel capacity across city departments. As we work our way through the budgeting process, we hear from departments across the city about their personnel and their difficulties with vacancies within their departments, etc..'",
        "'speaker_4': 'The first docket is a hearing order on the use of ARPA funds for pandemic recovery. And the second docket is a 17 F information request related to the Personnel Review Committee and Human Resources Practices for posting and filling vacancies.'",
        "'speaker_4': 'For generations, public sector jobs have been a lifeline for working families in our city, providing secure employment for women and workers of color with better and better benefits, greater job security and opportunities for nonunion from union representation and full time work.'",
        "'speaker_4': 'Across the country, local government public sector employment did not recover from the Great Recession of 2008 and until 2019. And then we were hit by. Since the onset of the pandemic, the private sector has regained 93% of their jobs lost since 2020, while the public sector has only recovered 53% of the jobs.'",
        "'speaker_4': 'Looking at our city's recovery since the recession over the past 15 years, not all departments gained back their personnel full time equivalent levels of 2008, supported by the General Fund. Inspectional Services has not fully reached their 22,000 needed staffing levels yet.'",
        "'speaker_4': 'Year after year, they took on more responsibilities and when the council and mayor passed new ordinances. And we're pretty good at that. We've added a lot of work to their workload. In the last past past few years, public facilities and property management are staffed below 2008 levels, while facilities, maintenance and capital projects are stalled without without needed'",
        "'speaker_4': 'project managers. B Cyf has more than 60 permanent full time equivalent positions below their 2008 levels, and Public Works has 80 full time equivalent position deficit compared to 2008 permanent staffing. All of these departments are front lines for city services and meeting residents needs.'",
        "'speaker_4': 'An excerpt from the Municipal Research Bureau's 2014 Transition Report spells it out Through the Great Recession of 2008, the personnel reductions of the three largest departments of school, police and fire have been less than proportional to their share of the total city employees.'",
        "'speaker_4': 'The greater burden experienced by the other 42 departments and the reduction of employees over 11 years is also evidenced by the fact that the police, school and Fire Department represents 77% of city funded payroll in 2013, but experienced 36% of the employee layoffs since 2002.'",
        "'speaker_4': 'The remaining 44 departments are 22% of the workforce, but have had a 63% reduction. The US Treasury Department determined that ARPA fund relief may be used to bolster local public sector personnel capacity to restore pre-pandemic 2020 staffing levels or expand up to 7.5% beyond the pre-pandemic baseline.'",
        "'speaker_4': 'I hope to explore this in the the committee hearing. We have heard throughout the budget hearings that department after department is struggling to hire and fill vacancies. It's an incredibly competitive job market at the moment. The Position Review Committee manages the approval process for posting and filling vacancies since 2017 financial year 17.'",
        "'speaker_4': 'The city has also eliminated 190 long term vacant positions. But we must understand why those positions were left vacant for so long. What functions they served were the essential and are they currently being contracted out? The 17 f order is intended to provide the counsel insight into the personnel processes in the context of fiscal management and recovery'",
        "'speaker_4': 'policies over the span of multiple mayoral administrations going back to 2008. Not just what is in front of us right now. And in this moment, we have a responsibility to look at the human resources situation holistically and use any and all tools at our disposal to help recruit and retain personnel for our city workforce so that we'",
        "'speaker_4': 'can continue to sustain and deliver good quality constituent services across all departments and unleash the power of municipal government. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, counselor Braden. On on docket 0640. Would anyone else like to speak on this matter? The chair recognizes Councilor Bach. Council. Bach. You have the floor. Thank you.'",
        "'speaker_8': 'And thank you to counsel Braden for filing this. And please add my name. I think it's been the most frustrating thing for, I think many of us about budget season. But for those of us who are here last year, the number of things where we approved new positions last year and they haven't been filled because of this'",
        "'speaker_8': 'hiring situation. I mean, if you think about like Whitey, which we had up, we had approved them for for new people and said they lost people with the speed humps. We had approved a whole second team so we could parallel process.'",
        "'speaker_8': 'Instead, public works is down to one engineer. I was working with property management around graffiti busters yesterday and they've got to like a third of the team's vacant. So I just think like again and again, this council is seeing the limitations of like the appropriation power is nice, but if we don't have the staff in place, then'",
        "'speaker_8': 'the money doesn't move and the work isn't done on behalf of the residents, the city. And so I have appreciated the administration's references to their plan to kind of do comp and class analysis and try to raise salaries appropriately to be competitive.'",
        "'speaker_8': 'But I just think this is a critical issue and it's becoming critical in every department. And so I really appreciate Councilor Great. And bring it forward. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Counsel Buck. The chair recognizes. Councilman here. Councilman, here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And thank you to Councilor Reinhardt, even though I wasn't here for the hearing. I did hear that a line item that we fought for and approved last year, which was workforce development for 19 to 24 year olds, that a position wasn't filled.'",
        "'speaker_7': 'And as a result of that, that that line item has yet to be tapped. So when we fight for things on the council to serve our constituents and then we don't have the personnel to do the work, it impacts all of us.'",
        "'speaker_7': 'And so I really do appreciate you bringing this hearing and this request to the council, and I look forward to the conversation. Please add my name. Thank you.'",
        "'speaker_1': 'Thank you. Councilman here. The chair recognizes Councilor Baker. Councilor Baker.'",
        "'speaker_5': 'Thank you, Mr. President. Being someone that was laid off during that. I was laid off in 2010. Department people know about it still would never be able to figure out how much we're spending in the city on printing that department had to go away with.'",
        "'speaker_5': 'But what I wanted to focus on was what Kensi had spoke about. It's the people that are doing the work. If you look in the policy rooms, they're all full. All the nerds are all clicking away on their computers.'",
        "'speaker_5': 'All the policy rooms are filled. But the people that are doing the work, that are filling the potholes, that are mowing the grass, we don't have them there. We need to focus on that. The people that are actually doing the work, our constituent service sort of stuff.'",
        "'speaker_5': 'So I just wanted to add my $0.02. Thank you. And please add my name. Thank you to both.'",
        "'speaker_1': 'Doggett. Yeah, thank you. Councilor Parker. Anyone else looking to speak on the matter? The chair recognizes Council Fernandez Anderson. Council Fernandez Anderson. Do you have the floor?'",
        "'speaker_4': 'I rise in support to my council colleague. And to quote my angel, still I rise. That's the last what I promise. So I think this idea is genius. And speaking of nerds, thanks, Wayne. Now we've got a lot of work to do.'",
        "'speaker_4': 'I wholeheartedly support this. I think it's brilliant. Looking forward to it.'",
        "'speaker_1': 'Thank you. Council Fernandez Anderson. Anyone else like. Would you like to add your name? Please raise your hand. Mr. Clarke, please. Council and Royal Council of Baker, Councilor Bach, Council of Britain. Council of Fire City Council Council Fernandez Anderson Council at Lara Council Region Council me here.'",
        "'speaker_1': 'Councilor Murphy, please add the chair. Dakar 0640 besides the Committee on Boston's COVID 19 recovery. Councilor Braden also seeks suspension of the rules and passage of dockets. 0641. All those in favor say I am opposed to any this have it docket zero six for one has been passed.'",
        "'speaker_1': 'We're on 2.0642. Mr. Clark, please read that.'"
    ],
    "Hearing on City Government Decision-Making Protocols.": [
        "'speaker_3': 'Docket number 064 to cancel on me here or for the following order for a hearing on government accountability, transparency and accessibility of decision making protocols in city government.'",
        "'speaker_1': 'Did she ever recognize this councilman? Here, Councilman. Here you have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And I'd like to add Councilor Tanya Fernandez Anderson as an original co-sponsor.'",
        "'speaker_1': 'Council Fernandez Anderson is so supportive.'",
        "'speaker_7': 'Thank you. If you've heard me speak before, you know that you've heard me say nothing about us. Without us is for us. And it's something that I said a lot when I was first running for office. And it and it was meant to remind people that we can't let the people who are in power close the door'",
        "'speaker_7': 'on us when it comes to decisions and choices that they make every day that impact our daily lives and lived experiences. I thought as a city councilor that I'd be able to get in here and learn that the decision making protocols and bringing that knowledge to the people.'",
        "'speaker_7': 'But even now, as a councilor, I struggle to grapple with how decisions are being made. And I'm often notified that something in the administration is happening after it has occurred. Cabinet Appointments Department hires are made without consulting US.'",
        "'speaker_7': 'COVID ARPA dollars are being spent with little community interaction. KBA decisions are being made in opposition to popular support for certain projects, and in one study conducted in collaboration with our office, we found that nearly a quarter, a quarter of respondents said that they strongly disagree that their voice was heard to represent it and policy decisions.'",
        "'speaker_7': 'This is a problem, but it's not a problem that's unique to one mayor or one city council or one department. We have systems and structures in place in our cities that pre-date all of us, that determine how we make decisions and how we must collaborate in order to make those decisions.'",
        "'speaker_7': 'But those systems routinely leave the voices of the people out. And so that is why we're filing this hearing today. We need to get to the bottom of how decisions are being made here in the city of Boston, what systems and structures are in place that force us to make decisions that way, and what structural changes or'",
        "'speaker_7': 'even changes to the charter need to be made in order to ensure that the voices of the people and that's all people are being heard. I look forward to this conversation and learning more alongside my colleagues. I really do appreciate my favorite nerd in the policymaking space, Jacob Blake Hawk, for his relentless advocacy in getting us to'",
        "'speaker_7': 'this point. I really do believe if we're really serious about changing the way we do business, that's going to require us to look at how we are functioning. I know that I have been incredibly disappointed by the number of things that have come across this council, and I've been forced to vote yes or no on things that'",
        "'speaker_7': 'I haven't had much of a voice in. And I have a responsibility to my constituents to making sure that we're creating the type of structure that allows us for us to really. Represent them in their voices. So I look forward to the hearing and my colleagues to participate.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Counsel me here. The chair recognizes Counsel Fernandez innocent. Counsel Fernandez innocent. You have the floor.'",
        "'speaker_4': 'Thank you so much, counselor. President Flynn and my original co-sponsor, counselor. Me here. Thank you so much for partnering or adding me to your. Yeah. That the. So the councilor. So the council needs access to all relevant information eminent from the city government.'",
        "'speaker_4': 'Right. And the issue here, I think, is that if there's no if there's not one streamlined process, then things are can get, you know, sort of contrived or we lose trust in this paranoia. And we talk about this, these processes that include us, we talk about I've heard my council colleagues talk about equity and being what being'",
        "'speaker_4': 'that we know that certain thing or certain moneys affect a certain population and pulling on our heartstrings, beautiful presentations and all of that should be followed with good intentions and of course implementation of action. However, if we're not working on a transparent platform, if we're not if we're not doing that together as as my council colleague, Sister'",
        "'speaker_4': 'Maria said, if it doesn't if it's not with us, then it's not for us. So I strongly, of course, agree and support this and look forward to the work.'",
        "'speaker_1': 'Thank you. Thank you, Counsel Fernandez. Innocent. But anyone else like to speak or or sign onto this matter. Please raise your hand, Mr. Kirk. Please add Counselor Arroyo, Counsel of Brad and Counsel Coletta Counsel Fernandez Andersen Counsel Clarity Counsel Elara Counsel and Counsel Murphy.'",
        "'speaker_1': 'Please add the chair. 2:00 064 Cho will be assigned to the Committee on Government Accountability, Transparency and Accessibility. Mr. Clarke. Please read docketed.'"
    ],
    "Opposition to State Receivership for Boston Public Schools.": [
        "'speaker_3': '06430643 Council and me here for the following resolution Opposing State Receivership for Boston Public Schools.'",
        "'speaker_1': 'The Chair recognizes. Councilman here. Councilman, here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. I also like to add Counselor Arroyo as an original co-sponsor, as well as Counselor Lucia.'",
        "'speaker_1': 'So no objection. Council, Royal and Council Genocide Order.'",
        "'speaker_7': 'So last month, the Committee on Education held a hearing on Docket 0199 in order for a hearing on state receivership for Boston Public Schools. As you all may remember, I tried to pass this resolution on the floor, and I was encouraged by my colleagues that we needed a hearing and we did just that.'",
        "'speaker_7': 'The goal of the hearing was to educate the public and the council around what receivership is and how it impacts our school communities. The hearing was insightful because we heard time and time again from the administration advocates, family members, students and members of the community.'",
        "'speaker_7': 'That receivership is wrong is the wrong move for state receivership is wrong, is the wrong move for Boston for many reasons, not least of which is that D.C. has a miserable track record of improving schools it has taken into receivership.'",
        "'speaker_7': 'VSC has voted to place three districts in receivership. Lawrence in 2021. Holyoke in 2015, which I opposed back then as a parent advocate and Southbridge in 2016. Southbridge and Holyoke are now the worst performing and second worst performing school districts in the state.'",
        "'speaker_7': 'According to Ducey's most district ranking. Following an initial uptick, Lawrence has been on the decline, and it's now back on the lowest of 6% of districts. A Boston Globe analysis of test scores, graduation rates, college enrollment and a dozen other metrics Lawrence, Holyoke and Southbridge published on Sunday show that the state has failed to meet almost all'",
        "'speaker_7': 'of its stated goals for the district. BP's is not without its problems, and we all know that because we sit in these budget hearings every day. But these are problems that can be solved by turning to the community, not by initiating yet another executive leadership retooling.'",
        "'speaker_7': 'That kind of thinking lacks innovation and intentional. We avoid the core problems a BP is facing. You can swap out the players at the top all you want, but the instability created through that process trickles down to parents, students and teachers.'",
        "'speaker_7': 'And we're left exactly where we started. Only less engaged and less hopeful for the future. This resolution has been a long time coming. We filed it back in 2021, and there was a desire from the council to learn more about the receivership, which we did, which includes our school community.'",
        "'speaker_7': 'We followed through on that request and created space for community members and counselors to come forward and learn more. Since then, there have been several articles, op ads, personal testimonies on social media from people across the district urging the city to fight back against any threat of receivership.'",
        "'speaker_7': 'Receivership is opposed by members of this body and has received opposition from the mayor, even her in her children, who is a former D.C. board member, and came out and said that her vote to place Lawrence under receivership was the wrong choice.'",
        "'speaker_7': 'It simply does not work well when if we can't risk doing further damage to our school district by handling by handing over it to the board with no clear track record for improvement, it is time that we as the Boston City Council and the representatives of the people listen to their voice and join them in opposing any'",
        "'speaker_7': 'third of state receivership for Boston Public Schools. And I move and I move that we suspend the rules and urge my colleagues to vote in favor of this resolution. I will say, you know, everything is always political theatrics.'",
        "'speaker_7': 'And, you know, we have an opportunity here as a council to hold the district accountable. And it is our I would say it is in our best interest to make sure that we support this resolution, because it gives us the ability to hold the district more accountable instead of allowing outsiders to tell us what is right for'",
        "'speaker_7': 'our people. So I encourage our colleagues to rise up and vote in favor of this resolution today. Thank you.'",
        "'speaker_1': 'Thank you, councilman. Here. The chair recognizes Councilor Arroyo council royal. You have the floor.'",
        "'speaker_5': 'Thank you. Council President Flynn. And thank you, Counselor Maria, for your leadership. I voice my strongest opposition to taking our Boston Public Schools into receivership. I'm very aware of Desi's track record. I think the Boston Globe recently published that record, but we've heard it from advocates and we've seen it on the ground.'",
        "'speaker_5': 'They have not done really any commendable work in their turnarounds to date in smaller school districts. At the very beginning of my career, I worked in Lawrence, and so I commuted from Boston to Lawrence, and I got to see firsthand what that takeover did to that community and the parents and the lack of parenting.'",
        "'speaker_5': 'Isn't in the way in which that community has been fighting since to take back control of their schools so that they can have a voice in the decisions that are being made with their children. And as councilman here has noted, the academic improvements have really gone down.'",
        "'speaker_5': 'And that initial uptick, frankly, came from injection of resources, a small injection of resources into the actual facilities. If you actually saw the Lawrence facilities, they had put a lot of money into improving them and making them modern and standard.'",
        "'speaker_5': 'But now, as we sit here today, we've seen repeatedly that Disney does not have the ability or the resources or frankly, the skill level to come in and take these schools over. And so I am voicing my strongest opposition to receivership.'",
        "'speaker_5': 'I do believe that this is something that we can handle with Boston Public Schools. I do know that there are places where, frankly, we would like to see them do better. But I know adamantly that state receivership is not a solution to those things and that those are the kinds of things that we have better control of'",
        "'speaker_5': ', frankly, as a body here with parents engagement with the school committee and with the superintendent. I know that Councilor. Council President Flint is sort of raised up the specter of what receivership is doing to our current efforts to improve by selecting and hiring a new superintendent.'",
        "'speaker_5': 'And I think the fact of the matter is, having this over our Boston Public Schools heads is actually stopping us from getting and moving forward in a way that is productive. And so I would like to see this this pursue ended or at least the conversation around it ended because we know that they don't have the ability'",
        "'speaker_5': 'to really do this well. And so with that, I add my voice to this and I hope to see this passed today. Thank you.'",
        "'speaker_1': 'The chit. Thank you, counsel. The chair recognizes counsel, illusion, counsel, vision. You have the floor.'",
        "'speaker_4': 'Thank you, President Flynn. And thank you to Catherine here for this resolution. I also rise in very strong opposition to any notion that there should be any state intervention into our schools for a lot of the reasons that have been said.'",
        "'speaker_4': 'There's no track record of success. We are in a pivotal moment as a city with a largely new city council, a new mayor with a new vision for our schools. A lot of change. We're hiring a new superintendent.'",
        "'speaker_4': 'So for this to be thrown in as a distraction is unnecessary. And I also just I'm cautious that the state should always be cautious when the state is taking its cues from a free market think tank that really doesn't believe in the public good.'",
        "'speaker_4': 'Right. We're talking about what we need in our public schools, and that's deeper investment to make up for a lot of intentional policy failures and policy harms that have been done towards our schools. So I think, you know that the state is taking cues from a think tank that believes that the model should always be privatization, should'",
        "'speaker_4': 'be everything that we need to know about why this is not the right approach for our schools and for our students. I was with a teacher just last evening from the Denver school and the Denver has been in receivership since 2014 with almost nothing to show for that.'",
        "'speaker_4': 'And so I think we have the tools that we need here to really help transform our schools. The state does not. And so I am in strong support of this resolution, and I am glad that it was filed.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Constitution. The chair recognizes counsel. Clarity. Counsel, clarity. You have the floor. Thank you, Mr. President. And obviously thank you to our colleagues, counsel here and the co-sponsors. And I appreciate the spirit by which this is filed.'",
        "'speaker_1': 'I understand legitimate concerns about total state receivership, and I do not support total state receivership. With that said, I will not be signing on to the resolution but will not stand in the way. Pursuant to Rule 33 to allow the motion to be adopted, i.'",
        "'speaker_1': 'I just want to be perfectly clear that for me, this has nothing to do with our teachers, our beloved BTU, our students, or the countless individuals who work hard every day on behalf of our students. For me. It has to do with the systemic failures of our central office and the a proven inability to consistently support our'",
        "'speaker_1': 'schools, our teachers and our school communities. Our school district is consistently failing our most vulnerable students and violating the law, particularly as it pertains to our English language learners and our special education students. For us students that require IEPs, there are many cases where students do not have adequate accommodations or plans in place for our English language'",
        "'speaker_1': 'learners. There are documented failures to provide students with equitable access to ELA teachers inappropriate support. We also have significant operational issues. Whether it's our transportation system, our data reporting system, our facilities, our safety policies or mechanisms consistently tracking parental and community concerns, we don't have one.'",
        "'speaker_1': 'We don't have a system that tracks parental community concerns, despite the fact that we're talking about all the investments that we've made over the last several years. Look no further than this past January. 16,000 kids. 16,000 kids were left stranded.'",
        "'speaker_1': 'Didn't get picked up. That's never happened. I'm here almost 20 years. It's. I've never seen it this bad. You all know, I have been a fierce advocate for public education, a fight to support all of the critical investments in our district.'",
        "'speaker_1': 'I believe in those investments and I will continue to support them. I also believe that it may be time to talk about a strategic partnership or targeted interventions may be appropriate. Whether that's what the state or frankly, the federal government, if anyone here doesn't think that the Department of Justice is looking at this very issue.'",
        "'speaker_1': 'You are sadly mistaken. And I would rather come to the table and identify those three or four or five areas and partner or have targeted interventions with the state or the federal government as opposed to having them come in and taking the whole thing over.'",
        "'speaker_1': 'Which, again, as I referenced in the beginning of this, I do not support that. I think targeted partnerships in these areas where we've failed to consistently make progress year in, year out, year in, year out. Same old, same old.'",
        "'speaker_1': 'As we continue to do is keep increasing the budget. We continue to give them more money. We're actually educating less kids than we've ever educated in the city. 7000 less than the last couple of years. And I just think that the time has come to call it what it is, which is we need to call out the'",
        "'speaker_1': 'central office. It's not about calling out our teachers. It's not about the students. There are dedicated professionals, passionate, committed to our children, to making a difference in their lives, to closing those gaps has nothing to do with them.'",
        "'speaker_1': 'For me, this is about the central office. It's the buck stops with the superintendent in the central office. They are thwarting progress. They are getting in the way of good instruction, good support. And for me, I just think that the time has come that.'",
        "'speaker_1': 'We call them out. And whether it's a targeted intervention or it's a strategic partnership, I think now is the time between now and Tuesday to negotiate what that is. I understand it's a difficult time because we're trying to attract a new superintendent.'",
        "'speaker_1': 'This probably isn't the timing on this is horrendous. I know that we've got 31 applicants. I believe in the mail and are planning a visit to turn the schools around. I want to work with the new superintendent, allow him or her to get the legs underneath them to move forward.'",
        "'speaker_1': 'This may be an opportunity for them as well. We potentially could make an argument that if we allow those three or four critical areas where we've chronically and systemically underperformed, maybe we could negotiate that our new superintendent can be the receiver.'",
        "'speaker_1': 'What do they think about that idea? And so these are the things that I'm sort of thinking about. But again, I appreciate the efforts of our colleagues to lead sponsor for work on the Education Committee and the hearing that she hosted.'",
        "'speaker_1': 'And again, as I referenced, I wanted to state my objection for the record and again, state that it has nothing to do with our teachers. This is all about the central office and calling them out. And as I mentioned, Mr. President, I will not stand in the way with Rule 33.'",
        "'speaker_1': 'Thank you, Mr. President. Thank you, counsel. Clarity. The Chair recognizes Counsel Fernandez Anderson. Counsel Fernandez Enerson. You have the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I strongly support my colleagues. Offer a receivership has been shown to actually not improve quality of schools in the districts that have utilized that approach. And local districts that have gone under receivership are much smaller than Boston, and then in that process is ineffective for them.'",
        "'speaker_4': 'So that begs the question, like, if this policy cannot work on small district, and why would it work on a district as big or the biggest district in the state? Additionally, receivership is often used to counteract school districts that are struggling for a number of socio economic reasons that often transcend to school themselves, ensure our students need'",
        "'speaker_4': 'food, housing, language support and mental health counseling and so forth. So how does putting the schools that they attend and receivership into receivership help them actually get the resources and services that they need? The state is really far removed from our youth.'",
        "'speaker_4': 'They don't see our youth as individuals. They don't know our youth. And so because of this, I heartily endorse this offer from counsel over here and oppose BP schools being placed under receivership. Thank you.'",
        "'speaker_1': 'Thank you. Counsel Fernandez Anderson, the chair recognizes Counselor Baker. Counsel Baker, do you have the floor?'",
        "'speaker_5': 'Thank you, Mr. President. If this resolution defends and protects the status quo for a system that can't even keep our students, teachers and staff safe, graduation rates and and academic progress is astoundingly poor. So we want to double down on a system that's failing our children and our families.'",
        "'speaker_5': 'In a city where enrollment plummets alongside morale, we need fundamental change, and this resolution does the opposite. It's time for the City Council to illuminate the facts of what's going on in our schools, not to cover up the misdeeds and failures.'",
        "'speaker_5': 'We're pretending as if status quo is okay because it's not. Let's get a range of people in here and have a hearing. Let's get DeSean here. Let's not have the echo chamber that we're used to. Everybody saying we don't want we don't want receivership.'",
        "'speaker_5': 'Let's get some opposing views. The single sided. The single sided. Hearings don't work. Needs to be true to differing opposing views here, which we are not providing here in this chamber. I agree with counsel. Clarity with with the targeted interventions doesn't need to be a total takeover.'",
        "'speaker_5': 'Wildly unsafe. Kids unable to read.'",
        "'speaker_4': 'Buildings failing. Spending.'",
        "'speaker_5': 'I think it's 160 million. This year on transportation will be another 10 million next year. Another 10 million after that. We spend 40 to 50 million every year. Three times what the police budget is. We're looking to defund the police, but we're looking to double down on something that's failing.'",
        "'speaker_5': 'I just don't get it. I don't understand it. And you're either. Now it's going to be either receivership or not. There's someplace in the middle there which I think Counsel Clarity spoke to pretty well. So and that's where I am.'",
        "'speaker_5': 'Do I want the state to come in and take over? No, but I think there's definitely areas where we can be in it being improved. And you know as well as I know that safety is one of them.'",
        "'speaker_5': 'If we don't have safety in our schools, just like if we don't have safety on our streets, if we don't have safety in our transportation system, we can kiss it all goodbye. The schools are unsafe right now. That's a huge problem.'",
        "'speaker_5': 'Kids aren't able to read. That's a huge problem. So that's my $0.02. I will be voting no on this. And again, I won't block it if other people don't don't want to. But I think it warrants another hearing, a balanced hearing, if we're able to to do a balanced hearing.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Counsel Baker. The chair recognizes council ora. Council ora. You have the floor.'",
        "'speaker_7': 'Thank you, President Flynn.'",
        "'speaker_4': 'First, I want to say that I am in support of this resolution and I am against Massachusetts State Receivership for keeps. I attended the hearing that was chaired by Councilor me here, and I think it really did a good job at illuminating all of the issues that state receivership would cause for our school district.'",
        "'speaker_4': 'I was only going to vote in support and was not going to rise to speak. But after the show of political theater for my colleagues, I think that it's incredibly important that we really have an honest conversation about what we're talking about here.'",
        "'speaker_4': 'First, did not show up to the hearing after they were invited. So if through the chair, if my colleague, Councilor Baker, has any connections to get them to come and speak up for themselves, then we would love to have them there.'",
        "'speaker_4': 'Secondly, Boston Public Schools and DC have been under a memorandum of understanding that outlined what we would do to improve the issue areas that DC identified and what DC would do to support us to meet those areas. Boston Public Schools showed up, talked about all of the work that they have been doing on their side of the'",
        "'speaker_4': 'memorandum of Understanding. DC did not show up and to my knowledge and everybody that was there to testify could not prove that they had met any of the commitments that they made on the menu to us. Not only that, they sped up the review process so they didn't even give us the necessary time to really reflect back'",
        "'speaker_4': 'on on the review process and the promises that were made in value, which included supporting all of the issues that were outlined by Council priority and VIPs and DC has done nothing. So even during the process of the MOU, you with BPC and DC, they have been completely unable to provide not only results but any kind of'",
        "'speaker_4': 'support to us. Does what do Boston Public Schools have issues? Yes, absolutely. And we should be able to talk about those issues earnestly and we should be able to talk about those issues collectively. But it's absolutely no surprise that the State Department wants to come in here when the people of the city of Boston just voted to'",
        "'speaker_4': 'move to an elected school committee. And we have a mayor that is committed to hiring a superintendent that's really going to transform our schools. We're moving towards more democratic governance. We're moving towards a different vision for us. And now the state wants to come in and try to take over.'",
        "'speaker_4': 'This is an affront to the voters of the city. It's a slap in the face to the parents who have worked so hard to make sure that they can have a voice in the schooling and what happens in the schools where their students are attending.'",
        "'speaker_4': 'So the voters are going to tell us that they want one thing and we're going to stand up here and say that we care about students, that we care about teachers, but we're going to tell the voters where they can shove it and that we're going to support the State Department to come in here and tell us'",
        "'speaker_4': 'what we need to be doing with our schools. When the voters of this city has told it, have told us the opposite. You want to talk about having balanced hearings. The people of this city elected every single one of the councilors that are standing around here.'",
        "'speaker_4': 'So the people of the city have decided what voice they want here in the city council chambers. And every single one of us here is representing what the voters have asked us to come and represent so we can do one or two things.'",
        "'speaker_4': 'We can have an honest conversation about peace. We can file the resolution. We can say that, yes, we have problems, that we want to have an opportunity to fix those issues ourselves. We all just got here. The mayor just got here.'",
        "'speaker_4': 'We have so many problems to fix and we need to be given an opportunity to fix those issues so we can either say, give us a chance to do right by our families or we can say no. Let's let a failed model coming to our city and see if we can roll the dice on our children's education'",
        "'speaker_4': 'and roll the dice on what the voters of the city have already told us that they want. I, I, I appreciate the fire that i've seen from my colleagues. I get it. You got to stand up. There are people that want them to say what they need to say.'",
        "'speaker_4': 'But at some point we have to make decisions as the city council of one of the largest 25 cities in this country that are based on fact and that are based on data and not just political rhetoric. And that is why I'm in support of this resolution and I'll be voting yes.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Thank you. Counsel The Chair recognizes Councilor Murphy. COUNSEL Murphy, you have the floor.'",
        "'speaker_6': 'Thank you. President Flynn. So as the only educator on this body. Someone who has dedicated my entire career to teaching and nurturing the children of Boston, I am standing up today to say this is devastating. I was a student in BHP's in 1974.'",
        "'speaker_6': 'I put my son on a bus in 1992. I've been in the system as a mother. I've been in the system as a student and also as a teacher for over 20 years. Yes, the state in D.C. has a really bad track record.'",
        "'speaker_6': 'But Boston Public Schools has not shown us much better year after year, decade after decade. Transportation, food services, even basic services like getting our children to school, feeding our children. Never mind that so many special education students and students, which I was both the teacher of.'",
        "'speaker_6': 'Do not get the proper services they need. So, yes, the state will come in. Yes, the federal government will probably come in. But I'm just standing today to say I'm not standing up because there are voters out there or constituents who want me to say something.'",
        "'speaker_6': 'I'm standing up to say when asked, Where do I stand on receivership? I will always unapologetically say, I.'",
        "'speaker_4': 'Stand on the side of the children. We have failed them.'",
        "'speaker_6': 'And it breaks my heart. I've seen it as a mother who's had to pull her kids out of under-performing schools. I've seen it as a neighbor who listens to parents. It. It burns me that we spend so much money and so many families feel that you either get into a school and that's considered a got me hell'",
        "'speaker_6': '. You get the golden ticket. Every child in the city of Boston deserves to get a seat at a quality school. Every child in the city of Boston deserves to get that golden ticket. Not just a few of our families.'",
        "'speaker_6': 'I also stand in support of our teachers. The teachers. I know I was one of them for 24 years and I have been touring schools since I got here. On the other side now is a city councilor and yes, you will see amazing things.'",
        "'speaker_6': 'I was blown away by the play at the Warren Prescott. I was at the Elliott this morning. I was at East Boston High last week. Go to any school at any moment and you will see amazing things happening.'",
        "'speaker_6': 'That is true. But something has to change. And I don't know what the answer is. Is it received Seaver ship or not? But it absolutely has to change. We can't just keep throwing money at a system that is not showing up for our children.'",
        "'speaker_6': 'So I believe we need to stand together. And just fight for our children.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_1': 'Thank you, Councilman Murphy. The chair recognizes Councilor Bach. Councilor Bach, you have the floor.'",
        "'speaker_8': 'Thank you so much, Mr. President. And similarly to Councilor Laura. I wasn't going to speak today, but I just. I wanted to state my support for the resolution. I think that the it is true that we are facing deep challenges and BP's.'",
        "'speaker_8': 'But the problem is, is that every one of them are things that take deep collaborative partnership work. I mean, when you talk about literacy, like we we have to do like deep literacy curriculum roll out across the district.'",
        "'speaker_8': 'Like that's something that like it it takes kind of that like line level time. It isn't something that gets better by people's like pounding their fists on the table. And it's I can't see it getting better through the sort of state city theatrics and the same thing, you know, when you think about rolling out pre-K, when you'",
        "'speaker_8': 'think about reforming special ed, like I think the thing this district needs is an empowered superintendent who is backed by both the mayor and the council to do things that take time, that take longer than one news cycle to actually really dig in.'",
        "'speaker_8': 'And I think that a path towards receivership is a path into further news cycle governing of the VP's system. And I can't see that. As a as an educator on the on the college side, when I think about what makes good curriculum, when I think about like what really changes, like students experience, I just I can't see'",
        "'speaker_8': 'it coming through state receivership. And as a number of colleagues have said, there's pretty strong evidence that state receivership is not delivering those results for any school district. So I do think, like I value colleagues point that like there's a lot of places that where we have to say as a body where BP has been is now'",
        "'speaker_8': 'is not acceptable. Um, but I think when I think about the kind of like slow and complicated and really committed work that we need to be doing, it's work that we need to be doing as a city with partners.'",
        "'speaker_8': 'And I think that the state can bring resources to the table and private entities can bring resources to the table. Everybody can throw in orange, but but that doesn't require something like receivership. So I just I really feel strongly that this is something where we need a great superintendent and the mayor and the council need to back'",
        "'speaker_8': 'them. And it is going to take leadership from everyone at the city. But I, I, I don't think desy has the capacity to help through a receivership lens, and I think that it would set us back considerably. And I agree.'",
        "'speaker_8': 'I think it was council, but it might have been councilor me here who said that in a lot of ways the fact that what we're fighting about is receivership today is a distraction from a lot of the core issues that we need to be focused on.'",
        "'speaker_8': 'So I just wanted to say, please add my name and I'll be supporting the resolution.'",
        "'speaker_1': 'Thank you, counsel. But the chair recognizes. Counsel I'm here. Counselor me here. You have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. And I really do appreciate all of my colleagues who rose up to speak in regards to this issue. I'll just say that I was appointed by DC to be on their accountability task force. And while I was there, I was there to serve the parent voice.'",
        "'speaker_7': 'And I was one of very few people of color in that space. And the way that Jesse normally measures accountability is by giving themselves a pass in terms of the things that they were supposed to rise up and do.'",
        "'speaker_7': 'So I really do appreciate counsel, a lot of calling that out because I saw it for myself firsthand as someone who was appointed to one of their committees. I also think that it's really important for us to acknowledge that as a council we are also held responsible.'",
        "'speaker_7': 'We approve the Boston Public Schools budget every year so we can talk about accountability without seeing the role that we have played. And particularly my council colleague Clarity, who's not here to hear this, but I'm sure he'll watch the tape and rewind.'",
        "'speaker_7': 'But he's been on this council for 20 years. And year after year we keep having the same conversation and not much changes. And so if we're really serious about leaning into this work, we also need to call ourselves into this process and recognize that in many ways, the council has failed.'",
        "'speaker_7': 'Boston Public Schools as well. And so this is a call for us to recognize the role that we have played or not in this process. And while I do appreciate my colleagues, you know, comments around the children, I'm a Boston public school graduate and a Boston public school parent who worked in the Boston public school space.'",
        "'speaker_7': 'And so for me, this is really about an opportunity for us to finally do right by the parents and the students and the educators and bring in someone else from the outside, especially in Boston as well. We're so worried about outsiders.'",
        "'speaker_7': 'If we're really worried about outsiders, that's what we're doing right now, is allowing outsiders to come into our city and telling us how we should be. So in the interest of protecting our Boston public schools, I am going to ask my colleagues to vote in favor of this resolution and look forward to continuing the work and holding'",
        "'speaker_7': 'all of ourselves accountable to ensure that accountability is 3060 and that includes us. Thank you.'",
        "'speaker_1': 'Would anyone else like to speak on this matter? Would anyone else like to have their names? Mr. Clarke. Please add. Councilor. Councilor Braden. Councilor Carter. Councilor Fernandez Anderson. Councilor Alvaro. Councilor Murphy, please. Out the chair. Council on the Council of Rail Consultation.'",
        "'speaker_1': 'Seek suspension of the rules and adoption of 0643. All those in favor say I oppose any.'",
        "'speaker_7': 'Doubt the vote.'",
        "'speaker_1': 'Mr. Clark, could you please call a vote for a vote?'",
        "'speaker_3': 'Roll call vote on docket number 0643 Council or Oil Gas Council or U.S. Council of Baker.'",
        "'speaker_1': 'Nay.'",
        "'speaker_3': 'Council a Baker and No Council The Bar Council of Gas Council. Breedon Council. Breedon years council a Coletta Council letter yes. Council for an end to end? Yes. Council for an end to sense and yes. Council 30. Council of Flint yes.'",
        "'speaker_3': 'Council of Flint. Yes. Council Borough Council LRA Yes Council Louisiana yes. Council Louisiana yes. Council let me here yes. Council A me here. Yes. Council a murphy. Council a murphy. Yes.'",
        "'speaker_1': 'Resolution. Thank you, Mr. Clarke. The resolution. The resolution has passed. Um, Mr. Clarke, we're going on to talk at 0644.'"
    ],
    "Recognition of African American Military Veterans and Heritage Day.": [
        "'speaker_1': 'Please read Target 0645.'",
        "'speaker_4': 'Don't you love me? You really love me.'",
        "'speaker_3': 'Doug Number 0645 Councilor Murphy offer the following resolution recognizing the contributions of African-American military veterans and recognize African-American military Heritage Month.'",
        "'speaker_1': 'Thank you, Mr. Clarke. The chair recognizes. Counsel Murphy. Counsel Murphy, you have the floor.'",
        "'speaker_6': 'Thank you. I'd like to suspend the rules and add Counselor Anderson and President Flynn, please.'",
        "'speaker_1': 'Seeing no objection. Council Fernandez Enerson in the chair also ordered. Thank you, Counselor Murphy.'",
        "'speaker_6': 'So thank you. So I want to thank Commissioner Santiago from Boston Veterans Services and Mr. Finnell, who are here in the audience. And thank you, Mr. Finnell, for your sacrifice and commitment and service during the Vietnam War and in Okinawa.'",
        "'speaker_6': 'And thank you also for your continued community service in your educational endeavors as a poet and founder of the Oscar Micheaux Family Theater program. So thank you for that. And I stand to offer this resolution today to recognize Saturday, May 21st, 2022, as African-American Military Heritage Day.'",
        "'speaker_6': 'Each year at the General Edward O. Gordon Veterans Memorial Park, the Organization of Afro-American Veterans and other military veteran organizations gather to memorialize the history and contributions of African-American military veterans. Here they honor African-American military and civil service by conversating with one another and sharing their experiences.'",
        "'speaker_6': 'In general, 43% of the 1.3 million men and women on active duty in the United States military are people of color. Yet only two of the 41 most senior commanders in the military are black. Most, more specifically, in 2020, black soldiers compromised approximately 21% of active duty army, 15% of the Army National Guard, and 21% of the'",
        "'speaker_6': 'Army Reserve. It should be noted that black Americans serve in the Army at a higher rate than their representation rate in the U.S. population, which is 13.4. So the purpose of annually celebrating African military Heritage Day in Boston is to recognize and commemorate the service of African American veterans in every war.'",
        "'speaker_6': 'The history will not be forgotten, and I'm happy to say that Veterans Memorial Park in Roxbury plays a part in this commemoration. With that said, Boston will continue to support the United States African-American military and veterans to show that our city strongly embraces diversity, to create a system that maximizes individual talents and increases morale regardless of race'",
        "'speaker_6': ', color or gender. So in short, I ask that my colleagues on the Boston Council pass this resolution to acknowledge Saturday, May 21st, 2022, as African American Military Heritage Day. Thank you.'",
        "'speaker_1': 'Thank you. Thank you. Councilor Murphy, the chair recognizes Councilor Fernandez Anderson. Counsel Fernandez Anderson. You have the floor.'",
        "'speaker_4': 'Thank you. Councilor Flynn. Council President Flynn. Thank you, Councilor Murphy, for offering this resolution to recognize the African-American military veterans who have served in the U.S. armed forces throughout this nation's history. They have served despite often being the victims of blatant racism and discrimination.'",
        "'speaker_4': 'During civil war, they fought to help free their enslaved brethren and themselves during World War II, and they served bravely only to come back to this country to be lynched and beaten, often in uniform immediately after the war.'",
        "'speaker_4': 'During World War Two, they fought courageously to defeat fascism while continuing to be victimized by Jim Crow and legalized segregation at home. The army itself was not segregated until 1950, meaning that in all the wars I've described above, the black soldiers were in separate fighting units, often led by segregationist commanders.'",
        "'speaker_4': 'During the Vietnam War, while black people were rising up for their freedom in this country. Many others were drafted into or chose to serve in the army. They fought bravely, even if they weren't always in full agreement with the objectives or if their main goals was to come home in one piece.'",
        "'speaker_4': 'And so it goes. So the present day where black men and women continue to serve our country via their service in the military. One of them being my son. Luis Miguel. Let me just say, Luis Miguel, Freddy Rocha, who is a marine who I am extremely proud of, who?'",
        "'speaker_4': 'Induces anxiety every time I talk with him because he is so dear and dear to my heart, I'm extremely proud of him. This young man is so beautiful in and out. Not because I'm his mother, obviously, but I am so extremely proud of my son for making his own decision, for being someone who wants to serve his'",
        "'speaker_4': 'country. And I am just I can't say how how happy I am that he has taken his own path to serve our country and how much I love him for it. And I pray for his protection and guidance.'",
        "'speaker_4': 'Guidance always. Amen. So thanks again to my colleagues and for offering us a solution and I am gladly to the second. Thank you.'",
        "'speaker_1': 'Thank you. Councilor Fernandez Anderson. I would like to echo. The comments of Councilor Fernandez innocent and Councilor Murphy. Exceptional heroism of African-American men and women in their role. Is part of the US military. They fought bravely. They fought under very difficult conditions.'",
        "'speaker_1': 'They came back to the States and weren't treated with the respect and dignity that they've earned. I've had a good friend Will assigned, as well as Saunders, who's passed away. It's an older gentleman. He was a Tuskegee Airman, superintendent of the Boston Police.'",
        "'speaker_1': 'And I heard him tell stories about the incredible sacrifices and contributions of African-American men and women in the military to our country. So I just want to say thank you to my colleagues, but the entire body for for supporting African-American veterans.'",
        "'speaker_1': 'I'd also like to. Thank my friend who's the Commissioner of Veterans Services, Rob Santiago, for always being there in support of African-American veterans and making sure that they have the services and programs that they've earned. So thank you, Commissioner Santiago.'",
        "'speaker_1': 'Would anyone else like to speak on this matter, or would anyone else like the chair recognize this Council of Borough Council? Laura, you have the floor.'",
        "'speaker_7': 'Thank you. President Flynn. I just wanted to rise to extend my.'",
        "'speaker_4': 'Gratitude and thanks to the veterans that are here with us today. I think it's incredibly honorable to fight for your country when so many times we have failed to fight for them in the same way. I am excited to support this resolution in honor of black veterans, in honor of the Black Veteran War tax resisters, in honor'",
        "'speaker_4': 'of the Black Veteran Vietnam War veterans and the people, the black veterans who fought against the war here and abroad. And on behalf of my best friend, Kaleo Goodwin, who is a Navy veteran herself. So I wanted to say thank you to you have been very happy to support us with this resolution thinking.'",
        "'speaker_1': 'Thank you, counsel. Would anyone like to sign on? Please raise your hand. Mr. Kirklees Council. A Royal Council. The Bar Council. A Brighton Council. A Cardiff Council. A Lara Council Council me. Councilor Murphy, Councilor Fernandez. Innocent in Flynn.'",
        "'speaker_1': 'Six suspension of the rules and passage. An adoption of Typekit 0645. All those in favor say aye. Aye, all those opposed. Same day. The ayes have it. The docket has been adopted. We're actually files. I am informed by the court that there are there are two way file matters or that three three they found that a hearing'",
        "'speaker_1': 'order from counsel Bork a personnel order. Oh, yeah. You know, in a letter from Council World, let me go to the hearing order for council. Book council. You have the floor. We? Mr. Clarke, please read the documents that I can.'",
        "'speaker_1': 'Exactly. Oh, okay. So you should. Okay. So the late files should be on everyone's desk. We will take a vote to add these three into the agenda. As I mentioned, the hearing order from Councilor Bork, a personnel order in a letter from counsel counsel world.'",
        "'speaker_1': 'We will take a vote to add these items into the agenda. All those in favor of adding the late file matters into the agenda. Please say hi. The ayes have it. Thank you. The late file matters have been added to the agenda.'",
        "'speaker_1': 'Mr. Clerk, please read the first file, madam.'"
    ]
}