{
    "Proclamation for David Stewart's Service.": [
        "'speaker_6': ', you know, reassuring, talking it through. He called back in the morning. That commitment to safety goes above and beyond. A lot of times, I think the call of duty and we're sorry to see him retire and leave the city, but I'm sure that we are all much safer, safer with him being here and having his touch around'",
        "'speaker_6': ', making sure that workplace safety is a high priority.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Clark?'",
        "'speaker_2': 'Yeah. I just wanted to also chime in and say thank you so much for your service, especially when it comes to our park ranger program. This is just an incredible asset to our city. These park rangers are out in our beloved parks and doing really hard work with people who get angry with them.'",
        "'speaker_2': 'And I have seen personally so many times them just be calm in the face of yelling people and really help make sure that all of our parks are safe and enjoyable for everyone. I can't imagine our city and our park system without this Ranger program.'",
        "'speaker_2': 'And so I just wanted to add my. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Clark. Councilman Lopez.'",
        "'speaker_2': 'I also wanted to just chime in on the thank you's and congratulations. Thank you for the hard work. I actually am very thrilled you are here in the council chambers celebrating and the proclamation. And not because I had a six pack at Barnum Park not too long ago.'",
        "'speaker_2': 'I was like, God, I swear to God, we drank that all medium and put it in. I'm just kidding. It's keeping you on your toes, man. No, I. It's. The Park Ranger program is so important in our city, and you all help keep the peace in our parks, help keep them pristine, but also help educate people on'",
        "'speaker_2': 'what the rules are and and what we can and can't do to our parks. And also because our parks are so historic. However old or however new they are, there are places for everybody and there are places for community gather and you all are the faces.'",
        "'speaker_2': 'And you all served this city with such with such dignity and with such hard work and honor. And I think it's it's fitting and congratulations and thank you so much for your service.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_7': 'Mr. President, I'd like to have my name added. And I just wanted to say, do we have Happy Haines here in the audience? Happy served on this city council. And back then we used to have parks police. It was before we had Parks Rangers and, you know, a lot a lot changes in the city.'",
        "'speaker_7': 'But I think the fact that we do have park rangers is so important, especially, you know, not just in the city, but in our mountain parks as well. And not long ago, a number of us had an opportunity to go do a tour of our mountain parks.'",
        "'speaker_7': 'And the amount of land that we have in our mountain communities is pretty, pretty massive. And so to be able to cover all that ground and deal with some of the challenges and issues that come up, I think is is important.'",
        "'speaker_7': 'I know that involves a lot of interface with Jefferson County where most of that land is located. But I just wanted to say, David, thank you for your 19 plus years of service and really appreciate your dedication and commitment to the city and just wish you Godspeed in in your retirement.'",
        "'speaker_7': 'Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Ortega. Any other comments on 688? CNN Madam Secretary, roll call.'",
        "'speaker_4': 'Gilmore I. Cashman I can each. Lopez I knew Ortega I. Susman, I black I. Brooks, Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Espinosa, I. New. Mr. President.'",
        "'speaker_1': 'I. Madam Secretary, please, first of all, to announce the results. 1212 8688 has been adopted, Councilwoman Gilmore. Don't suppose there's somebody you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_6': 'Thank you, Mr. President. I would like to invite a Denver Parks and Rec leadership, along with Mr. David Stewart.'",
        "'speaker_2': 'So I just wanted to say a quick word. So, David. David has been huge for me. I mean, I've been in this job about four years, and I learned very quickly that when he's not the person you call, when something's going right, you call it when something is going wrong.'",
        "'speaker_2': 'And I'll tell you what. Not once did I ever call him, and he did not pick up his phone. He was always there for me, and he always gave me the sage advice. He kept he just kept things on the right track.'",
        "'speaker_2': 'And he made sure that I was doing making sure I was doing the things right and correctly, to make sure that we kept people out of trouble and we made sure that we were following protocol. As as Councilwoman Ortega mentioned, you know, we had an amazing mountain parks tour.'",
        "'speaker_2': 'And and on that great adventure, we had a little mishap on the way back to Denver on Sixth Avenue. And I'll tell you what, the first person I called was Dave Stewart. And I'll tell you what. Within 15 minutes, he was out there on Sixth Avenue helping us deal with that situation and taking care of business.'",
        "'speaker_2': 'So it is true. It is totally true. Dave created the park ranger program in 1999. He decided, we need a park ranger program. And it is true that when he started the program for at least the first month, he took his bike and he strapped it to the front of RTD bus and went around to Parks and'",
        "'speaker_2': 'and basically was our first park ranger. So I want our park rangers to stand up. I just want you to know, if it wasn't for Dave, we would not have a park ranger program. We probably have around 30 park rangers in the city of Denver right now.'",
        "'speaker_2': 'And to think that he was he did this and he envisioned this is pretty amazing. So I want to actually acknowledged Janet, his friend that's here. And thank you for coming. And all of our park staff has come to definitely recognize David because he's been a huge part of our department.'",
        "'speaker_2': 'So I do want Bob Tall to come up and say a few words.'",
        "'speaker_10': 'Good evening. I'm real proud to stand up here and to recognize Dave for his years of service. And I feel very honored to be part of the ceremony tonight to help congratulate him on all those years of service.'",
        "'speaker_10': 'A lot of things have been said already. They're all true, and I really appreciate all of council's support for the program and the kind words for Dave. They're well-deserved. Dave I don't know how to say it, but Dave exemplified and yes, he does answer his phone like Scott, no matter when you call.'",
        "'speaker_10': 'But Dave exemplified and promoted excellence in serving park visitors and protecting park resources and the finest park system in the nation. Denver His legacy of leadership and mentoring continues to inspire all of us and including myself and is very much appreciated.'",
        "'speaker_10': 'I feel fortunate to work the last three and a half plus years with Dave. So Dave, on behalf of the Denver Park Ranger program, congratulations on your retirement. And I'd like to present this little badge plaque for Dave.'",
        "'speaker_10': 'And let me just read it to you, maybe just a little bit of background. First, we always called Dave the godfather of the program because that's that's what he was. And so this badge plaque is presented to Dave Stewart, the godfather of Denver Rangers.'",
        "'speaker_10': 'Thanks for all the years of dedicated service. Denver Park Ranger Program 2015.'",
        "'speaker_3': 'Once again, I'm.'",
        "'speaker_9': 'Just window dressing. But I did say to what I said to Davis, Is it something that I said.'",
        "'speaker_11': 'Dave?'",
        "'speaker_2': 'Well, thank you. This is truly an honor.'",
        "'speaker_1': 'And I really appreciate.'",
        "'speaker_2': 'The.'",
        "'speaker_1': 'Opportunity to serve the citizens of Denver and Denver City Council. The mayor's office and.'",
        "'speaker_0': 'I have.'",
        "'speaker_2': 'Started out with the city attorney's office.'",
        "'speaker_0': 'For my first seven years and moved.'",
        "'speaker_2': 'To the finance office and then finished my last six years.'",
        "'speaker_0': 'With the Parks Recreation Department.'",
        "'speaker_2': 'So it's truly an honor and thank you very much.'",
        "'speaker_0': 'And good luck with the new appointment.'",
        "'speaker_1': 'All right. Thank you, Councilwoman Gilmore, for that. We are moving on to Proclamation 689. Councilman Cashman, would you please read Proclamation 689?'",
        "'speaker_0': 'Thank you, Mr. President. Let's see. Proclamation 689 celebrating October as spell binders aural stirrer storytelling month. Whereas in 1998, Spell Binders was founded in Denver, Colorado, bought by Jermain Deitch, who wanted to build intergenerational communities between children and older adults.'",
        "'speaker_0': 'And in 1997, Spell Binders became a Colorado nonprofit corporation with the goal of establishing storytelling chapters across the country. And. Whereas, Spell Binders oral storytellers have shared the art and joy of oral storytelling with 65,000 Colorado students each year.'",
        "'speaker_0': 'And. Whereas, Spell Binders is dedicated to restoring the art of oral storytelling to connect seniors to youth, weaving together the wisdom of diverse cultures throughout time and. Whereas, Spell Binders oral storytellers are volunteers who embrace the power of stories, keeping children spellbound with literature.'",
        "'speaker_0': 'Today there are 18 chapters in six states and in Canada. And. Whereas, Spell Binders oral storytellers are committed to enhancing literacy, encouraging character development, providing humor, building resources of wisdom, and sharing a love for the written word. And.'"
    ],
    "Proclamation for Spellbinders Oral Storytelling Month.": [
        "'speaker_0': 'Whereas, storytellers gathered at Denver Union Station on October 2nd, 2015 at 4:25 p.m. through October 3rd, 2015 at 5:25 p.m. to set the world record of 25 hours of storytelling. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council proclaims the month of October 2015 as'",
        "'speaker_0': 'spell binders oral storytelling month and Section two that the Clerk of the city and County of Denver shall attest. And a fix the seal of the city and county of Denver to this proclamation and that copies be transmitted to Catherine Johnson, Executive Director Spell Binders Ray Moore and Brenda Vasquez.'",
        "'speaker_1': 'Thank you. Councilman Carson, your motion to adopt.'",
        "'speaker_0': 'Yes, thank you, Mr. President. I move that proclamation 689 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Cashman.'",
        "'speaker_0': 'Thank you. This body promotes sometimes that we think deep thoughts about important issues. I love stories and I've always loved stories. Since I was a little boy. I have distinct memories of sitting on the floor in first grade while Mrs. Slattery read stories to us a few days a week.'",
        "'speaker_0': 'I remember how excited I would be knowing that on a specific day there would be more tales of our Founding Fathers, the Wild West, or some mythical character that came from the recesses of her mind that opened mind to all manner of imaginative creation.'",
        "'speaker_0': 'I also remember how excited I was when I found out about this place called the library that had so many, many stories on its written pages. And how those stories freed me to the exploration of all manner of brave new worlds that spoke of what was, what is and what might be.'",
        "'speaker_0': 'The first book I remember reading was The Autumn Autobiography of Abraham Lincoln. The last book I read recently was A Man's Search for Meaning. Both of those were fascinating and rewarding, but none were quite as exciting as as the stories that Mrs. Mrs. Slattery had to offer, because she was the one who first allowed my imagination to'",
        "'speaker_0': 'take flight. And that is what storytellers do. They pry open our minds and expand our willingness to hear hear tales different than what we might have heard before. For thousands of years, human beings have passed on history through the oral tradition.'",
        "'speaker_0': 'I spent this past weekend with old friends celebrating the 50th reunion of my graduation from high school, and it was four days of storytelling at its finest. But as time is not always conducive to accurate recollection, as one of us remembered facts a bit different than the other.'",
        "'speaker_0': 'Another would add a correction. The actual. Truth of the narrative was refined and the history was made right for us all to carry forth to our family and friends. So I dug up a few quotes that I liked about storytelling from author Philip Pullman after Nourishment, Shelter and Companionship.'",
        "'speaker_0': 'Stories are the things we need most in the world. Brandon Sanderson, from the Way of Kings, said The purpose of a storyteller is not to tell you how to think, but to give you questions to think upon. And Rudyard Kipling If history were taught in the form of stories, it would never be forgotten.'",
        "'speaker_0': 'And my personal favorite from Dr. Seuss. You have brains in your head. You have feet in your shoes. You can steer yourself any direction you choose. So while while tonight, I am pleased to honor the spell binders for your 25 year commitment to our community and for bringing the miracle of story to so many, many young minds'",
        "'speaker_0': '. I want to take this moment of privilege to thank all the storytellers, friends, family, authors, filmmakers, musicians, and Mrs. Slattery for sharing with me your wonderful gifts. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Any other comments? 689. Seen. Madam Secretary, Roll Call Cashman.'",
        "'speaker_4': 'I can eat. Lopez. I knew Ortega. Sussman. Black eyes. Brooks Clark. All right. Espinosa. Hi, Gilmore.'",
        "'speaker_6': 'Hi.'",
        "'speaker_4': 'Ortega. Mr. President.'",
        "'speaker_1': 'I. Madam Secretary, please for the vote. Announce the results.'",
        "'speaker_4': '12.'",
        "'speaker_1': '12, 12. 689 has been adopted. Councilman Cashman, is there someone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_0': 'Yes, there is. Mr. President, I'd like to invite Ray Moore, and I believe some other representatives of spell binders are with him. Mr.. Mr. President, Council council members, thank you so much for for this proclamation tonight. We really appreciate it.'",
        "'speaker_0': 'And it, again, just really reinforces and validates what we volunteers are really committed to. That's sharing the oral storytelling tradition, telling kids stories about the star in the cottonwood, about the ghost with one black eye, with a with other kinds of stories, too, like Mrs. Slattery told you way back when.'",
        "'speaker_0': 'And what I want to say about spell binders is that, as you mention, or as the proclamation states, we have expanded 25 years ago, actually more than 25 years ago, we started in the Denver public schools. One woman had a vision of older.'",
        "'speaker_0': 'People telling stories to younger people, and it's as simple as that. And we achieved that result and then some. So I really, again, appreciate the recognition and we will obviously over the next month we have a lot of storytelling events planned.'",
        "'speaker_0': 'You should have in your hands our brochure. Inside, there's a calendar with all the storytelling events that are above and beyond all the school activities we engage in. Normally in the Denver Public Library, for any museum and other places around town that people can come experience stories.'",
        "'speaker_0': 'Stories that they may like. Like you say, have. Forgotten. And it's good to hear them again, because they remind us or they bring forth memories that help us fill in why these stories are so important. We have a number of people with us.'",
        "'speaker_0': 'I have a number of other my storytellers and Brenda Vasquez, who is the coordinator of our program for the Denver Public Schools. And just introduce them now. I'll have each one do that in turn.'",
        "'speaker_2': 'I'm Tom Hobbs, Denver resident and known as The Man in a Hat. And the kids go nuts. There's nothing more satisfying in walking away with your legs hurting from kids, hugging your legs.'",
        "'speaker_8': 'Okay.'",
        "'speaker_6': 'I'm Harriet Hoke, and I'm a storyteller. And some of you may remember that.'",
        "'speaker_4': 'For 32.'",
        "'speaker_6': 'Years, I was up here and telling you.'",
        "'speaker_4': 'Stories about.'",
        "'speaker_6': 'Planning and developing the city. Well, now.'",
        "'speaker_4': 'I do this for.'",
        "'speaker_6': 'Children and to help engage their imagination.'",
        "'speaker_4': 'In terms of what can.'",
        "'speaker_6': 'Be tomorrow. Hello. Thank you for this opportunity and thank you for honoring our wonderful storytelling volunteers. And just want to remind you that these incredible volunteers do not read books, but they tell stories. And that's there's a big difference there.'",
        "'speaker_6': 'We are the founding chapter of Spell Binders, and we have hundreds of volunteers donating thousands of hours in our Denver public school classrooms, telling to hundreds of classrooms and thousands of students. And they really do an incredible job of oral storytelling, which results in igniting the imagination of our children, creating an environment of excitement and a an'",
        "'speaker_6': 'excitement of reading. One of the things we hear often from our teachers is that after our our talented storytellers tell their stories in the classroom, there's a rush to get to the library to check out the same book.'",
        "'speaker_6': 'So it actually creates a love of reading. So as the manager of the Office of Volunteer Services at Denver Public Schools, I encourage all of you to consider being a storyteller yourself. We have a training. Anybody can be a storyteller if they have the heart and passion for it.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'And again, thank you for approving this proclamation. Paul, thank you for your work on this. And we are very grateful we were going to have a great month. We did set that world record over the weekend. And even though we were a little tired in the process, it was certainly a worthwhile effort.'",
        "'speaker_0': 'If you happen to catch the story on Channel nine or Channel Seven, maybe you can understand a little bit of this of this whole process, 25 hours of straight stories. And we've just started. Thank you. That.'",
        "'speaker_1': 'Thank you, Councilman Cashman, for bringing that forward. All right. We've got one more proclamation. 733. Councilwoman Kenney, will you please read proclamation 733?'",
        "'speaker_5': 'Yes, Mr. President. Proclamation 733. In celebration of Taiwan Friendship Day on October 10th, 2015. Whereas the Republic of China, Taiwan will be observing its 104th anniversary of its National Day on October 10th, 2015. And. Whereas, the Council of the City and County of Member becomes the Taiwan Economic and Cultural Office, welcomes the Taiwan Economic and Cultural Office'"
    ],
    "Grant Agreement with Colorado Health Foundation for Denver Healthy Corner Store Initiative.": [
        "'speaker_4': 'Airport 678 Resolution of voting post contract between City and County Derek Troutman and Shreve Cooperative or Concourse B BCA replacement at Denver National Airport for Governance Charter Review 658 Bill A Resolution for the Mayor's Reappointment to the Career Service Board 665 Resolution Approve the Mayor's reappointment appointment to the Denver Housing Authority Board.'",
        "'speaker_4': '666 A resolution approve any post special counsel agreement in City and County Division Allen and Currie, P.C. to provide legal services or conflict cases, overflow delegation, workers compensation, subrogation actions and other legal matters as needed. 667 A resolution approving the Mayor's reappointment at Denver Commission on Aging.'",
        "'speaker_4': 'Six From Infrastructure and Culture 664 Resolution Professional Service Agreement Ground Floor Media, Inc. for Professional Services for Adult Development and Implementation. Emerald Ash for Marketing Campaign from Safety and Well-Being 662 Resolution seven Oppose Site Use License Agreement between city and County Division Empowered for one on one's financial coaching.'",
        "'speaker_4': 'Two Denver residents at the Denver Human Services Castro Building, a Denver Human Service facility in the Montebello Building.'",
        "'speaker_1': 'Thank you, Madam Secretary. Now time for the bill for introduction. Let you please read the bill for introduction.'",
        "'speaker_4': 'From Business Development 668 Bill for an ordinance authorizing Director of Excise and licenses to issue retail marijuana store licenses to applicants without the requirement of a tax bond infrastructure and culture. 504 Bill for an ordinance proposed design services agreed between City and town different dig studio Inc. for Architecture and Engineering Design Service Package Sanchez Park 653 Bill'",
        "'speaker_4': 'for an ordinance approving and providing execution for intergovernmental agreement. Twin City Encounter State of Colorado Department of Transportation Concerning Traffic Signal System Improvement Program Denver two ZIP 2015 Signals Project in the funding therefor 669 A bill for an ordinance approving and providing an excuse to impose intergovernmental agreement on city and county.'",
        "'speaker_4': 'The State of Colorado Department of Transportation Concerning Traffic Improvement Program Denver Tip 2015 Signals Project and the Funding Therefor.'",
        "'speaker_1': 'Thank you, Madam Secretary. Councilmember, this is your last opportunity to call out any bills or resolutions starting at the top. Under the resolutions, no resolutions called out bills for introduction 668 called out by Councilwoman Each. And Bill's on final.'",
        "'speaker_1': 'Nobody was called out. So we got one 668 call out by Councilman Kennedy. Did we miss anything? Think we're good? Madam Secretary, first one's already teed up. Councilman Kenyatta, would you like for us to deal with this?'",
        "'speaker_5': 'Thank you, Mr. President. Just a question, please.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_5': 'Thank you. So this bill, 668 is a policy ordinance and I am part called it out because we typically have policy changes heard in committee so that there's a lot of transparency for the public. In this case, we have two weeks of budget hearings that kind of forced us to put some things on consent.'",
        "'speaker_5': 'And I just wanted to ask someone from the department to please explain what this bill does. Is it actually we previously required marijuana centers to pay a bond to the city upfront in order to do business so that if there were any violations, the city had a place to go to pay for any fines or penalties that'"
    ],
    "Surety Bond Requirement Removal for Marijuana Businesses.": [
        "'speaker_5': 'may be incurred, unpaid, unpaid fees, etc., where we are going to be removing that bond requirement. And I just wanted to ask the department if they could step forward and explain that just so that all of the public is very aware of this policy change.'",
        "'speaker_5': 'Thank you much for that. Thank you very much, Councilwoman, for the question. My name is Stacy Loucks. I'm the director of the Department of Excise and Licenses. And also with us today is our treasurer, Steve Arlington. And we're here to help address any concerns or questions you have about.'",
        "'speaker_6': 'This particular issue.'",
        "'speaker_5': 'This change that we're bringing forward to you tonight is a change in how we do licensing and not requiring surety bonds.'",
        "'speaker_6': 'This change is requested as surety.'",
        "'speaker_5': 'Bonds have become increasingly difficult, if not impossible to obtain, because surety bond companies are no longer serving their marijuana industry.'",
        "'speaker_6': 'Because of risk of exposure to federal lawsuits.'",
        "'speaker_5': 'This recent change in the bond industry is an obstacle for existing marijuana businesses to be able to renew their licenses, much less for new businesses to even be able to obtain the licenses. So in working with the Treasurer, we came up and have discussed our options and came up with the idea of just striking the requirement in'",
        "'speaker_5': 'the since 2009 and the six.'",
        "'speaker_6': 'Years of.'",
        "'speaker_5': 'Working with marijuana and requiring surety bonds, we've never drawn across the bond and Treasury feels the existing tools they have in place would be adequate to cover any sort of concerns in case people weren't paying their taxes. Thank you, Mr. President.'",
        "'speaker_5': 'So can I clarify, in the time we've been doing medical and retail marijuana has, have we ever had a situation where someone was, you know, owing the city money and we used a bond? My understanding is no, but if you wouldn't mind a call up, Steve Arlington.'",
        "'speaker_6': 'Just to provide that technical explanation.'",
        "'speaker_12': 'Good evening. I'm Steve. Only time the city treasurer. And to answer your question, no. In the six years of medical marijuana and almost two years of retail marijuana, we've never drawn upon a bond to collect any taxes owed by anybody in the industry.'",
        "'speaker_5': 'Great. Thank you very much. So just allowed to comment really briefly before we vote, which is to say that this to me is a very common sense adaptation to the limits that are at levels of government that go beyond Denver.'",
        "'speaker_5': 'I really am proud of our high standards that we have for the industry, whether it's, you know, age restrictions, our restrictions, the ways that we approach trying to make this a responsible business in our city are really important.'",
        "'speaker_5': 'But there are absolutely places where the federal government has authority and we are unable to maybe have the same high standard we might want because of the way that they have limited us. And I think that, you know, you could throw up your arms and, you know, be blind to those things or you could take a very'",
        "'speaker_5': 'practical approach and say, you know, do we have the protections in place? So I'm appreciative of us taking a very common sense approach to this and, you know, really acknowledging where we have some limits we continue to push.'",
        "'speaker_5': 'I know our federal lobbyists that Denver, you know, contributes to the to the to the national conversation, continue to try to encourage our national representatives to do banking reform so that we can have all kinds of protections for the industry and not having to operate in cash, etc..'",
        "'speaker_5': 'I hope we'll continue those efforts. But in the meantime, I'm appreciative that we're taking a common sense approach. So thank you to the department. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_7': 'First, I want to thank Councilwoman for calling this out. I do have a couple of questions. So, Steve, can you come forward and explain what those tools are that we do have in place that would ensure that if you know that we've got the right protections in the event that I think these are just for nonpayment.'",
        "'speaker_7': 'But I know that we recently had some news media coverage about some of the facilities where Denver Police Department caught some of them selling to underage youth. And, you know, that's a different area. But I think the overall protections for the citizens and the city is important.'",
        "'speaker_7': 'And so I'd like you to address what those tools are in place that provide those protections.'",
        "'speaker_12': 'Yes. Yes, I can. For the nonpayment of taxes. Currently, the Denver Revised Municipal Code provides that the city can seize and restrain any of the assets utilized by that business so that any of the equipment that they use we can seize it, destroying it, and auction it off for the collection of the back taxes.'",
        "'speaker_12': 'We can also take a court action against the business to obtain a judgment against them.'",
        "'speaker_7': 'Okay. I appreciate that. I think that helps clarify for anybody that's listening that although we may not be able to collect on a surety bond because as you indicated, it's very difficult for folks to obtain that we do have those tools in place to be able to ensure that the city is being made whole, if you will'",
        "'speaker_7': ', for any of these payments. That might not be me. So thank you.'",
        "'speaker_1': 'Thank you, Councilman Ortega. And the questions and comments on 68. All right. Since that was not called out, we are moving on and I believe we are ready for the block votes. All other bills for introduction are ordered published.'",
        "'speaker_1': 'Councilman Espinosa, will you please put the resolutions on the floor for adoption and a block?'",
        "'speaker_8': 'Thank you, Mr. President. I move that the following resolutions be adopted in a block. 609663670658665666667664662. And that's it.'",
        "'speaker_1': 'Got them all. It has been moved and seconded, seeing no comments. Madam Secretary, roll call.'",
        "'speaker_4': 'Lopez. I knew. Ortega. Sussman. Black. Brooks Clark. Espinosa. Gilmore. I Cashman. I can eat, Mr. President.'",
        "'speaker_1': 'All right. Councilwoman can each. Thank you, Madam Secretary, please, for the very nice results. 1212 hours resolutions have been adopted in the Bloc. Councilman Espinosa, will you please put the bills on final consideration on the floor for final passage and block?'",
        "'speaker_8': 'Thank you, Mr. President. I move that the following bills be placed upon final consideration and do pass in the bloc.'",
        "'speaker_1': '636 651 got on both. It has been moved and seconded, seeing no comments. Madam Secretary, Roll Call.'",
        "'speaker_4': 'Sussman. Black. Brooks. Clark. Espinosa. Gilmore. Cashman, I. Lopez. All right, new Ortega. Hi, Mr. President.'",
        "'speaker_1': 'I ask, please, because of anything else. The results. 12 eyes. 12 eyes. The two bills placed on final consideration do pass and block one pre announcement council will not sit as the Board of Equalization this evening as no timely written protest were received by the Manager of Public Works by September 17, 2015, from property owners within any'"
    ],
    "Purchase of Property at 5135 Race Court by the City and County of Denver.": [
        "'speaker_1': 'of the following local maintenance districts. 15th Street. 20th Street. Consolidated Larimer Street. Santa Fe Drive, C St Luke's Del Gainey Street East 13th Avenue South Downing Street Tennyson Street Number 2/44 Avenue and Elliott Street Golden Triangle West 32nd Avenue Broadway a South Broadway Streetscape, Arizona.'",
        "'speaker_1': 'The Iowa Wesley to Yale and Iowa to Wesley. And lastly, 10th and streetscape portions of 38th to 44th since there are no public hearings. And if there are no objections from members of council, we will not take a recess and seen no other business before this body.'",
        "'speaker_1': 'This meeting is adjourned.'",
        "'speaker_6': 'Denver eight TV's Your City, Your Source.'",
        "'speaker_0': 'Denver eight. On TV and online. To stay connected to your community, your city, your source.'"
    ]
}