{
    "Proclamation for the Denver St. Patricks Day Parade Committee.": [
        "'speaker_0': 'And we will Will we'll call you all on the next city that we go to. Thanks so much. All right. So, you know, other comments from members of council, we're going to move on to presentations and no presentations.'",
        "'speaker_0': 'There are no communication. There happens to be one proclamation. And this is a big proclamation. You heard the bagpipes earlier today. Saturday is a big day for Denver. And so I will be reading Proclamation 254 congratulating Denver, St Patrick's Day Parade.'",
        "'speaker_0': 'And let me put some green on because these folks are going to get upset at me. All right. Here we go. Okay. Committee on the occasion of the 56th Annual Parade and March 17, 2018. WHEREAS Denver. Has one of the largest cultural.'",
        "'speaker_0': 'It's weird to wear a hat and in this building. Denver has one of the largest cultural parades in the United States and the largest St Patrick's Day parade west of the Mississippi. A lot of folks did not know that, whereas this year's theme tribute to the Irish Heritage honors the 56th annual anniversary of the parade.'",
        "'speaker_0': 'Whereas Denver St Patrick's Day Parade exemplifies a peaceful celebration, along with a community of diverse citizens who gather together with a glance at the Celtic past and look to the future while enjoying Irish culture fanfare, pipe and drum bands, Irish step dancing and honoring all divisions of our military to delight over 300,000 spectators.'",
        "'speaker_0': 'Whereas, congratulations and thanks to all volunteers of the Denver St Patrick's Day Parade Committee, including many who have passed on but are still remembered for their endless hours and never ending commitment and makes this celebration possible. And. Whereas, we hope the Colorado Sun and the Maha Air lifts the spirits of all who march or attend the 56th'",
        "'speaker_0': 'Annual Parade. Saturday, March 17, 2018. There were actually be 9000 people marching in the parade Kimberley that 9000 who who hoped for warm wind at our backs. And we celebrate the Irish culture in the great state of Colorado.'",
        "'speaker_0': 'Now, therefore, viable claim by the Council of the City and County of Denver, Section one, that the Council there hereby congratulate the Denver St Patrick's Day Parade Committee. A volunteer organization. Volunteer organization can do all of this, this incredible on a well-organized, peaceful and spirited gathering at the 56th annual event in Section two that the clerk of'",
        "'speaker_0': 'the city and county of Denver shall attest, and a fix the seal of the city and county of Denver to this proclamation that the copy be transmitted to the Denver Saint Patrick's Day Parade Committee President Teresa. Miller Grano.'",
        "'speaker_0': 'I'm sorry. All right. I move the proclamation to 54, be adopted. It's been moved. And second, it. I do have some comments. This is. Since I've been representing city council. You know, my predecessor was Julie Monteiro, who got a chance to represent this for a lot of years, 12 years.'",
        "'speaker_0': 'Her predecessor was over there, Councilwoman Ortega. And this is always just an incredible, historic event. And what I like to say more than anything is that the folks who help organize this event. Ah, like everyone is Irish this day.'",
        "'speaker_0': 'It's like a welcome to the family and it no matter what you look like, where you come from, you are allowed to just celebrate and engage. And that is so important, especially today, especially today when we exclude so many people and events and things like that.'",
        "'speaker_0': 'This is one of the most inclusive events that we have in the city and county of Denver. And I'm always amazed how many people come. 300,000 people. 300,000 people will be here at this event. I know we've been talking about the Olympics and it brings 500,000 people, but.'",
        "'speaker_9': '300,000 people will be.'",
        "'speaker_0': 'Here on Saturday in my little district. And so I don't only want to thank the organizers, but I want to thank all the people involved. I know we have the police department that will, you know, be on guard and making sure everything is going well.'",
        "'speaker_0': 'There's never any big issues. It's always a peaceful event. And so we're really looking forward to it. But there are three people in my house who are specifically looking forward to it, and it's Kenya, Kenya and Makai, my kids, and they love dressing in all green and having a great day at this parade.'",
        "'speaker_0': 'So I want to let everyone know in the city and county of Denver to make sure you attend this. I hope my council members will be out here having a good time. And I want to wish congratulations to everybody who worked so hard on this event.'",
        "'speaker_0': 'Councilman Clark.'",
        "'speaker_5': 'Thank you, Mr. President. I didn't want you to think that I missed that subtle dig there about not being comfortable wearing a hat up here. Since some of us have become very accustomed to wearing hats, especially at the beginning of the college football season.'",
        "'speaker_5': 'That being said, my family, my kids at school just celebrated Cultural Night at their school. And so they were going through talking to me and their mother about where do you come from? What makes you who you are?'",
        "'speaker_5': 'And I am I am 100% mutt. But the biggest part of that puzzle is Irish. And so this has always been something that I've been very proud of. The only moment I ever had any pause from the moment I met my now wife and when I married her was when I realized that she is a thoroughbred and'",
        "'speaker_5': 'my kids would not. That wouldn't be the biggest thing for them, even though it was the biggest thing for me. But every year I get to show off that despite the fact that they didn't get the biggest piece Irish.'",
        "'speaker_5': 'We get the biggest celebration for the Irish thing. And I, I just want to say thank you to all of you because it is no small feat to put on an event like this. Every single year we get a little taste of that because we had a first time little tiny parade in my district for Halloween this'",
        "'speaker_5': 'year, and it was a lot of work. And it is nowhere it's not even in the same the same playing field. So thank you so much for doing this for all of us. Whether people are are mostly Irish or claim to be mostly Irish or a little bit Irish, are not any Irish and claim to be all'",
        "'speaker_5': 'Irish for one day of the year. It's a really important thing for us celebrating culture and heritage and having a lot of fun and having a signature event for our city. So thank you so much for everything that you do, and thank you for bringing this proclamation forward.'",
        "'speaker_0': 'Thank you. Councilman O Clarke. Okay. Uh, Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. Flynn is a long standing Irish name. O'Flynn means ruddy complexion. We show blood in the face quite easily. It's a family trait. And I've had the pleasure of visiting. Can I have water? Mr. President, I had the pleasure of visiting Ireland twice with.'",
        "'speaker_5': 'Once with my dad and my brothers and once with my children. And I'm told that it's time that I have to go back, because the Blarney Stone, which I've kissed twice, is running low on the gift of gab, and Flynn's are required to return periodically to recharge it.'",
        "'speaker_5': 'So I'm going to start planning a trip back there. My dad is Irish, but on my mom's side a 100% German. So together we gang up on the Brits. Right. But I want to thank the parade committee for all the hard work they've done.'",
        "'speaker_5': 'It's one of the first events that I took my children to 37 years ago when I moved to Denver to the St Patrick's Day parade. And we made it an annual event when they were growing up. And I know that it's hard work and I thank you for it.'",
        "'speaker_5': 'And I just want to leave you with a saying that was hanging on my dad's wall when we went back after he passed away earlier this year, we cleaned out his house and he had a wall hanging in the kitchen and it said, Bless your little Irish heart and every other Irish part.'",
        "'speaker_5': 'Thank you for all your work.'",
        "'speaker_0': 'Thank you. Thank you. Councilman Flynn, I thought you were going to break in the song there for a little bit.'",
        "'speaker_5': 'POGUE Mahone.'",
        "'speaker_2': 'I don't know what that means. Okay.'",
        "'speaker_0': 'It's been moved in. Second it. Madam Secretary, Roll Call Clerk Hi.'",
        "'speaker_3': 'Espinosa Flynn. Hi, Gilmore. Herndon. Hi. Cashman. Carnage. Lopez All right, new Ortega.'",
        "'speaker_7': 'I accept it's not going to show up. We're still rebooting my computer.'",
        "'speaker_3': 'Okay. Assessment. Mr. President.'",
        "'speaker_2': 'I.'",
        "'speaker_3': '12 vice.'",
        "'speaker_0': '12 eyes proclamation 254 has been adopted. All right. I. Who would like to come up here to speak? Madam President.'",
        "'speaker_7': 'Yes, thank you. Council President O Brookes. My name is Theresa milano, and that's fine. And I just want to point out that some of our board members are wearing a special outfit. Now, it's not as special as Councilman Clark's green shirt, but we are wearing the Irish Diaspora Kilt, which the Irish diaspora represents all of the people'",
        "'speaker_7': 'of Ireland, as well as all of its descendants around the world. And the kilt is the colors of Ireland, and the central stripes have the colors of the Irish flag. And so I want to introduce to you just a few of the board members that help to manage, guide and inspire 200 volunteers.'",
        "'speaker_7': 'First of all, Mr. Frank Halligan. Patty Richardson and more, as is bensky. And we also have with us Queen Coleen Jennifer Richards. Would you please stand? And one of her court members, Molly Warmington. So we would like on behalf of all O and J leisure, would you please stand?'",
        "'speaker_7': 'He's also wearing a traditional Irish kilt as well. And because our theme is a tribute to Irish heritage, we want to wear these outfits. You'll see us around town this week. We want to remember the people that came from Ireland and help build Colorado.'",
        "'speaker_7': 'They are statesmen. They are landowners, lawyers, builders. They are just incredible people. And yes, there's a few saloon owners. But we honor their contribution to the great state of Colorado. And we thank you from the bottom of our hearts for this proclamation.'",
        "'speaker_0': 'Thank you, Madam President.'",
        "'speaker_7': 'Saturday.'"
    ],
    "Grant Agreement for Ryan White Part A FY18 Program.": [
        "'speaker_0': 'No items have been caught out and under pending. No items have been caught out. Madam Secretary, please bring out Council Resolution 211. Councilwoman, can we put on floor?'",
        "'speaker_1': 'Yes, Mr. President, I move that council resolution 18 dash 0211 be adopted.'",
        "'speaker_0': 'All right. It has been moved. Need a second? It has been moved. And second, it comes from members of council. Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I am on the board of a nonprofit by the name of Del Norte that receives rain funds for the services that are provided. We are not a service provider. We provide housing. But because there are right and right funds that provide the services in some of the buildings that we hold, I will be'",
        "'speaker_7': 'abstaining from this vote tonight. And Kelly, just for your information, I'm voting as guest because they couldn't get me rebooted under my name for some reason.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Great. Looks like that is easy enough. No other comments from members of council. Madam Secretary Roque Ortega abstained.'",
        "'speaker_3': 'Sussman, I. Clark Espinosa, i Flynn I Gilmore i. Herndon, i cashman. I can each i. Lopez all right. New Mr. President.'",
        "'speaker_0': 'I. Plexiglass voting in the results.'",
        "'speaker_3': '12 zero nis one abstention. 11. I sorry. 11.'",
        "'speaker_7': 'So you showing me as a yes vote up there?'",
        "'speaker_0': 'Yeah. So we're going to do an abstention for Councilman Ortega. Gives us 11 eyes. One abstention. Resolution to 11 has been adopted. This concludes all the items have been called out. All of the items for introduction are ordered published, were now ready for the black vote.'",
        "'speaker_0': 'Some resolutions and bills on final consideration. Council members remember this is a consent or block vote. You'll need to vote, otherwise it's your last chance. Colorado on a separate vote gives one can each where you put the resolutions for adoption and the bills on final consideration for final passage on the floor.'",
        "'speaker_1': 'Yes, Mr. President, I move that resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a block for the following items. All series of 2018 unless noted otherwise. 180 9207204 213 168205209 216 115 183 188 193 139 179.'",
        "'speaker_0': 'All right, Madam Secretary, do you concur?'",
        "'speaker_3': 'Yes, Mr. President.'",
        "'speaker_0': 'Okay, it's been moved. I need a second. I'm Secretary Brokaw.'",
        "'speaker_3': 'Clark. Right. Espinosa. Flynn. Hi, Gilmore. I. Herndon. Cashman. I can eat. I. Lopez. All right. New Ortega. I assessment i. Mr. President.'",
        "'speaker_0': 'I. Please. Kosovo's announced results please. All very nice results. 1212 ays the resolutions have been adopted. The bills are in place for consideration and do pass. Tonight there will be a required public hearing council bill 2018 94 Changes to zoning classification of 3050 South Colorado Boulevard and require public hearing of Council Bill 2018 1 to 9, placing'",
        "'speaker_0': 'a moratorium on certain site development plans. Anyone wishing to speak on either matter must see the Council Secretary and receive a speaker's card to fill out. Toward the end of recess of council. Madam Secretary does not look like there is a large line up for these two bills.'"
    ],
    "Rezoning of 30-50 South Colorado Boulevard in Hilltop.": [
        "'speaker_0': 'Please refrain from profane and obscene speech. Direct your comments to council as a whole and refrain from individual or personal attacks. Councilwoman, can each where you please put Council Bill 94 on the floor.'",
        "'speaker_1': 'Yes, I move that council build 18 dash 0094 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right, it has. Give me a second. Yes, it has been moved and seconded. The public hearing for Council 94 is open. May we have the staff report? Teresa Lucero.'",
        "'speaker_7': 'Good evening.'",
        "'speaker_2': 'As well as a walk by.'",
        "'speaker_7': 'With community planning and development. This is a map amendment located at 3350 South Colorado Boulevard. The request is to rezone from urban edge single unit D to AP D. The PWD is based on the G RH three zone district.'",
        "'speaker_7': 'This property is located in Council District five in the Hilltop neighborhood. Property is about over. Just a little over an acre. 45,900 square feet. It is a vacant church. I think if this property might be familiar to a lot of people.'",
        "'speaker_7': 'Again, the request is to rezone from urban edge single unit to poverty g 17 in order to redevelop the property. So existing zoning surrounding on the north and east is ESU. D on the south is always a burns park to the West.'",
        "'speaker_7': 'RH three and Pudi in the Cherry Creek neighborhood. So again, the subject property is a vacant church to the north is a vacant property to the south. A city park. To the east. Single family residential. To the west.'",
        "'speaker_7': 'Single unit and multi-unit. Residential. And some commercial. This gives you an idea of the property and its location. The other thing that the property is subject to is a view plane from Cranmer Park, and that would allow buildings up to about 100 feet tall, which doesn't affect the property as with the proposed development redevelopment.'",
        "'speaker_7': 'So this gives you an idea of the building form and scale in the area lower density, single family homes to the east and across the boulevard, a commercial structure that's just one story tall. The park and the vacant property park to the south, a vacant property to the north, and the church itself, which is about two stories'",
        "'speaker_7': '. So, again, this is based on the grade three zoned district, and it is a multi-unit zoned district. That's a pretty much a low scale, low intensity zoned district and mainly residential. So as far as the public process, initial notification of a complete application went out in August of last year and we did have a planning board hearing'",
        "'speaker_7': 'on January 17th of this year where unanimously they recommended approval. And then we were at Ludie on January 30th where the committee recommended that we move on to the floor of council. So here we are for our public hearing and the proper notification has been made for this hearing.'",
        "'speaker_7': 'So the registered neighborhood organizations Cherry Creek, East Cranmer Park, Hilltop, Hilltop Heritage, Denver Association of Neighbors and I.N.S.. And we have a letter of support from the Cranmer Park Hilltop Organization and no other letters. So you know our criteria, so I won't read them.'",
        "'speaker_7': 'There are additional criteria when we are approving, approved. Those are consistency with the beauty, purpose and intent and consistency with the beauty district. Standards and criteria develop that the development is not feasible and enter any other zone district that the development establishes.'",
        "'speaker_7': 'Permitted use is compatible with adjacent properties and land uses and that the building forms are compatible. So the plans that apply our current plan 2000 Blueprint, Denver and the Boulevard Plan, which is a quite old plan, but it still applies.'",
        "'speaker_7': 'So plan 2000 staff believes that this conforms with and promoting infill development at sites where services and infrastructure are already in place, encouraging quality infill development consistent with the character of the surrounding neighborhood and where increased density and amenities can be can be accomplished, and identifying areas where increased density and new uses are desirable and can be'",
        "'speaker_7': 'accommodated and preserving and moderate modernizing our housing stock. So a blueprint. Denver The property is within an area of change. It is single family duplex, which is moderate density, primarily residential. The building forms allowed our single family duplex townhome and small apartments street classifications.'",
        "'speaker_7': 'Colorado Boulevard is a mixed use arterial and enhanced transit corridor to dale is a residential arterial bayard avenue and designated local. The Boulevard plan again is quite old. It was really written mostly for the commercial uses on Colorado Boulevard but does speak to development on the boulevard.'",
        "'speaker_7': 'They do talk about no wholesale increase in development but then later on speaks to specific sites might be okay for a development. So it somewhat contradicts itself and basically says it seeks to retain the diversity of the land uses on the corridor on in basing our PD on a standard zoned district, we believe that we are furthering'",
        "'speaker_7': 'the uniformity of district regulations by sticking with the standards that are consistent with our code, because we're using those code standards and varying just a few things in the PD, and that by implementing our plans and allowing reinvestment in a rundown site, we believe that we're furthering the public health, safety and welfare change or changing conditions.'",
        "'speaker_7': 'The property itself has been deteriorating for years. Properties on Colorado Boulevard don't address the Boulevard anymore. They turn their back on the boulevard. And we're seeing a lot of change in the Cherry Creek East Area. So staff believes that there are a lot of changed conditions in the area and that this is an appropriate justifying circumstance.'",
        "'speaker_7': 'And then we talked a little bit about the grade three being that moderately scaled. Standards that that are consistent with the and with the adjacent properties. So we believe that it is consistent with the both the context, sorry, the context and the adjacent single unit standards for height and density.'",
        "'speaker_7': 'So the additional criteria for PUDs that this site be unique and extraordinary. There is compromised access to this property because of the location on two major arterials and one substandard local street with a private alley in the back.'",
        "'speaker_7': 'It is very challenging to take access to this property and with the just location between a low density residential neighborhood and a very major arterial in the city, we think that is also a unique and extraordinary circumstance and the public benefit will be some of the things that we are writing into the property.'",
        "'speaker_7': 'No garden court building form. The entry feature requirement will apply to the only the structures in the on the street. And as long as those structures conform to the entry feature requirement, the rear structures will not have to apply.'",
        "'speaker_7': 'And it is, as I said before, are compatible in building form and scale. In the low intensity residential uses. There will be a restoration of the parkway with some landscaping and actual sidewalks that are suitable for people to walk on on Colorado Boulevard, which is kind of unheard of in this portion of Colorado Boulevard, and it does'",
        "'speaker_7': 'conform with our objectives and our plans. So we do think that this property is consistent with the standards and criteria with those changes precluding the garden court, allowing the entry feature requirement to be exempted from those buildings behind and allowing allowing multiple duplexes on the zone lot.'",
        "'speaker_7': 'Those are unique things to this property that are not available in other any other zoned district. And it is, as I said before, compatible in density and height with the adjacent properties. And so staff believes that the additional criteria are met as well.'",
        "'speaker_7': 'And with that, staff recommends approval.'",
        "'speaker_0': 'All right. Thank you, Miss Lucero. We have three speakers this evening. I'm going to call them to the front here. And please give us a little room for these speakers to sit down. Douglas macKinnon. Tom Hart. And Wendy Rehak.'",
        "'speaker_0': 'Please come to the front. Douglas macKinnon, you were first.'",
        "'speaker_5': 'Good evening, Councilman. Good evening, counsel. My name is Doug McKinnon. Address 730 17th Street, Suite 220 here in Denver, where we were last before this body, on this property. It was about 20 months ago to the day. So we left that evening with a very clear message from all of you.'",
        "'speaker_5': 'And that was to reach out to the neighborhood and see if we could find agreement. We worked first. We absorbed our our concept thought through what was appropriate in the neighborhood and then began an outreach process. And over the last 20 months, with significant involvement from many community volunteers, which which really should be respected, the the the'",
        "'speaker_5': 'effort that Hilltop has shown in committing to a dialog with us has not gone unnoticed. And from our partners and myself, we really feel like this is the way logical, reasonable new development can happen in challenging situations. So what we have tonight is a request for a new rezoning.'",
        "'speaker_5': 'That rezoning reflects the neighborhood agreement that we've reached. That neighborhood agreement has been committed in a covenant that runs with the land. That covenant runs in perpetuity. So as a good faith gesture on our side, we made an agreement with the neighborhood.'",
        "'speaker_5': 'And it's the neighborhood's request that we actually put those words in writing in a very meaningful way. We've done that in terms of a covenant on the property. The main points which both Tom and Wendy can speak to is an agreement on the total density on the site to no more than 22 units.'",
        "'speaker_5': 'We waive the garden court form, which was a troublesome shape for many people. So we've we've held two only duplex townhomes, rowhouses or single family homes. We have a concept plan that has 11 buildings. Each of them are duplexes.'",
        "'speaker_5': 'So 22 units in total. We've limited the heights on the property to no more than 35 feet, which is exactly the height that exists in existing zoning around the neighborhood. We have limited any access off Colorado Boulevard to provide for a safer environment, which would reduce sound transmission into the neighborhood.'",
        "'speaker_5': 'We've agreed on the private alley to expand and improve the private alley between the properties on arc on our Nicole to make sure that that works in perpetuity. So we have a project that we are very happy to begin to commence with your approval.'",
        "'speaker_5': 'I think the neighbors also feel satisfied and feel vindicated in their approach and input to us. And we look we request your approval tonight.'",
        "'speaker_0': 'Thank you, Mr. McKinnon. All right, Tom Hart, you're up.'",
        "'speaker_5': 'Good evening. My name is Tom Harkin live at 4530 Cedar Avenue. I am the zoning committee chair for the Park Hilltop Civic Association. And we're here. We were here almost two years ago and we opposed the rezoning. Since then, it's not mentioned.'",
        "'speaker_5': 'They came to us with a plan that we agree with. It provides for 11 duplex units and we've negotiated the covenants and we're here to support this rezoning.'",
        "'speaker_0': 'Thank you, Mr. Hart. Wendy Rehak.'",
        "'speaker_1': 'Hi, Wendy Rehak. I live at 666 Birch Street, and I am the president of the Cranmer Park Hilltop Civic Association here on behalf of the association to speak in support of the zoning, the rezoning application. Excuse me. After working with the property owner and neighbors near this proposed development and within the community, within the Association, we are'",
        "'speaker_1': 'supportive of revising the zoning based on the current concept submitted and an agreement to a set of points within the restrictive covenant negotiated between our association and the property owner. Developer. Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Rehak. All right. This concludes our speakers. Any questions from members of council? All right. Seeing no questions. This public hearing is now closed. 95 is closed. Comments by members of Council. Dr. Sussman.'",
        "'speaker_1': 'Um. Thank you very much, Mr. President. Thank you all for being here. Do.'",
        "'speaker_7': 'Your speaker's not on.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'For this. Just I just want to thank everybody that showed up tonight. I want to thank the developer for listening to the neighborhood, for going back to the neighborhood, for taking all the things in consideration. And I want to thank the neighborhood folks here who really worked hard on this to try to get something that everybody felt'",
        "'speaker_1': 'comfortable with. And I know it was not easy. 20 months, my goodness gracious. And thanks to Teresa for the work that she's done with both groups, sort of going back and forth. You'll recall that one of the reasons that I asked you all to not support this last time was because of the very strange character of this'",
        "'speaker_1': 'particular corner, the Bayard Street. That's not quite a street that leads Stale Street that comes screaming excuse me, screaming down to Colorado Boulevard. And the funny kind of turns there, the access on Ellsworth to the alley. It was a very kind of unsettling kind of arrangement.'",
        "'speaker_1': 'And I know we don't often do parties. And of course, when that one came through, I called up Theresa right away and go, What are we doing with the party? And certainly, as she explained, much of that, of the uniqueness of the property has to do with its access and its egress and ingress.'",
        "'speaker_1': 'And where where do you how do you position the buildings? And and so happy that they found that planning found a solution for that to a party that really, you know, after getting the egress and ingress established, it really mimics what the what's happening in the neighborhood behind it.'",
        "'speaker_1': 'Do you have the same kind of height? You have single family homes, not detached, but attached, and they're not slot homes. I know that I have council council friends who would be happy to hear that because they were making these decisions as that was going through.'",
        "'speaker_1': 'So I do want to thank everybody for your hard work and for your coming together and making such a good plan. That church was in and is in terrible shape. But it certainly is an example of lots of places in Denver that have churches on corners, on busy corners like this.'",
        "'speaker_1': 'And I know that blueprint Denver is addressing this situation. We recently found that there were about 60 churches in town that have or have been for sale or were sold. It's a it's a phenomenon of church attendance is declining.'",
        "'speaker_1': 'And so we do need to think about this, not just for this neighborhood, but for others. The fact that we are. Putting back sidewalks, even though it's a small space on Colorado Boulevard and that we have houses that will face Colorado Boulevard.'",
        "'speaker_1': 'I don't know if people know this, but Colorado Boulevard actually is a parkway that has setback requirements and all kinds of things like require detached sidewalks and tree lines. But as the years have gone by, the city has sort of let folks take back the right away and put fences, very high fences.'",
        "'speaker_1': 'I don't know how we're going to be able to fix that, too. So would you look into how we can fix it so that we can begin to have some sort of walkable street? I mean, when they say enhanced transit corridor, I need to ask you what's enhanced about it?'",
        "'speaker_1': 'Colorado Boulevard is our if you live it around where I live, we don't go there kind of like Quebec. You don't, you know, don't go there. You try and find other ways around. So really, I'm pleased with the way this has turned out and I urge all my council members to please vote yes on this rezoning.'",
        "'speaker_0': 'Thank you, Dr. Sussman. Councilman Espinosa?'",
        "'speaker_6': 'Yeah, I. I actually chimed in. Too late for a question, because I. But I hope it didn't take the full 20 months to negotiate these terms, or it shows you how far off we were the last time it came for us.'",
        "'speaker_6': 'You know, I. I just the. The only thing I wanted to say is that these churches and hopefully Blueprint Denver goes there and hopefully count this council. I mean, I think we've done a good job thus far to sort of recognize and working with CPD that there are unique opportunities and sort of anomalies and wherever they sort'",
        "'speaker_6': 'of exist because they're usually under zoned for the scale of the, of the, of the structures that are there. But. But without rambling too much. This one is a situation where. You could, you know, the growth. Well, when we try to say the growth problems in Denver right now are in part due to sort of very generous'",
        "'speaker_6': 'zoning that we've done citywide and very generous base zoning. And part of the conversation with Blueprint Denver is to sort of say, okay, what do we how do we how do we support growth and change it, but do it in a sort of more thoughtful manner?'",
        "'speaker_6': 'And what sort of recommendations will come about from that that sort of take what we've done, which is a very good step in form based zoning and and and layer on to it other sorts of conditions and constraints and considerations as we go forward, when unfortunately for a long period of time we have done a lot of'",
        "'speaker_6': 'rezonings to that very base zoning that is of concern. And this represented one situation where it was it didn't comport with underlying plans on unit densities, which we don't address specifically, and conditions, physical conditions that need to be considered.'",
        "'speaker_6': 'And and yes, they can be considered in the development process, but they also it doesn't mean that every zoned district will by itself automatically address those considerations. And and it is important that we be able to recognize that in real time.'",
        "'speaker_6': 'I think all the things, Mr. McKinnon, that you brought up that are being addressed are important, crucial, fundamental pieces that we don't know what you're going to build. You have a lot of latitude even now. But it gets to the the the very important aspects that were missing that are important to address the full gamut of the'",
        "'speaker_6': 'criteria. And and so that's why I'm very comfortable moving forward, because you do address those things, not just because the community wants it, because I've got a lot of communities that want things and want considerations made in. But the zoning largely captures those things, but not every time and not in every situation.'",
        "'speaker_6': 'And and so thank you for for doing that. Thank you, CPD, for recognizing that we do have the tool and the mechanism where we can steer developers into that situation to address the uniqueness of a particular area. I know we love to have plan uniformity and in create you know just going map to condition mean districts that'",
        "'speaker_6': 'we already have but there are situations where there are plausible redevelopment schemes that aren't part of our base zoning that can be captured. But where our base zoning doesn't it doesn't necessarily capture all the conditions that need to be addressed.'",
        "'speaker_6': 'And that's where these ads and dpu ads and waivers and conditions really play an important role to sort of address those things to the degree they can. So I'm sorry it took so long to get here. Sorry that I rambled, but these are important things that I've articulated many times from this dais, particularly because I'm in an'",
        "'speaker_6': 'area that's largely been impacted by slot homes. And and that was you know, that wasn't a condition here. But there you know, it is important that we get back to this idea that, you know, communities and developers can collaborate and create really wonderful outcomes with just a little bit of conversation and capturing those ideas in a way'",
        "'speaker_6': 'that respect both ideas, because that's what we're trying to do when we're city building, is being mindful of what we've done and where we're going. And and there are a lot of solutions that there's a lot of capacity for compromise in there.'",
        "'speaker_6': 'And so thank you for structuring this enduring. And I'm looking forward to whatever comes about here. Thank you.'",
        "'speaker_0': 'All right. Seeing no other comments. Thank you, guys. For everyone's hard work community coming together. I do remember 20 months ago it was a very tense conversation, but it's beautiful when this kind of outcome comes together. So thank you for all involved.'",
        "'speaker_0': 'Congratulations, Madam Secretary.'",
        "'speaker_3': 'Raquel Sussman. Clark Espinosa. Flynn. AI Gilmore. Herndon. Cashman. Canete. Lopez. All right, new Ortega. Mr. President.'",
        "'speaker_0': 'I please close the voting results concerns.'",
        "'speaker_3': 'Making sure. 12 eyes.'"
    ],
    "Moratorium on Site Development Plans for Side-by-Side Dwelling Units.": [
        "'speaker_0': 'All right, 12 eyes. 94 has passed. Congratulations. Okay. Um, Councilwoman Kinch, will you please put 129 on the floor?'",
        "'speaker_1': 'Yes, Council President. I move that council bill 18 dash 0129 be placed upon final consideration and do pass.'",
        "'speaker_0': 'All right. It has been moved. And second it a public hearing for 1 to 9 is open. We have the staff report council.'",
        "'speaker_6': 'Do I have my presentation?'",
        "'speaker_0': 'Counseling. Counseling?'",
        "'speaker_6': 'Sorry. I'm looking for Amanda. Where is she? There she is. Sorry, guys. We'll get started here in a second. Yeah. Load up.'",
        "'speaker_0': 'You want to do an intro for us?'",
        "'speaker_6': 'This is the slot home moratorium. The Council bill 129. Am I just there? Oh, sorry. I know what I'm supposed to do.'",
        "'speaker_2': 'What?'",
        "'speaker_6': 'I was floundering. Okay, let me do this officially the.'",
        "'speaker_8': 'Way I see it.'",
        "'speaker_0': 'You don't have to do that. Council can do it that you can just. Yeah, you can go right into the bill.'",
        "'speaker_6': 'All right. I wanted to just go through the presentation. This is slightly abbreviated for some of you who have been part of Rudy committee. This is going to be a little bit redundant. So before I get started, I just want to acknowledge the importance of Councilman Wayne New, whose building form development is on your desk.'",
        "'speaker_6': 'Councilman, news efforts on the misuse of the garden court, much like what we were just talking about, resulted in the moratorium that we're about to consider coming forth, because his work and the collective actions of this Council have advanced the creation and work of the slot Home Task Force, which is a group of very capable individuals from'",
        "'speaker_6': 'all sort of walks of Denver that have tried to tackle the difficulty, difficult challenges that slot home to present. Anyway, the task force has made many recommendations that this Council will consider for adoption later this spring. But is the task force last recommendation that is before you tonight?'",
        "'speaker_6': 'That recommendation called for a faster end to the use of existing form standards used to create slot homes while a solution is advanced. The slot home moratorium is a means to an end in preparation for potential changes that the task force believes will greatly improve the detrimental aspects of side by side attached dwelling units.'",
        "'speaker_6': 'The purpose of the proposed bill is to place a moratorium on the approved the approval of site development plans, otherwise called steps for side by side attached dwelling unit projects. Formal SDP applications that are eligible for approval once the moratorium is active have until 4:30 p.m. on November 10th of 2018 to be approved using the existing zoning'",
        "'speaker_6': 'standards. The moratorium shall expire upon the adoption. Next slide, please. The moratorium shall expire upon the adoption of the slot Home Text Amendment or June 4th, 2018, whichever occurs earlier. As you know, slot homes are derivatives of many different building forms in Denver's form based zoning code.'",
        "'speaker_6': 'The forms that are used to create smart homes today include Row, House, Townhouse, Apartment General and Shop One Shopfront Building Form Standards. And fortunately, through a combination of previously adopted text amendments and the current garden court moratorium, the use of the duplex and garden court forms to achieve unintended developments have has already been ended.'",
        "'speaker_6': 'The proposed site Home Moratorium specifically addresses the remaining building form standards so you can go to the next slide. So highlighted in yellow are the remaining building form standards where projects characterize this lot of homes can be built.'",
        "'speaker_6': 'The building forms that the moratorium addresses specifically are the townhouse row house, apartment general and shopfront building forms. In part due to concerns expressed by this committee during its November or not. This Committee, the committee during its November slot, Home Task Force Braking Briefing.'",
        "'speaker_6': 'The task force in January reconsidered its implementation recommendations. The task force voted unanimously, unanimously to put forward the following recommendation. The task force chose to keep. And I apologize for the slide. Hopefully the task force chose to keep its prior recommendation that was presented at that ludi meeting for a November 10th approval deadline.'",
        "'speaker_6': 'Cognizant of the expressed desires to have both additional STP approval time and earlier in an earlier end to the creation of slot homes, the task force agreed to recommend a proposed earlier stop date to the acceptance of the steps at the time in mid-January.'",
        "'speaker_6': 'It was unclear how soon that could occur, but the intent was as soon as possible. Working with staff, we determined that the moratorium is the appropriate means to achieve the task force recommendation, and that is what's up for consideration tonight.'",
        "'speaker_6': 'So. So as of right now and as of the last week in January, early first week of February, CPD has and will review and provide comment based on the new on the proposed urban townhouse standards, which is going to be what's used going forward.'",
        "'speaker_6': 'If sorry. However, completed reviews will not be approved until the urban townhouse form is adopted, which is anticipated in May. The approach of allowing developers to begin reviewing under proposed standards is similar to what we had done for the for 38th in Blake when it was being proposed for the incentive and design overlays currently.'",
        "'speaker_6': 'So at some projects may be submitted right now and could have for the last month and a half using the new standards even though they're not able to be approved. So during this moratorium, the Slide Home Text Amendment will follow.'",
        "'speaker_6': 'The normal adoption sequence has shown in normal adoption sequence and schedule mean. Planned for a council hearing as soon as May 7th. It is that May 7th date that then establishes the the end of the. In the end date of November 10th of 2018.'",
        "'speaker_6': 'On when. Well, actually, you know that that establishes the end date of November 10th on when the approval process. I may have gotten that. Eligible projects mean. Sorry, I'm confused by my own language. The last day for. Uh.'",
        "'speaker_2': 'Scratch that.'",
        "'speaker_6': 'So. So I just. For those that are paying attention. I'm talking about two different things. So the slot home moratorium is effective as soon as it's executed upon to the council tonight and the slot home test text amendment which will result in that urban townhouse standard which you can submit and review under.'",
        "'speaker_6': 'Won't be available until council for actual approval. Until Council adopted in May.'",
        "'speaker_2': 'Things. Sorry.'",
        "'speaker_0': 'Okay. We have no speakers signed up for this, so I'm going to go into questions. Members of council, um, and actually councilman new do you want to chime in here as a kind of co-sponsor on this?'",
        "'speaker_8': 'Yeah, it was, it was a very collaborative process, really appreciate and at least the leadership in committees leadership on this and the attorneys recommending the moratorium for us for this two month until the new criteria is developed and finished and approved.'",
        "'speaker_8': 'So we're we were real pleased. It was it was like Councilman Espinosa said, we had a well-rounded committee and we went through a lot of discussion and it was a very collaborative process. And so it was very interesting to hear all the different perspectives and and through the real deals and after we came up with some actual'",
        "'speaker_8': 'criteria. So I really appreciate all the work that we did and I think we've got something very good in there will be coming forward in the next cycle. Planning Board should have CRC and Planning Board and so it'll coming up to Louie again and then the approval process coming in May.'",
        "'speaker_8': 'So we're looking forward to it. I think you'll be pleased when you see the new criteria. Thank you. Mr..'",
        "'speaker_0': 'All right. Thank you, Councilman. New members of Council. Question. And I'll just just start off off for the edification of folks who were not able to tune into the committee meeting and ask maybe and a Elise to come up to the podium real quick.'",
        "'speaker_0': 'And just Councilman, you just talked about the collaboration with CPD on on this effort. Obviously, this is an effort put forth, you know, by the councilman. Just want to make sure from Speedy's perspective, it was unanimous. I heard from my constituent, Maggie Miller, that it was unanimous to move this forward.'",
        "'speaker_0': 'But from Cbd's perspective, you all are supportive, etc..'",
        "'speaker_7': 'Yeah, and I spoke with Community Planning and Development, senior city planner leading this Home Tax Amendment and evaluation project. Historically, CBD has not taken a position on moratoriums, but we're willing to provide the technical support to ensure that the task force recommendation does move forward with support of the council members.'",
        "'speaker_0': 'Okay. So you're not opposing it?'",
        "'speaker_7': 'That is correct.'",
        "'speaker_0': 'All right. The other question is, you know, there's been a lot of question of who in the pipeline gets to get their project done. And so I know there are several individuals who are in the pipeline. So can you just explain that again?'",
        "'speaker_0': 'And I know Councilman talked about it just for a second, but if you can explain it, I'd be great.'",
        "'speaker_7': 'Absolutely. So what this moratorium aims to do is to allow for projects that were submitted prior to the 14th of this month to continue under the existing regulations. That is what is currently adopted under the Denver zoning code, which does allow for a slight outcome.'",
        "'speaker_7': 'And those projects will have until November ten to complete and gain approval under those existing regulations. So in that pipeline, there's approximately 30, maybe a little bit more projects we can expect to see be approved in that pipeline project.'",
        "'speaker_7': 'And kind of that was an important compromise that I think we heard in Ludy as well as from the task force, is that we stopped this as soon as possible. But people who have already made significant investment and invested into the formal process, it was important that they were allowed to continue forward.'",
        "'speaker_0': 'Okay. So these 30 projects that are in that formal step will not be a part of the new design standards and guidelines that will be coming through planning board. When will it become into the planning?'",
        "'speaker_7': 'Yeah. So they'll be going to planning board on May 21st and then becoming the City Council for full consideration on May 7th. They absolutely have the opportunity to adhere to the new standards, but they are not required to do so.'",
        "'speaker_0': 'Okay. Thank you. Very helpful. All right. Seeing no other questions by members of council. We're going to. No. Yep. We're going to close the public hearing 129 and go to comments by members of Council. Councilman Espinosa, you want to make a comment?'",
        "'speaker_6': 'Yeah, I just wanted to explain. Was flustered and I had to look at my own bill to understand it. So I got when the task force made its recommendation in November, we ended up circling around November 10th. That was based on six months from a, you know, projected adoption date.'",
        "'speaker_6': 'And I, I got confused myself that, yes, it is, in fact, hardcoded in this moratorium that these existing SDP approved steps have to be done by November 10th, even if council doesn't adopt the if even if the urban townhouse text, it means thought home text amendment, urban townhouse form gets at all delayed.'",
        "'speaker_6': 'So it's a bit of a detailed nuance, but it is hardcoded in this moratorium that the existing city approved steps have until. Um, formal steps not approved. Sorry. I should have looked at Annalise.'",
        "'speaker_0': 'I think we got it.'",
        "'speaker_2': 'She explained it.'",
        "'speaker_0': 'Is that it, Councilman?'",
        "'speaker_6': 'Yeah. I shouldn't play CPD planner on TV. Thanks. Oh, actually, but I do want to comment. I just on Elise's has been you know, she actually wasn't the the leader of the task force at the time it started, but took it over quickly thereafter and has run with it and just done an incredible job leading that group'",
        "'speaker_6': 'to two solutions and compromises. And we'll talk more about that. You know, as the as the Urban Townhouse Forum comes to council, but even on this thing, this was this was, you know, the conversation that council had at LUDI was an interesting one.'",
        "'speaker_6': 'And it presented some challenges that she led that discussion and navigated it so well that the developer, a developer from the development side, is the one that actually proposed this idea that we're of this early in date and it won unanimous support in the end, which I don't think was an outcome that anyone would have necessarily predicted'",
        "'speaker_6': 'when we entered the room. So it's been great. Thanks.'",
        "'speaker_0': 'Okay. Oh, Councilman. No, go.'",
        "'speaker_8': 'Ahead. One last thing. And it also we really emphasized to the developers with these 30 projects, if they could use the new criteria, we should really, really encourage them to do that is it's going to be an excellent improvement to that building form.'",
        "'speaker_8': 'And we just really want to just encourage them to use the new criteria. Thank you.'",
        "'speaker_0': 'Yep. Thank you. Seeing no other comments. Madam Secretary, Rocco Espinosa.'",
        "'speaker_3': 'Flynn are Gilmore. Herndon. Cashman Canete. Lopez. All right. New Ortega assessment. Hi. Clark. Hi, Mr. President.'",
        "'speaker_0': 'I please the voting announce the results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_0': '12 eyes. Proclamation 129 has passed. Congratulations, everyone.'"
    ]
}