{
    "Contract with MCE-DIA, LLC for Food and Beverage Concession at DEN.": [
        "'speaker_2': 'Thank you, Councilman Cashman. Councilman, new.'",
        "'speaker_8': 'Thank you, Mr. President. I was also concerned about the retention issue, the 82 or so employees who would be losing their jobs as these restaurants turned over. So we had a good conversation. I learned I was very impressed with the process they went through, and I was reassured that the number of vacancies they inherited is several hundred'",
        "'speaker_8': 'vacancies, and they feel very confident that they can fit these 82 employees into positions that day. So I felt very good about what they were going to do. They committed to me that they would actually make sure that those people had those opportunities for employment.'",
        "'speaker_8': 'So I feel very good about their commitment as well as the process, and I'll be supporting this tonight and I encourage my colleagues to do as well. Thank you.'",
        "'speaker_2': 'Thank you, Councilman. New Councilwoman Gilmore.'",
        "'speaker_3': 'Thank you, Mr. President. I just wanted to speak on this since Dan is in my district, in District 11 and working very closely with the airport personnel, understanding a little bit around the RFP process and how important it is that staff is involved, but that there's also an opportunity for content experts from different areas that that would'",
        "'speaker_3': 'inform the, you know, validity and the strength of an RFP and really knowing that that that panel worked very hard and that, you know, we're talking about millions of dollars on both sides. I understand folks not being totally happy.'",
        "'speaker_3': 'But then on the other side, knowing that there was a separate panel that evaluated these proposals and that the legal team at Dan made sure that they vetted them appropriately. My my only one. Recommendation would be that, you know, that there's some language on the RFP that really addresses what happens to these proposals, you know, going forward'",
        "'speaker_3': 'so that the folks that don't get the bid understand the parameters in which they're, you know, working on and that, you know, really kind of going outside of that process makes it much more difficult because we end up asking questions in committee that we weren't privy to the entire process and the whole behind the scenes.'",
        "'speaker_3': 'And so and there's no way for us necessarily to be part of that, nor should we, where our duties are not in contracting. And so understanding that from both sides. But I do want to congratulate all of the parties involved in making sure that those 82 employees have the opportunity for a new employment transition.'",
        "'speaker_3': 'Those stories rang very true with me, and I just have to commend folks on both sides doing the hard work to make sure that that happens for those employees, because at the end of the day, the employees at Dan make than what it really is.'",
        "'speaker_3': 'And so just wanted to congratulate you all on that. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Gilmore. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. I, too, had a little bit of reservation about some of the process. And I think part of it is, is indeed that. And I think councilman, councilman, Councilwoman Gilmore is is dead on when we talk about language, understanding the RFP process and making sure that that that's understood from the get go.'",
        "'speaker_7': 'I do share the the. Just the peace of mind and being able to sleep at night, knowing that those workers, those employees have retained their jobs. And the only thing they will change is the shirt, the uniform. Right.'",
        "'speaker_7': 'But they can go home knowing that they have a paycheck. They can go home knowing that they don't have to look for another cheaper place to live, which probably won't be in Denver. And unfortunately. But they can go home with that peace of mind and their families can do.'",
        "'speaker_7': 'They don't have to change schools. They don't have to pinch those pennies unnecessarily. They don't have to forego lunch at school or dinner at home. They can just go home. Hang their hat. Call it a night. Spend time with family and be back in the morning.'",
        "'speaker_7': 'And that's exactly what retention. Yes, it is much more than just the job and some position and some cost savings is in people's families. And I think the the workers organized through Local 23 have done that. And I'm very proud of our councilwoman and that district of of being steadfast and making sure that that that was a'",
        "'speaker_7': 'priority. We all were visited as well to and communicated with on council. And I'm very proud of this council, very proud of being part of a council that understands and an airport that does that as well, too. Now, do I like Cherry Creek?'",
        "'speaker_7': 'Absolutely. Is there an opportunity, I think, for us to expand? Is there a voice here, a collective voice saying that's, you know, we want to be able to understand what those parameters are. And then and that way everybody who applies, understands the role, understands that they're the apply terribly similarly.'",
        "'speaker_7': 'Absolutely. But I think this is definitely a victory for the workers. And DIA was one of those airports that there is none other like it in the country. So, yes. Did I have those reservations? Absolutely still do. But that victory right here, we have a lot of residents that are going to go home and still have a'",
        "'speaker_7': 'job at the end of the day. And I hope we look at expanding that, not just to concessionaires, not just to the janitors. We shouldn't have to debate this philosophy anymore in these chambers as it would be something that we just do as a common practice in the city.'",
        "'speaker_7': 'Out of respect. Thank you.'",
        "'speaker_2': 'Thank you. Councilman Lopez. Councilman Espinosa.'",
        "'speaker_0': 'Yeah. I just in light of the comments, I just wanted to stress to the airport, you have a lot of workers out there that are making sums that are, well, healthy, not as healthy as others. And so as we're expanding the development potential out there, I stress that you be part of the housing solution for your your'",
        "'speaker_0': 'workforce as you as you, as as these opportunities increase. And so sorry I'm going on on record here just wanted everybody involved district 11 DIA to to be part of the workforce housing solution closer to the airport and think.'",
        "'speaker_2': 'Thank you, Councilman Espinosa. Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. I just want to chime in, too, having been a part of writing a lot of RFP and having been also turned down by a lot of RFP. I understand that our fees are very technical documents using language and that they can sometimes be not completely understandable.'",
        "'speaker_5': 'But I have always had the greatest faith in Denver. DIA Denver Airport for the way in which they've conducted their business. The the carefulness with which they manage the airport, the the attention they paid and the restrictions they have with FAA guidelines.'",
        "'speaker_5': 'Sometimes we don't always understand those restrictions. And things may seem odd, but. And then that's the federal government. I know that the CIA leadership is as interested in helping local businesses as we are. We all have our favorite burger joints and ours, but also to meet FAA requirements and to respond to an international audience.'",
        "'speaker_5': 'I mean, not just we want the local businesses, but they also respond to an international audience. And how about that group that just got the USA Today award? It was a USA award for the best restaurants in the United States for airport.'",
        "'speaker_5': 'And congratulations. That was a great award that you got.'",
        "'speaker_2': 'Thank you, Councilwoman Sussman. Any other comments? 133. I will add as well, I am enthusiastically supportive of this. I have no reservations about it. You know, my first job out of the military was with United Airlines at DIA.'",
        "'speaker_2': 'And so I worked there for two years from oh 6 to 8 and how I wish there would have been a smashburger. Now, my waistline probably does not wish there was a been a smashburger, but to think about the transformation, the restaurant options we had ten years ago, which is really not that long ago to now, is'",
        "'speaker_2': 'truly remarkable. And that's a testament to the award that we just received. You know, there will always be people that don't win our fees. And so it's good, though, to have questions and scrutiny to make sure that we are have our eyes dotted and our T's crossed.'",
        "'speaker_2': 'But as I've gone through this entire process, I've never had any reservations about that. I'm excited about a new gourmet concept. Smashburger is something that we do. We lack at the airport, which people have been asking for as a top ten list for concessions.'",
        "'speaker_2': 'So I'm happy that we have an excited concessionaire to bring a new concept to it and is also excited about the workers. But that's a testament to the concessionaire that we selected because we have to realize they did not have to do that, but they realize how important that is.'",
        "'speaker_2': 'And they came to the table and say, we will do that. So I think it's important that we congratulate them for coming forward to have that conversation to ensure because they are new to the new to the DIN team as well as bringing in HDB.'",
        "'speaker_2': 'I believe Councilman Brooks said from the five point his hood as well. So this is a very exciting proposition and I think the Dentyne made a great choice and I look forward to seeing this and other successful concepts to come in the near future.'",
        "'speaker_2': 'So, you know, the comments were brilliant and. 133 Madam Secretary, roll call.'",
        "'speaker_5': 'ORTEGA Nope. SUSMAN Hi, Black Eye Brooks. CLARK Hi, Espinosa. FLYNN Hi. Gilmore I. Cashman can eat. LOPEZ All right, new. Mr. President.'",
        "'speaker_2': 'Madam Secretary, please cause a very nasty results.'",
        "'speaker_5': '12 eyes, one knee.'",
        "'speaker_2': 'Both eyes, one nay. 133 has been adopted. All right, next one 138. Councilwoman Ortega, I believe that was you. What would you like for us to do with this?'",
        "'speaker_3': 'I need to call this out to abstain.'",
        "'speaker_2': 'Absolutely. Yes. So we will first get it on the floor and then I'll I'll come right back at you for comments. Councilwoman Gilmore, would you please move to have 138 adopted?'",
        "'speaker_3': 'Thank you, Mr. President. I move that resolution 138 be adopted.'",
        "'speaker_2': 'Moved and seconded. Counsel comments. Councilwoman Ortega.'",
        "'speaker_3': 'Mr. President, I serve on the Board of Del Norte Neighborhood Development Corporation, and for that reason, I will be abstaining from this vote.'",
        "'speaker_2': 'Thank you. Move in second and any other comments? One 3839 Madam Secretary, roll call.'",
        "'speaker_5': 'Ortega Abstain. Sussman Black II Brooks, Clerk Espinosa. Flynn, I Gilmore. I Cashman. Canete. Lopez. I knew. Mr. President, I.'",
        "'speaker_2': 'Got it. Madam Secretary, please supposedly announce the results.'",
        "'speaker_5': '12. One abstention.'",
        "'speaker_2': 'One abstention. 138 has been adopted. All right. Those are all the resolutions. Next, we have the bills for introduction 134. I believe council members Ortega and Nu, either one of you want to call that out for a vote?'",
        "'speaker_3': 'Councilwoman Ortega I need it for a vote for a similar reason as the previous one.'",
        "'speaker_2': 'Got it. All right. And, Councilman Nu, did you have a comment? Do you have a vote as well?'",
        "'speaker_8': 'Just a comment.'",
        "'speaker_2': 'All right, Councilman Gilmore, it's day 134. Could you have one 3442 published?'",
        "'speaker_3': 'Thank you, Mr. President. I move that council bill 134 be ordered published.'",
        "'speaker_2': 'Moved in second and comments. Councilwoman Ortega.'",
        "'speaker_3': 'I just want to mention that. The full facts. Business Improvement District rents space from Del Norte. And it's not a buy, I guess just because they have city money, somehow city dollars are still involved. So I think it's important to just abstain.'",
        "'speaker_3': 'So there's not any perception of conflict of interest here.'",
        "'speaker_2': 'Councilman, do.'",
        "'speaker_8': 'You know, I just want to voice my pleasure at this new budget that they've adopted. It's really addressing the right issues on Colfax. We're looking at safety. We're talking about design for streetscape improvements for our businesses and pedestrians.'",
        "'speaker_8': 'And and it just fits very well with the big effort that we're having to try to address the economic development of Colfax Avenue. And I just really want to thank Frank like a Dora, as the executive director of the Colfax bid for his leadership.'",
        "'speaker_8': 'And I just appreciate all they've done and and really support this improved budget. Thank you, sir.'",
        "'speaker_2': 'Thank you. Councilman, do any of the comments on 134. See none, Madam Secretary. We'll call.'",
        "'speaker_5': 'Ortega Sussman. All right, Black. All right. Brooks Clark. All right, Espinosa. Flynn. Hi, Gilmore. I Cashman can reach Lopez. I knew, Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please cause a very nice results.'",
        "'speaker_5': '12 eyes, one abstention.'",
        "'speaker_2': 'Well, why is one abstention when 34 has been ordered published? Next Bill for Introduction 129 Council Menu. Would you like for us to do with this? Please go right ahead.'",
        "'speaker_8': 'This is a conversion of Tudor to the new Cherry Creek area zoning. And we we went through we went through the zoning process that you agreed north this property decided to stay is approved. It probably could have converted to the new zoning there and the new ownership of it now is going to take that there's requesting to'",
        "'speaker_8': 'move to the new church, rezoning the size of the project. The heights are all the same. There's wide community support for this. And the developer, Mayor Javin, is an excellent developer. He's developing several properties. The Halcyon Hotel is one of his properties in Cherry Creek North.'",
        "'speaker_8': 'And and this particular apartment building will be a little bit larger units and than what has been specified before. So just want to support this and I think it be a welcome addition to Cherry Creek North.'",
        "'speaker_2': 'Thank you, Councilman, you. All right. Those are all bills for introduction. We got one more bill and final one. Ten. Councilman Espinosa, would you like for us to do with this?'",
        "'speaker_0': 'I just wanted to comment. Go right ahead. So I just wanted to thank the artist, Emmanuel Martinez, for an incredible depiction of an incredible individual, Cesar Chavez. And I just wanted to say this anecdotal bit, that the bust is mounted at just the right height so that when you must lift up your head just enough to change'",
        "'speaker_0': 'your perspective, to view it. And I think that's significant. And but it's not so high that you think that Cesar Chavez was larger than life. And that's a good thing, because that strength of character is in all who choose to tap into it.'",
        "'speaker_0': 'And I think that's an important artist's move. So I'm glad that this bust is being accepted by the city and county of Denver because it's a great contribution, a great piece in Cesar Chavez Park in District one. Thank you.'",
        "'speaker_2': 'Thank you. Councilman Espinosa, Councilwoman Cannick.'",
        "'speaker_5': 'Thank you. Mr. President, I, too, want to just comment on this exception. This is the closest neighborhood park to my house, and my son and I are probably there two or three times a week in weather like we've had.'",
        "'speaker_5': 'And I think that we sometimes, you know, park meetings, you know, they feel very controversial at the time, but then the importance of the name tends to fade. And this is an example, though, where the artwork and the name of this park creates a conversation opportunity on a daily basis.'",
        "'speaker_5': 'And so almost every time we go, my son asks some question about Cesar Chavez and we talk about farmworkers and grapes and Latino immigrants and equality. And each time, you know, the older he gets, the more he can understand about the story.'",
        "'speaker_5': 'And so and I think that, you know, this kind of an artwork that creates both beauty, but memory of history and acknowledgment of social movement is particularly important in North Denver, which is changing. And so maybe not as many Latino families it is there used to be and trying to keep that history and make sure that we'"
    ],
    "Donation Agreement for Cesar Chavez Bust by Emanuel Martinez for Cesar Chavez Park.": [
        "'speaker_5': 'keep the integrated history going as we work to create more affordable housing solutions and preserve that diversity in the neighborhoods so we don't lose more of it. So so I just I, too, want to thank Councilman Espinosa for calling this out.'",
        "'speaker_5': 'And it is a beautiful piece of art. If folks haven't seen it, it's it's well worth it. And, you know, the celebration is coming up, usually held at the park in April and this March. March, I'm sorry, it's coming up in two weeks.'",
        "'speaker_5': 'So I don't know that we have details yet. I'm looking at Councilman Lopez. Usually the Cesar Chavez Peace and Justice Committee sends out an email, but we'll make sure we get the details for the celebration and forward it to folks.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. In each year the comments 110 seen. All right, we are moving on. And that was it. I believe we are now ready for the block votes. All of the bills for introduction are ordered published. Councilman Gillmor, would you please put the resolutions on the floor for adoption in the block?'",
        "'speaker_3': 'Thank you, Mr. President. I move that the following resolutions be adopted in the eight block 117 119 123 126 132 136.'",
        "'speaker_2': 'Kamala. Thank you. Has been moved and seconded, seeing no comments. Madam Secretary, roll call.'",
        "'speaker_5': 'SUSMAN All right. Black Eye. Brooks Clark.'",
        "'speaker_8': 'Eye.'",
        "'speaker_5': 'Espinosa Hi. Flynn Hi. Gilmore. I. Cashman Can eat. Lopez. Hi, new. Ortega. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please, first of all, announce the results. 3939 resolutions have been adopted in the BLOCK Council in Gilmore. Would you please put the bills on final consideration on the floor for final passage in the block?'",
        "'speaker_3': 'Thank you, Mr. President. I move that the following bills be placed upon final consideration and do pass in a block. 111 one 2118 110 112 113 121 and 122.'"
    ]
}