{
    "Proclamation for the University of Denver Men's Lacrosse Team.": [
        "'speaker_2': 'President. We do have one proclamation tonight. Proclamation 383 Sponsored by me, a proclamation honoring the 2015 University of Denver men's lacrosse team and winning the National Collegiate Athletic Associate Division one Lacrosse National Championship. Whereas the University of Denver Lacrosse started as a club sport in 1966, was adopted as a Division one varsity sport in 1999, and currently'",
        "'speaker_2': 'competes in the Big East as an associate member winning the 2015 Big East regular season. And. Whereas, The Denver Pioneers were the four seed overall in the 2015 lacrosse championship and beat storied opponents on their way to the championship, such as and to the championship game, such as Brown, Ohio State and Notre Dame.'",
        "'speaker_2': 'And. WHEREAS, Coach Bill Tierney came to the University of Denver in 2009 after success, coaching at Princeton is now the first Division one lacrosse coach to win national titles at two different universities for a record seven title. And.'",
        "'speaker_2': 'Whereas, The Denver Pioneer Lacrosse Team is one of the most geographically diverse in the nation, fielding players from 17 states and nations, including Ryan, the plant, Zach Miller, Trevor Baptiste, Mike Reis and Wesley Burge, who all made the 20 1592 a all-tournament team.'",
        "'speaker_2': 'And. Whereas, on May 25th, 2015, the Denver Pioneers beat the Maryland Terrapins 10 to 5 at Lincoln Financial Field in Philadelphia, Pennsylvania, to win their first Division one lacrosse championship and the first championship away from the East Coast, with Wesley Burg being named the tournament's most outstanding player.'",
        "'speaker_2': 'And. Whereas, the council specifically recognizes and congratulate the 2015 University of Denver Pioneer Lacrosse Team and their monuments as victory in the national championship. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council congratulated the Pioneer Lacrosse Team, the coaches and the entire University of Denver'",
        "'speaker_2': 'on their incredible 2015 lacrosse season and claiming the 2015 National Collegiate Athletic Association Division one Lacrosse Championship. Section two that the clerk of the city and county of Denver tested the Fix the seal of the city and county of Denver to this proclamation in a copy before it it to coach Bill Tierney at the University of Denver'",
        "'speaker_2': '. So my motion to adopt I move that proclamation. 383 is adopted. It has been moved and seconded and I will start with myself with comments. This is just this is pretty awesome. There's just no getting around it. I you know, I remember growing up in Missouri, Lacrosse was not even a sport they had in my high school'",
        "'speaker_2': '. And it's something that they always do on the East Coast because that's where the powerhouses are. And for the pioneers to take this victory in such a fashion is just truly remarkable. And I'm excited to have this proclamation, and I'm excited to have coach here, and I certainly hope my colleagues were support this proclamation.'",
        "'speaker_2': 'Councilwoman SUSSMAN.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_8': 'I also give you much congratulations to you is my alma mater for graduate school. So I have.'",
        "'speaker_1': 'A special feeling about the pioneers. But also I had a daughter who played lacrosse and she was a walk on at Johns Hopkins the first year they were Division one. They didn't know that they played lacrosse west of what, Pennsylvania.'",
        "'speaker_1': 'So thank you for putting us on the map in lacrosse. And I'm so excited for your win. It was great.'",
        "'speaker_2': 'Thank you, Councilwoman Sussman. Councilman Brooks.'",
        "'speaker_7': 'Thank you, Mr. President. Thank you for putting this proclamation forward. There's nothing like getting a national championship for the city of Denver and for our state. And I just want to congratulate the coach. I was hoping to see some players here because I wanted them to sing you guys your fight song.'",
        "'speaker_7': 'But that's okay. I'm I am I'm not an alumni. I'm actually a student there right now. And so I'm excited to be there. The campus has been hopping a little bit. And so congratulations. Thank you for putting Denver on the map.'",
        "'speaker_7': 'Our state and the university. You guys are doing a great job. Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Casper McKinney.'",
        "'speaker_1': 'Thank you very much. I wanted to thank you, council president, for bringing this forward. I was out of the country for a couple of weeks and the person who picked me up from the airport, I asked, you know, what happened in Denver because I didn't read the paper.'",
        "'speaker_1': 'I didn't check my email, sorry, constituents, but and they she thought for 1/2 and she said, well, the Duke lacrosse championship was the only news that she thought was worth reporting from to me. So I thought that was quite a testament to the impact that you made to the entire city.'",
        "'speaker_1': 'Right. People were really cheering you on with this victory and the amazing story of how you came to Denver and of your players. So I wanted to thank you for the dedication that you did to get you to the championship and the pride that you've brought to the whole city and especially to your team.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Kenney. Councilman Monteiro.'",
        "'speaker_5': 'Thank you, Mr. President. I also am an alumni of the University of. Enver So I wanted to welcome you to the chamber. And with all my heart. Big congratulations. Let's see what you do next year. No pressure.'",
        "'speaker_2': 'Thank you, Councilwoman Monteiro. And in the comments, proclamation 383. Seen none. Madam Secretary, roll call.'",
        "'speaker_9': 'Brown I.'",
        "'speaker_1': 'Forts I can each.'",
        "'speaker_6': 'Layman. Hi, Monteiro. Hi, Nevitt. Hi, Ortega. I Rob Fry. Shepherd. Hi, Susman. Hi, BROOKES. Hi, Mr. President, I.'",
        "'speaker_2': 'Councilwoman Kenney. Got it. Thank you, Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_6': '12 Eyes.'",
        "'speaker_2': '12 eyes. Proclamation 383 has been adopted. Is there someone I would like to invite to the podium? Absolutely, Coach. I'd like for you to come up in and receive this proclamation. Come on up, sir.'",
        "'speaker_0': 'Well, first of all, thank you. I do apologize for our students not being here, but it's a great reason. They're in final exams right now. And maybe we missed a little bit of school the last week or so being in Philadelphia.'",
        "'speaker_0': 'But I want to thank all of you. You know, the state, the city, the you it's great representing all of you. It was a quite an amazing run for our young men. But I think the most really exciting thing about it was how the the university and the city got behind this thing and haven't done this for'",
        "'speaker_0': '22 years at Princeton before coming out here to Denver. My only regret is I didn't do it earlier. So thank you so much. And it's a great honor to be have this proclamation and to be welcomed by you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'All right, we are on to the resolution. Madam Secretary, please read. Please read the resolutions.'",
        "'speaker_6': 'From infrastructure and culture to 94, a resolution laying out, opening and establishing as part of the city street system. A parcel of land is Lowell Boulevard at its intersection with West 52nd Avenue. From safety and well-being to 71, a resolution approving the mayor's appointment to the Crime Prevention and Control Commission.'"
    ],
    "Creation and Establishment of the RiNo Business Improvement District.": [
        "'speaker_5': 'And I want to commend his vision for that, because our hope had always been to have affordable housing and to be able to have a walkable community and for places that if they were in play downtown to be able to walk.'",
        "'speaker_5': 'So now everybody's going to be coming through Reno, including all the taxi cab drivers, through a very, very beautiful Brighton Boulevard in the surrounding area. So I'm supporting this. It's probably no surprise any of you and I would encourage my colleagues to do the same.'",
        "'speaker_5': 'Our next person is Jeannie Robb.'",
        "'speaker_8': 'Well, did you want to go to Councilman Brooks first? I would certainly yield.'",
        "'speaker_5': 'Oh, I am so sorry.'",
        "'speaker_7': 'That's okay.'",
        "'speaker_5': 'I.'",
        "'speaker_7': 'I didn't.'",
        "'speaker_5': 'I didn't accidentally erased your name. I'm just kidding.'",
        "'speaker_7': 'I didn't sign it. I didn't sign in because you gave me the brief.'",
        "'speaker_5': 'Compton Brooks. Thank you.'",
        "'speaker_7': 'Thank you, Madam President. I guess I just want to open was saying, you know, I'll be supporting this business improvement district. I have. I believe this is our ninth in the city. 11th in the city. While we're growing, we're getting.'",
        "'speaker_7': 'I'll be supporting this this bit because I've seen firsthand the the return on investment the city gets from from bids from Colfax to downtown and now here. It's really exciting. And to see what you guys are doing, I, I just have kind of two words of encouragement.'",
        "'speaker_7': 'It's around great work. It's a, you know. You know, encouraging you for what you've done and the growth of what the work that you have in front of you, which would be a lot. One, the great work is somebody mentioned it before.'",
        "'speaker_7': 'Nowhere in the city do we have business leaders and artists working together and on the same page and coming up with plans. And so this is incredibly it's it's hard to bring two folks of different economic statures together and come up with the plan.'",
        "'speaker_7': 'And so we I think the city has a lot to learn from you all in that, you know, the other piece is is you make ugly look really cool and and I can I can I can say this because I basically live in Reno.'",
        "'speaker_7': 'Technically, I live in the whole neighborhood. We are not rhino, we are coal, but we live right next to rhino. And it is just it's amazing. I was on a bike ride on Saturday and I came down and Rhino is a great, beautiful day and everyone was in Rhino at the breweries out and about.'",
        "'speaker_7': 'And I'm just like, is the streets everything that you all said about the streets not being complete, no sidewalks, nowhere to park, but people are everywhere. And so you guys have done a great job and making it desirable.'",
        "'speaker_7': 'So good work on that and and working together business owners, property owners coming together and getting an overwhelming support the growth. It's funny that you have keeping while rhino don't because that's going to be the growth that's going to be the hardest thing to do is to keep it affordable for individuals to keep it eclectic enough and'",
        "'speaker_7': 'cool for the generation you're currently serving. Because there's another thing cool the next time. And so I just want to push you to be thinking out of the box. And because we don't have anything like this in the city and to continue doing that and our our promise on this side is that we will allow rhino to'",
        "'speaker_7': 'be a canvas and try new things with the city. So we're we're excited. And I'm excited to support this hope the rest of our colleagues do. And I just want to thank Councilwoman Monteiro for her 12 years over this district and her investing in her working with all of these developers and leaders to and not many people'",
        "'speaker_7': 'get to see their investment come to fruition and and you're getting to see it. So it's pretty cool if.'",
        "'speaker_5': 'You see keep. Councilman Robb.'",
        "'speaker_8': 'Thank you, Madam President. The work that you've done is truly remarkable. In fact, even though I didn't attend the committee meeting, I was able to watch part of it and printed out the slide presentation and took it to the Cherry Creek Steering Committee last week to present.'",
        "'speaker_8': 'Because even though Cherry Creek was one of the first two bids in the city and county of Denver, the business community and the neighbors have great desires to do infrastructure improvements that lie outside of the bid boundaries. In this model for putting a guide and a bid together in the overlapping, it has some potential for the area'",
        "'speaker_8': '. Of course, people, like some people in the audience tonight were concerned, well, how will I know that my priorities are met? How do you set priorities? And I pointed out what a fast job you guys did. I said from October 2014 to May of 2015, I've never seen a bid and get it done so fast.'",
        "'speaker_8': 'It and I'm so glad to hear tonight that it's been a lot of years because I was thinking you were a real miracle workers in terms of accountability. I want to put my $0.02 in. So often when the bid operating plans come to council, they go through on consent.'",
        "'speaker_8': 'I think I can remember two or three times that they've been at committee. And I even though a bid is a really a creation of this of state of the state, I think we have a responsibility just on the transparency issues that were raised tonight, which, you know, are always a concern.'",
        "'speaker_8': 'Frankly, I think we have that responsibility to review them nine times out of ten. We won't have any comments. We won't have any changes that help. But it helps us know what we're ultimately accountable for in setting up these operating plans and budgets.'",
        "'speaker_8': 'Because even though the money doesn't run into the general fund, it is public money. So that would be my my wish for the next council is that people who have the bids in their district ask to have them present at committee periodically.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Councilman fights.'",
        "'speaker_10': 'Thank you, Madam President. Because of my concerns that I laid out earlier for financial structures, I want to be sure to address how I see this as entirely different. And I am very much in support of what has been presented here tonight.'",
        "'speaker_10': 'I had asked the question, what is the responsibility of the taxpayer? This is a 180 degrees on the other side of that. These are individuals who have joined together coming to us, not saying we want something from you, but saying let us tax ourselves so that we can make these improvements and so that we can at a'",
        "'speaker_10': 'later time. The second item is kind of make even enhanced public improvements. I mean, they are coming to us asking to take the responsibility of doing this for themselves. A fair amount of public money has gone into various aspects of rhino, which makes it even more pleasing to me to see people stepping forward and saying, we want'",
        "'speaker_10': 'to contribute as well. And we want to have control over that. So I'm just extremely proud of your doing that. Thank you so much. And you're setting a fine example.'",
        "'speaker_5': 'Councilman Ortega. I'll be brief. In 2003, when I left City Council, we had adopted Blueprint. Denver in this area was defined as one of the new growth areas for the city. And since that time, we have seen almost complete transformation.'",
        "'speaker_5': 'And I know there's still a lot yet to be done in terms of transforming. But to just see what has happened is is very exciting. And I know for those of you who are the boots on the ground, you're living it day in and day out.'",
        "'speaker_5': 'And it's it's fascinating to go down to the area, as Councilman Brooks said, and just see the vitality and the the amount of people. I think the challenge is how do we ensure that pedestrian bike safety is number one?'",
        "'speaker_5': 'Because you have the conflict of industrial vehicles from some of the existing industrial businesses in the area. You know, it's a straight shot without with very few lights, you know. So at least on Brighton corridor, I think you can say the same about Blake Street and what is it, Market Street that are one way corridors as well'",
        "'speaker_5': ', that oftentimes people just kind of fly down those streets, they drive them pretty often. And so I look forward to hearing about the progress at the at the end or, you know, at your after your annual meeting and when your your budget request comes before city council.'",
        "'speaker_5': 'But way to go. I mean, you guys have done an outstanding job and it's exciting to see the progress that continues to be made in this area. So, yes, I will be supporting this tonight as well. Councilman Ortega, other comments by members of council seen none.'",
        "'speaker_5': 'Madam Secretary, roll call, please on council bill 304.'",
        "'speaker_1': 'Brown.'",
        "'speaker_9': 'I.'",
        "'speaker_1': 'Fats Pi coinage.'",
        "'speaker_6': 'Layman hi Nevitt hi Ortega.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Rob I shepherd i. Susman I. Brooks, i. Madam President.'",
        "'speaker_5': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_1': 'Oh. Drum roll, please.'",
        "'speaker_5': 'What happened?'",
        "'speaker_6': 'We've got it.'",
        "'speaker_4': 'We're all.'",
        "'speaker_0': 'In good.'",
        "'speaker_1': 'Hands.'",
        "'speaker_5': '11 eyes is going too fast. Okay. That was a lot of pent up enthusiasm. David For the next one counter Bill, three of four has passed. Councilman Brown, will you please put council bill three or nine on the floor?'",
        "'speaker_9': 'Thank you. Madam President, I move the council bill three or nine be placed upon final consideration and do pass.'"
    ],
    "Creation of the RiNo Denver General Improvement District and Appointment of Advisory Board Members.": [
        "'speaker_5': 'Okay. The public hearing for 309 is open. May we have the staff report?'",
        "'speaker_4': 'I have the opposite problem that Andy does. Mike's here. Okay. Sure. So John Carter, what Department of Finance Council Bill 150309 is for an ordinance to approve the creation of the Regional General Improvement District. The boundaries of the district are roughly I-70 on North 29th Street from the south, the railroad tracks and the on the west and'",
        "'speaker_4': 'on the east. So this sounds like the same boundaries, but it's actually a smaller subset of the bid boundaries on the west side of the Rhino neighborhood. The the primary focus of the idea will be to fund infrastructure improvements with the district's boundaries.'",
        "'speaker_4': 'First, the JDA will provide up to $3 million for enhanced streetscape improvements along Brighton Boulevard that will be installed in conjunction with the city's planned reconstruction for the street next year. Districts capital improvements will include trees, landscaping, irrigation plus pedestrian and landmark lighting along Brighton Boulevard.'",
        "'speaker_4': 'These capital improvements will be funded through a one time charge of roughly $200 per linear foot for properties fronting Brighton Boulevard. The guide will main will maintain to maintain these enhancements by imposing a levy of four mils on all real property within the guide.'",
        "'speaker_4': 'The Guide. The Guide Mill levy is estimated to raise roughly $200,000 in the first year, similar to the Ryan Obeid business. Personal property will be excluded from the guide's mill levy as the financial capacity of the guide expands.'",
        "'speaker_4': 'Revenue raised to the mill levy will also go towards funding additional infrastructure projects across the neighborhood. Future projects for the guide are anticipated to include a study and potential improvements to neighborhood lighting rain over riverfront access improvements, enhancements to the forthcoming Rhino Park and or enhanced and or enhancements to additional access roads within the district boundaries.'",
        "'speaker_4': 'The services facility, facilities and improvements to be provided by the guide are not intended to duplicate or replace the services, facilities and improvements provided by the city and county of Denver within the proposed district boundaries. The guide is being created to provide enhanced and otherwise unavailable services and improvements within those boundaries per state statute.'",
        "'speaker_4': 'City Council sets is the official board of Directors for the Final Guide. However, the proposed interest and proposed ordinance also creates a district advisory board which is which is delegated many of the day to day operations of the district.'",
        "'speaker_4': 'The Advisory Board will also recommend a district annual work plan and budget for city council approval each year. The initial advisory boards consist of seven members appointed by the mayor and confirmed by City Council through creation ordinance. Presenting and shall and show consist of at least two artists, creative enterprise, property owners and two residential representatives.'",
        "'speaker_4': 'The initial members of the board are proposed as follows and. HAYES Tom Gordon, Chris of all time, Jonathan Kaplan, Jason Winkler, Larry Burgess and Tracey Real as part of as part of the creation process, the petitioners, led by the steering committee of property owners, held several outreach events to ensure ample opportunity for property owners within the district'",
        "'speaker_4': 'to learn about the business plan, creation and operations. This includes informational mailings, newsletters distributed to property owners and numerous public events and small group meetings with property owners and businesses. Additionally, the petitioners held three public information events targeted specifically to residential property owners.'",
        "'speaker_4': 'Local media outlets also published articles on the guide's organizing efforts and planned infrastructure projects. Approval. Approval of the operating plan does not a not approve any specific development plan or change in zoning. City Council approval of the guide creation allows a proposed district election, including the oppose imposition of a an assessment.'",
        "'speaker_4': 'Proponents of the district are planning to hold the required election in November as well. Based on the present information, the Department of Finance recommends approval of the creation of the General Improvement District and its initial members of the Advisory Board of Directors.'",
        "'speaker_4': 'Thank you and happy to answer any questions as well for the jetty.'",
        "'speaker_5': 'Thank you, Madam Secretary. How many speakers do we have this evening?'",
        "'speaker_1': 'Eight.'",
        "'speaker_6': 'We have a.'",
        "'speaker_5': 'Okay, we have eight speakers, so I will announce our first six and if you can come forward our first five and Elizabeth, Jason Winkler, Jonathan Kaplan, Andy Mountain and Brian six. Yeah. If you can sit in the front row.'",
        "'speaker_5': 'That would be helpful. Okay. If you can make room for the rest of the speakers. All right, everybody in there. Okay. And Elizabeth.'",
        "'speaker_12': 'I'm an Elizabeth. Globeville was an extended family and lived in Swansea, all of which are taking care of me as I go into a healthier life that will activate me as an artist, I'm happy to say. And this perfect confusion about me speaking before is that I had signed up for the Geordie thinking I had signed up'",
        "'speaker_12': 'for the bid because I am in very strong support of it and the guide is very much the completion to me of the picture of how what the folks in Rhino are doing is inspiring and actually strengthening similar efforts of the cluster of neighborhoods surrounding the Rhino District.'",
        "'speaker_12': 'And one of the most wonderful things we're able to say out in the planning process is we work on the the continuation of the legacy that this council has started by putting neighborhood plan planners in the neighborhoods like Little Village in Swansea is Rhino has done it right and they have established a sequence of events that give'",
        "'speaker_12': 'city council and our city government the ability to provide the funding mechanisms and the prioritization so that we can support the entrepreneurial spirit of the folks that are really going to create the sustainable economy for us in these neighborhoods, which is ourselves and those that inspire us by invest, investing locally into the neighborhoods and working together with'",
        "'speaker_12': 'each other. And I can say that we're seeing partnerships between people that are creative people and that are business minded people in Elyria, Swansea and Globeville in particular are starting to know more people in Reno that can partner up in technical areas and in mentoring and business and that kind of a thing.'",
        "'speaker_12': 'So the relationship between the investors and the communities that is showing up in the in the GEDI and the bid is extremely exciting and very reassuring. One of the in particular I want to thank in Hayes for showing up at our neighborhood planning processes from Westfield.'",
        "'speaker_12': 'And there's a very important juncture there in Brighton Boulevard. So just as a person out in the mix doing what I can to make my way and meeting the context of creative neighborhoods, folks that transcend economic cycles through entrepreneurial courage and who sustain efforts over long political calendars, many people are very grateful, and I think we're all'",
        "'speaker_12': 'going to be learning a lot how to move together as diverse neighborhoods, too. And the solution to gentrification is really increase and diversify the income house to house to house to house, generation to generation to generation so people can stay in their neighborhoods and stay in the weave of their their family legacy.'",
        "'speaker_12': 'And with the advent of the artisan economy, local economy, there is nothing better than what we're seeing happening between the combination of the good, the bad, working with the city planning department and helping us strengthen the economy so we can work very dynamically with the larger projects like the the overview projects in the quarter, like the stock'",
        "'speaker_12': 'show and the I-70 dilemmas and how do we create the connectivity among. And it's a very wonderful process. So thanks to this council, thanks for staying in there and thanks for the folks that started with just your creativity.'",
        "'speaker_12': 'And here you are and there's a lot of people they're going to benefit from this. So full support.'",
        "'speaker_5': 'Thank you, Jason Winkler.'",
        "'speaker_4': 'Good evening, members of Council. Thanks so much for having us here tonight and thanks for everything you guys do. It's truly an honor and a pleasure to do what we get to do here. I'm Jason Winkler, and I'm a resident of Denver and also a landowner on a handful of parcels in Rhino Hammon Eastside around a West'",
        "'speaker_4': 'Sider. So none of that none of that really bothers me, whether we're talking about the disparity. But I do on that point think that it's going to be handled very well. The idea, of course, as a west side or west side piece of of Reno and kind of echoing what Councilman Burke spoke about and all the people'",
        "'speaker_4': 'flooding into Reno and doing great and.'",
        "'speaker_0': 'Fun and exciting things that it really is there.'",
        "'speaker_4': 'To provide the infrastructure, maybe the less exciting and the less sexy, you know, piece compared to the bad. But we need some place to walk. We need some place to bike. And from a safety perspective and from an economic driver perspective, the guide is there to sit beside the commitments made by the city and county of Denver'",
        "'speaker_4': ', specifically to make the Brighton Boulevard corridor great. And then we as landowners want to come in behind, behind what the city and county are here to do and make kind of the edges of what the city's going to do.'",
        "'speaker_4': 'Great. And that's being done kind of as a one time thing. And it's really to prevent what we call Brighton Boulevard Frogger, which is you have to go one side and then cross over and then go the other side and not get hit by traffic and cross over.'",
        "'speaker_4': 'So if we didn't do things by way of a guide like this and all the landowners come together, which we do really uniquely in Reno.'",
        "'speaker_0': 'You would have a patchwork.'",
        "'speaker_4': 'Of of of infrastructure improvements in this guide. Most specifically lets us do it all at once in a concerted effort. And it's more.'",
        "'speaker_0': 'Efficient.'",
        "'speaker_4': 'It's more effective, has a better end result, and it eliminates Brighton Boulevard Frogger. So and that's that's at least one of my big drivers. So and thank you. And we really appreciate your support.'",
        "'speaker_5': 'Thank you. Jonathan Kaplan.'",
        "'speaker_0': 'I want to thank counsel for this opportunity to speak. My name is Jonathan Kaplan and I own some passes on Brighton Boulevard and directly behind with my wife Dorothy are some parcels on wine coop. Also on the Reno board, the UIC board, boards of boards, the bridge over the Platte Working Committee, the gift board.'",
        "'speaker_0': 'Now. This is a great opportunity for us. And I want to thank all the rhinos for being here. And I want to thank Mayor Hancock, especially for the line item in the budget for Brighton Boulevard. What the gift is, is an extension of a form of a public private partnership.'",
        "'speaker_0': 'Residents can maintain a degree of control and we can guide how the neighborhood looks, sees and feels. The grid also equalizes a perceived inequity with all the money that's being driven towards Brighton Boulevard. The GID. Now, those of us that live on Brighton Boulevard will tax ourselves additional amount of money so that we can maintain Brighton Boulevard'",
        "'speaker_0': '. And the big picture here and it's not about individuals, what what it's really about is building community and, you know, communities. Micky once said Communities grow organically. Well, the GED is a way to help that growth continue. Reno has grown considerably over time, and it's the hard work, the tireless work of all the individuals that have made'",
        "'speaker_0': 'it happen. It's you know, it's the residents directing. As the community grows, it allows us to implement improvements such as wayfinding signage, bike racks, bike lanes, everything that the city has started. This city's given us a great opportunity here with the money for Brighton Boulevard.'",
        "'speaker_0': 'So those of us who live on Brighton Boulevard now are going to pay a little more so we can get a lot more because it's a real big picture and the GID will enable connectivity and it equalizes any inequities that may be perceived by the East Siders versus the West Siders.'",
        "'speaker_0': 'It's all about community and it's really about art. And without the arts district, we wouldn't have the GID, we wouldn't have the bid. And I want to thank Tracey and all the class of rhinos that have come out tonight to support this.'",
        "'speaker_0': 'And Judy, thank you for your support and counsel. Thank you for your support.'",
        "'speaker_5': 'Thank you. Our next speaker is Andy Mountain.'",
        "'speaker_4': 'Good evening, counsel. My name is Andy Mountain. I'm a resident of Denver, and I'm a principal with GBC, a consulting firm based here downtown. I've led communications and engagement efforts for a few handfuls of projects within Reno in the last decade or so.'",
        "'speaker_4': 'And it's given me a unique perspective on kind of the intersection of private sector interests and public sector plans, and really how that plays a role in shaping this dynamic neighborhood specifically. I wanted to come in tonight just to speak with you about the proposed Rhino Guide and encourage your approval of it.'",
        "'speaker_4': 'It exemplifies the kind of collaborative spirit and public private partnership that can serve as a model for other infrastructure projects throughout the city. Brighton Boulevard has long been a lightning rod of conflict in Rhino. There have been as many visions for the quarter as there are uses served by it.'",
        "'speaker_4': 'And when I first began work on Brighton in 2013, the city and local community were at a stalemate conflict primarily focused on detailed cross-sections. And typically we had individuals fighting over feet. How many feet should be dedicated to what nobody was pulling up and seeing the bigger vision that really stood in the way of progress.'",
        "'speaker_4': 'So what we did was we initiated a visioning effort for Brighton, figuring out a way for it to serve as the main street for Rhino while continuing to serve the diverse array of uses. We've touched on already everything from 18 wheelers and busses down to pedestrians and bicyclists, you name it.'",
        "'speaker_4': 'The result of that visioning effort was not one silver bullet design. It was a design that was adaptive and dynamic, just like this quarter is. Over the last year, you've heard from the rhino stakeholders that have banded together to define what they want, the future of their neighborhood to be specific to Brighton Boulevard.'",
        "'speaker_4': 'What this guide does is they've worked hand in glove with city staff sitting across the table from one another, working together to figure out how they can use the city's investment as a springboard from which they can invest their own funds to advance their own neighborhood.'",
        "'speaker_4': 'With the Rhino Guide, the neighborhood wins. They get an enhanced corridor. They get kind of help in designing it and investing in it. And they also get the structure and ongoing financing that they need to continue making similar improvements.'",
        "'speaker_4': 'With the Rhino Guide, the city wins. They get an enhanced and more vibrant and artistic, almost industrial artistic gateway into downtown, and they also gain a true neighborhood partner. One of the things that we've seen as the conflict has begun to be replaced by real collaboration and real spirit together.'",
        "'speaker_4': 'So really, over the last decade, I mean, this transition, you know, the neighborhood's gone from three kind of geographically disparate communities, almost tri sector, if you will, by railroad tracks. We got East Side, West Side. But there's also the river that serves as a barrier in this community.'",
        "'speaker_4': 'This guide effort has begun to bring folks together. So I encourage your support. This has been a tremendous effort and I'm honored to have been a part of it.'",
        "'speaker_5': 'Thank you. Thank you. Brian speaks.'",
        "'speaker_4': 'Members of.'",
        "'speaker_0': 'Council. Thank you for having us. I have a pretty short script.'",
        "'speaker_4': 'My name is Brian Sleeps. I'm with Great Divide Brewing Company.'",
        "'speaker_0': 'I have a pretty short script, so I just want to go off of that script for.'",
        "'speaker_4': 'Just a second and speak to a comment I heard earlier regarding the possibility of commercially assessed property today being developed into residentially assessed property which would then leave commercial property owners holding the bag. That bag would be the same size as it is today.'",
        "'speaker_4': 'And and I assume that's correct in that the election question is written such that the mill levy that's assessed on commercial property owners is set at a ceiling.'",
        "'speaker_0': 'So now I'll go back to my script again.'",
        "'speaker_4': 'Brian sleeps with great divide. We owned just over five acres of a of commercially assessed property along Brighton Boulevard. And with that said, we fully support the creation of a general improvement district and we would ask council to do the same.'",
        "'speaker_4': 'I have witnessed firsthand a very organized and collaborative.'",
        "'speaker_0': 'Public private partnership thus far, and I'm excited to.'",
        "'speaker_4': 'See the reconstruction of Brighton Boulevard get underway. The the General Improvement District would give us a unique opportunity to work with the city to retain the character of Rhino by funding enhancements to that project. It would also allow for future projects that would continue to make our neighborhood a great place to work, live and play.'",
        "'speaker_4': 'So again, thank you for your time and hope that you support this general improvement district. Like most of the residents and and business owners and commercial property owners in our in our district. Thank you.'",
        "'speaker_5': 'Thank you. Justin Cross.'",
        "'speaker_4': 'Members of council. I'll keep the short since I was up here already. But I just want to talk about the Guild and specifically the fact that we didn't set out to form a guide. We set out to form a bid, and then the investment, which we are very thankful for.'",
        "'speaker_4': 'And Bright and Boulevard came about and there was this idea of how do we contribute to that and basically turn it into a truly living street because of the concerns about potentially there being funds in an in transparent way, going towards infrastructure on the West Side and more towards soft costs on the east side.'",
        "'speaker_4': 'There was actually a decision by the bid board to explore creating a separate district specifically to function on to function as the entity to fund infrastructure improvements on the West Side. So I just want to talk a little bit about how that process or say that's how that process went.'",
        "'speaker_4': 'The idea for the guide. I think that we're so excited about is the funding for Brighton Boulevard is going to go primarily towards concrete, which in a lot of ways is great. We're really excited about having a separated bike lane other than this one right out here.'",
        "'speaker_4': 'It'll be the first vertically separated bike lane in the city and making Brighton a truly multimodal street and making it a real place. And I think that's what's so exciting to all of us is it's it is it will always be a gateway.'",
        "'speaker_4': 'It'll always be a thruway. But what makes a great gateway as a true place and really allowing cyclists, pedestrians and people of all modes to be able to walk down Brighton Boulevard and visit. The different things that are happening on that street are so important long term.'",
        "'speaker_4': 'The the goal of the guide really is to continue to fund other projects in the neighborhood. The big one is the river and we think that the river is probably our greatest asset on the west side of the tracks and it's been abandoned and overused and really treated like a sewer for most of Denver's history, especially in'",
        "'speaker_4': 'that neighborhood. And how do we as a neighborhood really stand up, really on behalf of the river and say, this is important to us, we want to reclaim this for this community? The GID, after funding the Brighton Boulevard improvements gives us the ability to do that over time and have a separate funding mechanism that really focuses on'",
        "'speaker_4': 'the area around the river and improvements associated with the river. So I just want to say thank you for your consideration. We are excited about this district, really looking forward to talk about specific projects and actually potentially looking and encouraging the East Side to actually sign up for it as well in the future because of the significant'",
        "'speaker_4': 'infrastructure needs related to drainage and one way streets on that site. Thank you.'",
        "'speaker_5': 'Thank you, Jason. Rick Krohn.'",
        "'speaker_0': 'Evening, Rick. Crown Attorney Spencer Fein here representing the proponents. And here just to answer questions, I.'",
        "'speaker_9': 'Think they've covered it very well. Don't really need.'",
        "'speaker_0': 'To add anything. Thank you.'",
        "'speaker_5': 'Thank you. And Jamie Lythgoe.'",
        "'speaker_11': 'And Jamie go Centro again, consultant on the guide creation process. So just here to answer questions, anything related to the process or the operating plan?'",
        "'speaker_5': 'Thank you. Members of council. That includes our speakers. Are there questions from my colleagues? Councilman Ortega, I would like to ask Jamie if you would come to the microphone. So this stretches all the way to I-70, correct?'",
        "'speaker_11': 'Yes.'",
        "'speaker_5': 'So how have large businesses like Pepsi been involved in the conversation and are they on board?'",
        "'speaker_11': 'Straight answers, yes. Pretty much every all those major landowners all up and down Brighton Boulevard did sign the petition of support. Our engagement for the process was nothing short of a labor intensive process, and this group has talked about the collaboration of how that came about.'",
        "'speaker_11': 'A lot of it driven by design and a lot of it driven by the big question of how are we going to make this work structurally from an organizational funding point of view, how does how do we make it all work?'",
        "'speaker_11': 'So beginning, I think sometime in mid-November and leading really through February, March time frame, when we actually went to petition, there was a group of property owners, including, as you said, Pepsi and others who were meeting literally every other week on a monday morning for 2 hours, sitting down, working through design, working through assessment methods, working through'",
        "'speaker_11': 'how we make this financially work for everybody without it being too much of a burden. So the guide was extremely labor intensive and collaborative process in that regard, and the demonstration of support we received and the petitions of support demonstrate that from all the major property owners, not only on Brighton but within the broader GEDI area as'",
        "'speaker_11': 'well.'",
        "'speaker_5': 'So my next question is about the fact that historically the city has looked at non-profits a little bit differently. I know that along this corridor we have the 40 museum. I think they're a nonprofit, are they not? They so.'",
        "'speaker_11': 'They are actually they have.'",
        "'speaker_1': 'A.'",
        "'speaker_11': 'Majority of them, a majority exemption, but they are do have a partial commercial exemption for part of their business. And they also did sign a petition of support for both the Biden.'",
        "'speaker_5': 'Okay. It all the questions. Thank you. Thank you, Councilwoman. Councilwoman Sheppard.'",
        "'speaker_1': 'Thank you. Forgive me if I missed this, but how many mills is this? Levy? I thought I heard eight for the first four. Okay. All right. Thank you.'",
        "'speaker_5': 'Thank you. Are there other questions? No. The public hearing is closed. I made my comments earlier. The thing that I would just like to hammer home is that allowing for this general improvement district to pass complements the Business Improvement District.'",
        "'speaker_5': 'And after hearing what Justin Crawford talked about how the board had decided that this really was the way to go, I 100% support it. And I'm so excited again to see I mean, Rhino is just changed so quickly and even a year from now, I'm so excited to see what happens.'",
        "'speaker_5': 'So I will be supporting this and I encourage my colleagues to do the same. Our next speaker, our next councilperson is Councilman Brooks, followed by Councilwoman Kennish.'",
        "'speaker_7': 'Thank you, Madam President. And I'll make this short, because I feel like I'm back in church a little bit with the heat, and I've said all of my comments, but I wanted to show my support and I did a fashion faux pas today and I wore my shorts.'",
        "'speaker_3': 'Some of us can see that.'",
        "'speaker_5': 'Councilman Brooks, can you stand up to the rest of us can see that.'",
        "'speaker_7': 'General, you get in this.'",
        "'speaker_1': 'Like Superman. I thought it was going to be chest hair.'",
        "'speaker_7': 'No, not chest hair or.'",
        "'speaker_5': 'Any other comments. Okay, Councilman Kennish.'",
        "'speaker_1': 'Thank you, Madam President. I know regret chiming out so that Councilman Brooks could go first, because I've got nothing to follow that. But so, you know, in regards to probably both issues, but for this one in particular, I just wanted to say, you know, I often get asked what it's like to govern.'",
        "'speaker_1': 'And particularly when I talk to folks from other areas, I talk a lot about Colorado and Denver and the Taxpayer Bill of Rights and how limited it seems like we are and how one of the things we end up doing is having these special districts that carry a lot of the infrastructure needs for our communities.'",
        "'speaker_1': 'And in in in many cases, you know, that's borne of a difficulty or it's borne of a challenge. But the one thing that I think that is a positive that comes out of it is it is actually creating a citizen led government in a way.'",
        "'speaker_1': 'What you are creating in this in this these actions is really taking ownership of your community, investing your dollars in having a direct say in how they're spent. And so I do think there's a beauty a little bit to that democratic way of of building your community.'",
        "'speaker_1': 'And so I want to just, you know, congratulate you. You've taken on a big responsibility, as we seem to be headed in the direction of passing this one as well from the comments so far. And, you know, to say that, you know, the values that you've shared in addition, I mean, we're talking about infrastructure here.'",
        "'speaker_1': 'But what I believe in is that the way that you build a community is is the way that you are treating and serving the people who will live, visit, spend time there. And so that I think if you think about the form following the function, you know, that's the responsibility you're taking on.'",
        "'speaker_1': 'And I think that the interest in, you know, touring truly keeping that to be an inclusive space. And so, you know, bikes is a really important piece. But how how do poor people interact with the community and continue to feel comfortable there?'",
        "'speaker_1': 'And and how do all of those pieces continue to come together? So I think that that flavor of rhino that you have is is, is, is about the people and how you make sure that that infrastructure matches the people is clearly a value that this group has.'",
        "'speaker_1': 'So with that, I want to lend my support once again to this measure and to say that I look forward to seeing the fruits of your labor as they come online. So thank.'",
        "'speaker_5': 'You. Thank you, Councilwoman Kennish. See no other comments. Madam Secretary, roll call on Council Bill 309 40.'",
        "'speaker_10': 'I.'",
        "'speaker_6': 'Can each.'",
        "'speaker_1': 'I layman I.'",
        "'speaker_6': 'Never.'",
        "'speaker_4': 'I.'",
        "'speaker_6': 'Ortega I Rob I Sheppard I Susman i brooks.'",
        "'speaker_7': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_5': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_6': 'Ten Eyes.'",
        "'speaker_5': 'Ten Eyes. Counsel Bill 309 has passed. Kelso MacInnis, will you please put Council Bill two of seven on the floor?'",
        "'speaker_1': 'Thank you, Madam President. I move that council bill 212 be placed upon final consideration and do pass. I'm went ahead. Take that back. Council President. I move that council bill two seven be placed upon final consideration and do pass.'",
        "'speaker_5': 'It's been moved and seconded. Council bills 207 and 212 approve zoning map amendments. The Council is required by law to conduct hearings on zoning map amendments, and council's actions are subject to court review in order to provide a record for court review.'",
        "'speaker_5': 'Testimony is recorded and any items presented to the Council are marked as exhibits and become a part of the record. Speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so, their home address is.'",
        "'speaker_5': 'The public hearing for Council Bill 207 is open. May we have the staff report?'"
    ],
    "Rezoning of 100 N. St. Paul Street and 149 N. Steele Street in Cherry Creek North.": [
        "'speaker_11': 'Thank you, Madam President. Members of City Council. My name is Ryan Winterberg with Community Planning and Development. Here to present an application to rezone from pod 630 to C, C, C and 12 at 100 North St Paul Street and 149 North Steele Street.'",
        "'speaker_11': 'So the subject site is located within southeast central Denver in Council District ten and in the Cherry Creek Statistical neighborhood. To orient you a bit to the site here, we see it is bound by North Steele Street on the East First Avenue on the South and North St Paul Street on the west.'",
        "'speaker_11': 'It is within the Cherry Creek North Business Improvement District and the Cherry Creek Shopping Center is directly across the street across First Avenue. The Cherry Creek Greenway and Pulaski Park are about a quarter of a mile to the south and the East First Avenue and North Steel Street corridor is served by six RTD bus routes.'",
        "'speaker_11': 'So the property is roughly 1.8 acres and it is comprised of two assessor's parcels. A Currently there is an eight story mixed use structure under construction at the site as well as a one story bank. The property owners are requesting a rezoning to facilitate the second phase of redevelopment, generally to increase the maximum permitted building heights.'",
        "'speaker_11': 'And it should be noted that PUD 630 always anticipated two phases of redevelopment, but the applicant's desired second phase is not permitted by PDE 630. So the request before you today is to rezone from PD 630 to C, C, C and 12.'",
        "'speaker_11': 'And consent has been received by both property owners within the PUD. So C CC and 12 stands for the Urban Center Neighborhood Context within Cherry Creek North and a 12 story maximum permitted building height. And as a refresher, the Cherry Creek North Zone districts were approved by city council in October of 2014 after a nearly two year'",
        "'speaker_11': 'process to draft customized zoning for Cherry Creek North, a direct recommendation of the Cherry Creek Area plan. And this application is the first owner initiated rezoning since the approval in the fall of 2014. So to orient you to the site a bit, if you've been here lately, you'll notice that it is a rapidly evolving context.'",
        "'speaker_11': 'The first phase of redevelopment, generally located at the 100 North Saint Paul Street site, is outlined in pink. It is the eight storey mixed use structure. It features ground floor retail and upper storey office. It also includes three levels of underground parking and a small surface parking lot access from North Steel.'",
        "'speaker_11': 'And it was reviewed and permitted under the entitlement of PDE 633. And the applicant has undergone a pretty substantial analysis of the development that's ongoing at that phase one compared against the proposed six and 12 zone districts, and has found that it substantially conforms with Section 12.'",
        "'speaker_11': 'So the area highlighted in green, this is the generally intended second phase of redevelopment at 149 North Steel Street. It features a temporary one story bank building there in the northeast corner, basically where that little red arrow is pointing you to.'",
        "'speaker_11': 'And upon completion of the first phase of redevelopment, that bank facility will move into the new building. And this green area is the proposed phase two redevelopment area, and the applicant intends to redevelop the site under the C 12 zone district should it be approved tonight.'",
        "'speaker_11': 'So before I dove into the standards a bit, I want to explain why the entirety of Pad 630 is before you tonight for rezoning. In December of 2014, we received a rezoning application to rezone generally the phase one area as outlined in blue and you see in this map out of 630 and into 1612.'",
        "'speaker_11': 'So whenever we receive a rezoning that involves a pad, CPD staff does a very thorough analysis of any remainder of the PD to see how the development would comply with the standards of that PD. And we did find that rezoning a portion of PD 630 and leaving a remainder would leave the remaining portion of 5630 non-conforming.'",
        "'speaker_11': 'And we do have a CPD policy not to support a rezoning that would leave a nonconforming PDS. And so we don't want to create any nonconformity. So based upon that analysis, the rezoning application was revised to rezone the entirety of 630.'",
        "'speaker_11': 'And we do find that it is a more logical application of zoning and avoids administrative challenges that could occur over time with the creation of a non-conforming party. To orient you to the existing zoning context in the area we see at the intersection of First and Steele several 12 storey zoned districts.'",
        "'speaker_11': 'We see some existing C CC and 12 zoning as well as TMX 12. We see the new mapping of the c ccn districts to the north moving into the business improvement district, generally decreasing in height, the further storey increasing in height.'",
        "'speaker_11': 'The further south you go towards the first steel corridor. We also see several pods along First Avenue, both within the Denver zoning code and the former Chapter 59. We see B three zoning to the south at the Cherry Creek Shopping Center and several C zone districts to the east along First Avenue, generally decreasing in height.'",
        "'speaker_11': 'The further east, you go away from the Business Improvement District. So to move you to the existing zoning, this is Bud 630 that currently applies to the subject site. It is a former Chapter 59. It was established in 2009 and always anticipated two phases of redevelopment.'",
        "'speaker_11': 'It permits a maximum height of ten storeys that's 145 feet and a maximum far across the entire site of 3.62 to 1. It also specifies parking and set back standards as well as some other design standards in the putty.'",
        "'speaker_11': 'I'd offer two options for a mix of permitted uses. The first option includes a retail service office and multiple dwelling units. The second option is retail service and office. So without that, the multi dwelling unit component and we can see here on the right this is the district plan excerpt from the PWD.'",
        "'speaker_11': 'It sets forth access standards as well as maximum building footprints. And I've highlighted for you in pink the phase one that's currently undergoing redevelopment. This is just really for your reference, it's not included within the putty. So the Cranmer curfew plan also applies to the subject site view plans protect and preserve panoramic views of the mountains from'",
        "'speaker_11': 'key locations throughout the city. And in this particular case, the Cranmer Park View Plan originates in Cranmer Park where you see the red dot are subject site is located at the Yellow Star and the view plan will specify maximum building heights for all structures, generally increasing in height.'",
        "'speaker_11': 'The farther you move away from the origin point of the view plane and at our particular site, the maximum building heights will be 158 to 161 feet across the site. The Design Standards and guidelines for Cherry Creek North also applied to the subject site.'",
        "'speaker_11': 'They guide site design, building design signs and streetscapes and the design standards and guidelines also specify a review by the Cherry Creek North Design Advisory Board who would make a recommendation to the zoning administrator for final approval. And these design standards and guidelines would apply regardless of the rezoning tonight.'",
        "'speaker_11': 'So moving on to existing land use, was there a subject site outlined in yellow? It is commercial retail. Then moving north, we see the Cherry Creek Shopping District mixture of mixed uses, retail and office. And to the south we see the Cherry Creek Shopping Center and you'll also notice multi-family and single family development in the northeast portion'",
        "'speaker_11': 'of your map moving farther away from the Business Improvement District into Cherry Creek East. So the existing context. So the building form and scale of our subject site, if you've been to the subject site, you'll notice that it is nearing completion.'",
        "'speaker_11': 'The photo that's in the upper right hand corner is taken from the northeast portion of the PD looking south. You can see in the foreground that said one story, temporary bank building that upon completion of the new building, that bank facility will move into the new eight story building and that will be the subject site of the'",
        "'speaker_11': 'phase two redevelopment. You can see the photo in the bottom is taken from the southern portion of the PD looking north. So you see the eight story building that is substantially complete. And in the lower right hand corner of that photo, you notice a small Wells Fargo structure.'",
        "'speaker_11': 'It is not included in today's rezoning. It is already zoned C 12. Moving into building foreman scale in the surrounding area. You see the photo in the upper right hand corner is very indicative of the Cherry Creek North Shopping District.'",
        "'speaker_11': 'We see pedestrian oriented buildings, high transparency. Then the photo in the lower right hand corner is the evolving context that we see at the first and steel intersection with the construction of 212 storey mixed use structures. Then moving to the south, we see the Cherry Creek Shopping Center with a surface parking lot located in between the building'",
        "'speaker_11': 'in the street and then in the northeast corner we see an eight storey office building that features ground story retail. Generally, we see higher intensity both in height and uses located at the first in steel corridor. There's a mixture of building heights within the shopping district, but generally heights will decrease the farther you move away from first'",
        "'speaker_11': 'and steel. So in terms of public process, we notified the following nine registered neighborhood organizations of completed application and then at every public hearing along the way. And for the communication that we have received today, we received a letter of support from the Cherry Creek East Association.'",
        "'speaker_11': 'We received a letter of support and an R.A. position statement from the Cherry Creek Area Business Alliance. Cherry Creek North submitted an email indicating that the R.A. voted in non opposition in response to an applicant statement of intent.'",
        "'speaker_11': 'And that statement of intent is included in your application package. Country Club Historic Neighborhood Association also submitted a letter indicating there are no vote of non opposition. And just today we received an email from Polley reads, a resident of Cherry Creek North.'",
        "'speaker_11': 'So it's not included in your staff packet. But she did write in opposition to the rezoning request, generally citing concerns over impacts from construction and loss of character in Cherry Creek. So in terms of process, since we did receive two applications at the site, we notified R.A. and City Council on December 26 and February 3rd.'",
        "'speaker_11': 'On April 1st, planning board recommended unanimous approval of the rezoning. On April 15, the Neighborhoods and Planning Committee unanimously move the bill out of committee. On May 11th, we notified R.A. and City Council of today's public hearing and signage has been properly posted on the property and June 4th at first.'",
        "'speaker_11': 'Sidney, of course, we are here today at the city council public hearing for ultimate approval. So now moving into the five criteria in the Denver zoning code that CPD uses to evaluate a rezoning, the first of which is consistency with adopted plans.'",
        "'speaker_11': 'And there are three adopted plans that apply to the subject site. The first is comprehensive plan, and CPD found that the rezoning request is consistent comprehensive plan 2000. And we look to a number of strategies to inform that determination, including the promotion of mixed use development at key and appropriate locations.'",
        "'speaker_11': 'Moving on to Blueprint Denver, we see our subject site is located in this purple area, which is indicated as a regional center concept land use, which is intended to include a balance of retail, employment and residential. Blueprint Denver also recognizes that many regional centers began as a regional shopping center, but does acknowledge that a synergistic mix of'",
        "'speaker_11': 'uses is important to support that regional center. And the hatch indicates that the subject site is also located within an area of change. And these are areas that blueprint Denver recommends channeling the most growth and redevelopment to. Blueprint.'",
        "'speaker_11': 'Denver also sets out a number of street classifications that inform land use. The first in steel corridor is a mixed use arterial intended for high intensity mix of uses. First in Steel Corridor is also called out as an enhanced transit corridor, and these are areas that blueprint.'",
        "'speaker_11': 'Denver recommends increasing ridership, improving efficiency and improving service. And primarily we would accomplish this through a mix of supportive uses, intensities and densities. Moving on to the Cherry Creek Area plan adopted in 2002. The plan includes framework strategies that would apply to the entire Cherry Creek area, as well as sub area strategies that apply to specific geographies'",
        "'speaker_11': '. You can see our subject site outlined in red. It is located within an area of change and the Cherry Creek Area Plan acknowledges that for Cherry Creek to continue to grow and to be prosperous, it must be it must redevelop.'",
        "'speaker_11': 'And the bulk of this growth and redevelopment should occur within these areas of change, while protecting the largely residential areas of stability that you see outside of that hatched area. The Cherry Creek Area Plan also includes framework recommendations to concentrate higher intensity, mixed use buildings along multimodal streets and key intersections like first in steel.'",
        "'speaker_11': 'And the site is also called out as a key development opportunity within the plan. So moving on to sub area strategies. Our subject site is located within a regional center concept land use, where a mix of uses and compact development is desirable.'",
        "'speaker_11': 'The Cherry Creek Area Plan also recommends that building heights should range from 4 to 12 stories within the shopping district. And the subject site outlined in red is recommended for a 12 storey maximum building height at the node, a first in steel where we see a permitted higher building height.'",
        "'speaker_11': 'The Cherry Creek Area plan also makes recommendations for improving multimodal connectivity, including a couple that are actually going to be coming up for implementation quite soon, including the Spear Lead Sail Mobility Study and the redesign of the first in steel intersection.'",
        "'speaker_11': 'And these upcoming improvements support the rezoning to see CCN 12 through acknowledging the evolving transportation context on this particular corridor. So based upon the review of these adopted plans, CPD does find that the rezoning request is consistent. We also find that the rezoning will resorts result in the uniform application of the Zone District, and the rezoning furthers'",
        "'speaker_11': 'the public health, safety and welfare through the implementation of adopted plans and policies. Moving onto the fourth criteria that there be a justifying circumstance for the rezoning. As the application points out, the land or its surrounding environs has changed or is changing to such a degree that it is in the public interest to encourage the redevelopment of'",
        "'speaker_11': 'the area or to recognize the change character of the area. And CBD did find a number of change conditions that justify this particular rezoning. As stated in the application, the 12 storey redevelopment that is occurring at the first and still intersection is the realization of the Cherry Creek Area plans recommendations for a higher intensity node at that'",
        "'speaker_11': 'particular location. Additionally, to change conditions since the approval of PDE 630 and 2009 are the adoption of the Cherry Creek Area Plan in 2012, setting forth a new vision for the Cherry Creek area as well as the customized Cherry Creek North zoning that was adopted in 2014, a direct recommendation of the Cherry Creek Area Plan.'",
        "'speaker_11': 'Additionally, the upcoming East First Avenue and Steele intersection redesign that should be beginning later in 2015. And the Spirit lead style mobility study that the RFQ has just been released this week does recognize an evolving transportation context in the area and justifies the rezoning to seek.'",
        "'speaker_11': '12. So now moving on to neighborhood context, we find that the subject site is located within a prototypical urban center. So we do find it appropriate to rezone to his own district within the urban center context. And finally, zoned district purpose and intent.'",
        "'speaker_11': 'We find that the Cherry Creek North Zone districts are intended to promote and enhance pedestrian oriented environment. And they are designed for specific application in the Cherry Creek North Mixed Use Shopping District. Specifically, the Section 12 Zone District applies to Cherry Creek North mixed use shopping districts to areas or intersections served primarily by major arterial streets or'",
        "'speaker_11': 'a building scale of 1 to 12 stories as desire desired, which we do see reinforced in the Cherry Creek Area plan. So based upon CPD's review of the five criteria, we recommend approval of rezoning PD 632 C and 12.'",
        "'speaker_11': 'And the applicants are here this evening, if you have any questions for them, and I'd be happy to answer any questions as well. Thank you.'",
        "'speaker_5': 'Thank you. We have three speakers signed up to speak this evening. The first one is Randall Phelps. Second one is Paul Powers. And the third is that. Jessica, if you could, please. The up.'",
        "'speaker_9': 'Madam President. Council members. I'm Paul Powers. I have nothing to add to a very complete report, but I'm available for your questions as the applicant.'",
        "'speaker_5': 'Thank you, Mr. Powers. Mr. Phelps. Paul Powers.'",
        "'speaker_4': 'Randall Phelps can my horn. Same as Paul Bowers. Just available to answer questions.'",
        "'speaker_5': 'Thank you. Okay. That Tasker.'",
        "'speaker_0': 'Thad, Texas 4535.'",
        "'speaker_9': 'Julian Street.'",
        "'speaker_0': 'Denver. As I was riding my bike through Cherry Creek past this location today, I noticed.'",
        "'speaker_9': 'An overabundance.'",
        "'speaker_0': 'Of coffee shops, high end restaurants and clothiers to serve the rich. But of course, I saw no facilities for our least advantaged citizens. Often I've heard this council talk about the benefits of promoting diversity and promoting diversity in neighborhoods.'",
        "'speaker_0': 'I've heard the president pro tem talk about the concentration of homeless shelters in her district. This zoning change does.'",
        "'speaker_9': 'Nothing to promote.'",
        "'speaker_0': 'Diversity. In fact, it inhibits it. As we've heard throughout the evening tonight, this council isn't.'",
        "'speaker_9': 'Supposed.'",
        "'speaker_0': 'To giving tax dollars, lots of tax dollars.'",
        "'speaker_9': 'To rich people.'",
        "'speaker_0': 'In fact, tonight, among other things, you're giving money to people who want to build a hotel for the wealthy. I would simply suggest that you use the zoning code in a few of those dollars to incentivize.'",
        "'speaker_9': 'Developers like these.'",
        "'speaker_0': 'To build a similar hotel for those who have no housing in the Cherry Creek area. Thank you.'",
        "'speaker_5': 'Thank you. That concludes our speakers questions from members of council. Councilman Ortega. Thank you. Madam President, I would like to ask the applicant if you can come to the microphone. So as we saw in the presentation that was done by Ryan, whenever.'",
        "'speaker_5': 'There are two options for the site. Either office with residential or retail office without residential. So have you determined what the specific use is going to be for the site?'",
        "'speaker_9': 'Yes, Councilmember. We plan to build for sale residential homes and will will build the retail as required under the zoning along Steel Street. So it'll be a small amount of retail, approximately 6000 square feet. But everything else on the steel street part of this project will be.'",
        "'speaker_9': 'Our intent is to build homes.'",
        "'speaker_5': 'Okay. So we're talking about high rise as opposed to single family homes, condos. Okay. And then your 6000 square feet of retail. I guess part of what I'm trying to get at is some of the parking needs that will serve and accommodate your tenants in the building.'",
        "'speaker_5': 'We know that this area is already very parking challenged. And so I'd like you to just address the parking issues in general. Yes. This development.'",
        "'speaker_9': 'We intend to exceed the. If the property is zoned to c cc and 12, we plan to exceed the parking requirement, which under that zoning is one per home. We will achieve in the neighborhood of 1.7. And we will have a per unit.'",
        "'speaker_9': 'Promise and we will accommodate the zoning requirement for the retail as well.'",
        "'speaker_5': 'Okay. Let me just see if I have any other questions. I think that's it. Thank you. Thank you, Councilwoman Ortega. Councilwoman Robb.'",
        "'speaker_8': 'Thank you, Madam President. Pro tem. While the attendance tonight might belie it, there's still a good deal of angst and concern about the amount of construction and the intensity of development in Cherry Creek. So I do have a number of questions if people can just bear with me.'",
        "'speaker_8': 'In Ryan's presentation, she pointed out that the PUD, which was created at two in 2009 and actually, Ryan, this may be more of a question for Mr. Powers, but the maximum height in the PUD is 145 feet. Assuming that you go ahead and do the condo construction that you're contemplating, how high a building would that be?'",
        "'speaker_9': 'According to our research, the criminal park ordinance will be the governing ordinance, not the zoning, because it will be more restrictive than the zoning and. According to the staff report, I believe that it's somewhere around 158 feet.'",
        "'speaker_8': 'So you're planning to build to 158 feet so the condos would be taller than eight stories of office. Or maybe you didn't build all eight stories. I'm trying to work well.'",
        "'speaker_9': 'In a residential building, Councilwoman. They may be about equal. But the I would say that if if this property is re zoned, we would build both within the premier park ordinance and within the zoning and. Ms.. WINTERBERG could correct me if I'm wrong in stating this, but I believe the.'",
        "'speaker_9': 'Existing pod allows 145 feet plus an amount of ten or 12 feet for the. For ancillary equipment on top of the building.'",
        "'speaker_8': 'So do you know how tall the office building is?'",
        "'speaker_9': 'Yes, I do.'",
        "'speaker_8': 'What is it.'",
        "'speaker_9': 'With the mechanical equipment? Approximately 146 feet.'",
        "'speaker_8': 'Okay. So it's my hope that you don't see the office building because if you did 12 stories of office, it would be a good deal taller. But we're hoping for residential here.'",
        "'speaker_9': 'Yes.'",
        "'speaker_8': 'Okay. How many units are you contemplating?'",
        "'speaker_9': 'Oh, between. 55 and 65.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'And could you talk a little bit about your time period or projected time period for construction?'",
        "'speaker_9': 'We believe construction won't start for a year to 18 months.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'And so given that sort of time period that it takes to get under construction, are you still pretty sure you'll be doing condos? Because a lot of the neighborhood letters reference. That is why I'm asking the.'",
        "'speaker_9': 'Well, we don't have a perfect crystal ball, councilwoman, but today we have sufficient commitments to finance condos and to insure them. And. You know all about the construction defects statute in Colorado. We believe that. Both the financing and the insurance will be there such that we're willing to.'",
        "'speaker_9': 'Risk the money to immediately design and engineer a condo building.'",
        "'speaker_8': 'Great. That's very helpful. And then on the outreach, you do have letters from neighborhood boards. Can you sort of talk about presentations? Did you where you presented this to get the input?'",
        "'speaker_9': 'Yes. I personally have presented to the Capital Hill United Neighborhood, Turkic East Turkic North, the Turkic Business Alliance Country Club neighborhood. And I hope I haven't missed some.'",
        "'speaker_8': 'But I think you presented to the steering committee.'",
        "'speaker_9': 'Yes, I did. Thank you.'",
        "'speaker_8': 'So so one of my particular questions is in all of those situations, because I was there for quite a few of your presentations, you were presenting either to a board or a zoning committee of the organization. Did you happen to present to the general population meeting of the Cherry Creek North Neighborhood Association?'",
        "'speaker_9': 'No.'",
        "'speaker_8': 'They didn't ask you to do that.'",
        "'speaker_9': 'I wasn't invited to speak only to the Chair Creek North Board.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'I'm almost done. Dave, my last question relates to Mr. Teske is testimony. If you do two condos, you will be expecting to meet the requirements of our inclusive inclusionary housing ordinance. Is that correct?'",
        "'speaker_9': 'Yes, we understand that.'",
        "'speaker_8': 'Yeah. And it may be off site.'",
        "'speaker_9': 'Yes.'",
        "'speaker_8': 'Okay. Thank you so.'",
        "'speaker_9': 'Much. Thank you.'",
        "'speaker_5': 'Thank you. Councilwoman Robb. Councilwoman Ortega. Councilwoman Robb asked my question about the commitment to affordable units, which we haven't or any of our for sale projects that move forward. But I wanted to ask the question about the corner of First and Steel in terms of improvements.'",
        "'speaker_5': 'We've seen a lot of new development that has happened at that corner. So I don't know what contribution those developments were expected to play in in this role of trying to improve that corner, which anybody who drives through it knows that it's gridlock at all times.'",
        "'speaker_5': 'And when you talk about pedestrian friendly or pedestrian safety issues, I know that's a concern, especially for some of the seniors who live just on the east side of Steele Street in I can't remember the I think it's called the covered housing that has three high rise buildings.'",
        "'speaker_5': 'But can you just identify what is being proposed to happen at that corner and how not only this developer, but any of the others who were allowed to build were somehow contributing towards that?'",
        "'speaker_11': 'Thank you. The councilwoman. So, as I mentioned before, the first and still intersection redesign will begin later this year in 2015. In 2013 and 2014, our colleagues in Public Works undertook an evaluation study to look at that particular intersection, knowing that it was called out in the Cherry Creek Area Plan as a very key intersection both to'",
        "'speaker_11': 'connecting people to Cherry Creek and then localized mobility and understanding that it's also very challenged to your point. So the study did identify, I believe, 3 to 4 different alternatives and selected a preferred alternative. I believe the focus of that particular study was understanding that a lot of the turning movements of that particular intersection are underutilized.'",
        "'speaker_11': 'So how to make the best use of that existing right away to serve pedestrians as well as bicyclists and autos? So a preferred alternative was selected and will be beginning design services later in 2015 and then probably approach implementation through the Capital Improvements program.'",
        "'speaker_11': 'So that is a city initiated way that that particular intersection can be improved from a multi-modal perspective. And then as individual properties redevelopment redevelop excuse me, along this intersection and anywhere within Cherry Creek North, they would be held to the streets keeping and sidewalk standards of the business improvement district, which is generally going to be heightened and'",
        "'speaker_11': 'have a broader sidewalk as well as a tree lawn. So we do expect to see design and hopefully implementation very soon of that intersection improvement.'",
        "'speaker_5': 'Though, given that this started in 2012 and 2013, what expectations did the city have in asking the different property owners who were developing on those various corners to contribute towards either through right of way or financially or whatever towards those improvements?'",
        "'speaker_11': 'Fred, I can't speak to the design process, so I wasn't involved in it, unfortunately. But I know that the selection of the preferred alternatives, as well as the vetting of all of the alternatives in that study, was a very collaborative process with the adjacent property owners knowing that there could be some changes in access as well as'",
        "'speaker_11': 'right of way acquisition or redesign. So I know that the preferred alternative was selected very collaboratively. I'm afraid I can't speak to any future right of way dedications, though that may be required. I believe it will utilize the existing right of way though, so I don't believe any existing dedication.'",
        "'speaker_5': 'I would like to ask Paul if you wouldn't mind coming back to the microphone if you have been asked to contribute any right of way to address part of the configuration of whatever proposed changes are to this intersection or financially, if you've been asked to contribute towards that.'",
        "'speaker_9': 'With respect to the Steel Strait development that we contemplate. Our property isn't on the corner of First and Steel. It's mid-block. Okay. So the answer is no.'",
        "'speaker_5': 'Okay. So the question would then be for any of those property owners who are on that corner, because it seems like we let that development go forward and now we're going to go change the reconfiguration of that intersection.'",
        "'speaker_5': 'And we should have been more thoughtful in looking at that upfront in terms of whether or not right away was needed to address, you know, the improvements that we're going to want to be doing. And it just sort of seems kind of backwards to be, you know, asking that we do that sort of after most of that'",
        "'speaker_5': 'major development has taken place where most of those buildings are now really right on the you know, on the lot line, if you will.'",
        "'speaker_11': 'Thank you. I did actually just pull up the image of the preferred alternative. It's it's known as alternative to a in that first in steel evaluation study. And it does appear that it utilizes the majority of the existing right of way, but that it may include some existing dedications of some pedestrian islands, as well as a wider'",
        "'speaker_11': 'sidewalk on the east side of the the intersection of steel. And first, so I know that will be a conversation when it comes to the upcoming design of that particular improvement.'",
        "'speaker_5': 'I have no further questions. Thank you. Councilman Rob, did you have.'",
        "'speaker_8': 'Thank you. I did have a few in. I really want to thank Councilwoman Ortega for her line of questioning on that. But just a few pieces. There was no desire on the part of the community to widen First Avenue or steel because it's hard enough for pedestrians to cross the developer on the south.'",
        "'speaker_1': 'East.'",
        "'speaker_8': 'Corner that's Steel Creek. The building complete when people are moving in was asked to build. I don't know if I'd call it a pedestrian median, but a median and East First Avenue so that cars couldn't cross out of the alley between Adams and Steel.'",
        "'speaker_8': 'So he did make an investment in the street. And I'm not wishing bad news for Mr. Powers, but when this project is designed and goes through all this site planning, I know one of the features of the Steel Street intersection extends the island at Saint Paul, which is very in First Avenue, which has very minimal.'",
        "'speaker_8': 'Waiting space. If someone is crossing there with a stroller, for instance, and can't get all the way, we couldn't lengthen the time at that intersection as we could at other intersections in Cherry Creek and have done recently. So that's the one intersection where we need more resting space.'",
        "'speaker_8': 'As far back as Bill Bill, I was out there looking at that. And finally, one of the things that I do like and I guess these are sort of comments, but they're in response to questions. I believe that Paul's core has an extra set back so that there can be a little more space from First Avenue for'",
        "'speaker_8': 'the pedestrian along the property that's already built. Actually, this sits down the block, not exactly on First Avenue. So with that said, that's all I.'",
        "'speaker_5': 'Know. Thank you. Councilman Rob, are there any other comments from council members? The public hearing is closed. Madam Secretary, roll call on Council Bill 207.'",
        "'speaker_8': 'We do. In comments.'",
        "'speaker_5': 'Comment. Oh, we are. Councilman Rob?'",
        "'speaker_8': 'Well, actually, I probably could have gone without comments, but I just feel that duty. I hope there's one down there. The neighborhoods have basically taken a position of non opposition to this, but I do not think and this is no fault of the police corp, but the outreach wasn't quite as extensive, possibly because of plans in place'",
        "'speaker_8': '. And most people know what the plan says now and the 12 stories are allowed. I think some of my some of my constituents will be happy to know that there's not more construction tomorrow in Cherry Creek because we're pretty construction exhausted, though.'",
        "'speaker_8': 'There will be things coming up in a year, year and a half as well. Probably in my way. And there really. This really pretty much meets the plan, which is why I think we see this the I think some of the support came because the plan, even though it's not mandated in the zoning, is for the condos'",
        "'speaker_8': ', which generates less traffic, fewer parking problems in the area. And so those were important to people. Thank you.'",
        "'speaker_5': 'Thank you, Councilman Brooks.'",
        "'speaker_7': 'It's a thank you, Madam President. It's our custom when we have someone who served in office to say hello. So the Honorable Paul Powers, we welcome you into these chambers after we ask you some questions, but is one to welcome you.'",
        "'speaker_7': 'Thank you for being here.'",
        "'speaker_5': 'Okay. A few comments. Okay. The public hearing is closed. Madam Secretary, roll call on Council Bill 207.'",
        "'speaker_6': 'Can each i layman i. Nevett i.'",
        "'speaker_5': 'Ortega I.'",
        "'speaker_6': 'Rob I. Sheppard, i.'",
        "'speaker_5': 'Susman, i.'",
        "'speaker_6': 'Brooks.'",
        "'speaker_7': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_5': 'I. Madam Secretary, close the voting and announce the results. Please.'",
        "'speaker_6': 'Ten Eyes.'",
        "'speaker_5': 'Ten Eyes. Counselor Bill 207 has passed. Councilwoman, can you please put Council Bill 212 on the floor?'",
        "'speaker_1': 'Yes. Thank you, Madam President. I move that council bill 212 be placed upon final consideration and do pass.'",
        "'speaker_5': 'They need a second. Thank you. It's been moved and seconded. The public hearing for Council 212 is open. May we have the staff report?'"
    ],
    "Rezoning of Property at 1290-1292 King Street from PUD 573 to G-MU-5.": [
        "'speaker_4': 'Yes. Thank you. Councilwoman or President Pro Tem Monteiro. Good evening. It's been a long evening. My name is Steven Chester, senior city planner with CPD here to present the staff report on 1292 1292 King Street PD 5732 JIMMU five.'",
        "'speaker_4': 'Here we are in West Denver, located within Council District one in the West Colfax neighborhood. The subject's site is directly south of 13th Avenue at the intersection of 13th and King Street. Also located directly north of the Knox Court Light Rail Station.'",
        "'speaker_4': 'Property is about 9.2 acres currently on the site as a single storey residential office type building, along with a three story shelter for women. The property owners are requesting rezoning due to the overly restrictive constraints on the current property due to the former Chapter 59 pad.'",
        "'speaker_4': 'They're hoping to redevelop this site along with the neighboring site, but they are back and can speak more about their plans for redevelopment. It's also important to remind you that approval of rezoning is not an approval of a proposed specific development project.'",
        "'speaker_4': 'So the request is for GMU five star general Urban Neighborhood Context Multiple Unit five story max. We'll walk you through the existing context, starting with the zoning in the area. It's a mixture of GMU five and three. The actual transit corridor is zoned E2.'",
        "'speaker_4': 'You see, that's left over from when this entire area was zoned. R two Prior to then, the new zoning code. There's some open space they could Gulch and Sanchez Park in the area which is zoned OSA. There's a quite a bit of u03, the use overlay three, which is a use overlay for a restrictive set of commercial'",
        "'speaker_4': 'uses in existing historic buildings. And then the current site or the site that's currently zoned PD 573. So they said it's a former Chapter 59 PD that's restricted to the building forms that are currently on the site or uses under AMI 30.'",
        "'speaker_4': 'The existing context pertain to land use is a mixture of single family and multi-family residential housing, with some scattered civic uses in the area, along with the transit corridor and the open space of Lakewood Gulch. Here's a picture of the subject site.'",
        "'speaker_4': 'This is that the shelter that I spoke of before. It takes use of the topography of the site. It's kind of a strange looking building, but and it's reached the end of its kind of useful life. Thus the rezoning.'",
        "'speaker_4': 'To the north is a Denver housing authority development. It's a mixture of two and three story buildings. As seen on the screen. Directly east of the site is a townhome project and a also affordable housing project up on the Hill.'",
        "'speaker_4': 'Their mixture of two and three stories and the largest building in the area is directly west of the site. It's a six story building also owned by Denver Housing Authority. The process to date in terms of public outreach.'",
        "'speaker_4': 'All the Arnaud's notified this application where the West Colfax Association of Neighbors Salons like Citizens Group, I.N.S. and the Denver Neighborhood Association. To date we received a letter of support from WECAN, along with a letter from the salons like Group.'",
        "'speaker_4': 'They do not take official positions on rezonings. However, I've been supportive of the public outreach process. We received a complete application on February 11th and April 1st, received a 9 to 0 recommendation from Planning Board. On April 15th, the case was moved out of Neighborhoods and Planning Committee.'",
        "'speaker_4': 'On May 11th, all the property was posted of notification of this public hearing. And here we are today. On June 1st, we'll walk you through the review criteria for this rezoning, starting with consistency. With adopted plans, there's three adopted plans pertaining to the site plan blueprint, Denver and the West Colfax plan.'",
        "'speaker_4': 'For the current plan, there's a number of strategies which support the rezoning, speaking to promoting infill development, increasing a diverse range of housing types, promoting infill development along with promoting transit oriented development, providing mixed income housing, especially along transit lines as well.'",
        "'speaker_4': 'CBD finds that this rezoning is consistent with the current plan. Moving on to Blueprint Denver the land use concept for the site is urban residential. Urban residential is a higher density primary residential land use with mid to high rise structures providing a mixture of housing types.'",
        "'speaker_4': 'It's also designated an area of change in Blueprint. Denver Areas of change are where we like to channel growth within the city in order to improve access to jobs, housing and services providing fewer and shorter auto trips. This application is consistent with the Blueprint Denver land use concept in terms of street classification.'",
        "'speaker_4': 'Knox Court is a residential collector. 13th and King Street are both on destiny local streets. Through this sudden here. This speaks to the recently completed two D strategic plan for the city. The Knox court station is identified as a urban station.'",
        "'speaker_4': 'In our 2D typology, urban stations are provide some small scale, mid-rise multi-family residential in nature with consistent moderate setbacks and a balance of pedestrian bike and vehicle use. This is done to reflect the kind of really neighborhood focus of the Knox Court and Paris stations there.'",
        "'speaker_4': 'They serve as walk up stations, not necessarily the highest intensity, highest density, two d that you see at some of our urban centers. Moving on to the West Colfax Neighborhood Plan, which was adopted in 2005. On this map here, you can see that the subject site has been designated.'",
        "'speaker_4': 'Urban residents are an urban neighborhood station. Land use. The urban neighborhood station district is a variable, compact and dense development pattern. Typically 1 to 5 stories of single family and multifamily residential uses. Development is encouraged to make to take into account for underutilized parcels and dated and declining properties.'",
        "'speaker_4': 'Some more significant and welcome redevelopment may occur, adding small and medium scale apartments or condo buildings in close proximity to the station area. CPD finds that this rezoning is consistent with the current plan 2000 Blueprint Denver and the West Colfax Neighborhood Plan for the next two review criteria Uniformity of district regulations and Furthering the public health, safety'",
        "'speaker_4': 'and welfare have also been met due to the adopt or the furthering of the city's adopted city plans. Moving on to justified circumstances of the land or its surrounding environs has changed or is changing to such a degree that is in the public interest to encourage a redevelopment of the area to recognize the changed or changed character'",
        "'speaker_4': 'of the area. Some of those indicators of change or the area of change plan, direction and blueprint. Denver The adoption of the West Colfax Plan, the opening of the West Rail Line, along with just general increased development activity along our transit corridors.'",
        "'speaker_4': 'The last review criteria consistency with the neighborhood context zone, district purpose and intent. In terms of neighborhood context, the general urban neighborhood context is made up of multi-unit buildings, primarily residential uses in a variety of building forms, moderate to high scale residential buildings, and a balance of of pedestrian bicycle and vehicle mobility.'",
        "'speaker_4': 'CBRE finds that this rezoning is consistent in that neighborhood context. Moving on to zoned district purpose in intent. The purpose and intent of this in district is to promote and protect higher density residential neighborhoods, promote safe and active, pedestrian scaled residential areas, and allowing for a multi-unit district with a variety of residential building forms.'",
        "'speaker_4': 'With that, CPD recommends approval based on funding. All of the review criteria have been met. We also have the applicants here today who can answer any questions. Thank you.'",
        "'speaker_5': 'Thank you. We have five speakers tonight. The first one is Turnell Curtis. Second is Richard Taaffe, Cindy Harvey, Adam Kantor and Carol McLennan.'",
        "'speaker_1': 'Madam President, pro tem council members, thank you for your time on a nice late night. I'm Terrell Curtis. I'm a resident of East Hill in Denver, and I'm the executive director at the Dolores Project. We are the property owner in question.'",
        "'speaker_1': 'We are seeking the rezone in order to fit, as the staff report showed, fit within the context of newer zoning plans that Council has adopted. It also facilitates future redevelopment of our site that I can answer more questions about if that's of interest.'",
        "'speaker_1': 'But we are eager to be able to preserve affordable housing in this very quickly changing neighborhood in West Colfax, and also to remain in context with the existing neighborhood of multi-family housing, affordable housing and especially very low income housing.'",
        "'speaker_1': 'We do seek we will be seeking to redevelop our site in order to add a multi multi income housing, particularly 0 to 30% AMI housing that will be permanent supportive housing for people who've been chronically homeless with a disability, as well as units of workforce housing at 40 to 50% ami.'",
        "'speaker_1': 'With that. I'll leave it at that. I suspect there may be questions and I'm here.'",
        "'speaker_5': 'All right. Thank you, Richard Taft.'",
        "'speaker_0': 'Madam President Pro-Tem. Council members, thank you for your time. My comments are very brief. I'm Dick Taft. I'm president of Rocky Mountain Communities. We're a nonprofit, affordable housing organization in the city of Denver. We provide affordable housing for families across the state of Colorado.'",
        "'speaker_0': 'We are very happy to be in this partnership with the Dolores project because it affords us the opportunity to provide a continuum of affordable housing at a site that is a TOD site right on the Knox Court station.'",
        "'speaker_0': 'It includes replacement of shelter beds. It includes inclusion, a development of new 35 units of permanent supportive housing, and takes 27 units of affordable housing and turns them into another 75 units. So. We're very happy to do this because this is the type of project that is of scale for affordable housing that this city and this and'",
        "'speaker_0': 'frankly, the state of Colorado so desperately needs.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'Thank you, Cindy. Harvey.'",
        "'speaker_1': 'Thank you, council members. My name is Cindy Harvey. I'm with Kepler Community Planning Architecture. We're the architecture and planning firm for our applicants, and I'm here to answer any questions. I'll just put this brief. Thank you.'",
        "'speaker_5': 'Adam. Cantor.'",
        "'speaker_4': 'My name is Adam Cantor. I'm also with Gephardt, and I'm just here to answer questions.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_10': 'Adam.'",
        "'speaker_5': 'And our final speaker is Carol McLennan.'",
        "'speaker_6': 'Good evening, members of council. My name is Carol McLennan. I'm a Park Hill resident, but I'm also a property owner in the West Colfax neighborhood and our member of the Land Use Committee for the West Colfax Association of Neighbors.'",
        "'speaker_6': 'And I'm here tonight to express we can support for this project. As you know, we have sent a letter of support, but I wanted to let you know that the applicants provided a presentation to our general membership in April before the Planning Board hearing and.'",
        "'speaker_1': 'Unanimously voted to support this project. As you know, we.'",
        "'speaker_6': 'Can is very strongly supportive.'",
        "'speaker_1': 'Of a healthy, safe and sustainable.'",
        "'speaker_6': 'Neighborhood. And we felt this is very important to support our current neighbors. Who are the applicants in doing this work to keep our neighborhood very diverse?'",
        "'speaker_1': 'We hope you support it. Thank you.'",
        "'speaker_5': 'Thank you. That concludes our speakers. Are there questions from members of council? Councilwoman Shepherd.'",
        "'speaker_1': 'Yeah. So, applicants, I want to give you a chance to tell your story a little bit better. I think it was a little bit piecemeal there and a little bit difficult to understand. So I think one question that folks might have is whether the shelter continues to operate and then exactly how many how many units are being'",
        "'speaker_1': 'built and what is the breakdown between permanent supportive housing and the low income housing? And I think it would be also good to explain any relationship between the shelter and the other housing units. Yep. Thank you. Absolutely. The shelter will continue operating.'",
        "'speaker_1': 'The Dolores project has operated on this site for eight and a half years, providing shelter every night for at least 50 unaccompanied women and transgendered individuals. In the wintertime, that number does go up to 60 or 65 in total to accommodate the need during cold weather.'",
        "'speaker_1': 'The need certainly hasn't diminished in the last eight and a half years. We don't see it going away in the next several years that it will take to get this project off the ground. And so it is absolutely an essential component that the shelter continue operating.'",
        "'speaker_1': 'In the initial site planning, we've been able to develop a plan in which the shelter can actually continue in place during construction of a new shelter building that will include 35 units of permanent supportive housing above it. So those are housing units for 0 to 30% AMI for people who've been formerly homeless with a disability.'",
        "'speaker_1': 'The Delores Project would be providing the ongoing supportive services for those residents. In addition, we are we're maintaining independent ownership of our properties. But with the adjacent property of Rocky Mountain communities, we will be joining the land use and creating 75 units of affordable housing at 40 to 50% ami.'",
        "'speaker_1': 'One more question I think I missed. So just to connect all the dots, is this permanent supported, supportive housing for the clients of the shelter or is that open more broadly? It will definitely be open more broadly. I mean, we probably couldn't fill all 35.'",
        "'speaker_1': 'Right off the bat. But we the Dolores project is and always has been a very collaborative model and we're very much a part of the continuum of care with other shelter providers and homeless service providers. So we would be doing outreach to our provider network to ensure that those units are filled regularly with people in need.'",
        "'speaker_1': 'Wonderful. Thank you.'",
        "'speaker_5': 'Thank you. Council winner take care. Would you be able to identify whether or not there will be a change in the number of shelter beds?'",
        "'speaker_1': 'Mm. We don't intend to change the number of shelter beds given our model of service. There certainly has been interest in increasing the number of shelter beds. Given our model of service. Increasing above 50 is we don't feel we can provide effective services above that.'",
        "'speaker_5': 'And with the staffing that you currently have, you'll be serving more people that will be in the housing units. Support units.'",
        "'speaker_1': 'Yeah, we'd be adding staffing. There will absolutely be at least one case management position added, probably another layer of program direction, and will be partnering with Rocky Mountain communities for the property management, which is an essential part of permanent supportive housing.'",
        "'speaker_5': 'Very essential. Can you speak to whether or not low income housing tax credits have been committed to the project yet? Have you? Not yet.'",
        "'speaker_1': 'Application We submitted an application for 4% bond credits and the state tax credits that we did not get allocated at this round. We anticipate going back again in January. We've got and really very clear and very positive feedback from Schaefer.'",
        "'speaker_1': 'So we're restructuring the project somewhat to address those needs, and we'll be going back in January or when those when that application to open again.'",
        "'speaker_5': 'Good luck with that. Thank you. Madam President, I just want to make one comment. I wish that that Tesco was here to see that we're actually working to support a project that does serve the population that he often speaks about.'",
        "'speaker_1': 'And we had the same conversation back here. Thanks.'",
        "'speaker_5': 'Thank you, Councilman Ortega. Councilman fights. I saw your name and then it disappeared. Did you have a comment?'",
        "'speaker_10': 'Councilman Shepherd. Councilwoman Sheperd asked my question.'",
        "'speaker_5': 'Okay. Thank you. Are there other comments? Those are questions de none. The public hearing is closed. Comments by members of council. Councilwoman Shephard.'",
        "'speaker_1': 'Thank you, Madam President. Pro Tem. I'm very excited to support this project and I'm very glad to be able to say that I'm a big fan of both of these organizations and both of these leaders, and I'm really a fan of the work that you do for our community.'",
        "'speaker_1': 'And this is exactly what we need to be doing here. And. I'm glad that we're going to be able to provide the services for the sheltered women and then permanent supportive housing, as well as the low income units that are needed here.'",
        "'speaker_1': 'And I know that we have the right leadership and this zoning is very appropriate. And having been a fan of Delores Project for such a long time and having been in their building on multiple occasions, I can definitely speak to the need to upgrade the facilities because there's really important work happening there and I think you need'",
        "'speaker_1': 'a little bit more space. So and then of course, this is great that it's on the and I don't know why I'm so emotional, but this is important work and I'm really happy that it's on the light rail.'",
        "'speaker_1': 'I mean, like immediately adjacent to the light rail. I mean, you can literally I mean, I don't even know if it's like 100 steps or whatever from the front door currently, but it's it's right there. And so that is often been a difficulty, I think in our shelter system is how clients can actually access these things.'",
        "'speaker_1': 'So now we have to figure out, you know, how to get affordable fares for them so that they can actually come to the facilities. Because often people are coming from downtown and it's you know, as long as I've lived on the west side of our city, there's so many physical, literal, physical barriers to being able to get'",
        "'speaker_1': 'there from the downtown area. And I think it's a testament to how great the work is and how well you work with the community, that there's no opposition from the community. And this is an area of change and this is exactly where we should be building this type of facilities.'",
        "'speaker_1': 'And it's also been designated in our work with the inclusionary housing ordinance as a high need area for for our most vulnerable citizens. So I really do wish Mr. Tech was here tonight to hear this. So I'm an enthusiastic support, and I would hope that all my colleagues are as well.'",
        "'speaker_5': 'Thank you. Councilman Shepard. Councilwoman Ortega. Well, first, I want to thank Councilwoman Sheppard for her heartfelt comments. I was at the Denver Department of Human Services when this particular building was put out to bid for the use of a shelter.'",
        "'speaker_5': 'I wish there was a way in this process we would have been able to keep the location undisclosed because of the nature of the work that you do and the protection that is always at the forefront of ensuring that women's lives are being protected, that you all serve day in and day out.'",
        "'speaker_5': 'That being said, I. I'm pleased to support this. And the need is so great not just for the 0 to 30, but also for the 40 and 50% of the RMI that's been targeted to be served as well.'",
        "'speaker_5': 'And if I can write a letter of support to accommodate your request that goes into Shaffer, please let me know. Because, you know, those dollars are absolutely critical to low income housing projects. And like Councilwoman Shepherd, I enthusiastically support this moving forward and wish that we could have more and more of these across the city because the'",
        "'speaker_5': 'need is so great. Thank you for the work that you do. Thank you. President Ortega. Councilwoman Kennish.'",
        "'speaker_1': 'Thank you, Madam President. For the applicants, I think that what stands out is the innovation of this proposal and really thinking creatively beyond silos and really thinking creatively about the ways to maximize very scarce, very difficult dollars and to come up with a concept and to not be afraid to take on a zoning request, which we know'",
        "'speaker_1': 'is costly and very expensive. So and you know, the staff very thorough report in terms of how this fits into the neighborhood context. So I appreciate that. I thought it was really important, though. I so appreciated the West Colfax neighborhood representative Carolyn being here because I as an At-Large member, I try to go to as many meetings'",
        "'speaker_1': 'as possible about the siting of affordable housing and homeless housing. And I get asked from, you know, every single neighborhood, why us? Why is every service in our neighborhood? And there's so much concentration. And it's funny because there are seven or eight different neighborhoods who all think they are unique.'",
        "'speaker_1': 'And and it's it's very interesting to me because this area, as you showed in the map, isn't just a shelter provider. It's a public housing provider. And quite a few units spread across numerous buildings. We're not just talking about one building.'",
        "'speaker_1': 'You have not. And two, if I if I remember correctly, there are two separate nonprofit providers, then Rocky Mountain, and then there's another is Del Norte. Or I forget who the other owner is, but I don't know of any other part of the city that has quite that concentration of providers, you know, probably two or three block'",
        "'speaker_1': 'area. And yet we not only don't have a neighborhood full of opposition, we have a neighborhood with enthusiastic, unanimous support, which says a lot about this community and it says a lot about the way that these providers have clearly interacted with that community.'",
        "'speaker_1': 'And so I'm proud I'm proud to live in a city where there is a community and a group of housing providers where, you know, we may not, in retrospect, have wanted to concentrate people in that same way. Right.'",
        "'speaker_1': 'We probably would have built it a little more diversely from day one if we were starting over. But in spite of that, you know, lack of foresight 50, 40, 38 years ago, we are continuing to move forward with this commitment in the face of what we know.'",
        "'speaker_1': 'I mean, this is the thing about the map that Councilwoman Sheperd mentioned about the inclusionary housing ordinance. People are shocked when they hear that this is a high need area, but it's because of the gentrification that will come with the transit.'",
        "'speaker_1': 'And so that's why, especially those 40 and 50% of Army units are so important. So I feel very proud. I feel very proud of this community for achieving this approach, a very practical approach to a very human challenge of poverty and needs.'",
        "'speaker_1': 'So with that, it's a land use decision we make today. But just like I said before, right, infrastructure and land use pave the way for how people live their lives and whether they're included or whether they're not. So with that, I'm going to be supporting this tonight and I want to thank the neighborhood for coming out as'",
        "'speaker_1': 'well as the providers. Thank you.'",
        "'speaker_5': 'Thank you. Madam Secretary, roll call on Council Bill 212.'",
        "'speaker_6': 'Can each layman I? Nevitt Hi.'",
        "'speaker_5': 'Ortega Absolutely.'",
        "'speaker_6': 'Rob Shepherd I Susman I.'",
        "'speaker_1': 'Brooks I thought.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_5': 'I. Madam Secretary, close the voting and announce the results. Ten Eyes and Eyes Council Bill 212 has passed. Congratulations. On Monday, June eight, there will be a required public hearing on Council Bill 302 approving an amended and restated Ironworks Foundry Urban Redevelopment Plan.'",
        "'speaker_5': 'On Monday, June 22nd, there will be a required public hearing on Council Bill 312 approving a text amendment to the Denver Zoning Code creating the Scottish Village Conservation Overlay, a required public hearing on Council Bill 313, changing the zoning classification for multiple properties, roughly bounded by 32nd Avenue, Clay Street, Dunkeld Place and Zuni Street.'",
        "'speaker_5': 'A required public hearing on Council Bill 319. Approving a text amendment to the zoning code creating the Potter Highland Conservation Overlay. A required public hearing on Council Bill 321. Changing the zoning classification for multiple properties, roughly bounded by 38th Avenue, Federal Boulevard, 32nd Avenue and Zuni Street.'",
        "'speaker_5': 'A required public hearing on Council Bill 322 approving a text amendment to the Denver zoning code, creating the side interior setback design overlay a required public hearing on Council Bill 323 Changing the zoning classification for multiple properties in the Highland Statistical neighborhood.'",
        "'speaker_5': 'A required public hearing on Council Bill 324 approving a text amendment to the Denver Zoning Code, creating a new zoning district, the Campus National Western Center and a required public hearing on Council Bill 325. Changing the zoning classification for certain properties within the National Western Center campus located in North Denver in the Elyria neighborhood.'",
        "'speaker_5': 'Any protests against Council Bill 313 321, 323 or 325 must be filed with the council offices no later than Monday, June 15th. On Monday, June 29th, there will be a required public hearing on Council Bill 345, changing the zoning classification for approximately 99 Quebec Street.'",
        "'speaker_5': 'Any protests against Council Bill 345 must be filed with the Council offices no later than June 22nd. See no other business before this body? This meeting is adjourned.'",
        "'speaker_0': 'Denver eight on TV and online to stay connected to your community, your city, your source.'",
        "'speaker_1': 'You are watching Denver. Eight TV's Your City, your source. And what?'"
    ]
}