{
    "Third Amendatory Agreement with Integral Recoveries, Inc. for Collections Services.": [
        "'speaker_1': 'No items have been called out under bills for final consideration. No items have been called out under pending. No items have been called out. Madam Secretary, please. But the first item on our screens. Councilmember Black, please put Resolution 278 on the floor for adoption.'",
        "'speaker_4': 'I move that resolution 20 2-0278 be adopted.'",
        "'speaker_1': 'It has been moved and seconded questions or comments by members of council. I do have my own comments first. And soon there's no one else in the queue. I will go ahead and ask those. Kristen Wood from different courts.'",
        "'speaker_1': 'I know you're here to answer questions. If you'd like to respond to these points afterwards, feel free. Okay. So this particular bill to 78 was proposing to begin a process of sending debts owed under $300 in Denver court to collections agent that we currently use into role forgive me, integral recoveries.'",
        "'speaker_1': 'I appreciate Ms. word your responsiveness to all of the questions and I asked a lot after the last meeting, but I remain concerned about how the contract would perpetuate or exacerbate poverty in Denver nationally. Fines and fees disproportionately burden low income people and people of color and make it harder for low income folks to afford basic services'",
        "'speaker_1': 'and goods. But I think there's still an opportunity before creating a new category of collections referral for us to ensure we have a full picture of who's impacted and what the consequences can be, and if there are more innovative and just ways of addressing fees and fines owned.'",
        "'speaker_1': 'My areas of concern were that there hadn't been an equity assessment done to identify, benefit and burden scenarios that I didn't know based on the responses. How many cases or what proportion are actually referred to integral for collections?'",
        "'speaker_1': 'And although fees can be waived for those who are found indigent, it's an onerous process that not everyone had the resources to know how to navigate. As an FBI, the Office of Financial Empowerment in the City is currently applying to join a cohort for cities and counties for Find and Fee Justice Leadership Network.'",
        "'speaker_1': 'Denver would join nine other jurisdictions in advancing fee and find policy reform, including Seattle, Sacramento, Philadelphia and Dallas. Given this, I think it would be a prime opportunity to allow the Court's time in the Office of Financial Empowerment to come together and address unanswered questions and create a more robust proposal.'",
        "'speaker_1': 'So I will be voting no this evening. Councilwoman Ortega.'",
        "'speaker_5': 'You, Madam Chair. No.'",
        "'speaker_2': 'I didn't want to be in.'",
        "'speaker_1': 'You. Is your mike on, Councilwoman?'",
        "'speaker_6': 'Can you hear me now? Yes. Okay, that's better. Sorry.'",
        "'speaker_1': 'Can you repeat your question?'",
        "'speaker_6': 'Yes. My question was whether or not this is one of the contracts that came through the Crime Prevention and Control Commission.'",
        "'speaker_4': 'Not that I'm aware of. It's been the court.'",
        "'speaker_6': 'Can you pull the mic down, please, and introduce yourself?'",
        "'speaker_4': 'Kristin Wood, Court Administrator for Denver County Court. And to my knowledge, this contract since my time as court administrator, which is February of 2020, has come through twice before council and it was on the courts, whether it was originally part of the CP.'",
        "'speaker_4': 'CC we've had this contract since 2009. To my knowledge it did not, but I could confirm that if needed.'",
        "'speaker_6': 'Okay. I just as as a seated member of that body, I don't remember this one coming through and just wanted to clarify if it is CPUC funded or if it comes out of the general fund for the courts.'",
        "'speaker_4': 'There is no associated funding with this contract. The city does not pay anything on the front end for this contract.'",
        "'speaker_6': 'So it's revenue generated from the referrals? Correct. Okay. Got it. Okay. Thank you. I don't have any further questions.'",
        "'speaker_1': 'Thank you. And we've got Councilwoman Black.'",
        "'speaker_4': 'Thank you. I read all of the answers that you sent over, so thank you. And then, councilman. Torres an email not too long ago, but. If this bill fails, what does that mean for in its managing the courts?'",
        "'speaker_4': 'Sure. In its current form, we are expanding the scope to include collections under $300, but it also extends the term of the contract for collections in its entirety. So if this bill fails, it would terminate all collection efforts across the board, even for amounts.'",
        "'speaker_1': 'Mr. Bailey.'",
        "'speaker_4': '$300. And so if that were the case, I would inquire as to whether or not it would be reasonable to proceed with an amended contract to exclude that expansion or if it was reflective of a failure on collections in its entirety.'",
        "'speaker_4': 'And Councilwoman Torres mentioned this. Cities and counties, fines and fees, workgroup or something. Are you aware of that? The Office of Financial? Yeah. I am not aware of that office. I did correspond with Councilwoman Torres after she sent the email and stated that we would be happy to participate in any study with respect to data that would'",
        "'speaker_4': 'assist them in their in their assessment with respect to impact. With respect to court customers and how that office could potentially benefit them. We are also happy to provide resource referrals and are you aware of other cities that are eliminating these kinds of fines?'",
        "'speaker_4': 'I know that there are ongoing studies with respect to fees and fines the state courts in Colorado currently use. I believe there's three different vendors for delinquent accounts where fees and fines are owed with respect to our assessment as a court.'",
        "'speaker_4': 'It's all defined in statute and ordinance. So any efforts with respect to a study or perhaps reducing or eliminating certain fees and costs, I'm not a part of that are aware of that currently. So if it was the desire of City Council or the Office of Financial Empowerment to eliminate these fines would require changing state statute as'",
        "'speaker_4': 'well as as part of it. As Denver County Court is a hybrid model of state cases and municipal cases. And so with respect to any type of amendment to what is currently defined, an ordinance would not impact state fees and fines on those types of offenses.'",
        "'speaker_4': 'And so just to clarify, this bill would continue the contract of collecting fees and fines over 300 and then add the additional task of collecting under $300. That's correct. And so, Councilwoman Torres, is your issue with the fines that are less than $300 or all fines?'",
        "'speaker_1': 'I would say all fines, but I think the original issue was with those under 300 initially as a new category that we would be sending to collections.'",
        "'speaker_4': 'And so is your desire to completely stop collections while the Office of Financial Empowerment participates in this program and then go on to change state statute?'",
        "'speaker_1': 'Well, no, not state statute. I think the Leadership Network for the Office of Financial Empowerment, those cities don't just outright eliminate fees and fines. They assess which ones could potentially be unnecessary, overly burdensome. They do an assessment. It's basically what they do.'",
        "'speaker_1': 'So it isn't a proposal to eliminate everything, but it is a proposal to involve them in a conversation to have about what an appropriate evolution of sending fees and fines to collections could or should look like.'",
        "'speaker_4': 'And I'm sorry I have so many questions, but a lot of the information I just got a couple hours ago, but. So all of the money that's collected goes into the general fund that doesn't fund the courts, is that correct?'",
        "'speaker_4': 'All the the fight, the fines, as Councilwoman Torres pointed out, are punitive in nature for the offense. So some of the the cases that are brought before the court, the only type of punitive outcome they would be, jailable offenses or probationary eligible offenses would be a fine.'",
        "'speaker_4': 'Other types of surcharges or cost generally go back to the general form or are dispersed out to other agencies for programs, for instance, the drug offender surcharge, a portion of those those costs go back to awareness, education, treatment and are targeted in that in that regard.'",
        "'speaker_4': 'Okay. I have one final question. Councilman Torres in an email said that people are prevented from renewing their driver's license if they don't pay the fees. I didn't think that was true. Is that true at present time? The there are no driver's licenses that are suspended for nonpayment.'",
        "'speaker_4': 'There was an outstanding judgment warrant fee that was previously ordered by the court, which, if left unpaid, the DMV could administratively suspend a driver's license. That was since repeal of last legislative session in the in the state. Okay.'",
        "'speaker_4': 'So that is not that's not an issue. So what if someone owed $147? What you said was the average. What if they never pay the. They're usually purged from the system with respect to collection efforts. Honestly, they're not reported to a credit bureau, and they're certainly not going to be they're not going to receive a higher punitive'",
        "'speaker_4': 'sentence than that. Fine. With respect to previously going back ten, 15 years, they used to jail people on failure to comply and warrants. And that obviously is not something that is going to serve either a punishment or a rehabilitation effort in any regard.'",
        "'speaker_4': 'And it doesn't harm someone's credit if we do not report to the credit bureaus. Okay. Thank you. You're welcome.'",
        "'speaker_1': 'Thank you, Councilman Cashman.'",
        "'speaker_7': 'Thank you, Madam President. Pro tem. This is to extend the contract with integral for two years, correct? For an end date of February one, 2024, so that this contract end February one of 2022. Are we out of contract?'",
        "'speaker_4': 'You're correct.'",
        "'speaker_7': 'So are they not doing collections?'",
        "'speaker_4': 'They're currently doing collections.'",
        "'speaker_7': 'So if we vote this down does not mean all of a sudden collection stop.'",
        "'speaker_4': 'That means we would have to go back to take over. Right. Draw that. Those efforts. Yes.'",
        "'speaker_7': 'Right. And so would you guess from since they've continued. That we'd had some time to work out, that they'll continue to collect because they make money. And we will then address you will then address a new contract provision to keep them going for some length of time.'",
        "'speaker_4': 'I guess I think that's the important thing of understanding, whether it's a $300 threshold or collections in its entirety. If it if we were revamping the contract simply to extend the terms, if that was something palatable, then we could certainly do that.'",
        "'speaker_4': 'Are the reason for expanding it is because we've always collected on delinquent accounts and didn't have a definitive threshold in which we did it right. It was a programing effort in 2020 that we undertook to revamp our collections process with integral.'",
        "'speaker_7': 'So in the past. They collected all dollar amounts. Correct. Only since 2020 was the three. Were the 300 and below left out.'",
        "'speaker_4': 'Correct.'",
        "'speaker_7': 'Okay. Thank you. Welcome.'",
        "'speaker_1': 'Thank you. Thank you. I'd like to welcome Councilmember Herndon to the meeting. Councilwoman Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. Pro tem. Thank you for that information. Just a quick clarifying question and I apologize. I read through the email that you sent, but I don't recall seeing this in there. How was the $300 threshold arrived at?'",
        "'speaker_4': 'So in in city ordinance, there is a flat rate that is assessed depending on the amount owed on the case, $300 and less is a percentage of the balance of what is owed, which took extensive programing efforts by our I.T. department and integral in the interface that we use.'",
        "'speaker_4': 'And so we decided to hold off on doing that in an effort to revamp our collections process, which we originally revamped it as part of a budget reduction process because the city used to advance an allocation for us to pay integral, to do the collections, to then recover it and recoup it once the costs were paid.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'So if we are no longer jailing people who are not paying this fine and we're currently not collecting on anything under $300, have we done any sort of I know that there wasn't any sort of impact analysis done, but are we sure that that $300 threshold, let's say the conversation was on the table, that we were considering'",
        "'speaker_3': 'no fines at all or some sort of different level of fines, recognizing that there is a an impact to particularly, you know, a lower income or no income group of people when it comes to those fines. Have we?'",
        "'speaker_3': 'Are we sure $300 is the right number? Have we studied kind of the specifics around that at all?'",
        "'speaker_4': 'Yeah, but the the court, in all honesty, has not done a study with respect to fines and costs. Our role is simply to assess them based on the offense and what's defined in statute in the ordinance. So an equity study of those cases that owe 300 or less has not been evaluated.'",
        "'speaker_3': 'Okay. And so that is something that potentially maybe this is a question for Council President Pro Tem Torres is something that potentially the Office of Financial Empowerment could then do to provide more information on whether that $300 threshold is the right way to go.'",
        "'speaker_3': 'Okay, great. Thank you. Thanks for your thanks for your interest.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Thank you, Councilwoman. So your Councilmember Black, your backup. Okay. I'll go to Councilman Flynn.'",
        "'speaker_2': 'Thank you, Brian, for your time. Christian. First of all, could you pull the mike down a little closer? Yeah. Okay. Thank you. In your response to the questions from last week, there were two things I want to make sure I understand.'",
        "'speaker_2': 'Unpaid fines and fees from court judgments are you said, are not reported to credit rating agencies, credit bureaus.'",
        "'speaker_4': 'They are not.'",
        "'speaker_2': 'That is true. That is true. So the fact that someone in this category would be subject to collection by integral would not become part of their their credit record.'",
        "'speaker_4': 'Correct.'",
        "'speaker_2': 'And then the other thing that I was trying to clarify was about driver's license. Correct. And you said that Colorado statutes were changed so that fines and unpaid fines and fees no longer result in an inability to renew your license.'",
        "'speaker_2': 'Or is that not true? They won't suspend the license. But can you renew a driver's license if you have unpaid court costs and fees?'",
        "'speaker_4': 'Not that I'm aware of. No, sir. It was only on outstanding. If you owed an outstanding judgment warrant fee with the DMV, that is what allowed them to administratively suspend a license and what they require payment of in order to renew it.'",
        "'speaker_4': 'Those are no longer assessed cases.'",
        "'speaker_2': 'So you can renew a driver's license if you owe, even if you are. On the list here being pursued by integral to pay court fees. Some find you can still renew your license.'",
        "'speaker_4': 'From the date the legislation passed when that legislation became effective. Yes. Four cases that occurred prior to that date. No.'",
        "'speaker_2': 'Right. Okay. And what was that? What was the year? What was the session?'",
        "'speaker_4': 'It was last year. Legislative session.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'You're welcome.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_6': 'I think I'm on. Yes. Okay. So I just want to kind of probe a little further into this. You made mention about the state courts and in the role that the courts have in being able to impose a fine.'",
        "'speaker_6': 'How does that differ from this contract?'",
        "'speaker_4': 'It doesn't.'",
        "'speaker_6': 'Okay. So that's.'",
        "'speaker_4': 'Any any cases that are within county court's jurisdiction, which could include a felony case that has been pled down, a misdemeanor case, which is a state level misdemeanor or a municipal.'",
        "'speaker_6': 'Okay. So I want to ask first of all, what is the annual amount generally that is collected that comes back to the city?'",
        "'speaker_4': 'Uh, I can run that information for you. I can tell you in traffic. It is generally around $13 million. Okay for criminal cases with respect to fines, fees and costs, the fines, I would have to run a query to find out the annual average amount on those cases.'",
        "'speaker_6': 'So if we did not pass this tonight, any of the people that are in the process of. Gathering together the amount of money they owe on their fees, what what happens to them versus new people that come to the door from the time.'",
        "'speaker_6': 'If if this doesn't go forward.'",
        "'speaker_4': 'So we have collections investigators on staff who work with individuals. I think when you look at fines and fees and costs that are imposed overall. Part of that is also restitution. Right.'",
        "'speaker_6': 'I'm going to ask you about that.'",
        "'speaker_4': 'That part of that is restitution. The fines, fees and costs. If an individual is found indigent at the time of sentencing, those fines, fees and costs are or can be waived based upon a finding of indigency. Our collection staff work with individuals to establish a payment plan so that someone can make a good faith monthly payment.'",
        "'speaker_4': 'Even if that is a very nominal amount. It's only when they're in noncompliance do those cases get referred to collections. And I believe that is after 90 days when an account is no longer responsive to our collections department that works with the courts.'",
        "'speaker_4': 'We have three collections staff that that currently work with individuals who have open accounts with the court.'",
        "'speaker_6': 'And help me understand, is this the only collection contract the courts have or are there others right now?'",
        "'speaker_4': 'Denver County Court only has this one collections contract.'",
        "'speaker_6': 'Okay, so if this fails to pass, then all fees that are collected from restitution to traffic fees, etc., etc. all would just come to a halt. Is that correct?'",
        "'speaker_4': 'With integral recoveries? Yes.'",
        "'speaker_6': 'Okay. Well, since they're the only one collecting.'",
        "'speaker_4': 'We do have three internal staff that work with individuals, but not on delinquent accounts.'",
        "'speaker_6': 'So those collections will still continue with staff, but not with this contract.'",
        "'speaker_4': 'Right.'",
        "'speaker_6': 'So what's the percentage difference between what staff generates versus what? This company generates in terms of the outreach to the folks that meet that 90 day collection.'",
        "'speaker_4': 'And I would have to get the information for internal or internal collection staff. I have the information provided to you by integral recoveries. I think they have over the period of of five years, I think 149,000 cases that have been referred to them with an amount of, I believe it was somewhere around $12 million.'",
        "'speaker_4': 'With respect to our current ongoing with those that are at our engaging and and meeting their established monthly payment plan, I can certainly query that information for you.'",
        "'speaker_6': 'Okay. Madam President, pro tem, I'm a little concerned about if council votes this down tonight, not having sort of an interim plan. I think it is important that the Office of Financial Empowerment can look at this and help us, and I would hope that it's looking at all our fines and fees.'",
        "'speaker_6': 'I have a list going back to I want to say 2011, looking at all the fees that we've collected over time. But I would hope that it's not solely limited to the courts so that we have a way to look at over time which fees or fines have continued to increase and are they disproportionately impacting various segments'",
        "'speaker_6': 'of our community? And I think that could then inform how we then move forward with this particular contract. What I don't know is if the two years is a one year contract with a one year renewal. Is that how it's written?'",
        "'speaker_4': 'We're asking for a two year contract so that we can continue our programing efforts to expand to this under $300 amount, which will take some ramp up time.'",
        "'speaker_6': 'Okay. Thank you. Thank you, Madam President. Pro tem.'",
        "'speaker_1': 'Thank you, Councilwoman Black.'",
        "'speaker_4': 'Thank you. So I did have the same question as Councilwoman Ortiz about what percentage is delinquent versus those that are paid on time. And you were also talking about restitution. So that's restitution to victims of crime, correct? Is that correct?'",
        "'speaker_4': 'And the other penalties you mentioned that they were there were penalties instead of someone going to jail. They are part of the original sentencing disposition on a case, and those vary by the offense level. Some do qualify for probation.'",
        "'speaker_4': 'Some might face a period of time in jail. Other individuals, the only punitive like a traffic ticket, would be a fine and court costs. That would not be a jailable offense or a probation eligible offense. That is, several municipal municipal offenses also include those where a cost is the actual punitive outcome for disposition in the case.'",
        "'speaker_4': 'All right. And Councilwoman Torres, I guess this question is for you. If if this bill either passes or fails. Is your intent to work toward and I think you already said this I was clarifying not to totally eliminate fines and, you know, restitution to victims, but to assess people's ability to pay.'",
        "'speaker_1': 'Yeah, absolutely. Thank you for that question. And I think what's important to note is that this is happening around the country where municipalities are assessing what's the status and why are we assessing particular fines and fees. We just have the courts in front of us today, and that's why I think your fines and fees are before us'",
        "'speaker_1': '. But the Office of Financial Empowerment would be doing this as a citywide assessment.'",
        "'speaker_4': 'And so but if a judge is determining what a penalty is, what gets what?'",
        "'speaker_1': 'I get where you're going. This would not supersede judicial recommendations. Fees for restitution. This may be just looking at what are we charging as the city for administrative process. I couldn't tell you for sure because they're not part of the cohort yet.'",
        "'speaker_1': 'And I think that's part of the difficulty here, is that what we're asking about and what's being proposed isn't quite matching up or fully understanding one another. And that's why I feel like this component of the 300 and under proportion just isn't ready for approval.'",
        "'speaker_4': 'Okay. Thank you. I think whether it passes or not, I think. You and the Office of Financial Empowerment and Others Council woman are taking me to this too. Are interested in really taking a look at fines. And their appropriateness, whether this passes or not?'",
        "'speaker_5': 'Yeah, absolutely. Okay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Hines.'",
        "'speaker_2': 'Thank you, Madam President. Pro tem, I I'm wrestling with something that Councilmember Ortega mentioned. I think Councilmember Black mentioned it as well, just about the, um, the extension and whether yet, you know, whether we could do a contract extension.'",
        "'speaker_2': 'I mean, I guess what I'm thinking we can only deal with what's presented to us and, and the courts are presenting to us a contract extension for something that's already expired. So in some ways, we're. We're we're working with something that is already doesn't have a contingency.'",
        "'speaker_2': 'So I recognize it's not ideal to not have contingency. We're kind of where we are now with no contingency either way. So tonight we can either vote yes or no. We can't amend it. So at this point, I am I agree with Councilmember Torres.'",
        "'speaker_2': 'I will vote no. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Hines. Councilwoman CdeBaca. Your mike, please. Can you hear me?'",
        "'speaker_4': 'Thank you. Not a question, but just a comment for my colleagues. If you recall the Reimagining Policing Report under strategy two, which was minimizing unnecessary interaction of law enforcement and the criminal legal system.'",
        "'speaker_1': 'With the community.'",
        "'speaker_4': 'This is one of the strategies that was.'",
        "'speaker_1': 'Called out as a.'",
        "'speaker_4': 'Recommendation from community to partake in this process.'",
        "'speaker_5': 'That Councilwoman Torres is talking about.'",
        "'speaker_4': 'And to make sure that we're absolutely not pursuing people for.'",
        "'speaker_5': 'Fines.'",
        "'speaker_4': 'Especially below.'",
        "'speaker_5': 'The $300.'",
        "'speaker_1': 'So just putting that on record and it is in.'",
        "'speaker_4': 'Alignment with many of the conversations that have happened in the PCC as well. Thank you.'",
        "'speaker_1': 'Thank you. No other members in the queue. Ms.. Woods I would just say that Councilman Hines, I think, hit on a point that I had been struggling with, that we're already operating past the due date of the current contract, which means I think this should have probably come to us much sooner so that we could have a'",
        "'speaker_1': 'dialog in committee about what might be appropriate to do now versus wait until some other conversations with other city partners could be available. Unfortunately, I still don't think this contract is ready for approval. I don't think we lose in asking you to come back with maybe a perforated proposal for contract which separates out the under 300 versus'",
        "'speaker_1': 'what's currently being assessed. But I don't feel I have the confidence that we know the full impact of what the under 300 given how many individuals are tied up in that particular proportion of fines and fees to approve this.'",
        "'speaker_1': 'If it does pass, I would like to get your commitment that you'll still work with the Office of Financial Empowerment before any of those cases are referred to integral recoveries. I know you have you do work with them as it is.'",
        "'speaker_1': 'And if they get past that 90 days delinquent that those get held and not sent over. So I think we're really trying to get in the middle of what could potentially be a really negative impact for residents that we may not necessarily need.'",
        "'speaker_1': 'So I would just ask you for that. If it does not pass, I would then like to see if the courts would offer a separate separated contract for the two sections.'",
        "'speaker_4': 'I appreciate.'",
        "'speaker_1': 'That. Okay. Councilwoman Ortega.'",
        "'speaker_6': 'I just had one quick question for actually two questions. One. One for the. CORDES How how quickly and I know this involves multiple agencies. Could you turn around if this vote is voted down tonight, how quickly could you turn around an extension with an amendment that would address the $300 threshold?'",
        "'speaker_6': 'And then if this goes down and we're looking at an extended time frame, I just was going to ask a guy from the mayor's office what would get cut, because we're talking about a sizable impact to either the courts or the general fund if some of that money ends up coming to the general fund as well.'",
        "'speaker_6': 'I don't know. This is something that you guys have thought about, Skye, but I just wanted to ask that question. So first of all, what would be that turnaround time? If this went down tonight and you all could amend, amend and extend the current contract knowing that you're continuing to function under the existing contract, even though it's'",
        "'speaker_6': 'expired?'",
        "'speaker_4': 'Sure, that would be my office. Obviously amending the language and removing that expanded section of that contract. And then it would go to the city attorney's office for review and approval, and then we would file a new resolution with council.'",
        "'speaker_6': 'Any idea on timing? That's what I'm trying to get.'",
        "'speaker_4': 'Clarification. I would say. But.'",
        "'speaker_1': 'And if you can introduce yourself, please.'",
        "'speaker_2': 'Good evening, Steve. John, Denver City Attorney's Office.'",
        "'speaker_7': 'Approximately 6 to 8.'",
        "'speaker_2': 'Weeks. So. So if this.'",
        "'speaker_6': 'Goes.'",
        "'speaker_1': 'Mr. Bailey, you've been asked not to have outbursts. You can leave if you're going to continue. Thank you.'",
        "'speaker_6': 'So if it's 6 to 8 weeks, that means for the interim, this company could not continue to collect anything set. Correct.'",
        "'speaker_7': 'You're out of contract right now.'",
        "'speaker_6': 'Okay. But they have been collecting even though they're out.'",
        "'speaker_4': 'We have not told them to cease. Okay. We would be obligated to do so if this sort of thing.'",
        "'speaker_6': 'Yeah. If this went down. So we'd be looking at, you know, at least two months before this would come back. And so those are collections that I think the city has counted on in some of these agency funds that we would be losing out on.'",
        "'speaker_6': 'I think the the policy discussion is an important one. But we also want to make sure that we have the ability to collect, you know, some of these key fees, restitution fees are always part of a court order.'",
        "'speaker_6': 'Right. It's part of what is being mandated when somebody finally gets their day in court and it's part of their, you know, what they're expected to do to be in compliance. And if this completely negates all of those and there's an expectation that the victim is supposed to be getting something, and now we've just said, nope, that's'",
        "'speaker_6': 'not happening anymore. I think we're sending a mixed message here. And I'm a little concerned that we're trying to do this without really having something else in place that ensures that we can do that. And if we can do, you know, a contract amendment, an extension that allows the time for this work to happen with the Office'",
        "'speaker_6': 'of Financial Empowerment, I think that then gives us a clear picture of moving forward into the future with not just our courts, but many of our other agencies that charge fines and fees. And then I think part of that big picture is what is the financial impact to the rest of the city's general fund?'",
        "'speaker_6': 'You know, we're in great times where we're enjoying the benefit of some federal dollars that we have not had in our coffers. But that's that's not going to last forever. And that's not always been the case in terms of how we are able to conduct business.'",
        "'speaker_6': 'So I think that all needs to be part of a big picture that we look at moving forward as fines and fees are reviewed across the city. Thank you. Thank you.'",
        "'speaker_1': 'Thank you so much. Councilman Hines. I'm sorry. Cashman.'",
        "'speaker_7': 'Thank you. Sorry, colleague. I'm. So trying to clarify that $300. Figure. Was it simply? Pulled out of the air by programmers saying, we have this much time, we can only get to this level. Was was there any philosophical element of that discussion?'",
        "'speaker_7': 'Why that number? Because this is my first thought was that this is a new element we're adding. But what I'm hearing is it's not. It was done for years and years at that 300 and under level. And because of the programing involved in the new system, you just couldn't get the work done in time.'",
        "'speaker_4': 'I guess it was it was really during the budget reduction process in 2020 where the ah budgets were to be reduced by a certain percentage. And as we looked at ways in which we could reduce our budget when 10% of it is only operating, we looked at our existing integral contract which required an upfront about a $600,000'",
        "'speaker_4': 'a year allocation from the general fund in order to pay integral to do the collections, work on the front end for the general fund to recoup it on the back end. And so that was a decision we made in a in a way that we could revert some money back very, very quickly.'",
        "'speaker_4': 'So to do that, we really had to re-engineer our entire collections process, which meant a lot of programing because we would no longer be receiving these dollars and depositing them. It would be integral doing that. And so that required a lot of programing.'",
        "'speaker_4': 'And as you look at the asset recovery fee that is allowed by ordinance, they are flat rate fees for amounts owed up until that $300 amount is a flat rate fee underneath that $300 amount, it is a percentage calculation which required much more time of our programmers to program for all of our current cases.'",
        "'speaker_4': 'Sure. And so we decided to hold off on that so we could meet our budget reductions in 2020.'",
        "'speaker_7': 'Okay. A couple of things. When we get contracts like this that have expired. It really stretches our ability to do our job to give important topics the consideration that they deserve. I think the points that Councilmember Torres brings up are extremely valid.'",
        "'speaker_7': 'That should be looked at. I'm enthusiastic about the study that that's been talked about to see really how all this plays out and what a number would be since it appears 300 was an accidental number. But the thing that I'm kind of mystified by and when you said you would feel obligated to tell them to cease collections'",
        "'speaker_7': ', I can't imagine why when it wouldn't be in the best interests of the city and county of Denver and this body. I'm not wanting to put words in my colleague's mouth, but what I'm hearing is that those who are considering voting no on this would like to see a bill.'",
        "'speaker_7': 'Continuing as integral has been previously doing collecting above $300.'",
        "'speaker_4': 'I understand and I completely appreciate that and have no problem drafting an amendment amendment mandatory language to exclude the expansion of the scope and only request to extend the term if that is how council felt. I do feel if I had a final if if this bill failed, it would be a formal failure.'",
        "'speaker_4': 'And that is where I would feel obligated to contact integral recovery services collections. I'm happy, though, to submit a new bill that excludes that expansion request.'",
        "'speaker_7': 'I would make it clear I want to make it clear that I would think that would be a terrible decision. It would not be what I think anyone on this body would want. I won't see any, say anyone.'",
        "'speaker_7': 'But as far as I'm concerned, I don't think that's a wise move. But you're in your position and I'm in mine. Thank you. I appreciate all your answers.'",
        "'speaker_1': 'Thank you. Councilman Cashman, Councilman Hines.'",
        "'speaker_2': 'Thank you. Council president pro tem. I just for quartz. Just so you know, we have I have personally talked about safety multiple times, bringing expired contracts before us. So this just happens to be a court's contract. But I want to I want you to know that that I'm trying to be consistent and and I've mentioned to safety'",
        "'speaker_2': 'that and that I also feel uncomfortable working with contracts that have already expired. And some of those, to Councilmember Ortega's point, have had financial impacts. But but I think it's important that we that we notice that that this is something that that the body has voted down multiple times in the past, expired contracts that have financial impacts'",
        "'speaker_2': '. So thank you, Council President Pro Tem.'",
        "'speaker_1': 'Thank you, Councilman Hines. Seeing no one else in the queue. Madam Secretary, roll call on resolution 22, dash 278 black.'",
        "'speaker_5': 'I see tobacco?'",
        "'speaker_4': 'No.'",
        "'speaker_2': 'Clark, I.'",
        "'speaker_5': 'Think.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Herndon High? No. Cashman? No. Ortega.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'SAWYER. No. Torres No. Sorry, Madam President. You have five eyes and five knees.'"
    ],
    "Amendatory Agreement with Pinyon Environmental, Inc. for on-call environmental consulting services.": [
        "'speaker_1': 'Five Eyes Resolution 22 dash to 78 has failed. Madam Secretary, please put the next item on our screens. Mr. Bailey, you can leave Page.'",
        "'speaker_2': 'Even more capable. Oh, I hope that's okay.'",
        "'speaker_1': 'Thank you. Sorry about that. Councilmember Black, please put resolutions 322 and 323 on the floor for adoption.'",
        "'speaker_4': 'I move the resolutions 322 and 323 be adopted in a bloc.'",
        "'speaker_1': 'It has been moved and seconded. Questions or comments by members of Council. Council Member Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. Pro Tem. More on coal contracts coming through without any reporting on the back end. For us to see where that money is going or how it's being utilized. So I'll be a no thanks.'",
        "'speaker_1': 'Thank you. No other members in the queue. Madam Secretary, roll call and resolutions 22, dash three, two, two and 22. Dash three, two, three.'",
        "'speaker_5': 'Sawyer. No black. I see tobacco.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Clark II.'",
        "'speaker_5': 'Flint.'",
        "'speaker_2': 'All right.'",
        "'speaker_5': 'Herndon. High Cashman.'",
        "'speaker_2': 'Ortega, i.'",
        "'speaker_5': 'Madam President, I.'",
        "'speaker_1': 'Hi nice eight guys and I think you know nice resolutions 20 2-3, two, two and 22. Dash three, two, three have been adopted. That concludes the items to be called out. All bills for introduction are ordered published. Council members.'",
        "'speaker_1': 'Remember, this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to code an item for a separate vote. Uh, Madam Secretary, would you please close the voting? Councilmember Black, would you please put the resolutions for adoption and the bills on final consideration for floor passage on the floor'",
        "'speaker_4': '. I move that resolutions be adopted in bills on final, final consideration, be placed upon final consideration, and do pass in a block for the following items. 326. 327. 329. 143. 301302303. Three. 16. 317. Three. 18. 189 308. 309 311 312 313.'",
        "'speaker_4': '314 325 389 285 388 three 9293. And that's it.'",
        "'speaker_1': 'It has been moved and seconded. Madam Secretary, Roll Call.'",
        "'speaker_3': 'Black Eye.'",
        "'speaker_5': 'CdeBaca High.'",
        "'speaker_2': 'Clerk. All right.'",
        "'speaker_5': 'Flynn All right.'",
        "'speaker_2': 'Herndon High. High.'",
        "'speaker_5': 'Cashmere. Ortega I swear. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_5': 'Tonight.'",
        "'speaker_1': 'Tonight, the resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 21, Dash 1528, changing the zoning classification for 3435 North Albion Street in Northeast Park Hill and a required public hearing on Council Bill 22, Dash 0147 Changing the zoning classification'"
    ],
    "Rezoning of 3435 North Albion Street in Northeast Park Hill.": [
        "'speaker_2': 'Unknown 111111111.'",
        "'speaker_1': 'When I make a decision on for those participating in person when called upon, please come to the podium on the presentation monitor. On the wall you will see your time counting down for those participating virtually when called upon.'",
        "'speaker_1': 'Please wait until our meeting. Host promotes you to speaker. When you are promoted, your screen will ask permission to allow us to promote you. Please accept the promotion. Once you accept the promotion, your screen flash will say Reconnecting to meeting.'",
        "'speaker_1': 'Please don't leave the meeting. You'll be reconnected and will need to turn on your camera. If you have one in your microphone, you'll see your time counting down at the bottom of the screen. Once you finished speaking, you'll be you will change back to participant mode and see the screen flash one more time.'",
        "'speaker_1': 'All speakers will begin their remarks by telling council their name and cities of residence and if they feel comfortable doing so. Their Home Address. If you've signed up to answer questions, only state your name and note that you're available for questions of council speakers.'",
        "'speaker_1': 'We'll have 3 minutes. There's no yielding of time. If translation is needed, you'll be given an additional 3 minutes for your comments to be interpreted. Speakers must stay on the topic of the hearing. Must direct their comments to council members.'",
        "'speaker_1': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilmember Black, will you please put Council Bill 20 1-1528 on the floor for passage?'",
        "'speaker_4': 'I move that council bill one 5 to 8 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded the required public hearing for Council Bill 20 1-152. It is open. May we have the staff report?'",
        "'speaker_2': 'Great. Thank you, Councilwoman Torres. Good evening. Members of Council Jason Morrison, senior city planner with Community Planning and Development ten. I'll be presenting the proposed resource rezoning at 3435 North Albion Street, where the request is from an old code PD 530 92mx2x.'",
        "'speaker_2': 'The proposed rezoning is located in Council District eight, which is Councilman Herndon's district. It's in the Northeast Park Park Hill neighborhood. The proposed rezoning is intended to facilitate redevelopment of the site and the preservation of existing 133 year old Victorian single unit structure on the property.'",
        "'speaker_2': 'Under a separate landmark designation application, the structure is in the process of being designated as a contributing historic structure. The property owner is requesting the rezoning to provide additional residential units for the neighborhood while also preserving this important piece of Northeast Park Hill, the proposed zone district BMX tracks, which is urban edge neighborhood mixed use up to'",
        "'speaker_2': 'two stories. Minimum maximum height is intended to provide safe, active and history and scale diverse areas in established residential neighborhoods. It allows for a mix of uses in a variety of building forms, including townhouse general and shopfront primary building forms.'",
        "'speaker_2': 'And the X indicates that allowed uses in building forms are more limited and TMX to zoned district. For example, drive thru services and drive to restaurants are not allowed in this proposed zone district. The current zoning of the subject site is 5539, which is a custom zoned district out of the former Chapter 59 zoning code.'",
        "'speaker_2': 'The PUD allows for the expansion of a restaurant use on the subject property. Maximum building heights within the PWD are two stories or 38 feet. Surrounding zoning an area includes a mix of commercial, multi-unit and single unit zoned districts.'",
        "'speaker_2': 'The existing land use on the site is a mixed use, surrounded by mostly multi-unit, commercial, single unit and open space. This slide shows the existing context surrounding the subject site with the proposed rezoning on the top left. The Matthew Moon application was unanimously recommended for approval by planning, board and before by committee.'",
        "'speaker_2': 'All public notice requirements have been met since the staff report was published. We have received one letter of support from Northeast Park, Parkhill, R.A. As you know, there are five review criteria when analyzing the appropriateness of a request.'",
        "'speaker_2': 'The first criterion is consistency with adopted plans. There are three applicable plans to this rezoning that's current plan 2040 Blueprint, Denver and the Parkfield Neighborhood Plan. This rezoning is consistent with several of the strategies and comprehensive plan and they are detailed in the staff report.'",
        "'speaker_2': 'When looking at blueprint, the future neighborhood context is urban edge. Within this context, small multi-unit, residential and commercial areas are embedded in one and two unit residential areas. Therefore, staff finds that the proposed rezoning is appropriate and consistent with the urban edge.'",
        "'speaker_2': 'Neighborhood Context Plan direction. Blueprint further identifies the future place as areas low medium residential, which typically provides a mix of low to mid scale multi-unit options where limited mixed use can be found along collector streets. Buildings are generally up to three stories or less and high.'",
        "'speaker_2': '35th Avenue is a collector street, and the maximum building height of the BMX two zone district is appropriate and consistent with this plan guidance. The subject property is located within the all other areas of the city growth area.'",
        "'speaker_2': 'The proposed rezoning is consistent with the growth strategy that is mapped in this area. Blueprint also has policy language around resuming properties out of the former. Chapter 59 Zoning Code and out of custom zoning such as the sites plan specific condition on the subject property today.'",
        "'speaker_2': 'Therefore, staff find that this proposed rezoning is consistent with Blueprint Denver when looking at the Parkfield Neighborhood Plan. Parkfield Neighborhood Plan was adopted by Denver City Council in 2000 and applies to the subject site. Staff finds that the proposed annex to Access Zone District helps maintain and enhance the small scale neighborhood character as cited in the Park'",
        "'speaker_2': 'Hill Neighborhood Plan. The scale of any future redevelopment provide an important transition between the prevailing neighborhood pattern of single and two units at the East and the higher density activity along Colorado Boulevard to the West. Staff also finds that the requested zoning meets the next two criteria.'",
        "'speaker_2': 'The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare, primarily through its implementation of adopted plans and through improved design standards. Additionally, the proposed Zone District will help facilitate housing density near a mix of uses and transit amenities such as Car Boulevard and the 40th and called Colorado Rail Station'",
        "'speaker_2': '. This rezoning would bring this property from former Chapter 59 zoning into the Denver zoning code, and such a change is listed in the zoning code as an appropriate, justifying circumstance. Lastly, staff finds that the proposed rezoning is consistent with the zone district purpose and intent of the to exist on district.'",
        "'speaker_2': 'And based on the review criteria, staff recommends approval of the application and I'm available for any questions.'",
        "'speaker_1': 'Thank you. Sorry. I'm following a script. It's not as easy as it sounds. We have two individuals signed up to speak this evening. Jesse Paris. Is our first and he is joining us online. Jesse, I see you're in the panel, if you can unmute.'",
        "'speaker_2': 'Be heard.'",
        "'speaker_1': 'Yes, go ahead.'",
        "'speaker_2': 'My name is Jessica Sampras and I'm representing for Blackstone Movement for Self Defense, Positive Action for Social Change, as well as the United Party of Colorado, the council in Front, Black Nose. And I will be the next mayor of Denver in 2023 and I file today.'",
        "'speaker_2': 'I am in favor of this zoning sometimes. I just had a few questions. What is going to be here? It was it was presently a restaurant, a band, a restaurant. What is exactly going to be here? Is it going to be condominiums?'",
        "'speaker_2': 'Is it going to be mixed use? Have mixed mixed use developments, housing as well as commercial? If it's going to be housing, what is the army level going to be for housing? And has there been a parking study done?'",
        "'speaker_2': 'And this is directly adjacent to the across the street from the Parkville Golf Course. And we know all the upheaval that we had last year because the golf course with the easement. So if someone could please answer my questions, I would greatly appreciate it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Michael Flowers.'",
        "'speaker_2': 'Hi. My name is Michael Flowers. I'm here representing Historic Denver, which is located at 1420 North Logan Street in Capitol Hill. I'm the director of Preservation Action at that organization. We are 51123 nonprofit dedicated to ensuring Denver's unique identity, cultural landmarks and historic places are thoughtfully maintained, actively used and relevant for all generations.'",
        "'speaker_2': 'Last year, our organization turned 50, and to celebrate, we asked the Denver community to help us identify the next 50 places that we should develop a preservation action report. The 1889 Robinson House in Park Hill, which sits on this lot, was nominated by the community and one of the 50 chosen.'",
        "'speaker_2': 'This brought our full attention to the home, which was actually threatened with demolition at the time. We worked closely with current owner Steve Davis, who bought the house and saved it from that threat is also in the process of landmarking.'",
        "'speaker_2': 'The House landmark designation, which was initiated in tandem with this rezoning effort, will come before the Council in the next couple of weeks. Not only does he plan to rehabilitate the Storch House, but he's also plans to build additional housing units on the north side of the lot.'",
        "'speaker_2': 'This rezoning TMX to X will help with that effort. Historic Denver fully supports this rezoning proposal. This is a perfect example of how historic preservation and new development can work together when a park to US oldest homes is being saved and new housing units are being planned as part of the same project.'",
        "'speaker_2': 'I consider this project a win win, and I hope you all do to.'",
        "'speaker_1': 'Thank you. That concludes our speakers questions for members of Council and Council. Bill 20 1-1528.'",
        "'speaker_3': 'Councilwoman Sawyer thinks that I'm President Pro-Tem just curious about the transition rate. So if the earmarks to X will allow for certain building farms, I'm glad that they chose the ex so that there's no drive thrus or businesses, but there are potential small businesses that could be built there with this zoning.'",
        "'speaker_3': 'So just curious about kind of how that transition would work between, you know, a historic home that is super exciting, that this is one of the 50 projects that have been identified by historic Denver, but just want to make sure that there's a thoughtful transition there to the neighborhood.'",
        "'speaker_3': 'So a little bit curious kind of what that looks like.'",
        "'speaker_2': 'Sure. Great question. So with this particular zoned district, that transition really comes with kind of that maximum height. So that two story so surrounding zoning in that area is already indexed to X. So this is kind of nestled within that.'",
        "'speaker_2': 'But when you look along Carter Boulevard, you see higher intensity use as you see higher intensity in terms of building height as well. And so this will kind of taper down as you go east to that one into two unit housing.'",
        "'speaker_2': 'So it's kind of just a gradual transition from west to east.'",
        "'speaker_3': 'Okay, great. Thank you. Thanks for the present.'",
        "'speaker_1': 'Thank you, Councilmember Flynn.'",
        "'speaker_2': 'Thank you. Madam President, pro tem Jason, the. The request to district seems really appropriate because the rest of the block is is the same. But when I look at the lot itself and the location of the building, which is proposed for preservation, I'm wondering what building forms can actually fit on the north side if they do the'",
        "'speaker_2': 'lot split. And I saw on the staff report that there was some mention of, you know, the lot splitting isn't a guarantee because there had to be consideration of the proper setbacks, etc.. What what is envisioned to be able to build on that north side of the property if it is split off?'",
        "'speaker_2': 'What? How many units could be built there? Any. Do we have any idea? Sure. Great question. So I'm certainly not an architect, but from the conversation I've heard and we'll back up for a minute. So the the proposals are the allowed building forms are townhouse shopfront in general.'",
        "'speaker_2': 'And I'm sorry to interrupt, but there are townhouses just to the east of it. Correct. But they are larger than would fit on. On a split lot here. Yeah. Correct. So it's my understanding the owner is proposing anywhere from 3 to 5, so there's not a high number at all.'",
        "'speaker_2': 'I do know that they are on the call tonight, if you'd like to ask them. But that's my understanding, based on conversations that I've heard. So. Looking anywhere from 3 to 5 like townhouse now. Okay. Thank you. Kara, can I ask you a question?'",
        "'speaker_2': 'Karen from the Landmark Office. Can you tell us at what stage is the process in the application for landmarking or designating this Robinson House as a landmark?'",
        "'speaker_4': 'It went to Rudy.'",
        "'speaker_5': 'Last week, is going to Meer.'",
        "'speaker_4': 'Council tomorrow and will be for before you guys on April 18th, I believe it was unanimously.'",
        "'speaker_3': 'Recommended by the LPC.'",
        "'speaker_2': 'Mm hmm. Okay.'",
        "'speaker_0': 'Did did the staff look at all.'",
        "'speaker_2': 'At the impact of whatever the proposed boundaries are? And I haven't seen the file on it yet, so I'm I'm not prejudging it at all. But did you consider the impact of where that large split would occur and the intrusion on the integrity of the Robinson House itself?'",
        "'speaker_4': 'We did we had some pretty lengthy conversations with myself and Michael Flowers and.'",
        "'speaker_5': 'Steve Davis as we.'",
        "'speaker_4': 'Talked about, like what could allow for density to be built on the site while also preserving the historic structure. So the boundary for the landmark is intentionally designed to give it.'",
        "'speaker_5': 'About 5 to 8.'",
        "'speaker_6': 'Feet of.'",
        "'speaker_4': 'Distance before you would get to any sort.'",
        "'speaker_2': 'Of like I'm sorry to say that again.'",
        "'speaker_4': 'There's about 5 to 8 feet from the edge of the building. That's part of the landmark boundary.'",
        "'speaker_6': 'So.'",
        "'speaker_4': 'That Steve can build.'",
        "'speaker_1': 'Without.'",
        "'speaker_5': 'Having part of it. Just going through landmark.'",
        "'speaker_4': 'Design review so that there's a little bit of a buffer between the new construction and the old construction.'",
        "'speaker_5': 'Without having to go through landmark design review for five feet of a building or five feet of a garage. We don't we.'",
        "'speaker_4': 'Don't we try not to get into that position.'",
        "'speaker_2': 'So 5 to 8 feet on the north side. Yes. And then obviously, the whatever is built on that north split lot would have its own rear setback that it would have to. So you'd have. Okay. Thank you. I'm just trying to visualize the impact on that building.'",
        "'speaker_2': 'So I know the goal is to preserve that building. Thank you. I thank you, Madam President, for them.'",
        "'speaker_1': 'Thank you. No more council members in the queue. The public hearing is closed. Comments by members of Council on Council Bill 21, dash 1528.'",
        "'speaker_2': 'Councilmember Herndon I'm present as this is in district eight very familiar of walk the site. I went to that restaurant when it was open however long ago it was. I think the criteria has been clear and met and I will be supporting this and I ask my colleagues to do the same.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. No other members in queue. Madam Secretary, roll call unaccountable 20 1-1528.'",
        "'speaker_2': 'Herndon, i.'",
        "'speaker_5': 'Cashman. Ortega.'",
        "'speaker_4': 'Sawyer I.'",
        "'speaker_5': 'Black. I. See tobacco.'",
        "'speaker_2': 'Clark, I. Flynn, I.'",
        "'speaker_5': 'Madam President.'"
    ],
    "Rezoning Property for Accessory Dwelling Unit at 2875 North Albion Street.": [
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced the results tonight. Tonight is Council Bill 21. Just one 5 to 8 has passed. Councilmember Black. Will you please put Council Bill 20 2-0147 on the floor for passage. Final passage.'",
        "'speaker_4': 'I will move that council bill 0147 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded the required public hearing for Council Bill 20 2-0147 is open. May we have the staff report?'",
        "'speaker_2': 'Um. Good evening. My name is Kenny Vanya and I'm with CPD before you. Today we have 2875 Albion Street and the request is from Usb-C to Usb-C one from a single unit. Two Single unit with Adu. So it is located in Council District eight in the North Park Hill neighborhood, and as the request is a single unit'",
        "'speaker_2': 'dwelling, the site is approximately just underneath 6000 square feet. And what is requested is an accessory dwelling unit with a minimum lot size of 5500 square feet. As you can see, the existing zoning is us. You see, it's surrounded by us.'",
        "'speaker_2': 'You see to the north, south and the east and to the west you can see Main Street and mixed use up to three stories as well as Eastside one which is allows for accessory dwelling in every single unit.'",
        "'speaker_2': 'There you can see the subject property in the top left. That's the property on the left primary. Most of the structures are one story in height. Single unit on Albion Street. And this went before the planning board. On February 2nd.'",
        "'speaker_2': 'It was approved unanimously and is before you tonight. So far we have received one letter of support from the Greater Park Hill community, Arnelle, and as well as three letters of support from the public which are attached to the staff report.'",
        "'speaker_2': 'And there are several review review criteria that are analyzed that we look from the Denver zoning code. The first one is Kansas City with adopted plans. And we're looking at specifically three plans, which is comprehensive plan 2040 Blueprint Denver, a language transportation plan of 2019 and the Park Hill Neighborhood Plan of 2000.'",
        "'speaker_2': 'There are several strategies and goals that are consistent with this specific rezoning that are specified in the staff report. And I would jump into Blueprint Denver. So Blueprint Denver classifies this area as urban, which is the neighborhood context as classifies it as predominantly residential.'",
        "'speaker_2': 'And homes are typically low scale single and two unit residential with some small scale multi-unit residential. When you're looking at the future place type classification, it is classified as residential low, which is predominantly single and two unit uses and accessory dwelling units are appropriate.'",
        "'speaker_2': 'Albion Street is a local street which is categorized as residential uses. And when we look at the growth area strategy, it's classified as all other areas of the city where we anticipate 10% of new employment and 20% of new housing here.'",
        "'speaker_2': 'Likewise in blueprint under the line you built form housing policy number four it states diversity of housing choice to the expansion of addus use throughout all residential areas. When we jump into the Park Hill neighborhood plan under the land use zoning section, it does mention on page 32 about maintaining the existing integrity of the residential character park'",
        "'speaker_2': 'here and ensuring the continued growth of development in Park Slope results in a balancing compatible mix of housing types as well as action number and Ozone three, which is create and maintain a mix of housing types that are attractive and affordable.'",
        "'speaker_2': 'And under review criteria two, two, three, two, three and five. It is consistent as found in the staff report and under the fourth criteria which is justifying circumstances, is based off a city adapted plan as blueprint calls for allowing accessory dwelling units in all residential areas.'",
        "'speaker_2': 'Therefore, CPD recommends the approval based on all the findings of the review criteria. Having met staff is available for any questions that you might have. Thank you.'",
        "'speaker_1': 'Thank you. We have one individual signed up to speak this evening, Jessie Paris joining us online. Jessie, go ahead and unmute your mic and go ahead.'",
        "'speaker_2': 'He has being a member of the council. When I was just a short person, I'm a presenter for Blackstar, for self defense, positive action, social change, as well as the new party of Colorado, the Residents Council and Frontline Black News.'",
        "'speaker_2': 'I will be the next day. This is foreign aid, correct? So I'm in favor of this travel and for movement throughout one building as it related to city council. Um. Well, it's going to be intimidating. Uh, well, there are a lot of questions I have.'",
        "'speaker_1': 'Thank you, Jesse. I think we got your question. That concludes our speakers questions for members of Council and Council 20 2-147 No members in Q. The public hearing is closed. Comments by members of Council and Council. Bill 20 2-147.'",
        "'speaker_1': 'Councilmember Herndon Thank.'",
        "'speaker_2': 'You, Madam President of the District eight show tonight. I think the criteria has been clear. I hope my colleagues support that. Thank you very much.'",
        "'speaker_1': 'Thank you, Madam Secretary. Roll call on Council Bill 22 220 2-147.'",
        "'speaker_2': 'Herndon, I. Hi, I'm.'",
        "'speaker_5': 'Cashman. Ortega Sawyer. I'm black. I see the Barca clerk.'",
        "'speaker_2': 'Hi.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, to close the voting and announce the results tonight. Tonight is Council Bill 20 2-147 has passed there being no further business before this body. The meeting is adjourned.'"
    ]
}