{
    "Rezoning for 4710 North Pennsylvania Street in Globeville.": [
        "'speaker_0': 'All right. We are going to go ahead and move along here. The next item up is Council Bill 21, dash 0577. Councilmember Sawyer, will you please put Council Bill 577 on the floor to take out of order, please.'",
        "'speaker_2': 'I move the council bill 20 1-0577 be taken out of order.'",
        "'speaker_1': 'I can.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments by members of Council. Council Member Herndon.'",
        "'speaker_1': 'Thank you, Madam President. We need to move this item out of order so we can postpone the public hearing date.'",
        "'speaker_0': 'All right. Thank you. Madam Secretary, roll call.'",
        "'speaker_3': 'Black. Hi, Clark.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Hi.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Cashman. I can h i Sandoval. I. Sawyer, i. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_3': '11 Eyes.'",
        "'speaker_0': '11 Eyes Council Bill 20 1-0577 may be taken out of order. Council Member Sawyer Will you please vote? Council Bill 577 on the floor for final passage.'",
        "'speaker_2': 'I move the Council Bill 20 10577 be placed upon final consideration and to pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Councilmember Herndon, your motion to postpone, please.'",
        "'speaker_1': 'Yes, Madam President. I move that final consideration of Council Bill 20 120577 with its public hearing be postponed to Monday, August 2nd, 2021. Thank.'",
        "'speaker_0': 'Thank you. We've got the motion and I think we got the second there from Councilmember Sawyer. I think I got that right. Comments from members of Council. Councilmember Herndon.'",
        "'speaker_1': 'Thank you, Madam President. We need to move the public hearing date in order to meet the posting requirements that was not posted appropriately in a timely fashion. So moving into August 2nd will fulfill that requirement.'",
        "'speaker_0': 'Thank you, Madam Secretary. Roll call.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Hi. Hi. Cashman. I can each I Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Sawyer, I. Torres. I. Black eye, Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '11 days.'",
        "'speaker_0': '11. His final consideration of Council Bill 21, Dash 0577 with its public hearing has been postponed to Monday, August 2nd. That concludes the items to be called out this evening or onto the Bloc vote. Any bills for introduction are ordered published.'",
        "'speaker_0': 'Council members remember this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Sawyer, would you please put the proclamations and resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_2': 'Absolutely. I move that proclamations and resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in a bloc for the following items. This is all 21 series 08210817074807550753. 0756.'",
        "'speaker_4': '0625.'",
        "'speaker_3': '0626.'",
        "'speaker_2': '0627. 0749.'",
        "'speaker_3': '0752.'",
        "'speaker_2': '0730. 06900691. 06930703070507060572. 06980728. 0731073506580697 and 0712.'",
        "'speaker_0': 'Dagen thank you. It has been moved and seconded. Madam secretary, roll call.'",
        "'speaker_3': 'Black eye, Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'So when.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Turned in.'",
        "'speaker_1': 'And.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Can each I. Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Sawyer, i. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '11, eight.'",
        "'speaker_0': '11 eyes. The proclamations and resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight, there will be a required public hearing on Council Bill 21, Dash 0405 changing the zoning classification for 3133 North Raleigh Street in West Highland and a required public hearing on Council Bill 21, Dash 0635 relating to'"
    ],
    "Rezoning for Accessory Dwelling Unit at 3133 North Raleigh Street.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Council Member Sawyer Will you please put Council Bill 405 on the floor for final passage.'",
        "'speaker_2': 'And move that Council Bill 21 deaths 0405 be placed upon final consideration and duties.'",
        "'speaker_1': 'Back.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 405 is open. May we please have the staff report? I see. It's in. You've already got it up and going. Please go ahead.'",
        "'speaker_1': 'Perfect. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Good evening, counsel. My name is Ed Senate Finance and I am an associate city planner here and representing family planning and development. Before you today, we have 3133 North Browns Street. It's currently zoning U.S.A. and the request says to three zone to us one, which is it's currently a single unit zone district and it's requesting for a'",
        "'speaker_1': 'single, single unit zoned district with an ADU. So right now the site itself is currently in Council District one, understandable in the West Highland neighborhood. And the site itself is just pretty close to the corner of Wylie and 32nd Avenue.'",
        "'speaker_1': 'It's just over 6000 square feet. And it's a single unit residential. So this so the zoning that is requesting is a single unit zone district, us ua1. But as you can see, U.S.A. one is directly to the north.'",
        "'speaker_1': 'That was reason for Nadir, but it's in an area of U.S., A-1 as well. As you get us, you see a SUV, which are all a single unit zone districts based on lot sizes. And the existing land use for this site is single unit residential.'",
        "'speaker_1': 'But as you can see, there are some two unit residential uses nearby as well. So as you can see, the subject property is on the upper left corner. And it's a one story structure. And then on the. On the picture on the on the top right is the property directly to the north, which is a single unit'",
        "'speaker_1': 'property with an ADU on the top of the garage, as you can see. And then across the street on the bottom left, you see just a two unit property there. So this went before the planning board in April and it was passed unanimously.'",
        "'speaker_1': 'It was our consent and it's before you today. And as a present we've received two comments of opposition and six letters of support have been received for this case. A lot of the concerns were regarding multiple aid use on a single block and being in close proximity to one another.'",
        "'speaker_1': 'The potential for parking concerns and noise issues. And the applicant has reached out to these individuals that had concerns to try to answer any questions you might have. And also the applicant is here to answer those questions as well.'",
        "'speaker_1': 'So whenever we're looking at a rezoning, we have specific review criteria that we analyzed based off the Denver zoning code. And I will dove into it right now. So the first one is concisely what Dr. Ponder really focused on the Conference Comprehensive Plan 2040 and Blueprint, Denver, L.A. and Transportation Plan.'",
        "'speaker_1': 'There are several strategies found in a comprehensive plan for 2040 that are specified in the staff report. And so I will jump into the blueprint Denver Blueprint. Denver classifies this area as urban, which is predominantly residential. And then within the feature place type, it's classified as low residential, which is predominantly single integrated uses and accessory dwelling units'",
        "'speaker_1': 'are appropriate here. As well. Blueprint does have specific policy that mentions accessory dwelling units such as the land use and built form housing policy for which is a diversity of housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_1': 'And this specific rezoning is consistent with the other criteria specified in the staff report. Therefore, CPD recommends approval based on all findings and all review criteria have been met. And I am open and available to any questions that you may have.'",
        "'speaker_1': 'And the applicant is here presenting answering questions as well.'",
        "'speaker_0': 'All right. Thank you for the presentation, Edson. This evening, council has not received any written testimony on Council Bill 21, Dash 0405 and we do not have any speakers signed up to speak this evening. And so questions from members of Council on Council Bill 405.'",
        "'speaker_0': 'All right. Scene one, the public hearing is closed. Comments by members of Council on Council Bill 405 Council member Sandoval.'",
        "'speaker_4': 'Madam President. And this reasoning fits all of the criteria, and I hope you all would support it. I've met my office has met with the West Highland Neighborhood Association that represents these areas where there are no and they are looking and going to start doing outreach about rezoning that entire neighborhood.'",
        "'speaker_4': 'Stay tuned so that we don't have to continue to do these one offs. So when we do some community outreach and go out to see if there's support, maybe the whole entire rezoning application will be coming forward. Thanking them.'",
        "'speaker_4': 'President.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. And I'm happy to support this this evening, saying that it needs all of the rezoning criteria and seeing other hands raised. Madam Secretary, roll call on Council Bill 405, please.'",
        "'speaker_3': 'Sandoval. Hi. Sawyer, I. Torres, I. What I. Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'Twin. Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Hines.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Cashman. I can. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'"
    ],
    "Denver Zoning Code Amendment for Downtown Golden Triangle Zone District.": [
        "'speaker_3': '11 nights.'",
        "'speaker_0': '11 days Council Bill 20 1-0405 has passed. All right. We're moving on to our second hearing. Councilmember Sawyer, will you please put Council Bill 635 on the floor for final passage?'",
        "'speaker_3': 'I move that.'",
        "'speaker_2': 'Council vote 21 just 0635 be placed upon final consideration and do.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Hines, your motion to amend.'",
        "'speaker_5': 'I apologize, Madam President. I don't have my script in front of me.'",
        "'speaker_0': 'All right. Well, go ahead and do it. Okay.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'I move that council bill 20 10635 be amended in the following particulars. One on page one, line 17 strike 20210054 and replaced with 202100602 on page one. Line 18 Strike June 16, 2021 and replaced with July 14, 2021.'",
        "'speaker_2': 'Three. On page one, line 27. Strike 20210054 and replace with 2021000.'",
        "'speaker_0': 'All right. Thank you. It's been moved and we've got the second there. All right, perfect. Council member Sawyer, do you want to go ahead and explain this amendment before we go on to the public hearing?'",
        "'speaker_2': 'Absolutely. The purpose of the amendment is to change the building form standards for general and point tower building forms. In Denver, zoning code sections 8.6.3.3 A and 8.6.3.3 B. Specifically, this amendment changes the primary street build to range from two feet, minimum ten feet, maximum to zero feet minimum.'",
        "'speaker_2': 'Ten feet maximum. This is a correction that fixes an inconsistency with the required primary street setback.'",
        "'speaker_4': 'For these.'",
        "'speaker_2': 'Buildings.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'Thank you. The required public hearing for council Bill 635 is open. Now we go ahead and get the staff report. And I see we have Christopher here.'",
        "'speaker_5': 'Yes. Thank you, Madam President, and I am happy to answer any questions on that floor amendment as well once we get through the staff report. So give me just a moment to share the screen. Okay. Are you able to see that?'",
        "'speaker_0': 'I am not.'",
        "'speaker_5': 'Now. Let's try that again.'",
        "'speaker_1': 'How about that?'",
        "'speaker_0': 'All right. Go ahead. Thank you.'",
        "'speaker_5': 'Great. Thank you and good evening. Council members, as as noted, we are here to discuss a text amendment to the Denver zoning code. This is Council Bill 21, dash 0635. And then also, as you heard earlier, there is an amendment to the Denver Revised Municipal Code that we will also consider after the consideration of the text amendment'",
        "'speaker_5': ', that is, Council Bill 21, dash 20636. And just so you are also aware, there is an additional associated amendment for for the Golden Triangle area that's associated with this larger set of regulatory updates. And that is something called the Downtown Design Standards and guidelines that will be adopted as the community planning and development rules and regulations.'",
        "'speaker_5': 'And that hearing has just recently been scheduled for August 10th. We'll touch base on that in a little bit. So Councilmember Councilmember Hines and District ten has sponsored this text amendment and the Associated Amendment to the Denver Revised Municipal Code to do two primary things implement the regulatory goals of the Golden Triangle Neighborhood Plan Blueprint of Denver'",
        "'speaker_5': 'and our other adopted plans, and then to apply more current and inconsistent zoning approaches and procedures for this particular area. The downtown Golden Triangle District you can see here outlined in red overlaps, primarily the Civic Center statistical area, but does extend to the east slightly into the Capitol Hill area and the zone district itself.'",
        "'speaker_5': 'You can see it there shown in the yellow in the map on the left. Was last updated in 1994. So when the Denver zoning code was implemented back in 2010, it really just simply changed the name from the old classification to the new DJT.'",
        "'speaker_4': 'Naming.'",
        "'speaker_5': 'Convention. It is a floor area. Ratio based system does not have any building forms that we are sort of comfortable with within the Denver zoning code. And there's relatively few design or street level types of standards that are related to this area.'",
        "'speaker_5': 'The allowed height limit currently is approximately 175 to 200 feet, depending upon the location where you are within this particular area. And also they should note that there are some applicable view plane restrictions that cover portions of this Golden Triangle zoning district as well.'",
        "'speaker_5': 'And as I mentioned, there are also design guidelines and design review that apply to this particular area. Those were last updated in 2002. So both the zoning and the design guidelines are either just shy or a little bit more than 20 years old and are in need of an update.'",
        "'speaker_5': 'The overall update, then I'll give you a preview of the Golden Triangle Neighborhood Plan really formed. The basis of all of our decisions over this two year process are now more than two year process that we have been engaged in and identified several key objectives that can be effectively addressed through zoning updates.'",
        "'speaker_5': 'And those objectives generally fell into three categories of land use, building form and then the street level experience. So the zoning update includes a number of changes that will implement and reflect upon those recommendations from the neighborhood plan, in particular for the land use.'",
        "'speaker_5': 'It will encourage a more broad mix of uses across the neighborhood. It will eliminate some outdated parking requirements for this urban downtown location and support more affordable housing in this area as well. There are a number of new standards that are also being introduced to lead to a variety of different building outcomes and shapes and sizes more'",
        "'speaker_5': 'effectively, shape those larger projects as well, and ensure that they contribute back to the human scale of the neighborhood and also some things that encourage the protection of smaller historic buildings that contribute to the collective character of this particular area of downtown.'",
        "'speaker_5': 'And then finally on the street level experience category, the zoning changes focus on introducing active uses at that street level and really address the experience that most of us will have in this particular area, because most of us will likely not own property or live in this particular area, but would frequent it to visit some of the'",
        "'speaker_5': 'cultural activities or other aspects that happen here. And so a number of things are relating to creating more space for outdoor dining and retail types of uses on the outside of commercial space, creating public gathering spaces, ensuring that there are, if there is room and space for stoops and entry and landscape into residential units when those are'",
        "'speaker_5': 'on the ground floor and really introducing a number of things at that street level, including recommendations to encourage more public art in this particular area. The zoning update also refines the current incentive system that exists in this particular area.'",
        "'speaker_5': 'It really focuses the density bonuses in the future on affordable housing and historic preservation. Now, the neighborhood plan does identify other priorities, things like open space and public art. And we have chosen to address those through zoning standards themselves and other types of alternatives, as opposed to creating density incentives around those.'",
        "'speaker_5': 'So, for example, public art and open space are allowed as alternatives to requirements for a nonresidential active use of the ground floor. This portion of the of the zoning update. And this touches on the amendment to the Denver Revised Municipal Code as well.'",
        "'speaker_5': 'We chose to use sort of an off the shelf to order that already exists and that uses a multiplier of the existing linkage fee system and the unit coefficients that are currently in place to calculate the number of affordable housing units or linkage fees that would be necessary to access that additional incentive floor area.'",
        "'speaker_5': 'It's important to note that in part why we chose to use off the shelf system is that the citywide expanding housing affordability project that is currently underway will lead to a much more comprehensive and robust system that will apply citywide and will ultimately replace this.'",
        "'speaker_5': 'So we wanted to make sure that we weren't spending too much time in creating a truly unique system for the Golden Triangle, knowing that it will ultimately be changed and replaced by by that citywide expanding housing affordability system, whatever that looks like in the future.'",
        "'speaker_5': 'So under the under the proposed zoning projects that are within that base floor area, we're using floor area instead of height in terms of creating that base and incentives. And if you are below that base floor area, there would be no extra requirements.'",
        "'speaker_5': 'You would have the option to pay linkage fees or provide affordable housing units under the building alternatives, but then projects that do take advantage of the incentives that would be required to meet that higher requirement for for the incentive area.'",
        "'speaker_5': 'At four times the current typical coefficients for fees and units, residential projects would be required to provide the units. Nonresidential projects still have the option to pay fees or to provide units. And then importantly, this, the system here in the Golden Triangle is is distinct from the other two incentives systems that are in place for 38 in'",
        "'speaker_5': 'Blake and the D.C. districts in that it does require units that are provided affordable units that are provided in a rental project at 60% ami a for sale residential unit could still be at 80% AMI for to meet those affordable affordability thresholds.'",
        "'speaker_5': 'And just a reminder, you know, we're talking about that 60 to 80% range. And so these are income levels that may include people like nurses, teachers and emergency service workers, somewhere with incomes in the range of about 45000 to $85000 per year per household, depending upon the size of the household.'",
        "'speaker_5': 'And creating housing opportunities is the priority for this area, but also the neighborhood plan. And certainly our feedback that we heard from the community. It was very important to also support landmark historic structures and the preservation of some of these structures within within the Golden Triangle.'",
        "'speaker_5': 'So the zoning update increases the current bonuses or the current incentives that exist today increases those pretty significantly for the rehabilitation of the structure, and then also increases the ability to sell or transfer those unused rights to other locations within the Golden Triangle.'",
        "'speaker_5': 'That's that's an existing opportunity that we've allowed for additional area to be sold or transferred to those other sites. However, we have limited the application of those historic preservation incentives to only that topmost portion of the maximum as they are from 12 to 15.'",
        "'speaker_5': 'So if we were to use one of those preservation incentives, you would have to meet the affordable housing first for that portion between eight and 12, and then you could potentially then use those historic credits for that type of area from 12 to 15.'",
        "'speaker_5': 'I should note, too, that this is really also intended to increase and support the additional designation of structures in this particular area. A sort of preliminary overview by our landmark team that we did as part of this project identified there, there's at least ten structures within the Golden Triangle that are very likely to meet the criteria for'",
        "'speaker_5': 'landmark designation, and there could be upwards of as many as 40 structures within the neighborhood. Upon further review and research. So this is just an example of how that incentive system would work under a couple of different scenarios.'",
        "'speaker_5': 'You can see on the right hand side a a typical project that is roughly the same sizes as what we see today would generate a certain minimum number of seven affordable housing units under this particular scenario. Utilizing that for incentive, that would increase to at least 18 affordable housing units.'",
        "'speaker_5': 'Again, those numbers sort of depend upon what types of uses are within the buildings. So those would be minimal numbers. And then that example on the far right shows how you could potentially use those historic preservation credits for that topmost portion of that project.'",
        "'speaker_5': 'Associated with the the ability to build additional floor area as part of an incentive if you're providing additional affordable housing because that increases the scale and bulk of the structure. We also want to increase the allowed height so that we have some greater flexibility to shape those buildings and avoid those really large, bulky outcomes.'",
        "'speaker_5': 'And so right now, as I mentioned, the existing height limit is 175 to 200 feet in the future. Under the general form, it would all remain 200 feet and under the point tower it would be 250 feet. But if you were leveraging those incentives and you were providing additional affordable housing or protecting those landmark structures, then there'",
        "'speaker_5': 'is some additional height that would be allowed up to 250 or 325 under the Point Tower. As I mentioned, that there are a couple of new planes that do apply to this particular area. You can see these Cheesman Park Botanic Gardens View plan that's in the purple there and extends over the eastern portion of the site there'",
        "'speaker_5': 'of the of the zone districts. And then the state capital view plane extends over a portion of the northern part of the neighborhood. So really, it's it's the area that I highlighted and outlined in yellow there where those tallest buildings would be possible.'",
        "'speaker_5': 'The existing height limitations in those plans still apply going forward. And this is just an example of some of the research and studies that we did. There were some concerns raised by some neighbors in the Cheesman Park area about potential impacts to views of the mountains in that in that portion of the neighborhood where the view does'",
        "'speaker_5': 'not extend. So we did some modeling and looked at what a full height, 325 foot point tower at the far southern end of the of the neighborhood would look like. And you can see that the existing trees and buildings in the Capitol Hill neighborhood generally blocked most of that building.'",
        "'speaker_5': 'And if you zoom in, you can see that even at that full height, the majority of that mountain view is protected. And we are confident that that the height limits that are posed are still consistent with the with the intent of the Cheeseman Art Botanic Gardens to plain and would not have a significant effect on those mountain'",
        "'speaker_5': 'views. As I mentioned, the final portion of this regulatory update is to update the design standards and guidelines that apply to this particular area. We're doing this as part of a larger strategy to create a more comprehensive and predictable design review process for for many of our downtown neighborhoods.'",
        "'speaker_5': 'And so we're actually taking three different design guidelines, documents that apply to Arapahoe Square, Central Platte Valley area and the Golden Triangle, and combining those into a single one stop shop of the downtown design standards and guidelines. And those would be those would be used by the Downtown Design Advisory Board, which is a group that's already already'",
        "'speaker_5': 'exists, and reviews projects in those other two locations. It's currently seven members and we would be expanding that board membership to nine members and adding two additional resident positions as part of the zoning update. And although this one single document, the Downtown DSG, is is a little bit longer than those three other individuals documents, it actually represents'",
        "'speaker_5': 'a 40% reduction overall in terms of the number of intent statements and standards and guidelines that have to be administered and used by use by our customers and the public hearing for that, for the downtown design standards and guidelines that will be adopted as safety rules and regulations, is on August 10th at 4 p.m..'",
        "'speaker_5': 'So the review criteria that we use to review text amendments in the Denver zoning code. Quickly, I'll just touch base on the on the public outreach. You know, this project has been ongoing since March of 2019. So over over two years now, we had a number of advisory committee meetings that started back in May of 2019, a'",
        "'speaker_5': 'series of open houses and surveys and project milestone reports, and made several additional presentations to to ludy to planning boards and other neighborhood groups as well throughout this process. Specific to the text amendment itself. We released a zoning strategy report back in February.'",
        "'speaker_5': 'The actual draft of the of the zoning changes came out in April for a full 30 day review. And we also sent communication to all active and ongoing projects in this particular area at the end of April, all related to the grace period and the effective date of the new zoning.'",
        "'speaker_5': 'The Planning Board public hearing was on May 19th nine. It was an 8 to 1 vote to recommend approval to you. And then luti committee was on June 8th and here we are on July 19th for the hearing.'",
        "'speaker_5': 'As far as public comment, relatively little. We've received one formal comment from the Morgans historic district, R.A., that cited some concerns about his views from Cheesman Park. We've received six comments that voiced overall support. I cited a productive stakeholder process excitement about the enhanced design outcomes.'",
        "'speaker_5': 'And some of those did include some additional suggested revisions to the zoning draft, such as actually increasing the additional floor area and the building height or creating more incentive options. There were three comments received in opposition, again citing concerns about building height, people experiencing homelessness, increased property taxes and an overall lack of a grand vision to also'",
        "'speaker_5': 'address streets and public spaces through this zoning update. And then finally, some seven comments were received that really neither expressed direct support or opposition, but made a number of recommended revisions to the draft zoning, including increasing the base, FDR, increasing building height, providing more flexibility on some of standards, and then requests for more time and flexibility for'",
        "'speaker_5': 'the review of pipeline projects under the old zoning code. We look at consistency with adopted plans and then uniformity of district regulations and furthering public health, safety and welfare. In terms of our text amendment review criteria, we'll start with consistency with adopted plans.'",
        "'speaker_5': 'There's a lot more detail in the staff report. There's a number of things that apply here. I'm going to try to focus on just a few to keep things brief as best as I can. The proposed zoning updates specifically address several goals within Comprehensive Plan 2040 to ensure all Denver residents have access to goods and services and'",
        "'speaker_5': 'amenities and housing that is affordable to all income levels. Furthermore, the updates address the goals for neighborhoods in Denver to exhibit high quality design that are active in people oriented and encourage mixed use where residents can live, work and play.'",
        "'speaker_5': 'In the future neighborhood context. The blueprint vs the downtown Golden Triangle, as you would suspect, all falls within the downtown context, exemplified by large mixed use buildings that are close to the street, high multimodal connectivity and flexible outdoor spaces.'",
        "'speaker_5': 'The the area is generally broken down between community corridor and the residential high future place types. So the community corridor offering a mix of office, commercial and residential with significant street activation and then residential high. A little bit more leaning towards the residential component, but still a high mix of uses.'",
        "'speaker_5': 'And this is the area with the most intense and great in an area that is the most intense and has the greatest heights in terms of residential components. And then growth strategy follows that pretty closely in terms of community corridor and the residential high in the downtown context representing and the community corridor, about 25% of new housing'",
        "'speaker_5': ', 20% of new employment anticipated in those residential high areas, 15% of new housing and 5% of new employment. When we looked at the overall equity analysis summary, the Golden Triangle area actually has relatively higher than average access to opportunity due to close proximity to transit, mixed use centers in corridor corridors and the nearby parks and civic center'",
        "'speaker_5': '. So it's in our Park and Gardens Park. It's also relatively less vulnerable to displacement than some other areas due to higher than average educational attainment and median income. And then it's within the citywide average in terms of jobs diversity.'",
        "'speaker_5': 'But in terms of the number of jobs, it's quite a bit fewer than other areas of downtown. So the proposed zoning updates are expected to further have a positive effect on these three metrics by encouraging a walkable, mixed use neighborhood, creating additional commercial space for local businesses, and then balancing development opportunities between both residential and commercial uses'",
        "'speaker_5': '. One area where the zoning update is expected to have a more significant impact is in housing diversity. So currently this area ranks quite low in comparison to other areas of the city due to the lack of missing middle housing options, a high percentage of renters versus owners, smaller unit sizes and higher housing costs.'",
        "'speaker_5': 'So the proposed increase in the proposed zoning and the recommendation to increase the overall total density here through those incentives enables the ability to provide more units overall. So that helps to serve me and address the issue from a supply side.'",
        "'speaker_5': 'But also having those affordable housing requirements in place further supports the creation of those more affordable units in particularly in a downtown location that has good access to transit and jobs and other amenities. In terms of blueprint recommendations.'",
        "'speaker_5': 'Again, there's a number of policy and strategy recommendations here that are addressed through the zoning update. A couple of things that are important to note. You know, encouraging higher density, mixed use development near transit and downtown zoning, updates that support the goal of enhancing Denver's vibrant retail and hospitality marketplace and creating active pedestrian environments and promoting exceptional'",
        "'speaker_5': 'design outcomes. The Golden Triangle neighborhood plan, as I mentioned, really served as our foundation for the last couple of years. And those 12 key objectives that I mentioned earlier, those were really drawn from this document. And the recommendations here, again, speak directly to fostering a brain, a broad range of housing opportunities in this particular area, promoting a'",
        "'speaker_5': 'high quality pedestrian experience and encouraging that the the overall height and mass of new development is compatible with adjacent smaller buildings. Also, we reflected upon housing and inclusive Denver, and particularly the recommendations to expand our land use regulations to lead to more affordable and mixed income housing.'",
        "'speaker_5': 'The incentive system here supports that provision of affordable housing, and again, particularly within an important downtown neighborhood that's close to transit and jobs. We also find that the requested zoning meets the next two criteria. So the text amendment will result in uniformity of district regulations both within the Golden Triangle District itself and then across other sections of'",
        "'speaker_5': 'the Denver zoning code and really brings this this area of downtown into the modern code. And then we'll also further the public health, safety and welfare, primarily through its implementation of several adopted plans. So with that, staff recommends approval of the text amendment to the Denver Zoning Code to update the downtown Golden Triangle Zone District, finding that'",
        "'speaker_5': 'the applicable review criteria have been met. That Council Bill 20 10635 and then staff also recommends approval of the amendment to the Denver Revised Municipal Code, Chapter 27, Article six to establish affordable housing incentives in the downtown Golden Triangle Zone District, which is Council Bill 21, Dash 0636.'",
        "'speaker_5': 'I'm happy to take your questions.'",
        "'speaker_0': 'All right. Thank you, Christopher, for the staff report this evening. Council has not received any written testimony on Council Bill 21, Dash 0635, and we have one individual signed up to speak this evening. Speakers may address the bill and or the amendment this evening.'",
        "'speaker_0': 'And our one speaker is Mickie Zeppelin. Go ahead here.'",
        "'speaker_4': 'Right.'",
        "'speaker_0': 'We're working on getting. Mr. Zeppelin promoted here. Into the queue. And we're going to ask you to go ahead and unmute.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'All right. Go ahead, please.'",
        "'speaker_1': 'Well, I was disappointed and I think it was disappointing in the presentation and in the zoning that hardly any reference was made to the fact that we have a very sacred place with all of our civic and cultural buildings, five museums, the city and county building the park.'",
        "'speaker_1': 'And that was hardly referred to the talked about preservation but not utilization. This is the opportunity to really inspire, to really recognize our history, to basically celebrate what is the special place, just as Washington, D.C. did at the Mall.'",
        "'speaker_1': 'They took the connectivity of all of their institutions and made them a special place. We should have a cultural and civic trail going through there. The zoning code must acknowledge the fact that this is not like any other neighborhood.'",
        "'speaker_1': 'It's not just a matter of housing and community services. It's a special place which inspires and should be the educational and basis for its citizens and its children and people from all over the country to make it more than a one stop shop at a museum or the park, but should in fact be a place where you'",
        "'speaker_1': 'stop and you really get a feeling for what this city is about and its history and its culture. And to basically leave this out of this news zoning code that not recognize it and at least say that this is the basis on which we will go forward in terms of developing our city.'",
        "'speaker_1': 'I think that we have really missed an opportunity and I hope that basically somehow this could be amended or changed to acknowledge that I heard all that tired discussion and no, there was no mention at all of the treasure we have in terms of five buildings.'",
        "'speaker_1': 'We now have been connecting the park and all these buildings. We now have the 50 to 80 trail coming in there. This is a special place. We are not treating that as a special place. We're treating it as.'",
        "'speaker_1': 'Am I finished?'",
        "'speaker_0': 'Nope. You can go ahead until it ticks down to zero.'",
        "'speaker_1': 'Well, I ask you to basically acknowledge the treasures we have and not bury them. In terms of affordable housing, which is critical and other other uses, and not at the same time recognize our treasures.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Questions from members of Council on Council Bill 635 and or the Amendment. All right? I I'm not seeing any questions. All right. Wanted to wait for a second. Councilmember Flynn. Go ahead, please.'",
        "'speaker_6': 'Thank you, my brother. This is a very sizable action. Some of them feel like there ought to be some questions, but I'd like to ask Christopher to comment on what Vicki Zeppelin was just saying. How does this rezoning, how does this relate to our cultural institutions?'",
        "'speaker_6': 'What does it do to promote, protect and reflect them so that we can understand that? Is there a need for an amendment to address that?'",
        "'speaker_5': 'Yeah. Good question. Council Member Flynn, thank you for that. So there's a couple of things to, you know, to speak to here is that primarily many of the civic and cultural buildings and structures lie outside the downtown Golden Triangle Zone District itself.'",
        "'speaker_5': 'So many of the civic buildings are within the of the downtown civic and zone districts. And then the art museum, for example, actually lives within the old former Chapter 59 and Vega's districts. And there's a lot of things happening there.'",
        "'speaker_5': 'And so this, you know, this zone zoning update to the downtown Golden Triangle area would not affect those structures at all. And so the the other thing I think that that I think is important to note on is that there are a number of and a number of zoning standards and alternatives that were built into this zoning'",
        "'speaker_5': 'upgrade that don't exist elsewhere. And you get to the uniqueness and that and the, you know, the specialness of this area that Mr. Zapp referred to, one of which is public art. And so right now, in nowhere else within the Denver zoning code does is public art offered as an alternative to meet certain standards in in the'",
        "'speaker_5': 'Golden Triangle and the proposed update. There are two significant street level standards that add to that pedestrian experience that are included. There are requirements for nonresidential active uses of the ground floor on certain streets, and then there are requirements for a set aside of publicly accessible open space on a larger project, larger lots.'",
        "'speaker_5': 'Both of those are open to an alternative where a portion of that requirement can be substituted if you are providing public art. So we believe that we think there's going to be opportunities, a number of opportunities where a development project may choose to incorporate public art that has to be outside, has to be accessible, accessible to the'",
        "'speaker_5': 'public. It can't be hidden within a lobby, for example. And so those opportunities, I think, are going to continue to add to the special quality of this place. The final thing that I will just mention is, is a lot of, you know, Mr. Zeppelin's comments and we've we've spoken about this prior to the hearing.'",
        "'speaker_5': 'Many of the things that make a place, the place are the spaces in between. It's the place. It's the public realm, right? It is the streets, it's the sidewalks, it's the trees. Those are all things that unfortunately we have very little oversight over in the zoning code.'",
        "'speaker_5': 'You know, the Denver zoning code and Community Planning and development oversee private development of structures. Our friends in the Department of Transportation and Infrastructure are the are the group that are charged with managing our public right of way.'",
        "'speaker_5': 'And so our our ability to affect change in those areas is is can only go so far. I will say the design standards and guidelines include a number of more qualitative aspects that speak to the character and the quality and the uniqueness of this place that will hopefully address some of his his concerns.'",
        "'speaker_5': 'And I know that Councilmember Hines, for example, has been having additional conversations with Dottie Partners and others about a 50 to 80 trail and how that can be incorporated into the Golden Triangle that will really create that space and create that linkage to those civic and cultural amenities.'",
        "'speaker_6': 'And can you talk just a little bit more about how the edges of the the this update where it abuts the cultural institutions like the museum, although the library, the city and county building and even the state capitol grounds on the other on the northeast corner.'",
        "'speaker_6': 'How do the edges what are the rules and regs are around the edges of it? How do they relate to our cultural institutions? How do they protect do they protect them in in that way? Are they different or are they the same?'",
        "'speaker_5': 'The the overall the zoning rules would be the same along those edges. Certainly, if you fall within one of those, do you play in areas then highly limited and restricted there, but within again within the design standards and guidelines and the design review process which we'll go to, then go to that downtown design advisory board and also'",
        "'speaker_5': 'through staff's projects are also working with you through staff, through those questions. There's a lot of information about how to reflect upon and respond to the context. And so, you know, oftentimes the set of architects is that they look at the site in isolation, and it's really critical and important to look at how a project fits within'",
        "'speaker_5': 'the broader context of those adjacent structures. And so certainly if there was any development proposed directly adjacent to some of those areas, I'd say across the street from the art museum.'",
        "'speaker_6': 'Yes.'",
        "'speaker_5': 'Staff and the design advisory board will be taking a very close eye and looking with a lot of scrutiny about what that relationship is and how those structures respond to those particular areas to enhance those those public spaces and those in those buildings.'",
        "'speaker_6': 'Is that does that process have teeth or enforcement or is it just sort of a softer advisory? Or can we really I don't want to say prevent, but that's the kind of concept I'm wondering, can we prevent prevent something bad from going up across the street from the Libeskind building or or the city and county building that'",
        "'speaker_6': 'would. Really disrespect. Are these institutions? Yes. I don't know what that might look like. Looking ahead, it's hard to say. But what is what is our authority with the with the design review?'",
        "'speaker_5': 'Yeah, good. Good question. So staff and the zoning administrator have, you know, have the final determination. So the design advisory board is is advisory, but it is comprised of a number of design professionals and then also local residents.'",
        "'speaker_5': 'And that's why we've added those to additional resident positions, because it is important to get the local context from these areas. And so there are design professionals that are part of that advisory board that will review projects and provide guidance and feedback.'",
        "'speaker_5': 'That is all part of our formal site development plan process. So, you know, a project can't get approved for a zoning permit unless it goes through that process. And then in addition, I will say the Golden Triangle has a long history of having an urban design committee that is made up of just community members and currently exists'",
        "'speaker_5': '. It's falls underneath the Golden Triangle Creative District, which is their local R.A. We have built into the design process because this exists today. There is a requirement to make a presentation to that group, to that community group that is separate from the Downtown Design Advisory Board process.'",
        "'speaker_5': 'So we've we've maintained that and will continue to bring that forward. So there's a number of checkpoints through the community, through staff, through the advisory board, and then ultimately through our project coordination team and the development services team who reviews our site development plans and makes those approvals.'",
        "'speaker_5': 'So it certainly does have teeth. And so there will be a lot of scrutiny and rigor and put towards projects, especially those that are adjacent to those areas, but certainly to every project that's within that particular area.'",
        "'speaker_6': 'Okay. Thank you. Explain for me, if you can, a little bit more on the the point tower, the height. I understand completely that the Cheesman Park, the view plane ends at, I think, Broadway. Correct. Correct. Everything west of Broadway is not under The View plane.'",
        "'speaker_6': 'So, you know, whatever the height limit is, it is. I'm trying to understand the diagram that was put together. What is the difference between a primary mountain view and a mountain view?'",
        "'speaker_5': 'Oh, sure. Yeah. If it helps, I can share my screen again.'",
        "'speaker_6': 'And I'm looking I'm looking at that slide from the presentation right now. I found it a little bit confusing. It looks like we're not considering the green sort of the very first elevations of the front range to these may be secondary, but the primary view is actually the snow caps, is that.'",
        "'speaker_5': 'Well, exactly. Yeah. And so really the the the labeling of that is as the primary Mountain View was, because the View plan itself, Cheeseman Park, Botanic Gardens viewpoint itself is actually quite broad. This is really that initial view of some, which is Slide 18 really shows the full sort of expanse of that of that view plant area'",
        "'speaker_5': '. But as you can see, most of those mountain views are obscured already through trees and buildings and other other elements that are in the foreground. So it was really just simply a naming convention to say the primary view are those open areas that you can see from the from the Cheesman Park Pavilion.'",
        "'speaker_5': 'And actually the view the viewpoint origination point is all the way over on the other side of the Botanic Gardens, but this is a convenient area that most people know and understand.'",
        "'speaker_6': 'Right. So the primary view is not a that's not a term as defined in the ordinary scope. It's just the primary view. You're defining as basically what we can see to the south of basically 12, 13, 12th Avenue.'",
        "'speaker_6': 'Mount Evans Yep.'",
        "'speaker_5': 'Yes, that's exactly right. And the conceptual point tower that we modeled, we actually created a model that shows many, many more, but all of all of them are obscured by the existing trees and buildings.'",
        "'speaker_0': 'That.'",
        "'speaker_5': 'Point tower that's shown there as a as an example. Yes. Is at the very, very southern end of the neighborhood. It's essentially a Rickenbach car dealership. It's, well, essentially ninth and Broadway.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'And so that's you know, that's the very southern extent of the neighborhood. So any project that's to the north of that that would reach that height is very likely to be obscured. And outside of the view of those mountains anyways.'",
        "'speaker_6': 'It's obscured by that building there that's on the north end of Cheeseman.'",
        "'speaker_5': 'Yes, it is obscured by that lovely building right there in the west. And how did.'",
        "'speaker_1': 'That how did.'",
        "'speaker_6': 'That get in there, by the way?'",
        "'speaker_5': 'That's all right. You know, I don't know the full history, but I actually think that the development of that building was in part the reason for the creation of this new plan.'",
        "'speaker_6': 'Okay. I had heard a story that that building went up after the View plane, but somehow it got in on it.'",
        "'speaker_5': 'I don't know. I don't know the full history.'",
        "'speaker_6': 'But not pertinent right now, but something I definitely want to look up. So basically what you're telling me is I'm looking at Slide 18 and what you're telling me is that that conceptual point tower is actually as far south as we would see a conceptual a 325 foot tower.'",
        "'speaker_6': 'And so that the rest of the view to the south of that that I'm looking at that is so gorgeous. Is still is still protected.'",
        "'speaker_5': 'That's correct. Yes, that's correct.'",
        "'speaker_6': 'Thank you. I only have one more question and I just ask for forbearance. I'm looking for in the staff report on the map, there is a parcel that is ab8g in the 1000 block of Cherokee. That is that is accepted from this Golden Triangle zone.'",
        "'speaker_6': 'I'm just curious, what is there and why why is it why is it an out parcel from this?'",
        "'speaker_5': 'Yeah. So that's you know, it's interesting that is similar to the art museum where it is. Right. It was not transferred over in 2010 to Oak District. So it's also.'",
        "'speaker_6': 'Not.'",
        "'speaker_5': 'Personal. It is it essentially was a miniature. It's a combination of residential townhomes and commercial use. There's art gallery in that particular location.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'All right. Thank you, Madam President. That's all I have.'",
        "'speaker_0': 'All right. Thank you. Councilmember Flynn and I had seen Councilmember Cashman. You were you had your hand raised. You want to go ahead?'",
        "'speaker_7': 'Councilmember Flynn got at the heart of my concern.'",
        "'speaker_0': 'All right. Very good. All right. Seeing their hands raised for questions. The public hearing is closed. Comments by members of Council on the amendment. Councilmember Hines.'",
        "'speaker_5': 'Thank you. Council president, the amendment. So we're just addressing the amendment at this point. So the amendment is very is a very technical amendment. It is just an oversight that we caught late in the actually, we as in CPD, I can't take credit for it, but I'm going to pretend like I'm taking credit.'",
        "'speaker_5': 'CPD got this this very technical change late in the process, so I apologize for bringing a floor amendment to to the body as as the council member. Sawyer wisely said, this is is just extremely technical in nature, and it is just a very small oversight.'",
        "'speaker_5': 'So there's no material alteration to the intent of the legislation. Thank you. Council President.'",
        "'speaker_0': 'Very good. Thank you. Councilmember Hines. And I'm definitely happy to support this technical amendment as well as the roll role on the amendment.'",
        "'speaker_3': 'Hines.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Cashman. I can. I. Sandoval. I. Sawyer, I. Torres. I. Black. I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results. 11 811 Eyes Council Bill 20 1-0635 has been amended. Councilmember Sawyer, would you please put Council Bill 635 on the floor for final passage as amended?'",
        "'speaker_2': 'I move that council bill 20 10635 be placed upon final consideration and do.'",
        "'speaker_3': 'Pass as amended.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of Council on Council Bill 20 10635 Council Member Hines.'",
        "'speaker_5': 'Thank you, Council President. I am excited to bring this text amendment and Associated Ordinance Text Amendment as amended and associated ordinance change to this body. I think this is a great day for the residents of Golden Triangle. I think that this will benefit the eclectic nature of buildings in Golden Triangle and encourage for its historic designation and'",
        "'speaker_5': 'preservation of the older buildings, while creating more and new accessible housing and more publicly available open space, which is already been part of the charm of this amazing neighborhood. But. But what this does is make it even more accessible and available.'",
        "'speaker_5': 'It also encourages more public art, similar to some of the art already in the neighborhood. If you've been by the art museum, you've seen several works of public art that that people get there. Tourists and residents get their photographs taken next to all the time.'",
        "'speaker_5': 'And and also Friday morning will be the final selection process for for the Denver Art Museum, Denver Public Library, $600,000 towards their 1% for art project. And that will be located in Golden Triangle as well, likely very close to both of both of those locations.'",
        "'speaker_5': 'So that'll be even more public art funded by by our developments. But but but this will encourage even more public art in in future developments. It encourages, again, publicly accessible, accessible, open space. But I think one of the biggest benefits of this text amendment is to increase the pedestrian experience for for residents and and visitors to Golden'",
        "'speaker_5': 'Triangle. I think that, you know, this is an area right next to the urban core. It is it is important for us to to think about how we can create housing density, but also create economic strength and and vibrancy with all of the all the creative and and other businesses in in the neighborhood.'",
        "'speaker_5': 'But but also encouraging the neighbors and visitors just to have a great pedestrian experience by the access to pedestrian infrastructure will create a neighborhood that will help its residents break their dependance on cars. Having more people use alternatives to cars to get around shop, work and play will help the planet.'",
        "'speaker_5': 'It will increase physical health as we act as pedestrians, not drivers, and use human powers to get around our city. It'll increase community as residents get out of their cars and interact with one another. As we hold hands and and circle of black with our partner or our walker dog or multiple dogs or one cat, there's a'",
        "'speaker_5': 'neighbor who watches cat around. But regarding Mr. Zeppelin and his comments, I agree with him wholeheartedly that this neighborhood is unique and distinct there. That said, as as Mr. Johnson said, zoning code doesn't provide a great base to celebrate the treasure that is Golden Triangle outside of some of the comments that Mr. Johnson already said.'",
        "'speaker_5': 'So I agreed with Mr. Zeppelin that this is a treasure of a neighborhood. And in previous public comment periods, I have I have mentioned that I will continue to work to achieve the vision that Mr. Zeppelin and frankly, the neighbors of Golden Triangle have asked for in ways that are leveraging the zoning code, but also leveraging my'",
        "'speaker_5': 'authority beyond just CBD authority, to make sure that we value and treasure the neighborhood that is Golden Triangle. Mr. Zeppelin mentioned a cultural trail and the 50 to 80 trail that I continue to push for that realization as well.'",
        "'speaker_5': 'And I continue to push for the realization of the creative district's vision, which includes the specifically, the Creative District wants to highlight a pedestrian experience on Acoma between 10th the 12th. So I will work with residents of Golden Triangle, the Golden Triangle, Creative District, R.A. and all of you on this Hollywood Squares box to advocate for for'",
        "'speaker_5': 'the 5280 for the for Mr. Zeppelin and everyone who lives in in Golden Triangle. I, I hope my colleagues will support this text amendment because one of thing, it also redefines affordability. We actually have an associated ordinance change because that would literally change the law of what affordable housing means it.'",
        "'speaker_5': 'City. So city wide affordability defined in ordinance is 80% AMI. But this ordinance change will define affordability as 60%. Am I in golden triangle for context professions in the 60 to 80%? Am I include teachers, nurses, firefighters and I believe they deserve to live in the neighborhoods in which they work, just like other people deserve to live'",
        "'speaker_5': 'in those neighborhoods too. This, combined with increased incentives for developments, developers to implement projects with affordable housing components, will create affordability in a neighborhood which hasn't built meaningful, affordable housing so far in this millennium. I'd go back to the 20th century to find some affordable housing projects in this in this neighborhood.'",
        "'speaker_5': 'So finally, I do want to touch base on our touch on one law that hasn't yet taken effect in Colorado, but has received a lot of a lot of conversation. And that is the the law that is commonly referred to as the repeal of the Telluride decision.'",
        "'speaker_5': 'This new law will provide cities in Colorado with the opportunity to require affordable housing and all new developments. That law doesn't take effect yet. It doesn't take effect until September. I believe it's 90 days after signing day. And meanwhile, we spent more than two years creating legislation that provides so much for the residents in Golden Triangle.'",
        "'speaker_5': 'I want to point out that 90% of this text amendment applies to so many other benefits for Golden Triangle other than affordable housing. That said, I completely get that affordable housing and housing just in general is a huge need for our city.'",
        "'speaker_5': 'This bill leads and some housing elements like redefining affordability as 60%. And still we should observe and respect the two plus years article to process. And in that, in that time, more than a dozen projects, housing projects, not just projects, housing projects have moved forward in Golden Triangle that will likely not have any sort of affordability component'",
        "'speaker_5': '. So we're aware of more than half a dozen other projects that are also in conversations to move forward in Golden Triangle. And I believe we can't wait for a new stakeholder process that incorporates the Telluride repeal. We need affordable housing now.'",
        "'speaker_5': 'I believe that that coverage and by the way, I think that that affordable housing conversation should be citywide. And so if we held back this conversation, I believe that would force too much focus on Golden Triangle, and it really should be a citywide conversation.'",
        "'speaker_5': 'So that's a lot for colleagues to digest. I really I think that this is an amazing work from our stakeholder group, from CPD, from so many residents who have provided a lot of input. Mr. Zeppelin as well. I think that we are.'",
        "'speaker_5': 'Our thoughts are on the same page. And I really look forward to to realizing his vision, which I share, and so do the residents and Arnaud's and Golden Triangle colleagues. I urge and I thank you.'",
        "'speaker_0': 'Q Councilmember Hynes. Up next, we have Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I would just like to acknowledge Christopher and CPD's all your work on creating the visuals to tackle the Ukraine issue that I had brought up. I know that wasn't easy, and I know after it came as a informational briefing before the movie, you really went back and really studied it and talked about it'",
        "'speaker_4': ', and it was explained in a different way. And I you all know I love visuals because I think that that's where I can send constituents call. I can send them to those visuals. They help take away some of the the language that we use in planning that is not always inclusive of everybody because they don't quite understand'",
        "'speaker_4': 'what's going on. I'd also like to say thank you for the incentive for landmarking. I think that this area is really important to preserve, and I hope that that resource and that tool, that's it. That's a newer tool I hadn't seen before in the Denver zoning code.'",
        "'speaker_4': 'So I'm always happy when we're working on adding new tools to our zoning code for other areas of town. That played just as much significance. And I'd also like to think going down, Councilman Hines, you really taking on the issue of the 60%?'",
        "'speaker_4': 'When we met, it was 80 and it was often times I think about teachers. I think about our staff. I think about our council aides. I don't even think our council aides, some of them make 80%. Am I in the city and county of Denver?'",
        "'speaker_4': 'I think they actually are in the 60 percentile of the amite. And so thank you for providing an opportunity for people, city workers and the people who keep Denver functioning like our teachers and librarians and our and our staff here in the urban core where they have an opportunity to live.'",
        "'speaker_4': 'And I do agree that this is a very unique area of town, but I think all areas of town are super unique and deserve their own identity and new tools to add to the zoning codes. So although I do agree with making the plan and I think thank him for all his work, I think Northwest Denver has'",
        "'speaker_4': 'amazing places as well. And I think that this was highlighted in this package by adding the historic preservation piece, by adding development pieces, by talking about the public right of way similar to what we did in the active centers and corridors overlay that we did in Northwest Denver.'",
        "'speaker_4': 'So I really do think that as limited a tool as our zoning code is that you are above and beyond it. So with that, you'll have me full support. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. Next up, we have Councilmember Kenny.'",
        "'speaker_2': 'Thank you. Council President and congratulations on your reelection for another year. I first want to acknowledge that this package meets all of the criteria. In particular, if you you know, we usually don't pick favorite criteria or extra criteria.'",
        "'speaker_2': 'But I do think in this case, the plan conformance, there was so much energy put into the Golden Triangle area plan and the visioning and you know, in particular the ways that this package tackles so many pieces of that plan vision, I think, is just really astounding.'",
        "'speaker_2': 'So I want to give my kudos to the participants in the process and Councilman Hines and all of the community planning staff. I did just want to chime in specifically on the housing proposal. I want to thank Councilman Hines, other colleagues who supported the EMI adjustment, as well as the staff.'",
        "'speaker_2': 'I advocated for this change and I want to just share a little bit more about why. I have long been a supporter of the full continuum of affordability. Right. A lot of our focus is on those experiencing homelessness and the lowest incomes.'",
        "'speaker_2': 'And I have been a defender and really argued that we do also need to do housing at 60 and 80% of AMI because there are families who are costs burdened at those levels too. And I will say that over the past several years, though, I have had to hear from constituents who really were asking me to reexamine'",
        "'speaker_2': 'that 80% of am I number and say to me, who is it really serving? And what has happened is that area, median income includes the entire metro area. And over the last five years, it really did a spike.'",
        "'speaker_2': 'And it's $100,000 is now the median income for a family of four in our region. And everything's adjusted by family size. But, you know, we used to have, you know, the very same occupations that both the staff and Councilman Hines mentioned used to be in that 80% of am I category.'",
        "'speaker_2': 'But what has happened is because the median has gone up so high, because some of our suburban counterparts have really dragged that median up, because there's been some way wage stagnation in some occupations, it has really shifted. And so, you know, my way of saying it is that 60% of am I today is the 80% of am'",
        "'speaker_2': 'I have ten years ago. And that's when a lot of those ordinances were written. Right and when those policies were passed. And I just want to give you an example. You know, I pulled some different occupations, but some of the occupations that show up in the 80% of my category accountants, audiologists, real estate agents.'",
        "'speaker_2': 'I don't want to say that some people need affordable housing more than others, but I do think that those are not occupations we see struggling as much with housing problems and instability. So they're they're at that income level, but their rate of struggle is less than those at 60%.'",
        "'speaker_2': 'And I also just you know, I also had to think about it's really difficult because a lot of times we talk about affordable housing. It feels race neutral and our policies on the surface are race neutral. Right. There's no race associated with 60% or 80% of am I?'",
        "'speaker_2': 'But we do we made a commitment as a council to look at the data and to think about where our policies have implications. And so it was not easy. And I don't have great, perfect data because the federal government, frankly, stopped reporting on it for four years for reasons we don't need to discuss today.'",
        "'speaker_2': 'But so it's difficult to get information on a my level and race and on whether your rent burdens all at the same time, whether you're struggling with your housing. But I did ask route policy for some information and I just want to share a few pieces of why this change from 80% of am I to 60% of'",
        "'speaker_2': 'am I advances racial equity. Okay. So I'm just going to use a few examples. So African-Americans are disproportionately represented among renters at both both levels, both at 60% and am I and 80. But the disparity is a lot greater.'",
        "'speaker_2': 'There are 16% of renters are African-American at 60% of in my compared to only 10% at 60 to 80, 61 to 80%. And just to give you some perspective on that rate, African-Americans are around 9% of our population.'",
        "'speaker_2': 'So they're overrepresented by quite a bit at that 60% of AM I category. Now, that's just among renters. So what we know is there's more need for housing for African-American families at 60% of AMI. So that's just the first fact.'",
        "'speaker_2': 'The second thing I looked at was the data about housing problems. So that housing problem might be that you're in substandard housing. It's for a lot of folks, it's that your rent burdened. You are paying too much of your income on housing.'",
        "'speaker_2': 'There's a few other types of indicators. For instability. But again, big disparities. You know, I'll just use another example for Latino families. They are just under 30% of households in Denver, but they make up 35% of those below 50% of women struggling with housing.'",
        "'speaker_2': 'It's about seven percentage points less at 80% of AM. So it's not that there's no one struggling at 80, but it's a lot less. And it's it's more it's more proportionate to their portion of the population. So what we see is racial disparities are showing up more at that 60% of my level.'",
        "'speaker_2': 'So I want to share this with folks just because this is the first time we're doing this in one of our audiences, we certainly got into some lower aims in negotiated agreements, but it's the first time we're doing a policy change.'",
        "'speaker_2': 'And I just think it's important to explain why. I think it connects to the goals of the city, although it gives everybody a chance for that housing who's at that income level. And the last thing I just want to add really quickly is the fact that that that these changes.'",
        "'speaker_2': 'Right. I know that, you know, we describe them as interim. They're going to be followed up by our City Way conversation. But there is a tradeoff we're making today, and I think it's just an important one to remind ourselves.'",
        "'speaker_2': 'And I was willing to make it right, which is the question of are you willing to accept a fewer number of units, right, then to get to the lower and level. So the multiplier in this case is four and it might have been a higher multiplier, a higher number of units if we just stayed at 80% of'",
        "'speaker_2': 'AM I. I believed it was the right thing to do to get to the households that had greater rates of rent burden, that had greater rates of struggle, that had more racial equity potential implications. But these are the kinds of tradeoffs that we're going to look at more when we have the citywide conversation as well, that there's'",
        "'speaker_2': 'a number of units versus level of affordability. So I think it was the right call. I appreciate the staff again and Councilman Hines really working through all the numbers and helping us figure out the place we could be.'",
        "'speaker_2': 'But I am proud to support this tonight. And, you know, we'll have to keep having this conversation about the my level in the other policies in the city now that we've we've started it tonight. So thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Koinange. Appreciate the comments by members of council and likewise, happy to support this this evening, especially as we're expanding the amount of affordable housing to that 60%. Am I? Because I think having that close access to the city and county built a building, the Botanic Gardens, the art museum, etc. All of those'",
        "'speaker_0': 'different amenities are important for all of our residents of Denver as well. And so happy to support this this evening. Madam Secretary, roll call on Council Bill three, six, five as and 4365 as amended. 9635. As amended. I'm sorry.'",
        "'speaker_0': '635. As amended.'",
        "'speaker_3': 'Hi.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Cashmere high.'",
        "'speaker_3': 'Can each I Sandoval. Hi. Sawyer, I. Torres. I. Black I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_3': '11 Eyes.'",
        "'speaker_0': '11 Eyes Council Bill 635 has passed as amended. Councilmember Sawyer, would you please put Council Bill 636 on the floor for final passage?'"
    ],
    "Affordable Housing Incentives for the Downtown Golden Triangle Zone District.": [
        "'speaker_2': 'I move that council bill 20 10636 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded questions or comments by members of Council on Council Bill 636. All right, CNN, Madam Secretary, roll call on council Bill 636, please.'",
        "'speaker_3': 'Like I. Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_5': 'Hines, I.'",
        "'speaker_3': 'Cashman. I can eat. I. Sandoval. I. Sawyer, i. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '11 Eyes.'",
        "'speaker_0': '11 Eyes Council Bill 20 1-0636 has passed. Our pre adjournment announcement on Monday, July 26, Council will hold the required public hearing on Council Bill 21, Dash 0532 Amending Section two, Dash two, four two and Section 2-243 of the Denver Revised Municipal Code regarding the Denver Food Commission on Monday, August 16.'"
    ]
}